{
  "id": 1785,
  "title": "Lights Out",
  "starring": [
    "Teresa Palmer",
    "Maria Bello"
  ],
  "runtime": 81,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "Rebecca must unlock the terror behind her little brother's experiences that once tested her sanity, bringing her face to face with a supernatural spirit attached to their mother.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8BnElzAQQpp7ZgdJJiAe1diomr4.jpg",
  "categories": {
    "plot": 7.655737704918033,
    "acting": 7.705882352941177,
    "ending": 7.529411764705882,
    "soundtrack": 7.0,
    "cinematography": 7.714285714285714,
    "familyFriendly": 6.0,
    "funny": 8.142857142857142,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "[10/10]\rPROs:\r1. A horror film could'nt be any better.Amazing.\r2.Nice concept of Ghost and it's weakness (sensitivity from light).\r3.Had a good story that kept unfolding slowly to the very last of the movie.\r4.Gives a message what courage and love can do together to destroy the evil.\rCONs:\rNone."
    },
    {
      "rating": "9",
      "text": "This has been one of the big surprises of the year.  I fully expected not to be impressed by this movie because of the trailers, but if it wasn’t for The Witch, I would say this has been the best horror film of the year (so far).  It is very well written.  It is based on a short film which you can get on YouTube and I would recommend you do that, but the film makers actually took the original concept and did a decent job with it.  I am not going to say it’s a perfect film, there are quite a few plot holes, and inconsistencies and there are a few moments that made me scratch my head, but, my god it is so refreshing to see a horror film where the character’s act intelligently.  Seriously this is one of the few horror films where the characters make some decisions that in other horror films they don’t even consider making, there were even characters I had expected to live in the end of the movie that died and characters I expected to die lived at the end.  If you are a horror fan, it is a seriously good watch, it’s a good mix of psychological horror and some decent jump scares, that being said, it is reliant on said jump scares, so it isn’t perfect. I still maintain The Witch is the best horror film of 2016 and even the decade, but Lights Out definitely deserves your attention."
    },
    {
      "rating": "9",
      "text": "I have to say I was very impressed with lights out. There were likable characters that you wanted to survive, it was intense for just about the entire movie, had an inventive premise, and a terrifying monster."
    },
    {
      "rating": "9",
      "text": "This movie is brilliant. plot, humor and effects all stand out in this movie. The acting could've been better but was slapped away by the realistic humor and terrifying creature.The jump scares aren't cheesy either. If you like horror movies then i recommend this without regrets."
    },
    {
      "rating": "9",
      "text": "this movie really surprised me. its much better then other horror movies releases this year. its kind of psychological horror with a pretty desent story where you really care about characters and dont want them to be dead. there is a new ghost in town."
    },
    {
      "rating": "8",
      "text": "I usually don't like short/rushed/fast moving movies, but this one somehow at 80 minutes managed to make all the right moves and be universally creepy and scary."
    },
    {
      "rating": "8",
      "text": "Very cool idea for a monster. Went into this movie not knowing anything about it, and I was pleasantly surprised when it wasted no time hitting me with the suspenseful horror. Very eerie! I would say that my only complaint was the poor acting and uninteresting characters. However, the story and monster kept my intrigue. Also, there were some funny moments slipped in. Not sure if they were intentional, but a little bit of humor in a horror film is always appreciated."
    },
    {
      "rating": "8",
      "text": "Seems that a number of critics shat on the end of this film - I just don't get that.  It's a little Pollyanna-ish of them - considering that we're talking about a horror movie.  If nothing else, this film should make a BIG star out of Teresa Palmer, who has done some excellent work in a lot of \"B\" movies.  She should be stealing some parts from the likes of Jennifer Lawrence in my mind.  The basic story is solid/innovative, but the 3 lead actors really put it over the top."
    },
    {
      "rating": "8",
      "text": "The refreshing idea and well used visual distortion with the combination of great performances. Lights out is another great summer hit for the horror genre."
    },
    {
      "rating": "8",
      "text": "In truth- 7.5, but I have to use whole numbers and the movie is better than a 7. Let's be honest here- it is a horror movie, and horror movies are meant to be scary. This movie delievers the scares hands down. It is the scariest PG-13 horror movie I have ever seen even. The premise is brilliant and the scares are executed with near perfection (even though it doesn't try anything new).\r But if you strip away the scares, or if you strip away the premise/monster you are left with the same basic bad movie horror plot. The heavy handed artificial story, the bland cliche characters, the same stupid character arc, and not to mention the bond created between two characters.\r If you replaced the main monster/demon with a standard ghost or Ouiji board this movie would be a 4 out of 10, but the premise and scares are so good- that it ends with a 7.5. Give it a go I say!"
    },
    {
      "rating": "10",
      "text": "This is an amazing movie as it exceeds above all expectations giving the audience a fun thrill ride. It is definitely a must see for everyone as the performances are well off the chart! Exceptional acting and great directing making this horror a classic!"
    },
    {
      "rating": "10",
      "text": "This was an actual good horror movie, not like ouija, pet sematary 2019, slenderman or wish opon"
    },
    {
      "rating": "10",
      "text": "I think that it is exciting horror with unusual plot. I put 10 points to this film."
    },
    {
      "rating": "10",
      "text": "Bjugghihyfguigihohouihhiihhihinkihinigufdwrgikkotethiomnfedugydretfuguftdygifyhoobihydtunkhu"
    },
    {
      "rating": "7",
      "text": "Pretty good scares, and a pretty good villain, but overall, I wish this movie had focused more on the plot. Worth watching if you're a horror fan, but don't get too excited."
    },
    {
      "rating": "8",
      "text": "Taking the concept of a short film and expanding it out over feature-length is never easy. Yet, Lights Out director David F. Sandberg does it with ease in this scare-filled, chilling, and atmospheric horror film. Never knowing where the attack will come from next, Sandberg's horror instincts are top-notch, but what is even better is the story. Far too often, horror movies ditch the story in favor of just trying to scare its audience. However, Lights Out develops its characters, it story, and really earns it scares and horror. At the end of the day, it is as divisive as all other horror movies, but it has an undeniably great concept and, for me, it executed this concept perfectly.Starring Diana as our resident evil being, this poor family has been stalked and hunted by Diana for a long, long time. Though impeccably scary, her back story and her connection to this family are incredibly well-developed and compelling. Sandberg, in this case, turns the film almost into an investigative drama as Rebecca (Teresa Palmer), her little brother Martin (Gabriel Bateman), and her boyfriend Bret (Alexander DiPersia), piece together who Diana is and her relation to Rebecca and Martin's mom, Sophie (Maria Bello). In this section, Sandberg manages to create tension through the mystery of the entire proceeding and invites the audience to solve the mystery along with the characters, which is always a fun enterprise to undertake as an audience member.However, the real point here is to scare you. Though cliched in parts, the film's unique concept allows the film to take a unique approach to these cliches and always keeps you guessing throughout the runtime. Along with the characters, we are forced to guess where Diana is and, as her movement is hard to pinpoint, you can never really guess where she is hiding. Sandberg definitely has a lot of fun getting his character's and audience's mind racing with this element and uses it in order to buck cliches.In terms of its characters, all of them are largely well developed. However, all are bolstered by their actor. Particularly, Palmer is terrific as Rebecca and really steals the show. Along the same lines, Bello perfectly portrays the tormented Sophie who cannot escape the clutches of Diana, no matter how hard she tries. Though you can see the ending coming, its power is bolstered by the acting of this duo who allow the film to reach a terrific emotional and horror crescendo.For a horror film, Lights Out is terrific. For a debut, it is all the more impressive. With great creature design, mythology, story, and characters, Lights Out is clearly a labor of love for Sandberg and it really pays off in this chilling, thrilling, and downright scary film that made me regret leaving the lights off when watching."
    },
    {
      "rating": "8",
      "text": "Great scary movie.  I'm old and I've never seen a story line like this.  The characters did some stupid things to create situations, but I give the movie extra points for originality."
    },
    {
      "rating": "8",
      "text": "If you've ever thought of whats in the dark, the reason why you run to your bed after turning the light off then this movie explains it all... great stuff"
    },
    {
      "rating": "8",
      "text": "Good movie. The depression taking form as a monster is not exactly subtle and a bit one-dimensional but I still found the movie entertaining. Some jump-scares were a bit too predictable others were just annoying like cutting to a box that's been slammed on the desk. On other occasions the movie managed to create suspense and keep me hooked for a long time. Towards the end the tension dropped off a little for me but it is still a good movie. Has similarities with the Babadook though I liked this one better. Also, the movie is not very long."
    },
    {
      "rating": "8",
      "text": "Lights Out was great. I started watching movie with least expectations (mainly after seeing mixed reviews) but it was much more than my expectations. I totally enjoyed it.This movie will get your pulse up fast, revealing the \"horror\" very early on. Interestingly enough, it keeps that pulse up throughout the movie despite of this. The concept of something that can only appear and be seen if it's dark is bound to lead to a jump scare whenever it appears. Towards the end you've almost gotten so used to it that the scare effect wears off a bit, and is one of two reason I don't rank this a 10. But thanks to a good story and good actors, the movie still holds its ground to the very end.The characters are really good, well written and performed. The plot has some weight and emotion to it, and with a solid ending that wraps things up in a much more satisfying way.All in all you get everything you want from a jump scare movie with Lights Out, with a good plot and good actors that deliver, and a scare factor we all can relate to."
    },
    {
      "rating": "8",
      "text": "Siblings get attacked by their mother's old friend from the mental asylum who only likes the dark."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "10",
      "text": "○●○●○●○●○●○●○●○●○●○●○●○●○●○●○●○●○●○÷,÷÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,+,+,+,+,+,+,+,=,=,=,=,=,=,=,."
    },
    {
      "rating": "10",
      "text": "°》°》°》°》°》°》°》°》°》°》⊙》°》°》°》°》°》°》°》°》°》°》°@\"@\"@\"@\"@\"@\"@\"@\"@\"@\"@\"@\"@\"@\"@;@;@;@;@;@;@;@;@;@;@;@;@;@;"
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "7",
      "text": "Lights Out delivers plenty of unsettling thrills and scares without sacrificing its interesting story and characters, and even adds in a few terrific performances from its talented cast."
    },
    {
      "rating": "8",
      "text": "Lights Out, is quite possibly one of the most visually and mentally scary films in the last two years. The film is yet another in a string of horror movies that uses diseases as allegories for its premise, and this premise alone is genius. Lights Out is often unnerving and sometimes terrifying, dark in look and tone, without feeling recycled or derivative. The biggest strength of the film is that the story is constructed in a way that the audience is always wondering if something will happen.\rThe most genius element of the film is the look of the creature that haunts this movie “Diana.” Diana is an all-black figure that lurks in the dark, and kills whoever threatens it. That being said throughout this film the audience has to fear that this character could pop out of any dark space at any given time. At 81 minutes, not a single second is calm or peaceful, because the mere sight of sight of this creature is unnerving. However, the writers and crew deserve credit for conceiving the idea of the film having a lot of darkness in it.\rWe often say lighting is a storytelling device, but in today’s films it's become less true the more formulaic films get. In this film lighting is very much a storytelling device, and it is used perfectly. Every scene in this film contains, just the right amount of darkness and light, almost as if there are safe areas, and areas that characters should stay away from, and they’re often changing. The dark look and tone of this film, create a very unnerving atmosphere, because one of the most common fears is a fear of the dark, and more notably a fear of the unknown, which exists in the dark.\rThe film really hit a note with me personally, because I have had nightmares in the past about all dark figures living in the dark, so the film felt that much more personal to me. That being said, the film really doesn’t feel all that derivative of other recent horror films. A few moments, and scenes did feel familiar (Diana as a child), but those were few and far between. Even those moments that are a little familiar, are constructed in a way that they are still very scary.\rThe film does what The Babadook did a couple of years ago, and uses depression as an allegory for the creature in the film, which is turning into a very cool concept. The film is one of the few films within the system that uses lighting to tell the story, and does so in a way that is clever and terrifying at the same time. The film is admittedly dark, and relatively humorless, and not really for children, but that kinda goes without saying. For those horror buffs looking for a good scary movie, this may be your movie."
    },
    {
      "rating": "9",
      "text": "Crazy fun! When I see a horror film, it usually isn't of my own will. I'm brought along for comic relief so that my so-called friends don't jump at every shadow on their way home. During horror films, I'm the one hiding behind my shirt collar and close-fingered hands. But Lights Out was so much fun, I couldn't look away. There are a surprising amount of laughs and fun moments that really engage the audience to root for the good guys. I could call out the underdeveloped characters or predictable scares, but the truth is, I was so involved in the story, that I only considered these flaws after the film was over. I always had trouble seeing how people could find scary movies a \"fun\" experience. Lights Out solved that mystery for me!"
    },
    {
      "rating": "9",
      "text": "Wow was this movie good. I had high hopes for the movie and it delivered. It was intense, creepy, and had me on the edge of the seat for almost the entire time. I thought the premise was original and really entertaining. I liked the characters which is usually really rare in horror movies. They make smart choices and you really root them. Definitely recommend!"
    },
    {
      "rating": "8",
      "text": "Though it's probably not the scariest film of the year, this is still a fun and creepy movie that is simple and easy to follow. It's filled with jump scares but they are good scares that are used creatively. In addition to good scares, the story that this movie has is one that will keep you hooked. Lights Out is full of suspense and a great film for those who love horror movies and thrilling mysteries."
    },
    {
      "rating": "9",
      "text": "This movie is perfect and  a simple creative scary plot added to the teen screams full of JUMPSCARES that made me jump in the cinema also a good cast my recommendations if you like paranormal horror films with plenty of jumps and darkness this is the movie"
    },
    {
      "rating": "8",
      "text": "Lights Out is an impressive debut for first time director David F. Sandberg, who even if he falls into the genre cliches that we have come to expect, still gives us some great performances from the cast including a great Teresa Palmer in the lead role, and a great Maria Bello in the supporting role."
    },
    {
      "rating": "7",
      "text": "I am not a fan of horror movies but I liked this one. Scary, with a good story. One of the best horror movies I have seen in years. No happy ending either which makes it even better :)"
    },
    {
      "rating": "7",
      "text": "If you are a fan of horror films, you will find this film interesting, but it had a lot of faults. Among them were a weak script (and an especially weak exposition) and actors who were not very interesting to watch (Maria Bello was fine, but the weak script did not help her much). Once the unnecessarily complicated lives were “exposed” and explained, the action was decently done. Using a live person for the “monster” and not CGI was very effective as was the lighting and some of the special effects. Was it a happy ending? I’ll leave that to you to decide since I refuse to spoil it for you."
    },
    {
      "rating": "9",
      "text": "James Wan is still able to reinvent the horror genre in his new movie Lights Out. With a new fresh idea James Wan has created a gripping story that kept my eyes glued to the screen anticipating what would happen next. The cinematography is down right good, the characters feel real, so much so that it's hard not to have some kind of attachment to the characters on screen. The story is clever in it's own right, it's a very open and close story, I don't expect a sequel but maybe James Wan will surprise me like he did with this film. This movie is truly incredible and is defiantly worth watching. The movie keeps finding ways to surprise you, don't judge this film based on the trailer it doesn't begin to scratch the surface. I would highly recommend that you go watch this film!"
    },
    {
      "rating": "8",
      "text": "My son Julian (13) and my lady Tammy, themselves two horror-film aficionados, and I went and saw this theatrically, and we were all quite pleased, though at least Julian and I tend to go for the classic stuff. Well worth checking out, if you're in for this sort of thing."
    },
    {
      "rating": "7",
      "text": "This film has genuinely terrifying scares with some good performances.  While the story is fairly basic, there are some twists and turns with the finale being unexpected.  B+"
    },
    {
      "rating": "7",
      "text": "Surprisingly decent and creepy for a PG-13 horror flick. This film's biggest and most notable achievement is its ability to not rely so heavily on fancy trick shots or effects and even tones down the amount of cheap jump scares throughout. It's also unexpectedly clever in many instances. Overall, this is mainly just another fun and forgettable horror flick, but it's also one that has some surprisingly decent scares and ideas that at least puts it above most horror flicks nowadays, especially cheap and watered down PG-13 ones."
    },
    {
      "rating": "0",
      "text": "Boring and not a scary movie, the plot is very poor, horror here and dont smell...It is not clear why it was filmed, and for who, all the best moments have been shown in the trailers, watching movies say to yourself \"when will it end?\" No I do not advise this film, better not to waste time in vain and pass by."
    },
    {
      "rating": "2",
      "text": "I was really hyped for this film as the trailer looked good and James Wan produced it, but it turned out to be a boring, unbelievable mess with bad acting, bad dialogue and has a very lazy and disappointing climax. The core concept, that of a ghost which only appears in the dark, should have provided a lot more possibilities for frights, but the way it was handled, specifically, the way the ghost is introduced and seen so quickly, in the first few minutes of the film, means there's no real buildup or suspense. The only real mystery left is who the heck the ghost is/was, which turns out to be some poor disabled girl who can't be in the sunlight and everyone just calls her 'evil' because her skin is black, which means she probably just decides she may as well be evil. Then, her only friend (who also wants rid of her) decides to blow her own brains out as she's just part of her psychosis anyway. Which begs the question, was she real or wasn't she? I'm not sure even the Director knows or cares. No likeable characters, just another waste of time and money."
    },
    {
      "rating": "7",
      "text": "It's got three things going for it that help elevate it above the average modern horror flick. They are it's unique concept, brisk pacing, and the most likable horror movie boyfriend ever. The only real problem it's got is a lack of scares.I can't praise the inventive use of the movie's core concept enough. There are quite a few clever moments involving the specters sensitivity to light. The final act is a tense game of cat and mouse where everybody involved is using quick thinking to survive. These aren't your average horror movie idiots. The characters are pretty crafty with their efforts to survive and the ghost is downright ruthless. Despite all of that though, it's not a scary movie. These entity tormenting these characters isn't very frightening in appearance and results to the same hide, seek, and pop out tactics from time to time that we see all of the time. There are inventive scenarios, but this is more of a thriller and less of a horror movie. The story itself isn't bad. It uses a believable scenario to ensure that these characters come together. The problem is that it all feels a little too predictable. I was basically able to see how things were going to conclude early on. Not too mention it skips out on some potentially interesting information, like how exactly the entity \"Diana\" is able to live on, and details on how exactly her death took place. I mean, we know what went wrong, we just don't get to know how or why.The characters are well-written though. They act believable, not to just the situation they are currently in, but based on the situations they had already experienced. For example in Teressa Palmer's character you really see the effects her childhood had on her. The standout character though Alexander DiPersia. Usually the boyfriend in horror movies is just flat out unlikable to the point where you can't wait to see him die. DiPersia plays a cool and sweet guy. The polar opposite of what we expect from this role. As a result I really found myself caring for his character and rooting for him to make it out.Lights Out could be better. No doubt about it. It's not scary and not entirely satisfying in the plot department. Yet it's characters are strong enough and concept original enough to make it worth watching, because both are capitalized so well. It also stands out as one of the more original modern horror movies out there. So this is definitely worth a watch for genre aficionados and enthusiasts. Everyone else can also be left pretty satisfied with what is just a pretty good horror film."
    },
    {
      "rating": "5",
      "text": "A solid backbone is here. The storyline is simple, but effective and creepy. The darkness gimmick works well and provides a few decent scares. The cast is game. It just never evolves. It never ups the horror quotient. It is exactly what you think it is and it never challenges that notion or brings it to the next level."
    },
    {
      "rating": "7",
      "text": "Entertaining, with a good plot and most importantly, scary, Lights Out is a superior horror film that fully delivers on it's smart premise in its short running time."
    },
    {
      "rating": "7",
      "text": "This was a great film! Very good acting all around and good directing. \"The woman in the shadows\" is done very well and is a very intriguing creature. The suspense and tone in this movie was spectacular and never a dull moment. Even with the film's incredibly short run time it uses every second to its advantage. This movie shows that horror films can still be great with original and creative ideas to create the films."
    },
    {
      "rating": "7",
      "text": "From same masterminds of The conjuring, a jump scare movie that fulfills the expectations of everyone who wants some minutes of effective fear of the dark. Preferably, don't watch before sleep."
    },
    {
      "rating": "7",
      "text": "When Childhood Nightmares Come Back to Haunt Us\r Lights Out is the recent horror movie that intrigued us from the start as we saw the many trailers while we were scrolling through our facebook feed over the summer. It fed our imagination with the combination of the monsters-in-the-closet mindset and the idea that when the lights go out our darkest and deepest fears are unleashed. Director David F. Sandberg, relatively new to the horror scene, shows his talent with this movie and also the likes of  Annabell 2, another horror film.\r Starring in the film is the familiar actress Maria Bello, who gets to portray Sophie the deranged mother whose depression over her second husband’s death leads her to push away her children and resort to an old friend. Her eldest child Rebecca (Teresa Palmer) who left home years ago gets thrown back into her old life when her young step-brother Martin (Gabriel Bateman) asks her for help with their mother after the recent passing of his father. Sophie’s childhood “friend” she met at a mental institution only known as Diana (Alicia Vela-Bailey) returns as she goes off the deep end. Diana’s possessiveness over Sophie leads to strange behavior, specifically when she takes lightbulbs out in order to let darkness consume the house and enable Diana to stay. When the lights are on everything is normal other than Sophie’s lethargic behavior, but when the lights go out Diana comes out to play and nothing is getting in between her and Sophie. Rebecca isn’t unfamiliar to this behavior from her mother or Diana, she is determined to save her mother with Martin from this satanic entity who is taking over the mother she once knew.\r Sandberg creates a beautifully terrifying monster that plays off of our fear of the darkness. Diana is increasingly intriguing throughout the film as we learn more about her, and her history with Sophie. Even after the movie when I crawled under the safety of my covers in bed the silly fears of the fictional character Diana didn’t escape me. The way they portray her in the movie is spectacular; she has no identifiable features other than the figure of a female, her “skin” or body is entirely black, she can move lightning fast appearing out of nowhere and even coming to Rebecca’s apartment, her ability to hurt people and even kill them, like she did to Sophie’s second husband and Martin’s father in the beginning of the movie, and her strange backstory make this character what she is. Overall, this character’s originality is so simple yet compelling when paired with the mysteriousness of her history and connection with Sophie and even Rebecca.\r The opening of the movie shows us the horror we had come for from the start as Sophie’s husband and Martin’s father is met face to face with Diana and evidently killed. The dark scenes throughout the movie are expertly filmed and the use of lighting, whether it was the tattoo sign by Rebecca’s apartment or the uv light from the basement scene, make the movie unique.  The lighting help tell the story of Lights Out indicating the bright and well lit areas a safe zone and the dark areas a place where Diana’s wrath is reachable. For the majority, the filming and originality are excellent quality, although the few scenes played out through Sophie’s childhood at the mental institution are all too similarly filmed to the ones in Ouija. If the character’s backstories were executed differently and had more content, in order for it to seem more complete, it would have been more effective rather than thrown at the viewer in a quick and displeasing way. It is too big of a jump from one plot point to another and poorly done compared to the rest of the movie.\r Emotions are explored in this movie especially between Sophie and Rebecca. These actresses are perfect in portraying the frayed relationship between mother and daughter and the emotions that go with it. Sophie’s character goes deep with emotions as her depression comes and goes so does Diana feeding off of her unhappiness. I feel like the movie gets really deep when Rebecca decides to put away her grudges toward her mother and try and help her get better. Even though (spoiler alert) Sophie dies at the end of the movie heroically by choosing her children over Diana and killing herself, I think Rebecca gets closure about her relationship with her mother because she knew her real mom still existed beneath the distorted and depressed mother she grew to know.\r Additionally, this movie is quite short for a horror film being only a mere 81 minutes and it shows towards the end. Through the climax of the movie everything is fast paced and action packed and we are just starting to find out the rest of the unknown information about Diana in the basement scene. Then abruptly the ending comes leaving us surprised but more confused than anything. Jumping from Sophie killing herself to Rebecca, Martin and Rebecca’s boyfriend sitting in the back of an ambulance leaves us with so many unanswered questions and a conclusion that ultimately sucks. It almost seems like Sandberg was trying to leave a cliffhanger for a possible 2nd movie but failed in making it seem that way. It needed to have more content towards the end and contributing to a longer and more satisfying ending, enabling enough room for an undecided 2nd film.\r In conclusion, If you want to be left leaving the movie theater brushing off your childhood nightmare where monsters exist in the dark you’ll be pleased with Lights Out. Ultimately this is a great horror movie that left us questioning our safety in the protection of our beds at night and features great originality and performances by stars like Maria Bello, Teresa Palmer, and Gabriel Bateman. I would give this movie a 7.5 / 10 and would enjoy seeing whether David Sandberg will decide to make a sequel to this fantastic film."
    },
    {
      "rating": "3",
      "text": "This movie is nothing to gawk at. I fell for the hype and decided that it may be worth a look-see but i didn't get scared or startled once. It's rather short and the lore isn't explorer enough, ie: how can an entity exist on it's own on the sole basis of a material form (mom) being alive. The lead actress (Teresa Palmer) isn't good at acting...I didn't know who she was before going in and later read she was discovered working at a mall in Australia and cast next day without an audition (2005ish).  And that explains a lot. If you want an eerie film that has the potential to actually give you a fright, go watch It follows."
    },
    {
      "rating": "0",
      "text": "How rotten tomatoes can put 77% to this ****ok, bad script, bad actors, bad characters, bad story, bad cinematografy, is bad in everything, is awfull, lack of a logic script... is very bad in everything and just make us jump sometimes..."
    },
    {
      "rating": "4",
      "text": "A boy is terrified by a menacing specter that only appears in the dark…and happens to be his distraught mother's evil friend. He gets his sister and her bf involved in fighting this malevolence ghost. These movies always have the \"jump-out-of-the-dark\" scares and this one has its share. There's nothing else that makes this film stand out. It has a mild sense of menace, but never really raises much tension."
    },
    {
      "rating": "7",
      "text": "Warner Bros. Is The Modern 'Hammer Productions', Temporarily\r \"Lights Out\", the second horror film most anticipated of the year (undoubtedly, the first was \"The Conjuring 2\") lands in midsummer with an unimaginable reception at the box office, but with unequals from specialized critics. It's not perfect, and despite it being favored with the production of the horror master of the 21st century, James Wan, it is distant from the works of the producer; nevertheless, gives some well made scares and a few drifts of the conventional decisions in the genre, although, as it is recurrent in the summer, all that promise disappears when they turned on the lights.\r As happened with the selfsame Wan at the beginning of the decade with \"Saw\" and Andrés Muschietti with his short film \"Mama\", talented Swedish director David F. Sandberg managed the support of New Line and Warner Bros. to adapt his short film from 2013, in a lucrative film of 81 minutes runtime. There have been several cases in which Hollywood accepts the original ideas from shorts (especially, relating to the horror genre) to take them to the big screen; nevertheless, it is complex and expectant the process to extend a simple plot of three-minute into a solid story line for more than one hour. Sandberg knew to create an gloomy atmosphere and in constant movement, but he neglects worthy treatment to a promising premise complicating the solidification of a real modern classic, even so, it is a delight enjoy of the darkness of his invention.\r Rebecca (Teresa Palmer) is a young woman who is determined to move away from her home to leave behind inexplicable events that happened in her childhood on account of the psychological disorders of her mother with her imaginary friend, Diana (Alicia Vela-Bailey). However, Martin (Gabriel Bateman) replaces the role of his elder sister in house of his mother, experiencing the apparition of a woman with creepy appearance as soon as lights switch off . Rebecca decides to confront her atavistic fears from childhood and save her family, inquiring into the origin of the mental problems of her mother, Sophie (Maria Bello), uncovering the tragic roots of the supernatural manifestations that haunts them, Diana was a marginalized girl with psychiatric problems due to a skin disease with contact of the light, now, she is an aggressive supernatural appearance in search of a weak mind, unfortunately, she has found a home inside a family that was nuclear.\r In addition to each one of the aspects that adorn films of Wan, one of the essential elements is to create strong characters that worry us, characters with credulous foundations; one simple plot, but with heart, with expectation and above all with intense shocks. This lack is present within the film, Palmer and Bello are not light the spark in screen with their performances. The story takes reminiscences of the genre and it is unable to establish the limits of Diana, nevertheless, some of the sequences more stressful are based purely on these.\r With multitude of resources such as the  setting ( interesting fact: I'm pretty sure that the interiors of the house of Sophie where they filmed \"Lights Out\" are the same used in Universal's \"Ouija\" in 2014, with minor modifications; pay attention to details inside the house), lighting and the soundscape manage to hook the audience in a dark spiral to their deepest fears, the cupboard, the blackness under the bed, a bleak basement and of course the universal fear of the darkness.\r We are exhausted of diffuse plots that does not lead nowhere, the argument is  elementary and simply effective. A narrative that combines with the haunting soundtrack and the admirable cinematography, obtaining sequences makes the hairs on the back of your neck stand on end during all runtime. With appropriate 81 minutes, it is slips gradually giving clues and delivering cheap jump-scares with an ending belonging to a family drama, nothing suitable for the purpose of the film, but at least, it was decent.\r \"The Ring\", \"Dark Water\" and even \"The Conjuring\" are rough references in the movie of Sandberg and even though in occasions he become stagnant to project scares that we already have seen, he provides certain scenes that explore the places more recondite of your mind and they will overwhelm you, until you are under your bed sheets at the midnight. The intermittent light red in the apartment of Rebecca, the confrontation between Diana and Bret and the last thirty-minute take advantage of the resource to the maximum; the film is more than keep you on the edge of the seat, the film stays with you until the darkness of your bedroom and oblige you to remember Diana, unavoidably.\r \"Lights Out\" is the dreamy debut of any director and fulfills with generate excitement about what will deliver David F. Sandberg with Annabelle 2. In a period in where horror films are having a boom spontaneous, the last project of New Line does not exceed the level reached by previous films of the movie producer, nevertheless, it entertains, frightens and even paralyzes. The only function of \"Lights Out\" is to nurture even more the universal fear to darkness and, Yes, I always switch on light more than three times to assure me that I'm completely alone, however, the silhouette of Diana always is there."
    }
  ]
}