{"id": 3582, "title": "Like a Boss", "starring": ["Tiffany Haddish", "Rose Byrne"], "runtime": 83, "genre": ["Comedy"], "description": "Two female friends with very different ideals decide to start a beauty company together. One is more practical, while the other wants to earn her fortune and live a lavish lifestyle.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/yce0CZPWd0GGudksRJi8p4gDj1M.jpg", "categories": {"plot": 3.75, "acting": 3.0, "ending": 2.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.357142857142857, "action": 5.0}, "reviews": [{"rating": "1", "text": "Inane. It's just inane. There are many other movies out there to see, don't waste your money on this one."}, {"rating": "3", "text": "Not aggressively awful (I smiled a few times) but it just lacks any energy or style, and for only being 84 minutes somehow still drags."}, {"rating": "1", "text": "no es lo peor que he visto. mentira, lo es. es una **** de emociones, sentimientos y fuego."}, {"rating": "4", "text": "Well, not very good film. I am disappointed from this film. That's all for now."}, {"rating": "0", "text": "Did anyone expect a movie titles after a **** SNL song from a decade ago to be good? Wow...two zany gals takin' on the world....like a boss. I bet they talk about how they have sex and how \"they aint gonna be takin no **** So risque! I cringe everytime something like this is released."}, {"rating": "4", "text": "Unfortunately a poor movie that falls flat with its jokes. And tons of talent wasted.42%"}, {"rating": "3", "text": "Tiffany Haddish and Rose Byrne play best friends who have their own small cosmetics business. Salma Hayek is the glamourous villain who owns a giant company that wants to buy them out. In her broad comic style Haddish has a few funny moments, but this weak script shows how much of her charm lies in her innate ability. Byrne and Hayek aren't even mildly amusing . Even Jennifer Coolidge (who can make anything hilarious) falls flat with the lousy jokes. The plot is painfully predictable and the direction (while energetic) never adds any fun or clever touches. Not a good way to start out the New Year."}, {"rating": "7", "text": "I think this movie is getting pretty unfairly dragged through the mud.  Is this art?  Not by a mile.  Yes, it's supremely \"lightweight\" but sometimes that's all you want.  It's a pleasant way to spend a an hour and a half and there are some legitimately hilarious lines.  Tiffany Haddish and Rose Byrne are a pretty funny duo.  I liked it well enough.  -shrug-"}, {"rating": "4", "text": "Rose Byrne is extremely funny and likable...per usual and you can tell Selma Hayek is really having fun playing the bad guy but the rest of the film is barely passable"}, {"rating": "3", "text": "Typical simplistic comedy in which those involved probably had more fun doing it than you'll have fun seeing it.I know it wasn't funny for me."}, {"rating": "0", "text": "Tired of Tiffany Haddish movies, yes I know its not 100% hers or about her but anything she is involved with already smells like crap to me. This Amy Schumer black twin I'm tired of seeing, she is like Kevin Hart and if Schumer had a baby actually. Both try hard comedians who fail."}, {"rating": "4", "text": "Funny at times but certainly not a memorable film due to a thin story. Not really recommended."}, {"rating": "4", "text": "movie just falls flat, the plot is meh, the acting is meh, the joke are not that funny, it just feels like i’ve seen this all before. glad the movie wasn’t too long or this 4 would have been a 1."}, {"rating": "6", "text": "Like A Boss has a generic story and jokes that fall flat, but in the end, Tiffany Haddish and Rose Byrne's on-screen chemistry really bring the film together for an entertaining January comedy."}, {"rating": "2", "text": "Like a Boss Does Not Put Its Talents to WorkThe Stream: Predictable and laughs are few and far between, though I think they are tryingThe Big Screen: Tiffany Haddish and Rose Byrne have good on-screen chemistryThe Final Bill: If you don’t mind knowing everything that’s going to happen from minute one and realize that every joke is obvious and unfunny, then sure whatever.-Trip FontaineAnd the January doldrums at the movie theater begin. Like A Boss is a feeble, predictable buddy comedy that retreads an old premise, does absolutely nothing new and only succeeds in its pairing of its stars, Tiffany Haddish and Rose Byrne. The basic premise is that two life-long friends own a make-up company, Mia & Mel, that’s falling on hard financial times when they get approached by a cosmetics mogul played by a be-wigged, Salma Hayek. Hijinks ensue! And, do they learn a lesson about friendship? Miguel Arteta has directed this derivative comedy and not really found anything worthy of your time or the stars.There are very few bright spots here. Rose Byrne is an unlikely comedic actress. She’s been good in supporting roles in Bridesmaids and Neighbors. There are bigger comedy stars, but Byrne has her niche. She does well here as desperate and downtrodden, in a funny way. Although a bigger personality, Tiffany Haddish falls in line with Byrne’s rhythms and they ultimately work well together. I wish there was a better project for them. I’ll also note that Billy Porter has some good scenes and gets some laughs. The problem with the scenes with Porter is that they are in the trailer and TV commercials, so you know exactly what’s coming.Like a Boss does zip by. While being very formulaic and predictable, the movie does not linger on anything. In fact, the end comes very fast on the heels of the final confrontation. (You know how these movies go!) At one point, the characters mention weeks have gone by but it had barely been a minute of movie time. It was all very slight, not surprising and not funny enough to be worth it.All of the talents involved have better movies or TV projects that you could watch. Watch Girls Trip for a 20th time for your Tiffany Haddish fix. Rose Byrne is better in Neighbors or Bridesmaids or Spy. Check out Salma Hayek in Beatriz at Dinner, which was also directed by Miguel Arteta. I will say that there was a group of raucous, probably drunk, ladies in the theater I was in, who cackled, howled and talked through much of the movie.If you must, grab your drunk girlfriends and run the movie in the background on your girls’ night in this summer, but skip it in the theater. It’s not even worth the 83 or so minutes."}, {"rating": "2", "text": "Haddish and Byrne provide solid performances, but it’s not enough to make up for an unoriginal script with more cringe than laughs. If you enjoyed the trailer, stop there – every “funny” moment is already included."}], "recommendations": ["tammy", "dirty_grandpa", "tower_heist", "wedding_crashers", "date_night", "30_minutes_or_less", "little_fockers", "the_other_guys", "sex_drive", "identity_thief", "neighbors", "the_wedding_ringer", "the_proposal", "ride_along", "trainwreck", "paul_blart_mall_cop", "thunder_force", "dodgeball_a_true_underdog_story", "wanderlust", "a_bad_moms_christmas", "couples_retreat", "horrible_bosses_2", "forgetting_sarah_marshall", "what_happens_in_vegas", "the_longest_yard"]}