{
  "id": 623,
  "title": "Limitless",
  "starring": [
    "Bradley Cooper",
    "Robert De Niro"
  ],
  "runtime": 105,
  "genre": [
    "Thriller",
    "Mystery",
    "Science Fiction"
  ],
  "description": "A paranoia-fueled action thriller about an unsuccessful writer whose life is transformed by a top-secret \"smart drug\" that allows him to use 100% of his brain and become a perfect version of himself. His enhanced abilities soon attract shadowy forces that threaten his new life in this darkly comic and provocative film.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hv5JMCrMVLvV6HKPf9FcBuyk2MG.jpg",
  "categories": {
    "plot": 6.103448275862069,
    "acting": 7.294117647058823,
    "ending": 7.076923076923077,
    "soundtrack": 8.0,
    "cinematography": 7.25,
    "familyFriendly": 6.0,
    "funny": 3.75,
    "action": 6.923076923076923
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is a fun movie. Bradley Cooper and De Niro give great performances.  An interesting story told with great fx and cinematography. Its a great ride. Go see."
    },
    {
      "rating": "9",
      "text": "Limitless is a fairly gripping thriller.  What does this pill do?  Doesn't it have everybody's minds racing after watching this movie?  Very original film that doesn't have to rely on trends in the movie biz.  Cooper is the outright best actor for this thriller.  Rough around the edges but smooth, suave and articulate when need be.  There is a bone to pick with this movie... the end is unsettling and somewhat disappointing.  In fact, when I watch it, I literally sat there thinking, \"Really.  THIS is how they end this great movie?!?!\"  All but the ending was incredible.  9/10"
    },
    {
      "rating": "7",
      "text": "Limitless while not being amazing has enough going for it to be entertaining and worth recommending. The story while being a little too familiar in science fiction was told in an original way and the cast gave good performances. I enjoyed the use of colour schemes in the movie and the dynamic use of the camera positioning and shots were interesting and effective. The movie did stay predictable throughout and unfortunately the ending of the film was not much of a surprise, something that is a little disappointing as there was more potential to this movie. Limitless is worth a watch. Recommended"
    },
    {
      "rating": "6",
      "text": "The point of this cliched, preposterous movie? Don't do drugs."
    },
    {
      "rating": "9",
      "text": "Limitless is one of these rare films, where the preview doesn't give you a clue as to how good it really is. I saw this because the movie I wanted to see wasn't playing until 11, and I honestly didn't expect much from it. What I got was a visual masterpiece, with some of the best camera work I've ever seen, and an amazing story that was so much more than some guy and his magic pill. It's intense, shocking, and unique. Bradley Cooper really makes the movie. He FINALLY lets go of his super cool, good looking guy image, and really shows the audience that he can act! This movie was a breath of fresh air and I can't wait til it comes out on DVD so I can see it again!"
    },
    {
      "rating": "9",
      "text": "Most movies that constantly make you think \"What would I do if I were them?\" usually ranks higher, especially when the person in the film does what I would do, but better.\r This movie has a transhumanist theme to it; the idea of where nootropics will bring humanity is called into question.  What will change when we can take a drug and learn quantum mechanics, everything about physiology, and understand corporate business, in a month?\r The negatives of the film do not out shadow the themes presented.\r While he should of just known to have a gun or weapon to defend himself at certain points... That is what it takes to make a movie dramatic and suspenseful. No one can be perfect, or else it would be entirely unreal."
    },
    {
      "rating": "8",
      "text": "wtf is up with all the people writing its bad. I personally thought it was pretty enjoyable if you like suspense and action its also somewhat slow and leaves you guessing whats going to happen, SOME just some parts were somewhat dull but it was still i good movie"
    },
    {
      "rating": "8",
      "text": "\"Sharp , great dialouge , and a nice and steady pace , Limitless is a breath of fresh air in a year where movies have not been there best. Its simplistic , smart , and very well done and boasts one of Bradley Coopers best performances .. a nice surprise\" .. B+"
    },
    {
      "rating": "7",
      "text": "This was a very good film. wasn't expected this movie to be any good. Great Job with the cast and screenwriting. This isn't the type of movie that i will die to see, but when i watch this movie i wasn't upset that i watched it i was glad that I actually found time to watch it , this movie was good. A good movie to watch. This movie probably don't seem good but it is. Good actors and actress. Good job with directing this movie. A well put together movie. The script to this movie was good. Good movie to watch."
    },
    {
      "rating": "8",
      "text": "This film seems to be a bit predictable and there is an awful lot of \"why didn't he do that...\" BUT somewhere quite late in the film things start changing and when you do reach the end (it is a bit long) there are some fairly startling revelations. In fact it puts the whole film into some perspective.\rWell worth watching and probably under estimated as a thoughtful film."
    },
    {
      "rating": "8",
      "text": "Yep its good. Reminds me of Fight club a bit. It does slow down towards the latter half but I really like the ending. It could have been a really really great movie but that been said, its definitely one to watch."
    },
    {
      "rating": "7",
      "text": "I liked this movie, not necessarily because of the whole concept of the drug and its potential was brilliant. I liked the way Bradley Coopers character acted in a realistic way getting gradually more adventurous rather than going straight into world domination mode. It would have been nice to see Robert De Niro develop into more of a nemesis but this is a minor flaw in an otherwise entertaining movie."
    },
    {
      "rating": "10",
      "text": "This movie was phenomenal. I think the concept is interesting enough to see this movie! It's about an unsuccessful writer who comes across an amazing new drug. It has the ability to completely unlock your brain's potential. It definitely changes his life and his outlook on it. Like all drugs that aren't completely kinked out and are illegal, it has side affects. This movie is great from the acting to the way they brighten up the world when he takes it. The ending is great and a bit scary too. I know this review might be a bit late, but please see this movie. It's so great."
    },
    {
      "rating": "7",
      "text": "all i have to say is wow.  this movie shocked me.  it was better than what i expected it to be.   forget the people who hated on this movie.  this movie is decent.  the story was very good.   the movie takes you for a spin."
    },
    {
      "rating": "8",
      "text": "Cooper is very convincing in this role, proving he is a versatile actor. From struggling writer to junkie to successful businessman - he plays them all. Would happily recommend this movie."
    },
    {
      "rating": "6",
      "text": "One word, shallow. A shame, since the cool starting concept went to waste.[SPOILERS] The glaring hole in plot/character is: if the drug is all-enabling, what differentiates the central character from the thug and any other person on drugs? The answer the movie gave is NOTHING. He didn't have any redeeming qualities, from start to end he was completely reliant on the drug. He may have killed someone, and showed zero remorse or guilt. Aside from running out of the drug, he really didn't run into any problems. I felt the movie had a chance when he was told \"you don't have experience, you have talent but you didn't earn it\". Unfortunately the director never went down that road. I give the movie 6, because it just doesn't live up to potential."
    },
    {
      "rating": "5",
      "text": "Limitless is a film with a brilliant premise, with Bradley Cooper as Eddie Morrow, an intelligent but burnt out writer whose life is kind of running away from him. Tied to a deadline to produce the first chapters of a new book (after receiving an advance payment he's effectively wasted), dumped by his woman Lindy (Abbie Cornish), chased up for rent by his Chinese landlady and effectively getting to his wits end.\rSalvation comes in the unlikely form of his ex-brother-in-law Vernon (Johnny Whitworth), a low-life drug dealer who he bumps into whilst on a walk around his neighbourhood. Seemingly well to do with flash clothes and a nice apartment, he gives Eddie a clear looking pill explaining it's an experimental drug which enhances recall.\rEddie, unsure but also running out of options, heads home and takes the pill on the way. He suddenly finds himself able to access every memory in his mind, literally everything that he's ever seen, heard or been exposed to. But not only that, these memories are coherent and accessible with the necessary context, effectively making him super-intelligent. With this massive increase in intellect comes a massive increase in confidence, focus and ability to learn.\r He gets back to his apartment building and, using his new abilities, immediately beds the landlady's daughter after briefly spotting an obscure book in her bag that he remembered from his own days in college. He also recalls the background conversations between said book's owner and uses this knowledge (and his increased confidence) to dazzle the woman. He then immediately tidies his apartment, cleans all his clothes, and knocks out the chapters of his book in a few hours.\r However, things get complicated when the pill wears off. Eddie goes to see Vernon, but Vernon is shot by those he had stolen the pills from. Eddie locates the pills and begins to take one a day, using them to turn his life around.\rIn order to secure funds he borrows a substantial amount from an Eastern European loan shark, and invests in the stock exchange, becoming the darling of the financial world. He reconnects with Lindy who is shocked by the transformation and worried about the pills. And he eventually comes into contact with Carl Van Loon (Robert De Niro), a billionaire tycoon who has motives of his own.\r Will Eddie come out on top? Watch the film and find out.\r But is the film any good?\r Well, yes and no. The first 45 minutes is brilliant, setting up the story and displaying the 'power' of the pills, their effect on Eddie, and the transformation of his life. The rest of the movie is like a different film, with the introduction of De Niro's character, and the shift from sci-fi/fantasy and action, into a more dramatic and slower paced, almost 'cat and mouse' thriller. To me it suffered massively because of that, and it's clear that the film is based on a novel. I can imagine the book having a lot more depth and exposition in regard to the set up, as well as a more cogent rationale for characters' actions leading to the ending.\rIt's no surprise that the television show bases its own narrative more around the action and sci-fi/fantasy elements of the first act of the movie.\rOverall the film is very good, but the complete tonal shift does mean the pace becomes almost a crawl (save for a couple of action set-pieces) after that initial 45 minutes.\r If it pops up on television, give it a whirl. But it's not a film I'd recommend anyone actively seek out."
    },
    {
      "rating": "5",
      "text": "When I first saw this film I was left with a little pit of disappointment. After patiently waiting for a month to watch, I felt that the pacing of the film seemed to be very uneven and that the ending had such little impact. However, after being given a chance to digest what I'd seen, this film has been able to grow on me. It feels refreshingly original and has some great visual effects, including a fraction zoom which I'm a big fan of. Some interesting characters as well. Overall, Limitless is a very good watch."
    },
    {
      "rating": "8",
      "text": "Show me the dealer! I want some of this. My first thought was a drug is bound to have side effects. I was totally wrong. If you like a mystery thriller with a touch of fantasy. Watch it. Don't over think it, just enjoy."
    },
    {
      "rating": "9",
      "text": "Not sure how you couldn't love this dazzling ride. But maybe it's one of those I need to have ingested a psychedelic some time in one's life. Anyways The Hangover's Bradley Cooper triumphs again in this unpredictable thriller about an underground drug that happens to vastly enhance cognition. So strap in and get ready to enjoy a great, wild mind-blower, complete with Robert De Niro as an arch Wall Street villain.Loved it. A major wow."
    },
    {
      "rating": "0",
      "text": "Great. What do you get out of watching this movie ? Loser guy swallows a drug and gets super-smart. The perpetual monologues are highly annoying. In addition, the movie starts with the guy telling us that he didn't succeed. All expectation is killed right at the start. I cannot believe a studio actually greenlights this crap."
    },
    {
      "rating": "0",
      "text": "I can't believe that someone would like this. So pretentious, full of crap, drug addict obsolete. I mean fear and loath was great movie that promote using drug. This, well, this is bull shi*. I gave it zero, i couldn't give it more, i just can't. I 'm happy that i didn't go to see in cinema i would be frustrated and betrayed. After 15 minutes watching at home i couldn't standed so much stupidity and i quit it. Just stopped and deleted, forever."
    },
    {
      "rating": "0",
      "text": "The film lacks any sort of direction, pacing or credibility. While I appreciate the fact that Bradley cooper doesn't want to play the stereotypical a**hole in films for the rest of his life, this movie really won't do him any good. Watching the film I didn't feel any sort of sympathy for the character. To me, he's just a looser stealing drugs off a dead guy and cheating on his girlfriend.De Niro does his best to salvage the movie, but it's simply not possible.Also, the premise is very unbelievable. How would a former drug dealer gain access to a highly sophisticated drug, let alone walk around with a stash on him? To sum up, I didn't care very much for the movie. P.S. relying on voice overs for insight is very very cheap."
    },
    {
      "rating": "8",
      "text": "Smart action flick with a great story, great acting and keeps you on your feet. Grabs you in to its world and never lets go. Reminds me of those old SciFi 90s action movies, but better."
    },
    {
      "rating": "10",
      "text": "I have to say Limitless is one of the best films I've seen in a long time. One great thing about the movie is that it is so unpredictable, and by the end you're left thinking 'Wouldn't that be great if it really happened'. With Bradley Cooper (The Hangover, The A-Team) and Robert De Niro (Raging Bull, Goodfellas) at the helm, you know before watching that it's going to be a good film and it fulfils that incredibily. Excellent 10/10."
    },
    {
      "rating": "8",
      "text": "This is a great movie. It's fast-paced, it's interesting and the performances ( especially Cooper and De Niro) are excellent. Artistically it's stunning and the execution of the idea is intriguing. Very good film, 8/10. P.S if you like this, check out the book. It's called \"The Dark Fields by Alan Glynn."
    },
    {
      "rating": "0",
      "text": "Limitless may not be the worst film of all-time, but it certainly tries to be. All with the air of seriousness, this movie has one of the stupidest plots I have ever seen, absolutely terrible acting, annoying narration that only makes me hate the protagonist, and a theme that seems to encourage being a terrible human being. This was not a movie to give a happy ending to. This was a movie that should have ended before it put a stain on the careers of everyone involved."
    },
    {
      "rating": "0",
      "text": "Dumbed down version of Click (2006), except without the moral lessons, and popping pills instead of using a remote control. My how the times have changed. Lots of cliches: struggling writer, russian thug antagonists, mayor / wallstreet bigshot as generic optimal of success."
    },
    {
      "rating": "8",
      "text": "This is an amazing movie! It's superb, with great characters, amazing action scenes and clever ideas. If you don't love this unpredictable thriller, then you're probably really grumpy."
    },
    {
      "rating": "10",
      "text": "A great movie. Kind of in the supernatural world, and I love it. I would be great for all ages, that have a sense of intelligency. Go see it. If you love supernatural. If you love De Niro. Its a must see. Makes you think outside of the box."
    },
    {
      "rating": "7",
      "text": "Besides the cheesy Matrix ending, this is an entertaining/ popcorn movie. It could have been more poignant and philosophical, but instead it goes for the mass appeal. Regardless, it's good escapism and better than most movies out right now."
    },
    {
      "rating": "4",
      "text": "Don't get me wrong I was entertained by this movie but there are just too many loopholes in the story and too many convenient things happen to keep the movie going. I wouldn't watch it again."
    },
    {
      "rating": "6",
      "text": "What do you get when you take an original, novel-inspired premise that has \"Limitless\" potential and injest it with Hollywood flair? A film engaging enough to make you think differently; atleast until you leave the theater. The popcorn thriller delivers, but not to the level it could have. \"Limitless\" is a film that falls into the unfortunate trap of overcomplexity. With this entrenching influence, comes gaping flaws. Before we examine such flaws, let's start with what we see on the surface. We are introduced to a charming, amiable protagonist in Cooper, who the viewer, can easily take an affinity towards. He is the vehicle for the film's effectiveness. In his role, Cooper is the \"face\" of the film's every expression, where we see and feel Morra's dissatisfaction with the status quo, and the urgency to make something of ourselves. This connection between character and self will \"do\" it for some, but that is just the start. Next is the visuals. Once we are embraced by the presence of NZT-48, the filmmakers' efforts to illustrate the endless capabilities of the drug is impressive to say the least. The world becomes bright, the scenery all makes sense, the sounds more resonant, and life's once grim lenses are now pure as ever. You throw in a couple notable supporters, (Abbie Cornish and Robert De Niro) and you have yourself a pretty enjoyable trip to the theaters, right? Perhaps, for some. This is my problem with \"Limitless.\" Once you make your way past the topical layers of the film, (cast, fast pace, visual effects) which are done tediously, there isn't any substance left, and to fill up time, the filmmakers are forced to add unneeded \"fluff\" that strays from the effectiveness of the film as in the protagonist's moral and internal struggle to weigh the consequences of power, and a desire to revert to \"normal life\" and make something of himself naturally. This is almost entirely neglected after the premise, where Hollywood's true colors are readily shown. Here is  where I begin to lose the direction of the film. Cooper's girlfriend has clearly left him in the beginning of the film, but comes back to him on a whim once he has taken the drug. Now it seems that a drug, said to allow use to use 100 % of your brain has the power to attract and give of pheremones? Interesting, yet silly.  What else is ludicrous is the seeminly unlimited supply of the drug. When Morra's ex-brother-in-law dies he finds one bag of pills, yet it seems another two or three bags are spawned over the course of the film. One of the most moronic of all plot flaws is the unnecessary involvement with the Russian loan-shark. Now, if you had the brilliance of Morra and had earned large sums of money in the stock market (which seems a bit unrealistically whimsical as well) where is the logical practicality in borrowing $100,000, and even so, when he had come out on top of the investment ($2.5 million), why would he fail to pay back the amount. The loan-shark's usage of NZT also has little to offer to the film's direction. Recalling instruction on \"how\" to fight as in the subway, also seems \"far-fetched\" when taking into account the pill's function: using all one's brain-not muscle memory. Other instances of absurdity take flight when Morra's girlfriend runs across an ice-rink (in shoes-across ice...) and picks up a child while having the strength and reaction (not traits of the drug) to lift a child up and manuever the blade of a skate flawlessly into the path of an intruder. The film's last 10-15 minutes is what really drove me over the edge of sanity. Where does drinking one's blood become a key to safety in suspense? Now granted it is unique, the logic seems suspect. Just when you thought \"Twilight\" Series couldn't be more of a pop-culture hit....Aside from the many other plot holes and moral ambiguity, \"Limitless\" is a fun roller-coaster, thriller of a ride that will make you think......only after the credits have rolled."
    },
    {
      "rating": "4",
      "text": "I mean, I suppose if you're a child or have an IQ below 100, the plot holes and otherwise sketchy moments that appear, in all seriousness, every 15-20 minutes.  A friend, who also thought Battle LA was phenomenal and thinks Transformers 2 is the best movie to date, said \"it's a movie\" not able to understand that even fictional movies aren't meant to have a flawed storyline, let alone every other scene being questionable.  All logic aside, I found it a very boring movie, the whole premise was a lot like Phenomenon but at least Travolta didn't develop his powers through pharmaceuticals and there was a hint of Wall Street to it.  It wasn't original, the plot was just silly, and there wasn't nearly enough mindless action to make it fun.  All in all, I've seen far worse, but there is no reason to go out of your way and see this.  It was a waste of time."
    },
    {
      "rating": "2",
      "text": "Feeling totally \"duped\" by this movie. I was expecting Leslie Nielson or Steve Martin to appear! Great premise but the movie falls apart and becomes a farce. Save your money!"
    },
    {
      "rating": "9",
      "text": "i really liked this movie it is very original and it is not filled with action but when there is no action it is still interesting enough that you want to keep watching it and the acting is spot on. there are a few twists that you dont see coming and that is what you look for in a movie. this movie has alot of what you look for with great acting great plot and story line and some girls that are nice to look at although i kinda wish there were more of them to see. this is a must see and you will love yourself for seeing it"
    },
    {
      "rating": "8",
      "text": "First of all this is really good film. secondly when the guy says at the beginning we only use 20% of our brains that's not actually true. that's just a myth. we use 100%. thirdly the ending sucked. to me it seemed like they tried to cut it short or ran out of ideas. this is a shame because if it went on for another hour and ended differently it would of been better. over all really good film, and i loved the music by the black keys."
    },
    {
      "rating": "6",
      "text": "You get to be the smartest guy on the planet and all you want to do is make money? A great premise ruined by Hollywood's catering to the average movie goer. There's a Jekyll and Hyde quality to the movie but it squanders opportunites to really imagine what a super smart guy might get up to. In the end he's going to be POTUS, when he'd be better off hob nobbing with Buffet and Gates and helping the world. Then study epigenetcis and cure diseases, predict health trends. Crank up green energy sources. All this guy does is go back to an old girlfriend, who would now be oh so boring! And if I had bad guys chasing me I'd now how to make them dissappear."
    },
    {
      "rating": "4",
      "text": "It's somewhat entertaining, but feels a little too sterile for lack of a better word. I definitely chuckled throughout. When Cooper \"realizes\" he can fight in the subway, however, it feels like a bad parody of \"Chuck\". And the end?  Pretty weak. No larger lesson for anyone, and it's going for a \"Player\" ending, but with no savvy or grace. DeNiro is wasted in this as well.  Abbie Cornish is solid, and Anna Friel is pretty courageous in a minor part."
    },
    {
      "rating": "5",
      "text": "Let the eye-rolling begin. It's the customary reaction whenever you tell people you that you're writing a novel. Let their eyes roll, you think, because on a good day, you literally feel like a god, as the words congest the previously white spaces of the page teeming with life; the life that you invented from the brain you would kiss on the cerebellum if the law of physics permitted it. But not everyday spent in Bohemia is a happy one. The prospective writer, just like Eddie Morra(Bradley Cooper), can sit at his desk and produce nothing for hours on end, abiding by the \"stay in the room\" principle to no avail, while people in the outside world with real jobs lead productive and fulfilling lives. An unsuccessful writer can suck the life out of your very being. Tired of being a \"cleaning lady\" and \"bank\", the writer's girlfriend, Lindy(Abby Cornish), indicates her preference for those punch the clock types when she dumps him, even though, you would think, an editor would have more patience than most women, since she is in the book biz. Before things can get any worse, Eddie has a fortuitous run-in with his ex-brother-in-law, Vernon(Johnny Whitworth), who gives him a special pill, a black market substance called NZT, which is designed to maximize the brain's potential, and in Eddie's case, cures his writer's block and allows him to finish the novel. \"Limitless\" should have stayed on this path, a writing path, instead of veering off into more sexy narrative terrain. With all that access to the brain's potential, Eddie could have started a new religion and be its charismatic spokesperson. \"Limitless\" could have been a treatise about the dangers of rhetoric, but the film is just not that ambitious, so it settles on being a dumb generic thriller about high financing on Wall Street, conspiracies, and who ultimately has control over the magic pills. The moviegoer doesn't care how NZT affects a Russian loan shark, since, in Vernon's words, \"it works better if you're already smart.\" Turning his back on Bohemia, Eddie becomes a financial wizard, in which \"Limitless\" then gets bogged down with deadly boring talk about corporate mergers, involving Van Loon(Robert DeNiro), who wants this newbie to restructure his deal. \"Limitless\" forgets that it had the makings of a pretty nifty science-fiction mindbender. Under NZT, large chunks of time go unaccounted for, and as a result, Eddie may or may not have murdered a socialite in a hotel room. A detective questions him, but he is never formally charged. It's as if he's getting away with murder. Since Eddie, at one point, drinks another man's blood laced with NZT, it's hard not to connect \"Limitless\" with the Christian Bale character in Mary Harron's ultra-violent \"American Psycho\", whose Patrick Bateman also gets away with murder. Both films touch on the superficial nature of society. Curiously, \"Limitless\" is quite limited in its scope. Anybody can make a killing on the market, or run for the senate. With a better script, Eddie would rule the world."
    },
    {
      "rating": "6",
      "text": "well i found this movie to be exausting... and thats not necessarily a good thing. there are a couple of development faults at the beginning  that were kinda annoying then after that the movie got ADD. i was never totally sure of what was going on and could only drop my jaw as a women used a little kid as a weapon. some of the stuff was just not that needed. but the acting was good and it was a good story. when it could be followed"
    },
    {
      "rating": "5",
      "text": "Wow. A lot of users gave this movie a positive review (users, no doubt). I checked it out because I thought the concept was sort of cool, and because De Niro could release a fart and I'd still take a whiff.  What ruined the film, was the fact that the lovely Abbie Cornish was made to use an ice skate as a weapon (to cut a bad guy)....which is fine, except for the fact that the skate was on the foot of a child - The child which she picked up and swung, cutting said bad guy. A cheesy, cringworthy moment that prepared me for the ridiculous blood-slurping scene."
    },
    {
      "rating": "5",
      "text": "This was simply a cheap movie with limited appeal. I thought it ran out of steam about half way through. The ending was unexpected and weak. Do not waste your time."
    },
    {
      "rating": "6",
      "text": "Bradley Cooper plays a New York writer who can't writeâ"
    },
    {
      "rating": "5",
      "text": "This movie was entertaining but it falls into its own trap of being about taking a drug. It is nauseating for the viewer to watch a drug user go through highs and lows. It really is a nasty trip to go along for the ride of a user who is tripping. So, I enjoyed the highs of this movie... and I hated the lows, which should be expected... but it doesn't make it worth recommending."
    },
    {
      "rating": "7",
      "text": "If I were rating strictly on the visuals, this film would get a 10.  I haven't seen his other films, but director Neil Burger has a good eye and uses visual effects well.  The story was interesting enough to keep my attention, but there were a couple of times I rolled my eyes in disbelief.  I was never bored, and that's a good sign.  The acting in the movie is very good and of course really comes alive when DeNiro is onscreen.  Overall, this movie intrigued me enough to want to see other films by this director because of his visual flair.  Impressive!"
    },
    {
      "rating": "8",
      "text": "a prime example of how most professional critics are a worthless bunch. this movie is engaging, interesting and full of twists. it all adds up to a good time. watch it."
    },
    {
      "rating": "9",
      "text": "It's rare that a movie whose concept it completely enthrawling and makes me say when sitting in the theater watching it's preview, \"I can't wait til that comes out!\"  But it's even rarer that such a film fulfills that promise and allows me to say when the credits are rolling, \"I knew that was gonna be good!\"  This is such a film."
    },
    {
      "rating": "7",
      "text": "Nice light movie to watch with your girlfriend. Fun, not too simple story about a wish any of us would like to get a hold of in real life. The characters seem real enough to support the concept. Good performances by Bradley Cooper and Robert De niro, good touch from Abbie Cornish. Not much more to say really. It`s just not one of those movies that make you think about stuff. Sure, maybe a nice coffee talk after watching it but later, meh, it goes with all the other such productions and fades away."
    },
    {
      "rating": "10",
      "text": "This was the stupidest movie ever created it was a waste of money, time, and good popcorn. if you wanted a good movie to laugh at you got it. i nearly fell asleep 30 minutes into. dont waste your money on this movie."
    }
  ]
}