{
  "id": 4063,
  "title": "Lincoln",
  "starring": [
    "Daniel Day-Lewis",
    "Sally Field"
  ],
  "runtime": 149,
  "genre": [
    "History",
    "Drama"
  ],
  "description": "The revealing story of the 16th US President's tumultuous final months in office. In a nation divided by war and the strong winds of change, Lincoln pursues a course of action designed to end the war, unite the country and abolish slavery. With the moral courage and fierce determination to succeed, his choices during this critical moment will change the fate of generations to come.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oOo905cttAIkHERDBya5sX6HbIV.jpg",
  "categories": {
    "plot": 8.166666666666666,
    "acting": 8.553191489361701,
    "ending": 7.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 8.75,
    "action": 8.428571428571429
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It's hard not to give this film the highest marks. Daniel Day-Lewis is amazing and so perfect. That's no surprise. What surprised me was the fact that so many other great performers were not overshadowed. Tommy Lee Jones nearly steals the show as Thaddeus Stevens, and Sally Field commands her role as Mary Todd Lincoln. Every character gets plenty of screen-time, all the while we are served up a buffet of the greatest portrayal of a US President in the history of cinema."
    },
    {
      "rating": "10",
      "text": "A riveting portrait of the last few days of the late president, 'Lincoln' is a highly-tuned piece of historical drama that works almost the same way as a blockbuster thriller, mostly thanks to Daniel Day-Lewis (who presents us with a typically masterful performance), Tony Kushners dense, historically accurate script, and Spielberg's willingness to hold off of sentiment and keep it realistic. In fact, this movie barely feels at all like a work from Steven Spielberg. It feels more like a Sidney Lumet courtroom drama, with occasional blips of Spielberg's touch feeding through. I would have to say that, thanks to this display of restraint, 'Lincoln' marks his best film since 1998's war masterpiece 'Saving Private Ryan'. The entire cast is put to great use, even those actors who might not seem like the right choice for a role that may demand a southern accent and donning a wig (James Spader I'm looking at you). While Daniel Day-Lewis captures with absolute clarity Lincoln's steady mannerisms and droll sense of humor, Tommy Lee Jones provides an antithesis as the spitfire, strongly-voiced abolitionist Stevens. Sally Field also makes a strong return to the screen as Mary Todd Lincoln, perfectly capturing the frantic melodramatic fits that the role requires, while also not submitting to a shallow interpretation of her vibrant character. The rest of the cast shines as well, giving the look of the film the sense of being thoroughly lived-in. While we may never be able to get a 100% valid look into the life of the great man, 'Lincoln' represents the most accurate and engaging exploration of his life ever transmitted to the silver screen and it stands as a hard-won tribute to his accomplishments as well."
    },
    {
      "rating": "8",
      "text": "Before you see this you have to know this isn't about Lincoln as much as it is about passing the 13th amendment. While it does drag (it's 2.5 hours) it's never boring and it's filled with plenty chuckles to carry it along. Day-Lewis IS Lincoln and is sure to win the Oscar. Much like Ledger and the Joker, I could not imagine anyone else in the role."
    },
    {
      "rating": "10",
      "text": "My favorite movie of 2012.  Lincoln is exceptional film making by Steven Spielberg, with brilliant  performances by Daniel Day Lewis and Tommy Lee Jones."
    },
    {
      "rating": "10",
      "text": "With excellent acting by the entire cast, deep characters, and great dialogue, Spielberg and Kushner create a beautiful film that immerses the audience into the time period and reanimate these historical characters.  Through my personal passion for history and politics, I was able to recognize and appreciate the amount of detail they put into their work.  Daniel Day-Lewis once again immerses himself into a role and the result is breathtaking.  My favorite film of 2012, this movie is destined to be a classic."
    },
    {
      "rating": "10",
      "text": "It's clear throughout 'Lincoln' that the man himself was not a man of means, he didn't come from money nor did he have much of an educational background, he learned about life through living it, rising the ranks with popularity amongst the people he served, Daniel Day-Lewis delivers a dazzling and powerful performance as the 16th President of the United States, a man with countless stories and a calm and collective attitude that resonates throughout the film, a film that breathes a sombre breath, yet it accomplishes an impressive feat of pivotal speeches, interesting characters and a story intertwined with the politics that surrounds Lincoln and his family. We pick up out story in the closing month of Lincoln's fruitful life and as he attempts to push through 13th Amendment with the aid of Thaddeus Stevens (Tommy Lee Jones) and William Seward (David Strathairn) amongst others. The detail and careful consideration put into each political moment of this historic amendment is quite astonishing, an ensemble cast full the shoes of various figures in the life of Lincoln as he attempts to be the driving force in the abolishment of slavery in the United States, but the opportunity to break away the financial roots of the Confederacy also played a major factor in an attempt to end civil war. The film doesn't have the typical blockbuster and big-budget effect that director Steven Spielberg creates, but instead we have gatherings of important people in dark, candlelit rooms as they argue for themselves but also what truly matters, peace, there isn't epic portions of flying flags, but instead there are intensely flawed characters, never really sure of loyalty or allegiance, equality plays a major factor in the film, not just amongst the people, but for the President himself, who is often held accountable for his past as a man not coming from a privileged life, but it also fits well with a film that wants to show the real side, as Lincoln himself uses tactics, as any politician does, to sway voters, using negotiators (James Spader, John Hawkes and Blake Nelson) to change the minds of a few Democrats. The performances are the true heart and brilliance of the film, Daniel Day-Lewis captures the mannerisms of what we perceive to be the man in the top hat, a soft spoken individual but one who seems tired and endlessly in thought, often brought back down by his passionate and forthright wife, Mary Todd Lincoln (Sally Field), and his stubborn son Robert (Joseph Gordon-Levitt).\rWriter Tony Kushner has managed to make the politics enthralling by working pivotal moments into passing parables, no fireworks or streamers necessary, it feels more real and candid when it is played out in this way, which Spielberg perfectly portrays onscreen.\rThe film really should have ended five minutes earlier than it did, although we all know how the end of the sorry goes, many people probably still want to see, but a much better close happened a little earlier. Even so, this is quite an engrossing and dramatic piece, expert direction, writing and performances, sheer brilliance throughout."
    },
    {
      "rating": "6",
      "text": "Damn, what a cast. I love films like this that have these huge casts and I keep seeing all these character actors who I recognize from other films or television shows. Daniel Day-Lewis was great (though I prefer him in Gangs of New York and There Will Be Blood, personally). Tommy Lee Jones, David Strathairn, and David Costabile, are also major bright spots. As a whole, this is an at times very interesting film about Lincoln himself, as well as everything he went through trying to get the 13th amendment passed. The performances, direction, and costume design, are all major pluses to this historical film. However, it felt a little long. Some of it could have been trimmed and the final product would have benefited from it. On top of that, Mary Todd Lincoln was almost exclusively portrayed as a total b****, while Robert Lincoln was almost exclusively shown as a wannabe soldier. Thus, I almost think Jospeh Gordon-Levitt's portion could be trimmed significantly, though his performance was fine. I also wish they either showed more elements of Mary Lincoln or trimmed her down and focused exclusively on Lincoln, his Cabinet, and the House. The ending is also poor, as it does not even show anything. While I am not a huge fan of gore, at least hearing a gunshot would have been an added plus. The way they did it felt as if they were purposely keeping us at a distance, which is annoying. The film can also be a little tedious at times and fails to hold your interest throughout the entire run time (largely thanks to the parts that add nothing much to the film as a whole). However, as a whole, the film is very well made and very well done from all parties and stands as a great look at history and is poignant even today, as though the issues are different, the divide between parties and the way votes work is all too similar."
    },
    {
      "rating": "5",
      "text": "Spielberg delivers a so-so biopic focusing on one particular moment in Lincoln's life. One doesn't quite understand the purpose of choosing this particular moment if then you don't follow on the social and political implications. Everybody already knew the history - it would have been interesting to focus on some other aspects. Daniel Day-Lewis impeccable as usual, this time the fault lies with the screenwriters and the director."
    },
    {
      "rating": "9",
      "text": "The real masterpiece comes from Daniel Day-Lewis' climactic performance, as well as his dead on portrayal of our greatest president. Tommy Lee Jones as the cynical Thaddeus Stevens gives us a laugh with his sardonic humor. And Sally Field scores again as the emotionally traumatized Mary Todd. The story-line is brief considering their history altogether, but \"Lincoln\" is a gut-wrenching memoir of the 13th Amendment."
    },
    {
      "rating": "7",
      "text": "Lincoln is best viewed with modest expectations. The performance of Daniel Day Lewis lives up to the hype. It is a great performance in a great career. Unfortunately, the other elements of the film do not rise to that standard and it shows. I'd compare Lincoln to Raging Bull. In that film we have also have a great performance by the lead but also great supporting cast, script, directing and it makes for great film. If DDL had those elements around him I could see a classic film being made, but instead it is a good movie, a high three."
    },
    {
      "rating": "5",
      "text": "The Performance given by Daniel Day is obviously brillant, but it is not enough to save this rear miss by Spielberg, this movie is just mediocre, it should of been called \"the 13th Amendment\" because that is really what this is about, not Lincoln"
    },
    {
      "rating": "8",
      "text": "Three things struck me about this excellent movie. First, at times I thought I was watching a play, not a flick. Lots of set pieces shot on sound stages. 90% dialogue, 10% action. Secondly, I found that dialogue to be self-consciously archaic, sometimes almost Shakespearian in syntax and dialect. (That always makes me wonder how close screenwriters and directors really come to the speech patterns that actually existed back in the day. Since we have no recordings from that era, movie makers must use diaries for clues and examples. That said, I suspect that a) the written word was different from the spoken and b) oratorical speech more different from conversational speech than it is today.)\r Thirdly, I thought Speilberg's tone to be a bit didactic, as if he wanted to educate all of us on the mechanics of what it took Abe to get the 13th amendment passed. I found this to be neither good nor bad, just noticeable."
    },
    {
      "rating": "8",
      "text": "Spielberg & Tony Kushner managed to to transfer us into the mind of Lincoln giving us a historical thriller that will soon become a \"Classic\".The film has the two \"battlefields\" of war and politics that keep us on the edge of our seats.As it goes for Daniel Day-Lewis(Lincoln) I have only one word: \"Breathtaking\"."
    },
    {
      "rating": "9",
      "text": "First rate look at the personal side of real people written about so much as \"legend\" that you forget.  Is Rex Reed serious about this being a \"bore\"?  When is he going to retire and stop boring us?"
    },
    {
      "rating": "9",
      "text": "The latest from Spielberg examines the great president's last 4 months, when he struggled to pass the 13th Amendment to end slavery. Tony Kushner (\"Angels in America\") wrote the screenplay, so it's wordy and eloquent. In the title role, Daniel Day Lewis is simply amazing: creating a character who's not only imposing, but wise and down-to-earth. Sally Field and Tommy Lee Jones also turn in great performances and the entire cast is outstanding. Visually, it's attractive and full of period eloquence. Don't expect this to be a big hit, the seriousness of the subject and constant conversation renders it too inaccessible. It is a solid history lesson in a beautifully made and intelligent package."
    },
    {
      "rating": "8",
      "text": "If you are looking for action pass this by.  The movie is like watching a chess game.  Slow thinking, planning and timing"
    },
    {
      "rating": "9",
      "text": "I was enthralled from the start.\rhttp://scriptsmotion.wordpress.com/2012/11/09/lincoln/\r While it isn"
    },
    {
      "rating": "10",
      "text": "they might as well give day-lewis the oscar now. he outdoes even himself here. a truly lived-in character right from the start. and kushner's script is unbelievable. bravo"
    },
    {
      "rating": "8",
      "text": ""
    },
    {
      "rating": "10",
      "text": "Lincoln is one of the greatest biopics of all time.Steven spielberg has done an incredible job.this movie is grand.the cinematography is amazing.All the performances are astonishing.daniel day lewis delivers the performance of a lifetime."
    },
    {
      "rating": "10",
      "text": "A joyous bundle of history and excellence. The movie plays out in a slow and slightly reserved fashion, rewarding those who pay close attention to the details of the well-versed dialogue. The acting on all fronts in spectacular, and it not only paints a detailed and acute description of one of the most important pieces of American history, but does well in honoring the great United States President and showing you a great depiction of his life and those around him. By the end, you'll feel your own sense of emotional accomplishment and maybe even feel smarter. Overall, a glorious film, and my personal movie of the year."
    },
    {
      "rating": "8",
      "text": "This is a really solid movie.  The acting is superb, the story is interesting, and the writing is good.  However, it felt oddly short.  There were all these interesting characters, but not enough time to develop any of them completely.  It felt like it should have been a TV miniseries.  One other thing really stood out to me for some reason.  I'm not one to let profanity affect how much I like a movie (The Wire is one of my favorite TV shows), but this had more profanity than I would have expected from a movie set in the 1800s.  Even Lincoln said \"sh*t\" at one point.  It just really caught me off guard.  Other than that, this is a great movie that tells the story of Lincoln as you've probably never heard it told."
    },
    {
      "rating": "10",
      "text": "A wonderful movie, it tells the part of the story that wasn't told- the struggles Lincoln had to deal with in his fight versus the Democrats and even within his own party.  It's a compelling drama, in the spirit of \"The King's Speech\" after watching this movie I admired Lincoln, and wished I had been around to hear one of his \"stories\""
    },
    {
      "rating": "10",
      "text": "I can understand why on the surface alot of people may have found this movie to be boring. But when you give it a chance and look and enjoy the performances of all the leads , I found it anything but boring. Daniel Day Lewis is incredible and James Spader was surprisingly good too. I think it was a great choice not to include any real action sequences in the movie , as I feel they would have felt completely out of place and fo4ced in a movie like this. Overall I was glued from start to finish. Wonderful stuff."
    },
    {
      "rating": "10",
      "text": "My girlfriend fell asleep during this movie, but I sure didn't. It is dialogue heavy which I'm sure everybody has heard. The screenplay is excellent though, allowing for moments of subtlety where other movies would be afraid to bore the audience. The acting accompanying the screenplay works perfectly as every character seemed to be cast perfectly to suite their role. Great supporting roles in this movie go even further than Tommy Lee Jones and Sally Field. James Spader is a surprisingly hilarious addition to the cast and Joseph Gordon-Levitt brought added drama to the film. See it if you are slightly educated in Civil War history, and can enjoy a well-written film."
    },
    {
      "rating": "9",
      "text": "Interesting movie.  It prompted me to read Ms. Goodwin's book.   There were several actors that I absolutely  loved seeing and they all did an amazing job."
    },
    {
      "rating": "3",
      "text": "Lets get this Bill passed.. find someone to help pass this bill... hey bill will you help me pass this Bill.. wow what a waste of talent. actors were superb sets and direction was excellent. but give me a break the story should have focused much more on personal relationships and how without that bill there lives being affected by it. that would have made a more powerful movie..."
    },
    {
      "rating": "2",
      "text": "Couldn't watch it all it was so dull. Ridiculous facial prosthetics. Watch \"Boy with a bike\" instead. This is not, as had expected, a biopic, it just focuses on one small piece of legistlation that they're trying to pass. An episode of the West Wing is more entertaining. DDL is good but the rest of the film ducks sonkey sicks."
    },
    {
      "rating": "3",
      "text": "Yawn!!  I can certainly appreciate the artistic talents of the writers and the actors, but when I go to see a movie, I want to be entertained. If I wanted to learn the intricate details of how Lincoln was able to pass the 13th amendment, then I'd watch a documentary.  This movie stretched on for two and a half hours of mostly boring dialog.  Yeah, I can appreciate the acting, but this was not what I was expecting.  Very disappointing."
    },
    {
      "rating": "3",
      "text": "This movie was like watching C-SPAN from the 1800's.  It is EXTREMELY slow and stuffy.  Some of the vocabulary is like listening to Shakespeare, you kind of understand what they are saying but it still would be helpful to have a translator to make sure you know what is going on.   Abraham Lincoln and his rambling stories....... I wanted to shoot him myself by the end of the movie.  He is like that uncle that tells you a 15 minute story that has nothing to do with anything.  All that being said, there is great acting and I can see where it would be critically acclaimed.  If you are looking for a true look at politics in the 19th century, this movie is for you, but if you want action or anything resembling entertainment, pick a different movie."
    },
    {
      "rating": "10",
      "text": "Oh, this is beautiful film-making. Spielberg takes you on a ride inside Lincoln's mind and his intimate conflicts, in such a pretty and touching way...\rDDL is outstanding once again, and this will be seriously a big contender to the award season. I bet ."
    },
    {
      "rating": "4",
      "text": "I must be in the minority, but I was very disappointed with \"Lincoln\".  I really enjoy history and biography, had read Goodwin's book and had heard almost unanimous praise for the movie.  However, I thought the film was tedious, the script very stilted, and the acting rather mundane.  If this had been a movie without the hype, the well known cast and director, and the subject, I am sure more of the critics would have panned it.  I kept looking at my watch and wondering when it was going to show all the great things that had been written about it.  A real disappointment."
    },
    {
      "rating": "8",
      "text": "Who is this R. Kurt Osenlund of Slant Magazine that writes, \"Steven Spielberg's LINCOLN film may further the heroism so associated with its subject, and favor a liberal viewpoint that leers down at the Confederates, but it's no bleeding-heart glamorization.\" ?  Who says conservatives were in favor of the Confederates? Lincoln was a conservative Republican, and most of the Confederates were Southern Democrats. People don't seem to realize that it's Republicans who were and still are the true \"liberals\": those in favor of liberty, freedom, and self-determinism (the right to life, liberty, and the pursuit of happiness) for all people. The movie is good, though. Just ignore Slant Magazine."
    },
    {
      "rating": "7",
      "text": "The movie is saved by outstanding performances by the supporting cast, including some moments of humor by James Spader.  It's a good movie, but not the type of historical account that you'll return to like you would Schindler's List.  DDL is, of course, excellent, but the movie as a whole is essentially solid work."
    },
    {
      "rating": "7",
      "text": "Lincoln will likely appeal to political junkies above all others thanks to its complex and in-depth examination of the painstaking process of passing legislation through a gridlocked congress-which has eerie parallels to our current political climate.  But the remainder of viewers will have to be satisfied with an expertly crafted, albeit somewhat creaky, historical drama fueled by a career capping turn from Daniel Day-Lewis and an excellent supporting performance from Tommy Lee Jones."
    },
    {
      "rating": "6",
      "text": "When the lights came up after Spielberg's Lincoln the packed audience began exiting in an overly courteous and orderly manner. It was eerie. It felt like we were playing a formally dressed audience leaving an opera house after a beautiful ceremony. But it wasn't until I was walking up to my car that I remembered we had come for a movie. I remembered being excited about the movie. I remember 30 minutes of horrendous previews. I remember the opening credits and the low murmurings of the Chicago Symphony's brass section improvising Aaron Copland riffs. I remember Abraham Lincoln telling me to relax ... relax ... count backwards from ten ... then the feeling that I'm floating somewhere above the mid 19th Century. James Spader floats by eating crabs, and then David Strathairn in a Chinese robe. In the parking lot I have a faint feeling that I had just enjoyed myself. I think I ate a piece of hard candy"
    },
    {
      "rating": "7",
      "text": "A drama movie laden with history and political theater. The pacing starts off a little slow but picks up nicely at the end. I will admit it was hard to understand all the references at times but the movie does a great job of keeping you engrossed in the time period. I highly suggest you read about the history of the 13th amendment to understand the film better as I think you'll get more enjoyment from it. I will watch this again for sure. Turned out to be pretty powerful."
    },
    {
      "rating": "8",
      "text": "A superb movie with great acting by Daniel Day Lewis, this is a movie worth seeing. Even though at times the dialogue is pretty heavy, and seems to go on and on, the story is well told, and it's a movie you wouldn't be disappointed with."
    },
    {
      "rating": "10",
      "text": "Steven Spielberg's movie made a huge impression in theators. With a blazing $85,846. The movie has such a great cast. This is what a biography film should be like."
    },
    {
      "rating": "8",
      "text": "Day-Lewis proves once again he is the best actor of his generation. Spielberg's touch and mastery are all over the film, yet a bit hard to follow at time with the onslaught of new characters and dialogue. Overall, a wonderful movie experience."
    },
    {
      "rating": "10",
      "text": "Honestly one of the best movies I have seen in a long time! Spielberg did a wonderful job on this piece. The acting and the costumes to the filming locations were perfect. The chemistry between Daniel Day Lewis and Sally Fields was epic. A must see!!"
    },
    {
      "rating": "10",
      "text": "I braced for a poor historical account with over-direction from Spielberg and over-acting by Daniel Day-Lewis. Spielberg masterfully manages Tony Kushner's dialogue-heavy script in a thrilling way I have not seen since \"All the President's Men.\" Kushner could have been preachy or melodramatic; his script is riveting. Best of all, Daniel Day-Lewis inhabits Lincoln the way Daniel Craig fits into a James Bond tux. This film is dazzling - a wonderful theater-going experience. Congrats to everyone involved with this production."
    },
    {
      "rating": "9",
      "text": "I like the movie. Maybe, because I am  too spoiled with action movies, this one seems slow, almost like a reading book. I found the structure to be interesting, - arguments over a passing 13 amendment has almost took entire movie, building the culmination bust in the end.  The characters were deep and passionate. Overall good movie."
    },
    {
      "rating": "8",
      "text": "Very, very well made, and great acting. Great movie. At some times, can seem melodramatic, but all in all, it's a great film. Daniel Day Lewis delivers Lincoln expertly."
    },
    {
      "rating": "9",
      "text": "On some level I can relate to comments about the slow pace of the movie, especially in the beginning. I agree that the pace was slower than I expected, but it was not too slow. It was perhaps the appropriate pace to gather in the facets that were needed to relate the urgency and polarization of that time. There are plenty of scenes to make the blood race, not because of battles or other action sequences, but because of the opposing views that were being spewed out with such venom. To see a president in the midst of such turmoil, apart from the battlefields of which we have all seen and read plenty of documentaries and dramatizations, was riveting. On this side of the historical time line, we can look back, knowing that the 13th Amendment was passed. Yet this movie was able to take me to a place where I experienced how impossible it seemed then, and to experience the relief, even more than triumph, that the feat was accomplished. The film's deft script and inspired acting showed what a delicate tightrope the President had to walk to make this happen and how very close it came to failing. Then the war would have ended, and the states remain united, but the slavery issue would have remained unresolved.\rThat Daniel Day-Lewis took the time needed to wait on the \"voice\" of Lincoln to grow within him and come forth from him with such an impact of authenticity is one of the things that moved and impressed me the most about LINCOLN. David Strathaim and Sally Field also gave powerful and eloquent performances, as well as several others, but my favorite supporting actor was Tommy Lee Jones. His Thaddeus Stevens lumbered about with a pronounced limp from a childhood bout with polio, providing a much needed counter-point to the congressional members who venomously opposed the passing of the 13th Amendment. Their loud, jeering racial put-downs sound shocking today but are revealed to have been perceived as reasonable and accepted to many in the North at that time. Jones'  delivery of Stevens' rejoinders helped to balance out the harshness of the prejudices of that time, giving us some space to laugh with him at their narrow-minded stupidity. At the same time it is sobering to think Stevens\" views would have been considered the radical ones to many of that day.\rI highly recommend this film as an opportunity to connect with a moment in history and experience the people and happenings of that time come to life. I have not seen a film that has done this better."
    },
    {
      "rating": "10",
      "text": "Lincoln is an extraordinary picture that takes us into the world of politics as we have never seen it before, and Spielberg shows that he still is one of the greatest directors in the history of cinema, and that Daniel Day-Lewis is one of the finest actors of all-time.  Steven Spielberg has always been my favorite director, his films such as Schindler's List and E.T. The Extra-Terrestrial are one of the main reasons that I fell in love with movies in the first place.  He has been planning to make this movie for a very long time, and now that it"
    },
    {
      "rating": "10",
      "text": "When you leave cinema after seeing this film you will be inspired by it. Yes it's that good. Now you probably want me to explain that. Firstly \"Lincoln\" was directed by Steven Spielberg. Whit that said you know what to expect, and he's not the only great name among the cast. It features Daniel Day-Lewis as Lincoln, Tommy Lee Jones, Joseph Gordon-Levitt  James Spader, and many more. The list is just full of experts. Script is well written, acting is top notch, and every scene fits perfectly.  I especially love speeches in this movie. They are well written and define personalities of characters. The thing i loved the most is Lincoln himself. In this film he's shown as a real person with problems and emotions, and they did tat brilliantly. Some people think that \"Lincoln\" is too slow. And maybe some scenes are dragged out a little, but they should be. Every word and shot in this film matters. It defines characters and it's important for plot. It's a political movie so some people might be bored. You'll need too bi in the mood for watching this film. With all that sad I cant find single objective fault, well i think i saw a bald cap on Tommy Lee Jones in one scene but i'm not even shore. If you like history, drama, politics or fun you will like \"Lincoln\""
    },
    {
      "rating": "5",
      "text": "The big problem with Lincoln is that it's a performance, and not a movie. Daniel Day Lewis is excellent, as always, and looks and sounds just like the man himself, but the film is self-indulgent and pays attention too heavily to Lincoln's abolishing slavery, when there were many more interesting times in this man's life. Sally Field is wasted, in my opinion, having less than 15 minutes of screen-time. Tommy Lee Jones is great, but he too isn't given enough time to have an interesting story. I wanted to like this film more than I did."
    },
    {
      "rating": "6",
      "text": "Director/producer Steven Steilberg has great movies made everyday .  his project on Lincoln is okay i guess\rHistory is okay but its gets me tired . Stielbergs films are great but this one way 60 % enjoyable . Grade B"
    },
    {
      "rating": "0",
      "text": "Not being American and familiar with the story I found this incomprehensible. It does not even seem to be a particularly momentus time in history. Its not as if the Americans were the first to ban slavery !!"
    }
  ],
  "recommendations": [
    "darkest_hour",
    "the_theory_of_everything",
    "the_assassination_of_jesse_james_by_the_coward_robert_ford",
    "the_last_of_the_mohicans",
    "the_post",
    "the_professor_and_the_madman",
    "steve_jobs",
    "rush",
    "american_hustle",
    "catch_me_if_you_can",
    "a_beautiful_mind",
    "the_social_network",
    "cinderella_man",
    "raging_bull",
    "invictus",
    "amadeus",
    "magnolia",
    "alexander",
    "the_devil_all_the_time",
    "the_aviator",
    "american_gangster",
    "spotlight",
    "wall_street",
    "whiplash",
    "kingdom_of_heaven"
  ]
}