{"id": 2394, "title": "Lion", "starring": ["Dev Patel", "Rooney Mara"], "runtime": 118, "genre": ["Drama"], "description": "A five-year-old Indian boy gets lost on the streets of Calcutta, thousands of kilometers from home. He survives many challenges before being adopted by a couple in Australia; 25 years later, he sets out to find his lost family.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/iBGRbLvg6kVc7wbS8wDdVHq6otm.jpg", "categories": {"plot": 7.741379310344827, "acting": 7.851851851851852, "ending": 8.454545454545455, "soundtrack": 9.0, "cinematography": 7.888888888888889, "familyFriendly": 6.0, "funny": 8.0, "action": 7.6}, "reviews": [{"rating": "8", "text": "This film actually managed to exceed my expectations quite a bit! The trailers made it look a bit too much like a made-for TV film, but this actually proved to be so much more! It was an incredibly heartfelt true story, consisted of great and memorable performances, especially from Dev Patel who's never been better or more inspirational, and was just all-around a well-made and compelling film! My only minor dissenting bit of criticism is that the film's emotional grasp let go of me right before the credits with a brief advertisement of helping endangered and lost children in India. I'm not saying I hated this at all, as it was very admirable. It just kind of took me out of my emotional investment of the film during the very final moments which sort of bothered me. Nonetheless, this was still an incredibly inspirational, well-acted, and depicted true story brought to life!"}, {"rating": "7", "text": "Going into an 'Oscar baity' film during the Oscars winter season is always an experiment: is this going to be one that will allow you to fully immerse yourself into the fibre of the story or will you be severely frustrated by all the teary closeups followed by the string score?Lion, for better of for worse, does both. The first half of the film is absolutely splendid. Raw, poignant, emotional. It has it all. A fabulous lead actor in the young Sunny Pawar and a heart-wrenching story to go with him. Things go a bit wonky once the film shifts time and place to Australia. While Dev Patel is splendid here, after Sunny's performance, it is difficult for him to live up to what has been presented. Rooney Mara is excellent, albeit rather tangential (potentially, actually unnecessary as a character). And that is where the problems lie. That strained relationship they have is just not meshing well. It does not progress the story anywhere. There are glimmers of hope in that Australian section, though. The dinner scene when Patel's character has a fit and Nicole Kidman, playing his adoptive mother, has one of the most expressive 30 second performances seen in a long time. Her \"big scene\" is also quite good but was too much of a tear-jerker moment for my taste. From the technical side - the cinematography is excellent (again, especially in the first part of the film), and the original score is mesmerising and gives a wholly new dimension to the film. The bottom line is that this film is all well-intentioned, and that is the problem probably with it. It veers on the edge of being fully committed to the story and characters, but then kind of drifts away to be \"a film\". Basically, it is overly obvious and cliche at times. And I bet that the real-life story was not a cliche at all. The film just does not fully realise itself as an excellent one. A good film, definitely. A very good film, surely. But not an excellent one."}, {"rating": "8", "text": "Going into watching Lion, I expected a cliched feel good film. I expected it to be overly manipulative and, while a solid film, nothing particularly special. My expectations were misguided, however. A powerful, spiritual, and lyrical journey to find one's own identity, Lion is a film that snuck up on me, but left me in absolute ruins. The power of this film is not to be understated as Lion is a film that never ceases to be powerful and emotionally impactful. It discards the cliches, develops characters, and is a film whose emotional power is well earned and never manipulative. For a feature-length debut for director Garth Davis, Lion is a film with incredible strength, gravitas, and a film that is a full-fledged drama that shows the potential of feel-good cinema.Refusing to be bottled into cliches, Lion is a film that finds power from the very beginning. Set in India, young Saroo (Sunny Pawar) is lost on a train and winds up 1,600 KM away from home. Home, a very small place in rural India, is the polar opposite in terms of language and build than Calcutta, which is where he winds up. Dodging child traffickers and abuse left and right, this sequence not only highlights Saroo's journey, but the journey of other children. As the epilogue describes, 80,000 Indian children go missing each year. This journey to Calcutta experienced by Saroo highlights the abominable conditions of homeless children in India. Heartbreakingly enough, there are a large number of them he encounters who are rounded up by nefarious characters. Even in the orphanage, the treatment is horrendous. However, Saroo's life is changed when he is adopted by John (David Menham) and Sue (Nicole Kidman). An Australian couple, Sue had a vision that she would adopt an Indian child and, sure enough, she turned her vision into a reality with Saroo. In his portrayal of Saroo, Sunny Pawar is brilliant. Obviously, he is adorable. But, he never seems to be acting. This feels like his life and one that he is familiar with, even subconsciously. Pawar cannot be older than five or so, but he is phenomenal in this film and gives a natural performance for a film that demands one. His confusion and authenticity lends the film considerable gravity, but so does the introduction of his adoptive brother Mantosh. Adopted by John and Sue a year after Saroo, Mantosh is broken. Whatever happened to him and whatever he saw has left him shattered internally, constantly hitting himself when he is upset. Though this is a film about Saroo finding his birth parents, weight is given to Mantosh's role in the film. Highlighting just how lucky Saroo was to escape his circumstances unscathed, Mantosh is a sobering adult. He stays away from his parents and Saroo because he knows how bad he is, which is heartbreaking. Divian Ladwa is brilliant in this relatively small role and makes the most of this broken man. The film, after initially showing Saroo getting used to life in Australia, jumps ahead to Saroo as an adult (Dev Patel). Dating Lucy (Rooney Mara), the duo \"meet cute\", but that is not hard when Rooney Mara is in the film. Together, Patel and Mara have insatiable chemistry and the two work terrifically well together. Rising above the classic cliche of leaving Lucy as just Saroo's girlfriend with no grit of her own, Lion ensures that it is clear Lucy has a life of her own. She has her own emotions, passions, and interests. Suddenly, however, these diverge when Saroo becomes obsessed with finding his birth parents. Though perhaps going on for too long, Saroo's descent into anger, resentment, and panic as he searches fervently on Google Earth for any clue as to where his family could be. He resents himself for not finding them sooner and can only imagine the pain and anguish felt by his mother. The film is incredibly somber in these moments, punctuated by the score by Hauschka and Dustin O'Halloran. Nominated for Best Original Score, the score may be a bit too noticeable at times, but it is brilliantly orchestrated in spite of that concern.However, the moment we are all waiting for is Saroo finding his birth mother. The moment is chilling. It is one of the most powerful scenes put in a film all year. Yes, it is manipulative. Yes, it is sentimental. But dammit, I almost cried. I had to fight back the tears to be able to still watch. The look on his mother's face, the embrace, her hand running through his hair and on his face, the little peck on the forehead Saroo gives her, UGH. I was in ruins. There is no way to deny this film's power in this moment. It may be manipulative and something out of Extreme Makeover: Home Edition after Ty Pennington shouts, \"Move. That. Bus!\", but man is it ever effective. It is a sequence that has anticipation, power, and one where director Garth Davis steps back and allows us to feel the full power of the moment. Yet, he is not done making my eyes wage war on the tears."}, {"rating": "7", "text": "The critic score for this movie is spot on. The strongest section of this movie is our following Sunny Pawar, heavy subject matter, layered, detailed and these scenes have drive behind them. Not that the second half was poor, but it lacked depth. The pace picked up quickly and the feel to this side was thin. Rooney Mara's character felt as if she was just in the movie because she is in the real world life of Saroo. And you can only stretch Google Earth so far in movie format. My last quibble with the movie is the cinematography. With the locales and places depicted in the film there were so many chances for the cinematography to shine, for the watcher to be awed by the diversity shown on the screen and the beauty of these places. I was left wanting. It was serviceable but not a wowing experience. That being said, this is a feel-good movie and it accomplishes this in spades, both with young and old Saroo. It accomplishes what it set out to do in the end, with a few hiccups along the way."}, {"rating": "9", "text": "This is a really incredible story, I'm a little surprised to see kind of mediocre critic reviews.   I put it on Netflix, planning to semi-watch while I was working, instead I was drawn into the movie and stared at the TV the whole time.  I thought it was really great, I love really moving true stories like this.  I kept thinking about it long after."}, {"rating": "7", "text": "Very moving film that made me get emotional like very few in the last couple of years. The story is important and once again (after Slumdog) it gives us an idea of how it is like to belong to the poor clash in India. That first part of the film lasts almost until the middle, which is how it should be order to make the viewer be able to put themselves in the position if these children, at least have an idea. Then we get to know the family and many things that come with adoption. As expected Nicole Kidman nails it as the new mother. But especial kudos to the leading actor, who has the charisma to carry any film in my opinion. All the cast is great and you´ll be involved with the story no doubt. I don´t give it more than a 7 because somehow the film is not new and doesn´t have the creativity and art something like Moonlight posesses for example. But everything is on point, cinematography and all. Must see. Important story, a reflection of millions."}, {"rating": "7", "text": ".  The best way to describe it is that it’s an extraordinary true story of a lost child in India, who, after being adopted by Australian parents, yearns to learn where he came from.  He remembers that he fell asleep on a train after being separated from his brother, however, the place where he came from doesn’t exist, according to everyone who he talks to and he searches heavily to find his way home.  My description hasn’t really done the story justice, but I didn’t want to go into too much detail since I think it’s best to go in an experience it yourself.  The film has an extraordinary first half which feels really organic and really gives the story what it deserves.  The second half doesn’t quite match up to that and becomes very ‘Oscar baity’ for a lack of a better term.  It does feel like Dev Patel and Nicole Kidman are aiming for those Oscar nominations.  They are very good performances and I don’t object to them getting an Oscar nomination, but you know those performances, where you can feel it’s the award season.  It’s a very good story and if you don’t want to see the film or the trailer doesn’t appeal to you I would recommend picking up the book, written by the actual person who the film is based on which tells of his story, however, I will not give away the title for this book, since just looking up the title, actually gives away the films ending.  I liked Lion, but I think it could have been better.  I would say give it a chance, I suspect I am being just a bit too critical of it."}, {"rating": "9", "text": "What a fantastic film! A truly uplifting and feel good movie. A very emotional and tear jerker as well. The music was also superb and it hit all the right notes. Dev Patel was fantastic as usual along with Rooney Mara. You really get behind this boys story and try to guide him through."}, {"rating": "8", "text": "A definite crowd-pleaser, and slight tearjerker, Lion tugs at the heartstrings with its wonderful story, brought to life by an exceptional cast and beautiful score, both of which help drown out the film's small issues and somewhat painstaking second half."}, {"rating": "9", "text": "Lion is based on the brutal true story of a young boy who got lost away from his family and home in India. The casting and performances were perfect, as they both stay faithful to the true story and make you feel for the characters. As the story unfolds it tells a lot of important messages about family, life, and identity that make this a truly special film everyone should see."}, {"rating": "7", "text": "The true story behind Lion is a very nice tale, and I thank this movie for making me aware of it. Unfortunately I have to say that as a movie I'm not too impressed with Lion. The pacing of the film I think is its main problem, because you can't get too emotionally invested in the characters before you are making a jump to another thing. The first part of the movie as a child is actually much better at this, but the second half feels a little incomplete. Perhaps with a few more minutes added the pacing may have been improved, but as it is I didn't connect to deeply with the plot or the characters, nor it let me appreciate the quality of their acting. Nevertheless, the movie does have good points, as I said the story is very nice tale, and Dev Patel sells it nicely enough. In conclusion, Lion is a solid movie that tells you a \"feel good\" story, but it loses itself in parts with its meh pacing. Recommended only if you enjoy the type of story. Final Verdict: 6.7"}, {"rating": "0", "text": "Je ne sais pas si toutes les \"histoires vraies\" méritent d'être traitées au cinéma, aussi incroyables puissent-elles paraître... Mais cela plaira certainement à la ménagère (internationale) de moins de 50 ans ainsi qu'aux mamies du monde entier : c'est plein de gentille guimauve du début à la fin.Personnellement, le miséreux adopté qui retrouve sa môman d'origine 25 ans plus tard, je suis content pour lui mais j'abhorre ce film tarte à se mettre des claques, d'une mièvrerie sans borne et d'une niaiserie de très mauvaise qualité qui plus est ! la preuve en est que c'est tellement dilué qu'on s'en tape carrément et en force  (pour rester poli bien entendu).A part ça, c'est le premier film sponsorisé entièrement par Gogole Eursse, ce qui met très mal à l'aise, lorsqu'on sait les agissements de la multi-nationale du Mal et du Malin, le Big Brother numérique omniscient et omnipotent que nous nous devons de conchier tous ensemble !Et puis de toute façon, ne mangez pas cette saloperie, Lion ça colle aux dents et c'est un complot des dentistes."}, {"rating": "9", "text": "More than excellent. The true story of an Indian 5 years old kid who carries stones with his older son to make living and help their single mom. A piece of sweets he couldn't buy remains in his memory for 25 years and was instigator in his search of origin. Saroo the kid was lost in a long journey while sleeping in a train waiting for his older son. He was moved to Australia where a family adopted him with another disturbed Indian kid. Saroo grew up in Australia with home and roots deep in mind, till the inescapable decision of searching where he did come from. Tedious search in Google maps for three years allowed him to know where he did come from to go back to his mother and young sister and to discover that his older son died in a train accident. Gripping acting from young Sunny Pawar (Saroo), his looks, his runs, his sleeps in nowhere. Attractive acting from Dev Patel (adult Saroo), and from Nicole Kidman the adoptive mother, and David Wenham the adoptive father who faced with courage the will of Saroo to search for his family and origin. Nothing is wrong in this movie. Music, scenario, photography, directing, no single minute is nonsense. I didn't see such an attracting meaningful movie for long. Heartbreaking about our true life when we are entrenched in small occupations while others are loosing the meaning of life and strive to find it. Chapeau for everyone in this masterpiece."}, {"rating": "9", "text": "Powerful, heartfelt, and touching. Lion is everything you would expect from a crowd pleasing tearjerker, and more. If ever there was one, Lion would be the most beautifully manipulative film of the year. In this case, it is so competently directed and eloquently written, the sheer power of the performances blow you away, with tears rushing down your face. See It for Sunny Pawar,,,,,see it for Sunny Pawar!"}, {"rating": "9", "text": "Lion is the based on the amazing true story of five year old Saroo who gets lost on the streets of Calcutta, thousands of miles from home. That’s all I’m saying about the story, the less you know the better. Dev Patel is terrific as Saroo but the standout performance is from Sunny Pawar as the young Saroo. As far as child actors go he was brilliant. The level of emotion in this one movie is incredible. Sure it’s a crowd pleaser but it’s also a gut wrenching powerful story accompanied by a beautiful soundtrack. Highly recommended."}, {"rating": "9", "text": "Garth Davis uses close-ups sparingly and hits no false notes; cinematographer Greig Fraser creates a child's perspective by setting the camera at the hero's eye level and conveys the grandeur of India through sweeping panoramic and overhead shots."}, {"rating": "9", "text": "Kidman grabs the central focus of the story as the more distraught of the two. The performance is riveting because she essentially plays the entire film at two levels, the surface everyday life and then what is turning over and over again in her mind."}, {"rating": "10", "text": "Powerful, heartfelt, and touching. Lion is everything you would expect from a crowd pleasing tearjerker, and more. If ever there was one, Lion would be the most beautifully manipulative film of the year."}, {"rating": "10", "text": "A heart rendering drama that will have all but the most cynical stifling sobs for at least half of its running time. This is a powerful and surprising story that is acted to perfection by Dev Patel and Nicole Kidman. Music and cinematography are great enhancers of the overall impact. On the face of it this felt like it would be just another routine drama, when in actuality it is the most surprising find of the year in cinema. A stunning must see."}, {"rating": "10", "text": "I loved this film from beginning to end.  It was a total eye-opener.  Heartbreaking but redemptive.  Beautifully filmed with a moving and powerful, yet simple score.  All the acting was authentic and engrossing. Impossible to fault. The end credits only added to the tremendous emotional impact of the story."}, {"rating": "10", "text": "A great adaptation of a true story. The movie is compelling from the opening scene to the final end credit. This movie has everything for the rollercoaster of emotions it generates as you travel through the life of a boy lost without hope."}, {"rating": "9", "text": "My vote for best picture of the year. It will go under the radar with the muscle being put behind other films but LION is the most humane, tender, and emotionally moving films of the year. LION is a classic story of a young Indian boy who is tragically separated from his mother only to try and track her down years later, after he is adopted and relocated to Australia. It's the story of one who is trying to reconcile a tragic past with the person he has now become. Somewhat fantastically, but true, he uses Google Earth and his memory to locate his hometown. The ending is expected but packs such an emotional wallop that lingers long after the film has ended. Classic, simple, and powerful this isn't a film to be missed."}, {"rating": "9", "text": "This isn't a film you watch.  This is a film you experience.  Garth Davis' feature-length directorial debut is Metaflix's 2016 best movie of the year."}, {"rating": "10", "text": "\"Lion\" is a complex movie, with its profound themes of home and identity, and its tonally disparate halves. A smartly understated approach to Brierley's story holds it all together."}, {"rating": "10", "text": "Director Gareth Davis has pulled it together for a tale of two countries, two cities and two lives twenty years apart.Such an amazing movie. Good luck Oscar game."}, {"rating": "9", "text": "When Nicole Kidman steps out of the shadows, breaking off from a wall of men, and onto the edge of the stage...her eyes beam undiluted willpower. It is a gaze that both chills and warms, radiating and demanding trust in this singularly self-possessed presence..... Yes, the script makes its concessions to romantic conventions...."}, {"rating": "10", "text": "A sober and yet profoundly stirring contemplation of family, roots, identity and home, which engrosses throughout the course of its two-hour running time."}, {"rating": "10", "text": "Such an amazing movie. Impossible not to be moved by it. Great performances all around, especially from Nicole Kidman and Dev Patel. Sure Oscar contenders."}, {"rating": "9", "text": "In her compelling and subtle performance, Kidman beautifully captures the prickly defensiveness, the lonely dedication, and the suppressed emotional longings of mother."}, {"rating": "8", "text": "“Lion” is a first rate, sentimental, emotional, ‘small’ movie that will move even the coldest hearted person. It is a true story that starts in  1986 when we meet five year old Saroo (Sunny Pawar) and his older brother (Abhishek Bharate) in a poor province of India where their mother (Priyanke Bose) earns what money she can hauling rocks. The boys help by bringing in any money they can earning it in any way they can including stealing coal off trains so they can exchange it for milk. One evening the boys are separated and we see Saroo falling asleep on a decommissioned train finding himself lost and in Calcutta almost a thousand miles away from where he lives.The first part of the film follows young Saroo, as he tries to survive, with director Garth Davis and screenwriter Luke Davies not shying away from those who prey on children. (In the credits at the end it states that 80,000 children in India go missing every year, many to sex traffickers, to this day).Going into the second part of the film it is 20 years later and Saroo, now played by Dev Patel, lives in Tasmania, an island State off Australia, having been adopted by Sue and John Brierly (Nicole Kidman and David Wenham). He goes to Melbourne to study hotel management and meets Lucy (Rooney Mara) from America, they become lovers and at school they meet and become friends with other Indians. It is through these meetings that Saroo develops a need to search for his long lost mother, brother and very young sister who he has never forgotten.To tell any further would mean spoilers and I don’t go there.Up until 1961 the Oscar awards had a special category for any Juvenile performers who gave a strong performance. If the category was still given this year two young actors would fight it out with 8 year old Sunny Pawar playing a 5 year old in “Lion” versus Alex R. Hibburt, a 12 year old, playing 9 year old Chiron.Dev Patel does a superb job as the older Saroo having to show a lot of his feelings with his face instead of talking. Divian Ladwa plays another child adopted by the Brierley’s who isn’t able to adjust to the new life presented to him after being traumatized in his earlier life.David Wenham and Rooney Mara do what they can with what they have to work with while Nicole Kidman has two extended scenes that had many audience members trying to hide their tears!Cinematographer Greig Frasier will certainly be responsible for a big rise in tourism to Tasmania with some of the scenes breath taking as is some of the aerial shots of the mountains and waters in India.This is director Garth Davis’s first feature movie and doesn’t overdo tugging of the heartstrings which the screenplay by Luke Davies is quite effective in just telling the story as it happened.The soundtrack by Dustin O’Halloran and Hausckha is a definite plus.Be sure to stay for the ending credits as it not only explains why the movie is called “Lion” plus pictures of the real people highlighted in the film."}, {"rating": "10", "text": "\"Lion\" |  A  |  After the cold disappointment of shallow, chemistry-free, over-hyped \"LA LA LAND' this brilliant surprise has restored my faith in Hollywood.  This incredible true story is perfectly directed with a slow steady hand and too many layers to describe here.  Kidman, Patel & Pawar deserve Oscar nominations."}, {"rating": "9", "text": "Lion's astounding true story and excellent performances (from Dev Patel and Sunny Pawar especially) elevate it beyond the cliches and the predictability. And then the ending comes, and the film bombards you with feels and emotion (in the good way) and you'll want to cry. See it so you can learn the story, and definitely see it if you want a good cry."}, {"rating": "10", "text": "Extraordinary story told in a very extraordinary way. Dave Patel and Nicole Kidman outstanding. The music beautiful. All in this picture perfect. I really love it"}, {"rating": "9", "text": "Lion leaves a reflexive message to the audience after a surprisingly unforgettable show, full of strong interpretations (especially by Patel) and a breathtaking conclusion."}, {"rating": "9", "text": "Inspiring, heartwarming since the early minutes, the long oddysey of a young wanderer boy looking for his original homestead. Remarkable, tender roles of Nicole Kidman and Dev Patel."}, {"rating": "7", "text": "A little Indian boy (Sunny Pawar) gets separated from his family and ends up far away from home, living on the streets and in orphanage, until he's adopted by a nice couple who take him to Australia. Also starring: Dev Patel as boy as an adult, Nicole Kidman and David Wenham as his new parents, Rooney Mara, Diwian Ladwa. Based on a true story which was turned into book, written by the boy himself, and now a movie.I liked \"Lion\" a lot, for the most part it's gripping and packs a strong emotional punch. But the two-hour story as a whole is uneven, losing steam during its last quarter and – even worse – starting manipulating with the audience in unconvincing way.This big shift doesn't kill the movie but the whole experience would win if adult Saroo's journey was compressed into shorter period of time. As it is, the last quarter is not quite compatible with the previous hour and a half and ends up killing the mood that has been masterfully built up and maintained almost from the start. The adult cast offers impressive performances during that last quarter which is totally worth the awards recognition it has garnered. I am especially glad to see Nicole Kidman and Rooney Mara getting strong, well-written female characters and thus turning in more interesting work as usual for them.But the movie makers could have easily shortened the adult Saroo's detective work part which really bogs the story down and seems to be more of an excuse to show Patel hanging around aimlessly. He'd still have enough screen time for all those stronger acting scenes with the girlfriend and family, or just showing off his fab new looks. Watch out, girls and manlovers, he's turned into quite a heartbreaker indeed, wild hair and strong body, and all...\"The mood that has been masterfully built up and maintained almost from the start\", as mentioned above, is the main reason why \"Lion\" turns out to be such a moving journey. The director uses as little dialogue and talking as possible, concentrating on just showing this lost little boy wandering around – sometimes enhancing the events with not too intrusive music. The environment becomes a character of its own – alien, dirty, sometimes hostile. Watching this little guy just trying to get by, without trying to make him „act“, or remind us to feel something, gives the story a lot of poetic power and unexpected dimension of depth. Sadly they are unable to repeat or resuscitate this feeling later on, although Patel gives an strong performance of his own, as stated above.Interestingly, 2008's \"Slumdog Millionaire\" – Dev Patel's breakthrough hit which also shows the shadow side of India and its childrens' lives – is also a movie of two halves, the first of which excites a lot and the second kind of kills the buzz. So, it's a great movie for the first three quarters and just okay after that.\"Lion\" is one of the frontrunners during this award season, with 60 nominations and 32 wins already under the belt. It's nominated for 6 Oscars: movie, adapted screenplay, supporting actor (Patel) and actress (Kidman), cinematography and music. Was also nominated for four Golden Globes but did not win any."}, {"rating": "9", "text": "The cinematography is really impressive. The subtle colors and variety of shots correspond to each character's emotion and action. The score is stunning as it gives depth to the film and is truly breathtaking."}, {"rating": "10", "text": "Lion is a good movie, and every element of it is good. Not groundbreaking, but good. Good enough. Even the performances which will probably get nominated for Oscars were just good."}, {"rating": "10", "text": "A heart rendering drama that will have all but the most cynical stifling sobs for at least half of its running time. This is a powerful and surprising story that is acted to perfection by Dev Patel and Nicole Kidman."}, {"rating": "6", "text": "The risk-free and strightforward presentation of this moving and miraculous true story yields only a good movie. It'll brighten your day, not change your life."}, {"rating": "10", "text": "Lion was one of my favorite movies of the year. It made me want to travel, cry, write, and live. Dev Patel carries an incredibly vibrant performance of the true story of Saroo Brierley, who was lost as a child and then attempts to find his family in his 20’s. Pair that with grand sweeping landscapes and the incredibly endearing Sunny Pawar, who shines despite the grit of 1980’s slums of India, and it had everything I could have wanted in a hauntingly true film. This movie stuck with me days after leaving the theater and only deepened the lifelong crush I have been harboring on Dev Patel (which started in Slumdog and escalated in The Newsroom). I am in general pretty lukewarm on Nicole Kidman, but this is her at her best, and her maternal interactions seemed authentic without being romanticized. All in all, this was near perfect to me, and somehow managed to avoid landmine clichés that could have cheapened this standout of 2016. 9.7/10"}, {"rating": "10", "text": "Wow, Nicole!　You are amazing. I want you to get second Oscar. Good direct, good scrip, good actors and amazing true story! Lion is a beautifully told, uplifting story of courage and determination."}, {"rating": "6", "text": "Eighty-thousand children go missing each year in India. Saroo Brierley, author of the autobiography, “A Long Way Home,” was one, and he tells about his incredible journey from India to Australia and back again. The result of the adapted indie drama, Lion, is a well-intended attempt which utilizes a “been there, done that” approach to prove how the community can pitch in to help families across the globe.Sure enough, being a depressingly heartwarming weepie, Lion starts on a heartbreaking note. Saroo as an adorable little five-year-old oversleeps and loses his way in a dark train station, separated from his older brother. He hops onto a train and arrives at another station far away, and sees no options available other than to sleep on cardboard with other lost kids. The stay gets cut short though, as several kidnappers force him out. He then comes across new parts of India’s culture he never knew existed beyond his mother’s work as a rock-hauler. A hospitable Hindu couple helps Saroo out until he runs away out of desperation. Soon, with hopes of locating his parents, an orphanage takes him in, where beatings occur daily.Eye-swelling in these first moments are guaranteed while watching a vulnerable little tike lose his innocence before reaching his full development of memory cells. When also considering how everyone in India speaks in their native tongue with English subtitles, an extra step authenticates the true story. However I must admit: the boy cast as Saroo, Sunny Pawar, acts precisely how any young actor would in his first role. Nobody cheers him on because of his talent, but because of his cuteness.A kind Australian couple eventually adopts Saroo, with some English lessons included to help him with the transition. As investing as it all feels, the very next event is, “20 years later.” So did nothing interesting happen within twenty years? This sort of leap in time happens constantly throughout the picture, limiting the story possibilities and minimizing Saroo’s motives of returning to India. So proof exists in why Lion would prefer to tug on your heartstrings over structuring the story to deserve the countless awards it campaigned so hard for.Speaking of awards, my complements go to the Academy Award nominated performances of Nicole Kidman (The Hours, Moulin Rouge!) and Dev Patel (Slumdog Millionaire). Both portrayals standout satisfactorily well, carrying the second half of the film to maintain the audiences’ tears. Although I ought to complain about Kidman’s distractingly obvious wig. Yes, I realize they needed to cast a talented actress, and yes, I understand she needs to look like the real-life counterpart, so why not cast someone whose natural hair looks like the real life counterpart? Or maybe dye Kidman’s hair? Oh, right. They needed an already nominated actress to guarantee a nomination, and she has to still look pretty in her natural silky blonde hair for those expensive interviews and campaigns.Yet like any other Oscar-bait picture, the production crew still put in tremendous effort. Saroo’s growth into manhood blooms to life through various scenic shots meant to highlight memories of home, such as moths illuminated by the sun, or the infinite route of a railroad track. Then as things turn more personal and distanced from youth, the camera pulls in closer to the human face. The minds and hearts of everyone involved were in the right place, even if Lion turns out no different in quality than the summer released indie crowd-pleaser.Clearly, Lion will fall out of the public’s memory after the 2017 Oscars ceremony. But the #LionHeart campaign it started will last much longer. It exists to raise donations to benefit the 80,000 lost children in India, and worldwide. I encourage you to offer them a small donation; even just a little can travel a long ways to make a difference."}, {"rating": "2", "text": "Slow and boring. First half of the movie is spoken all in Indian. Not my cup of tea. I think the lead actor is a great actor. But i just couldn't sit threw this boring film."}, {"rating": "3", "text": "The only tears were tears of excruciating boredom.  Sure, it's a nice true human story that shows cultures many may be unfamiliar with.  Yes it's shot well in exotic and far off locations (from a domestic standpoint) featuring some decent acting.  Who cares when it's this low key and this familiar a story?  Not this viewer for one."}, {"rating": "2", "text": "I dislike having my emotions manipulated in a formulaic and predictable way.For example; boy gets on train, falls asleep, train travels to another city, of course, it had to happen that way. So the adventure in weepiness begins. Could not wait for the credits to roll. Naturally boy, now man, finds birth family and is embraced by all. True story it may be, but spare me the sentimentality and melodrama."}, {"rating": "6", "text": "This is a really good story, but its structure, pacing and editing threw me off constantly throughout. I couldn't completely engage with the film as a result.Nearly an hour of the film is spent on little Saroo, yet ultimately this has no bearing on the film as a whole. The film is about Saroo reconnecting with his biological mom, his culture and his heritage. Yet none of these scenes further that. They're from a different movie about the entire life of Saroo and the tribulations of all Indian orphans which this film clearly is not.I really think this film benefits from a less chronological structure - if his past as a young boy were something he was remembering in pieces in the present. Because ultimately how much of that time does he really remember? It seems unlikely it was all of it since he was so young, so these scenes are really for the benefit of the audience so we spend too much of the film waiting for him to find home because we aren't actively connecting with his past like he is. We already know what happened and the incoming inevitable conclusion.Still, it's a beautiful story and the conclusion is convincingly emotional and touching. Dev Patel and little Sunny Pawar are both pretty great."}, {"rating": "7", "text": "Really moving story with very good acting and beautiful music. Drags a bit in the middle."}, {"rating": "6", "text": "Lion is a touching movie of searching and even more emotive because it’s based on true events. The film is divided in two parts, first the story of Saroo as kid, when he is lost and must face entire India on its own; and second the story of Saroo 25 years later finding his way back home. The evolution of the protagonist appears to be upside down; when he is a kid is forced to face the reality, give up childhood dreams and start living independently but when he is an adult he is lost, he doesn’t know what decisions to make, because of the uncertainty of a home as a reference spot he cannot have stable human relationships. The performances of Dev Patel, Nicole Kidman and Rooney Mara are marvelous, but Sunny Pawar as young Saroo is brilliant. There is conflict between the two parts of the film, seem to have different directors, in the first one the photography and production design are really strong, transmitting you the despair of the protagonist; and in the second one, those two are average, but the script is more intense along with the acting. The score marked the gathering of both sections, with beautiful and moving melodies."}, {"rating": "7", "text": "A fantastically well executed movie, for what is at the end pretty much a lost boy going home story. Plenty of interesting elements throughout the movie make for an engaging, and at times very moving watch, but there seemed to be a central skeleton missing here, something to really make it defining."}], "recommendations": ["the_light_between_oceans", "minari", "call_me_by_your_name", "the_glass_castle", "the_florida_project", "belfast", "the_impossible", "stand_by_me_doraemon_2", "blue_valentine", "carol", "leave_no_trace", "the_age_of_adaline", "the_boy_who_harnessed_the_wind", "a_monster_calls", "nomadland", "the_danish_girl", "only_the_brave", "marriage_story", "gifted", "legends_of_the_fall", "manchester_by_the_sea", "the_bridges_of_madison_county", "the_lost_city_of_z", "the_book_thief", "the_descendants"]}