{
  "id": 4263,
  "title": "Little Nicky",
  "starring": [
    "Adam Sandler",
    "Patricia Arquette"
  ],
  "runtime": 90,
  "genre": [
    "Comedy",
    "Fantasy"
  ],
  "description": "After the lord of darkness decides he will not cede his throne to any of his three sons, the two most powerful of them escape to Earth to create a kingdom for themselves. This action closes the portal filtering sinful souls to Hell and causes Satan to wither away. He must send his most weak but beloved son, Little Nicky, to Earth to return his brothers to Hell.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AudA8gnTWSBWXBHSBHnr3HHUXXM.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 5.5,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.875,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Very very funny in most parts but they spent way to much to make it resulting in bad press making it a box office bomb."
    },
    {
      "rating": "9",
      "text": "Fantastic, this one of my new favorite Sandler movies, it's hilarious constantly throwing hilarious moments at you and the supporting cast is hilarious, Adam Sandler, as in all his other movies, gives an outstanding performance, and is has a sweet love story thrown in, I'm not cool with it's interpretation of hell, but it fits the movies style, this is a must watch for Sandler fans."
    },
    {
      "rating": "10",
      "text": "This movie is funny as hell. Adam Sandler does what he does best which is comedy. I thought this was funnier than any other critic suspected. The critics are always hating on Adam Sandler comedy such as Happy Gilmore and Billy Madison. Those are great comedies. So screw off critics."
    },
    {
      "rating": "10",
      "text": "(At around fifty minutes) When Nicky is talking with the Asian people on the street, you can see in the background \"Tom's Restaurant\", which stood in for \"Monk's Diner\" on Seinfeld (1989)."
    },
    {
      "rating": "10",
      "text": "FUCX THESE CRITICS, This is FUXCING HILARITY !!!!..........................................................................................................."
    },
    {
      "rating": "8",
      "text": "Even that little tribute to Chris Farley really warm my heart and make me smile, no matter how much the imperfect things in the movie, i found Little Nicky as another fun Adam Sandler movie, it's enjoyable, it's entertaining, it's fun."
    },
    {
      "rating": "10",
      "text": "▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪•••••••••••••••••••••••••••••••••••••••••••••••••••••••••"
    },
    {
      "rating": "10",
      "text": "---------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "7",
      "text": "Absolutely crazy and absurd, but that is what makes it so funny. Has all of Sandler's regular casting actors, and some great additions popping up everywhere on the screen."
    },
    {
      "rating": "0",
      "text": "Souless, dumb and disturbing, Little Nicky is a movie that I can't even stand. Adam Sandler is funny, but not even in this movie. Seriously, who accepted the idea of this movie?"
    },
    {
      "rating": "3",
      "text": "A mess of a film that revels in its own stupidity. Its unfunny and rather nauseating. The few gags it does have cant save it from banality. Rubbish."
    },
    {
      "rating": "6",
      "text": "One of Adam Sandler's most enterprising projects to date, 'Little Nicky' tells the story of the son of the devil trying to strike a balance between heaven and hell and saving Earth in the process. Although not as funny as some of Sandler's early work i.e. 'Happy Gilmore' and/or 'Billy Madison' this film is still light years ahead of some of Adam's more recent movies like 'Jack and Jill'. Whats more is that you don't even have to be a true metalhead to \"get\" some of the references but it is much more appreciated if you are a fan of the genre. Supporting cast are so-so."
    },
    {
      "rating": "1",
      "text": "I think it's a sign when the funniest part of your movie is a dog snoring that you've gone wrong somewhere. However this film does have one saving grace, in that it is only the second worst film with little as it's first word (being marginally better than little man)."
    },
    {
      "rating": "1",
      "text": "It's movie hell, in more ways than one."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"
    },
    {
      "rating": "10",
      "text": "this is my favorite sandler movie. It is entertaining but if you are one of those people who study a movie instead of watch a movie then you probably wont like it because the things that this movie is about might be pretty dumb but they are still hillarious."
    },
    {
      "rating": "10",
      "text": "The movie...how can i put it...rocks. Defintely the best Sandler movie i have seen. The quick humour and one liners are what makes the movie so spectacular. So if you haven't seen it then what the hell you waiting for? your missing out on a part of life!"
    },
    {
      "rating": "10",
      "text": "How can you not like this movie. it rocks great soundtrack average acting and great comedy."
    },
    {
      "rating": "1",
      "text": "Like The Waterboy just two years earlier, Sandler creates one of the most annoying characters in comedy history!  This time it's a demon from hell.  Sandler... you can do better."
    },
    {
      "rating": "6",
      "text": "Different kind of role for Adam Sandler. He played it to perfection. He is the devil's son who doesn't even want him. His mother is an angel in heaven."
    },
    {
      "rating": "10",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡¡••¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "6",
      "text": "Even though Little Nicky had my favorite director Quentin Tarantino in it, it doesn't make me say it's the only thing that disappoints me about this movie."
    }
  ]
}