{
  "id": 1150,
  "title": "Little Women",
  "starring": [
    "Saoirse Ronan",
    "Florence Pugh"
  ],
  "runtime": 135,
  "genre": [
    "Drama",
    "Romance",
    "History"
  ],
  "description": "Four sisters come of age in America in the aftermath of the Civil War.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yn5ihODtZ7ofn8pDYfxCmxh8AXI.jpg",
  "categories": {
    "plot": 9.6,
    "acting": 9.5,
    "ending": 10.0,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 5.0,
    "funny": 9.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "When judgment day comes, and mankind is evaluated on the merits of its spiritual and cultural achievements, this film alone will redeem the infinite inequities of humanity. It will usher us to paradise."
    },
    {
      "rating": "0",
      "text": "So boring! Lost interest was just waiting for it to end! There were people yawning and falling asleep in theater! Huge waste of time !"
    },
    {
      "rating": "5",
      "text": "Not my favourite film................................................................"
    },
    {
      "rating": "8",
      "text": "This film was one of my childhood and really reminded me of the value of family, and to follow your dreams."
    },
    {
      "rating": "9",
      "text": "Other than this version, the only other version I have seen of the beautiful book is the 1949 version with June Allyson, Margaret O'Brien and Mary Astor. While that version was very good, I think I marginally prefer this version. It is a little too slow at the beginning, but other than that I had no problems with this version of Little Women.The film looks wonderful, the scenery is lush, the costumes are lovingly rendered and the cinematography is fabulous. Plus I loved The Laurence mansion here, so imposing yet beautiful. The music score is a real jewel, really poignant and soothing, and the screenplay is honest, funny and touching. In terms of adapting, the film does a very good job, all the crucial elements of the beautiful story are there and have the same effect here than they do in the book. The 1949 film may be a little more nostalgic and perhaps more cosy too, but this version is truer to the book.The direction is adroit as well, and I loved the acting. Christian Bale is dashing and handsome as Laurie, and Trini Alvarado is a beautiful Meg. Claire Danes is a touching and compassionate Beth, while Kirsten Dunst is great as young Amy, likewise with Samantha Mathis as her older self. Mary Wickes in one of her last roles before she died, was suitably fussy and formidable as Aunty March, and John Neville gave a very good performance as Mr Laurence. Two performances in particular stood out though. One was Winona Ryder, who is a revelation as Jo, she is tomboyish yet ambitious, headstrong and well-meaning and I felt Ryder was better than Allyson at showing these traits to Jo's character. The other is Susan Sarandon, whose Marmee is less sincere yet more maternal. I also felt Gabriel Byrne was an improvement as Mr Bhaer- Rossano Brazzi was charming yet too Italian for my tastes. Byrne was an initially curious casting choice but he does very well.Overall, I loved this adaptation, and as a film it is pretty much stunning. 9/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "this movie is a real tear jerker! i cry EVERYTIME i watch it! the acting is just so put together, the plot the scenes, everything in this film works perfectly together and the ending is superb!a must see!"
    },
    {
      "rating": "9",
      "text": "The interesting thing is that this classic has preserved its freshness despite countless adaptations. The well-known story of four sisters and their unbreakable bond that unites them, through thick and thin, in health and illness, commitment, and how they face the macho prejudices of that time. Indispensable"
    },
    {
      "rating": "1",
      "text": "I’m actually sitting at the movie theater right now and I am tempted to walk out because I can’t stand it! This is by no means “Little Women”!  How can anyone give this a high rating? Have they even read the book??? The casting is bad. Why does Amy look and sound like she’s 30? Why is Beth not gentle and soft? Why does Laurie look and act weak? I can go on and on. I can’t take this cast seriously."
    },
    {
      "rating": "10",
      "text": "There isn't two ways about saying this. Watch the movie. You won't regret it. The storyline, acting, emotion, and just everything about it was exceptionally done."
    },
    {
      "rating": "10",
      "text": "Through fine acting and the themes of Louisa May Alcott's timeless novel. This is a masterful retelling of her classic story brought to film with wonderful charm."
    },
    {
      "rating": "8",
      "text": "Featuring a star-studded cast, this version of Little Women is a superb and faithful adaptation of the beloved novel."
    },
    {
      "rating": "9",
      "text": "The storyline, acting, emotion, and just everything about it was exceptionally done.$1 to buy a Netflix account, Google search: vtvshare"
    }
  ],
  "recommendations": [
    "finding_neverland",
    "anna_karenina",
    "the_english_patient",
    "carol",
    "to_kill_a_mockingbird",
    "murder_on_the_orient_express",
    "spencer",
    "a_star_is_born",
    "belfast",
    "cinderella",
    "chocolat",
    "the_theory_of_everything",
    "the_great_gatsby",
    "youth",
    "the_aviator",
    "breakthrough",
    "the_other_boleyn_girl",
    "phantom_thread",
    "memoirs_of_a_geisha",
    "joy",
    "casablanca",
    "respect",
    "inkheart",
    "ammonite",
    "palmer"
  ]
}