{
  "id": 1540,
  "title": "Little Fockers",
  "starring": [
    "Robert De Niro",
    "Ben Stiller"
  ],
  "runtime": 98,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "It has taken 10 years, two little Fockers with wife Pam and countless hurdles for Greg to finally get in with his tightly wound father-in-law, Jack. After the cash-strapped dad takes a job moonlighting for a drug company, Jack's suspicions about his favorite male nurse come roaring back. When Greg and Pam's entire clan descends for the twins' birthday party, Greg must prove to the skeptical Jack that he's fully capable as the man of the house.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/90mwPRNMmX9RUGVgKMJMJNQnYX8.jpg",
  "categories": {
    "plot": 3.6666666666666665,
    "acting": 4.384615384615385,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.6,
    "funny": 4.196078431372549,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Little Fockers arrives long after you thought every last bit of sort-of comic juice had been wrung out of this franchise. Everything and everyone, the actors as much as the script is a bit hoarier. There is still just enough fizz in the characters to make this worth watching."
    },
    {
      "rating": "10",
      "text": "Great movie, great entertainment . Big Ben Stiller fan. Just as I expected, funny, great plot, and twists. Can't wait for the next one. Plan on buying the DVD."
    },
    {
      "rating": "8",
      "text": "I don't understand why everyone say that it's a bad movie ... It's a good movie. Not funny as much as I expected but it's still an enjoyable movie with a very good performance from DeNiro (like everytime ! :) )It's a worth checking out !"
    },
    {
      "rating": "1",
      "text": "Little Fockers was one of the most horrific and stupid attempts at a comedy movie I have ever seen. Everything is screwed up and gross, almost nothing is funny, it is very disgusting. I had to leave in the middle of the movie, and I have never done that before. I almost always show respect to a movie. This movie just had terrible acting, terrible everything."
    },
    {
      "rating": "3",
      "text": "A couple of funny lines but sadly, you've already seen them if you've seen the trailer. Ben Stiller's type-casting stereotype is growing incredibly old."
    },
    {
      "rating": "7",
      "text": "was not as funny as the first two focker movies. but kept me entertained. good one to watch at the house where you can chat. wouldnt spend the money to go see it wait to rent it."
    },
    {
      "rating": "7",
      "text": "I actually enjoyed it. I shyed away because of negative reviews but it was actually pretty decent. Jessica Alba is damn terrible in it though and its pretty much a recycled version of the first 2 films but it wasnt that bad."
    },
    {
      "rating": "8",
      "text": "I belive that all of these movies are truly outstanding. This seires is one of my favorite movie series and still is. The only one disappointment is simply that Greg's parents are barely in it, which is what made the whole second movie."
    },
    {
      "rating": "1",
      "text": "\"Little Fockers\" is a disaster movie. Not in the genre sense of the word, in which some great calamity or other(an ocean liner is sinking; there's a highrise building on fire; bees! bees! everywhere, bees!) threatens the all-star cast's lives, but rather, it's an aesthetic disaster, a comedy with an aura of impending doom. The collected actors, especially the old-timers, decorated many times over with awards and accolades, seem to be slumming like it was the nineteen-seventies. Unlike Fred Astaire and William Holden in \"The Towering Inferno\", or Richard Widmark and Olivia de Haviland in \"The Swarm\", nobody gets out alive in this second sequel to the inexplicably popular \"Meet the Parents\". Unlike Ernest Borgnine in \"The Poseidon Adventure\"(released many years after Borgnine picked up his Best Actor Oscar for \"Marty\"), Robert DeNiro, Dustin Hoffman, and Barbara Streisand go down with this sinking ship of a movie. They're held accountable. Unlike those old war horses from Hollywood's classical period, most of them in semi-retirement when they participated in those Irwin Allen(\"The Master of Disaster\") spectacles, DeNiro and his legendary co-stars are still active, and should be ashamed of themselves for involving themselves in such an obvious turkey. Pure and simple, \"Little Fockers\" is a paycheck movie. Simply put, they phoned it in. On the other hand, Astaire and Widmark, legends from a bygone era, were no longer relevant to the then-current marketplace, and to that younger generation of yesteryear, they had the look of museum pieces in those analog event films, since both actors, and others of their ilk, were presented out of context with what made them vital and worth preserving in the first place. Astaire, the star of \"Top Hat\"(second only to Stanley Donen's \"Singing in the Rain\" when it comes to ranking musicals), who would dance with Ginger Rogers as if his life depended on it, was then reduced to playing a stock character who just like everybody else, feared flames and smoke inhalation. \"The Towering Inferno\" made him look like a has-been, a ghost of his former self. It's the same prevailing effect that the lowbrow hijinks of \"Little Fockers\" projects onto its distinguished cast, especially Streisand, who is clearly no longer a \"Funny Girl\", only fat. Whereas Hoffman gets off relatively easy, in what amounts to little more than a special guest appearance(he calls his son \"Gay\", short for Gaylord, now known as Greg, played by Ben Stiller), DeNiro, overrated as a late-blooming comedian, is stuck with the unenviable task of carrying this film, and as Greg Focker's micro-managing father-in-law and foil, the Scorsese regular gets called on to do something that undoubtedly amounts to being the nadir of his long and illustrious career. \"The Adventures of Rocky and Bullwinkle\", notwithstanding. Erectile dysfunction and its pharmaceutical cure, minded for laughs in the recent \"Love and Other Drugs\", is the malady that keeps on giving apparently, when Stiller, whose participation in the extended boner joke may as well be his career low too, sticks a needle in DeNiro's side effect-plagued baby-making appendage, blessedly left to our imaginations, thanks to a strategically placed child who witnesses it all, and screams. We know how he feels. The boy functions as a sort of in-frame, diegetical film critic. (In other words, he expresses his horror, and our horror of the scene's mounting.) Without his two-fold caterwaul, the medical-related ordeal would have been further exposed as an unfunny bit(the child's screaming may coax some into laughter), and be greeted by the same stony silence which follows the enema(!) that Jessica Alba(playing a flirtatious drug company rep) performs on a hospital patient, and Barbara Streisand's Dr. Ruth shtick(she's the other Jewish sex therapist, Dr. Roz Focker). Ever desperate for laughs, this shameless film makes \"Godfather\" puns(\"Bobfather\" is slightly less painful than \"Godfocker\"), and goes so far as trotting out Harvey Keitel for nostalgia's sake, and promptly gives him nothing to do. Playing a crooked plumber, Keitel's filmic self sort of avenges Scout's death by Travis Bickle's gun in \"Taxi Driver\" when Jack Byrnes gets buried under a truckful of sand. In another film, the ditch that he digs would be used for hiding bodies. In the absence of that film, he could start with his good buddy Bob."
    },
    {
      "rating": "1",
      "text": "Little Fockers is a boring, useless, terrible ending to a beloved trilogy. Meet The Parents and Meet The Fockers were both wonderful. Jessica Alba, the only new starring actress, is the only good actor. It seems to serious, with plots ranging from divorce to heart attacks to erectile disfunctions. Even DeNiro can't act well, with the bland, boring, repulsive script given to him. The only pro I can think of other than Alba are the children. Now five, they're funnier- not to mention more adorable than ever."
    },
    {
      "rating": "10",
      "text": "Definitely as funny as the first two, if not funnier. I wasn't expecting much due to all the bad reviews but the film had me in stitches. So great so see all those great actors in a film together. There's a healthy dose of Owen Wilson as well who's on form as per usual."
    },
    {
      "rating": "4",
      "text": "The third installment in the Focker series doesn't quite live up to the star-packed cast that sets its expectations so high, and then, fails as its characters meander about aimlessly throughout the many dull subplots. Stiller and De Niro do still seem to bring a few laughs with their persistant bickering and their concordance to stay in the \"Circle of Trust,\" but the few bright moments of the comedy we loved in \"Meet the Parents\" are overshadowed by the ludicrous, and at times painful direction of the film. We are introduced to an Alba character, who, quite stunning, has no relevance to the picture. She is introduced on a whim of infatuation to Stiller, and then, awkwardly exited as if she'd made a cameo appearance on a spoof film. Even more, above all else, is the embarrassing references to one of the greatest pieces of cinematic work: \"The Godfather.\" It was depressing to see an aged De Niro, forced to act like a stooge, be lowered to the level of having to say, \"Godfocker.\" I couldn't be more disappointed in the writing of this film as the monologue relies on cheap laughs and cliched behaviors from the children, who, are as one-dimensional as a piece of cardboard. In the end, if you were a fan of the first two films, you walked away from your seat either really disappointed and saddened by De Niro's cinematic demise, or estatic at the rudimentary humor geared  toward the likes of a 6 year old. If you were new to the series and were unfortunate enough to view the latest (and worst) 'Focker' flick than you probably just walked away realizing you should have seen \"The Fighter\" instead. Unless you can shut your brain down for 90 minutes and just enjoy, \"Little Fockers\" is an utter disaster of a film."
    },
    {
      "rating": "5",
      "text": "there are some laughs in this but not many. much like the prevous 2 the jokes and the punch lines can be seen miles away before they even arrive. there is some chemestry there with the actors but for the most part it feels like they are just going through the emotions . there is little focus on the kids and the main focus is on deniro and stiller who just barely keep this film afloat. if you really liked the first 2 films you will probubly like this one.if you are like me and thought the first one was just ok and thought the secondone was pretty decent . then this will probubly be the least funniest of the 3."
    },
    {
      "rating": "8",
      "text": "Easily the best film in the series. Little Fockers ends the series on a high note and I loved it from start to finish. The only bad thing about it is that Jessica Alba sucks hard in this film, Besides that its good."
    },
    {
      "rating": "2",
      "text": "Waste of my fockin' time. Even worse than the previous sequel. Lame potty-mouth humor and recycled acting. I became disinterested about 20 minutes into the movie. Even if you liked Meet the Parents, this movie's still a waste of your time"
    },
    {
      "rating": "6",
      "text": "It's not good as the first two movies, but kept me entertained. I think this ''  trilogy '' had come to an end. I found very disappointing that Greg's parents were barely involved in this movie, especially Dustin Hoffman (as Bernie Focker). I also expected that the kids were more in the story, the title does say '' Little Fockers ''. It's was more of De Niro's '' I'm watching you '' thing. Jack Byrnes (Robert De Niro) not trusting Greg was getting a little bit old. I mean come on, he didn't trusted him dating his daughter, marring his daughter and now, he doesn't trust him raising his family. Don't give me wrong, I love the first two movies, but I tough that the third one had something different. They tried to bring it back again, but they kinda failed. I still enjoyed it and it's not that bad. If you loved the first movies, you will probably find this one disappointing. Of course, Jessica Alba is hot as always."
    },
    {
      "rating": "1",
      "text": "How can so many amazing actors end up in such a ridiculously BAD movie? I mean painfully, horribly, squirming in my seat BAD. Proof of why I rarely see movies in the theater; wish I hadn't bothered with this one. The writer should be publicly flogged."
    },
    {
      "rating": "2",
      "text": "Little Fockers is an unfunny sequel and couldn't match to the top of Meet the Parents and Meet the Fockers! The story is not that interesting,the characters are forgettable,the jokes are so boring and descent conversation,the two gag jokes are so disturbing between Greg cutting on the finger and Greg sticking a needle on Jack,and they shouldn't been done already since the last two movies that are actually quite classic,but this is one is not that good."
    },
    {
      "rating": "0",
      "text": "this movie is more of the same of the others. it was pretty good in the begginning, but now it has run dry. it's the same comedy and dialouge as the last two. i was really hoping they would change it up in this one, but unfortunately they didn't. i hope they don't make another."
    },
    {
      "rating": "4",
      "text": "I thought it was OK. I guess I was expecting a little bit more with actors like Ben Stiller and Robert DeNiro. But I guess the script writer is to blame (as always). I did enjoy the part where Greg (Stiller) cut the tip of his finger off while cutting the turkey."
    },
    {
      "rating": "2",
      "text": "Well. This is going to be a short review. I'm just going to say that I can actually remember when Robert De Niro was still a serious actor and when Ben Stiller was still funny."
    },
    {
      "rating": "2",
      "text": "Meet The Parents is entertaining with good joke and memorable moments. Meet The Fockers is an average sequel with some development. This is a huge joke, the jokes aren't funny, the dialogue is lazy, the acting is underwhelming and the kids as mentioned in the title don't have much screen time, they appear in it for like 4 minutes."
    },
    {
      "rating": "6",
      "text": "Little Fockers is a mediocre flick, it's not all that funny, the plot is lacking, and the acting can be lame for some characters, but it will get a good laugh or two, it's definitely not a movie kids can watch, but it's an ok movie from beginning to end."
    },
    {
      "rating": "6",
      "text": "It feels as though you don't have as much of a connection to the characters in the third film, and a few events that take place in it are just randomly forgotten after awhile and they move onto something else. The ending was not fantastic, Jack randomly forgives Greg after beating the crap out of him, and the Little Fockers have little role in the movie at all. They are just in the movie so that Jack and Gaylord can battle it out with awkward situations again. However, this film does have funny scenes, and now that I think about it, Jack doesn't even do any CIA things, such as the lie detector, or that cool under-the-bed mobile home. This is the worst film in the series, but it STILL deserves a positive review. And God bless Jessica Alba."
    },
    {
      "rating": "3",
      "text": "The only thing \"Little\" about this film was the laughter it generated"
    },
    {
      "rating": "2",
      "text": "I couldn't even watch more than 25 minutes of this movie. I don't care whether the house is finished for the kids birthdays, the wife thinks Focker is cheating on her, or if the grandparents show up to the debacle. The storyline and themes of this are infantile, ridiculous and unlaughable."
    },
    {
      "rating": "3",
      "text": "Not the worst thing to sit through, but certainly not funny. My wife, who practically worships the first two, didn't laugh out loud once during this movie."
    },
    {
      "rating": "4",
      "text": "The trailer was funnier than the movie. It was too slow and dragged out, compared to the first two movies it was a flop. It seemed like that they ran out of ideas and went to crude comedy the puke and the boner seen was to much. Did not like how the entire movie was based around Stiller and Di Nero, the children were funny as the rest of the rest of the family. They needed a bigger role."
    },
    {
      "rating": "5",
      "text": "A for humor & mishaps.A for the cast.C for the exaggerated.F for the ridiculous.Don't get me wrong, I'm a fan of the Focker franchise.  I just think that it gets old after a while; the first one was the best out of all of them.  Eccentricity was a bit over the top, (save for a spread eagle valley girl character played by Jessica Alba) but it was still hilarious and I always love the cast :)."
    },
    {
      "rating": "6",
      "text": "I thought it was mildly funny, but there were quite a few messes in the story and there feels like too much going on at once. It does have a few good moments, but nothing too interesting."
    },
    {
      "rating": "1",
      "text": "Horrible! The first one was brilliant the second ha ha not so much, but then you have this lazy, ignorant film featuring a wasted talented cast who just look stupid the whole time. And it is too raunchy to even be taken seriously at all. I give this movie 7%."
    },
    {
      "rating": "4",
      "text": "They continue to besmear the legacy of that great first installment. I'm confident that the makers of Little Fockers, if they made a film out of this review, would find the basest and least funny way of poop-riffing on the word \"besmear\". \"Let's get some really talented actors together for a good old fashioned cash-grab! Who cares if its crappy? I'll tell ya what's crappy....8 figures!\""
    },
    {
      "rating": "5",
      "text": "\"Little Fockers never lives up to be as funny , clever or original as the first two. It tries to hard to make you laugh and never does. All the hysterical parts we have all seen before. There were some mild moments of humor but nothing special\" .. C"
    },
    {
      "rating": "2",
      "text": "This irritating addition has lived up to everything that was expected of it, its run by weak, overused material, and ever so raunchy jokes. Nothing that we havenâ"
    },
    {
      "rating": "5",
      "text": "This is hopefully the last installment in the series. I love the \"Focker\" series, but this one falls short of the other two, as many people have been saying. But I think a 27 is way low, that basically means horrendous, & it was not that bad. There was still a lot of humor, & most of the reason for the negative reviews are for the stupid jokes regarding inappropriate gags, although, there was also a lot of good humor that you'd laugh at if you're a fan, too. I loved Owen Wilson in this movie, he was completely off-the-wall & funny. But anyway, for the most part, not Godly, not bad."
    },
    {
      "rating": "1",
      "text": "Jack Byrnes was once a comedic character that everyone loved, now he is just an old man who plays with boner pills. Paul Weitz (American Pie) wasn't that bad on the directing but he is going to be hated because of the materials he was given. Writing for the film is John Hamburg (who wrote for all three) just gets worse every time. The materials once in Meet the Parents were relatable, funny, and heart-warming. The materials in Little Fockers now are just plain insulting to both the trilogy and the stars. Playing Jack Byrnes is the iconic actor Robert de Niro, it is absolutely ridiculous that they gave him jokes like say \"The Godfockers\" and basing the movie's humour on just the name \"FOCKER\". Ben Stiller isn't anything to blame for because he's always playing roles like this. Little Fockers is only an unnecessary and insulting addition to the once award-winning trilogy. RazzieBuzz: Worst Couple on Screen (Robert de Niro, Ben Stiller)"
    },
    {
      "rating": "4",
      "text": "By far the worst installment of the series so far and yet despite itself at times quite entertaining. The characters have been so well setup in the previous films that even though little of what takes place in this film makes sense you still can derive a little pleasure from the bizzarre situations these likable characters find themselves in. Whilst the tv show \"worst week\" attempted to serialise the events of Meet The Parents, Little Fockers feels like it would be more at home as an episode of that tv show."
    },
    {
      "rating": "10",
      "text": "Great movie. Loved it. I thought it was much better than the other movies. Made me laugh. The one liners were better than the last movie as well. Will watch it again and again."
    },
    {
      "rating": "6",
      "text": "This is a movie you either love or hate, no in betweens. I thought the cast was well acted and it had a simple plot, mild comedy isnt such a bad thing. I always enjoy movies that have series and keep the same actors and they did well in this keeping the exact same actors throughout the whole series of 3. I always enjoyed Ben Stillers comedy/movies. DeNero is slacking a little but Ill always enjoy his routine. Like I said its either a hit or miss, cant like 1 our of 3, either like all 3 or you like none and I have enjoyed all 3, I just think people take a fun simple movie and rate it to hard on the little things, but hey thats why there are so many opinions...Little Fockers is a great family kids flick, pop in the popcorn and watch away."
    },
    {
      "rating": "7",
      "text": "It didn't look promising at first, but after 20 minutes, it picked up. It's worth a watch and is funny at times, but i can't compete with \"Meet the Fockers\" as I hoped, but it's good enough to keep us entertained throughout! The Story is not the same as the others, with those being \"Meeting Parents\", this one is kind of all over the place, and confusing almost all the time, one minute the kids are at school, the next Jack is having a heart attack , it's more like little story's into one movie. Also, one thing to add, as the first \"Fockers\" movie did, this ending leaves an opening for a sequel, and I must say, how many times is Greg and Jack going to be fighting, this is a nice ending, leave it at that!The cast is a full on list of funny people and great actors who played their part wonderfully, but with some of them are getting old and not as funny any more, a little disappointing!Like I said before, it's worth a watch, but only once would be just fine"
    },
    {
      "rating": "5",
      "text": "Having never seen the first two, I went to this movie without expectations.  It occasionally made me laugh, but it was not a non-stop gut-busting comedy.  The familial miscommunications which serve to drive the comedy aren't particularly great, either.  I did find that the characters all felt like they had depth, I suppose because they've already been developed in the two previous movies.  But this film failed to do more than amuse me for a while.  Passable, but not great."
    },
    {
      "rating": "1",
      "text": "Every funny line was already displayed in the trailer, so this movie was purely agonizing to sit through. The cast lacked depth and never caught my attention."
    },
    {
      "rating": "3",
      "text": "Overall this movie was a giant flop. It tries to combine child-like humor (projectile vomiting) with scenes depicting the use of a Viagra-like product and the ensuing aftermath. It didn't really have a target audience save for those of us who've already seen the previous two, and even then it fell short trying to do too much at once. Definitely a waste of money."
    },
    {
      "rating": "2",
      "text": "Did we really need another Fockers film? The answer is absolutely not!!! I know it\"s suppose to be a silly campy, fun time movie, but c'mon you came at least try to have a storyline! One of the worst Ben Stiller films ever!!!\r Acting: Their was none\rStoryline: Please!\rCharacters: Nothing new"
    },
    {
      "rating": "9",
      "text": "a"
    },
    {
      "rating": "0",
      "text": "All I Can Say Is The Movie Is Bad.. Acting, Writing, Everything.. Once In A Great While A Clever Joke Comes Along.. But I DID NOT Laugh Once During The Whole Movie.. The Title Is So Stupid Just Because The Guys Last Name Is Focker Ya We ALL Get The Joke.. SO So SO Lame...Overall Nothing Is Good About This Movie.. The WORST Movie Of 2010... I Hope I Bring Down The User Score.."
    },
    {
      "rating": "4",
      "text": "For the third time, Stiller and De Niro take to the screen for a battle of the wits, and as it turns out a battle for the biggest laughs - competition is tight. However, aside from these two masterful mains, the rest of the formula just doesn't work - they've tried it just one time too many. Without the event of a wedding, or the actual 'meeting of parents' the film becomes bland and lacks direction. In this case the film revolves around Greg's (Stiller) children's birthdays, which happen to coincide with Jack's (De Niro) feeling that the end is nigh and that someone must fill his boots as the family patriarch. These two events provide little to base an entire film around - especially a film with the potential that Stiller, De Niro and even Wilson bring to the table. At it's best, Little Fockers uses subtle but original humour that leaves one laughing in the same fashion as would have been expected during the first two. At the very worst, it involves exaggerated attempts at humour and absurd plot tactics. In conclusion, this film has been done twice already, the third time was just one too many. Please, Roach and co, I implore you... do not make another one."
    },
    {
      "rating": "6",
      "text": "Stiller and De Niro return after their previous outing that was released what, 6 years ago? It still has the charm of the previous movies, but unfortunately, its 6 years too late. Some of their tried and true comedy antics seem to be outdated and lack substance. Still an entertaining movie, but Universal has ridden this pony as far as it could."
    },
    {
      "rating": "4",
      "text": "Do yourself a favour. Go to youtube watch the trailer and be done with it. Seriously, if your looking for laughs then you would be saving yourself the disappointment because the trailers deliver everything thats good about this movie in under 2 minutes. As a big fan of the first two Focker films I was quite optimistic about this one but sadly this was an awful addition to the Fockers. The plot picks up several years down the line since we last visited the Fockers. Greg (Stiller) is settled down with Pam and his twins struggling with his finances and turns to Jessica Alba for help. Jack (DeNiro) has health problems and is looking to hand over the family reigns however he still has it in for Greg and with Greg's suspicious behavior it only makes things worse. Their are appearances from Barba Streisand but its largely down to the few occasions where Owen Wilson and Dustin Hoffman appear to work their magic that save this film from being a total catastrophe. The jokes are now wearing thin and for Focks sake lets just hope that this is the last Fockers film because based on this evidence they are ruining what was once a strong household set of fims in comedy!"
    },
    {
      "rating": "10",
      "text": "Little Fockers: An Inadequate Sequel\r\t\rThe word comedy refers to â"
    }
  ],
  "recommendations": [
    "identity_thief",
    "ted_2",
    "30_minutes_or_less",
    "horrible_bosses_2",
    "thunder_force",
    "hubie_halloween",
    "trainwreck",
    "zoolander_2",
    "this_is_the_end",
    "tammy",
    "couples_retreat",
    "night_at_the_museum",
    "the_ridiculous_6",
    "anchorman_2_the_legend_continues",
    "tropic_thunder",
    "dirty_grandpa",
    "dinner_for_schmucks",
    "neighbors",
    "paul_blart_mall_cop",
    "the_hangover_part_iii",
    "a_million_ways_to_die_in_the_west",
    "neighbors_2_sorority_rising",
    "baywatch",
    "masterminds",
    "ted"
  ]
}