{
  "id": 1303,
  "title": "Little Man",
  "starring": [
    "Marlon Wayans",
    "Shawn Wayans"
  ],
  "runtime": 98,
  "genre": [
    "Comedy",
    "Crime"
  ],
  "description": "After leaving the prison, the dwarf criminal Calvin Sims joins to his moron brother Percy to steal an expensive huge diamond in a jewelry for the mobster Walken. They are chased by the police, and Calvin hides the stone in the purse of the executive Vanessa Edwards, whose husband Darryl Edwards wants to have a baby. Percy convinces Calvin to dress like a baby and be left in front of the Edwards's house to get inside the house and retrieve the diamond. Darryl and Vanessa keep Calvin for the weekend and decide to adopt him, while Walken threatens Darryl to get the stone back.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gs6AnQy7ZfOCgz0wsl7yjQOxF6K.jpg",
  "categories": {
    "plot": 3.5,
    "acting": 0.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.3,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "brilliant - the funniest movie i've seen in decades; these guys know how to make fun of midgets."
    },
    {
      "rating": "10",
      "text": "Coming from someone who loves to laugh at midgets, this was a blast! I laughed out loud many times and felt better for the rest of the month."
    },
    {
      "rating": "10",
      "text": "Great movie, very funny! Yes, it's a one-joke movie, but when that joke is an evil, horny dwarf that people think is a baby, it really makes you laugh!"
    },
    {
      "rating": "0",
      "text": "This is seriously the worst movie I have ever seen. It nearly made me ill."
    },
    {
      "rating": "0",
      "text": "I thought that nothing could beat 'The Shaggy Dog' as the worst film of 2006... but i was wrong. The 'jokes' arent funny and the CGI was so bad. One of the worst movies I've ever seen."
    },
    {
      "rating": "0",
      "text": "Is most certainly the stupidest idea for a movie ever."
    },
    {
      "rating": "0",
      "text": "Here's some free advice to the idiots running the studio - NEVER make a movie that's basically a remake of a bad Bugs Bunny cartoon. I'm not a fan of Pirates 2, but seriously, you're much better off watching that, even if you've seen it already."
    },
    {
      "rating": "0",
      "text": "Little Man deserves to buried in a hole in the ground and forgotten. It was painfully unfunny and has such horrid slapstick comedy. The Wayan's brothers are really slumming these days and who knows if they'll ever manage to get back to making movies that are funny."
    },
    {
      "rating": "1",
      "text": "If you wanna see a reason for a massive suicide, you have to see this movie."
    },
    {
      "rating": "0",
      "text": "For Tuff D to give this a perfect 10 there can only be one logical conclusion. He saw this movie too soon after having his lobotomy. The worse movie of the year hands down."
    },
    {
      "rating": "0",
      "text": "Can a movie be worse than \"White Chicks\"? Believe it or not, yes..."
    },
    {
      "rating": "0",
      "text": "Oh My God this was that awful."
    },
    {
      "rating": "0",
      "text": "You have got to be kidding. This movie was a disaster through and through."
    },
    {
      "rating": "10",
      "text": "Best movie all year."
    },
    {
      "rating": "0",
      "text": "Worst movie I've never seen!"
    },
    {
      "rating": "0",
      "text": "This movie is terrible. And its insulting that it would even been made with the expatation that one would pay $8.00 to see it. Finally it insults African-American's by pandering and stupid sterotypes."
    },
    {
      "rating": "10",
      "text": "Genius. White Chicks was brilliant but this is even better. Hope there is a sequel."
    },
    {
      "rating": "0",
      "text": "Best Movie since Big Mommas House 2. Oscar material right here."
    },
    {
      "rating": "10",
      "text": "Almost in spite of itself, Little Man manages to deliver big laughs. It's not enough to make it a consistently funny movie, but this one-trick pony from the Wayans brothers has flashes of humor and sincerity that almost save it from its disastrous ending. Great film, almost perfect."
    },
    {
      "rating": "0",
      "text": "Irrefutable proof that, like Mel Brooks, the Wayans brothers lost the ability to be funny long ago. The difference being that Mel Brooks actually made quite a few audience-killers before losing it. All the Wayanses have under their belt is Scary Movie."
    },
    {
      "rating": "0",
      "text": "Even worse than 'White Chicks' and that really is saying something. Offensive (and worse) unfunny rubbish!"
    },
    {
      "rating": "0",
      "text": "Not only was it crap... it was incredibly boring. Helped me get to sleep though."
    },
    {
      "rating": "3",
      "text": "When I first saw the commercials for this movie I thought it would be one of those rare \"gems\" that Hollywood periodically spews out. However, this movie turned out to be a \"tall order\" and fell a heck of a ways \"short\" of a decent midget-ripping laugh."
    },
    {
      "rating": "0",
      "text": "Wow, another Wayans predictable garbage film, two thumbs down."
    },
    {
      "rating": "6",
      "text": "Nobody notices that the baby is a full-grown man. The \"Little Man\" is readily accepted as an infant. Meanwhile, quite pointedly, the filmmaker intergrated an African-American couple in an affluent, nearly all-white community, as a means, perhaps, to show that these people don't notice that their neighbors are indeed black. \"Little Man\" might \"Something New\" in code, or maybe it's the stupid low-brow film everybody says it is."
    },
    {
      "rating": "8",
      "text": "An irreverent, immaturely vulgar film that is too lame for adults, but too crass for small kids.  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "7",
      "text": "the story is very well acted out and easy to follow but the CGI takes the illusion away and ruins some of the jokes. either way i laughed out loud through the whole movie."
    },
    {
      "rating": "0",
      "text": "I can't list everything wrong with this movie in 5000 characters, so I'm not going to try. But really the main flaw is that, at no point in this movie did I laugh, to be honest I didn't even smirk at any point. I cringed, I felt physically sick, but at no point did this film approach anything vaguely resembling humour. And for a comedy not being comic is a real problem."
    },
    {
      "rating": "6",
      "text": "This is a bad film I will admit, however it is still entertaining and the Wayanas Bros. are just a likable duo that can make any film work to their advantage. They have done better, and this is probably their worst, but it still has some pretty funny moments. CGI was always going to be obviously dodgy and while its a clever concept it is indeed quite silly, but still its a funny movie that got laughs out of me. Overall it won't please everyone but will get laughs from the right audiences."
    },
    {
      "rating": "5",
      "text": "This movie is both  funny and dumb.. I recommend it for watching if you have a lot of free time. Otherwise don't waste your day. My final score is 5/10"
    },
    {
      "rating": "2",
      "text": "Pequeño pero peligroso es una pelicula que intenta forzadamente salir del hoyo de la ridicules y el humor obvio, al intentarlo logras algo pero no siempre el resultado es positivo."
    },
    {
      "rating": "8",
      "text": "Its NOT that bad. Yeah I mean sure the Story is doesn't make sense. A little man who is trying to steal diamond but then things go wrong when the cops are called and he ditches the diamond into a womans purse causing them to chase after the woman and her husband. Then pretty much the Little man dresses up like a Baby to get the diamond back. Now this flim is pretty funny to me and I enjoyed it. I know many critics and some people don't like it but meh I don't care what they say. This is a great movie."
    },
    {
      "rating": "8",
      "text": "i wish  marlon and his brother could direct this movie . i still love  the comedy . the Wayans Brothers are  hilarous  in white chicks and scary movie  but this is even better . but i wish they had little man 2"
    },
    {
      "rating": "8",
      "text": "The movie was funny, well acted and entertaining.Sure, it wasn't realistic and some people might not find it funny with it's juvenile humour but, for me, it was a really fun movie."
    },
    {
      "rating": "7",
      "text": "litle man esta mal hecho principalmente pero es muy graciosa y divertida a pesar de que se critique negativamente por los criticos y le falta mejora para ser muy buena"
    },
    {
      "rating": "5",
      "text": "epic.................................................................................................................................................."
    },
    {
      "rating": "3",
      "text": "\"Little Man\" was a very bad movie, which does not rescue the story, the comedy with which they handled, and the interpretation of the \"adult\" baby left me trolling and very angry. I do not like that movie."
    },
    {
      "rating": "0",
      "text": "Cheap lowbrow \"slapstick \" comedy that prioritizes puns and shock value over plot and dialogue. The dated and offensive stereotypes that plague this movie aren't even funny enough to justify their rudeness. The performances are the nails in the coffin with even talented actresses like Kerry Washington feel awful to watch. Nothing redeemable here."
    },
    {
      "rating": "10",
      "text": "i wish marlon and his brother could direct this movie . i still love the comedy . the Wayans Brothers are hilarous in white chicks and scary movie but this is even better . but i wish they had little man 2."
    }
  ]
}