{"id": 4816, "title": "Little Miss Sunshine", "starring": ["Greg Kinnear", "Toni Collette"], "runtime": 102, "genre": ["Comedy", "Drama"], "description": "A family loaded with quirky, colorful characters piles into an old van and road trips to California for little Olive to compete in a beauty pageant.", "releaseYear": "2006", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/tFnTds88mCuLcLPBseK1kF2E3qv.jpg", "categories": {"plot": 5.962962962962963, "acting": 7.172413793103448, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.228571428571429, "action": 5.0}, "reviews": [{"rating": "9", "text": "\"Little Miss Sunshine\" is a heart-warm movie. It's well written script delivers that supporting each other as a family, everything is possible. And yes, it is one of the best movies of the year."}, {"rating": "9", "text": "LITTLE MISS SUNSHINE is an independent film, humorous in its own dark little way. Though the film comes across mostly a drama, it has its funny moments, and all of the humor is either subtle, clever, depressing, or a combination of the three. Though Steve Carrell, now known for his wittingly hilarious role in TV's comedy THE OFFICE, appears as one of the more major characters, Alan Arkin (if any cast member) seems to be the one who draws the most audience laughs. In fact, Carrell delivers most likely the least humorous role. Though he does definitely still have his humor, with a big nod to the scene at the dinner table near the beginning. Other than that, LITTLE MISS SUNSHINE is a heartwarming, sometimes weepy, and ultimately feel-good film. I highly doubt there has been one road movie as good and unpredictable as this since NATIONAL LAMPOON'S VACATION."}, {"rating": "10", "text": "One of the best movies I've seen in years. It's a perfect and satisfying blend of bittersweet plot and stinging social commentary. Wonderful performances by everybody, especially Carell."}, {"rating": "10", "text": "Loved this film, laughed out loud for the first time in ages in a theater. Steve carell was at his best comic (and understated self). also loved the young actress who played Olive, unaffected charming young child actress."}, {"rating": "9", "text": "Believe the hype. My girlfriend and I haven't had this much fun at the movies in a long, long time."}, {"rating": "10", "text": "hyseterical and heartbreaking at the same time. The performances are pricless."}, {"rating": "9", "text": "One of the most uplifting and blackest comedies I have ever seen, Little Miss Sunshine has something for the whole family to enjoy, laugh at, shed tears at, and cringe at. Almost every emotion was invoked within me upon watching this movie. Were not for a few unnecessarily pointless bits that had no payoff, this would be a perfect 10 for me. Still, the script, cast, and direction are beautiful. This also marked the beginning of Steve Carrell's journey to becoming a dramatic actor in film. This is a great film, especially if you like really messed up dark comedy."}, {"rating": "1", "text": "Wow. I'm stunned. Every once in a while a movie comes along that is jaw-droppingly horrible to the point that it leaves your mouth hanging open. I lack sufficient terms to express how trite and repellent I find this simpering movie. It's an exhausted \"human spirit\" movie so cloying that it needs to be taken off life support. From the first time I saw the TV commercial which featured the hackneyed ruse of getting the whole family in one vehicle for the duration of a movie, I suspected the script would have difficulty making that premise believable. It certainly fails there, but that's the least of its problems. But still, the wealth of good reviews drew me to buy a ticket. My initial reservations were right. This script is an inept piece of garbage long before you evaluate it on moral grounds, where it collapses spectacularly. The family here is a mix of characters so drippy and dense that they never realize their dumpy, uncoordinated, bespectacled daughter isn't the Junior Miss type. It takes them exactly one pageant (following a needless cross country trip) to figure that out. The same family doesn't realize that a heroin-snorting, horndog grandfather shouldn't be the one teaching their adolescent daughter her beauty pageant dance number. Why not go all the way and include a \"funny scene\" of grandpa molesting her? The setup is practically there; a scene so distasteful feels like it's just off-screen (or on the cutting room floor) in this wholly objectionable movie. Long after a ridiculously unbelievable \"chance meeting\" in a gas station, long after paper-deep villains have been thrown at the screen, long after the annoying Murphy's Law plot line is exhausted, comes the most sick, saccharine, crappy moment in all of film history which involves a family attempting to redeem their seven-year old daughters failed, inappropriate talent routine (a strip tease) by joining her on stage. Sexualizing a seven year old girl without her being developmentally able to understand it... mmm, that's comedy gold. This \"edgy material\" is about as palatable as a cup of bleach. I'm not one to look for messages but here we've got something like \"Let's all support each other as we swim up the cr*p river of life!\" I'm sure it's supporters think I've missed the point and that the humor is just dark. It's not dark. Making a dark comedy is an art. This comedy has no edge in it's delivery. It's filmed straight. It's acted and presented ineptly. It's about as edgy as a smutty episode of Seventh Heaven. This is the rotten family-values homily to end them all. Drawing big saccharine payoffs to support a family values theme also places this squarely in mainstream whitebread entertainment. It makes perfect sense that idiotic Hollywood would nominate this tripe for a bunch of Oscars, but I can't believe I respect people who like this atrocity. The Oscars have become so gratingly self-impressed, and the nominees so limp, that all you can really do anymore is root against films you don't want to have any further influence on the culture. I am so glad it lost the Best Picture award ; Now it starts a long descent to the bottom of time's toilet, exactly where it belongs, where it will be forgotten."}, {"rating": "0", "text": "How about putting this in bold font across the top of the DVD box, \"The Most Overrated Film of the Decade.\" Look I know a good movie when I see one and never let the hype get to me. I thought Sideways and Lost in Translation were well deserving of their praise when they came out and were nominated for Best Picture but this was a joke. Let's go over a few of the stand-out scenes **Spoiler**: Alan Arkin uses countless expletives for no reason at all until he finally dies, Carell mispronounces Proust about fifteen times, Paul Dano mopes around for two hours then turns into the grandfather and curses uncontrollably for no reason, and finally the movie climaxes with a so-quirky-she's-cute kid stripping in a beauty pageant. Chevy Chase must be rolling in his grave right now thinking about this poor attempt at remaking his comedy classic. And can we talk about Steve Carell's underacting? It seems he went into a coma sometime around the start of production and hasn't come out of character since. You can watch his eyes in the film carefully read over the cue cards off screen while trying not to fall asleep."}, {"rating": "0", "text": "I felt totally conned by this movie. I can just imagine the Fox poeple at Sundance thinking, \"Those arty blue-staters LOVE quirky indie comedies like this, with their ironically suburban aesthetics and implausible motel sets that mimic 'Wallpaper' spreads from 1999!\" The script was total garbage; I could hear its rusty gears creaking throughout, especially during the exposition scenes when the writer had to contrive a way for the entire family to agree to take the road trip. I think Little Miss Sunshine might be my least favorite movie of all time. No doubt it will win best original screenplay at this year's Oscars."}, {"rating": "0", "text": "This movie is wretched. The characters are unappealing and classless. I couldn't root for any of them. Just gross. Who would let their kid act in this junk?"}, {"rating": "1", "text": "Just how did this made-for-TV movie make it into theaters? If I make a video of my fat little sister dancing in front of a televised beauty pageant with my cliched grandparent swearing in the background, can I go to Sundance too?"}, {"rating": "7", "text": "Is winning really everything?"}, {"rating": "1", "text": "Tremendously overrated. Artsy and cute but nothing more. NOT fulfilling in the least."}, {"rating": "5", "text": "Little Miss Sunshine is a dry, slow movie that reaches for quirky and only manages to grab on to pain. In fact, this movie seems to be about how unfair life is and if we all go on stage and show up all the stuck up people that we can dance like a stripper, then we have made something of ourselves. This movie isn't different, its just a complete rehash of old screwball comedy. It wants to find humor in the awkward but comes up with nothing short of inane. The characters are all unlikable, except the two children, and this seems to be done purposely as if to show the old idea of ignorance being bliss. Its situations are terribly staged, and the only thing that works is that the actors all can act. But that does not matter because the characters they're playing are flat and shallow. Sure its trying be true to our world full of social decay, but who cares if all your characters do is decay more(one actually quite literally). This movie gets nominated for best picture while a movie like Children of Men is forgotten."}, {"rating": "3", "text": "While it's obvious many people feel this movie succeeds in its humorous antics, I can only find myself cringing. This is one of those films that's all about personal taste, my palete having grown accustomed to a decidedly different sort of entertainment. I can say with certainty, however, that awarding it with Best Picture would have been similar to awarding the Nobel Prize to the individual who invented the Slap Chop: both amusing and utterly ridiculous."}, {"rating": "0", "text": "We walked out!"}, {"rating": "10", "text": "It's not too often that family films tug so endlessly on the heart strings, or a film which offers real and genuinely funny moments, characters and adventures all on a road trip to the most unlikely of places for the most unlikely of people. The film is a true example of how it's the simple things which change the rules entirely, and Little Miss Sunshine offers a range of characters all with different dreams, hopes and outlooks in life, and they all come from the same family.\rThe comedy road trip is a cunning and daring attempt to break from the clutches of similar scenarios and situations, we have some of the most interesting characters to grace the screen who all embrace their part and set the standard, we have the mother, Sheryl (Toni Collette) who struggles to look after her two children and her depressed brother Frank (Steve Carell) who recently attempted to commit suicide, her work-oriented husband Richard (Greg Kinnear), a motivational speaker who simply cannot catch a break, Edwin, played by Alan Arkin, the sharp-tongued grandfather who is very close to one of the children, Olive (Abigail Breslin), who is the little girl with big dreams and who truly lights up the screen in every possible way. She has been accepted into a beauty pageant 800 miles away and the whole family reluctantly agree to take the trip to support the young girl.\rPaul Dano plays the other child, a 17 year old who broods and speaks very little during the film as he is having a vow of silence until he fulfils his dream of being a test pilot. Each member of the family have their own grievances which come into play as the film unfolds, and they realise just how much they need each other. The film holds many messages of family values but its underlying themes really hit home the most, it categorises everything in life into simple reactions from other people, preparation, dreams, routine and perseverance, but also despair. Its at these moments that realisation can hit, whether something may not be for you or if you simply don't fit in, its not down to anybody else to say otherwise, being yourself is the most important part and the point of it all.\rMuch like the job of Richard, the film is subtle and light-hearted life lesson from the excellent writing of  Michael Arndt, who holds the equally brilliant Toy Story 3 credit to his name, he manages to use various situations that can be summed up through equal means, Olive is the little girl who lets nothing get her down, and Abigail Breslin simply fits the role like a shoe. Steve Carell plays a character who has seen it all and simply isn't happy with it, and needs his dysfunctional family around him. Greg Kinnear delivers a riveting performance of a man who doesn't seem to pay close attention to his family, but this the exact reason why he struggles through, to support his family and not be seen as a failure. There to bring a realisitc approach to their situations is Alan Arkin, who tells it as it is and nothing more.\rA masterful yet subtle film that weaves in and out of every detail of a simple problem and lays it all out on the table to try and work out, with fantastic performances from each cast member who offer various explanations from their characters perspective that make this a must see show for a bit of comic relief and to get a lesson in being yourself."}, {"rating": "9", "text": "Really fantastic. Great performances, and some great laugh out loud moments. I understand the sitcom comparisons, but there's a subversive undertone that really makes it sing."}, {"rating": "9", "text": "I loved it! No, nothing blows up and nobody winds up getting hacked to death but that's half of the appeal of this film. All of us know the wanna-be successful dad. All of us know the chain-smoking mom in denial, pretending that if she doesn't acknowledge that her husband is a failure, her brother is suicidal and her daughter has no chance of winning the pageant that it all doesn't exist. Excellent job by Michael Arndt, the producers and directors. Best of luck to LMS as Best Picture of 2006!"}, {"rating": "10", "text": "By far, the best drama/comedy I have seen this year.  Everything about this was near perfect:  the casting, the acting, the character arcs, the storyline, and even the score/soundtrack.  I couldn't stop laughing throughout the entire movie.  If you have an interest in this, you MUST see it in the theater."}, {"rating": "10", "text": "This movie is a wonderful grin! If you need one, go see it. Couldn't find one thing wrong with it."}, {"rating": "9", "text": "Loved this movie--and I kid you not, one of the best mainstream movies I've seen all year.  This quirky, dysfunctional family is not so dysfunctional after all when they come out of their own worlds to rally behind Olive, the youngest in her quest to win Little Miss Sunshine child pageant.  The contrast between this kooky family and the pageant enthusiasts will certainly make you question what is normal?"}, {"rating": "7", "text": "The trailer made it seem like this movie was going to be some indie, high brow, artsy film but as stated it really was more like a sitcom. Fortunately the comedy though silly is never really juvenile and the drama manages to not be cheasy. Entertaining but like a sitcom episode easily forgetable."}, {"rating": "8", "text": "I laughed out loud quite a bit. Very funny, and highly recommended."}, {"rating": "10", "text": "This family puts the fun in dysfunctional. Creative, out of the box, and unexpected turns in this movie had us laughing so hard we cried."}, {"rating": "9", "text": "Owen Gleiberman is retarded. This is one of the best indie comdies since Swingers. I don't know anyone that didn't love it."}, {"rating": "2", "text": "The only reason I sat thru this film was to see as much of Alan Arkin as possible. Yes, everything was funny, but just too much. Best"}, {"rating": "9", "text": "I'm not one of those people who laughs out-loud in movie theaters, but this movie made me do that... over a dozen times. Awesomely funny."}, {"rating": "9", "text": "Hysterical, heart warming story."}, {"rating": "7", "text": "I had heard the critics say how good this movie is so I wantedI enjoyed the movie. I laughed at the funny antics like everyone else but I really started to get interested in it after I began to add up all the pieces of Alan Arkin's character and came to the conclusion that he's a child molester. There are so many signals that this might be true through out the movie that it becomes kind of sad. Sad because we, the audience, like the family are totally oblivious to the fact that he is probably molesting her the whole time he's in the movie. Because it's played by Mr. Arkin we think that this character is just a harmless heroin sniffing, foul mouthed porn magazine toting old man that just happens to share the hotel room with his granddaughter. The child is so innocent that she sees nothing wrong with sharing the strip tease he taught her to Rick James' \"Super Freak\" and the parents had no idea what he was teaching her. Even the shots of the little girls in the pageant remind you of JonBenet Ramsey and make you think \"what's going on here?\"."}, {"rating": "10", "text": "What a refreshing burst of fresh air in the comedy/drama genre. There is not a moment in this movie where the comedy seems forced or the acting overdone. Every ridiculously funny part of this movie is completely believable. Even the script is written and delivered in that rough unpolished way that makes you think these are 'real' people and we are a fly on the wall in there insane lives. Everyone involved in this movie deserves a very big pat on the back. We need more real comedies like this."}, {"rating": "0", "text": "They tricked me, and stole my money."}, {"rating": "10", "text": "Great movie from start to finish. This had me laughing one minute to holding back tears the next. Well-written & acted, I hope this movie gets nominations in every category. A++ all around. Abigail did a wonderful job in this film."}, {"rating": "8", "text": "Good show, almost great. So delicious that one tends to ignore the spillage when it goes over the top. As entertainment that rings true it's immediately gratifying, but the contrivances linger."}, {"rating": "4", "text": "Can you say \"overrated\". I kept waiting for something to surprise me and win me over...not! Oh, and I guessed the ending from the very beginning. It'll probbaly win best picture too. What a joke."}, {"rating": "2", "text": "Just because you leave the theater with a smile on your face doesn't mean it's a good movie. It means you like to see awkward little girls prosper and enjoy their childhood. Who doesn't? But everything leading up to these few minutes of Breslin enjoyment are painful to sit through and show no signs of humor at all. A for effort from Abigail but everything else failed miserably."}, {"rating": "0", "text": "Awful!"}, {"rating": "9", "text": "At the end of this movie I felt warmth in my heart."}, {"rating": "8", "text": "A fun movie, well-done, even though the plot has been little over-done."}, {"rating": "3", "text": "Mystifyingly bad. Oh, how I wanted to like it. Cliched characters assembled on a screenwriters factory line, with nary a breath of life in them (save Breslin, lovable without ever being cloying), a plot creakingly contrived from start to finish. Not one moment of this film rang true (ok, one - the sweet scene where Alan Arkin's 'foulmouthed grandpa' - i imagine this is what he was dubbed in the screenplay - assures Breslin's wannabe beauty queen that she is beautiful. Really - and this is the film at its most touching.), nevermind tickled the funny bone. Replete with gaping holes in character motivation/ development you could drive a truck through (the son wants to be a fighter pilot, so he took a vow of silence. This leads us conveniently to 'funny,' furious scribbling in a notepad, ' i hate everyone'. Teenage angst has never been so subtle!). Even the supposedly laugh-out loud finale felt heavy-handed and like a desperate, mean, and inexplicable ploy for laughs. Finally, it just felt so slight - at film's end, a great big shrug is all I could muster."}, {"rating": "9", "text": "I am amazed by some of the reviews here. If anyone here trusts user-submitted reviews, I beg you you to ignore any that are full of finger-shaking hyperbole and excessive use of first-year university words. This film is heartwarming, funny and charming. It's one of the few films I will watch when I want to be cheered up. It's Disney for tax-payers."}, {"rating": "6", "text": "The fact that late-summer audiences so enthusiastically embraced this mildly likable but largely derivative, unimaginative family comedy-drama/ social satire/ road movie/ would-be Microcosm of America is proof positive that at the end of an even more dismally mindless movie summer than usual, moviegoers are absolutely starved for anything that presents even an illusion of intelligence, originality or depth. The family dinner in the Hoover household that opens the movie, and in which all their goals, problems, conflicts and neuroses are artlessly laid out for us, is as clunky, amateurish and contrived as the worst Screenwriting 101 project can get, and the movie misses what should've been some easy, obvious targets completely: even though it tries to get some symbolic mileage out of dad Richard's aspiring career as a motivational speaker, a cursory viewing of a 3 AM infomercial featuring Tony Robbins and Leeza Gibbons yields far more pertinent (if unintentional) commentary about the motivation-for-money business than anything seen here. Acting is uneven: Greg Kinnear (Richard) mined the American Everyman field to much greater results in this year's earlier The Matador, while Alan Arkin, as a dirty old druggie grandpa, adds nothing new to that hoary old independent movie cliché. (But don't be surprised if, like Don Ameche and James Coburn, he walks off with a Lifetime Achievement --oops, Best Supporting Actor Oscar for this trite performance!) On the other hand, Toni Collette, as beleaguered mom Sheryl, proves once again, as she's recently done in The Night Whisperer and In Her Shoes, that she's any movie's secret weapon, while Steve Carell, who at this point in his career seems incapable of doing ANYTHING wrong, balances his manic, hilarious vocal work as Hammy the Squirrel in Over the Hedge with a wonderfully subtle, nuanced portrayal of Sheryl's suicidal gay brother. And the kids are alright, too: Paul Dano, as the Hoovers' resolutely mute son, says more with silences than many actors do with pages of dialogue, while Abigail Breslin, as would-be child beauty pageant contestant Olive, is a joy to watch because she's so thoroughly unaffected. (An Entertainment Weekly interview with her revealed that what she wanted right now more than anything else was to catch a frog. That seems to explain it.) In fact, little Olive herself is so sweet, sensible and thoroughly NORMAL that you can't help but wonder who left her in a basket on the Hoovers' doorstep many years ago; I loved how, even though she very much wants to be in this pageant, she's mature enough to sacrifice it on several occasions when a family crisis appears to interfere. And although one of those emergencies will prove instantly recognizable to anyone who's seen National Lampoon's Vacation, the movie really accelerates at roughly the same pace at which the Hoovers' smiley-face yellow van breaks down. The situations (and the family's reaction to them) get funnier, and the movie barrels into a terrific beauty pageant finale (with no small assistance by Beth Grant, who as an officious official, is a marvelous comic foil) in which Olive innocently exposes children's beauty pageants for the truly repellent, disgusting obscenities that they are. A lovely, Chaplinesque final shot ices the cake, but the question remains: is Little Miss Sunshine's dynamite finish enough to compensate for the sluggishness of most of what precedes it and bump it from a 6 to a 7? Well, let's put it this way, if the fierceness of its attack on kiddie pageants were enough to get them run off the face of the earth, it just might...but then, the JonBenet Ramsey murder (whose recent reemergence as a news story provided this movie with the most unsavory free publicity since the Three Mile Island nuclear accident boosted The China Syndrome back in 1979) wasn't quite enough to get those pedophilic meat parades banned, so..."}, {"rating": "10", "text": "Drawn from the same font as Sideways, full of dark humour, revelation, flaw and sunshine. I did not expect to be so drawn in, and the time flew so quickly I had to double-check the time when it finished. And yes, one of the most memorable and 'funny' climaxes ever filmed."}, {"rating": "10", "text": "Best movie I have seen in a few years."}, {"rating": "10", "text": "A funny, bittersweet piece with an outstanding ensemble. Extremely enjoyable and quite possibly the best film of 2006. Plenty of hilarious moments right alongside heartfelt family emotions. Highly recommended movie."}, {"rating": "10", "text": "Without question the best movie I have seen in 2006."}, {"rating": "10", "text": "Great little pic. Recognizable disfunctional family members with characters that will stay with you and ring true. Not a side splitting laugh riot a minute... that's not what it's about. But it is funny, witty and poignant... in a Capraesque sort of way. Fantastic casting! Kudos to all!"}, {"rating": "6", "text": "It was funny in parts and okay overall, but it could have been funnier. The direction and editing are largely at fault. . Laughs were stepped on and opportunities for good reaction shots were missed. When Duane has his revelation there are funnier things he could have said. The coming attractions for this were brilliant; the film not so much."}, {"rating": "10", "text": "This movie made me laugh so hard that my sides ached. On top of that, it had something to say about what it really means to be a winner. This movie is a winner!"}], "recommendations": ["instant_family", "the_big_sick", "sisters", "silver_linings_playbook", "blockers", "wanderlust", "neighbors", "palm_springs", "life_as_we_know_it", "seeking_a_friend_for_the_end_of_the_world", "chef", "the_family", "the_king_of_staten_island", "click", "me_and_earl_and_the_dying_girl", "the_intern", "good_boys", "the_40_year_old_virgin", "groundhog_day", "sextuplets", "knocked_up", "juno", "up_in_the_air", "friends_with_benefits", "we_bought_a_zoo"]}