{
  "id": 4767,
  "title": "Little Monsters",
  "starring": [
    "Fred Savage",
    "Howie Mandel"
  ],
  "runtime": 102,
  "genre": [
    "Adventure",
    "Fantasy",
    "Comedy",
    "Family"
  ],
  "description": "A young boy is scared of the monster under his bed. He asks his 6th grade brother to swap rooms for the night as a bet that the monster really exists. Soon the brother becomes friends with the monster and discovers a whole new world of fun and games under his bed where pulling pranks on kids and other monsters is the main attraction.",
  "releaseYear": "1989",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ynQT9NA4SBfoswIRkyrwqHe4aBz.jpg",
  "categories": {
    "plot": 7.1,
    "acting": 7.7272727272727275,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.0,
    "funny": 6.75,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Just another throwaway addition to the zom-rom-com genre. Considering the talent involved, it’s very middle of the road"
    },
    {
      "rating": "5",
      "text": "Expect a bad story and unrealistic events told in a funny way. At the end of the night I had a good laugh but it goes too far to really call it a good movie due to the fact the plot tried to be sensitive and funny at the same time."
    },
    {
      "rating": "7",
      "text": "This is a very cute and funny Australian horror-comedy about a kindergarten class caught in a zombie apocalypse. It’s actually a Hulu original, but it showed up on Hoopla a little while ago so I could actually watch it. The main dad character starts out SUPER unlikeable, but he gets better as the film goes on. I’m a believer that a protagonist does not have to be likeable, relatable or a good role model. They must be understandable and interesting, and this movie checked all those boxes for me. Josh Gad is also in this movie. He’s really annoying. He plays kind of a Pee Wee Herman-style kids entertainer, but he’s really a big jerk. I feel like I’ve seen that before in other movies, Death to Smoochy comes to mind. The story is also a pretty basic zombie horror-comedy setup and execution, not that different from Shaun of the Dead or Zombieland. Nothing too original going on. However, the best part of this movie that makes it worth watching is Lupita Nyong’o as the kindergarten teacher and her class. They bring the laughs and they bring the heart! She is really excellent in the role, and she’s a damn good singer too! The child acting I thought was quite good as well! As someone who is interested in becoming a teacher myself, I really got into this movie and enjoyed it a lot! I’d say it is worth a watch if you like horror-comedies or like working with kids. It’s fun."
    },
    {
      "rating": "8",
      "text": "Alexander England plays a hapless musician who escorts his nephew on a kindergarten field trip (Lupita Nyong'o is the teacher). Soon after they arrive at the petting zoo, there’s a zombie outbreak and they have to protect this kids. Yes, this is a comedy…and a fun one. These 5-year-olds are delightful (esp. a deadpan Diesel La Torraca as the nephew). Nyong’o reveals her comic charms and action chops, but the highlight of her performance is her rendition of “I Don’t Want to Live on the Moon.” Josh Gad also takes a riotous turn as a kid’s show host with a bad attitude and a potty mouth. This Australian import has enough quirky edges and snappy writing to make it thoroughly clever and ultimately very sweet (who ever thought I’d say that about a zombie flick?)."
    },
    {
      "rating": "8",
      "text": "This film is an original take on a genre that has been done to death (pun intended). Alexander England perfectly portrays down-and-out loser musician Dave with Lupita Nyong'o's adorable Miss Caroline. Feel-good fun for (not) the whole family"
    },
    {
      "rating": "8",
      "text": "Funny and heart-felt, anchored by another superb Lupita Nyong'o performanceKind of like a cross between Kindergarten Cop (1990) and Shaun of the Dead (2004), Little Monsters is a hilarious and unexpectedly moving piece of work. The storyline is unquestionably clichéd – a loser who cares only about himself is forced to protect others, realising he's been a douche and must change his ways (with the help of a good woman, of course). We've seen this narrative template countless times before. But what's extraordinary about writer/director Abe Forsythe's Little Monsters is that he's able to create likeable characters and elicit genuine emotion from an archetypal structure (the zom-com) that seemed to be in its death throes.Dave (Alexander England) is a man-child whose life is going nowhere. Unemployed and recently separated from his girlfriend Sara (Nadia Townsend), he moves in with his sister Tess (Kat Stewart) and her son Felix (Diesel La Torraca). Taking Felix to kindergarten one day, Dave meets and becomes infatuated with Felix's teacher, Miss. Caroline (the always radiant Lupita Nyong'o), and when a school trip to Pleasant Valley Farm petting zoo requires an additional chaperone, Dave leaps at the chance. However, an accident at a nearby US army base releases a horde of zombies, and so, trapped in the zoo and determined not to upset the children, Caroline must try to convince them that everything they see is part of an elaborate game.The thing that struck me most about Little Monsters wasn't the zombies or the comedy, but the emotion; Forsythe never allows the humour to dissipate, constantly tempering the sentimentality. And it's a sentimentality that feels authentic and, more importantly, feels earned. Forsythe, whose son is five and has just started kindergarten, was inspired by his personal experience of anxiety upon handing his child over to a kindergarten teacher, with the zombies introduced later. This is an important point, as they're a means to an end, with no real importance vis-à-vis what the film is trying to say - which is that children can confer strength and, with their uniquely innocent perspective, offer a non-judgmental and often exceptionally perceptive view of the world.The film's comic structure definitely has a vibe of La vita è bella (1997), with Forsythe getting a lot of mileage out of Caroline trying to keep up the illusion that everything is a game – zombies chasing people is a game of tag; the longer the children all survive, the more levels they will complete in the game; the blood all over Caroline is jam. Even funnier, at one point one of the kids complains because she thinks the zombies look too fake. The film also features one of the best sight gags I've ever seen, involving Dave and a photo of Caroline…or is it? There's also a brilliant scene involving Felix and a Darth Vader outfit, which features him trying to use the Force in a rather awkward situation, later telling Tess, \"I am your father mummy\", a line which made me laugh more than it probably deserved.In terms of the acting, Nyong'o owns the film – her performance is physical, emotional, authentic, lived-in, and when the time comes, she's fierce and driven, with a real sense of psychological verisimilitude that renders Caroline as a believable, relatable person, complete with human fallibility. She also plays the ukulele for real, has perfect comic timing, and her singing voice is pretty damn good too.Aside from Nyong'o, the film's other stand-out performance is a wonderfully over the top Josh Gad, playing US children's entertainer Teddy McGiggle. Introduced as a kind of hyperactive but generally affable Mr. Rogers, we soon learn that McGiggle is a cowardly, self-obsessed, alcoholic, sex-addict, who hates children and his comedic companion, a hand puppet named Mr Frogsy. And Gad has a blast digging into this litany of character failings - whether it be tearfully confessing to Dave that he's addicted to sex with single-mothers; drinking hand sanitizer; screaming at zombies, \"I f****d your mother\".If the film has a problem, it's probably the character of Dave. We're asked to like him from the get-go, but his introductory scenes don't make it easy, as he comes across as a self-important and lazy slob. Of course, that's how he's supposed to come across, as it sets up his redemption arc. Some people, however, will undoubtedly sour to him to the point where that arc seems perfunctory, even cynically fake.That notwithstanding, Little Monsters is a real gem - rarely have I seen a film so sentimental that avoids becoming turgid. Nyong'o grounds the whole thing, Gad chews the scenery magnificently, and Forsythe nails the comedy/zombie balance. The zom-com subgenre is almost completely in the rearview mirror, but Forsythe has been able to craft an emotionally genuine (and genuinely emotional) film that actually has something to say, and that has tremendous fun saying it."
    },
    {
      "rating": "7",
      "text": "It provides a few good laughs whilst remaining fun throughout the entire film. Unfortunately the zombie parts feel a little low budget. Shoutout to Australia representing but how crap that it made zero impact in Oz."
    },
    {
      "rating": "8",
      "text": "A really sweet film that I encourage everyone to watch. It’s not the greatest film in the world but I loved the message that it was trying to convey. My IG: @milogr.ay"
    },
    {
      "rating": "7",
      "text": "Should you escape Little Monsters (2019)?The Stream: It takes too long for the monsters in Little Monsters to appear.The Big Screen: Funny and sweet mixed with the suspense of the zombie chase makes for a good combination.The Final Bill: Zombie comedies have been done before, but this one has Lupita Nyong’o kicking butt and saving children.-Trip FontaineLittle Monsters premiered this weekend on Hulu. No, not that Little Monsters – the classic from 1989 starring Fred Savage and Howie Mandel about the monsters that live under the kid’s bed. Little Monsters (2019) is a little bit Shaun of the Dead and a little bit Kindergarten Cop.  Because this movie is already on a streaming device and “time is money”, I will tell you whether it is worth your time to stream Little Monsters.From the trailer, you might believe that the movie is about a group of students on a field trip that gets overrun by zombies, and it is. It just takes a good 25-30 minutes to get to any of the monster action. We are transported to Australia where slacker, rockstar wannabe, Dave, is having an ongoing argument with his girlfriend. Needless to say, that relationship doesn’t end well such that Dave moves in with his sister and precocious nephew, Felix. Of course, Dave is inept and inappropriate in caring for Felix until he meets Felix’s luminous kindergarten teacher played by, Academy Award winner, Lupita Nyong’o. Eventually, the kindergarten class embarks on a field trip to Pleasant Valley Farm, which is next to a U.S. military base where some unexplained experiment is going on and going wrong. Zombies ensue.Sure, it is a bit derivative of these other zombie comedies and other movie clichés abound. England’s character is the cliched unreliable uncle. Josh Gad plays a children’s television host, who is not-so-surprisingly less kid friendly off camera. Zombies stalk the set and crave flesh as they are known to do. The biggest savior/revelation for the film is Nyong’o. She sings, she kills zombies and she’s a delightful presence as the kindergarten teacher every 5 year-old should have. It is refreshing to see Nyong’o as the object of affection and a romantic lead here, and she has nice chemistry with England. There are some laughs here and there and some good music, if you’re a Taylor Swift fan especially. The zombies are grotesque-looking, so the makeup was on point. There are some really tense moments where you do not know whether they all will make it.Ultimately, Little Monsters is not a must see film. If it were in the theater, I’d tell you to skip it. Since it is already on Hulu, it is probably a movie to watch on a lazy Sunday afternoon, especially with Halloween coming up, even if it is just to marvel at how remarkably talented Lupita Nyong’o is. I wish she had more starring roles.Great job, Trip! I must agree but with a caveat for the new parents in the world out there. If this came to theaters, I wouldn’t say completely skip it but it is must definitely a streaming gem. We haven’t seen a movie where toddlers are put in such peril. This movie is basically every new parent’s nightmare! For those of you with a kindergartener, I might say definitely check this out for the Halloween season, even if it’s for zombie apocalypse preparation. And for those of you looking to netflix and chill in this ghastly time of year… definitely check it out."
    },
    {
      "rating": "7",
      "text": "World's worst human makes amends by protecting his nephew and classmates from American military-produced zombies on a school trip."
    },
    {
      "rating": "6",
      "text": "A few good laughs throughout and a movie thay doesn't take it's self too seriously.Entertaining"
    },
    {
      "rating": "2",
      "text": "Not fun, the hero is pathetic, everything is predictable, kind of though that was a horror movie for kids (because there are many kids) but as the hero is doing and showing his sexual thoughts about pictures, i don't think this is for them. 2 points because of the teacher and the cute kids who are acting. I longed 30 minutes before to stop, that was horrible and boring as you can guess."
    }
  ]
}