{
  "id": 3328,
  "title": "Live by Night",
  "starring": [
    "Ben Affleck",
    "Elle Fanning"
  ],
  "runtime": 129,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "A group of Boston-bred gangsters set up shop in balmy Florida during the Prohibition era, facing off against the competition and the Ku Klux Klan.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bkd46T4RplawnDjpHoI8mhzTLks.jpg",
  "categories": {
    "plot": 5.48936170212766,
    "acting": 5.133333333333334,
    "ending": 6.333333333333333,
    "soundtrack": 3.75,
    "cinematography": 4.5,
    "familyFriendly": 3.0,
    "funny": 3.0,
    "action": 6.75
  },
  "reviews": [
    {
      "rating": "8",
      "text": "An interesting story about a guy living in Boston, who dates the wrong woman. But then becomes a big shot working for the italian mob. Ben Affleck plays a guy who is crafty, and has to deal with racists and people from his past to accomplish his goal. And alltogether, it is quite enjoyable to watch.I can keep this short saying i was pleasantly surprised by the movie and a look in the prohibition. It's an excellent movie, i give it an 8/10."
    },
    {
      "rating": "8",
      "text": "Great movie! I really enjoyed the story and as I like gangster movies, this certainly was one of the best in last few years. The acting of course was really good too."
    },
    {
      "rating": "8",
      "text": "Having read the novel by Dennis Lehane, it became apparent that any adaptation of the novel would have to be long in order to capture the sprawling grandness of the novel. From Boston to jail to Ybor City to Cuba, the book has a lot of players, a lot of angles, lots of action and moving parts, and a lot of subplots. The film adaptation sticks largely to these transitions and mentions many of the subplots without diving into them. This is both to the film's detriment and betterment as it often feels as it lacks the depth necessary to make all of its pieces work, but also feels like it is adding in too much. As many have said, making it shorter or longer would have been for the best. However, the final product - which sits at just over two hours in length - is very, very good. Ultimately a barometer on how much people like Ben Affleck, the critical and audience reaction has said that Affleck sucks at either acting, directing, or writing, or a selection of the trio. Fortunately, for me, I do really enjoy Affleck's work in all three arenas. As such, Live by Night falls right into my wheelhouse and, for the most part, works very well.That said, it is hardly perfect. The beginning section, set in Boston and in jail, is rocky to say the least. For critics who do not enjoy Affleck, this early section makes it easy to write it off as nothing more than a derivative homage to old school gangster and noir flicks. With a femme fatale, underdeveloped morality elements, heists, a cop father, and brushing shoulders with death and gangsters, and doing all of these while smoking a well shot cigarette in a suit with a fedora, the beginning is derivative. It is also messily put together, typically shot, and poorly edited. Scenes smash into one another as Affleck skims through the first 100+ pages of the book to try and get to the good part. He sprinkles little pieces here and there to set the scene and tries to rush through it all. Likely, editing this portion was a real pain as it is the slowest part of the film and is entirely necessary. As such, it flies by and feels wholly inadequate.For this who decide to stick around, however, Affleck delivers a tremendous gangster flick once we hit Ybor City. Charged with running the rum operation in Tampa of gangster Maso Pescatore (Remo Girone), Joe Coughlin (Affleck) is a nice guy. He can kill, but cannot live with the guilt. While the beginning is derivative and typical of gangster flicks, this section is hardly typical. Cruel gangster with a conscience has been done before, but not quite like this. Instead, he is an uncruel gangster who operates more as a remorseful businessman. His line of business demands violence, but unless the person makes an overt case for deserving a bullet to the head, he is hardly a gunman. Instead, he runs a tremendous operation and lives out the American dream with his best friend Dino Bartolo (Chris Messina) at his side. Taking on the KKK and the gang of Albert White (Robert Gleinster) at every turn, Joe is able to defeat all comers. He corners the market in Ybor City and, as the book explains more and the movie hints at, the entirety of the South stretching to New Orleans. Raking in cash, he also meets a Cuban freedom fighter who becomes his wife, Graciela Suarez (Zoe Saldana). Life is good as he plans on opening a casino to preempt the legalization of alcohol. Until he meets Loretta Figgis (Elle Fanning).The daughter of Chief Sheriff Irving Figgis (Chris Cooper), Loretta is gorgeous. She is off to Hollywood, but trips along the way and falls into heroin and the sex trade. Joe brings her back to Ybor City as his end of a bargain with Irving in exchange for a KKK member's head. Loretta returns and becomes a preacher who commands a large congregation and builds up serious political sway. She also happens to be anti-gambling, as she views it as a vice and a sin against God. Though directed to kill her, Joe cannot. She kills the casino deal and ends Joe's run as the Mayor of Ybor. Why could he not kill her? Well, to explain that, it really dives into what makes Live by Night so good.Early in the film, Joe's father Thomas Coughlin (Brendan Gleeson) warns his bandit of a son that we reap what we sow in life. Joe, a good man, knows this. He knows that his gangster lifestyle will come back to haunt him because of the violence he must commit to remain relevant. He kills people via booze, pimps out girls, and sells drugs. He is not a good man and this bothers him. As Albert White explains to Joe early in the film, Joe is looking for somebody to make him pay for his sins. Joe is remorseful and regrets his sins, which is why he cannot kill Loretta. He envies and admires her. She went to hell and back. She preaches and lives up to the word of God. She sinned and escaped retribution for her sins. She outran the rebuking (her father spanking her does not count). This is really underscored in the final shot of the film."
    },
    {
      "rating": "8",
      "text": "Live by night is a slick, action packed crime thriller. This movie has great acting and many action scenes to satisfy fans of the gangster crime genre."
    },
    {
      "rating": "8",
      "text": "Pretty Good Crime ThrillerYeah, I know I'm supposed to hate Ben Affleck because he did his woman wrong or he was a horrible Batman or because he got into a fight with Bill Maher over liberalism, blah, blah, blah, but all of that nonsense aside, this was a good, solid crime thriller period piece. I wasn't alive back then and neither were any of you, so take it with a grain of salt and enjoy the ride. It's got Irish mob, Mafia, Cuba, prohibition, gambling, Florida, murder, sex, violence, bombing, and the story is just fine--not disjointed at all. No, it wasn't \"The Godfather\" - and I didn't expect it to be. But after all the negative press, I almost expected it to be \"Plan 9 From Outer Space.\" It wasn't. It was a good way to spend 2 hours and 10 minutes. Kept my attention which plenty more than I can say for many new films."
    },
    {
      "rating": "8",
      "text": "Very nice gangster effortLIVE BY NIGHT is a tour-de-force gangster epic from Ben Affleck, set in 1920s Florida where rival gangsters seem to spend the whole running time plotting against each other and striving to win control of their turf. It's a lively, well-paced effort, directed very nicely by Affleck himself, who also bags the main role. The film reminded me of BOARDWALK EMPIRE particularly, which may have been the intent, and has the same quality of cinematography and feel. There are action scenes sprinkled liberally throughout and they're immersive and impressive, particularly a wonderfully old-fashioned car chase. The supporting cast is dotted with familiar character actors giving solid performances and overall there's very little to dislike about this one."
    },
    {
      "rating": "8",
      "text": "[][][][][][][][][][][[[][][][][][][][][][][][][][][][][]!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,!,"
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%"
    },
    {
      "rating": "8",
      "text": "Gangster MovieI went to the theater to watch a Gangster/Mafia movie, and I got one. Mafia movies are by far my favorite type of movie. Live by Night delivered that 1920's gangster look. Ben Affleck does an amazing Irish Mafia member persona. The story was very moving and the characters were likable. There was just enough action in the movie. The tommy gun fight scenes felt like a real 1920's gang shoot out. Live by Night shows a true gangster movie look. Most Mafia movies rely on the story to make their movie good. Live by Night uses action and an amazing story. I had a little trouble with keeping up with the names of the characters but later on I started memorizing their names. Definitely go see this movie if your a gangster/mafia movie fan. Live by Night will not disappoint you."
    },
    {
      "rating": "8",
      "text": "÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷===============================■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "8",
      "text": "=;=:=:=;=:=:=:=:=:=:=;=;=;=;=;=;;=;=;=;=;=;=;=;=;=;=;=;= ◇♡◇♡◇♡◇♡◇♡♡◇♡◇♡◇♡◇♡◇♡◇♡●■●■"
    },
    {
      "rating": "8",
      "text": "Pretty Good Crime ThrillerYeah, I know I'm supposed to hate Ben Affleck because he did his woman wrong or he was a horrible Batman or because he got into a fight with Bill Maher over liberalism, blah, blah, blah, but all of that nonsense aside, this was a good, solid crime thriller period piece. I wasn't alive back then and neither were any of you, so take it with a grain of salt and enjoy the ride. It's got Irish mob, Mafia, Cuba, prohibition, gambling, Florida, murder, sex, violence, bombing, and the story is just fine--not disjointed at all. No, it wasn't \"The Godfather\" - and I didn't expect it to be. But after all the negative press, I almost expected it to be \"Plan 9 From Outer Space.\" It wasn't. It was a good way to spend 2 hours and 10 minutes. Kept my attention which is lot more than I can say for most new films."
    },
    {
      "rating": "8",
      "text": "I don't fathom what people didn't comprehend about this. The movie was very fine. It can easily be considered as one of the best gangster movies we came across this year. As a viewer I was able to see the amount of hard work the team had put on. The movie was very refreshing. The screenplay was awesome so was Cinematography & Direction. Actors also joined hands and it was looking in the screen. I could feel it. This movie was as realistic as it could get. Maybe some people didn't understood. Not everything needs to be understood by everyone anyway. It's a must watch movie. And if you like crime Genre then you cannot miss this one. This movie is full of aesthetics and entertainment. It'll grip you to your seats. Just ignore the negativity & don't miss this one. It'll leave an impact on you. And you'll surely feel refreshed."
    },
    {
      "rating": "8",
      "text": "Ben gives an intriguing performance in Live By Night. Ben's character is very clever & he outsmarts his rivals with his ingenuity. The gangster saga is riddled with cliches, but it rises above its drawbacks. The movie is chock full of action galore gangster style, narration by Ben, a solid supporting cast and there are even neat twists in the movie in the later part of the film. Ben also directed this crime thriller and this is one of his better films of recent years, B+."
    },
    {
      "rating": "8",
      "text": "@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@"
    },
    {
      "rating": "8",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "8",
      "text": "A dark, violent film but fascinating.Joe Coughlin (Ben Affleck, who also wrote and directed) is Tom the police chief's son (Brendan Gleeson) in 20's Beantown. Nevertheless, he prefers the life of crime himself. He and his co-horts rob banks and poker games, upsetting his papa greatly. Love, however, remains strong between the two. Moreover, Joe is small peanuts in a town run by two mob leaders, one an Irishman and the other Italian. As fate would have it, Joe falls for the Irish mobster's \"moll\", Emma (Sienna Miller) and begins a clandestine affair, knowing the consequences if Boss Albert finds out. Joe daydreams so much about Emma that on a routine bank heist, his foggy mind upsets the apple cart. This leads to a police chase and fiery crash; Joe escapes, the cops do not. Albert IS looking for Joe, for he knows the score now, but doesn't get there before Tom arrives. Pulling strings, Tom gets Joe a very light sentence of three years. Wow. When he gets out, Joe doesn't know where Emma is, believing her to be dead, and decides to \"relocate\" to Tampa Florida, working for the Italian Boston Boss. He does this because the Irishman is worming his way into bootlegging and gambling down south, too, in Miami. Once there, Joe does a fabulous job, working with Cubans including lovely Graciela (Zoe Saldana). The straight-laced police chief, Figgis looks the other way and has a beautiful daughter, Loretta (Elle Fanning) who is off the star in Hollywood. But, what happens when the Italian mobster begins to believe Joe is weak and not into \"killing\" anymore? What about Albert, is he still looking for Joe? This very fine movie has great performances, many twists and turns, gorgeous sets, fabulous costumes, and a style that dazzles. Who can we thank? Why, first, Affleck who stars, writes, and directs and Dennis Lehane, whose novel came first. Purists may want to know that the ending of the film is different from the book while those who detest violence won't want to watch it. Even so, the violence is not pervasive and the story too good too miss. So, movie fan, don't skip it."
    },
    {
      "rating": "9",
      "text": "Google ImageLive by Night is a old style gangster movie, that plays out in the height of the prohibition era on the east coast and the south of the Untied States. It features Ben Affleck, Sienna Miller and Zoe Saldana amongst a whole host of other stars.When Joe Coughlin comes back from serving in the First World War he is done taking orders. He’s seen too many good people die senseless deaths following other people's directions.After he returns to Boston he decides to become an outlaw. For the next ten years he sleeps by day and lives by night, robbing anyone worth stealing from. But, robbing banks and gaming parlours had to bring him to the attention of the wrong people at some stage.His life style eventually catches up with him when he finds himself caught between the Italian mob, lead by Maso Pescatore, and the Irish mob, lead by Albert White. Joe’s lover is the girlfriend of Albert White, a fact that hasn't gone unnoticed by the Italians. Maso Pescatore tries to blackmail him with that fact into killing White.Coughlin refuses as he still resents taking orders from anyone and also does not want to be associated with the mob. Pescatore rats him out to White, landing Joe first in hospital and then in prison. His lover is killed in the mayhem following the events that lead up to Joes incarceration.A new StartWhen he gets out he decides to join the Italian mob after all, hoping to be able to avenge Emma’s death. Maso sends him down to Tampa, Florida to wrestle the city from Albert’s hands, who has taken over the rum distribution in Florida. That first task accomplished Joe sets out to build en empire, taking full advantage of the illegal booze trade during the height of the prohibition.While in Tampa he forms an alliance with Cuban siblings, one of them is Gabriella Corrales, whom he eventually marries. Being in a relationship with a black woman however, brings a whole new set of trouble in form of the Klu Klux Klan to his doorstep. After some initial set backs, Joe disposes of local splinter group the Italian way.In the end there is a big show down between Joe, Albert White and Maso Pescatore.I really like Live At Night. It is an good old fashioned gangster movie, something you don't see often anymore. The script is great, although it did feel a little long winded at times. At some points I could not believe that there was yet another twist in the story. But in the end it all made sense.Ben Affleck was a busy man with Live By Night. He wrote the screenplay, directed the movie and starred in it. Leonardo DiCaprio and Affleck are listed as producers. It’s not the best movie ever made, but it is definitely worth watching."
    },
    {
      "rating": "8",
      "text": "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
    },
    {
      "rating": "8",
      "text": "¤¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "8",
      "text": "Synopsis- In the roaring '20s, Prohibition hasn’t stopped the flow of booze in an underground network of gangster-run speakeasies. The opportunity to gain power and money is there for any man with enough ambition and nerve and Joe Coughlin, the son of the Boston Police superintendent, long ago turned his back on his strict upbringing for the spoils of being an outlaw. But even among criminals there are rules and Joe breaks a big one: crossing a powerful mafioso by pilfering his funds & his moll. The fiery affair ends in tragedy, setting Joe on a path of revenge, ambition, romance and betrayal that propels him out of Boston and up the ladder of Tampa’s steamy rum-running underworld."
    },
    {
      "rating": "8",
      "text": "DaydreamingNot exactly of course. And if you want to get a high position in a criminal organization, you probably should never sleep, let anyone out of your eye sight and be strapped all the time. But this may make this sound a lot more action paced than it is. This actually takes a page (or more) from older crime movies, especially when it comes to its pacing and storytelling in general.That may not be everyone's case of course, so that will be up to you. Still you can't fault the movie for its quality and while it is not another \"Town\" (though that eventually happens too, no pun intended), this does move correctly into a different territory and shows off Ben Afflecks other qualities. A strong and stellar cast in a slow burning movie ... sounds good?"
    },
    {
      "rating": "7",
      "text": "Critics have been out for blood in every movie that Ben Affleck has involved himself in lately. First came the unjustified hate that came to \"Batman V Superman\" which lead to the corporate mishandling of \"Suicide Squad\" which would have been trashed either way. Then the slick but flawed action thriller \"The Accountant\" premiered and received more critical distaste. The difference with \"Live By Night\", is that the critics finally got what they wanted, a bad release date and an overblown budget caused the loss of up to $70 Million for WB. It's interesting how after just one super hero movie, Ben is already being treated the same way as someone like Michael Bay, or Roland Emmerich. \"Live By Night\" is the best gangster tale i have seen since Michael Mann's \"Public Enemies\"."
    },
    {
      "rating": "7",
      "text": "Do you remember? Ben Affleck's breakthrough came alongside then-BFF Matt Damon, starring in \"Good Will Hunting\" (1997) for which they both also won Academy Award for best original screenplay.Affleck's career hasn't been as chock-full of rock solid movies as Damon's but he's still a fine actor and some would say he's even better as director. He won his second Academy Award for directing \"Argo\" (2013) but his first works in this field, \"Gone Baby Gone\" and \"The Town\", are really good also.\"Live by Night\" is probably meant as Affleck's magnum opus, with him directing, starring and adapting another Dennis Lehane's novel (after \"Gone Baby Gone\").It's a good-looking, majestic, violent and slowburning mafia drama taking place in 1920-30's USA, from Boston to Florida. In a good way, it's really reminiscent of such great classics as \"The Godfather\" and \"Scarface\". Sometimes it feels more like the former, the other times the latter. But the result is not just me-too-project because mafia dramas are cool. The ambitions have been higher.Affleck is careful to build up the authentic setting and let characters have enough depth to make us actually care. Like in good tv series, he takes his time creating the atmosphere but also offering enough brutal bloodletting to keep the more impatient viewer satisfied.There's no serious problem with the result... but \"Live by Night\" is too traditional. It's like re-watching your favorite mafia epics – from recent stuff, I'd recommend HBO's \"Boardwalk Empire\" – but with a big helping of sad-faced Affleck. It's all good but not so fresh anymore. What's worse, these days many of the other screen stories about criminals offer this kind of experiences too. You can enjoy comparable quality, from Netflix's \"Luke Cage\", for example. Americans really know how to put together stuff like this, and they have done so many times, which doesn't work for Affleck's favor.On the other hand, if you haven't seen enough of this kind of stuff, \"Live by Night\" offers everything the genre fan needs: good story, exciting action, convincing characters, really good cast of actors... Affleck fills the lead and has the most amount of screen time. There are also Sienna Miller and Zoe Saldana as two of his biggest loves, Brendan Gleeson as his father, plus various interesting characters played by Chris Cooper, Elle Fanning, Miguel (yes, that R&B star), Matthew Maher, Chris Messina... I didn't just list a bunch of actors here, all of them impressed me with their performances and colorful characters. \"Live by Night\" may not be super gripping story-wise but it sure does have a lot of cool actors in memorable roles. Considering how many moviemakers just seem to waste the acting talent they have been given, it surely must count for something.I enjoyed how there's something interesting nuance or detail about each and every major character. For example, the lead man doesn't just want to be gangster and chooses to see himself just an outlaw. His priority is to be his own man and he dislikes violence, choosing the diplomatic way whenever possible. For most of the time, he even questions if he's cruel enough to hold this position of power he has gained. You will remember him as sad, haunted man locked between two worlds, never quite achieving neither peace nor freedom he seems to want so much.That may not be all that original but mafia epics don't usually offer this kind of depth, outside of TV world."
    },
    {
      "rating": "8",
      "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●$*$*$*$*$*$*$*$*$*$*$*$*$*$*+.÷.÷.÷.÷.÷.÷.÷.÷.÷.÷.÷.÷."
    },
    {
      "rating": "6",
      "text": "Not a bad movie. forty-nine for such work is not enough (the score of Critic Reviews). I enjoyed watching this movie from beginning to end. The film keeps you in suspense and does not disappoint at the end"
    },
    {
      "rating": "7",
      "text": "Affleck has suited up to currently be the most prominent actor. He came back with movie of the year Batman V Soup(yes that's intentional)erman and followed up with one of the best action flicks of 2016 The Accountant. And now we got another great one. Will this be his last one until Justice League? I'm gonna say yes but not definitively since the advertisements for this movie came out of the blue. It's too bad this was a critical and commercial flop. But the best are not always getting what they deserve."
    },
    {
      "rating": "5",
      "text": "I felt the movie was very long and drawn out, it could have done with a shorter plot line that summarised the story better. I look forward to what Ben Affleck has to offer next."
    },
    {
      "rating": "7",
      "text": "Would have worked better as a mini-series (because it would allowed some of the themes to breathe), but overall has some great moments and it's well-acted."
    },
    {
      "rating": "6",
      "text": "One of the best things about Prohibition-era gangster flicks is that you can bet on neat old cars, cool period clothes and traditional violence. They spent plenty of money on film one to give it rich historical heft, but writer/director Ben Affleck didn't bring anything new to the genre. He also plays the lead, a somewhat principled crook, who resists pressure to join a gang until he has no choice. This takes him to Tampa, where he gets involved with the rum trade and a beautiful Cuban woman. This movie unfolds with predictable plot points and uninteresting characters, but has sufficient energy to keep it moving. What it's missing is any compelling drama or emotional impact. Instead, it's a rather bland, quickly forgettable entry into the gangster pantheon."
    },
    {
      "rating": "10",
      "text": "I have not yet had the opportunity  to watch the movie, I'm sure it will be brilliant as the book, because I trust the work of Director Ben Affleck , besides the wonderful cast."
    },
    {
      "rating": "2",
      "text": "Ben Affleck wrote, directed and starred in \"Live By Night\" but forgot to act, to bring any excitement to the screen or make an interesting story!! He gives a very bland performance and with all sorts of car chases, killings, shoot outs, and even the KKK burning crosses, the film feels and looks static. The three female leads are flat-chested and rail thin almost being interchangeable while it seems in the 1920s and 1930s all gangsters were ugly looking. Taking place in Tampa and Ybor city, Florida, with Savannah, Brunswick, Riceboro, Tybee Island filming in for those 2 places, for tax credits, it definitely doesn't have a Florida feel.Affleck as a wanna-be kingpin in the underworld, but seeing himself as an outlaw instead of a gangster, with rum running and trying to introduce casino gambling he first works for the Irish mob boss Albert White, played by Robert Glenister, and then the competing Italian mob boss Maso Pescatore, played by Remo Girone.There are a couple of twists near the end after 2 hours and 8 minutes but they don't really pay off.The aforementioned female leads, in order of appearing, Sienna Miller as White's mistress who has a secret relationship with Affleck, Zoe Saldana as a black Cuban who also becomes Affleck's lover, (ah, it is nice to be a director, writer, lead actor and co-producer of a movie) and Elle Fanning as a 'fallen' woman who becomes an evangelical preacher all do fine jobs but are not given enough to fill out their characters and Fanning is given short shrift on what could have been a more interesting part in the film.Many of the men, and there are many, give strong performances but with Ben Affleck commanding 100% screen time they aren't given that much time. Chris Messina as Affleck's loyal righthand man, Chris Cooper as the sheriff of the Ybor city area and the father of Fanning plus the brother-in-law of a KKK leader Matthew Maher, along with Brendan Gleeson as Affleck's father and Police Deputy not to forget the gangster bosses Robert Glenister and Remo Girone are just a few of the actors.\"Living By Night\" is a waste of good actors, a failure as director, writer, actor and producer for Ben Affleck and a waste of your time and money."
    },
    {
      "rating": "4",
      "text": "This movie is beautifully shot. The images compensate somewhat for the wretched acting, lack of character development and predictable plot. Almost all of the focus is on Ben Afleck (who unfortunately is at his most bland and vacuous). Villains, sidekicks and female characters get very little to do, so when they disappear or die, ho-hum."
    },
    {
      "rating": "1",
      "text": "Um filme de mafia aonde tentaram transformar o mafioso no mocinho puritano antiracista. Um monte de romance chato, pouca ação e explicações por coincidências preguiçosas."
    },
    {
      "rating": "6",
      "text": "Fall and rise, a revenge tale.Number four for the director Affleck after his other film won the Oscars four years ago. He has also written the screenplay and produced it. It was based on the book of the same name. The story of a World War I veteran turned notorious gangster. Escaping from the war, falling in love with a gangster's woman, a bank heist, prison time, the son of a police officer and his journey to the top of the criminal world after losing everything at one stage of his life. More like a revenge film, but the intention was not aggressive. Only the time and the life passage give one to him.From all his directional films, probably this could be the worst one. It had everything a gangster film needed like gun fights, car chase, revenge, romance, yet I felt lacked depth in its overall theme. Actors were not bad, the settings looked fine. The length of the film was a bit long, but the film offered nothing new. It looked like someone's biography or made it look like one. I think that's the point. Even the end part of the film extends, only to annoy us after two long hours patiently sat for it.The best part of the film, what I liked was the 1920s. The story about between two the World Wars, that too was about an internal affair like underworld activities looked nice on the screen. The cast and crew were best for the film, yet failed to impress us. Though it was not totally a bad film of the year, only it did not stand and deliver as it was promised. So, still it can be watched once if you prefer, but not guaranteed entertainment.6/10"
    },
    {
      "rating": "4",
      "text": "Elle Fanning is worth watching    but there is just    absolutely    nothing exciting about this film, completely middle of the road"
    },
    {
      "rating": "6",
      "text": "Hard to put a score on this one. On one half the film is brilliantly directed by Ben Affleck and everyone is giving it there all. The production values, costume designs, music all top notch. The problem is that the story isn't all there. The action scenes were absolutely terrific and all the tension as well. I was invested in the first act of the movie then it kinda deflated. Affleck does show once again that he is a terrific director but his screenplay is much to be desired."
    },
    {
      "rating": "6",
      "text": "In the end, I think is a good movie. The resolution is great at every level.But the truth is the first act is quite boring. A lot of characters are presented with (boring) care. After the work is done (and it feels like work, which is quite awful, probably), the movie starts to pick up in tensionThe third act is really great and makes the movie what it is.The performances are just fine in my opinion. Professional might be the right word. So... If you like Ben Afflect, you have to see thisIf you DISlike Ben Afflect, you better not see itIf you are indiferent to him, I recommend it"
    },
    {
      "rating": "3",
      "text": "Live by Night, in a few words, is a bit of a mess. There are multiple, multiple problems with it, many branching from Affleck's ambitious idea to direct, write, and star in it, and not releasing a satisfying result. One problem with doing all three of the above, is that there wouldn't be as many people to say \"uhhh Ben, the screenplay for this scene doesn't really work,\" or \"act like this,\" or \"maybe the shot should look more like this,\" since he made many of the decisions.Characters/Acting: Despite the all-star cast, there were too many people to keep track of, and most of the characters I just forgot about or didn't care for. A bunch of characters just kind of die; Loretta, a key character in the movie, shows up for about 5 scenes and then dies off-screen. The worst part about the death was the treating of it. The scene addressing her death basically goes, \"Hey Joe, that girl who you seemed to care for and gave you some insight on life and was the daughter of the cop you're working with died.\" \"Oh. That's too bad.\" Aaaand cut, move on to the next scene. Ben Affleck, in my eyes, isn't the most talented actor to go around, but he can deliver when needed. This was not the case, though. His accent's all over the place, as well as Zoe Saldana's, and he fails to make any facial expressions to show how he is feeling at many given points. Many of the actors just exist, and that's it. Brendan Gleeson was in a few scenes (before dying off-screen as well), and didn't really get to do much, along with other performances that were not given justice. Almost every character falls flat and fails to make you care for them too much. There was only one character I liked, since he had an okay sense of humor compared to the rest of the movie, and he was only in a few scenes.Humor: Almost all the humor falls flat in this movie. Many scenes that were obviously trying to be funny jumped off a cliff and did a belly-flop onto a pool of hot lava. Again, there weren't as many people who could offer advice for Affleck's screenplay.Plot: The plot of the movie didn't feel consistent, and there were too many scenes that were unnecessary and added to the already too long runtime. Affleck also gets shot halfway through the movie for absolutely no reason, and then heals and goes back to business. The movie doesn't even tell how much time passed, which was a problem for other instances of the movie as well. The motivations of Affleck's character are also unclear and muddy. He doesn't seem to have a clear, solid reason to do what he does, he just does.Cinematography: The cinematography isn't too bad, but there are a few artsy shots that didn't seem to fit in the rest of movie, and seemed to be an excuse for Affleck to get some recognition.Action: The trailers promised a good amount of action, but despite the long runtime of the movie, it's not delivered. The few minutes of action there was though, mostly towards the end, was relatively boring and didn't feel exciting or new.Editing: The editing was boring, and there were a few scenes that were strangely cut. For example, Joe's buddy is telling him about this guy's name, Gary L. Smith. The two are in the underground tunnel things when Joe's buddy begins telling him the name. Suddenly, it cuts to the two at an empty bar, and Joe says something like \"wait, is it Gary L. Smith, or Gary Elsmith?\" to which Joe's buddy replies with something like \"no it's L. Smith, like the letter. He wants to be called that,\" and then they cut back to another set that I don't remember. The car scene at the beginning was also poorly done. There were 2 cop cars and Affleck's car, but the cars were all black, so it was difficult to determine which car was which, with the shaky-cam and fast paced editing. When one car drove off the road a bit, I wasn't sure if it was Affleck's or a cop's. Music: The music is as bland and boring as I ever thought a high-budget movie could get. It felt like the creators completely forgot music exists and is important for movies, and just said \"ah, just get some royalty-free music online, no one will notice\" and quickly stuffed it into the movie right before they released it.Overall, the movie was poorly done, with multiple things wrong with it. There are other specific details I could pick apart, but I've already spoiled much of the movie. But there are plenty of specific realism issues and other things wrong that would make more sense if you saw the movie, which I don't recommend doing."
    },
    {
      "rating": "4",
      "text": "This had all the ingredients to be a great film: good source material (Dennis Lehane's book forms the 2nd chapter in a trilogy about the Coughlan family); a smart and stylish director (Ben Affleck) coming off an Academy Award; a beautifully interchangeable list of set pieces and wardrobe; and a genre that will never stop being entertaining.However, the end result was a bloated and directionless mess. What should have been a crime film \"epic\" came across as a series of short scenes thrown together without any real flow. The choice to cast himself in the lead role has hurt Affleck's film here, and it appears that while he knows how to direct a suspenseful film, he is best served having somebody else write the screenplay (this is the first of Affleck's four films that he has written).This film was a hugely missed opportunity."
    },
    {
      "rating": "4",
      "text": "Ok so this is the first I saw that technically released this year so this is where I start. Short version to summarize the movie is that it is a gangster film staring and directed by Ben Afflect. I would want to summarize the plot but it is way too incoherent yet generic so think of it as a rise to power kind of mafia film like scar face.After the Town and Argo people thinks that Ben Afflect is the next big director or something. I have not seen Argo but judging from what I saw in the Town I have to say I am not that impressed. Mostly because his narrative style bothers me and some of the plot points are too much in your face and lack of subtlety. Here the problem got worse. 90% of the time he is talking to you in narration which is common for gangster movies but here is felt way too blunt. I won't go into details but just imagine Morpheus from Matrix narrating the whole movie.Another problem is the pacing. It is so boring. Now there is a difference between slow and boring. So is paced is lack of speed but there is pay off like the Shining and Tinker Tailor Soldier Spy. But boring means things barely happen with no pay off. And this film is boring. The first 20 minutes was my God I was so bored that I almost want to leave. Things happen but there is no weight. You can cut it out and there is no impact to the rest of the film whatsoever. There are many moment in the film where there are many plot points just lead to no where or there are too many side stories and just lack focus.Now with the negative things I said there are some positives. The cinematography is amazing every shot is worth putting on your wall. The acting is good especially from Elle Flanning who surprisingly sympathetic. But it can not save the movie and it bombed at the box office. To be honest I only heard of this movie randomly in a commercial a week before it came out and only from a word of mouth knew it is made by Ben Afflect. I don't necessarily hate this movie there are some amazing moments like the final gun fight was brilliant and many individual moments that shines. Given the raise in quality of the movies this year, I wouldn't the movie is bad but it is definitely the least entertaining film I have seen so far."
    },
    {
      "rating": "3",
      "text": "A swing and a miss, maybe the precision should have taken into account rather than power.Live By NightAffleck's homage to Brian De Palme-isc late '80s gangster genre is admirable. And that is it. Appreciation draws out a nod here and never anything else. The emotions are bland and too belittled by the hip and happening of the nature it so desperately wants to be. The set rules, that Ben Affleck, the writer, director and starrer, so proudly claims to have, have boundaries visible barely on the horizon and yet we are told repetitively to care for the daily formal business or personal conflicts that is resulting into textbook character arcs.And what Affleck actually cares about and is actually looking forward for the entire film, which is dodging the generic bullets of shock and awe therapy, is never romanticized enough to create the raw crisp moment when he asks for. In those last moments, where up till now the film was reserved, had to amp up now for a final cathartic punch, finds itself immensely immersed into a tedious procedure to offer you a sigh of relief. That peace after the storm comes with a price. A price too heavy to retract from that point.On the other hand, the film looks ravishing. Affleck's love for the genre, a wee bit cartoonish, but still utterly understandable, colors each frame with a poised respect in this sensitive world. Which can also be interpreted as his doom. For instance, take the trajectory of Sienna Miller's character in the film. She carries incredible weight, power among these characters, hence she is given a seperate fast and runny first act. Now, Affleck is taking this opportunity to brim his film with stereotypical montages of some street boy or \"outlaw\"- as he calls himself- making into a big shot as an excuse to value her presence. Scoffing at this particular character and evaluating her into a resonating memory, Live By Night could have easily been a shorter special night."
    },
    {
      "rating": "5",
      "text": "It is understandable that Ben Affleck's adaptation of Dennis Lehane's novel is unable to contain the same effect as the book, due to the amount of depth the themes and multiple subplots go into. The film makes an attempt to contain as much as is possible, yet in doing this has a little bit of everything, but not enough of anything. Sticking to the main plot, there are good performances and the amount of effort in production design is not to be overlooked. However, the movie skimps on the importance of various angles and leaves out the critical aspects of characters and their reasons for being the way they are."
    },
    {
      "rating": "4",
      "text": "Ben Affleck is a great director, but this was just really, really boring.The best thing about this movie is Elle Fanning. Whenever she's on screen, the movie stops being boring and becomes really good. Unfortunately she's not in the movie a lot, so it quickly goes back to being boring.The climactic shootout is kinda fun, but not enough to make me forget that this movie is still mostly just people sitting and talking for two hours. That would be fine if the dialogue was good, but it's not. It's really not.And then, just when you though it was over, it keeps going and going until it finally decides to end in the stupidest way possible."
    },
    {
      "rating": "6",
      "text": "First off, those accents! Ben Affleck is in full blown low, whispery and (I assume) Italian/Irish gangster accent mode here, among numerous others. It felt a bit over the top. However, I liked the period setting, the old building frontages and so on. The special effects (explosions etc.) are alright - its certainly watchable if you can get past the cheesy accents(!) but there are definitely some cliches present (I wasn't keen on the female characters). Still, its not un-entertaining regardless. This film is alright - not one I'd recommend you go out of your way i.e. pay much to see but its an ok watch, not a complete failure but its not especially great either. There are some good bits of dialogue and it paints the scene of criminality in America at the time of the prohibition era relatively well, so it could be worse. Its certainly true that there's more dialogue driven scenes than fast paced action scenes - whether that would bother you depends on your own taste in films I suppose.I suppose I'm sort of sitting on the fence - I dont think it deserves the really low ratings some people give it but I wouldn't give it a very high rating either, somewhere in the middle (Make of that what you will). I don't like to feel totally put off watching a film that initially appeals to me, due to negative reviews - I bought it after seeing it on sale for £1 and it appealed to me - I wasnt familiar with it so I bought it and I certainly wouldn't say it wasn't worth that low price. I certainly thought it was interesting to see it in terms of it being directed by Ben Affleck as well, although I wouldn't say this is his best directorial effort, its ok. I wouldn't write him off as a director entirely, even though this isn't as good as it perhaps good have been - its a decent attempt at a good film but it is slightly lacking, although it does have a nice sense of atmosphere."
    },
    {
      "rating": "8",
      "text": "Gangsters and Gunshots in Prohibition America.Being a Jazz Age aficionado and a Dennis Lehane fan I looked forward to reading the book and seeing the film. In this film adaptation Ben Affleck plays Joe Coughlin, an Irish-American who skirts the edges of crime only to find himself swallowed by it. Mafia boss Maso Pescatore sends him down to Florida to set up a profitable business only to find our hero botching up his job which leads to bloodshed and a swift turn of events. Supporting Affleck is the ever reliable Brendan Gleeson as his father, sour-faced Chris Cooper as the patriarch to the charming Elle Fanning who portrays a religious zealot who gets in the way. While no classic and a little slow-going and talky for a gangster flick, this is nonetheless a good, low-key film where Affleck shows his chops as one of Hollywood's multiple threat stars."
    },
    {
      "rating": "4",
      "text": "abcdefghijklmnooqrstuvwxyzhkiiyrwrysgjohnbujkctvysehdtinkjohjoyrweswdzdsgyhmbhucygukonkijonjoogrehdwsfjkbd"
    },
    {
      "rating": "0",
      "text": "⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡⊙¡*.*.*.*.*.*.*.*.*.*.*.*.*,"
    },
    {
      "rating": "4",
      "text": "In the roaring '20s, Prohibition hasn’t stopped the flow of booze in an underground network of gangster-run speakeasies. The opportunity to gain power and money is there for any man with enough ambition and nerve and Joe Coughlin, the son of the Boston Police Superintendent, long ago turned his back on his strict upbringing for the spoils of being an outlaw. But even among criminals there are rules and Joe breaks a big one: crossing a powerful mob boss by stealing his money and his moll. The fiery affair ends in tragedy, setting Joe on a path of revenge, ambition, romance and betrayal that propels him out of Boston and up the ladder of Tampa’s steamy rum-running underworld."
    }
  ],
  "recommendations": [
    "the_town",
    "snitch",
    "public_enemies",
    "3_days_to_kill",
    "jane_got_a_gun",
    "savages",
    "the_accountant",
    "good_people",
    "donnie_brasco",
    "taken",
    "those_who_wish_me_dead",
    "the_taking_of_pelham_1_2_3",
    "the_little_things",
    "cold_pursuit",
    "wall_street_money_never_sleeps",
    "safe_house",
    "no_escape",
    "widows",
    "man_on_fire",
    "triple_9",
    "the_equalizer",
    "the_gunman",
    "killer_elite",
    "gangster_squad",
    "the_marksman"
  ]
}