{
  "id": 2840,
  "title": "Live Free or Die Hard",
  "starring": [
    "Bruce Willis",
    "Justin Long"
  ],
  "runtime": 128,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "John McClane is back and badder than ever, and this time he's working for Homeland Security. He calls on the services of a young hacker in his bid to stop a ring of Internet terrorists intent on taking control of America's computer infrastructure.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/31TT47YjBl7a7uvJ3ff1nrirXhP.jpg",
  "categories": {
    "plot": 6.545454545454546,
    "acting": 6.235294117647059,
    "ending": 3.6666666666666665,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.666666666666666,
    "action": 6.634146341463414
  },
  "reviews": [
    {
      "rating": "7",
      "text": "A rather enjoyable addition to the Die Hard franchise. Has a good mix of plot and action, The acting is pretty solid as well. I'd recommend it if you are a fan of the old ones."
    },
    {
      "rating": "10",
      "text": "This movie replaces Die Hard 1 as my favourite movie of all time. It is non-stop action. It just doesn't stop, I was lucky enough to go to the bathroom for about 1 minute when there was nothing happen and the second I got back things started blowing up again. If you want to see awsome action..then this is your movie."
    },
    {
      "rating": "8",
      "text": "I haven't laugh so hard for a long time. The action is ludicrious, the plot has every cliché in the book, but hey, Live free or die hard is not a good movie, and it does not pretend to be, what it is is a lot of good fun."
    },
    {
      "rating": "4",
      "text": "Mildly entertaining action flick with no originality what so ever. Started off well and looked like it was heading in the right direction but lost its way in the second half of the film. Stunts though entertaining were farcical, Film ended with a whimper and was very predictable. Can't be compared to the original which is an all time classic by the way. The 4th die hard the best in the series- Not by a long shot"
    },
    {
      "rating": "7",
      "text": "a decent fourth film to the die hard franchise . bruce willis for the most part was on target as john maclaine amd justin long did a pretty decent job as his side kick . the film's PG rating kinda held it back i felt . felt it coulda been pushed abit further . but its a fun ride while it lasts."
    },
    {
      "rating": "6",
      "text": "This Die Hard sequel is decent, but it fails to capture several elements of the original. Though Len Wiseman has expertly crafted his action, but those action sequences don't give Bruce Willis a performance that captures the John McClane that sneaked around a building controlled by terrorists shooting them down one by one or wearing a board saying I hate n--grs to fight the terrorist's brother. That was the TRULY BADASS John McClane, and he was also the most badass element of the franchise. Also, couldn't the antagonists have been better? Timothy Olyphant (Thomas Gabriel) and Maggie Q (Mai Linh) played poorly created antagonists who underestimated John McClane in ridiculous situations. The situations were also more ridiculous than what was ridiculous in the original. Man, it's like Len Wiseman almost ruined Die Hard for me, but he didn't; he just failed to make it great compared to the original due to what changed with John McClane and the action and because of the ridiculous situations. Also, isn't tracking down a computer-slicing terrorists more of a job for an FBI Agent or a spy? because it probably isn't for John McClane. If you like this, that's cool with me, but don't forget it didn't capture the badass John McClane of the original, because when I see Bruce Willis, that's exactly who I see so I still wouldn't recommend it. But at least Bruce Willis's performance in Live Free or Die Hard is still pretty solid and Justin Long did a pretty good performance. ~65/100"
    },
    {
      "rating": "6",
      "text": "Live Free or Die Hard is actually a strange experience; for a film that strays so far from its franchise's staples and roots, this film is pure, action-packed entertainment nonetheless. While I understand why many fans of the franchise might dislike this entry when compared to the others, I still think those people are making a huge mistake. Live Free is a good action/thriller. It hardly feels like a Die Hard film, which is disappointing, but it's very well directed, well acted, and the script is solid. I enjoyed it a lot. I loved the effects; some were over-the-top for a Die Hard movie, but the sequences were extremely well shot and surprisingly original. Sure, this probably isn't the perfect Die Hard sequel, but it's still a good movie worth seeing!"
    },
    {
      "rating": "5",
      "text": "I call this film 'Die Hard Light' as the villains aren't that villainous, the supporting cast a little bit goofy and a plot taken straight out of a saturday morning cartoon."
    },
    {
      "rating": "7",
      "text": "\"Live Free of Die Hard\" is strong and crazy with impressive CGI and the good guy-bad guy dialogue. It is one hell of a roller coaster ride."
    },
    {
      "rating": "10",
      "text": "Of the last three \"Die Hard\"s as of September 27, 2013, this one is definitely the best. It brings back why we fell in love with the first Die Hard,: jokes, explosions, and well-played out scenes. The storyline to this one is especially exceptional, as it feels very real (the third movies seemed like a stretch). If you like movies in general, you will like Live Free."
    },
    {
      "rating": "10",
      "text": "John McClane has arrived in the 21. century and still knows the moves to kill all gangsters with a minium effort. The story: amazing, Brucie. stunning, the action: mindblowing. It's not a normal film and when the White House explodes on TV, there is no more tension to create. Best action film of the year!!!"
    },
    {
      "rating": "5",
      "text": "Die Hard 4.0 is an all-out American action film. It's big screen shooting and explosions all the way through. Whilst this is all good and keeps your interest, it's amazing how little focus there is on the story. There's really not enough emphasis on the characters and their motivations; nor is there any explanation of how anything magically happens at the touch of a button. Overall it's a good action movie but given the context it could have had a much stronger plot."
    },
    {
      "rating": "0",
      "text": "Terrible CGI climax scene, censored catchphrases and lame action. The villain was entirely forgettabe and got no time to grow at all and the plot was ridiculous. McClane himself went from an everydayman action-hero to superhero in this movie as well, at no point did it feel like a Die Hard movie."
    },
    {
      "rating": "3",
      "text": "I am a big fan of Die Hard one and I thought the third one was pretty good as well. How is this 2007 installment getting such good reviews? I left the theatre with about 30 min left in the movie. There was no way that this movie was getting any better. I already didn't care about any of the characters or where the plot was going. They did two things here that were fundamentally wrong. One, they introduced Kill Bill-type fighting scenes (Bruce Willis fist fighting a hot Asian woman? Give me a break) . At least Hollie Genaro (in the first one) had a certain down-home sexiness to her and, of course, she didn't get involved in any long, drawn out kung fu scenes. The people in this movie are supermodelesque which ruins the movie (people with no sense of taste like that style). Two, the action scenes weren't believable. They were more on par with a fantasy movie, or as another reviewer put it, they belonged in an installment of Terminator. The reason why the first one worked is that the action was not-so-far-fetched, but still very exciting. It's an art form that requires as much restraint as imagination to get it just right. What a horrible movie. It will probably still make money because it is a name-brand, just like a Mike Tyson fight (when was the last time he put on a good show?) RIP Die Hard."
    },
    {
      "rating": "5",
      "text": "Stupid movie, with a good action scene or two. Again when a plot point gets hard to solve, computers can do anything"
    },
    {
      "rating": "0",
      "text": "This is the worst film I've seen in 15 years. I have no idea how its getting such high reviews, I can only assume the general expectation for film quality is steadily decreasing over time... This movie by no means lives up to the Die Hard name. It is pure and simple: an unrealistic action bore-ride (so much action its actually unentertaining) about an invincible man who not only dodges bullets -- SPOILER ALERT -- -- he also has the ability to take on F-16 fighter jets with his bare hands. Add on to this the fact that almost every government building looked completely contrived -- (the FBI headquarters looked like it was an oversized bathroom with computers and paid actors standing around having silent conversations.) and that Bruce Willis was the only decent actor in the whole film, and you have a pretty horrible 2 hours to sit through. I think that the PG-13 rating should have been enough of a warning sign, but after reading all these positive reviews I went out on a limb (and I greatly regret doing so.) I actually walked out on this film, despite my great love of the original trilogy. I should also note that I waited 2 weeks before writing this post, so that my anger and outrage wouldn't bias my review. Needless to say, it was a pretty poor film."
    },
    {
      "rating": "3",
      "text": "I don't know about anyone else, but I really, really, really, REALLY miss Bonnie Bedelia. For some reason, fans of the Die Hard franchise don't mention this too often, but her Holly McClane was an essential--even vital--reason why the first two Die Hard flicks worked as well as they did. Not only was New York's finest everyman-turned-supercop's wife a perfect match for him, a tough, feisty, resourceful woman who gave as good as she got (remember how she handled William Atherton's obnoxious, intrusive TV reporter? Ouch!) but she helped make Die Hards 1 and 2 (NOT the Star Wars movie series) the perfect, definitive action-movie illustration of Joseph Campbell's hero's journey: essentially, the first two movies were as much about John's efforts to reunite with his wife as they were about his attempts to save the world. In the series' third installment, Die Hard With a Vengeance, Holly is reduced to an offscreen presence that John spends the whole movie arguing with over pay phones; in the current Live Free or Die Hard, the divorce papers were filed years ago. Of course, if you choose not to accept The Bonnie Situation, there are lots of other reasons why Live Free or Die Hard is not only a crushing disappointment but a true insult to all those who believe (as Entertainment Weekly clearly does) that the 1988 original is the greatest action movie of all time. Die Hard movies decrease in effectiveness in direct proportion to how large a terrain gets covered: the original took place in a large office building; the second entry, which was only slightly less good, was set mostly in an airport; the markedly inferior third installment covered all of New York City, and this one, the absolute weakest, uses the entire Eastern Seaboard as its McClane-vs.-terrorists playing field. Artificial, all-too-obviously computer-generated action sequences (including a couple that look suspiciously like the dreaded rear-projection shots that went out of style right after the seventeenth time Frankie Avalon faked hanging ten in front of footage of a wave, circa 1965) completely sink this one, all but defeating Justin Long's likable screen presence as a computer geek unwillingly recruited by McClane. But the final blow is dealt by Live Free's selling of the franchise's soul in order to get the almighty PG-13 rating. Not EVERYTHING has to be for the kids, and watching the ridiculously sanitized action in this one reminds us of how gutsy (in both senses) the first two were; c'mon, watching a bad guy take an occasional icicle in the eye or get turned into red coleslaw by a fast-moving jet never seriously hurt anyone. The biggest fraud of all--and one that Ralph Nader might consider investigating, if he's finished bollixing up elections--is Live Free's bowdlerization of McClane's legendary \"Roy Rogers quote\". In the questionable interest of not burning so-called virgin ears, who hear worse on the playground, or on cable TV, it gets muffled in a despicable act of aural hocus-pocus. In the interest of telling it like it is, let me just describe this trick (and this movie) the way the REAL John McClane would've wanted: \"Yippie-ki-yay; mother, we've been f.cked!\""
    },
    {
      "rating": "8",
      "text": "Don't let the goofy title and the PG-13 rating fool you. It's still a fun \"Die Hard\" action movie to watch. Even though this movie takes on a bit of a different twist as far as storyline, it still tends to bring back that old Die Hard persona. It has some great action and some great new characters as well. As far as acting goes, there's some really good acting. But characters like Thomas Gabriel (Timothy Olyphant) and of course John McLane (Bruce Willis) really make the movie intense. Thomas Gabriel is a very unique terrorist for John to take on. With Olyphant's dark complexity for Gabriel, he really gives us a memorable Die Hard villain. And John McLane is still bad-a** in this PG-13 setting. Speaking of PG-13, it's absurd to have a Die Hard film to be PG-13. I know people got upset with the PG-13 rating (and frankly so did I). But really if you think about it, your basically watching a clean version of Die Hard. Also, if you're going to watch this movie, I recommend the unrated version. It really brings back it's Die Hardness. Overall, even with its    PG-13 rating, the movie still kicks a**."
    },
    {
      "rating": "7",
      "text": "La más grotesca e imponente de la saga. Un ataque generalizado, no como las otras que solo son puntos en las ciudades. Divertida. Buenas escenas de acción y actuaciones."
    },
    {
      "rating": "8",
      "text": "The action here was excellent. Though often hardly believable, it's no Michael Bay crap (it'd need another 20 minutes of throwaway of filler for that). You actually care about the characters and can't help but be entertained by such dynamic scenes."
    },
    {
      "rating": "10",
      "text": ".............................................................................................................................Great One of franchise better than the 2nd one......................"
    },
    {
      "rating": "10",
      "text": "........................................................................................................................................................... One of best 4th entry in a franchise"
    },
    {
      "rating": "8",
      "text": "Bruce Willis once again as John McClane is a steamroller crushing everything in his path. He flattens Maggie Q and an assortment of hot, french speaking henchmen. The cooler cell scene w/ the awesome parkour sequences are worth the price of admission alone. If you're looking for action, this should serve as a good primer for Transformers..."
    },
    {
      "rating": "9",
      "text": "Held my interest from minute one. Action from start to finish. At this rate, this franchise can go on for many more."
    },
    {
      "rating": "8",
      "text": "Great action movie. A couple \"only in the movies\" stunts, but overall very entertaining. Timothy Olyphant and Justin Long are fantastic!"
    },
    {
      "rating": "9",
      "text": "Yippee-Ki-Yay! this is a great movie. The stunts were so awesomely outrageous that they made me laugh."
    },
    {
      "rating": "7",
      "text": "Some guys have all the luck?! Is there any other explanation possible considering B W is both sexier bald and the only human who can outgun a F-16 fighter jet without an automatic audience chortle? Intelligently, the film never allows any mental deliberation even remotely enter our brains...it's slam bam from the opening minute. This is mass produced schlocky lunkhead entertainment overwhelmingly geared for those who prefer their movies in through the eyes and out through touche. But director Wiseman intelligently avoids the audience any mental skepticism by always plunging forward with the consequences increasingly growing ever more dire. It really is a throwback action flick without the pervading sense of irony and irreverence which strangles other like-minded fare. Even that blowhard Kevin Smith subverts his enlightened schlump persona to only serve the mechanics. The MAC commericals have given JL some brain credibility allowing the writers to not feel compelled to give McClaine both a mind and rock-solid bod. Move over fantastical 20-something comic book super heroes and welcome 50 back 50 plus Bruce Willis as the summer's #1 action star."
    },
    {
      "rating": "7",
      "text": "A decent action movie. Not great. The charisma of McClane is lacking compared to previous movies. The movie is not slow. It keeps moving! I give it a seven. (The Rock is a great action movie)"
    },
    {
      "rating": "10",
      "text": "Sure, if you look to this movie as anything but a straight up action flick, you might be a bit disappointed. If, however, you're looking for some crazy, over-the-top action with some solid acting by all the major players, especially Bruce Willis, then you can't do much better than this."
    },
    {
      "rating": "8",
      "text": "Basically just what i expected. Still a lot of fun to watch Bruce, some real good action scenes, some laughs, Kevin Smith, not much more to say. Just a few more jokes from Bruce himself would have been nice. 8 out of 10 from me"
    },
    {
      "rating": "8",
      "text": "Loved it. The title alone is worth the price of admission. The only part that really pushed my ability to suspend disbelief is McClane vs the F-35 jet. At that point, it ventured into Woody Woodpecker territory. Still, the apocalyptic premise of a \"fire sale\" is awesome (and really scary). Other details, such as the Warlock character played by Kevin Smith are too cool as well. Fun. Highly recommended. I'll watch it again next week, probably at the Graumann's Chinese. see you there."
    },
    {
      "rating": "10",
      "text": "Absolutely awesome 2 hours. Willis rules, and this was the best Die Hard yet. Sure the action was over the top, but who cares. Some of the best bad-guy deaths in recent movie memory are in LFODH."
    },
    {
      "rating": "4",
      "text": "Very not good, all over the place both in story and geography, rubbish dialogue, bad guys who are mostly pretty benign in action-flick terms and then suddenly turn super-nasty and murderous which just doesn't flow, STUPID stunts that go too far over the top (and one which is pulled straight out of an old Arnie flick so NOTHING new there)... Dumb, empty, sad, and even maybe depressing."
    },
    {
      "rating": "9",
      "text": "While it may not have been the best movie of all time. Most of the people going to see this move got exactly what they wanted. Another great Die Hard Movie. While the plot and character development suffer a little from the non-stop action, the movie excites"
    },
    {
      "rating": "9",
      "text": "Throughly entertaining. I wasn't expecting much going into the cinema but I enjoyed every moment. Recommended."
    },
    {
      "rating": "8",
      "text": "The movie (and it knows it's a 'movie', not a 'film') has a premise, some likable good guys, some appealing-evil bad guys, and a few reasons for blowing things up real gooood. No awkward attempts at character development, metaphor, thematic depths, i.e everything that (I hear) bogs down all this summer's 'Three-quels'. Just don't expect the movie to stay with you afterwards."
    },
    {
      "rating": "4",
      "text": "A miserable flick. I'm even a fan of the older die hard movies, i found 1 & 3 good at least. This one was a bunch of nonsense. The plot, the action, everything was absurd. It's hard to get into a movie when it doesn't have to follow the rules of physics.. or reality. Intensely boring! I didn't expect to come out of a die hard movie unthrilled. Transformers owns this."
    },
    {
      "rating": "3",
      "text": "Heartbreaking... I love the Die Hard movies but this is a real stinker. So much of what made the others great was the location becoming one of the characters. Here, there is no central stage for all the action. Also, Bruce seems so grumpy and depressed through the whole film that his one-liners come off as failed attempts to become his old lovable self. The stunts were not suitable for Die Hard and belonged in a Schwarzenegger flick. Finally, though there is lot's more crap to talk about, the editing was pure rubbish. How many times can we have dialog out of sync with actors mouths. There was no smooth flow to this film. It's a big stinky, burning paper bag full of doggy-do."
    },
    {
      "rating": "10",
      "text": "This is the best movie I've seen this year so far. God Bless John McClane for saving America and saving my summer. From some few others who saw it with me said they felt there was too much. In the age of CGI too much action rarely happens. Every person was believable in their role. Bruce Willis definitely does not act his age. Great movie. Action fans will not be disappointed."
    },
    {
      "rating": "9",
      "text": "I loved it. Of course, some of the action was unrealistic, inasmuch as I can't believe any human body could take some of the blows we see and keep on tickin, but at least it's not slick and computerized. Great humor, realism (yeah I know what I just said, so..all that notwithstanding), and plenty of cheer-out-loud moments."
    },
    {
      "rating": "8",
      "text": "Exactly what you think it is... and extremely well done. Better than the first? Of course not. But satisfying nonetheless."
    },
    {
      "rating": "9",
      "text": "Everything I wanted to see in an action movie. A must see on the big screen...Awesome!"
    },
    {
      "rating": "9",
      "text": "Hilarious when not violent. At times ridiculously unrealistic but that's what, generally, movies are about."
    },
    {
      "rating": "9",
      "text": "A perfect Die Hard movie. If you love those movies, a must see!"
    },
    {
      "rating": "10",
      "text": "There isn't a score high enough for how good this movie is. Sure there are dumb villains, unbelievable stunts, and an invincible aging Bruce Willis, but that's what makes it so good. Is it the best action movie ever, maybe, I can't remember the last movie that was this much fun to watch."
    },
    {
      "rating": "10",
      "text": "Great and creative action sequences for another great addition to the Die Hard series."
    },
    {
      "rating": "8",
      "text": "It's a pretty good movie but as everyone else has pointed out, you definitely need to suspend your disbelief in most of it. Still, the \"hacking\" was done pretty well compared to what I'm used to seeing in movies like Swordfish. The only scene that really really got to me was the truck vs. freeway vs F-35 Lightning II in the middle of Baltimore scene... that was definitely ridiculous but it was well produced and highly highly entertaining. What else do you expect from a Die Hard movie? It all comes down to John McClane kicking some serious ass."
    },
    {
      "rating": "9",
      "text": "For me the best was the third. But this one is extremely tight for an action movie. It is funny, the effects are amazing and of course, this is over the top in terms of unrealistic action. The story is quite technical because it revolved around computer terminology. But in my view it's a very good story for that type of movie. The actors are very convincing, even the new ones. A good entertainment and I hope there will be another one."
    },
    {
      "rating": "10",
      "text": "For an action movie to keep up with todays standards and not loose itself in flash and excess perversion to entertain the audience, Live Free Or Die Hard will go down as not only one of the best of the Die Hard series, but most definitely one of the true great action movies of 2007."
    },
    {
      "rating": "10",
      "text": "Awesome action and extremely thrilling."
    }
  ]
}