{"id": 1379, "title": "Locked Down", "starring": ["Anne Hathaway", "Chiwetel Ejiofor"], "runtime": 118, "genre": ["Comedy", "Crime", "Drama"], "description": "During a COVID-19 lockdown, sparring couple Linda and Paxton call a truce to attempt a high-risk jewellery heist at one of the world's most exclusive department stores, Harrods.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/svHelD0Hb3TXPAQoPsoBwdDMTvf.jpg", "categories": {"plot": 7.8, "acting": 7.857142857142857, "ending": 9.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.285714285714286, "action": 7.0}, "reviews": [{"rating": "9", "text": "A very fun (and hilarious) heist comedy movie, and with a surprisingly good performance from Anne Hathaway."}, {"rating": "7", "text": "Just watched Locked Down, the first 2021 movie I've watched and the third 2021 movie to be released this year, and I really liked it. Locked Down was funny but also deep and I believe it respectfully and accurately represented how a lot of people have felt during the COVID Lockdown. Anne Hathaway and Chiwetel Ejiofor gave phenomenal performances, I am never let down by Anne's acting and haven't seen a lot of movies with Chiwetel but he is a damm good actor. The chemistry between Anne and Chiwetel was exceptional, they were so authentic, natural, and funny together. The writing was great. The costumes were excellent specifically the ones wore by Anne Hathaway. A great first movie of 2021."}, {"rating": "7", "text": "After suffering through Malcolm & Marie, I returned to this quarantine-inspired comedy, Locked Down, which premiered on HBO Max in January. Locked Down is another movie filmed in these COVID-quarantine times like Malcolm & Marie, and the main stars, Anne Hathaway and Chiwetel Ejiofor, do the heavy-lifting of sparring with each other and embodying the malaise of being locked down. This movie is billed as a comedy and crime thriller. Let's see how funny and thrilling it actually is.Locked Down takes place during the initial 2-week lockdown in London after the COVID-19 pandemic grabbed hold of the world. Hathaway and Ejiofor play Linda and Paxton, a couple who have been together for 10 years, but as their relationship is coming to an end, they find themselves stuck at home locked down. Linda is upwardly mobile as she's been promoted to CEO of a multi-national corporation; and Paxton feels stuck as a delivery driver due to his criminal record. Their diverging paths add tension to their relationship until those paths collide in an unexpected way. Doug Liman directs this movie, which could be construed as a romantic comedy - Liman directed The Bourne Identity and Mr. & Mrs. Smith, which may give a hint as to where this is going.When I first watched Locked Down, the Zoom calls and talk of quarantine was depressingly distracting. Ejiofor's character goes out into the street to read poetry to his neighbors who are also locked down; and Hathaway's character works from home and smokes at her window. It feels too close to home at times. Ejiofor and Hathaway argue back and forth like the couple from Malcolm & Marie, but their arguments feel substantive and have a lightness to them that's not so self-serious and self-righteous. The dialogue is funny, and Hathaway and Ejiofor have good on-screen chemistry. They pleasantly deliver their lines with such energy and wit. There are also some fun and unexpected appearances by other actors like Dule Hill, Stephen Merchant, and Ben Stiller - to name a few.Ultimately, Locked Down is just an enjoyable trifle of a movie. If you are going to watch a movie that constantly reminds you of our COVID-times, it might as well be one that is having a little fun with it, even if it does get ridiculous. Grab a bowl of popcorn and give Locked Down a stream."}, {"rating": "9", "text": "Surprisingly deep look at the end of a relationship and how being forced to physically stay together can add to the strain.  Heavy Whos Afraid of Virginia Woolf vibes for the first two thirds, and though the last third is quite different, and a little hard to swallow, I can forgive it that.  The performances of the two leads is very strong."}, {"rating": "7", "text": "A very pleasant movie. Kudos to the writer who wrote the interesting dialog delivered by the two main actors. I especially liked Anne Hathaway and her monologues. Nice scenery in London, good story, good ending. A bit intellectual, but that made it better for me."}, {"rating": "9", "text": "I expected a lot from this movie going into it, due to the subject matter of two humans trapped within their own frailties, together, during a lockdown we all have experienced for nearly a year now.  Locked Down is a love story, one that is very palpable to many of us in this real life, with an adventurous twist I didn’t see coming. Locked Down was written by Steven Knight (Serenity, Dirty Pretty Things), and directed by Doug Limon (American Made, Mr. And Mrs. Smith).  It stars Oscar Winner Anne Hathaway as Linda, and Oscar nominee Chiwetel Ejiofor as Paxton, two very flawed, very real lovers at the end of their romantic cycle, yet imprisoned together still as a result of the COVID-19 virus lockdown.  These are very relatable characters, with relatable individual flaws, forced to stay together physically when emotionally the relationship has clearly run its course.  There are so many profound, and funny, moments in this film.  Paxton chides a toilet paper hoarder by asking how many arses she has.  Linda recollects her Grandma as a Calvinist.  Hathaway delivers an amazing scene describing the reality of recovering smokers using the imagery of serpents coming through the floor.  And her explanation for why she didn’t tell him she was smoking again, that if she didn’t tell, it didn’t happen, is an amazing allegory for the lies and cover ups we tell ourselves when we fail.   I give Locked Down a 4.5 out of 5 for what it is.  A love story.  While it may not be the finest love story of our time, it is certainly the most authentic in its characters and delivery.  I encourage anyone at the precipice of relationship we all find ourselves in eventually to treat themselves to what may happen, if we simply continue to love, and endure."}, {"rating": "10", "text": "The coolest heist of 2021, where there was no blood shed or anyone hurt on the process, I had to rewatch these movie over and over cos it’s just so cool. It just showed what some people are going through being locked and being honest with oneself once again."}, {"rating": "6", "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."}, {"rating": "4", "text": "I’ll give it points for trying to be topical and a motions for filming amid the pandemic, but the film is so aimless and takes way too long to get into the heisting."}, {"rating": "4", "text": "Disappointing and frustrating.Very clearly a reflection of a blatant attempt to exploit its own simplicity by believing that it offers something more dignified or even substantial.Saying: \"it could've been better\" is offensive because it's certainly clear that those intentions did not exist in this production, and I say that from all the parties involved.It's clear that Doug Liman did this in a hurry, and without enthusiasm, but he leaves me even more uncertain about what he will deliver with Chaos Walking, considering the delays and the long reshoots."}, {"rating": "7", "text": "(Mauro Lanari)\"Man is least himself when he talks in his own person. Give him a mask, and he will tell you the truth\" (Oscar Wilde, \"The Critic as Artist\", 1891). Who knows how many times we had the opportunity during the lockdown to test if this statement was true. Written by Steven Knight, Doug Liman's film is hilarious and does not yield an inch between the \"Zoom\"-esque 1st part and the 2nd, that of the planning of the heist caper at Harrods, which was at risk of conventionality."}, {"rating": "10", "text": "Es una película de la cual tenía altas expectativas, si bien no me logró llegar un 100%, es muy buena, tengo que admitirlo"}], "recommendations": ["silver_linings_playbook", "the_intern", "blue_jasmine", "marriage_story", "sleepless_in_seattle", "blue_valentine", "the_descendants", "up_in_the_air", "closer", "leaving_las_vegas", "promising_young_woman", "gone_baby_gone", "five_feet_apart", "as_good_as_it_gets", "a_simple_favor", "manchester_by_the_sea", "little_miss_sunshine", "seeking_a_friend_for_the_end_of_the_world", "the_big_sick", "me_before_you", "cruel_intentions", "cast_away", "stillwater", "the_perks_of_being_a_wallflower", "burnt"]}