{"id": 4399, "title": "Logan Lucky", "starring": ["Channing Tatum", "Adam Driver"], "runtime": 118, "genre": ["Comedy", "Crime", "Action", "Drama"], "description": "Trying to reverse a family curse, brothers Jimmy and Clyde Logan set out to execute an elaborate robbery during the legendary Coca-Cola 600 race at the Charlotte Motor Speedway.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/mQrhrBaaHvRfBQq0Px3HtVbH9iE.jpg", "categories": {"plot": 6.619047619047619, "acting": 7.0625, "ending": 7.0, "soundtrack": 4.5, "cinematography": 8.5, "familyFriendly": 6.0, "funny": 7.5813953488372094, "action": 5.0}, "reviews": [{"rating": "2", "text": "I am writing this review as a warning to others to not be fooled by the rotten tomatoes score on this one. Hollywood must be fighting back against rotten tomatoes and paying off critics for this movie to get a 93%!!! To put that number in perspective the first Lord of the Rings only got a 91%! Now to the movie: This movie is boring, unfunny, offensive to southerners, the actors had a pathetically fake southern accent, and the plot makes zero sense. I also didn't care about the main characters at all. I actually found the side characters more interesting being the construction workers former sister in law and daughter. Just don't waste your time. There are numerous other heist movies that are ten times better than this one."}, {"rating": "8", "text": "Another unexpected surprise in this 2017, I had no expectations for this film, even considering it was Soderbergh's return, I did not even saw a single trailer, I went to see it because of Soderbergh's name and I honestly think that in the end that was what made me enjoy it so freely.In a way Logan Lucky is basically Ocean's Eleven, come on, even the film mentions it and although you could actually think it's something bad surprisingly ends up helping it, everything works because everything is so different, the characters, the scenarios and let's say its conclusion.I will not delve much because frankly there is not much to go deeper, this film knows to what it plays and what it offers and it gives you just that, you will have good entertainment and several laughs, seriously, the scene with the prisoners asking for the books of A Song of Ice and Fire killed me.Is Worth it? totally, Logan Lucky is two hours of solid and unpretentious entertainment, something that is always appreciated, is a Soderbergh's best? no, but the only reason it excels over other works from him is because the same reason I mentioned, this movie tells you directly what you will see and that is exactly what it delivers."}, {"rating": "1", "text": "Oh boy. Its this movie loved by the people who lives in rural areas (or smaller cities, or towns)?This movie is beyond overrated.The score is VOMITIVE. I hate every song they put in here. EVERY SINGLE ONE. I hate this music so much that I would love for it not to even exists. Then the absurdist humor. It just doesn't land.Then the accents. Either they were all badly done or they were expertly done compared to other movies, and that's why I hate them. But Oh my GOD I hate them.Then the plan. Look the Ocean's movies had plans as ridiculous and improbable as this one. So that's not the problem. But here the plan is unfolding as we see it. So when things go wrong we don't feel that bad, because we hardly know exactly what was planned and what was improvisation. Etc.Plus, the directing just like the frenesy of something that it supposed to be fun. It seems that in this case, the plan serves more for the situations to be \"funny\", than to have any kind of importance.In the end. This is a TERRIBLE movie by almost every front."}, {"rating": "5", "text": "One of those fun movies that's smarter than you'd expect. Daniel Craig was really fun. But I walked away forgetting about it, except for the fact that it was clever. It set out what it was intending to accomplish, which was to entertain, but I think a movie should be making you think about something after you walk out. This movie did not do that."}, {"rating": "5", "text": "Being a long time fan of Steven Soderbergh, I just assumed I would enjoy this movie. However, I found it slightly disappointing. The cast is impressive, and Daniel Craig stood out with a charismatic performance. Most of the story made sense although there were elements of the ridiculous about it at times. All in all, it's an ok film that's well made as you would expect from the director. For me, it just wasn't particularly exciting or intriguing."}, {"rating": "3", "text": "I agree with all the negative reviewers. While this movie isn't awful, it is not funny. At all. Not a single person laughed once in the theater, and experience that I see is not uncommon. The actors do a decent job with a bad script. Very bad script. Choppy. Rote. Expository. Unfunny. Familiar. Way too long. Just bad. I didn't walk out, but I did leave to go to the bathroom and didn't hurry to go back. So many plot holes. Heists have to make sense. This one does not. It is totally unbelievable and just logically impossible. So it doesn't work.But the worst thing is the 80 score on expert reviews and the 23:7 positive to negative ratio on user reviews. AM I TAKING CRAZY PILLS? I seriously believe some positive reviewers are paid or are bots. Many of the positive reviews just recite the plot and add generic comments like \"funny!\" I seriously think some people are cribbing from a press release from the studio to make $20-50. They have no individual comments. The negative reviews, OTOH, have personal stories about people walking out of the theater and are in very individual styles. Something is rotten here. If I had gone to see this based on the positive reviews I would have been p***ed. Be wary of the reviews of bad movies! Look for reviews written in unique voices. The positive ones are like an AI experiment, with their Uncanny Valley descriptions and phrasing.Onion AV Club let me down too. This movie is not worth watching for free on Netflix, let alone going to see in a theater."}, {"rating": "8", "text": "A heist film that mixes in comedy so nicely. Steven Soderbergh understands the heist world which he did great in Ocean's Eleven, the difference here is the location. It does take a big leap of faith to believe that these guys could pull this off and at times it borders on the absurd. But if you just go with it you will be happy with the result. A-"}, {"rating": "3", "text": "This movie couldn't make up its mind if it is supposed to be funny. The romance falls flat. The father / daughter subplot feels unnecessary. The casting of Adam Driver is questionable. Nothing against the hillbillies of West Virginia, but almost everyone in the movie is incredibly attractive. I expect a twist at the end of a caper film, but this one dragged on and on for an extra 20 minutes at least. Save your money."}, {"rating": "3", "text": "I think the critics have once again been far too kind. Perhaps they think by praising Soderbergh, he'll want to come out of retirement. To be honest, when I see a movie, I don't care who the director is, I just want to see a well-made movie. This is mediocre at best - it feels like a rehash of Cohen brother movies. It tries really hard to be quirky and cool, but the first half of the flick falls flat. The second half picks up and is more interesting and fun, but then the ending tapers off a bit too long.  $ave your money and wait for it on Netflix!  You're NOT missing anything here."}, {"rating": "7", "text": "It's just a good, solid easy-going heist flick, and I enjoyed it greatly. Don't go into it anticipating that you'll need to think too much.  Soderbergh just seems to know how to direct Channing Tatum - he makes him look great. Only Hillary Swank's role seems to be underdeveloped, but hey.  Also, special call-out of the daughter - she's amazing in that role."}, {"rating": "5", "text": "a taste of the south, bot not enough flavor. the movie drags on even after it has nothing new to say. i m not sure what hillary swank, katie holmes and the rest of the great supporting cast is doing in this movie. even the adorable, charming Farah mackenzie is nothing more than a weak plot device. daniel craig is a miscast yet watchable nonetheless."}, {"rating": "4", "text": "Is it me? Have I seen too many movies, including all the classics, since I started going to the movies, at least once a week, for 75 years? Yes, I am old and I do use the closed caption hearing when watching television though my NET doctor says all is okay. I have no problem when talking with people but I have problems understanding movie talk, especially when they use accents.Having had a rough 5 days with sick friend I wanted to go see something light, funny and, possibly, a no brainer. I really enjoy Channing Tatum in movies and I have also enjoyed Steven Soderbergh’s “Ocean’s 11, 12, 13” and their collaboration with “Magic Mike” plus I was somewhat intrigued by “Introducing Daniel Craig as Joe Bang” so I decided to go see “Logan Lucky”.“Logan Lucky” is a redneck, Southern heist film along the lines of the Ocean films. Along with Tatum and Craig other members of the cast are: Adam Driver, Seth MacFarlane, Katie Holmes, Katherine Waterston, Farrah MacKenzie, Hillary Swank to name a few. The screenplay was by Rebecca Blunt along with some excellent photography by Peter Andrews. Though it takes place in West Virginia most of it was photographed in Georgia.“Logan Lucky” is the second picture I have seen this past week, the other being “Wind River”, which were pretty much given high marks and I don’t understand why. I read most of the Rotten Tomatoes reviews and still shrug my shoulders.I don’t/won’t recommend “Logan Lucky”.I still don’t get the “Introducing Daniel Craig” unless it is to introduce him as a very funny guy and the opposite of James Bond but that’s stretching it."}, {"rating": "7", "text": "Logan Lucky is very distinguishable as a Sodenbergh film, even if you weren't sure it was by the director. There are extended moments of awkwardness, subtle humour and a myriad of socially bizarre characters. Overall well done, but not bringing anything new to the heist genre."}, {"rating": "9", "text": "An exceptionally funny film with a heart of gold, this is a brilliantly subtle and delightfully clever comedy which is much more sophisticated than I was expecting. The script is superb, the performances are just the right side of caricature, and the story line is compelling and surprisingly moving at times. The pacing is less frantic than one might expect, but this serves to allow breathing room for the plot, and it's also a surprisingly family-friendly experience. Part love letter to Nascar, part commentary on the South, part classic heist romp, this is an endearing and intelligent film which is a unique and beautifully crafted experience that is sure to be enjoyed by everyone. 9.01/10"}, {"rating": "7", "text": "While a lot of critics, at least in my opinion, are praising this movie because Steven Soderbergh has returned to directing, this is still a fine movie. The acting is great and everyone from Channing Tatum, Adam Driver, Daniel Craig, and (surprisingly) Katie Holmes put on rather authentic southern accents, crisp cinematography and tight editing and direction, a trademark of Soderbergh, and a rather smart height film even if it's basically the redneck Oceans Eleven. And while there are laughs to be found, especially with some great character driven comedy, the jokes aren't as funny as they should be and often feels like it's relying too much on the audience being familiar with southern culture. Not to mention a lot of padding and filler to keep the movie a float, with plot threads that either feel unnecessary or just goes on for too long, and characters that feels like they are extended for too long (particularly Seth MacFarlane's character) or are just unnecessary (particularly Hillary Swank's character). Still this is a fun time at the theaters and I would recommend people seeing if they are interested."}, {"rating": "8", "text": "Logan Lucky is an enjoyable, fun summer movie for if you want to sit back, relax, and have some good laughs.Acting: Tatum and Driver are fine in their roles, but Daniel Craig is definitely the stand-out, of course. It was nice to see him play a wild, unpredictable, enjoyable character, taking a step away from the countless cool and laid-back roles during his career. He was one of the best parts of the movie, as his performance was spectacular and was enjoyable to watch. Hilary Swank easily earned the worst performance. During the last 20 or so minutes, which I will talk about later, she was terrible, speaking in a monotone voice, being completely stiff, and having an annoying smirk. Seth MacFarlane, who I don't find terribly funny in the first place, didn't really make an impact on me. He was borderline annoying, and I didn't care for the whole subplot that he was involved in.Characters: Again, Daniel Craig as Joe Bang was easily the best performance and best character, just because he was interesting and cast well. All the other characters are fine. Nearly all of them are over-the-top or stereotypes, which I see many people dislike, but I think it worked with the sort of wacky style of the movie.Plot: The story was fine, despite there being a few plot holes here and there. The heist was intriguing to watch and easy to follow. The last 20 or so minutes drag on for way too long, however. In the final act of the movie, Hilary Swank plays a detective, looking into what happened during the heist. It isn't interesting, and feels completely disconnected from the movie, as only 1 of the (sort of) main characters is actually in it. It could have been scrapped from the movie and made it a bit better. Another subplot that wasn't too interesting was the racing one with Seth MacFarlane's character. It never really went anywhere or added anything to the main story, and again MacFarlane was a bit annoying. The story also would have been fine without this whole part. Also, this movie is different from Oceans 11 or other Soderbergh heist movies because it focuses more on the characters and their motivations. Tatum's character and others have a reason to be doing it, and there is more of a plot outside of the heist itself. I didn't mind this, as it was different than Oceans 11 and not just following the same path. This might have been why he put in the last 20 minutes, so the movie wouldn't just end right after the heist. Nevertheless, it could have been removed and been fine.Humor: Now, just because I found this movie to be particularly funny, especially in a few scenes that were hilarious, it doesn't mean you will. I found it to be consistently funny throughout, but others apparently didn't laugh once. Unless it's an Adam Sandler movie, I usually don't take people's words for it when they say it was or wasn't funny. But with other movies, I try to give them a chance. If someone else found it funny, good for them, but it doesn't mean me or the guy next to me in the theater will. I've also seen some reviews saying it was trying too hard to be a Coen brothers movie, but that's not the case at all. The Coens' movies are quirky while maintaining a dark element and incorporating dark humor. Logan Lucky is just wacky and not supposed to be taken extremely seriously.Script: Not the best, but I don't think it was trying to be. Was charming and pretty funny throughout (to me). Rebecca Blunt, who made her debut writing this movie, may or not be real, but whoever it was who wrote it did fine.Logan Lucky is a movie that you can expect to sit back and at least somewhat enjoy. Even if the jokes don't make you laugh or even chuckle, at the very least it is a somewhat respectable heist movie that isn't supposed to be too serious, at least in my eyes."}, {"rating": "10", "text": "This a movie that is very subtle, but none the less it is perfect. It has a lot of cliché's in it, but they are good cliché's.  I'd recommend this movie to anybody."}, {"rating": "7", "text": "I think they done a very good job with this film. The cast performed their roles very well, the dark comedy style was completely on point. Give it a shot."}, {"rating": "1", "text": "Easily one of the worst movies I've ever seen. The cast did their jobs well but the script and the story itself was so slow, boring, uneventful and even the rare instances of humor were barely worth a chuckle. In the hundreds of movies I have seen in my life I have never gone to one and found myself checking the time every 15 minutes waiting for it to end. The fact it has 93% on rotten tomatoes is an offense to the entertainment industry and I am annoyed beyond belief I wasted my time and money on it."}, {"rating": "7", "text": "Contrary to announced plans to quit making movies, director Steven Soderbergh is still here and producing one intelligent entertainment after another.This is his first attempt to cut studios out entirely and get by on own means.The man’s had enough of „Ocean’s“ after completing the trilogy but he likes an idea of a heist story. „Logan Lucky“ is a working class version of this, which means less glamor and more people wearing blue jeans and eating at diners.As expected form Soderbergh project, there’s a bunch of pretty cool faces doing their thang.Among others, we have Channing Tatum, Adam Driver, Katie Holmes, Daniel Craig (yes, the 007 himself), Dwight Yoakam, Seth MacFarlane, Jack Quaid, and Hilary Swank.Soderbergh and the team are still very good at putting movies together, everything in technical sense is competent. The result is too laid-back to become very gripping but it is certainly well oiled and tuned machine of a heist movie worth your time if you care about the subgenre.And there's enough little humorous details to smirk about, if you happen to notice them. Just like Soderbergh prefers it.I still think it could’ve been shorter than 119 minutes, especially because some important plot parts are explained quickly rather than shown anyway. Also, there’s no big amount of suspense or character development to justify this kind of duration.But maybe it’s just me, dreaming of a perfect world where so many movies don’t have to last two hours, so I have more time for other stuff too!PS The ony screenwriting credit goes to Rebecca Blunt who is suspected to be a pseudonym. Would be nice to know who’s behind it. Maybe it’s like Roderick Jaynes for Coen movies. It wouldn’t be the only nod to Coens in „Logan Lucky“."}, {"rating": "6", "text": "A fun premise, but the film rarely takes full advantage of it. A roadside bar in West Virginia seems like a good place to find some interesting characters, but we never get to see any. A Nascar race seems like a perfect location for some fun heist hijinks, but instead we just get some cashiers and a few security guards. The main character's motivation is pretty weak: laid off for some uninteresting reason, not really struggling for money (his daughter seems well cared for), and he's not motivated by revenge. We meet a few characters that seem to hold promise, but they ultimately disappoint, and the film decides that there's just going to be one scene where we bring out everyone's quirks, then those quirks are absent from the rest of the film. A cursed high school quarterback, an Iraq War vet, two morally dubious religious converts, and an eccentric bomber sounds like a great setup with plenty of ways they could play against one another. But few of the fun scenes that you'd imagine ever materialize, and the long/uninspired editing doesn't do the film any favors. The film also has an awkwardly long epilogue, which is one of the few times that I've thought that a montage would have improved a film (rather than awkwardly lingering on characters for 20 unneeded minutes). There are a few genuinely good laughs and the heist is solid, but this ultimately feels like a film that needed a few more drafts of the script and a much more quirky editor."}, {"rating": "5", "text": "A bit of a disappointment, unfortunately.  A Steven Soderbergh-directed, Ocean's-style caper comedy transplanted to a blue-collar milieu in West Virginia and North Carolina, it is a film of fitful amusement and invention, but it is never as consistently fun as it clearly aims to be.  The film does have one enormous asset, though:  a delightful performance by a cast-against-type Daniel Craig.  He plays a taciturn, tattooed, Southern-accented pyromaniac and thief named Joe Bang.  Craig venturing beyond the suave, tough James Bond archetype is not exactly a revelation (consider, for example, his turn as murderer and In Cold Blood subject Perry Edward Smith in Infamous), but it is clear he relishes this absurd antihero, and his enjoyment becomes ours.  The rest of the cast, including Adam Driver and Channing Tatum as unexpectedly convincing brothers, is mostly fine, though none of their roles are nearly as compelling as Craig's.  Riley Keough, for instance, is sexy and spry as a Daisy Duke-style hairdresser sidekick, but the role never blossoms beyond the functional and ornamental.  There are two members of the ensemble I would gladly cut, however:  Seth MacFarlane, just bizarrely and uncomfortably miscast as a narcissistic British racing sponsor, and Hilary Swank, whose late-in-the-game appearance signals when the film seriously starts to feel overlong and out of fuel.Behind the camera, Soderbergh acquits himself decently on a scene-by-scene basis, shooting the action (much of it set in an industrial labyrinth beneath a speedway) with characteristic clarity and efficiency.  On a broader level, though, the film slips away from him to a degree.  His attempts to infuse the story with heart and soul—the West Virginia locals' economic anxiety, one principal character's doting relationship with his daughter—are rather limp, and the film becomes a noticeably long sit during its third act.  Said third act includes one of those montages in which the events of the heist play out again from another perspective, showing us who was misdirecting whom and what transpired in place B while we were focused on place A.  Sadly, this registers more as convoluted and labored than a-ha! surprising or playful."}, {"rating": "6", "text": "So imagine Ocean’s Eleven but instead of a casino it’s a NASCAR race and instead of George Clooney and company in their designer sunglasses and slick suits you’ve got Channing Tatum and his group of rednecks. Throw in Daniel Craig with bleach blonde hair for good measure and you’ve got Logan Lucky. A heist movie that doesn’t take itself too seriously. It’s mad, it’s funny and highly entertaining. No it isn’t the best heist movie you’ll ever watch, it’s overly long and adds too much backstory that drags the plot in unnecessary places. Oh great another scene with Tatum and his daughter simply there to highlight his money problems but he loves his daughter so it’s ok for him to pull off this heist because deep down he’s a good person. You know just in case you didn’t pick up on that the first time. We know it’s a heist movie so just get on with it. And don’t ask me how they did it but the end was both rushed and dragged out all at the same time. For me Daniel Craig stole the show but the whole cast worked very well together. Recommended."}, {"rating": "6", "text": "I didn't dislike this movie; it had its moments. It just dragged quite a bit and was not that funny. Maybe if it wasn't billed as a comedy I would have liked it better? I feel a little misled by the critics on this one."}, {"rating": "8", "text": "This is a fun, little movie. The Southern accents are terrible, but that just adds to the charm. Tatum Channing and Adam Driver were very credible, but Daniel Craig almost steals the show."}, {"rating": "8", "text": "Channing Tatum and Adam Driver play brothers who decide to rob the Charlotte Motor Speedway. They bring on a safe cracker (Daniel Craig) and his brothers to round out the crew. Anyone who's seen director Steven Soderbergh's \"Oceans\" movies will appreciate the elaborate machinations of the heist, only this time the crooks aren't slick. Everybody's having fun with their thick Southern accents and even thicker skulls (Driver turns in an especially subtle but winningly deadpan performance). This translates into enjoyment for the audience too. While the energy lags during parts of the heist, the rest of the film is entertaining, especially the dimwit characters and the actors who are having such a good time playing them."}, {"rating": "8", "text": "As far as Steven Soderbergh heist films go, this might not be the best. But as far as coming-out-of-retirement films for directors are concerned, boy, was this one more than welcome for me to behold, for if \"Logan Lucky\" does anything well, it helps me understand just how much I missed the director's presence in cinema over the last few years. But, it just so happens that this isn't the only thing \"Logan Lucky\" does well either. The film also spins feel-good, country bumpkin heist fun and intrigue at a decent clip, and excels smoothly on the performances of its supremely gifted cast, including a revelatory turn from one Daniel Craig as the aptly named \"Joe Bang.\" So, sure it's not as good as an \"Ocean's Eleven\" or \"Ocean's Thirteen,\" but it stands tall amidst the pantheon of heist films in general, and will probably end up being one of the better, unsung films of the 2017 altogether."}, {"rating": "7", "text": "I can see why the audience reaction seems to reflect some disappointment with this film. I was very bored and put off with what seemed like an artificial and confusing beginning, but once it got going (the caper and beyond), I enjoyed the film, the suspense, and all the performances, especially Daniel Craig. But since the film doesn’t seem to be doing great business, the hint at a sequel probably won’t amount to anything."}, {"rating": "9", "text": "Often promoted as a redneck's version of the \"Ocean's 11, 12,  . . . \", which it is, \"Logan Lucky\" is a funny if a bit stereotypical tale of a West Virginia man's attempts to seek some sort of redemption after being fired unfairly by the company doing below ground support work to repair sinkholes at the Charlotte Speedway.    Channing Tatum is the most believable character who balances the rural type lifestyle with intelligence, whereas most of the other characters, funny though they may be, seem to overdo the Southern hillbilly schtick, which Hollywood almost always does, and can be somewhat insulting to those Southerners from Texas to Virginia down to Key West who do not live the \"assumed\" lifestyle we see here.    But that's a minor point, and the film does do well in Jimmy Logan's case as far as empathy and the hurt of losing a job and dealing with a divorce.    Otherwise, the big draw here for myself was to see Daniel Craig step out of his usual severe James Bond type mold, and he comes through brilliantly, having no difficulty making us believe he was truly from a backwater extremely poor West Virginia town.    For more comic relief we have his two bumbling hardcore redneck brothers in on the heist, and possibly the more insulting caricature of southern people in this movie.    Being from Arkansas and seeing it a second time because my wife can watch a movie she likes a million times, the audience didn't seem offended, and laughed a lot.    After all, if you can't laugh at yourself, you can't deal with much of anything.    Yes, we are from Dixie, but while I'm not a native, having spent my first 12 years in Iowa, I've been here a lot longer, 44 years and all my friends and family are here.    But that minor point aside, while \"Logan Lucky\" doesn't contain any big surprises, it does have its cleverness, humor, and decent story line to keep it entertaining.    Fans of the \"Ocean\" series will like it immediately, and those looking for a good chuckle will like the movie as well.    It is a bit long, and there is one plot hole I won't give away that even after two viewings I'm still trying to figure out, because it relies on an assumption on the viewer's part and doesn't explain for sure just what this certain part of the movie has to do with the rest.    Otherwise, it's a lighthearted movie and will probably be a sleeper at the box office and do well on DVD."}, {"rating": "6", "text": "A modestly entertaining comic crime caper that has its moments but never quite lives up to its full comedic potential, despite a solid cast that delivers a series of strong performances. The film admittedly delivers some good laughs, but they're too few and far between given the rich untapped veins of material available in the subject matter. It's an inoffensive offering for home viewing on a Saturday night when you don't have any other plans, but don't go out of your way to catch this one."}, {"rating": "6", "text": "Not going to be an Oscar nomination  but just a good old fun movie. Quite the imaginative written screenplay. Go with low expectations and let it provide you with clean fun & entertainment"}, {"rating": "5", "text": "The proper rating is a 4 but I gave a 5 because it was light hearted and tried to be a good film. Its not. Whats wrong with it ? Its a Coen Brothers wannabe . They can pull it off;others can't. Daniel Craig is mis cast. The women are good but don't get much screen time. The southern accents are so thick, its sometimes difficult to hear every word. Finally too many moving parts to the heist. Its strains credibility that everything planned worked exactly as such. Whats good about the movie ? Cast was pretty good, the concept of rednecks planning a heist is original and some scenes were good. Hard to pull everything together. It tried to be entertaining and a few times, it was. Its not the worst movie you will see this year but no harm if you miss it either."}, {"rating": "9", "text": "This is a very entertaining movie. Outstanding performances by Adam Driver and Daniel Craig, and the rest of the cast is very good as well. This is a caper film in the tradition of the Oceans 11 movies. Don't dwell too much on the details of how the heist is pulled off - just go with the flow and enjoy it. A nice twist at the end is a bonus. Nice to have Soderbergh back (though the fact that he directs does not influence my very positive review)."}, {"rating": "9", "text": "Logan Lucky is a comedy/crime movie about two brothers who assemble a complicated heist in order to steal a large sum of money. The leads; Channing Tatum, Adam Driver, and Daniel Craig specifically do a fantastic job making their characters interesting to watch. The heist aspect of the film is well executed, as the film slowly gives you hints along the way to what they are planning. The film doesn't spell things out perfectly for you, allowing the mystery of the heist to question you. The characters are all a bit weird and out of touch with technology, coming from where they live. This brings some great comedic moments that keep the movie entertaining throughout. Overall, it is a well crafted movie that is thoroughly entertaining."}, {"rating": "8", "text": "Logan Lucky; from the director who bought us the Ocean's trilogy, Magic Mike and Magic Mike XXL, and Side Effects; once again proves that Steven Soderbergh can bring a great film to his once-in-a-lifetime filmography of media that may or may not be worth watching. Veterans of his films would be surprised to know that this is coming from the same director of the Ocean's trilogy. Newcomers would be dragging themselves onto the floor wanting more after paying for that sole ticket."}, {"rating": "5", "text": "Just saw this new Soderbergh movie.It's very complex, but honestly it's poorly directed: Confused, overly complex, dull even in its complexity. There is no sense of the pieces of the heist \"coming together\", driving the excitement and anticipation. It's just noir-by-the-numbers. Too bad."}, {"rating": "6", "text": "Way overrated by critics given to Soderbergh bias. Has some very poignant acting & funny moments. But drags too many times and for too long. Tatum & Driver again impress, but Craig breaks out of Bond mold in a big,funny way."}, {"rating": "8", "text": "I had a feeling that Steven Soderbergh wasn't really going to retire for good when he claimed that 2013's 'Side Effects' would be his last film. Given that I was personally pretty disappointed with that film, I certainly hoped that it wouldn't serve as his swan song. Thankfully, it didn't, and he came back with a vengeance with this surprisingly funny deadpan caper comedy! Sure, the film may simply feel like a redneck 'Ocean's Eleven', with the premise and what not (the film even pokes fun at itself about that briefly towards the end), but the talented and studded cast with the likes of Channing Tatum, Adam Driver, Riley Keough, Seth MacFarlane in an almost unrecognizable role, Daniel Craig completely and brilliantly playing against type, and even a worthwhile cameo near the end, make this film all the more fun and a lot more easy to forgive the fact that it is indeed very much like a redneck 'Ocean's Eleven.' Overall, this was actually quite a bit more fun and humorous than I was anticipating, and served as one of the more surprisingly good films I've seen this year! Very good to have you back Soderbergh!"}, {"rating": "8", "text": "Clever, fun, funny, charming, with a lot of detail and classic film-making touches. Just a solid movie with some bad accents but really good acting, spot-on casting, and topical satire and humor. Also, it is a rare movie that can lovingly cherish the same culture it is also lampooning, somewhat. Highly recommended; pleasantly surprised by this one."}, {"rating": "9", "text": "The funniest film of the year so far, Logan Lucky is a kind of redneck Ocean's 11, with even more originality and wit. Daniel Craig gives his best performance to date, as does Channing Tatum. Highly recommended."}, {"rating": "0", "text": "Boring this movie is very bad and such a waste of time! Do not waste your money  on this movie! I repeat Do not waste your money  on this movie! Thanks"}, {"rating": "9", "text": "Can we please start giving Channing Tatum more credit as an actor? I'm not saying the guy is Oscar worthy, but for goodness sake the man is working alongside Adam Driver here and at no point does it look like he has no business sharing the screen with such a soulful performer. Which to me says he's a bit more than the mediocre talent Hollywood only keeps around for the pretty face and hot body he brings to the table his detractors often try to paint him as.Anyways, this is a southern fried heist flick with a comedic slant. One where the seemingly simple minded and down on their luck rednecks come up with a shockingly complex and intelligent plan to rob a motor speedway while delivering plenty of laughs along the way. It's never an outright laugh riot in the traditional sense even though it will get you to guffaw at times. That's because the humor is most often delivered in a straight-faced, downright deadpan manner. The most cartoonish aspect of the whole thing is Seth MacFarlane's character, making you realize just how much the genre tends to rely on the absurd or loud to get a reaction from the audience. Logan Lucky on the other hand is funny due to the naturalistic cleverness of its material.There's also a heart to the whole thing that makes it easy to get invested in the characters and their schemes. That's because the cast are playing a bunch of average, luckless southern joes with charming down-home sensibilities. The lead of which is trying to do the best for his daughter and others close to him after losing his job. You want to see them succeed so you'll sit on the edge of your seat during every close call in-between the chuckles. Think of it like a lighter, fluffier version of Hell or High Water that's just as enjoyable."}, {"rating": "10", "text": "One of the best movies this year!  Easily, unarguably!  Rotten Tomatoes has it at 93%In a day and age when I can sit at home and for hardly 20-50$ a month, I can daily consistently watch the greatest movies, TV shows and cinema of all-time...    I can sit right there on my couch, with my humongous HDTV and absorb cinema at any time I desire, it is rare these days that I will go to a movie theater to see 'what's playing'.When I saw Daniel Craig as Joe Bang and Kylo Ren with a prosthetic arm/hand, and all then tossed into a NASCAR bank heist?  haha I knew this movie would either be HORRIBLE or it would be AMAZING.  Logan falls into the latter.  As is with most top-notch cinema, there really is no way for me to explain 'what' makes this movie so 'great', but if you watch this flick and you do not 'get it', you need to remodel your cinematography paradigm."}, {"rating": "9", "text": "You can keep \"Baby Driver,\"this was a far superior film. Great performances, especially from Adam Driver and Channing Tatum. Think of it as a redneck version of \"The Town\""}, {"rating": "7", "text": "I'm giving this movie a 7 because it's a pleasant romp and I found sufficiently entertaining to watch it all the way through despite the fact that I have no love for 1) hillbillies, 2) the South, 3) southern twangs and drawls, and, 4) fictional characters which come off as exceedingly ignorant and stupid.Another reviewer commented that Logan Lucky is more clever than you might expect and that is certainly true."}, {"rating": "9", "text": "This movie was awesome, this is what a new school heist flick is supposed to be, you can keep your Drive & Baby Driver, just keep giving me kickars movies like this and I'll be happy.  Recommended."}, {"rating": "9", "text": "Great movie! Had a blast watching this one. The movie was extremely enjoyable from beginning to end and was absolutely hilarious at moments. I love it took the more smaller subtle comedy parts rather than the all out huge lough out loud moments. Channing Tatum, Adam Driver and Daniel Craig all give great performances, but the stand out Daniel Craig. He had me laughing from beginning to end along side Adam Driver who also had great comedic timing. The story was fun, but wasn't necessarily amazing. I felt the chemistry is what makes the movie so enjoyable and hilarious and some memorable scenes."}, {"rating": "8", "text": "Logan Lucky was a very fun and surprising movie. The actors were all amazing. They brought a very special tone to their character. The story is well written with savoury dialogues. The movie is remnant of the Ocean Eleven's heist movies in terms of how the stories is showed. This isn't an action movie of course, but it's so well done. The soundtrack is great and fits perfectly. Overall a very charming, funny film. Be aware that this is done with south US accents. So for my part, I was happy to have subtitles but it wasn't too bad. I give it a 78%. Definitively the best Tatum performance."}, {"rating": "8", "text": "Logan Lucky is a hilarious, fun-filled time with characters that are an absolute blast to be around. Daniel Craig turns in his best performance outside of the 007 franchise and Steven Soderbergh proves why he's the king of heist films."}, {"rating": "9", "text": "If I could give this an 8.5, I would, so I rounded up to a 9 as I feel this is a movie that deserves so much more credit than it has gotten. Easily one of my favourites of the year thus far, this movie is basically redneck Ocean's Eleven and I mean that in the best way possible. This movie is very cliche and predictable, but I had a hell of a lot of fun watching it, especially since it was better than what I expected it to be."}], "recommendations": ["lucky_number_slevin", "seven_psychopaths", "spenser_confidential", "rocknrolla", "mortdecai", "the_dilemma", "pitch_perfect_2", "the_nice_guys", "jumanji_the_next_level", "deadpool_2", "the_gentlemen", "inherent_vice", "tag", "snatch", "burn_after_reading", "the_guardian", "tusk", "hancock", "the_king_of_staten_island", "this_means_war", "american_ultra", "the_cobbler", "keeping_up_with_the_joneses", "spy", "identity_thief"]}