{"id": 1293, "title": "London Has Fallen", "starring": ["Gerard Butler", "Aaron Eckhart"], "runtime": 99, "genre": ["Action", "Thriller"], "description": "In London for the Prime Minister's funeral, Mike Banning discovers a plot to assassinate all the attending world leaders.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/korY0GInEJThWEm23MRmErQ3GqT.jpg", "categories": {"plot": 4.777777777777778, "acting": 5.0, "ending": 5.75, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 4.25, "action": 5.714285714285714}, "reviews": [{"rating": "0", "text": "This is one of the worst movies I have seen in my entire life. Usually, I don't expect much from this kind of movie, but the ignorance and stupidity with which this was made is unbelievable. In fact the stupidity of what the heck is actually happening on screen was the only thing that made me laugh for the first few minutes.  After that it is just near impossible to watch for anyone who owns even the tiniest bit of brain. Whoever wrote this piece of garbage must have had a great toilet sitting for making the whole plot up, even though the other thing that came out in this sitting was probably a better creation than this movie."}, {"rating": "3", "text": "Seriously, it could be worse, it could have been even less believable, but the whole story line is so simple and so single minded, that I could feel my brain cells dying while watching this on the plane.\rActing is pretty ok (7/10), effects were timely and well made (9/10), but story line (1/10) and believability (1/10) with brain numbing dose of patriotism (10/10 where more is worse...) made me pretty sad that I was watching it. In the end I wanted to cry because when president gets rescued you must feel proud and patriotic, but I felt ashamed for watching it.\r Yes, it was that bad and I watched it..."}, {"rating": "3", "text": "This is a sequel that never should of been made. Incredibly over dramatic and tedious action. Man It seems like Gerard takes everything he is offered now."}, {"rating": "3", "text": "Oh My Gooood I've never been so insulted by a movie in the opening act... I think even Transmorphers gave me more credit for my intelligence.  And certainly more than this movie gave to Scotland Yard.  Gerard Butler had God mode of course, so at least that was nice...  Basically, Terrorist Independence Day - most world leaders are killed within a 5 minute destruction scene.  You're telling me that within a day or so, terrorists were able to covertly plan a half dozen MAJOR attacks within one city, and undermine the secret services of 40 world powers?  I was done with this as soon as it started - I'm glad this movie was only just over an hour and a half.  Even Morgan Freeman couldn't absolve this movie of it's sins."}, {"rating": "3", "text": "The set-piece destruction of London landmarks is good special effects, but otherwise this is a limp affair. No surprises, obvious plotting, dull script. This had me yawning in my chair and drinking coffee to get through it on the off-chance that it might improve. It didn't."}, {"rating": "2", "text": "Non ho mai visto tanti stereotipi e assurdità in un unico film d'azione. Il cast è buono, ma la trama fa acqua da tutte le parti, senza contare le solite esagerazioni dei film americani anni 80... Commando fra tutti. Se ti esalti facilmente con queste cose allora è il film per te, in alternativa puoi impiegare meglio il tuo tempo."}, {"rating": "4", "text": "The film is just another generic action film with wasted talents. Plot is a mess,action might be okay but the sheer number of action films that I've seen in recent years are better than this pile of turd.With a great and talented cast which again was wasted because of how horrible the film was equip with terrible action set pieces,the film didn't live up to it's predecessor because the movie takes place in a huge city rather than just one building,the film did nothing original just another generic action film that no one wants."}, {"rating": "7", "text": "Our President (Aaron Eckhart) travels to London for a state funeral with his star Secret Service guard (Gerard Butler). After a massive (and impressively rendered) terrorist attack on the city's major landmarks they're on their own to escape the culprits. Check your mind at the door and just enjoy an almost non-stop string of well-staged action encounters. Even though plausibility is in short supply and predictability abounds, Butler's seemingly superhuman ability and gung ho attitude power thru the ridiculous odds. It rips along with few pauses for drama and an boundless body count."}, {"rating": "8", "text": "This is a fun action packed no thinking March movie. Sit back, relax and watch stuff blow up. Don't take it serious and enjoy it for what it is. ACTION"}, {"rating": "7", "text": "Even though it's still not better than its last installment, Olympus, but London Has Fallen should be my guiltiest pleasure right now. Who doesn't love blowing sh*t up when you have Gerald Butler around? Great movie, I just imagine what other places they might destroy next? I wish they travel to Japan and rename the third film as Tokyo Has Fallen. I wish this gonna happen when it arrives in 2018 (unless if the President stays alive)."}, {"rating": "4", "text": "London has Fallen is loud, lazy and cheap looking. It takes a serious issue, something the critics don't won't to address, and turns it into a video game."}, {"rating": "5", "text": "A failed attempt to reproduce the “somewhat” glamour-ish ‘Olympus Has fallen’, but failed with originality, character depth and basic storytelling. It’s a big action-sequel but it doesn’t have the thrills nor the breathtaking aspects that’s supposed to define the genre. Add non-existing & despicable characters; well that’s ‘London Has Fallen’. The whole flick is about the fast plot and plot only, which is fun for some individuals but meh for others, and the structure of the film is one big mess with expositions and predictability all over the place. The actors though. Damn great! But what a waste of their careers. Another film with destruction of famous landmarks, but it’s a fast-paced and somewhat enjoyable (but messy) ride.\r Personal rating: 50/100\rCritical rating: 37/100"}, {"rating": "7", "text": "A good deal better than I thought it would be. Critics hate it because of it's cliches but they don't understand that the whole point of doing something that has been done before is to show how you make it different. The firefights weren't elaborate (it's not BulletStorm) but the simple act of shooting was top-notch in terms of movies. I was reminded of a 3rd person shooter game when in a later battle he sticks to cover and reloads. This happened a few times and was cool because some movies forget to reload. One of the greatest moments was when there's the finale explosion and the patriotic theme song plays. And Morgan Freeman makes a good point at the end about foreign policy. \"Some say this would have never happened if we minded our own business but that's not true. We know that it's better to do something than to do nothing\""}, {"rating": "5", "text": "Good cast and acting with a common action movie plot , I would probably give it a 6 as I did for Olympus Has Fallen 2013 rate it 6  to me 6 is a not bad score from my point of view  watchable movies started with 5 up . below 5 if you like to kill some time movies ,  The reason I give this 5  because of it's bad special and visual effects failure I know its so poor and some scene looks like a game but I can't just take out more than 1 score for that and totally forget about the movie so there you have it .  Please rate a movie wisely some users don't do 2 to 9 they only rate 1 for bad and 10 for good that's why we get fooled by most of that high rated movies and the same of very low rated movies that actually deserves more points !"}, {"rating": "8", "text": "So this movie won't be winning any awards.  We know that.  But, a group of us found it very entertaining.  Granted, you have to suspend realistic thinking as you watch it because lots of things are quite far fetched.  But, that's okay with us.  We just want to be entertained.  The premise is that the British Prime Minister has died and leaders from 40 countries will be attending the funeral.  A terrorist's dream.  There is non-stop action and it is all about bullets and bombs.  It is almost impossible to tell the good guys from the bad guys.  Gerard Butler and Aaron Eckhart are a great couple as the President and his Secret Service bodyguard.  And, keeping POTUS safe is not an easy thing.  Morgan Freeman lends gravitas as the V.P.  Loved it!"}, {"rating": "4", "text": "i watched this last night.. and i am going to talk about story or do spoilers...\rI was expecting something very great but i get nothing... if i will talk from the start, movie was okay but when the blast happened and effects where that bad that you can easily judge it.. story was OK. effect was worst literally worst, story line was bad. movie can't hold you till the end may be your expectation will do..\r i was hoping for something good but i get nothing.. while watching HOMELAND series came to my mind because of Drone and all.. **** from the start they showed drone so i was expecting very awesome things.. i gave 4 stars because of actors hard work.. don't go with any kinda expectations, just watch it.. and if you're expecting like the previous once then please don't watch it. Review by Mayank @itsbymayank and ya the last bomb blast was real thank you maybe"}, {"rating": "2", "text": "...*sigh*...I'd like to start by saying I put up a fight against seeing this movie but was out numbered so here we are. Terrorists have taken over London and it's up to Gerard Butler to protect the President from absolutely anyone as no one can be trusted. There isn't even enough laughs for this to make it into the \"so bad it's good\" category. Cringe inducing and over the top with horrendous dialogue. Not recommended but if you do go please leave your brain outside the door as it will not be needed."}, {"rating": "7", "text": "Inferior to Olympus Has Fallen but nevertheless wildly entertaining and action-packed, London Has Fallen delivers the action to compensate for its predictable plot."}, {"rating": "0", "text": "Id Rather Be Kidnapped and tortured by terrorists than watch this **** again.\r ......................................................................."}, {"rating": "8", "text": "London has Fallen doesn't seek to lead the audience up the garden path. It very obviously advertises itself as destructive action with a simple good guy bad guy message, a dollop of patriotism and a little smaltz. Perfect rainy day feel good flick.  Its neither cerebral nor nuanced. But then again neither are the mass of negative reviewers. What did they expect?  Did they watch the trailer ? Who goes to a movie knowing they won't enjoy it ? Whats wrong with some people ?"}, {"rating": "10", "text": "Excellent Action James Bond style movie. A few parts were a little too graphic for my taste but I love when movies don't need to be \"politically correct\" and call bad guys just as they are, In this case middle eastern terrorist."}, {"rating": "8", "text": "A very cliche' action film but a really fun,entertaining,over the top,bloody action flick. Gerard Butler is a badass once again brutally kicking the crap out of terrorists who think they can take him on. Some of the CGI shots are a little cheesy but they have improved since olympus Has Fallen, The action is violent and awesome and that's what makes the movie so much fun. My heart was pounding every second of this movie which is why I love it. I really think critics are to serious with fun action movies, just take them as they are. That being said, London Has Fallen is a fun action movie that will have audience's thrilled with excitement."}, {"rating": "3", "text": "London Has Fallen tries to be bigger in scale and scope than it's predecessor, and because of that it contains scenes of destruction and exploding buildings containing really bad visual effects. I understand this isn't a big budget movie so it obviously not going to have the great effects, but if that's the case then why try use them when they're just going to be bad?"}, {"rating": "7", "text": "This is one of these films which draws an unfair assessment. Not sure why so many disliked it .  The storyline made sense. The acting was performed well.  As in all shoot'em up movies some scenes are questionable as far as presenting a realistic shootouts but overall both my wife and myself was not disappointed .Ignore the ire of some and see it for yourself"}, {"rating": "6", "text": "Rather implausible and predictable, but the bullets and knives rip mercilessly enough for visceral action delight.\r From the previous title, or even this title, audience would have a clear idea of what's promised here. It's \"save the president\" themed action movie, sets in London. There are famous names actors to elevate the story, but it should be no surprise that the drama portion is average. They do succeed on advancing the action into full blown combat spectacle from continuous shoot-out and rapid brutal slashing.\r Benjamin Asher (Aaron Eckhart), the president of USA, has an obligation to attend the funeral of British Prime Minister. Along with his trusty bodyguard and soon-to-be part time dad, Mike Banning (Gerard Butler) he embarks in the trip, and as we all know it, London is eventually hit with terrorist attack. The story is plain it operates on a strict linear motion with barely any twist at all even though it has actors who worked on this genre before.\r The main idea is the same patriotism and duty-bound motive, which is arguably worked slightly better than the predecessor, but it often becomes too flat in delivery. Some of the scenes feel too forced to create tension and it ends up too cliché in the process. Script doesn't produce any solid interaction as it relies on too much on misguided bravado and the comedy aspect only works partially. Furthermore, the intended twist is far from effective since it doesn't develop nicely, if any at all.\r Fortunately, this is a definite step up action-wise. Chase scenes, melee brawls and gun fights are far more intense and better choreographed. It has the luxury of great continuous shots action in no shortage of speed and impact, almost similar to video game sequences. There's also the addition of CG for large scale attack, understandable since they have to present actual London under siege, though it's inferior to the psychical combat counterpart.\r \"London Has Fallen\" is miles from the predecessor in term of action, but it might not be an appealing visit for those wanting complex narrative."}, {"rating": "0", "text": "Another one of the \"terrorist group declares war on the entire world and somehow is more powerful than the rest of the world's army combined\" hollywood film, with zero respect for the viewer's intelligence. The film desperately wants to be taken seriously though, which is difficult considering what is going on in the laughable plot. There are plenty of cliches though so yay? Don't even watch this for free, there are better shows for your time.Oh and Morgan Freeman is in this film, but his character has zero personality."}, {"rating": "5", "text": "London Has Fallen is a dumb action movie with no story or any development, and that's what I was expecting going in and that's what I got. I would be lying if I said I didn't enjoy myself watching this movie, because I did (for what it is). There were a few good actions scenes that was pretty well done and Gerard Butler makes for an enjoyable lead. I know this movie isn't suppose to be taken too seriously, because you would look like a right fool if you take any of this movie serious, but i can't pretend or act like i don't see the major flaws in this movie. I think the biggest thing that really hurt this movie is the noticeable CGI, which is absolutely awful and looks completely unfinished. Aaron Eckhart basically plays the male version of a damsel in distress and Jackie Earle Haley doesn't even do anything in this film.\r Overall, if you want a movie that's non-stop action and doesn't make any sense at all, but you want to have a good time, then London Has Fallen is the movie for you."}, {"rating": "9", "text": "Great above average action film. London has Fallen does have its cliched moments, but it really has a good plot/script and some amazing/intense action sequences. I think this was a great film overall, and in fact I thought I enjoyed every single scene. Every single scene seems to have entertained me! I don't know why but I think critics are really bashing these types of films, like White House Down. (91/100)"}, {"rating": "2", "text": "I found this film too violent and totally unbelievable.    The 'hero' was totally indestructable.\rHe fought off at least 100 opponents on his own,   saved the wofld from disaster and ended the film with no obvious wounds.\rWe should keep him on standby to save the world"}, {"rating": "2", "text": "Beyond bad.  The first one was pretty bad but had a few decent lines and was vaguely entertaining for the premise.  (maybe a 5/10.)  This movie takes anything that was good in the first one...and throws it in a dumpster, lights it on fire, and adds a bunch of racism, stereotyping, and poor dialogue on top of it.  There are maybe a few cool action scenes but it was so bad I honestly forgot what happened...or even if I had seen it at all...until I see it was on Netflix...I fastforwarded though it in seconds...and noticed that yes, that was one of the worst movies I had the misfortune of watching.  So predictable and banal...that I had forgotten most of the actual film or fast-forwarded though half of it it was so bad.   If you like not just dumb action movies, but very dumb action movies, you might think this movie is OK.  Suggestion:  be ready to fast forward after the early explosions happen because the 2nd half of the movie...just gets worse from there.  At least write in an interesting bad guy or something that hasn't been done 50,000,000 million times before and the movie might have actually been remembered for something.  Terrible waste of a decent premise and decent actors: 2/10."}, {"rating": "5", "text": "Action movies, regardless of their explicit intent or savage coincidences, always tend to be a blend of entertainment, and implicitly, a political mine-field waiting to be criticized for its portrayal of the bad guys. Bad guys, no matter how hard you try to justify them, are always the main concern and heavily scrutinized subject of many critics and talks within action movies. Now, after 2013’s obsession with White House abduction movies, White House Down and the original Olympus Has Fallen, which spawned our currently reviewed London Has Fallen, its hard not to be political when the main players in the film are today’s world leaders.\r In 2013, London’s predecessor Olympus Has Fallen showed a very political situation of a North Korean terrorist trying to unify Korea by capturing the American President, and using it as leverage to remove American opposition in North Korea for a South Korean invasion. While London Has Fallen does not have as much of a very intellectual plot as its original, one thing is for sure, the action, language and kick-ass Mike Banning (Gerard Butler) are amped up to mirror signature John McClane moments, but never ever quite passes them.\r London Has Fallen is a less thought-out actioner, yet, the film tries to out-do its predecessor’s actions, with a smaller budget, which never boasts well for action movies. Usually, when studios give a smaller budget to sequels, their faith in the subject matter is not very convincing. Yet, London Has Fallen is a more aggressive, solid action film that Olympus on many levels, and perhaps thats because of the cast and crew’s fun with the material, rather than a serious tone found in the first film.\r Rugged with grit and braun, London Has Fallen is easily a fun and mindless action movie for die-hard action movie fans, as well as passive fanfare for casual action fans to the genre as well. Filled with ridiculous one-liners, sometimes really animated and disgraceful action special effects and some serious contemplative moments of justification and reveal, London Has Fallen is the perfect post-Oscar action movie to cozy up to for the month of March.\r As mentioned above, Olympus was a much more plot-heavy and politically savvy action film, while London is nothing short of a revenge film. But who is to say revenge films are bad? Anyone remember Kill Bill or Mad Max: Fury Road?\r The baddie this time, Aamir Barkawi (Alon Aboutboul) is a arms-dealing terrorist, arming any nation or any one body, with deep enough pockets, with weapons that could take out some of the world largest and longest standing national landmarks. When his dealings get him directly entangled with the interests of the United States, the United States military orders a drone strike attack on Aamir and his family. Of course, to amp up the melodrama and emotions, despite all of the intelligence of the United States government, the day of the strike is the same day as Aamir’s youngest daughter’s wedding. Barely escaping the bombing of the United States, Aamir and his son Kamran Barkawi (Waleed Zuaiter) spend two long, hard year, devising a plan that will get their revenge and debt in blood.\r Upon the news of the sudden death of the British Prime Minister, President Benjamin Asher (Aaron Eckhart) along with his top personal Secret Service Agent Banning, make their way to the UK for a highly publicized funeral for the former Prime Minister. Gathering some of the biggest leaders in the world, Barkawi’s plans being to unfold, trapping leaders, bombing landmarks and killing off thousands of people, including innocent civilians, in an attempt to capturing the leader of the free world, and globally broadcasting his execution. Banning, whose steps ahead of every nations top security outlets, goes above and beyond his duties, not informing a single soul of the President’s movements and plans. His quick decisions saves the President for as long as he can, until he in inevitably captured and planned to be publicly executed for fear propaganda.\r Some of the most interesting parts of London Has Fallen aren’t even within the scenes of the film, but facts surrounding the film as a whole make for one interesting little pop culture entry. Olympus, which was directed by American go-to action director Antoine Fuqua (Southpaw and The Equalizer) dropped out of the sequel, and was replaced, surprisingly by Iranian born filmmaker Babak Najafi, the man behind the Easy Money sequel and Berlin Film Festival darling Sebbe. What’s truly surprising with London is the studio’s confidence in an International director taking the reigns of a quite heavy Pro-America action film, one that has no problem showcasing the always tacky shots of the tattered American flag victoriously whisking in the wind over a sunrise or sunset."}, {"rating": "0", "text": "After watching this based on a recommendation (or at least started to watch and then gave up after 30 or so mins) I can say this is one of the worst movies I've watched in a long time.Filled with horrible plot elements that utterly smash suspension of disbelief and a Pro-US bent so driven that this is comparable to the propaganda films of North Korea.The opening scenes seem written only to directly insult every nation possible. The action is cliché and the 'world' of the movie is completely unbelievable.Avoid this movie at all costs. If you really must waste your time, I'd recommend spending 115 mins staring at a single blade of grass - You'd likely have a better experience with greater character depth and probably a far more enjoyable story."}, {"rating": "7", "text": "London Has Fallen is directed by Babak Najafi and include the main cast of Gerard Butler, Aaron Eckhart, and Morgan Freeman.\rI enjoyed the movie throughout, even though it started off really boring it definitely had some interesting parts here and there. The ending is also quite fun, in a turn-your-brain-off kind of way. What bothered me the most was the editing, which was terrible up until that one-shot sequence at the end, where it finally got a bit better.\rGerard Butler is really great on the role, a total badass, even though he was so in a very unrealistic way. The overall character fits with the theme of the movie.\rAaron Eckhart is also fine here, as he is in any movie ever. I think this actor is terribly underrated and overlooked no matter what role he is playing.\rThe CGI is pretty underwhelming, they should have increased the budget from the first movie, which was also better in almost every aspect than this sequel.\rLondon Has Fallen is not made to be over analyzed, it is just a fun action meaningless, suspenseful and to a point unnecessary movie that's made for 90's action movie fans to enjoy."}, {"rating": "7", "text": "I didn’t go expecting to see the greatest action movie, but I just wanted to see a fun action movie and surprisingly the movie just delivered that. London Has Fallen is definitely a mindless action movie. The movie shows a great chemistry between Gerard Butler and Aaron Eckhart with Gerard’s character being the best thing in the whole movie. The movie has a ridiculous plot but has stunning action scenes which will make the audience entertained. The movie pulls you back into a terribly clichéd villain and there’s almost nothing intriguing in the first half of the movie ."}, {"rating": "8", "text": "This move is the definition of bad ass. It's a throwback to 80 's action movies. Though the story is a bit weird it's not center stage, what is though is Gerard Butler who is bad ass added on top of bad ass. This movie is a great start to march."}, {"rating": "4", "text": "Is Gerald Butler a badass? Sure he is. Is it enough to save this entire movie? Nope. Other than a cool tracking shot in the third act, London Has Fallen is an overall idiotic movie. I understand it's meant to be over the top and a throw back to classic 80s action films but it was style over substance through and through."}, {"rating": "7", "text": "This movie is getting judged pretty harshly. Yes it has a generic terrorist villain with generic terrorist motives, and yes the patriotism can be a little over the top at times. Despite that, if you enjoy action movies and don't think a movie has to be groundbreaking to be enjoyable, then there are good qualities too. The original cast returns, and the movie strikes a good balance between respecting the relationships between characters from the first movie and remaining accessible to newcomers. You don't have to watch Olympus Has Fallen to enjoy this movie, although I definitely recommend that movie. The plot has much in common with the original, but there are enough differences that it never felt like I was just watching the same movie. The action is on the border of over-the-top, but it doesn't stray too far. As opposed to the first film, Mike Banning (the protagonist) has quite a bit of help, so he feels less like a unstoppable action hero and more like a highly-skilled combatant.\r Bottom-line: Check it out if you like a don't-think-too-hard action movie."}, {"rating": "4", "text": "The only reason this got a good score is because of Mr freeman, I think personally its silly and childish, One man places the SAS secondary to himself and takes on a whole building... No I don't think so. Not quite hit it this time i'm afraid."}, {"rating": "10", "text": "Great movie with good action and a little bit of comedy. Kept me entertained and on the edge of my seat the whole time. Loved the aspect of the president and his security."}, {"rating": "7", "text": "I do not believe it is a spoiler to say that this movie is very much what you would expect if you have seen the first movie. The action is hard hitting like the first film.  The hand to hand and close arms conflict tends more towards brutal efficiency than it does towards being overly dramatized.  That might be where the complaints concerning massive body counts comes from.  If you are going to have a few really long fights, and you are making a minimal plot action movie, you might want to have a hundred short fights.\rThe cinematography is good.  The acting is solid.  The language is surprisingly vulgar, but otherwise the professional keep it professional, for the most part :) There are a couple moments where the writing didn't seem quite up to par, but maybe those were ad-libs.\rThis movie is not up to the level of Die Hard, Lethal Weapon, John Wick, or the Equalizer.  It is a different kind of action movie.  It doesn't do the cute clever moments.  Without the Steven Seagal or Liam Neeson line deliveries and clever action moments, this film isn't fun like many action films can be.  It is a brutal chase film.  A well done brutal chase film.  If you don't want to see a brutal combat chase film, don't go to this movie and the give it a 4, 3, 2, 1, or 0 score.\rLike some other worthy sequels, this movie is true the first film without being a copy of the first film."}, {"rating": "2", "text": "\"London has Fallen\" is one of the most boring, lifeless, dull, and uninspired movies I've ever had the misfortune of enduring. It's so bad that it makes \"Olympus\" look like a masterpiece."}, {"rating": "6", "text": "Decent movie where Gerald Butler is portrayed as the fighter/defender in which he shines. The plot was pretty straight forward but nevertheless was it catchy enough to stay in the story. You can expect some decent action throughout the movie which keeps you hooked but don't expect to much of a plot, which was in my eyes decided and \"revealed\" in the first 10 minutes."}, {"rating": "3", "text": "A predictably macho-patriotic action movie with a largely overblown plot. Also, why does the entire script consist of nothing but of cheesy one-liners?!"}, {"rating": "3", "text": "So far... I was not expecting a sequel to Olympus Has Fallen so I knew it would be dumb in the first place without any doubt. It's like they're trying to improve what they did with Olympus Has Fallen but failed to do so every single step."}, {"rating": "3", "text": "Kinda sucks that the main character from 'Gods Of Egypt' is also the main character in this. I guess this year won't be so pretty after all. And to be honest, he's a great actor but I'm just so sorry for him. Two movies that disappoint and nothing new at all."}, {"rating": "3", "text": "A disappointing sequel to what was an otherwise great original. The city of London is not the only thing to have fallen in this sequel, the quality of story telling has also taken a dive."}, {"rating": "1", "text": "At best - kringeworthy. LHF highlights the current state of Hollywood action screenplay format - moribund!! The theme of insulting your international 'BFF' has become tiresome. Presumably, US filmmakers are too scared to suggest total incompetence of 'unfriendly' States or are ignorant of the U.K. Considerable experience in matters of anti-terrorism. Yet again the world is saved by a guns-Ho US President and Special Agent (played by a Scotsman!) practically ignoring their 'saviours' in the form of a 22SAS unit, under the command of a Scotsman.\rGiven the choice between watching this movie or a rainy day in the Highlands - I recommend you by a disposable umbrella!"}, {"rating": "9", "text": "Let's just start this out with the obvious. This is an action movie. And it is a good one at that. The action is plenty, and there was no moments in the whole movie in which I felt bored, or wasn't interested. I think that the humor hit very well. It wasn't used every few minutes, but instead was well placed throughout. I feel like Gerard Butler was again a good choice as an agent, and felt like someone well fit for this role. I loved Olympus has Fallen, and I believe that if you liked it even remotely, you will like this movie. I feel like overall, it was a better movie than Olympus has Fallen. A lot of the bad reviews you hear on this movie will be centered around it being too similar to the first, which it isn't, or about it being too action heavy possibly? Overall the theme is similar in that you have a person trying to save the president, but the setting and the way it is presented is fresh and new. I actually felt really into the movie as a whole. Overall, 9/10."}, {"rating": "2", "text": "plodding and ugly with a gross attitude of \"white people are good, brown people are bad\" that I couldn't get past. pair that with terrible one-liners and unnecessarily excessive violence, this is an extremely unpleasant watch."}, {"rating": "0", "text": "I waste my time watching this movie. I understand this is an action movie. But even for an action movie, you need to have a logic that makes sense to some degree. For example:\r 1. Everybody at MI6, are stupid and they need a field agent come and reconnect the system.\r2. For **** sake, the president of the united state is under attack and there is no field agent (CIA) in entire London or nearby to help him! What about Germany, or the  Netherlands, How about NATO!!\r3. There is a marshal Law thingish that is used for this kinda situations! \" Oh we should do nothing and wait till our hero to kill everybody then we can take back London!\"\r4. In one of the absolute **** part in safe house, two MI6 field agents leave our hero and the president of the united states alone to fight  to go where? what could be more important than protecting the president?\r I could go forever! every part of the movie had these types of garbage."}], "recommendations": ["olympus_has_fallen", "the_kingdom", "geostorm", "salt", "battleship", "skyscraper", "the_purge_election_year", "infinite", "the_tomorrow_war", "american_assassin", "repo_men", "taken_3", "the_transporter_refueled", "the_ice_road", "red_dawn", "angel_has_fallen", "xxx_return_of_xander_cage", "elysium", "shadow_in_the_cloud", "taken", "taken_2", "battle_los_angeles", "escape_plan", "mile_22", "furious_7"]}