{
  "id": 2305,
  "title": "Lone Survivor",
  "starring": [
    "Mark Wahlberg",
    "Taylor Kitsch"
  ],
  "runtime": 121,
  "genre": [
    "War",
    "Action",
    "Drama",
    "History"
  ],
  "description": "Four Navy SEALs on a covert mission to neutralize a high-level Taliban operative must make an impossible moral decision in the mountains of Afghanistan that leads them into an enemy ambush. As they confront unthinkable odds, the SEALs must find reserves of strength and resilience to fight to the finish.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zaBIrloyhGK7iNTZMb3f9SARsl8.jpg",
  "categories": {
    "plot": 7.458333333333333,
    "acting": 7.296296296296297,
    "ending": 8.38888888888889,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 7.892857142857143
  },
  "reviews": [
    {
      "rating": "10",
      "text": "\"Lone Survivor\" based on a true story of 4 navy seals on a mission to capture the Taliban leader. This movie was fantastic from the start! This movie was well made and well acted. I just wished there was more character depth to feel very bad for the men that died in the film. The film was extremely spectacular, when it came to the action it was so intense and very well done! It was super realistic, there were a couple of scenes that can make your stomach turn. Overall this film was very good and showed how much courage these men had, It was way better then what I expected!  10 out of 10"
    },
    {
      "rating": "8",
      "text": "After seeing this incredible true story, it really made me wonder what director Peter Berg was thinking when he did the mediocre \"Battleship.\" This film was a great example of war movies done right, like \"Saving Private Ryan\" and \"Black Hawk Down.\" The acting from the four Navy SEALS was exceptional! Mark Wahlberg was great as usual! \"Battleship\" star Taylor Kitsch also gave another great performance. Emile Hirsch was really good, as was the highly underrated Ben Foster. The story was really well done and the action was intense and delivered! So overall, this is one war film that's definitely worth checking out, as it portrays the true courage of those SEALS that died that day, as well as all SEALS in general."
    },
    {
      "rating": "6",
      "text": "I'm surprised at the reviews calling the film \"too patriotic\" or even \"jingoistic.\" I found it to be well-acted and notably lacking in what some might call flag-waving or in politics of any sort. These guys are heroic to be true to themselves and strong for their \"brothers.\" They don't care who's president or defense secretary. Unfortunately, the script and film are NOT lacking in cliches. You've seen 'em all and will see them again. It also does a poor job of helping us establish emotional connections with the men who (obviously) are going to lose their lives. Violence of all sorts is extremely brutal and I had to look away at times ... but that's one of the points of a fact-based war movie, right -- that those who lived it did not have the option to look away?"
    },
    {
      "rating": "9",
      "text": "I thought this was an excellent movie. Reading some of the critics reviews here can be misleading. It is evident that those critics who thought negatively about this film we're viewing it through their own political and moral lens. Take in this film objectively and it is a thought provoking, high energy account of what happened. I also suggest you read the book first, I appreciated the additional context it provided. That being said, the film does a pretty good job condensing the book while maintaining its moral and political dilemmas as well as it's heart-felt sentiments."
    },
    {
      "rating": "10",
      "text": "This movie was a brutally beautiful tribute to the men killed during Operation Red Wing. Having read the book multiple times I knew I wasn't going to be surprised by anything in the movie but I was still moved by actually seeing what these men endured. Peter Berg did a great job telling this story. Marcus Luttrell did an awesome job keeping it honest. Thank God for our military and their willingness to serve selflessly."
    },
    {
      "rating": "10",
      "text": "I loved this movie, it was a great tribute to the men that gave their lives in Operation Red Wings. You can tell that they had Marcus Luttrell guiding them and making sure things were not blown out of proportion just to meet Hollywood standards. Was a great birthday present from my wife and I will definitely buy it once it is released on DVD, hell I even made an account just so I could rate it being a veteran I am very picky about military movies but this was one of the best up there with Saving Private Ryan and We Were Soldiers."
    },
    {
      "rating": "8",
      "text": "A film that truly surprised me, in regards to how the cast was going to hold up.  I have no doubt with Peter Berg has ability to create a sense of true American realism, as seen in Friday Night Lights and his respective series.  The cast was great, however, I felt that we could of saw a little more of them because I didn't feel the emotional connection I thought I should as they fell one by one.  But, as I say this, the ending of the movie was the most emotional part of the movie.  That, along with the rendition of We Can Be Heroes, was, I can't express how I felt."
    },
    {
      "rating": "10",
      "text": "This movie is brutal. There were parts that made me cringe. This movie had me hooked the whole way through. When the fighting begins, it doesn't end until the end of the movie. I didn't think I could have been any prouder of the US Military but after watching this film, I was wrong. It made me remember that there are people out there serving this country, making decisions that puts theirs lives in harms way so I can sit here and write a review based on my opinion about a movie that i wasn't sure I was going to like. I loved it. It is one of those movies you watch and it impacts you.\r The only change I would make is the title. I don't think it does this movie justice. I would have gone with the mission name instead."
    },
    {
      "rating": "10",
      "text": "i felt compelled to write a review after seeing some of the absurd reviews written by the professional critics.  This is a painful & beautiful & honorable film filled with spirit.  From Mr. Berg, to the cast, all the way through even the effects of Greg Nicotero, the passion is clear and palpable.  This film conveys core elements of the human experience in so many complex, unlikely, and ultimately honest ways.  And that's what we want from  a great movie isn't it?"
    },
    {
      "rating": "10",
      "text": "Lone Survivor is brutal and intensely violent. It'll break your heart. I absolutely love and respect this movie, and it has given me a newfound appreciation and respect for the sacrifices our military makes so that we can live in peace here at home. It's so shockingly realistic and gritty that you'll wince every time one of the main quarter cast gets shot or injured."
    },
    {
      "rating": "9",
      "text": "So, from the looks of it most of the \"Top reviewers\" are in some way retarded. This isn't supposed to be some action flick with lots of violence. It's a depiction of real events; if telling the truth is propaganda  as the reviewers claim, then DEVGRU really is a modern day Hercules. It'd take a few minutes to fact check the details in the movie to the actual events and they'd realize how dumb they sound.\r Three men did die on that mountain, Lt Murphy did sacrifice himself to call for help, a Chinook was shot down, an Afghan man did save Lutrell's life. It baffles me that some people would call any of that propaganda (it tells you something, when the book has near perfect reviews  that hollywood reviewers are trash)."
    },
    {
      "rating": "10",
      "text": "Most compelling characters with true dedication towards their nation and duty. Not matter what critics say, this movie is going to win the heart of every living human being."
    },
    {
      "rating": "9",
      "text": "This movie shows the kind of hell the military has o go through at times, sad sorry of these courageous soldiers that never give up and put their teams interests above their own lives."
    },
    {
      "rating": "9",
      "text": "I don't give out a lot of tens and from a cinematic perspective I guess this one isn't but you'll never see a more intense war depiction than Lone Survivor. Marcus Luttrell has stated he is 85% satisfied with how it turned out. For Hollywood depicting a true story those are pretty high marks in my experience. I wouldn't recommend it to anyone sensitive to graphic violence but if you want to experience heroism and courage without politics this is the film for you."
    },
    {
      "rating": "9",
      "text": "First I have to say I rarely write reviews. Just left the theater and I was compelled to give my opinion of this movie. First and foremost the movie kept my interest from the second it started until the ending credits and beyond...Almost didn't want to leave the theater....one of the most moving movies I've seen in some time. I've read some of the reviews and agreed with most, its as good as a war film with true emotion as ur going to get. In my humble opinion it was as good as Saving private Ryan! Not as meticulous as a Spielberg film but just as enjoyable...I'm not a military guy but after seeing this movie I have a renewed respect for these guys. I almost wished I was younger to join such a Nobel cause....These guys albeit mostly in danger are truly living.  Sorry getting off course...acting was very believable and loved the back ground music...Peter Berg did a fine job off telling this unbelievable story of our real life super heroes. However I left the theater hating the enemy and loving the fact that I am an American!!! Although there is a bit of a twist towards the end that gives us food for thought. Sometimes not everyone who we think are our enemies are...I highly recommend this movie!"
    },
    {
      "rating": "7",
      "text": "Berg's film is adeptly crafted but without much soul. Bookending it with actual footage of the Navy SEALs contextualizes it as a tribute rather than a dramatic exploration. Which is acceptable  young people with hours of Call of Duty under their belts need to see the war games played out in reality. But as a fully formed feature, Lone Survivor prioritizes respect over honesty. Ultimately, it can't achieve either. Lone Survivor director Peter Berg puts the emphasis on action and veneration rather than dramatic exploration and nuance in this fact-based Navy SEALs film."
    },
    {
      "rating": "8",
      "text": "Action.. patriotism...pride...compassion...and appreciation are all you need to know about this movie.\rPlots.. sub-plots... acting...dialogue.. etc.. don't really cross your mind when you are watching this movie.\rits simply a good time at the movie. You will leave the theater feeling enormous pride to live under the same airspace as our military men and women that risk their lives day in and day out"
    },
    {
      "rating": "10",
      "text": "This story is the very definition of Hero, Pain, Love, Brotherhood, Family, Spirit and Humanity coming together regardless of cultures and backgrounds.  It put things into perspective for me.  These men have families, wives, little ones and yet they volunteer to put there lives on the line for what they believe most.  Our freedom.  My Wife broke down at the end of the movie and I almost lost my nerves.  You FEEL everything in this movie.    Best War movie since Saving Private Ryan."
    },
    {
      "rating": "10",
      "text": "It is hard for me to write on this subject. We all know how this film ends before we see it. Only one men survived to tell this true story. To keep things short i gave this movie a ten, because we all need to know that this is dedicated to the men who lost their lives. FOR HONOR AND GLORY"
    },
    {
      "rating": "8",
      "text": "This brutal war epic delivers through its action sequences and heart-pounding story. Its suspense keeps the movie going and even have the audience guessing even if they don't anything about the real-life story. One big issue to me was that there wasn't enough character development (mainly between the supporting roles played by Taylor Kitsch, Emile Hirsch and Ben Foster) other than that \"Lone Survivor\" is a gripping and intense war film surprisingly directed by the guy that brought us \"Battleship\", but I won't hold that against him. Overall, this is a good movie to check this month. I give it an A-!"
    },
    {
      "rating": "9",
      "text": "There are some flaws. But overall this is a gripping and entertaining movie. I am not an avid movie lover because I usually get bored with the tired stories. However, I was pleasantly surprised by this film. I very much enjoyed it, and highly recommend it. Be warned, the firefight scenes are intense. It is hard to watch at times, not because it isn't good, but because of the intensity."
    },
    {
      "rating": "9",
      "text": "I'm usually not a fan of flag-waving war movies. But this one had a lot of nice elements. What carried the narrative along, so that it wasn't just a shoot out, (although one of those scenes went on too long for my taste), was careful editing, back and forth between two or three narratives. And what carried the day, was not patriotism, but the the band of men, fighting together. The four men, were admirable, although I wasn't completely happy with either Mark Wahlberg's character or acting, I'm not sure why, I seemed to have the sense that he wasn't in the fight as much as the other men, as if the star needs to be saved at the end, and I dislike having to say that, because I am sure the real life hero fought as bravely as the others. The script and dialog were tight. The film showed war at its bloodiest, most fatal, hand-to-had combat. And also had an interesting plot twist at the end showing the humanity of a culture other than our own. Interspersed with the fighting shots were wide angle natural beauty: supposed to be a mountainous range in Afghanistan; the film was shot in New Mexico. The film's credits at beginning and end - stay all the way to the end - nicely framed the picture in our real country's heroes. The entire theater audience with whom I saw the picture, applauded the film at the end, and at the end of the credits. Films don't often get that kind of praise."
    },
    {
      "rating": "9",
      "text": "This movie like most movies has a message to send. It was compelling and moving the way the four actors captured each of their roles, showing the lighter side things, the pride in serving your country as dark as the times may have been. But the movie was amazing on many different levels. For one it's inspiring, showing us that we should always look for the good in people and learn how to trust someone even when all seems lost. I really enjoyed this movie for the action, the dialogue, the comedic aspect of the conversations between characters, as well as the camera angles and ideas executed."
    },
    {
      "rating": "1",
      "text": "This film takes the generally gruesome and at times utterly horrific slaughter of a small group of US soliders and civilians and uses it as a platform to promote that US military. Jingoistic overtones of patroitism, home and country try unsuccessfully to pave over the blood, gore and misery of young men with wives, babies and small children killed in Afganistan to support the imperialist asperations of corrupt US elites.\r I was left feeling saddened and in no small way nausiated. To make matters worse at the end we get to see these people in happier times with wives and the part that really upset me small babies and children.\r Just as bad in one sense too was the films compulsion to exaggerate the specifics surrounding the actual death of these men as if the truth somehow detracted from their bravery. The enemy multiplied from the true number of 10 combatants to over 200 or more. To make these people seem more less worthy and more villianous they were presented as Taliban which was strictly not the case. They were aligned with the Taliban but then show me a Afgan combatant who does not at least have a passing relationship with them.\r If this films sends a message to US voters as it did to me it would be get rid of your two main parties and find some decent ethical people to vote for. The current mob are an elitist immoral disgrace who worship death and conquest at any cost over simple human decency and respect for life."
    },
    {
      "rating": "9",
      "text": "A story foremost about the brotherhood of fighting for one's country and for one another.  This film is a very tough film to watch, but a fantastic film no less.  A"
    },
    {
      "rating": "8",
      "text": "These so-called 'professional critics' of some are pathetic.  To give Lone Survivor a zero or very low score shows that some people think they know it all and they do not.  Many movie critics find every way they can to knock a movie and they rarely EVER give mid to high scores.  So, F- them.\rThis movie gets 'a pass' bc Berg had the job of re-creating a real true honest story.  They go out of their way to re-invent the actual true events and that can be hard.  So cut them a break.  This movie makes you FEEL.  It gives us 'undeserving' a chance to get as close to the action of war as possible.  To catch a glimpse of real horrible warfare where U.S. soldiers die fighting to protect our freedom which most people take for granted daily.  Seriously, start reading the news, watch you tube videos of live war, real fear, disaster, dead soldiers...get educated about our war history and why our soldiers do what they do to maintain or reduce our enemies/terrorsists from mounting up against us from a far.  This is a moving, touching, patriotic movie that deserves respect to the real men and woman who died for you and me during this operation.  And so-called 'pro-critics'...who think  you are...Go critique fiction and keep your mouths shut!  Because we don't want to hear your ignorant thoughts about this movie."
    },
    {
      "rating": "0",
      "text": "The warfare and battle genre is depicted quite flashy and irrelevant these days, be it as it may in Lone Survivor, there is actual emotion in there. Within the realms of hollow characters and dull editing, Mark Wahlberg's big movie to kick off a year where is in something bigger in the oncoming train wreck of Transformers, he has just set the bar. Clearly trying to emote something heartfelt and crushing here, it falls to the depths of boredom without a doubt. Sometimes these movies fly high, but most crash the surface of dry sand with no penetration, I couldn't care less about this dribble."
    },
    {
      "rating": "8",
      "text": "It's obvious from the title that most of the men don't survive, but the operation is what matters. Four Navy SEALs set out to kill a Taliban leader in Afghanistan, but the mission goes horribly wrong. The film takes some time to set up, but once the action kicks in, it's a gripping ordeal (especially those remarkable tumbles down the rocks). Director Peter Berg has crammed the skirmishes with confusion, astounding kills and high-tension pacing. These are some of the best battles in recent filmmaking. The cast is strong (in both senses of the word), while miming moments of emotion. A brutal, well-crafted and stirring tribute."
    },
    {
      "rating": "9",
      "text": "A brutal and emotional movie that is only amplified by the fact that it is serving as a tribute to real people and events. The cast is fantastic. Every single one of the actors here bring their best and really sell the horror and pain of the events. It's one of the best war movies I've ever seen, not because it glorifies the violence, but rather shows the horror of it. This is one of the best movies I've seen in a long time, and I recommend you put it at the top of your must-watch list. I give it a 9.8/10=Amazing."
    },
    {
      "rating": "6",
      "text": "This movie is based on real events in 2005 in Afghanistan and on a book with the same name written by a Navy SEAL Marcus Luttrell who was the only survivor in a battle with Taliban.\r Combat scenes are done exceptionally well. There is real footage in the beginning of the movie of some training that SEALs have to go through. And pictures of fallen soldiers and officers who lost their lives in that fight were shown at the end of the movie. All that adds to the authenticity of it. In those pictures soldiers were surrounded with their families. That makes you think of the utmost sacrifice of those men and the horrible loss their families endured.\r As a piece of art this movie did not engage me with exception of the very last part.\rBut as a tribute to soldiers who risk their lives to protect our freedom this movie is great."
    },
    {
      "rating": "0",
      "text": "Oh look everyone: some mindless US war propaganda! I'm so surprised. So if you like US war propaganda you might like Lone Survivor. if you don't, and perhaps even understand that it is logically impossible to fight a defensive war of any kind on the opposite side of the globe, and that this is therefore an illegal war of aggression being glorified, you will either laugh at how ridiculous the movie is or turn it off after 15 minutes out of disgust that this worthless stuff is being marketed at stupid young Americans males.There is absolutely nothing worthwhile being pushed by this movie. It is almost a war crime in its own right, to go with the thousands of war crimes committed by the US government against the people of Afghanistan already. I usually don't advocate censorship of anything, but Lone Survivor is unworthy of being watched by anybody. I'll make an exception, and just this one movie should be banned. What an insult to humanity it is."
    },
    {
      "rating": "9",
      "text": "This is a really good movie, it stays very true to the events that happened. There was an amazing tribute at the end that showed everyone that died. Very brutal, and bloody."
    },
    {
      "rating": "8",
      "text": "A visceral display of streaming bullets and gory bloodshed, Lone Survivor follows a botched military operation with relentless intensity. It portrays the unforgiving struggle as the four stranded NAVY SEALs climb and jump for their survival in punishing hostile territory. The movie does a good job of not excessively use special effects, action feels more realistic with restriction on design, make up and practical effect. While it boasts military lingo and thick atmosphere of exclusive brotherhood, the movie manages to convey the sacrifice to the audience.\r The movie is a dramatization of an actual failed mission which left the four men team behind enemy line in Afghanistan. Mark Wahlberg is at his element as Marcus Luttrell, he thrives more in an arduous action movie. Stoic and with grit, he produces more natural rendition in this type of role. The cast of recon team could use more characterization as sometimes they might fall into stereotypical macho soldier. However, as the movie progresses and these men engage in battle of attrition and moral, they perform more compellingly in extreme situation.\r There is a raw primal feeling at work as they are shot endlessly. It's a grueling and exhausting process; the sensation of utmost emergency is almost as engaging as what Black Hawk Down had to offer, although in smaller scale. The way the shootout is portrayed, by visual and audio, is impeccably organic. Whiffs of nearby bullets sound intimately closely, the flesh tearing hits are even more so. The movie understands how to build up exhilaration while the protagonists fade with every hit they take.\r It reaches its height in the second act; the latter part does tend to falter. The pace loses a bit of steam towards the end, even though it makes a decent conclusion. Most time goes to reenact the gruesome battle and it's done justly, but there could be more effort made for the buildup as well. Audience might not follow the mission well as it's peppered with military terminology or the geography of Afghanistan, the movie could clarify the position and movement clearer.\r There are flaws, but in essence Lone Survivor succeeds in portraying a courageous act. It's patriotic without being preachy; instead it delivers with tightly packed action and sheer tension."
    },
    {
      "rating": "7",
      "text": "Berg did for war films what Peckinpah did for westerns with Wild Bunch.  You can't leave the theater without remembering the violence of war --- no bloody lipstick for bullet wounds here.  The entire film was tension filled even with a too predictable conclusion.  What would have been better than knowing only one survived as indicated by the title would have been if it were someone other than Mark Wahlberg.  I really like him, have seen most all of his films, he played the part well, but it made the ending as to which one was to survive even more predictable.  What could have been a great movie, therefore, wasn't."
    },
    {
      "rating": "7",
      "text": "I didn't expect too much from this film, that may be why I liked it.  But none the less, this movie tells an amazing true story, with action! Drama! Not a lot of comedy...barely any, but that's a war movie right?\rThis isn't the kind if movie to dazzle at the awards ceremonies, but.  It will dazzle to everyone who watches it.  This year, or any year.  People will continue to watch this movie.  Much like Zero Dark Thirty."
    },
    {
      "rating": "9",
      "text": "This movie is a great tribute to the men who passed away during Operation Red Wing. It's emotional, the action is good and shows the true terror of war."
    },
    {
      "rating": "10",
      "text": "One of the most compelling movies i have ever seen. I was hooked from the very beginning. It was a very revealing movie and I give my upmost respect to those who lost there lives."
    },
    {
      "rating": "3",
      "text": "this is something that is not that  cool Mark Whalberg was better in ted . i there is not enough gore and i do not like this it stunk  major . this sucks and it is not good enough to be one of  my favorite film"
    },
    {
      "rating": "8",
      "text": "This one surprised me.  I thought it was going to be another gung-ho jar head movie.  It feels like it at the beginning with the harsh troop training scenes.  However, it makes sense and has meaning this time.  Whalberg does a good job."
    },
    {
      "rating": "10",
      "text": "Definitely my favourite 2014 movie so far.This is a good emotional movie about four soldiers in big trouble.The action scenes are realistic and the characters(based on real soldiers)are really credible."
    },
    {
      "rating": "8",
      "text": "This movie is one of the more solid war films in recent memory. It obvious that we know what happens considering the title but there is still an element of shock factor to this. Its nice to see some movies based on the war in Iraq now that the conflict has calmed down a bit. Now we get to hear about all the heroes that emerged over the time of the conflict."
    },
    {
      "rating": "3",
      "text": "This movie was based on a true story, and it is extremely sad what happened to the SEAL team. But sadly, the movie was a complete snooze. It is two hours long and an hour and a half of it is pretty dull dialogue. The movie is action-packed for the last 30 or so minutes, but even that wasn't all that good. It was not shot well, and Mark Whalberg's cheesy southwestern accent was comical. Not worth seeing."
    },
    {
      "rating": "4",
      "text": "A film that, while having decent action scenes, is ultimately less than average. What brings this film down is not the gun battles or the ham-fisted patriotism, no no. It's the logic and the script: they are horrible to say the least. The dialogue isn't bad--in fact the characterization is great, with the leads and supporting cast all feeling like real people. The issue is, no thought went into making this script, or the logic, make any kind of sense. The scene that likely drew people to the theaters (where the operation to kill a Taliban leader is compromised by non-combatants) was poorly thought out.  Unless this is a case of actual human beings being this stupid (this is based on a true story after all), the writers have made a scenario where US Marines were unable to use their heads and MARCH the compromises up the hill with them to the extraction zone, and THEN cut them loose. instead, they argue about whether to shoot the civies, tie them up and leave them to die, or cut them loose right then and there.\r Now, you probably aren't a writer... or a soldier. But seriously,yhis shouldn't be too hard to problem solve...\r Another issue was the other US forces that were dropped in the immediate area; when the shooting between Wallberg's group and the Taliban started, where the hell where they? Did they not hear all the AK-47 fire and RPG's going off? Or did they decide to hightail it out of there when the **** hit the fan? The film also goes into ridiculous territory when it decides to exceed \"soldiers being injured and shot\" and goes into \"Watch us throw these idiots off a cliff. Twice. Oh, and they don't die. MARINES ****\r In the end, this film does not invoke a sense of empathy and pity for the US Marines who faced this situation; I'm gonna go on a limb and say that the actual Marines they based the characters off of were not this stupid. The Marines in this film are portrayed as one thing only: Idiots. They could have used their heads and extracted with no casualties, but instead allowed the \"compromise\" of their operation to bolt down the mountain and warn the Taliban that there were Marines up there. Thanks to the two idiots in charge (the ones who advocated letting them go), the two soldiers just following orders died as a result. One of the two aforementioned idiots was also gunned down, a Chinook helicopter a full of US soldiers (15-20 i think) was shot down by an RPG, and a whole village of innocent civilians was nearly wiped out when the Taliban came to kill the Last Idiot.\r That's what the film really should have been called: \"Last Idiot Standing.\" Had the morons in charge used their heads, the lives of 50+ people wouldn't have been screwed up or destroyed that day. Any inspirational message this film tries to convey is drowned out in the sea of stupid that is this script. Up to you if you wanna watch, but I say \"Avoid\"."
    },
    {
      "rating": "8",
      "text": "There is a little bit of testosterone overload in Lone Survivor, but that's true of most Hollywood war films.  The gun battle is brutally graphic and the men can't seem to speak without saying the \"F\" word, so don't go to this movie if you're squeamish or prudish.  I thought it was a well made film, but it wasn't anything new that I haven't seen in other war films, especially war films set in Vietnam such as Platoon.  It certainly isn't a film I would want to see again as I don't find all the graphic violence entertaining, but the film is certainly a reminder of what our military personnel are going through to keep this country safe."
    },
    {
      "rating": "7",
      "text": "Lone Survivor is a tight and intense true story of military action. The film makes you feel every shot and bump that these people took. It isn't war as excitement or escapism but something much nastier. Just like real life, I'd assume. The film could do without Whalberg's very wooden performance, however."
    },
    {
      "rating": "6",
      "text": "Sadly, the director has created a hagiographic film that gives little attention to the more interesting aspects of the story.  When will Americans stop ramming the bravery and American-ness of their armed forces, especially the special forces, down our throats?  It really lets the film down as it pushes everything else into the background.  Chalk this one up to another Peter Berg miss."
    },
    {
      "rating": "8",
      "text": "This is one of the rare times the movie is better than the book. The problem with the book is that it was ghost written and flooded with far too much political commentary. Further, the book attempts to draw conclusions on powerful events that happened far too recently. What the movie does is take those events and portray them without commentary or rhetoric. The audience is left to draw it own conclusions. Further, the movie does an excellent job of staying close to the original events. My only qualms are with the number of goat herders and the final battle which never took place. However, it's still and entertaining an compelling movie."
    },
    {
      "rating": "6",
      "text": "A Navy SEAL team assassination mission in Afghanistan goes wrong.  Those things are going to happen; it's all part and parcel of these types of tricky operations.  While America isn't known as a country that celebrates failure, it does however celebrate courage and valor and that is what the movie is mainly about along with trying to do the right thing under trying circumstances.\rFor what it is, the movie works, war is hell, people die."
    },
    {
      "rating": "7",
      "text": "This is well-filmed and fairly moving film with good visuals and music. Acton is solid."
    },
    {
      "rating": "7",
      "text": "Lone Survivor was a decent movie but it failed to deliver on a lot of the emotion from the book, aka the real life events. Forewarning, the rest of this review will contain SPOILERS. I'll go ahead and start with the positives. The acting was phenomenal and the main guys, Mark Wahlberg, Ben Foster, Emile Hirsch, and especially Taylor Kitsch, who I thought stole the movie, really deliver. They are able to establish an incredible rapport and level of camaraderie in a very short time so credit to them for them. The combat scenes, which make up essentially three-quarters of the film, were done excellently as well. Peter Berg really delivered here. The movie was gruesome, bloody, gory, and felt real because of those often subtle but occasionally dramatic sequences. Another thing I loved about the film was the sense that, more than just a movie, it was a dedication to those who lost their lives and have done so for our freedom throughout our history. The 5-minute intro with real-life footage from BUD/S training and hell week started in and then the photo/video montage of the heroes who died in the battle after the film completed it. Bravo again to Berg for that. Lastly, I loved that Marcus Luttrell had a role in the film itself. He is in several scenes and it was very unexpected when he first popped up in a scene.\r Now for some of the negatives. They changed so much stuff for the movie, it almost felt like a different battle. Now don't get me wrong, obviously there are things that must be left out when making a movie from a book due to time constraints. However, leaving something out and changing it are two totally different things. One of the changes that bugged me most was them showing Luttrell see the CH-47 Chinook crash. In reality, he didn't find out about that until later on when he was in the village. Another thing that irritated me was how they showed the Taliban invade and shoot up the village that was keeping Luttrell. This was actually the biggest change in the movie because they change the entire meaning and importance of villages like these. In reality, the Taliban attacks the village with threats but never actually raises a gun at it because they know, if they demolish an entire village for not complying with their ways, they will destroy their supply line in the Hindu Kush mountains. This is broken down in detail in the book and is you supplement that with more research you will quickly see that the Taliban would not massacre an entire village that didn't engage them first just because said village is obeying their Pashtunwali culture over the Taliban. If they did that, their supply line would fall apart and this reality was completely lost in the movie. There were several other changes that were minor but there was one last one that I felt is worth mentioning and that is Mike Murphy's death. When reading the book, the most emotional element was the tragic and tormenting way that Murph dies and the movie fails to portray that. Now I will say this, Marcus Luttrell was very involved in the movie and acknowledged that there were changes made because the studio wanted to dramatize things more. I'm sorry but the story is pretty damn dramatic on its own and doesn't need more action or drama.\r Regardless, this movie was a decent, not great, film and is a salute to the men who have lost their lives fighting for America. While it could've been better, it was still worthwhile experience and I am curious to know if I would've enjoyed it more if I hadn't already read the book first."
    }
  ]
}