{"id": 3130, "title": "Look Away", "starring": ["India Eisley", "Jason Isaacs"], "runtime": 103, "genre": ["Horror", "Thriller", "Fantasy"], "description": "A timid and socially alienated 17-year-old high school student's life is turned upside down when she switches places with her sinister mirror image.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/8WTEFOwFBx0mHurnEfv27I0FOe2.jpg", "categories": {"plot": 5.75, "acting": 7.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "This movie is good. The highlight for me was the editing that is quite clever sometimes. The performances may sound amateurish. The movie itself has a well-developed idea"}, {"rating": "9", "text": "Dont listen to SJW oppinions - sex scenes didnt last for 20 minutes neither did naked scenes. The movie is clever in presenting transformation from good, naive child into typical (well, minus killing thing) cold adult. Main character was awesome and was supported by good performances from others."}, {"rating": "3", "text": "/    /"}, {"rating": "3", "text": "What could have been a more attractive suspense and mystery story receives the most basic and simplistic treatment of the horror genre.Beyond the disappointment, what bothers me the most is the lack of effort."}, {"rating": "7", "text": "No es tan mala pero tampoco es buenísima la historia en general esta bien , los efectos están bastante logrados pero creo que hay momentos en los que aburre un poco y muestra partes que realmente no son importantes creo que si se hace una secuela y se toman en cuenta estos aspectos a mejorar se pude hacer una bastante buena película de suspenso en conclusión si estas aburrido y quieres ver algo diferente es bastante recomendable pero si quieres ver una película muy fuerte en guion y que no te aburra en ningún momento y te mantenga en rollo, puede que hayan mejores opciones en general como digo no es mala pero tampoco buenísima. un saludo"}, {"rating": "6", "text": "Look Away is an accomplishment in a directorial way. This is really very well directed and the cinematography is exemplary. The lead role is absolutely amazing and the rest of the cast feet perfectly to the film. The original score is really superb and have a real emotional impact on the scenes. The dark point of Look Away cames from the story, unfortunately the plot isn't as great as the technical aspect. Looks like a kind of strange variation on Stephen King's The Dark Half with a more schizophrenic part. If you're looking for a great screenplay you'll probably be disappointed but if you're looking for a well directed film it really deserves it."}, {"rating": "8", "text": "Meek girl had a dead twin sister hiding in her mirror who starts talking to her and then takes her place to do the things that she can't do - like killing."}, {"rating": "5", "text": "I can't say this was bad for these kind of films but it can be better if just film was a few longer to describe the main character and her dark \"avatar\". And it would be more interesting if not this photo at the beginning that shows that she've got a sister (it's her sister in the mirror not her dark side). Last scene in the film, it's what I exactly will remember."}, {"rating": "0", "text": "This might be the worst movie I have ever seen.I'm writing this as the movie is playing- and that tells you everything you need to know about this movie."}], "recommendations": ["snow_white_and_the_huntsman", "the_paperboy", "the_others", "oz_the_great_and_powerful", "terminal", "hanna", "maleficent", "alice_through_the_looking_glass", "pan", "taking_lives", "let_me_in", "the_conjuring_the_devil_made_me_do_it", "antlers", "the_fly", "sin_city_a_dame_to_kill_for", "the_devil_all_the_time", "elektra", "i_am_legend", "till_death", "maleficent_mistress_of_evil", "a_walk_among_the_tombstones", "backdraft", "10_cloverfield_lane", "the_karate_kid_part_iii", "blood_ties"]}