{"id": 4587, "title": "Looney Tunes: Back in Action", "starring": ["Brendan Fraser", "Jenna Elfman"], "runtime": 93, "genre": ["Animation", "Comedy", "Family"], "description": "Fed up with all the attention going to Bugs Bunny, Daffy Duck quits Hollywood, teams up with recently-fired stuntman Damien Drake Jr. and embarks on a round-the-world adventure, along with Bugs and The VP of Warner Bros. Their mission? Find Damien's father, and the missing blue diamond... and stay one step ahead of The Acme Corp., who wants the diamond for their own purposes.", "releaseYear": "2003", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/q0kntpdsHA0QdYjpQdNBqrVTdQq.jpg", "categories": {"plot": 6.181818181818182, "acting": 6.375, "ending": 2.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.777777777777778, "action": 7.5}, "reviews": [{"rating": "3", "text": "Sadly, \"Looney Tunes: Back in Action\" is one terribly written movie with incoherent characters and disgusting CGI. The critics were way off the scale for this one..."}, {"rating": "3", "text": "Yes, the movie may have had the Looney Tunes charm I remember watching as a kid, but I can't help but feel that the movie was trying to destroy the much better movie Space Jam's legacy. And while I don't really have anything against fart jokes in movies, did you really have to make Taz fart? Thanks for ruining my childhood idiots."}, {"rating": "4", "text": "This is one of the reasons of the Looney Tunes' decline. I like the animation, but I feel that the dialogue is very poor. Also, what's up with the Wal-Mart scene? That's just crazy."}, {"rating": "5", "text": "Yes, the Looney Tunes are back in action, but the story is a mess and it gets tiring after a while. The mix between real life and Looney Tunes doesn't work well here."}, {"rating": "9", "text": "This movie is pretty hilarious, if you enjoy cheesy comedies, or just love the Looney Tunes characters, this is a movie you should look into, you wont regret it."}, {"rating": "6", "text": "Looney Tunes: Back in Action, isn't one of those movies that you can watch over and over but it will provide some great entertainment and cheesy laughs.The first 20 minutes or so will poke fun of stuff from Warner Brothers from the past ten years ( well when it was released in 2003, it'll be 19 years in todays standards). Brendan Fraser is a likeable hero. as well as Steve Martin as a villian. I found however the females performances with the exception of Joan Cusack ( She can't do anything wrong) were awful and wooden. Some of the jokes could of been better but they also could of been worse. Overall it's just some dumb, well-animated fun. Perfect for a rainy sunday afternoon or something to shut the kids up."}, {"rating": "6", "text": "It is acceptable, only that I can say. is better than the last? I would say yes, Joe Dante brings the freshest looney tones, with more charisma and more action."}, {"rating": "6", "text": "Movie very well done and entertaining."}, {"rating": "7", "text": "It is witty. It flashes into the wit of the old cartoons, quite often in fact. But, not as good as them. But then again, not many cartoons are these days."}, {"rating": "8", "text": "It's flawed, but unlike Space Jam, which completely desecrated the integrity of Looney Tunes for the sake of crass commercialism, it actually focuses on the titular characters and why they are funny in the first place. The humans are pretty boring and annoying for the most part (save for Joan Cusack's cameo), but Dante's trademark pop culture references and obvious love for the institution of Looney Tunes keep it well above water, with some truly inspired moments. Its bombing is testament to the idiocy of the moviegoing public in general."}, {"rating": "5", "text": "So is this cannon with 'Space Jam'? Because this is a forgettable messy classic."}, {"rating": "6", "text": "While 'Who Framed Roger Rabbit' (1988) combined the endless parade of favorite cartoon characters to cross paths with the live action actors, it would be easy to understand that it may have influenced 'Space Jam' (1996), a movie that combined the favorite Looney Tunes characters with a basketball star like Michael Jordan. Here, we now have 'Looney Tunes: Back in Action' another animated/live-action Looney Tunes crossover that I enjoyed about as equally as 'Space Jam' (1996). However, the one thing I can say is that this movie does get one thing right, and that is the spirit of the Looney Tunes. The characters act the way they would and should when they're in a story like this one. The movie opens with a classic Looney Tunes sketch that involves Elmer Fudd hunting for rabbits, with Daffy Duck arguing with Bugs Bunny over what season it is. \"Rabbit Season!\", \"Duck Season!\" they shout to each other constantly. But, things stop when Daffy gets tired of the repetitive shooting of himself, he feels that these jokes are made redundant and that the producers of these shows should try some new material, maybe where Daffy doesn't become the target of humiliation anymore. However, the vice president of comedy, Kate Houghton (Jenna Elfman) decides to remove Daffy from the show after making these requests. We are then introduced to a training stunt-man/cop named D.J. Drake (Brendan Fraser), who is struggling to make it big in the show-business, despite his father, Damian Drake (Timothy Dalton) being a star. The world seems to be in threat when D.J. later receives a call from his father who tells him to go to Vegas to ask about some mysterious object called \"The Blue Monkey Diamond\" which, apparently has the power to transform human beings into monkeys, and it grabs the attention of the movie's main villain, the ACME chairman (a charismatic Steve Martin) who wants to use the diamond as a way to hypnotize the population to buy his products. The plot sounds ridiculous, but at the same time, it keeps within the spirit of the Looney Tunes characters. The movie goes a little over the top towards the end, as it starts out like any other family adventure movie, but like I said, it gets a little overboard as the characters become something more than how they were first shown. There are some very funny moments added here, and the cast do a good job to stay within the animated spirit. Director Joe Dante also does a capable job of handling so many of these beloved characters, but maybe, if they were to do a movie like this again, make a coherent, and calm plot rather than trying to go too over the top."}, {"rating": "6", "text": "It's lovely as Space Jam and it'll make you laugh if 'Looney Tunes' are your main thing. It's as close to the positives as you wanted it to be at. It's not a bad movie at all."}, {"rating": "8", "text": "Amazing script, animation and more, but...... some things dont are ''cool'' or ''good''The Good Things Of The Movie:AnimationColorScriptThe Bad Things Of The MovieI Dont Know How I Say ThisIn The Conclusion The Score Is 8"}, {"rating": "2", "text": "The film no one wanted or asked for its a mess from beginning to end some ok parts."}, {"rating": "9", "text": "An extremely entertaining and funny live action that you will fall in love with when you see it!"}, {"rating": "10", "text": "This is my favorite movie. It's not the best movie of all time, but it's my best movie. Every single joke gets a laugh out of me every single time and all the characters are great. Brendan Fraser is amazing, as always."}], "recommendations": ["penguins_of_madagascar", "space_jam", "scoob", "madagascar", "hotel_transylvania_3_summer_vacation", "ice_age_the_meltdown", "spies_in_disguise", "flushed_away", "scooby_doo", "the_angry_birds_movie", "despicable_me_3", "the_angry_birds_movie_2", "rio_2", "robots", "igor", "hotel_transylvania_2", "the_secret_life_of_pets_2", "the_lego_movie_2_the_second_part", "despicable_me", "madagascar_escape_2_africa", "despicable_me_2", "austin_powers_the_spy_who_shagged_me", "minions", "hotel_transylvania", "the_secret_life_of_pets"]}