{
  "id": 2094,
  "title": "Lord of War",
  "starring": [
    "Nicolas Cage",
    "Bridget Moynahan"
  ],
  "runtime": 122,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Yuri Orlov is a globetrotting arms dealer and, through some of the deadliest war zones, he struggles to stay one step ahead of a relentless Interpol agent, his business rivals and even some of his customers who include many of the world's most notorious dictators. Finally, he must also face his own conscience.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3MGQD4yXokufNlW1AyRXdiy7ytP.jpg",
  "categories": {
    "plot": 5.2727272727272725,
    "acting": 6.25,
    "ending": 2.6666666666666665,
    "soundtrack": 10.0,
    "cinematography": 5.666666666666667,
    "familyFriendly": 3.0,
    "funny": 5.25,
    "action": 6.4
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Arguably one of Cage's best roles, and Hawke does pretty darn good to! This film begins with one of the most entertaining openings I've ever seen. The characters mean something to you backed by an ironclad story and top rate performances. We are given another perspective of war.....the business side, and the result is shockingly entertaining!"
    },
    {
      "rating": "8",
      "text": "All at once a character study, family drama, black comedy, and surprisingly accurate look at the world of a gunrunner, Lord of War is easily one of the lowkey better films of 2005. Nicolas Cage is fantastic, and his supporting cast comprising of Ethan Hawke, Jared Leto, and Bridget Moynahan are more than capable in their respective roles. The script is dark and biting, but never shies away from its anti-war message. The strength of this film is it's focus on the black market, rather than on war itself being evil. This is a movie I definitely recommend."
    },
    {
      "rating": "10",
      "text": "The best movie I've seen in years....see it now!"
    },
    {
      "rating": "9",
      "text": "I really liked it. Amazing intro. Interesting but predictable story but still cool to see.I learned a lot from this movie"
    },
    {
      "rating": "7",
      "text": "Un Nicolas Cage en pleine forme dans le rôle du trafiquant d'armes cynique et blasé... et très sympathique ma foi puisqu'il n'est présenté que comme un VRP, un VRP comme tant d'autres (!)... qui font leurs petites \"affaires\". Et comme Ponce Pilate, il s'en lave les mains, lui et les autres.Tout le film fait preuve du même genre de cynisme emballé dans une ironie de tous les instants (ou presque), un choix qui le rapproche sensiblement d'une comédie mordante et un choix fort judicieux à mon avis puisqu'il fait réfléchir le spectateur tout en le faisant ricaner et plus si affinités.C'est d'ailleurs très souvent la bonne méthode que de manier l'ironie cinglante et la satire pour dénoncer les absurdités du monde, cela évite en effet un misérabilisme malvenu.Lord of War est donc bien réalisé et mène sa braque exactement là où il veut en venir malgré hélas quelques faux pas. Le personnage du frérot est détestable de maladresse et fait pièce rapportée ; quant au rôle de sa femme, il s'avère assez mal développé et reste peu crédible. Enfin, toute la partie de cache-cache avec l'idéaliste d'Interpol est des plus téléphonées.Néanmoins, le film demeure assurément efficace et drôle en plus de réussir son pari : il dénonce sans être lourd, il dénonce avec intelligence. C'est rare de nos jours."
    },
    {
      "rating": "7",
      "text": "This film, allegedly based (very lightly) on actual events, tells the story of a Russian-American gun dealer and confronts the immorality of the war and arm business. It would even be depressing if it weren't ironic. Irony is the key to perceive the taunts of a film that takes for granted the inevitability of violence: just like food, death is a human need and man will always feel the urge to kill his fellow man. This provocation is the starting point for a trip to the world of arms trafficking, through the eyes of a trafficker who has surely killed more people than a nuclear bomb and who seems to live in a parallel reality. For him, the death of a child-soldier is sad, but its worse if its with arms purchased from the competition. All this shows us that this is a sarcastic movie, but with little drama and no characters that we can enjoy.As far as actors are concerned, the film is based on a good performance by Nicholas Cage, perhaps one of his best film performances to date. He is not one of the actors that I particularly like, so I was surprised to have liked his work here. The rest of the cast merely seeks to support him with poorly structured and developed characters. Jared Leto was a casting error."
    },
    {
      "rating": "9",
      "text": "This movie flew under the radar when it came. Few talked about it, because they were certain that it was another straight-to-DVD from Cage. They were so wrong.After a suberb opening, you are thrown into a day in the life of a cook-turned-gunrunner to give you an insight how the global gun trade works. Well probably not completely after the book but it does an outstanding job depicting the bloody tragedy of it. Especially the scene where he sits to the table in the african savannah dealing guns to the rebels, where he knows the villagers just a stonesthrow away will die with his bullets. Straight-A powerful projectory of the brutality of it.Fantastic characters, Cage has never done it better since this, Jared Leto plays his coked up brother great as well, and Ethan Hawke is the guy chasing Cage´s tail, also great.How can you rate this movie down? Those who read the title of the movie and expect Michael Bay trash, you are so in it for the wrong ride. This movie is about what takes place behind the action, behind the war, bloodshed and genocide in this world."
    },
    {
      "rating": "10",
      "text": "Kono, the name to which the ship is changed, is a diamond-rich area of Sierra Leone named for a tribe that lives there."
    },
    {
      "rating": "10",
      "text": "Lord of War is a strong, potent film that (besides adding accurate commentary on gun trading), has many alternative themes about life. It reminds us that sometimes, having everything you want is a bad thing, and that being at war with yourself is far worse than any global conflict. It is well-acted, well-scripted, and never boring. It is a rare 21st century Nick Cage movie that is actually good."
    },
    {
      "rating": "7",
      "text": "A movie with a very important, highly relevant message that needs to be told, and for sure it was told in a very engaging and entertaining way. What brought it down from the platform of greatness is that unfortunately it gets way too bogged down on the pressures to make it \"sellable\" - too much of the runtime was unnecessary superficial nonsense that stuck out as a sore thumb as it was clearly meant to attract simpler-minded dolts. So quite the shame at the end, but overall still a film that's well worth a watch."
    },
    {
      "rating": "7",
      "text": "Although its pacing can be a bit wonky, \"Lord Of War\" still features a very cleverly penned screenplay and an unquestionably magnetic performance from Nicolas Cage."
    },
    {
      "rating": "8",
      "text": "I liked the opening of the movie, they used a very good soundtrack. Interesting movie, gives you an idea how illegal arms dealing goes. To sum up, good cast, storyline, characters. Especially I liked the characters. Worth watching."
    },
    {
      "rating": "2",
      "text": "The fact that this film is entertaining purely to watch the protagonist's wife marginally saves it from the decrepit and unsubtle dialogue, uninspiring plot and the infuriating arrogance of Nicholas Cage's disastrous performance. It is also worth your time to laugh at his ridiculous chat up lines and his attempt to portray an eighteen year old near the beginning which is bad beyond belief due to his middle aged looks."
    },
    {
      "rating": "3",
      "text": "Left the movie after 20 minutes. Cage must like stretching the envelope but here he folded it in on himself. Terrible movie. But a great expose of the Americans love of weapons."
    },
    {
      "rating": "0",
      "text": "This is the #1 worst movie I have ever seen. Pathetic waste of time. Terrible story from beginning to end. This movie should never have been made. It doesn't have a single redeeming quality."
    },
    {
      "rating": "3",
      "text": "No conclusion. To preachy. Got boring half way through."
    },
    {
      "rating": "3",
      "text": "Laziness is splattered over this boring production. Like the script writer in Adaptation says: good scripts do not have narration. This film has plenty of them, bogging the ending down much like how War of the Worlds did. Not worth your time or your intelligence."
    },
    {
      "rating": "1",
      "text": "Finally I've seen LORD OF WAR. I wanted to see it since it was released in France back in May. What a piece of trash! It lacks any dramatic credibility, its plot is incoherent (if there is one), its characters are one-dimensional, and its dialogs are tacky and stale. Syriana next to it is a major masterpiece! I don't know if I should do a review, since the film is so bad, it is beyond any serious attempt at reviewing. Just to say that the devil, as we know, is in details, and the details are not at all Niccol's strong point. [***SPOILERS***] There is no such a thing as Interpol agents (contrary to the popular myth perpetuated by Hollywood and Ethan Hawke) - Interpol is an information clearing house located in Lyon, France, staffed with international bureaucrats and directed by a former NYU law professor. Its employees have no legal powers to arrest anyone! Soviet (Ukrainian) Jews on Brighton Beach couldn't care less about Ukraine - the cradle of East European anti-Semitism (as Yuri Orlov's younger drug addict brother who nostalgically makes the map of Ukraine with the cocaine lines - tackier than that would only be the map of the US made with the lines of heroin by the film maker Niccol himself). Finally Orlov is not a Jewish name, contrary to what the main protagonist states in the beginning of the film. It is as Russian as Stoly vodka and Gorbachev's perestroika! In fact, Yuri Orlov is the name of a Soviet dissident, founder of the Moscow Helsinki group in the 1970s. Gun running may be a mortal sin, but spreading ignorance by making big-budget pretentious B-movies with Nikolas Cage is almost as bad. If anything, Cage deserves better than that! Post A Comment!"
    },
    {
      "rating": "2",
      "text": "This film made me laugh only once and that was still too much for a film based on such a serious subject. it seemed at times to be trying to make cage into a likeable character even though his actions are as morally wrong as is possible, this is an even worse flaw in the film when you consider its based on real events. on top of this the action is poor and i can't see how any one could find it enjoyable."
    },
    {
      "rating": "3",
      "text": "The screenplay is weak and full of \"newbie\" cliches: it's extremely expository and hampered by wall-to-wall voiceover in a desperate attempt to make sense. The characters show no dimension -- they simply walk through plot. The writer didn't even do basic research, e.g. Interpol cannot wiretap in the US nor does it report to the US president. Great cinematography saves this from a zero rating."
    },
    {
      "rating": "3",
      "text": "The introduction was pretty good - following the bullet - cool graphics.... Then, it sucked. I lost interest in the movie half way through it. It didn't have the WOW factor."
    },
    {
      "rating": "2",
      "text": "Super lame and boring."
    },
    {
      "rating": "0",
      "text": "Terribly lame and boring. No twists... you know exactly how this movie is going to end from the start. To quote Homer Simpson, \"Booorrrring.\""
    },
    {
      "rating": "0",
      "text": "A two-hour anti-gun commercial."
    },
    {
      "rating": "2",
      "text": "This was like watching a slide show with Nicolas Cage narrating. If you're looking for an action movie, don't pick this one. If you're looking for a convoluted statement about worldwide arms suppliers, then this movie is for you. Did I mention that Nicolas Cage narrates?"
    },
    {
      "rating": "3",
      "text": "The opening was so compelling and masterful then the movie just fell on its face. It did not hold my interest as I was waiting for the opening scene to continue. should have stuck to the point (gun running.)"
    },
    {
      "rating": "6",
      "text": "Thank You for Smoking meets Blood Diamonds.  A daunting narrative task.  Too long.  Very mixed reviews by both pros and users tells me 1-2 scenes should have been deleted.  It lacks too much humanity in its parody-meets-inconvenient-truths to be a long movie.  Acting is very good.  Cage, Monihan, Leto are at their best.  The real stand-out performances for me are the father son duo of Liberia. Good production values.  My guess is this project had too little adult supervision at the script stage.  Selling a hard look at a forbidden, ugly social, political cultural truth would need a stronger story sense to create a commercial hit."
    },
    {
      "rating": "5",
      "text": "\"Lord of War,\" a misfire of a political satire about the international gun market, opens with a killer scene: Nicolas Cage standing on a veritable carpet of bullet casings. Mr. Cage's character, Yuri Orlov, is a gunrunner who has placed untold weapons in untold numbers of hands. Now, surrounded by gutted buildings and dressed to impress, a cigarette burning between his fingers, Yuri looks straight into the camera and wonders aloud how he can furnish everyone in the world with a gun to call his very own.\r This carpet of casings also serves as a launching pad for a subsequent and even more outlandish opening credit sequence that tracks a bullet from its manufacture in Russia to its final resting place in the skull of a young African. A bullet in the head always seizes the imagination or at least the audience's attention, but because the African is merely cinematic collateral damage, the image registers both as showboating and as a warning shot for the problems to come. The screenwriter for \"Lord of War,\" Andrew Niccol, lavishes a great deal of time and many words building a case against guns; unfortunately, the film's director, who also happens to be Mr. Niccol, enjoys playing with toy guns. His words may say no, but his overworked, overslick visual style says lock and load, baby.\r The problem, of course, is that violence is so inherently cinematic, so visually and aurally captivating. Loud pops, big bangs and the sights and sounds of bodies seizing up and spurting blood have long been the stock in trade of certain movies, which partly explains why the bangs are getting ever louder, the bloodletting more spectacular. The noise in these films has grown so deafening that it can be hard to hear the message (if there even is one), especially when that message carries a familiar, been-there, done-that, eat-your-oatmeal-because-it's-good-for-you moralism. Like: guns are bad, corporations are soulless, and some first world governments traffic in third world misery. To which any reasonably informed viewer might be expected to wonder, And your point is what, exactly?\r Mr. Niccol's point here, it appears, is both to entertain and to instruct with the story of Yuri, a Russian émigré who rises from humble Brooklyn to become a globe-trotting gunrunner with all the moral reasoning of a flea. Guided by Mr. Cage's intermittent voice-over, the story tracks Yuri's decades-long evolution as a merchant of death saddled with a few familiar distractions: a beautiful model wife played by Bridget Moynahan and a drug-addled brother played by Jared Leto.\r Yuri gets his break in the early 1990's when he snaps up materiel in the recently imploded Ukraine that he subsequently offloads in war-ravaged Africa. Like everything else in this film, Mr. Cage's performance is watchable if never credible because his director never resolves the disconnect between this star's function (to entertain) and that of his character (to repel)."
    },
    {
      "rating": "4",
      "text": "Great movie. Good story line imo and Cage just nails the role.  Shows a unique perspective into arms dealing."
    },
    {
      "rating": "7",
      "text": "Good movie, not exceptional but offers good insight and an interesting perspective I think, you'll have a good time."
    },
    {
      "rating": "9",
      "text": "I am truly bewildered by a couple of the extremely negative user comments here. I can only think that Susan M., who says this is the worst movie she has ever seen, is an ardent gun enthusiast and was offended by the movie's overall anti gun message. But to say that this movie \"doesn't have a single redeeming quality\"? It's an absurd, puerile statement that has nothing to do with this movie. Same goes for Dusty L., who says this is \"a slide show\" and to look elsewhere for action. Again, I have to wonder if he saw a different movie. Actually, if you like action, you'll be glad to know Lord of War has some terrific (admittedly usually brief) action, including an extraordinary sequence involving a plane making an emergency landing on a highway crowded with people, a truly jawdropping and thrilling scene. Other \"redeeming qualities\" this movie has: biting wit -- it's very funny; terrific editing; wonderful widescreen lensing with fantastic color and production design; strong performances from Cage, Leto, Holm, and many others; and great music. I saw it last night, and only wish I had seen it earlier so I could have told more people earlier to go and see it."
    },
    {
      "rating": "8",
      "text": "Stylish and fascinating. It deserved better during its theatrical run."
    },
    {
      "rating": "9",
      "text": "If you don't like weapons - guns, for those who don't know - I wouldn't recommend this. All that took was watching a preview or generally knowing what it is you are watching. If you do like weapons, war, and Nick Cage - basically if you are a guy - then this movie will do it for you. Great stuff, I loved it."
    },
    {
      "rating": "8",
      "text": "You have to be kidding me. this barely makes it through the green light. The movie is so fantastic, Cage is so cool that i bet some arms dealer is gonna shut this website down for good. And critics wake up, this movie is a slap in the face of pansy-journalistic morality which, as the movie tells, is a force without power."
    },
    {
      "rating": "9",
      "text": "Niccol dares to deal with how the international traffic in weapons affects us without most people even being aware of it. And he does it with savvy. I have not yet read a review that mentions the key distinction Lord of War makes between Yuri Orlov and Simeon Weisz, the two primary arms dealers shown here. Weisz (Ian Holm), who works with the CIA, says his aim is to change governments; he deals for a political purpose. Orlov (Nicolas Cage) does it because \"I'm good at it\" and he goes where the money is, not caring who gets the weapons. He also sells for the U.S. Government but, in addition, he makes his own deals, willy-nilly. Weisz believes his motivation is superior to Orlov's. Orlov challenges Weisz, reminding him that he (for the CIA) sold weapons to both Iran and Iraq (to use against each other). Weisz fires back that he wanted both of them to lose. There is no moral difference between these two men but their remarks about their own motivations provoke thoughts that ricochet against what we see happening in the world today. It's a thrilling insight and there are many like it in this shockingly (because it's in the multiplexes) profound view. Unfortunately many people will probably not understand exactly what they are seeing, and Lord of War may not get the recognition that it deserves. Jane Franklin."
    },
    {
      "rating": "9",
      "text": "Timely and much needed portrayal of the world today. Cage and Leto's characters are well-drawn and captivatingly acted."
    },
    {
      "rating": "4",
      "text": "Script was lazy and slip-shot, and this was not one of Cage's better performances. Maybe because he was too busy doing voice- over narration, (which this movie relies way too much on). Lastly, I got no sense that this movie really knows what it's talking about, or that film-makers made much of an effort researching this project. You won't actually learn anything about how the gun-traffic industry works."
    },
    {
      "rating": "8",
      "text": "This is possibly Nicolas Cage's best performance. The movie is disturbing but ironically funny and very informative. I liked it and hope you will too."
    },
    {
      "rating": "9",
      "text": "An entertaining, witty, and disturbing take one of the most morally reprehensible professions a person can have. In many ways, it's better to tackle issues like gambling, drugs, gun running, and cigarettes from the perspective of the people who make the sale of these vices their chosen career. I would've much preferred a version of \"The Constant Gardener\" told from the POV of the drug company scientist who arranges to do trials in impoverished regions of Africa."
    },
    {
      "rating": "8",
      "text": "Absolutely terrific. For light entertainment, this one is actually incredibly powerful. It gets under your skin and makes you think. All the acting is really impressive, and the whole thing is just so bloody entertaining that it's impossible to dislike, unless you're looking for a bad movie."
    },
    {
      "rating": "9",
      "text": "I enjoyed the movie from the beginning. I would say it's the best movie I've seen in a long time!"
    },
    {
      "rating": "4",
      "text": "Like 'Blow' with guns instead of drugs, and less interesting content. I think Nicolas Cage is a great actor, but I don't think he quite fit this character. Ethan Hawke was wasted in his role."
    },
    {
      "rating": "10",
      "text": "This a film very well written, the dialogues are very smart.It's a clever action film.Cage is wonderfull."
    },
    {
      "rating": "10",
      "text": "Terrific."
    },
    {
      "rating": "7",
      "text": "Like all of this director's films, all the parts are there, all the key scenes, all the cleverness and the drama, the emotion, the poignancy, etc -- but somehow it doesn't add up to being great. Something's always missing from his movies. I have no idea what. At the same time, they're smarter than most movies, and they're still pretty good. And Lord of War is not an exception."
    },
    {
      "rating": "8",
      "text": "Excellent!! Movie makes the viewer physically react. Also makes them think."
    },
    {
      "rating": "10",
      "text": "Brilliant."
    },
    {
      "rating": "8",
      "text": "Puts a human face on some of the worst acts against humanity in recent memory. Cage is fine in his dry deliverance. How else would an international arms dealer act. They know what they are contributing to."
    },
    {
      "rating": "10",
      "text": "Superb film with a lot to say. Cage is brilliant. Direction and music are fabulous. RENT IT!"
    },
    {
      "rating": "7",
      "text": "i was expecting a movie that wasnt gonna be very good based on the boxoffice, but actually it was alright, Cage pulled off his role great and it had some good one liners, ill probably see it again."
    }
  ],
  "recommendations": [
    "12_strong",
    "greyhound",
    "red_tails",
    "valkyrie",
    "jarhead",
    "elysium",
    "equilibrium",
    "green_zone",
    "13_hours_the_secret_soldiers_of_benghazi",
    "the_kingdom",
    "zero_dark_thirty",
    "the_hurt_locker",
    "savages",
    "sicario_day_of_the_soldado",
    "armageddon",
    "apocalypto",
    "guns_akimbo",
    "midway",
    "wonder_woman",
    "pearl_harbor",
    "the_1517_to_paris",
    "london_has_fallen",
    "lone_survivor",
    "eastern_promises",
    "deepwater_horizon"
  ]
}