{"id": 4380, "title": "Lost Highway", "starring": ["Bill Pullman", "Patricia Arquette"], "runtime": 134, "genre": ["Drama", "Thriller", "Mystery"], "description": "A tormented jazz musician finds himself lost in an enigmatic story involving murder, surveillance, gangsters, doppelgängers, and an impossible transformation inside a prison cell.", "releaseYear": "1997", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5POhfNeFPIi4VUNwCTaK85sh98r.jpg", "categories": {"plot": 8.5, "acting": 8.714285714285714, "ending": 8.666666666666666, "soundtrack": 7.8, "cinematography": 8.2, "familyFriendly": 3.0, "funny": 8.666666666666666, "action": 8.4}, "reviews": [{"rating": "10", "text": "52? Seriously? This movie is absolutely brilliant. If you're someone who enjoys being fed meaning then it's simply not for you. Those prepared to feel their own way and drop the barriers between dream and \"reality\" will find an intangible joy in unusual and familiar dark places. When I first watched Mulholland Drive I felt cheated, disturbed and confused. I've since learned to give in to the confusion and explore all the gaps between my stupid expectations. I find it rather offensive that Mulholland Drive has such a high rating in comparison to Lost Highway and can only assume that it's due to the nudity and lesbian scenes. I really hope that isn't true. David Lynch uses sex as a vehicle for something far more erotic and devastatingly honest. His movies leave me twisting for truth and dreaming within dreams that turn on themselves and walk their way \"back\" into life. I will always have a sincere love and respect for the artist that showed me what I want by failing to deliver what I learned to need. Thank you for denying me this and granting me so much more."}, {"rating": "10", "text": "I've been hankering to see this one again. I think it might be better even, overall, than Blue Velvet, though the latter is undeniably more straightforward. I guess I understand why the \"dream\" comparisons seem to be frequently invoked when talking about Lynch and \"Lost Highway,\" but if you know anything about Lynch's methods he doesn't particularly lean toward dreams or dream imagery. Rather, as I understand it, he just gets these ideas in his mind and he doesn't censor himself, so the starting material is different because he's never coming from the too typical place of just trying to come up with a movie premise that people might like. And then, when he starts putting his ideas together, he doesn't allow conventions and commercial concerns lead him astray, he stays true to his vision and he is one of the few who can get away with that.\r This film was the first to deal with the idea of a transmigration of identity, something Lynch may or may not have picked up from a 19th Century craze, I don't know. He continued working with this idea in Mulholland Drive and Inland Empire, though to me those two were less successful than Lost Highway, which is why I'm writing this. I hope more people can find out about Lost Highway and enjoy it as much as I have.\r So, to appreciate this film I recommend not getting too caught up in understanding it. It's a harsh critique of Hollywood, for one thing. The humor is about as deadpan as you can get. The violence is not pervasive but is at times strong. I don't find it gratuitous at all, though. Many people get their attentions taken with the sense of dread that is certainly there, but I now see more of the humor and style. Lynch is, above all, the most stylish of all contemporary American directors, I think without even a close rival. Also, he may be the sexiest. His sex scenes just sizzle and pop, think about the seduction scene in Blue Velvet or the lovemaking sessions between Cage and Dern in Wild at Heart. This film is no exception, Patricia Arquette smolders and her love connection with the young hero feels real and alive.\r The word \"pretentious\" some have used here puzzles me. Lynch may be Hollywood's least pretentious director! He's very true to his own vision and doesn't try to intellectualize. I don't get that criticism. Also, too much emphasis on \"understanding\" it. Look, it's kind of simple: there is a sort of identity migration. It's a mystical concept, no scientific basis for it, so you kind of have to go with it. It deals with evil in a way that may seem needlessly oblique to some but in return for a little patience and open-mindedness you get to see Robert Blake, in white pancake makeup, being Satan incarnate! I think that is worth the price of admission alone."}, {"rating": "7", "text": "One of the hallmarks of a David Lynch film is the element of surprise -- the sense of not knowing what will happen next and the queasy dread that what you're about to see could disturb and haunt you and linger in your head for a long time.\r Lynch established that agenda in \"Eraserhead,\" his first feature- length film, and he hasn't abandoned it to a futile quest for mainstream acceptance.\r It's impossible to imagine Lynch making a conventional film with \"normal\" people and \"normal\" entertainment values -- a fact that binds his fans to him but alienates many critics and moviegoers.\rIn \"Lost Highway,\" which opens today at Bay Area theaters, Lynch continues his exploration of the unknown and delivers a dreamlike meditation on reality, identity and paranoia. Set in a bland city that resembles Los Angeles, \"Lost Highway\" stars Bill Pullman, fresh from play ing the enthusiastic president in \"Independence Day,\" as Fred Madison, a spooked saxophonist who finds himself terrorized by a man who enters his house when he's asleep and videotapes him and his girlfriend Renee (Patricia Arquette) as they sleep.\r At a party, he meets a smirking trickster, played in ghostly white makeup by Robert Blake, who declares himself the culprit. Blake invites Pullman to dial his own phone number and to listen as Blake, who's standing before him, \"answers\" at the other end of the line.\r That's just a taste of what Lynch and co-writer Barry Gifford, whose novel \"Wild at Heart\" inspired Lynch's 1990 film of the same name, have to offer.\r There's also a murder; a fire; a personality transformation involving an auto mechanic (Balthazar Getty); a gangster's moll, also played by Arquette, who cons Getty into committing a crime; a memory lapse by Getty; a reappearance by Pullman; and a series of bizarre foreshadowings and precognitive images that may or may not pro vide clues to the mystery of \"Lost Highway.\"\r The result is a world, part film noir, part apocalyptic acid nightmare and pure Lynch, in which nothing can be trusted or relied upon -- least of all our psychic well-being.\r It's a weird movie, in that spooky/sicko, deadpan way that Lynch's movies always are, and it's guaranteed to repel anyone who likes entertainment wrapped in tidy resolutions and optimistic fade- outs.\r The visuals, Angelo Badalamenti's music and Lynch's sound design -- his perennial sound designer, Berkeley's Alan Splet, died in 1994 -- are all effective, and the comic bits, specifically Robert Loggia's scene as a mobster berating a tailgating motorist, are all effective.\r Filmmakers such as Lynch deserve our admiration for creating new cinematic idioms and exploring new ground. At the same time, \"Lost Highway\" often feels like a stunt -- like an arcane, deliberately perverse game that Lynch knew would never make sense. It's also feels, with its similarities to \"Twin Peaks: Fire Walk With Me,\" \"Blue Velvet\" and \"Wild at Heart,\" like overly familiar territory. Lynch's great wish is to shock and arouse us, but in using the same kind of music, camera effects and offbeat editing rhythms over and over, his work is beginning to look like variations on a single theme.\r Arquette, whose low-in-affect style is perfectly matched to Lynch's, gives the strongest, most memorable performance -- and brings to mind Kim Novak's similar dual roles in \"Vertigo.\"\r There is also a cameo by Richard Pryor, along with appearances by Gary Busey, rock star Henry Rollins and Natasha Gregson Wagner, daughter of the late Natalie Wood."}, {"rating": "10", "text": "dont know how or why ive missed seeing this 1997 masterpiece of film making...its slow burn winds into an open mind and stays there, im sure it will, for the duration of my lifetime...Eraserhead, Wild at Heart, Blue Velvet, and now...Lost Highway...are such strange, memorable, phenomenally crafted works of apex art and now i savour this new find...and for another moment...i feel alive...feel...good...to be alive...it appears many of  \"critics\" do not seem to know what they are talking about...those who cannot act or direct, clearly make a profession out of criticism..i encourage those who make a parasitic living off films...to observe more intently...and speak with more reverence for that, which i observe, they often show such little respect...Lost Highway is masterful...watch it more than once...im sure it was meant to be watched more than once."}, {"rating": "2", "text": "Thought this movie was garbage. And trust me Will S., I'm not an idiot - I'm much smarter than you. This movie just panders to an audience that desperately wants to think of itself as elitist and high-culture. That is why it has amassed such a cult following, and that is why it has a 9.3 user rating on MetaCritic."}, {"rating": "10", "text": "This film follows (and transcends) the European  \"art film\" model of a non linear narrative, oblique dialogue and double characters (a la Luis Buñuel and  Krzysztof Kieślowski). However it is also injected with American action film motifs combined with truly odd Lynchian  touches that make this one of the most remarkable films of the 90's. The party scene is one of the scariest sequences caught on film...ever."}, {"rating": "7", "text": "\"Lost Highway\" is an example about most experimental David Lynch's films. A possible Doppelgänger lead character, Fred, and a mysterious unsolved crime. It's very difficult to understand this film with first view. It's necessary to watch again. Interesting film no logic. It's an avant-garde movie."}, {"rating": "2", "text": "Figure it out...I dare you....pretentious claptrap."}, {"rating": "10", "text": "Anyone who votes less than 10 for this movie did not understand it, and therefore is an idiot."}, {"rating": "7", "text": "I find it amusing when people say something like Inception is \"confusing\". Nobody does it like David Lynch. Lost Highway is one of the most polarizing movies ever made. It's weird,abnormal,confusing, nightmarish', and doesn't follow the typical A-B-C narrative structure. It's definitely a wild ride. Lost Highway isn't Lynch's greatest film, that honor would go to Blue Velvet or Mulholland Drive. But If your looking for an insane movie experience,this is it. Complete off the wall insanity."}, {"rating": "10", "text": "David Lynch does not make movies for buisness. His movies do not have a target audience becasue he does not care about audiences nor does he care or know the meaning of this film. If you can deal with that than you will love this movie. If you are a visual person you will also love this movie for it has a very unique dreamlike look that only David Lynch can master."}, {"rating": "10", "text": "This is not a movie, this is Art. You have to analyze Lynch' surrealism like a dream, with all the archetypal creeps and weird characters as subconscious projections around a few protagonists. The critics are retarded and don't seem to get it. It's awesome and breathtaking from beginning to finale. One of my favourites -Mulholland Drive is even better!"}, {"rating": "10", "text": "This was my first contact with Mr. Lynch's work. I watched it not knowing what to expect at all. When the final credits showed up, I was shocked! I sincerely thought that was the most nonsensical garbage of a movie I watched in the past decade! Despite that, I just couldn't get it out of my head for the following 4 hours. More than that: I was actually obsessed with it! Late at night that day, in bed, still trying to figure out what in the world I had just watched, I got the \"revelation\". Instantly, without watching the movie again, I was convinced this was one of the best movies of the decade! Thank you Mr. Lynch for providing an island of originality in an ocean of linear, dumbed-down, conservative story-telling. Lynch does on film what Escher does on canvas."}, {"rating": "10", "text": "A Brilliant Masterpiece. Thank God (David Lynch) for people like Zack H. and Joris and Horatio A. and Will S."}, {"rating": "7", "text": "The Lost Highway is good but is nothing up to the standard of Mulholland Drive. It neither sustains or builds up suspense like Mulholland Drive, but the critics have rated it very harshly. There are moments of Lynchian genius and brilliance but this is all in the context of a movie that does not build up the same reputation as other Lynch projects. A good movie that is as disturbing as it is interesting but if you need one to rent during a weekend get Mulholland Drive."}, {"rating": "8", "text": "Lost Highway is as divisive as any other David Lynch film amongst critics and audience members alike. A confusing and convoluted film, Lost Highway's true interpretation is as hard to pin down as any other Lynch film, though it is perhaps a bit more accessible than, say, Mulholland Dr. In essence, Lost Highway is a film about the underbelly of society. Porn, sex, murder, and temptations abound in David Lynch's mesmerizing tale of a man who has opened his home to Satan and cannot get him out of his place. Told in the only way Lynch knows how - confusingly - Lost Highway can be off-putting, but for those willing to get swept up in its whirlwind, it is more than satisfying.Satan has entered the home of the Madisons. This much is clear. If the suggestions in the beginning of the film that Renee Madison (Patricia Arquette) was different and not like herself, the conversation between Fred Madison (Bill Pullman) and the mystery man (Robert Blake) cement it. Telling Fred that this mystery man is in his home and also showing that he is the source of the videotapes they have received hinting at Fred murdering Renee, it becomes clear that Satan has a hold on this family. How did he get into the home of Madisons? Via Renee. Just as Eve is the reason sin entered the world after she bit the apple from the tree of knowledge, Renee is a sex worker and porn star. By engaging in these sins and keeping the company of Mr. Eddy/Dick Laurent (Robert Loggia), who has clearly sold his soul for money and fame, Renee allowed Satan into the home of her and her husband. Once this happens, Satan lets himself into the home and toys with the Madison's and messes with the mind of Fred. Sending him to jail and then dumping him briefly into the body of Pete Dayton (Balthazar Getty), Satan has his way with the Madison's, but ultimately gets his reward: their souls. Helping Fred kill Dick Laurent and welcoming Renee's nude body into his previously burning cabin, the Madison's souls are no longer their own. The transaction is, of course, orchestrated by Renee who says that the man who lives in the cabin will help her and her lover disappear.Sin engulfs the entirety of this film with the porn tape between Renee and various people playing throughout much of the final half hour of the film. People are murdered or driven off the road by men like Mr. Eddy or they engage in a variety of other sins throughout the film. This indulgence and embrace of the underbelly of society wreaks havoc on the family unit and destroys it thoroughly. In many ways, Lost Highway crafts an ode to films such as Rosemary's Baby or a companion piece to fellow 1997 release The Devil's Advocate. All show the temptation of sin and the potential rewards of selling your soul, but they always come in this world. Once it is over, the fire rages all around (as it does in the Madison's fireplace and in the cabin) and nothing but the gnashing of teeth remains. This film and the others show the aftermath of this and the pain, strife, and threat posed to our lives if we allow Satan in via our own sinful tendencies.A thoroughly hypnotic and freak experience, Lost Highway features a lot of similar traits to Lynch's works, namely wooden acting and weird people. Pullman and Arquette are terrific, however, and portray these sort of alien and confused people unaware of what hell their actions have awakened. The film is often stolen by Robert Blake, however, as the mystery man whose always looming presence is terrifying and thoroughly unsettling from beginning to end. Robert Loggia is also great in a truly intense and angry performance, instilling great fear and presence whenever he appears on the screen.Lost Highway is a divisive film, but is an equally horrifying one that really feels Lynchian from beginning to end. A parable on the dangers of giving into temptation and making deals with the devil for success on Earth, the film is hypnotic, mesmerizing, and perverse. Yet, it is also brilliant and a truly surreal experience as with all of his works. Nobody makes unique films like David Lynch and every single one of his films continues to defy expectations and pre-conceived notions about the film."}, {"rating": "6", "text": "Of course the story is very interesting and you need to focus and think to understand it. Usually no one understand it after watching it the first time, you need to watch it again. But...The biggest problem of the movie is the length. There are so many unnecessary long scenes, sometimes it is even ridiculous, when some dialogues are just to unrealistically too long. I was happy to see the outro."}, {"rating": "9", "text": "Lost Highway is of which Muholland Drive inherits its best characteristis like a plot that never gives you the answer and makes you only wonder why and some of the most beautiful surrealistic scenes that Lynch ever made"}, {"rating": "7", "text": "\"We've met before, haven't we.\" ​Before finally getting around to watching the whole movie I would always watch \"The Mystery Man\" scene. Everything from the the audio from the noisy party gets drowned out, like they’ve entered a separate dimension. The color grading changes as the music goes down when he walks up to Bill Pullman. Robert Blake (The Mystery Man) has no eyebrows or eyelashes. His face, his voice, his laugh. Pure creepy.David lynch is the type of director who explains nothing but shows us everything we need to know to gasp it's dark and yet deep meaning."}, {"rating": "9", "text": "Lost Highway is not Lynch at his most accessible, that would be Blue Velvet followed by The Elephant Man and The Straight Story, and I would put those films as well as Mulholland Drive (one of his most polarising along with Eraserhead) as better films of his, but while it has divided and will divide viewers I did love the film. Lost Highway does occasionally get confusing (particularly from a psychological stand-point) as a result of trying to have too many ideas, which does seem to be what the main complaint is against it, but for me there was very little wrong (as a bit of advice it is a good idea to be acquainted with Lynch's style first with The Elephant Man or Blue Velvet being the best place to start). Lost Highway looks amazingly stylish, the cinematography some of the best of any film personally seen in a while, the colours are expressive and bursting with colour and hypnotism and the images are surreal but impeccably hypnotising. Lynch's directing is highly accomplished if not quite some of his best directing like Mulholland Drive or Blue Velvet. He also does a great job in not making Lost Highway too formulaic (there is a sense that formally and structurally that there was a fair bit of re-invention involved), in fact it was one of the freshest and most unique psychological mystery thrillers personally viewed. Like Eraserhead, Lost Highway is basically an atmosphere/mood piece and it works amazingly as one. It may be Lynch at his strangest but that made the film even more fascinating to watch, no matter what you think of some of the story the impact the atmosphere has in the film cannot be denied. The thriller elements are enough to set the pulse racing and the mystery elements while made obvious about half-way through have a lot of suspense. Bill Pullman's exemplary here, some of the best work he's ever done even, and standouts too are Patricia Arquette at her most sensual and Robert Blake at his creepiest. The music score is incredibly haunting with fitting use of pre-existing songs and while spare the dialogue doesn't stick out like a sore thumb too much. All in all, a bizarre film but with the mood it has and how well-made and directed it is it is a very compelling one too. Not Lynch at his best but around the top end of his filmography. 9/10 Bethany Cox"}, {"rating": "6", "text": "Ironically, Lost Highway is not as good as I remember it. It has a great opening for a noir/horror thriller. It may have made a good 90 minute or 105 minute film but over two hours is far too long and the 90s soundtrack feels dated. Lost Highway is not a bad film but is definitely a notch below the other Lynch films I have viewed recently (Mulholland Drive, Wild at Heart)."}, {"rating": "8", "text": "A nightmare subtly disguised as a movie, and it's not because it's a bad movie, but because its characters -and the story itself- seem to come out of a bad dream, to the point that it doesn't allow us to be distracted or blink; and with a puzzling final act that leaves questions unanswered."}, {"rating": "10", "text": "Sometimes as good, sometimes better than Mulholland Dr., and the soundtrack just takes this one over the top."}, {"rating": "7", "text": "if you enjoy not-understanding something, it's a great enjoyable film which makes you struggle to your core, finding out whats happening. it's definetly a must-watch for film-lovers."}, {"rating": "8", "text": "A sensorial journey with a mind boggling plot that keeps you hooked all the way through. Totally worth your time."}, {"rating": "7", "text": "I never thought that I would see a film as disturbing as Mullholland Drive. Well I think I just did.Lost Highway is a breathtaking and mind-blowing  experience that could only be made by Lynch. The combination of music, sound and imagery create a unique piece of cinema. I wish I had understood it a bit more so that I would rate it higher, but I am too disconcerted for that."}, {"rating": "10", "text": "Lost Highway is one of those mind fantasy movie that will confused a lot of people, well thankfully for me, i found it not that hard and not that confusing if you really think about it again, and i wouldn't say that my theory was the one, Lost Highway is like Hitchcock's Vertigo, where people thinking and give their own opinion on what really happen and what causing Madeleine jump and die in the end of a movie, and it can be anything, so it's not a one answer theory, same like Lost Highway, you can make your own opinion or theory on what really happen through out the film, besides all of that, Lost Highway fills with a superb and amazing performance by everybody especially Patricia Arquette, Lost Highway is proving another Lynch skills which before this he probably well known as making a good weird film, in Lost Highway he prove that he can make and representing fantasy and reality in film so well, overall Lost Highway is another incredible work from David Lynch."}, {"rating": "10", "text": "One of the best movies ever made. A toss up between this and Mulholland Drive. It's literally the story of O.J. Simpson."}], "recommendations": ["donnie_darko", "dark_city", "eyes_wide_shut", "titane", "stoker", "personal_shopper", "the_killing_of_a_sacred_deer", "the_cell", "the_ninth_gate", "a_clockwork_orange", "you_were_never_really_here", "a_ghost_story", "enemy", "memento", "searching", "under_the_skin", "a_cure_for_wellness", "antichrist", "us", "the_birds", "last_night_in_soho", "midnight_special", "the_machinist", "annihilation", "the_master"]}