{"id": 3535, "title": "Lost in Space", "starring": ["Jack Johnson", "Gary Oldman"], "runtime": 130, "genre": ["Science Fiction", "Adventure"], "description": "The prospects for continuing life on Earth in the year 2058 are grim. So the Robinsons are launched into space to colonize Alpha Prime, the only other inhabitable planet in the galaxy. But when a stowaway sabotages the mission, the Robinsons find themselves hurtling through uncharted space.", "releaseYear": "1998", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/4miEpZmUOMqV8P0T6oq5HVBiVHw.jpg", "categories": {"plot": 2.6, "acting": 1.75, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.0, "funny": 1.0, "action": 5.0}, "reviews": [{"rating": "1", "text": "This movie is purely indescribable, everything about it is so horribly bad that I don't even know how much detail I can go into on this movie, I've only watched 4 minutes of the monstrosity and it's a steaming pile of **** Let me get this straight, this is the worst movie I've ever seen in my 16 years of existence, this is the worst movie I have seen in my LIFE. I was just casually scrolling through the channels on Sunday night, bored out of my mind, when suddenly, Lost in Space shows up, and I start watching it and then I turn off the TV, grab a cloth, wrap it around my hand, and smash the living **** out of it, then I pour kerosene onto the TV, go outside, start my car, reverse my car, accelerate, crash, crawl out from the rubble of my house, throw a lit match onto the kerosene, and then my soul is purged from the disgrace that is Lost in Space.\r There really is nothing to redeemable about this whole movie, the characters suck, the CGI sucks, the story sucks, the acting sucks (looking at you, Matt Le Blanc), EVERYTHING SUCKS. Let me say that Saving Private Ryan was released in the same year, Armageddon was released in the same year, the Rugrats Movie was released in the same year, Fear and Loathing in Las Vegas was released in the same year, Men in Black and Batman & Robin were released a year before this piece of **** AND EVERY SINGLE ONE OF THESE MOVIES WERE BETTER (well, not Batman & Robin, that was REALLY bad).\r I would have given this movie a 10 if it had been classified as a comedy movie, because this thing is literally laughably bad, I was just giggling through all 4 minutes of this horrible movie, everything is just so pathetically bad, I really don't want to see or hear of this movie ever again. Only watch this movie if you're one of those YouTube review channels, or if you want to torture someone, I don't care, just don't give New Line Cinema any money for this pathetic excuse for a movie, go and buy a better movie, like, I don't know, Antz or something."}, {"rating": "3", "text": "It's hard to know where to start with this mess of a movie when almost everything is so horribly wrong. The writing is absolutely appalling (\"Within these eggsacks lives a monster race of spiders!\"), the direction is non-existent, the plot flails around at random, and the effects are incredibly dated. However, most of all, what truly makes Lost in Space a wretched experience, is the cast. Oftentimes the robot (simply named 'Robot') has more emotional depth than the human characters. William Hurt and Matt LeBlanc put on embarrassingly awful performances, and being the two male leads, this is unforgivable. Lines are just lackadaisically read in standard middle-shots no matter the scenario. Gary Oldman brings his usual A-grade ham, and Jared Harris uses a bizarre cartoon-character like speech pattern for his role. The film is not offensively bad, but most certainly is not worth the two-hours of its running time."}, {"rating": "6", "text": "I saw this when I was 14 or 15 so my review definitely doesn't have a lot of credibility. I liked the movie enough to watch it a few times, but I do remember most of it being cheesy and predictable. Although to give it more credit, the original was extremely cheesy, what would you expect from a 50s show? I felt the story needed to be more centered around one issue, but it felt random. But perhaps it was doomed from the start. The main premise is that they are lost in space and they have lots of adventures. So, perhaps this should have been a show and not a movie. This film is decent, that is the best way to describe it. Gary Oldman is wonderful as usual, great character."}, {"rating": "9", "text": "A very good Si-Fi movie  !\rGood for the all family, good story, just a little long.\rIt's not the best film ever made but would deserve to be more known"}, {"rating": "6", "text": "I'll be honest when I say I actually liked this movie. I know it gets allot of bad reviews from allot of people, and I understand and agree their opinions. But, I enjoyed at and found it entertaining. As long as you don't take it too seriously and enjoy it for what it is then it can be fun. Overall: It's a crap movie, but I still enjoyed regardless of all its flaws."}, {"rating": "2", "text": "1. youngest daughter set to squeal.\r2. ham rape.\r3. monotone performance from William Hurt.\r4.underdone monkey pet set to squeal.\r5. continuity issues of internal story logic.\r6. Mr. Robinson's goodbye to his wife \"goodbye wife\" before possible death clearly overdubbed post production.\r 7. constant dead eyes from cast apparently director had no cattle prod.\r8. \"robot forget logic use your heart\" Will to robot, a child prodigy of time travel is so temporary stupid he doesn't know software is built on logic."}, {"rating": "8", "text": "This good movie could have been great if writer Akiva Goldsman had been able to -- or been permitted to -- dump the boundaries of the TV source altogether."}, {"rating": "10", "text": "This good movie could have been great if writer Akiva Goldsman had been able to -- or been permitted to -- dump the boundaries of the TV source altogether."}, {"rating": "10", "text": "This good movie could have been great if writer Akiva Goldsman had been able to -- or been permitted to -- dump the boundaries of the TV source altogether."}, {"rating": "10", "text": "A very good Si-Fi movie ! Good for the all family, good story, just a little long. It's not the best film ever made but would deserve to be more known"}, {"rating": "9", "text": "A very good Si-Fi movie ! Good for the all family, good story, just a little long. It's not the best film ever made but would deserve to be more known"}, {"rating": "10", "text": "A very good Si-Fi movie ! Good for the all family, good story, just a little long. It's not the best film ever made but would deserve to be more known"}, {"rating": "10", "text": "A very good Sci-Fi movie ! Good for the whole family, good story, just a little long. It's not the best film ever made but would deserve to be more known"}, {"rating": "10", "text": "A very good Sci-Fi movie ! Good for the whole family, good story, just a little long. It's not the best film ever made but would deserve to be more known"}, {"rating": "10", "text": "A very good Si-Fi movie ! Good for the all family, good story, just a little long. It's not the best film ever made but would deserve to be more known"}, {"rating": "10", "text": "A very good Sci-Fi movie ! Good for the whole family, good story, just a little long. It's not the best film ever made but would deserve to be more known....."}, {"rating": "10", "text": "A very good Sci-Fi movie ! Good for the whole family, good story, 2h, 10m long. It's not the best film ever made but would deserve to be more known....."}, {"rating": "10", "text": "A very good Sci-Fi movie ! Good for the whole family, good story, 2h, 10m long. It's not the best film ever made but would deserve to be more known....."}, {"rating": "10", "text": "A very great Sci-Fi movie ! Good for the whole family, good story, 2h, 10m long. It's not the best film ever made but would deserve to be more known....."}], "recommendations": ["hotel_transylvania_transformania", "the_mummy_tomb_of_the_dragon_emperor", "terminator_genisys", "dark_phoenix", "the_spongebob_movie_sponge_on_the_run", "hancock", "the_twilight_saga_new_moon", "bad_boys_for_life", "the_day_the_earth_stood_still", "national_treasure_book_of_secrets", "i_am_number_four", "black_panther_wakanda_forever", "red_dawn", "edge_of_tomorrow", "the_twilight_saga_eclipse", "the_tax_collector", "superman_ii", "i_am_legend", "minions_the_rise_of_gru", "abduction", "the_many_saints_of_newark", "journey_to_the_center_of_the_earth", "seventh_son", "doctor_strange_in_the_multiverse_of_madness", "underworld_rise_of_the_lycans"]}