{
  "id": 1851,
  "title": "Lovelace",
  "starring": [
    "Amanda Seyfried",
    "Sharon Stone"
  ],
  "runtime": 92,
  "genre": [
    "Drama"
  ],
  "description": "Story of Linda Lovelace, who is used and abused by the porn industry at the behest of her coercive husband, before taking control of her life.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9zdacmBswpiyLJfynWeGFXxHP1i.jpg",
  "categories": {
    "plot": 5.571428571428571,
    "acting": 5.5,
    "ending": 7.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Absolutely superb casting and acting. A powerful depiction of domestic violence, intimidation, and the darkness behind the scenes of the industry. Excellent and tasteful use of flashback techniques. This movie's reception by \"critics\" has been unjustly harsh; go see it for yourself and ignore the Metacritic score."
    },
    {
      "rating": "6",
      "text": "Linda Lovelace (Amanda Seyfried) was the most famous porn star and her movie \"Deep Throat\" was the biggest grossing XXX ever. This biopic starts with the passionate, wide-eyed, exciting version of her story, but switches halfway thru to reveal the truth: her husband (Peter Sarsgaard) pimped her out and abused her. This dark and unfortunate film has a strong cast (Sharon Stone & Robert Patrick have the most touching scenes as her parents) and lots of garish '70s style. While it's relentlessly cruel, it never conjures up much sympathy. It's an over-the-top biopic that's more instructional than emotional."
    },
    {
      "rating": "6",
      "text": "The real life story of Linda Lovelace and \"Deep Throat\" was a pretty interesting affair so having a bio-pic made about her wasn't that surprising.  However, the plot is a little messy and the story tends to ignore some important facts about her life--and, in doing so, made the film feel more like a collection of short stories from Lovelace's journey than the actual story.  But the subject material is interesting and the performances are strong.  As a drama, it's great.  As a bio-pic, it's okay."
    },
    {
      "rating": "4",
      "text": "Amanda Seyfried came onto screen nearly ten years ago, beginning in light comedies and now we are beginning to find her in Oscar-bait films such as this. Unfortunately, Lovelace is a difficult story gone wrong--no matter how gifted Seyfried's performance was."
    },
    {
      "rating": "7",
      "text": "Unlike the year's earlier 'The Look of Love', which also dealt with a porn industry icon, Lovelace is actually  very informative if a somewhat sanitised and one sided depiction of events in the life of Linda Lovelace of  Deep Throat  fame. At a modest  93 minutes there is a lot to pack in and at times scenes seem to end with an exclamation mark to lead us succinctly in to the next chapter of L L's life. The film is very well served by its actors. Amanda Seyfried has never before given such an accomplished performance, but that being so she is still eclipsed by Peter Sarsgaard as her husband Chuck Traynor who, as painted here, is very much the villain of the piece. Sarsgaard is breath takingly brilliant and steals the acting honours from a strong line up of character actors with some ease. An unrecognizable Sharon Stone also registers strongly in support as Linda's down trodden mum and the choice of soundtrack and costumes fit the period to perfection. All in all this is a much better movie than I expected given the luke warm reviews and, on reflection, I feel that it has been rather under rated."
    },
    {
      "rating": "7",
      "text": "It is a biographical drama of the number one adult movie star of the 70s, Linda Lovelace. The movie unfolds her life story that happened between the age 20 to 32. It briefs her struggle in the married life till her first appearance on the silver screen in a movie called 'Deep Throat'. I could have liked more if the movie would have the original cast Kate Hudson and James Franco as planned instead Amanda Seyfried. Nonetheless, it is a cool movie about a true story. To me what's important is the message to reach everybody than the technical and cast issues.\r Linda is from a decent respected family who is attracted to Chuck, a guy she meets in a pub. Instantly they decide to get marry against her parents will. After the marriage, she is not permitted to interfere into her husbands business, in fact she does not know anything about it. Once Chuck gets into a severe trouble in his business the couple loose everything they had. So then he decides to put Linda into an audition for a movie in the lead role. Everything goes as planned, in one movie and it's success they begin to reclaim their position in life. Now as a popular celebrity in the country, what Linda decides about her future is the rest of the story.\r Amanda Seyfried was excellent as Linda Lovelace, she exceeded all my expectation and so the Peter Sarsgard. In the initial parts I almost started to dislike the movie because I thought it was travelling in one direction which I was not happy about. In half way the movie begins to explain in different perspective of the same story and that is where it almost convinces the audience. Still a few things need proper explanation especially her relationship with Marchiano. I believe they are not planning for a sequel to brief her second marriage and rest of the life till she dies. The movie had few nudes but no sexual interactions. It describes more on the emotional side than her professional stuffs. In the end this is about a real person's good and bad where we can learn something from their mistakes. Overall, it is a one time watchable biopic."
    },
    {
      "rating": "5",
      "text": "It is not a bad but also not a good movie. It's pretty much a 'meh'-movie.\rThe biggest problem is the sweet sweet irony because while trying to show us that a prude society can't be one that makes sexuality safe, this film is terribly prude and (probably) unwillingly scandalizes sex itself.\rIt is also a shame that Amanda Seyfried is unable to capture any of Lovelace's fabled screen presence and leaves the character rather bland and one-dimensional.\rit is not a terrible watch but it also doesn't add anything new to..well...anything."
    },
    {
      "rating": "10",
      "text": "This movie was outstanding. Thats right, I said it. Outstanding. What this girl went through was horrific.  This movie was too underrated and should have been revered more by Hollywood alumns. I was impressed by all of the performances. Knockout cast. I was so into it I was crying 15 minutes after the movie ended.  I know this is just an opinion, but I highly recommend this movie for everyone.  A piece of history that carries more weight than I ever would have imagined before watching.   Kudos to the writer, producers, director, and performers. Thank you for sharing a hard, brutal reality.  I am grateful."
    },
    {
      "rating": "5",
      "text": "Amanda Seyfried and Peter Sarsgard put on great performances but the movie is suffers from some elements from its script and it can be better. But the performances by its lead stars were great"
    },
    {
      "rating": "4",
      "text": "Lovelace is one of those movies based on true events that we don't want or don't need to know about, and besides that, the acting is terrible! The only reason people liked this film is because it shows Amanda Seyfried naked."
    },
    {
      "rating": "6",
      "text": "This is an extremely well acted film which allows for a mild recommendation.  As much as you learn about Linda Lovelace I feel we aren't able to get to a strong enough emotional level because the script glosses over to much. B-"
    },
    {
      "rating": "0",
      "text": "Nothing interesting that hasnt already been said is shown in this movie. The characterizations are shallow and the movie basically repeats itself at midway point. avoid!!!! amanda seyfried is wasted in this movie!"
    },
    {
      "rating": "2",
      "text": "If Hallmark or the Living channel made a film about he porn industry, this would be it. Revisionist and highly sanitised, Lovelace is a poor drama lacking the real facts of the decisions that Lovelace made."
    },
    {
      "rating": "5",
      "text": "In the early 70's Deep Throat was a porn film that even your parents had heard of, and its star became world famous for her \"talents\" on screen. behind the scenes it was a different story as she was used and abused by her husband and mentor. The casting here is inspired, especially Sharon Stone virtually unrecognisable as Linda's mum, but the story itself feels rushed with characters disappearing for long periods with no explanation, and Linda's husbands descent into abuse feeling incredibly rushed."
    },
    {
      "rating": "6",
      "text": "A solid biopic, that could of easily gone down the pornographic path given the subject matter but refrained."
    }
  ],
  "recommendations": [
    "joy",
    "blue_valentine",
    "the_fault_in_our_stars",
    "me_before_you",
    "collateral_beauty",
    "manchester_by_the_sea",
    "the_curious_case_of_benjamin_button",
    "closer",
    "gifted",
    "breakthrough",
    "marriage_story",
    "white_boy_rick",
    "revolutionary_road",
    "the_place_beyond_the_pines",
    "the_intern",
    "the_glass_castle",
    "the_upside",
    "hustlers",
    "the_blind_side",
    "scent_of_a_woman",
    "donnie_brasco",
    "the_devil_all_the_time",
    "the_descendants",
    "stillwater",
    "21_grams"
  ]
}