{
  "id": 2097,
  "title": "Love Actually",
  "starring": [
    "Alan Rickman",
    "Bill Nighy"
  ],
  "runtime": 135,
  "genre": [
    "Comedy",
    "Romance",
    "Drama"
  ],
  "description": "Eight London couples try to deal with their relationships in different ways. Their tryst with love makes them discover how complicated relationships can be.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7QPeVsr9rcFU9Gl90yg0gTOTpVv.jpg",
  "categories": {
    "plot": 6.884615384615385,
    "acting": 6.666666666666667,
    "ending": 5.5,
    "soundtrack": 7.5,
    "cinematography": 1.0,
    "familyFriendly": 3.0,
    "funny": 6.947368421052632,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The occasional overdone moments are far outweighed by the heart touching warmth of this film. If you are looking for a deep dredging of of the human soul read Kafka or watch The Pianist. This is a light hearted reminder of some of the joy of life. And what's wrong with that? A good example of why one shouldn't listen to critics."
    },
    {
      "rating": "8",
      "text": "Infused with the charm of Hugh Grant, Martin Freeman (\"Tim\" from The Office UK), Liam Neeson, and many others, these loosely connected stories weave together to make one of the most endearing and funny rom coms of the past decade. Unlike its American counterpart, this film underplays (to the extent that that's possible with an all-star cast) its principle actors, bringing a much-needed aspect to the stories. Sure some of the tales are a bit cloying, and some are a tad unnecessary, but such is the folly of a modern romantic comedy. The stories don't always hit home with the feeling they're trying to convey. Having said that, one story in particular really impacted me emotionally- something few films ever do, especially romantic comedies. Two particular performances stand out in this movie. The first is Liam Neeson's character as a widower, whom I found to be extremely endearing. His evolving relationship with his stepson (Thomas Sangster) is a delight to watch. It turns out he has chops for family roles, too, and not just high-impact drama and action. Who knew? The other gem in this film is the more ephemeral but ever-present Bill Nighy, who plays a washed-up old hack of a singer/songwriter whose glory days are well behind him. Even he gets his own love story, but that takes a back seat to his hilarious scene-stealing lines peppered throughout the film. All in all, this film is a fun, charming watch, if not a perfect movie, and is well worth seeing if you have any love of romantic comedies. It also happens to be a no-brainer alternative to that Valentine's Day knockoff cal. Verdict: Movie Win (for rom com fans)"
    },
    {
      "rating": "10",
      "text": "To all those who have watched it: I hope you enjoyed it as much as I do.To all those who haven't watched it yet: what are you waiting for?"
    },
    {
      "rating": "1",
      "text": "Puh-lease! A contrived ... winking at the camera ... aren't we so cute and funny (NO! You are not) over-long, overwritten, piece of garbargouix. This is a movie for unhappy, lonely housewives who want to get out of their routine marriages. They'll have that affair but they'll realize that the momentary excitement of the bad deed fades and they cut it off ... and they see that the man they married is a good person with flaws, like us all. And then one day they'll be in the shower and they'll find a lump ... and three years later ... it's all done."
    },
    {
      "rating": "2",
      "text": "When a movie has you begging for it to end not even half way through it's pure crap. We've all seen this movie and this characters millions of times, nothing new in it. Don't waste your time."
    },
    {
      "rating": "9",
      "text": "Some parts of the movie are very sentimental, but Love Actually is a well-directed and well-acted film. The script is intelligent and funny, and while the story is a little confusing, as there are so many characters, I highly recommend this. The direction by Richard Curtis is very good and well paced. I think the film's main strengths are the acting and the well-developed characters. The standout is Bill Nighy, in an unlikely but actually hilarious role. Though Emma Thompson and Alan Rickman are very good as well, in one of the more interesting stories. There is also Laura Linney and Liam Neeson, two talented actors, if you see the two of them in Kinsey you'll know what I mean. Keira Knightly, Hugh Grant and Kris Marshall also delight. In conclusion, look out for this film. I was annoyed a bit by Rowan Atkinson, but I really like this. 9/10 Bethany Cox"
    },
    {
      "rating": "1",
      "text": "I am only giving this movie a 1 for the great cast, though I can't imagine what any of them were thinking. This movie was horrible. I want that 2 1/2 (!) hours of my life back. Friends whose taste I trust actually recommended this piece of crap to me. Just to start ... I don't think even in America could someone has idiotic as Hugh Grant's character be elected to lead the country. If Laura Linney's character liked her hunky co-worker so much, why the hell didn't she turn off her' cellphone when she finally lured him to her bed? (And her storyline was left hanging.) Why did the subplot with Emma Thompson and Alan Rickman seem to be about humiliating Emma's character? Why did Keira Knightly marry the black guy if she really wanted the other guy? And how convenient that in a huge city like London, all the children iin the story went to the same school. The movie's music was horrible, especially the little girl who was forced to sing like an American Idol reject. Were they going for the absurd when the so-so looking guy went to America and was overwhelmed with attention from prospective Playboy playmates? And the oh-so-cuteness of Colin Firth's character's and the maid's trying to communicate. The porn star body-double couple hardly had a story. But then, the stars of the movie hardly had a story. Hugh Grant's dancing-in-his underwear/\"Risky Business\" ripoff was unforgivable, as was the misogyny of the middle-aged men ending up with women half their ages who had been their servants."
    },
    {
      "rating": "3",
      "text": "It was OK. I don't see why everyone loves it so much. It wasn't very smart or deep or well-directed. I usually check out the customer reviews b/c after Seabiscuit and A Beautiful Mind I realized that I could not trust reviewers any more, so I decided to use these user ratings, woops. I feel like this post board for this movie has become a bash-board for whoever Robert Plant is, he did some review I guess. The movie was pretty retarded but I walked out kinda happy, I still feel like I wasted my time. I liked the actors and their stories, even though some of them were really boring and uninteresting. I'm from the UK and I don't see how this movie could've offended some people...  I spoke to a crew member on the film and he said that there were many moments where he could hear many cast members or crew members complaining about the character development, I couldn't agree more. It's a dopey, ditsy, light-as-a-feather holiday movie, no more, like a mediocre Christmas Special."
    },
    {
      "rating": "5",
      "text": "I really wanted to like this movie. I feel terribly cynical trashing it, and that's why I'm giving it a middling 5. Actually, I'm giving it a 5 because there were some superb performances--Emma Thompson, Laura Linney and Bill Nighy among them. But, my God, what a maudlin mish-mash of overbaked optimism! I loved the film best when reality took over--which was all too rare: Linney's hopeless romance, Collin Firth walking away from his linguistically-challenged infatuation. Thompson's initial heartbreak. It was real, bittersweet, and true. When I had to suffer through yet another bumbling romantic performance by Hugh Grant (who, besides Americans, would elect someone this idiotic to their land's highest office?), a school play that looked like the finale of \"American Idol\", and a wedding that resembled the parade sequence of \"Hello Dolly\", I was actually angry. At its best, \"Love Actually\" is sweet and true and optimistic. At its worst--as it often is--\"Love Actually\" is manipulative, unbelievable, and just plain stupid. I think a 4 is a better vote...actually."
    },
    {
      "rating": "2",
      "text": "Watched it again, and this time I realized just how glitzy and poor this film is...Really appealed to my baser instincts when I first watched it....Everything warm and fuzzy at Christmas with a couple of  \"real\" love stories...But beneath the coating of  Hollywood style slickness, there lurks mediocrity,  a lust substitute for love...Firth  likes his maid's butt, Rickman loves to ogle his come on sexy secretary, and those were mild examples...A film of mostly male fantasies done in a \"cute\" simplistic way.....What a waste of talented actors....Liam Neeson was decent....And Linney's story is about love...Beneath the coating of sparkles and sleaze, lurks a mediocre film....Merry Christmas!"
    },
    {
      "rating": "2",
      "text": "Maybe I'm not english so I missed the jokes - but it was not romantic or comedic. An hour in I was bored to shreds .... Kiera Knightly was the only interesting thing for me in this movie.... but worth sitting 2hrs for without being delved into the story."
    },
    {
      "rating": "4",
      "text": "I can see how it would have seemed great as an idea. You tell a bunch of short stories involving the various stages of love featuring a varying cast, and then connect everyone, expecting your audience to be enlightened. They aren't, because Love Actually, actually doesn't work, not to mention that its a good half hour too long."
    },
    {
      "rating": "10",
      "text": "This is the best of the Christmas season feel good movies! Richard Curtis at his very best! The music and soundtrack are superb!"
    },
    {
      "rating": "8",
      "text": "I think most of these postings fail to take into consideration one of the prime motivations for going to the movies: escape. The film is, admittedly, fluffy but I don't know that Curtis was out to make Citizen Kane. It's a romantic comedy, a genre not particularly well known for its grounded realism. (And furthermore, why is it the case that only crushing hearbreak is considered \"real\"? Have none of you been in love?) Ultimately, I'm most disappointed in my peer-reviewers disillusionment. Perhaps this jaded perspective speaks more to your personal experiences than the film in question and I just think that's terribly sad."
    },
    {
      "rating": "9",
      "text": "Isn't this comment website suppose to be opinionated? If you like the movie, that is great, if you don't, well that is how you just see it. There isn't any need to say things that you have lost your respect for people, becasue it is jsut a movie, it doesn't mean anything. But on the otehr hand, i did like this movie, it was hilarious. A downer i thought of the movie is that i really saw how the creators, directors or whoever TRIED to make some of the characters seem funnier than they really were. But i would like to ask ANYONE who knew what the music was called when the Prime Minister and the President were in a Press Confrence and the Prime Minister was stating that he will not tolerate the Presidents 'bullying' towards the the PM."
    },
    {
      "rating": "10",
      "text": "Beautiful, sickening, deliriously funny yet uncontrollably upsetting, Love Actually is the ultimate rom-com by Richard Curtis, who also brought us Four Weddings & A Funeral, Notting Hill and Bridget Jones' Diary. Although I spent 3/4 of the movie wiping the tears from my ridiculously sensitive eyes, a heartwarming film nevertheless, and one of very few films which I intend to buy the second it comes out on DVD. Forget what the NYT or the Wall Street Journal has to say, hear it from a normal single woman with normal feelings - this is a beautiful film which will have you smiling and wiping the tears away in no time. Includes some brilliant moments, such as the porn star story, the little boy who's in love and the single English guy who decides to find love in America, yet has some terribly chin-shaking moments such as when Keira Knightley's character realises ..... and the Liam Neeson's wife's funeral. Just don't forget plenty of tissues!"
    },
    {
      "rating": "6",
      "text": "While this wasn’t my flick it was still engaging. I thought the film had an interesting premise and this was a film viewing experience I’ve never had. Some of the relationships worked, the film had a good cast, and the presentation was good. I guess I’m just too into romantic films and I’m not British so a lot of the British humor probably went over my head. If you are a girl though in the mood for a nice feel good romantic comedy to watch around the holidays this will do. Also, act fast because this is leaving Netflix at the end of the month and is it true that on Christmas you tell the truth."
    },
    {
      "rating": "5",
      "text": "Has some genuinely funny stuff but is also complete fluff. Basically a sitcom in film format."
    },
    {
      "rating": "6",
      "text": "There are countless ensemble comedies such as this--some of them actually quite successful. Love Actually contains some wonderfully connected stories but, unfortunately, too many of them."
    },
    {
      "rating": "7",
      "text": "Cute, charming, and indelibly sweet, Love Actually may be a bit too rich for some due to its wide-armed embrace of movie romance cliches and absurdities, but for those willing to go along with it, the film is a true joy. Setting it during Christmas is a stroke of genius as director Richard Curtis expertly matches the joy, spirit, and magic of the season with that of love, while being unafraid of showing of the dirty, messy, and painful side of love. Through love lost via relationship missteps or death, love found via unexpected avenues, or unrequited love, Love Actually is a breathtaking and expansive look at love that tremendously develops its character. Plus, what a cast! Alan Rickman, Emma Thompson, Hugh Grant, Keira Knightley, Chiwetel Ejiofor, Colin Firth, Liam Neeson, Bill Nighy, Laura Linney, Martin Freeman, Joanna Page, Billy Bob Thornton, Rowan Atkinson, and January Jones, all appear in Curtis' largest romantic production yet. While I do prefer his more grounded looks at love in Notting Hill and About Time, Love Actually is still a joyful experience.Truly, the greatest accomplishment here are the characters. For such a large cast of intertwined people, Love Actually jumps quite easily from character-to-character and story-to-story while drawing lines between each and giving each character room to breathe. From Prime Minister David (Hugh Grant), a former playboy looking to finally settle down when he meets Natalie (Martine McCutcheon) to Billy Mack (Bill Nighy), a former heroin addict rock star who realizes love may not be for him, Love Actually's character range is expansive and each romance is well-developed. Though often giving way to cliche, particularly with 11-year old Sam running through the airport to find the \"love of his life\", Love Actually manages to rise above the cliches by somehow exploiting them perfectly. In a lesser film, running through the airport to find a girl would have bothered me greatly. Here, however, the film manages to make it into an explosive climax, symbolizing the hurdles experienced by all characters in the film trying to find their love with the big, adorable pay-off.Of all the characters, it is hard to choose a favorite. Billy Mack is great, of course, but one of the best pairings is John (Martin Freeman) and Judy (Joanna Page). Each encounter between the duo embodies the sweet and charming nature of the rest of the film, as well as the clumsiness and awkward nature experienced by the other characters. Though given relatively little screentime, their quick chemistry and immediate romantic charm make them an enjoyable couple to watch progress during the film. This duo really shows the charm of the film and how effective it can be at drawing pathos. We barely see this duo and yet, their encounters are entirely memorable and incredibly well handled.Love Actually's willingness to embrace cliche may be its biggest turn off for many, but for myself, it was one of the best pieces. On their own, each story would certainly crumble if extended into a whole film. Together, however, they soar as little snippets into a variety of people's love lives. As a whole, it is a vignette and love letter to love and all of its ills and joys.Now, Love Actually is imperfect. By not focusing on any single character, it does limit itself somewhat. Though a great vignette into love as a whole, one of the best parts of any romance film is being along for the whole ride. By jumping from character-to-character, Love Actually deprives its audience of this element and, as a result, the climax is not as infectious as it could have been. Still a great climax, but a bit stunted compared to the others works by Curtis.Love Actually is a bold and ambitious look at love by director Richard Curtis. Pairing him with a tremendous and large cast, the film is a beautiful take on the matter and really delves into all that it can bring. That said, its large cast and numerous characters, though well-written, can be both a gift and a curse given the genre of the film. Though we become connected to each character here, the beauty of the romantic film is the journey, not just the beginning, little bits in the middle, and the ending. For it to be truly satisfactory, you must eat the whole pie, not just a slice."
    },
    {
      "rating": "7",
      "text": "Despite its length and some of its more contrived elements, \"Love Actually\" remains a brazen and compelling romantic comedy with a bevy of admirable performances."
    },
    {
      "rating": "4",
      "text": "There are better movies of two hours length. I loved Bill Nighy's performance, however, as well as Linney's. Mark's love for Juliet was poignant. Little Sam's story might also have worked as a subplot. Rest of the stories were trash."
    },
    {
      "rating": "7",
      "text": "Love Actually brings a smile to my face. It's adorable when it needs to be and also creates some drama when it's important. It is now a style of movie that is very overdone but Love Actually was one of the firsts and it worked for it. I really liked Love Actually, there were adorable characters and they weaved them all in together perfectly."
    },
    {
      "rating": "2",
      "text": "Can't imagine how they convinced so many famous, gifted performers to participate in this moronic, misogynistic, substandard, poorly written, incompetently edited and deeply unfunny movie."
    },
    {
      "rating": "8",
      "text": "Love Actually is a very funny and joyful rom-com that is going to be remembered for ages, it's better than most of the other rom-com's of today. I totally recommend this one."
    },
    {
      "rating": "6",
      "text": "'Love Actually' isn't all that great, actually. Really cheesy and very predicable of how certain scenes are gonna turn play out. However, I guess that's the charm of it all, because I would consider this one of my guilty pleasures.The film really captures the spirit of Christmas and Bill Nighy was fun to watch. Nighy has the best story in the movie, in my opinion. Andrew Lincoln, on the other hand, is creepy as hell in this movie. Even Lincoln himself admitted it.Putting aside the creepiness, it's still the most Christmas of all Christmas movies you'll find."
    },
    {
      "rating": "5",
      "text": "I like how this films description calls it \"the ultimate romantic comedy\". Well, it actually is that. But \"Love Actually\" doesn't only have the sweetness and romance of the romantic comedies but also the overwhelming cheesiness and predictability which in the end trump the positive attributes of the film."
    },
    {
      "rating": "9",
      "text": "WHAT I LIKED: I cried, I smiled and I laughed. 'Love actually' is the very peak of this genre; a classy, emotionally rewarding, thematic and genuinely hilarious ride. This is only made possible though because it's incredible cast all bring their A-games; bringing to life each well-developed character to the extent that you really care about each one. As a result this film could also be considered a lesson in handling multiple characters in one space whilst still making narrative sense, for it succeeds hugely there too.\rWHAT I DIDN'T LIKE: Having said that (whilst you could argue that love is the grounding feature here) it's narrative has no obvious central points to grab hold of.\rVERDICT: It's a wonder it's so good when it's so chock-full, but this is by far the best rom-com I've seen in a while. What a surprisingly charming movie."
    },
    {
      "rating": "8",
      "text": "Romantic comedy. A montage of believable characters fall in love in a showcase of Britishness. The ultimate Christmas feel-good movie. Hugh Grant, Emma Thompson and Alan Rickman play their usual neurotic parts and there's a classic cameo from Rowan Atkinson."
    },
    {
      "rating": "8",
      "text": "A romantic comedy, of a traditional recipe, it is; but this one knows how to do just enough to not seem like one more of the bunch, based on stories linked at Christmas, with a cast if not memorable at least it knows how to be pleasant. Of those that should be seen without being demanding, at Christmas."
    },
    {
      "rating": "8",
      "text": "A fun popcorn Rom-Com with a great cast and witty writing, albeit with some overdone, cheesy moment (all involve Hugh Grant)."
    },
    {
      "rating": "1",
      "text": "Such a mediocre movie! I can't believe how people say that over and over again over Christmas. So many stereotypes -- gay British rock stars, exotic innocent foreign beauty, messed-up 10 Downing St., foolish American girls completely infatuated by a random British guy. By the way how can the only black in this movie cheated on and the only mentally ill guy seem to be a mere burden on family?"
    },
    {
      "rating": "9",
      "text": "Love Actually is one of the few ensemble cast, multiple storyline films that seems to have pervaded popular culture in recent years that actually--pardon the pun--works. Unlike Valentine's Day or New Years Eve (just to name a few), Love Actually manages to create a cohesive film with an all-star cast and just enough story lines for watchers to be invested in each characters hardships and happiness. Perhaps the greatest success that Love Actually can boast is the expert use of the multiple storyline structure to bring more than one kind of relationship to the forefront of this romantic comedy. Liam Neeson portrays a recently widowed stepdad, coming to terms with the loss of his wife while learning to care for his love-lorn stepson; Laura Linney plays a lonely ex-pat, unable to invest in her own romantic life because her responsibilities to her mentally ill brother; Bill Nighy demonstrates the love a washed up rockstar has for his manager and his constant and only companion throughout his career; Andrew Lincoln, who plays Mark, shows us the bittersweet side of an unrequited love with his best friend's wife. All these relationships--father to son, sister to brother, friend to friend, and lover to almost lover--come together to create a beautiful collage of varying human relationships. Of course more typical love interested are also included with Colin Firth's cross-cultural relationship with his portuguese employee or Prime Minister Hugh Grant's love for a member of his household staff. However, the inclusion of these varying types of love all echo the very opening lines of this movie, that \"love actually is all around\" in the form of \"fathers and sons, mothers and daughters, husbands and wives, boyfriends, girlfriends [and] old friends\". Love Actually is truly a tribute to the human experience, as it honors all the different forms that love comes in. It's easy to categorize Love Actually as an overdone, overly sugary and cliched film, but this would ignore all the complications that the movie tackles. The heartbreak, sadness, unrequitedness, and grief that inevitably come with loving--with being so invested in another human--are not only included, but heavily considered through out this film. Emma Thompson, a dedicated friend and devoted mother and wife, discover that her husband, Alan Rickman, has gifted another woman jewelry for Christmas. The scene that ensues is impossible to forget as she stands in the bedroom she shares with said husband, her children and husband just on the other side of the wall. The scene is so touching and so evocative because her dilemma is so clear; she's been betrayed but as she stands in the home that she's built with her husband, with the family they share together, she cannot let go of their life together. She still loves and it's because she loves that she was able to be so broken. Laura Linney's character, mentioned above, is perhaps an even sadder tale. She sacrifices her love for her coworker Carl, for the love and wellbeing of her mentally ill brother. Love Actually is full of moments, like Laura's stuggle between her own interest and her brothers, or Emma Thompson disillusionment with her marriage, that grapple with real problems, real emotions and real struggles. Death, infidelity, mental illness, sexual harassment in the workplace and unrequited love are all serious issues dealt with in Love Actually that one would not typically associate with a movie that markets itself as \"the ultimate romantic comedy\". However, despite these darker issues, a talented cast manages to create comedic moments even in the face of more serious issues. Of course, there also moments purely created for comedic effect, seemlessly woven in as a result of the multiple storyline structure. Rowan Atkinson's cameo as a store clerk allows for a lighthearted break from heavier material while the sex-driven Colin's search for love in America also provides comedic moments. So many ensemble cast films fall flat in their execution despite being littered with classic tropes and ample star power. Love Actually avoids this failing by making use of a talented cast, evocative emotional scenes, comedic relief and the multiple story line structure that highlights all the kinds of love that exist."
    },
    {
      "rating": "8",
      "text": "Love Actually can be accused of being self-indulgent and sometimes overly quaint which can work against it being funny. The film lacks enough character development while it’s rarely as amusing as it thinks it is yet the actors, the character situations and the good spiritedness of the whole thing somehow defuses those problems. The positives in this case outweigh the negatives. The sheer epic quality of the film along with its goodhearted message of love conquering over hate, Craig Armstrong’s music while delivering some genuinely well written stories means it’s pretty easy to see why Richard Curtis debut film is shown every Christmas. The fact this movie has struck a chord with so many people means that ‘love actually’ in the grand scheme of things ultimately does matter."
    },
    {
      "rating": "7",
      "text": "Watching this movie was like eating comfort food in the middle of winter when it's cold outside.... it warms you up!"
    },
    {
      "rating": "2",
      "text": "I feel like I've been pranked and that someone switched out a movie with this poor attempt at emotional manipulation.A tale of cuckolding, betrayal, abuse of power, poor parenting, and much more. This film is just chock full of terrible people doing immoral things with some music and cheesy lines to try and make you feel happy (or sad to contrast the happy).As a rom-com it fails. As a Xmas movie it fails. If you really want to try enjoy watching it, go in making fun of it."
    },
    {
      "rating": "10",
      "text": "A Christmas movie our family watches at least once a year. Great interconnectedness between stories, and a great lot of fun!"
    },
    {
      "rating": "10",
      "text": "Love Actually is a collection of stories about how these people either fell in love or how sometimes love cannot always be. However, at the end of the day, love always wins and nothing can stop it, even if you speak different languages.Love has no barrier and if you want it you need to go get it, and sometimes that might mean travelling across the world to meet the love of your life. Imagine a film which combines all of the best romance films into one and you have Love Actually. Almost every story in this could be made into its own film as each one is as unique as the other, having their own meaning and emotions. The viewer gets to see every angle, from love across the globe, love you can't get and love you need to go fight for.One of my favourite aspects of the film is the use of music with the scenes. The music is made to be perfect for the emotion, giving me goosebumps. I also just loved every story that is told throughout and that's because of the meaning that each relationship holds, and what it means to the viewer.Love Actually... is all around."
    },
    {
      "rating": "1",
      "text": "Why this movie was liked by so many people.. only because if synchronised with Christmas time??"
    },
    {
      "rating": "10",
      "text": "Realistic stories about the wonderful thing that keeps life worth living...Love!"
    },
    {
      "rating": "4",
      "text": "Cheesy to the point of being unbearable. Bad casting along with some creepy scenes and characters don't help either."
    },
    {
      "rating": "7",
      "text": "THE GOOD: With a witty script and a great cast, Love Actually is a respectable romantic comedy. Good performances and soundtrack. Hugh Grant, Emma Thompson and Bill Nighy take the cake.THE BAD: Way too cheesy and on the nose. I find subtle romances much more appealing. Some of the subplots are simply bad."
    },
    {
      "rating": "10",
      "text": "Fantastic film. There is much more to Love than the romantic love alone and this film stays with you"
    },
    {
      "rating": "8",
      "text": "I didn't think I'd enjoy this film as much as I did! I loved the stories involving Daniel, Sam, Joanna and Carol as well as David and Natalie. I liked how everything tired together in the end and that it made sense. They've tried to recreate this film numerous times with films like Valentines Day, New Years Eve, ect but this film does the formula the best. I could have done without the fat shaming though!"
    }
  ]
}