{
  "id": 2060,
  "title": "Love and Monsters",
  "starring": [
    "Dylan O'Brien",
    "Jessica Henwick"
  ],
  "runtime": 109,
  "genre": [
    "Comedy",
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "Seven years since the Monsterpocalypse began, Joel Dawson has been living underground in order to survive. But after reconnecting over radio with his high school girlfriend Aimee, Joel decides to venture out to reunite with her, despite all the dangerous monsters that stand in his way.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/r4Lm1XKP0VsTgHX4LG4syAwYA2I.jpg",
  "categories": {
    "plot": 6.392857142857143,
    "acting": 6.15625,
    "ending": 7.769230769230769,
    "soundtrack": 8.0,
    "cinematography": 6.0,
    "familyFriendly": 6.0,
    "funny": 8.454545454545455,
    "action": 7.1
  },
  "reviews": [
    {
      "rating": "3",
      "text": "If you're someone who can't stand watching characters think and behave like idiots, then you won't like this movie at all. That's my biggest gripe. The main character here is just written so brick stupid he becomes un-relatable. I guess that's intentional, part of the charm. I just didn't buy into it. It's the type of movie that under a few different writers, a different director and maybe different casting could have been a real jem. Instead it's a token b movie."
    },
    {
      "rating": "9",
      "text": "This movie was super entertaining and has plenty of heart. The main protagonist is very entertaining with his charismatic and humorous attitude. Loved it. And would love a sequel."
    },
    {
      "rating": "6",
      "text": "For what it's worth, it was fun.Completely forgettable, of course, but if you're just looking for entertainment that demands nothing more than turning off your brain and having fun, then I can say that this is a pretty good option.I say this because I saw it with zero expectations and did not end up disappointed or bored."
    },
    {
      "rating": "9",
      "text": "Awesome movie. Different from all the other end of world and zombie movies. Definitely worth the $20!"
    },
    {
      "rating": "8",
      "text": "Honestly loved it.  I feel bad they didn’t get a widespread theatrical release for this, it has what it takes to be a sleeper hit.  Entertaining, bit scary, and tons of heart.  Has all the makings of the start to a series"
    },
    {
      "rating": "8",
      "text": "Love and Monsters was good, a fun take on the apocalypse, with not a small part cribbed from zombieland, but lighter and funnier, it has an overture for a sequel that I hope they make"
    },
    {
      "rating": "10",
      "text": "Funny, good characters, nice gigantic monsters, nice story. I had fun watching it and ask for nothing more, except a sequel."
    },
    {
      "rating": "3",
      "text": "The world was aesthetically interesting, but the story was fairly generic and uninteresting. The main characters infatuation with some girl he dated 7 years ago is just your standard Hollywood trope of being in love. When he grows up a bit and see's how stupid it is, he still gets the girl anyway."
    },
    {
      "rating": "10",
      "text": "If your into the end of the world movies that has suspense and humor  this ones a great watch. I would highly  recommend this movieTo all. Definitely can see a possible sequel!!!"
    },
    {
      "rating": "7",
      "text": "Pretty generic post apocalyptic fare but the beating heart of love that clearly went into this project shines through anything mediocre. Definitely worth your attention!"
    },
    {
      "rating": "8",
      "text": "It's always a real treat when a film from which one might not expect much turns out to be a pleasant surprise, and so it is with this charming, fun, entertaining sci-fi/teen romance/comedy/road trip tale set against the challenges of a crushing but comical monsterpocalypse. When a global catastrophe causes animals, insects and other forms of wildlife to mutate into monsters, surviving humans are forced into underground bunkers to stay alive. But that becomes tiresome over time, as a bored, geeky, lonesome twenty-something discovers out when separated from his girlfriend for years, prompting him to take a chance and go in search of her, despite the perils. What ensues is an evolutionary saga that's reflected in more than just the creatures of nature. Though occasionally somewhat predictable, the film is nevertheless filled with many delightful plot twists and developments that are augmented by colorful supporting characters (some of them human, some not), genuinely laugh-out-loud humor and even a few touching moments that are truly heartfelt but without ever becoming sappy. Then there are the picture's superb visual effects, which very deservedly earned an Oscar nomination for their clever, inventive, eye-popping designs. While \"Love and Monsters\" may not have a particularly compelling title, it has much to offer in terms entertainment value and engaging insights, even for younger viewers, qualities that are often hard to come by in fare aimed at such audiences. And, even though this one has been quietly flying below the radar for a while, director Michael Matthews' second feature outing deserves wider attention than it has been getting in light of everything it has going for it."
    },
    {
      "rating": "8",
      "text": "As long as you do not ask what the writer(s) were on when they came up with the end of the world, the rest of the movie is great.  The CG and physical effects are seamless, the world building is great, and the ending is hilarious.  This is clearly being set up to be a new franchise, and this is a great start."
    },
    {
      "rating": "7",
      "text": "I liked the adventure part of it and it was an interesting movie, even though it lacked in being memorable enough and the end of the movie felt a bit predictable etc. But it was entertaining and if you want adventure with a bit of comedy and bit of romantic I suggest it to you"
    },
    {
      "rating": "10",
      "text": "Was really surprised at how good this movie was. Visuals were fantastic and the storyline was refreshing."
    },
    {
      "rating": "10",
      "text": "Really entertaining! It’s hard nowadays to watch a good fantasy movie, but Love and Monster doesn’t disappoint"
    },
    {
      "rating": "10",
      "text": "Fun movie and very rewatchable. Very simple storytelling and very relatable. It has up and downs, and a few scenes really hit you hard. The movie takes its serious moments serious, not any of that use of unnecessary jokes in serious moments to ruin it... like other movies do. Just gonna say, that robot scene hits you hard, man."
    },
    {
      "rating": "7",
      "text": "Cinematic comfort food that delivers. Fun creature designs, well animated. A witty script hanging on a conventional but well constructed plot that doesn't care about making sense and connects the dots between setup and payoff. A pleasant diversion with heart and style."
    },
    {
      "rating": "10",
      "text": "This movie felt like a victory for everyone who's ever had a loved one who can't seem to conquer the thing holding them back. Whether it's depression, anxiety, or addiction, many of us have had to watch someone we care about ruin or waste their own lives because of a cycle they can't break.Joel feels unloved and unlovable. He was experiencing one of the happiest and most hopeful moments when his world literally ended. In his mind, his failure to bond with and pair off with anyone in his bunker is evidence of his lack of value. Honestly, he's a bit like an incel in his thinking. He immediately projects any potential future happiness on a few brief conversations with his newly found, but long hunted-for girlfriend, Aimee. Setting off without proper preparations, he needs immediate rescuing by Boy, a dog who is so desperately lonely for company that he follows Joel, dragging his own sad baggage with him. Meeting Clyde and Minnow, two other survivors who bear the scars of their own losses behind masks with varying degrees of fragility. Joel learns some skills for coping with his anxiety which is necessary because he ends up being the one who has to save Boy after he separated from Minnow and Clyde. He saves himself and Boy again but has a falling out with his friend due to his friend's own weakness nearly costing them everything.When he does meet up with the object of his projected love, he is very surprised that she's got better things to do than validate his newfound skill at just dealing with the stuff she's been dealing with for years. Unlike him, she spent her time moving forward while he remained stuck in the worst moment of his life.Joel struggles with disbelief and self-doubt as he examines his reason for this quest, but a quick reminder that there's no place like home opens his eye to the idea that he could actually take an active role in making other people's lives better.Like many people who are unaware of how they're really seen by others, he responds to the world around him by drawing a fictional version of it, and experiences it like he believes he's the protagonist of an epic adventure. Joel eventually lets go of the narrative of a world that revolves around him, and realizes that there are other people who have their own problems in the world, and that he might be able to help them. His discovery comes right before the most meta moment in an already self-aware monster movie. Joel realizes that the plot of every other post-apocalyptic movie has been transplanted into his movie. He seems disgusted by the cliche far more than the actions of the villains, which perfectly suits the tone of the movie, but could have easily fallen flat with a 'Good till the last twenty minutes when they tried to shove in some more action'. I think one of the gifts of this movie was its casting. With the exception of Joel and perhaps Boy, most of the other characters have limited screen time, but they manage to pack a lot into every moment. A lingering look of pain when Joel is given a goodbye hug from a bunker-mate who recently lost someone only to have a much later flashback showing the movie's first casualty, along with other bunker-mates dragging a nearly catatonic Joel to safety when he is paralyzed by fear and disbelief. Minnow and Clyde carry their loneliness and losses with them and their pain behind masks of varying degrees of fragility.Jessica Henwick is a treat as we see her in flashbacks and the present as a firmly anchored and tough but sweet and kind young woman who becomes a leader on her own due to the fact that she had to.O'Brien wears the screen naturally and excels in this kind of role where his goofy charm, much like in Weird City, is relatable to many people who are just regular guys in an irregular world.I'm not really hoping for a full-length sequel, because I think it said what needed to be said. I can see where people refer to this story line as derivative, but I thought it was far more original then the dozen or so revamps of Batman/Spiderman/Superman etc."
    },
    {
      "rating": "4",
      "text": "I really wanted to like this film, but it just plays it way too safe. Things just pan out a-ok with every conflict. For a catastrophe that wiped out 95% of the human population, the bug encounters are just too few and far between.The world needed a bit more building and characters didn't get a huge amount of development."
    },
    {
      "rating": "3",
      "text": "3 stars is only for the cgi monsters. watched it no choice coz need to find out why it's nominated. conclusion: the quality of the nomination has dropped so much that only Tenet can win. but then 'clash of titans' has equally good cgi monsters but not nominated.the actor was from maze runner. he was quite ok in that series but if u give the actors bad script, this is what u get. very painful movie. almost unnecessary silly. will ferrel is intelligent silly, if u get what i mean.the only character worth watching is the ........ u guessed it....... dog."
    },
    {
      "rating": "10",
      "text": "Alot of emotions went through my head but I loved it.Alot of twists and turns too but its great overall"
    },
    {
      "rating": "3",
      "text": "Super predictable, not a very compelling watch. Simple content. It isn’t an awful watch, the CGI is well done and the acting is passable, but the plot brings the entire production down."
    },
    {
      "rating": "5",
      "text": "Creativity 14/25humor 10/25action 12/25general 14/25TOTAL:50/100get boring in some sections."
    },
    {
      "rating": "6",
      "text": "In this movie’s post-apocalyptic world, small woodland creatures are now gigantic and lethal. Most humans exist in bunkers. Dylan O'Brien plays one guy who decides to venture onto the surface so he can reconnect with his past girlfriend. This leads him on an adventure where he encounters several big creatures and learns his own strengths. There’s a light-hearted approach to the narrative that doesn’t approach funny, but keeps the attitude crisp. O’Brien does a nice job of playing humorously inept, which is good since he’s on camera the entire movie. The monsters are fun, but other than their design, there’s little original. This latest take on the genre is pleasant enough to watch, but offers little new and certainly nothing frightening."
    },
    {
      "rating": "7",
      "text": "Having used rockets to destroy an asteroid that was on a collision course with Earth, the chemical fallout causes cold-blooded animals to mutate into monsters that kill off most 95% of the population. The rest of humanity are forced to reside in underground bunkers just to stay alive.With it’s tongue in cheek approach to life after an apocalypse the best way to describe Love and Monsters is essentially Zombieland with monsters instead of zombies. Thanks to a fun lead performance by Dylan O’Brien, a fast paced script and some great monster effects it is still a pretty entertaining movie in its own right however, and it serves to prove that it is still possible to make these sort of films on a relatively modest budget."
    },
    {
      "rating": "3",
      "text": "This should have been a lot better than it was. The cast does a decent job but the characters are so stereotypical and the movie was incredibly boring at times. It would have been better if it were 90 minutes rather than pushing the 2-hour mark because large chunks of the movie, especially in the second half, were incredibly uneventful and largely just the main character reflecting on things."
    },
    {
      "rating": "9",
      "text": "Better than I expected. The dog deserves Best Supporting Actor from the Academy. I don't care who he's against."
    },
    {
      "rating": "6",
      "text": "I'm in a tough spot, I feel like I was entertained by the dog, Minnow + Clyde, Mav1s, basically everybody else other than the main character, but... How come someone be such a helpless arrogant kid after 7 years into an apocalypse? Also, in what world would you think that someone will be waiting for you after 7 years? I just cannot comprehend.Honestly, watch the first 10 minutes and if you are not frustrated you'll probably like the movie but if you are... things will be the same until 10 minutes before the end.@blacksun hit the nail right in the head."
    },
    {
      "rating": "7",
      "text": "\"Love and Monsters\" starts off as a teen romance interrupted by the apocalypse, but thankfully becomes much more than that and ultimately very entertaining. There is a welcome trend recently in apocalyptic movies (possibly due to the ongoing pandemic) of finding originality vs. defaulting to a zombie plague. Former \"Teen Wolf\" and \"The Maze Runner\" star Dylan O'Brien is an affably geeky guy that stumbles into the hero role. The monster scenes balance decent special effects with fun action. I would have liked to see more of the beginning's \"life in the bunker\" setup as it would likely have given the movie more emotional depth. But overall this is a very enjoyable family-friendly adventure."
    },
    {
      "rating": "8",
      "text": "An overall very nice monster adventure movie. Except for a few missteps along the way, it's an enjoyable watch. The effects are good and the acting is up there too.I'm not gonna spoil anything, but I'd say that the movie looses a bit of momentum towards the last parts. But it's ok, it's not like it's wrapped up in a stupid way. It just sort of ventures into some hard to believe scenarios that kind of messes with the almost perfect pacing of the first 2 thirds of the movie.But, I still enjoyed watching it. And everything does come together in a nice way, however clumsily it got there."
    },
    {
      "rating": "7",
      "text": "A little cheesy with a lot of charm! It's not perfect but an enjoyable film that kept us engaged throughout. The acting was good with some delightful characters and an adorable dog. Scenery, cinematography, and CGI are well done. I thought some of the \"monsters\" were a little corny but it did get nominated for an Oscar in Visual Effects and Best Sci-fi/Fantasy for Critics Choice. The basic story line wasn't anything new but there was some creativity along the way, and the ending was satisfying, but also left the possibility for a sequel. There are definite plot holes, silly scenes, and obviously requires a willing suspension of disbelief... I mean it's sci-fi, where bugs become ginormous in 7 years LOL! It might be a bit intense for younger viewers and there is some mild profanity, but this movie is lots of fun IMHO!! / April 2021"
    },
    {
      "rating": "6",
      "text": "It's ok. A fun take on the heroes' journey with likable characters, solid action and a laid back light-hearted tone.A bit predictable and trope savvy, with one of the worst protagonists-split-up-before-the-climax scenes I've seen in a while, but it's held up by its premise, great monster design and excellent pacing. Nothing groundreaking you haven't seen before, but I was entertained and would happily watch a sequel."
    },
    {
      "rating": "9",
      "text": "This movie was super entertaining and has plenty of heart. The main protagonist is very entertaining with his charismatic and humorous attitude. Loved it. And would love a sequel!"
    },
    {
      "rating": "5",
      "text": "Dans ce monde post-apo où l’homme n’est plus au sommet de la chaîne alimentaire, un gentil gugusse quitte son abri et ses amis pour aller rejoindre sa bien-aimée, bravant les dangers, lui qui n’est qu’un poltron de base ! ça, c’est pour le « Love » et quant aux « Monsters », il s’agit ni plus ni moins que de la faune mutante très agressive et très… vorace !Malgré un budget qu’on sent sensiblement limité, le film est tout à fait convaincant par ses effets spéciaux ; il bénéficie également d’une réalisation sérieuse et les comédiens font ce qu’ils peuvent… mais il hésite beaucoup trop entre la comédie et l’ambiance horrifique et ne sachant sur quel pied danser (et ce, d’un bout à l’autre), il trébuche régulièrement dans l’invraisemblance et l’incrédulité.Pas assez sérieux pour qu’on y croit, pas assez drôle pour qu’on en rigole, le voilà le cul entre deux chaises, une position clairement inconfortable… il passe le temps en tout cas et c’est déjà pas si mal pour ce post-apo… très « bon public » finalement."
    },
    {
      "rating": "8",
      "text": "L&M is a nice fantasy/romantic movie. The story is simple and includes some W. Allen comedy style. The FX are really good. The actors are fun to watch. Even if the main actors are younger, they are really believable. The comedy is subtle and nice. Some elements of horrors spikes here and there, so not for 13 or less. The music is fine. The Mavis encounter was really a great moment into the movie. The movie is doing emotional stuff in a good manner. I give it 82%. I wasn't expecting much from that movie, but it was a great surprise."
    },
    {
      "rating": "8",
      "text": "I really liked & enjoyed this movie.It has some nice emotional attachment involving the main characters.Especially when Mav1s battery is dead & a song plays it was so cool.Dylan O'Brien did decent acting.The monsters are portrayed well.The ending could be a little better though.Highly recommended!"
    },
    {
      "rating": "7",
      "text": "I gotta admit, I thought the premise of this movie sounded utterly stupid, and although Love And Monsters WAS a little far fetched, and although I would've preferred a little more action and a little less love story, I'd still say it's worth a watch. Dylan O'Brien wasn't too hard to look at!!"
    },
    {
      "rating": "8",
      "text": "Cutie Dylan O'Brien of MTV'S Teen Wolf and the Maze Runner franchise stars in this dystopian Horror fantasy. Some time in the future an asteroid heads towards the earth and is blown up but the nuclear fallout ends up mutating all bug and animal life which puts humans at the bottom of the food chain. Joel (O'Brien) discovers that his girlfriend is alive and 85 miles away. So he leaves his colony and makes the trek there fighting monsters and befriending a dog along the way. The movie feels very refreshing in its subject matter and execution. It's got charm, style and a charasmatic, engaging leading man. Although I never fully bought into the romance I loved the live action \"Manga\" feel of the material. It's fun, energetic and feels very much like something new.****/5Eric: ***.75/5"
    },
    {
      "rating": "7",
      "text": "Love and Monsters is a movie where I just watched it because it had \"Monsters\" in the title. I love monster movies and since new movies coming out are rare, I gave it a watch. The premise is simple \"Seven years after the Monsterpocalypse, Joel Dawson (Dylan O'Brien), along with the rest of humanity, has been living underground ever since giant creatures took control of the land. After reconnecting over the radio with his high school girlfriend, Aimee, who is now 80 miles away at a coastal colony, Joel begins to fall for her again. As Joel realizes that there's nothing left for him underground, he decides to venture out to Aimee, despite all the dangerous monsters that stand in his way\". So was this movie a \"monster\" good time or a large-bore?Firstly, the characters are all great. Joel Dawson (Dylan O'Brien) is a very frightened and nervous individual but gradually grows more confident as the movie progress which is done convincingly. Later on, in the movie Joel meets two survivors on the surface, Clyde (Michael Rooker) and Minnow (Ariana Greenblatt), who eventually teach Joel the ropes on surviving. Clyde is the cool teacher and Minnow is the very loveable sidekick. The best addition to this movie is the pet dog \"Boy\" who goes with our main character Joel on his journey. \"Boy\" adds an extra layer to this movie by giving Joel, and the audience, someone to care about on the journey and leads to some intense moments. The director, Michael Matthews, made a great choice in including a companion for Joel as the movie wouldn't have hit the same notes if it was just him. Also, dog companions are great anyway. There are some other characters like Aimee (Jessica Henwick), Joel's goal, and they are all pretty good as well.I do have to give a lot of praise to Dylan O'Brien as he is very charming and charismatic despite playing a kind of nerdy loser type character. He makes Joel seem very relatable and successfully makes us root for him. There are also some surprisingly emotional moments sprinkled in this movie and Dylan's performance is very good, to say the least in making us feel for him. There also some comedic moments and quips from our main character that for the most part land and none of it takes us out from the emotional core of the movie.Let's talk about the monsters, they are great. They all have freaky designs but still, look reminiscent of the animals that they mutated from. The movie only has a few monster moments that appear but it works. Every moment where a monster appears is intense and suspenseful. There is also a great world-building and rules set in the movie that I particularly enjoyed. Not all monsters are the same as each monster have different ways to be dealt with and some monsters who are not as aggressive which was interesting. If I had to give a flaw to the movie then it has to be the predictability and the cliches in the movie. The story isn't anything amazing and you can probably guess all the twist in this movie since it uses so many cliches that you would expect. Right from the first 10 minutes of the movie you can probably guess one of the twists near the end since it feels that incredibly cliche. The third act of this movie is not as good as the first two acts which were focused on the loneliness and struggle of our main character. The last act feels like a completely different movie with its over the top nature that is mostly dumb action rather than intense or suspenseful like the previous action set pieces. Overall, Love and Monster don't do much new but that's okay. In the end, the movie knows what it wants to be which is the growth of Joel on his journey with some monsters and it does that good. The movie has a lot of heart and sincerity that isn't in a lot of movies nowadays. The movie is carried by a great performance from Dylan O'Brien and I hope to see more of him in the future. I had a surprisingly good time with this movie and I believe you will as well."
    },
    {
      "rating": "10",
      "text": "Great movie! It has some action, some charm, some humor, and good  characters. It's a fun movie to watch and a more unique take on the post apocalyptic genre. I was pretty satisfied when it was over."
    },
    {
      "rating": "10",
      "text": "vivement la suite des aventures de ce chanceux accompagné de son fidèle ami boy."
    },
    {
      "rating": "6",
      "text": "Netflix film that feels like a Netflix film, through and through. It is fun, easy to digest with acting that does the trick without offering more. To me, this is the equivalent of an airplane book you nab before taking a long flight or a broken-spine paperback you pick up at a garage sale on a Saturday morning. The world we know and love is gone and is currently filled with monsters or so you find out on the back cover and Hero-guy is on a journey. Yep, a journey. Don't worry, despite the 'originality' he is likeable and offers commentary and expositional asides as he goes on his typical hero's journey. His want: to join up with the love of his former, pre-apocalyptic life (he's getting tired of listening to his good friends boink in their underground bunkers). His need: to become brave and more confident. His friends pshaw him...cue \"you won't survive without us\" chorus but oh, au contraire... on the surface of monster-land, he first befriends a dog that is a perfect prototype of man's best friend (care of the screenwriter): reliable, intelligent, sentimental and all around good soul. Next he meets a quasi father-daughter team who teach him a thing or two about the landscape and what to look out for. So, here he gets lessons in survival skills. Then a robot who keeps him company (don't worry, no post-apocalyptic, digital hanky-panky) and he has his share of growing pains via valiant battles then lo and behold, he meets his love who turns out not to be so much in love with him anymore. She's kind of moved on, bro. But yeah, there is a villain with an Australian accent who at first seems legit (he brews his own beer) but he is too good to be true for Mr. Hero. Turns out, lame, he only wants his giant crab to have food (i.e. people) so said crab will have energy to get him to take the next group of survivors he and his crew can hoodwink. Hero escapes and learns/realizes during battle that the crab is under the dominion of bad Aussie man and blasts the poor crustacean free. Next thing, crab has the revenge vibe and villain and henchmen are gobbled up good and the end is: well, Hero is respected and maybe, he will get 'some' later. But now, time to get people out of bunkers, back on the surface and into the mountains where the monsters don't go. Boom. Book cover closed. The end. Toss it.    Fun and forgettable which is sadly a Netflix norm. But hey, a pizza movie that is light and for a Friday night, why not? Why not, indeed."
    },
    {
      "rating": "10",
      "text": "Surprisingly great movie. No Netflix agenda, great characters, great vibes. Enjoyed it a lot"
    },
    {
      "rating": "9",
      "text": ""
    },
    {
      "rating": "8",
      "text": "Basic story, great CGI monsters that can get you authentically disgusted and nice characters that make just enough to deliver a good movie that you will enjoy watching.Nothing epic, just a good movie that does its job.Definitely worth a watch."
    },
    {
      "rating": "10",
      "text": "What a great movie! Full of action, emotions, adventure, you cry, you laugh, just great!"
    },
    {
      "rating": "10",
      "text": "This is a light-hearted movie and it gives off really good vibes. Don't compare it to other apocalypse and zombie or monster movies because it is kinda different. It is also not predictable as you think, you are gonna be surprised especially in the last half hour ,it will go in a different direction in a very good way. Also it does carry a message and it is not just a pointless fun movie. It is suitable for kids and for family watch, it will be really good if you watch with your family in this quarantine, it will cheer you up and it is really suitable for this time in a good way , give it a shot and you won't regret it.  Besides, who doesn't enjoy watching a movie with Dylan O'Brien in it"
    },
    {
      "rating": "10",
      "text": "I loved every second of the movie. I was a little skeptical of the movie concept and thought it would be a little childish considering the title of the film but it manages to entertain without being too corny or cheesy. It’s just the right amount of light-hearted without being too breezy and I laughed through almost the entire thing. The protagonist, Joel Dawson, potrayed by Dylan O’Brien, is so easy to love and relate to you root for him until the very end.I was very excited to watch another Dylan project and this was worth every second. Check this movie out if you want a good laugh with moments of peculiar depth. You won’t regret it. I certainly don’t."
    },
    {
      "rating": "10",
      "text": "this is one of the best movies i sawlove it.if you did not see give it a try it will surely be good."
    },
    {
      "rating": "10",
      "text": "Really enjoyed it - its a solid, enjoyable, fun movie. The most fun I have had watching netflix in a while. With a fantastic doggy actor!"
    }
  ]
}