{
  "id": 18,
  "title": "Luca",
  "starring": [
    "Jacob Tremblay",
    "Jack Dylan Grazer"
  ],
  "runtime": 95,
  "genre": [
    "Animation",
    "Comedy",
    "Fantasy",
    "Adventure"
  ],
  "description": "Luca and his best friend Alberto experience an unforgettable summer on the Italian Riviera. But all the fun is threatened by a deeply-held secret: they are sea monsters from another world just below the water’s surface.",
  "releaseYear": "2021",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8tABCBpzu3mZbzMB3sRzMEHEvJi.jpg",
  "categories": {
    "plot": 7.149253731343284,
    "acting": 7.2105263157894735,
    "ending": 5.25,
    "soundtrack": 8.4,
    "cinematography": 8.0,
    "familyFriendly": 7.0,
    "funny": 8.8,
    "action": 9.666666666666666
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Fun, colorful, and simple Pixar; not everything has to be Toy Story or Soul."
    },
    {
      "rating": "9",
      "text": "Uma linda história sobre amizade que aquece o coração e uma bela homenagem para a Itália."
    },
    {
      "rating": "10",
      "text": "The thing most people have with this film is that the plot isn't strong enough or the stakes are too low, saying how Pixar is 'losing its touch'. But too be honest, no they're not, they wanted to take a break from the high staked and complex plot driven films. They wanted to create a whimsical story about friendship and acceptance. And the lgbtq+ metaphor is especially appreciated. It's not just about the plot that pixar wanted to take easy, it was the art style too. Instead of having insanely human like detailed characters, like in soul, inside out, raya and the last dragon, and so on and so forth. They instead went with a cute and brightly colored style. Which is only one of the breathtaking things about this film. People are ridiculing this film for what it's not, when they could be judging it for what it is. It's one of the most visually stunning films that Pixar has made, each character had their own life and they're not just some random person who's their to help out Luca. I don't care if this film was made by Pixar, Disney, blue sky's, paramount or any other studio, I'm judging it for what it is and not for what it needs to compare too. In short, I loved everything about this film and I'll be thrilled if they were to make a second release. May it be on Alberto wanting to find his parents, people not being accepting of the fact that they're sea monsters or if it's even about Luca trying to decide if he's in love with Giulia or Alberto. I would still watch it and love it no matter what studio creates it."
    },
    {
      "rating": "10",
      "text": "Amazing movie I’ve watched it twice and have cried both times so heartfelt and loving"
    },
    {
      "rating": "8",
      "text": "Luca is a cute, heart-warming movie that brings an important lesson about friendship. It might not be the best replayable Pixar movie but it gets the job done in bringing a message to kids, there are some flaws, specially in the ending, but still is an entertaining movie for everyone to watch!"
    },
    {
      "rating": "0",
      "text": "I'm reaching the point where I simply hate CGI and rehashed stories with clichés as big as an elephant and filled with PC messages. This movie is nothing more than a tick box corporate exercise."
    },
    {
      "rating": "2",
      "text": "Luca follows the Disney trend of putting a random place in the world, throwing in a generic copy and past plot/characters, and calling it a day. This was very much on par with Raya and the last dragon for me. The cast was fine but the movie was so incredibly basic that it was difficult to watch let alone enjoy it.There was no real effort to make something original and fun. Instead, it was yet another coming-of-age story that hit every familiar trope along the way. Don't bother wasting your time here."
    },
    {
      "rating": "9",
      "text": "It's a very authentic, well-made, well-animated film, and since it was directed by a true Italian, all the cultural references are legitimate. This film can actually teach you a thing or two about Italian culture, and in that sense it is educational. All around great film, Pixar has done it again."
    },
    {
      "rating": "10",
      "text": "I could give this a 9 for the movie overall quality, beautiful colorful animation and story, but it gets a +1 for discussing such important themes such as discovering love as a kid, and this love happening to be so pure and innocent that simply feels natural and believable. It's important to have such representations for kids and give them a better chance to understand themselves, instead of pretending kids fall in love the same way adults do."
    },
    {
      "rating": "10",
      "text": "A love letter from Pixar to Italy, I love it so much. One of the best pixar film ever."
    },
    {
      "rating": "10",
      "text": "Loved the vibe and atmosphere....really really enjoyed it. Thanks Pixar team!"
    },
    {
      "rating": "8",
      "text": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good."
    },
    {
      "rating": "10",
      "text": "By far the best Pixar / Disney I’ve seen in a long time. The friendship story is very well written, the characters beautifully animated, the colours amazing. I feel like watching this movie again already."
    },
    {
      "rating": "9",
      "text": "Film incredibile sopratutto per me che sono di Italia hanno rappresentato bene il portorosso è la relazione tra Luca e Alberto anche se semplice e stata davvero toccante perfino la relazione anche se passa in secondo piano tra il padre di Giulia e Alberto mi è piaciuta parecchio, spero che faranno il seguito perché mi interessa la relazione tra Giulia e Luca e la sua nuova vita."
    },
    {
      "rating": "9",
      "text": "Meandering story aside, this is a fantastic slice-of-life/coming-of-age fantasy that soars because of the strength of the central friendship and theme. I loved Soul, but Luca resonated with me more. There are several excellently directed slapstick comedy moments as well as heart wrenching twists that really pulled me in. I don’t think this will stand tall among talks of Pixar’s absolute masterpieces, but Luca struck a personal enough chord with me that it’s among my favorite of their films. Beautiful and lovely."
    },
    {
      "rating": "8",
      "text": "My favorite part is when the parents threw all the children in the fountain."
    },
    {
      "rating": "9",
      "text": "cute and simple movie, the friendship in the movie is very well carried and to being yourself with everyone else is lovely one of my favorites of pixar"
    },
    {
      "rating": "10",
      "text": "Gorgeous. Powerful. Beautiful. Disney-Pixar's \"Luca\" is a film whose trailers do not do it justice. From mobility to disability to chosen and given family, this film is one that tackles themes more relevant today than ever, all with breathtaking visuals which further immerse you into the story. Despite its juvenile-aimed marketing and simple plot expectations, \"Luca\" is a cinematic masterpiece for all ages. You'll laugh, you'll cry, and you'll leave wishing you were along the coast of Italy with a scoop of gelato in hand."
    },
    {
      "rating": "10",
      "text": "Luca is charming, inspiring, sweet, beautiful, and so much fun, Luca surprisingly overwhelming and touching too, there is not a lot of word to describe Luca except all of that, just watch the film, Luca is simply one of the best Disney Pixar's movie ever, i highly recommended."
    },
    {
      "rating": "9",
      "text": "Bellissimo film d'animazione che ritrae la riviera ligure senza troppi stereotipi, raccontando una toccante storia sull'amicizia e contro i pregiudizi."
    },
    {
      "rating": "7",
      "text": "Loved the animation style here; it truly reminded me of Hayao Miyazaki and Ghibli films. Although Pixar's risky move is welcome, centering the plot around the race was kind of underwhelming. The film feels very childish after watching 'Soul,' but it's nice to see that the studio is taking another step into inclusion."
    },
    {
      "rating": "8",
      "text": "A simple story about friendship with gorgeous animation that will definitely warm your heart."
    },
    {
      "rating": "9",
      "text": "I think Luca was absolutely fantastic.The film features a relatively simple story of friendship, grounded by the overarching narrative of humans vs sea monsters. From beginning to end, the pacing felt right, the music was on point, the comedy shined through the films writing. It was everything I wanted it to be. Luca is set in the Italian Riviera and features jaw-dropping animation throughout its runtime (as we have come to expect from Pixar). The adventure sets off in the world of the sea monsters where we are introduced to Luca and his family. From this moment forward I was hooked. This film has a lot of heart. From the first minute of watching, I was grinning ear to ear. You could argue that this plot has been done to death but I feel like this was a fresh take.This really was a love letter to Italy, and it feels like one of Pixar's movies that I will keep coming back to.9/10"
    },
    {
      "rating": "6",
      "text": "Cute at the moment but ultimately forgettable. Luca is another big step in terms of visuals for Pixar. The movie looks and sounds absolutely phenomenal. This, Soul, and Coco are probably the best looking Pixar films ever. The score is really fun and works well with the film and the sound design is phenomenal. However, I can’t let the animation blind me to the fact that the story and characters are very subpar. Luca and Alberto have good voice actors doing a good job with the material but their character development is thin and generic for a Pixar movie. I don’t remember a whole lot about their characters other than they are fish people. All of the other characters felt one note especially the villain who is awful. The villain has absolutely no development, motivation, or interesting backstory compared to any other Pixar film and it sucks because Pixar has cranked out some fantastic villains. This story feels very generic and has very low stakes. There isn’t anything wrong with a low stakes story but it needs to have a solid story built around it and this doesn’t really have a solid story. Events just kinda happen and they form a story but there isn’t anything deeper than that. It has some good themes of acceptance and belonging but they feel one note and not explored enough. I ultimately found myself getting bored at points which usually doesn’t happen with Pixar. While Luca can excel in its visuals, music, sound design, and voice acting, it ultimately doesn’t have a lot more to offer than that. If you like Pixar then check this out but don’t expect it to be the next Ratatouille."
    },
    {
      "rating": "0",
      "text": "Luca isn't a bad movie but it's really shameful film for a animation studio like pixar . You can't even compare it with soul or coco . It has a really simple story plot and it doesn't have any perfect character . It's really predictable and you can guess what will happen at end . But in other hand the movie has got a perfect quality And it has got a really meaningful message  however it's not a film that pixar can have a proud felling about it."
    },
    {
      "rating": "2",
      "text": "It's really no wonder this was direct to streaming.  This was a Little Mermaid remake the way Pixar does it- about boys, like most of their films.  The character animation and design really look like they would be from a cheap studio, not like a studio who spent millions.  This film will not hold up like timeless Disney films like Bambi.  It is anti-animal (showing the boys killing their friends) and children in the future will see this as a relic of a time that could have been used to save the planet but instead was used to promote the very thing killing our oceans."
    },
    {
      "rating": "3",
      "text": "Looks cute initially, but very boring and predictable story. Picks up towards the end a little, but not by much. It's a mix between Findong Nemo and Cars, set in Italy."
    },
    {
      "rating": "5",
      "text": "Boring and predictable. Adults were falling asleep and the kids were wandering off to do other things by the halfway point."
    },
    {
      "rating": "2",
      "text": "So my expectations for this movie was really high but I was utterly disappointed. The story is really BORING and not engaging at all and feels toooo cliche. The animation was pretty though but still not up to the level of the other animated movie Pixar has made before. If you have a children between the age of 5-8 , they might like the film for its cartoony and colourful animation but older audiences like ages 10+ will not find it good at all. Overall a bottom tier Pixar movie. Don't recommend."
    },
    {
      "rating": "8",
      "text": "Pixar does it again, creating another cute film, this time with the theme of acceptance, regardless of what... species you are. At times it does feel like a \"Little Mermaid\" reboot, but is sweet all the same."
    },
    {
      "rating": "6",
      "text": "+Great art style+Decent voice cast-Average plot-Below average screenplay for a PixarDefinitely enjoyed watching Luca, but really this is a C class Pixar movie at its best."
    },
    {
      "rating": "7",
      "text": "Fun, well animated, well voices and nice music but story rises many questions. Still enjoyable!"
    },
    {
      "rating": "9",
      "text": "Another Pixar hit! Such an amazing story and the visuals are so beautiful like usual. Pixar continues to deliver movie after movie."
    },
    {
      "rating": "8",
      "text": "At this point, I am truly a sucker for any Pixar movie, so of course, I was going to watch Luca. The synopsis is \"Set in a beautiful seaside town on the Italian Riviera, the original animated feature is a coming-of-age story about one young boy experiencing an unforgettable summer filled with gelato, pasta and endless scooter rides. Luca shares these adventures with his newfound best friend, but all the fun is threatened by a deeply-held secret: he is a sea monster from another world just below the water's surface\". So is this another hit from Pixar or an unfortunate 'flop'? Let's get the obvious out the way, Luca is visually stunning. The marine world is gorgeous, but when they are on the surface of the water it looks photorealistic. Additionally, the land is also spectacular and rich in colour, which makes it so pleasant to look at. I also really love the character design for the characters in their land and underwater forms, it isn't as realistic looking as Soul but it has this \"Studio Ghibli\" look to them that makes it very charming. The cinematography in Luca is excellent as well. There are some shots in here that feel like a painting. They manage to capture the joyfulness of the setting and make this sort of realistic land feel completely magical.The music score by Dan Romer is also phenomenal. Dan perfectly captures the hopeful and Italian nature of the setting. The score perfectly elevates every scene and giving it more impact. One memorable score that sticks out is every time our main character Luca starts imagining, the music that happens in these scenes is just wonderful. I also love the chemistry between our 3 main characters. Every time the 3 main leads are together on-screen is the best part because their bonding is just so sweet to watch. This is also thanks to the voice performance of Jacob Tremblay, Jack Dylan Grazer and Emma Berman who do a great Italian accent. I also love the theme that was explored in Luca about friendship, acceptance and openness as it is a great message and it was done very effectively here.However, Luca does play it very safe compared to previous Pixar movies. The plot doesn't have much twist or interesting development and for the most part, is very predictable. This is okay as it is more focused on the friendship between our characters rather than having high stakes in the plot. Although, it does make Luca not as memorable as say Toy Story or UP. I also have a slight issue with the 3rd act as it resolves nearly everything way too easily for my liking. There are also some plot threads that don't get resolved and it does certainly feel like sequel 'bait' a bit which is a little annoying. Overall, Pixar does it again by providing another big hit. Luca is an extremely joyful, fun and pleasant movie to watch that it would be honestly a shame to not watch it. It may not do anything unique but what it does, it does superbly. Luca is a magical experience and I certainly would love to revisit this world in a sequel."
    },
    {
      "rating": "10",
      "text": "LUCA is a pure shot of summer nostalgia with a dash of whimsy and a beautifully well done animated style. Luca and Alberto are two of the best Pixar characters from their modern batch of films and how they develope throughout the movie is endearing. A movie about friendship and breaking out of the mold, LUCA is one of Pixar's most heartwarming stories."
    },
    {
      "rating": "7",
      "text": "I will never forget the first time I saw La Luna with a crowd. The look of the glowing stars scattered in millions and covering the moon left us in awe — like, we literally wowed at the look of them. Was it the first time for our eyes to be graced with the wonder of magical cinematic experience? Definitely not — or at least not for me. But there was a certain tactile sensation the animation in that short evoked in spades like no other. They seemed tangible. I felt like if I stretched my hand I could touch them, and even feel their weight, bolstered by the glass-like sound they make when they are swept up. Luca has no dearth of that quality. Enrico Casarosa's first feature film has an animation reminiscent of that of stop-motion films. Its 3D animation possesses that malleable look that almost could be mistaken for claymation. That brings a sense of vibrancy to the already-vivid idyllic Italian setting. And when you see the tide soaking the beach pebbles and listen to the pitter-patter of the rain, it's guaranteed you'll feel the breeze coming off from all around you with the redolence of childhood summers. I also adored the underwater world. It's nearly as if it exists in a parallel realm that happens to be in the Mediterranean Sea, where fish bleat and crabs bite when they \"sense weakness\". No wonder why its inhabitants consider humans \"Land Monsters\"!Unfortunately, I can't muster up similar praising words when it comes to the story. Sure it's a sweet fish-out-of-water story — I mean, literally — about our titular kid breaking the protective shell built around him by his overprotective parents, while tackling themes of friendship and acceptance. But haven't we had enough of this already. I mean, I'd lose count if I tried to mention how many children-oriented movies that have taken such basis to build their stories upon. The story here hasn't much substance to keep it from dragging. It's definitely a joy watching the trio of under(the)dogs daydreaming about the dream they share of winning the Portorosso Cup and Alberto being the daredevil he is or even bickering with Giulia. Other than that, there's not too much that really happens. Even Luca's antagonist, Ercole Visconti, that garnered plenty of admiration from many people because of how a typical villain in the vein of Toy Story's Sid he is, is nothing more than a bully that no one can stand against.Regardless, there's at least one thematic choice that reinvigorated this traditional fable near its bellissima finale. Without getting into detail, it's something that has to do with doubt in Luca and Alberto's friendship. It's not about it per se — it's nothing new and you can even see that moment coming from a league — but it's the way it ties up how Luca perceives Alberto's quasi-hedonistic view over the course of the story with Luca's fear of destroying the image his parents would like him to present was kind of brilliant. He's striving to satisfy his innate thrill-seeking desire and sense of curiosity while fitting the mould of the \"good boy\". I think that added an extra layer to the character of Luca. Really enjoyed Pixar's latest effort that, small-scale as it is, overflows with wholesome vibes."
    },
    {
      "rating": "7",
      "text": "Welcome back, Streamers! A Disney+ release? Sign me up please! Luca, the new Pixar film, premiered on Disney+. It's a movie about a young sea monster who experiences his first unforgettable summer on land in the Italian Riviera filled with gelato, pasta and endless Vespa and bike rides. We follow Luca as he takes this adventure along with some newly found friends all the while fearing that his aquatic secret would be found out or even worse his parents would catch him. Let's see if Luca is worth the watch.Now, you already know that Pixar and Disney are the kings of movie animation. Luca continues in that tradition. We are transported to the Italian Riviera (as if I've been there and know, smh). The film does a good job of making the audience feel like they are zooming through the streets with the cast and on vacation. My one ding against the movie is that the parts underwater, while limited, were pretty underwhelming and bordering on boring. The creatures and their transformations were cool and seamless, but it just makes sense why they spent so much time on land because the sea is boring! For me, what comes to mind when I say boring... The Little Mermaid. Sorry, I should phrase that better. Luca gives me the pre-teen male equivalent to The Little Mermaid vibes. From the beginning of the flick, when he starts to find human trinkets on the ocean floor, my eyes began to roll back in my head. Then, he gets on water and becomes human with legs. You couldn't imagine my boredom at the storyline. They picked it up from there, not by much but they did. Pixar movies are generally good at telling compelling stories but this one just doesn't seem to be one of them. Maybe it's just such a basic story that we've heard it too much? I think the lack of originality in the plot lessens the execution and beauty of the visual film. The kids are great. The comedic bits are pretty good. I'm looking at you Mom, *Dolphin noise* (you'll get it when you watch the movie). So, while you'll get the feels here and there, I feel something was missing from the heart of this movie compared to a UP, Soul, Inside Out, etc.Overall, Luca is a cute movie and adventure. It feels a bit too much like the boy version of The Little Mermaid without singing but a good story nonetheless. Kids will definitely enjoy this film, but I don't think this is one of Pixar's most compelling works. Turn on Disney+ and enjoy a bowl of popcorn and pesto spaghetti with Luca and Alberto."
    },
    {
      "rating": "8",
      "text": "La particularidad narrativa que tiene 'Luca', a diferencia de otras producciones de Pixar, es que denota mayor énfasis en la amistad de estas criaturas y su aventura hacia un nuevo mundo, sumergido en prejuicios. Preciso, bella animación, tierna historia."
    },
    {
      "rating": "8",
      "text": "This film tells an old tell that was told about a million times in a unique and interesting way... The story is so compelling, touching and interesting that the hour and a half of the movie goes by like nothing!I absolutely loved this movie and I would recommend it to both children and adults!"
    },
    {
      "rating": "7",
      "text": "Una animación preciosa, muy bien llevada, con una historia que abarca muchos temas pero todo dentro de su sencillez, que eso, a pesar de simples, muy muy bien tratados.La conclusión es lo \"mejor\", maravillosa y se pueden sacar muchas deducciones, y eso, aunque la trama no es tan compleja como, por ejemplo, Soul, pero tiene su aquel que la hace súper interesante y divertida, que es lo que prima.Cosas buenas: Muy divertida de ver, la animación más cartoon es preciosa, todo el tema artístico y los detalles que tiene en cada plano.Cosas malas: Es poco arriesgada, no hay un momento en que tambalee el argumento, que sea muy emocionante, sabes en todo momento cómo va a acabar, y puede que peque algo de ritmo fílmico.Conclusión: Te la fumas y bien fumada, hablando claro, lo vas a pasar súper bien, pero en el momento que la pongas en perspectiva con otras películas del mismo estilo, empieza a perder algo, pero es genial en todos sus aspectos."
    },
    {
      "rating": "5",
      "text": "This is a good example of a movie that relies mostly on the nice graphics and lovely place created by the story.  The story is rather uninspiring and a bit commmonplace and really wasn't too well thought out.  Having seen it once I was glad I didn't pay to see it, and wouldn't recommend it to anyone else."
    },
    {
      "rating": "10",
      "text": "I absolutely loved the movie it was very touching heartwarming & inspirational i found the ending really sad but inspiring and I would really recommend watching it I hope their is a second movie because I can't live without knowing if Luca & Alberto will meet again."
    },
    {
      "rating": "10",
      "text": "One of the best Disney movies I have seen. I love the area it takes place and the plot!"
    },
    {
      "rating": "9",
      "text": "Luca is a charming tale of friendship, with the feeling of the last days of summer, when even the smallest task is a beautiful adventure.Luca is a sea creature, who accidentally discovers the land above, in this case the italian Riviera.When on land, he can turn into a regular human. This dual identity is a major motive in the film, as Luca and his friend Alberto (another sea creature) hide their true nature to integrate in the human world.Once they meet human girl Giulia, the trio forms a bond that is threathened by suspect and jealousy.Despite being savvy of where the plot might lead, the writing is so good that the viewer should not mind.Absolutely recommended for people of all ages, with a touching message for kids."
    },
    {
      "rating": "7",
      "text": "Not the next Pixar classic, but a fun and heartfelt movie nonetheless. Definitely watch if you have Disney+."
    },
    {
      "rating": "8",
      "text": "It borrows a lot of animation DNA from Studio Ghibli.  It borrows the facial  animation style of the Ardman Studio (Wallace & Grommet); yet, it's all used to build engaging, nuanced characters.  This leads to a much more heartfelt third act pay-off than I expected. Also wonderful are the color renders of the fish people and the town. 10/10 on the animation. For those concerned, it's much less gay-friendly and more fairy-tale-ish for which I was grateful."
    },
    {
      "rating": "9",
      "text": "Pixar's Luca unfolds like an animated and magnetic adult fantasy with lots of farce, fun and joy, heartwarming and inescapable family consequences, there is no doubt that the temptation of visual effects, whether humorous or sub-textual, is dazzling. Luca is a film imbued with a sentimental affection for the Italian environment and its quaint, bountiful and breathless villages scattered around its shores, as Pixar Animation Studios does so well, the added angst of improving its ability to achieve data while remaining faithful and enjoying the ability of a united family is a fantastic and welcome storyline and Pixar's fairy tale mud sun whirlwind, reverberating sound recording and the sweet lessons of acceptance distinction take a short passport. It wouldn't be Pixar's best or riskiest film to date, however, Luca is one of the few who thinks he's not afraid to be something else. Luca is the smallest movie created by Pixar, however, he's arguably one of the best in the studio. Pixar's Luca is fun, refreshing, and well-animated. Luca is a beautiful illustration of Italy, even animated! The script isn't powerful enough or the stakes high enough, but a film that is still smart, however, could be much higher. One of the most breathtaking movies Pixar has ever created. Each character has his or her own life, and it's not just a random character who is there to help Luca. I could still watch it and it excites me despite this study, right? There is food and parfaits, fountains and a bicycle, ugly mustaches and even the starry sky. I found myself on the verge of tears in the last moments of this excellent and disarming film."
    },
    {
      "rating": "6",
      "text": "Because of this movie, it has been mentioned that there are two Pixars.The studio with the excellent quality that has produced incredible animated classics, and the one that hardly does enough to please the public.But I don't see it that way.I know that I have to admit that there are better movies from the studio, and there are ones that could be considered are coming from a lesser Pixar.But are you coming to tell me that Pixar has ever made a bad movie? ****Luca is perhaps one of their simplest stories ever, and probably their most rudimentary film since Cars 3.This more than anything because like that trilogy, Luca is more focused on a child audience, and their true great stories are more universal.Even so, this is a story about friendship that unfolds in a very good way, especially since it's not trying to be more than what it's showing.I'm not fooling myself, nor do I fool people by telling them it's a great movie, far from it, but can't say it's bad either.I know people will hardly be talking about in a few weeks, and of course it will not appear in the most prominent of its catalog, but even so, it's not a disposable option. It's more like an optional pick from their repertoire.Pixar decided not to risk anything, and therefore we see the super basic results.The colors and visual splendor are present and I liked them, but there's not a great story, not the same soul, nor the same enthusiasm.Luca is content to be just competent and ordinary. Nothing else."
    },
    {
      "rating": "10",
      "text": "Real and fantastic, show us the true essence of friendship, a very moving message"
    },
    {
      "rating": "10",
      "text": "Luca was a very cute, sweet, and funny movie with a very cool nostalgic feeling. The animation was exceptional; very visually beautiful and stunning, the water especially was just gorgeous and so well done. The writing was superb, loved the sweetness and simplicity of just a solid story about friendship and the themes of friendship, loving yourself, and not judging people based on their appearance were very well done. Jack Dylan Grazer and Jacob Tremblay's performances and chemistry were outstanding. Also the music was lovely. One of my favorite animated movies I've ever seen."
    }
  ],
  "recommendations": [
    "the_book_of_life",
    "kubo_and_the_two_strings",
    "klaus",
    "finding_nemo",
    "wolfwalkers",
    "onward",
    "your_name",
    "the_iron_giant",
    "soul",
    "over_the_moon",
    "the_polar_express",
    "moana",
    "raya_and_the_last_dragon",
    "cinderella",
    "brave",
    "how_to_train_your_dragon_2",
    "song_of_the_sea",
    "the_good_dinosaur",
    "the_incredibles",
    "ratatouille",
    "the_princess_and_the_frog",
    "spirit_stallion_of_the_cimarron",
    "the_little_prince",
    "toy_story_3",
    "atlantis_the_lost_empire"
  ]
}