{"id": 624, "title": "Lucy", "starring": ["Scarlett Johansson", "Morgan Freeman"], "runtime": 89, "genre": ["Action", "Science Fiction"], "description": "A woman, accidentally caught in a dark deal, turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dhjyfcwEoW6jJ4Q7DpZTp6E58GA.jpg", "categories": {"plot": 5.206896551724138, "acting": 5.0, "ending": 4.363636363636363, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.625, "action": 6.0}, "reviews": [{"rating": "10", "text": "I thought the movie was great. It had a spiritual message that provoked one to thought. I love action movies and this film does give lots of action; however, typically action movies don't offer any depth to the storyline. \"Lucy,\" does provide depth and need for thought and I left contemplating its message. It reminded me a bit of the Matrix. The message was a labyrinth of possibilities."}, {"rating": "1", "text": "Pushing aside the laughable \"science\", the film fails to entertain. Scarlett Johansson is so bad in this, that it's no longer surprising when her performance contains no emotion or actual acting. The character is beyond unconnectable, and sometimes unlike able. The story is lame, the action is kind of lame, and overall the project is just boring."}, {"rating": "2", "text": "Really bad movie. Scarlets worst movie. It's like a Matrix wannabe but is tiresome and predicable. Yes there is action but it is all the same and you are just thinking ok I get it get on with it already."}, {"rating": "7", "text": "Scarlett Johansson's acting ability is impressive.  Morgan Freeman delivers exposition as beautifully as expected.  The movie was at times fun to watch.  And I'm happy the people writing screenplays are currently fascinated with transcending human limitations through science (although in this case the black market designer drug variety of science).  I wish the people in charge of allocating government research funding in real life were half as fascinated.  Unfortunately that bunch seems more interested in the type of research that makes things (and people) blow up.  Not that this movie didn't have plenty of that.  Not that I mind when it's a movie.  Here ends my praise for Lucy, here begins the snark and spoilers.  Don't say you weren't warned!  The movie starts falling apart around the time drugs turn Lucy's eyes a CGI shade of blue.  Then it manages to recapture my interest during a police standoff in which Lucy meets her ever-after-to-be-bewildered love interest.  But only Robert Heinlein could have created a terser 'boy meets girl, well that's all settled then' sequence.  Immediately after she kisses him so he'll keep following her around like a bewildered collie dog, a car chase ensues.  It lacks all suspense because Lucy is behind the wheel and obviously isn't going to wreck (wreck herself, anyway, she manages to ruin the day and increase car insurance rates for plenty of innocent bystanders).  Here the dialogue really rubs logic the wrong way when Lucy proclaims that no one ever really dies, even as she races with obvious urgency and aforementioned vehicular carnage to extend her own life, apparently in order to share what she has learned with the rest of humanity.  But really, what's the rush, won't it all come around again or something mystically eternal like that?  The movie then collects itself a final time for an ending I found superficially profound.  Until I thought about what the message is in the context of the movie itself.  The plot wraps up with Lucy's voiceover, “Life was given to us a billion years ago. Now you know what you can do with it.”  Okay, who doesn't want to control time and everything else?  (Shut up, yes you do.  You just don't want anyone to think you're a control freak.  You'd jump at the chance.)  But what steps is this movie suggesting we take in order to attain such lofty post-human heights, exactly?  Step 1:  Have a shady boyfriend encourage you to drink lots of alcohol, distract you from your studies, and get you mixed up with ruthless drug dealers before he gets himself killed.  Step 2:  When circumstances permit, arrange to become an unwilling drug mule for the ruthless drug dealers, get groped by one, and make sure he slaps you around a bit so as to accidentally release a lot of designer drugs into your system.  Now you should have some transcendent power flowing through your veins, so move on to Step 3:  With those powers you can straighten everything out (except road safety in France) by first gaining control over yourself, then getting control over other people (shut up, you know you want to make your mother-in-law river-dance on the Thanksgiving Turkey this year), then getting control over pretty much everything, and finally take control over time itself.  At which point you can go directly to Step 4: turn yourself into an organic super computer, then go back in time and have a chat with one of humanity's furry predecessors, or at least lock eyes and touch pointer fingers E.T.-style with one.  But when you return to the present there's still violence, blood, gore, and ignorant humanity, so you pass along what you've learned while your new, cleaner-cut (at least as far as the standards of French police goes) boyfriend kills some guy who was about to shoot you in the back of the head while you were time-surfing.  Proving that you sure didn't change anything with that whole time travel trip.  Which step was that one again?  Sorry, I lost track.  But I guess maybe we can pretend that step made sense because maybe the time-line branched off when Lucy met anthropology Lucy (yes, that Lucy) and in some other branch of time humanity evolved into something much more decent?  Whatever.  On to the Final Step:  Text message your new love interest to let him know you are everywhere.  Very stalkerish.  Don't worry, he won't mind.  In fact, judging by his expression, it seemed to clear some things up for the poor befuddled fellow.  Or at least cheer him up."}, {"rating": "9", "text": "Really great Movie with a really Great Plot.\r What's good:\r-People speak their Native language (Korean, Chinese, German, French,...) (subtitles are available)\r-Really good Cinematics\r-Really good Effects\r What's not so good:\r-Many Facts are really wrong. For example: Studies show that People do not use 10% of their Brain. The whole Plot is based around this wrong thesis."}, {"rating": "8", "text": "The old \"we only use 10% of our brains\" thing has become widely talked about, especially as of late. Writer and director Luc Besson takes that scientific theory/urban myth and creates a wildly entertaining action sci-fi movie. While things get quite absurd it never breaks the bounds of reality anymore than other sci-fi movie has, so I really don't get the complaints surrounding that.\r At least in this movie is in on it. There are quite a few nods to the audience that say Besson knows just how out there this whole thing is. It leads to some humor injected to the mix. The action is solid, but don't expect it to be a non-stop thing. The real treat comes from the impressive visual effects and Johansson's performance. As the character becomes less human Johansson becomes more interesting and fantastic.\r Watching \"Lucy\" flick through periods of time like she's swiping an iphone is an incredible treat to behold. The visual effects are marvelously done and as they get more intricate the more fun you'll have with this film. It's sci-fi at it's most fun. O\r This is one that takes the absurdity of it's premise and runs fully with it. Because of that certain elements of the plot can feel disjointed. For instance outside of one key plot-point surrounding Freeman's character, the supporting cast feels useless. However that never stopped me from enjoying it. Don't let the fact that's it's a science-fiction movie turn you away. There's a little something here for everyone.\r I give \"Lucy\" an 8.4/10."}, {"rating": "0", "text": "The plot doesn't make any sense, the characters are pointless and the conflicts are contrived to an insane level.\r Everything seems as by the numbers as you can get, Asian mobsters, the old trick of having them not speak English so their lines don't sound cliche and stupid, the main character is an ultra super bad ass so guys are ok with her plus this regular girl is also ultra super beautiful in a scarlet johansen way and not a chick in a Michael Bay movie way so women can be cool with her too and LOOK AT THOSE RED BOTTOM SHOES... LOVE THEM YOU SEALS.. LOVE THEM, THESE SHOES CAN FEED AN AFRICAN VILLAGE FOR A MONTH BUT WHO CARES THEY ARE AWESOME GO BUY BUY BUY... Sorry, just should it was funny that they make a point to show her shoes a few times.  I imagine her other stuff is expensive too but I don't know.\r Its a really dumb movie that pretends its not which hurts it because the nonsense really pulls you out of the story."}, {"rating": "8", "text": "Lucy is a high-intensity science fiction spectacle with strong, realistic characters that endure great development through the story. The concept and script are excellently written with sublime special effects and visuals. The film lacks the typical action associated with Luc Besson's writing but with the lack of action benefits the strength of the sci-fi concept. However, the story is shown in such an interesting and dynamic way that it doesn't waste the only measurement worth anything: time."}, {"rating": "8", "text": "Scarlett Johansson is brilliant and magnetic in this fast passed, intriguing and entertaining Sci Fi action thriller that's very well directed by Luc Besson. It's at times very violent and crazy but still very entertaining with some great action set pieces and the supporting players are also very good, especially Morgan Freeman. Some of the visuals are also very interesting and I think that this film is well worth the time spent watching it."}, {"rating": "8", "text": "It's a good movie with good action scenes. Yes the science behind the plot is all wrong but it's a movie, and when has Hollywood ever gotten science or history correct in there films. So if you can not take everything so serious then you should enjoy this film. It's surely not gonna win film of the year but it's certainly is and entertaining 90 minutes."}, {"rating": "8", "text": "Life was given to us a billion years ago, now you know what to do with it. A Young woman whose brain has become powerful enough to have access to every information of this universe, the approach of the movie is one that gives us the access to the dearth of human life and its marshalling. A mind boggling, mind- expanding, exhilarating thriller. Scarlett Johansson in the movie has acted gracefully, beautifully and in the unique expansion as is given to her in her deserving role of superwoman from an indie-film icon and Marvel-universe sidekick, netting unity to the infinity of the concept. Although the concept was a recalcitrant one, the philosophy is the one that says more than the fantastic concept of using your brain to its maximum capacity. The fast pacing movie is one to be watched with an open view, and not with the circumspection of finding logic in it. By and Large, a fantasy that will get you challenged with grand notion that with great power comes genetic transformation and a baffling imaginary to support this pseudoscience."}, {"rating": "8", "text": "Despite an instantly unlikable character in the lead role (Lucy) this movie dazzles with intelligence, dark humor and a fierce attack on the current limitations of humankind. Everyone has heard that people use only 10-15% of their brain-power and \"Lucy\" takes that concept to a satisfying extreme. With allusions to witchcraft, near-death-experience and LSD, the script/direction/acting/effects encompass nearly everything a viewer could expect from the concept. (Lucy being the name of the oldest female human skeleton found on Earth is quite funny, in that Lucy in the film starts out at 7% capacity.) Like in the movie \"Her,\" Johansson wraps her mind around artificial intelligence and manages to exude a cool congeniality while becoming superhuman. Sadly, Morgan Freeman as a professor of neuroscience (parodied in Scary Movie 5?) seems more like an afterthought than anything integral to the plot.﻿"}, {"rating": "8", "text": "Scarlett Johansson's and Morgan Freeman's performances were fantastic, the special effects were exhilarating, and the plot was intriguing and handled effectively. The only con that knocked my rating down a couple pegs was the lack of characterization."}, {"rating": "8", "text": "The hypothesis of what would happen if the human brain worked 100% works well, with no other pretensions than to entertain, for an action movie according to the French method. It is true that it is hyperactive or exaggerated but it is well worth a large bag of popcorn. Let's be fair: in someone else's hands this would have been a brainless grotesque."}, {"rating": "9", "text": "This is an excellent movie for the initiated.  I could relate tremendously with the psychological profile of Lucy.  Her strive for knowledge was detaching her away from humanity.   The questionable actions she made throughout the movie explained the accelerated extent of her detachment from humanity as well... the random cut scenes in her mind were a bit annoying but exactly how some people use their imagination in critical moments."}, {"rating": "3", "text": "Despite knowing the premise of the movie was and is completely based on pseudoscience instead of any scientific facts, I went to see it in a theatre just because I just wanted to have fun and feel entertained by the action. It was a waste of money. The action is very poor by 2014 standards. There are some weird, National Geographic or Animal Planet films/cuts placed into the movie, which probably meant something for the mind of the director. Okay, I get it, an approaching wild cat to its prey... but come on, what have you had to be that high, dude? It doesn't even look funny. Save your money if you haven't seen it in a cinema - it's only good for renting when you are hopeless and alone at home."}, {"rating": "4", "text": "Some parts of the beginning had potential. Then, it just became implausible, absurd and pretty much just escalated too quickly. So in the end, 'Lucy' became a god? I thought it was trying to send a message that we don't use our brains enough but alrighty then. The last straw was when she injected herself with the 'drugs' and this black, tree-like thing started growing out of her. That part really hit me and realized I was not going to leave happy. When she started travelling through space and time made me laugh a bit. In the end, it seemed like the director collaborated with M. Night Shyamalan on acid. But yeah, I'll give it a 4 for effort and for the actors."}, {"rating": "3", "text": "One day a struggling screenwriter took some mushrooms, and while watching The Shawshank Redemption, started a script about a girl who takes the blue meth from breaking bad and it turns her into an emotionless  metaphysical superhero.\r The result was Lucy.\r Its not very good."}, {"rating": "2", "text": "There's nothing that could go wrong in a movie that didn't in this one. Lucy is not only a silly stereotype blockbuster action sci-fi movie. It surprises you on different levels about how bad can a blockbuster be. The silliness of its science and the fact that the director tries to convince you that the bogus you're watching is actually based on science, while it obviously is not, can be really frustrating, while maybe if the film didn't pretend to be scientific, smart or philosophic, it could be at least a fun-to-watch straight-forward bit-em-up action film. The only good thing about the movie is Johansson's performance as the title role. But othe than that, the silliness of the science, the randomness of the events, the inhuman nature of the movie, the pretentious unoriginal nonsense philosophy in the film, and the poor structured underdeveloped script that limits Lucy's human relationship to the one with a cop that we don't even know, all these wrongs go wrong-er with every minute that passes until the end of the film. with the last surprise \"K.O.ing\" you in the end:  \"Written and directed by Luc Besson\". So if you really are a sci-fi fan, or a fan of smart blockbusters, or even like simple kick-ass beat-em-up action films that don't pretend to be more, you'll come out of the cinema wondering why the heck did you have to watch this ****"}, {"rating": "8", "text": "I'm just gonna cut right to the chase.\r Is this movie based on science fact?\r LOL. No. But it at least tries to tie into it.\r This movie is right up the same vein as Kill Bill or Pacific Rim.\r It's live-action anime.\r Sit back, and enjoy the show.\r SPOILERS:\r It's re-imagining of Metropolis"}, {"rating": "3", "text": "Some cool visuals, other than that not much good to say. The main character, Lucy, basically becomes a god and if it wasn't for the fact that there wouldn't be much of a story or a movie if she actually dealt with all the challenges they faced head-on (which she definitely could have done) she probably would have if this were real. I dislike the false science about the brain, but I know it couldn't be helped because that false science is the foundation upon which the entire movie stands.\r As an aside, before I learned about what this movie was about, I honestly thought this was a live-action take on the anime show Lucy, which it has some similarities to."}, {"rating": "6", "text": "The premise is good, but the movie would have really benefited if the writing was tightened up and if it was more grounded in reality and actual science. The visuals and acting were strong though, Scarlett Johansson's performance was especially good despite her character was written somewhat poorly and flat for most of the movie. I felt this movie could have been terrific with better writing and execution."}, {"rating": "5", "text": "No reason or rhyme slows down this movie that has Scarlett Johanson overdose on a new synthetic drug that boosts the usage of her brain above that of the ordinary human and thus unlocks untold superhero powers and a personality change to boot: Scarlett goes from an interesting trashy lady to  boring cold calculating **** in a matter of minutes.\r But it is all for nothing because Scarlett knows somehow that she has only 24 hours before her body will fall apart or something. So what she needs is the rest of the drug to boost her brain power to 100 %.\rI am still unsure what her purpose really was. Did she hope to gain the knowledge to save herself or was her aim to gain knowledge for humanity? Who knows. The movie doesn't linger too much on explaining things. Or it isn't made for creatures that only use 12% of their brain capacity..\r A French cop obliges to help her out, while a Japanese drugslord makes matter difficult. It doesn't make much sense. We even get to see a large scale battle between the cops and the gangsters that has the criminals gain the upper hand despite the police being forewarned by Scarlett and thus should have been able to lever the power of the French state against the scum. I would have laughed at this for being silly nonsense, if it wasn't for the fact that nowadays that might even possible. At present the state seems more able to cow their citizens into obedience than stopping terrorists from harming people, which is after all a primary function of the state.\r There isn't much more to say really. Engaging dialog? Nope. Intriguing characters one can identify with? Forget it. A larger than life opponent? Not at all. A deep meaningful exploration of the concept? Ba-boom!  But worst of all. No explanation of the motivation of the characters is given.\r This movie has a script that contains an interesting idea and filled in the remaining blanks with action scenes. Even the action scenes themselves are senseless as they are disconnected. Scarlett's powers change from scene to scene depending on what looks awesome.. At one point the movie becomes pretty awkward because after killing all his minions, Scarlett lets the bad druglord live. The only conceivable reason is that he had to reappear again in the rest of the movie. That is a pretty bad level of writing..\rIt gets a 5 for being meh.\r Oh, it has also Morgan Freeman in it. He is there to illustrate things to the people who use far less than their allotted 12 percent. Totally superfluous."}, {"rating": "6", "text": "Lucy feeds on its original premise with silly thrills overshadowing it's complex intentions. Scarlets Johansson does her finest but when there is no character the audiencte can relate to + a weird premise = it's those fun thrills that remain in the mind after leaving the cinema."}, {"rating": "6", "text": "This is a science fiction, so don't expect any reality. It has a very original story and great acting. I don't know why everyone is so critical, it just lost focus near the end but overall, it's definitely worth seeing."}, {"rating": "3", "text": "The concept behind the film is very interesting. However it is not developed so much during the film. There is definitely something missing. Scarlett it's not the best actress choice for this film."}, {"rating": "8", "text": "I found this movie a good excuse to get an entertainment time...that´s all..You can´t asking more of the film. However I will googling a while to find out if the scientific facts they talk about in the movie could have a bit of truth.\rEncontré esta película una buena excusa para entretenerme un rato... eso es todo.. no se le puede pedir más al filme. Sin embargo, voy a googlear un rato para averiguar si los hechos científicos que hablan en la película podría tener un poco de verdad."}, {"rating": "6", "text": "Lucy is a sci-fi action film. It uses quite a lot of CGI which makes the watcher feel like the things they're seeing are real. I would say that this movie focuses more on the science than the fiction. The beginning stars of like most normal action movie, but then over time it turns more scientific whiteout you even realising it.the cast was good (e.g scarlet johanson and Morgan freeman) therefore the acting was good! It is watchable, and it isn't boring, but it does focus a lot on evolution so it feels almost educational in a way. Don't be out of by the way i said it feels educational, because it sandwiched between violence. Overall it is a fun watch."}, {"rating": "0", "text": "Análisis rápido: Lucy es una película que no llega ni a mediocre, se queda en intento de cine.\rAnálisis largo: Lucy es un insulto a mi inteligencia, plantea un argumento que trata de ser inteligente porque de vez en cuando muestra alguna que otra metáfora visual y en otro momento una crítica \"express\" al capitalismo y la sociedad en una frase de Morgan Freeman.\rScarlett Johansson realiza un papel mediocre interpretando a la protagonista de la película, un personaje vacío, mal construido y que sinceramente al llegar al final de la película me importa su vida lo mismo que en el minuto 00:00.\rEn esta película es mala hasta la banda sonora, las escenas de acción son ordinarias, sabes que son de acción por las explosiones.\rEl argumento está mal hecho y es un intento de plantear una trama inteligente.\rUna de las peores películas que he visto nunca."}, {"rating": "7", "text": "Lucy is utterly bonkers and sometimes cheesey, but Scarlet Johansson's charisma and Luc Besson's stylish direction make it an enjoyable action-thriller despite its flaws. I will say that certain viewers are likely to be annoyed by the implausibility of the plot, but viewers looking for a purely entertaining ride should be satisfied. The action is pretty solid, as are the performances and visuals. Johansson makes for a strong leading lady, and the movie does have pretty interesting themes about how the fabric of reality could be altered as we develop. Overall, silliness aside, Lucy rises on the strength of its star and stylishness to become a wildly entertaining ride with plenty of fun. 7/10."}, {"rating": "0", "text": "I honestly do not comprehend why some people give this piece of utter trash a positive score. What a stupid world we live in. I came in to watch with no expectations, which is great because I would've been beyond disappointed. Anyone who has any shred of dignity regarding their intelligence and who knows even basic science would know that this is laughable at best. Yes, it is a sci-fi film, but when you try to add in a few myths and stupid folkloric conspiracies about science and biology and try to make it work to make your film somewhat 'believable', or to make a bit of sense at the very least, you need to do your research properly. This way you just insult audience members above the toddler mentality, and there are toddlers smarter than this.Full of inconsistencies, plot holes, actual storyline that explains a solid motivation behind the main characters, this was a movie I wish I hadn't spent time of my life watching. At first it kind of felt like a rip-off of 'Limitless', which I was actually entertained by back in the day, but then it veered into **** territory, and the ending was etremely stupid, I don't care what those pseudo-intelectuals slash soul hippies slash wannabe scientist say. So the pinacle of the brain cpacity is to turn yourself into a **** computer, violating however-many physics laws without even a grain of sensibility.Honestly, don't even bother."}, {"rating": "9", "text": "More than just an action-adventure flick, this is a mind-bending story that reminds us of what we already know to be true about the transitory, illusionary, energetic nature of all things.  Go with an open mind and leave with it opened even further."}, {"rating": "7", "text": "It's ambitious, strange, moronic, cerebral, and propulsive fun all at once.  The effects can be cheesy at some points, but other times they can actually be really cool.  At least they're all used creatively.  It's almost impossible to really label this movie.  It's so strange that I can see why a lot of the critics are polarized.  There are a few thought provoking ideas here, even if the movie lacks the impact and believable logic to truly reach its full potential.  But to be honest, how often do summer movies have any ideas at all?  It's definitely the most unique action movie of the summer, even if it's not the best.  I'd say to go see it.  Just don't expect something on the levels of The Matrix or Inception."}, {"rating": "8", "text": "I liked the story and I liked the subject matter.  I though that Scarlett did a great job in a difficult situation making it seem like she \"was\" using all of her brain.  I wish the movie wouldve been at least 30 mins longer to make it a 2 hour movie.  Its like they cut it to make it more of a summer blockbuster movie.  So i hope the video has an \"uncut\" version.  The movie touches on some Hawking time issues and even imaginary time issues."}, {"rating": "8", "text": "Lucy feels a bit short and under explained. Never the less, Scarlett Johansson is iconic and stars in one of the coolest, smartest action movies of the summer."}, {"rating": "0", "text": "Please, please, even if you think the lush Ms Johannsen poops rainbows, if you are a thinking person with more than a passing interest in logic and coherent storytelling, think twice before spending time on this film. This film has a fascinating premise which is then totally subjugated into a chase'em/shoot 'em movie. All the action sequences are borderline ridiculous, the final gun fight, the manic drive across Paris... why? And those of us who bought in to the idea and (the first third, despite cliched stock shots is quite promising) are deprived of any meaningful, or even better than fantastical, discussion of the core theme. Rubbish. Just rubbish."}, {"rating": "7", "text": "Lucy is an unusual film. What starts out as routine superhero stuff diverts into something much stranger and unique. It's an acquired taste that feels least satisfying in the traditional areas (super-power battle sequences, for example) and most satisfying in it's delving into evolution, science and religion. Lucy is one of those films destined to become a cult classic in the future."}, {"rating": "7", "text": "What happens when one can access the human mind to one's fullest extent? Luc Besson's \"Lucy\", despite its obvious plot holes and ridiculous ex machines, does show its own creative answer to the question as the film does manage to be a smart, ingenuous, and action-packed as it shows."}, {"rating": "7", "text": "Just leave any and all expectations at the door and you will enjoy this one. Tries to create a new type in its world building but that comes with mixed reviews. Freeman gives a lecture staggered in bits through the movie to give us simple minded folks a few ideas on what Lucy was doing other than just hallucinating or thinking about National Geographic shorts. I think Scarlet gives a better performance in the movie \"Her\" which has a similar plot just not as much pseudo-fu as this flick. This movie just left me with one question in the end. Was that memory stick USB3.0 or USB2.0? If it was 2.0 then it would take a whole lot longer to copy his files. :)"}, {"rating": "7", "text": "Weird - that's the word describing a movie most. The idea of movie is intriguing, but its realization is ... strange. I don't want to say it is bad, it is actually quite good, just strange. Movie looked like to me very short and unfinished. I really thought there should be something after \"I am everywhere.\" She is everywhere, right ... so what? I feel like movie didn't tell what its main point - looks kinda unfinished. But I don't agree with those low ratings. 7-8 from my point of view, but not 5."}, {"rating": "7", "text": "\"Lucy\" is the first secular, sci-fantasy, international Western I've seen. The \"black hats\" are one dimensional, Asian villians; the \"white hat,\" Scarlett Johansson, is a literal bombshell, who finds her moral compass in her expanding frontal lobe. This is Johannsson's movie to win or lose as she plays a steroidal game of \"Beat the Clock.\" with criminal minds and a cocktail of mind-blowing chemicals. It's plot is like a blend of the \"Gang that Couldn't Shoot Straight\" and \"Contact,\" but Johannsson is convincing, the action fun and the outcome mysteriously begs a better sequel. Should get an Oscar nod for special effects and applause for it's simian anti-drug message."}, {"rating": "7", "text": "Lucy aims to entertain cinema-goers with SFX. Don't take any of it seriously. It's a SCIENCE FICTION. There's an element of fiction at play here. You'll leave the cinema dumber for believing any of it. However, the visual experience makes up for all of it. Entertaining and worth viewing on a mammoth screen."}, {"rating": "8", "text": "_the beautiful Scarlet once again embraces us with her action skills! Lucy brings me back to BBC's Earth and the formation of our Planet. The car chase scene was one of the best considering it was never seen before."}, {"rating": "8", "text": "Since it is based on pseudo-scientific concept (humans use less than 10% of their brains), it qualifies as pseudo-science-fiction. However, overall, great entertainment ... as long as you try not to use more than 10% of your brain."}, {"rating": "7", "text": "The best thing about futuristic, sci-fi is when it shows us truly mind-blowing concepts and visuals. In this case, that's literally what happens. Scarlett Johansson plays a woman who accidentally ingests a substance that enables her to use increasingly large portions of her brain's ability. This gives her powers that allow her to control the world around her. The film is full of cool ideas that are illuminated with strong special effects. Johansson is up to the challenges of super skills, both mentally and physically. Writer/director Luc Besson has added his signature action (that crazy car chase) to give the visuals even more of an impact. A fun trip!"}, {"rating": "7", "text": "-\ta somewhat sci-fi thriller that depicts the origin of life.\rYou could say it starts off as a bit of a joke. Or just a really bad version of a 007 wanna-be-badass replica. Even Johannson’s acting starts off like a joke; literally, she seems to be laughing more than crying herself through the first ten minutes of the film.\rHowever, Lucy transcends with every passing minute – as if the quality of the film and it’s acting were corresponding to the percentage of brain capacity that the protagonist female-gone-super-human android is using.\rIt is one of those films, whose idea clearly surpasses cinematographic capabilities - time, space, gravity, and the origin of cells that build life and our reality - it is one of those films, that you watch skeptically, but are patient and open to giving it a chance. You watch, learn and enjoy, but after that start are all the while still deciding whether this is total guff, whether you have been ripped off at the theatre counter, and served quantum-physics starters-pack drivel with some Scarlett glitter on top to cover it up?\rAbout midway through, I decided to give it a chance. A real chance. A chance at blowing me away and taking my mind to places unexplored, allowing my brain synapses to dance and go wild, tying together all my theories about life with what I was learning whilst fixing my eyes upon the screen. It worked.\rThe key is, to see film as art. To take what you can get from it. Not to critizise (and believe me there was a lot of moaning and dis-missing going on in the seats around me) but to make the most of it. Yes you CAN.\rOnce this happens (and there have been a lot of films where it just doesnt happen, let me just say ‘The Counsellor’) you are free to go and experience that wonderful world of time, intelligence and purpose of life that is Lucy. Maybe I am an optimist who was fed cyborg-bullcrap and went off on it – maybe I fell in love with the idea of being- and playing Scarlett’s part, but in any case, I am glad to have seen this film, as it let me exit that cinema with sharpened senses and let me glide into the night feeling alive, thursting for knowledge, finding life intelligent and beautiful. Each step was beautiful."}, {"rating": "8", "text": "It's an entertaining movie and interesting idea. Nearing the end when i was expecting a bizarre scene, suddenly just 'poof'. A complete let down at the end, but a happy ending one i guess. It still a good movie to watch on the big screen."}, {"rating": "7", "text": "Lucy is a pretty cool action flick with a heavy dose of intelligent writing.   Whether backed by real facts or, assuming, made up ones- it doesn't really matter as the ride is a consistently interesting one that feels like a really juicer primer for a (hoped for) sequel.  Morgan Freeman is solid as the reassuring center to the spinning, frightening reality in which Lucy is thrust."}, {"rating": "9", "text": "Great popcorn flick, moves fast, and it \"makes you think\". This material would work even better as a 10-episode tv mini-series with each episode advancing her mental capabilities by 10% and depicting her new abilities. Yeh, that would be righteous."}, {"rating": "3", "text": "The movie starts really good, but to the end it gets just laughable. They shot to long and transformed it into a holy awakening movie towards the end. The superpowers Lucy gets, get more and more ridicolous when she turns smarter and stronger. SPOILER : Why should a human be able to use telekinesis and travel in time because they got 10x smarter than before ? SPOILER END. They should have stopped in the middle of the film and just go on with the plot from there, but the movie transforms to a comedy from there..."}], "recommendations": ["elysium", "limitless", "colossal", "sunshine", "annihilation", "chaos_walking", "the_tomorrow_war", "arrival", "surrogates", "chappie", "source_code", "what_happened_to_monday", "interstellar", "code_8", "captive_state", "repo_men", "downsizing", "nerve", "jupiter_ascending", "guns_akimbo", "anon", "children_of_men", "mortal_engines", "they_live", "the_girl_with_all_the_gifts"]}