{
  "id": 3801,
  "title": "Luther",
  "starring": [
    "Joseph Fiennes",
    "Jonathan Firth"
  ],
  "runtime": 123,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "During the early 16th Century idealistic German monk Martin Luther, disgusted by the materialism in the church, begins the dialogue that will lead to the Protestant Reformation.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5Z3wlA8sKdd3tPTZW8N1q3YEd5f.jpg",
  "categories": {
    "plot": 1.8571428571428572,
    "acting": 2.8,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "How did anyone even enjoy this crap! First off, it is pretentiously long! It's filled with so much story that's never very clear. The story just jumps place to place and sometimes is confusing to fully understand. Second, the characters! Joseph Fiennes as Luther is fine (I guess) but the other characters are utter crap! Plus, there are characters that aren't shown very well. There in the movie, but there just there. It cuts back to them now and then, but they're just there for appearance. A prefect example, Alfred Molina as John Tetzel! He shows up for like 5-10 mins and you'd think he'd become a main character or a strong supporting character at least! No! He's just gone. Don't know why! That was probably the only part of the movie that I truly liked. This is movie is like going to a bad sermon that never spits the message out clearly. Overall, this is lame!!!!!! It gets an F!!!!!!"
    },
    {
      "rating": "6",
      "text": "Deciding how historically accurate \"Luther\" is is best left to those familiar with the religious and political intrigue in 16th Century Europe. For the rest of us, it is a generally well-told and sometimes even absorbing tale. Sir Peter Ustinov easily manages to steal all of his scenes; the same cannot be said for Joseph Fiennes. We have to take the script's word that Martin Luther was such an influential man because nothing in Fiennes' performance remotely suggests it."
    },
    {
      "rating": "10",
      "text": "A wonderful depiction with only minor historical inaccuracies. A movie every Christian should watch."
    },
    {
      "rating": "6",
      "text": "Based on the quality of Luther, it sadly doesn't reach the expectations of my personal discussions with society. It has a fine tone and starts out clueless, though eventually builds up momentum and suspense after gathering a substantial amount of information, that gets to the point of overload, and blasts with a finale that finishes with a breathtaking conclusion. It's a great churchgoer motion picture, and relates a lot to Renassaince studies which really overthinks me a bit. Everything is cause and Effect in Luther, it builds up a tremendous amount of character, and then that's the part when you start getting entertained, about 3 quarters way in. Which is the disappointing factor about it. Before all that, you just want a silent nap."
    },
    {
      "rating": "1",
      "text": "Have already rated thos movie and surprise surprise its gone missing. This film is so poor it is a insult to the TV show.Half hacked story a villian to forget and victims no one cares about. Hang up your badge Luther before you get investigated  for fraud mate."
    }
  ],
  "recommendations": [
    "predestination",
    "zero_dark_thirty",
    "the_good_shepherd",
    "sicario_day_of_the_soldado",
    "tinker_tailor_soldier_spy",
    "valkyrie",
    "contagion",
    "hereafter",
    "the_machinist",
    "child_44",
    "annihilation",
    "children_of_men",
    "knives_out",
    "the_gambler",
    "the_counselor",
    "the_king",
    "tenet",
    "argo",
    "what_happened_to_monday",
    "chaos_walking",
    "the_accountant",
    "the_experiment",
    "broken_city",
    "beirut",
    "stillwater"
  ]
}