{
  "id": 777,
  "title": "Machete",
  "starring": [
    "Danny Trejo",
    "Michelle Rodriguez"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Comedy",
    "Thriller"
  ],
  "description": "After being set-up and betrayed by the man who hired him to assassinate a Texas Senator, an ex-Federale launches a brutal rampage of revenge against his former boss.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dcPSm1rGEFdiEc7DaKz0t5kb66b.jpg",
  "categories": {
    "plot": 5.95,
    "acting": 5.2,
    "ending": 5.166666666666667,
    "soundtrack": 8.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.5625,
    "action": 5.548387096774194
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This movie is great. It features great performances from Danny Trejo, Michelle Rodriguez, Jessica Alba, Steven Seagal, Robert De Niro, Jeff Fahey and many others. Many people bad mouthing this movie are forgetting that fact that it's a grindhouse movie. It's meant to be funny and feature over the top gore with ridiculous scenes. My only gripe with this movie is that although there is a good amount of action, It's not near the amount it should have considering it's a grindhouse movie. This is a great all around movie and Robert Rodriguez has stated that he's had this plot in mind way before the whole immigration laws started happening."
    },
    {
      "rating": "7",
      "text": "I love Robert Rodriquez, i find him funny, soulful and a creator in an art that is dwindling just like the music profession. Planet Terror is one of my most favorite movies and the El Mariachi series is crazy for the budget. But i found Machete, while a really cool and fun movie, to lack the heart and attention to detail the other Grindhouse movies oozed. He made it seem so easy the first time that the second had little chance."
    },
    {
      "rating": "9",
      "text": "Machete may not send texts, but he definately can make a brilliant movie. Danny Trejo stars as Machete, who was a cop in Mexico before he got double crossed and Steven Segal decapitated his wife. Three years later, Machete is an illegal immigrant living in Texas, who is then given an opportunity to kill a senator (Robert De Niro) who wants to get rid of all the immigrants. The job then turns out to be a set-up, as the Senator is shot in the leg by his own man and Machete is framed. First things first, this film doesn't attempt to be a heart-warming story or a contendor for the Oscars, all it attempts to be is a Mexploitation film which is full of action, blood and laughs. And in that context, it succeeds. It's about time Danny Trejo got the leading role for a movie, he's 66 and been in over 100 films, yet this is his first leading role in a film. Robert Rodriguez especially rewards him, by having him get in a pool with a naked Lindsey Lohan and her naked onscreen mom. The action in this film may seem a bit over the top, but the great thing is that the film revels in being over the top, it is quite in vein of the old B movies. In one scene he attaches a machine gun to a motorbike and rides it high into the sky, with an explosion behind him, taking down about ten guys at once. In fact, heres a link to that particular scene http://www.youtube.com/watch?v=yF0JCB24Ld8 This film has a wicked sense of humour. In the opening, Machete carries out a naked girl, who then stabs him with his own machete and then calls the bad guys. I know what you're thinking, \"The girls naked, where does she get a cell phone from?\". Think about it with a dirty mind. Yeah, from there. During a fight in the hospital, Machete stabs an enemy, then pulls out his intestine and escapes out a window. This film also boasts what I call the funniest bodyguards I have seen in a film so far. Machete, to enter a villians mansion, grabs a load of gardening equipment and poses as a gardener, the guards let him in. One guard then remarks \"You ever noticed how you let a Mexican into your house just because he's got gardening tools? No questions asked, you just let him right in. Could have a chainsaw. You know, a machete...\". They then realise what he's said, and have their asses handed to them by Machete. Later the guards (still alive) talk about how people are fine with Mexicans working for them, yet not with letting them live in this country, and when Machete returns, one guard just proclaims \"I quit!\" and hands Machete his gun, making the smart choice and walking out alive. I would happily return for \"Machete Kills\" and \"Machete Kills Again\""
    },
    {
      "rating": "7",
      "text": "The situation in the movie is a conspiracy of capitalists and political hardliners against Mexican immigration. Unfortunately, the showdown is too dumb and therefore disappoints greater expectations. However, the movie is fast-paced and holds some hilarious moments. Worth watching."
    },
    {
      "rating": "6",
      "text": "funny is the word.   serious is the tone.  and very little action i didn't expect that.   this movie is toned down by political overtones.  its okay.   but it will grow on you in the near future.   Machete was a hero and legend.   Lindsay lohan gets naked YEAH!!!!!!!!!!!"
    },
    {
      "rating": "4",
      "text": "The acting is so bad that it's laughable and trust me, I laughed many times. Trejo is the only decent part of the cast, Mainly because he doesn't have much in terms of dialogue. The gory action is entertaining to watch but Machete is still quite possibly the stupidest movie of all time."
    },
    {
      "rating": "6",
      "text": "This feels like two films in one. The first being the portions seen in the 'Grindhouse' trailer; explosions, sex, violence. The second a weak inner conflict between a man and his past. While this could have been good, its only so-so."
    },
    {
      "rating": "5",
      "text": "Great fun, and after a strong start, I thought I was in for a treat, but it slowly went downhill. There's only so much tongue in cheek I can take before it grates on me, and not even the last action scene can make up for that. A few other issues and plot holes throughout, so it doesn't surpass an average solid action film for me."
    },
    {
      "rating": "6",
      "text": "Machete is dumb, but fun. Its unrelenting balancing act of being weird and sticking to a B-Grindhouse-movie structure threw me for a loop, but I can see why a lot of people love this movie. It's certainly unforgettable."
    },
    {
      "rating": "8",
      "text": "You either enjoy this genre-splicing homage to 70s black exploitation movies or you don't.  The movie is fun, tongue-in-cheek, violent and campy.  It has a somewhat forced political message, one with which I agree.  White liberals might say that it is racist, but my best friend (who is Mexican) was dying with laughter, as every conceivable Mexican culture stereotype is thrown into this movie in some way.  Jessica Alba is still beautiful and still is, at best, a mediocre actress.  Danny Trejo and Michelle Rodriguez are perfect.  Bobby D is great as a race baiting, hypocritical Republican politician.  This is not high brow film making.  But it is fun.  If you liked Grindhouse then you will like this, if not then this is not the movie for you."
    },
    {
      "rating": "9",
      "text": "\"Machete\" Loaded with strange humor and gratuitous violence, Rodriguez knows what his fans want. There may not be much substance here, but the film's attitude doesn't have time for sense. Likable enough characters and good performances are throughout the film...recommended"
    },
    {
      "rating": "6",
      "text": "Ken Loach is not Mexican; Loach, the politically-minded filmmaker who made \"Bread and Roses\"(the 2000 message movie about a janitors' strike, largely comprised of transplanted Mexicans in the U.S.) is a Brit. Being an outsider, Loach was saddled with the obligation of depicting a race in the best possible light, so as a result, the well-intentioned \"Bread and Roses\", at times, suffocates on its own earnestness, which is, the most common malady that plagues any didacticist film. Also, there was the matter of the old conundrum that any socio-political film faces(most prominently featured in Alan Parker's \"Mississippi Burning\"), since the intermingling of differing racial heritages is contingent on a political objective, can't help but be hierarchical, in which a white hero(Adrien Brody as the union organizer) becomes the focal point of the story. The importance of the janitors is signified by its savior. Ken Loach wouldn't be able to get away with making a film like \"Machete\"; he doesn't have the blood to be irreverent about the state of Mexicans in the U.S. But just because a filmmaker has the license to go pop with a hot button topic such as illegal immigration like a grindhouse cineaste, instead of a social realist, should he? Can a scene where Lindsay Lohan totes a machine gun while donning a nun's habit co-exist with a more sobering one in which a pregnant border crosser is gunned down by an INS agent without leaving a bad taste in your mouth? Like any exploitation movie, can the politics of \"Machete\" survive the onslaught of cheap thrills, enabling the message to go down like disguised medicine? That's debatable; that's up to you. But keep this in mind: despite the high quotient of graphic violence and gratuitious nudity, the hero is no gringo; he's brown, albeit with bad skin, and worse teeth. In \"Machete\", \"wetbacks\" are doin' it for themselves. Machete(Danny Trejo) echoes Malcolm X's words(from the 1992 Spike Lee film about the slain Nation of Islam leader) when he tells a white kid(adopted by Mexican parents, played by Daryl Sabara) that there's nothing he can do for them. Like the white FBI agents in \"Mississippi Burning\"(Gene Hackman and Willem Dafoe), one of Michael's guards sees the injustice of the new immigration laws, yet his conscience never translates into traitorous behavior. He doesn't join the revolution. When Machete needs help, it's his own people(the \"network\", organized by \"She\", played by Michelle Rodriguez) who come to the vigilante's aid; the invisible people in uniforms, the service people who need Adrien Brody to mobilize them in \"Bread and Roses\"."
    },
    {
      "rating": "5",
      "text": "A brainless, testesterone-driven, blood-splattering, limb-flying, bullet-blazing action flick that never stops entertaining - \"Machete\" bows down to the male chauvinist, and deepens its insecurity, painting the perception of what a man is suppose to be. The character sleeps with countless, beautiful women, kills anyone and everyone with impeccable precision, and an aura as tough as nails. What \"Machete\" delivers in presentation and overall entertainment, it lacks in instances where no action is taking place, or what other movies call \"DIALOGUE.\" Now, I understand the casting of a guy like Trejo, but when you are put into the lead role, you have to \"SAY\" more than ten words. In the various cutscene transitions, the audience is forced to just pause.....and look at a character who looks like he has been to hell and back more than a few times. This one-dimensionality in acting or the lack of is just not enough to earn high praise. In addition to the vow of silence of Trejo's supposed \"tough\" guy character is the inconsistency of his capabilities. For instance, on numerous occassions he asks for help to work a cell-phone, but despite this, is able to load files onto a computer. Overall, the incessant, half-baked, over-the-top, violent carnage \"Machete\" brings is merely another Hollywood attempt to stimulate its lazy, dazed, zombie-tranced viewers who aren't interested in paying close attention to detail, but rather to what \"moves\" infront of them on screen. Hollywood has regressed its viewers to such a nadir that a trip to the theater now takes on the resembling act of an infant fixated on the moving carousel above him, watching in awe. If you are planning on taking away something from this film, or looking to stimulate your brain in some sort of way, I advise you to try another alternative. \"Machete\" is complete and utter balderdash - esthetically pleasing to the eyes, and 105 minutes... your brain wish had back."
    },
    {
      "rating": "10",
      "text": "Bloody hell, WTF is this. A brutally awesome, fun, full of blood film (no shi*, this is Rodriguez and that means a flood of blood). I remember watching and enjoying \"Planer Terror\" which was also brutal and genius just like \"Machete\". I could write an essay of 1000 words about this film just describing how good it is but I'll make it short. Epic Masterpiece (\"Bullet97\"), great(convincing) acting, full of action and a dose of humor. If you want to watch this film but you can't make up your mind, trust me you do want to watch this film because you won't regret it."
    },
    {
      "rating": "3",
      "text": "This movie is a caricature sort of like grindhouse series, however, the movie is horrible.  I gave it a 3 because of Alba is worth a 3.  This movie is simply stupid from beginning to end.  The ending is horrible.  I liked Grindhouse, obviously I did not like this but YMMV."
    },
    {
      "rating": "5",
      "text": "Moments of greatness followed by minutes of boredom. -- For some reason, Rodriguez decided that this movie needed tons of exposition to explain a guy who kills people with a Machete. Even Quentin, would admit that this movie talks too damn much.  The random moments of awesome low ball taste are spread apart by slow dialog from actors who aren't even phoning it in.  The wind up between pitches kills what could have been a highlight of the summer.  The action is a bloody version of the A-Team television show and not up to the standards of El Mariachi or Desperado."
    },
    {
      "rating": "6",
      "text": "The B-movie \"Machete\", based on the fake trailer in \"Planet Terror\", gives nothing new but blood and gore. However, \"Machete\", which has a more clear story and objective, is an exception"
    },
    {
      "rating": "10",
      "text": "This movie is frggin awesome!!! Robert Rodriguez delivers yet another epic masterpiece!! The all star cast, including Danny Trejo, Jessica Alba, Michelle Rodriguez, Robert de Niro, and more, is great!! The action is gory, bloody, and awesome!! The script is well written, suspenseful, and sometimes hilarious!! Don't forget the nudity!! You rock, Alba!! Overall, this movie rocks and I recommend it to action fans, Robert Rodriguez fans, guys who are in love with Jessica Alaba, and movie fans in general."
    },
    {
      "rating": "10",
      "text": "I actually wanna give this a 9.5 just because i was counting on it to be more apart of \"grindhouse\" where the initial trailer came from. it did not have the film scratches and stuff that it had. also i was hopin that Tarentino was gonna help out a some, but he ddnt. but i was not dissapointed. IT WAS AWESOME."
    },
    {
      "rating": "1",
      "text": "Big fan of Rodriguez but I had an incredibly difficult time keeping from walking out of this movie.  The story was there but pretty weak and they tried to make up for that with the violence but that even became predictable and ham-handed after the first half hour.  Definitely an all-star cast but please, De Niro, your too good for this.  For that matter, Steven Seagal is too good for this movie.  Don't even get me started on his lousy attempt at an accent.  I'm all about a movie for entertainment's sake if a plot and acting can't be expected but I have to say that Ma-Sh&*ty hits the trifecta on a lack of all three.  Save yourself the effort of seeing this movie by slurring a few cliched tag lines, hitting your head against a wall and stabbing a rump-roast with a carving knife a few times and you pretty much have seen the movie."
    },
    {
      "rating": "5",
      "text": "If you enjoyed Planet Terror at all, then you will have fun with this movie.  I do think it was way cooler and more entertaining as the trailer on Planet Terror, because the actual movie isn't that great.  Planet Terror had ridiculous action and hilarious cheap jokes.  So does Machete, but it adds some crap you don't want like blind support for ILLEGAL immigration.  Of course you expect a movie with the hero being mexican to sponsor ILLEGAL immigration, and to be ridiculous about it, but it goes beyond that to where it gets annoying.  You can tell when something is supposed to be a joke, but whenever they make a comment about how ILLEGAL immigration is good, the tone gets quiet and serious.  Towards the end you start to think \"Wow, do the people involved with this movie actually believe this crap?\"  It was supposed to be a funny action movie about a mexican guy getting revenge, but I felt like a victim of bait and switch with all the political commentary.  This is a pretty cool movie spoiled by somebody's desire to spread a false message."
    },
    {
      "rating": "10",
      "text": "Robert Rodriguez's homage to the exploitation films of the 1970s contains beheading, stabbing, betrayal, a beautiful nude woman who pulls a cellphone from...(well, you'll have to watch it to find out), and Steven Seagal as a villain. And that's before the opening credits!Our hero, Machete (Danny Trejo), has suffered the loss of his wife and daughter at the hands of the evil drug kingpin, Torrez (Seagal). Three years later, our hero, by chance, gets caught up in a whirlwind of lies and deceit, which leads to Machete being framed as the gunman in a plot to assassinate Senator McLaughlin (Robert De Niro). Booth (Jeff Fahey), who has unwittingly hired Machete as the scapegoat, has no idea who he's dealing with. This misfire takes Machete down several roads, all of which lead to his nemesis, Torrez.Along the way we meet the beautiful, and law abiding, Sartana (Jessica Alba), who, as part of the immigration police force, feels as if she's betraying her own kind by tracking down illegal immigrants to be deported. Meanwhile, on the other side of the legal fence, Luz (Michelle Rodriguez, looking sexier than usual), is helping her people make a better life for themselves in the states. With this, we get the underlying pro-illegal-immigration message of the film, which, at times, comes across too preachy. But then again, this happened in some of the exploitation films of the 1970s, so this can, in essence, be chalked up to the films genre without causing an uproar from the audience regardless of their personal stance on the subject.Machete provides a wide variety of colorful characters. To begin with, Danny Trejo is brilliant as Machete, and as a result, we're willing to follow him to the ends of the earth, or to a pool hosting a couple a naked woman. De Niro is great as he channels a likeness of George W. Bush into the despicable Senator McLaughlin who'd just as soon shoot an immigrant as look at them. Jeff Fahey has mastered the deep voiced villain without overselling it (Christian Bale, take note), and Don Johnson's contribution as Lt. Stillman is every bit as despicable and spot on as De Niro's McLaughlin. It's always a pleasure to see Cheech Marin on screen, and his performance as Padr, the priest who knows exactly what to do with two passed out naked women in the back of a hearse, is not something you'll soon forget (they even manage to sneak in a weed joke). Even Tom Savini makes an appearance, it's like a mini From Dusk Till Dawn (1996) reunion.This might be all good a well, but what about Lindsey Lohan? She holds her own here, and looks good doing it, although her part doesn't require a lot of her (she's a heroin addict who spends most of her time naked, I'm not going to take the cheap shots, but you can), she still brings something worthwhile and entertaining to each of her scenes.Machete shares similarities with Rodriguez's 2007 grindhouse outing Planet Terror, including the worn-print-shown-at-drive-ins look. The babysitting twins return, only this time as hot twin nurses, and one of my favorite characters is back, Dr. Felix (Felix Sabates), who, just like in Planet Terror, is all too eager to discuss the more graphic aspects of his chosen career with a smile on his face and a skip in his step.If Rodriguez made a promise to entertain with the original faux-trailer for Machete in 2007, in 2010 he's returned to collect on that promise, and he delivers, with blood, sweat, and breasts."
    },
    {
      "rating": "10",
      "text": "When you see \"Introducing Don Johnson\" in the titles, you know you're in for fun! The film harks back to director Robert Rodriguez's early style (a la \"El Mariachi\"): jammed cuts, hard action and ironic humor. Danny Trejo plays a renegade lawman who slices his way through the bad buys with all manner of blades. There's a plot, but it's more about enjoying the sharply-crafted filmmaking. The grindhouse style is plenty violent, but the flashes of fun and great characters make it completely cool. How often do you see Lindsay Lohan in a nun's habit, shooting one of our greatest actors?"
    },
    {
      "rating": "10",
      "text": "very  funny and entertaining ,very violent  but done in a really good way  nice to see oldies like steven segall and don johnson getting employment again"
    },
    {
      "rating": "3",
      "text": "Trailer was great , but the movie is garbage. This is not funny , action scenes are very bad directed and poorly executed , actors wasted and all that in the name of Grindhouse fell. My ass. Planet Terror which was also a dissapointment and a proff that Rodriguez carrer met a dead end is better than this. John Fahey is the only bright spot and maybe Jessica Alba , here and there plays well a police inspector in this mess of a plot. One more inetersting thing here is that as much as they call this a Grindhouse style film , with all the brutal action and gore , there is very litlle nudity and some soft sex (when its not going in fade out). One more proff that this whole Grindhouse concept is fake and just excuse for poorly done movies with weak scripts in the name of cool. If you are into grindhouse and older exploitation action ,horror and crime movies digg for the real classics and avioid this. However , people who are not so much into cinema and go to movie theaters here and there could find this entertaining , for all it's cheap action , wanna be splatter and very bad humor. All the others , that are looking for quality action go and watch Predators. That movie is at least trying to be something."
    },
    {
      "rating": "3",
      "text": "This movie is some sort of a gimmick and a (strange) kind of tribute to the westerns of the 60s and the B-movies from those days. It didn't work for me. The exaggerated violence and blood is boring and given that the movie is build on this and some chicks in short skirts, it is not worth losing 2 hours of your life for. Bad, really bad stuff."
    },
    {
      "rating": "2",
      "text": "Rodriguez's worst movie. Piece of crap that had to be packed with celebrities to get butts in the seats. Who cares if it's an amazing cast if the script and dialogue are crap?The Jessica Alba almost nude scene is doctored also...she was wearing a bikini and they just erased it on the computer after they shot it. Bad. Bad. Bad."
    },
    {
      "rating": "0",
      "text": "What a pile of sh*t.  First film I walked out of since Catwoman.  Rodriguez needs to learn how to direct.  the infamous \"it's a homage to 60s films\" crud only goes so far."
    },
    {
      "rating": "0",
      "text": "This is not a movie, don't bother or waste your time. No story, has scenes that copy Desperado, and has no trace of realism whatsoever. I do realize we are watching a movie in the end, and the point of it is to be entertaining, but it should be realistic to some extent! Steven Segal has yet again proven to be one of the worst actors of all time, coupled with a great Robert DeNiro who I would ask \"what were you thinking\" when he chose this movie. In the end, I understand that people may like the movie for the action and just endless killing, but I personally think that its 2010, I just couldn't understand how Danny Trejo would use someone's guts to rappel down a building into the floor right under him.."
    },
    {
      "rating": "10",
      "text": "prettty beastly see it its pretty sweet. it was beaastly dont miss it it is the crap. see it today for only 4.99.987.7955555558.6887.6788768.3454566556"
    },
    {
      "rating": "0",
      "text": "Well, there is an hour of my life I'll never get back. I can't believe the quality of actors this movie contains and to turn out a B or even a C movie.What a disappointment"
    },
    {
      "rating": "3",
      "text": "I expected this movie to be filled with gratuitous violence and campy humor.  In fact that is why I rented it. I thought it would be fun. What I did not expect was for it to be this bad.   The violence is frequent but the humor is few and far between.  It's also a very divisive movie, filled with egregious stereotypes of all races.  It seemed like it was intentionally designed to fan the flames of the illegal immigrant firestorm. They threw some big name stars in the mix to make it appealing, I guess, but their roles are terrible.  Lohan is just there to be nude. Alba is there to be cute.  Deniro must just be there because the wrote him a big check.  I can't recommend this film, in fact I suggest you avoid it."
    },
    {
      "rating": "0",
      "text": "While I like actor that played Machete, this movie was probably one of the worst movies I have ever seen.  It is just sad that there are some people that feel the need to pump this movie up because of the political statement that it makes.  Especially when the statement it makes is flat out false.  That is absolutely pathetic.  The acting was poor, the story was poor, but I hope to see the actor that played Machete in more movies in the future.  Hopefully something with a better story and much better acting."
    },
    {
      "rating": "10",
      "text": "I reviewed the second Machete, so I thought I would review the first one, because I thought it deserved it. :) Machete is the first Danny Trejo balls out action flick that was directed by Robert Rodriquez and Ethan Manquiz. The story is not the best out there but enjoyable. And you get to see Robert De Niro! Danny trejo is awesome as Machete, he was funny and ass kicking at the same time. This movie was packed with suspense, powerful performances and cheesy twists and gore! Watch it and you'll be entertained throughout."
    },
    {
      "rating": "10",
      "text": "I actually give this movie a 9.5 but I rounded it to a 10. WHAT A MOVIE! Its is just so unique. Imagine a B-Movie with a high budget to make it live up to today's standards. Some might disagree but this movie has an all-star cast with the best being: Danny Trejo as Machete, Steven Seagal as Torrez, Michelle Rodriquez as Luz, and Jessica Alba as an Immigration Office (sorry I forgot her name). The movie is very unpredictable seeing as it is very over the top, which is a good thing because you have NO idea what will happen next. It is VERY violent, has some nudity (I'm surprised that Lindsey Lohan isn't gross looking nude), and has hilarious humor. So if you like extremely violent  Action, good looking women nude, and more than just chuckles but real laughter from both the brutal kills and the intended comedy. I was almost crying at Steven Seagal's little banter after the final fight with Machete. And that wasn't a spoiler it shows it in almost every trailer. Lets just say Seagal is just as big of a badass as he is in every other movie, and he does things his way. And try to notice the easter eggs with some actors having lines as titles of movies that have been in before. \"Hes Hard to Kill\" \"Showtime\""
    },
    {
      "rating": "10",
      "text": "MACHETE is one of the best movies I have ever seen I was pretty much having to hold myself back  from laughing at the theater. I loved all the characters and the storyline and music were both awesome. So far I am surprised that the major critics have not been able to get it. I hope Roger Ebert  sees this film maybe we can get the 4 * rating from the best critic on the planet that this film certainly deserves"
    },
    {
      "rating": "5",
      "text": "The action is amazing, the campy gore extremely fun, but the leftist politics - even though it's a parody - is a little over-the-top.  I know, it's meant to be, but Tom Tancrado-esque state senator firing a hire-powered rifle into a pregnant woman's womb??  That wasn't so fun.  And it certainly wasn't fair.  Lop off as many heads as you'd like, but man, those political statements are a little ham-fisted.  And the Catholic Church massacre was a bit much for my liking.   Nailing Cheech to the cross??  Come on now. Then again, you can pretty much say or do anything against the Catholic Church in Hollywood these days I suppose."
    },
    {
      "rating": "3",
      "text": "This movie is two things wrapped into one - a caricature, and a commentary on the ridiculousness of culture and popular thinking on current issues in the United States, and an old-fashioned shock and laugh horror film. The target is illegal immigration, and the response to it in Arizona (what John Stewart called \"the dumbest state in America\"). In that respect, the movie is like club, it hits you over the head with its message, so that even an idiot can find the irony. In that respect, I applaud the creators for speaking to the level of the common man. However, no thinking person will be so impressed. Is the movie scary or funny? ...not really. ...though the audience is full of people laughing loud enough to make sure everyone else knows they get the joke. The dialogue is purposefully camp. I thought I would have had more fun than I did. I was left thinking this was a little too close to bad movies (trying not to be bad) for me not to feel like I'd wasted my $13. It was definitely forgettable. As an aside, I couldn't help thinking that a trailer from this film would have made a wonderful cameo in the movie Idiocracy. I can definitely see more \"Machete's\" coming out down the road."
    },
    {
      "rating": "0",
      "text": "This movie was horrid, if you like this then you need help. It started bad ended bad. Whoever decided to put Lindsy Lohan in this movie needs to get mental help as well. Every single seen with her just made the movie get more worse then it already was. Want a real action Movie then watch The Expendables."
    },
    {
      "rating": "10",
      "text": "Very good movie. Very unique and very very bloody. It's good to see Trejo do well in a lead role. Jessica and Michelle were smokin' hot. I would kiss both of their faces. Lindsey Lohan...well at least she's working again."
    },
    {
      "rating": "3",
      "text": "Bad, and not in a good way. No, I didn't misunderstand the film, but what a perfect way to waste the talent of an all-star cast! It's comical to a point, which is the films strong suit, but eventually it just stops being funny and slumps into TOO MUCH over the top action and gore. What a disappointment!"
    },
    {
      "rating": "10",
      "text": "I am definitely planning to watch this movie this weekend. Machete's cast are all first rate, there is something for everyone like eye-candy for the guys, eye-candy for the ladies; and lots of macho action and adrenaline. The typecast and cliche's are a smart and clever ingredient to be exploited. Machete's seems to have all the ingredients to be an iconic movie, like pulp fiction."
    },
    {
      "rating": "0",
      "text": "At least it was slightly better than Rodriguez' latest unbearable-to-watch flick, Predators. At some point in the life of an actor, you must somehow say to yourself 'I am so old-looking now, nobody will take me serious anymore when I am trying to behave like an action hero'. Trejo can barely walk anymore, he has a huge pot belly, yet we are supposed to buy that he kills everyone just like that ? The whole movie was more like a parody, none of that could have happened in reality. To start out with, why wasn't he killed right in the beginning of the movie ? Nobody profited from him surviving.\rThe gory effects are fun maybe a couple of times, in the end they become just boring. The last 15 minutes destroyed every credibility the flick possibly had. Shot through the head, but raised from the dead, to fight another day ?\rThis is just filmmaking at its most primitive level."
    },
    {
      "rating": "0",
      "text": "I couldn't even be bothered to give this horrible film a one star rating. This film will cater to lowly people and thugs everywhere, Most of those who are gang affiliated or maybe just someone who enjoys watching Danny Trejo's washed up acting career."
    },
    {
      "rating": "5",
      "text": "This movie is so bad it's good.  Rodriguez tosses in every cliche and stereotype he can think of resulting in one hot mess of a movie.  Interspersed are populace messages replete with good old fashioned hatred of the man (right on baby!).  The problem is this genre has been dredged up so much  that it's no longer a novelty."
    },
    {
      "rating": "10",
      "text": "Robert Rodriquez new film is one of the most entertaining films of the fall. It is fun, bloody, messy; every action-loving viewer should run to the nearest cinema and experience it for themselves."
    },
    {
      "rating": "8",
      "text": "I liked Machete very much. It was definitely a fun thrill ride. Machete also had an A list cast, including Robert DeNiro. The one flaw I believe this movie has, is the overusage of the parody type movie. However, the action is sick. The acting may not be the best, but this could Lindsay Lohan's ticket back in Hollywood."
    },
    {
      "rating": "3",
      "text": "\"Machete Running a tired-less 105 mins that felt like it never ended. Danny Trejo is a very talented actor but even he can't save this movie , Robert Rodriquez has a good style and authenticity , but i felt the movie drabbed , lacked and was boring\" .. C-"
    },
    {
      "rating": "6",
      "text": "I was expecting Machete to rival planet terror but it just seems to be missing something. It doesn't feel as Grindhouse. It's certainly entertaining but nothing special"
    },
    {
      "rating": "0",
      "text": "The moment a young woman nonchalantly pulls a cell phone out of her cootch for no particular reason, this film hits rock bottom and never recovers.  Unfortunately for Machete, this disgusting event takes place about 5 minutes in.  A shockingly solid B-movie cast (Jeff Fahey, especially) is wasted in this exploitative trash that starts with a bang (the first few minutes, anyway) then instantly succumbs to an unambiguously and pretentiously preachy \"illegal Mexican immigrants throw off the shackles of your oppressors!\" narrative nose-dive.  Utterly vile and the complete opposite of entertaining.  Robert Rodriguez at his all-time worst, which is saying a lot, given his embarrassing resume."
    }
  ]
}