{"id": 389, "title": "Machine Gun Preacher", "starring": ["Gerard Butler", "Michelle Monaghan"], "runtime": 129, "genre": ["Action", "Thriller", "Crime"], "description": "The true story of Sam Childers, a former drug-dealing biker who finds God and became a crusader for hundreds of Sudanese children who've been kidnapped and pressed into duty as soldiers.", "releaseYear": "2011", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/A9gRYTyNLGJuxHmqdGM5UxHxJtB.jpg", "categories": {"plot": 6.5625, "acting": 7.384615384615385, "ending": 3.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.0, "action": 7.5}, "reviews": [{"rating": "10", "text": "I am not sure why this movie is rated so low.  Absolutely incredible.  very moving and varying degrees of emotion.  I would call this a must see!  Dont be fooled by the low ratings"}, {"rating": "8", "text": "In his best performance yet, Gerard Butler plays a troubled, complex guy who leaves his life of crime for God and becomes a real life hero in Sudan. Machine Gun Preacher is violent and, at times, hard to watch, but the story is inspirational and puts the spotlight on an ordinary man doing extraordinary things. But he is far from subtle and chooses to use a gun to get them done. The film can certainly be upsetting, especially when you see how kids in Sudan are treated and what happens if they disobey. But no matter how gruesome some parts may be, Machine Gun Preacher only shows the audience the brutal truth and the cause that Sam Childers is fighting for.\r Based on a true story and directed by Marc Forster (Monsterâ"}, {"rating": "3", "text": "I found this movie very \"preachy\" and honestly boring. It picks up in the second half, but the first half is so dreadful, why bother? I thought Gerard Butler did a fine job with what he was given, but what he was given was a shallow cartoonish character, who is not only rather uninteresting but unlikable to boot. If you are interested in Africa or the atrocities that have and continue to go on over there, due yourself a favor and find a documentary or other film to satiate your appetite!"}, {"rating": "9", "text": "This is an amazing real life story. I found it inspirational how the main character \"Sam Childers\" changed his life from from a drug addict thug to putting his life on the line to help the orphan kids in Southern Sudan. I like his realism after his conversion. I believe the way he channeled his fearlessness from something dark into something great challenges the audience to greater potential as well."}, {"rating": "10", "text": "\"MACHINE GUN PREACHER\" - A very powerful movie. My question is: how many modern American Preachers would actually teach in support of the efforts of San Childers and how many would condemn his methods? This R-rated film is a gritty and realistic portrayal of the unimaginable brutality still going on in the Sudan. My favorite aspect of this film was that it showed the deep flaws and humanity of Childers, his struggles, doubts and anger.My hat is off to Relativity Media and the other production companies for their courage in bringing this movie to us. Stars Gerard Butler, Michelle Monaghan, Kathy Baker, Michael Shannon, Madeline Carroll, Souleymane Sy Savane and the rest really put it on the line here!Too often \"christian: films paint an unbelievable picture of the faith process and the way God works in this world. It would be very hard for me to imagine any American church showing this movie to its congregations, but church leaders themselves, at least, need to watch and deal with these realities. How do we reconcile God of the Old Testament with  God in the New Testament? Did David have Bible study with Goliath? Was not King Saul commanded by God to wipe out nations? How does this \"fit\" with the Gospel of peace Jesus preached? We know \"the Lord our God is one God\" and that He is immutable (never-changing). The concept of Dispensations only shallowly addresses this topic. Preachers: let's hear it!"}, {"rating": "9", "text": "I was expecting a by the numbers action flick, given the reviews.....but instead was utterly blown away by what I watched. First of all, it tackles a topic that is so important yet so very, very, very few mainstream movies want to touch, which is the atrocities of civil war going on in Sudan (and similar situations across Africa.) It doesn't shy away from displaying the soul-crushing horror of what is happening, and the dangerous insanity in which it drives its protagonist in. In many ways it's about the dangers of different types of radicalism. Radicalism of terror, on one hand; but also radicalism of thinking you need to or you must save the world, which can put you on a path of destruction of everything you supposedly cherish, if not evil. At the same time, the film also goes all out on the **** giving West, which claims that it knows and that it cares about this Hell, but in actions does next to nothing, while proudly waving its little human rights flag out of its ass.It's an infuriating movie about an infuriating crisis and a furious man, played magnificently by Gerard Butler. It has no easy answers, and or any answers at all really, which is kind of the point. You question everything - religion, civilization, humanity - including yourself, and everything you are doing, and more importantly not doing. This is the very definition of courageous movie-making. What a criminally underrated film."}, {"rating": "7", "text": "Machine Gun Preacher was a fantastic movie with a plot that almost felt like a modern day version of Schindler's List. Now don't get me wrong. In no way am I saying that this film was anywhere near that level. I'm just saying that some of the emotions were similar due to the similarly tragic nature of the true stories they tell. Gerard Butler leads a cast that provide great acting throughout the film and deliver on those emotions. The plot develops well and the reality of the story adds an additional layer of depth. The action sequences were a little weak and unfortunately the movie leans a little too heavily on those scenes. The constant varying perspectives makes you think and the drama is effective. I think the ending felt a bit rushed and the film lacked that climactic emotional sequence that sticks with you but overall, I think most people would really enjoy this movie."}, {"rating": "9", "text": "The movie is amazing, on the whole. The beginning is a bit hard to bear, as it's *extremely* vulgar and painful. Although, it is an good representation of what Sam Childers' life used to be like. The accuracy of what is going on over in Africa is heart wrenching and makes you want to go over to help them yourself. And watching the development of Sam is interesting and will have you feeling for him."}, {"rating": "1", "text": "There is in fact an incredible story to be told of Childers' life and of his mission to help children in Sudan. Unfortunately, Machine Gun Preacher is not an incredible film but rather one lacking the emotional pull needed to adequately reflect the work Childers has done on behalf of so many who are completely unable to help themselves."}, {"rating": "9", "text": "Gritty, gray life.  And some red too.  The movie wades from deep, murky pond to deep, murky pond. It isn't your typical formulaic, black/white entertainment where the good guys save the day and everything works out. Reality isn't like that. Sometimes sacrifices (even big, soul-wrenching sacrifices) have to happen. Sometimes you have to beg and plead for help from people who will never understand because they are so far removed from you. Can you imagine trying to live these two lives in the movie? I don't mean biker and Christian, or even AKs and Christian. I mean Sudan and America. One week you're with kids who are happy to have food, health, and a ball to kick and the next your wife and daughter think you don't love them if you say 'No\" to a limo for the prom. I'm guessing all these talking about whether or not Gerald Butler was a good fit for the role and \"white savior tropes\" didn't relate to the film. Which is a shame. It is so powerful and shines a bright light on the West's spoiled, self-centered society if you're willing to look. I only wish they had used a different title."}, {"rating": "10", "text": "I don't see how this movie is rated so low, this movie was amazing yet sad and touching at the same time. Gerald Butler was a great actor chosen for this movie. This movie is actually a true story, they are still alive to this day. It's so hard to see good true movies now-a-days."}, {"rating": "10", "text": "This story held me glued to the screen from the very beginning. I was touched deeply by Sam Childers' heroic efforts. At least he is trying to make a difference. It only takes a spark to get a fire burning. Bravo for  Sam, who stands up for what he believes is right.  This movie definitely inspired me to think about what is really important. Saving children and helping the needy should be our primary focus, but unfortunately in our society, its all about taking care of numeral Uno. I loved this movie, and I'm proud of the fact that it is based on actual events. We need more inspiring characters and movies like this."}, {"rating": "0", "text": "Wow. This movie is quite simply unbearable to watch. While the story itself may harbor some interesting and compelling material, the script is so horribly mundane, cliche, and unbelievable that the film comes off as unintentionally comic material. Gerard Butler does the best with what he is given; however, his character's arc goes from awful scoundrel to world saver literally overnight. Furthermore, not only is the entire film's premise a stretch of your imagination, the ending is extremely unrewarding and empty. Please, save yourself some brain cells and some time, and choose something else to watch."}, {"rating": "8", "text": "Despite a competent performance from Butler, Machine Gun Preacher tackles way too much material to present a cohesive onscreen telling of the Sam Childers story.\r Watch this movie here for free http://www.watchfree.to/watch-27fa77-Machine-Gun-Preacher-movie-online-free-putlocker.html"}, {"rating": "6", "text": "Nothing special, it was just good. It was a little boring from time to time."}, {"rating": "6", "text": "This film is a fairly standard action film, only with a moral angle to it and I felt a bit torn about how sincere it was, or wanted to be viewed. I have nothing against the main character, played by Gerard Butler, he certainly seems to have his heart in the right place and it was, if anything, I suppose, reassuring to see someone with a chequered past care so much about the children forced to be in the middle of a violent/bloody conflict in Africa but I couldn't help but feel that somehow it still was a bit disingenuous. Of course I must mention that its based on a true story, that of Sam Childers, who was a former armed drug dealer in America and who became religious and ended up in Africa wanting to protect the kids, which is a nice story I suppose. I guess it comes down to the age old saying 'truth is stranger than fiction' but then also the saying, as noted (I beloeve) in the Bible 'No one is beyond redemption' also applies. Its an optimistic and nice message, sure enough and the film is certainly watchable - a fairly gripping watch at times and entertaining but the dichotomy between the scenes set in church with sermons being spoken and the bloody action/war/violence scenes, it felt a little uncomfortable I suppose. Thats not to say I don't give money to charity, generally at certain times of the year and after natural disasters and the like but it just felt perhaps a little uncomfortable viewing - a bit tacky somehow, even though its an important story to be told and its an important message.Butler does give a particularly good portrayal as Sam Childers, coming across as passionate about the Sudanese. Michelle Monaghan also does a good job portraying his wife, Lynn. Its a good film, an interesting story and its worth seeing but if the story doesn't appeal then, obviously, it wouldn't be for you - i.e. if you think organised religion is a complete con or if you believe that we in the west should stay out of the issues in other continents (i.e. Africa) and that sort of thing then this won't be for you but that sort of thing aside, its a good watch. A thought provoking film I'd somewhat cautiously recommend, yes."}], "recommendations": ["crash", "i_still_believe", "the_hate_u_give", "exodus_gods_and_kings", "the_road", "into_the_wild", "risen", "lone_survivor", "babel", "the_hunt", "unbroken_path_to_redemption", "courageous", "children_of_men", "sin_nombre", "heaven_is_for_real", "the_shack", "just_mercy", "noah", "dark_waters", "war_room", "her", "i_kill_giants", "snowden", "zero_dark_thirty", "13_hours_the_secret_soldiers_of_benghazi"]}