{"id": 3603, "title": "Mad Max", "starring": ["Mel Gibson", "Joanne Samuel"], "runtime": 91, "genre": ["Adventure", "Action", "Thriller", "Science Fiction"], "description": "In the ravaged near future, a savage motorcycle gang rules the road. Terrorizing innocent civilians while tearing up the streets, the ruthless gang laughs in the face of a police force hell-bent on stopping them. But they underestimate one officer: Max Rockatansky. And when the bikers brutalize Max's best friend and family, they send him into a mad frenzy that leaves him with only one thing left in the world to live for – revenge!", "releaseYear": "1979", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5LrI4GiCSrChgkdskVZiwv643Kg.jpg", "categories": {"plot": 6.958333333333333, "acting": 7.136363636363637, "ending": 7.2, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.148148148148148}, "reviews": [{"rating": "3", "text": "So I wasn't alive in 1979 or whatever, but watching this in 2015, all I've got to say to say is this movie is basically terrible. Bad acting, basically a nonexistent script, horrible overrated by fanboys apparently of other related movies. Mad Max: Fury Road is a actually a really good, entertaining movie. This movie takes 45 minutes too long to kill off the wife and baby and then never delivers. I feel sorry for people in 1979 and the early 1980s, and even now, who think this passes as hardcore action or has \"good chase scenes.\""}, {"rating": "9", "text": "Despite the films low-budget, Mad Max is a gritty cop movie classic, that has some of the most astounding and realistic car chases and road stunts ever committed to film, that helps to bring Millers & Kennedy's vision to life of a brutal and violent future where the world is breaking down into lawlessness and anarchy."}, {"rating": "6", "text": "Not so great,very unecessary dialogues much ado and scenes meaningless okey the budget it was tiny,but deserves a good 7 score a B+ movie... some good scenes,some good dialogues and good acting.."}, {"rating": "5", "text": "I didn't really enjoy this movie as much as everyone. It was just slow and I never felt like something really important happened. I think it's great as an introduction to the other movies of the franchise, but as a single film, I didn't like it."}, {"rating": "0", "text": "The start of the movie was really good and the characters are done and acted really well, but what the heck was the rest? After about 40 minutes, I waited 15 minutes for it to get interesting, then another 15 and I was done. My buddy was bored stiff too."}, {"rating": "8", "text": "This movie is one of the best low budget films of the 80's.\rIt tells the story of Max Rockatansky, a cop who is really commited to the law. When the world starts falling apart around him and his wife gets killed before his eyes, Max decides to hunt down her killers and ends them.\rThe movie has some really well made, practical action sequences and a simple but effective plot.\rThe most impressive thing is, that those still keep up to today.\rSo...if you are into dystopian action flicks, you have to see this one and its even better sequel, The Road Warrior."}, {"rating": "7", "text": "Mad Max is a good movie. It has great, memorable moments but the crudeness of this film may deter viewers from watching the rest of the series. It's low budget crudeness, did however, create a world that would pave the way for the rest of the series and its hero, Max. Just be sure to go ahead and watch it's brilliant sequel."}, {"rating": "2", "text": "Skip this movie and go straight to Mad Max 2.  The concept is interesting and the cars and costumes are cool, but, as my son said, \"It's just a bunch of stupid action and everybody dies.\"  There's just no sense of a storyline.  It's one chase scene after another.  Not enough is done to develop the near-future setting.  The relationship between Max and his wife, which should be crucial to the plot, also isn't given time to develop.  All there are are chases.\r \"Max used to be a cop.  Max used to have a wife and son who were killed by bad guys.\"  This is about all you need to know to have some context for Mad Max 2."}, {"rating": "8", "text": "A solid eight out of ten, even though a lot of people find it to be a very boring movie. I think it is good for what it started, as the sequels would thankfully improve upon it."}, {"rating": "9", "text": "George Miller crafts a gruesome world. One filled with exciting characters and fantastically crazy villains. It pulls few punches making for a satisfying, violent, and dark movie.\r For what is essentially an older movie the stunts and special effects are very well-done. It also has a unique style that few other movies have been able to emulate. The originality leads to the world and characters keeping you involved even if the plot tends to meander a bit.\r With fantastic performances all around, some deranged villains, and violent scenarios it's definitely a darker piece of fiction. George Miller keeps it all going with some great action and a straight-face. If you haven't given this movie a chance before there's plenty of reason to go on this \"mad\" ride."}, {"rating": "5", "text": "I felt this film was pretty bad overall really, with pretty campy acting and overused music for 'dramatic effect'. HOWEVER, I understand the australian film scene was not big at this time and there were budget constraints, but it seemed like the script was pretty poorly written, and the plot of this film is pretty much pointless. This film was like an unintentional Mockingjay part 1, just being a set up for obviously what the real film he wanted to make was; The Road Warrior. The whole plot could've been put in as exposition in the second film withing 1 minute of screen time. The acting as well wasn't that high quality and Toecutter 'menacing' screams and mannerisms (along with a lot of the gang) were more worthy in something like a west side story film. Pretty bad film overall but i respect what he was 'trying' to do especially with a lack of australian cinema. I must say though, excellent practical effects for it's time, a real achievement there."}, {"rating": "10", "text": "The first  film \"Mad Max\" over all was a hell of a good ride! what makes the film bad ass and beautiful is the action sequences also the story. Writer/director mastermind George Miller demonstrates breakneck  prowess at chase sequences and a shock value story. This is how a proper action film should be made with actors who can handle this material also a good direction, the action genre today is suffering. Mel Gibson's performance is heroic and bad ass! the way his character is written is caring and his character is fascinating; the writer's: James McCausland, George Miller put flavor also fastidious into the story. In a post apocalyptic world, an officer named Max who is committed to his job is on a high speed pursuit for the gang leader whom they called \"the knight rider,\" the gang leader is killed in a car crash (which Max is responsible for) the gang takes vengeance. With a caring/bad ass protagonist  and Miller's visionary skills is stripping vision of human destiny careening toward a cosmic junkyard. Grade A+"}, {"rating": "6", "text": "So like idk what the **** was actually happening in this film but DAMN was it entertaining, like holy **** car chase and **** (Also a love romantic thingy was in there but **** dat), also ToeCutter confirmed the scariest ****ing villain of all time *goddamn those accents*"}, {"rating": "9", "text": "Heading out to the highway with Mel Gibson is one his early performances. A sadistic, wicked hunter & prey game between bikers and patrolman. The chases makes the blood pump at maximum, with a crashing final act. Good choice for a weekend."}, {"rating": "6", "text": "Mad Max is a strange film with a charismatic central presence in Gibson but a slightly haphazard feel to it."}, {"rating": "6", "text": "The problem of the movie is their low budget, because you can see it in the pictures. The main idea is not bad. The story and motivation of the protagonist are simple"}, {"rating": "5", "text": "+ Great chemistry between main characters, wonderful practical effects, intense action-sequences, a great and crazy villain, and good opening scene and ending.\r But the rest isn't that great. The dialogs are at some places very forced, and some of the actors with minor roles didn't handle the role well at all. The first act got some intense moments, but it didn't feel new or unique. The first half of the movie is accually very slow and boring, with its boring dialogs and uninteresting plot. Mel Gibson as Mad Max is, even though he got some flaws, great for the role. But he wasn't as crazy as I expected to see in this post-apocalyptic movie. Most of the movie is in fact very boring, the story did not impress me! Mad Max is not as great as what I expected to see. Still; it got its moments with solid characters and good action.\r But lack of innovation, forced dialogs and mostly boring storytelling didn't impress me.\r 5.5/10"}, {"rating": "9", "text": "Though I had only seen the previous installment, 'Mad Max Beyond Thunderdome', which I enjoyed whilst a great many people didn't, with the present sequel earning ten (!?) Oscar nominations, I wanted to catch up on things before seeing the new film at the Cineplex. I was very pleased with this early film in the post-apocalyptic movie category, and can see how and why both it and star Mel Gibson became so successful. Other than Kenneth Anger's experimental film, 'Scorpio Rising', I have never seen a work that so fetishes both cars and the ritual of dressing, either for driving or for war. It's very well directed and suspenseful for a first-timer in Miller, and I'm so glad he's still helming the films of the series 36 years later! All that one has to do to see How To and How Not To Continue a Fine Franchise is compare how both George Miller and George Lucas have done this century. It's sad that they were so short on funds that only Gibson could be fitted with real leather in the film--I think I can rightly assume that money isn't a problem anymore..."}, {"rating": "7", "text": "Mad Max has some great chase scenes, fantastic characters and a great plot, especially for a low-budget film. In fact, there's only one problem with it, and that's that it has too much buildup, making the ending feel abrupt, like it's finishing right in the middle of things. It makes the film feel shorter than it actually is, which is a shame."}, {"rating": "7", "text": "Mad Max is a good movie with Mel Gibson doing a great performance as Max. I also respect the effort that the crew and the director had to go through by making this movie as I can say it well do.\r But if I got to be honest here, I thought the movie at times was a bit slow and there was some scenes in the movie that weighted it down for me.\r Good movie but not the best."}, {"rating": "7", "text": "This movie is pretty great even nowadays, for a movie from 1980, it certainly is more interesting than many action movie today and you get to feel that Mad Max universe already, even though here it is more civilized than in other parts later and I actually think some of the next parts were better than first."}, {"rating": "6", "text": "Is the first movie with a mediocre budget,so a rhythm so slowly,but entertaining, with rich performances mainly Gibson and Hugh Keays-Byrne as the horripilant antagonist toecutter.... But Mad Max (1979) is yes yes is enjoyable"}, {"rating": "7", "text": "..........................................A Insane movie that is not so good like the masterpiece sequel,but is enjoyable,some scenes could be deleted because is boring and unecessary,but the budget was so tiny I understand..."}, {"rating": "8", "text": "Bottom line: Good chase scenes and fun characters make this perfect for a Saturday afternoon.\r I’ve seen Mad Max twice. The first time was a few years ago. I saw it because it was one of those famous movies that I've never taken the time to watch. I must have been doing two things at once because I didn't quite get it. This time, I gave it my full attention and I think I understand it. At least, I understand it a little more. It still feels like a rather strange movie but I have a better idea of what happened.\r The movie opens to a post-Apocalyptic landscape, \"a few years from now...\" as the movie says. An understaffed police force is at war with criminals for control of the roads connecting the last pockets of civilization. A police cruiser parks alongside one such road. Suddenly, a female dispatcher's voice calls out an alert on the radio. A cop killer and his girlfriend have escaped custody, stolen a supercharged police cruiser and are on the run. The unit in pursuit needs assistance. The criminal’s voice blares out on the radio, \"I am the nightrider!\" The two officers race off to join the pursuit. The nightrider continues to taunt and evade both cars. Goose, a motorcycle officer, briefly joins the pursuit before crashing. Throughout the chase, the camera cuts to an officer who sits alone in a cruiser. The mysterious man, steps out of his car, puts on dark sunglasses and dons a leather jacket and leather gloves with quiet, deliberate motions. This is Max (Gibson), the force's top officer. Once the criminal shakes off his pursuers, Max sets off to bring the man to justice. The two cars speed towards each other in a game of chicken. The cars nearly avoid a head on collision. The almost fatal encounter silences the once proud nightrider. Instead of shouting at the officer, he begins to cry. The two cars race over a hill at such speed the nightrider can’t react fast enough to avoid an overturned fuel tanker blocking in the road. The nightrider's car bursts into a ball of fire and the sequence ends.\r The introduction of Mad Max is simple and to the point. It’s a good indication of what the rest of the movie will be like. The focus of the movie is on cars and chase scenes. The story is present to make excuses for more chase scenes. That is, it isn't a sparse story with chase scenes but chase scenes with story spread throughout. It isn't quite to the level of focus as the original Gone in 60 Seconds (which features a 40 minute chase scene) but it is still enjoyable. On some level, for a short hour and a half movie, I might say that the film tries to accomplish too much. After all, it takes some time to establish Max's wife and infant son, and his friend named Goose, and the nightrider’s gang, and the police force, and so on but the pace of the movie is consistent enough that this doesn't become much of an issue.\r The vehicles and characters are equally stylized. For example, you have the one nameless couple driving in a 1959 Chevolet Bel Air with fur interior and an elaborate flame paint job. Similarly, you have the police captain, Fifi; a tall man with a billowy voice and a thick moustache wears leather pants and no shirt while he waters his little plants. The style reminds me of the colorful gangs in The Warriors where you have the baseball gang and the roller skating gang. There isn't really a reason for cars and characters. I mean, this is the post-apocalyptic future, right? How much time, money, and energy did they spend on making these cars? Shouldn't these people be worried about food? Mad Max is just one of those movies where you have to go with the flow.\r I'd recommend this movie for a Friday evening or Saturday afternoon. It is simple and to the point."}, {"rating": "7", "text": "Mad Max is a good movie. It has great, memorable moments but the crudeness of this film may deter viewers from watching the rest of the series. It's low budget crudeness, did however, create a world that would pave the way for the rest of the series and its hero, Max. Just be sure to go ahead and watch it's brilliant sequel."}, {"rating": "7", "text": "Mad Max is created in 1980, so it can't get fixed up because some people that were in the making of this movie probably retired or died or something. Enjoy Mad Max like it is."}, {"rating": "8", "text": "Mad Max is a film that many people love, not because of the hero icon itself but because of the awesome bad guys, the thrill rides and car chase sequences that will keep you gripped. Mel Gibson is really young in his role of Mad Max Rockatansky, that said he's 21 when he got the role and can drive and chase down the motorcycle gang. The gang leader, Toecutter and his gang harasses and assaults people including Max's girlfriend, Jessie. But nothing truly exciting happens until we get to the third act where Max takes revenge on the Toecutter and the motorcycle gang including Johnny the Boy. Now let me get to the different language to English and English in Australian. Many people didn't bother changing different languages or the fact they do, you can hear the difference between American and Australian. Years ago when people watch Mad Max they watched it and they loved it but revealing what is wrong when they change the language to Australian. Me and they found out that they recognised Mel Gibson's voice and not in the American language. Hahahahahahahahaha! I mean you just can't make this s%!t up at this point. It's so f£$king weird. I really like Mad Max and it is a cult classic to many Mad Max fans. Now Mad Max 2 on the other hand, we'll get to that awesomeness later."}, {"rating": "5", "text": "Mad Max(1979)\rStarring: Mel Gibson, Joanne Samuel, Hugh Keays-Byrne, Steve Bisley, Roger Ward, Vincent Gil, Geoff Parry, Jonathan Hardy, Reg Evans, Lisa Aldenhoven, Gil Tucker, Sheila Florance, David Cameron, and Christine Kaman\rDirected By: George Miller\rReview\rThe Maximum Force Of The Future\rEveryone has been watching the old Mad Max films to watch the new one in the series that is out in theaters. I've great things about all four movies. But this first entire it was. it was, it was, boring!\rIn a dystopic future Australia, a vicious biker gang murder a cop's family and make his fight with them personal.\rThe film opens with a car chase where we get introduced to Max who takes down this psychopath who calls himself the Knight Rider. The rest of the Knight Rider clan show up to take their revenge.\rTheir were a lot of good stuff in this film, the acting is pretty good, the score is amazing, and the action is pretty okay. I was expecting something simplistic and grander then what I got.\rI believe it should of been like Punisher where you see his family get axed in the beginning or maybe they have that opening sequence but instead that knight rider from the beginning kills his wife and son and then the rest of the knight riders show up to take their revenge.\rI don't know I like a lot of things about this movie as I've stated but after that opening sequence I just felt bored. Until then the knight riders showed up and terrorized a couple, then they killed Maxes family and he takes revenge.\rMad Max is a pretty fine start but the lack of action that flows with the story just made me feel bored and want take my pillow. I'm giving Mad Max a two and a half out of five."}, {"rating": "6", "text": "The first is the worst of franchise, not the third like everyone say, there is much runaround and little action, In the third also have much runaround, but have less, and have more action and the action in the third is so much better than in this the first one."}, {"rating": "10", "text": "Mad max is movie made by american international pictures takes place in Australia where max set to avenge his wife and son, by defeating toecutter and his minions, watch mad max. it's a movie where max set for revenge."}, {"rating": "9", "text": "George Miller's Mad Max is one of the best action films of ALL TIME. Mel Gibson's Max Rockatansky is one of the top three action movie heroes in my opinion. The villain, Toecutter, was okay. The story isn't that original but the film is made for really great action and the action is truly amazing. In the end, my rating for this film is 9.5/10"}, {"rating": "7", "text": "sanely ingenious and bolder as much as glorifying and adventurous..Mad Max3 And A Half Out Of 5Mad Max is a sci-fi thriller about an inadequately working officer who is a worried vulnerable family man that is on the verge of going rogue due to its surrounding that literally defines dog-eat-dog world. The effort and hard work that went on creating the future world pays off and the primary reason to that would be its accuracy and lunacy towards the resemblance with practicality which is not created to please the viewers but stand on its definite ideology. It is rich on technical aspects like choreography of all the chase sequences, background score, sound effects, art design and editing. The script is unpredictable, thought-provoking and goose-fleshing filled with nail-biting action sequences and three dimensional characters that are perfectly cooked and served to the audience. The screenplay by James McCausland and George Miller (the director) keeps the audience engaged with unexpected twists and turns and mind-shattering visuals where Miller's brilliant execution not only supports but celebrates it into a whole new level. The performance is decently handled by Mel Gibson although it could have been a lot better. Mad Max is sanely ingenious and bolder as much as glorifying and adventurous the journey is, for this is a long drive that every moviegoer has been waiting for buckling its seat."}, {"rating": "6", "text": "Mad Max is a good movie, but it has two problems that for many people will kill it: an excessive duration for what ends up being told, with an abrupt end as a side effect, and a non-existent post-apocalyptic world (surely to cause of the short budget), except for the shortage of gasoline."}, {"rating": "9", "text": "Extremamente antigo mas impressionante como ainda consegue ser melhor que muito filme atual, as corridas impactam e nao sao colocadas a cada 5s, personagens bem esquisitos e interessantes,um mundo vazio que traz uma grande sensaçao do caos que traz o enredo"}, {"rating": "7", "text": "Mad Max, the movie's got a decent plot, great characters, good dialogue, some very talented makeup artists, some very brutal moments and some very brilliant action scenes.The movie does run into some problems though and one of those problems being the pacing throughout certain scenes in the movie.Also, some of the scenes throughout this movie feel like they've been cut too far down and they shouldn't have been because you can tell it has and it sort of ruins the movie.Overall, it's not a bad movie at all, I enjoyed it quite a bit. It's got some brilliant action scenes, great acting and a decent plot."}, {"rating": "6", "text": "It obviously could be better. This movie have moments but it looks cheap. It has to be post apocaliptic, but i havent know that is post apocaliptic movie, I could not see this in movie. Fortunatelly next movie are better."}, {"rating": "8", "text": "A different type of movie making with great car stunts. Story is hitting and thrilling, full of memorable moments and amazing character developments. This one has flaws but with its different tone, it's a classic for me."}, {"rating": "5", "text": "So Australian. Max is not nearly mad enough, in fact he is downright boring compared to the others around him."}], "recommendations": ["mission_impossible_ii", "the_mechanic", "angel_has_fallen", "mechanic_resurrection", "run_all_night", "mission_impossible_rogue_nation", "the_commuter", "3_days_to_kill", "the_ice_road", "premium_rush", "mission_impossible_ghost_protocol", "mad_max_fury_road", "mad_max_beyond_thunderdome", "the_equalizer", "cold_pursuit", "kingsman_the_golden_circle", "the_last_stand", "the_bourne_legacy", "war", "escape_plan", "mission_impossible_iii", "max_steel", "john_wick", "mission_impossible", "boss_level"]}