{
  "id": 3303,
  "title": "Mad Max Beyond Thunderdome",
  "starring": [
    "Mel Gibson",
    "Tina Turner"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Mad Max becomes a pawn in a decadent oasis of a technological society, and when exiled, becomes the deliverer of a colony of children.",
  "releaseYear": "1985",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jJlxcEVVUHnrUeEkQ0077VeHQpb.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 7.0,
    "ending": 7.571428571428571,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 7.357142857142857
  },
  "reviews": [
    {
      "rating": "4",
      "text": "The low point of an other wise great trilogy see's a car chase with no death, kids, a meh tina turner who was just brought in for popularity, a PG-13 rating, and only 1 car chase.  This has many problems, including the characters, the second half, and the fact that max is just a stereotypical action hero."
    },
    {
      "rating": "3",
      "text": "Mad Max: family friendly edition. I don't even know. The film is basically Mad Max meets Indian Jones, with the inclusion of Tina Turner. **** U Tina Turner and your beyond thunder-dome song. Mad Max is usually violent, gritty and basically metal as **** The best way to describe the film is kinda like if all of a sudden the band Mayhem decided to collaborate with ****ing One Direction. It just doesn't ****ing work."
    },
    {
      "rating": "8",
      "text": "...........................................................................................................................................More Funny, More Family Friedly,And Little Action.... and this is Very Bad, But even Mad Max 3 is Better than the First One...."
    },
    {
      "rating": "5",
      "text": "If the critics think this is better than the Road Warrior, then they must be mad. This is by far the worst in the series and a complete let down on Miller's part. It may be crazy, but Tina Turner isn't a good replacement for what should be a movie with great car chases outdoing its predecessors. It does have redeeming factors such as Thunderdome itself and an entertaining chase sequence but that's the only good that comes from this. Be warned, the critics are wrong, the fans are right, this is the worst in the series."
    },
    {
      "rating": "8",
      "text": "It's definitely a change in tone for the series. The action loses the extreme and graphic violence of it's predecessors and the story doesn't carry the same bleakness. Yet, while it loses some of the identity that established this series the world continues to flourish.\r It's still packed with the same zaniness inherent in Miller's original take on the world. It just looses some of the insanity. It's still crazy, but not in the same dark and grim way. The out there villains and scenarios have a more approachable nature to them this time around, allowing for a film that can appeal to a larger audience.\r The movie definitely loses something it's predecessors have in the process, but the adventure is only slightly less entertaining. Miller still has an eye for creating fantastic and exciting action. Now that his world is more apocalyptic than ever he can really let his imagination run wild and fills it with even more unique and creative ideas. The \"Thunderdome\" itself is quite entertaining.\r The brutal edge that made the series stand out in the first place is indeed missing. Something that is likely to upset and turn off purists. Yet, even without it the series still proves to be an entertaining ride. With a unique world and some well-crafted action I still found myself enjoying the continued adventures of \"Mad Max.\" It doesn't live up to it's predecessors, but there are still plenty of reasons to return to this wasteland."
    },
    {
      "rating": "10",
      "text": "THE post-apocalyptic trope creator. Simply must see. Not only real action, but also a coherent story, with characters full of nuances and personality.\r WAAAAY better than the 2015 dumbfest movie."
    },
    {
      "rating": "8",
      "text": "Again the budget is higher than before and you can see it: The world is great again. The story is top in the beginning, but I didnt like the kids part. Also Aunty was not a bad character, so why did Max fight against her? Some parts of the movie were a bit too childish. So the 2nd part is the best of the trilogy, and the 1st part is the worst."
    },
    {
      "rating": "8",
      "text": "In my opinion this part of Mad Max is still very good movie - it has interesting universe, interesting characters, the plot isn't that predictable and actually is interesting. Yes it has some flaws, but overall you still see and feel that Mad Max vibe with all the apocalyptic world. I think people just wanted to see something more like previous parts action wise and didn't like that this had kids in the movie and some other things- but why do you want all the parts to be the same? I think this is more interesting this way."
    },
    {
      "rating": "8",
      "text": "Mad Max: Beyond Thunderdome (1985) IT'S NOT THE WORST OF FRANCHISE!!!!!!!!!!!!!!!!! the worst is the first one Mad Max (1979)...... Understanting ****"
    },
    {
      "rating": "4",
      "text": "[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn[nasasn"
    },
    {
      "rating": "2",
      "text": "Mad Max Beyond Thunderstone is the last film in the Mad Max trilogy starring yet again Mel Gibson only this time he's joined by singer, Tina Turner!!!!! Not seen this movie in years but I know it's a horrible mess with bad acting and is terrible especially compared to the original Mad Max. Skip it."
    },
    {
      "rating": "7",
      "text": "I enjoyed this more than the others, it has a bigger scope and better realised characters and world."
    },
    {
      "rating": "7",
      "text": "Not sure what all the fracas is about. Despite the conventionality of some of the story elements, Miller's frantic, cooky stamp is still undeniably apparent here. \"Mad Max Beyond Thunderdome\" is a visually rich, supremely well-designed action movie and a worthy entry into George Miller's legendary franchise. Bonus points go to Tina Turner for turning in a **** handful of original songs for the film, as well as a delightfully over-the-top performance for the movie-goers to have fun with."
    },
    {
      "rating": "5",
      "text": "+Some interesting sci fi fantasy designs+Some interesting camera work and edits-Terrible incoherent plot-Awful pacingThis movie feels oversaturated with ideas and ultimately became an incoherent mess with a cool car chase at the end. Its a shame as madax 2 was awesome."
    },
    {
      "rating": "8",
      "text": "This movie is not like by a lot of Mad Max fans and they say it is the worst movie in the franchise. I say those should see a real bad sequel like Highlander 2, Star Trek 5 or Star Wars The Last Jedi. If this is the lowest point than you should thank Hollywood that they did not butcher the franchise and that it is one of a few franchises with no weak movie. The movie has a good story, more character development than the prequels and solid action. Of cause it is a bit different form the first 2 movies and cant compete with Fury Road but that is still nowhere near a disaster or even average. Like all movies of the franchise it is set in a post apocalyptic future were the world is a barren wasteland / desert and the survivors struggle to survive. Our civilization, technology and morals are just stories of the past or abstract concepts. The story follows again (Mad) Max Rockatansky who travels through the wastelands when his car and all belongings were stolen by a pair of thieves with a smart approach that I wont spoil. When he follows them to a settlement called Bartertown to get back his stuff he is involved into the power struggles of the town. He will be dragged down into the fragile balance of power and things will change. This is the set up to the story. Actually I liked the story. They add a lot to the lore, introduce good characters and have some natural development. A lot of this movie enter pop culture knowledge. Like for example “Master Blaster”, “Two men enter one man leaves” etc. I watched it a few times and do not know why people dislike this movie. It is no 10/10 but definitely good. We have also a strong cast. Mel Gibson returns as Mad Max and fully delivers his signature role. Tina Turner as Aunty Entity was a positive surprise. She rocks every scene she is in and feels natural. Then we have Angelo Rossitto as Master and Paul Larson as Blaster. Together as Master Blaster they are an interesting combo and work well. The rest of the cast is strong too with Gary Stephen “Angry” Anderson as Ironbar Bassey, Adam Cockburn as Jedediah Jr, Bruce Spence as Jedediah and Helen Buday as Savannah. All together give a truly strong performance. Of cause the costumes, sets and locations look convincing. They give exactly the right feeling of a post apocalyptic future where civilization ended and the weak are eaten by the strong. Again nothing to complain. The soundtrack is excellent with Tina Turner giving us the classic “We don't need no other hero” which is still played today and sometimes covered. The rest is good too with “One of the Living”, “Bartertown” and “The Children”. Overall this was an enjoyable movie that I can recommend and did rewatch a few times. Not a 10/10 but definitely at least an 8/10 for me."
    },
    {
      "rating": "6",
      "text": "Not compared to the previous film, this is also a good Mad Max movie. The single fact of watching this world that Miller created once again, is enough reason to watch it, but it also has a good story and cool action shots,"
    },
    {
      "rating": "8",
      "text": "Mad Max (1979) is the Weakest of franchise, no the Thunderdome (1985),,, is clear that this don't seem a Mad Max movie, except for the last great car chase of movie."
    },
    {
      "rating": "8",
      "text": "Isn't Bad and Poor like many Mad Max fans says,is just a little or much bellow than The Road Warrior (1981),Fury Road (2015) but is easily superior than the first Mad Max (1979)\rHave a good story,great script,direction & acting, even fleeing the essence of the franchise, but the only and last car chase scene of movie lives up to franchise,and have a train :) Amazing!!!"
    },
    {
      "rating": "5",
      "text": "I really can't believe this is from the same guy as Mad Max, The Road Warrior, and even Fury Road. This is like The Colour of Money to The Hustler. Only not as decent as The Colour of Money."
    },
    {
      "rating": "7",
      "text": "Very Underrated for fans of franchise the last chase in the end of the movie and the only chase of movie,is amazing with train!!!!!!!!!!!!!!!! and the scene in the thunderdome are very cool!!!!!!"
    },
    {
      "rating": "8",
      "text": "While Mad Max is not post-apocalyptic and I actually think that Mad Max 2 is an post-apocalyptic masterpiece so what do you expect from Beyond Thunderdome? Better than the first and the second or a step backwards? A step backwards. Many people find the third to be quite s£!t and not very good as the other two but for me I really do like it. I actually found this one to be as good as each other that is to say the first Mad Max. If it's not as good as each other as Mad Max, I don't know what it is. Right after the epic chase sequence at the second film, The Road Warrior, Max goes across a town called Bartertown where it has camels, pigs, pig s!$t, a dwarf called Master and fighting which is controled by Aunty Entity played by a singer, Tina Turner. When you decide to go to the fight with your opponents you go to Thunderdome where you can confront you enemies when people chanted \"Two men enter, one man leaves.\" Max has been exiled and sent to the wasteland and went across the oasis with children. I have to be honest they definitely reminded me of the lost boys from Peter Pan where they live at Never Land where they never grow up. Anyways, that's all I can about it. Now that the theme song which I really love which is sung by Tina Turner who also starred in Mad Max Beyond Thunderdome. I can never get bored with this 80's song one teeny bit! It's just something that the atmosphere exists from many places and made me feel like I went to heaven. With all that, that is the end of my Mad Max marathon and the final film of the Mad Max trilogy that is until Mad Max: Fury Road exists with Tom Hardy starred as Mad Max and not Mel Gibson. It is in fact the last film that Mel Gibson ever to play Mad Max. I haven't seen Mad Max: Fury Road but I will going to in sometime in the near future. I heard that it is fantastic. Anyways, that's it for Mad Max, Mad Max 2 and Mad Max Beyond Thunderdome. Beyond Thunderdome is a good movie to end the franchise that Mel Gibson ever starred as the final time, Mad Max Rockatansky."
    },
    {
      "rating": "7",
      "text": "Frankly, not as great as the two originals, but Mel Gibson's interpretation, and the always direction of the master Goerge Miller, continue making this film, the worst but stilling being one of the bests movies of the year, and not a sorry trash on a cool franchise as Mad Max's."
    },
    {
      "rating": "8",
      "text": "The discrimination of this movie is unbelieveable.\r Clearly Beyond Thunderdome is Light Years, Better than the first one, have more good action and less winding than the first one"
    },
    {
      "rating": "7",
      "text": "They obviously wanted to go a different direction with this film, putting far more emphasis on the post-apocalyptic world and less so on the fighting it out via high speed chases the other films emphasized, that doesn't happen until the end. They also seemed to be going for more kid-friendly, like mixing elements of Peter Pan and the Goonies, a lot more cartoonish comedy scenes, less scary and brutal moments, but odd they left the whole S&M look in place with many of the characters. What this film does really well is the costume design, vehicle design, set design, mix of looks of the characters, and overall aesthetic. Where the villains and characters were somewhat believable in the first 2 films, in this one they are much more out there like it's a Disney live action film, especially the tribe of kids. That said, I still think this is a good film overall and around a 7/10. It's just all 4 films in this series are good and worth watching and this and the first are the weakest of the 4 but for different reasons. I rank the films: 4, 2, 1 & 3 (tied). The 4th is a great film overall and retains the spirit of the first 2 while having the great costume and set design of the 3rd. The 1st was the most realistic and balanced, he had a wife and kid and was just doing a job that he eventually wanted to get out of but he was forced back into it due to the villains. There was some goofiness in it but it was more borderline horror at times and definitely not kid friendly. But visually it's the least appealing and the pacing is pretty slow, it seemed less post-apocalyptic and more Nowheresville, Australia during the late 70s / early 80s with a mildly punk-ish bike gang. The 2nd film was a good mix of realism and a more creative post-apocalyptic world but I am guessing was still limited by budget, just not as limited as the 1st."
    },
    {
      "rating": "7",
      "text": "weaves in for a better closure..Mad Max : Beyond Thunderdome3 And A Half Out Of 5Mad Max : Beyond Thunderdome is the final chapter to the beloved character Max that is more than just an epilogue as the character still has potential to and does evolve. The feature takes its time and chews off its characters allowing the audience to sink into it and the makers being aware of the persona of the character and its fame that can easily hold the audience for it. The primary reason why it is more questionable among the fans, would be his character driven approach towards the plot, that maybe slow, but is surely effective. The script is neat and clean and figures its way out as always on delivering the perfect balance of art and commercial aspect of the cinema. The George Miller part of the feature can be clearly seen as it is mild and focused more on the emotional part of it, which is written and executed aptly for the character that has suffered to this extent. The performance has improved a lot and is something the makers can rely upon completely as Gibson is in his A game and carries it off all on his shoulder. The scrutiny in here is simple and sensible with an impactful emotional touch as a goodbye for the character; a perfect end to a trilogy. Mad Max : Beyond Thunderdome weaves in for a better closure and achieves something more colossal from its poetic theme"
    }
  ],
  "recommendations": [
    "mad_max",
    "indiana_jones_and_the_temple_of_doom",
    "the_league_of_extraordinary_gentlemen",
    "back_to_the_future_part_iii",
    "mad_max_fury_road",
    "star_wars_episode_i_the_phantom_menace",
    "mission_impossible_rogue_nation",
    "star_wars_episode_ii_attack_of_the_clones",
    "terminator_3_rise_of_the_machines",
    "resident_evil_apocalypse",
    "the_terminator",
    "stargate",
    "superman_returns",
    "aliens",
    "the_dark_knight_rises",
    "hellboy_ii_the_golden_army",
    "rampage",
    "the_last_witch_hunter",
    "bumblebee",
    "total_recall",
    "fantastic_four_rise_of_the_silver_surfer",
    "spectre",
    "terminator_2_judgment_day",
    "predators",
    "the_scorpion_king"
  ]
}