{
  "id": 1330,
  "title": "Madagascar: Escape 2 Africa",
  "starring": [
    "Ben Stiller",
    "Chris Rock"
  ],
  "runtime": 89,
  "genre": [
    "Family",
    "Adventure",
    "Animation",
    "Comedy"
  ],
  "description": "Alex, Marty, and other zoo animals find a way to escape from Madagascar when the penguins reassemble a wrecked airplane. The precariously repaired craft stays airborne just long enough to make it to the African continent. There the New Yorkers encounter members of their own species for the first time. Africa proves to be a wild place, but Alex and company wonder if it is better than their Central Park home.",
  "releaseYear": "2008",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/agRbLOHgN46TQO4YdKR462iR7To.jpg",
  "categories": {
    "plot": 6.52,
    "acting": 6.684210526315789,
    "ending": 7.0,
    "soundtrack": 9.0,
    "cinematography": 6.0,
    "familyFriendly": 6.857142857142857,
    "funny": 6.851851851851852,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Computer graphics have passed into a realm of beauty not witnessed before and Blu-Ray is the pinnacle. this film looks extraordinary in BR. the characters stay true to the original with the penguins and the king hilarious. you have to listen closely to get all the gags. it is worth seeing for this alone."
    },
    {
      "rating": "6",
      "text": "La película es divertida una vez, no se como a los críticos le pareció mejor esta que la anterior."
    },
    {
      "rating": "3",
      "text": "Madagascar: Escape 2 Africa is a limp relative to the original Madagascar. The jokes aren't as funny and the plot isn't as interesting. Not much to say beyond that. The penguins are still funny, though."
    },
    {
      "rating": "9",
      "text": "Pretty darn funny. The opening sequences launching the plane are just hysterical. Considerably better than the original film, and as someone else pointed out, hard to see how it could have been much better. Lots of droll movie references and in-jokes (The Lion King in particular gets a good workout) and one of the best scripts of 2008. Oddly enough, because it has so many in-jokes, it is probably a slightly better film for adults than it is for children, which makes me drop a point off what it might have been. But one of the best films of the year anyway."
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie. I thought at first that it would be some cheesy sequel, but it proved me wrong. The soundtrack is absolutely amazing and it sends shivers through my spine every time I listen to it. The best sequel to surpass the first one!"
    },
    {
      "rating": "10",
      "text": "I almost gave this movie a nine, but honestly, I can't think of any way it could have been better so I'll have to go with a 10. This is particularly impressive since as an 18-26 yr. old male I'm not exactly the key demo group. My girlfriend loved the first movie so of course we had to go see the new one opening day. So it is safe to say that I was dragged to this movie and didn't expect to enjoy it in the least. The plot is not overly deep, and a lot of it is predictable kid stuff or scenes redone from other movies, but unlike other movies seem to try too hard to parody other flicks, I found myself laughing along with the kids more often than not. The silly gags will all there of course, but what really made me laugh were the more obscure adult references. Examples include: King Julian describing how he would invade a foreign country and force his political ideology on the inhabitants if he only had a few days to live, or the scene in which the monkeys are negotiating with the penguins and they are referred to as \"Communists\" because they unionized. The bottom line? Mad 2 is smart, funny, and definitely worth your time. If your kids want to see it, take them. You'll enjoy it at least as much as they will."
    },
    {
      "rating": "4",
      "text": "Why Dreamworks? Why? The first film is so much better, nothing is really that funny in this film, it seems a lot less sophisticated than the first. An amazing disappointment."
    },
    {
      "rating": "3",
      "text": "Nothing's changed in the game of Dream works for \"Madagascar: Escape 2 Africa\". The characters are stoned, story's baffling, and all they really do the whole time is just....moving. (P.S: Sorry for the criticism Dream works, but your penguins were NOT funny.)"
    },
    {
      "rating": "8",
      "text": "Very very good movie for teenagers , kids and adults."
    },
    {
      "rating": "7",
      "text": "Funny and well animated. Expressive voice overs, good screenplay. It's not one of the best animated films of recent years but it is fun and entertaining. The penguins are hysterical."
    },
    {
      "rating": "4",
      "text": "Not the best franchise to come out of Dreamworks. This installment lacks any kind of humor, story, or interesting characters. Only the penguin characters (and they appear in very few scenes) save this movie from being a total waste of time."
    },
    {
      "rating": "8",
      "text": "This sequel is even better than the original. The story is much better and there are more characters this time around. There is even a lesson to be learned from this Madagascar movie. It is a signifigant improvement."
    },
    {
      "rating": "6",
      "text": "A lot better than its predecessor but not well executed ans still has a whole bunch of the main flaws the first one had, but it is a well animated film and children will enjoy it. I give this movie 62%."
    },
    {
      "rating": "8",
      "text": "Funny SequelNot As Good As The First One, But There's A Whole Lot To Like Here."
    },
    {
      "rating": "7",
      "text": "Pluses- Entertaining at times, humor brought smiles rather than laughs. My niece seemed to like it. Kids laughed, but laughter was sporadic and not the entire audience was amused to the same levels. Minuses- plot not well connected between the four main characters. Long. At times I wanted them to get on with the story. Summary- go see it on a large screen if you are going to see it."
    },
    {
      "rating": "7",
      "text": "Good movie, not as great as the first one, but definetley worth watching if you liked the first. Story is well written, characters are well played. Overall a good movie to watch with the family."
    },
    {
      "rating": "7",
      "text": "This movie was just ok for me. It was not nearly as good as the first one."
    },
    {
      "rating": "7",
      "text": "So how will \"Madagascar: Escape 2 Africa\" play in Kansas? Sick of the cronyism he encountered at KU fraternities, Thomas Frank(author of the political and cultural critique \"What's the Matter with Kansas: How Conservatives Won the Heart of America\") left the Sunflower State, and became a democrat. While attending meetings for the Young Republicans, a wide-eyed Frank felt like an outsider; soon jaded, he quickly realized that the party of his youth on the Jayhawk campus, was more about harboring power than the promotion of ideals. In \"Madagascar: Escape 2 Africa\", fate thwarts the destiny that awaits Alex(Ben Stiller), who instead of being King of the Animal Preservation(read: the sequestered world invented by the Cons, not the real world(read: the jungle) unencumbered by party ideology), ends up as an entertainer in a New York zoo(read: lion as the liberal elite). Leaders of the ultra-right incite their Conservative Evangelical constituency with unfounded claims that the so-called liberal media and their latte-sipping subscribers are laughing at Middle America and their cultural bent for all-things-Orthodox. Not only was Alex a Young Lion(read: College(or Young) Republican), he was next in line to lead(read: W.) the animal preservation, and would be considered a God by all the lion-fearing animals. To his feral parents, and counterparts, Alex is a dancing fool; completely worthless, a wuss. For a lion to earn his spurs in the imitative Africa(not the real Africa), fighting is the only currency. The subtly satirical \"Madagascar: Escape 2 Africa\" turns the culture wars on its heels. It's Alex, the coded liberal, who is being persecuted. Late in the film, the satire grows more playful when Alex saves his own life, and his disapproving father's life, by performing for the safari tourists, led by an ultra-violent old lady(read: pro-hunting conservative), who ironically, permit the two lions to live because they can see that a lion well-versed in the dancing philosophy of Bob Fosse has worth. In this sequel to the uneven \"Madagascar\", there's a surprisingly savvy parable about our country's current political climate, that shouldn't be written off in favor of the penguin and monkey show."
    },
    {
      "rating": "9",
      "text": "This is a family movie that especially young kids would love. My entire family saw it today and universally loved it. No, it is not an Oscar winner, so what? See this movie and have a great time!"
    },
    {
      "rating": "6",
      "text": "This film is nothing spectacular in fact it is just alright but I’m cool with that. Unlike the first film this one is kind of enjoyable. While it is not laugh at loud funny the film has a lot more heart, the main characters while still just alright I actually have a reason to care for them this time around, the penguins are used better, and the animation looks nice. I’m not going to recommend this film as it is not as good as something like Shrek 1 & 2 or Kung Fu Panda; however, this is a passable film and if you want something passable then this is it. Fans of the first film should check this out as it has more of the same characters and nice humor. This isn’t a drastic improvement so much as it will win people over who didn’t like the first one but if you are going into this film expecting another somewhat annoying film don’t worry it’s a bit better than the first one. This film is nothing but ok but it surpassed the first one and that’s good enough for me. It’s a rental, which is a lot more than I can say for other animated films like The Wild."
    },
    {
      "rating": "8",
      "text": "I thought that this would be worse than the original, and I was so wrong. I was laughing like a mad person throughout the whole movie. The sequences launching the plane are hysterical. The script is unbelievable good, and the plot is also well imagined. The bird-helicopter reminded me of 'Chicken Run', but it's no big deal. A great animated movie. Recommended."
    },
    {
      "rating": "6",
      "text": "Well I wouldn't say the movie was bad. The humour was surprisingly good BUT the plot wasn't the best I ever seen."
    },
    {
      "rating": "5",
      "text": "Not as good as first film, writers don't seem to have many good ideas. Penguins are still great."
    },
    {
      "rating": "6",
      "text": "Personally, I enjoyed the first one more. But it comes really close. The sequel is still pretty silly but it's also quite funny. If they could mix the consistency of humor and action better, it would have been great."
    },
    {
      "rating": "5",
      "text": "Marginally better than the first. Characters have a little more depth and the humor is more balanced. That being said, it is still sadly mediocre."
    },
    {
      "rating": "5",
      "text": "\"Madagascar: Escape 2 Africa\" is a fun tale that is certainly enjoyable to watch, but it's story may feel similar to the first, and does lack in alot  of qualities that the best animated fare have to offer."
    },
    {
      "rating": "9",
      "text": "I think is better than preguel and sequel- more touching, less weird humor and animation is somehow better. Only what i hate is huge reference to Lion King, but otherwise, is fun for whole family"
    },
    {
      "rating": "6",
      "text": "Devoid of some great aspects of 'Madagascar', 'Escape to Africa' is, in all, a neatly written comedy, though it has dumbed down significantly from the first. The penguins are hysterical, the main five are great, and a goodbye to the hilarious Bernie Mac."
    },
    {
      "rating": "6",
      "text": "An okay sequel to an okay first movie, Madagascar 2 may even be better than the first one in some scenes, but overall it seems a bit tired and sloppy."
    },
    {
      "rating": "8",
      "text": "Not every sequel will come along and be this gigantic improvement over the first film, but the least it can do is try to at least stand on its own and be an entertaining film in its own right. That rings true here: while \"Madagascar: Escape 2 Africa\" is not leaps-and-bounds better than its predecessor, it's certainly a worthwhile successor: the characters are great and more well-developed, the animation is still great, the film has some great humor and a good amount of heart. Sure, it might not be as strong as some of DreamWorks' other efforts (it was released in the same year as \"Kung Fu Panda,\" after all), but \"Madagascar: Escape 2 Africa\" is a rock-solid film that will entertain people of all ages."
    },
    {
      "rating": "6",
      "text": "Madagascar attempts to recapture its image.\rThe film is semi-productive in its story which the first one seriously lacked. The only real problem is that the comedic element isn't but so apparent here. In conclusion, its entertaining, but not amazing."
    },
    {
      "rating": "8",
      "text": "Madagascar retorna menos potente que o primeiro filme, mas ainda ótimo. Talvez o maior destaque tenha ficado por conta dos pinguins, que aparecem mais."
    },
    {
      "rating": "7",
      "text": "The Madagascar sequel is a lot funnier and well paced than the original, I wouldn't say it's groundbreaking or anything like that but for the most part it's actually alright. Memorable characters, kinda' drags a bit, but it's still pretty entertaining."
    },
    {
      "rating": "7",
      "text": "Not as entertaining as the original but still relatively enjoyable, the sequel to Madagascar is stupid and absurd but funny, mainly thanks to its vocal talents and visual spark."
    },
    {
      "rating": "9",
      "text": "Better than the first I liked the animals more in this one than in any other and the comedy is fantastic!!! but unfortunately this is the only GOOD sequel."
    },
    {
      "rating": "6",
      "text": "Madagascar draws its sequel in the african savanna and was almost interesting but fun at the same time , more and more New Yorkers animals of emotion added to the third ."
    },
    {
      "rating": "7",
      "text": "Not as good as number one but still decent. The penguins are still hilarious and their scenes are the best. Funnily enough, it's a bit like Zoolander- Ben Stiller plays a guy who has a tough family but he's a model/dancer who's not as tough. Anyway, it's a decent film. Watch it if you enjoyed the first."
    },
    {
      "rating": "3",
      "text": "evan though it gets more indebted with the characters and origins and the beginning is good,the rest of the movie (except the  ending that was the only other good part) fell flat.Like a pancake."
    },
    {
      "rating": "7",
      "text": "While being an improvement of the first Madagascar movie, it's still worth to say that it only works if you... MOVE IT! Yeah, that's just basically it."
    },
    {
      "rating": "7",
      "text": "While it improves its characters, the sequel to the first Madagascar movie didn't do much to improve on the first one. However, it's still enjoyable, but not what I truly wanted."
    },
    {
      "rating": "6",
      "text": "There’s a nuttier, generally more diverting entertainment creeping, crawling and waddling along the edges of “Madagascar: Escape 2 Africa” than the larger one lollygagging on screen. This central story of this new animated movie, written by Etan Cohen and the directors Eric Darnell and Tom McGrath, involves Alex (Ben Stiller in low gear), a lion who in 2005 journeyed from New York captivity (i.e., a zoo) to the jungle in the first “Madagascar” with the usual mix of celebrity-voiced racial and ethnic stereotypes: a motor-mouthed zebra, Marty (Chris Rock); a nice if woefully neurotic giraffe, Melman (David Schwimmer); and the token girl, a hippo with a sizeable caboose named Gloria (Jada Pinkett Smith).\r Three years later Alex and company are literally ejected from Madagascar in a rickety plane operated by a penguin crew that’s led by the supremely confident, quite possibly insane Skipper (Mr. McGrath), a sleek ball of feathers and fat who simultaneously brings to mind Jon Lovitz, Phil Hartman, John Wayne and a cue ball. Along with his two sidekicks, a couple of stooges called Kowalski and Private (Chris Miller and Christopher Knights), Skipper keeps first the plane and then — after crash-landing on an African savannah — the movie moving with his deadpan delivery and with some surrealistic nonsense involving a barrel of laughing monkeys. (I see a big future for Mason and his silent partner, Phil, the two-chimp team whose lah-di-dah manners and sartorial flair recall that of the 1970s television ape, Lancelot Link.)\r With King Julien, a deranged lemur whose daft non sequiturs and bon mots are dropped and dribbled with dexterity and control by an unrecognizable Sacha Baron Cohen (at times sounding like a less frantic Robin Williams), the penguins and chimps could have skittered into something memorable. Alas, the filmmakers, who clearly are having as much fun visually with these scene stealers as they are aurally, stick by the contemporary American animation playbook: Alex has a dream (gotta dance), father issues (with Bernie Mac as the pride of the pride) and a requisite baddie rival (Alec Baldwin, who else?). There’s also an unfunny old lady with a Jackie Mason accent who deserves a violently cruel end, but this is a PG movie.\r Mr. Darnell and Mr. McGrath don’t appear especially committed to these stale conceits and character dynamics, which may explain why they spend so much time playing with the penguins, chimps and King Julien, who may not roar but certainly rules. There’s true playfulness here whenever this wacky animal pack takes over, a suggestion of delirium echoed by the zippy, at times overly zooming camerawork with its roller-coaster dips and swoops. And while the filmmakers throw the camera around almost as much as Brian De Palma does, every so often they slow down, giving you a chance to scan the softly muted colors of the landscapes and explore how the exaggerated character designs create a nice visual contrast with the photorealistic details and flourishes.\r It’s unsurprising that Alex’s mane registers as more realistic than any of his words or emotions, but it’s also a bummer. “Escape 2 Africa” is good enough in patches to make its distracting star turns, storybook clichés and stereotypes harder to take than they would be in a less enjoyable movie. Casting Mr. Stiller and Mr. Schwimmer may sear their brands onto under-age cerebral cortices but does nothing for the movie. And, really, did the hippo (voiced by will.i.am from the Black Eyed Peas) who courts Gloria with a low rumble and a suggestive shimmy have to sound like Barry White rather than, say, Marc Anthony or Justin Timberlake? I laughed, but honestly, if this country can vote colorblind surely its movie studios can animate colorblind too. (Can’t they?)"
    },
    {
      "rating": "7",
      "text": "Funny and well animated. Expressive voice overs, good screenplay. It's not one of the best animated films of recent years but it is fun and entertaining. The penguins are hysterical."
    },
    {
      "rating": "8",
      "text": "This is a funny and great movie. It has a lot of jokes and a couple (kinda) serious moments, but they mix well. I would also like to say the best part is adding onto the original characters and showing where they came from."
    },
    {
      "rating": "8",
      "text": "Usually, when a film achieves remarkable financial success, the film industry arranges for space for one or two sequels. This is what happened with \"Madagascar\", but the sequel was able to maintain the initial level of quality. In this film, the attempt of the four zoo animals to return to the US fails and, by great coincidence (this only happens in the films), they end up falling in Central Africa, in the animal reserve where Alex was born, which allows him to know his parents and origins. The film is very good and fun, it retains most of the cast and voice actors of the original film and adds or recovers some characters, such as the Elder Lady, who gains some protagonism here, alongside Alex's parents. I also noticed that some characters who, in the initial movie, were secondary, were now approached for a more central space, a measure that was certainly the response to the affection they gained from the public. This is the case, for example, of King Julian. The four central characters do not change much, but the script tried to give them more space and attention to counterbalance the weight of several charismatic secondary characters. The script recaptures an old tradition of animated films and creates moments where it conveys moralistic messages, especially regarding the differences between individuals (the events between Melman and Gloria and Marty's dilemma with the other zebras are just two examples). Personally, I have nothing against this militancy implied in the film. Voice actors continue to perform flawlessly, as well as drawings, animations, and cinematography. Oddly enough, this movie is very poor in music or great songs. There are some, but none deserve particular attention."
    },
    {
      "rating": "8",
      "text": "Madagascar: Escape 2 Africa was so ridiculous that it was good. 90% of it was nonstop laughter, but there were some cheesy bits in it. If you’re looking for a fun movie to watch, and your in the mood to laugh super hard, this Madagascar sequel is a good choice."
    },
    {
      "rating": "7",
      "text": "La historia creo que mejoro aunque sacrificaron algo de humor. Puede ser inferior a la primera pero sigue teniendo sus momentos que hacen que volver a verla valga la pena, especialmente los pinguinos, la anciana o personajes como Melman o Gloria que no eran la estrella principal de la anterior (entre otros personajes menores), y acá como que se les dio mas importancia. Madagascar 2 es una película que me hizo pasar un buen rato. La recomiendo."
    },
    {
      "rating": "10",
      "text": "I like em big and chunkyI like em big and chunky Moto Moto is easily the greatest character in the movie. He is easily up there with big chungus and shaggy as best fictional characters. Plot twist moto moto gets rejected. F for moto moto. The name is so nice I say it twice."
    },
    {
      "rating": "7",
      "text": "I think it is better than the previous chapter, but I don't like it. I would give it a 65 but I cannot. The beginning is good, but Alex's problem with his parents and the problems of others is boring, the hippos and giraffe. .."
    },
    {
      "rating": "8",
      "text": "Love the sequel as well. Honestly the whole series is pretty funny. This also kept me laughing almost throughout."
    },
    {
      "rating": "7",
      "text": "Madagascar 2 is a sequel to the animated comedy Madagascar and it succeeded.  It is even better than the previous part and it is mainly due to the story, which plays a bigger role compared to the previous part.  The comedy is also excellent here again, but what the previous part forgot is a story that is better here.  Overall, this is a good film and for me the best part of the series.  I recommend."
    }
  ],
  "recommendations": [
    "penguins_of_madagascar",
    "robots",
    "spies_in_disguise",
    "despicable_me",
    "ice_age_the_meltdown",
    "madagascar",
    "the_lego_movie_2_the_second_part",
    "despicable_me_2",
    "hotel_transylvania_2",
    "rio_2",
    "the_lego_batman_movie",
    "despicable_me_3",
    "hotel_transylvania_3_summer_vacation",
    "ferdinand",
    "puss_in_boots_the_last_wish",
    "the_croods",
    "smurfs_the_lost_village",
    "over_the_hedge",
    "kung_fu_panda_2",
    "flushed_away",
    "ice_age",
    "thor_ragnarok",
    "incredibles_2",
    "ghostbusters_ii",
    "minions"
  ]
}