{
  "id": 523,
  "title": "Madagascar",
  "starring": [
    "Ben Stiller",
    "Chris Rock"
  ],
  "runtime": 86,
  "genre": [
    "Family",
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "description": "Alex the lion is the king of the urban jungle, the main attraction at New York's Central Park Zoo. He and his best friends—Marty the zebra, Melman the giraffe and Gloria the hippo—have spent their whole lives in blissful captivity before an admiring public and with regular meals provided for them. Not content to leave well enough alone, Marty lets his curiosity get the better of him and makes his escape—with the help of some prodigious penguins—to explore the world.",
  "releaseYear": "2005",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zMpJY5CJKUufG9OTw0In4eAFqPX.jpg",
  "categories": {
    "plot": 5.71875,
    "acting": 6.380952380952381,
    "ending": 5.0,
    "soundtrack": 1.0,
    "cinematography": 5.0,
    "familyFriendly": 6.818181818181818,
    "funny": 5.878787878787879,
    "action": 7.8
  },
  "reviews": [
    {
      "rating": "10",
      "text": "the lemurs are so funny i cracked up laughing and dancing about that song so everybody stop giving this movie a low score and MOVE IT!"
    },
    {
      "rating": "6",
      "text": "\"Madagascar\" is silly and funny at the beginning, and starts getting strangely annoying and dull as it draws nearer to the end. I would recommend this film for kids, but for adults, it would be alright but you'll probably forget it in a couple of days."
    },
    {
      "rating": "8",
      "text": "A delightful ploy of city animals desperately attempting to get back home, 'Madagascar' has a sort of panache that most animation films try to have, but fail. All the animals are fun and hilarious, significantly the penguins. I don't see why this film is an average. It's a charming spectacle."
    },
    {
      "rating": "8",
      "text": "this is a great zoo movie, Marty is great, Alex is great, Gloria is a great hippo, and melmon is my favorite hypochondriac. all around amazing,and what I expect from dream works."
    },
    {
      "rating": "7",
      "text": "It's another animal adventure from DreamWorks. If you like to move to the beat, this movie's for you. It's not that memorable anyways, but the feelings are granted and the funniness works."
    },
    {
      "rating": "9",
      "text": "One Of DreamWork's BestMadagascar Is A Very Memorable Film With It's Characters And Comedic Voice Acting (ESPECIALLY Sacha Baron Cohen As King Julien)"
    },
    {
      "rating": "5",
      "text": "Now, in \"Madagascar\", Dream Works presents their homemade movie formula of \"15% story and 85% fun\". It may be amusing for the kids that have pure, honest hearts, but for the adults the film's baffling and confusing."
    },
    {
      "rating": "5",
      "text": "As a member of New York's historic Congregation Emanu-El, I thought it was great that the animators included an exterior shot of that beautiful house of worship in the background of one of Alex's earlier scenes, so much so that I mentioned it in the Temple Bulletin and DreamWorks sent them a copy of a still from the movie. Other than that, it had very little going for it."
    },
    {
      "rating": "0",
      "text": "Insufferable."
    },
    {
      "rating": "2",
      "text": "There is nothing good about this movie except its impact to children, which is the reason I gave a 2, not a 0, and for its memorable anthem, that is I LIKE TO MOVE IT MOVE IT, which for me is super horrendous and corny..............."
    },
    {
      "rating": "7",
      "text": "Madagascar is an okay movie, but it lacks in substance and story. Most of the movie relies on corny jokes and sight gags to get its humor, which can be hit or miss."
    },
    {
      "rating": "9",
      "text": "this movie is one of the best movies of 2005 next to star wars revenge of the sith!"
    },
    {
      "rating": "9",
      "text": "Funny,Sweet and Highly Addicting."
    },
    {
      "rating": "7",
      "text": "I could see a fantastic movie here - until the end. It was really good start -middle but it just ended suddenly. I enjoyed the film but I would've given it a higher score if it had a better ending."
    },
    {
      "rating": "7",
      "text": "Good."
    },
    {
      "rating": "10",
      "text": "Very funny."
    },
    {
      "rating": "8",
      "text": "I was expecting the best animated feature film of the year, it wasn't, but it has the wit and style we look for in one. It's funny and the kids will love it. ps: the penquins are hilarious!"
    },
    {
      "rating": "6",
      "text": "Yes, Madagascar can be funny at times, but it lacks the wit and charm of Shrek, its sequel, and Over the Hedge. But at least it's an improvement over the disatrous Shark Tale."
    },
    {
      "rating": "6",
      "text": "The penguins rocked. The rest sucked. My 5 year old sister liked it though and alot of my friends do too. I was bored with it."
    },
    {
      "rating": "2",
      "text": "Yes, the animation was fair. The voices were not that realistic. It had absolutely NO PLOT. There was barely any good jokes. Actually there wasn't any good jokes. The only cool thing about this movie is the song \"Move It\" and that the animation was fair. But, those are not what makes a good movie. Definately the animation part, I said FAIR, they really could of gotten better and more realistic animation. But, even that only plays a small part of a good animation. The real part is this is ANIMATION!!! Not reallity. Animated movies are suppposed to creat things that truly entertain the minds of people. This was way to ordinary. Hasn't any of you already thought of a bunch of zoo animals washing up on a shore of an island? This is orgiinal. The jokes were the lamest jokes ever, they're worse then my friends jokes! When he tries to crack one everyone who hears it wil go totally silent, everytime. This is no hyperbole, everyone goes silent when he tries a joke, even if we are cracking up at the table."
    },
    {
      "rating": "1",
      "text": "Boring. The writing is so lame and the story and jokes so bad."
    },
    {
      "rating": "10",
      "text": "One of the best movies."
    },
    {
      "rating": "1",
      "text": "I waited forever to see this popular CGI-fest because Robots and Shark Tale left me cringing in abject terror at any piece of 3-D computer-generated animation NOT bearing the Pixar label...but the short subject featuring the Madagascar penguins that preceded Wallace & Gromit: The Curse of the Were-Rabbit turned out to be surprisingly bearable (if immediately forgettable compared to the feature that followed), so I ponied up my $2.50 to finally check it out at a discount theater, and guess what? This turned out to be by far the worst of the sorry bunch: a film so relentlessly shrill, assaultive, headache-inducing, self-satisfied and aggressively unfunny that it ALMOST made me want to re-evaluate Shark Tale, which at least had some well-cast voices, and Robots, which boasted some impressively elaborate animation set-ups. (Notice that I said ALMOST; life is already too short, I just blew 80 minutes on this, and I'm sure there are sock drawers that need rearranging somewhere.) This completely heartless, soulless and utterly disjointed tale of city zoo animals forced back into the wild, where they have to face their primal instincts and temptations certainly had potential, but stampedes it completely beneath an endless cacaphony of pop-culture riffs and movie references (I hesitate to even call most of them \"jokes\"; they're so joyless and perfunctory that they're far more accurately described as checklist items) that take the place of a cohesive script; this is exactly the same chop-suey corporate writing approach that turned The Simpsons from what was at one time the greatest TV show on the air to the completely unwatchable farrago it is today. I was shocked to see Hans Zimmer's name credited to the music; his work may have been one of several contributions to turning The Lion King from an animated kiddie musical into a dramatic movie of real heft, but Madagascar is so wall-to-wall loaded with push-button soundbites from TV and movies (the worst example: the Hawaii Five-O theme IMMEDIATELY followed by the Chariots of Fire theme) that I honestly don't recall any background music that Zimmer contributed! I'm certainly well aware that the history of popular animation--from Warner Bros. Looney Tunes cartoons to Rocky and Bullwinkle to even the early years of The Flintstones--includes many examples of simultaneously appealing to kids on one level while pitching jokes to adults that the little ones won't catch (the \"NUTS\" gag in the Wallace & Gromit movie is a delightful contemporary example of this) ...but Madagascar tips the scale so far one way that it made me start to understand Michael Medved's appreciation of Barney the Dinosaur playing 100% to his wee audience and completely chucking the smart-aleck postmodernism, especially during the truly hateful bit about cute little creatures being devoured in the jungle that made one little guy in my audience burst into sobs. The character design is harsh and repellent, with the lemurs' egg-yolk eyes in particular being...well, an eyesore; the animation, especially of people and crowds, is frequently inept; of the voices, Chris Rock comes off as the most overbearing, Jada Pinkett Smith the least, and most of the others far closer to Rock than Smith. Some have argued that Madagascar's uber-rapid-fire, yock-on-top-of-yock approach carries on the tradition of what Tex Avery did so successfully in the 1940s and 1950s, but there IS a crucial difference: Avery's features worked because he limited them to 7 minutes. But then, Madagascar is hardly a movie that respects its betters: early on, a couple of monkeys discuss flinging their poo at Tom Wolfe. Now we can agree to disagree about I Am Charlotte Simmons, but for a group of hack committee sitcom writers to make a comment like that about the master satirist who wrote the brilliant novels The Bonfire of the Vanities and A Man In Full (whether he wears a white suit or not) merely underscores the wise old agage: throw one piece of poo, get 1,463,892 pieces of poo thrown back at yourself. At least!"
    },
    {
      "rating": "10",
      "text": "Best movie i've seen in a while. i love the movie so much i quote it on a regular basis. who will ever be able to forget the penguins and their escapades. whoever thinks that this movie was bad must have lost their sense of humor. to them i say, \"If you have any poo fling it now.\""
    },
    {
      "rating": "10",
      "text": "It was a beautiful masterpiece, even more exciting than star wars. Filled with sensational dialogue and heart warming comedy, the zoo animals take us on an exciting adventure through the WILD. Rivaling the Godfather, Citezen Kane, and Star Wars for the greatest cinematic experience of all time with superb animation. I LOVE this movie."
    },
    {
      "rating": "6",
      "text": "Do not get me wrong I do not hate Madagascar but this film could have been a lot funnier and/or a lot more heartwarming. Look at the first two Shrek movies, those movies were funny and had a lot of heart. In Madagascar you see a film that is trying to recreate what worked so well in that movie and in some cases succeed but in some cases fall flat on its face. You have a really entertaining beginning with some good laughs and an equally entertaining finale. However, in the middle the good jokes are few and far between and it becomes hard to care for the main characters due to the excessive amount of time devoted to arguing rather than advancing the plot and/or coming up with jokes. Plus, the only really funny characters are barely in the movie. However, I doubt most people especially kids will mind. If you are a child you will probably enjoy this film like I did when I was a kid. Adults may/may not get thorugh this film ok but it is watchable. While I do not think it is as good as Shrek I do not think it is bad. Enough of the jokes work, there is some heart, and the side characters are pretty funny. If you are looking for a couple laughs this film will satisfy. However, if you are looking for that really funny and/or heartwarming film like Shrek you will not find it here. This film is not the next Shrek. Instead we have a decent film with a few good laughs and amusing side characters that is a rent. Second act of this film really brings it down but some good laughs in the first and third acts make it watchable."
    },
    {
      "rating": "7",
      "text": "its not an excellent movie, but to be fair, its rather perfect. the animation is nice, the characters aren't so bad, and the songs are so nice and cool. Madagascar is a perfect summer flick for kids and adults."
    },
    {
      "rating": "0",
      "text": "Easily the worst movie I have ever seen. Even though I was much younger when I saw it, I was very disappointed with the lack of sophisticated humour. Awful...Absolutely awful..."
    },
    {
      "rating": "8",
      "text": "A fun movie. It's quite funny, the plot's all right and it's well voiced. It's not as good as Shrek, or anything Pixar have made but it is one of the better Dreamworks films. Falls short of greatness due to the fact that it is now starting to show it's age, which is a shame."
    },
    {
      "rating": "7",
      "text": "A fun animated film. While it does have little of a lesson to learn from it, the characters are fun and the story is unique (until The Wild was released)."
    },
    {
      "rating": "6",
      "text": "Fairly entertaining and some great characters, particularly the penguins and lemurs."
    },
    {
      "rating": "5",
      "text": "It is not nearly as funny as people will hope or as it should be but it is sometimes funny and features great voice acting and memorable moments kids will talk about forever. I give this movie 56%."
    },
    {
      "rating": "5",
      "text": "Solid voice acting, but its story is too simplistic. Simply fails at being entertaining throughout, even with its short length. Bland animated feature."
    },
    {
      "rating": "6",
      "text": "Great animation! DreamWorks and Nickelodeon made one of the most famous animated features of our generation! I haven't seen the other two parts yet though"
    },
    {
      "rating": "5",
      "text": "I can honestly say, this is a mixed bag. With the story of Alex, Marty, Gloria and Melman escaping from the zoo, they escape with some pretty funny scenes and ending with bad fighting scenes. Nuff said."
    },
    {
      "rating": "5",
      "text": "\"Madagascar\" uses most of its humor on animals doing things that humans do, and while its okay, its quite dragging. The film is overall fun and somehow enjoying, but its pop culture references are tiresome with... well, all Dreamwork Animation films. New characters have moments of shine  especially the penguins, and while it plot lacks nearly any clever ideas, its humor can almost, but not quite, help it pass on by."
    },
    {
      "rating": "8",
      "text": "The first in a series of highly popular DreamWorks films, \"Madagascar\" still stands as a pretty great film. Funny, visually great and featuring some extremely charming and outstanding characters (notably King Julien), \"Madagascar\" is a surprising winner after the struggle that was \"Shark Tale\" and it's certainly a worthwhile watch."
    },
    {
      "rating": "5",
      "text": "Madagascar advances to a point.\rAgain DreamWorks attempts the same plot of just trying to be fun without much substance. Madagascar becomes entertaining until it simply gets old with little to no backbone."
    },
    {
      "rating": "8",
      "text": "Before watching this film: No related film precedes this.\r Premise: A couple of city zoo animals were wrongly released back into the wild after a animal rights protest and a boat sinking and the animals must adapt to live in the jungle.\r Pros:\r1) The big four animals are fun and interesting.\r 2) The penguins, monkeys and lemurs are great supporting characters and they often outperform the main four animals in making the film good.\r Cons:\r1) The film slowed down in the third quarter and there were less jokes as the film becomes introspective. This should not have been allowed to happen.\r Score: 4/5 (no half score). Good enough to watch it in the cinema.\r Who would be satisfied with this film? All children would love it. For others, the older you are, the less you would love it."
    },
    {
      "rating": "9",
      "text": "Madagascar, um dos filmes de desenhos animados mais cativantes e legais que eu já assisti. Talvez esse, junto com Shrek, sejam os melhores trabalhos da DreamWorks."
    },
    {
      "rating": "6",
      "text": "It's modestly alright, a lot better than Shark Tale. The character animation reminds me of Looney Tunes movements. It has a better story line and more interesting characters, but can drag on a bit. Overall Madagascar is alright for the most part"
    },
    {
      "rating": "8",
      "text": "Pretty funny, and all voices are perfect. The best characters by far are the penguins. They have the best lines, the creepiest voices, and are just so darn entertaining!"
    },
    {
      "rating": "6",
      "text": "Holed up in Central Park Zoo, pampered zebra Marty (Rock) gets itchy hooves and decides to explore the Big Apple. When his buddies — vain lion Alex (Stiller), straight-talking hippo Gloria (Pinkett Smith) and neurotic giraffe Melman (Schwimmer) — go after him, their rescue mission goes belly-up, seeing the four friends carted off to the untamed wilds of Africa.\r There is something deliciously neat about the premise of DreamWorks’ latest CG offering; taking institutionalised zoo animals and throwing them into their natural, wild habitat is an idea seemingly full of rich pickings. But Eric Darnell (Antz) and Tom McGrath’s (The Ren And Stimpy Show) film fails to fully mine the concept for comedic gold.\r It is visually splendid, has a smattering of good set-pieces and gags and a likeable atmosphere, but it does not have the coherence nor the consistency to give anyone at Pixar a sleepless night.\r et where Madagascar falls down is in simple storytelling know-how. In the initial zoo sequences, the motivations and set-ups are clearly defined, but when the characters get shipwrecked, the plotting runs aground with them, grinding to a halt as the foursome argue for an eternity on a sun-kissed beach. While the characters are likeable riffs on the actor’s recognisable personas — Schwimmer’s giraffe is Ross Geller with a long neck — none of them are loveable, so the film fails to deliver the requisite uplift it is so patently striving for.\r More enjoyable than Shark Tale but falling way short of Shrek, Madagascar doesn’t really live up to the promise that the idea and voice talent deserve. But it’s still spirited, amiable, featherweight summer fun."
    },
    {
      "rating": "7",
      "text": "This gave the franchise a great start but it should have featured more of the penguins!!! the characters can sometimes be quite annoying but it definatley has some good comedy in there as well!!!!"
    },
    {
      "rating": "6",
      "text": "Madagascar has been a slightly funny movie, the characters entretenieron us , we not only fun , even a little , but the plot , the animation and the son the good script."
    },
    {
      "rating": "8",
      "text": "THIS is the best in the series. It's the original and the most underrated. The penguins are brilliant comic relief characters and the Lemurs are pretty good too. I have no idea why it's the lowest rated in the franchise. Oh well. At least the users gave it a \"generally favourable\" score. I agree with them a lot more than critics here. If you like Dreamworks, you'll like this."
    },
    {
      "rating": "7",
      "text": "The penguins were hilarious. The lemur king was also amusing, and so was Melman the the giraffe. It was, however packed with corny jokes and some of the sub-plots dragged on a bit. I won't be seeing the sequel if their is one."
    },
    {
      "rating": "8",
      "text": "WHAT I LIKED: A whitty animation that will appeal to adults and children alike - 'Madagascar' is paugh out loud funny. The characters are well realised (partially thanks to their voiceovers) so everyone can get into the story\rWHAT I DIDN'T LIKE: It's not the most interesting film in terms of plot, so isn't as classic for family watching as a pixar etc.\rVERDICT: A fun and pacey animation that everyone will enjoy."
    },
    {
      "rating": "7",
      "text": "Madagascar is a good movie. It lacks real emotion to me, and it can just get to weird and crazy at times,but it still has some good characters and jokes to make it an enjoyable ride."
    },
    {
      "rating": "7",
      "text": "Madagascar is a colored adventure, full of corny jokes and great characters, that uses simple story-telling and an unremarkable plot. Despite the negative antecedents of this nothing-special film, it's a true family-friendly film, that more than the half of the audience will like, specially united families."
    }
  ],
  "recommendations": [
    "flushed_away",
    "shaun_the_sheep_movie",
    "puss_in_boots_the_last_wish",
    "hotel_transylvania_3_summer_vacation",
    "madagascar_escape_2_africa",
    "ice_age",
    "robots",
    "storks",
    "the_croods",
    "hotel_transylvania",
    "despicable_me",
    "penguins_of_madagascar",
    "ice_age_the_meltdown",
    "bolt",
    "peter_rabbit",
    "rango",
    "rio_2",
    "rio",
    "despicable_me_2",
    "hotel_transylvania_2",
    "spies_in_disguise",
    "the_lego_movie_2_the_second_part",
    "megamind",
    "captain_underpants_the_first_epic_movie",
    "the_lego_movie"
  ]
}