{
  "id": 4512,
  "title": "Made of Honor",
  "starring": [
    "Patrick Dempsey",
    "Michelle Monaghan"
  ],
  "runtime": 101,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Tom and Hannah have been platonic friends for 10 years. He's a serial dater, while she wants marriage but hasn't found Mr. Right. Just as Tom is starting to think that he is relationship material after all, Hannah gets engaged. When she asks Tom to be her 'maid' of honor, he reluctantly agrees just so he can attempt to stop the wedding and woo her.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pDg8D0jNqmz7RbCBgblWvmPswHE.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 2.4,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "By-the-numbers material about a closeted, currently-in-denial homosexual man (my opinion only and not necessarily that of the film) named Tom who decides to selfishly destroy the upcoming wedding of his friend because he decides at the last second that he wants her all to himself.  All the \"chick flick\" cliches are in place and quite dull to behold.  Wait... why am I even reviewing this???"
    },
    {
      "rating": "5",
      "text": "The movie will keep you occupied for the better part of it. Some funny parts although its entirely predictable. Good date movie to take your girl to."
    },
    {
      "rating": "0",
      "text": "Predictable, bland, and we are expected to root for the cad who flaunts the fact that he chases every woman he sees. And Hannah cheats on Colin with Tom and we're still supposed to care about what happens to her? I didn't. What creeps."
    },
    {
      "rating": "2",
      "text": "This movie is completely inappropriate for children 16 and younger. It is a cheesy modestly entertaining chick-flick that relies on an unnecessary surplus of suggestive sexual innuendo to keep the 18-22 year old crowd giggling. I was disgusted in the PG-13 Rating."
    },
    {
      "rating": "2",
      "text": "Formulaic and not all that funny. The only saving grace is that up until the end, Michelle Monghan makes a fairly likeable character and has agreeable chemistry with Patrick Dempsay. Completely predictable though."
    },
    {
      "rating": "0",
      "text": "Utterly boring and predictable. Not funny at all."
    },
    {
      "rating": "0",
      "text": "A man as a bridesmaid...semi-creative, I give that. A man as a bridesmaid played for stereotypical and cheap laughs...stupid."
    },
    {
      "rating": "6",
      "text": "For the sake of credibility, there should be a scene in which Hannah(Michelle Monaghan) broaches the subject of her best friend's serial dating as a serious matter. Hannah loves her best friend Tom(Patrick Dempsey) unconditionally. But if they are to give people something to talk about, Hannah needs to set some conditions for Tom, so she can be rest assured that his womanizing ways are a thing of the past. A promise. But that's too complex for \"Made of Honor\". After all, Tom is a good man. How do we know? He pets strange dogs and helps old people into their rowboats. Even though Monaghan brings an innate intelligence to her role, the film asserts that a woman's heart is bigger than her brain. \"Made of Honor\" is an insult to any smart woman's intelligence, but Monaghan and Dempsey have an effortless chemistry that can't be dismissed. The whole point of going to the movies is to be entertained, but sometimes, a little truth would be nice. And the truth is: Tom's a bit of a cad, but his rough edges are smoothed out by a patriarchial paradigm and American boosterism."
    },
    {
      "rating": "7",
      "text": "This is why scores never really show how good a film is. Its not one you'll enjoy if your being stuck up, or watching alone. Its a chick flick that i enjoyed to watch with my girlfriend! It was fun and predictable, exactly what you want when trying to relax. Although he starts unpleasant the main character slowly seems to change and becomes a nicer character. All in all it was fun i don't know where all the complaints come from."
    },
    {
      "rating": "0",
      "text": "What a homophobic piece of trash. A waste of film. Homophobia was so last century, to be gay is NOT to be feminine, and finally...absolutely not funny. Stop pushing stereotypes and cheap laughs, movie producers and directors. Just like P.S. I Love You and other recent cheap crass unfunny movies, gay guys or being played are played for cheap laughs. Have some creative jokes for a change."
    },
    {
      "rating": "0",
      "text": "To make money and get cheap ignorant laughs from tired, old, ugly, and FALSE stereotypes about gay people is not admirable. It's the opposite of that. A boring, senseless, pointless, ignorant movie. Minutes wasted."
    },
    {
      "rating": "6",
      "text": "Predictable but cute, I think the reviews are a bit harsh. Michelle Monaghan is charming, but Patrick Dempsey as some irresistible stud is a bit far fetched. Funny and enjoyable."
    },
    {
      "rating": "3",
      "text": "Too generic, same old same old romantic comedy. What made this apart from being one of the worst movie are the characters of Michelle and Patrick."
    },
    {
      "rating": "10",
      "text": "Funny and entertaining from start to finish."
    },
    {
      "rating": "0",
      "text": "Completely unfunny and non-entertaining from start to finish. Word."
    },
    {
      "rating": "7",
      "text": "Patrick Dempsey's comedic timing helps raise this generic rom-com to newer heights, strengthening the altogether warm and enjoyable atmosphere."
    }
  ],
  "recommendations": [
    "27_dresses",
    "the_ugly_truth",
    "hall_pass",
    "trainwreck",
    "the_change_up",
    "bad_moms",
    "the_40_year_old_virgin",
    "bridesmaids",
    "what_happens_in_vegas",
    "dirty_grandpa",
    "knocked_up",
    "good_luck_chuck",
    "the_wrong_missy",
    "neighbors_2_sorority_rising",
    "superbad",
    "legally_blonde",
    "no_strings_attached",
    "tammy",
    "zookeeper",
    "the_proposal",
    "bad_santa_2",
    "bad_teacher",
    "rough_night",
    "the_ridiculous_6",
    "that_awkward_moment"
  ]
}