{
  "id": 2769,
  "title": "Maggie",
  "starring": [
    "Arnold Schwarzenegger",
    "Abigail Breslin"
  ],
  "runtime": 95,
  "genre": [
    "Horror",
    "Drama",
    "Mystery"
  ],
  "description": "There's a deadly zombie epidemic threatening humanity, but Wade, a small-town farmer and family man, refuses to accept defeat even when his daughter Maggie becomes infected. As Maggie's condition worsens and the authorities seek to eradicate those with the virus, Wade is pushed to the limits in an effort to protect her. Joely Richardson co-stars in this post-apocalyptic thriller.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/twa9gXjocLM629sJrQYVtmF306R.jpg",
  "categories": {
    "plot": 7.2105263157894735,
    "acting": 7.403225806451613,
    "ending": 7.923076923076923,
    "soundtrack": 9.0,
    "cinematography": 5.75,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.333333333333334
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Brilliant drama,\rCinematography has a minimalistic arthouse vibe, perfectly accompanied by a subdued soundtrack.\rIt shows that Schwarzenegger has more to offer then what he is famous for, one liners and cool action cinema. Nothing really to say about it but to recommend it strongly to anybody who like films atmospheric, slightly depressing and smart."
    },
    {
      "rating": "10",
      "text": "Maggie is unique, intense and original. Arnold Schwarzenegger is awesome, best performance of his career. Its a must watch for drama fans, just do not confuse this with a horror movie."
    },
    {
      "rating": "6",
      "text": "Time to time, \"Maggie\" has its melodramatic, tear-jerking moments, but the movie is just mostly a huge boring sequence of events with a wandering plot and sub-par acting."
    },
    {
      "rating": "8",
      "text": "Maggie is the film that finally shows an emotional side to zombie films. This movie is not about killing all the infected people in sight. I think that Maggie has a least four excellent performances. The best is definitely Abigail Breslin. It is Arnold Schwarzenegger who is going to bring people to the theatre to see this movie but it really is Breslin's film, she is really the star. Schwarzenegger however is not his normal self. The man can act, and I'm sure that this film will never receive the credit it should because Schwarzenegger is in it and people are too quick to judge it by its cover. Maggie is slow but the performances managed to keep me interested. The film is also dark which perfectly captures its tone. I think that people need to go into this movie with an unbiased mind and it could really be enjoyed."
    },
    {
      "rating": "8",
      "text": "Beautiful shots, full of suspense and a decent cast all combine to make Maggie an enjoyable film. The story is believable and not your usual apocalypse scenario."
    },
    {
      "rating": "8",
      "text": "I don't think I've ever seen a movie like Maggie. This movie hit me hard emotionally when I saw it a month ago and I have not been able to get it out of my mind since. Arnie plays a father who shows his daughter love, devotion, trust and dignity after she is bitten and infected with a virus that will eventually turn her into a zombie like state, Where everyone else pretty much gives up on her he refuses to. Abigail Breslin plays Maggie as a teenager who accepts her fate without any outlandish behavior and just wants to be with family when the end comes, Her father is the only real family she has left. Breslin is outstanding in this role, she reminded me a lot of my own daughter which is probably why it hit me so hard. If the movie concentrated on just these two and trimmed maybe 10 to15 min I would have given this movie a 10"
    },
    {
      "rating": "2",
      "text": "Maggie 2015 is one of those movies that is a great example of how not to make a movie and how to waste everyone's time.\r Not everything in it is bad, acting, some scenery is good, tbh, but if you enjoy watching depressed people walk around, this one is for you."
    },
    {
      "rating": "7",
      "text": "I liked this film, and I really wish I could give it a higher score.\r The script is terrific, exploring the overdone zombie genre uniquely as a heart-wrenching family drama. The film focuses on both a father's anguish at having to choose the ultimate fate of his terminally ill daughter, as well as the young girl's struggle to face her impending death on her own terms.\r The performances are terrific, surprisingly, since I don't usually associate Arnold Schwarzenegger with art-house acting showcases like this. The aging action hero does as good a job as anyone has a right to expect him to, and his face is well-suited for the somber material. Abigail Breslin outshines him, of course, with an amazing performance assisted in no small part by a top-notch makeup department.\r Unfortunately it's Director Henry Hobson, making his feature film debut, who keeps the movie from being everything it should have been. With his shaky, handheld shots and dingy orange-gray palette he's obviously trying to thread the needle between artsy and scary, but he doesn't pull either off particularly well. To be perfectly frank, sometimes I have no idea what he's aiming the camera at.\r If you can stand the uneven quality of the direction, and you love both zombie films and melancholic character pieces, this is a must-watch. Otherwise, I'd wait until it pops up on Netflix."
    },
    {
      "rating": "3",
      "text": "f the audience goes into this movie thinking Arnold is going to be fighting zombies and killing bad guys, they will be extremely disappointed. Maggie is simply a father-daughter drama, taking place in an apocalyptic world with not much else going on.\rThe film revolves around the character “Maggie” played by actress Abigail Breslin (Little Miss Sunshine, Zombieland) who is infected with a deadly virus that eventually transforms her into a zombie. Then we have veteran actor, Arnold Schwarzenegger (The Terminator, Predator) who plays the caring father who tries his best to help his infected daughter until the end.\rAs for the film, not a lot goes on or happens, other than Arnold and Abigail’s characters attempting to have quality time, and engage in conversations that the audience did not care for.\rThe film does a horrible job at keeping the audience interested and engaged while also lending a depressing tone or feel that ultimately allows the audience to feel unconnected with the characters.  I’m not saying that all movies need to have action or a predominantly jolly and happy tone to it, but if they do choose a depressing tone, there should be a better effort on their part to establish deeper connections amongst the characters. The film “Maggie” had my peers and I feeling quite relieved when it was finally over.\rIn conclusion, this is a film that had a lot of potential to be great, but sadly falls short of that.  On a positive note, the film had originality and a brand new take on the zombie genre.  Other than that, nothing special here.\r Final Score: 3/10"
    },
    {
      "rating": "7",
      "text": "Maggie is a film that was marketed as a slow drama with zombies. It turned out to be a pretty good slow drama that had a fresh take on the zombie apocalypse story we all know. It is widely disliked for not being an action-packed piece of crap with Arnold Schwarzenegger cracking one-liners constantly like they all thought it was going to be. If someone could explain that to me, that would be great.\r But seriously, Maggie is a pretty good little film, not perfect, but pretty good. It surprised me with it's simplicity and nice cinematography, as well as the acting. Arnold actually gives a very good performance as a father who has to deal with his daughter slowly becoming something else, and knowing he will have to do something about it. But this is Abigail Breslin's movie. She was VERY good as the title character. Joely Richardson was also pretty good as her step-mother. The direction was pretty good by first timer Henry Hobson, and I really liked how some of the shots were set up. Really, my only complaint is that the dialogue could have been touched up some. But overall, Maggie is a nice little slower drama with horror overtones, and a welcome lower-key take on the zombie genre. Without giving anything away, I think the ending was perfect."
    },
    {
      "rating": "9",
      "text": "The normal zombie movie would be all about killing zombies with strange weapons or firearms, but this movie give us a new perspective. It was very touching see how Maggie sickness advance and i think everybody have acted well during the movie. All the characters act realistically from Wade and Maggie to Caroline and the cops that want to finish the work faster because they don't want have further problems.  It's a drama story, this is not an action movie or horror one , but it can touch you like the past two genres won't do. If a movie is slow is not a problem and i've not found this movie so slow. Great Movie , i hope independent production realesed more often movies like this."
    },
    {
      "rating": "6",
      "text": "Decent movie. Don't listen to the likes of \"ArkhamKnight \" here. if you look at his profile, all he does is bash movies he does not understand. It s a decent movie. nice to see Arnold in a different role."
    },
    {
      "rating": "10",
      "text": "Every moment of Maggie is brilliant and emotional. Breslin and Schwarznegger both give solid performances, and the movie is very, very, well written. Henry Hobson has done justice to Arnold fans, and given him the role of his lifetime. I can compare Maggie to my favourite video game, The Last Of Us. The result is haunting, suspenseful, terrifying and thrilling, every moment was crackling with suspense, an eerie quietness and powerhouse performances and emotions. Wade knows that Maggie will die, but he stays close to her till her last breath. Maggie captures the relationship between a father and her daughter masterfully. It's dark and scary, and meets the requirements of a zombie outbreak and its effect hits home. Maggie deserves a staring ovation. It's brilliantly written, sharply directed, masterfully acted and well executed. Take your father to watch this one, it's a love letter to all fathers in the whole world. Being a father himself, Schwarznegger beautifully captures a role of a father struggling to help his daughter before she turns into the things he most hates. Maggie deserves to be watched. 10/10."
    },
    {
      "rating": "7",
      "text": "This was a wonderful movie about a family having to deal with the inevitable death of their daughter. It touches on death and knowing that a loved one will die and how people around them cope with it. Great movie"
    },
    {
      "rating": "10",
      "text": "It was awesome to finally see Arnold in a serious dramatic role. The movie is slow and tragic but that is what makes it so unique to the genre. Maggie is a fantastic piece of work that reminds me of \"The Last of Us\" in its best moments. Sad thing is most people probably won't be able to sit still long enough to enjoy it."
    },
    {
      "rating": "10",
      "text": "For every dumbass review of zero I will score it a ten.Arkham you are a ra tard. You know NOTHING about movies.Police Academy got a 7 and you think a zero is fair? Go watch Batman .How many different Batman's are there anyway? Enough's enough ."
    },
    {
      "rating": "8",
      "text": "A slow-paced, emotional look at the effects of the zombie apocalypse. By focusing on one girl's transformation and the effect it has on her and those around her during a time when the world isn't completely ravaged by the undead, director Henry Hobson and writer John Scott III create a compelling world and effective tale. Even better is that it is brought to life by fantastic performances from it's two leads.\r One would think Arnold Schwarzenegger in a zombie movie would be a straight up zombie killing good time given the actor's pedigree. This movie is something wildly different though and Arnold shows just how great of a performance he can give. His emotions are real. It's both shocking and exciting to see the hero of countless action movies nail this dramatic performance. Abigail Breslin is just as fantastic. She really brings the process of turning into a zombie to life. She plays each stage of the change perfectly.\r The writing is just strong all around here. Characters act like real people and their dialog is believable. It's a treat for drama fans and for zombie fans who are interested in more emotional tales. So what's the catch? Unfortunately it is a very slow movie. It carries a very solemn tone. Perhaps too solemn. Characters wander around with their heads and act really glum. I mean, I get that this is a drama, but at times all this sadness can kind of suck the life out of the parts of the film. Luckily though it's not too bad, but the slow-moving melancholy nature of it all will turn off some viewers.\r \"Maggie\" is a powerful drama that provides an interesting take on the well-worn zombie motif. It's fresh and plenty emotional. Many might not be able to get past the pace and tone of the film, but those that can will be treated to a great tale and some incredible performances. It's not the zombie film you watch if you are looking for action. It's the one you watch if you are looking for some tears."
    },
    {
      "rating": "8",
      "text": "Don't expect this to be an action movie or even a zombie movie.  And thank goodness for that.  If you're interested in seeing a slow-burn film about a family put into an impossible position by love and circumstances, your time will be respected.  It's as refreshing to see a movie deal with zombies as something other than an action or horror plot device as it is to see Schwarzenegger play a human being instead of a comic book character or a one-liner vending machine."
    },
    {
      "rating": "7",
      "text": "\"After his daughter (Abigail Breslin) is infected with a virus that transforms her into a zombie, a small-town farmer (Arnold Schwarzenegger) will stop at nothing to save her.\"\rThe Film isn't great and isn't bad but a good film.I enjoyed it and it's an okay movie."
    },
    {
      "rating": "5",
      "text": "Nothing new to see here. Some good scenes about a person dealing with the inevitability of turning into a zombie, but really didn't dive into anything we haven't already seen from a Walking Dead episode."
    },
    {
      "rating": "10",
      "text": "Very good movie, although quite sad and emotional.  If you're looking for an action movie or the type of Arnold fare of days past forget this movie.  Zombies are just the vehicle used to grab your attention.  Everybody loves zombies and Arnold.  But this movie is about the tragic, sad deterioration of a sick daughter suffering from a nasty disease and deeply loved by her father who must watch his daughter slip away and will ultimately have to make some tough decisions at the end.  The disease could have easily been cancer and it would be the same movie.  I was very impressed with the actress who played Maggie and Arnold's performance was extraordinary.  The man can act."
    },
    {
      "rating": "6",
      "text": "Arnold Schwarzenegger in a zombie drama movie, hmm  interesting.\r The story is about a Midwestern teenager is infected by a disease that slowly turns the person into a cannibalistic zombie. Despite the growing threat she represents, her father will defy both the risk and the authorities in order to protect her.\r Every since I first heard the news of Arnold Schwarzenegger in a zombie drama movie with Abigail Breslin I was sold already by the thought of it and the trailer for the movie helped a lot. I think it was about time for a movie starring zombies in it to be a deep drama I mean it would be interesting to see more then the goof over the top zombie movies that we always get. Now after seeing Maggie I was a little bit disappointed but there are a lot to like when it comes to positives.\r I know Arnold Schwarzenegger isn't the greatest actor on the planet but he is likable in real life and in movies, I mean I can you not like the guy his like the best worst thing to happen to cinema. Arnold in this movie actually pulled off a good performance, his wasn't just playing himself or doing one liners, he actually did a good and serious performance and it worked.\r Abigail Breslin also did a great performance in this movie playing the teenager slowly turning into a zombie and in the movie you see her turning and the effect's it has on her and her father is truly heartbreaking to watch, and her performance sold it for me.\r The chemistry between Arnold Schwarzenegger and Abigail Breslin was just spot on brilliant. They performances really helped me to buy into the father and daughter thing and it payed off so well because they are scenes in this movie were it was so sad to watch when it cuts to the two of them having a talk about their past life and how worried they both are.\r The movie was shot beautifully, the writing was okay for the most part, the directing was good and the Arnold and Abigail were the only thing that kept me watching till the very end.\r Now for problems: These a scene in this movie were Abigail character see's this boy the same age as her who's also infected and the two of them have a little love triangle and I didn't really care about. The scene it self could have been cut out of the movie as the scene and the boy never get brought up again.\r The ending to the movie just kind of ended just like that. I already thought of a better and more sad ending to the movie but since I'm keeping this a spoiler free review (For the most part) I just thought the movie ended at the wrong time and could have ended better.\r Overall Maggie was a okay movie with two solid performances from Arnold and Abigail."
    },
    {
      "rating": "7",
      "text": "This was a beautiful, bumpy ride to a horrible ending. The story was beautiful, but the film suffered a lack of pacing. Some moments were extremely thrilling, some moments seemed to drag on forever, and some moments built to nothing. That is where the ending comes in. This movie is ultimately about Schwarzenegger's character, not Breslin's, and the ending resolved Breslin's storyline, but Schwarzenegger's storyline was not resolved. Had they added another scene at the ending resolving his storyline, my score would have been a point higher. This is one of Schwarzenegger's better performances, and it stands out among other zombie flicks."
    },
    {
      "rating": "1",
      "text": "Trash, nothing but total trash from beginning to end. A melodramatic bore that failed on nearly every level. Contrived, torturous and the fact Arnold Schwarzenegger is in this type of role is a failure in of itself."
    },
    {
      "rating": "5",
      "text": "Schwarzenegger has grown a beard and added a new skill to his notable acting ability: crying (total 2 tears). He plays a protective father whose daughter (Abigail Breslin) has been infected by the zombie virus that's terrorizing the world. He stubbornly defies authorities and struggles to hold on to her humanity. You expect this type of film to be bleak, but this one is saturated with slow somber suffering. While the concept offers an original spin, the tedious pacing, relentless dismal emotions and heavy-handed score drag it down. The most affecting moments are between Breslin and her teen friends. (Criterion Cinema only)"
    },
    {
      "rating": "4",
      "text": "You won't miss anything if you skip this movie. If you like to see Arnold a little tuned down, and have nothing better to do, sure ... but it's basically a slow predictable drama."
    },
    {
      "rating": "3",
      "text": "This is just one of those scenes from The Walking Dead where someone's been bitten and they're waiting to turn--but strung out for 95 minutes. If you've seen the trailer, you've seen the movie.  Add tons of shaky cam, slow pacing, and \"indy film\" camera angles to make it extra pretentious.  No twists, no new take on zombies, zero surprises.    It was seemingly made by people who've skipped the zombie genre for 20 years and thought they discovered this scenario themselves."
    },
    {
      "rating": "9",
      "text": "Touching, bleak, thoughtful... makes 'The Road' look like National Lampoons Apocalypse Vacation by comparison. Good performances all round, and best original take on the Zombie genre for a long time."
    },
    {
      "rating": "2",
      "text": "ce film est d'un ennuie mortel ! j'esperé que cela s'anime a un moment ou a un autre, mais non, jusqu'a la fin on ce tourne les pousses. bref passez votre chemin !"
    },
    {
      "rating": "9",
      "text": "Ok let me start by saying, this is a drama, based in a Zombie epidemic. A inside view of farmers family dealing with a infected family member. There is no action and there is very little gore, its not a horror as such. Now my personal opinion. Lots of new going on in this film, i normally don't like Drama's but i am glad i gave this one a go. Acting is brilliant, the story is brilliant but slow, it's atmosphere paced and very touching. Very different take on a zombie apocalypse. Arnold's acting was brilliant and very surprising, Not massive dialogues, but enough, with the expressions and portrayal, Arnold did well. Everyone else in this movie also made it happen, nothing was flawed and it all came together well. Now it is slow and i was tempted to skip forward here and there but i stuck with it until the end and i am glad i did. It leaves a mark on you. Go into this movie expecting only a drama based in the zombie world and a whole new side to Arnold and you will appreciate it. Once again Drama's not my thing and Arnold's usual work is more to my taste, but i appreciated everything in this film, so on that perspective, il give it a 8.5/10. Its a shame people have not judged the film correctly. Nearly all Negative reviews say \"Bah where's the gore\", \"bah no action\" or \"Bah i hate Arnie\". If you see reviews involving anything similar to that... they have not watched it knowing what they were about to watch or are bigoted."
    },
    {
      "rating": "9",
      "text": "Deeply moving and superbly acted and written movie.  The story develops slowly as the tension builds while you grow to care about these people and the situation they are forced to deal with. The music adds the final element to complete the atmosphere of terror and sorrow. A totally unique movie experience with elements of the classic zombie masterpieces of the past making it a rare and special gem. Be patient with this and you will be rewarded. It will stay with you unless you have no soul."
    },
    {
      "rating": "6",
      "text": "There are stretches of painfully boring silence, but the movie really starts picking up in the second half.  It was good to see Arnold in something different, however, this movie belongs to Abigail Breslin. Not your typical mindless zombie film."
    },
    {
      "rating": "7",
      "text": "A tale of a father who stood by his daughter till the final.\r The zombie apocalyptic drama that centres around a father-daughter relationship. When the daughter is infected by the necroa virus which turns humans into the cannibalistic, the loving father stands by her side, but how long is the remaining film.\r One of the blacklisted screenplay and a low budget film that surprised me for having Arnie on-board. Chloe Grace Moretz was supposed to play the title character, would have been definitely a perfect fit. Because I've seen her excellence in the 'Carrie' remake, anyway her replace Abigail Breslin did perform well.\r I had seen many movies of Arnold Schwarzenegger, but as I remember this is the first time seen him in a casual, realistic and emotional outfit. Maybe his age is restricting him from taking up the tough roles to play as what he was known for, but still I'm happy that he's doing movies that fits him right now.\r For the one reason it is called a horror and you know why, but it was not horrifying. A slow paced simplest zombie movie. Enjoyable film for the sake of the cast, yet forgettable and move on kind of flick.\r 6½/10"
    },
    {
      "rating": "8",
      "text": "While the film may have been a slow burn I felt interested throughout.  Arnold Schwarzenegger is fantastic in this role as a father who knows what's best for his daughter but can't come to grips with the right decision.  Overall this dramatic zombie film was a surprise.  B+"
    },
    {
      "rating": "7",
      "text": "Maggie is a very powerful drama. The acting was top notch from all of the actors, the characters' reactions were believable and the movie was very interesting to watch. While some people might find this film too slow and the ending wasn't perfect, it definitely exceeded my expectations."
    },
    {
      "rating": "3",
      "text": "Maggie takes itself way too seriously, especially for a zombie flick. Seeing Schwarzenegger in a straight drama role is odd enough, but he's surprisingly not terrible at it. He's certainly not going to win any Golden Globes any time soon, but he's convincing enough in the simple role he's been given to play here.But while he's not terrible, the film is. It's relentlessly bleak, and inexcusably boring. The story moves so slowly you'd have to fast forward it to see it move at all; and the characters aren't deep enough to paddle in. If you ever have trouble sleeping, put the Zopiclone to one side and stick Maggie on."
    },
    {
      "rating": "8",
      "text": "This movie was a real surprise at a retail store as I had missed its theatrical release. I took a chance on it, knowing nothing but the two excellent actors, and was not disappointed in their performances. This is not an action film, and doesn't apologize for it, and those who review it negatively are incompetent movie watchers who don't understand that there's more than one genre of film. This film sort of has an old-school M. Night feel to it, in the vein of The Sixth Sense--slow, suspenseful, nags at you, because you never know what's going to happen. But it doesn't throw blood in your face--this is not The Walking Dead, and that's what many reviewers are ignorantly comparing it to. Whatever, I bought it, watched it twice already, will watch again."
    },
    {
      "rating": "10",
      "text": "In an over-crowded market where fighting for the flesh of the masses is the norm, it’s always a surprising pleasure to witness one of these somnambulistic walkers twist the event inside out and present something very different in a very familiar setting. To overtly put, Maggie has breathed some new life into the tired zombie sub-genre.\r The film opens with the same bleak impact that Charlton Heston introduced in ‘The Omega Man’ (Sagal, 1971) as Wade, played convincingly by renowned action icon Arnold Schwarzenegger, drives through the depressing post-apocalypse as the once beautiful countryside burns its last breath, gradually unveiling the pandemic that is ripping society apart. Wade is searching for his missing daughter, Maggie (Abigail Breslin) and manages to track her down at a hospital, where he’s abruptly informed of the non-curable infection she has contracted and is given a limited timeframe with his daughter, per the government ruling on the outbreak.\r This zombie virus doesn’t turn victims into rotten, flesh hungering undead corpses within hours or days; it’s a painstaking terminal illness that emotionally deteriorates the victim and the family and close friends unit suffering intensely. The hopelessness of watching a loved one gradually succumb to an incurable illness is displayed here with such honest depth, which also correlates to the disease that will eventually rip humanity into ruin.\rArnold gives the best performance of his career as a simple, every-day man wracked with the pain of watching his daughter descend into her illness. Wade clearly feels he’s failed his own daughter and as she is dying, the last connection to his deceased wife is fading. Arnold’s comeback to filmmaking hasn’t been kind (the box office returns have been underwhelming and reviews mixed) but Maggie paints him in a different, mature light. Abigail Breslin anchors the film as the title character, witnessing her own body turn against her as the disease distorts her humanity. The necrosis make-up effects are shocking and heightened even more as Maggie twists into an emotional wreck at each instance of the virus closing down her mortality.\r The whole ordeal is punctuated by cinematographer Lukas Ettlin, who opts for a subtle yet realistic, intimate style, and the abundance of ‘shaky-cam’ shots gives the constant sense of disruption; you feel Wade’s life tearing apart, a poignant metaphor for the film’s world. The post-apocalyptic iconography that this sub-genre is so accustomed to is represented differently, relying on emotional impact rather than stylistic awe. The colours are faded and there are deep shadows peering over, the unknown taking hold. The zombie make-up effects are less traditional, with deep black cuts and gore unwinding. The scene where Wade encounters the reanimated father and daughter is textually abhorrent, with punctured eyes and near skull-like decay.\r But unlike other zombie films, these wandering corpses are given profiles and backstories, as Wade’s action on dispatching these meandering carcasses faces the realisation of their surviving family which mirrors Wade’s own turmoil. Schwarzenegger is able to demonstrate certain depth he has acquired over the years in one heartrending scene as he visits the house of the zombies he just killed to discover desperate carvings on the wall that read ‘Love my daughter, love my family’. Little sub-plots like these reinforce the main thread and builds up anxiety; every cause has an effect.\r Henry Hobson has made a unique and strong debut in his first feature-length director effort. To be able to twist genres and turn tired conventions into a dramatic fusion takes skill and craft, and Hobson has proved himself and paved the way for a promising future ahead. The script for Maggie, written John Scott 3, spent years on the Hollywood black list, garnering a positive reputation before the cameras started rolling.\r The zombie sub-genre always works best when there is something else going on underneath and Maggie is no exception; quantifying a worldwide outbreak to just a small group of characters and watching their lives fall is all the more effective. It becomes more personalised and the audience can sympathise.\r Maggie comes highly recommended for audiences who are looking for a different type of flesh to chew on."
    },
    {
      "rating": "9",
      "text": "Maggie is an UFO in the movie landscape. Beautiful images, lightings.and what about that gripping performance from Schwarzenegger. Really moving performance and a Must see"
    },
    {
      "rating": "10",
      "text": "Excellent movie. The finale was quite unexpected and not totally satisfying, but the performances of Schwarzneger and Breslin respectivly are simply fantastic. I also like the different approach on the ,now overdone, zombie movie trend. So, 1010."
    },
    {
      "rating": "3",
      "text": "This movie should have been called \"I Was A Teenage Zombie.\"  Predictable and derivative.  Boring.  Minimalistic.  Bad cinematography and coloring.  My biggest complaint is they don't play \"Free Falling\" at the end."
    },
    {
      "rating": "9",
      "text": "One of the Best drama i ve ever seen!Pure true drama.Not only effects and killing.Every scene hides so much emotion!I recommend it.I like some meanings of the movie.Really great one!"
    },
    {
      "rating": "5",
      "text": "It burns me to say this but Maggie isn't quite emotional, quite sad in some scenes, but not during the entire movie, and the pain Wade Vogel (Arnold Schwarzenegger) has been having with Maggie Vogel (Abigail Breslin; she got infected by a zombie) isn't really much to say and zombies have really been overused in movies."
    },
    {
      "rating": "10",
      "text": "I honestly can say that I did not find any flaws with this movie, due the fact that I was so engrossed in this masterpiece.  I grew up watching Arnie blow stuff up, be a twin, dress up as Turboman, but Maggie is without a doubt his best performance.  The macabre undertone of 1 of 3 impending outcomes would be more than enough to push anyone to the breaking point, and Arnie hits the nail dead center on the head.  Brav-effing-o."
    },
    {
      "rating": "10",
      "text": "First, I have to clarify this... Maggie is a human drama. Period. If you are expecting it to be anything else(an action movie or a horror movie or maybe even a zombie movie), this is not the movie that you are looking for. I know it sounds like I'm exaggerating, but I'm certainly not.\rIn this movie, zombies are just an element of the story, not the main opposition that Schwarzenegger has to fight against with a machine gun in his hand.  They are depicted as some kind of contagious disease that slowly takes people's souls and turn them into dangerous creatures. So this movie is more about the disease and families who are torn apart by the disease, not about the zombies themselves.\rOverall, this human drama(I have to emphasize this) is brilliant and emotional with a beautiful soundtrack, artistic cinematography, and great performances. And the first-time screenwriter John Scott 3 did an amazing job, and I'm really looking forward to his next work."
    },
    {
      "rating": "5",
      "text": "It surprises me more by what Arnold Schwarzenegger achieves as an actor than by overall story, nevertheless it is an interesting addition to the genre."
    },
    {
      "rating": "7",
      "text": "After his daughter (Abigail Breslin) is infected with a virus that transforms her into a zombie, a small-town farmer (Arnold Schwarzenegger) will stop at nothing to save her. Maggie lurches a bit clumsily at times, but is partially redeemed by strong performances and an unexpectedly thoughtful tone. I'll give Maggie a B-."
    },
    {
      "rating": "8",
      "text": "I have seen a few lower ratings on the internet before watching this movie, may be that's the reason I liked this film, the expectation was too low. To my surprise this film is not bad at all. As we all know, Arnold may not be so great in character roles, but everyone loves him. In this film you can see a different Arnold, very controlled acting to his best. The film is a very touching drama, mixed in horror. The bond between a father and daughter is the backbone of the story. It's worth watching, not bad at all. The film deserves a better rating for a reason."
    }
  ]
}