{"id": 2537, "title": "Magic Mike XXL", "starring": ["Channing Tatum", "Matt Bomer"], "runtime": 115, "genre": ["Comedy", "Drama"], "description": "Three years after Mike bowed out of the stripper life at the top of his game, he and the remaining Kings of Tampa hit the road to Myrtle Beach to put on one last blow-out performance.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mXWbLqTWziO9aAyWMBzVnDSP57t.jpg", "categories": {"plot": 5.5625, "acting": 6.0, "ending": 5.0, "soundtrack": 7.142857142857143, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 7.4, "action": 3.0}, "reviews": [{"rating": "4", "text": "Three years after the first movie ends, the Kings of Tampa travel to one final show at a stripper's convention. On the way: they talk about their future plans, they talk about their love for each other, the entire gang only performs in the closing production (and then it's only abbreviated duos with audience members and tedious intros from Jada Pinkett Smith). The flesh fest of the original is gone, but more importantly, Matthew McConaughey's magnetic personality isn't there to give the movie vigor. There are a few fun moments and some early solos that are enjoyable, but these guys have embraced their feminine side with all their sensitive sharing and dull chatter."}, {"rating": "8", "text": "This is one of those movies you know you shouldn't have enjoyed but you did anyway. I was surprised myself to see that I actually liked it. Fun, entertaining, and light."}, {"rating": "6", "text": "An entertaining, if often ridiculous, raunchy romp into the world of Magic Mike and his plucky band of ripped comrades. This is a good sequel to the suprising original, with a lighter tone throughout, making for a more enjoyable experience. The cinematography could have been better, with less style than the original, though the soundtrack was fun and it was well paced. The storyline is barely there, with just enough detail to vaguely explain how the troupe get from a too b, and the script is tolerable, with some hilarity provided by Tatum's apprent gift for comic timing. The abundance of rippling man-candy will keep fans happy in spite of the film's lack of subtlety, and the inclusion of some feminist/insightful moments elevates it somewhat from what could otherwise be a basic sexploitation flick. Worth your time if you enjoyed the first one, though nothing spectacular. 5.78/10*\r *Extra points for the inclusion of some NIN and Manganiello's Twilight joke."}, {"rating": "7", "text": "It's much funnier, more light-hearted, and just plan fun than the first movie. I happened to be one of maybe 4 dudes in a theater full of women who were whooping and hollering throughout, as if we were in an actual strip club.  Which speaks to the energy of the film.  I got the feeling that the new director let the guys have more fun with their parts than Soderberg did.  As for the objectified male picture of 2015, this one BURIES 50 Shades of Gray.  Believe it."}, {"rating": "2", "text": "A male perspective.    Forty minutes into Magic Mike - I thought -Tatum should bend over and everyone involved in this film should kiss his butt for making it rain in their pockets  with this terrible sequel. Tatum is having a mid-life crisis.  He wants to recapture his youth. He can rest easy. We see he still has the moves\rin the last twenty bareable minutes of “so you think you can strip.\" But when the motion stops and they open their  mouths - it’s unbearable. Especially the flirtatious banter between Tatum and Heard while he’s taking a piss.  Rumor is the “actors” starved themselves - quite evident in their very thin performances of their even thinner characters.  As for the women -  they chew the scenery.  Twitch is a nice addition - he’s a great dancer.  But Michael Strahan - he’s not. ABC and Disney using sex to get ratings for  “Live with” - times have changed.  It will be hard to get it up a third time - may I suggest  a silent movie with the guys using their g-strings as sling shots as naked and afraid  they traverse the wild dunes of Fire Island - from Ocean Beach to the Pines- looking for Pettyfer and  McConaughey.  And as for Hollywood grosses - imagine ( and who didn’t !) a tape of Joe and Sofia on their honeymoon night - Watch out Jurassic World !"}, {"rating": "0", "text": "This was the utter worst piece of trash I have ever seen!!!  I saw the first one and thought it was 'marginally OK,\" but this one has no redeeming value. If you're going to see some skin, which most people are, then go see another movie and then sneak in for the last 10 mins of Magic Mike. Unless you're a teenage girl or a gay man who hasn't gotten laid in 10 yrs, then you should SKIP this movie.  AWFUL AWFUL AWFUL"}, {"rating": "10", "text": "More than anything, I felt recognized by Magic Mike XXL. It's sweet, feminist, funny, weird, erotic. For a movie about a bunch of straight fellas on a road trip, it's one of the most female-centric films I've ever seen. It's kind without being sentimental, sexy without being stanky. I love that Soderbergh et al put the love-story and moral compass stuff on the back burner and, a la Alice down the rabbit hole, just let these guys wander from one freaky situation to another - all rendered with equal parts nuance and fantasy. By the time they get to the Andie MacDowell character's place, I thought - geeze this practically feels like an art film. Layered characters, crafty dialog, beautifully shot. But it's about strippers! Heaven. And a real stand out: scene after scene crammed with women who look like actual human beings. There's not a single **** any where in this movie. Nor do the guys feel threatened by other folks of color, by gay culture, by women of size, or by each other. It's got just enough goof and fantasy to keep it all heightened. Yet it all feels grounded in reality - a sur-reality where a bunch of straight boys actually talk about what women want and it's not adversarial. It's hahhht. My only bummer - that more critics and audience members aren't recognizing the value and importance of a major Hollywood release that so deeply celebrates female sexuality and the many possible manifestations of a more gentle masculinity. Go see Magic Mike XXL!"}, {"rating": "5", "text": "If you want to believe your wife and girlfriend are going to see this movie for the \"plot\", then be my guest. It's just a threadbare excuse to throw hunky guys onscreen in exchange for the ticket price. The good news: you don't actually have to shove dollar bills into their thongs."}, {"rating": "6", "text": "Disappointing - even for someone who really liked the first one.  This one was not directed by Soderbergh but by his assistant director, and the even bigger problem was just the lack of story or writing.  There was no cohesive story in this film, there was very little stuff going on between the characters...one of the thinnest plots of a studio film I have ever seen.  Large chunks of the film was just male strip tease dance numbers that had nothing to do with the plot and was just an excuse I guess to get people who like that kindof eye candy more of it.  As a straight guy, none of that did anything for me and while it was limited in the first film to only letting us see what they were doing, whereas most of the focus was on the story of the two guys...this film was like the opposite..an excuse to show a bunch of male stripping with the story secondary.  Its a bad sign when I Get so bored I have to self-edit the film by fast forwarding but thats what I had to do for multiple dance scenes towards the end as it served no purpose beyond maybe a sexual thing, such as a straight guy watching porn.   With that said, if you liked the first film, or really like male stripping, you may like it, as there were a few funny moments and some of the dances were new and interesting, but it was not a great movie overall."}, {"rating": "7", "text": "Less serious minded than Steven Soderbergh’s box office hit ‘Magic Mike’ this fluffier sequel is also a lot more fun. The loosely structured screenplay at first seems to only offer up a lot of inane macho chatter and the movie never gels into a cohesively good story whilst also fatally lacking an ending of which to speak. However, approached in the right spirit there is much warmth and humour peppered throughout to keep the enjoyment buoyant. Most of the cast are engaging with Joe Manganiello in particular proving more impressive here than he was in the first film. His striptease in the food store is one of the best scenes on offer. Andie MaCdowell is also given a few nuggets with which to shine leading one question where she has been these past years. The film also benefits immeasurably from some surprisingly good rap music on the soundtrack. This in turn elicits a fairly positive response to a movie that, whilst one wouldn’t rush to see it again, is a guilty pleasure whilst it lasts."}, {"rating": "10", "text": "Everything in Magic Mike XXL is large, the dances, the acting, the music, the sound and the magic itself. 2012's Magic Mike brought a lot to the table and many argued that the magic will return. Well, can the sequel hold its steam three years later? Hell yes. XXL is a better movie than I thought it would be, the songs are off the charts, the dancing is great and Channing Tatum gives a hell of a performance. It was sad to see Dallas and The Kid go, and seeing what an amazing performance McConaughey gave in the predecessor, I was bummed, new director, okay cast and Sodenbergh being used as the director of photography. Boy, was I wrong. This movie tops its predecessor in every way, excellent visuals, brilliant acting and groovy music are just some of the highlights. Jada Pinkett Smith was amazing, Amber Heard is in this, Micheal Strahan gave us some magic and many more stars deliver MAGIC. PURE MAGIC. There is more comedy this time, because Magic Mike had a bit more serious tone. This movie is not uncomfortable, it is not awkward to watch this, believe me, I think there were only 3 men in the theatre and the rest were women. XXL is incredibly fun, excellent and jaw dropping entertainment. This is the most fun you can have this week."}, {"rating": "6", "text": "What the f--k is this s-it? I mean, personaly I just want a simple movie like utter dull, but suddenly people (and I MEAN people) feels like this movies are for gay (which is not true but in fact are male stripping :p ). The actors does alot of perfect performance (particularly Channing Tatum). But, there is no highlight about this film."}, {"rating": "8", "text": "This movie was *extremely* fun, complete fan service, tons of abs. Nothing not to like. We also thought it was an improvement over the original which took itself very very seriously. http://bit.ly/1C36GUg"}, {"rating": "6", "text": "The movie is not very good, and there is no real sense of the plot being important at all. Nothing really gets solved, and by the end of it you know you bought a ticket to see the dancing. If you like the dancing go see it by all means, if you are looking for a great story mixed with the production values of its predecessor; it's not necessary to see."}, {"rating": "5", "text": "The first one was okay, kinda fun, but this one was a disappointment. I do like Channing Tatum, and I think he is a good actor and a great dancer as well as being good-looking, but his movie did not do justice to his talents. It seemed that 90% of the dance moves were just simulated sex, and I would have liked to see some more actual dancing. There were a few good moments here and there, but after awhile it seemed repetitive and it didn't have much of a plot. The other \"male entertainers\" were okay but no one was particularly impressive in terms of talent."}, {"rating": "3", "text": "I approached the sequel to “Magic Mike” expecting fun, fun, fun and guys with fantastic bodies shaking their junk and booties all over the place. “Magic Mike XXL” has the guys, with fantastic bodies, shaking their all but it isn’t fun, fun, fun but boring, boring, boring!\r There are too many unnecessary storylines, written by Reid Carolin, while the direction by Gregory Jacobs and the choreography by Alison Faulk, have the guys in gay bars--but none, of course, are gay--straight bars, a whore house, at a strippers competition and in a Southern woman’s house filled with divorcees and wine.\r The first movie was based somewhat on Channing Tatum’s life before he became a star and this is a Hollywood movie which seems to have little basis in truth. The choreography is polished, each of the strippers have a ‘back’ story and at the very beginning Mathew McConaughey’s is explained but he is missed.\r The men besides Tatum are: Matt Bomer, Joe Manganiello, Kevin Nash, Adam Rodriguez, Donald Glover, Stephen “tWitch Boss, Michael Strahan, plus a few extras, certainly have the bodies to make guys in the audience make a resolution to hit the gym--right after the July 4th weekend! They also have the dance moves down but the editing, costumes and most of the dances are just ‘off’ a bit enough to make their scenes distracting.\r Jada Pinkett Smith takes McConaughey’s place as the emcee of the boy’s show and has a fling with Tatum in the past.  Amber Heard, as Andie MacDowell’s daughter who is the Southern woman hostess and the rare woman who can take XXL Manganiello, is the new love interest for Tatum. Gabriel Iglesias, as the only gay guy with the group not as a dancer until he enters in Carmen Miranda drag to win a contest but is the driver of a truck for the guys and has a bad accident closing his eyes while driving and all the guys are high on ‘molly’. Elizabeth Banks has a few minutes on screen as the competition’s director and as an ex of Jada--don’t ask!\r As with most sequels “Magic Mike XXL” doesn’t stack up to the original, is not as sexy though there are more dances and men, and not as much fun--not one man or women in the audience threw dollar bills at the screen!"}, {"rating": "4", "text": "Just not my cup of tea.\r I have seen the first part and I don't remember I felt the same way as I did for this. My point is, this film is for women and maybe that including the gays. Being a straight male, I find it's not fun or entertaining, but I felt it pulled me further away as the movie progressed without balancing the content as a product for everyone.\r I know, no one asked my opinion. I respect the movie, at least it aimed for a certain section of the audiences. The road trip was fine to me, except the music and the dance parts. Thankfully, there's no nudity, except once, but still an R rated movie for strong sexual appeal.\r Whatever the theme was about, I expected a good story. But it was a lot like a documentary. No focus on any particular characters, but Channing Tatum was in a prime position. No development either in the story other than a group that embark a road trip to participate in a competition. Nothing anything like the first film, kind of detached from afar.\r So I won't expect you to feel as the way I did on this, but you could consider my points and can judge whether want to watch it. Still, I'm not suggesting to boycott the film. I'm neutral, and all I'm saying is that it did not impress me, but it might you, especially if you are a woman.\r 4/10"}, {"rating": "2", "text": "This movie did not have a story. There was no dancing expect for the ending. I did feel the characters did try there best to have a good movie but it fell short."}, {"rating": "7", "text": "If Magic Mike was the party then Magic Mike XXL is the after party, not quite on the same level as what came before it, but a damn good time none the less!"}, {"rating": "6", "text": "You have to REALLY want to just hang out with these guys to enjoy this sequel.\r I mean, it was fine. It was interesting and even insightful in spots. It was just not as much fun as the first one."}, {"rating": "5", "text": "So, I'm an openly gay man living in 2016 who should find this movie very entertaining, what with all the hot straight men acting gay. But just like the first one I didn't like this and I think that it's just as sleazy and coarse as the original. I have to give kudos to all these actors who really seem to give their all to these testosterone fueled, narcissistic idiots that they play. Next time I should just download gay porn for satisfaction."}, {"rating": "8", "text": "We don't have Dallas but we have a funny and sexy following film for Magic Mike (2012). New characters are entertaining, dialogues are amusing and well written and music...well, how can music be bad in a movie like this? Great soundtrack and corepgraphies that will heat things up whenever you are. From Manganiello dancing to the Backstreet Boys to the final performance, XXL is bigger and funnier than its predecessor in all ways. I left the theatre wih a huge smile on my face. And turned on."}, {"rating": "4", "text": "Dull, predictable and with some laughable lines, \"Magic Mike XXL\", tries really hard but in the end, is just a forgettable, cheesy film, that satisfies only the eye."}, {"rating": "10", "text": "This was a great movie! The first Magic Mike was better. Channing Tatum is soooo HOT!  I highly recommend it for those who want to have a great time watching hot sexy beef-cake men grind their stuff. Fit, hardbodies and muscles and sexiness galore!!! I see many bad reviews and that 's to be expected, probably form haters (men) or men pretending to be women. I watched it twice and it was worth every minute!"}, {"rating": "1", "text": "I was so excited to see this movie.  WHAT a Disappointment.  ZERO story!  The person who edited this movie should never work in movies again!  There was HALF the amount of dancing as in the first.  The best part was the very end with the \"Strip-off\"  that's it.  Waste of $$.  Please...don't go there with a XXXL please"}, {"rating": "10", "text": "The dance routines are awesome. The movie is very entertaining, yet simple and light.\r Check out the movie here http://www.watchfree.to/watch-2a33c4-Magic-Mike-XXL-movie-online-free-putlocker.html"}, {"rating": "4", "text": "The most exciting part about this movie was the ´talk´of Joe´s large penis. Channing Tatum has lost me as a fan, the only way to make up for it is by attending my birthday party as a male entertainer."}, {"rating": "7", "text": "XXL Magic Mike. Great movie, has the moments of a good laugh, also great choice in music for the moments. Great dance routines, great actor/actresses\rBut I'm rating this a 7, because I was hoping to see more strippers towards the end, just seem like they were getting a budget. Plus some of the actors didn't talk.\r Thanks Lukas,"}, {"rating": "7", "text": "After three years of retirement from strip dancing, Mike (Tatum) misses his former job and the crew he worked with, so when an opportunity comes along his way to perform one last time with the Kings of Tampa, he grabs it and proves that there is still magic in his Mike.So, did it exceed its expectations? As for fan of its predecessor, yes. But as an ordinary moviegoer, it is surprisingly not what you have been expecting for. It does not only tell the story of Mike and his team in front of the stage, but also deals with the viewpoints and camaraderie in overcoming their problems in life.Gregory Jacobs has a passion in reaching out and doing things different than its prequel by pulling off some emotional moments, which works and delivers often. Also, for quite some times, it feels that it lacks in sense of urgency due to slow-paced parts and plotless story.VERDICT: Magic Mike XXL is indeed magic for its target audience, but ordinary moviegoers would still enjoy it despite of some flaws."}], "recommendations": ["magic_mikes_last_dance", "step_up_2_the_streets", "free_guy", "baby_driver", "black_snake_moan", "footloose", "tag", "kick_ass", "chef", "pitch_perfect_2", "sex_drive", "deadpool_2", "pitch_perfect_3", "the_nice_guys", "baywatch", "21_jump_street", "catwoman", "pitch_perfect", "friends_with_benefits", "the_tourist", "palm_springs", "the_gentlemen", "kingsman_the_golden_circle", "hanna", "hustlers"]}