{"id": 4867, "title": "Maid in Manhattan", "starring": ["Jennifer Lopez", "Ralph Fiennes"], "runtime": 105, "genre": ["Comedy", "Drama", "Romance"], "description": "Marisa Ventura is a struggling single mom who works at a posh Manhattan hotel and dreams of a better life for her and her young son. One fateful day, hotel guest and senatorial candidate Christopher Marshall meets Marisa and mistakes her for a wealthy socialite. After an enchanting evening together, the two fall madly in love. But when Marisa's true identity is revealed, issues of class and social status threaten to separate them. Can two people from very different worlds overcome their differences and live happily ever after?", "releaseYear": "2002", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/a0xOVDKEWW1nyArKFS3Fg1b4PsE.jpg", "categories": {"plot": 7.0, "acting": 7.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "7", "text": "I thought that in its genre the movie was fine, better than what I expected it to be. It was light, fun but not great. It was certainly entertaining. Ralph Fiennes did it all for me. He is fabulous! Jennifer Lopez...sorry, but I don't understand why people think the movie is 'bearable' just because of her and her 'beauty'! Obviously, many think she is beautiful but to me she is just cute.  I guess, people from different countries/circles have different taste. I know some will suggest I say this because I am jealous of her but  it is not jealousy at all  for in my circle of friends most of us are naturally better looking than her (sorry if that sounds arrogant, but it is just true), and many people around the world are! I am sure many girls and guys here will agree with me on this point . Back to the movie.  one great thing about JLo is her smile and her vivacious eyes,and since she has this exotic type, it works well  for this type of movies...movies that are based on stereotypes. Although she is a pretty average actress, in this movie she definitely shines. So, even though I am not her fan, in Maid in Manhattan, I liked her! The story, is of course very cliche, but the setting adds glamour to it. I did enjoy the movie, and so far I have watched it twice in my life...I am sure I will watch it again...eventually!"}, {"rating": "7", "text": "A story wholly worthwhile--and Jennifer Lopez's finest performance to date. Maid in Manhattan is a unique look at interchanging social classes surrounding one fabulous Manhattan hotel."}, {"rating": "5", "text": "This is harmless fluff made watchable by a luminous Jennifer Lopez."}, {"rating": "5", "text": "Maid in Manhattan is a completely predictable, sappy farce, and an okay one at that, but it is memorable. Fiennes and Lopez don't have such good chemistry, but the direction isn't horrible; the flaws in the movie are mostly the fault of the clichéd story."}, {"rating": "0", "text": "It sucks. I can't believe someone can make a movie so crappy, it's one of the worst movies I have ever seen. I have no friggin idea how someone can say it was a good movie."}, {"rating": "10", "text": "Muy buena historia, buenas actuaciones por parte de Ralph, Jennifer y Natasha."}, {"rating": "6", "text": "Ok movie, this is probably every maids dream. To meet a handsome rich man that will sweep her off her feet."}], "recommendations": ["red_riding_hood", "17_again", "stardust", "leap_year", "10_things_i_hate_about_you", "mean_girls", "the_lucky_one", "no_strings_attached", "a_cinderella_story", "the_duff", "the_break_up", "aquamarine", "friends_with_benefits", "the_vow", "easy_a", "the_blind_side", "how_to_be_single", "clueless", "legally_blonde", "no_reservations", "the_boy_next_door", "snow_white_and_the_huntsman", "barely_lethal", "just_go_with_it", "hustlers"]}