{
  "id": 834,
  "title": "Mainstream",
  "starring": [
    "Andrew Garfield",
    "Maya Hawke"
  ],
  "runtime": 95,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "A young woman thinks she’s found a path to internet stardom when she starts making YouTube videos with a charismatic stranger  – until the dark side of viral celebrity threatens to ruin them both.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9KXWDsbbp2dcjMNzYRzkuRfrpzc.jpg",
  "categories": {
    "plot": 7.714285714285714,
    "acting": 6.285714285714286,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The low ratings of the film it's only because of its magnificence. It brings back what cinema used to be in movements like La Nouvelle Vague. It's not a critic to the powerful elite nor dictatorial governments, it is critic to our ordinary life, it critics our attitudes. And not in the superficial way we are used to, it is in an intense way we can't handle. And that is the reason why it received such bad reviews, low ratings, it was because we, the viewer, are constantly attacked. And not by a good guy, not by a hero, because if it were, we could bear, we would think: \"I'm sorry, man, but I am not a saint\", but when it is a mad man who shows us what the problem is, when a lunatic shows us we are horrible person inside, we start to feel anguish and then repudiate the movie for its geniality. There is the need to deny the movie as a masterpiece so we can bury inside of each of us the knowledge of our own hypocrisy. Certainly this is not a Hollywood movie, this is, undeniably, cinema with its most pure essence. And the way Gia Coppola does that it's not only through a good plot and use of lines like most directors would, she uses strong and tense scenes to give the spectators a miscellaneous felling of repugnance, obnoxiousness and anguish.And not it's not only the critics that makes the movie so unique. Gia Coppola uses colors and pallets to tell the story throughout every scene we can see colors have meaning and it's used to guide the audience to have a feeling. The colors alongside the amazing camera technics gives one mesmerizing photograph of the film. It's beautiful, unique and at the same time completely audacious, doing justice to all of this genius's work.Also, we can't forget about the gorgeous characters development in which is captured the human nuances in different scenarios of power in only 94 minutes. It is completely amazing how real this movie is, and that is why he is so shocking, it is real.Therefore I may conclude saying I wish there will be more films like this one for our society need movies like this. And for Gia Coppola I tell you this, don't grieve for the low ratings and acceptance of the movie, it just happened because your masterpiece worked and affected people, so congratulations, because now I will follow your work with high expectations for this is one of the greatest works of its time.A precise film for the pandemics."
    },
    {
      "rating": "5",
      "text": "Andrew Garfield plays a wild weirdo who becomes a YouTube sensation. Needless to say, the film is an extended comment on the perils of internet popularity. Garfield goes all out creating a fascinating and somewhat obnoxious character. Director Gia Coppola (Francis' granddaughter) has peppered the film with some flashy editing, silly emojis, a frenetic pace and a strain on credibility. This satire on social celebrity gives Garfield free reign, but never really comes together as an effective commentary or fulfilling movie. [usr =2.5]"
    },
    {
      "rating": "4",
      "text": "Part of me wonders if there's something true in saying this film could've explored something more profound, or at least to say that there's some kind of incredibly substantial undertone to its subject matter, but not really. Not at all. People who today still do not understand the simplicity of social media and ''influencers'', maybe they're not paying attention, or just don't care, if it's the second, good for you.Gia Coppola comes extremely late to a party that brings nothing new, neither in terms of drama, nor in terms of entertainment.It doesn't provoke a discussion, and completely loses the mark to say something that's at least a bit meaningful. Yes, her film rests on the shoulders of an interesting but obnoxious performance by Andrew Garfield, and also the work of newcomer Maya Hawke, but her film says nothing that isn't known, and consequently it's as hollow as what she criticizes."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)Is it possible to criticize a media and economic system from within or does one fall into contradiction? The hamletic doubt arises to F.F. Coppola's granddaughter and she did not give me the idea of havin' overcome the logical impasse, while Andrew Garfield is a histrionic webstar in an uneviscerated ménage à trois."
    },
    {
      "rating": "2",
      "text": "It looked promising, but then it just escalated into nonsense! (of course there is an element of truth to it, but the delivery was just a mess). Maybe if it is rewritten and recast"
    },
    {
      "rating": "6",
      "text": "When watching the trailer, this movie seems like another \"call out\" to the culture of mainstream media, a subject that while interesting, has clearly been done before (and is pretty touchy for most audience members). It's true; this story might not have a unique purpose, but it still stands out from the rest. It felt like a mixing of nostalgia and modern concepts that were incorporated delicately for an appealing feel. This direction helped refrain from feeling like the movie was trying to drown the audience by keeping overwhelming moments brief, but at the same time still being able to draw emotion from all around good performances. These performances from the actors really helped keep these characters alive, and in short amount of time character relationships were able to feel natural and simultaneously confusing. This confusing factor is what kept the film from becoming another tiresome critique on our generation's fixation on social media and the internet. It kept you asking questions, which kept evolving the characters, relationships, overall messages and themes. The ability to get the audience to ask themselves the questions is incredibly important is because it makes the audience understand more (and feel better about themselves) as it allows them to do the deep thinking, instead of handing them everything on a silver platter. It doesn't automatically give you a target. You don't know who the \"bad guy\" is, or what he represents (even at the very end!) It's incredibly captivating, and I'm glad that Coppola was able to convey this. Additionally, the cameos of real influencers were not as obnoxious as I anticipated them to be since around a good half of them felt natural enough. I wouldn't call this a fantastic movie, since this theme is overdone and \"Mainstream\" brings nothing new to the table, but I appreciate the route that directors and writers took for what they wanted to do. It's a piece of art, and I can see all the little pieces of passion poured into it from its team. It definitely doesn't deserve such a low score."
    }
  ]
}