{"id": 370, "title": "Maleficent: Mistress of Evil", "starring": ["Angelina Jolie", "Elle Fanning"], "runtime": 119, "genre": ["Family", "Fantasy", "Adventure", "Action"], "description": "Maleficent and her goddaughter Aurora begin to question the complex family ties that bind them as they are pulled in different directions by impending nuptials, unexpected allies, and dark new forces at play.", "releaseYear": "2019", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/vloNTScJ3w7jwNwtNGoG8DbTThv.jpg", "categories": {"plot": 5.631578947368421, "acting": 5.958333333333333, "ending": 7.125, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 8.0, "funny": 8.0, "action": 6.0}, "reviews": [{"rating": "2", "text": "This film is a mess and a completely unnecessary sequel. The acting is wooden and cringeworthy from the cast especially Angelina who comes across as a caricature in this film. It basically undermines the simple poignance of the themes and revisionist twist from the first film. Top Razzie contender of 2019 and nobody should be wasting their money on this."}, {"rating": "3", "text": "CGI was amazing but the story was too far fetched. The previous part was much better because it contained the core of the original  (fairy) tale. This was just a a bad extension."}, {"rating": "5", "text": "I liked the new reinterpretation of sleeping beauty of 2014. Something \"original\" that changed the classic story. This second installment does not match the previous one. Spend a lot of time rambling and avoiding to arrive at 2 hours. VERY SLOW and in essence almost nothing happens. Angelina eats the movie, Disney really knew how to choose it very well. Michelle Pfeiffer as the human villain who wants to end all rare beings and that the world is only human does well. On the other hand we see that Maleficent finds other Dark Fairies equal to her and that reminded me a lot of How to train your dragon 3, but this one is badly told compared to the other. If the movie takes 30 minutes I would give it an 7, but with my note I am being benevolent."}, {"rating": "4", "text": "I'm not a fan of Disney's live action remakes. Some have been better than others but none have been transcendental or worth remembering. After all the animated classics remain classic and they're better.Maleficent was a strange case, especially as they altered the plot in order to make her the main character and eventually the heroine.I didn't find anything interesting in that film and personally I didn't like it but since it was a huge blockbuster, the sequel was inevitable.Maleficent: Mistress of Evil comes to repeat the formula on a larger scale. Typical in this type of sequels but like its predecessor it makes the mistake of taking itself too seriously and the dramatic overload is ridiculous.Beyond how artificial everything feels, the film fails to make its plot useful or more interesting and honestly everything becomes boring quickly.I had no expectations therefore I cannot declare it disappointing, simply forgettable and therefore this is definitely an option that I would not recommend."}, {"rating": "2", "text": "Se o primeiro filme já é ruim o sua sequencia não foi diferente, nem o grande elenco pode salvar esse novo filmes, está na hora da Disney repensar seus filmes live-action"}, {"rating": "8", "text": "Amazing to watch!awesome visuals and score does a fair portrayal to fairy tale!amazing acting especially angelina jolie she played maleficient perfectly her expression charisma are well suited!amazing ending quite expected yet amazing to watch!michell piffer was amazing playing kindof villianish because she does that for humans so has her reasons portrayed well by her!overall a good movie not as good as first one but yaa!"}, {"rating": "1", "text": "Maybe I have entirely different expectations from everyone else, but, this movie was an abysmal flop.  The story arc was patently predictable.  Aside from the first half hour, Maleficent had very few lines and felt absent from much of the movie; with more silent reactions than talking The \"meet the parents\" dinner scene was the only redeeming exchange between characters. Instead of a children's movie, it felt like a mixture of The Lord of the Rings meets Game of Thrones, especially when the Queen Ingrith/Michelle Pfieffer (read; Cersei) character was poisoning her husband, locking innocents in a church to be poison gassed, and standing on a tower directing war. How disappointing."}, {"rating": "3", "text": "This time, the film didn't really continue the creative choices he made. Elements of war that were presented did not get enough depth, instead appearing so one-dimensional. The film assures humans as the first invaders. A queen made purely evil for no apparent reason, or even ridiculous depending on where we look. The uniqueness of the main characters had to be sacrificed. Watching this is like watching a big fireball, the visuals can be beautiful but inside there is a hot-mess, unfortunately we can't possibly expect a better story to come from the ashes later. There's no bounce back from characters who have lost their uniqueness."}, {"rating": "3", "text": "The plot make no sense. Characters dies and other characters will forget about them the next scene. Mass destruction and 100killed and people still pretend like nothing happened, showing up to the wedding like theres nothing. Half of the town and castle is destroyed ffs"}, {"rating": "3", "text": "Scontato e prevedibile, alcune scene non hanno senso e molti personaggi non hanno motivo di esistere"}, {"rating": "3", "text": "If the first one offered a worthy chance of experimenting with a character that was enriched by the original animated movie from the otherwise flat one in the original fairytale, the second one pretends to expand on that idea unnecessarily, and thus fails miserably. This painstakingly derivative tale of betrayal and reconciliation through self-forgiveness had already been told by the first iteration of Maleficent in a much more poetic and contained manner, the second delivery fails at everything the first one got right and ultimately reduces the character it tried to bring to new heights to a completely unconvincing and ridiculous thing which is no longer unique or interesting."}, {"rating": "6", "text": "I’d give it a C+/B-. Plot was absolutely predictable. No character did anything surprising, and the dialogue was colorless. Visually it was very well crafted. Costumes, sets, and CGI were superb. But Angelina Jolie seems unable to show any strong emotion, and I didn’t feel any emotional loyalty to anyone except Prince Phillip, Diaval (the raven), Conall (yes, it’s the black fairy that ), and Pinto. The best I can say is it was entirely watchable."}, {"rating": "0", "text": "poor movie, not funny, not addictive, poor acting, too dark for children, waste of money!"}, {"rating": "0", "text": "First much better. Horrible ending, weak script. I expected much more from this sequel."}, {"rating": "4", "text": "It seems as if Disney is so remake-happy, they'll be glad to cobble together a remake of a remake of a remake. And also have said remake³ have such a convoluted plot, copy and paste characters, and, awful, awful writing to have it fit in with the **** remakes they made this year. At least the presentation is good enough to call it the best of the remakes from this year, but that's not saying much."}, {"rating": "10", "text": "I was blown away by this film. There was more of a compelling story than expected, visually it's spectacular, it has enough little nods to the original but deviates JUST enough to be it's own film that has an entirely fresh perspective on the classic. I can genuinely say I consider this better than the original and I will gladly go see it again!"}, {"rating": "10", "text": "Spectacular movie and effects specials I recommend this second part and I love Jolie as Malefficient"}, {"rating": "10", "text": "I wasn’t expecting much going into this, but I’m very impressed! For a Disney “remake” and what is kinda Avatar as a fairy tale, it was surprisingly original. It’s not often we get a really good high production classic fairy tale like this, and I am here for it. It was emotionally moving and surprisingly dark, but hopeful and happy in the end, of course. If you go into this tuned-in to the type of movie it is, it’s gold."}, {"rating": "10", "text": "Una obra maestra de los live acción, mucho mejor que la primera en todo el sentido cargada de mucha acción y emoción"}, {"rating": "5", "text": "This movie bugs me more and more as I continue to think about, sure It's entertaining but it plays off like a housewives show and while yes that may be eye popping and extremely gripping it is just not a good plotline. It feels rushed and too Aurora centric. Angelina Jolie's Maleficent is incredibly underused. But still I'd recommend watching this, it's interesting, entertaining, and at times leaves you with your head scratching. Even if it's a hot mess from beginning to end."}, {"rating": "8", "text": "This movie was surprisingly enjoyable. Thumbs up! If you are on the fence about this movie, just give it a shot..."}, {"rating": "6", "text": "The movie is nice looking as almost every Disney movie. The colours, costumes are well-favoured, camerawork is great.But the plot is too predictable. In every moment of the movie you don't just suspect what is coming next, you simply know it.Great movie for children nevertheless, but no more."}, {"rating": "10", "text": "Melhor sequência os diretores desse filme estão de parabéns, Angelina como sempre arrasando no seu papel de atriz a produção e o contexto magnífico."}, {"rating": "0", "text": "Terrible..................................................................."}, {"rating": "10", "text": "This movie is so excellent I am going to go see it like 2 more times.  Only Disney could make the great a movie. It is simply beautiful and Angelina Jolie and Michelle Pfieffer are so good as well as the rest of the cast.  Best movie I have seen in a long time - if you haven't seen it then please go see it."}, {"rating": "10", "text": "It is a rare occurrence for a sequel to top the original; this is one of those occasions. With a rich plot packed with twist after twist, impeccable cinematography that is visually stunning, and effects that are utterly captivating, Maleficent: Mistress of Evil is one of the year's best films and one of Disney's best live-action adaptations to date."}, {"rating": "10", "text": "This movie is awesome I highly recommend it. I'll definitely watch it again and again"}, {"rating": "10", "text": "Absolutely enjoyed the movie and all the graphics. My family and I all loved the show, and is something we would definitely watch again"}, {"rating": "7", "text": "7/10. \"Mistress of Justified.\" This was a great sequel that surpassed the original. Great special effects, character designs, and acting. It’s simply magical. Michelle Pfeiffer kills it as the evil Queen Ingrith in a way that just makes you hate her guts. The only negatives I would remark on is the dramatic and abrupt change in tone after the war scene. It doesn't fit well going into the final act (seeming shoe-horned in). Especially considering the queens high treason and war crimes where she gets off basically scott-free and where her and the other's misdeeds are quickly pardoned and forgotten about. There are additional story inconsistencies regarding the crimson powders effects from the first half of the story to the second half. But all-in-all, worth watching."}, {"rating": "8", "text": "I liked this, but there are some caveats.First off: this movie looks great from the effects to the creature design to the costumes. It just has this great fairy tale fantasy look to it.Loved the world building in this. You get a lot better feel for the human society here. A new group of fairies appear in this and they are given more detail than expected with various subsets with their own costumes and customs.Found the pacing better than the last film, which had a lot of editing from the original cut from what I hear. I also appreciated that this movie was trying to be more of a crowd-pleaser. The last film's moments of harsh emotional darkness did feel like it was trying too hard to be edgy at times. However, I admit that that it did have some great character and dialogue moments with Aurora and Maleficent that Mistress of Evil lacks.Again, Angelina Jolie is the best part, stealing whatever scene she is in. She delivers the best emotional moments of the film. I was disappointed that the villain's henchwoman Gerda (Jenn Murray) is used sparingly. She is the competent and straight-to-the-task type. She evokes this odd uncomfortableness and does a lot with very few lines of dialogue.The movie's biggest problem is that it's like Tron Legacy in that the director/screenwriters found ways to depict murders without graphic violence and they felt that that justified them going crazy with them. I found the amount of death went farther than it needed for a family film. To compound the matter, the rushed feel-good ending really feels in conflict with the events that took place before it.The movie juggles way too many characters. The creators really didn't know what to do with Maleficent's sidekick Diaval (Sam Riley). Michelle Pfeiffer's duplicitous Queen Ingrith's scene time could've been cut. She was an okay villain who I think could've been stronger if her characteristics hadn't gotten old after a while. Also, Maleficent, the star of the film, is only in it half the time.Despite these legitimate flaws, I still enjoyed myself. This movie is basically fantasy porn. Just understand that this is one of those cases where you're willing to shut your brain off."}, {"rating": "10", "text": "The second chapter of this film partly looks more confident than first chapter. Angelina Joley lookas amazing, Ell Faning so sweet. Really recomends to watch"}, {"rating": "9", "text": "Very good, much better than the first, with big surprises about the origin of the maleficent and an epic ending."}, {"rating": "7", "text": "The film is exciting, a fantastic and amazing fairytale , angelina jolie steals the show"}, {"rating": "10", "text": "I loved it! Even more than the fiesta movie! The effects, the story. Great!"}, {"rating": "9", "text": "Una espectacular segundo parte memoranda de la primera donde podemos ver de nuevo a Angelina jolie en su esplendor y con la incorporación de Michelle Pfeiffer donde hace una interpretacion increíble en general una muy buena segunda parte do de os recomiendo verla"}, {"rating": "10", "text": "Me ha encantado esta segunda parte ojalá hagan una 3 parte porque me encantaría ver de nuevo a estas divas juntas nuevamente"}, {"rating": "10", "text": "This second part is magnificent, the effects, the story and of course the duo Pfeiffer and Jolie and their epic scenes"}, {"rating": "10", "text": "I love this second part the duo Jolie and Pfeiffer is spectacular and effects are the best  I hope has 3 part"}, {"rating": "8", "text": "Maleficent 2 is a good Disney tale, it does not cause any incredible emotions, but still holds the level set by the first part. So if you liked the first Maleficent, then the new part should be liked."}, {"rating": "10", "text": "Yeah I'm glad I did not fall for rotten tomatoes score and decided to go see it anyway. Very entertaining - awesome movie. This is a movie where everyone at the theater claps at the end!"}, {"rating": "6", "text": "The technical aspects of the movie are great. It is a spectacle for the eyes. I guess that's its main reason for existence - selling 3D movie tickets, and selling merchandise to children.I find it somewhat disappointing, because there was the potential for a good story here. If children were the main target audience, the story could've been simpler. Instead, I felt like I watched a mish-mash of different stories and characters, all somehow exploiting a Disney's established franchise. It's confused and confusing.So, we got Mad queen Cersei; a weak king; a weaker prince; a useless, weak princess (why?); General Black Man; Maleficent Targaryen; comedic relief Grima Wormtongue; Thor's Heimdall mixed with Gandhi; Bird man William Wallace; the Avatar creatures, but with less blue, and more wings; Sonic's useless hedgehog niece; and finally, perhaps the best character: Lesbian psychopath murderer.Why are they all in the same movie, and why is this a Lord of the Rings war meets Game of Thrones scheming meets Dances with Wolves? I don't know. I don't think the writers know. However, it's quite pleasing to look at, and Angelina Jolie portrays the part of Maleficent really well."}, {"rating": "5", "text": "I mean...It's okay...It's better than most of the movies that have come out recently but that's not really saying much. The third act actually approaches on being genuinely enjoyable but the rest of the movie is mostly uninteresting. None the less, this movie is watchable and not as bad as it could have been."}, {"rating": "7", "text": "This was not as good as the first one. It was entertaining, but was missing a storyline and a theme, which were very strong in the first one. This sequel was all over the map, trying to connect too many sub plots together. The last 15 minutes were really good. Worth going to the matinee. Cheers."}, {"rating": "10", "text": "So much funJolie is amazing and Pfeiffer is tooGreat effects and epic battle sequences"}, {"rating": "10", "text": "Since the so-called \"critics\" are being biased, i'll be biased too and give it a 10. Ideally it would've been a solid 8. Maleficent: Mistress Of Evil reminds us how Maleficent will always be mistreated for just being a horned-winged scary looking fairy and how her heart is bigger than what many people would think it is. Michelle Pfeifer/Queen Ingrith was the strong antagonist figure to the strong Maleficent, something the first film lacked. Also, Elle/Aurora's acting skills have developed over the course of the years. We also get to see Maleficent's origin and why she's the extra-ordinary powers that her kind doesn't posses."}, {"rating": "8", "text": "This is definitely a great Disney film. Bright decoration, cool acting...  Angelina is magnificent here. Really guys who dare to grade this masterpiece at 2?! (sorry for poor English) I had only positive emotions after the film, and much appreciate for this to actors (except Elle Fanning, she not ok here) and to Joachim Rønning. Feels like an old Disney's story. Thank you for the picture."}, {"rating": "9", "text": "This movie is perfect to watch with friends and family as it contains stunning images, realistic and captivating special effects and you get to see Maleficent’s glorious evolution of Character, not only does she discover more of her kind and realize that she’s not alone but she also comes back to life as a Phoenix after sacrificing herself trying to save aurora, which was unpredictable and an honorable way to end the movie."}, {"rating": "6", "text": "This sequel takes place a few years later, when Princess Aurora (Elle Fanning) announces her engagement to the handsome prince (Harrison Dickinson). However, his mother (Michelle Pfeiffer) has other plans that involve eliminating Maleficent (Angelina Jolie, who's so made up and stolid she could have been computer generated) and her kingdom. The story follows expected paths and the performances are all appropriately good or evil. What makes this film special is the dazzling visuals: enchanting creatures, stunning settings and magical effects."}, {"rating": "6", "text": "There's so much in this that doesn't make sense or doesn't match what we've been previously told or is utterly ridiculously convenient. It's enjoyable to watch but the story is fully of nonsense."}, {"rating": "8", "text": "Well well...I was certainly not expecting such an improvement over the first movie. It's definitely darker and more brutal than expected and also much better directed. Good camera work, elaborate costumes and stunning set pieces one after the other. The CGI looks amazing too showing this is truly an expensive and well crafted movie rich in details and visual beauty. The script doesn't offer an original and groundbreaking story but it's well written with some witty dialogues and a focused narrative that's easy to follow. While the phoned twists might appear naive for adults I am sure kids will enjoy this elegant film about self discovery, family, war, loss, friendship, love, hate and everything in between. Elle as Aurora has one intense scene where she is showing some skills as an acretess but overall gives a flat performance yet she is never the key protagonist of the story so in the end she seems an OK choice to portray an innocent and naive girl with a pure heart. She is still very likeable and never gets on your nerves as many Disney princesses. The Prince of the other hand is ridiculous. The two protagonists here are Angie and Michelle, both stunningly beautiful and immensely talented and good in their roles. Queen Ingrid is evil and her story perfectly justifies the first movie and the original story of The Sleeping Beauty. Maleficent goes through a self discovery journey rising above all. The movie is a good spectacle, aesthetically flawless, with great characters and a convincing plot. It's not a masterpiece but a very good sequel and a fun night out at the theatre. IMAX or Laser 4K is recommended. The UHD Blu Ray seems a must given the high number of beautiful Angelina close ups, HDR and Dolby Vision will make the movie pop so nicely. Recommended."}], "recommendations": ["maleficent", "alice_through_the_looking_glass", "alice_in_wonderland", "fantastic_beasts_the_crimes_of_grindelwald", "cruella", "oz_the_great_and_powerful", "the_bfg", "the_nutcracker_and_the_four_realms", "mowgli_legend_of_the_jungle", "bumblebee", "doctor_strange", "fantastic_beasts_the_secrets_of_dumbledore", "9", "how_to_train_your_dragon_2", "thor", "avengers_age_of_ultron", "let_me_in", "super_8", "stardust", "the_legend_of_tarzan", "valerian_and_the_city_of_a_thousand_planets", "rise_of_the_planet_of_the_apes", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "pan", "the_illusionist"]}