{
  "id": 504,
  "title": "Maleficent",
  "starring": [
    "Angelina Jolie",
    "Elle Fanning"
  ],
  "runtime": 97,
  "genre": [
    "Fantasy",
    "Adventure",
    "Action",
    "Family",
    "Romance"
  ],
  "description": "A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land.  Maleficent rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal – an act that begins to turn her heart into stone. Bent on revenge, Maleficent faces an epic battle with the invading King's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom – and to Maleficent's true happiness as well.",
  "releaseYear": "2014",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ik8PugpL41s137RAWEGTAWu0dPo.jpg",
  "categories": {
    "plot": 5.213114754098361,
    "acting": 5.575,
    "ending": 6.266666666666667,
    "soundtrack": 5.0,
    "cinematography": 3.5,
    "familyFriendly": 5.25,
    "funny": 3.3333333333333335,
    "action": 7.8
  },
  "reviews": [
    {
      "rating": "10",
      "text": "LOVE IT!  I would definitely see it again.  To the Top Critics: This is not American Hustle or The Wolf of Wall Street folks..THIS IS DISNEY.  Treat it like a Disney movie.  --- I thought they did a wonderful job recreating Maleficent!  My whole family loved it."
    },
    {
      "rating": "5",
      "text": "I loved what was hinted at in this movie, not particularly what was done though. The visual splendor was riveting for sure. I knew that if any actress could pull off the Disney villain Maleficent, it was none other than Angelina Jolie, an all-time favorite of mine. But I cannot deny the fact that the things that made this a Disney movie is pretty much what ended up strangling it. I liked the angle of her being a fairy who isn't sure about humans but tries to connect and even love them and is betrayed in a gruesome fashion. The film seemed solid until she started to seem quite a bit softer than would be consistent for a dark fairy/witch who threatens an entire kingdom of people. It's not that she could have been more sadistic but more like all the other characters could have been smarter, like all of them. Everyone who wasn't Maleficent was either crazy or pin headed. Except maybe her helper crow. But that sort of made it an environment where she had to do everything for everyone like the nanny, kind of a weak approach for a character with such a strong presence. Meaning she needed a stronger antagonist, Sharlto Copley didn't deliver for me. Just came off a little too insane. The story just got too predictable and cliche' to stay intriguing. The visuals did not disappoint though and who can't help but love Angelina's portrayal of a famous villain. A different story all together may have proven better for her character. I mean, if everyone tells the story claiming that's how IT REALLY HAPPENED, i mean who actually knows how it really happened then? How many stories do you need to bleed dry Disney?"
    },
    {
      "rating": "4",
      "text": "This unfortunate vanity project for Angelina Jolie could have been a thing of greatness. Not only does it suffer from complete lack of character development but it also fails to create any interest in anyone beyond the title character. We get a glimmer into Princess Aurora’s mind and energy but as quickly as we start to gain interest, Maleficent casts a sleeping spell; much like this film does to its audience."
    },
    {
      "rating": "5",
      "text": "Even with the solid and magical (no pun intended) performance from the star Angelina Jolie, the movie lacks a well thought out process. Instead of building off of a main role starring a someone sod Jolie’s caliber, it takes a turn and gives us dull supporting characters who left us bored for most of the movie. Although it had a fantastic lead and some beautiful visual effects, those couldn’t lift my spirits from the average and disappointment of a showing that Maleficent gave me."
    },
    {
      "rating": "6",
      "text": "Why, Why does Disney have to reboot Sleeping Beauty?  Now, I wasn't the biggest fan of the original movie but it was a pretty decent flick. But what I loved the most about the movie was the villain, Maleficent. She was so creepy and evil, it was awesome! So when I heard Disney was going to make a live action adaptation of Sleeping Beauty focused completely on Maleficent, I was excited. But my god was I wrong! For one, they make Maleficent good. That is such a bad idea and the worst part is they want us to simpithize with her! Uh, hello you realize she cursed and infant baby right? Speeking of which, Aurora is really bland in this movie. And don't even get me started on Prince Philip, he's pretty much useless in this film. King Stefen is probably the most forgettable Disney villains ever. The three fairies, WHAT THE HECK!!! They turned them into Three Stooges"
    },
    {
      "rating": "4",
      "text": "This started out to be promising, but by the end it just became worse and worse. Retelling the story from the villain's point of view could have worked if only she had stayed a villain and the characters had acted reasonably, but nothing made any sense.  Maleficent wanted revenge and she could have killed the young princess a hundred times yet she did not. The father didn't need to send his daughter away, especially not with 3 so incompetent women. He also didn't  react realistically when he was reunited with his daughter considering that he was so crazy because he loved her so much and tried to protect her.  I expected that the \"true love's kiss\" in the end is gonna be a twist and it could have worked if only it was Diaval who kissed her, because it was built up, from the very beginning it seemed like he cared about the princess. If maleficent remained a villain as she is supposed to be, it would have been nice to see that the bird/guy she tormented turns against her, ruin her evil plan and two person who suffered Maleficent's cruelty end up together. Instead, this \"twist\"  is plain dumb, the king became completely evil for no logical reason, the villain became nice again for no logical reason... etc. Meh..everything is dumb in this movie.\rSo let's see the positive things... It looks good. Yeh, that's it. The visual effects are cool, the whole fantasy setting is beautiful, the costumes are great, Maleficent looks exactly as she is supposed to look. But this does not save the movie, its bad, don't watch it!"
    },
    {
      "rating": "4",
      "text": "Angelina Jolie was good but that is really the only positive thing to come out of Maleficent. Uninteresting  characters, slow pacing and an anti-climatic final showdown provide little life in this boring film."
    },
    {
      "rating": "6",
      "text": "All the cast put in fine performances, particularly Jolie. I also praise Disney for introducing a grey area to all the black-and-white fairytales we already know (though this is not original or innovative). It certainly looks beautiful enough, with the 3D - like with most features - being most effective on the quiet, less spectacular scenes (such as the walk through the forest) as opposed to the grandiose battle scenes. Nonetheless, with all that going for it, it still feels like little more than another telling of the same story, as opposed to a retelling.Dem cheekbones though."
    },
    {
      "rating": "3",
      "text": "Maleficent will no doubt entertain the little girls with some dazzling visuals and an amazing performance by Angelina Jolee as the classic Disney villain. Unfortunately, I am a little girl and while this director lengthy resume with visual effects clearly shows it also shows that he doesn’t know much else. This is a first time director whose mainly done visuals all his life, which is reflected in his failure to tell a good story. The film starts telling a story about two good characters and it seems like we will get the interesting motivations for Maleficent being evil or a misunderstood villain but instead the film just switches the moralities leaving me wondering if the King will get his own movie where he is shown in better light. I didn’t expect much from this movie but I never thought I’d get writing this atrocious with poorly written characters, an incoherent story, and an experience that makes me want to prick my finger on the spinning wheel and die. I’d only watch this film with the sound turned off up until the credits when Once Upon a Dream plays, which is the only enjoyable part of this film."
    },
    {
      "rating": "10",
      "text": "I didn't expect to be as entertained as I was with this movie.  So many of today's special-effects-movies seem to rely more on the computer and less on plot and story-telling.  This movie was well thought-out and well-paced.  Angelina gave a great performance.  She could very easily have overacted the part.  I can picture some other (unnamed) actresses giving over-the-top performances in such a familiar-type role.  Jolie pulled off both characters,  both the evil and ultimately good one, in believable fashion.  And you can call me old-fashioned---I really liked this movie........so much more than that recent stinker of a movie about some Hotel in Budapest."
    },
    {
      "rating": "4",
      "text": "A spellbinding performance from Angelina Jolie as Maleficent and brilliant visual effects can't save the movie from its flaws which consists of: shoehorned characters (Prince Philip), slow pacing and an anti-climatic final showdown."
    },
    {
      "rating": "10",
      "text": "Magnificent! It is like a dream. Such a wonderful remake of a story of Sleeping Beauty. Awesome special effects. Jolie's play is superb, her cheeks, her smile. I will definitely show this movie to my mother."
    },
    {
      "rating": "5",
      "text": "I have to agree with most critics for this movie. Angelina Jolie is fantastic as ever, but as my friend said as soon as the movie ended, \"I would re-cast pretty much everyone but Jolie, Riley, Manville, Temple, and Staunton. Everyone else needs to go.\" And that's exactly how I feel as well.\r The movie starts with a very good scene in which young Maleficent is depicted as a kind-hearted, powerful young fairy, protector of Moors. Young Stefan actually works for me, but not with the grown-up Stefan. The cast just doesn't work. As soon as Jolie starts wearing the costume, I feel like I'm watching Halle Berry in that horrible Cat Woman spandex costume all over again. It just didn't work. Her natural-looking appearance was perfect. I don't understand why she had to change her appearance after her wings are cut off (only to reattach again).\r Elle Fanning is lovely, but she's not doing her best in this movie. I'm excited to see Oculus tomorrow which Brenton Thwaites is starring in, but his Prince Phillip character is way too irrelevant and unnecessary.\r The scenes are also very predictable. I totally saw the \"Maleficent is the true love\" twist right after somewhere aroud the first time she connects with Aurora. It's Frozen all over again. To sum up, I think the movie would only please children and those who simply watch the movie for eye-pleasing visual. Even the climax did not get me excited."
    },
    {
      "rating": "5",
      "text": "If anyone ever asks you for an example of a great idea turning into a very mediocre movie - point this title out, I'm sure the will get the idea. If not, they should watch the original Sleeping Beauty and then watch this. Better? Yeah.\rThis movie indeed has the potential to turn around the whole Sleeping Beauty story into something much better - more intricate, cooler and even thought provoking.\rThe main problem I have with this movie lays withing the writing and directing. Writers Linda Woolverton and Charles Perrault simply don't give the actors anything worthwhile to work with. Constantly the movie is preoccupied with transition scenes that literally tell us what has or is going on - too obvious, even for a children's movie. I believe it isn't in Disney's style.\rDirector Robert Stromberg went along with it and tried to make something of it, including some beautiful scenes, and other scenes that are as if ripped out from other fantasy flicks. He has done some pretty good work in the past, however here we see mediocrity and literacy, but I'm pretty sure that came out mainly from the script.\rI have to note out that this movie contains some of the worst camerawork I've ever seen - awkward zooming and totally worthless scenes included.\rOther than that, actors starring here had nothing to work with to begin with, so no one is even worth mentioning. Jolie tried to make Maleficent faithful and memorable, but ultimately fails, due to reasons already mentioned.\rAnd there is nothing more to say. It's a pretty movie, it had the potential to be a masterpiece, however it falls short to be classified as even a Disney kid film.\rIt can be entertaining to watch if you have nothing else to do, but that's about it."
    },
    {
      "rating": "8",
      "text": "I found this movie delightful.  It was beautiful to watch. Angelina is perfect in the roll.  I've always been a Maleficent fan.  I even have a really cool Disney costume I ware  every few Holloween.  Anyway, if you want to feel young at heart for 90 or so minutes.  I recommend it.  Disney should have made the story this cool."
    },
    {
      "rating": "10",
      "text": "While it's fun to \"make-believe\" that frogs turn into Princes, Maleficent tells the untold tale of what happens when Princes turn into frogs.  And it tells the tale from the viewpoint of the person who is physically traumatized and emotionally betrayed by the very person in whom they placed their deepest love and trust and the inner journey to heal from that horrific evil and reclaim your own capacity to love...from the least expected source. This is a brave and true tale, told with stunningly beautiful direction by Stromberg, an ingenious script by Woolverton and timeless, flawless performances by Jolie and Fanning.  Reading most of the \"negative\" reviews of this film, it's pretty clear that many people 1) simply did not grasp the subtle philosophical messages of this film and 2) want to keep their \"fairy tale\" characters either black (evil) or white (good).  But telling those simplistic tales to our children does not prepare them for the complexity of the real world. Congratulations to all involved for crafting a blockbuster masterpiece that will actually create a better world by teaching empathy, understanding and the true meaning of love."
    },
    {
      "rating": "7",
      "text": "\"Maleficent\" 10 Scale Rating: 7.5 (Very Good) ...\r The Good: Jolie seems like she was born to play Maleficent as she was perfect in bringing the classic villain to the big screen. A mere cock of her eyebrow or well-timed menacing glare would often times be enough to get the point across. Perhaps the best performance of Jolie's career. The story itself is well done and Maleficent's transformation from wronged fairy to evil queen was one of the highlights of the film. As a fan of the classic tale, I was more than a little apprehensive with a film casting Maleficent as an anti-hero, but it was well handled and believable. The special effects were also, for the most part, top notch as expected.\r The Bad: However, a few of the denizens of the fairy realm were poorly done and looked like cartoons. That was especially frustrating since the overwhelming majority of the film was an amazing spectacle. While I was fine with most of the liberties the film takes with the story (you are indeed warned that this is NOT the story you know, but instead is what really happened), there is a key part near the end that drops the film down a notch. I scratched my head at this particular scene as it almost makes you wonder why they made the film to begin with. Copley is hit and miss and on occasion over-acts. I sort of expected this from him though as it seems to be a common issue for him."
    },
    {
      "rating": "10",
      "text": "The film exceeded expectations in all, the story was very well written and in my opinion this version became greater than the original. The special effects were used well, the acting is mostly perfect in the role of Angelina Jolie, this is definitely one of the best Disney movies. Forget everything you know about Sleeping Beauty and start afresh. This movie teaches you the true backstory of sleeping beauty with lots of twists and awesome effects. Watching it in 3D is perfect."
    },
    {
      "rating": "5",
      "text": "The visuals are striking and Angelina Jolie is phenomenal but even those points can't compensate \"Maleficent\" from its bland narrative and hackneyed tone."
    },
    {
      "rating": "8",
      "text": "As others have stated, the effects are amazing and Angelina Jolie is a great Maleficent. But there's more that makes this film worth-while. This movie modernizes an old, formerly-boring tale while adding depth to the most interesting characters. It blurs the lines between good and evil, exploring the fluid relationship between the two. Cons: Lack of humor (not that this was a comedy, but they could have done more) and an ending that left me a little dissatisfied."
    },
    {
      "rating": "10",
      "text": "Maleficent is MAGNIFICENT!!! A heart-warming story of a mother's love.  True love's kiss is not exclusive for romantic love only, but it is most certainly true in parental love, too.  Angelina Jolie was superb, as usual."
    },
    {
      "rating": "3",
      "text": "With its weak story and exaggerated scenario \"Maleficent\"  can not meet the expectations of the viewer,  and the action of Angelina Joely can't save it from disaster that is."
    },
    {
      "rating": "10",
      "text": "This is so good. I love everything in Maleficent, it's amazing to watch. Disney must be proud of themselves. I can't really complain about this wonderful. If you haven't seen it yet, you are missing out. Once again, great job Disney."
    },
    {
      "rating": "2",
      "text": "I must confess, I was not really a huge fan of Walt Disney's 'Sleeping Beauty' (1959), for some reason, I thought that the film was nowhere near as fun or endearing as 'Snow White and the Seven Dwarfs' (1937) or 'Cinderella' (1950). I did, however, enjoy the evil presence of the ever so powerful Maleficent, thinking she could just be one of the best Disney villains of all time, you would think that making a movie about her would be interesting, especially with Oscar winner Angelina Jolie in the title role.\r I am afraid that this film does not do the title character justice, 'Maleficent' commits the crime of being utterly boring, which is a word you wouldn't think could be used to describe a Disney film, but it is.\r We see Maleficent from a young age, and how she meets a boy named Stefan, and they grow up together falling in love. One day, when Stefan leaves for the kingdom, Maleficent is charged with almost killing the king. The king then promises whoever kills this villainous Maleficent will be the next in line to the throne.\r Sharlto Copley plays the much older Stefan, and he wants the throne so badly, that he betrays Maleficent on order to do so. Ever since this, we see Maleficent grow bitter, and when Stefan gets married and gives birth to a daughter, that's when she decides to curse the child. So, that's the reason why Maleficent did what she did, it's because the king is a cold-hearted person who is just unlikeable. If you're thinking that's not what happened in the animated classic, you are right...already this film makes no sense.\r Elle Fanning plays the princess Aurora, she is convinced that Maleficent is her fairy godmother, since she has been watching her since she was a baby. The two seem to get along, and Maleficent seems to think that maybe she is overreacting, which in this case, yeah she is.\r This film spends too much time showing us some colorful CGI, and numerous flying creatures as if we are in a \"Harry Potter\" film, but neither look impressive enough to hold our attention for more than five minutes. The film also plods along ever so slowly, for a film that is supposed to be 97 minutes long, it feels like an extra hour longer. There is no life in this film, no sense of fun and excitement...it is devoid of energy.\r Angelina Jolie looks great in the role, but she is ultimately one note, I do not blame her, the blame is for the screenwriter, who just happens to be Linda Woolverton who wrote the wonderful 'Beauty and the Beast' (1991). How could a writer, who wrote something so magical, and so exciting...then go to to write something so lifeless and almost boring?\r The dark colors and cartoon-ish CGI do not save the movie at all, everything about this film is just not worth your time or money. 'Maleficent' is a magnificent bore."
    },
    {
      "rating": "5",
      "text": "Maleficent is Disney's first attempt at a movie that stars a villain to be the main role; --- correct me if I'm wrong --- however, there's almost no attempt to survive this long movie."
    },
    {
      "rating": "10",
      "text": "God damn finally a well made original fairytale production. I mean ofc it has some flaws but its really a no miss movie if you enjoy fairytales. Acting is subtle and spot on. Presentation and pacing is sufficient. Sometimes it gets a bit boring but those passages are few and far between."
    },
    {
      "rating": "3",
      "text": "If I had to compare this movie to another movie of it's kind, it would have to be Snow white and the huntsman. But jolie is not theron, and this movie just hovers right below huntsman but above mirror mirror.  I understand that it's a re imagining, but the script could have used some re-editing. For me I give it a 3 out of 10."
    },
    {
      "rating": "4",
      "text": "Maleficent could have been a Disney live-action film for the ages; it has some of the right pieces.  But with a weak foundation and suspect direction, it’s just another dull kid-flick to slug through, with a story like a cursed spindle, ready to prick its viewers into a deep slumber."
    },
    {
      "rating": "10",
      "text": "Absolutely fantastic :)Perhaps the best movie I've ever seen!With the beginning and this kind of ending story is breathtaking.Angelina is BEAUTIFUL,and is definitely the right person to play Maleficent,and she pulled it off flawlessly:)One of the movies that I am going to watch many times!"
    },
    {
      "rating": "7",
      "text": "A very predictable movie with a little twist on the original. this movie is based from the movie \"Sleeping Beauty.\" It is a Disney movie so i guess that is justified. it is intended for a younger audience. with some touching moments it was a movie i actually enjoyed, it brought a little hope after i was disappointed from the movie \"Godzilla.\" The good acting brought the characters to life. 7.3/10"
    },
    {
      "rating": "3",
      "text": "Jolie is fantastic as Maleficent but this movie doesn't know what it's doing with itself.  The plot is all over the place.  Stick to an idea and go for it.  The \"Sleeping Beauty\" is asleep for all of 5mins in this movie.  Ellie Fanning who plays Aurora is terrible in this too.  A noble attempt to come at a classic from a different angle but it ultimately falls flat on its face."
    },
    {
      "rating": "6",
      "text": "Angelina Jolie steals every scene with her excellent performance .... The Disney movie has charming effects, but a poor and bad script.\rIt is a cliche movie for this summer."
    },
    {
      "rating": "1",
      "text": "You can tell this film is directed by a visual effects person--the film is high on visual beauty (often to a superfluous degree) and very low on interesting or even logical storytelling.  I would describe this film as \"hilariously bad,\" with an emphasis on the hilarious and the bad.  The audience I was sitting in at some all just let out a collective laugh (I think it was when she started floating people through the air), and after that it just went downhill, with people openly commenting on the nonsensical plot elements and heckling the characters on screen.  Basically it takes elements of more successful movies (Lord of the Rings, Frozen, Beauty and the Beast, etc) and tries to replicate their successful parts in a movie that adds very little to the story of Sleeping Beauty.  The beginning of the film is the most successful; I wish they had drawn out the story of Maleficent as a child--the actress who played her was quite hypnotic."
    },
    {
      "rating": "0",
      "text": "This film it's an abomination. Sorry for my english, but i fell betrayed by one of the most interesting plot of this years. The trailer it's a trap, and all the script (maybe the first part it's ok) is a big slap on the face of all the adults who grew up with the sleeping beauty and the terror for one of the most iconic villain in animation history."
    },
    {
      "rating": "6",
      "text": "Angelina Jolie made an amazing performance in this movie, but there's a lot of cliches predictable scenes... and despite there's a good new perspective of the story, and great visual effects... The movie is middling."
    },
    {
      "rating": "8",
      "text": "\"Maleficent\" was looking to create a dark magical tale based on \"Sleeping Beauty\", and even though it has its flaws, it did exactly that. Thankfully to its striking visuals and Angelina Jolie's magnetic performance."
    },
    {
      "rating": "0",
      "text": "It was so disappointing to see how Disney allowed to destroy a Classic story like sleeping beauty. Even if  the idea behind was to show why maleficent became a villain, the story changed so much that it becomes shallow and forced for the new story. The good are now the villains and the villains are now the heroes.....silly.\rNo creativity at all.\r P.s. Seems that Disney parks in Orlando, California, París, etc. Will have to tear down their main castles, the sleeping beauty castle...ironic!"
    },
    {
      "rating": "7",
      "text": "Angelina Jolie gets crisply chiseled cheeks and a horned headdress as the villainous star of Disney's Sleeping Beauty legend. This is one of those origins stories that upends expectations and reveals the sad, touching truth behind the wicked profile. Luckily, Jolie is up to the demands. Her commanding performance is the film's strongest feature. The writing is not special, the visuals tend toward high-end animation and the 3 fairies that are supposed to provide comic relief don't. Luckily, its short running time (97 minutes), brisk pace and Jolie's presence help make this a moderately enjoyable film."
    },
    {
      "rating": "10",
      "text": "Maleficent is a film that is very well made. Its not fast-paced which is a plus. Angelina Jolie is so good in the role as Maleficent, that words cannot even really describe how spectacular she is as Maleficent so spectacular is an understatement. She really got into the character 'Maleficent' excellently. Elle Fanning is perfect for the role as Princess Aurora, no other actress would have been better for the role as Princess Aurora then Elle Fanning, and no other actress would have been better for the role as Maleficent then Angelina Jolie. This film is perfectly paced and doesn't feel rushed in terms of running time. It's not fast paced and that's a plus in and of itself. It doesn't end too soon, it doesn't end too late. It's just a perfect 98 minute running time.\r What I liked about this film is the cast because they could not have picked a better cast then they did for this film. Another thing i like about this film is that the story is amazing and even with some new twists which makes it interesting as I have noticed with this film. The pacing is great because it doesn't feel rushed like some other movies around 98 minutes can feel. The acting is perfect. Not one movie star in this movie had any bad acting, so i was happily surprised with that not being an issue. Although, I shouldn't have been surprised about that, because the cast in this movie is just absolutely superb.\r The story and the visuals are also things that really stand out in this film like the cast does. I was very happily surprised at how amazing and good the story and visuals are in this film. They are just combined in this film perfectly. Not one time did I have a bored moment watching this film. It is an exciting and stunning film and definitely does not disappoint. I highly recommend this live action Disney take on Sleeping Beauty through Maleficent's point of view to everyone, except to really young children in the single digit ages.\r After my viewing of Disney's Maleficent live action film, I give it an A+ or in other words a 10 out of 10."
    },
    {
      "rating": "0",
      "text": "I cannot stress enough my dislike and contempt for this film. MALEFICENT is one more overproduced piece of crap from the Disney machine. Angelina Jolie, who I actually like a lot, needs to get back to real acting which she has proven most capable at. MALEFICENT is a sad indication of what some audience members actually want and we'll keep getting as long as the BO is strong (pun intended)."
    },
    {
      "rating": "10",
      "text": "Absolutely spectacular! Angelina Jolie played the role to perfection. The story was great. I do wish they would have made it a little more dark, but overall, spectacular movie!! Must go see!!!"
    },
    {
      "rating": "10",
      "text": "This movie was way underrated by the critics. Personally, i thought the movie was great, Angelina Jolie rocked the part, and it deviated just enough from the original mvoie to make it good while still keeping true to the story."
    },
    {
      "rating": "1",
      "text": "Come on!! I mean come on this is the meanest deadliest witches of all we are talking about!! well that aside I've never believed in Angelina as a Superhero, Super Secret agent or any Epic character, she should stick to more complex and psychological characters, that's why I expected a memorable Maleficent but instead the movie kept me asking what and why and it never gave me the answer. But Disney you own the stories you can tare them apart as much as you want."
    },
    {
      "rating": "6",
      "text": "The movie looks so beautiful, Angelina Jolie is perfect in her role, there are a couple of powerful moments and overall it is not boring. But the story is weak, the most interesting part is the first act, while there´s a big amount of minutes where nothing seems to happen in the second act. Nice message with some women empowerment. Not much more going on. You can stream it."
    },
    {
      "rating": "8",
      "text": "This film is a very symbolic film and if you take the chance to sit and reflect upon what you have seen, I think you will agree with me in saying that the story is was intelligently written. Although fairy tales are fantasy, they often make comments on the real world, and this film establishes the fact that nobody is simply evil.\r This is not a recreation of Maleficent or Sleeping Beauty, it is a revision and it executes that perfectly.  My only flaw with the film was that the cruelty of Maleficent did not really develop to the climax (Aurora's curse)."
    },
    {
      "rating": "10",
      "text": "Saw it yesterday. I don't even know what to say. It was absolutely incredible. Some people say it was a bit cliche-ish but all Disney movies are like that, and this is so unique I am sure if it didn't have to follow the initial story of sleeping beauty this would have been different. The visuals were incredible. I especially loved the flying and battle scenes near the beginning (I think you can probably tell why because of my user). Certainly one of the most unique and interesting Disney movies yet. I would recommend it to anyone! 10/10 for sure."
    },
    {
      "rating": "5",
      "text": "This movie is ok but it lacks any of the wonder or imagination of the original Sleeping Beauty.  Visually the film works, it looks great unfortunatly thats the best part similar to other disney retellings.  The story is sloppy and man are those fairies annoying.  C+"
    },
    {
      "rating": "5",
      "text": "Great visual effects,  but the develop of the principal character is poor. A cruel villain that actually never was a cruel villain? I recognize however, the effort that Angeline put into her character but, it was simply bad written."
    },
    {
      "rating": "7",
      "text": "Не плохая графика, точнее она на на столько хороша, что ее не видно, то есть кажется что так и должно быть, так и было. Радует актерская игра Джоли, как всегда на высшем уровне. Не очень обычная история и развязка, но что-то в этом всем не то, не привлекает. Так же не оправданная длинна фильма, растянули как целую эпопею.\rМой вердикт: сходить с девушкой самое то)))"
    },
    {
      "rating": "3",
      "text": "Immediately as the film starts, a narrator tells us about Maleficent's back story. We are shown who she is, but most of what the audience knows is delivered through narration. We meet Stephen shortly afterwards. Maleficent falls in love with him because the narrator says so. However, Stephen is \"ambitious\" because the narrator says so. Stephen leaves Maleficent behind. She is sad because the narrator says so... The narrator eventually eases off halfway through the film. This is a poor way to impart exposition to the audience in a film, and the rest of the narrative is unfortunately weak due to further poor characterization of the antagonist and supporting characters. Jolie's performance as Maleficent saves her character somewhat. I DID like the feminist message at the end, clumsily executed as it was. Ultimately, this film suffers from very basic narrative and character deficiencies resulting from poor exposition and cliche overuse. This film is not necessarily terrible, but one should not expect to find a profound feminist narrative here."
    }
  ],
  "recommendations": [
    "maleficent_mistress_of_evil",
    "alice_through_the_looking_glass",
    "snow_white_and_the_huntsman",
    "alice_in_wonderland",
    "stardust",
    "the_illusionist",
    "cruella",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "let_me_in",
    "oz_the_great_and_powerful",
    "the_nutcracker_and_the_four_realms",
    "the_bfg",
    "pan",
    "the_prestige",
    "bumblebee",
    "9",
    "tomorrowland",
    "super_8",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "thor",
    "the_lovely_bones",
    "the_lucky_one",
    "onward",
    "hugo",
    "the_fly"
  ]
}