{
  "id": 66,
  "title": "Malignant",
  "starring": [
    "Annabelle Wallis",
    "Maddie Hasson"
  ],
  "runtime": 111,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "Madison is paralyzed by shocking visions of grisly murders, and her torment worsens as she discovers that these waking dreams are in fact terrifying realities with a mysterious tie to her past.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dGv2BWjzwAz6LB8a8JeRIZL8hSz.jpg",
  "categories": {
    "plot": 3.1818181818181817,
    "acting": 3.391304347826087,
    "ending": 5.666666666666667,
    "soundtrack": 5.5,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 3.4285714285714284,
    "action": 6.2
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Come on people this was a wholly original idea and gory as all hell.  Had a freaking blast with this one.  The “twist” was bonkers AF never saw that coming.  Definitely cool to watch as we head into Halloween.  James Wan needs to make more original horror movies!"
    },
    {
      "rating": "7",
      "text": "On the one hand, there's the consistently questionable dialogue, the spotty performance work throughout and the overall clumsiness in handling certain nuts and bolts in the narrative. On the other hand, though, there's James Wan's always dynamic directorial bravado on display, the generally engrossing mystery at the center of things...and the absolutely batty third act that's just impossible not to enjoy. I hate to parrot the masses with this stale of a take here, but they really are correct - the final twenty minutes of this movie really do make it worth the watch. It's just always a blast to see a film and filmmaker make such a balls-to-the-wall, wacky-ass decision and have it pay off with so much raw entertainment value. Can definitely say with confidence that this is something I've never seen before and I for sure do not regret doing so."
    },
    {
      "rating": "7",
      "text": "The tone of this movie skirts the line of campy really hard, but balances itself out well with moments of seriousness and good scares. The film is loaded with twists, and is a fun ride all the way to the end. The acting can come off as kind of flat at times, but that appears to be by design rather than an oversight. A long overdue dose of escapism overall that is at least worth a watch."
    },
    {
      "rating": "8",
      "text": "I heard a lot of chatter about Malignant being some kind of neo-Giallo film, but I really think that was just an attempt to distract from the true nature of this film, to protect the twist in the third act. Sure there are elements of Giallo here but they are just nods. The true parentage of Malignant is over-the-top violent, frenetic paced and usually at least SEMI tongue-in-cheek horror B movies from the 70's and 80's. James Wan sets the viewer up for the ride in the opening sequence with an absolutely bonkers set piece that lets you know his intentions right off the bat. It's gonna be bloody, violent and poke fun at it's own parentage. I truly believe that this is done as a way to communicate to the viewer - \"Stay with us on this ride. It's going somewhere great. The 2nd act will drag a little but there is a good reason.\" Once you see the reveal, you understand a lot of the more puzzling elements earlier on.Now, is this film an acting class? Nope. It is the most clever plot you'll ever see? Not even. Will you guess the twist early on? That depends on how many of these types of films you have seen before. I figured out what sub-genre this was early on but I didn't get the twist until about five seconds before it dropped in all it's glory. I only had time to get out \"NO WAY.\" before my wife said \"What?\" and then we were both like - \"WT actual F?!?!\"I just have to applaud James Wan for attempting something fresh and semi-original here. There is so much to like about this film. The cinematography, most of the special effects, the humor, the way it doesn't pull punches with the violence - and the fact that there is no gratuitous sexuality. This film is on a mission. If you relax, have fun with it and don't take it (or yourself) too seriously, this film is a blast and a joy to behold, for fans of bloody disgusting horror, anyway. If you don't like violence, DO NOT watch this film. There are no jump scares and no silly Deus-Ex-Machina resolutions. In the end it all makes glorious, ridiculous, bloody, violent sense.If you dig movies like My Bloody Valentine, Texas Chainsaw Massacre 2, Basket Case, Dead Ringers, Sinister, etc... you will most likely be grinning like an idiot at the end of Malignant. Invite some friends over, order a pizza and have a blast with this one. It's definitely worth checking out."
    },
    {
      "rating": "10",
      "text": "I don't relate to people's interest in complaining about everything nowadays. Maybe if the audience had even enough talent to create anything for other people to **** on, they'd be more understanding. Akela Cooper, Ingrid Bisu and James Wan clearly put a lot into making a fun, almost retro, horror movie. I can't see a single thing wrong with Malignant, it's, at least, worth seeing, and that's all that really matters."
    },
    {
      "rating": "3",
      "text": "Alright, the best part of this movie was the animation for the memories dissolving and the choreography for a fight scene that happens late in the movie. The animation for the antagonist? Bad. The twist? Both ludicrous and bad. The acting? Cheesy when it's good, but otherwise bad. The script? Bog-standard B-quality made for TV movie stuff. Maybe this movie was supposed to be something else? A lot of other reviews state it's supposed to be a homage to 80's/90's slasher films and if it is they still did a bad job."
    },
    {
      "rating": "0",
      "text": "Malignant is good, just in the first few minutes. Such a sin in the main: the drama and suspense. It's admirable at first, but over time they get rough."
    },
    {
      "rating": "9",
      "text": "A word of warning; this movie is not for everyone. It's specifically catered to people who loves cheesy 80's/90's era slasher movies and from what it set out to do, it achieves it in spades. For those who are willing to embrace it for what it is, this is gonna be one hell of a ride."
    },
    {
      "rating": "1",
      "text": "Not scary, creepy, or intriguing. First act is decent, second act is boring and repetitive, and the third act is goofy and off-the-rails (though not in a good way). Could have been enjoyable shlock but the tone is all over the place. The characters were one dimensional and poorly acted."
    },
    {
      "rating": "8",
      "text": "Starting with homage and evolving to outright insane fun, Malignant is a tribute to the best of 80s american and italian horror, while also becoming it's own unique beast that should not be missed by any horror fan!"
    },
    {
      "rating": "10",
      "text": "The first movie since Conjuring (2013) what made me scream like a baby. Amazing job!"
    },
    {
      "rating": "0",
      "text": "Possibly the **** movie I’ve ever seen…My experience can only be explained this way:I was going back to the cinema for the first time in 2 years, went with my girl, we bought some food and we were really exited for the movie to start.At that moment James Wan arrived, pulled down his zipper, and started to pee on our feet. We didn’t really understood what the heck was happening, but we were already there, so we kept watching, hopping it will get better.But no. James kept peeing. staring us dead in te eyes like if he was thinking “oh yeah, this is happening”At the end, he shaked his thing, splashing everything, farted, and went away. Worst experience ever. I’m still frustrated about my money. Wouldn’t even accept to be paid to see it again ."
    },
    {
      "rating": "0",
      "text": "I love JW but again he let me down, in other movies he is producing and its okay but now is his own fault, being bad intentionally is not an excuse is was just a bad movie in general."
    },
    {
      "rating": "1",
      "text": "Oh boy… where to start with this one. Walking out the cinema no less than four couples questioned wether or not what they had just seen was a terrible dream, or that we were on some form of reality show, with cameramen secretly recording our reactions. The two people in the toilet cubicles discussing what was worse, the acting, story or premise, or the girls mentioning that they should have watched a trailer first - this was a strange experience just walking out of a film to murmurings of what we all had just witnessed (one that I could only presume had the same profound affect as cult classic ‘The Room’). The movies premise is actually a really interesting one, something very unique and unlike any horrors recently so for this I have given the film at least a 1, that’s about as good as I can give this film. Some of the character choices (not in a dumb movie type trope) just seem to be poorly written, a great example of this is the main character suffers a tragedy in Act 1, her mother does not even turn up in the film until around half way through not even questioning anything she has gone through (odd choice, bad mother). To some domestic abuse being shoehorned in which in reality sets up the movie but this could have been done in so many other less jarring ways. The acting is absolutely atrocious with some poor attempts at some jokes thrown in, basically the structure around this absolutely mental film essentially does not support its unique interesting premise, leaving it looking like a C rated horror movie where if it was available to stream for free I would want my money back."
    },
    {
      "rating": "0",
      "text": "Highly disappointed. I was really looking forward to seeing this movie but a total let down. The first 5 minutes I thought was a bad commercial. If I would’ve known it was the movie at first I would’ve walked out. Absolutely ridiculous acting, the music was terrible, the storyline is just weird. There’s nothing about this movie that I found scary. More of a comedy or a spoof. I’m not really sure what they’re trying to do. I am a huge fan of the conjuring movies so this was a complete let down."
    },
    {
      "rating": "1",
      "text": "If it doesn't get the Razzy, it was robbed. Honestly, this movie is so insanely bad, it is good, then bad again. It can only be assumed its intentionally bad.  The acting is absolutely awful.  The dialogue is very canned and stilted.  The actors have about as much inflection as a My Buddy Doll. Even their actions a dumb.  The cops act  like a bad 1970s under budget cop show. And everyone makes conclusions that aren't evident.  In one scene, the lead protagonist is putting her dirty clothes in the dryer (unwashed) when she witnesses a murder.  All the characters just follow along for no logical reason other than to set up the next scene.  Our mid-twenties protagonist doesn't even remember her teenager traumas, without her overly bewildered mother showing her home movies that were somehow kept and forgotten up until this point. Somehow her own same-age sister doesn't even remember this. It makes no sense.  Also, every character is exceedingly cliché to the point of stupidity.  The intended horror scenes are so bad, that they are laughable.  Seriously, you will laugh at how absurd they are.  I can literally point out something wrong in every single scene.  Its that overwhelmingly bad.  I have seen better films on Mystery Science Theater.Troll 2 and the Room may have new competition for worst movie."
    },
    {
      "rating": "0",
      "text": "Worst horror movie of the year so far, and one of the worst horror movies of all time.  Somehow worse than The Night House and Candyman. Wow this sucked"
    },
    {
      "rating": "0",
      "text": "Wtf did I just watch really enjoy this director but god was that awful. Not scary not all that tense honestly terrible. Will not be watching this again do better mr. wan"
    },
    {
      "rating": "9",
      "text": "Original and very well crafted horror ride. Reminded me of original \"Evil Dead\"."
    },
    {
      "rating": "1",
      "text": "My wife and I couldn't stop watching this train wreck of a movie. Absolutely terrible in all aspects. We really don't know why we felt the need to see it through to the end. I gave it a 1 because it truly boggles my mind. I guess watch it?"
    },
    {
      "rating": "3",
      "text": "The Movie is 1 hour and 50 minutes long I literally wasted 1 hour and 20 minutes on this cheaply made garbage literally for nothing! what a waste. The effects towards the end are super cheap! I've seen Netflix movies with more effort than this and that's saying  A LOT!! What kept me watching that long was because I was waiting for the Plot twist but boy what a HUGE disappointment it is. What makes it so terrible is the Effects used and specially the BIG plot twist the Presentation is just so badly done, so cheap! The movie starts out very strong, keeps the viewers attention but when the plot twist is revealed everything that was good about the movie turns into a cheap B Studio movie and the effects of the creature? Wow what a ripoff. Wait when you watch the Jail scene. For a movie that starts out as a solid 7 the first hour and 20 minutes that scene is so cheap and the ones before that when the creature is revealed that it plunges into a 3. I am honestly not even going to continue watching I feel offended as a horror super fan, this is embarrassing. Its so extremely corny. This gets a 3 out of 10 from me."
    },
    {
      "rating": "3",
      "text": "This film is the most boring cinema I’ve seen in a very long time.   It only gets points for its style and cheesy appeal"
    },
    {
      "rating": "1",
      "text": "Absolutely terrible. Who greenlighted this movie? There are college/indie films with better acting and plot progression."
    },
    {
      "rating": "3",
      "text": "A genuinely bad horror movie. A big disappointment coming from the usually amazing James Wan."
    },
    {
      "rating": "4",
      "text": "James Wan forgets how to SCARE... 1st act is a haunted house film - but offers literally no scares... I'm not sure how this is possible, as imo, Wan is the BEST of our generation for this... The film flip flops between, buddy cop comedy (not funny), a weird action film and some body horror (which is actually kind of cool). I wish Wan stuck to what he does best, and if he offered MORE SCARES (ITS A HORROR MOVIE) I would have liked this film so much more... PS. I actually loved the twist!"
    },
    {
      "rating": "7",
      "text": "After dipping his toe in big budget films in the Fast And Furious franchise and the DC universe, James Wan returns to his pulpy-Leigh Whannell partnered roots with Malignant. It's more along the lines of, say, Dead Silence than Saw. I've seen reviews mention the campy aspects of the film and I'd call it pulpy instead. Like Tales From The Crypt or Amazing Stories kind of pulpy. And the title which I kept mistaking as Malicious or Malficient, makes perfect sense as the precise definition of malignant is \"tending to invade normal tissue or to recur after removal\". Then there's the underground Seattle location with the building atop the damaged portion of the city that remains pretty much intact. Thematically fits. It's bat turd crazy, but in a good way. I've also seen comparisons to directors like DePalma and Raimi. I would add to the list, thematically, Frank Henenlotter of Basket Case and Brain Damage fame. That should give you an idea of what type of film Wan was aiming for."
    },
    {
      "rating": "3",
      "text": "Here's a horror flick from director James Wan that sees a young woman haunted by her past and visions of people dying all around her. She must discover the mysterious reason behind all of these occurrences before it's too late. I went into this one with moderately low expectations, having only watched the trailer once, and I gotta say that I was not at all prepared for just how cringy and flat-out bad this film would turn out to be, even with my low expectations. What starts off in the first half as a mysterious psychological horror thriller (and a surprisingly slow one at that) quickly dives headfirst into absolutely absurd supernatural slasher horror schlock, complete with terrible cgi and effects. On top of that, terrible and hammy acting is provided from practically everybody involved here, with several moments coming off as unintentionally hilarious often times due to the actors and their line delivery. The final act was really just something else, and not in a good way at all. I can't remember the last time a film jumped the shark in its final act worse than this one, and the ending, like the rest of the film, was just cheesy, predictable, and completely unsatisfying. Overall, this was not only not scary and full of cheap jump scares, gore, and forced comic relief moments, but it also just reaffirms my belief that this is why the horror genre has been slowly dying over the years."
    },
    {
      "rating": "2",
      "text": "P######ta filme ruim da porr@! Nem se iludam por ser o diretor de outros filmes aclamados. Aqui você vai encontrar um filme gore e uma história MUITA tosca! Não vale o tempo perdido."
    },
    {
      "rating": "4",
      "text": "James Wan's Bogeyman, who likes to sharpen things like the red-faced monster from Insidious.Yes, it's more gruesome when it comes to violence, but everything Wan has done before is here, especially what he did in Insidious.From the uninspired jump scares, always showing someone behind the character in the scene, along with the predictable formulaic music by Joseph Bishara, which leads you in every way.To the story of the main character who repressed a sinister past, who is also forced to confront it with hypnosis.Even the sets that involve the monster, at some points seem straight out of The Further.You know, if it's not dark, dirty, and dilapidated, it doesn't work.Malignant it's very long, repetitive, and painfully predictable.Won't even talk about the lazy performances, nor the missing payoff from its conclusion.Wan sold Warner some kind of modified rehash of his old tricks, and they bought it as a high-caliber film.Gotta respect him for it."
    },
    {
      "rating": "3",
      "text": "What if Basketcase were remade with a 40 million dollar budget and was also a haunted house / action movie / thriller / X-files / Giallo / copy & paste of a bunch of other genres? Are you exhausted already? Is this movie trying to be funny? I sure rolled my eyes the whole time. The whole thing is really predictable, despite the ridiculous premise. You can see the scares coming from a mile away. The acting and script is appalling. It's way too long, cut it down to 75 minutes and it could be legit entertaining. There's too many plot threads that don't contribute to the story and go nowhere. Big budget and horror rarely go together and this is no exception."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "10",
      "text": "Great film. I really enjoyed it. People always want crappy jumpscares that are cheap but this film shows there's much more to horror than jumpscares"
    },
    {
      "rating": "10",
      "text": "It's a good movie . James Wan is awesome .Not only the horror, the fight sequences are also good ."
    },
    {
      "rating": "0",
      "text": "Laughingly bad to the point I had to stop the movie and fast forward to the end, which was cringe worthy."
    },
    {
      "rating": "9",
      "text": "Insanity, ridiculousness, and a lot fun. A must watch if you're bored of the same stale horror modern tropes. A genuinely fun time. Lots of gore and lots of surprises. This movie is bonkers in the best way possible."
    },
    {
      "rating": "10",
      "text": "This is James best work. Like the Matrix of horror movies as far as being something that pushes the genre forward !  Great movie and a must watch. Has one of the best action sequences I ever seen a horror movie ever !!!!!A ware horror movie that focuses on being an actually good movie instead of just jump scares !!!!!"
    },
    {
      "rating": "9",
      "text": "Fun, bonkers horror flick courtesy of James Wan. This film will split audiences and critics with its audacity. Either you will say WT% or be hollering and cheering at its twist and turns. I found this to be an original film that cements Wan as a true master of horror, The John Carpenter for our generation.  All the tricks and trades that he learned, be it in the horror and the action genre are well used here. To say more would be a travesty, but this in my opinion is one of the best horror film of 2021."
    },
    {
      "rating": "5",
      "text": "Technically this is great, however it completely fails as a horror and is a schizophrenic comedy without any apparent structure.  It is not scary in the least, and it makes no sense.  It was like a child with ADHD was asked to tell a story while they were high on Halloween candy.  The downside is that the 'story' is incoherent, trying to be everything at all times with reason.  This leads to dialogue and motivation that the director could not handle, and the acting appear to be poor, yet if you have seen enough bad movies, you know these actors and actresses are doing the best with the material they have.  Some are comparing Malignant to Evil Dead series, but that is a superficial comparison as that classic series had an infinite amount of structure compared to this.The real shock is that this does have a lot of fun moments, and may be worth a watch if you are into these movies.  This does not change the fact that it is not a good movie.  A lot of reviewers fall into the trap of thinking that if they like it, it must be at least a 7. This is quite possibly one of those movies, where it is objectively not very good based on what it wanted to accomplish, but is entertaining in unintentional ways that elevate it.Just be prepared to have a bit of a headache, and the need to mutter WTF over and over, after the movie ends.  The twist is highly predicable, but due to the pathological need to do nothing in the standard method, you will never guess how it is carried out.  If there was any logic to this, then the cast could actually follow and give a more grounded performance (again this in on the director, not them).  So hopefully when this gets a sequel, it will try to be a bit more coherent while acknowledging it was an accidental comedy, and leaning into that.5/10 - Objectively7/10 - Subjectively (which may change once my brain heals and I give it a second watch)"
    },
    {
      "rating": "9",
      "text": "The movie is amazing.The movie starts off slow but it's going to grow and the third act is impressive, and the direction and photography are amazing."
    },
    {
      "rating": "8",
      "text": "First off I want to say that if you go into this expecting a horror movie you will probably be disappointed. This is a mystery/thriller with horror elements. Plot wise there are definitely some holes, but it's really enjoyable if you just hold back your expectations of it being a horror film and be curious to learn about what the movie is gonna show you. This movie does however have a lot going for it if you think of it as a mystery and go in open minded."
    },
    {
      "rating": "10",
      "text": "Best scary movie I have ever seen in my life. I love plot twist with scary face. WOuld recoomend you begin a watch.."
    },
    {
      "rating": "9",
      "text": "It's Deep Red meets Basket Case meets Insidious and it is glorious!It's not for everyone but it absolutely is for me."
    },
    {
      "rating": "10",
      "text": "Despite some negative reviews I was not only pleased with this film but thought it was an original masterpiece. Insidious is my favourite horror film of all time and James Wan further demonstrates his versatility here with this homage to Dario Argento and other 80s slashers. Although it's a slasher is has a somewhat supernatural element to it and certainly isn't predictable or formulaic. I love how Wan is brave enough to push the boundaries of convention and try something new. This is gonna be another love/hate movie I feel as it's so out there and bizarre. The camera work is incredible as per usual and is used creatively to add to that sense of terror. The music is top notch and trademark Wan, unsettling and discordant. Love it love it love it. Some of it is a little unbelievable and fantastical, but even there I think Wan is aware of this as at some points the film morphs into some kind of black comedy like Reanimator. James Wan you are the man! Sure the acting is bad at points and some of it just doesn't make sense, but I dare you not to enjoy it. All that stuff just adds to the intended B-movie feel"
    },
    {
      "rating": "8",
      "text": "When the true greats of the genre weren't releasing the likes of Halloween or A Nightmare on Elm Street, they were making lesser known and more ridiculous works of horror that have only ever really been picked up by hardcore enthusiasts. Despite being nowhere near as iconic or well-received as their best efforts, these films were still made with a great deal of creativity and often with same level of passion. I'm talking about titles such as Deadly Blessing or Ghosts of Mars.That seems to be the style of movie James Wan was going for here. It's evident that the Insidious director made this one just to have some fun and is clearly having an absolute blast with his crazy premise, wild camera angles, playful soundtrack (which occasionally calls to mind Saw), and ludicrous gory action. The results are one of the most insane things I've ever seen and it is AWESOME! Which you wouldn't guess right away due to what a slow start it gets off to.Malignant is actually kind of boring at first and had trouble maintaining my attention early on. Its characters, setup, and even worse the scares feel cliché and predictable. It doesn't take too long for things to get interesting with its mystery though, and when the reveals start coming it explodes into a delightfully unhinged rollercoaster of madness that left me gawking at the screen in disbelief and ecstasy.Wan's willingness to fully embrace the illogical and maybe even dumb nature of the material means this will never get the same level of respect as his two Conjuring entries. Yet, it will always have a place in the hearts of the real horror devotees, likely showing up on countless lists of underappreciated gems on websites like Bloody Disgusting in the future, and further cements his legacy as the Wes Craven/John Carpenter of this generation."
    },
    {
      "rating": "6",
      "text": "Thoroughly enjoyed this deeply flawed, but very entertaining movie. While technically a horror movie, it's definitely not very scary. It teeters on the silly in fact. I really doesn't know what it wants to be. But there's a hard to put my finger on energy in the story telling that kept me watching with a not small amount of pleasure. If only to yell out 'come on, that's ridiculous' more than once. Particularly all of the police who apparently all graduated from the star wars stormtroopers school of shooting."
    },
    {
      "rating": "4",
      "text": "Given the overlong, deadly serious nature of the story's slow-paced, dreadfully dull, cliche-ridden buildup, I soon found myself watching the clock, waiting for this one to end and wondering what additional tedium I'd be subjected to in the concluding sequence. Much to my surprise, however, the film actually gets better in its end run by turning into a gloriously campy romp that had me in stitches the rest of the way. In fact, that drastic change in tone made me wonder why director James Wan hadn't handled it as such all the way through from the beginning; it would have made for a much, much better film. However, the picture's initial attempt at being \"serious drama\" falls flat on its ass and only gets better when it decides to take itself far less seriously. In the interest of full disclosure, I should add that I'm not much of a horror movie fan, because I find it's an art form that's truly difficult to do well, with most contemporary offerings falling prey to material that's not especially scary or descending into gore fests aimed at seeing how high the body count can get. With some retooling, this one might have succeeded at doing something distinctly different and genuinely entertaining. But, as it stands now, this is destined to become a midnight show cult classic that's probably best watched blitzed out of one's mind."
    },
    {
      "rating": "4",
      "text": "Anything over a 5 rating is flat out someone selling the film. James Wan shows very little of his ability in this pretty boring horror film. The script is standard fare at best. We’ve seen similar so many times; often better executed. The scares are cheap and tired. It gets a 4 rating only because of some nice visuals and set pieces. And for those saying it’s a homage to 80’s horror, well just go back and watch one of those. You’re wasting your time with this one."
    },
    {
      "rating": "8",
      "text": "Es definitivamente una película de James Wan, de principio a fin, es bastante gráfica y es muy entretenida, el problema no es el ritmo ni los personajes, mucho menos la banda sonora, el problema es que hay un revoltijo de géneros cinematográficos que nunca terminan de cuajar, empieza con suspenso, luego terror sobrenatural, luego slasher con toques de giallo y finalmente acción desenfrenada con masacre incluida. Lo giros de trama funcionan solo por cumplir pero nada del otro mundo, en general es una buena película, quizás decepcione a muchos debido a la enorme ausencia de sustos de todo tipo y un final simplón e incipido."
    },
    {
      "rating": "5",
      "text": "Alright, alright, alright, alright. We're back with the early Halloween season spooks with Malignant. This film is being released in theaters and on HBO Max for 30 days. If you haven't heard of this film, or not a horror fan, the trailer is below. In Malignant, Madison becomes paralyzed by violence in her life and the shocking visions of gruesome murders. She is tormented by these events that turn out to be more than just visions. What's her connection and why should we watch? I'll get to that.As you can see from the trailer, Madison is going through it with these visions/malevolent entity (Gabriel) and so are the victims. That's actually a part of the movie that succeeds. It is not just that you feel stuck in the visions or that you feel a part of the scenes, but the film does a really good job of following Gabriel. In fact, they do so well at it that I started to root for Gabriel in these scenes. Now that I think about it, that might be a negative. Ah, well. Other than the physics of Gabriel's movements, my guy is possibly the most athletic villain of all time and he really brings the pain. The problem with Gabriel and the movie is unlike The Conjuring, we have no clue where his powers come from. It's literally the most random thing in the world, unexplained and just perplexing. I mean even in the final explanation of the the story I sat there and said, \"Why would they think this would work? This makes no sense.\" Nevertheless, we come to movies to suspend belief and that is what I had to do. That's a mixed bad and probably the only reason to watch this movie. Let's see the bad guy go wild and be confused why this is even possible while doing it.While saying that, I do appreciate the original perspective Malignant brings on malevolent entities in the horror world. What I don't appreciate is the lack of scares in this flick. The movie starts off in one realm and we just end somewhere completely different. I think we've gone in the paranormal, ghost, demon, monster bag a bit too much recently. This gives us slasher, with a semi-demon, and psychological thriller all mashed in one. I'm not mad at what they tried to do, but the execution of continuity is just non-existent. In writing this film, the addition of a scene or two ,or even a line or two, could've fixed the holes in the understanding of Gabriel. Nothing could've fixed the physics though. But, what that tells me is there's room to grow/expand upon in the series. I'm not certain there will be a second film, but I can see how something could break through again with James Wan leading it. The Conjuring series has been so popular that they might just give Malignant a follow-up. I'd ask for the whole cast to be changed excepted for the lady cop but that might be asking too much.Malignant is a strangely bad but pleasing early Halloween season movie. From all of the commercials and trailers, I feel a bit mislead by Malignant. Then, the title and title sequence gives away a lot more than you need to know. The story is executed in an original way which actually is quite pleasing but also quite ridiculous. Viewers have to give in to the absurdity and impractical physics of the human body for you to truly enjoy this flick. I think horror fans will be a bit disappointed in the scares in the movie but still entertained by the violence. They should grab a handful of popcorn to enjoy the spectacle. General viewers, who may just have HBO Max, this movie is only scary for about 10 minutes altogether, so if you can get past those parts, you might enjoy rolling your eyes at some bloody and ridiculous scenes and faces, under duress."
    },
    {
      "rating": "7",
      "text": "The film Malignant immediately caught my attention with its opening. There is quite a long period of incomprehension afterwards, but gradually various information starts to be revealed, which makes everything start to make more sense, until we actually get to see some of the revelations. I think it worked. Wan's style was on full display here. At one point I felt like I was watching The Conjuring. One minute I felt like I was watching Insidious and one minute I felt like I was watching Dead Silence. At one point I was even reminded of the Saw series. I just think Malignant is such a mix, and it fit me. I'd also like to highlight the music, which was really cool. For me, it's a good movie that I can recommend."
    }
  ],
  "recommendations": [
    "insidious",
    "annabelle",
    "insidious_chapter_2",
    "dark_skies",
    "chernobyl_diaries",
    "the_possession",
    "devil",
    "cabin_fever",
    "the_mist",
    "the_grudge_2",
    "countdown",
    "scream_4",
    "ouija",
    "hostel_part_ii",
    "final_destination",
    "dead_silence",
    "hereditary",
    "the_strangers_prey_at_night",
    "vacancy",
    "the_collection",
    "the_eye",
    "the_descent",
    "the_curse_of_la_llorona",
    "drag_me_to_hell",
    "house_of_1000_corpses"
  ]
}