{"id": 1582, "title": "Mama", "starring": ["Jessica Chastain", "Nikolaj Coster-Waldau"], "runtime": 100, "genre": ["Horror"], "description": "Guillermo del Toro presents Mama, a supernatural thriller that tells the haunting tale of two little girls who disappeared into the woods the day that their parents were killed. When they are rescued years later and begin a new life, they find that someone or something still wants to come tuck them in at night.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/btfia2Z048VIodvcyj31cNjTqyC.jpg", "categories": {"plot": 5.421052631578948, "acting": 5.181818181818182, "ending": 6.571428571428571, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 4.571428571428571, "funny": 2.25, "action": 4.0}, "reviews": [{"rating": "10", "text": "Mama has a really crazy story, having the so called \"entity\" feel much more realistic and physical-ish. The Mama entity is so chilling to see, loved every aspect, it's so interesting to see that the kids are so natural and relaxed around it. Couldn't ask for a better cast; I love Jessica Chastain, and  Nikolaj Coster-Waldau characters they have great chemistry. This cinematographer, Antonio Riestra... wow amazing at keeping me at the edge of my seat. Also props go to Michele Conroy for editing. And don't I want to forget the Director, Andrés Muschietti, for doing such an amazing job! Mama will forever remain in my Top Horror movies of All time!!"}, {"rating": "3", "text": "Mama is just a bad movie. The scenes that are intended to be scary are instead unintentionally scary, the characters suffer from being massively stupid, and the supernatural entities motives make no sense. Even worse, one of the little girls is truly grating. Jessica Chastain is ok and Andres Muschietti does a fine job creating tension and a scary atmosphere, but the film never goes far enough to elicit scares. The film puts you on edge, but then pulls the rug from under you and leaves you wishing it had actually followed through on something for once. Horror films that lack a pay off are typically okay in my book because the atmosphere is scary enough and the things that are intended to scare you, actually do. With Mama, however, the plot and story is so laughably bad, none of these things scare you. The characters are thinly written and past and fall apart with the story around them making no sense and just being a nonsensical compilation of \"best scenes in a horror movie\" type situations, except the scenes here are so obviously trying to be scary, they fail to do anything at all. Mama is a horror film made by someone who loves horror, but has no idea what makes them work."}, {"rating": "8", "text": "It was a good movie,starts slowly but bottom stage get the momentum,and ended nicely.Well written script and decent effects.End was better than i predicted."}, {"rating": "8", "text": "Let me first just get this out of the way, Mama isn't a scary movie. Despite its lack of any sort of fear it's still an enjoyable movie thanks to it's well written plot. It's filled with mystery and likable characters. As you learn more details about the plot, and what exactly \"Mama\" is, you begin to see a bitter-sweet side of the story. It's actually kind of a sad tale. Mama managed to keep watching, and most importantly interested, because I actually cared about the characters and their fates. I watched this movie in hopes of getting a good scare, and while the movie didn't deliver any frights whatsoever it still kept me entertained and I find that impressive. So I recommend Mama, not for frights, but for story."}, {"rating": "3", "text": "Started off slow, but I didn't mind it. The story slowly started to evolve. Along the way, there were a few scary moments. But 3/4 of the way, the movie fell apart. The movie became very cheesy and the suspence was gone."}, {"rating": "0", "text": "Guillermo del toro has made great films in the past but this time the presents logo has let him down. Mama is not a great film. It doesn't give you creepy jeepers from movies like Paranormal Activity, it's a crappy horror movie with bad CGI effects and jessica chainten was \"meh\". This film absolutely has no story, the0 is only for some of the creepy performances. 0/10. Nothing more."}, {"rating": "2", "text": "A complete garbage. I'm giving it a 2/10 because of the great acting from the kids. But overall the plot was just stupid and the cgi was amazingly bad."}, {"rating": "2", "text": "When my brother invited me to premiere I was very exciting because I've heard many good reviews about this film. Later, I left cinema, scared but not for \"Mama\" but bad movie was it. This film hasn't sense. Okay, a evil ghost thought that two little orphan girls are her daughters but film has struggles to explain the real reasons. Sorry, but \"Mama\" is not for me."}, {"rating": "1", "text": "it wasnt scary you could see the how computized mama is and none of the pops scared me or gave me the chills none of them. from the previews i thought this would be good so i watched it an it wasnt good you will laugh if your a true horror fan alright except your little sister who will be screaming her head off while your laughing and the computerized mama"}, {"rating": "3", "text": "Bad movie,very stupid,the mama character is very bad computerised,no story,they wonted to make an unexpected ending but they fail because thats was stupid too.The only good thing in the movie was Jessica Chainstains performance.I canot say this is worth watching at all. sorry for bad english if there is some not my mothern language."}, {"rating": "1", "text": "Yet another very dumb movie with juvenile Guillermo Del Toro's name on it.  Loaded with a lot of fantastical nonsense and very little else, this boring fairy tale is not worth anybody's time who is over the age of 12 with half a brain.  Good photography, sound design and visual effects never substitute for the harder task of good narrative drive and suspense.  It doesn't fool anybody, well maybe the younger generation because they don't know what they're missing in a good thriller or have the attention span to care."}, {"rating": "1", "text": "I'm cowardly and it's still didn't work for me, didn't really scare me. The lack of full story, likable characters and decent computer graphics destroyed the movie. 'Mama' is simply bad, not a real horror movie. 1/10 for the try."}, {"rating": "5", "text": "This was a disappointment - expected more from Del Toro, even if he wasn't directing.  The premise was interesting enough and riffing off financial collapse (now that is a horror movie) was a promising start.  But despite good acting and decent cinematography the film falls into cliches and is disjointed.  And can we all admit that CGI is not frightening?  It just pulled me right out of the film and any hope of feeling horror soon turned into annoyance. There were a number of jolting moments but generally these turned out to be cheap stunts to get a rise from the audience.  I'd recommend as a rental."}, {"rating": "0", "text": "This year's Woman in Black. They take a popular actor at the time (in this case Nikolaj Coster Waldau, known for playing Jaime Lannister from Game of Thrones) and put him in a poorly made movie about a vengeful spirit and hope it sells. Mama is simply a god awful movie with no suspense what so ever. A terrible generic story with cheap scares, that honestly don't scare at all. The fact that people actually like this trash proves how poor their taste are."}, {"rating": "2", "text": "If you like horror movies with non stop CGI, a storyline used over and over, unlikable characters, no real scares, and a ghost that looks like something out of a bad cartoon. Than this is for you. The theater was laughing non stop at the stupid that is Mama. Its as dumb as the title."}, {"rating": "6", "text": "It's a bit of a clunker. The movie is shot very well, creepy dark gloom and one especially cool flashback. The acting is for the most part serviceable if not solid. Jessica Chastain in particular does well with the material (better than the morose standing about and pouting we got to see from her in ZDT). The movie's story is standard stuff so dont expect anything big or game changing here. Though overall the movie is mediocre, the parts that are bad, are incredibly bad. One scene in particular stands out, In a dream world Luke (nicolai coster-waldau) speaks to a ghost who speaks in what could be one of the worst professional audio mixes in a decade.  Another part of the film is the scripts use of characters. Luke as a character is unnecessary, he really does nothing and the film would have been more effective without him, which in turn would have given you a shorter and tighter film. As well the script has plenty of inane, why did this, or that doesn't make any sense, moments.  Overall the film is alright, but I'd think twice about paying theater prices too see it."}, {"rating": "9", "text": "One of those very rare horror flicks tat never fail to impress u.A lot of genuine scary scenes.Even if ur one of those people who can sit through all of the scenes that cause a stir the storyline will never disappoint u.the story has been well written.The movie is calm and quiet throughout  the story moves at a decent pace...also not one of those dull movies or those set of horror movies that end on a depressing note..and yes, it also does a brilliant job at making u jump out of your seat when u have to unlike most other movies that try to force tat upon u and fail."}, {"rating": "3", "text": "Same old, same old. People making stupid decisions that normal people, even when they are at their dumbest, wouldn't possibly dare make.\r Would you go to a ghostly house when it's dark and take pictures of a ghost when you are absolutely sure that the ghost is real? I don't think so.\r Same old, same old. A ghost with absolute power, an ugly face, and long long long hair. Would that scare you? Umm, no, I don't think so. The last time that worked was on Samara, and it's overdone now.\r Don't watch it. It doesn't even include some nudity or hot spooning to keep you interested.\r How did it sell more than 100 million dollars? I don't know."}, {"rating": "3", "text": "We went to see this \"movie\", and I had high expectations....long story short: it sucked! I sooooo badly want to give specific reasons, but that would mean spoilers, because judging by the posts, there are people who believe this is \"gonna be good\". Trust me, the 3 minute short was far better. I am not a \"troll\", just another pissed off consumer! Let's put this way: we actually LAUGHED when it ended, and I never do that at a \"scary\" movie...\"Mama Mia\" was scarier. I would say \"save your money\", but different tastes will definitely help pay the producers bills, so go ahead, see for yourself. Hell! You might like it, but if you have any idea what a \"good\" horror movie is, you are gonna be REALLY disappointed because this film was not made for you."}, {"rating": "0", "text": "I went to the cinema manager and asked for my money back. Happily he did give us free passes to any other movie of our choosing. He did say, though,  that we weren't the only ones looking for refunds on this colossal pile of excrement. Even the visual effects were tired. Looks like every other supernatural film that has come out since the Ring. I wish I knew how to spell the sound of a human retching, that would explain my feelings on this movie."}, {"rating": "10", "text": "Mama is a horror film of 2013 directed by Andres Muschietti. The plot begins with Jeffrey who kills his wife and flees with her ​​daughters. During the escape Jeffrey upset, has a car accident and the three find themselves in a forest. Wandering find an abandoned cabin where Jeffrey decides to kill her children and then himself, but he can not aim because a strange creature kills him. This same creature will take care of two children for five years as it will be discovered by men hired by Lucas's brother Jeffrey. Annabele him and (his girlfriend) will take care of them but the mysterious creature will do anything to be with the girls. A horror film that manages to scare in places with excellent shots and great actors, the film succeeds in some places even to touch. Final and the storyline by no means trivial although I think some important parts of the film were cut (in fact we do not know what he later found in the woods Lucas after the ghost of his brother told him to go there)."}, {"rating": "5", "text": "Pretty decent film. But nothing special."}, {"rating": "10", "text": "This is definitely the best horror movie I have seen in 2013. The quality of the movie is outsanding and the story is amazing. I could watching over and over again."}, {"rating": "3", "text": "The story line is great. However, the digital effects of the movie were not up to expectations. For a preteen, I would suggest this as a great hand-holder. As for adult thrill seekers, don't waste your time. The scenes drug on and on. The best part of the film is the ending, but it's not worth the wait.  However, the acting done by the two little girls in the film is far from what's expected. They even \"out act\" all the adults in the film, by far.  The movie would have been better if it wasn't for the bad producing and directing.  Again, wouldn't waste my time."}, {"rating": "2", "text": "\"Hey, I love you, girl,\" Lucas, a hirsute graphic artist tells his boho flatmate, Annabel, the bass guitarist in a three-piece indie-rock band, on the precipice of her incipient entree into womanhood. She's going to be a mother, or rather, a surrogate matriarchal figure, better known as the stepmom. Lucas' two nieces, Victoria and Lilly, missing for years and presumed dead, are found, miraculously, alive in a woodland cabin, and seemingly without parental supervision. On that fateful day in the band's rehearsal space, when Lucas breaks the news to Annabel of the girls' improbable recovery, the goth girl doesn't look none too pleased. Suddenly, her cool beau comes with baggage. Annabel, while talking it over with the lead singer, decides on a reactionary life-choice that betrays her persona, so soon after thanking god in the loo for the close call on a home pregnancy test. The femme singer, quite pointedly, calls Annabel \"dude\", as in, \"You didn't sign up for this, dude,\" a sisterly endearment loaded with trenchant points in that the masculine appelation evokes a testament to such feminist ideals, chiefly, the outright rejection of traditional female roles. On her own volition, Annabel follows Lucas to suburbia, taking up residence in a two storey Virginia colonial, as part of an agreement with a behavioral scientist that accedes complete access to the girls for an empirical study on feral children. Like the wild child from Francois Truffaut's L'enfant sauvage, the girls walk on all fours and undergo an enculturation period. Alone in her vanilla trappings, Annabel, the exiled hipster, rocks the colonial. Quite a sacrifice for a \"girl\" whose desert island, all-time, top five musical artists would definitely include Kim Deal. Unlike Laura, Rob's long-suffering girlfriend in High Fidelity, whose slumming is protracted by her love for a arrested owner of a record shop, a sad diletantic man-child who wouldn't allow the paralegal to grow. Annabel's transition into adulthood, however, is abrupt, and especially curious, since she's the same person: same close-cropped hair, same raccoon-style eye makeup, differing from Laura, who tells Rob, \"I couldn't go to work with my hair dyed pink.\" And yet she gives it all up. And not for something good like a career. The woman in flux chooses to be a homemaker with a surprising minimum of fuss. At the film's core, Mama beats a sexist heart, because the filmmaker suggests that all women, down deep inside, want to be mothers. Laura, too, despite being career-minded, was once an expecting mother-to-be, but fails to carry her child to full-term, since, as she tells it, due to Rob's one-night stand. But let's not forget the record shop owner's rebuttal to his transgressive behavior, in one of many instances where he breaks the fourth wall. On the bus, Rob humbly admits that Laura is the smart one; he realizes how Laura played him, convincing the in-film narrator that seeing other people was his idea, when, in actuality, she had already started anew with another man: the dreaded Ian. Laura not only outsmarts Rob; she outsmarts the audience. Laura, a former party girl, who first meets Rob in the midst of his deejay gig at a club, also worked as a legal aid during the day. Rob's infidelity came at the right time; it provided her with a convenient excuse to terminate the pregnancy. The film seems unaware that she chose to ascend through the ranks of her profession, rather than sit at home with a baby. It's a gambit that pays off, as indicated by Rob, when he muses aloud about the incongruity between her handsome salary and the \"dump\" she once resided in. The maternal instinct is neither engendered in Laura nor Annabel, but whereas High Fidelity allows for upward mobility as a transition into so-called respectability: a good job and a better man, signifiers both of personal growth, Mama has a fifties mentality, in which Annabel gives up the life she invented in order to rear children, as proof and verification of her finishing. She trades her bass for a laundry basket. Akin to Sylvie, the stepmother figure in Housekeeping, the aunt who inherits two girls that accept their new guardian in varying degrees(Ruth, the protege; Lucy, the rebel), just like how Victoria likes Annabel better than Lilly. Equipped with glasses, she sees that \"mama\" is just a stay-at-home mother. Today, women who reject the traditional role of wife and mother have someplace to go, but this being the 1950s, Sylvie just got lost, returning home from her vagabond's itinerary of constant walking after her nieces' orphaning. While window shopping, she cringes at the vacuum cleaner display. Her sister, the one who chose to vacuum, ended up driving her car over a cliff. Hopefully, Lucy will have better luck. Mama, too, plunges in the water, taking Lilly with her. Victoria survives; she wants to be like Annabel: independent, but the film won't let her out of the house."}, {"rating": "5", "text": "Not bad horror containing plenty of jumps, probably more laughter at what was just so ugly. This story line has been done so many times the concept is nothing uniquely new. What this film had is one of the best \"crackhead\" (pun) monsters on film, visually nasty. Riminiscent of The Ring, The Grudge, The Excorist and other good horrors. Disappointment into what was turned out to be such a lame ending, this equated to, a bird in the hand is worth more then two on the branch. While playing that boohoo melody with its white lights and moths/butterflies CGI. The biggest flaw I had with this film was the doctor doing his own investigation right after running away. Not much expectation from a dumb slang title.\r Middle road scores for having such a nasty Mama"}, {"rating": "7", "text": "Actually, I don't like movies under \"Horror\" category. But Mama is different, it tries hard to avoid the cliches and succeeds in that. Also the movie has a good story to tell, unlike most horrors, which includes the theme of motherhood love. I recommend this movie to every horror lover, the score would be about 9 if I liked horror category in general."}, {"rating": "6", "text": "For 5 years, 2 little girls are raised in the woods by a ghostly specter. When they're returned to civilization, they move in with their uncle (Nikolaj Coster Waldau) and his girlfriend (Jessica Chastain). Of course, their \"mama\" comes with them. This is a relatively well-told ghost story with a creepy atmosphere, some nice surprises and a few good scares. Since there's only one evil presence, the intrigue is limited. To make things worse, it completely falls apart by the time we get to the laboriously overdone ending. Fans of the genre might enjoy much of it, but it's not special in any way. (And what happened to the dog?)"}, {"rating": "7", "text": "Great scary movie.  I thought the story and the cinematography were great for a scary movie.  It has been a long time since I can say that for a scary movie, probably since \"Strangers.\"  My only cons was the fact I laughed everytime they said 'Mama' and the ending did not make alot of sense.  Also, Jessica Chastain was a smoking hot as a goth rockband chick."}, {"rating": "7", "text": "To start off, let me say that I am a big fan of Guillermo Del Toro's movies. I love his vision and the diversity of his characters and situations he creates in his stories. that said, Mama was somewhat of a disappointment. The movie was great with it's scares and chills(mama is definitely creepy), but the ending should have been so much better thought out and executed. I believe a better ending would have given this movie a stronger lasting power with fans of horror. Still its worth a look."}, {"rating": "4", "text": "No, No, and No! This movie was way overpriced, way too slow getting started, and even more under developed than I had expected after watching what seemed to be enticing previews for it. I don't understand why directors wish to push half developed movies; oh wait, Yes I DO! It's for the stupid teenagers who theatre hop and giggle all through the movie, like the ones that sat near me tonight in the theatre. They made an very mediocre movie even worse since I had to half listen to them and half focus on the movie as I continued to ask questions like why did it start with the delusional father killing the wife?, and what possessed him to take the girls to the wood?, and why the ghost was called mad and in a 19th century asylum? Very unsatisfying movie. I wish I would've waited to rent it once it on bluray instead of the paying $9.50 to watch it in a loud theatre."}, {"rating": "7", "text": "'Mama' is a great horror movie, but the movie is not all terror, too much drama."}, {"rating": "8", "text": "I thought this movie was great. Definitely a fresh twist on the Horror genre. Movies like this are best experienced in a packed theater with everyone around you clutching their armrests."}, {"rating": "7", "text": "Storyline: Jessica Chastain and Nikolaj Coaster-Waldau (Game of Thrones) star in this stylish, scary horror flik which is about two abandoned kids, living in a shack in the wilderness after their father crashes his car. Wait a minute, Hansel and Gretel anyone? Nah, this is way better.\r Acting: After seeing Jessica Chastain in 'The Help' and 'Zero Dark Thirty' it's nice to see her try something very different as she plays a rock chick with tattoo's. She pulled it off easily and very convincingly. She's doing something right because that's 3 great movies in as many years. Nikolaj Coaster-Waldau who is better known in his native Denmark first came to my attention in the excellent 'Headhunters' done a decent enough job but two seasons of 'Game of Thrones' has made it hard to picture him as anyone other than Jaime Lannister, know what I mean? Maybe it's just me. The two little girls were pretty good as well.\r Direction: I had never heard of Andrés Muschietti until this and on checking I see Mama is a remake of a short he made in 2008 but this is his first feature. What a debut. I know it's a lowly horror but English isn't even his first language so I think he's done an excellent job.\r Production: While $15 million is no small sum it still makes this a fairly low budget movie. The film has a great feel and look about it thanks to the sets and the make-up and special effects while there aren't lots of them they are extremely good. A well put together film.\r Conclusion: This is way better than your average horror with great scares. Scary little girl horrors are great and there are 2 in this, even better. Highly Recommended.\r Score: 7.5/10"}, {"rating": "7", "text": "This was definitely one of the better horror movies to come out in recent memory.  Being a father of two young daughters (coincidentally the same age apart as the two in the film) the movie certainly had a way of pulling at the heart-strings in developing many lovable characters.  As a parent, the story comes off as an almost unbearably sad in parts.  This, however, also creates one of the key downsides of the film as well, at least when seeing it with a full auditorium.  The PG-13 rating, as is the studio's want, creates larger audiences, but it also invites younger audiences as well.  Seeing a movie like this with today's teenagers, who do not have children of their own (and by the way they acted, hopefully never do...) and thus can't relate to more than half of the raw emotions that are depicted in this movie, becomes a very frustrating scenario.  It was clear that the younger daughter, Lilly, was seen by these teenagers as frightening and terrible, where all my wife and I could see was a frightened and terrified, helpless little girl.\r All and all, the movie was fun (though deeply depressing) to watch.  It was so artfully shot, well-lit, and well-acted, that you find yourself willing to forgive some of the not-so-stellar writing (i.e. - anything near the beginning pertaining to Jessica Chastain's character being in a rock band)."}, {"rating": "7", "text": "I came in to the movies to watch mama with very low expectations however I was surpised that the movie was as good as it was the best part of the movie are the two lil girls they are creppy from start to finish and they really make this movie diferent from other paranormal centric movies I recomend this movie but only wile its in theaters so you can enjoy how creppy this movie is"}, {"rating": "7", "text": "Mama is the perfect suspenseful and dark horror movie to start off 2013, and also proves to be a good first directing effort from Andres Muschietti.  This film is able to achieve what so many horror films fail to do, and that is to scare us.  The last scary horror film in theaters was \"Sinister\" and it showed that there is still hope for the horror genre, and Mama showed once again that I am right.  The film does make some mistakes and has a lot of horror film clichés that keep it from being great, but I still urge you to check out this film and experience a very creepy film.  Jessica Chastain has already established herself as one of the top actresses in Hollywood currently, and she perfectly fits this performance and has us really follow her to the end.  What is so interesting and unique about a film like this is that I rarely have had a PG-13 horror film scare me, mainly because most horror films are rated R because they want to push the limits of horror.  But Mama was able to provide good scares while also being able to be suitable for most people.  Most people will have a mixed reaction when they see this film, some may like the film, some may hate it, and some might like it but think the ending killed the tension.  I felt like when we finally see the ghost of Mama it destroyed a lot of the mystery and fear, but it still was a satisfying conclusion to a good film.  There is a lot of CGI used in this film and most of it is used very smart, but there are times where they can go a little overboard with the special effects.  It takes a while to adjust to this film, but soon you get used to it and find that it"}, {"rating": "5", "text": "es una película de suspenso pero lo deja a uno pensando en el amor de las madres y ademas es un deleite visual tambien krx,wls,tredmyhx4t5yhyi54ljnhflhjnt"}, {"rating": "10", "text": "i think mama was a very scary movie it scared the  out of my cousin this is a movie i would love to watch again and it show all the stuggles a mama has to go to to see the girls she raised ps why dose lily die why"}, {"rating": "8", "text": "Incredibly freaky and sad movie. It scared the heck out of me and out the same time the ending made me really sad. It's special effects looked wildly real and wildly freaky. Del Toro is a great director and a master of horror and drama."}, {"rating": "5", "text": "This was an OK film until the end. Towards the end of the film, they try to recreate the classic horror film scene in Psycho where the chair is turned around to reveal a dead person. In Mama, they tried to recreate this classic scene from horror film history by having the Aunt be standing there twitching, as the girls walk up to her from behind. When they get close to her, she turns round to reveal her face. This would have been a bad scene due to the fact it is blatantly a ripoff of the scene from Psycho; however, they made a bad scene worse by having the worst laughably bad CGI/Mask in the world. It's less scary than in Psycho, and that was 1960 and Mama was in 2013. If that isn't bad enough, they tried to use this trick TWICE! Most of the film is decently written and the children are surprisingly good actresses for their age, but the ending is as bad as those \"lik if yoo cri errytim\" comments on YouTube."}, {"rating": "0", "text": "Boring to the point of where you most likely be looking at your phone or falling asleep your better off avoiding any of these kind of that have good to great reviews but mama falls to scare anybody films like this are just a excuse to try to Brianwash the audience into thinking they're seeing the greatest thing ever"}, {"rating": "5", "text": "\"Although Mama is on the more \"compulsively scary\" side of things. It lacks the effort that make films like \"Insidious\" scary. Its bland and hardly effective, also suffering from a frigid conclusion, Mama was still not as terrible as it should have been\"  C+"}, {"rating": "5", "text": "This movie was too typical, it wasn't bad nor good....though it was very boring...i hope they don't make a part 2 of it like the ring 2, where they show how the so called ''mama'' origins will be showed..i hate predictable movies like this...so don't bother to watch this movie in theatres, waste of money it would be :o ...all i have to say is don't  make predictable,boring,stereotypical movies..sinister is a good horror movie out so far..."}, {"rating": "7", "text": "Pretty good horror flick, starting with a typical cheesy premise, but ending quite strongly.  Chastain as usual is great, and Mama ends up being an interesting 'monster' character, typical with any of Del Toro's produced films."}, {"rating": "6", "text": "Just saw this yesterday and  I'm a little conflicted.......let's starts with ﻿the good:﻿the opening scene was interesting enough but I don't know if I missed a key part that explains why ﻿the father started killing people then his ex-wife(child support maybe?)then decides to kill his two daughters...then himself...I wanted to know what drove him to this point but like I said...there were no explanation for his actions...even his brother never says why(maybe he was just as clueless as I was)﻿the scenes were well done for the most part and the acting was believable and the locations(mainly the spooky looking house in the woods) were great! The character development of the female lead was good...she go's from i don't want kids to really putting her life on the line(like any loving mother)for the two girls, speaking of the girls, the youngest is a complete nutcase! The bad: A lot of the story just felt weak and/or rushed! They also should have explained the history of the spirit haunting the two girls more thoroughly instead of just tacking on the whole....she was insane story....she should have had more dept to her character....this horror movie actually had a good story but just fell short which is disappointing because it had good material to work with. Also, when the guy was pushed down the stairs...he clearly saw the monster but whats the first thing he did when he got out the hospital? He went to the woods and got lost....? The therapist was smart enough to figure out what the ghost wanted but was to stupid to bring what he needed to stop the ghost  got and himself killed? There's also an identity crisis with mama because the director(or writer) didnt know who was actually the leading star. I thought it was the uncle/boyfriend but he gets sidelined early in the movie  and the woman pretty much finish's what he started! In the end its a pretty scary movie with a good(if not disappointing) story. Its not perfect but it was good enough that anyone can enjoy it even if its just a rental so i give it a 6/10"}, {"rating": "6", "text": "I have been eschewing horror films for quite a long time, not my cup of tea to be constantly under the fusillade of twisted images of supernormal creatures and the menacing sound effects antedated by portentous background scores, while trying to squeeze any sort of excitement and satisfaction from it (or just a natural aging process). But MAMA, outsmarts a myriad of its sort by casting Jessica Chastain as its sadistic prey, so when I got the BluRay disc, it is not easy to say no to it, not when Chastain wears a Gothic makeup.\r THE ORPHANAGE (2007, 8/10), which also has a Spanish pedigree, has left an indelible impression on my memory and its credo of a mother’s salvation can be easily transplanted into MAMA, only this time the mother is a gawky ghost, thus, Chastain’s character, initially a childless bass player in a rock band, has to undergone the transference of her own mother nature to fight for the girls, it is a tug-of-war of two mothers (Coster-Waldau’s proxy-father figure as one can anticipate, would have to sidestep aside to leave enough space for the maternal battle, he would be in the hospital since the half-way through and never returns home to aid his girlfriend even when he recovers and completely senses the spooky thing is happening with the two girls, instead, he would go directly to the haunted cabana, at least give your girlfriend a head’s up, man!). It is sufficient to say there are nothing too ground-breaking MAMA brings to its mother genre, the scares and twists are both predictable and fully-informed ahead, and a certain amount of casualty among supporting players is indispensable (and overused).\r What’s quite impressive is the ingenious shooting prowess from Muschietti and DP Antonio Riestra, for example, during Coster-Waldau’s hospital stint, a semi-long shot at their home, in a fixed gaze, implies Mama’s existence in the house by disinterestedly concocting all 3 extant characters in one frame while a fourth one is off-camera and does the interaction. Another one comes within the spine-tingling motion, a tracking close-up focus on the elder girl until she is locked outside the door when Mama is trailing both girls. Also the sepia and over-saturated flash-back takes are smartly interpolated, and the shots from a camera in the darkness is not a new invention but pay their dues by the in-the-blink-of-an-eye fright (poor doctor!).\r Chastain shoulders on a very understated development from a punk bassist to a surrogate mother, Muschietti has a good sense of reining the holistic haunting aura instead let it slip into a drama competition (although if one has Chastain, he should not squander the opportunity).  Megan Charpentier, plays the elder sister of the two, whose transition is the most telling proof of a mother’s love, the ending is redolent of THE FORGOTTEN (2004, 5/10), and the motherly clasp always win!\r MAMA, expanded from Muschietti’s own short film, is a qualified scare-fest, but one advise should be alarmed to all the makers, whatever gristly creature you are contriving, if it appears continuously on screen for more than 5 minutes, the terror efficacy will be dampened no matter how unsightly it is, so play your trumps parsimoniously is a wiser option if your intention is to scare audiences out of their wits."}, {"rating": "6", "text": "Terrifying all around. Well-thought of and beautifully executed. Jessica Chastain proves she will never fall into typecasting as she boldly takes on this role."}, {"rating": "7", "text": "A rare horror movie that doesn't combine stupidly with a ridiculous story. Mama carried enough thrills and scares to make up for the sometimes sleepy scenes."}, {"rating": "7", "text": "A horror movie that is actually not tasteless, disgusting, or pure crap. Well acted and filmed. It is scary without being ridiculous. It was gripping, but it got a little cheesy at the end."}], "recommendations": ["the_curse_of_la_llorona", "case_39", "the_possession", "the_woman_in_black_2_angel_of_death", "brightburn", "the_haunting_in_connecticut", "annabelle_creation", "ouija_origin_of_evil", "the_forest", "dead_silence", "dark_skies", "the_boy", "house_at_the_end_of_the_street", "would_you_rather", "the_woman_in_black", "the_eye", "chernobyl_diaries", "wish_upon", "unfriended", "devil", "you_should_have_left", "slender_man", "darkness_falls", "happy_death_day", "vacancy"]}