{
  "id": 894,
  "title": "Mamma Mia!",
  "starring": [
    "Meryl Streep",
    "Amanda Seyfried"
  ],
  "runtime": 108,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "An independent, single mother who owns a small hotel on a Greek island is about to marry off the spirited young daughter she's raised alone. But, the daughter has secretly invited three of her mother's ex-lovers in the hopes of finding her biological father.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mQy3BuOdf3OSORWOKTodqfRayJM.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 5.25,
    "ending": 9.5,
    "soundtrack": 6.166666666666667,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.666666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Complete crap! Bubble gum that went stale a long, long time ago."
    },
    {
      "rating": "1",
      "text": "All my friends and their girlfriends and wives went and saw Dark Knight. I got dragged into seeing this with my girlfriend a few hours ago as punishment for me taking her to go see Iron Man when it first came out. Suffice to say she didnt want to see Iron Man so guess what I caught a glimpse of what hell and torture is. Basically there were only 20 people in the theater for Mama Mia and out of that 20 I'd say that 99% of them were cat loving frizzy haired old ladies. Oh and seeing Pierce \"I used to be James Bond\" singing some crappy songs with some old women who are my mom's age was enough to make me cringe. Eh at least one or two of the songs was good so I give it a 1."
    },
    {
      "rating": "2",
      "text": "I thought it was awful. Granted I was never an Abba fan and living in NY never saw the show but.... I have heard Meryl Streep sing better and definitely act better. And someone should shoot the casting directors for putting Pierce Brosnan in. The only talent was Sophie. Julie Waters was not used to her best ability. I couldn't figure out what the audience was laughing at. A few amusing moments but basically REFUND!"
    },
    {
      "rating": "5",
      "text": "I'm going to give it a five. I personally didnt like it very much, but my mother did, so I suppose this film is only good for the girls."
    },
    {
      "rating": "3",
      "text": "I must say I expected more from Meryl Streep. The other actors lived up to no expectations whatsoever. A fun plot, wonderful music, a terrible movie. The live musical was much more amusing, and the singing, dancing, and acting was actually commendable; I very much encourage anyone who is considering seeing the movie to rethink and save up for tickets to see it performed in the way it was originally intended."
    },
    {
      "rating": "2",
      "text": "There were some great actors in this movie, but everything else was the mot bizarre piece of film work I had ever seen. It certainly seemed like everybody in the movie was having fun, but I wanted to find the nearest match so I could set the T.V. on fire. Weird as hell."
    },
    {
      "rating": "4",
      "text": "What I sure know is that they have the crappiest script of the year..."
    },
    {
      "rating": "10",
      "text": "Amazing!! Mamma Mia is the first genuinely funny and most lavishing musical I've seen yet. Mamma Mia stars Amanda Seyfried as Sophie a girl on the verge of getting married in two days, there's just one catch. She wants her father to give her away except she doesn't know who her father is, know it's a musical mystery to which of the three men she invited to the villa is her father, could it be Sam Carmichael the architect, Bill the free spirit, or Harry the quiet business man. Which one could it be? That's an answer for you to find out in this amazingly beautiful musical that boast some of the best ABBA song around and some other great music too. Mamma Mai is a treat for the whole family, it's one of those movies you can enjoy watching again and again.I very highly recommended this great film."
    },
    {
      "rating": "4",
      "text": "Thought the stage play was great, think the film is terrible. IMO the type of play did not translate well. If you want to see a funny, entertaining and great feel good musical on the screen, take a turn to Hairspray."
    },
    {
      "rating": "7",
      "text": "Fun, it was fun! there is no much more to say. A nice comedy with great, old music! and of course there were Meryl Streep and Pierce Brosnan! Yeah, as someone else said here, critics should relax I never  trust them anyway... So yeah, a movie to enjoy, and sing along...!"
    },
    {
      "rating": "9",
      "text": "What a blast! This movie was an all out enjoyable, music filled, cake and ice cream party! The theater was packed and we had to sit in the 2nd row. I figured headache in the first 10 minutes, but no. It was easily the most fun movie we have seen in a long time. I think it is telling when the whole (packed) theater is hooting and hollering, clapping and singing during the movie. Gimme a movie where everyone cheers in the end anytime. If you want to go see a movie just for the all out fun, this is the one. There was nothing pretentious or preachy, unlike Wall-E. I went with my 16 year old, 14 year old and 10 year old. My 16 year old even said that it was her ALL TIME favorite movie. We aren't looking for the next Oscar winner, just for a fun time out with friends or family."
    },
    {
      "rating": "9",
      "text": "A great movie, uplifting and fun."
    },
    {
      "rating": "8",
      "text": "Fun, Fun, Fun. I left loving ABBA all over again. However, I do question the casting of Pierce Brosnan??"
    },
    {
      "rating": "10",
      "text": "I haven't seen the musical nor am I an ABBA fan but I watched this movie twice! Once on my own thinking it was a lighthearted comedy - can you imagine a 30 year old single man sitting by himself in a theatre filled with women and families! The second time with a female friend, because Dark Knight was sold out. But my companion was in hysterics and laughed so hard we got the occasional looks from the crowd. I loved the movie both times. It was kitsch but as a filmmaker myself I have to admit the movie was well crafted and well acted. Not many people understand the complexities of making a film and this is a hit all round judging from the crowd as well."
    },
    {
      "rating": "7",
      "text": "I enjoyed the fun pace of this movie, but the lip synching was sometimes off. The dance scenes were fabulous, especially the women on the dock - loved that part!"
    },
    {
      "rating": "0",
      "text": "This is the WORST movie musical I've ever seen ... and I remember \"Can't Stop The Music\"! The writing is so wretched it sounds like it was written by a 12 year old girl and although I like ABBA's music as pop songs they do not work in a book musical. Everything is wrong with this movie but the blame is on Lloyd. Totally misdirected!"
    },
    {
      "rating": "8",
      "text": "Not perfect but who cares, light lots fun."
    },
    {
      "rating": "7",
      "text": "As one of the few guys in the theater on \"date night\" with my wife of 27 years, I have to admit I really enjoyed Mama Mia. Perhaps because I grew up with ABBA in the 70's my toes already were in sync with the music. It is a rare fill that can make you laugh (Baranski and Streep sight gags) and cry (mother & daughter tender time painting toenails). If you weren't smiling during the dock dancing numbers, you were asleep!"
    },
    {
      "rating": "2",
      "text": "Boy, I don't understand how this could be considered good in any way. I never liked ABBA, but don't think that's the issue. Other people in the theater loved it, but neither my husband or I came out liking it."
    },
    {
      "rating": "10",
      "text": "I am an ABBA fan, also only 17, but that didn't make a difference o fmy age; Mama Mia was an entertaining and so amusing show. The audience couldn't get enough of it, they wanted more. =) It was great!"
    },
    {
      "rating": "6",
      "text": "The Broadway musical was much better -- very clever & creative story. The \"Parent\" group was too old -- should have been folks in their 40's not pushing 60 like Streep, Brosnan & crew. Otherwise, pretty fun & entertaining."
    },
    {
      "rating": "10",
      "text": "I loved everything about this movie, well there is one actor that can not sing. BUT you must see this movie."
    },
    {
      "rating": "10",
      "text": "Mamma MIa! was great fun, I could have turned right around and bought another ticket immediately. Brosnan has a lovely light tenor, and sings in tune and at tempo, so I've no idea why some folks are complaining about his voice. Want a laugh? Check out Sean Connery singing at the end of Disney's _Darby O'Gill and the Little People_."
    },
    {
      "rating": "10",
      "text": "I loved this movie so much I had to see it twice (and I'm the type that doesn't have time for movies). At the risk of sounding sexist, I'll say that this is a great movie for women. I doubt know if many men will love it, but every woman should see it with a girlfriend or a daughter, or a mother. It is so joyful, so funny and so TRUE to life in a hysterical cheesy 'Greek\" kind of way. It captures the spirit of mothers and friends and love."
    },
    {
      "rating": "9",
      "text": "I agree with the user who labeled this as a camp classic. Not critic material maybe but a wonderful antidepressant on film."
    },
    {
      "rating": "6",
      "text": "It's a movie that FORCES you to be happy.I don't like that."
    },
    {
      "rating": "6",
      "text": "Although 'Mamma Mia' certainly has more believable characters and can make you tap your feet now and then, only SOME of the voices are passable and the amount of time separating each song is ridiculous."
    },
    {
      "rating": "0",
      "text": "This movie was a serious dissapointment. The 2 old bats next to Meryl Streep were hidiously horrible."
    },
    {
      "rating": "9",
      "text": "Great fun. If you like Abba, you'll love this movie. Certainly cheesy, and seeing Pierce Brosnan singing doesn't feel right, but you'll have a real laugh!"
    },
    {
      "rating": "9",
      "text": "Great Movie. Probably the best all year so far. Loved the songs. Meryl Streep was awesome."
    },
    {
      "rating": "10",
      "text": "Who knew Meryl could sing too? Simply wonderful."
    },
    {
      "rating": "8",
      "text": "Great chick flick, laughed through the whole thing...actors were great & it was fun to watch them have so much fun."
    },
    {
      "rating": "9",
      "text": "The most enjoyable 2 hours you'll have at the movies all summer - provided you love Abba songs! Sooo frothy, sooo camp, and soooo much fun!"
    },
    {
      "rating": "9",
      "text": "This is one of those \"guys don't get it\" kind of movies. Because so many of our movie reviewers are guys, this is a problem. They seem to complain about song and dance numbers. This is a MUSICAL, guys, not Thomas Hardy. Last year, those (mostly) male critics gushed over dark movies about bloody conflicts that nobody wanted to see. Or, you get Momma Mia, a movie that has no blood, no guns and no Iraq. Thank God. If you like movies that are pure escapist froth, this is a good one. Pierce can't sing; who cares."
    },
    {
      "rating": "5",
      "text": "Well, as a veteran of 3 live performances of Mamma Mia including one on Broadway....I thought Meryl Streep's and Pierce Brosnan's singing was really pretty awful. And Christine Baransky's performance was sooooo bland and boring. I was disappointed."
    },
    {
      "rating": "9",
      "text": "I love the broadway musical and the movie didn't let me down. All the gals are great and that's what ABBA was all about. Streep is sensational. Pierce Brosnan can't sing a note but his all-male rough voice presence was indispensible opposite Streep. A bit slow at first compared to Broadway (too many pictures of Greece) but it picks up the pace and the last hour is a feel good riot. We'll buy the DVD no doubt!!!"
    },
    {
      "rating": "10",
      "text": "Excellent, outstanding 52 is not a true score."
    },
    {
      "rating": "10",
      "text": "A good movie with great songs. Love ABBA and most of the cast does a great job with their songs. I'd go see it again!"
    },
    {
      "rating": "8",
      "text": "I really enjoy music from ABBA, so I went to see this film. This is one of the most fun movies I've seen in years. Meryl Streep delivers so much energy through the screen, and makes the movie better than it otherwise would be. In the middle there were scenes that can cause anxiety, and it can drag a bit in other scenes. That is until Meryl."
    },
    {
      "rating": "8",
      "text": "The film is an unexpected delight. Streep is funny, touching and energetic.,she can do anything. What a marvel! She and Brosnan create a believable love yearning to reconnect after twenty years of longing. Skarsgard is rougish & Firth is sweet . Baranski & Walters are buoyant and hilarious. The young couple, Siegfried & Cooper, are beautiful and charming. I went to see Streep and Brosnan, expecting to hate the ABBA songs, and was drawn in to how expertly the lyrics advanced the plot and the joy they spread to the characters and the moviegoers."
    },
    {
      "rating": "10",
      "text": "Superb musical entertainment, brilliantly conceived that left everyone dancing in the aisles. Now that is what I call a 10!"
    },
    {
      "rating": "10",
      "text": "Thoroughly enjoying. Superb cast and of course the music."
    },
    {
      "rating": "10",
      "text": "Loved the movie, it was fun and an escapist two hours. Noticed that people were laughing, clapping and singing along. One of those times that I have to say the critics are way too full of themselves. Also I suspect that that the movie is victim to harsh reviews because it is essentially \"Chick flix\" material. Amazing how the worst super hero crap gets good reviews but something classed as Chick gets consistently panned."
    },
    {
      "rating": "8",
      "text": "Great movie, but you gotta be an ABBA fan. So not everyone is a trained musician...that just made it more endearing. LOVED Julie Walters. The whole experience just made me feel happy, and who can't use a little lift now and then?"
    },
    {
      "rating": "5",
      "text": "Just so-so. Not as good as Chicago or Rent. The story has an ackward flow, and the music and dance seemed to add little. Maybe 2 good music numbers , the others felt like filler to me. Meryl Streep is fearless and I give her credit for another fine job."
    },
    {
      "rating": "10",
      "text": "Best movie in a long time real fun first time in years the audience clapped after the show."
    },
    {
      "rating": "10",
      "text": "If you want to come out feeling better than when you went in, go see this!!! Truly uplifting!!!"
    },
    {
      "rating": "9",
      "text": "I thought Meryl Streep's singing was great and I was pleasantly suprised. Pierce Brosnan, however, was a little difficilt to listen to. At least he tried. I had never seen the stage show, but the movie was great fun!"
    },
    {
      "rating": "10",
      "text": "It's fun and gay. What can I say? I love it. Colin Firth at 47 turning 48 soon was absolutely adorable. It's Meryl. It's Greece. It's Abba!"
    },
    {
      "rating": "10",
      "text": "Oh come on people, its just pure fun, don't take it so serious! Meryl is great as always and though the songs don't always shift comfortably to the scenes, thats part of the fun! LONG LIVE ABBA!"
    }
  ],
  "recommendations": [
    "hairspray",
    "grease",
    "burlesque",
    "a_week_away",
    "mamma_mia_here_we_go_again",
    "cats",
    "hannah_montana_the_movie",
    "sing_2",
    "the_muppets",
    "sing_street",
    "the_greatest_showman",
    "almost_famous",
    "high_school_musical_3_senior_year",
    "pitch_perfect",
    "just_go_with_it",
    "mary_poppins",
    "17_again",
    "we_bought_a_zoo",
    "annie",
    "the_family_man",
    "into_the_woods",
    "step_up",
    "music_and_lyrics",
    "sweeney_todd_the_demon_barber_of_fleet_street",
    "last_vegas"
  ]
}