{
  "id": 3754,
  "title": "Mamma Mia! Here We Go Again",
  "starring": [
    "Amanda Seyfried",
    "Lily James"
  ],
  "runtime": 113,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Five years after meeting her three fathers, Sophie Sheridan prepares to open her mother’s hotel. In 1979, young Donna Sheridan meets the men who each could be Sophie’s biological father.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg",
  "categories": {
    "plot": 5.595238095238095,
    "acting": 5.5,
    "ending": 7.5,
    "soundtrack": 5.428571428571429,
    "cinematography": 5.666666666666667,
    "familyFriendly": 6.0,
    "funny": 8.2,
    "action": 4.666666666666667
  },
  "reviews": [
    {
      "rating": "4",
      "text": "This felt like a disney movie amped up to 11, and this isn't a good thing. The  whole \"fall in love after just meeting\" is so old that even disney doesn't do it anymore. Most characters are shallow and very under-developed. The script feels very childish, if that's the right word for it. Can't tell you how many times i rolled my eyes, at the stupid and corny things said by those characters. The amount of unnecessary sub-plots could have been taken out, cutting the movie to at least 90 minutes, Cher's character and plot line comes to mind.  It certainly could have been more straight forward, to make it a better movie.Being a lover of music, i have to admit, some songs are very catchy and good to listen to. The performances are good and convincing, but unfortunately this movie suffers a bit with Meryl Streeps absence, although that point is kind what drives the movie forward.I wasn't expecting too much of this movie, but wasn't expecting it to be a combination of a live action disney movie and a mexican soap opera."
    },
    {
      "rating": "2",
      "text": "The Vocals weren't strong in the movie, and the storyline didn't make sense. If you compare the \"Past Tense\" actors to the real characters they don't look the same at all, and the show haven't done nothing to make them look as they were described in Mamma Mia \"1\". Overall it  just seemed sloppy and weird to me, and it's a shame to the real Mamma Mia. Only positive is that all the old actors were there. (Too obviously only made for money)"
    },
    {
      "rating": "2",
      "text": "The movie of 2008 fascinated me, the songs, the landscapes, the choreography, the plot and everything to make it a totally enjoyable movie. I did not feel the same here, I think that if Meryl loses a bit of that energy and Lily James, however charismatic, is not enough. There are few new songs (mostly forgettable) and the previously used songs are widely used. The trailer already shows you everything that happens and there is no surprise. Cher brings absolutely nothing and appears in the last 5 minutes. Donna's relationship with the 3 men seemed very forced and rushed. I did not like. I expected much more."
    },
    {
      "rating": "8",
      "text": "For those who enjoy a happy musical movie, this is for you. I loved the music and feel-good atmosphere and thought it was thoroughly entertaining. I missed Meryl's presence but the cast filled the spots very well. Their talent carried the movie, even though the dialogue was sparse. The music was fun and it was fun to watch. I recommend seeing it."
    },
    {
      "rating": "1",
      "text": "Challenge: watch the whole movie without covering your eyes or  plugging your ears and not vomit. You cannot do it. Never been done. Never will. Donald Trump will be humble before that happens."
    },
    {
      "rating": "2",
      "text": "Choreography is extremely lame (sometimes it's just some \"waving\" and that's for like 3 of the songs), especially during the Waterloo segment, where they all look like a high school theater musical gone wrong. Songs are just re-hashed from the original, with nothing different to make it watchable. Actors are flat-out incompetent, especially the younger ones and Cher (give her the Razzie already). Script is... well, there isn't one. It adds NOTHING new to the original story. We still have no idea who the father is and no new information that could make this go forward in any kind of way. Streep is in this as a freakin' GHOST for the very last musical number. There is NO reason for this to suck as much as it did. I expected average, at the very least boring. But this is an insult to ANYONE, even fans of the original will be pissed by how this brings NOTHING new and barely makes any sense.Avoid this movie. Re-watch the original, but please do not give this movie any credit for doing anything."
    },
    {
      "rating": "1",
      "text": "So…here we go again!After nearly ten years since the original Mamma Mia, the hit Broadway musical and box office hit film (generating over $600 million at the world wide box office), returns for another dose of ABBA inspired music and sing-alongs that fun for the whole…rather female family.Acting as both a sequel and prequel, Mamma Mia: Here We Go Again continues from the first film, showing us just how Sophie (Amanda Seyfried) plans to re-open Hotel Bella Donna in the beautiful Greek Islands while being pregnant. With the help of only one of her three fathers Sam (Pierce Brosnan), Sophie does everything in her power to give the best grand opening party ever. Yet, for the first time in all her life, she has never felt closer to her mother Donna (Meryl Streep).While Here We Go Again is such as silly and absurd as its predecessor, the truly best parts of the sequel, aren’t the sequel aspects at all, but the prequel aspects. The majority of Here We Go Again. showcases a young Donna (Lily James) and how she came about to Greece and how she came to meet (and fall in love) with the three influential men in her life, including a young Harry (Hugh Skinner), an young Bill (Josh Dylan) and a young Sam (Jeremy Irvine).While Here We Go Again is surely meant to be Sophie’s story, especially given Sophie’s pregnancy with Sky’s (Dominic Cooper) baby, the move never quite allows Sophie to being the star. Always in the shadow of her mother and what an amazing woman and presence she was, both in a narrative sense and reality sense, Seyfried’s Sophie is constantly overshadowed by both Meryl Streep’s Donna, and now, Lily James’ Donna. Both Donna’s are shining examples of just how exuberant, vibrant and lively Donna really is; a soul who leaves her friends on a whim, travels the world with no regrets, and gets into bed with any cute man that puts in any effort to sweep her off her feet. Whoops!Its in Here We Go Again where the audience can truly appreciate the amazing absence of the amazing Meryl Streep and her interpretation of Donna, and James is more than up to the task and does an incredible job of brining to life a beloved character.One of the more disappointing features of Here We Go Again is the void of Streep on-screen. While much of the marketing and promotional advertising promises Streep in the newest film, her return is not for quite long, and overshadowed greatly by her mother, Ruby, played by the queen of glam and glory, Cher. While the queen of disco only shows up very late in the film, she does what Cher does best, providing the film with its fair share of sass, attitude and divine diva-ness that capsules the film into queen like status, yas!While Mamma Mia: Here We Go Again isn’t the most spectacular musical you’ll watch, especially after such genre-defining work on La La Land, you can sure bet that this latest instalment of the popular ABBA pop group’s discography, will one a huge hit amongst women, mothers and inspire an onslaught of mother/daughter dates for the remainder of summer 2018."
    },
    {
      "rating": "9",
      "text": "\"Here We go Again\" caps off the near-perfect \"Mamma Mia\" duology. This film is tearjerking, fun from start to finish, contains an amazing soundtrack, and has terrific continuity from the first film."
    },
    {
      "rating": "5",
      "text": "Mamma Mia succeeds in what it is trying to be, unfortunately what it's trying to be isn't very ambitious. While the scenery is nice and there are some upbeat musical scores, ultimately this is a film that is both demeaning to men, women and the art of film."
    },
    {
      "rating": "6",
      "text": "The sequel to the hit ABBA Musical/Movie Mamma Mia has a lot of really great things going for it. The musical numbers have been polished up from the original. The cast really has improved their vocals. The casting is stellar, and there are some heartfelt moments scattered throughout. The pacing is a little shoddy, and there are some scenes that can be skipped over entirely. The story is unnecessary, particularly when viewed in the context of the first film. Its a light, fluffy, fun musical you can turn your brain off to."
    },
    {
      "rating": "8",
      "text": "Not sure why I rented this. I suspected watching it would lower my IQ by around twenty points. I'd seen the first \"Mamma Mia\" movie on a cruise ship in Alaska. All I remembered about it was that Pierce Brosnan could not sing to save his life and that the plot was terminally silly. This sequel/prequel is carried by Lily James, a British actress who first impressed me as Churchill's young secretary in \"Darkest Hour.\" She lights up every scene in which she acts. She has singing, dancing, and acting chops to burn. Cher, at the ripe old age of 71, appears toward the end of the movie. The plot again is terminally silly, but the movie is saved by the sense that a bunch of actors who genuinely care for each other are having an extraordinary amount of fun together."
    },
    {
      "rating": "6",
      "text": "I'm an ABBA fan, I love their songs but I was never happy with the results of Mamma Mia, although I know the play is a phenomenon. The truth is that the film didn't leave me satisfied, partly because I'm not a fan of musicals in which all the scenes are built based on the musical numbers. I hate when they only talk for a brief moment, they say a few words and seconds later they are already singing and dancing. I really hate that and both films are like that.I know it's a bit weird that I cannot enjoy the songs I like that way but it just didn't worked with me.This sequel doesn't invent something new or different and it doesn't want to do it either. It's simply an extension of the first film and what it had already done and that's not necessarily a bad thing but it's not necessarily a good thing either, especially since it wasn't a necessary sequel to begin with. But it's already done so complaining about that is an exercise in futility.I admit the change of structure in the story by interspersing the narratives of the past and the present helps the film and shake things a bit.Lily James does a good job as a young Donna and to me she's the only one that leaves a true impression of the cast of that part of the story. While the other part of the cast, ''the famous ones'' they're simply working at half gas, without striving at any time.Cher's addition doesn't really contribute to anything but it works. At least I've gotta say the film doesn't lie to you, it's practical and simple, it's obviously aimed to a certain type of audience, especially those who enjoyed the first one, so of course they will enjoy this one as well, that's why I give it credit. It's not a film that I'm interested in seeing again but its quality is good enough to excel what is necessary."
    },
    {
      "rating": "3",
      "text": "If want to see what the women's movement want of straight men see this . Patronising references of all the various minority groups. They even had a wheelchair user in one dance scene which in itself is fine of course, but by that time you realise this is spoon fed PC token inclusion . weak soy boys and weak singing. Chers entrance is noteworthy."
    },
    {
      "rating": "10",
      "text": "I adore this one! If you liked the 1st,no doubt that you will like this one"
    },
    {
      "rating": "1",
      "text": "Low budget found a cheap place in Croatia pretending it is in Greece.Nothing compares the first film that i loved so much,,,so disapointingvery few new songs and veru poor replica of the lovely Greek scenes"
    },
    {
      "rating": "0",
      "text": "Rated E. Highly emetogenic. Sickeningly saccharine. Sent me to diabetic ketoacidosis."
    },
    {
      "rating": "3",
      "text": "I wanted to like this, I really did. I love ABBA music and I'm a dude. But seriously, I could not stomach 20-mins of this female fantasy musical. It gets a \"3\" rating from me because the production values and casting (well, sort of) were top notch, it's gorgeous to behold but ugh, the plot, the painful singing, the unrealistic situations, just tortuous, sorry, but I did try."
    },
    {
      "rating": "8",
      "text": "I really liked it!Makes you sing along, dance, and even cry!It`s not as good as the first one, but still very good!"
    },
    {
      "rating": "8",
      "text": "Mamma Mia Here We Go Again is relentlessly sunny musical romp! You have to really get into it, though because it is so silly. I highly recommend!"
    },
    {
      "rating": "0",
      "text": "This movie is extremely cheesy, to the point where lumi likes it and she has a tiny pp."
    },
    {
      "rating": "0",
      "text": "The  movie I felt was disappointing with a bad plot ruining a movie that could have had potential fails the expectations focusing on the music to make you think it was good, to experience how much the movie offers buy the soundtrack."
    },
    {
      "rating": "3",
      "text": "a brimful of nothing..Mamma! Mia Here We Go Again1 And A Half Out Of 5Mamma! Mia Here We Go Again is a commercial plot driven musical sequel that depicts the past of the protagonist Donna which was kept hidden under the shadow in the first installment. It is certainly better than the first one; the reason to that is the sincerity that may not breed the essential crisp out of it but appropriately respects the tenderness of it, but unfortunately that's not saying a lot. It is rich on technical aspects like its up-beating and far better songs, decent background score and breezy costume design and on the other hand fails completely on choreography (which is disappointing considering the genre of the feature), cinematography and editing. Few songs and alluring visuals and locations are the only high points of the feature. The script is blunt, naive, cheesy and immature at times that follows an indefinite structure that collapses before it even builds itself up. The overstuffed characters with their textbook sub-plot, is one of the dullest recipe in this mishap of misconception. The screenplay by Ol Parker is raw and under-cooked to create any impact on its self-created and pretentious emotions. And whilst Parker fails on offering an appropriate trajectory to its characters, it decently holds on to its role on executing the sequence with conviction. The performance is something that itches down the throat throughout the course of it since the cast seem to have been enjoying too much to persuade the audience for a second look. Mamma Mia! Here We Go Again is more of a question than an answer to its predecessor as it's a brimful of nothing, where after the dust settles, there is still not a single piece of craft to explore in it for it takes place to create a satisfying closure for the makers and not the viewers."
    },
    {
      "rating": "10",
      "text": "I know this is not a cinema masterpiece but this is really unique and probably one of the few movies when the sequel is better than the original.The relationship of Sophie and Donna is stronger than ever. The duet between Meryl and Amanda is incredible, very touching and probably you're going to cry a lot in that part.Cher singing \"Fernando\" is probably the best musical moment of the movie. I mean, Cher should be in every single movie in this world. All the cast are great but when the Goddess of Pop enter in the movie we just want to see more.Rosie and Tanya are the funniest characters in the movie, the young and the oldest ones. And Tanya have the greatest lines on Mamma Mia! Here We Go Again.\"Super Trouper\" singing by Cher and Meryl Streep with the backing vocals of all the cast. Seeing this two having a song together is like heaven on the earth.The Screenplay is not gold, but it's funny and entertain the public. This is not a Oscar material film but it's probably the funniest movie of this decade."
    },
    {
      "rating": "7",
      "text": "This film serves as a prequel wrapped around a sequel. Lily James creates a lovely younger version of Sophie (played in the original by Meryl Streep). We see her meet the 3 dashing men who later became the \"fathers\" of her daughter (Amanda Seyfried). We also see her currently living in her mother's renovated Greek villa. All of this is peppered with plenty of Abba songs, some of which are repeated from the original and some of which I've never heard (not a big ABBA fan). Thru it all is a bright sense of fun and romance. The staging and costumes aren't as dazzling as the original, but there's still plenty of spirited joy. For fans: Streep and Cher (as the grandmother) both only appear late in the film for 2 numbers each. NOTE: Stay thru the credits for one final comic chorus."
    },
    {
      "rating": "7",
      "text": "This is such an enjoyable movie,  all the music and dancing is great fun to watch.  Amanda Seyfried and Lily James are so perfect as the leading ladies.  The cast is great and there just isn’t anything negative to say about it.  if you want to have some good fun, go see it.  Meryl Streep is not in this film, just FYI."
    },
    {
      "rating": "10",
      "text": "Its an amazing movie. Lots of fun, lots to laugh about and of course a lovely love story."
    },
    {
      "rating": "5",
      "text": "Unlike some of the reviewers, I actually enjoyed the silly, over-the-top aspect of the original.  And those infectiously upbeat Abba songs!  This one, though , was quite a disappointment.This one goes into the past to show how the young Donna meets all her boyfriends.  Although Lily James does a good job as the young Donna, her exploits with the three young men just aren't that interesting.  They used all the really good Abba songs in the first film, so they wind up with a lot of B sides here.  And the addition of Cher doesn't make up for the absence of Meryl Streep (except for a cameo appearance),  Trying to get more serious doesn't work too well.  Hopefully, they won't make another sequel."
    },
    {
      "rating": "6",
      "text": "“Be still my beating vagina..”Here We Go Again, folks.More beautiful scenery and musical numbers. The great ensemble cast returns with a welcome appearance from Cher. The acting from everyone was good. Even the new cast who play the younger versions of the older characters were pretty solid. Especially Lily James who I thought was crazy good.What took me by surprise is how sad and really tragic it got. I can tell it struck a chord with the audience by emotionally engaging them. The first movie was about becoming an adult and leaving your home. The second movie focus on moving on after a love one passed. I’m glad these films kept that formula. Still, It’s not all doom and gloom.However, there are issues.The story jumps from present day with Sophie (Amanda Seyfried) and the past with Donna (in 1977), which at times made it confusing when it keeps cutting back and forward. For me, it wasn't well executed.There’s a scene where it tries to be heartbreaking with Pierce Brosnan looking through old photographs of Donna while singing solo. No musical number or anything, just briefly singing. What was intended to be an emotional scene, instead made me cringe in my seat. He’s singing is the reason why. I will give credit for trying in terms of acting.Of course the cast got much older since 10 years and it shows. They tried to make a joke about it, and it's painfully unfunny. The audience didn't laugh, neither did I. Time has been most cruel to them.Despites those complaints and praise, it holds no weight to anything. After awhile you soon realize the filmmakers never set out to make a masterpiece or thinking piece. While yes, some of the cast are not best singers (mostly the males) or dancers, but the only thing you have to say is “who cares”. This is pure entertainment with heart. Elevating on enjoyment and most importantly having a good time. While not quite uplifting and lacking some of the energy from the first, but hey. The audience though - Uniting the gays and middle aged mum type of crowd since 2008.Overall rating: Take a chance on this one!"
    },
    {
      "rating": "9",
      "text": "I'm a Mamma Mia fan and I loved the sequel. Everybody, who loved the first movie should go to the cinema. Great cast and great songs, I juts love this movie!"
    },
    {
      "rating": "6",
      "text": "I loved Mamma Mia! and liked Mamma Mia! Here we go again.  I would have liked it so much better if the new movie followed  Donna's diary from the first movie and the music had a much fuller sound.  The timeline wasn't right in #2 and would have been so easy to fix with the way the characters were setup.  Donna meets Harry in Paris where they don't have sex and then follows her to Greece where they do have sex.  It's not hard to do.  They could have had the whole Waterloo song and dance scene with her at a Paris music shop where he buys her the guitar, starts playing Waterloo, takes off his shirt for part of the sale, and people passing by join in the song.  Even having a bust of Napoleon on the sidewalk would have been so easy.  He could follow her to Greece, sees her after Sam's left, asks to see the island, and it would have fit right into the diary entry from #1.  Since it was an \"oh what a night\" sort of diary entry for Donna, it shouldn't have had any of the Harry is really gay overtones to it.  When Donna is in Greece, she should have spent more time with Sam seeing the whole island since he was her main guy.  They would talk about the hotel idea and him sketching the plans for it.  They totally skipped that.  Bill doing a boat race in Greece was a better link to the actual diary, but it still opted to not include much of the relative on the Greece mainland for who Donna would later work for and name Sophie after.  They could have had such great scenes of them sailing around the island and actually being on the island where they have their \"oh what a night\" experience.  So much of the music in the movie is a cappella or minimal accompaniment.  Abba music needs to have a full sound.  The lip syncing of Cher was really bad.  They could have done so much more with her character as well.  Dancing Queen seemed to have solos with the chorus of singers heavily muted.  Please NO!  Mamma Mia! needs to be high energy with a strong music track to go with the vocals.  If the diary timeline had been fixed and the music done with higher energy, I would have loved it as much or more as the first one.  I can even enjoy Pierce Brosnan's singing with a good sound track to back him up."
    },
    {
      "rating": "10",
      "text": "This was such a beautiful movie. I loved everything about it, if you liked the first one you’ll love this one with no doubt."
    },
    {
      "rating": "9",
      "text": "In the canon of \"best worst campy films,\" Mamma Mia! Here We Go Again stands at almost the top. It's very rare for films to hit the \"so bad it comes full circle back to good\" point, but this one is the real deal.  The wonderful awfulness of it and the full-on sappy fun is only hurt a surprisingly little by the fact that this is the B-sides version of the first film.  Tons of fun!"
    },
    {
      "rating": "8",
      "text": "A perfect feelgood movie. Lots of strong musical numbers, some excellent set-pieces and a strong supporting cast. The flashback scenes intersperse so well with the modern scenes you feel as though you're getting two films in one. One sour note, I feel the \"we're so sad that Sophie is dead\" theme that permeated the movie put a needless downer on things. I am sure they could have reworked the story in a better way than this."
    },
    {
      "rating": "4",
      "text": "I went into seeing “Mamma Mia! Here We Go Again!” not expecting to be surprised and I was surprised in many ways.First of all I saw Lily James in “Baby Driver” last week and didn’t recognize her and she floored me in this movie. Playing young Donna, the role played in adult hood by Meryl Streep in the first movie, Lily James is startling, beautiful, incandescent and an excellent actor.Another surprise to me was Amanda Seyfried who had never impressed me before in the many movies she has made. In this film she looked different, more sparkling and more realThe biggest surprise for me was Cher! Not that she stole the film for the 15 minutes she was in it but because the first 5 minutes she looked bad, was dressed very unlike Cher and seemed very stiff singing “Fernando” but the last 10 minutes she was dressed as the Cher we know and stole all the closing credits from the rest of the cast, including Streep.A major surprise for me was that I love musicals, especially the old M-G-M, Busby Berkeley choreographed, Astaire & Rogers, Gene Kelley type of movies as along with songs and dances they usually had a good book. “Mamma Mia 2” drove me crazy with a song every two minutes consisting of second tier ABBA songs plus putting in the 3-4 hits that were used in the first “Mamma Mia!” Most songs were sung for absolutely no reason except they were written by ABBA.“Mamma Mia! Here We Go Again!” is 1 hour and 50 minutes long—go see “Mission: Impossible” and then walk into “Mamma Mia” at the 1 hour and 20 minute point!"
    },
    {
      "rating": "6",
      "text": "There's only so much you can do with a Mamma Mia sequel, and for what it does, it does it well. The weakness? Well, half the soundtrack is a repeat from a the first film, and the flashbacks contain actors who look nothing like their counterparts, but otherwise a fun ride."
    },
    {
      "rating": "3",
      "text": "'Mamma Mia! Here We Go Again' reminds us many times why the first movie didn't work. Despite the fact that the songs (from ABBA) are better incorporated to the film's story, ironically, the best parts of the film is where the character's don't sing. We see that Sophie (a plucky Amanda Seyfried) is trying to open up a hotel in honor of her mother's memory. Slight spoiler alert (even though it is very early in the film), but yes, Donna (Meryl Streep) has passed away. We're never given an explanation as to how she died, just that, she is no longer with our main characters, and that's a way to kick-start the movie's plot. We do get constant flashbacks to Donna's younger days (where she is played by a likeable Lily James), and how she traveled across different islands and met many handsome men who she spends some romantic times with. The singing done by James, as well as her on-screen male love interests, is done well, and as I said above, the songs are better incorporated to the film's story... but I found myself more invested when they would just sit an talk. I know that might be a bore for some, but I felt that the characters were really progressing just through dialogue alone. The movie constantly cuts back and forth between past and present, developing Donna's character even more, and how she met her three exes. Unfortunately, this made me feel that the overall storytelling of the film was very uneven. Time and time again, we're being forced to get emotionally invested in these two different timelines, when they're cutting back and forth to different situations, so there is no time to care. I found myself getting utterly frustrated with the bland archetype character that Andy Garcia was playing. What's the purpose of his role? Just to be utterly handsome and flirt with Donna's two best friends, that's it. All in all, this maybe a \"feel-good\" film, but I found myself feeling the exact opposite. A waste of emotional investment despite some strong work from a talented cast."
    },
    {
      "rating": "6",
      "text": "When you don't put Meryl Streep in the film it is notorious the absence, but the adding of Cher is so strangely perfect. Lily James transforms into a young Donna, she is a great actress. The boys still don't sing. I think it's on purpose.The choices of the younger versions of the O.G. cast is perfect, but the fact they changed the story of how Donna met the dads really confused me."
    },
    {
      "rating": "7",
      "text": "After the passing away of Donna, Sophie, her daughter, tries to leverage the local place where they lived their entire lives, so she could make her mom proud once again. At the same time that Sophie go struggling in present time, we see Donna's young adult life, how she met all of the Sophie's fathers and her relationship with them, we see a lot of Donna adventures with her friends and love, so as her disappointments. Directed and Written by OL Parker.We accompany two stories in two different times in parallel, present and past, these transitions normally worked out well, but there were some few times that it didn't felt much naturally between those two times. The story of Donna is very nice told in here, since the moment that she graduated the movie made it clear what she thought about the world and how she wanted her life to be like, during her relationship with other characters we can get to know her a little bit more each time, how kind she is and what she sees around things, they did a good job in evolving the character that we already know, or better building up to that one that Meryl did 10 years ago. The story of Sophie also works, it just isn't so interesting as Donna, but like they are mixing with the time, the thing about her moments is also a lot about the parents, wich was definely fun, how they hold up with their lifes is a interesting moment, there are some drama moments that i don't think that it worked in the best way, but mostly it was good.The story brings discussions about maternity, how big is the connection with a mother even after a death, it did got some emotional moments where it did speak a lot.A lot of the movie could be taken out into clips of music, like more than 50 per cent of it, it could be cutted out and be watched just by itself, and i gotta say that must of these clips are great, like damn, really great, some of these are so fun that can easily put your spirit up, some of these clips are completely fun, a completely delight to watch, not necessary are the most creatives ever, but the happiness that you see in the face of every single one that are in those dancing and singing moments are contagious. Lily James singing is fantastic, she is a great singer, everybody that got the shot to do some singing moments did a good job, the songs aren't original for the movie, bu they are very good, the creativity aren't very big in most of the clips, but they still pumped my spirit up, so it was good. The dancing sequences was a lot of fun and much of it because how much it did contagious me and how much different people was there, there were all kind of people there together and having fun, that was fantastic.Lily James singing is fantastic, i'm glad that they are keeping her in those movies that requires that her character to sing, she as a singer really heat's my heart, in the acting part she is also very good, she could pass me the suffering in some moments, or the strange parts that she didn't knew what was happening as well, physically she is great, wich was nice in the dancing moments wich happened a lot with her, where she did a great job not just in the singing part, but also working with her expressions while doing it so together with the dance, she was fantastic. Amanda Seyfried had some really good emotional moments. Christine Baranski and Julie Walters are still very fun and a very nice duo with chemistry, so as the actresses that portray the younger verse of them, wich are Jessica Keenan Wynn and Alexa Davies, they did a very nice job and i completely bought that they were the same person. The 3 fathers so as they younger selves was also very nice, all of them did a good job, they were all fun and all sang well.This movie fixed one problem that it had in the 2008 one, wich is the filter, that yellow and ugly filter is gone, and now we have a beutiful cinematography to see the island and the colors in a much better way. There were some sequences where the green screen was easily noticiable.This one is definely better than the first one, it is so fun that will bring your spirit up, playing the songs from ABBA with some good moves and a very nice singing, there are some moments that are boring, some unnecessary telling, but overall it is a lot of fun."
    },
    {
      "rating": "7",
      "text": "Mamma Mia! Here We Go Again. The first time was better. I love musicals, but already the second film does not cause a storm of emotions. Cool music, good plot, but still something is wrong."
    },
    {
      "rating": "7",
      "text": "This would have got a higher review if it was just a prequel. I really enjoyed this movie, the ABBA music won my heart, but it was slightly cringe with much older Colin Firth and co. Lily James easily stole the show with her dancing, singing and acting performance."
    },
    {
      "rating": "6",
      "text": "A silly sequel that was entertaining but not very interesting.  I enjoyed the first film better, but some of my friends enjoyed this one more."
    },
    {
      "rating": "7",
      "text": "Obviously this film is incredibly cheesy, ridiculous and cringy, however, if you just go to the cinema looking for 90 minutes of entertainment, this film is great. It's just meant as a bit of fun, and if you look at it in that way, it's pretty great."
    },
    {
      "rating": "7",
      "text": "To be quite honest, I didn't care much for the first film. However, this sequel managed to rope me in with the seemingly amped up effort put into it. It seemed like they cared a lot more this time around. The musical numbers were fun, well choreographed and sung, many of the jokes landed, and that cast was very game, with Lily James and Cher being highpoints. Sure, it's not Shakespeare, but nobody should go in with that expectation. If you're looking to be entertained and not have to think too hard, you'll have fun being able to avoid the world for two hours."
    },
    {
      "rating": "7",
      "text": "With a simpler story, the film becomes better than the first since its 10 first minutes. Nice and light, but forgettable. Nice and soft. 7.0/10"
    },
    {
      "rating": "8",
      "text": "I like the message this film sends, it says that it's your choice how to live the rest of your life and do what makes your soul shine. The \"young Donna\" kept telling about how short life is and she wanted to make some memories, it's cool, brave and I appreciate that. However, I don't really love all the songs. I mean it's good, but kinda boring, it's all on a type"
    },
    {
      "rating": "7",
      "text": "It was a good movie, not better than the original one.I was bored by the fact that after a song, 2 minutes of plot comes on, and then another song, every damn time.I know it's a musical, but they abused the quantity of songs, and also the fact they used the greatest ABBA songs on the first one, left them with not some great hits for this second one.I enjoyed the history of Donna on her young ages, but I wish they hadn't pick that storyline for Meryl Streep. Killing Donna for me, wasn't a great idea. I don't know if Meryl could act for the entire movie or what, but with her being alive, the plot could potentially be really much better.What I liked the most, was watching a movie with that great cast 10 years later, still fresh."
    },
    {
      "rating": "6",
      "text": "“Mamma Mia! Here We Go Again” não me deixou satisfeito. Esta sequela não inventa algo novo ou diferente e também não quer fazer isso. É simplesmente uma extensão do primeiro filme.6/10"
    },
    {
      "rating": "2",
      "text": "This sequel/prequel/disaster contains some recycled songs (performed better this time) mixed in with deeper ABBA cuts.  Unfortunately, that's the only reason to watch this film.Better singers were brought on board but again we're forced to listen to the first movie's cast attempt (and fail) to sing.Many story points of the first film are retconned.  There are plot turns that don't even make sense.  This appears to have been done to shoehorn in some of the songs and get the \"feels\" desired by the writers.Do not attempt to make this movie fit in with the first.  Do not attempt to think about the movie very hard.I cannot believe it took three writers to turn out this inconsistent mess of a film."
    },
    {
      "rating": "10",
      "text": "A rare sequel that supercedes its original in all aspects: more colorful, emotionally packed with joys and sadness, and better screenplay with more heavy weight stars added into the cast. The trailer intendedly feature songs already presented in the first movie, but when you immerse yourself into the movie, you will find that ABBA still has much more hits that you could remember. The only disappointment is that Meryl Streep has minimal screen time, but this is how the plot means to be when you finished the whole movie; her debut in the movie is precisely nice and placed at the best part of the movie. My top movie for 2018."
    },
    {
      "rating": "10",
      "text": "Better than the first one. The plot is wonderful, AMAZING SOUNDTRACK. I laughed, I cried and enjoyed every moment. Perfect sequel to this amazing musical movie. the director does an incredible job telling the story of the present and past. Lily James deserves an Oscar after her performance, she has a lot of talent and a great voice.EXCELENT MOVIE 10/10 -"
    }
  ]
}