{
  "id": 1818,
  "title": "Man of Tai Chi",
  "starring": [
    "Tiger Hu Chen",
    "Keanu Reeves"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Drama"
  ],
  "description": "In Beijing, a young martial artist's skill places him in position to experience opportunities and sacrifices.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jXq5Gjy8vc3iifDgtObZ4i6qNe8.jpg",
  "categories": {
    "plot": 7.538461538461538,
    "acting": 7.444444444444445,
    "ending": 7.666666666666667,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I thought this was a brilliant directorial debut from Keanu. It's very well put together, with tons of brutal action, a banging soundtrack, a great concept for the story and just all round entertainment. Keanu seems to capture the spirit of the classic martial arts flick perfectly, demonstrated not only by the directing style but in his role as the archetypal lead henchman. His performance borders on Grindhouse and makes me think he'd be perfect for that genre too. I don't know how the guy looks so young as well. He's either been cloned at some point or as had a facelift. A great martial arts flick and one I'll definitely be watching again."
    },
    {
      "rating": "10",
      "text": "It may not be groundbreaking, but Man of Tai Chi represents an agreeably old-fashioned picture for martial arts fans  and a solid debut for first-time director Keanu Reeves. The music is sizzling and Tiger Chen doesn't need wires, it's spectacular. Man Of Tai Chi is one of the best martial arts films after Gareth Evans's The Raid."
    },
    {
      "rating": "7",
      "text": "Directional debut for Keanu Reeves which was partially based on stuntman Tiger Chen's life story. Since the story was inspired by a Chinese character, the movie was co-produced by Hollywood and China in Cantonese and Mandarin languages with a little English. Keanu Reeves appeared in a negative role and his friend Tiger Chen as himself.\r As the Keanu Reeves's first movie as a captain it is evident that he had faced tough challenges to capture in some of the scenes. Clearly the fight choreographies were the best parts of the movie. Since his friend Tiger Chen is a stuntman they had no troubles in those areas. Those who love martial arts will like this movie for its awesome stunt sequences. Drama portions were little sloppy, due to the similar fashion storyline that already we had seen in some of the earlier releases.\r It is not a finest martial art movie of the year, but fights were the movie's highlight. I can't appreciate Keanu Reeves direction, but somehow he handled everything nicely from this movie being a junk. He's a good actor than a director, though he may improve in his next project, but I don't know.\r I expected this movie to be fast paced, exciting one, but what I got was opposite. The reason was the story of individual character did not fit into as a single movie. For example, Tiger Chen's master and his story, Hong Kong Police and their criminal chase, all these looked a bit weird together. Removing commercial elements could have made it a better movie.\r This is not the first time a western director flew to the east to make a movie. It has been done many times in the past in movies like 'The Last Samurai', 'Kundun' and the recent one '47 Ronin' et cetera. So no wonder Keanu Reeves made this with his best friend Tiger Chen. The question is, is this movie worth to have a peek? I would say it was not the best nor the worst.\r 6.5/10"
    },
    {
      "rating": "9",
      "text": "The film is very good but I wanted it to be great. The martial arts in this film are amazing and shot quite well  not from up close (Hollywood trick  that I hate  to make seem action seem more intense) but from a wider angle to show case the amazing choreography.  The action doesn't need help to be intense and starts early and is frequent and varied until just after halfway where the movie goes a touch too slow through the dramatic story line before an ending that was almost great.  Keanu is great as a director and for first-time out has made a very watchable film with incredible action sequences while showcasing us the incredible artist Tiger Hu Chen whose skills I look forward to seeing more of.\rIf you enjoy this genre don't miss this film."
    },
    {
      "rating": "7",
      "text": "A lot of sweet fight scenes and great martial arts performances. The story isn't that great and the characters and acting are mediocre at best, but Tiger Chen's progression over the course of the film is pretty neat. This movie could've been a lot better, but it's worth a look if you like martial arts movies."
    },
    {
      "rating": "6",
      "text": "Nice movie, amazing fight choreography, a bit of a cliche` story but quite nice and appropriate music soundtrack. Script leaves something to be desired at times and Keanu Reeves' acting is below par in certain scenes but overall nice."
    },
    {
      "rating": "8",
      "text": "While other reviews would suggest that the film's story is quite generic it manages to put a 3rd act twist in the makes you re evaluate the film taking it in a different and more personal direction to similar martial arts tournament films.\rThe fighting is very high calibur and fans of the matrix will be most at home here with reeve's directing and Tiger Chen's choreography eliciting that same feel. Man of Tai Chi does for tai chi what Only the Strong did for Kopiera but is also very engaging."
    },
    {
      "rating": "8",
      "text": "This movie is so close to being amazing.  It shows some really good direction by Keanu Reeves and good acting by Tiger Chen.  There's not an excessive amount of fighting and the fights seem fast and furious or dramatic.  Most of Keanu's acting is terrible in this movie but not all of it.  He's just too stiff but he pulled the voice off nicely.  More than anything, this movie has a great story, although it might not be obvious to everyone who sees the movie.  It really is a great script, with the journey of a man through so many discoveries---corruption, power, virtue, selfishness, purpose, and more.  The villain challenges the hero into becoming the hero in multiple instances, which is very rare and awesome.  When Hollywood inevitably has to do another remake, I think they would be smart to remake this film."
    },
    {
      "rating": "7",
      "text": "It may not be groundbreaking but it has few scenes which were outstanding like first Tiger fight with two opponents. This movie is quite solid martial arts movie, which does not try to have super deep story and characters you wish the best for. Instead you get eye pleasing visuals, a little bit of Chinese culture and philosophy. It is not Keanus best role to be honest though."
    },
    {
      "rating": "7",
      "text": "Keanu Reeves passe derrière la caméra et propose \"son\" film d'arts martiaux, tout en s'adjugeant au passage un petit rôle pas très gentil et manipulateur... Du coup, inutile de songer aux séquences de Matrix \"je connais le kung fu\" que ce soit formellement ou scénaristiquement bien entendu : l'approche de l'acteur-metteur en scène repose ici en filigrane sur les principes fondateurs de cette discipline particulière que l'on nomme le \"Taï Chi\" : le contrôle opposé à la force...Cela n'est sans doute pas très adroit et rejoint par analogie la naïveté des deux côtés de la Force d'une célèbre saga (obscur ou lumineux), appliquée à une sorte de philosophie orientale \"pour les nuls\" vue par un Américain... Oui, c'est vraiment bizarre et pourtant malgré leurs maladresses, on devine les bonnes intentions de Keanu qu'on sent clairement admirateur des arts de l'Empire du Milieu.Le film se montre intrigant et enchaîne un beau paquet de combats, lesquels ne sont pas forcément bien mis en valeur, hélas. Le montage est de temps à autre assez détestable et surdécoupe trop l'action : cher Keanu, pourquoi n'as-tu pas revisionné les vieux classiques chinois en la matière ? ou revu le premier Matrix avec ses superbes ralentis ? or, de ralentis, il n'en est pas question ici ou beaucoup trop rarement... Quant à la scène en lumières clignotantes, c'était juste horrible.Bref, comme trop souvent avec les acteurs qui se mettent à réaliser, le résultat est étonnamment perfectible. Mais pas rédhibitoire dans le cas qui nous occupe, fort heureusement ! l'ambiance est agréable et si ce n'était Keanu dans son petit rôle, ce film pourrait passer pour un film 100% chinois avec tout le charme de l'extrême orient, de ses vieux maîtres et de ses belles filles asiatiques.Un film en tout cas intéressant, jamais ennuyeux, assez spectaculaire et qui laisse une bonne impression globale en dépit de ses errements."
    },
    {
      "rating": "6",
      "text": "Great to see Keanu as an antogonist in this flick, an adequate twist on a trickster devil plot. Rather enjoyed the frequent fighting during the movie, with an unlikely hero, Tiger Chen. Worth watching, especially if you're a guy ;)"
    }
  ]
}