{
  "id": 549,
  "title": "Man of Steel",
  "starring": [
    "Henry Cavill",
    "Amy Adams"
  ],
  "runtime": 143,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "A young boy learns that he has extraordinary powers and is not of this earth. As a young man, he journeys to discover where he came from and what he was sent here to do. But the hero in him must emerge if he is to save the world from annihilation and become the symbol of hope for all mankind.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dksTL9NXc3GqPBRHYHcy1aIwjS.jpg",
  "categories": {
    "plot": 9.777777777777779,
    "acting": 9.76086956521739,
    "ending": 9.866666666666667,
    "soundtrack": 9.666666666666666,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 9.5,
    "action": 9.4
  },
  "reviews": [
    {
      "rating": "10",
      "text": "SPOILERS AHEAD.\rAmazing how things change over the years. When I was a young boy, I saw a squeaky clean Christoper Reeve in his neon blue outfit and it left a lasting impression. Long after the movie, we would still run around on our farm with red swimming towels flapping in the wind behind our backs. In those moments, the lines between fantasy and reality blurred and I became the super hero I adored.\rBut the way we perceived this person, this alien, had to change. This story had to be told from a different angle. We had to see it from a realistic and emotional point of view.\rHis personal struggle is beautifully told and succeeds in creating a deep sense of empathy. A man who had to let his farther die because he believed it when his farther told him that the world was not ready for him. A man who had to hide his identity ending up drifting around from one place to the other.\rThis is his journey. He brings goodness to us, but also evil and he knows he is accountable.\rIn the end, he becomes a being of hope, bridging the divide between a distant extinct planet and earth.  He becomes a link between them and us who ends up saving us and fulfilling his father's vision.\rIn conclusion. The way Superman was portrayed in the 80ties, was through the eyes of children. In this movie, Kal-El is presented to us through the eyes of the adults we have become. Not only does he bridge the gap between his planet and ours, and the gap between hope and despair. In a sense, he bridges the gap between us and our child like perception of him."
    },
    {
      "rating": "10",
      "text": "The movie was awesome lots of action, a little bit of humor not much though and had some very emotion parts.The visual were spectacular and hans zimmer did ah wonderful good on the soundtrack. Henry cavil was an very good superman i still liked reeves more. Overall it was very good and my favorite movie of  the summer so far"
    },
    {
      "rating": "10",
      "text": "MOS (Zack Snyder) is the latest comic-book based reboot of the Superman story where first contact is the main epilogue for the film.\r Where Superman Returns (2006) paid homage to the Donner-Reeve films, Man of Steel gives this boy scout a well needed injection of sun light in a back-story heavy extravaganza. The film uses a variety of source materials for inspiration (Sullivans, Whitney) as well as setting up a possible JL movie  Whilst many question the ending, you have to say to yourself  surely the way we expected him to be comes from somewhere?"
    },
    {
      "rating": "9",
      "text": "I was super hyped about this movie, but started doubted if it was going to be good from seeing the critics hate on it. But boy were they wrong this movie is AMAZING! Not as good as the Dark Knight movies but still a hundred times better than Superman Returns. Also this movie has superb action (you finally get to see Superman kick some ass!) and emotion, and a great villain, and they don't shove all the love stuff with Lois Lane down your throat, it's natural. Overall best Superman movie, and best origin story (for a superhero, but Batman Begins is still amazing)"
    },
    {
      "rating": "10",
      "text": "I just saw Man of Steel at the IMAX 3D. It was the best rendition of superman I have ever seen. The acting, storyline, and graphics was epic! I can't wait to see it again! My favorite movie this far! I recommend everyone see this film."
    },
    {
      "rating": "10",
      "text": "This is a movie about Truth, Justice, Honor, Tradition, and Culture. Everything that made America great in the past. This is why the Liberal Movie Critics are trashing it.\r Politics aside, the movie is great!"
    },
    {
      "rating": "10",
      "text": "One of the best superhero movies ever made, the look of the film is amazing and destroys Henry Cavill as Superman (Clark Kent and how), and the action scenes are of the highest possible quality, is like the fight scenes transformers but only you know what is happening and of course the action scenes are better filmed, and the story of the film is excellent and has some references to comics, anyway Man of Steel is a movie which is indispensable to REALLY superman fan."
    },
    {
      "rating": "10",
      "text": "Finally a good Superman movie that is grounded in the real world while still being about a God like Alien. Also nice to see Zod having a legitimate reason for what he is doing and making Superman have some hard choices. Bring on the next one."
    },
    {
      "rating": "9",
      "text": "First things first, I loved this movie!  It has it's flaws but still a great film to watch.  I was actually very impressed with Henry Cavill.  He did an amazing job as superman.  Overall the acting was superb, though maybe not the best script ever.  The action was epic in scale but it didn't have the same weight as The Avengers' action did, it felt a bit generic and bland.  Overall this film has much of everything, emotion, action and some humor.  Great film"
    },
    {
      "rating": "8",
      "text": "Haters gonna like. I have to admit that I don't like Superman but Man of steel was an extraordinary action packed film with extraordinary visual effects and music. Tries to reach The Avengers though it doesn't achieve it. The appearance of Christopher Nolan is something that can be easily seen with all that dark stuff on that movie. Michael Shannon was the best enemy that Superman could have. Amy Adams was always as if she was crying through the whole movie. I will watch the sequel (if they make one). I enjoyed it and it is certainly a film for the cinema and not for the DVD. i liked that it also showed past and now at the same time. Thumbs up!"
    },
    {
      "rating": "9",
      "text": "It's not a masterpiece that will go on to win the Oscars next year. But it's the biggest, loudest, action packed movie that Superman deserved. It definitely has the Snyder touch, and you can see Nolan's influence in it too.\rThe pacing is good (not great though) and it keeps some balance at least for the first half of the movie. Then we get to see some good old school Superman action, with enemies that can fight toe to toe with him.\rThe supporting cast is good, the story flows, sometimes a little forced, but overall it's a great movie."
    },
    {
      "rating": "10",
      "text": "Absolutely brilliant with awesome acting and awesome effects this film is the best film of 2013 and that's is not arguable at all. I don't see why the critics are saying sores like 53 out of 100 as that's wrong and they should change their scores to 90 at least."
    },
    {
      "rating": "8",
      "text": "So many don't like it. I loved it.\r This is what I call the Prometheus syndrome. Many hate it, but many loved it, and I loved Man of Steel, even though I am aware of some of it's problems- the same with Prometheus, but I don't think it brings down the film as much as it has been made out to be.\r This was my most anticipated movie of the year, and to be honest I had been hesitant from the start, as I had never been fully keen on Zack Snyder's work, I always found that they were good, but never great, with films such as Watchmen and the Owls movie- or they were just plain awful... Sucker Punch. This is, by far, Snyder's best work, and although many haven't liked the action- it flew by for me- the whole film whizzed past actually, while for most it seemed to drag. This film made me feel like a kid, as at one point I was sitting with my mouth wide open at the scale of the thing, and I literally jumped out of my seat when Superman himself, or Kal-El I should say, started throwing down in the air, against Zod.\r Another concern I had did come to fruition, with many saying David S. Goyer will bring greatness to the project, but actually he has written some awful movies, and when people said 'He wrote The Dark knight Rises'- this is incorrect, he did the story for it. Films that he has written recently would be 'Ghost Rider: Spirit of Vengeance', 'Jumper' and 'The Unborn'. Three awful films, that although the script isn't as bad as I am making it out to be, there are a few weird lines that pulled me out of the scene. I liked the structure Goyer gave, although it did lack some depth, I felt like I got enough to become emotionally connected to the characters.\r The two strongest parts of the film would probably be the performances, and also the effects. I normally would criticize a film for one of it's strongest parts being the effects. But this is probably some of the best effects work I have ever seen. In this kind of scale anyway. As this film is big, and there is a hell of a lot of carnage.\r Sure when you think about it. A lot of people died. But hey. Superman. it's all that's needed to be said. Bad argument, I know. But... Superman.\r As part of the effects work, this also some of the best action I have personally ever witnessed, in scale and execution. It's crazy. I have heard that many simply turned off and got numbed by it, but I was the guy who wanted more. As I said earlier, I honestly felt like a kid watching my favorite comic books moments coming to life. Properly.\r Here's a rundown of the performances:\r Henry Caville- He plays a great Superman, and although the character was lacking in the script department, I definitely connected with him. And he WAS Superman.\r Michael Shannon- He worked for me, and I preferred his reasons to go to Earth. There is an established reason for what he is doing, and he believes what he is doing is for the better. It is not I'm a bad guy. Blah. Although anyone could have really played the character, it wasn't a stand out role, but served a purpose.\r Russell Crowe- Awesome. Krypton scenes- some of the best of the film. Amazing stuff there. And he is perfect.\r Amy Adams- Good Lois Lane. She is given some weird lines though that doesn't suit the tone of the film, e.g. 'What if I need to tinkle?' Also the Superman-Lane relationship is a little rushed, and could have been left to a later film.\r Kevin Costner- Again, great, although almost a bit underused. But he is almost the underlying hero of the film.\r Diane Lane- Also good etc.\r In other words. Go see it. Here, The Prometheus Syndrome, comes into effect. And today we see the creation of The Man of Steel Syndrome."
    },
    {
      "rating": "10",
      "text": "Instead of telling all obvious good things about this movie, I will just say that i will watch it again tomorrow. I have NEVER done this with any movie. And this is coming from a person who was never a big fan of Superman."
    },
    {
      "rating": "10",
      "text": "Watched again yesterday. And still giving it a 10. Just amazing movie. And a first movie I go to see twice in the theatre. Just great, really opened up more with the 2nd viewing. Zod is a great villain!"
    },
    {
      "rating": "10",
      "text": "A cinematic blockbuster with action scenes that will just AMAZE you! Yes, this is a different take on the most iconic Superhero that was ever created but, in my opinion, it is better for it. This is a updated and modern Superman for this generation of movie-goers, as it is for those of us who didn't grew up with the original Superman movies back in the late 1970's and 1980's  Many fans have already said to ignore critics as most of their reviews are very harsh. I agree with the fans. Many of the critics compare this movie to the original superman movies as they said that those movies had more heart and humor. To me, this is very unfair and biased as they can't accept the fact that this is a reboot and thus a different Superman from the one that they remember from the original films. This new Superman is grounded, and more serious"
    },
    {
      "rating": "10",
      "text": "I went into this movie with high expectations. And wow was I pleased. The work done on this movie was phenomenal.\rPeople have issues with the casting for a few characters, but I will say that it was perfect. The movie nailed it. And I can not wait to see a new one.\r My only problem was that it was short, and if the movie was longer, then there would have been more character development. Other than that I had no issue.\r I love new and dark approach to the heroes of the DC Universe, and I pray that the rest of the heroes and heroine have the same feeling.\r This movie has the story, the characters, the acting and the action.\r 10/10"
    },
    {
      "rating": "10",
      "text": "Words can't even begin to describe how awesome this movie is!Heartbreaking performances,outstanding fights scenes and CGI.Man of Steel reaches perfection.EPIC!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "One of the most enjoyable movies this summer so far. Critics have no idea what they're talking about. The soundtrack was a little overpowering at times, but that's all I have to say about this movie in a bad way. This movie is action-packed, has really good acting, and pretty good presentation. I think that some people don't really like the way Zod is defeated in battle, when Supes cracks his neck, and I understand that. But he really didn't want to. He had to save that innocent family from dying. I would've done the same thing if I was him. It takes a little while to get some where, but you will not regret going to see this movie, I promise."
    },
    {
      "rating": "10",
      "text": "Man of Steel takes from Superman lore the aspects that fans of the original films have been dreaming about for over 3 decades.\r Superman II is the film that really grabbed my imagination from the original motion pictures during my youth. It excited me like nothing else had before. It was the baddie film. Superbeings fighting and throwing each other through Coke signs! Despite the Lester/Donnar pollution, the film is iconic. Not least for Terrance Stamps role as General Zod and the über-sexy Sarah Douglas as Ursa.\r This retelling of the franchise, grounded in the Zod story arc is just an incredible proposition for fans like me.\r To open on the visualisation of the birth of the Man of Steel is brilliant story telling. The old story is fresh and new straight away. The film gives us enough on screen, and, coupled with 'the good jist', the story romps along without treading to closely on old worn ground and risk growing stale whilst stumbling over a back-story most of the audience will know.\r All grown up and Superman who is known, excellently, as Kal-El throughout the film, is unsure of himself, new, or initially without, good knowledge of his past he appears a vulnerable lost soul. His powers are unrealised and he simply uses his moral compass (and some good hear-say)to direct him to an answer, if there is one...and there is *thumbs up* Then gets real.\r Michael Shannon's portrayal of General Zod is nothing short of sensational. His character is not the 'Bad' guy in the usual sense of the word. He is a creation of a society who's morals are questionable 'even' by our human standards and he is driven in his beliefs and is all the more dangerous for it.\r Henry 'Kal-El' Cavill is brilliant. The character is written so well you can identify with this vision of Superman like never before. With Cavill you feel that we are all along for the same ride and we like where it is going.\r Amy Adams is perfectly cast as Lois Lane. She is a remarkable actress and this role seems naturally made for her. The relationship between Lois and Superman is fresh and uncertain. I enjoyed the story arc but missed a little chemistry between the two and the last kiss didn't impact on me and, looking back, I thought it should have. Teed up nicely for the sequel though I have no doubt.\r I did have a couple of winces and the biggie for me was the 'Jesus Christ' shot of Kal-El departing the spacecraft following a final farewell to his father, Jor-El. I am not a massive follower of every Superman comic in print. I have a collection but would not consider myself an expert. So I cannot say whether this imagery is integral for the die hard comic fans'. For me, it is not needed, the symbolism of religious connotation is obvious if you 'want' look for it, without it being rammed down our throats so crassly.\r Another stab came from the military subordinates' question regarding terraforming. In order to better explain the situation (spoonfeed the audience) a soldier/officer pipes up and asks \"What's Terraforming\". I truly believe that the majority of fans and people in general will have heard of the word terraforming and have a grasp on, essentially, what it is. A better put 'explain please' question would have been, in response to \"They're terraforming\" would be \"How are they doing it\"?\r Good eyes also, on intrepid reporter Lois Lane, to spot a shadowy figure on her digital camera preview screen!?!\r Influentially I think that Christopher Nolan was on the bus but Zach Snyder and David Goyer were definitely in the driving seat. The pace of the film is relentless, I thought that the 3rd act needed to take breath before the final showdown to prepare the audience a little more for the upcoming clash. And... What a battle. What a fight. Nothing was spared, those buildings were empty by then, smash 'em up and ..oh and *He breaks his freakin' neck* Evolution or extinction? Right there the Superman character took a massive evolutionary leap forward.\r Man of Steel is visually stunning with an incredible soundtrack. The 3D aspect is good. I thought that the effect worked best during close up shots especially between Jor-El and his wife Lara before launching the capsule. I am not a fan of the art at all so I would have preferred a 2D viewing (not possible at our local cinema) So I look forward to that fresh viewing on a beautiful Steel-book Blu-Ray with a flawless transfer...I hope.\r Leaving the cinema, I immediately wanted turn round, sit down and watch it again (Very rare since I was probably 16) and took with me the message that I got from the film and that was; We can be better. We all, really can be 'Superman' if we choose to be. And that's not bad.\r I don't often dole out top marks. Many people believe that a 10/10 or 5 Stars is not the done thing? 'No such thing as a perfect film'! But when a film comes along that has so much riding on it and is much more than the sum of it's parts and is really bloody good then really; Fair Play, Sold!\r Suffice it to say that Man of Steel is a benchmark Summer Blockbuster classic."
    },
    {
      "rating": "10",
      "text": "Very, very well made movie. Despite the last forty minutes being one straight up action scene, the first one hundred are excellent insights into Clark Kent's troubled character. Not to mention a climax that will leave you agape."
    },
    {
      "rating": "10",
      "text": "Upon hearing general zod as the main villain....I was a bit dissapointed.....but well, after seing the trailer....I guessed MoS still have hope to be decent movie....but after seeing this movie....THIS IS THE BEST SUPERMAN MOVIE YETTTTT!!!!!!! Pure Action..... I never like Superman stories being told with stupid drama and romance like Superman Returns....I don't care about those critics too"
    },
    {
      "rating": "10",
      "text": "So I finally saw this movie today and I must admit that it was really everything that I wanted in a Superman movie.  Henry Cavill was Superman, even though I really liked Brandon Routh, he just wasnt given the right medium to really fully embody the character that Cavill played in this film.\r Amy Adams was a very good Lois Lane, with her larger than life reporter.  She was given little time to grow as a character but I am sure if there is a sequel then that will give her more time to shine.\r The actor who played Zod was very good.  I mean I will always have a place in my heart of Terrence Stamp, but this new Zod was very good.\r Russel Crowe as Jor-El was very well played and not over acted at all.\r Overall this was a very interesting and refreshing new take on Superman, and I hope there is something more coming down the pipeline on this one"
    },
    {
      "rating": "10",
      "text": "Gets better each time you watch it. I understand the critics' and their need to see more character development, but with the powers that the characters possess, they needed it to be realistic, i.e., globally impacted. The sequel will redeem Zack and Henry."
    },
    {
      "rating": "9",
      "text": "MILD SPOILERS ALERT. First of all this movie was amazing. I'll keep this review short. This movie has a lot of action in it and I guess it does have too much in it but they are cool scenes. All of the acting are great. This movie has a lot of emotional depth to it, one is because of a scene involving Jonathan Kent, the other at the end of the fight with Superman and Zod. All in all great movie, one of the best movie of the year along with star trek and I am looking forward to Justice League!!"
    },
    {
      "rating": "9",
      "text": "Finally a superhero movie with superhero worthy action scenes. I felt like it was taken straight from a comic book.  The special effects are perfect and there's a great cast. I would have liked more development of superman;s character, but that is a small complaint compared to the epic fight scenes and solid storytelling. 9/10"
    },
    {
      "rating": "10",
      "text": "I went into this film with the taste of the ABYSMAL \"superman returns\" in my mind like a lingering cringe worthy memory from my teen years that I would never shake, what I got to my surprise was a movie that had NO BAD ACTING. Let me reiterate, NO... BAD...ACTING... even the criminally underused actors didn't in any point in time under or over act their roles, and this is a movie with more than enough respectable names in supporting roles. I think the best way of describing it as, would be a \"sci-fi\" superman as opposed to a \"comic book superman\" this isn't the avengers, where a city is invaded and little to no casualties occur, this is people being killed and \"the boy scout\" having to step up and make a choice between the people he longs to connect with, or humanity whom he's afraid to try to connect with. The very magnitude and serious handling of these drives make for the first recent origin movie of one of the biggest DC superheroes to be worthy of being just that, while everyone can of course respect the old romps that were the christopher reeve films, this transcends those early camp beginnings and offers up something that is truly special. The irony is that those that seem to be scoring this movie low, seem to be of the kind that would prefer another hackneyed love story with a silly bit of action a la superman returns. This is not a romantic drama fan-fic esque terribad film with cheesy acting and campy villains however.. this film is a real bona fide epic."
    },
    {
      "rating": "9",
      "text": "This movie isnt perfect but it definitely is a good start for where they want to head with this. I am happy to say that it is in the right direction.\r The ACTING was superb by everyone, just the actors on Krypton had be engaged. I like how they world builded Krypton instead of it being a boring white planet like the past movies...\r The ACTION was great but I dont understand the hate for the too much when it was Zod vs Superman; I'm sorry but if you have two or more Kryptonians fight, the environment around them id bound to get immensely destroyed.\r The STORY was a great origin story, but I can understand some people not on board with the whole flashback way but for me it workds. The way it was intertwined with present events worked well imo.\r My only complaint will have to be some of the pacing, it wasnt awful but it could be improved, there were just some parts when you are waiting for things to happen but it wasnt that bad. The pacing was just fine.\r I think the critics are wrong for comparing this to Donner bc\r1) Its a reboot,\r2)Donner didnt make Superman.\rYou should definitely walk in with an open mind forgetting Donner and instead expect a movie that goes by the comics instead of the Donner films for once."
    },
    {
      "rating": "9",
      "text": "Just pure beauty....coming from a marvel man myself. I loved how Snyder captures the connection between Clark and his earth dad...and how its over ins tornado accident...as he watched his dad needlessly die even though he could help his dad risked his life for clarks safety PURE BEAUTY"
    },
    {
      "rating": "10",
      "text": "Do not listen to the critics.. this is by far the best superman movie till date!!\rThe action is phenomenal and Henry Cavill has done an amazing job, he is Superman!\r I wasn't not a huge Superman fan to be honest but after watching this movie I am now!"
    },
    {
      "rating": "8",
      "text": "Man of Steel (2013) is a modern day take on the Superman lore, it introduces the viewers to Superman's past and his birth on Planet Krypton. The movie wastes no time and plunges the viewer into great action set pieces, while building the foundation for the movies lore.\r The characters are believable and their performances are very solid for this type of movie. The so called critics who slam the movie for not having enough humor or for over the top action or for whatever unprofessional reason are completely unfounded in their \"arguments\" and just prove how arrogant non objective they are, this is not 1970's, hero movies must retain a serious tone to be relevant nowadays.\r For the type of movie this is, it is a 8/10 any day of the week! It is by far the most ambitious take on a Superman movie, and it whole heartily succeeds.\r Go see this movie if you are a action/science fiction/superhero fan. You won't be disappointed."
    },
    {
      "rating": "10",
      "text": "I had my doubts about Man Of Steel but after watching Superman come alive and kick some serious ass, I was happily proved wrong. The film captures the humanity of Superman's search to be human even after finding out who he really is. David S. Goyer's screenplay perfectly reflects Kal-El's struggles and challenges growing up in today's world. Zack Snyder has managed to do the impossible, he has successfully made the Man Of Steel relevant and above all human. With a strong cast including Russel Crowe as Jor-El, Amy Adams as Lois Lane, and of course Henry Cavill as Superman/Clark Kent/Kal-El. Michael Shannon makes a truly menacing General Zod that you actually respect for his notions but understand his questionable motives. Overall, Man Of Steel is a pleasant surprise filled with plenty of little Easter eggs for DC fans to look out for. This is one summer blockbuster you won't want to miss, Zack Snyder has created another epic superhero masterpiece."
    },
    {
      "rating": "9",
      "text": "Acting: 7\rStory Line: 10\rPicture: 9.5\rAction: 8.2\rAverage: 9 (round off)\rMovie is worth watching. Do not listen to the critics. It is great and powerful; just how superhero movies should be made. If this turns into a full on justice league movie you will be proud to say that you followed the story from its epic beginnings."
    },
    {
      "rating": "9",
      "text": "An awesome use of special effects to create the best superman movie to date. Along with the almost never ending action the fight scenes in the film are the best I have ever seen in our cinema to date.\r 9 out of 10"
    },
    {
      "rating": "10",
      "text": "Finally a good Superman movie. Yes, it was serious, but DC's New 52 and all the Warner Premiere movies are serious. DC is serious, deal with it.\rAlso, some people complained that there was too much unbelievable action. Superman CAN punch the moon out of orbit. Even if we know that is not possible, who cares. If you want \"realistic\" watch a documentary. Superman fans want to see the Man of Steel get punched through a mountain.\rThis movie catered to the real DC fan. It is what a Superman movie should be.\rSo in brief, if you want weak, funny characters, they make Marvel movies for that.\rAnd if you think this movie was worse that Superman Returns, they make a pill for that."
    },
    {
      "rating": "10",
      "text": "This was the perfect Superman movie! I loved how Snyder captured the essence of Krypton and told the full story of how Kal-El's home planet was destroyed. I thought Russell Crowe played a perfect Zor-El as he brought substance to Kal in the times that he needed it the most. Amy Adams was a perfect Lois Lane as she embodied everything that the character needed to have including heart, a go-get am attitude and the wit to know when not to write a story about an alien living on Earth. Henry Cavill played a wonderful Superman and I would say that he brought the character to life more than Christopher Reeve did with the 1978 movie.\r Overall, people will complain about the serious tone that this movie had along with the special effects. However, I argue that this is a new telling of the Superman story and it should be taken serious. Think Batman Begins. As far as the special effects, that was one of the big reasons why I did not love the Avengers. However, this is Superman after all and he does fly so the special effects are a given. But the movie could have used less destruction of Metropolis, but I believe it made up for itself by the stellar acting of the entire crew.\r Overall, I would rank this movie as the 3rd best Superhero movie of all time. My top 5 are as follows:\r 1) The Dark Knight\r2) The Dark Knight Rises\r3) Man of Steel\r4) X-Men: First Class\r5) X-Men"
    },
    {
      "rating": "10",
      "text": "Finally Superman was given a just reboot! Henry Cavill plays the role well and is perfectly fit for the it. The screenplay was well-written, decent. Visual effects were fantastic while sound and editing were well done. The cast delivered beyond satisfactory. A motion picture-of-the-year material. Man of Steel is this decade's The Dark Knight (2008).\r movienotesbook.blogspot.com"
    },
    {
      "rating": "10",
      "text": "After watching this movie and finally watching Superman kick some ass, I have three words to describe how I feel: f*** the critics. This movie portrayed Superman as the full fledged badass he is in the comics(you know, the one that destroyed an entire solar system just by sneezing). This movie did the best job yet of showing the actual scale of Superman's strength, unlike the god awful Christopher Reeves Series and even worse, Returns. This movie deserves at LEAST a 9/10."
    },
    {
      "rating": "10",
      "text": "It's a shame people are so eager to hate in today's society. This move was a great retelling of a classic hero. Period. Haters keep on hating. I think some critics would simply prefer all movies be reality based romantic dramas, sorry for your lack of imagination."
    },
    {
      "rating": "9",
      "text": "Nolan and Synder set out to do something with this film that most fans of Superman have longed for, create a Superman that is relevant.  Man of Steel delivers on almost every level.  The vision is epic, the delivery is epic and there is action.  Tons of SUPER action.  I saw the movie in 3D...honestly, didn't improve the movie over a 2D I am quite sure.  The movie sticks to a pleasant pace with one notable scene being somewhat of a tear jerker towards the middle of the movie.  The movie delivers what most wished the previous 3 movies could have been.  Solid action, great story and visually stunning."
    },
    {
      "rating": "10",
      "text": "A WORD OF ADVICE: Don't mind what critics have said about this movie!  MAN OF STEEL is a masterpiece!  Go watch it for yourselves.  The film is worth every dollar you'll spend on movie-going.  Don't miss watching this on the big screen especially in 3D to enjoy it in its fullest glory.  Even if you have a big flat screen 3D TV, don't wait for the DVD or BluRay format in stores cuz you'll miss a great deal from the actual big screen experience.  Of course, we gotta buy our own when its out on the market cuz were going to definitely see & enjoy it again and again.  I have seen this 3 times already and, every time, it got better and better to a point of concluding that Zach Snyder is indeed a true directorial genius and the David Goyer-Christopher Nolan storytelling team-up equally outstanding in retelling the Superman canon!  Retrofitting in today's advances, the filmmakers succeeded beyond our expectations of rebooting this most loved superhero of all-time.  Without the red brief (why is it outside by the way?), Superman looks current and does not look at all like 75 years old.  We call this film \"Superman Reborn\" and aptly so.  Fresh as a morning dew, MAN OF STEEL literally saves the day and ultimately takes back his rightful place which is at the top of the heap of all superheroes.  All the actors were perfectly cast.  A very determined Henry Cavill was not \"humorless\" as he took on a more serious (not Dark Knight dark) version of the Man of Steel. The-not-too-feminine-blond-more-than-brunette Amy Adams was perfect as Lois Lane to Cavill's Clark.  She had enough held-back spunk & flirt in her reminiscent of all the other Lois-es like Margot Kidder & Teri Hatcher who truly owned the role.  It was smart of them to make this version of Lois Lane not that dumb to recognize through Superman's disguise (glasses, really?) and it was great that the filmmakers did not explore the romance between these 2 characters (there's just too much to take in) reserving it for the sequel as they focus more on Kal-El's search of being (To critics: this is the reason why Cavill's humor is held at bay. Try checking out MAN OF STEEL's commercial on Carl's Jr and Hardee's. You'll know this actor is far from being \"humorless\").  Michael Shannon exudes shades of Willem Dafoe/Joaquin Phoenix in his performance as a more likable Zod here---meaning, he is nothing short of brilliant as an actor.  His chilling delivery of \"YOU ARE NOT ALONE\" ominous message gave us goosebumps galore.  It has a spooky feel to it reminiscent of \"The Ring\".   The scene-stealer of the house was Antje Traue as Faora.  Man, that woman kicks serious ass!  And you'd think Michael Shannon's Zod's badass-ness was to the rafters---Hers skyrocketed and blew the top off!  She's undeniably the Eve to Zod's Adam, in other words, the whole thingy can't be told without her.  And then there's the 2 Robin Hoods, Russell Crowe & Kevin Costner.  It was such a treat to see these 2 great thespians in one film.  One word to describe their presence---EPIC!  Both of them brought a whole new meaning to that word.  While Russell Crowe re-introduced us the Gladiator we all loved in the introductory part of the movie, Kevin Costner gave us Field of Dreams all over again bringing (a tug in the) heart, soul and balance throughout the film.  Laurence Fishburne as Perry White was a superb choice.  He was great as a leader-of-the-pack Morpheus in the Matrix films and he was equally chief to head the Daily Planet in this one.  He truly embodied the sharp boss of Amy's Lois Lane   Unfaithful's Diane Lane is no stranger to take on the role of a mother to a child gifted with superpowers.  Remember she was the mother to Hayden Christensen in JUMPER so it's but naturally fitting for her to be cast as the \"hot version\" of Martha Kent (You know, hot dude--hot mom, makes sense right?).  Lucky Henry Cavill gets to have not just one but two hot mamas here.  Although Ayelet Zurer's appearance as Lara Lor-Van El (the real mother of Kal-El) was only brief, her steely heartbreaking performance was searing enough to last.  To sum it up, MAN OF STEEL have enough ingredient for every movie-goer to enjoy.  The action is fully packed especially in the climax part of the film.  Watching the sequences is like being in the final series of loops of a roller coaster leaving you wanting more at the end of the ride.  And what better soundtrack than Hans Zimmer's brilliant otherwordly drum-rolling score to keep the excitement going.  If John Williams made us believe a man can fly in the Donner films, Hans Zimmer made us believe Superman can soar & battle again for superhero supremacy at 75 in this Snyder extravaganza.  On my first viewing of the movie, I thought there were small lapses in the editing but concluded later on in my second and third viewing that it was artfully & thoughtfully done---more cohesive than I have originally thought.  Go watch MAN OF STEEL and see for yourselves then watch it again!"
    },
    {
      "rating": "10",
      "text": "MoS got a long round of applause after it was finished in the theater I was at and it deserved it!  This reboot gave us everything we wanted and delivered on nearly every level and in the very few areas where it didn't, I'm sure will be corrected in the 2nd installment."
    },
    {
      "rating": "10",
      "text": "Don't know how or why so many mixed reviews by critics I guess they were expecting the campy, cheesy 70's Superman? great updated story of the Man of Steel, he's young just embracing who he is and so he makes mistakes, makes some bad choices that a seasoned Superman probably doesnt make, but that to me doesnt take away from the movie it add's layers to him, I thought they had some great emotional scenes, and great action as well, I really only had one gripe but I understand it. But loved this movie right up there with The Dark Knight and Iron man 1! go see it!"
    },
    {
      "rating": "9",
      "text": "I don't know why this movie is getting such mixed critic reviews. It was amazing. Definitely the best Superman movie. It takes itself seriously. The action was awesome and the emotion the movie conveys is beautifully done. Crowe does a great job as Jor-El and so does Henry Cavill as Superman. This movie really got me pumped up for a Justice League movie and sets up for a hopefully great Superman saga."
    },
    {
      "rating": "10",
      "text": "Just came back from the movie! Just one word Amazing. Watched it in IMAX 3D it's not just the end that﻿ has action scenes. From start to end it's a bang for the Buck. It has a great story, some moments even bring tears into your eye and as for the Action is concerned it was EPIC. It was amazing to see superman in the air flying and fighting especially in IMAX 3D. Go for it. I would rate it 10/10."
    },
    {
      "rating": "10",
      "text": "Ok here goes:\r I loved this movie. This is the kind of Superman movie that has, for whatever reason, been absent from existence for far too long. You can get a Superman movie like this but you have to look in the DC Comics animated universe. You know, the ones that go straight to Blu-ray Disc. I can't believe it has taken 75 years for Superman to be seen on the big screen in this fashion. It has literally everything the giddy nerd in all of us wants to see from Superman. Intense action, glorious set-pieces, a plot that puts more than one hemisphere in danger and through it all an actor playing Superman who nails every moment he is on screen. I loved Superman Returns but this movie is such a big  you to the emo baby mama  of that movie. Gone are the days when Lois Lane is just a pretty face and villains exist to have a villain.\r No. This is the one we've all been waiting for. It's finally here.\r As an origin story, the plot is such a solid take on the sci-fi elements of the comics regarding Krypton that I had a  grin on my face basically the entire first 20 minutes. I was hoping the helpful grey levitating droid was going to be named Brainiac but it had a different name. Oh well. Not a big deal.\r The fact that Zod is given a heartbeat in this movie is one of the best decisions Goyer and Nolan made when writing this thing. There is a perfect logic behind everything Zod does and you see his point of view with each word from his mouth. He is trying to save the race of people he swore to protect from extinction. A noble cause that a society would expect from all their Generals.\r The balance that is struck between Kal's dual heritages and morality is basically the theme of the entire film. Jor-El is all about destiny and being a leader for a lesser people, while Jonathan just wants to protect his child and preaches restraint above all else. The \"first contact with an alien\" aspect is touched upon but not as much as I thought it was going to be. I guess that's my fault for reading so many interviews with creators and producers.\r All the actors nail it. Literally every one of them. I can't think of a weak spot as far as casting. Faora is ****ing BAD ASS. She kicks so much butt in this movie I'm creaming my pants right now remembering her scenes. Look for her to give you that wow factor as far as action scenes. The Kents serve their purpose with such grace, it makes me sad to say they were barely on screen. Jor-El on the other hand has a good 20-30 minutes of dialogue spread throughout the film. Add him to the bad-ass list, by the way. Scientists get combat training on Krypton, believe that. Michael ****ing Shannon. That is all. That SHOULD be all for anyone who doubts him. Amy Adams and Henry Cavill probably needed more screen time together to get a good chemistry going but this movie is not about them. This is an origin story, not the love story that I'm sure will be more fleshed out in a potential sequel.\r Hans Zimmer's score isn't as memorable as Williams' but it's about ten times more powerful and visceral. Tonally, it goes perfectly with everything that is going on on screen.\r It seems like the last third of the film being nonstop action and ultimately an entire city block of Metropolis being turned into ashes is being used as a scapegoat for critics. There more collateral damage in this movie than I've ever seen in a superhero movie. Some may find it off-putting for a Superman movie but I didn't find it jarring at all. You have to believe a city battle between Kryptonians is going to destroy a few buildings. It's either that or have a castrated final battle between Zod and Superman. No thanks. Give me MORE explosions and MORE destruction if the world is at stake.\r One final thought on Henry Cavill as Superman. As an actor, playing the role of Superman should be relatively easy on paper, but when you get down to the nitty gritty, the character is relatively complex. He has to know what to do without knowing who he is. He has to know what to say without knowing how to feel. There is a boy scout stigma attached to the character that the script lets Superman break free of, but would have been utterly pointless with the wrong person at the helm. Henry Cavill is not only the right actor for the job, he's the right face and aura. The right voice tone, the right rhythm to his speech, even the way he looks at General Swanwick at the end of the movie after he downs a drone and tells the Army basically \"I know you're spying on me, stop it\". The look is one of quiet dignity and utter confidence in what he's saying while still conveying the strength and leadership only Superman can. This is the leader of the Justice League. Routh, for all his similarity to Reeve could NEVER lead a League of superheroes.\r After seeing the film, the only thing I could think was \"I can't ****ing WAIT for MOS 2 and Justice League.\" That's a feeling most Superman fans have been waiting for for a long time."
    },
    {
      "rating": "10",
      "text": "Man of Steel is the perfect Superhero film. Do you come to watch a (SUPERHERO FILM) for Romance or drama? No, you come to see it for action and seeing your favorite Superhero fight super villains. Man of steel gives you just that and does it in epic fashion. It's not to say this movie doesn't have drama or a little bit of romance because it does, It just doesn't dwell on it.\r The movie gives you a little bit of everything, it shows you krypton, which we have never seen before. Don't listen to all the people that talk bad about it, mostly its critics. Its the best Superhero film I have seen as well as the best Superman anything that has ever been created. Superman has always had it hard when it comes to media other than comics, like video games and movies. Do yourself a favor and go see this movie, you won't regret it."
    },
    {
      "rating": "10",
      "text": "MARVELOUS OUTSTANDING\rBrilliant movie overall just don't expect Nolan's wit. The movie is just made better by the great music by Hans Zimmer\rLucky to watch it first day n first show\rGo watch it now"
    },
    {
      "rating": "10",
      "text": "This is the best movie I have ever seen. Of course there are some elements that could be perfected, such as the performance of the main actor which in the end, you realize they didn't tell you so much about him and the way he reacts to things.\rBesides that, the movie is just awesome, super fast paced, an incredible story. I just want to say that: justice has been done to the most awesome superhero of all. You get to watch him in all his glory, there are no doubts about his strength and capabilities.\rThe best movie (superhero movie, at least) that I have EVER seen."
    },
    {
      "rating": "10",
      "text": "The movie is simply AMAZING, I will never understand why critics are treating it so brutally. Since the very moment the movie begins you are caught by the depth of the characters, the way the story is told, the story itself; the acting is superb and every single actor adds something special to their portrayals. For the first time after Christopher Reeves we have a lovable and believable Clark Kent/Superman. The action scenes in this movie are something you have never seen before in any other superhero movie. And for the first time in 75 years the infamous question of why Lois Lane does not realise that Superman is Clark Kent wearing glasses IS SOLVED: Lois Lane is not \"stupid\" anymore!!\r Again, do not pay attention to the critics. I really do not know if it is about trying to badmouth of every Zack Snyder project or just haters gonna hate."
    }
  ]
}