{
  "id": 2872,
  "title": "Manchester by the Sea",
  "starring": [
    "Casey Affleck",
    "Lucas Hedges"
  ],
  "runtime": 138,
  "genre": [
    "Drama"
  ],
  "description": "After his older brother passes away, Lee Chandler is forced to return home to care for his 16-year-old nephew. There he is compelled to deal with a tragic past that separated him from his family and the community where he was born and raised.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/e8daDzP0vFOnGyKmve95Yv0D0io.jpg",
  "categories": {
    "plot": 6.224489795918367,
    "acting": 6.683333333333334,
    "ending": 4.833333333333333,
    "soundtrack": 2.6666666666666665,
    "cinematography": 6.6,
    "familyFriendly": 3.0,
    "funny": 5.833333333333333,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I left this movie wanting to find an Oscar to immediately hand over to Casey Affleck. His restrained but deeply moving performance has easily been one of my favorites of the year. The movie is filled with impressive acting from everyone involved, but I feel like so much of it hinges on his ability to make his character's quietest and stillest moments say so much.The movie is a powerful exploration of grief that works so well because it remembers that people don't stop making sarcastic comments and stupid jokes when things are awful. It's the humor that makes the sadness more genuine and affecting, because the characters feel more human and real.It's one of my favorite films of the year."
    },
    {
      "rating": "9",
      "text": "Worth seeing twice, in my opinion. I left the theater feeling a bit underwhelmed after first seeing it, but I went back the next night and felt I better understood why it garnered such overwhelming praise. Affleck's performance is truly remarkable; again, I couldn't appreciate it as much the first time I saw it, but after developing a better understanding of the character (don't want to reveal anything), I appreciated how challenging of a performance it was for Casey. The film is raw and visceral, and really offers an interesting perspective on the grieving process and the effects it can have on a person."
    },
    {
      "rating": "10",
      "text": "Film is INCREDIBLE!!! Casey Affleck and Michelle Williams are heartbreakingly moving and stunning! Gonna be a long but fruitful awards season I think for them!! Whole cast and overall picture are a MUST SEE!"
    },
    {
      "rating": "8",
      "text": "Manchester by  Z's seems like an appropriate name for this film. I understand how well this was filmed. The acting was brilliant, as a character Lee Chandler neither neither hatable nor likable. He's damaged and broken and the film does a great job of contrasting the changes which have come about in his life. The dialogue is interesting as well, the characters have interesting lines and they move the film along interestingly.However, the movie is one in which very bad things happen to people and are accentuated by smaller bad things happening to them. Intellectually I understand this is a great movie. The book is about a group of aimless characters who drift through life, drift through the movie and then drift out. They have no purpose just like this movie. I know you are probably reading this and wondering \"Why is he giving this an eight if he doesn't have anything good to say about it?\" Well objectively speaking I believe there are many elements which go into making a film really good : acting, directing, sound, plot. From a technical and objective perspective this movie is excellent. It is an extremely well made, well acted and technically well done film. However, i never really felt invested in the movie. I didn't want the movie to end up being some hackneyed film where the character finds redemption, find a new love in his old city, and moves forward in some way. But at the same time I wish there was more to it."
    },
    {
      "rating": "9",
      "text": "Affleck has done the impossible - dramatized an interior pain in a consistently affecting manner.  Women usually get the roles for articulating unbridled expression regarding loss, divorce, etc.  That's not the way this man suffers.  Affleck deserves every accolade.  The film is not for those who need a car chase, but it's a a human story, wonderfully written and rendered.  Michele Williams didn't have as much to do, as she was less 'written.'  Affleck's nephew in the film is utterly superb as well."
    },
    {
      "rating": "9",
      "text": "The story-telling is good with flashbacks that give you insights on Lee's life. The film is both funny and heartbreaking. You smile in a scene and get a soulcrushing revelation in the next. Because they, as i said, give you an insight on the main character story as the film goes on. The Acting by Casey Affleck is very very good. He deserved the Oscar. Is a bittersweet masterpiece on the theme of loss and guilt. One of the best films of 2016."
    },
    {
      "rating": "7",
      "text": "Manchester by the Sea is a very touching human drama, marked by loyalty to reality. Evaluates mourning from three points of view, how each one faces it, the relationships that are forced to come up and how some things make sense, so you can learn from them and grow; but others don’t make sense and will stay forever with you as a burden. First we have Lee Chandler, hunted by a past to be revealed, not eager for human contact and that lost interest in life, practically an automaton. Second is his nephew Patrick, going through adolescence, very closed to himself, shielding in girlfriends, friends, a band, the town, in order to escape from the true. Third we see protagonist’s ex-wife Randi confused by mixing past and present due to recent events that rise repressed feelings buried down below. Those three performances are amazing, Casey Affleck is carries out the movie, Lucas Hedge surprised me a lot and Michelle Williams is heartbreaking. The direction and screenplay are strong, without fear of showing the real world. And those violin solos create a unique soundtrack."
    },
    {
      "rating": "6",
      "text": "I am not sure what to think about this movie. The acting is generally very good. Michelle Williams sticks out as the real star although Casey Affleck seems to be getting all the hype. Affleck is a great fit for the role. However, he plays the exact same role he plays in all of his movies which makes me wonder about his actual acting capabilities. It's perfect for this movie though. I am concerned that Casey Affleck is like Klaus Kinski or Woody Allen who only can play themselves.The movie is well shot and has a profound story that's well written. The movie would have been better if it had taken itself a little bit less serious and been sped up a little bit at times, especially in the first half."
    },
    {
      "rating": "10",
      "text": "I don't think I've ever seen a film nearly as 'human' as this. Every single performance in this movie is astounding, nothing comes across fake, or even acted. Such a fantastic movie, it is a damned shame this movie is not a wide release. If you have the chance to see this movie, do."
    },
    {
      "rating": "6",
      "text": "This is a movie about a man with a volatile temper who is haunted by his past (we find out why towards the end of the movie).  Since the main character and the teenaged nephew who has the main secondary role are not immediately sympathetic characters, the film needs to keep the filmgoers interested with the plot and the personal growth of the characters.  Unfortunately, Casey Affleck never really experiences any personal growth, and ends the film the same as he started.  Matthew Broderick is totally wasted in a cameo role.  The scenery is beautiful, but the film is way too slow moving."
    },
    {
      "rating": "10",
      "text": "mindblowing. Lonergan's amazing writing is paired with astounding performances from the actors. Definitely gonna be remembered for many years to come."
    },
    {
      "rating": "9",
      "text": "Casey Affleck isn't like his brother Ben Affleck because he is still a rising star. This film deserved to win picture of the year at the Golden Globe Awards. I think that this film has the potential of winning at least one oscar scene it has been nomanated for six."
    },
    {
      "rating": "4",
      "text": "\"Manchester by the Sea\" asks how do you survive an unimaginable tragedy?? People handle it in different ways and Lee (Casey Affleck) becomes a totally cold, uncaring person who cuts himself off from all those he loves, leaves his hometown, gets a job as a janitor in Boston, drinks a lot of beer and has fights in bars.The first hour of the film deals with Lee before and after the tragedy, how he was a happy man, father, husband, brother and friend before he became the loner he is now. After his brother, Joe, (Kyle Chandler) dies, he comes home to find out that Joe has appointed Lee the guardian of his 16 year old nephew Patrick (Lucas Hedges) who in many ways is a typical teenager but is acting out upon the death of his father. At this point the director/screenwriter, Kenneth Lonergan, tells us what the tragedy was and it is almost to painful for the audience to hear and watch. For the next hour and 17 minutes we see how uncle and nephew interact and deal with life, Patrick with humor and sarcasm, Lee without emotions and staying as uninvolved as he can stay. We meet Patrick's mother Elise (Gretchen Mol) who has been out of his life for years, her new husband Jefferey (Matthew Broderick) Lee's ex-business partner and friend George (C. J. Wilson) but most important of all Lee's ex-wife, Randi (Michelle Williams).While Affleck is getting all the attention in the reviews I was more impressed with 20 year old Lucas Hedges as the 16 year old who can break your heart and a second later having you laugh. Affleck does a strong job especially since most of his scenes have to be done in a monotone, showing no emotion and fighting the pull his nephew on has him as a human being.Michelle Williams has a very emotional scene, lasting about 5 minutes, with Casey Affleck but as easily as I am moved in a movie's emotionally scenes, this didn't move me.Gretchen Mol is wasted and Matthew Broderick has a very thankless part. The rest of the supporting players including  Patrick's main girlfriend played by Anna Baryshnikov are all above par.I love heavy, family, movie dramas but the bottom line is that \"Manchester by the Sea\" is way too long by 15-20 minutes which doesn't make for very much tension and though the scenery of Manchester by the Sea is excellent in all the seasons and there is no fault with the acting I don't recommend it.Oh, yes, a very distracting soundtrack that more than once takes you out of the story."
    },
    {
      "rating": "2",
      "text": "Sir Alfred Hitchcock once said, \"I don't make slices of life pictures.  I prefer slices of cake.\"  This is a prime example of why he expressed that sentiment and why he was the Master, and why so many are students of his to this day.  The filmmakers of this little indie slice of life film are not.  Not that there is anything wrong with that, but it is naive not to realize the tenants of suspense apply to all stories and genres, that any good movie needs some form of imagination.The writer/director here is trying to pass off a lazy, half baked, self indulgent, contrived excuse for a movie that is very slow, dreadfully boring, poorly edited (in the sense of economy of running time), and unevenly acted (at times it's naturalistic and real, while at others it's painfully forced and phony, with Casey Affleck delivering a suitably competent performance but certainly not outstanding by any sane measure)... and the critics just ate it up!  They swallowed the pretentious void of story craft and lack of dynamics hook, line and sinker, as the herd on the scent of pretentious art films does, so often mistaking the pretense of art for actual accomplished audience pleasing work, or even difficult opaque but still highly worthy endeavors that require work on the audience's part.  This thing is neither.  Moviemakers should always work for the audience, not the other way around.  That means even with difficult, challenging or disturbing material the work of story craft in a narrative must be done before it's given to the audience.  To just throw up on screen some ramblings and musings (no matter how tragic or melancholic) that a screenwriter jacked off on the page and called it a day is no excuse for the lack of quality entertainment or \"art\" in any genuine sense of the word when it comes to the cinema.Of course The Academy flock will also delight full course on this unpalatable slice of s--- too.  Meanwhile we, those in and who work for the audience, shake our heads in disgust at the obscene deranged over-praise."
    },
    {
      "rating": "1",
      "text": "Nope. Not sure why this even made it into the nominations. This is a slow drag with one good scene. I'm sure there's some super intellectual reason why I'm wrong, but it doesn't change the fact that I was bored and disconnected from this movie."
    },
    {
      "rating": "8",
      "text": "Manchester by the Sea is objectively one of the best Oscar bait movies I have seen. The acting is grounded and always character consistent. The character consistency is the key to the overall film’s success. Kenneth Lonergan’s directorial accomplishment is utilized to anchor moments that might otherwise be drama cliche. The character consistency would, of course, be an even more impossible task without an excellent cast. Casey Affleck will undoubtedly get the quarterback like attention at the Oscars. What that comment means is I failed to see a single bad performance from the rest of the cast. For narrative, the contemplative structure allows the viewer a chance of gaining character insight without letting moments explicitly define the players. A tragic event will occur and a given scene only allows a character minor fallout before a transition in time. The cinematography is fine with an excellent focus on the little quirks one might find in a small New England town. In addition, the blend of cinematography and location lends to the rare cinematic experience of a story feeling like it came from a genuine place. Manchester is an uncomfortable film when it comes to dishing out any form of conclusion. The result is a narrative more in line with postmodern sensibilities. The ending can easily be dismissed as a typical indie climax. However, the conclusion is anything but a simple artistic gimmick. Seeing the ending as a gimmick robs rewarding the narrative of its logical continuation. In fact, I daresay Manchester by the Sea contains one of the year's best movie endings. To summarize, the butterfly-like effect of grief is the central theme I pinned down. The question, \"Do I deserve forgiveness?\" is also asked. I can’t say I admired the film as much on a personal level. The film contained a lot of scenes which were a little long for my taste. Additionally, the movie works better as an example of fine filmmaking over anything I can take with me in life. Many people will see the film as a relatable experience but nothing more. I am curious as to how long the movie will stay in the minds of the average viewer. Definitely, see the film for its cinematic accomplishments."
    },
    {
      "rating": "10",
      "text": "Critics love this movie, and I expected something good.But I was not ready for this. The film surpassed all my expectations.Directing, acting, cinematography, script, attention to details. Superb!In my opinion, this movie is by far the best this year.I hope it will win Oscar in February.Directed by Kenneth Lonergan.Main character Lee Chandler played by Casey Affleck.Another stellar performance is of his ex-wife Randi played by Michelle Williams."
    },
    {
      "rating": "7",
      "text": "A moderately entertaining character study with relatively profound explorations of issues like redemption, forgiveness and understanding one's limitations. But it's also often an exercise in taking itself way too seriously, with more than a few pregnant pauses, lingering shots of mugging emoting and throwaway slice-of-life sequences. Casey Affleck and Lucas Hedges turn in capable but overrated performances, though Michelle Williams steals the show with what should be an Oscar-winning supporting portrayal. Enjoy this one, but don't get taken in by the hype."
    },
    {
      "rating": "10",
      "text": "I have never cried and laughed at the same time in a film, however, there is a first time for everything. Kenneth Lonergan's Manchester by the Sea is easily the best film this year. I guess I should start with the acting, which is also the best this year. Casey Affleck shines in his role as Lee, a grieving uncle/brother with a dark past. I am not one who can see the future but I can easily say that Affleck will be getting a best actor nomination if not win best actor. Among the other future nominees, Lucas Hedges is a welcome surprise in his role as Patrick, Lee's nephew. Finally, Michelle Williams will probably be getting a best supporting actress nomination in her role as Randie. The acting in this film is impeccable and it definitely helps it destroy you emotionally. Another stand out is the writing, people are probably saying that this is the saddest film this year but they forget the fact that the film has a lot of humor. The humor is very unique in that its a stinging humor, every joke has an insult behind it (which is great). The direction and the cinematography is amazing and really adds to the amazing sense of place that this film has. You can really tell where you are (I don't really know how to explain it but it's good). Overall, this film is unlike many that are made these days. It doesn't spoon feed you exposition, it lets you come to conclusions on your own and it is very rewarding. Also, the film doesn't have a linear storyline yet it all makes sense. And like life, it doesn't have some perfect ending where everyone's happy, it is real and it feels as such. In closing, it would be a disservice to oneself not to see this movie because it is unequivocally the best film this year."
    },
    {
      "rating": "7",
      "text": "I was really looking forward to this movie because of the hype. Well acted.  Well photographed. And interesting story.  But it wasn't entertaining for me.  I really didn't feel the emotion or the empathy.  Not sure why not.  It lacked something."
    },
    {
      "rating": "6",
      "text": "Good movie but wouldn't say it's oscar worthy. Casey always puts on great performances. Story is slow paced alot of times it seems like thier is nothing going on. Horrific background interwoven into the story and Michelle Williams is great as she always is. The guy that played Casey nephew got a lot of praise but i think he just did a passable job. Overall the movie is watchable but don't expect anything ground breaking or anything that will suck you into the movie."
    },
    {
      "rating": "8",
      "text": "First of all i LOVED the pictures in this movie.I just couldnt turn my eyes away for a minute. And then well Casey Affleck . Outstanding perfomance. On the one hand the old happy guy and then now one of the most depressed heroes of the last years so amazingly performed. Even his eyes and his silence was hurting,mourning. Just thank you and bravo."
    },
    {
      "rating": "10",
      "text": "This is a work of art. Simple yet complex. The directing and the writing by Kenneth Lonergan manages to be really elegant and told in a very subtle way."
    },
    {
      "rating": "9",
      "text": "A man and a boy, one an uncle, one a nephew, are engaged in an intimate fishing lesson off the lake on Manchester, Connecticut. This melodic view takes us from here through the uncle’s cold spiritual journey of knowing his place amidst the chaos of death.Manchester by the Sea is written and directed by Kenneth Lonergan (Gangs of New York), whose hard work shows in how deep he is willing to dive into the darkest corners of everyone we meet throughout his record of memories. The lonely, depressed, recently divorced plumber we are invited to connect with has a lot coming at him; having lost his brother to cardiac arrest, and now left to be the only one left to take in custody of his now fatherless nephew.​From watching the heartbreaking flashbacks that depict the uncertainty of the plumber’s path, to the humbling, somber performance by Casey Affleck (no tears necessary), all audiences suited for the well-earned R-rating will be greatly moved by its rough depiction of an everyday story within an everyday life.What makes the chilling power of this deceptively simple story so powerful is the consistently cold feel that Lonergan maintains from start to finish. Being set in the northeast, snow appears all over to reflect the plumber’s state of mind, and the cold is felt all the greater depending on the amount of stress tugging between him and his blood relatives. The screen’s empty starkness takes its time to linger on the quietest of moments, screaming the loudest of internal noises without saying a word.Manchester by the Sea could have easily taken place anywhere in the world, not necessarily in one particular small town in one particular part of the nation. What makes the Boston-Manchester setting work to its advantage is its subtle handling of the culture, right down to the look, feel, and taste of the area. The much-needed emphasis on father and son bonding through the quietness of fishing bookends the film with the one single image that defines everything valued by the people who live there. Also similar to last year’s big Oscar-winner Spotlight, there is a clear presence of Catholicism guiding the lives of all Bostonians, whether or not they consider themselves religious. They claim that all Catholics are Christian, which is not believed to be entirely true by everyone, nor is it said so in the feature, but it works to the advantage of making the sense of hope they seek after touch much closer to home.There are plenty of independent features out there that tackle the discomforting subject of family death and custody, but none of them handle it with the same level of detail, humanity, and personal application as Manchester by the Sea. It’s not the feel-good holiday treat you may be looking for this time of year, but considering how family and tragedy essentially go hand-in-hand, Lonergan’s scholarly study on the personal crisis will help countless others in what to do about a similar trauma.Hence, I encourage all to see this masterful, humbling work when they get the chance to, but not just with anyone, with the relatives they are the closest to. That way, you can walk out of the theater together sharing the tears of your worst and best memories. If more movies had the power to do that, then Hollywood would at last be restored to its former glory."
    },
    {
      "rating": "10",
      "text": "Wait to see this film until you know you have nothing to do and nowhere to be afterwards, particularly if you've ever lost someone close.  An eloquent and profound observation of loss, love and life itself -- powerful in all the ways only intimate cinema can be.  Stunning work from all involved."
    },
    {
      "rating": "3",
      "text": "i don't care how great the acting is in this movie, it was not entertaining for me and I found it to be just dark, dreary and depressing.  If I had a dollar for each time we were in a car, the movie would have more than paid for itself.  If you are looking to be entertained, this is not the movie for you.  The story is depressing and Casey Affleck's character is depressed.  There is no humor at all in any scene.  Awful!"
    },
    {
      "rating": "0",
      "text": "This movie was a waste of two hours with good acting.  No real plot line, just two hours of footage of some dude.  Utterly terrible movie, truly stunned it has such good reviews."
    },
    {
      "rating": "0",
      "text": "This has to be the most overrated movie of all time.  I'm not opposed to a slower movie, I have the patience.  But this movie was so boring. Absolutely nothing happens.  I am stunned that it has this high of ratings."
    },
    {
      "rating": "0",
      "text": "depressing, disjointed, and EXTREMELY disappointing!  Don't waste your time on this pathetic, aweful movie."
    },
    {
      "rating": "0",
      "text": "This is the one that made me realize I should ignore the critics. As for the movie, when life is that bad - you get help. You have to get help or something really bad will happen. Shame on the critics - I think it is called Schadenfreude - disgusting"
    },
    {
      "rating": "0",
      "text": "If you love \"feel good\" movies, you might want to skip this one. There is no resolve or happy ending. This is the real, raw, and brutal reality of life after horrendous tragedy. Kenneth Longergan, the director and screenwriter, brilliantly articulates the void of life after insufferable and incurable tragedy. It may have been a crowd pleasure to write an ending where his nephew brings back the spark of life, but I found it more authentic to end it the way that Kenneth did. Casey Affleck's character, Lee, mentally imprisons himself for his past mistakes since the law will not do it for him. He deprives himself of every form of human connection or indulgence; going through the motions of life without fully living. This is a story of tragedy without healing. Casey Affleck's incredible ability to convey the long drawn affects of grief is Oscar worthy."
    },
    {
      "rating": "0",
      "text": "One of the worst movies ever made--boring, stupid, and flatline plot.  Who cares about any of these characters?  Dull, insipid, tired of limited vocabulary with f---.  don't waste time or money on this."
    },
    {
      "rating": "6",
      "text": "A 6 or 7 out of 10 at most.  A bunch of lame writing (Affleck has to rush back to Boston to his janitor's job rather than stay and raise his nephew) coupled with Affleck's emotionally flat performance makes for a ho hum movie experience.  Won the audience choice award at the film festival I was at where I had seen several films at just that festival that were much better.  Baffled at the ratings.  Just NOT that good."
    },
    {
      "rating": "2",
      "text": "It's a mystery what all of the hype is about... Excruciatingly slow, bleak, boring characters and landscapes and about 45 mins. too long. If you enjoy watching someone take leftover pizza out of a fridge, put it in the microwave and watch it slowly turn, you might like this movie (this was an actual scene in the film - about 1-2 mins. long)."
    },
    {
      "rating": "3",
      "text": "One of my biggest issues of a very dominant trend in both filmmaking and TV shows in the past few years is the overbearing strive and subsequent critical acclaim for material that is heavily realistic, presents \"complex and flawed\" characters, but there is a complete lack of central morality or moral lens for the viewer. If anything about good and evil, right or wrong, morality in general is touched upon, it is strictly restrained to moral relativism, where it's always \"up to the viewer\" to form their own feelings, the filmmaker tries not to offer the slightest clue about his or her stance on the issues. Pretty much every last \"critically acclaimed\" TV show these days falls under this category, and a plethora of movies, Manchester by the Sea being the most recent example of the ones I have seen, though it's really not about one or two examples.The issue I have with this \"non judgmental\" trend is that I firmly believe art, truly great art, should in some shape or form benefit society, not simply present it \"as is.\" When society celebrates stories of moral relativism, it adopts moral relativism. Things that were, and for good reason, seen as clearly wrong, suddenly become \"complex,\" up for personal interpretation, depending on \"circumstance.\" And if challenged, the excuse is always \"oh I'm not endorsing this, I'm just portraying real life without judging. This is what people do.\"But when art abandons teaching moral messages, that contributes to society becoming morally anchorless and losing its scope of what's right or wrong. No, this definitely is not an argument about \"violent movies influence violence in real life\" or anything of the sort - it's not about what is portrayed, but how it is portrayed. And morality seems to have been sacrificed by many filmmakers on the altar of realism, with both public and critical acclaim embracing this with both arms."
    },
    {
      "rating": "1",
      "text": "A very depressing movie.You are pounded with F BOMBS throughout the movie.Tries to manipulate you into accepting what you see is normal.I can't think of anything positive."
    },
    {
      "rating": "10",
      "text": "This was one of the most honest, compelling, and beautiful movies that I have seen in all of 2016. Kenneth Lonergan has truly written and directed a masterpiece that will be admired for decades to come. Casey Affleck and Michelle Williams really shine, but every single performance is spectacular. Every single actor completely transforms, and the honesty of this story left me feeling both full and hollow when I left the theater. This movie changed how I view grief, mourning, and masculinity. If you can only see one movie this 2016 Oscar season, make it Manchester by the Sea. This movie changes the game."
    },
    {
      "rating": "0",
      "text": "This is one of the most depressing movies I've ever watched.  Well acted, but very, very, very slow, and dark and the opposite of uplifting.  It's a feel sad movie.  The emotional torture of dealing with horrible life tragedy is well represented, but watching it for two and a half hours is not fun, nor particularly illuminating."
    },
    {
      "rating": "0",
      "text": "A very depressing movie, not for me. Good acting but I go to the movies to end up feeling good and this  movie had the opposite effect on me. The young actors were very good."
    },
    {
      "rating": "3",
      "text": "If you are looking to be entertained, stay as far away from this movie as you can. It is well-acted and directed but it is a bleak, depressing slice of life. I wish someone had clued me in beforehand as had I known, I would happily have given it a miss."
    },
    {
      "rating": "6",
      "text": "This is an extremely dark movie.  Critics love it because it doesn’t go for the happy ending.  Casey Affleck will likely win an Oscar for Best Actor.   Affleck plays an average lower-middle working-class guy living in a small coastal fishing town.  Michelle Williams (who is probably too pretty to be believable for the part) plays his wife, and they have three young kids.  Affleck is a happy guy with zero aspirations in life and spends his free time boating, drinking with his buddies and dabbling in recreational drugs.  The movie would have you believe that many people live this kind of life, and that most can get away with living a sloppy and ambitionless life without consequences but, in the dice game of life, Affleck takes a stupid gamble and rolls snake eyes.  He becomes a haunted and angry individual who moves to Boston and ekes out a living as a janitor.  Several years later, his older brother dies and names Affleck the guardian of his high-school age son.  This could have been a movie about redemption.  (It’s the obvious ending choice, and you will find yourself hoping for it, rooting for it.)  Instead, you get a cautionary tale about broken people. Those who like this movie use a lot of adjectives to describe it like: \"heartbreaking, genuine and powerful.\"  It is all those things but, it’s also a movie without hope. The ending is sudden and abrupt like a cold slap in the face, a lump of coal in your Christmas stocking, or discovering the Grinch in your living room instead of Santa Claus. If you're looking for holiday cheer, you might want to go see something else."
    },
    {
      "rating": "4",
      "text": "I walked into this movie with all the hype in the back of my mind and no idea what the story was. I loved the cinematography - the acting was extraordinary but I found the storyline over the top and kind of overblown melodrama. what brought him to get so drunk? how did he survive the unsurvivable? I felt like they just kept adding reasons to not like Lee (Casey Affleck) while feeling sympathetic to the two ex-wives. I feel like they just wanted to create a Job-like character when in fact he is more of a self-destructive character. What brought him to drink and do drugs? Also - although I love the music overall - the placement of the sound on one speaker over whelmed the dialog and the emotions of the scenes. Anyway - great job by the actors - not so thrilled with the director or the writer's job. Sorry - I left the theater feeling as if I was taken advantaged of."
    },
    {
      "rating": "1",
      "text": "I can't believe viewers rated this movie highly. Although decently acted with adequate cinematography, the story was unredeeming about a man who experienced a significant tragedy but who is given a chance to turn his life around by his older brother who makes him guardian to his son. The main character is inadequate in dealing with his loss and his opportunity and fails to honor his deceased brother's wishes. We are all familiar with people who are overwhelmed by life's circumstances. We go to the movies to see shining examples of people who surmount these challenges and point the way turning things around. This movie failed."
    },
    {
      "rating": "0",
      "text": "The film is pathetic. Dragging on, pretending to portray real feelings, this film is neither real nor (good) fiction. It is sentimentality on its lowest level with no real educational sense either. As far as the script, in one instant, the creators didn't know how to get out of the drag, so they just turned the page, changed the music to a happy sound, just to fall right back into near senseless depression, and end the film on meaningless nothingness. How can other film critics not see the worthlessness of this 2.5 hour-waste-of-time? Perhaps, they are afraid not to get free tickets next time around."
    },
    {
      "rating": "3",
      "text": "I so wanted to like this. There is much to like about the story but the editing combined with the director falling in love with the screenplay he wrote, turned it into a cliche of an art film. It is not Gome Baby Gone that Afleck did so well. Definitely watch it, but on cable. It was so excrutiating at times, I so wanted to fast forward. Keeping the camera rolling while nothing happens does not make it deep, it just makes it indulgent. Every scene Michelle Williams is in is incredible. Would she deserve a nomination... YES."
    },
    {
      "rating": "0",
      "text": "Beyond salvation.  Horrible, dreadful movie.  Makes me want to cancel Amazon and Redbox.  Depressing, and it never got better.  We kept thinking that perhaps the next scene would rescue the movie.  But alas, this was one of the worst movies we have ever seen."
    },
    {
      "rating": "1",
      "text": "Dull boring, the tragedy is used to try to give the movie something interesting but it is stupid and unlikely. Affleck acts like himself. Why make a movie like this? Critics are dopes."
    },
    {
      "rating": "0",
      "text": "Manchester By The Sea doesn't go anywhere.  I kept waiting for something profound to happen but it never did.  The movie is boring and I can't figure out why it won awards..... Two thumbs Down... Booo"
    },
    {
      "rating": "9",
      "text": "I think some people didn't like this film because of \"silence\" and I usually am one of those people (for example, True Detective season 2). But, here it adds to the film somehow. The film rarely deals with the normal confrontational way drama is presented. We often see the in between moments of the events, or the aftermath - and when paired with excellent acting this made it seem more genuine. There was something about the way it was written and the screenplay, that make the characters more real than those in most other films I've seen."
    },
    {
      "rating": "10",
      "text": "Silence is often the most deafening sound.  A loss can trigger the strongest of emotions.  And there is nothing louder in this film than the quiet performances of its leads and virtually say everything especially in moments when no words are exchanged.  I watched this one as part of the London Film Festival 2016 and it blew me away for its equal measures of heart, houmor, love, despair and humanity.  The casting is superb and deserve to scoop up the awards of the year in a story which even though one can guess from the start what is in its nucleus, we sit and admire the masterful director peel it off to gradually reveal an even richer and more layered core."
    }
  ]
}