{
  "id": 3632,
  "title": "Mandy",
  "starring": [
    "Nicolas Cage",
    "Andrea Riseborough"
  ],
  "runtime": 122,
  "genre": [
    "Horror",
    "Action",
    "Thriller",
    "Fantasy"
  ],
  "description": "The Shadow Mountains, 1983. Red and Mandy lead a loving and peaceful existence; but when their pine-scented haven is savagely destroyed, Red is catapulted into a phantasmagoric journey filled with bloody vengeance and laced with fire.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/m0yf7J7HsKeK6E81SMRcX8vx6mH.jpg",
  "categories": {
    "plot": 7.944444444444445,
    "acting": 7.886363636363637,
    "ending": 7.666666666666667,
    "soundtrack": 8.11111111111111,
    "cinematography": 7.7,
    "familyFriendly": 3.0,
    "funny": 7.428571428571429,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Mandy is a strange film. It has a lot of qualities. It is an horror movie with a Gothic style to it. It reminded me of the first Hell Raiser. The filming has a psychedelic style. The acting is pretty solid, including Cage. It's violent and one monologue could have been better. I give it a 78%. Crazy film and very hard to define, and because of that, pretty unique."
    },
    {
      "rating": "7",
      "text": "To be honest I really didn’t understand the story or motivations of the characters. Did it matter, no. The cheer love of all things 70’s and 80’s, the style, vibe, music and visuals made up for it. It’s more an experience than a solid movie in that sense. Is it a good movie? Not really. But who doesn’t geek out of seeing a dual chainsaw fight with Nic Cage?  It is inspired filmmaking that makes this movie worth seeing. Next time I hope a better script is involved."
    },
    {
      "rating": "7",
      "text": "This movie is so spaced out in a good way. The use of lightning and colours is breathtaking. Cage does a great job and the baddies also. Really liked the Hellraiser / gimps.But in the end it just becomes af silly pastiche ala Evil Dead."
    },
    {
      "rating": "5",
      "text": "A little too long but so striking that you can not but surrender and see the whole thing even if in some parts you do not pay that attention to it."
    },
    {
      "rating": "9",
      "text": "I'm truly surprised by how touching this movie was.  Considering Cage's appearance I was prepared for an over-the-top horror-comedy.  Imagine, then, my surprise when I realized Cage is the most grounded element in this story!  Sure, it's still over-the-top and drug-fueled, but I still connected to the character's emotional journey.  And from a visual standpoint, the movie is just fun to watch, never boring.  If you're in the mood for something weird and trippy, give it a chance."
    },
    {
      "rating": "9",
      "text": "A movie of substance. It's a simple plot of revenge but takes a surprising amount of time to establish the revenge story. And my my the what a way to do it. Amazing use of the colour pallete as every other critic has pointed out. But what also drew my attention was the camera movement and the editimg.  This movie has a lot of style in it about how it's approach to an age old revenge story"
    },
    {
      "rating": "9",
      "text": "\"A primal, psychedelic rage-scream of a movie.\" - Slash FilmYeah that sums this movie up perfectly."
    },
    {
      "rating": "7",
      "text": "The one of nice movie for the evening. This is impressive sound, excellent color gamma for drug trips and elegant picture in many times. But it has a bad side in many things - it dependents from an your expected experience.However, the Cage's smile is perfect looking in the end of movie"
    },
    {
      "rating": "8",
      "text": "Nicolas Cage and Mandy works very well, because both Mandy and Cage's acting style is completely over the top. The movie is unapologetic about it's completely unhinged approach which works well with the movie's overall theme and makes for a very stylish and entertaining movie."
    },
    {
      "rating": "9",
      "text": "Nicolas Cage is an international treasure. Movies where Nic Cage is able to flex his acting muscles and prove to doubters he is actually talented are always films worth watching. Mandy is one of those movies. About a lumberjack named Red (Cage), who exacts revenge on an evil cult called “The Children of the New Dawn” when they kidnap and murder Red’s girlfriend, Mandy, with the help of a demonic biker gang called \"The Black Skulls”. The world-building in this psychedelic horrifying trip of a flick is fantastic, but by far the movie’s outstanding highlight is its mind-blowing, next-level cinematography."
    },
    {
      "rating": "8",
      "text": "This was the best theater experience i may have ever had. The movie may be slow at first, the music and incredibly interesting visuals keep you interested. Once the movie really begins it is so brutal and fun to watch. The chainsaw scene and the basement scene were so amazing!Nicolas Cage was perfect for this role."
    },
    {
      "rating": "8",
      "text": "TRIPPY, GROTESQUE, EPIC, DEVILISH, and BEAUTIFUL. Mandy is one hell of a movie!Ingenious use of foreshadowing, and unique, yet excessive use of symbolism. Garish portraits, and frames dipped in eye-blindingly bright neon colors. Unearthly metallic score by the late Jóhann Jóhannsson. Mandy is a wild poem with a straightforward revenge story represented through hellish art.Every single actor/actress is flawless, most notably Nic \"Rage\". Andrea Riseborough's performance as the titular character is fantastic. Linus Roache, however, isn't flawless; because his freakishly incomparable performance surpasses this word. I can't imagine any actor who could give such an unnerving performance as the maniac cult leader, Jeremiah. Let alone his peerless bygone look. This is really one of the most perfect villain castings ever!Besides some ostentatious and unnecessary use of symbolism. I think the setup is overlong, and there is an inconsistency in the rhythm of the movie; especially, and strangely, at its wildest moments that caused some monotony. Other than that, I have nothing else against it. Also, the vivid and bizarre visual experience is more than enough to keep me quite engaged. The Clockwork Orange fan, Panos Cosmatos is going to be one of the greatest, and most idiosyncratic directors.(8.5/10)"
    },
    {
      "rating": "8",
      "text": "\"Mandy\" isn't afraid to stick to its own remarkable visual palate and its own spectacular story. This movie takes its time, but after the midpoint, it flies completely into a rampaged showstopper on an epic scale, putting you in the headspace of somebody who had a normal life, and then large rage-filled aftermath. The visuals are very unique, and it adds a level of intensity to the spirituality tone of the antagonist."
    },
    {
      "rating": "10",
      "text": "Mandy utilizes the power of cinema to its fullest extent. I felt transported into another world the moment I heard that King Crimson song. It's made with immense talent, style and passion and I can't ask anything more from a film. To me Mandy is flawless."
    },
    {
      "rating": "4",
      "text": "I really wanted to love this movie.  The tone kind of jumps around and the beginning of the movie seems as though the director assumed people would go into it high.  There were a lot of psychedelic colors and effects early on.  The movie mellows out as it goes.  Some of the scenes are incredibly violent and pull no punches while others seem like they took a step back.  Nick Cage is Nick Cage in this movie.  Enough said.  The best scene in the movie takes place in a bathroom.  Seeing him laugh cry on a toilet in his underwear is something I never thought I would see, but I have now.  I really wish this movie would have swung for the fences, but it appears that the director had second thoughts and was at conflict with himself on the movie he wanted to make.  It could have been so much more."
    },
    {
      "rating": "7",
      "text": "The surprise of the year definitely. I don't think it's as good as many believe but honestly I'm really surprised.The story is simple but the atmosphere and tone definitely put it on another level. Nicolas Cage remembers how to do things well and adds another good film to his repertoire among all the inmudity of roles that have plagued his career in the last decade.My biggest problems are with the rhythm which is very uneven in certain parts. The duration, especially since the ending doensn't feel as satisfactory as I expected and as I wanted. And also as I said the the ambiguity of the story. It can be argued that it works considering how the film is presented but in my opinion it's a defect.Great score by Jóhann Jóhannsson in his last work before his untimely death. I certainly plan to add it to my collection.I don't think Mandy is a movie suitable for everyone but I really think that all audiences should watch it. You can hate it or you can love it but it's a journey that you should experience.Also I cannot criticize negatively a film that in its opening sequence uses Starless by King Crimson."
    },
    {
      "rating": "9",
      "text": "This movie easily could've been a hot mess. But director Panos Cosmatos pulled together all of the craziness into a cohesive revenge movie with the color wash of Suspiria. I loved this movie, it was brilliant."
    },
    {
      "rating": "6",
      "text": "a mirror of ours..Mandy Mandy is a character driven horror thriller depicting a revenge natured plot after a couple's mundane life is snatched by a group of sinisters. Set in a parallel world, the tale is eerily more mythological than sci-fi and Cosmatos's grasp over such malleable conspired theories amps up this gore for 2 hours. The project is undeniably an act of love and passion towards the horror genre that never wears off. The harrowing creatures, literal bloodbath, an angry mob mentality and tiny other such notions that it is brimmed with, filter out its audience easily. But amidst all these hokum formulas of Cosmatos, their lies a poetic tone that soars throughout the course of the feature and is what makes it more human. This visual galore fiddles with sparkling intense colors that speaks metaphorically to depict its more animated version. It also takes few things a bit too far, that may make you cringe on your seat with disturbing ideologies and horrendous methodologies that leaves a long lasting impression on you; it's definitely not a tale you'll easily forget. The richness on technical aspects is what elevates this simplistic concept with sharp sound effects, detailed art designing, stunning visual effects, metaphorical cinematography and an-old-comic-feel-like background score that sends you back to your childhood cartoon days. It aces on projecting the stakes and emotions of the characters through an emotional bridge in order to communicate fluently like when Cage almost drinks an entire bottle of pure alcohol despite his throat burns. Cosmatos's narration is also dependent a lot upon the performance then be it silent pitches or intriguing monologues. If Cage's rage gives you goosebumps then so does Riseborough's heartbreaking performance where she steals the show within the allotted screen time. The first half has a lot of potential, it is layered, it speaks honestly and its concept is much higher and mature than we usually get. Unfortunately, the second half is a bit low on ingenuity since its closure barrs its newer territories and till then the makers are slaves to its closure. Also, the series of mind-numbing tricks and cheats and weapons and tactics and deaths and bloodsucking calorific values, shucks away the earned respect in its initial stages. The inexpressive passion that each frame screams, the visual delight wrapped with ordeal images and a mythical allegory that is set afar from our world and is still a mirror of ours, are the high points of the feature. The linguistics fabrication of colors is the strongest vision of all and Cosmatos chooses a horror genre to teach us that; what an amazing lesson it is. His undying thirst is what fuels his execution skills where even the simplistic act is pulled off with such panache that it leaves you in an awe of it. Mandy is a bonafide tale stamped by blood and sweat and you will be able to see it, it's the makers job to make you and he triumphs with a huge margin. Don't treat it lightly, for Mandy surely won't treat you mildly, it's an honest tale that shouldn't and doesn't compromise."
    },
    {
      "rating": "7",
      "text": "6.7/10  A brooding slow burn thats pretentious at times with very striking visual prowess.Though predominately it plays like another attempt at high brow ultra cinematic \"art\" for pseudo intellectual hipster film snobs and indie loving critics, there is a plethora of excellent redeeming visuals. The plot is a simple revenge tale with some deeper attempts at symbolic thematics. It moves at tortoise pace for a majority of the time and lucky enough for the viewers the long drawn out exposition scenes are shot in intriguing manner with vibrant colorization and beautifully lush cinematography. Unfortunately the dialogue is so incredibly annoying and ridiculous it bogs these slow scenes down somewhat. There are a few downright brilliant sequences when the bizarre and twisted visuals rise this above mediocrity. The practical effects on the creatures are realistic and fantastically intense. Towards the finale it picks up when the blood soaked revenge kicks into insane levels of high gear and this is when the film is is at its most effective with Cage wreaking absolute havoc. Cage is his normal self as far as his emotional acting and it's good to see him get some recognition once again. The soundtrack is very well done and sets the tone in brilliant fashion. Overall if you can look past some of the arthouse smugness of the dialogue, pacing, symbolism, and appreciate the ultraviolece and colorful visuals and sounds, it's an interesting ride."
    },
    {
      "rating": "7",
      "text": "This movie is crazy and while there are some moments that I felt came across pretentious, I did have a good time. This is a film primarily of style and the amazing Nick Cage and if you love crazy Nick Cage this is right up your alley. Overall high 7 a B+."
    },
    {
      "rating": "8",
      "text": "\"You are a vicious snowflake\"How do you even review something like this?This really is not for everyone and that is just fine. The plot isn't anything special, but it's the experience that matters, good or bad. Chainsaws, 80's revenge, and Cage. The whole movie is a drug trip with the climax being the overdose. The trippy visuals and colors are just outstanding and really stick out.It's one of Cage's best work in years and also one of his best freak outs, as you're not sure to laugh or cry with him. It was very odd, yet strangely moving. You really do feel his pain both physically and emotionally. I wish we see Cage in more great stuff, than becoming another meme.The score is so melancholia and beautiful, which instantly caught my attention. Capturing the despair of love and the taste of sweet revenge. RIP Jóhann Jóhannsson."
    },
    {
      "rating": "7",
      "text": "All you Nicolas Cage fans out there (and I know you exist, don’t be shy) probably remember a film called Drive Angry 2011. Nicolas Cage goes on a murderous revenge driven rampage against a sadistic cult. Now join Nicolas Cage going on another murderous revenge driven rampage against a sadistic cult in Mandy. For those of you who don't already know, Drive Angry is rubbish and very skippable but Mandy is a film that's everything Drive Angry should have been and so much more. Nicolas Cage is the only actor who could play this part, to put any other actor in this role would be ridiculous but when Nicolas Cage does it for some reason it works spectacularly. Cage’s career has ranged from the good, the bad and the what the hell is this? Mandy will bring you on an unconventional emotional roller coaster ride varying from should I walk out, am I hallucinating, to this is the greatest trippy horror I've ever seen and I can't stop crying with laughter.Red (Nicolas Cage) and Mandy (Andrea Riseborough) live in a wonderfully peaceful house deep in a secluded part of the woods. This is all turned upside down by a bunch of hippy Jesus types, a sadistic cult let by a Charles Manson character, Jeremiah Sand (Linus Roache). Join Nicolas Cage on his journey of bloody vengeance as only Nicolas Cage can. I feel like the creators of this film were on LSD, the actors were on LSD and I was on LSD. The score by the late Jóhann Jóhannsson and the cinematography by Benjamin Loeb uses everything at its disposal to create a visually stunning film. You're constantly waiting for the worst to happen in every scene, it's the most unnerving thing I've seen in a long time. Taking manic and crazy to a whole new level, everything from the script to the chainsaw fight is the craziest thing you’ll see all year. And maybe a few years after that too, because we don’t get films like this very often and if you’re into the weird then make sure you take the time to see Mandy, I can’t guarantee all of you will love it but I can guarantee a part of you will enjoy it. It’s on limited release and then it’s straight to DVD so find a way to see it. Recommended."
    },
    {
      "rating": "9",
      "text": "Artistics Scenes and great Cinematography . it is the income of making such a  harmonic movie . every scene of this movie had a relation with some colors . i think this movie was movie of colors and director panos cosmatos made a color harmony and bring a mind connectivity into the briliant shots , i think you need to focus on what panos meant to show you behind those every none and conceptual elements ofhis movie . some times you do not get what people say to you , you just have to listen them carefully with your attention and with this you can understand what panos cosmatos made ."
    },
    {
      "rating": "8",
      "text": "TL;DR - Mandy's story has a bit of a mismatching in it's First and Second Halves. Nick Cage takes a while to rev up into the kind of roles we love watching him do with the story on the same parallel. Even so the set up is much appreciated in the first half making us care which gives us a good reason to stay with Cage's character once the revenge ride begins.When I watch John Carpenters The Thing which is one of my favorite movies I am instantly transported to the Arctic base that our characters reside on because of the amazing cinematography, soundtrack and some very good editing. Though 'The Thing' is far superior in every aspect, 'Mandy' will give the coming generations a similar feeling transporting them into the world where the titular Mandy resides with her lumberjack husband played by Nicholas Cage, who after the plot set up goes into one of his best over the top NickCagey roles since Face off or Snake Eyes.Mandy is one of those films which will undoubtedly reach cult status and will be watched in decades to come. The good editing, great cinematography and 'Nice Simple Story' combined with kooky-good performances from cast fuses into a Movie that in its entirety can be summed up as a Beautiful train Wreck. There are Tonal Clashes constantly with the first and the second half of the film being completely different from each other. Even with the jarring switch the movie stay's with it's Tone switch long enough on either side to make Mandy as a must watch at least once as well as Director Cosmatos's Beyond the Black Rainbow also to get the Blu Ray when it Releases."
    },
    {
      "rating": "7",
      "text": "Drenched in vivid 80’s nostalgia and even with it’s disjointed story, there is a lure to the visuals that pulls you in and leave you feverishly guessing at some of it’s intent. Enter Cage dueling with a chainsaw and all is forgiven. It’s amazing how something bad can feel so good."
    },
    {
      "rating": "7",
      "text": "Entertainingly insaneEqual parts psychotropic horror and grindhouse revenge thriller, Mandy is the second feature from director and co-writer Panos Cosmatos. And although it would be impossible to recommend to everyone, there is an undeniable brilliance here. An insane brilliance. But a brilliance none-the-less. Although it could (somewhat legitimately) be accused of too much style and not enough substance, Cosmatos mixes an expressionist aesthetic with horror tropes, a generic revenge narrative, and comedy beats, resulting in a film quite unlike anything I've seen.Set in \"1983 A.D.\", the film tells the story of Red Miller (Nicholas Cage), and his girlfriend, aspiring fantasy artist Mandy Bloom (Andrea Riseborough), who live a simple secluded life in the Shadow Mountains. When Mandy is spotted by the Children of the New Dawn, a religious cult led by failed folk singer Jeremiah Sand (Linus Roache), he becomes infatuated with her, using the \"Horn of Abraxas\" to summon the Black Skulls, a trio of demonic bikers addicted to a highly potent form of LSD. Along with the Skulls, the Children invade Red and Mandy's cabin, tying Red up in barbed wire outside, and leaving him for dead. Unbeknownst to the Children, however, Red survives and sets out in pursuit of both the cult and the Skulls.One of the things that will jump out at you as you watch Mandy is that Cosmatos packs the narrative with an extraordinary amount of cultural references,. Prior to hearing any dialogue, there is an audio extract of President Ronald Reagan speaking about how the vast majority of Americans are disgusted by porn. Mandy's art is not recalls Roger Dean, whilst the film's animated sections recall Heavy Metal. Indeed, the general aesthetic is equal parts Bat Out of Hell and Iron Maiden. The Children of the New Dawn is obviously inspired by the Peoples Temple of the Disciples of Christ and the Manson Family. The home invasion bears more than a passing resemblance to similar such scenes in The Last House on the Left (1972) and Henry: Portrait of a Serial Killer (1986). The revenge narrative has something of the original Mad Max (1979) about it. Sand's \"Amulet of the Weeping Maze\" is inspired by The Carpenters. Red wears a Mötley Crüe t-shirt, and tells an awesome Erik Estrada/CHiPs (1977) joke. During a discussion about which planet is their favourite, Mandy selects Jupiter, but Red argues for Galactus. The Black Skulls are obviously inspired by the Cenobites from Hellraiser (1987). The Children's A-frame chapel resembles the church in There Will Be Blood (2007).The score is the most pseudo-John Carpenter 80s music imaginable, composed by Jóhann Jóhannsson, in one of his last compositions prior to his untimely death. Indeed, the score is almost another character entirely, and the film simply wouldn't work half as well if the music wasn't as good.Director of photography Benjamin Loeb bathes his compositions in purples, reds, indigos, yellows, greens, and oranges, with the occasional blue (primarily associated with Mandy herself). Often the colours are non-diegetic and unexplained (for example the Horn of Abraxas always appears in green light, irrespective of location). The cinematography also employs a plethora of subjective techniques, such as double lens flares, animation, slow-motion fades and dissolves, and telephoto shots.Very much a film of two halves, if the first brings us to the gates of hell, the second pushes us in and slams the gates shut behind us. The two halves are divided by an extraordinary single-shot 45-second scene of Red (wearing only underpants and a t-shirt) pouring vodka over his wounds, drinking what's left, and screaming. It's a scene of extraordinarily raw emotion that works brilliantly, because you simply don't often see a male protagonist this vulnerable. Indeed, it's not beyond the realms of possibility that one could read Mandy, at least in part, as a meditation on the destructive nature of profound grief, and if so, that interpretation begins right here. Yes, there is more than a hint of an archetypal dualistic cosmology underpinning Red's revenge, particularly Zoroastrianism and Manichaeism, but so too is it a deeply personalised quest.There are some problems, however. For starters, it's kind of disappointing when you realise that for all its technical prowess and fascinating aesthetic gymnastics, it's just a revenge flick, and at over two hours, it tends to drag a little in places. The screenplay (by Cosmatos and Aaron Stewart-Ahn) can also be too on the nose at times and doesn't give Red a huge amount of depth.Yes, it's all kind of pointless. However, love it or loathe it, there's no denying that it's brilliantly assembled. As an audio-visual experience, it's unlike anything I've seen in a long time, and it's almost certainly destined for cult status."
    },
    {
      "rating": "9",
      "text": "Chainsaw Shaman: The Mythic Symbolism of MandyMandy is a beautifully, intensely, ferociously *human* film. Sitting in a darkened theater and diving into this hallucinatory experience, a strange kind of connective magic forms between director Panos Cosmatos, star Nicolas Cage, Cage’s character Red, and the film viewer.In several interviews Cosmatos describes how creating Mandy and his previous film Beyond the Black Rainbow were ways for him to work through the feelings of rage and helplessness he experienced after losing his parents. Rather than creating a more literal and grounded exploration of loss, Cosmatos instead crafts a bold and shocking mythical world populated by demon bikers, chainsaw wielding cultists, mind-melting drugs, and strange magical artifacts.Mandy follows a home invasion/revenge plot structure that we have seen many times before in films like Death Wish, Rolling Thunder, and others: a parable for the sacredness of the loved ones in your life and the importance of valuing them above all else. Cosmatos filters this familiar narrative through a psychotronic blend of dark fantasy, 80’s horror, and 70’s surrealism. Mandy’s bloody and bombastic midnight-movie aesthetic might make it appear to be a superficial love letter to cult movies of the past, but I argue that it is a masterclass in symbolism; an exploration of the pain of the subjective human experience in a powerful poetic fashion.  Psychologist Dr. Jordan Peterson says of myth and fantasy, “The Mythological landscape is the landscape of human experience. In this world, there is nothing more real than pain”. Cosmatos utilizes this symbolic realm of fantasy to explore his very real grief and fury.This is a movie about emotional intensity: the value of being intensely passionate and accessing the primal warrior instincts you have locked deep down in the dark, seething abyss of your psyche. Nicolas Cage describes his acting style as ‘nouveau shamanism’, a process in which he journeys inward into the recesses of his own mind, and utilizes what he finds there to embody a character. His goal is not to pretend to be something, but rather to access his most powerful emotions, memories, dreams, and experiences in order to genuinely feel something, and express it via a performance. In interviews Cage shares that he utilized his shamanic practice to access the powerful pain of his most recent divorce in order to bring the character of Red to life. It’s fascinating to see how Cage evolves his character through the remarkable visual communication of his acting. He utilizes his face, voice, and body language to depict the transformation of Red *visually*. In many scenes Cage doesn’t speak a single word: he reveals everything through his face with expressions both subtle and wildly erratic. Red evolves further and further away from the calm, gentle man he was at the beginning of the film. Cosmatos has his character undergo several stages of mutation through ‘rites of passage’ that plunge him deeper and deeper into madness and the realm of the fantastic. A key transformation occurs during Cage’s spell-binding melt-down in the bathroom. This scene functions as a kind of ‘crossing the threshold’ moment for the character where he takes his first voluntary step into the strange unknown. The bathroom set is designed to act as a visual manifestation of Red’s mental state: the shocking orange patterns of the wallpaper and bright lighting make it seem like a perverse prison cell or microcosm of hell in which Red is trapped.Cage wails in anguish, desperately chugging a bottle of vodka, oscillating wildly through the spectrum of emotional torment. The vodka becomes a symbolic elixir; something that numbs his physical pain and transforms his despair to burning, skull-crushing rage.At the demon biker’s lair, Red dips his finger into a mysterious jar and mutates even further when his tongue touches the mind-warping “skull juice” LSD concoction. It liquefies his reality and rockets him to another primordial plane. This is followed up by another gleefully psychotic scene of Cage lighting a cigarette from the flaming, decapitated head of a demon biker. He takes a long drag off the cigarette and shows us visually through his wild, nerve-shredding, electric stare that he has somehow journeyed even further into madness.  What is amazing about this series of wild scenes is that Cage manages to change his character’s state of mind incrementally after each threshold of violence and depravity is crossed.Red becomes an avatar of our own rage against the injustices we've experienced in our life. Through him we fight back; eviscerating with savage fulfillment all the dark forces that have harmed us.  As always, the viewer brings their pain with them to the theater.  Through the alchemy of film we can experience our pain from a unique perspective, reflect on it, and perhaps find answers."
    },
    {
      "rating": "10",
      "text": "I have never been more disturbed by a movie in my life... If the tape from \"The Ring\" was an actual film, it would be this movie. Easily Nicolas Cage's best performance. I'm still trying to process what I just watched.."
    },
    {
      "rating": "10",
      "text": "Objectively speaking this was wonderfully directed, the acting was phenomenal, and it truly is a midnight movie! If you love movies like Crank, The Shining, Beyond the Black Rainbow, or literally any Rob Zombie movies you'll probably love this movie. It is definitely not for everyone, but for those who love these genres absolutely go see it in theatres if you can. Those who can't get it on VOD immediately and do yourself a favor... get a kickass sound system and the soundtrack!"
    },
    {
      "rating": "10",
      "text": "'Mandy' is amazing. Amazing. Amazing. In all honesty, I'm more impressed by it than I was by Paul Thomas Anderson's newest film, because it's so much more original, so experimental and so fearless in its utter, bizarre, grating unusualness. It's not even really fearlessness; Panos simply doesn't seem to hold any awareness of cinematic conventions or formulae. I'd never, ever have dared intertwine tragedy and comedy so closely as he does here.It's much less important, but I also felt like I was watching Cage's comeback in real time. He's magnificent, and a lengthy shot in a bathroom could easily be the best single shot of his career.Of course, the one convention the movie does hew to is the revenge genre, and I feel like the encounters in the second half get slightly repetitive, and some of the gore feels just slightly juvenile to me personally. Also the music never quite jumps out and astounds us the way the rest of the movie does. But those are pretty minor complaints. It's one of the most atmospheric movies I've ever seen, and watching it really does feel more like visiting a place than watching scenes unspool.Cosmatos is absolutely going to be one of the most fascinating film-makers to watch in our era (although, at this rate, it looks like we should probably expect a smaller oeuvre than most). Over and over and over again, I just couldn't believe what I was seeing and hearing had actually just been done."
    },
    {
      "rating": "10",
      "text": "If Kung Fury was expanded by an hour and a half,a little darker, a little more art house, and involved sweet revenge on hippy cult leaders, you have Mandy."
    },
    {
      "rating": "10",
      "text": "If only watched intro with King Crimson's galaxy smash-hit, one would leave the theater happy....those who stayed to the very end would be rewarded with the best psycho sh.t imaginable, one that David Lynch would kill for ! Starless night, Bible black, oh, those lyrics never had better meaning  ! 10 out of 10."
    },
    {
      "rating": "10",
      "text": "Did you love Earthbound? Ever wonder what would happen if Ness and Paula grew up, moved in together, and Ness became a lumberjack and Paula dyed her hair black? Ever have nightmares of New Age Retro Hippies summoning gnarly biker dudes with the Horn of Apraxus and a jar of LSD, harming Paula, and wondered what Ness would do? See Mandy and wonder no more. Spoiler alert, Ness upgrades his yo-yo."
    },
    {
      "rating": "2",
      "text": "The positive reviews seem to be mistaking self indulgence and pointlessly stylized filmmaking for art. Doing something odd for the sake of being odd is not art, it's masturbation and that's all this is. It felt like a student film with a ridiculously high budget. I guess the folks reviewing this steaming present positively forgot this medium is for storytelling, something in which the makers of \"Mandy\" have precious little interest."
    },
    {
      "rating": "1",
      "text": "This movie is very bad. I wish that I didn't have to write 75 characters to leave a review."
    },
    {
      "rating": "7",
      "text": "Very fun movie once it gets going. Blood is shed from pretty much start to finish, and Nick Cage delivers as the vengeful hero very nicely. The enemies that he goes up against also work well in the environment, it feels like they belong there.I don't like Mandy's backstory, either they should have done more with Red and Mandy (by that I mean developing their love and rapport with each other), or jumped into the action sooner. The whole setup, the couple animated scenes, and most of the dialogue throughout the film (even though there wasn't that much) were really odd in tone, and felt pretentious in their own ways. Still a fun movie, and I definitely would watch again.6.5/10"
    },
    {
      "rating": "10",
      "text": "I absolutely loved this film. It has a great \"slow-burn\" pace, it has a fantastic soundtrack, eye-melting psychedelic visuals, ridiculous OTT gore-soaked violence, and great performances from the cast.  I saw it a film festival where the projectionist was requested to \"turn everything up to 11\" and it didn't disappoint. My favourite film of 2018."
    },
    {
      "rating": "8",
      "text": "This movie does exactly what it's meant to. It's a slow burn set through a beautiful scenery, then goes from 0-60 real fast! Nicolas Cage gets let off the leash in this brutal and beautiful revenge tale. It's an over the top bloody mess that you either accept or you don't. The outcome can definitely be polarizing but I enjoyed it from start to finish."
    },
    {
      "rating": "10",
      "text": "Mandy is a trip from tranquil normalcy to psychedelic horror that blurs the lines between reality, fantasy and drug induced psychosis. It is not for someone who needs immediate gratification. I will try not to spoil the plot and will only reference events revealed in the trailer.The first half establishes the characters of Red and Mandy, a lumberjack and an artist who have found peace in each others arms. They are trying their best to live happily isolated from the rest of civilization until one day darkness invades their sanctuary. The second half is an odyssey of bloody vengeance that sees the human psyche twisting and contorting like the branches of the blackened forest until it can scarcely be recognized as human. The contrast between the two halves is startling, the film goes from 1 to 11 and Cage's reactions to what he is facing are not out of place. They capture the terror of a normal man faced with an unspeakable malice he can't understand.My conclusion; This film takes the classic character of the woodsman hunting down the evil warlock to avenge his lost love and adapts him for a modern day setting. His adversaries are abominations in black armor. Are they simply bikers driven to extreme psychosis through substance abuse or something mystical, ethereal and evil? Is the cult leader simply mad or is there truly some sort of monstrous power manipulating the events that transpire? Its impossible to tell as the protagonists perception becomes more and more unreliable. Thats the genius of this film. It blurs the line between fantastical dark fairytale and realistic psychological horror."
    },
    {
      "rating": "8",
      "text": "If Nicolas Winding Refn and David Lynch had a baby, then that baby got really in to fantasy and heavy metal, Mandy is the film that baby would eventually make. It's a film of pure insanity, where a man can fight a demon, slit its throat open, snort cocaine, have his face melt off and that scene will still not even be the strangest part of the film. It starts of simply enough, with Red Miller (Nicolas Cage) and his girlfriend Mandy Bloom (Andrea Riseborough) living a peaceful life in the wilderness. But then one day Jeremiah Sand (Linus Roache), a Manson type leader of a crazed hippie cult, sees Mandy and decides to send his cult to kidnap her since he believes they are destined to be with each other. This propels Red to go on a bloody quest of vengeance using a crossbow, an axe and eventually a chainsaw. It's basically like your typical rom-com (just with a few more demon bikers).Overall it does have the same general set up to a classic revenge film like Death Wish, with a hero is wronged and decides to deliver his own brand of justice. The difference being that Mandy uses imagery that feels like it's been pulled from hell. Whenever evil appears, the screen fills up with a blood red glaze and gives a very primal feeling of dread. Then at other times the imagery feels like we're looking at the world through the eyes of a 80's heavy metal fan, full of imagery which feels like its been ripped from from classic album covers.Though at the core of this crazed ride is Nicolas Cage, who has always been known for his insane performances and may have found the perfect film to showcase his talents. Throughout the film he's able to go switch seamlessly between rage and misery, whilst somehow still embracing the more darkly comedic elements of the film. In one single take sequence, Cage delivers such a variety of emotions that it could be the fastest I've heard an audience go from laughter into shocked silence.Mandy is definitely not a film for everyone and it's unlikely to ever get any mainstream success. But with Cage finally finding the perfect film to match his crazed onscreen persona, it also seems destined to become a cult classic."
    },
    {
      "rating": "10",
      "text": "An absolute wild, crazy, trippy, and over the top violent revenge story like no other! Mandy brings back Nicholas Cage in all his glory and madness! This movie feels like the proper Ghost Rider movie we all deserved, filled with intense crazy images, grisly and violent action, and yet it's all so psychedelically beautiful and amazing. An incredible achievement in film making, and one of Nicholas Cages most intriguing roles!"
    },
    {
      "rating": "9",
      "text": "this is one of Nicolas Cages best movies, the filming style is vary stylistic, and cage manages to convey a lot of emotion in this roll, and lots of grit, Mandy is one of the best movies I have watched in a long time it's vary gritty especially during the fight scenes."
    },
    {
      "rating": "10",
      "text": "Mandy I'd call this film a glorious chimera of Legend, Suspiria, The Crow and original Mad Max: The Road Warriors. All in my top 10 so you can guess how I feel about Mandy. Red Sonja would've been PERFECT for Panos. How about Barbarella? LOVED Mandy (AMAZING acting, soundtrack and visuals)! I'd say the character development is fantastic in this film. What you're missing is all the garbage \"filler\" that exists in most films/television as well as the exposition. This director extracts every drop of significance out of his scenes. You are only shown what's necessary and relevant. And as a result, for 120 minutes, you won't be able to take your eyes or focus off Mandy. Two words...Cheese Goblin"
    },
    {
      "rating": "9",
      "text": "Loved it!!! \"Mandy\" is bat s^#t crazy. I felt like I was on acid after watching it. The movie does not anchor itself in reality (which makes it that much better). Kudos to Nicolas Cage for going there. This time his \"over the top\" performance pays off... in a big way. The heavy metal soundtrack and color scene (much of the movie is completely red) combine to make \"Mandy\" a cult classic."
    },
    {
      "rating": "7",
      "text": "the only thing i really like about this film just the feel of gothic, the cast and the technic."
    },
    {
      "rating": "8",
      "text": "Mandy, apart from being an author's film, is a new installment of cinema cult.An unbeatable aesthetic, a perfect cast and a film with its own presence.Mandy is a very important film for the current cinema."
    },
    {
      "rating": "6",
      "text": "There's a good movie hiding in here somewhere.You're going to need to do two things to prepare for watching this movie. 1) Do drugs. 2) Bring extra drugs to take halfway through.There is a good film in here somewhere. I think cutting 30 minutes out and playing the rest at 1.5 speed would do a lot to help the finished product. Oh, and did I mention drugs?"
    },
    {
      "rating": "1",
      "text": "I don't know who is pushing this movie, or who it's for, but it's utter trash. The plot, characters, and dialogue are all terrible. Reminds me a lot of The Neon Demon - stylish visuals with nothing else. The pacing is glacial. I took nothing away from this movie, it's simply a waste of time."
    },
    {
      "rating": "4",
      "text": "A long, seemingly endless, rock opera with garbled dialogue, hick poetry, trailer park artistry, and Nic Cage in tightie whities."
    },
    {
      "rating": "5",
      "text": "Un interesante ejercicio de estilo, que desperdicia sus mejores recursos como sus protagonistas, diluyendose en un exceso de direccion, falta de ritmo y pericia narrativa. Tiene ese halo especial ochentero, en que el poster es mejor que la pelicula, pero aun asi tiene razones para disfrutar el viaje."
    }
  ]
}