{
  "id": 2594,
  "title": "Marauders",
  "starring": [
    "Bruce Willis",
    "Dave Bautista"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "An untraceable group of elite bank robbers is chased by a suicidal FBI agent who uncovers a deeper purpose behind the robbery-homicides.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bAvmDn5C7arBoRrfaG3b3Kdue1q.jpg",
  "categories": {
    "plot": 3.888888888888889,
    "acting": 4.5,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I find it extremely hard as a writer to critique other work, lives are put into these things.  But I'm going to be honest with this one.\r A bunch of cheap plot twists and story antidotes that either a; don't fit in or b; aren't compatible with the plot.  Missed potential.  Although I do admire the effort.  Cool it on the slow-motion scenes and give meloni a quality that doesn't involve the generic alcoholisim, it was hardly germane.  And the cheap **** ending?  My sympathy went out the window."
    },
    {
      "rating": "3",
      "text": "Marauders is a very disappointing action-thriller. With an excellent cast, it squanders its potential with a nonsensical plot. The characters are interesting enough, and it had a great start with an homage to Heat."
    },
    {
      "rating": "3",
      "text": "We had high hopes but its totally B-Grade, huge plot holes and a narrative that is far too smart for its own good.Its an attempt at a heist film and wants to bring something different to the table and fails miserably.Props for trying but leave the conspiracy theory plots to writers with more know how.The whole experience was pretty insulting and not worth the time."
    },
    {
      "rating": "4",
      "text": "Bruce Willis, if you are reading this, please let the poor little mouse out of your mouth that you have been hiding for years now, I beg of you.It must be hard for you Mr. Willis, trying act to with fur ball in your mouth. Is that why you have been phoning it in recently just so you run into the bathroom to spit it out. It’s nice of you to give the mouse a warm and wet home but think of your career man."
    },
    {
      "rating": "6",
      "text": "Started really good, intense, felt like it will be an interesting heist movie/ thriller, but afterwards, when things slowly started evolving and things were unwrapped and solved, all of it felt like it is done in a rush and some of the decisions characters made at some points were just unreallistic or weird. Also the ending, even though in itself is predictable, how it played out didn't make any sense at all. So basically if they would have kept the movie as enticing as in the first half for the whole movie it would be amazing, but as the second part of the movie is quite average if not worse, I gave this a 6 and it might be giving a bit higher mark than it should receive actually."
    },
    {
      "rating": "4",
      "text": "This movie wastes the potential it had with its cast. The movies story was interesting but becomes another cops and robbers film with a little twist but it becomes too predictable throughout. Didn't have a lot of anticipation with this movie, but I was sort of interested in seeing it. I was hopping it was gonna be a different heist movie but it disappoints."
    },
    {
      "rating": "6",
      "text": "The end kind of cheesy but the rest is not that bad. A good cast and a good Mystery too."
    },
    {
      "rating": "7",
      "text": "Action is good. The story is a bit complicated ............................."
    }
  ],
  "recommendations": [
    "man_on_a_ledge",
    "now_you_see_me",
    "the_loft",
    "a_perfect_getaway",
    "grudge",
    "wild_card",
    "wrath_of_man",
    "now_you_see_me_2",
    "i_see_you",
    "vantage_point",
    "seeking_justice",
    "the_number_23",
    "project_power",
    "unknown",
    "till_death",
    "the_good_liar",
    "bird_box",
    "contraband",
    "solace",
    "the_november_man",
    "the_call",
    "next",
    "pirates_of_the_caribbean_on_stranger_tides",
    "the_ice_road",
    "escape_plan"
  ]
}