{"id": 4370, "title": "Marie Antoinette", "starring": ["Kirsten Dunst", "Jason Schwartzman"], "runtime": 123, "genre": ["Drama", "History"], "description": "A retelling of France's iconic but ill-fated queen, Marie Antoinette, from her betrothal and marriage to Louis XVI at 15 to her reign as queen at 19 and ultimately the fall of Versailles.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/cybXGmv8Rjd5Os8Xml6YxMBQ0Zt.jpg", "categories": {"plot": 4.222222222222222, "acting": 5.857142857142857, "ending": 7.0, "soundtrack": 4.133333333333334, "cinematography": 5.75, "familyFriendly": 3.5, "funny": 5.0, "action": 1.5}, "reviews": [{"rating": "0", "text": "This movie walks all over the name and likeness of a dynamic individual. Boycott. Please."}, {"rating": "4", "text": "Sofia Coppola shows that she was more interested in Marie Antoinette's shoe collection, then she was in Marie Antoinette."}, {"rating": "8", "text": "Visually ravishing, the film captures the imperial grandeur of 18th century France, animated by the shallow, exquisite creatures of fashion. What dresses! What shoes! Captures excess without cloying or beating us over the heads, Coppola's fresh interpretation remains underrated and misunderstood."}, {"rating": "3", "text": "Nothing happens."}, {"rating": "10", "text": "Love this movie, one of my favorites, love everything: Kirsten, the dresses, the acting, ESPECIALLY love Coppola for making my favorite movie. Why is that people don't like it? its perfect. Gorgeous. Delighting.  I 've re watched it soooo many times"}, {"rating": "5", "text": "I wanted to enjoy this, but the soundtrack would sweep me right out of the movie to wonder what the heck they were thinking when they chose that movie. Also, it was very uneven between narrative in the first hour and montages in the second. It was very pretty, though."}, {"rating": "0", "text": "I felt sick afterwards. Did Coppola even read the book? I have and this movie isn't faithful to it at all. Sickening hipster trash that only a father could love (and pay for)."}, {"rating": "3", "text": "Before seeing this film I had read that audiences at Cannes booed and jeered repeatedly during its showing and later audiences in French moviehouses fround the ting so absurd it elicited hysterical laughing. Frankly, those responses played a role in my wanting to see the thing, hoping to be pleasantly surprised by an unorthodox treatment similar to a Ken Russell treatment of Mozart. No banana, folks. This movie is so inane, you might find yourself, as I did, cringing in embarrassment at the vacuous attempts at convincing us that Marie and Louie were,,,well...vacuous. And the soundtrack defys explanation. Is Ms. Coppola trying to say something about the decadence of the pre-Bastille oligarchy or her own dislike of 20th Century New Wave pop-rock music by marrying the two? The combination of the two contributes to the overall hokiness of this hokey flop."}, {"rating": "3", "text": "I may be a bit harsh, but I was bored out of my mind. I stopped the movie, and then read her Wiki entry. It was more fulfilling."}, {"rating": "3", "text": "Although the real story of Marie Antoinette is fascinating, this movie does not do her, history, or cinema justice. On the plus side, the costumes were masterful."}, {"rating": "0", "text": "What went wrong? Why did they choose to make a music video about Marie's dresses? This movie takes \"suck\" to a whole new level. It is glossed over, and doesn't even show the reality of Marie's life during that time period. It does not show how she was given very little power over her people, and how every single problem was blamed on her. In this film, she is probably blamed for ripping a dress instead. Kirsten Dunst is terrible in the role of Marie Antoinette, as she is with every role. This movie makes me want Dunst's character guillotined, but sadly, it doesn't show it happen. Avoid this Kirsten Dunst mishap like your life depends on it."}, {"rating": "8", "text": "While this movie is not the epitome of narrative or good direction, it does force the audience to consider whether or not what they learned in school about Marie Antoinette rings true. In appreciating this film, I believe, we are forced to give way to the recognition as Marie Antoinette as a girl (she's only 20 or so after all) who enjoyed luxury and perhaps indulged in that vice a little too much. Yes it is frivilous, yes it is historically inaccurate in many ways, but it also instills in us the much needed question \"but what if the opposite were true.\""}, {"rating": "8", "text": "I didn't at all find myself anxious for the end of the movie. In fact, I thought the time passed perfectly fine. The camera was obviously a bit taken up by all of the pretty and the sugary sweet and lavishness, but that's the point. And it's done in plenty enough interesting ways that I wasn't at all bored; it was interesting. I think it's a pretty human look back on those events, however accurate or not they're displayed, to show Marie thrown into the stoic France and told to make her family proud (or humilate them, otherwise) no matter what it takes. I'm not often a fan of the lavish, but this movie puts it into perfect context."}, {"rating": "10", "text": "Brilliant, from Kirsten Dunst and Jason Schwarzman's performances to the music, and the beautiful costumes to the wondrous setting and art direction. This movie is one of the best fims I have seen. Period."}, {"rating": "8", "text": "A visual feast! - and a fine performance by Kirsten Dunst. Definitely a mood piece and not to everyone's cup of tea (stretches of little or no dialogue) - but lI loved it! Lots of verve and attitude!"}, {"rating": "2", "text": "Sophia Coppola is a daring filmmaker. She created a movie about a historical figure and made it as dull, shallow, boring and uninteresting as humanely possible. She is a punk at heart. I have a difficult time understanding the people who defend this movie. I liked Lost in Translation and I am a fan of deliberately paced movies. This was plain horrendous."}, {"rating": "2", "text": "The costumes of Kirsten Dunst were wonderful, and the dogs and animals were fantastic. The children also were charming and beautiful. But the music was just TERRIBLE, and so disjointed that I found myself not being able to wait until it was over! Besides being out-of-era, the music was tuneless and distracting. The whole time I wondered where the movie was going, and the close-ups of food and drink became so repetitive that I was even more anxious for the movie to be over. Very odd and tedious..."}, {"rating": "3", "text": "I was really disappointed. It was a very limited view. I would have given it a ten if it had no sound... Although I did like the Cure song in the middle. I had to google her to find out what her actual story was. Left me empty."}, {"rating": "6", "text": "THE BIGGEST DISAPOINMENT OF THE YEAR. An audacious concept, Coppola asks us to watch a two-hour music video, a frothy confection of shoes and parties, only to subvert the film in the last few scenes when Marie Antoinette (unfortunately played as a wooden stick by Canine-teeth Dunst, the films second flaw) faces her fate with dignity and with class. Character is earned, not bought. By juxtaposing parties and shoe shopping with the queen"}, {"rating": "0", "text": "One word: Dreadful. They cared more about filming shoes, dresses and hair than making a good film. If you like to shop, this film is for you, otherwise, stay away."}, {"rating": "2", "text": "This is not a good movie - on any level. There were more disconnects and historical inaccuracies than can be mentioned here. The author/director/writer demands such a \"suspension of disbelief\" - and fails - that when they do throw in a historically accurate fig, the casual viewer is left to \"sort it out for themselves!\" For example, Marie was 38 when she was beheaded. Her oldest child was 16 and her son was 12. They weren't toddlers! There was no \"ageing\" process from the time she entered the court to the end. In a piece demanding time context, there was none. The music selected was dreadful. The switch from contemporary to modern just didn't work. Granted, it was intended to convey a \"spirit\" - failed. This movie made Marie Antoinette out to be nothing more or less than a pleasure seeker. In reality, she became very involved in the politics of France from 1775 -> because her husband was so weak. And finally, Kirsten Dunst in the title role was a fly-weight. She could not hold up her end of the bargain. The acting was - just that - acting and pretense. I recommend anyone interested in neo-period pieces see \"The Libertine\" with Johnny Depp in the lead for a compare and contrast of style and substance. The Libertine was well-done, well-crafted and well-acted."}, {"rating": "5", "text": "I kind of liked this movie.... but it's hard to say... it really dragged on.. a lot! There were certain parts that dragged on for at least half an hour.... then other parts that skipped about 3 years.. parts were very confusing but others were very interesting..Over all i give it a 5! I think i would be able to sit and watch it again but not for a while.. it went on too LoNG!!!"}, {"rating": "0", "text": "Jason Schwartzman and Kirsten Dunst make Ben Affleck and Jennifer Lopez look like Thomas Hayden Church and Sandra Oh."}, {"rating": "10", "text": "Coppola stuns us with glamour and decadence. A fascinating film."}, {"rating": "10", "text": "Sofia Coppola did a superb job with this movie and should be praised by all as a great work of historical fiction! Although most perceive this as a fake portrayal of the real story, that was the point! it was historical fiction..... mostly facts but with a story twist."}, {"rating": "10", "text": "A great movie, highly entertaining."}, {"rating": "10", "text": "Beautifully drawn out, A must see movie!"}, {"rating": "9", "text": "Wonderful. I can't believe all the compliants about the ending -- it was perfect!!"}, {"rating": "10", "text": "Incredible! Dunst HAS to be nominated for an oscar, she's just excelent in the film, the best performance i have seen this year so far."}, {"rating": "9", "text": "A beautiful, beautiful film. Mesmerizing with its delicate pace, contemporary and oddly fitting sound track and stunning, lyric photography, the film is also a plausible biography of this teenage queen. Dunst is perfect."}, {"rating": "6", "text": "Somewhere in England, in a pub, Midge Ure, with beery breath, blurts out to anybody who's listening, \"This bloody movie begins in \"Vienna, and I wrote a song called \"Vienna\"! Fancy that! It would've been f****n perfect, in my humble opinion, had it accompanied Marie's journey to Versailles! I'm from the eighties, too, you know! And I need the money, goddamnit!\" Sorry. Crazy Ultravox fan talking here. No love for the London-based synth-band, but Adam Ant, of all people, has the unique distinction of having his music accompany a silent film classic(Fritz Lang's \"Metropolis\"), and a period-piece biopic about a queen with too much free time. \"Marie Antoinette\" bears a faint similarity to Aleksandr Sokurov's \"Russian Ark\", in which your entertainment is derived mainly from the historical importance of the film's location. Some of the casting is disastrous. With the right actors, the repetitious scenes of court life wouldn't seem quite as tedious."}, {"rating": "4", "text": "The reviews below say \"beautifully drawn out\", \"worth it just for the imagery alone...\", \"a visual fest\", etc. I agree with these comments, but beautiful film making doesn't make an engaging story. This movie unfortunately digresses from the perfection of \"Lost In Translation\"'s ability to combine Sofia's visual mastery with a plot and gentle turn of events that keep you wanting more. This movie returns to the \"pop art\" feel of The Virgin Suicides, where you want to like it, but after around an hour or so, the pace of the movie put me to sleep (almost literally). Maybe it was just missing Bill Murray?"}, {"rating": "10", "text": "So wonderfully captures the hermetically sealed culture of Versailles, its obsession with visual delights... and frankly, its vapid apoliticalness. The movie is worth it alone, just for the imagery of the palace with the nobility and without the tourists."}, {"rating": "9", "text": "A Stunningly beautiful film. The cinematography and costumes are certainly oscar caliber. The lack of left-wing, self righteous anger at the royal lifestyle pissed off most film critics and the french, which is probably a good thing. The only critique; I am not sure the no-wave and post-punk off of Sofias iPod works all that well. She should have done it Kubrick style; painstakingly providing period music which would have worked better."}, {"rating": "3", "text": "The Marie Antoinette documentary on the Biography channel was more exciting and more accurate than the film. The music was the worst I have ever heard for a film. I thought in the beginning that I was in the wrong movie. Modern rock and roll music does not go with this film... Sorry!"}, {"rating": "8", "text": "Nice eye candy, but too little dialogue. Glad it was filmed at Versailles. The controversial Converse seem to throw a lot of people under the 6 pt threshold."}, {"rating": "10", "text": "This movie was amazing. I liked that it wasn't a historical piece, but a kind-of colorful bibliography. I found myself researching M.A after, and thinking how unfair her life was. I think the soundtrack is genius, and it works. It was so bold. Especially the \"I want candy\" scene. My fave!"}, {"rating": "2", "text": "One vote for cinematography and one for costume. That's it."}, {"rating": "3", "text": "A visually stunning mess. Great to look at but completely lacking an interesting script. Schwartzman is horribly miscast. Worth seeing for the sheer trainwreck value."}, {"rating": "2", "text": "Kept waiting for something to happen other than the Queen taking off and putting on her nightgown - nothing else happened. Cinematography and costume were good."}, {"rating": "9", "text": "The style, direction, and acting all make for a captivating view of one of the most famous Queens of France."}, {"rating": "5", "text": "Great costume/set designs and a decent performance from Dunst saves this movie from being a total exercise in dullness."}, {"rating": "0", "text": "It was really worse then a 0 but sadly thats the lowest rating. I would rather watch the grass grow. They added scenes that they didnt need. We had to watch her walk up a baggillion stairs. The movie was sickening."}, {"rating": "4", "text": "There is nothing much in this film than the formal ceremonies and all that glamor. But it does well in showing the excess in indulgence behind the palace walls. Some scenes are too long and unnecessary. The scenes show Marie lazying around and daydreaming which makes you feel like dozing off. The acting was fine, especially Kristen, who does great at being an ignorant queen."}, {"rating": "8", "text": "Not the best movie, but def one of the boldest of last year. juxtaposing one of the biggest icons of French history and one of the biggest outsiders to become part of French history, against pop songs. And why not Coppola perfectly captures the glamor and the snobbery of the French high society. although something s are hit and miss like the last shot of the destroyed bedroom at the end, and the way the mob that stormed Versailles is reduced to pack of people with flames. i think the movie could have been edited better with some things left out in the first 1/3. Dunst was perfect and the subdued performance of Jason Schwartzmen is great."}, {"rating": "1", "text": "Aesthetically perfect; depiction of characters horribly superficial, void, really incomprehensible."}, {"rating": "10", "text": "It appears only certain people see the extraordinary intelligence and nuances of this movie. It is one of my favorites."}, {"rating": "4", "text": "Not total crap but hardly riveting. The film should have had a warning that its more about fancy costumes rather than MA and her place in french history. Looks like the only thing Sofia Coppola basically wanted was for people to sympathise with MA - why else would she not have directed the film in such a way that it also shows her death and how the masses in France were starving whilst she was leading a lavish lifestyle - after all, that's what she is most famous for and everyone associates her with the gallows. Trendy music and moving camera's worked in Lost in Translation cos it was in a modern trendy place called 21st century Tokyo - but to try and apply a rock based pop art soundtrack and camera movements to a slow anti-climatic period drama costume set doesnt really work - but at least we now know what to expect in a Sofia Coppola directed film. Tarantino car boot trunk shots she will never achieve!"}, {"rating": "1", "text": "Sofia Coppolla totally dropped the ball on this one. Her first two films are nothing short of amazing. This is one of the most boring, uninspired works of garbage I have seen in ages. The art direction and visuals are intersting but there is nothing that will keep your interest for 2 hours. I think I would have rather watched paint dry!"}, {"rating": "9", "text": "Marie Antoinette is a difficult film to review. To start off, though, I will say that it's certainly not better than Lost in Translation, which very well could end up being Coppola's masterpiece. But then again, Marie Antoinette is a change for Coppola on multiple levels - here she proves her artistic versatility and sometimes that's more reassuring to fans than another brilliant film on par with Lost in Translation. What sets Marie Antoinette apart from the majority of its contemporaries is its sheer bravery. I mean, one scene featured Marie running away from a gathering with The Strokes blasting in the background! Indeed, artistic bravery is admirable, yet here it is far more than admirable because one of thing: it succeeds. The film also hosts a powerhouse performance by Dunst, who, like Holly Hunter in The Piano, does not rely upon verbal forms of communication"}], "recommendations": ["annette", "the_great_gatsby", "youth", "roma", "amadeus", "the_favourite", "moulin_rouge", "hugo", "memoirs_of_a_geisha", "casablanca", "the_neon_demon", "barry_lyndon", "alexander", "perfume_the_story_of_a_murderer", "phantom_thread", "in_the_heights", "bohemian_rhapsody", "the_sound_of_music", "the_green_knight", "black_swan", "the_bfg", "ratatouille", "la_la_land", "braveheart", "cloud_atlas"]}