{
  "id": 4598,
  "title": "Mark Felt: The Man Who Brought Down the White House",
  "starring": [
    "Liam Neeson",
    "Diane Lane"
  ],
  "runtime": 103,
  "genre": [
    "Drama",
    "History",
    "Thriller"
  ],
  "description": "The story of Mark Felt, who under the name \"Deep Throat\" helped journalists Bob Woodward and Carl Bernstein uncover the Watergate scandal in 1974.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fyL7sKgNOMA2o5xesE0d629Sx7F.jpg",
  "categories": {
    "plot": 5.083333333333333,
    "acting": 5.111111111111111,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 5.333333333333333,
    "funny": 5.0,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "5",
      "text": "There is simply no momentum in the film. The story is fascinating and the acting is fine, but it could have been more tight, personal, and riveting."
    },
    {
      "rating": "5",
      "text": "What a letdown - Liam Neeson in a more meaty role than usual. His one note acting really disappointed. Direction lacked dimension, the story was predictable. The script and director had a good message, but they didn't land it well because everything else in the film was lackluster. The most middle of the road movie you'll see this year."
    },
    {
      "rating": "6",
      "text": "Never as thrilling as it could be, nor as snappy as THE POST, it still has an interesting insight into the power of Hoover’s FBI and the extent of the Watergate coverup."
    },
    {
      "rating": "10",
      "text": "My boyfriend and I really understood the dilemma and trauma one goes through when working with someone who is breaking laws. We were helpless because we were not in a position of power like Mark Felt was. Watergate was not a time to go through endless investigations and then a long trial trial. Having the media expose wrongdoing was the fastest way to stop Nixon. This movie shows why the media is often more suitable than a grand jury because things get done quicker. We need heroes like Felt today."
    },
    {
      "rating": "7",
      "text": "This is not the best film made from the watergate scandal. That said it wasn't totally bad. The story is done in a fair manner but you feel it's missing key elements regarding historical data. I think they tried to simplified it too much. That said the acting was the most interesting part. Liam character is subtle in terms of emotion, giving only small gestures. It may seems one key note acting, but it's more putting a facade to protect itself. We get a brief glimpse into his personal life, maybe not enough. I give it a 70% for the acting, but I wasn't impress with the over simplification and how the film is edited in general."
    },
    {
      "rating": "6",
      "text": "Taking into account the theme, its subject and the general environment of the story I can say that that is the most relevant stuff about it but the film itself doesn't really offer substance or something more attractive."
    },
    {
      "rating": "5",
      "text": "Neeson is very one dimensional in this film and lacks the kind of lustre that someone portraying the role of Mark Felt should have. I can't help but think this movie would have been better with someone as in the role. Not to say that Neeson can't act but I feel that his talents have dumbed down a bit because he's been in mediocre comedies and action films for the last several years. He hasn't done a serious drama in a long time and it shows.Now as for the movie, It's not bad. They do a good job explaining things for those that aren't as informed about Watergate as others but I don't think it'll offer anything new other than a nice dramatization of events for those very familiar with the scandal. It's not a bad movie at all, It's certainly watchable but I think it could have been better."
    },
    {
      "rating": "4",
      "text": "While this is an important story and person in US history and he should be remembered and his story told, I just dont see it being made in a movie - the movie ended up being very slow paced and boring and really not that entertaining. Liam Neeson was good and I managed to watch it all, only because of it I give it a 4. I mean acting and story is all ok, but it feels just boring when watching it"
    },
    {
      "rating": "2",
      "text": "Plodding, ponderous, dreary account of a career FBI agent who took it upon himself to feed information to the press about a relatively inconsequential political dirty trick blown up into a national scandal by the Nixon White House's attempts to cover it up.  Over the course of the movie, I found myself caring less and less about the hero of the story, his wife, his daughter, or any of the political operatives with whom he interacted.  I guess it is difficult to make high drama about an emotionally stunted bureaucrat periodically slipping into phone booths to leak information to willing recipients who proceed to publish it.  The production values--intended, I suppose, to create an atmosphere of clandestine underhanded dealings and suspense--just became an annoyance that contributed to the film's general monotony.  I am a political junkie fascinated by intrigue and scandal, but this movie was a huge turnoff."
    },
    {
      "rating": "6",
      "text": "In short: it's a chore of a movie. It just doesn't feel to have the tension that Mark Felt had, and it's not immersive at all. Not even to mention the fact that the movie is not fun what so ever, and most importantly not entertaining. It's a serious movie and does that well, and pretty much this is the only thing that it's done great in this title. The acting and the script was all right, but could have been so much better. Still the cinematography was amazing, and very clever. But the plot it's not interesting enough for general audience. More over it's hard to understand it all, if you don't have the necessary background. Overall it's a slightly above average movie, because there are a couple of things that where done great, but the rest just lacking immensely."
    }
  ]
}