{"id": 2344, "title": "Marriage Story", "starring": ["Adam Driver", "Scarlett Johansson"], "runtime": 137, "genre": ["Drama"], "description": "A stage director and an actress struggle through a grueling, coast-to-coast divorce that pushes them to their personal extremes.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/2JRyCKaRKyJAVpsIHeLvPw5nHmw.jpg", "categories": {"plot": 7.185185185185185, "acting": 7.788461538461538, "ending": 8.5, "soundtrack": 0.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.25, "action": 8.6}, "reviews": [{"rating": "7", "text": "It’s a poor mans version of Kramer vs Kramer.  It doesn’t have the tension of Kramer.  It is too amicable for me.  Adam Driver can’t get away with just being a pretty face like Johansson.  he has a constant sadness which makes the movie worthwhile."}, {"rating": "10", "text": "yeah i really ain't gonna lie, i thought i had no emotion but... i cried :/"}, {"rating": "6", "text": "The acting is solid all around (though Scarlet J may have been a bit out of the rest of their league), but I felt like I've seen this movie before. It feels like a Los-Angeles-i-fied Kramer vs. Kramer, but without the true stakes. There are a couple of excellent scenes in this film, but the rest of it is only so-so."}, {"rating": "10", "text": "Excellent movie, with the best performances of the year, and with a direction that brings a strongly exciting movie. Best movie this year."}, {"rating": "9", "text": "Some people may like the ending, for me it wasn't fully satisfying, but that is about the only complaint I have about this perfectly acted, randomly hilarious and fantastically scored film. One of 2019's best."}, {"rating": "0", "text": "Except from Adam & Scar Jo (10 min Oscar-Worthy Performance), this movie is absolutely pointless & mediocre.Waste of time.One of the most Overrated & Overhyped movie of 2019."}, {"rating": "10", "text": "Simply stunning. Maybe the best movie of the year. If you like dramas, you will be missing out if you do not see Marriage Story!"}, {"rating": "0", "text": "Filme Oscar Bait preso em uma narrativa que já vimos no cinema. Colocar humor em momentos que não deveria está e levando muito a serio situações triviais. Um filme bem canastrão para pessoas que batem palma para qualquer coisa com uma roupagem indie e cool"}, {"rating": "0", "text": "I don't think I have ever gotten through one of Baumbach's depressing movies. The Squid and the Whale, Greenberg, turned them both off 30 minutes in. This looks like more of the same. It's HEAVY and SAD, therefore it must be DEEP. I know I will hate it so I will not watch it. Because Baumbach's movies suck. But hey. Knock yourself out. :) Waiting for Wes Anderson's and the Coen Brothers' next movies to come out."}, {"rating": "0", "text": "Remake Millenials de Karmer Vs Kramer.Extremamente chato e sem vida. Laura Dern faz mais do mesmo , ScarJo aprendeu a usar colírio para simular choro e o roteiro beneficia covardemente o Adam Driver."}, {"rating": "3", "text": "An intimate and well-acted film about a journey from marriage to divorce that isn't really more than a high-end documentary. Marriage Story aspires to show the viewer the real emotions and situations of what can actually happens in divorce so you're not going to get a plot twist. The movie essentially sides with the wife as they add the unforgivable bombshell that he has cheated on her. It also never lets him respond to the allegations that he is a smothering, self-involved idiot. She is portrayed as completely justified in blowing up the marriage and dude has to suck on the pain.It's mostly depressing. Any joy or comedy is quickly snuffed out with a new sorrowful revelation. Marriage Story revolves around the emotions and I cannot help but forever process the reasons and details which seemed one-sided and flaky."}, {"rating": "5", "text": "Look, the professional critics are right: beautiful script, well acted and directed. However, I'm afraid I have seen enough Woody Allen movies about the problems of LA/NY relationships to last a lifetime.  Didums, address some real issues instead of navel gazing...again"}, {"rating": "9", "text": "Marriage Story is an instant classic and the best film I’ve seen in years. Everything about this film blew me away. Adam Driver and Scarlet Johansson have turned in career-best performances. Laura Dern is a revelation, and Ray Liotta is quite good too. And then there’s writer-director Noah Baumbach, who truly has outdone himself (I have not seen all of his films, but this is by far the best that I have seen). The direction is outstanding. Perhaps the most exceptional quality of the film is the writing, which is truly ingenious. Not only is the screenplay really moving, but it’s also hilarious; I laughed out loud frequently. I also love how unpredictable and quirky the screenplay is, which serves to make the action and dialogue more realistic, believable, and endearing. The writing and direction remind me a lot of Woody Allen, yet Mr. Baumbach manages to forge his own unique style. This film also reminds me a lot of Kramer vs. Kramer, but I think Marriage Story is superior. This film is sure to be honored at most, if not all, of the awards ceremonies. I for one think that it should win Best Picture, Best Director, Best Original Screenplay, and at least three of the acting categories (actor, actress, and supporting actress). Obviously, I have not seen all 2019 awards show contenders yet, but I will be very surprised if a film comes out during the remainder of the year that is better."}, {"rating": "10", "text": "Heartfelt, incredible movie. Noah Baumbach has always created wonderful movies, but this is his peak"}, {"rating": "9", "text": "“Marriage Story” was written and directed by Noah Baumbach (“The Squid and theWhale”) and is, like his prior work, semi autobiographical, as he tells the story of a failed marriage and the lingering affection and feelings that remain throughout the issues and problems facing a divorcing couple with a child they both love.Scarlett Johannson was never better as she interacts with her ex-husband- to- be exceptionally well played by Adam Driver. Remembering that Mr.Baumbach’s background as a child of two divorced parents and the ex-husband of Jennifer Jason Leigh, it is easy to understand where his allegiance lies amidst the two parents vying for the affection of their son. As is so often the case where the writer and director are one in the same, this film could easily have used the input of a third party to edit and minimize lengthy scenes and dialogue as well as a choice in casting (since some of the characters appear to be more like stereotypes than real life individuals). One might argue that these lengthy oratorical performances by the characters gives them an opportunity to exhibit their acting wares and, true as that may be, it adds to the length of the film which could be shorter than its 2 and ¼ hours. All that being said, I give the film a 9.0 because it is a heartfelt and brilliant dissection of the divorce process, those who exploit it and those who are victims of it as written and directed by one of its vital participants."}, {"rating": "9", "text": "LIFF33 2019 #1“I never really came alive for myself; I was only feeding his aliveness.”I’ve said some harsh things about Netflix movies in the past, but recently I’m starting to warm up to them.‘Marriage Story’ was absolutely excellent. A devastating portrayal of divorce that can bring out the ugly in people, especially with child custody. But it’s not all doom and gloom. It’s incredibly heartfelt with plenty of humorous moments. I guess you have to find the comedy during the difficulties in life. Lets just say my cheeks wasn’t dry afterwards.And yes, I wept.Adam Driver and Scarlett Johansson both gave masterclass performances. And I do mean some power house acting. Driver plays Charlie, a competitive and undaunted theatre director that he is very clear about what he wants. Johansson plays Nicole, a mother who’s a delightful presence and loves to play, but is also a dedicated actor. This is the best I’ve seen from Johnasson. Her character delivers a monougle where she’s explains the issues in her life that’s all shot in one take, which brilliantly displays her acting chops where she naturally shifts from emotion to emotion - it was impeccable.The supporting cast were all fantastic. Lauren Dern, Ray Liotta, Merritt Wever, Julie Hagerty, and Alan Alda were all brilliant and really bounce off the energy from Driver and Johansson. Even the child actor held his own between these juggernauts of actors.Not only are the performances the strongest element of the movie, but so is the writing. Every character is so uniquely fleshed out that the conflict feels so incredibly raw. It’s one of the reasons why I was so glued to the movie from start to finish. One of the best screenplays of the year.This is the first Noah Baumbach movie I’ve seen from him and I am aware of his other work, just haven’t got around to watching them. However, I feel like this was the best introduction to him as a director, because he crafted such a sympathetic look on marriage dissolving away. We don’t see the full relationship, but we do get to hear Nicole and Charlie individually describe what their love about each other, while there’s a montage that flash’s through their routine life together with their son. Nothing visually striking in the presentation, but not once did it feel stale.The score from Randy Newman was terrific and fitted wonderfully with the movie. I loved the aspect ratio as it added a lot to the overall mood of the movie. When the two go head to head in the custody battle - that doesn't mean they’re enemies. They still talk to each other as if they are still a thing. It’s also hard to pick aside, because you understand where each of them are coming from, and even if you do choose, you still feel bad for either one.Overall rating: Any other relationship movie aint sh*t compared to this."}, {"rating": "10", "text": "Marriage Story is one of Noah Baumbach's best films, and perhaps one of the best movies of 2019. Everything about this movie is incredibly compelling. I laughed. I cried. I was on the edge of my seat as I watched the best and worst of a human relationship unfold over the death of a marriage.The element of Marriage Story that shines above the rest of the movie is the acting performances. Scarlett Johansson and Adam Driver give the best performances of their careers, and Adam Driver in particular proves that he is one of the best actors alive today. His portrayal of a father going through the ringer in an attempt to protect his son broke my heart. He goes through every possible emotion flawlessly, and he is so vulnerable you can't help but feel for the guy.The script is a work of art. There are no good guys or bad guys. No one is right or wrong. Everything is a very human shade of grey, and the story just made me think about how I view my own romantic relationships. The score is beautiful, with a very surprisingly well utilized Stephen Sondheim ballad that anyone with any theatre history will recognize immediately.The cinematography is pure kino. The way space and barriers are used is just beautiful. Its very subtle, but its there. Its implemented wonderfully.This is one of the best dramas of 2019. It's definitely get some acting award buzz. I think this movie will resonate and remain relevant well into the future. I've already made plans to see it again."}, {"rating": "1", "text": "If this movie is nominated for anything, it should be for the most boring movie of the year."}, {"rating": "9", "text": "Yet another movie featuring a filmmaker baring their soul for the audience to celebrate, lament and understand, Noah Baumbach's \"Marriage Story\" follows in the footsteps of movies like \"Lady Bird,\" \"Roma\" and the very recent \"Honey Boy\" in that it's not just an undeniably personal exercise. It's also a supremely well-executed artistic experience on a structural, dramatic, thematic, and technical level. It's rare to have a film operate so meticulously in its characterization process, yet remain so fascinating and emotionally impressive. In many other films, you'd label it a potential issue to have your average scene length be somewhere between 7-10 minutes, and to have most of those scenes involve characters simply talking to one another. But these are very carefully constructed moments of build-up, allowing the audience to breathe these characters in and empathize with every action taken and word spoken, no matter how hurtful or diabolical it may seem on the surface. At the end of the proverbial day, we find we're dealing with nuanced human beings trying desperately to navigate their respective ways through a tragic phase of existence (a kind of death, as the movie so aptly puts it). It's sad, heartwarming, brilliant, and earnest -- an experience I know I'll carry with me for some time."}, {"rating": "6", "text": "Didn't like the pace with numerous scenes protracted without adding much, if anything, to the story. Acting was really good, but I didn't care for the characters much. Felt that the husband's character was somewhat disjointed. Egocentric and detached on one side, in denial and fighting for custody for some reason on the other. Overly long, sad and actually boring."}, {"rating": "6", "text": "Um dos principais problemas do filme está direção: os planos escolhidos não fazem sentido para as cenas e constantemente deixar a cena no rosto de um personagem se torna cansativo; este elemento só funciona quando é pontual e o elenco está perfeito... O elenco aqui é bom, mas não o suficiente. Em alguns momentos os dialogos entre o casal parecem desconectados com a própria; parecem falas jogadas no ar e que não demonstram uma construção plausível e orgânica."}, {"rating": "9", "text": "Beautiful movie with no new morality for me. Impressive actor's play, macro-position for shooting and deep story of marriage life that many couple may have. Also, this is one of new picture for remining about basic rule of relationship"}, {"rating": "9", "text": "Wonderful,stunning,striking,outstanding perfomances. I won`t get tired of telling how great 2019 for films. I can`t say that there is a great screenplay or plot,but nevermind,there is an ordinary plot and screenplay.It focused on perfomances ,which are realy outstanding ."}, {"rating": "8", "text": "Well, at least Adam Driver was in one good movie in 2019. This is a really solid Netflix Original drama. It’s really well-acted, the writing is excellent and the story is engaging. It deals with some pretty tough subject matter, it’s about a couple going through a divorce, but it also has light moments of comedy. It feels very realistic. It’s also really well-shot and well-edited. This is one of those rare movies where there really isn’t anything bad about it at all. Well, maybe the score is a little weird and distracting sometimes. It’s composed by Randy Newman and sounds right out of a Pixar movie. Wallace Shawn of The Incredibles and Toy Story fame is even in it. It seems out-of-place sometimes, but the rest of the movie is so good I think I can overlook it. Overall, this movie is a must-see and I hope it wins some Oscars!"}, {"rating": "10", "text": "Wonderfully written with superb acting. Unexpectedly funny in all the right places."}, {"rating": "10", "text": "This movie unearths a range of emotions from both the main stars, Johansson and Driver. Although it is a divorce the movie focuses on, it is not all that it contains, as it ebbs and flows throughout different moods and feelings of both parents, bringing the audience along with them. It makes the audience switch allegiances with every word each scene, and leaves us feeling just a little helpless. It has many beautiful moments and meaning in almost every scene, and it is undoubtedly a must-see. If this movie does not get Oscar-nominated, then the world doesn't make sense anymore."}, {"rating": "10", "text": "Less is more. Emotional and devastatingly real.  Best performance. Greatly written."}, {"rating": "9", "text": "9/10. The only part that upset me was the ending. But honestly the ending really went along with the realism of the movie. These 2 actors should do many films together they were wonderful together.  I obviously love Scarlett j. I even named my daughter after her. And I remember Charlie on Girls. Which I love his style in acting hes very good and deserves more recognition."}, {"rating": "9", "text": "Fantastically truthful acting. Director has a very unique style which I really enjoyed. Didn't quite reach the height of emotion I thought it would be I think that restrained version was the point. Great movie"}, {"rating": "0", "text": "The term overrated definitely comes to mind. Besides Adam Driver's performance this is a mediocre movie at best. They are getting a divorce, we get it. It's frustrating and painful to watch like nails on a chalkboard. Yet doesn't have much to say other than our laws and process for divorce are terrible. It's quite disgusting how the process typically plays out in these cases."}, {"rating": "10", "text": "Great screenplay, jaw-dropping performances, memorable score... everything here’s just so beautifully made that it’s hard not to love this movie. Please, give Driver, Johansson and Dern their Oscars!"}, {"rating": "0", "text": "(Mauro Lanari)Since statistics show that \"arranged marriages\" last longer than \"love marriages\", this nineteenth-century and Victorian invention of ours would deserve at least a minimum of deepening. The suggested hypothesis is that interpersonal affective relationships can't not fail because, before that, there would be an unresolved infrapersonal conflict, the \"Spaltung\" a.k.a. inner splitting. Therefore a mumblecore that merely describes the phenomenology of such failure as already too many previous film is just useful to mitigate the frustration of those who identify with the couple of protagonists."}, {"rating": "6", "text": "I would rather call this move \"Divorce Story\": it is more about marriage falling apart that about marriage per se. I was looking forward to watching this film as both critics and audience seem to love it. Plus I like Scarlet Johansson and Adam Driver. Maybe my expectations were a bit too high. Or maybe one to have to live though a diverse themselves  to have an empathy. Because I did not have much.I enjoyed a few episodes but not the movie as a whole. It felt like director-writer's own experience which I am not sure was true. Performance-wise I liked Scarlet's and Laura Dern's but not as much Adam Driver's. His singing was better than his playing but I don't think it was his fault.Not to say that the movie was not good but the hype is definitely not justified."}, {"rating": "10", "text": "One of the best films of the year - if not THE best - it is also one of Baumbach's finest."}, {"rating": "9", "text": "Noah had me choked up for the entire runtime of his thundering masterpiece. This profound experience is so rare, that it has happened to me only once. In Marriage Story.Marriage StoryThe writer and director, Noah Baumbach is spewing love. Not the usual way of expressing. But then, miscommunication is a major factor in this film. He is sugar-coating or bitter-coating a love story, by deconstructing, reverse-engineering a love story. Although that is what it seems at first. The film, above all, wonder me the most, is when it balances both sides of the coin. Every now and then, I think about what happened, why we are here, just as those characters do. It all makes sense and nothing fits despite the description, the definition. And still you don't feel cheated. And Noah dodged that bullet so effortlessly that you- at certain points in the film, even when there is no particularly emotional hurdle to cross- melt with a cathartic smile and tears, in its simple wittiness. The film deliberately follows Adam Driver's perspective. Now, that is a perfect choice, considering he \"is walking on\" something that he doesn't fully understand, just like us, the audience. Hence, he comes off warm and even pitiful at times, more than he actually might be or should. For following Scarlett Johanson would have come off calculative rather than spontaneous. Not something that the film wants to put out. It is vulnerable phenomena to be in. And to experience it, you should be out of control. Desperation is what drives the greed. And greed, something you keep it off the table from Day 1, is what it will come to. Not materialistic but philosophical. You'd want to be how you think of yourself to be. And in these scenarios where you are highly conscious of your decisions and acts. Legacy (Henry, in their case) is what you hold on to or at least fight for, now that you are sober."}, {"rating": "7", "text": "Great performances by Adam Driver and Scarlett Johansson.  Some very good dialog.  There a couple of unnecessary scenes.  And it drags in a couple of spots.  But, overall, it is a good cinematic experience."}, {"rating": "2", "text": "There's still an hour and thirty minutes left but I'm here because I feel sad in my not liking this so far. So thumbs down away! I was excited to see this because of the trailer, but I'm pretty sure everything in the trailer has already happened and now it's like this, people saying how they feel like it's interesting when it's not. I can't pay attention to anything they're saying, I just keep thinking: straight people problems. I was worried this might happen, seeing how I hate straight people. But I definitely hate these straight people. Spoiler alert! Her mom's exhusband is not only gay, she caught him blowing a guy, which is an example of how the jokes work here too, not just some kind of... it's not homophobia. It's just like.... you know, those straight people I hate who make fun of gay people because they're friends with gay people. It's the gaffer character who says he feels comfortable saying what he does because he was raised by two women, only it's like that guy wrote a movie about marriage called Marriage Story and now I'm not watching it because it's so boooooooring these poor rich straight people have so many problems. I'd rather be watching Love Island at least they're self-aware about how **** what they're saying is **** life"}, {"rating": "0", "text": "Last night I watched the first twenty minutes of Marriage Story. I love everyone involved in the movie so expectations were very high. But immediately, (IMMEDIATELY) the intrusive, BUSY musical score started to drive a nail into my head. Here were two monologues; letters written by the lead characters about each other. They were smart (if a little precious) and heartfelt and full of nice details. However, the entire time Adam Driver and Scarlett Johansson were speaking, this wall to wall orchestra kept sawing away, frolicking and gamboling like a Rossini overture underlining the moments with 'whimsy' and the promise of 'heartache.' Like a bright yellow highlight pen, the music left no room for independent thought: I was being told exactly how to feel about every second. But I got through the opening bits; although I didn't quite buy any of the director/actor theatre scenes- Why is that no one ever seems to be able to capture the truth of what it's like to do small theatre? Those ridiculous rehearsal scenes were painful in their ostentatious inauthenticity...and don't get me started on the actual performance of the play. It was almost exactly like that old SNL sketch \"Bad Conceptual Theatre\" - If only Dan Aykroyd had stepped out as Leonard Pinth Garnell to give a review - Even more hilarious was the discovery in a later scene that this awful slice of \"high art\" was slated for Broadway. In what universe? But I stuck with it until the scene where Scarlett Johansson reminds her husband that she finds it difficult to cry onstage only to walk into her bedroom and burst into tears. This is a moment that should've wrecked me. It's beautifully set up, and would have been totally unexpected and rending. But at she walks through the hallway towards her bedroom, the score whips up into a Soap Opera ready string-filled cry of anguish so generic it could have been used for that old Carol Burnett sketch As The Stomach Turns. The camera pulls in to show Scarlett's tear-filled face - but any empathy is immediately sucker-punched to the ground by the hideously OVER THE TOP music.Cut to: this morning as I scanned through the Golden Globe Nominations. Not only is that exercise in bathos and banality actually nominated for Best Original Score... It was written by none other than Randy Newman. Bummer.If I make it through the movie it will be with the sound off and the subtitles on. I like to decide how I feel about things. I don't need to be smothered in kisses to know I am loved. And I don't need to be swaddled in a treacly, syrupy, honey-laden, jokey, telegraphing soundscape in order to understand that sadness or joy are on display. I'm pretty sure I'm smarter than that. My CATS are definitely smarter than that. It's no coincidence that Bennett coughed up three yards of hairball during the first thirty seconds of the movie."}, {"rating": "1", "text": "No me gusto la pelicula, me dormi a la mitad de ella y desperte casi para el final que ugh..."}, {"rating": "8", "text": "Adam Driver plays a promising New York theatre director and Scarlett Johansson is his actor/wife. When she gets an offer to work in LA, it makes their impending separation much more stressful. There's more focus on the husband, perhaps because his situation is more disruptive or because writer/director Noah Baumbach based this on his own experience. As a result, Driver is given the bulk of the heavy lifting and his character's dilemma (and his performance) is absolutely heart breaking. Johansson also does a fine job, along with a wonderful supporting cast, esp. Laura Dern and Alan Alda. It's good that they both play their attorneys, because the legal angles tend to drag down the emotional development. As their young son, Azhy Robertson is exceptionally natural. The film is slightly longer than it needed to be, but the subtle, excellent performances and Baumbach's skilled observations combine to create an affecting examination of the pains of divorce."}, {"rating": "1", "text": "Marriage Story scored an extraordinary 94 on Metacritic and 96 on Rotten Tomatoes. One critic declared it is 'easily the most compelling divorce story since Kramer V Kramer.' I suppose it depends on what you consider compelling. There are plenty of other films about divorce but the one that springs to my mind is Todd Haynes' 2015 film, Carol, impeccably cast, acted and shot. Carol received a 10 minute standing ovation at Cannes that year and scored 95 on Metacritic, just one point more than MS (though Carol is a far superior film in every sense). There are a good deal of curtain-chewing and adult tantrums in MS but these don't disguise the fact that there is very little 'story'. MS is well acted but the characters don't really have much to work with. Their marriage has real problems, certainly, but good grief, what marriage doesn't? Basically, they need to talk more; she needs to be more assertive and he needs to listen and make compromises. Instead, they wind up paying absurd amounts of money for something that could easily have been worked out with more mediation. No doubt this happens all the time, but do we really need to witness the histrionics? Put simply, Marriage Story is mush in the same way that the weakest Woody Allen movies are mush. If you engage with that kind of jump-improv, indulgent, pseudo-self-analysis; if you like watching dewey-eyed, beautiful couples who have an almost perfect relationship talk themselves apart (leaving their oddly untraumatised child apparently saner and happier than either of them) then break out the popcorn and paper hankies. You're in for a treat."}, {"rating": "10", "text": "Marriage Story is a haunting and powerful look into divorce, love, and the human experience of balancing family and career. Noah Baumbach's direction is spectacular, while all the performances (specifically Driver's though) are superb. The story this film tells is heartfelt and truly relatable to anyone who lost any kind of love at any point in their life and even more so for those who've experienced a divorce firsthand. I was left with teary eyes by the end and although some are unsatisfied with the ending, I feel it was rather cathartic and human, as things cannot be wrapped up in a neat bow in life. I was amazed by Marriage Story and I certainly hope it gets the credit it so rightfully deserves come awards season."}, {"rating": "8", "text": "In this drama from director Noah Baumbach, Adam Driver and Scarlett Johansson play an embittered couple on the cuff of a spiteful divorce. Driver plays a New York-based theatre director traveling back and forth from there to LA where Johansson's character primarily lives as an actress that started out in film but now does theatre to support Driver. Any film that deals with divorce automatically hits close to my heart, as I come from divorced parents. I'm always interested to see how it will be portrayed differently in each film. And I gotta say, I think the last time I watched a divorce film that was so raw and honest about divorce was 'Blue Valentine' from 10 years ago starring Ryan Gosling and Michelle Williams. And while this one isn't quite as dismal and bleak as that one was (there are some endearing moments to be found in this one), this one still managed to portray all of the nitty gritty details and pitfalls that accompany long and bitter divorces. On top of that, Driver and Johansson deliver what I'd easily consider to be Oscar-worthy performances. Laura Dern also particularly shines as Johansson's divorce lawyer. Overall, while it's certainly not the first film to deal with divorce in great detail, it still gives a pretty unflinching look at the toll it takes, and that was more than enough to make it stand out to me."}, {"rating": "9", "text": "Adam Driver and Scarlett Johansson deliver Oscar-worthy performances in the relatable and heartbreaking \"Marriage Story\"."}, {"rating": "8", "text": "Marriage Story is a great display of acting as Driver and Johansson put on a clinic in this film. For two hours, you watch them go through every conceivable emotion, and you believe them in every moment. The supporting cast is great as well. The plot is simple, but that doesn't really hold the film back. My only complaint is that both characters are so financially successful that the money doesn't really come into the picture, except for a few lines where Driver complains about how much money he's spending on his lawyers. I would have liked to see the two of them making some really difficult financial decisions, like the ones people would face in a real divorce."}, {"rating": "9", "text": "An incredibly real look at a how a marriage ends and how a divorce can effect people. Adam Driver, Scar Jo, Laura Dern and Ray Liotta were incredible in this wonderfully directed  story of a failed marriage, the affection and feelings that remain throughout as well as the issues and problems with a child involved that they both love and want to spend time with. It even shows how even the most amicable separations can be complicated by lawyers with agendas and how even throughout all this, a family can remain."}, {"rating": "10", "text": "Ne yazsam bilemedim, övülecek o kadar çok şeyi var ki, başyapıt olmuş, oscarları toplar gibime geliyor."}, {"rating": "9", "text": "Amazing movie. A must watch for everybody who had live a long relationship."}, {"rating": "9", "text": "While some have somewhat correctly said that this film covers ground that's been addressed before and that it occasionally tends to play like both a therapy session and a legal consult, writer-director Noah Baumbach's latest nevertheless offers viewers an engaging mix of heartache and humor, showing the pain and utter absurdity that goes into the dissolution of a marriage. The truly superb ensemble cast, with excellent performances by Scarlett Johansson, Adam Driver, Ray Liotta, Julie Hagerty, Alan Alda and, especially, Laura Dern, coupled with a razor-sharp script, makes for a dynamite combination that reaches out, grabs and holds audience attention from beginning to end. Arguably Baumbach's best film, this offering is more than deserving of all the praise that it has rightfully had heaped upon it. You'll laugh, you might cry and you'll definitely feel the heart strings tugged with this one, but the picture assuredly earns the reactions it evokes. Go see it in the theater or catch it on Netflix."}, {"rating": "10", "text": "Best film I’ve seen in a while and my favourite from 2019 so far. Way more realistic, captivating, gut-wrenching and well paced than say, The Irishman, for example. That film was a nice piece of rich storytelling, slightly over-indulgent in its duration, but Marriage Story just resonated with me more. To be honest, I don’t think 2019 has been a great year for film. Preferred last year’s releases (Roma, The Favourite, A Star Is Born, Green Book, etc) I’m hoping on this Marriage Story winning big at the Oscars. It’s superbly acted, that conflict scene at around 1:30hr in to the film was top class. Excellent writing, directing, and yes, the ending was a beautiful end to the journey witnessed onscreen. I don’t get how anyone couldn’t like it, but then again, I found the ending to The Sopranos and Breaking Bad great. Both are polarising endings."}], "recommendations": ["blue_valentine", "manchester_by_the_sea", "the_descendants", "collateral_beauty", "joy", "revolutionary_road", "blue_jasmine", "fences", "gifted", "scent_of_a_woman", "closer", "the_father", "me_before_you", "the_intern", "the_place_beyond_the_pines", "the_danish_girl", "the_fault_in_our_stars", "silver_linings_playbook", "leaving_las_vegas", "the_glass_castle", "21_grams", "rain_man", "call_me_by_your_name", "lady_bird", "lovelace"]}