{
  "id": 3834,
  "title": "Marrowbone",
  "starring": [
    "George MacKay",
    "Anya Taylor-Joy"
  ],
  "runtime": 111,
  "genre": [
    "Thriller",
    "Horror",
    "Drama",
    "Mystery"
  ],
  "description": "A young man and his three younger siblings are plagued by a sinister presence in the sprawling manor in which they live.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ykn2GWDINcbunWPoNVRQtMaybo7.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 4.571428571428571,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Although slow and not entirely original, the film eventually builds to a great story. For fans of whimsical supernatural horror, not heavy on the guts and gore."
    },
    {
      "rating": "10",
      "text": "A very good movie. The end twist was very well executed. It always keeps you suspense."
    },
    {
      "rating": "6",
      "text": "Not that great, not bad either. It's not really a horror movie. And the ghost parts are too subtle to be scary or interesting.So, the movie isn't about that. It's about the story. Which is fine, if it was an interesting one. There are certain parts that made me pay attention a bit more than other parts. But ultimately I felt bored 75% of the time. It's one of those movies that explains the plot points along the way. So until you get to those \"Aha!\" moments, you don't really know what's going on. And that made the movie come off as confusing for at least the first half of it. But at the same time, when something is revealed, it was also interesting enough that I paid attention. I just wish it didn't drag along so slowly to get to those parts."
    },
    {
      "rating": "4",
      "text": "A Gothic horror movie that had such promise and potential it's frustrating to see it fall into that pile of instantly forgettable horror movies. The annoying thing about The Secret of Marrowbone is the story was there, it was dark and had a different take on the typical haunted house movie. Unfortunately nothing else seemed to be working and I found myself just wishing it would end already.As with most horror movies it begins with a family moving into an old creepy looking house. The Marrowbones are all set to start their new life, but the eldest child, Jack (George MacKay) must keep the death of his mother a secret until he turns 21 in order to make sure he won't be separated from his siblings. Yet their new house is not quite what it seems. And cue the ghostly activities and countless jump scares most of which have been spoiled by their own trailer. How many times have I said that while reviewing a horror movie? The Secret of Marrowbone moves at a slow pace, relying on the atmosphere to keep you engaged. Unfortunately it had no atmosphere. I sat there wishing I was reading this instead of watching it, at least that way I could erase the cheesy acting and the fact that it feels like a TV movie you'd tune into if you've nothing better to do. It moves from set piece to set piece in a series of choppy transitions, many of which don't make a lot of sense. Then there's a few scenes that are out of place altogether and yes I'm talking about that scene where yer man is standing on a cliff overlooking the beach in the middle of nowhere secretly watching yer man and yer one having a nice little date to which he practically turns green with envy. The story is the only thing going for it but I wasn't engaged and I wasn't scared. Not recommended, skip it."
    },
    {
      "rating": "2",
      "text": "\"What a way to waste such amazing performances (or in some cases, actors that just didn't have enough to perform).The movie isn't dumb, but the execution of what they do in it has been done before, and way better. We follow a family. Well, that's what the trailer promised us. But in reality, is the big brother that brings the whole story together. Anya Tayler is disgracefully wasted by being just one more of the cast and not a prominent part (Have these writers seen The Witch?). The movie has one great sequence at the start with the family working together and a nice score. After that is boring \"\"character stuff\"\" that, with the ending, is just a waste of time, really, and doesn't earn a second viewing.Being boring in a horror movie is one thing... but just to be clever? You're wasting my time.\""
    },
    {
      "rating": "5",
      "text": "Nothing special, even considering that it has a good cast, but on front of so many pathetic and simplistic disappointments of the genre, it stands out a lot."
    },
    {
      "rating": "4",
      "text": "This is a stupid movie where nothing happens, yet the concept and some of the execution was great. The lead can't act and neither can most of those cast as his siblings. Anya Taylor was the saving grace of the movie, but even she can't save this mess of a movie. She had an excellent performance that really brought act iii to life, yet the act was still mostly lifeless. The twist was an unexpected one, but then the movie had a hard time committing to it, and even still, logistically it has quite a few flaws. This being that if you know what the twist is and give any part of the movie any thought, then it all falls apart. There is so much tedious stupidity that the movie felt burdened and clunky. Nothing felt genuine, and once the father was finally revealed, he did anything but meet expectations. Logistically I don't think the movie would make any sense upon a second watch. Avoid this one, if you want a similar experience go and see insidious whatever or the sixth sense. The scene where the kids were playing risk was especially dumb."
    },
    {
      "rating": "4",
      "text": "Es previsible desde el segundo 1, para nada recomendable, intenta ser oscura y se queda en nada."
    },
    {
      "rating": "0",
      "text": "my boyfriend would rather watch it than spend time with me! my boyfriend would rather watch it than spend time with me! my boyfriend would rather watch it than spend time with me!"
    },
    {
      "rating": "6",
      "text": "It had a twist that I didn't see coming, which is rare. The cast is great, and all do wonderful performances. The cinematography is excellent. The story is interesting. Unfortunately the scare factor and tension is not what I was hoping it would be. Some of the execution of certain scenes could have been done a lot better in order to raise the tension. Ultimately I watched this movie for one simple reason, which is that two of my favorite actresses are in it: Anya-Taylor Joy & Mia Goth. They both gave excellent performances and on top of that the movie looked great and had a pretty satisfying twist / conclusion in my opinion. So I was fairly satisfied with it."
    },
    {
      "rating": "8",
      "text": "I reckon the creative talent but i'm not a fan. One expects some light entertainment/thrill from a movie. Otherwise there's plentyful of real historical atrocities to parse. It's also impossible to describe the movie without taking away the brutal twist plot and with it the whole interest. The worst is that it's probably a lighter version of the initial sadistical vision of the moviemakers, because there's lot of space to make it even more brutal. Developing the characters to make them sweeter, restoring a bit of hope after the revelatiion by making believe that maybe.. maybe.. for a while, making the brother into the bad guy etc. Not to mention that untouched meat in the attic which kinda seems illogical for a starving person. Luckily someone had the taste to stop it"
    }
  ],
  "recommendations": [
    "house_at_the_end_of_the_street",
    "shut_in",
    "i_see_you",
    "ready_or_not",
    "dark_skies",
    "old",
    "the_uninvited",
    "summer_of_84",
    "you_should_have_left",
    "insidious_chapter_2",
    "now_you_see_me",
    "devil",
    "chernobyl_diaries",
    "awake",
    "a_quiet_place_part_ii",
    "the_boy",
    "hereditary",
    "better_watch_out",
    "happy_death_day_2u",
    "dead_silence",
    "shutter_island",
    "countdown",
    "freaks",
    "eli",
    "man_on_a_ledge"
  ]
}