{"id": 4518, "title": "Mars Attacks!", "starring": ["Jack Nicholson", "Glenn Close"], "runtime": 106, "genre": ["Comedy", "Fantasy", "Science Fiction"], "description": "A fleet of Martian spacecraft surrounds the world's major cities and all of humanity waits to see if the extraterrestrial visitors have, as they claim, \"come in peace.\" U.S. President James Dale receives assurance from science professor Donald Kessler that the Martians' mission is a friendly one. But when a peaceful exchange ends in the total annihilation of the U.S. Congress, military men call for a full-scale nuclear retaliation.", "releaseYear": "1996", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/hll4O5vSAfnZDb6JbnP06GPtz7b.jpg", "categories": {"plot": 6.066666666666666, "acting": 5.363636363636363, "ending": 8.75, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.121951219512195, "action": 7.4}, "reviews": [{"rating": "0", "text": "Tim Burton made this? or was he just making an attempt at a modern Ed Wood film?"}, {"rating": "8", "text": "This was made as a parody to the sci fi films from the 50s and 60s it's a all out joke in a good way."}, {"rating": "10", "text": "This is the best movie ever. I do not care what anyone will ever say. This movie, it's just perfect entertainment. I was fully invested the entire runtime, I was never even aware of the concept of boredom throughout any scene. The actors know what movie their in, and they love it. It will never stop pissing me off how underrated Martin Short is.The only real complaint I have is Natalie Portman's character, who is just Lydia Deets again, but I dont care. I loved this so much, it's so funny, so odd, and so pointless. I get that people were mad this followed Burton's more serious trend of movies like Ed Wood and Edward Scissorhands, but I will never care a single time, ever. In conclusion, this movie is great, fight me."}, {"rating": "2", "text": "A total waste of time. Jokes were few and far between, and seldom funny at all. Tack those onto a threadbare, incoherent plot, and you have a recipe for disaster."}, {"rating": "5", "text": "If you're looking for a B-movie quality parody of B-movies with a bunch of well-known actors thrown into a plot-less confusion of a movie then you'll enjoy this! But if you are like me you'll just leave the theater after viewing it scratching your head saying \"What the hell was that I just watched?\""}, {"rating": "3", "text": "No real plot. The movie was all over the board. The scenes made good actors appear as amaturs."}, {"rating": "9", "text": "The aliens are upon us, and they do not come in peace! After a fleet of warships are spotted on their approach to Earth, the world leaders prepare to welcome the intergalactic invaders from Mars, but are instead vaporized by their laser death rays! Who will save us when MARS ATTACKS? Tim Burton's irreverent black comedy combines the high camp of a Roger Corman production with Sam Raimi's particular brand of \"splatstick\" humor for an end result that is nothing short of hilarious! MARS ATTACKS features an all-star lineup that includes Glenn Close, Pierce Brosnan, Annette Benning, Michael J. Fox, and many, many more playing ridiculous caricatures of our social and political figureheads. Academy Award winners Jack Nicholson and Rod Steiger stand out in particular as the two opposing heads of government. Nicholson plays the politically-correct President of the United States who overlooks the aliens' initial attacks as being a \"cultural misunderstanding,\" while Steiger gives us a taste of DR. STRANGELOVE as General Decker, whose hand is always on the button as he anxiously awaits the authorization to deploy his nuclear deterrents."}, {"rating": "5", "text": "As a big fan of Tim Burton's work, I went into this film with an open mind in spite of being aware of very mixed reviews surrounding it. That said, this film was painful to watch. It has virtually no direction and a plot as thin as 1/2-ply toilet paper. It's as if Burton and the team of writers completely phoned it in and relied on star power (there are a surprising amount of famous actors involved) to keep the project afloat. The kitsch appeal wore off after about 15 minutes. I can now say that I endured this movie; I will never do so again."}, {"rating": "4", "text": "An all star cast leads to Tim Burton's first sub par film.  This film has a who's who of talented actors and actresses, but unfortunately it has a silly script and ridiculous aliens."}, {"rating": "6", "text": "A very well constructed parody of 50's films. The effects are not convincing but are well created, plus the action filled story combined with comedy makes for a well rounded film experience---for what It's worth"}, {"rating": "1", "text": "Very disappointed in this movie. The destruction scene looks like a cartoon! The martians look like a cartoon!  At least Independence Day managed to be very good!"}, {"rating": "6", "text": "Mars Attacks tries too hard to be an intentionally bad movie. Even so, it still is charming and definitely nails the \"so-bad-that-it's-good\" category. Tons of cameos of stars that really shouldn't be in the movie at all.\r Overall:\rThis is a bad movie, no doubt about that. But, it is also incredibly charming and worth a watch for a quick tasteless laugh."}, {"rating": "10", "text": "Martians are look like completely not realistic graphics but a good plot"}, {"rating": "5", "text": "A goofy cultural artifact, Tim Burton's \"Mars Attacks!\" is a cult sci-fi comedy miscast as an elaborate, all-star studio extravaganza. The technically brilliant picture possesses a quirky insider tone that will appeal to specialized student-age audiences and older sci-fi fans but will fly over, under and around the general public.\r Although the intent and feel of the film, which is based on some rare Topps trading cards of the early ’60s, are very different from “Independence Day,” this pic’s belligerent aliens and massive worldwide destruction they unleash, including the demolition of Washington, D.C. landmarks, unavoidably remind of the blockbuster. Burton’s picture could even be construed as something of a satire of the summer’s monster hit, although it was clearly made with no reference to it.\r After a surreal curtain-raiser involving some stampeding barbecued cows, pic gets down to business quickly, as hundreds of hubcap-like, “The Day the Earth Stood Still”-style flying saucers approach Earth, and Americans, led by president Jack Nicholson, optimistically prepare to welcome them in friendly fashion.\r During the initial half-hour, as the world awaits the Martians’ landing, an assortment of characters in three distinct locations present themselves. In Kansas, there is a trailer-home family in which gun-nut son Jack Black heads off for Army duty while his misfit brother, Lukas Haas, mans the donut stand and looks after Grandma (Sylvia Sidney).\r n Las Vegas, a sleazy hotel entrepreneur, also played by Nicholson, is hatching a scheme for the biggest hotel yet on the Strip while wife Annette Bening swears off booze in favor of New Age enthusiasms. At the same time, former heavyweight champ Jim Brown, reduced to working as a Pharaonic greeter at an Egyptian-themed hotel, is plotting a return to his family, consisting of no-nonsense Pam Grier and two teenage sons, in D.C.\r But the main action is in the White House, where gung-ho general Rod Steiger, looking like Mussolini, and first lady Glenn Close urge the prez to nuke the visitors posthaste, while pipe-smoking scientific adviser Pierce Brosnan assures everyone of the Martians’ undoubted civility and goodwill.\r When the big day of the space invaders’ landing arrives, the Martian spokesthing, with its skeletal head, bulging, rolling eyes and enormous brain emerging atop a dazzling red robe, assures the crowd of military, led by Colin Powell-like general Paul Winfield, media, leftover hippies and New Agers that they come in peace — and then abruptly leads its cohorts in frying the assembled humans with ray guns.\r Despite this shock, the president invites the Martian ambassador to address a joint session of Congress, whereupon the politicos are promptly incinerated as well. Thus begins a full-scale war, with the Martians invading in force, laughing uproariously as they wipe out everyone and everything in their path and killing off a good many of the principals in the process. Ultimately, the least likely character in the piece is the one to find the aliens’ unexpected Achilles’ heel.\r But the picture is lacking in the uproarious humor that might well have ensued from the material, which instead inspires occasional laughs but, much more often, bemused fascination and wonderment at the bizarre imaginations and impressive skill of the filmmakers. Pic is loaded with wit, nifty little ideas and an extraordinary sense of design, but its allure is of quite a particular nature, much closer to that of “Ed Wood” than of Burton’s earlier, and far more commercially successful, works.\r For connoisseurs, then, there are many pleasures to be had; others may find the film amusing but hardly compelling. The affection Burton and his cohorts possess for the sci-fi of the Cold War era is unmistakable, and is conveyed here through a loving reinterpretation of the aesthetic of the period. Hats off to the exceptional production team, from production designer Wynn Thomas, costume designer Colleen Atwood and lenser Peter Suschitzky to the many special- and visual-effects hands, who have done a superlative job making deliberately cheesy and artificial effects look seamless and utterly convincing. Music also plays a key part in the proceedings, from Danny Elfman’s patented fun-house sounds to some mordantly used pop tunes.\r The insidious little Martians are great fun to watch, especially as they cast withering glances at the naive Earthlings and take great sport in doing them in. Creatures were computer-generated, and interact with utter precision and believability with the human actors and real backgrounds."}, {"rating": "10", "text": "I just love this movie. I'm 58 years old and have been watching sci-fi movies for over 50 of those years. This movie has all the laughs of Matinee (another terrific movie) without the slightest attempt to soften the satire or blunt the humor with pathos. Great music, beautiful photography. It gets better with each viewing."}, {"rating": "8", "text": "This stylistic feature of black comedy has put quite a mark on reflecting and perhaps parodying America's attitudes towards culture and materialism. The fact that the design of the UFOs and Martians were less shoddy and more of what we think of them means that it helps to look at these in terms of our assumptions. A great ensemble of character with their own time to shine, the comedy is affectionate as well as outrageous. It's not meant to be predictable, it's the fact that the characters should have seen this one coming."}, {"rating": "8", "text": "Known for his gothic films, Tim Burton embraces his weird side in Mars Attacks! Okay, he embraces his weird side in every film he has ever made, but I mean, his really weird side. Light, stupid, and incredibly funny, Mars Attacks! is an riotously funny science fiction comedy that is more than in on the joke and knows actions on screen are absurd. With its tongue placed firmly in its cheek, Tim Burton's film offers more laughs than it knows what to do with, while also giving a humorous look at people's reactions to the attacks. From weirdos in Vegas to a pair of kids who were clearly prepared for the attack, the President, the military, and rednecks in Kansas, Mars Attacks! offers some political insight, but more or less settles for being tongue-in-cheek science fiction film and I was more than okay with this approach.Spoofing 1950s science fiction films, Mars Attacks! features an ensemble cast led by Jack Nicholson, Glenn Close, Annette Bening, Pierce Brosnan, Danny DeVito, Martin Short, Sarah Jessica Parker, Michael J. Fox, Natalie Portman, Jack Black, Pam Grier, Christina Applegate, and Ray J before his Kim Kardashian sex tape. This cast hams it up a ton in their various roles with each of them engaging in hysterical encounters with the attacking alien forces. As for standouts among this cast, Nicholson is a big highlight in a duel role as the President and, in Vegas, as real estate developer Art Land. Offering two very different performances between the serious President and the outlandish and crazy Art Land, Nicholson is both a calming presence and a great source of dry humor in the film. Natalie Portman is also hysterical here as the President's daughter. Though incredibly young, her deadpan delivery and comedic timing make every word that leaves her mouth comedic gold. Pierce Brosnan as a cocky professor, Sarah Jessica Parker as a fashion talk show host, and Martin Short as the White House press secretary, are also highlights here.Plot-wise, Mars Attacks! is pretty typical with a lot of the film focusing on determining whether or not the aliens are hostile or not. However, once they get their answer (\"spoiler\": they are going to attack), all hell breaks loose. Burton steps on the gas, pours fire on it, and laughs maniacally as the film spirals into control. With entertaining deaths, great one-liners and gags along the way (\"they killed Congress!\"), and fun action set pieces, Mars Attacks! embraces the absurdity and has a ton of fun with it. In particular, an encounter between Martin Short and an \"attractive\" alien is hysterical. Additionally, the running dialogue between Pierce Brosnan's severed head and Sarah Jessica Parker's head attached to a dog's body is both absurd and even more comical when considered in the context of the situation they find themselves in during the film.With purposely cheap-looking aliens, the film reaches great heights as a spoof with oddly comical aliens that openly mock the science fiction genre and dedication put into making realistic looking aliens. Yet, in terms of spoofing the genre, its depiction of the United States is great. Dignified, advanced, and self-assured, the generals and President are quickly bamboozled by the aliens who use their own inventions as comedic tools (the translator running gag is great). Even better, the use of nuclear weapons being quickly embraced by the aliens is tremendous, as is the full-scale invasion of Washington DC, the use of the Washington monument, and the mayhem in the White House. All are uproariously absurd and keep making you wonder, \"Did that really happen?\", but the answer to this question is also, unequivocally, \"Yes and it was glorious.\" By mocking the death of a useless Congress, the ineffectiveness of the nuclear bomb, the gung-ho general, and peace-loving President and Professor, Mars Attacks! really satirizes many elements of politics and it is hard to say what side the film comes down on. At the end of the day, both the pacifists and war advocates wound up dying. If anything, Mars Attacks! seems to say, \"F*** it we all die anyways.\"With gloriously terrible computer animation, hilarious dialogue, purposely awful music (that Grandma deserves the Congressional Medal of Honor for listening to that stuff), and a lively cast who deliver their lines with the right amount of cheese, Mars Attacks! is a great comedy film. Spoofing B-movies and 1950s paranoia-laced science fiction horror, Mars Attacks! demands that its audience be willing to go along with it throughout. This does not mean shutting off your brain or anything stupid like that. Rather, its brand of humor is all its own and requires that the audience just accept this oddity that will unfold and tries to enjoy the ride. As a result, Mars Attacks! is wildly divisive, but I found myself to be firmly residing in the \"Yay\" section."}, {"rating": "8", "text": "While he has been hit and miss recently, I like Tim Burton. Mars Attacks! is not his best(Edward Scissorhands), but far from his worst(Planet of the Apes)- in fact Mars Attacks! gets my vote as Burton's most underrated film. Mars Attacks! is a film you love or hate really, but I like it and consider it underrated and somewhat as a guilty pleasure.The film does have a slow start and it does take a little too long before the fun starts. What I loved about Mars Attacks! though was its smartness, fun and in some ways uniqueness. It does make the most of a bubble-gum card story, and works brilliantly as a biting satire, and is further advantaged by some excellent visuals not only in the computer-generated bug-eyed Martians but in the photography, make-up and sets, wonderfully clever sci-fi references, a smart script and a quirky score from Danny Elfman. Tim Burton's direction is also great, and the acting is all fun. While Jack Nicholson, Glenn Close, Danny DeVito, Martin Short, Pam Grier and Annette Bening are a lot of fun, the best performances come from Pierce Brosnan who is hilarious as a presidential adviser and Lisa Marie who is weird yet wonderfully creepy and seductive as the disguised alien temptress. Overall, I really enjoyed this film. It is not Burton's best, but it is better than most of the stuff he's churned out this past decade-Big Fish and Sweeney Todd are the only ones so far that had the charm and uniqueness that made me love Scissorhands, Ed Wood, Batman and Vincent so much. 8/10 Bethany Cox"}, {"rating": "6", "text": "/    /"}, {"rating": "6", "text": "This should have been the first clue to all of us that Tim Burton’s charm was not as strong as it once seemed. They have Jack Nicholson playing two characters and they literally do nothing with it. As a matter of fact, nearly all the characters are completely useless. The ones that actually succeed and survive don’t really seem to care, either. The whole movie doesn’t seem to really care about itself. No matter what happens, nothing really feels important. All the characters seem to treat everything with the same confidence they would treat anything else. It’s not horrible, it just doesn’t feel like a completed story."}, {"rating": "2", "text": "Mars Attacks is a 1996 comedy sci-fi fantasy and it has some great actors such as Jack Nicholson, Sarah Jessica Parker, Pierce Brosnan, Danny DeVito, Michael J. Fox....  It's about these aliens invading earth or some junk and to be honest parts are daft.. Sarah Jessica Parker's head on a dog's body and I honestly didn't find this movie entertaining or funny. If there was any good acting throughout the movie it was mainly if not all done by Jack Nicholson and many of the characters are silly and the aliens laughably bad and had no intimidating factors besides their weapons or other forms of defense and were mostly onscreen as a comedy factor but only laughable in a pathetic way. The film feels horrible and seems a cheap rip off of Independence Day which was also embarrasingly bad and the only thing Mars Attacks really attacks is the viewers intelligence with bad acting, horrible directing and sillyness that's not entertaining or if at all only barely."}, {"rating": "7", "text": "Tim Burton is often known for his off-beat, gothic approach to storytelling so it came as somewhat of a surprise when he delivered Mars Attacks! in 1996. It was a colourful and energetic homage to the B-movie, sci-fi’s of the 50’s and looked very much like a change of pace for him. Sadly, it wasn’t entirely well received and, if truth be told, I shared this criticism at the time. However, on a reappraisal, Mars Attacks! is actually a lot of fun and time has certainly been kind to it. Burton is in full command of his send-up of the science fiction yarns of old and, despite the silliness of the whole affair, he injects it with the requisite playfulness that the material requires. Added to which, he assembles an impressive cast who all seem up for the joke and fully aware of the ridiculousness their involved in."}, {"rating": "6", "text": "When hundreds of Martians land on Earth, U.S. President James Dale arranges a meeting with them. The ambassador of Mars announces that they \"come in peace\", but when a dove is released as a symbol of said peace, the Ambassador shoots it before he and the other Martians massacre most of the people at the event.Mars Attacks is an unusual movie. It's full of A-List starts, yet gives many of them very little to actually do, and the structure often makes it feel as though you're watching a series of unconnected sketches rather than the movie. Having said that. this movie does still provide a decent number of laughs and memorable moments, so if you're looking for something a bit different this is still worth checking out."}, {"rating": "2", "text": "You know how sometimes when you revisit a movie after a long time, you discover that you can now appreciate that movie in a way that you just couldn't when you were younger?  Well, that was not my experience with Tim Burton's “Mars Attacks!”.  I just watched it for the first time since I saw it in theaters 25 years ago.  I remember really not caring for the movie then, and I figured maybe I just wasn't sophisticated enough to appreciate its brand of camp, but it turns out that it is even worse than my memory served.  Every single role in this film is filled by an A-lister, but no one is given any material to work with.  Christina Applegate, who was coming off of 10 years delivering zingers on “Married… with Children”, has zero lines of dialog.  Jack Nicholson is doing his best to vamp up 2 roles, but when the writers give him nothing interesting to do, it all falls flat.  I laughed zero times during the movie (not even a smirk), and I appreciated none of the story beats.  Just so you know where my allegiances lie, I tend to absolutely love half of Tim Burton's films, while I detest the other half.  I think you know which category “Mars Attacks!” falls into for me.  Whatever you do, do not watch this movie.  It is so bad it is bad.  Let's collectively forget it ever existed and watch “Ed Wood” instead.  “Mars Attacks!” gets an F - Reserved for movies with absolutely NO redeeming value."}, {"rating": "7", "text": "Mars Attacks is one of those iconic films in the sense where everyone can describe it in two words, Martians Attack. This film boasts the countess A-listers, however most of them are under-utilized, where-as Jack Nicholson is over utilized as he plays two of the leads; one of which is only important as he is Annette Bening's husband."}, {"rating": "4", "text": "A science fiction comedy and homage to classic B movies from the 1950 era. In short it has a remarkable cast with a lot of big names and is a disappointment. I could stop here but will go more into details. The idea for the movie sounds crazy because it is based on a trading card series of the same name from the sixties. I had a hard time to believe this but read that it was correct (Could also be a joke by the producers or widespread rumor). The director Tim Burton was pitched the idea for the movie and want to pay homage to classic B movies. I think he succeeds with the homage even if the movie is not entertaining enough to be remembered (For some it is rememberable but for the wrong reasons like being unremarkable, boring etc.). It has the tropes and hallmarks of B movies including the silly ones with for example the disguise that is so obvious that it can never work and mad science that lets comic books look like scientific educational books  (head scene near the end). I think the set up is clear with the title being Mars Attacks. A fleet of flying saucers is on the way from Mars to Earth and humanity not knowing what to expect readies themselves for this event. So starts the story of the movie. Like I already said it is B movie inspired but does not deliver. It is neither in the realm of good movies or so bad that it is good category (=entertainingly bad). It fells somehow tasteless. This is even more a surprise with this cast of actors. We have Pierce Brosnan, Glenn Close, Jack Nicholson, Danny DeVito, Natalie Portman, Michael J. Fox and Sarah Jessica Parker to name just a few. Even the smaller roles have prominent actors or at least familiar once. While I say there is no bad acting or even a notable missteps there is also nothing to remember. No performance is outstanding or wowing me. Then there is the humor. I say there a few good laughs in the movie but again overall it is not entertaining enough. Tit is uninspired or not worked out well enough. The special effects are great for the style they aimed to archive. It is unique and looks well even when I must admit that it is not my cup of tea. I will still praise it for this review. I must make a warning here. For some people the movie is to violent. While I first would have disagreed I see the point now. It is a bit cartonish or slapstick like violence. Comparable to the Looney Tunes or Tom & Jerry were it slips under the radar. The soundtrack is remarkable. It made the “Indian Love Call” by Slim Whitman world famous and the song is just called “Mars Attacks song” now (Just google it or use this on YouTube). The rest is also good and we have a contribution by Tom Jones too. Danny Elfman did a fine job for the score. Overall this is a weaker movie and disappointment. It is hard to pinpoint what exactly is missing. For me it is not funny enough and feels like a to do list was done. It has some memorable scenes but overall fails to get immersive."}, {"rating": "8", "text": "Mars Attacks is an excellent comedy fiction shot at the farce level. One of Tim Burton's best films with an amazing cast, how nice it is to see Jack Nicholson in a comedic role. The whole film was shot in the unique style of Tim Burton. A real comedy that will make kids laugh without dirty jokes."}, {"rating": "9", "text": "Such a fun and non-serious movie! Is it campy. Yes. Is it dopey. Yes. You really just need to roll with it. Arrk! Arrk! Arrk! Oh those silly humans."}, {"rating": "9", "text": "Well, what can I say about this movie? other than that its kinda crazy lol and clearly spoofing 1950s/1960s b-movies. The special effects are somewhat dated but then its meant to appear dated. This movie has it all, from floating transplated heads to alien boxing(!). There are the really greedy characters, the gung ho military officer and the overly optimistic president (played by Jack Nicholson) but at the end of the day, this movie isn't about the story as much as its to be watched for the visuals, the sheer absurdity of whats going on, given that I don't think everything was really explained in the movie but yeah, its not really about that I suppose.The cast of this movie is quite impressive, from, as previously mentioned, Jack Nicholson to Glenn Close, Annette Benning, Pierce Brosnan, Danny Devito and Michael J Fox and not to mention a rather random yet quirky and kinda amusing cameo appearance from Tom Jones who's rudely interrupted by the aliens during a rendition of his song 'Its Not Unusual' while on stage in Vegas. Like I say the special effects are kind of dated now, though the movie is 15 years old so thats to be expected but the way the aliens appear is quite humorous with their large portruding, colourful brains and their strange language which is more like a repetitive long noise than a language as such... the movie is quite like a comic strip turned to life, its kind of camp in a way, especially with the Tom Jones scenes - the aliens aren't at all scary, at least not to me but the whole thing is so amusing because of its absurdity, it works quite well.This is a somewhat feelgood movie that doesn't set out to do anything other than entertain and make you laugh and as far as thats concerned, it does it quite well, though, as with most every other movie, it'll depend on your own tastes as to whether you'll really like or enjoy this. As an example, I'd say that another movie (or set of movies) thats a similar parody and that has the same sort of humour is the Austin Powers movies - their also over the top and camp with some ridiculous characters, although their not aliens, well not all of them anyway!.Personally I enjoyed this movie, it made me laugh - I found it fun watching the well known cast appear in a movie as this being that its based on b-movies of the past, although I would say that its perhaps a bit too silly for some - the ending came rather quick and I felt I missed a bit of the story but it certainly didn't ruin the movie at all. Its a good bit of fun, not to be taken seriously."}, {"rating": "10", "text": ""}, {"rating": "8", "text": "Stellar cast, really funny, many deaths. A parody of sci-fi alien invasion movies, but a really good one too."}, {"rating": "8", "text": "I first watched Mars Attacks! along with my brother. I was too much scared after watching it. After years, when I watched it again I thought how much bad this movie was. Less dramatic, more focus on comedy and cheap special effects.After I watched it now, I came to know that I was wrong. This movie was never intended to be SciFi drama, director wanted to make it SciFi- dark comedy- satire and he did it beautifully. Movie is great entertainment at it's best. Most of the people may not understand the purpose and the message of the film: it acted as a satire on all action and SciFi movies. I was amazed to see that this movie had big name in it's cast like Jack Nicholson, Danny DeVito, Pierce Brosnan, Michael J Fox, Natalie Portman, Jack Black etc. The special effects were also a funny part, because some of them are very well achieved and some of them are really cheesy; that's their purpose.Overall, Mars Attacks! is one of those films that you have to see for yourself, and ultimately evaluate."}, {"rating": "10", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."}, {"rating": "3", "text": "This movie is mean-spirited and not fun.  It's based on some trading cards, and so it has a kind of retro fun factor, but it's just one of those things where Hollywood is going \"Isn't this SO cool?\" and it's really just not."}], "recommendations": ["evolution", "paul", "men_in_black", "men_in_black_ii", "wild_wild_west", "thor_ragnarok", "guardians_of_the_galaxy", "johnny_english_strikes_again", "austin_powers_the_spy_who_shagged_me", "tremors", "hellboy", "the_gentlemen", "snatch", "mortdecai", "madagascar_escape_2_africa", "armageddon", "austin_powers_international_man_of_mystery", "the_league_of_extraordinary_gentlemen", "red_2", "fantastic_four_rise_of_the_silver_surfer", "indiana_jones_and_the_temple_of_doom", "ant_man_and_the_wasp_quantumania", "iron_sky", "robots", "werewolves_within"]}