{
  "id": 2330,
  "title": "Mars Needs Moms",
  "starring": [
    "Seth Green",
    "Joan Cusack"
  ],
  "runtime": 88,
  "genre": [
    "Adventure",
    "Animation",
    "Family"
  ],
  "description": "When Martians suddenly abduct his mom, mischievous Milo rushes to the rescue and discovers why all moms are so special.",
  "releaseYear": "2011",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/g94LNU4pipIUJLkTvYIgNGfT2J2.jpg",
  "categories": {
    "plot": 5.153846153846154,
    "acting": 5.25,
    "ending": 3.0,
    "soundtrack": 2.0,
    "cinematography": 5.0,
    "familyFriendly": 7.4,
    "funny": 5.4,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "NormalThe idea of dogs putting on a showsounded better than anything he'd ever heard.ReverseEr Her Vetti Hinguth Enin Eh Derab DenyseWah Shallow Niguets Snaw Vava E Ni Eye"
    },
    {
      "rating": "1",
      "text": "What is happening to Disney? Iâ"
    },
    {
      "rating": "3",
      "text": "Wow Robert Zemeckis, are you serious? The SF king throwing this crap into the theaters? \"Mars Needs Mom\" is terrible. The story pace is inconsistent as well as its huge cliched ending. Don't watch it."
    },
    {
      "rating": "3",
      "text": "Yes, the animation looks incredibly real, impressively so. I applaud the time and energy that went into creating this. The problem is that it actually works against the film in two very bad ways. The first is simple: The film is unpleasant to look at. This is uncanny valley territory. Everything looks so real, but at the same time clearly false, that it gets very, very creepy. I think this is the main factor in driving kids away. If I were five years old, this would have freaked me out. The other reason is a point I've been trying to get at for a while. Making animated films look realistic is inherently a bad idea. Leaving the uncanny factor out, this is always a bad idea. Why is it that animated films are made? So we can do things that can't be done in real life. Look to the film with the best 3D animation I've ever seen: Tangled. Tangled's animation was detailed down to the shiniest fiber of hair. Even then, it never looked like anyone was really there. If no one will believe it, then do whatever you can with it. Mars Needs Moms, you fail."
    },
    {
      "rating": "10",
      "text": "So many bad reviews for this brilliantly made, stunning film. I sat down to watch this with my daughter whom is two years old. The animation is simply flawless and stunning. I would say it is up their with Avatar.  I could not take my eyes off the screen!!! The story was well thought out and made me compelled to see more. My daughter loved the aliens, and the character Key was very deep for a children s movie. Before reading the bad reviews and not giving this a watch, just give it a try! You will not be dissapointed!!!"
    },
    {
      "rating": "5",
      "text": "I'm very surprised by the low critics and viewers ratings for this film. I thought it was nicely done and I actually enjoyed it. I will say that the film was a little slow and uneventful at the beginning, but once the story unfolded a bit, I thought it was a lot of fun. I'm not quite sure who the target audience was for this and that probably explains the poor box office performance. I don't think young kids would have liked this film, and I don't think older kids would want to see it either; that's the only real negative thing about the film. But if you're a fan of motion capture animation I say check this out!"
    },
    {
      "rating": "5",
      "text": "No broccoli, no TV. That's the edict handed down from a mother to her son, so the motion capture boy tries to fool his motion capture mom by feeding the offending vegetable to the motion capture cat. The ruse works, until the cat barfs, and Milo(Seth Green) is sent to bed without his zombie fix. Feeling burned, Milo wishes that he never had a mom, making the woman who sounds suspiciously like Joan Cusack cry, and before he can take it back, she becomes the victim of an alien abduction, in a style that strongly recalls \"Close Encounters of the Third Kind\". In the 1977 Steven Spielberg film, the moviegoer feels the anguish of being left behind as Melinda Dillon watches the otherworldly aircraft whisk her baby away beyond the lit-up sky to heaven knows where. \"Mars Needs Moms\" is not quite so harsh(if it was, you'd have a theater full of traumatized little kids), since Milo sneaks on board the departing spaceship. True, Milo's mother may be lobotomized by a faintly Asian-sounding alien who looks a little like E.T.(MIndy Sterling), but \"Mars Needs Moms\" makes sure that the boy has some fun on this dystopian planet, where girls are more prized than boys. With mother and son always being relatively close together, there's not much in the way of drama, as it would've had Milo needed to find his own passage to the red planet. The boy never realizes the full extent of regret for uttering those hurtful words against his mom because he's too cognizant of her whereabouts. The mission, as a result, doesn't have a whole lot of urgency to it, and yet, we do see what could happen to the captured woman(through another character's mother) which is considerably more frightening than anything in \"Bambi\"."
    },
    {
      "rating": "4",
      "text": "Its among the most impressive animated films visually. I found many of the characters memorable Some of the aliens seem creepy but thats only because of the animation. Its not all bad."
    },
    {
      "rating": "5",
      "text": "It is not a really good film from disney. I was expected more"
    },
    {
      "rating": "4",
      "text": "there is no story nothing really maybe I'm just dumb, stale, bland ,uninteresting i have more but u get the picture this is one of those awful movies you watch at night when u cant really get to sleep then u wish u had just watch an infomercial. i like watching pretty much anything but these has to go to the dump"
    },
    {
      "rating": "10",
      "text": "I dont understand why people have slammed this movie with poor ratiings, clearly there not watching the movie, busy on there phone or talking to there friends. This is aimed at slightly older kids, i think a PG is only been handed out because its a disney movie. Anyone under 7 will struggle to understand this movie simply because of the action scenes and story is not really \"Disney\". But that being said, my two kids who are 7 and 8 both really enjoyed the movie. Its a warm touching movie with a good meaning to it. Its funny throughout for kids and familys. But those going into this thinking there gonna see a film along the lines of Wall-e or Area 51 they will be disapointed. This is a far cry from cute disney as all the animation looks exactly like real people, which may come across scary for younger viewers i dont recommend any parent taking any child under 6 to see this film some scenes are not suitable, a few parents took there kids out of the film because they were scared. But the animation is amazing, the effects and voice acting are outstanding. If you enjoy a clever movie with twists and turns then this is for you. Im buying the DVD when it comes out. One of the best animated movies of the year."
    },
    {
      "rating": "10",
      "text": "This was a great family movie.  Very entertaining and heart warming for kids and parents alike.  My daughter wants to live on the Moon and travel to Mars.  So this was great  fun.  Also the 3D digital art work was fantastic.  It seemd as if you were there with Milo.  I am going to go see it again and also buy the new DVD.  Thanks Disney and IMD!"
    },
    {
      "rating": "0",
      "text": "Just another bad movie nothing special at the least bit."
    },
    {
      "rating": "3",
      "text": "Mars Needs Moms has a great premise and has great animation along with great motion capture performers, but it isn't creative or heartfelt or funny for that matter. Mars Needs Moms ends up being weird and bland. I give this movie 33%."
    },
    {
      "rating": "10",
      "text": "I have to say not one of Zemeckis's best. Some parts were a little bit cheesy but fun characters and some funny moments were enough to hold me through to give it a good score."
    },
    {
      "rating": "10",
      "text": "you see now here's the movie we have all been waiting for with beatiful animation and the rest that are eye popping it will go down with classics such as toy story."
    },
    {
      "rating": "0",
      "text": "oh god, what is disney thinking?!?!?!?!?!?!!?!? this cgi pile of vomit reminds me of real life! why did the aliens steal the f cking mum/mom? Sonic Boom Rise of Lyric is better than this"
    },
    {
      "rating": "3",
      "text": "\"Mars Needs Moms\" is just flat-out boring. The story is bland beyond belief(not to mention showing signs of sexism), there's no sign of emotion, humor, or relatability, it's cliched like never before, and don't even get me started on how it's obvious only made for mothers to get more attention from their kids. Wouldn't have hurt to make the movie decent...I fell asleep while watching this movie, MIDDAY! If you're looking for something heartwarming, great for families, or even remotely entertaining, don't go with this movie. This really does make me ashamed of Disney."
    },
    {
      "rating": "10",
      "text": "No broccoli, no TV. That's the edict handed down from a mother to her son, so the motion capture boy tries to fool his motion capture mom by feeding the offending vegetable to the motion capture cat. The ruse works, until the cat barfs, and Milo(Seth Green) is sent to bed without his zombie fix. Feeling burned, Milo wishes that he never had a mom, making the woman who sounds suspiciously like Joan Cusack cry, and before he can take it back, she becomes the victim of an alien abduction, in a style that strongly recalls \"Close Encounters of the Third Kind\". In the 1977 Steven Spielberg film, the moviegoer feels the anguish of being left behind as Melinda Dillon watches the otherworldly aircraft whisk her baby away beyond the lit-up sky to heaven knows where. \"Mars Needs Moms\" is not quite so harsh(if it was, you'd have a theater full of traumatized little kids), since Milo sneaks on board the departing spaceship. True, Milo's mother may be lobotomized by a faintly Asian-sounding alien who looks a little like E.T.(MIndy Sterling), but \"Mars Needs Moms\" makes sure that the boy has some fun on this dystopian planet, where girls are more prized than boys. With mother and son always being relatively close together, there's not much in the way of drama, as it would've had Milo needed to find his own passage to the red planet. The boy never realizes the full extent of regret for uttering those hurtful words against his mom because he's too cognizant of her whereabouts. The mission, as a result, doesn't have a whole lot of urgency to it, and yet, we do see what could happen to the captured woman(through another character's mother) which is considerably more frightening than anything in \"Bambi\"."
    },
    {
      "rating": "10",
      "text": "best movie of 2011!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "6",
      "text": "This movie does have its moments. But even those are covered with a cliched part and so-so voice acting. An overall ok movie but is a big step-down for director Robert Zemeckis. 6/10 (OK)"
    },
    {
      "rating": "2",
      "text": "What was originally the demise of ImageMovers, who is currently the only animation studio that makes their films with motion capture, Mars Needs Moms is far from their best work. Sure, the animation is fine, but the story it attempts to tell is bland, predictable and extremely rushed, the character designs, with the exception of Gribble, are very hard to look at, and then there's the characters themselves, who can be one of two things: annoying or a jerk. Gribble can be a mix of both, but just comes off as an idiot, Ki is okay but kind of dated by being a \"hippie\", Two-Cat and Wingnut supply the worst jokes in the movie, and then there's Milo, the main character. I hate the little twerp with a passion. Yes, his actor does a decent job, but he's really annoying, his character design is awful, and at the start of the movie, he says this one line that's so unforgiving that you'll want to hate him for the rest of the movie. It's hard to imagine at first, but once you hear it, you'll understand why. But there are some things that the film did right, like the background animation is nice, some of Gribble's jokes caught me off guard and the music is very well orchestrated. But those alone aren't enough to make it passable."
    },
    {
      "rating": "10",
      "text": "ThIS mOViE iS goOd WaTCH thIsMovIe!1!!charactercharactercharactercharactercharactercharacterchar"
    },
    {
      "rating": "5",
      "text": "Marte Necesita Mamas no es tan mala como muchos dicen, sin embargo tampoco es una película tan buena. No la calificaría como mala, sino mas bien mediocre. Presenta un concepto interesante, tiene partes emotivas y demás, aunque algunos personajes se vuelven irritantes y la historia no es explotada lo suficiente, así como que quedan cosas sueltas sobre por ejemplo el porque la supervisora les mintió a todos. Gráficamente esta bastante bien eso si.Una película con bastante potencial, pero que le falto mas empeño en el desarrollo de la historia."
    },
    {
      "rating": "2",
      "text": "Why the martians looks highly uncanny? Also this movie copied Close Encounters of the Third Kind."
    },
    {
      "rating": "1",
      "text": "this movie was terrible! this movie is so overrated! one of the worst animated movies ever from 2011!"
    },
    {
      "rating": "3",
      "text": "The animation, while good, looks too realistic, like way too realistic compared to The Adventures of TinTin."
    }
  ],
  "recommendations": [
    "coraline",
    "the_good_dinosaur",
    "the_smurfs",
    "the_boss_baby_christmas_bonus",
    "monster_house",
    "the_angry_birds_movie_2",
    "astro_boy",
    "my_little_pony_equestria_girls_forgotten_friendship",
    "cloudy_with_a_chance_of_meatballs",
    "happy_feet",
    "the_tale_of_despereaux",
    "alvin_and_the_chipmunks_the_road_chip",
    "where_the_wild_things_are",
    "walking_with_dinosaurs",
    "hotel_transylvania",
    "real_steel",
    "chicken_little",
    "cloudy_with_a_chance_of_meatballs_2",
    "the_angry_birds_movie",
    "ice_age_the_meltdown",
    "the_croods",
    "the_polar_express",
    "the_nut_job",
    "shark_tale",
    "the_boss_baby_family_business"
  ]
}