{
  "id": 1570,
  "title": "Mary Magdalene",
  "starring": [
    "Rooney Mara",
    "Joaquin Phoenix"
  ],
  "runtime": 120,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "In the first century, free-spirited Mary Magdalene flees the marriage her family has arranged for her, finding refuge and a sense of purpose in a radical new movement led by the charismatic, rabble-rousing preacher named Jesus.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oLbqnVAmD8ISel1SLTY3Ek0TWz8.jpg",
  "categories": {
    "plot": 3.4,
    "acting": 6.25,
    "ending": 2.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "My wife and I really enjoyed this film. The acting was spot and it's different from ALL the other movies made about Jesus and really none about Mary M. Sit back and enjoy it!!"
    },
    {
      "rating": "9",
      "text": "Text: Helen Edmudson, Philippa Goslett, & Garth Davis I appreciate you, Rooney Mora, Joaquin Phoneix, and Chiwetel Ejofor, GOD has blessed you with unbelievable talent. This movie was brilliantly made, it shows you the life of Mary Magdalene, but at the same time, it also focuses on Jesus. I don't believe any other cast could have pulled this off. Watch the film, it's not to be compared to the Passion and its brutality. This film shows this bible story for what it should have been. The game changer for this movie is Simion called Peter, in the book of ACTS chapter 13 Simion Called Peter from NIGER is called a black man. which means there should be more game-changing movies to come.Summary: EPIC MOVIE !!!!!!"
    },
    {
      "rating": "2",
      "text": "There is not that much info from Mary Magdalene before she joined Jesus... some info in the Bible and one Book under the Name Mary Magdalene along with some other apogripha books paint somewhat the picture of \"Redemption\" and \"Tolerance\"... this is coalescent in Mary Magdalene's Story...yes, she was a follower of Christ an apostol... but even more important to her character... \"She was a prostitute\" this is essential for her Arch as a character in the Bible... she was about to be Stoned to Death and Jesus intervine to save her asking \"He who is clean of sin Throw the First stone\" also he added \"I have come for the sinners\"... so she being a prostitute and then becoming an apostol fighting for a cause beyond her mundane life and Jesus stating that the kingdom of God is for everyone and all are capable of redemption...this is Crucial in the short story of Mary Magdalene in the Bible... coming from the worst place to a leader...and the leader fighting for the lowest... and this movie...\"completely ignored this part of the story\" the \"Story!!!\"...there is no story without this.... this is takes away 2 essential premises from both Mary and Jesus as characters... the Teacher willing to die for all and believer of redemption and Magdalene able to pull herself out from the dark and into a higher purpose... without this we are seeing a movie called Mary Magdalene...but this is not her...this is fantasy...so from there the points falls flat... we end up watching some fiction.... to be honest there is not that many interpretations from her...so this is really a waste... they could have bring her story to the big screen...instead we watched Fantasy fiction labeled as Something that it is not... lots not even talk about \"painting Peter as a Black actor\"...listen this was low... like can we take a famous head of a church...like Buddha and make him black, take Kukulcan and make him black...like please NEtflix...wtf?"
    },
    {
      "rating": "7",
      "text": "Although this movie may be inaccurate to the gospel accounts, it was beautiful to watch and the acting is superb.A fresh take of Mary Magdalene the prostitute and Jesus's follower portrayed as a intelligent and kind woman who loves and cares for Jesus and whose actions mirror his is beautiful to watch . Her life is portrayed as I would like to believe it actually was. This film also shows Jesus and the burden he had to carry throughout his life not only at Crucifixion.This is surprisingly one of the best movies about the true nature of Jesus that I've ever seen.Visual and aesthetically beautiful, the photography by Greig Fraser is more than polished, and contributes to the pair of music in the development and in making the viewer empathize with a Mary. He took her as a prostitute. The performances of both Mara and Phoenix is impeccable.A slow movie that takes its time, at times seems to decay in its argument, but always hooks correctly again. A good new and refreshing proposal within the biblical cinema.Watch with this movie with heart and open mindedness and remember this Mary's story."
    }
  ]
}