{
  "id": 3581,
  "title": "Mary Queen of Scots",
  "starring": [
    "Saoirse Ronan",
    "Margot Robbie"
  ],
  "runtime": 124,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "In 1561, Mary Stuart, widow of the King of France, returns to Scotland, reclaims her rightful throne and menaces the future of Queen Elizabeth I as ruler of England, because she has a legitimate claim to the English throne. Betrayals, rebellions, conspiracies and their own life choices imperil both Queens. They experience the bitter cost of power, until their tragic fate is finally fulfilled.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/b5RMzLAyq5QW6GtN9sIeAEMLlBI.jpg",
  "categories": {
    "plot": 5.162790697674419,
    "acting": 4.75,
    "ending": 6.333333333333333,
    "soundtrack": 3.0,
    "cinematography": 3.6666666666666665,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.666666666666667
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Fantastic performances by Ronan and Robbie. The rest of the cast, especially David Tennant, do a great job in their bit parts as well. That doesn't stop the film from being freaking boring though. So very little happens onscreen and most of it just comes off as typical soap opera drama, It's boring and it fails to maintain your interest throughout. So as much as the cast tries, The material they were given fails to bring anything to the table but that's to be expected. Most historical drams fail to capitalize on the source material."
    },
    {
      "rating": "1",
      "text": "The cinematography is good and the acting is adequate, but these virtues can't save this piece of garbage. The story is soporific. The characters aren't people, they're representatives of various groups, and so lack any sense of individual personhood. This is a movie with some very trite messages and no life, no personality, no heart. It's like a Sunday School lesson in the Church of Current Morality without a hint of art except for the stilted dialogue, which is thoroughly unengaging. I watched the whole thing, but I gave up trying to follow what was happening about halfway through. The tone is imposed by fiat. The pace does nothing to serve the film except get us from beginning to end. It just plugged along from one pretty tableau to the next without variation or any sense of impending catharsis. Bad script, bad director, bad editing."
    },
    {
      "rating": "6",
      "text": "The titular queen returns to Scotland to claim her rightful crown, but conflict from her cousin Elizabeth in London forms the basis for this drama. There's also an element of feminism, as both women battle the misogynist attitudes of their court. The narrative sometimes seems confusing, but the basic plot was discernible (and not all that complex). Those who like historical dramas will enjoy the fine performances and period trappings, although there are some liberties taken with accuracy, including color-blind casting and a gay relationship."
    },
    {
      "rating": "3",
      "text": "Although the story might be quite interesting to some, it did not appeal to me personally and I found myself quite bored after about half an hour. I don't think the actors or actresses are to blame for this as I thought the performances passable though far from splendid. And it wasn't so much the historical inaccuracies but mostly that the storytelling was too bland to keep me even somewhat interested. I can't recommend this one to anyone without a special interest in this Scottisch-English (hi)story."
    },
    {
      "rating": "5",
      "text": "I think with enough certainty that this film tried to cover more than it could sustain. It's clear that its ambition was quite great, however considering that although the story is quite interesting, its development unfortunately meets the same obstacles that period films usually have. Therefore the truth is that very few people will feel really attracted to the material.It's true that their leading actresses manage to do a very good work, probably one of the best performances of Margot Robbie, if not the best of her career and surprisingly will go quite unnoticed.Saoirse Ronan on the other hand maintains her level although we have seen better works from her, however, I think this film was manufactured with the idea of getting nominations in the awards season and considering that went by without making any noise, it's quite evident that its quality and above all its campaign didn't measure up."
    },
    {
      "rating": "0",
      "text": "Pretty terrible. There is no way around it! I could not even finish the movie without falling asleep from boredom."
    },
    {
      "rating": "6",
      "text": "As the clouds roll onto the waving and knotting hills of Scotland, a haze of insecurities, betrayal and bloodshed awaits two powerful Queens; two women whose blood lines and loyalties are blurred by the manipulative and convoluted men in their lives. Yet although history always tells us that men have been at the forefront of politics and royalty, Mary Queen of Scots is a highly dramatized account of the 16th Century events surrounding Queen Mary (Saoirse Ronan) and Queen Elizabeth I (Margot Robbie), two of the most powerful and influential women, not only of their time, but of all time. As cousins, the two share a very respectful and adorning attitude and relationship, although never meeting according to the pages of history books, Mary Queen of Scots amps us drama for a fateful face-to-face between the two. Young Mary, widowed and eighteen by the time she claims her position as Queen in Scotland, is free-spirited, understanding and audacious. Embracing the many facets of a colourful and diverse world, including homosexuality, Mary’s beliefs and perspectives may be a little too liberal in a 16th Century world, yet we are manipulated into believing anything, especially when Ronan is playing the title role. On the other end, Queen Elizabeth I is a reserved, alienated and scorn barren woman whose fate was almost succumbed to smallpox. Embarrassed and hidden underneath the many layers of white make up to hide her smallpox scars, Elizabeth is riddled with sadness and tragedy, who confidence is hidden underneath elaborate and grandiose dresses that retracts men, even the tenderness and love of a man in desperate search of her love, Robert Dudley (Joe Alwyn). While both actresses are faces of beauty in Hollywood, Ronan’s Mary is the only Queen noticed for her divine and unpaired magnificence. Mary Queen of Scots is just another role to add to Robbie’s recent fascination of diving into roles of women lacking much physical, emotional or mental beauty, despite the actress’ undoubted charm and elegance. Robbie’s interpretation of Elizabeth I is just one more notch under Robbie’s belt solidifying her devotion and passion to her craft.While it isn’t much of a spoiler to know that Mary’s fate is found on the chopping block in 1587, the film begins with her demise, focusing on just how she got their. The film, directed by Josie Rourke and written by Beau Willimon based on a book by John Guy, historians may very well disregard Mary Queen of Scots because it becomes clear that the film is less fascinated with shedding historical and real light on the life of these two reigning women, and play more like a dramatic narrative, very similar to the style and narrative flow of The Other Boleyn Girl a decade prior. While that film features two of Hollywood’s most promising young actresses then, Mary Queen of Scots showcases two of the strongest young female actors of today.Both Robbie and Ronan are magnificent in their respective royal roles. Overshadowing all of their male counterparts, even with the likes of David Tennant, Jack Lowden and Guy Pearce gracing the screen, Ronan and Robbie are acting forces, elevating the material of the screen, regardless of how potent it every really becomes. Mary Queen of Scots is a masterclass of acting for two very deserving actresses today.Both actresses, nominated for Academy Awards the year prior, Ronan for Lady Bird and Robbie for I, Tonya, are in a class of their own, Ronan may reign supreme however between the two budding actresses, after all, the film is called Queen of Scots. Ronan carries the brunt of the film’s heavy story material, constantly dealing with betrayals, death and obscenities beyond her control, despite her position of Queen. Ronan’s delicate portrait of a scourged historical figure is riveting.Sadly, as the film’s story unfolds and the ruse of each woman’s power is displayed in glorious fashion, the film is still bounded by the approval of men, fertility and virginity. Lines like “How did it come to this? Wise men servicing the whims of women”, or “Worse than a plague is a woman with a crown”, the content of the film is wholly vexed by the presence of men. While the royal women have a clear path to attain their goals, the men provide the women and the film with the majority of the narrative’s twists, turns and rivalries to unfold. Emotions, notions of privilege and family drama are the driving forcing for Mary Queen of Scots, proving the line in the film “the matters of the heart dictate the outcomes of countries” unequivocally.United and strong, Mary Queen of Scots gives audiences a ponder-some conclusion and climax, basically setting up a narrative film for a fictitious meeting between the two Queens. Decorated and flooded with white sheets to separate the two and set in place to avoid any direct face-to-face contact, the film seems to be one big lead up to this grand moment."
    },
    {
      "rating": "5",
      "text": "Not even the excellent acting makes this film anything more than unremarkable.    It's one fantastic story. The political war of two sovereigns, both women, representing the polar opposite of each other in a time of huge turmoil. A proven young noble with political genius in her veins going against an old hand of politics who has spent a long time protecting her throne from all that challenges it. How this screenplay managed to make such a leviathan conflict mediocre is beyond everyone who paid to see it. The biggest issue is the speed of the screenplay. So eager to cover an enormous expanse of time, it messily cuts from one scene to the next without grounding or context and in so doing destroys any sense of the stakes or importance. Everything goes past in a whirlwind of bits left out and confusing time jumps clumsily explained in conversations. This leaves the characters in exactly the same limbo. They're all totally one dimensional and usually malicious or incompetent. No back story, no explanation of their relevance, no character building. I struggle to care when every single person is a fatuous over-dramatic dullard who speaks in cliches and is on screen for maybe ten minutes in the whole film.    As for the main characters they are exceptionally well acted, but held back by a poor screenplay, even ignoring the historical inaccuracies (as some artistic license is required). Mary comes across as a petulant child, who throws away anyone who disagrees with her regardless of their (unexplained but mentioned) importance, is totally oblivious to the political dimension of anything, and rushes from calamity to calamity like a headless chicken. The speed of the narrative doesn't help this as it never demonstrates her aptitude, she never seems a part of any of the big political decisions as the screenplay is too busy having her gossip, and shout at people for disagreeing with her. It takes away from the political force Mary was historically and leaves the narrative unclear.  Elizabeth is far better, and my favourite character of the film. She is active in her politics, makes genuinely hard decisions, keeps her composure as a regent must, and grows throughout leaving her to make a decision which - despite the melodrama - shows her growth as a character. She, along with everyone else, seems to have an obsession with banging on about gender - as if this was a hugely debated topic in a society where the average life expectancy was 30-40 during a divide between the two major denominations of Christianity and a political cold war. But again all these topics and indeed how the lines of accession or family tree functioned in relation to Elizabeth and Mary is all skipped over because of the films breakneck speed.    Characters come and go, historical events come and go, but they're all a blur. Lost in amongst monologues, jarring dialogue and possibly the worst battle scene ever committed to film in which a 'major battle' that decides if the rebellion succeeds is a horn being blown and twenty guys walking into a river because some people charged at them from the trees. Like everything else, five minutes and done. It feels as if it's there just to say it's there.    It is an enjoyable enough film, and certainly watchable, but not something you'll find yourself recommending to anyone else or even talking about at all. When a film is dull enough you forget large parts of it having only watched it a few hours prior, that's all there is to be said."
    },
    {
      "rating": "5",
      "text": "I wasn't quite **** even with the talent involved.It's too dry for my taste, but not to say there isn't redeemable qualities. The sets, costumes, and performances were all solid, especially with it being a period piece drama. And an entertaining performance from David Tennant, in spite of the slim screen time.However, the sluggish pace ruins any investment I could have with the story and the movie unfortunately follows the period piece drama formula. But seriously, releasing this movie at the same time as 'The Favourite' aka Walk Hard of period dramas, didn't really help.I think being broke is better than being ''woke''."
    },
    {
      "rating": "4",
      "text": "Mary Queen of Scots is one of the weakest, most plodding, most boring, and lackluster historical dramas I have ever seen. Not even Margot Robbie and Saorise Ronan can save this shoddily written screenplay. There's almost nothing redeemable about the production. It is somehow both incredibly beautiful and utterly lifeless. The action is completely boring. Even the sex scenes somehow manage to be both ostentatious and workmanlike. There's not a whole ton of care taken in regards to historical accuracy. What's most interesting is that this whole story is historically moot, because Queen Elizabeth and Mary Queen of Scots never met face-to-face in real life, so this movie is more fantasy than anything. However, a lot of the cinematography and costume design is beautiful and engaging. This movie is just a needless bore."
    },
    {
      "rating": "5",
      "text": "Pretentious Tug Of WarMary Queen Of ScotsRourke's period drama has both, the essence of that era and plethora of drama to fuel the film, what it lacks vigorously is the attitude to own that throne. There is no romance between the audience and the characters; none at all, and hence this repulsive script sets the doom for itself. The storyline is without a doubt, cinematic, dramatic, unlike your usual period drama, it is a script that feeds itself off on the antics. And the filmmakers were aware of them, hence they have directed all their guns on either building up to that peak moment or fill in the blank that would spice up that moment. In order to do so, presumably they have completely lopped off the flamboyancy in narration, there is no flow, it either leaps or skips. The film is incredibly rich in costume, make-up, production design with huge set pieces and jaw dropping location that is clearly appealing.As mentioned before, the film lacks the poised tone of these characters and storyline, there is not enough ego to boast off in front of anyone or boost off the storytelling furthermore. Set in two different stages, personally I feel there is a lot to peel off in Robbie's section. Her character might be fighting against the entire country or world or her own people, but her greatest fear is herself and that resistance that plays a vital role in this film is the best asset of it.Unlike Robbie, Ronan gets a character that is completely satisfied with herself and has to fight against the others, but mind you, her track is much more gripping, much more juicy and glorifying. I can see why this has been Ronan's anticipated project for a while, since has got quite a wide range in her character to step in. And respecting the material, the stage, the history and the Queen herself, she is giving her best in each scene.Among two phases of hers, one of the strongest is in early stages, when she is taking things and people around her lightly and shows every sign of bratty-ness there is. The second half takes over the characters and has too much to say and do to let the actors overpower the storyline. The only time when Ronan and Robbie shares the screen- to which the entire movie is building towards- is well shot, performed and written.The amount of pressure it has to qualify with good grade on that scene, is well managed on both paper and screen. The other supporting cast doesn't get much to do except for Pearce who has done a decent work. Rourke's world isn't subjective enough to make its audience care for them, it is well aware of its pathos dark world to be appealing, but the content is read off like mere poignant news. Mary Queen Of Scots has everything we have seen in such genre, and its only unique quality which is to create the crisp tense environment between two personalities, is left untouched."
    },
    {
      "rating": "7",
      "text": "Entretenida, la historia es emocionante la 2da mitad, tiene problemas con el casting q hay negro y chinos, pero fuera de eso todo muy bien"
    },
    {
      "rating": "5",
      "text": "Strong players and an excellent wardrobe do not prevent this clutter of plotlines and characters to be an entertaining watch. It jumps from point to point without a clear line of where it wants to go exactly and spends time delving into situations that would have been better suited to flesh out the actual rivalry between Mary and Elizabeth.At the end, you're scratching your head wondering what exactly happened and what part each and every character actually played in the eventual downfal of the Queen of Scots. A pity, since the story must have been part to the concept of ASOIAF, yet it is sadly mistreated in this incarnation."
    },
    {
      "rating": "0",
      "text": "Horribly Historically inaccurate in the name of diversity. Pointless boring film."
    },
    {
      "rating": "2",
      "text": "An awful movie with weak screenplay.Titular character is annoying, mentally unstable and barks at everyone. Despite the fact that she spent her whole life in France she speaks with strong (Irish?) accent?All her 3 husbands were portrayed as weak mean. First came before they even started so she never felt a man, second one was homosexual and she had to force him to have sex with violence (he didn't have problem giving her oral sex before that...) and third one was a fool who raped here.She kept close a gay minstrel who on her wedding night slept with her husband. Despite that she asked him to never change and be true to his nature until he was murdered by royals and jealous gay husband.Black and Asian people people on British courts in historic drama...It feels like this movie was made top push some ideological agenda and not to tell a story."
    },
    {
      "rating": "3",
      "text": "In 1933 in a play by Maxwell Anderson called \"Mary of Scotland \" he was first to imagine a meeting between Queen Elizabeth of England and Queen Mary that never took place. Three years later it was made into a movie starring Katherine Hepburn as Mary and Florence Eldridge as Elizabeth. In 1936 Bette Davis got an Oscar nomination playing Elizabeth in \"The Private Lives of Elizabeth and Essex\" and that is the Elizabeth I remember 82 years later. She would do the role again in \"The Virgin Queen\" 1955 and Mary is only mentioned in passing. Through the years, on television, theatre and other movies both Mary and Elizabeth have been portrayed by other actresses but these I have mentioned immediately came to mind hearing this movie was opening up this week.As fine a job as Saoirse Ronan does playing the lead in this 2018 movie, which probably will get her a fourth nomination, she is sabatoged by the dark, slow pace getting to the major scene. Her acting partner, Margot Robbie as Elizabeth, is not written as powerful a woman as Mary which unbalences the whole movie.Beau Willimon wrote the screenplay, basing it on the book \"Queen of Scots: The True LIfe of Mary Stuart\" by John Guy and one doesn't know which is fact or fiction or 'Hollywood's based on a true story' or who invented the sex lives of some of the characters.The movie is the screen debut of London's Donmar Warehouse theatre companies artistic director Josie Rourke which may or may not explain the darkness and drab setting of most of the movie. Also, whether it is me or the accents or the soundtrack I had a hard time understanding at least half of the spoken language.There are many actors as supporting players in roles supporting both queens in both good and evil ways. A standout is James McArdle as Mary's brother, Simael Cruz Cordova as a gay man who whose a close confident of Mary, Jack Lowden as her gay husband, Joe Alwyn as Elizabeth's lover and David Tennent as John Knox, a Scottish minister.The only reason to see \"Mary Queen of Scots\" is for the performance of Saoirse Ronan but if you ever want to see the definite performance of Elizabeth look up that 1936 Bette Davis movie!"
    },
    {
      "rating": "6",
      "text": "Bland story and the politically (in)correct race casting basically just completely undermined my enjoyment."
    },
    {
      "rating": "1",
      "text": "Inaccurate and slow moving dull-fest with bazaar progressive, diverse stunt-casting that quite frankly takes any viewer with a brain and a passing grade in high school history right out of the movie. I'm actually looking forward to the biopic of Shaka Zulu that includes a few Swedish and Chinese natives holding spears in the background."
    },
    {
      "rating": "3",
      "text": "What an awful film. I would have left after 15 minutes but my companion insisted that I stay. There are three reasons for my poor review:(1) The actresses chosen to play Mary and Elizabeth were lightweights and were never believable in their roles. Saoirse Ronan does not have the gravitas to pull off the role of Mary. She may be fine portraying contemporary characters in movies, but not historical ones that are larger than life. Particularly annoying is that she speaks with an Irish accent and she is supposed to be a Scottish queen. The woman who plays Elizabeth is better, particularly when portraying her as haughty and aloof, but when she gets simpering the portrayal becomes annoying. Besides, all Elizabeths will ultimately fall short when compared to Cate Blanchett's performance. In this case, way short. On the positive side, both actresses \"looked\" the part so their anemic performances were a particular letdown.(2) What a disastrous decision to populate the courts of Elizabeth and Mary with Black and Asian actors. Of course, I have no problem seeing these actors in movies... except when it harms the historical authenticity of the portrayal. There were no Black and Asian people in the high courts of both countries during that period, let alone a Black English ambassador to Scotland. All this for artistic license. Such a dumb decision!(3)The director of this film really missed the mark.I blame the director for the odd pacing and stilted dialogue. The real problem is that the movie is very literal, and lacks any type of nuance. It also lacks historical accuracy in other ways, such as portraying a meeting between Mary and Elizabeth, something that never happened in real life. The meeting itself however is a fine example of cringe-worthy acting and dialogue.I am dismayed that some professional critics gave this movie good ratings. I will pay more attention to those that didn't, in the future. The only good points were the costumes and cinematography... but if that is a movie's only claim to fame, I say what a waste of a couple of hours."
    },
    {
      "rating": "2",
      "text": "This stinks quite a lot.  David Tennant looks like he's stumbled in from Harry Potter and there is too much acting going on.   Didn't believe a word anyone said and so didn't care who lived or died.  The scene between Mary and Elizabeth which takes place behind the gauze was appalling.   Generally rotten."
    },
    {
      "rating": "6",
      "text": "Who would have thought that a movie with such great performances, production values and cinematography could be so dull? Unfortunately, that's the case with this period piece drama. Much of the fault lies with the muddled screenplay, which tries so hard not to spoon-feed the audience that it ends up failing to make clear such significant story elements as delineating the rival factions at play and defining the rules of royal succession. In its attempts to explain these things (and not all that well, I might add), the story ends up becoming cumbersome, jumbled and, at times, just plain boring. That's too bad, because Saoirse Ronan and Margot Robbie deliver excellent portrayals of their historic characters, and many in the film's crew obviously went to a lot of hard work to produce gorgeous sets, costumes and makeup, Regrettably, though, those efforts are all for naught in a film whose mediocre writing and subsequent mediocre execution betray these other fine attributes. Off with their heads!"
    },
    {
      "rating": "5",
      "text": "Oscar bait that didn't really come off. The film is very drawn out, and I know its about Mary, hence the title, but it felt like there could have been more focus on Elizabeth. Agree with some other reviews too, you can't rewrite history because the modern day is very PC, as much as people might not agree with the way things were. The trailer was deceptive too. If you are expecting some kind of Mary vs Elizabeth film with the latter descending into madness, you are going to be disappointed."
    },
    {
      "rating": "8",
      "text": "“Mary, Queen of Scots” stars Saoirse Ronan in the title role together with Margot Robbie as Elizabeth I in this epic biodrama of 16th Century politics, religious prejudice and royal intrigue. Directed by Josie Rourke and based on the novel by John Guy who co-wrote the screenplay with Beau Willamon (the writer and producer of “House of Cards”), this is basically the story of two cousins forced by their male advisors and counsel to be at war with each other and the kingdoms claimed to by each. For history buffs, this is a film that will put a new perspective on the life and reign of Mary who, until now, was thought of as an immature monarch placed in a role for which she was ill prepared. Instead Messrs. Guy and Willamon show Mary to be a spirited, wise and dedicated ruler who was, according to all records, the rightful heir to the kingdom and thrones of both England and Scotland. Interesting to note that today’s British monarch, Elizabeth II, is a direct descendant (11 times removed) of Mary. I give this film am 8 for its historical value and the quality performances of the ladies who portray the two queens."
    },
    {
      "rating": "8",
      "text": "Well done.  Mary is the star of the movie, for sure.  The setting and appearance seemed spot on.  The acting was excellent.  However, I could not totally follow the story, nor always assess who were supporting Mary and who were not.  I did get the gist, but would have enjoyed it more with either some narrative, written or spoken."
    },
    {
      "rating": "7",
      "text": "You have to feel a little sorry for Director Josie Rourke and Screenwriter Beau Willimon.  How do you create a unique, distinctive point of view for material that has been addressed so many times?  The Friedrich Schiller play “Mary Stuart” was performed in 1800.  The play was the inspiration for Gaetano Donizetti’s opera “Maria Stuarda” in 1835.  1936’s “Mary of Scotland,” starring Katherine Hepburn in the title role, was the first film version. It was followed by “Mary, Queen of Scots” in 1971 with Vanessa Redgrave and “Elizabeth” (1998), the world’s introduction to Cate Blanchett.  You get the idea.Screenwriter Willimon’s text is more than up to the task of crafting an original point of view.  This “Mary” becomes a meditation on themes that feel entirely contemporary.  The grace, courage and innate intelligence of both Mary (Saoirse Ronan) and Elizabeth I (Margot Robbie) stand in stark contrast to the self-absorption, conniving and over-reliance on violence that overwhelm the male characters whenever they perceive a chance to seize power.  The message is so cogent that is creates modest hopes that US politics may be leavened in the coming year as more women enter the equation.  The film also dramatizes the potentially corrosive influence of organized religion, as minister John Knox (David Tennant, working incognito behind a massive beard) bellows about Mary’s unacceptability to be a monarch worthy of respect, because she is Catholic not Protestant and has the misfortune of being female.This is nominally the first feature film for Director Josie Rourke.  However, Ms. Rourke has been in charge at Donmar Warehouse in London since 2011.  The first female Artistic Director in the history of the West End, Ms. Rourke’s theatrical sensibilities add depth and texture to the film.  This is particularly worthwhile as we see the visual evolution of Elizabeth from attractive young queen to disfigured smallpox victim to, eventually, the caricature in bright red wig and whiteface who has lost her individualism as she has become submerged in her role as monarch.Ronan and Robbie are also excellent.  Ronan shows the emotional versatility we’ve come to expect from her prior work - “Brooklyn,” “Lady Bird,” “On Chesil Beach.”  In this case, her portrayal of Mary is riveting as she communicates grace, courage, fear and intelligence in full measure.  Because the screenplay focuses so centrally on Mary, Robbie (so excellent in last year’s “I, Tonya”) is given a prosthetic nose and little to do until the film’s climax, at which point her forceful presence commands attention.  Along the way, both women communicate a fondness, respect and desire for friendship from a cousin who is simultaneously her most-feared rival.This “Mary, Queen of Scots” is a retelling well worth the full attention of today’s audience.  Most of us already knew that, by the end of the story, Mary would be a little light-headed.  It’s refreshing that we learned so much about gender, religion, power and humanity along the way."
    },
    {
      "rating": "8",
      "text": "Excellent betrayal of Queen Mary of Scotland. Her Scottish accent was believable."
    },
    {
      "rating": "8",
      "text": "The performances of the two lead actresses (Margot Robbie and Saoirse Ronan) were great, and the rest of the cast (full of well-known British actors) was strong also. That said, I think you have to be interested in history to really enjoy this film. I am, so this was no problem for me and my family. However, this film was more about history than about human beings, although I don’t think that was the fault of the actors, but of the director. And although I was interested and never bored, the film seemed longer than two hours."
    },
    {
      "rating": "7",
      "text": "Saoirse Ronan delivers a great performance and looks beautiful. The rest of the movie is meh."
    },
    {
      "rating": "7",
      "text": "I found this to be quite an engrossing watch. It may not (pretty much certainly isn't) entirely historically accurate/factual but it features good performances from the main cast and some impressive settings and so its watchable from that point of view. I thought it was quite gripping in the scenes featuring both of the distant warring family members and I thought it featured some rather impressive examples of cinematography. Also, I thought David Tennant gave a quite powerful performance, even though you don't see him much as such but moreso in terms of his speeches heard by a crowd of people on more than one ocassion. I feel his voice is instantly recognisable and I'd say him and Saoirse Ronan gave the most memorable performances, although Margot Robbie pulls her weight too. Elements of the plot may be a bit fanciful but I found it quite a gripping and interesting watch regardless.Also, I feel I can't review it without mentioning that there are some sex scenes and partial nudity present. It would be a slightly awkward watch for younger people if with parents and it did add a bit of a salacious element to it, which perhaps wasn't entirely necessary but for the most part its a gripping watch."
    },
    {
      "rating": "7",
      "text": "Saoirse Ronan and Margot Robbie are really strong in the lead roles. I don't think this film is very accurate Historically they have changed some things I guess to make the story more interesting."
    }
  ],
  "recommendations": [
    "the_danish_girl",
    "colette",
    "the_reader",
    "20th_century_women",
    "the_last_duel",
    "legends_of_the_fall",
    "bombshell",
    "the_favourite",
    "anna_karenina",
    "the_last_king_of_scotland",
    "tulip_fever",
    "jackie",
    "the_other_boleyn_girl",
    "closer",
    "cold_mountain",
    "belfast",
    "hidden_figures",
    "phantom_thread",
    "darkest_hour",
    "spencer",
    "the_theory_of_everything",
    "thoroughbreds",
    "american_beauty",
    "dances_with_wolves",
    "denial"
  ]
}