{"id": 2898, "title": "Mary Poppins Returns", "starring": ["Emily Blunt", "Ben Whishaw"], "runtime": 131, "genre": ["Fantasy", "Family", "Comedy"], "description": "Mary Poppins returns to the Banks family and helps them evade grave dangers by taking them on magical, musical adventures.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/uTVGku4LibMGyKgQvjBtv3OYfAX.jpg", "categories": {"plot": 6.925925925925926, "acting": 6.703703703703703, "ending": 7.444444444444445, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 6.0, "action": 7.0}, "reviews": [{"rating": "10", "text": "It`s an incredible movie! It brings so much joy with the songs, story and acting! Emily Blunt is amazing! A sequel that honors the original!"}, {"rating": "9", "text": "My wife, my 13-year-old daughter, and I went to Mary Poppins with guarded excitement. We'd read enough reviews to be wary that this was not going to be as enchanting as the first Mary Poppins. But we were surprised -- in a very positive way.I'm as big a fan of the original as you'll find; it was a substantial influence on my life when it came out (I wanted to grow up to be Dick Van Dyke). So I was especially doubtful. We had purchased the soundtrack, which was released a couple of weeks before the movie, so we were already familiar with the songs -- and really found several of them to be nearly as memorable as some of the Sherman brothers' songs -- particularly \"Nowhere to Go But Up\" and \"A Cover is Not the Book.\" So we already liked the music.Well, the movie was enchanting. I sat there was a big silly grin on my face for most of it; my wife sobbed at several points, and my daughter squeezed my hand repeatedly and actually cried at the end (which is unusual for her; she tends not to lose it at emotional endings). We left singing the songs, and absolutely thrilled with Emily Blunt and Lin-Manuel Miranda. I was also incredibly impressed with the kids and with Ben Wishaw...and of course it was so uplifting to see Dick Van Dyke and Angela Lansbury still in form.If I had one criticism, it was that the plot setup seemed rush and workmanlike. I could have stood a little more character development before the heavies moved in. But that's a small quibble in what was otherwise a transporting film that I recommend wholeheartedly, especially for families and those who can abandon their cynicism temporarily and give themselves over to the fantasy."}, {"rating": "9", "text": "I didn't like that gennre, but boy... this movie is full of joy, happiness with really nice production design and great costumes and good songs. I can only watched the hungarian dubbed version (even the songs were dubbed) in cinemas, but i will watch it in original language too. Blunt is superb, she will recieve that Oscar nod sure thing. I just keep smiling for 2 hours."}, {"rating": "10", "text": "Though the wholly enchanting \"Mary Poppins Returns\" received mostly excellent reviews as did the film's titular star Emily Blunt, what surprised me most was the terrific score by Marc Shaiman which is anything but unmemorable. \"Nowhere to Go But Up,\" \"A Conversation,\" \"Trip a Little Light Fantastic,\" \"Underneath the Lonely London Sky,\" \"The Place Where Lost Things Go,\"(the film's very best song) and \"Can You Imagine That?\" lead a spirited, lyrically accomplished array of songs that make this homage to one of the screen's most beloved musicals in its own right an effervescent confection that also forges its own path. Splendid cameo numbers from Dick Van Dyke, Angela Lansbury and Meryl Streep add to the unbridled merriment."}, {"rating": "10", "text": "Wonderful! Just as magical as the original. Like in the 1960s, children of all ages was awed to silence, and adults were roaring with laughter.  I plan to see it again! Mary Poppins has always been my favorite movie.  This movie set 20+ years later was true to the original storyline, but amazingly contemporary.  (Lin-Manuel Miranda rapping Hamilton-style. And Dick Van Dyke dancing again!)  Another Classic that will ensure for generations!"}, {"rating": "8", "text": "In the interest of full disclosure, I was skeptical about this one and wasn't particularly looking forward to seeing it. I must admit, however, that I enjoyed it more than I was expecting, especially since remaking classics or creating sequels to them is very risky business (and something that often makes me cringe). This offering does justice to the original by not ruining its legacy, thanks to the excellent production values, fine performances and an enjoyable soundtrack that, unlike so many contemporary musicals, isn't totally forgettable. Emily Blunt pays perfect homage to the legendary character and is worthy of whatever acclaim that comes her way, and kudos are definitely due a fine cast of supporting players. The film is, unfortunately, somewhat episodic, using the narrative between musical numbers mostly as a bridge to link the songs to one another. Otherwise, though, this is a capably made and surprisingly delightful release."}, {"rating": "7", "text": "This is a film that can feel incredibly cheesy for the times in which we live, both real and cinematographic but I think that also gives it a fairly big merit considering that it managed to print that old Disney magic in a story that they did not seek to update but simply resume and it works. Not like the original without a doubt, but it definitely works.Emily Blunt's work is amazing. She's really the best of this film. The rest of the cast pales before her work even though they don't do things badly.Lin-Manuel Miranda's inclusion doesn't work really well and his English accent is pretty bad. I don't deny that he tries but this was not the kind of film that required his talent.I should also mention that none of the songs are memorable so that's also a negative aspect. Good songs, functional songs but hardly remarkable.Is it worth it? Of course. Believe me, this film will hardly become a classic but at this time and with its quality it's an indisputable option."}, {"rating": "7", "text": "This Movie Is Just Like Original Mary Poppins But Different, The Last time I See this Movie Is I was Watching This Movie At Event Cinemas In Glendale, NSW, The Music Is Best, The Movie Was Best, And Many Things Was Best"}, {"rating": "7", "text": "I generally don't watch this type of movies, but it was pretty fun to watch. Songs and choreography were merged pretty well with the movie plot, but I felt the movie could be a lot shorter. It felt long, and some plot points were unnecessary. Overall, it's fun to watch but not cinema worthy. Wait for it to launch on Netflix."}, {"rating": "10", "text": "Emily Blunt showcases a magnificent performance in a familiar yet fresh setting with a new direction of more delightful musical numbers and improved visuals while giving a wonderfully welcome cameo of Dick Van Dyke. Mary Poppins Returns will bring back good old memories of its classic predecessor."}, {"rating": "10", "text": "I completely enjoyed this movie for what it is.  It is a funfilled, wholesome movie with a nice story. The acting is great and the songs too.  You can take anyone of any age to this and they will enjoy it. Well done."}, {"rating": "8", "text": "Wow! What an absolute joy to watch! Of course, I love the original film, as it's such a fun and charming classic, but man, not only was this a worthy successor, but this is pretty much an instant classic in its own right as far as I'm concerned, as it holds its own against the original effortlessly! Emily Blunt is absolutely perfect in the titular role, and without a doubt does Julie Andrews proud (she even gave Blunt her personal approval!) And for all the Hamilton fans, Lin-Manuel Miranda charms marvellously alongside Blunt. The songs are a delight, and the animation sequences that blend with the actors, much like in the first film, are all beautifully rendered. Topping all of this off are some fun little cameos in the film's final act. I will say that I was a bit disappointed that there weren't really any songs from the original (not even Supercalifragilisticexpialidocious), and I thought some renditions of at least a couple might've been fun to see. And there are some familiar and predictable tropes and moments, but when a film like this has me grinning from ear to ear for nearly the whole time, it hardly even matters! Overall, whether you've seen the original or not, you'd have to have a heart of stone not to be even remotely won over or charmed by this joy of a film, as it's an absolute delight to watch from start to finish! Simple as that!"}, {"rating": "8", "text": "First of all, Emily Blunt's performance as Mary Poppins is excellent. She makes this famous character her own by just embodying her. She seems more like somebody who actually cares about these children. The ending shows this the best. Also in the song “Where the Lost Things Go” they show her caring for the children a way that the original didn’t show. I also have to applaud Lin-Manuel Miranda, who played Jack, performance in this film. You could easily tell that he was having fun with his character. I just wished we got to see his character more. I’m glad that they didn’t change the special effects in this film and kept it in the style of the 1964 one. They did put a slight modern day look to it but it was still the same style at the end of the day. Now some people say that none of the songs in this aren’t catchy and I argue over that. I would say that all but a few songs are catchy. The only non-catchy songs are the ones that are a bit slower and “Turning Turtle.” All the other songs are energetic and have great choreography to go with them. Marc Shaiman also composed the original score for this film and it’s just as magical. During the opening credits you can hear his score and in it, there are hints to the songs from the first film. The production design on each of the sets looks straight out of the first. I just wished they took a bit more care in making the house look more like the original. There are some obvious details to it that make it not look similar. For one the entryway is entirely different. They had some unique transitions between the scenes of the real world and imagination. The atmosphere in this film was excellent. In each scene, it gave off the correct type of atmosphere that you would feel in that situation. Finally, I think there were a few scenes that could have been cut out and it wouldn’t have affected the movie. Mainly because they did nothing with it later on. In the end, Mary Poppins Returns is an excellent film that is just as great as the first one."}, {"rating": "10", "text": "Delightful! Joyous! and so touching. Ben Wishaw is so ardent that he melts your heart. The kids are just right. Emily Blunt is Magical, Magical. Her voice is fantastic.  The songs are hummable and memorable. I've been singing \"Can You Imagine That,\" and \"Nowhere to go but up\" all week. The finale with the balloons surpasses the wonder of \"fly a kite.\""}, {"rating": "9", "text": "Nothing will top the first Mary Poppins. There’s no disputing that but the sequel is just as wholesome. Emily Blunt does as fantastic job as Mary Poppins which surprised me"}, {"rating": "9", "text": "I hate to be cliche, but it's practically perfect in every way. Emily Blunt is tremendous - one of today's finest actresses."}, {"rating": "9", "text": "A lot of people have been saying they don't like this movie as much as the original, but I had a lot of fun watching this movie! Emily Blunt did an excellent job portraying Mary Poppins, & I loved the fun they put into the musical scenes! When I walked out of the movie, I had the \"Can you Imagine That?\" song stuck in my head for the rest of the night! Excellent sequel to the original!"}, {"rating": "10", "text": "Mary Poppins Returns, about the titular nanny returning to help the grown up Banks children, was a true experience for me that brings back the feel of the original Mary Poppins and 60's Disney in general. (It even has a nostalgic old-fashioned opening credits).The entire thing looks and feels fantastic like an old-timey storybook. Includes a new 2-D animated/live-action segment, not something we've seen in a while and a welcome comeback. The story itself has a very old-fashioned and genuinely good-hearted feel to it.Great cast. Blunt makes and an excellent Mary Poppins, and Lin Manuel Miranda is pretty likable as Jack, Bert's replacement. Ben Wishaw (the voice of Paddinton and the most recent Q from the James Bond films) does a surprisingly sympathetic job as Michael Banks mourning the loss of his wife and just trying to keep things together.The songs, by Marc Shaiman (Hairspray and parts of the South Park movie and Team America) aren't as catchy or memorable as the first film, but that's not knocking these songs. I did like them all and they again captured an old-school feeling.There were some weak points. A lot of the scenes set in London, were too darkly shot for their own good. I mean I understand that an intentional style choice as the bleakness of London contrasts with the brightness Mary Poppins brings, but it makes it a pain to watch at some points.The movie is basically like The Force Awakens as it repeats many elements from the first film. (They even bring back Admiral Boom, now played by David Warner. I mean come on he was no spring chicken in the first film. He should be dead by now.) Also, the whole mother-just-died bit was done by Disney only a month ago for the Nutcracker movie, although this movie handles it a lot better if you ask me.Lastly, the main antagonist is paper-thin and whose crookedness exceeds practicality. This is especially disappointing as the first film didn't need this sort of villain to drive the plot.Those criticisms aside, I had so much fun with this movie that I'm still giving it a full rating. There is nothing really objectionable in this but be forewarned younger children may be bored by the more talky moments. I saw restlessness in my nephew and other young children while watching this."}, {"rating": "10", "text": "Absolutely delightful movie! I had a smile on my face pretty much through the whole film. The music and dance numbers are top notch as well as the performances. I grew up on the original, but, I have to say this new Mary Poppins movie is definitely well done. The feel good movie of the year."}, {"rating": "10", "text": "Gorgeous family film and ms blunt is genius as poppins. The musical numbers including 2D are magical."}, {"rating": "6", "text": "Emily Blunt does a good job of portraying Mary Poppins, and Lin-Manuel Miranda is charming.  There are perhaps around three good songs.  And it is a treat to see Dick Van Dyke and Angela Lansbury.  However, the plot is a mess.  Both the death of the mother and the impending home foreclosure are too much darkness to deal with.  They could totally do without the foreclosure subplot, including the absurd effort to change the time on Big Ben.  Colin Firth is saddled with playing a one dimensional villain."}, {"rating": "8", "text": "After 54 years, her return to the screen pretty much follows the template of the original: sweet children, withholding father, tuneful songs, eye-popping fantasies, and of course, the sassy nanny (Emily Blunt). The situations are Disney sweet (even when times are down), the performers are all fine (Blunt was acceptable, but not outstanding), the flights of imagination are enjoyable and the pleasant tunes feel stylistically like the originals without being memorable. The film hits all of the right notes, just not as wonderfully as the first time. While it's not without charm and the story never lags, this follow-up doesn't possess that special magic that made the original a classic."}, {"rating": "3", "text": "Aside from a likeable Emily Blunt, this movie was horrible. The last quarter was good and watchable and fun. Music was dull and not catchy. Movie lacked depth and definitely the feeling of the original.  Jacks character made me squirm. So disappointed. Loved the scenery hovering over a London."}, {"rating": "6", "text": "Mary Poppins Returns is an average movie by musical standards. It had a pretty good story and songs but it lacked anything that made it truly memorable. The songs were not all that catchy and the characters weren't that interesting."}, {"rating": "8", "text": "I am a fan of Emily Blunt after watching her last few movies. I am still mixed feeling on this movie, but I think it was an above average movie for sure and worth a watch. I couldn't help but yell, \"I'M MARRY POPPINS Y'ALL!\" in the theater before the movie started."}, {"rating": "5", "text": "Emily Blunt as Mary Poppins is amazing, otherwise this movie is a total waste of time.  The songs aren't anything noteworthy.  The character Jack seemed to only be there to remind us that Dick Van Dyke was amazing in the original.  Poor Jack had nothing to contribute other than act as a counterpart for Mary. More often than not his presence is distracting."}, {"rating": "6", "text": "“Mary Poppins Returns,” as a show, is less than the sum of its parts.  But some of those parts are magnificent.  First, there is the respectful homage to actors of a prior generation.  Dick Van Dyke, who played Bert the Chimney Sweep in the original “Mary Poppins” (1964), returns in this film, even singing and dancing in a final scene, no small accomplishment at age 93.  Karen Dotrice, the original Jane, has a brief cameo.  Angela Lansbury, also 93, who had no association with the original film, is amazingly spry in her brief appearance as a strong-voiced Balloon Lady.Emily Blunt, who showed off her musical theater chops as the Baker’s Wife in “Into the Woods” (2014), is luminous as Mary – the perfect blend of regal bearing, mischievousness and warmth.  When Mary Poppins is in charge, this film is on strong footing.  On the other hand, when Lin Manuel-Miranda (Jack the Lamplighter) is on the screen, the audience does not “look around at how lucky we are to be alive right now.”  His efforts need considerably more work, work.Director Rob Marshall previously has been quite effective in bringing Broadway musicals to the screen.  “Chicago” won six Academy Awards in 2003, including Best Picture, the first musical since 1968 to win the top award.  His versions of “Nine” (2009) and 2014’s “Into the Woods” also are worthy of note.Here, Marshall receives another credit as one of three story writers.  One wonders why, since the plot is almost incidental.  Widower Michael Banks (Ben Whishaw, so excellent in Amazon Prime’s “A Very English Scandal” this year) has fallen on hard times.  He and his family are about to be evicted from their ancestral home.  If only the family can find their Certificate of Shares in the bank that holds their mortgage, all will be saved.  Six-year-olds across the world have a clear sense of how this will all end.  The show lurches happily along from one song opportunity to the next, sometimes with no plot development.  One interesting quirk:  this may be the only Disney film in history where the animated sequences are by far the least effective elements of the film.The score by Marc Shaiman, with lyrics by Shaiman and Scott Wittman, the team behind the excellent “Hairspray” (2007), is entirely serviceable.  However, it suffers in comparison to the score of the original film.  “Mary Poppins” offered a series of songs known by generations - “A Spoonful of Sugar,” “Chim Chim Cheree” and “Let’s Go Fly a Kite.”  In this film, the score is super-cali-fragil-never-mind.  There are no soaring ballads here that you simply can’t get out of your head.  In fact, given the non-existent plot, many seem entirely interchangeable.If you need a diversion to minimize the time you have to spend during the holidays talking with family members you’ve avoided all year, this may be the show for you.  Medical warning:  do not take a spoonful of you-know-what before viewing.  It would just be redundant."}, {"rating": "6", "text": "Though this film is quite delightful and good for the whole family, the visual effects of the first fantasy sequence and the borrowing from the original booka and stage musical limit this film from finding a true identity and justifying it's own existence. Solid C"}, {"rating": "2", "text": "This movie firstly wasn't even needed, secondly, I cringed the whole time, and thirdly, it was just plain horrible. I only have it at one star because of the appearance of Dick Van Dyke. If he wasn't in this film, I would have given it a 0/5. The plot, one dimensional, acting, meh, Meryl Streep, not needed. Everything about this movie was dreadful. I'd think if the dancing penguins made this, they would've done a much better job and getting it right!"}, {"rating": "9", "text": "I can't believe some people. The movie was a fantastic feel good experience, which is exactly what I want from my disney movies. Does the movie have faults? Sure. Is the plot a tight knit web of threads? No. But that's not the point, not of this breed of disney movie."}, {"rating": "6", "text": "Nada de otro mundo es lo mismo que mary poppins original la música nueva no es pegadiza pero emily blunt hace un buen trabajo"}, {"rating": "9", "text": "Mary Poppins Returns is an amazing show in my video. It showed the same kind of Mary Poppins, but the original children in a different way. I love that it shows how it shows the relationship between the siblings and how Michael grew up and the struggles he goes threw which reminded me that not all shows are about someone's absolutely perfect life."}, {"rating": "1", "text": "Rather than bringing this classic Disney movie sequel to the here and now, the movie is an excruciating, unimaginative, dated rehash with a mess of a screenplay, forgettable, stitched together musical dance numbers and songs that don’t advance the story. Despite the admirable performance of Emily Blunt the movie is simply unbearable!!!!"}, {"rating": "3", "text": "Serviceable musical and \"old school\" visuals, but overall brainless betrayal of the original that mimics the look and sound but failed to replicate the heart and mind."}, {"rating": "0", "text": "They made it like a Broadway play instead of a mary popins  movie And not one single memorable song If disney was still alive he would not approve of this movie He wanted the songs to be memorable This movie didnt have any catchy songs they treated it like a Broadway play"}, {"rating": "3", "text": "A shovelful of Splenda makes the mediocrity go down, whether you like it or not. 'Mary Poppins Returns' is practically perfunctory in every way. Like 'The Force Awakens' and other recent products fresh off the Disney assembly line, this retread slavishly recreates all of the familiar parts you loved from the original, without bothering to add in the innovation, sense of wonder, and complex shades that made the original worth watching in the first place. The Disney faithful will love it as it not only preaches but panders incessantly to the choir (this time singing forgettable songs that sound like b-sides from Marc Shaiman's better, though still largely pedestrian, back catalog). For everyone else, it might be worth seeing just for the costumes and some of the choreography, otherwise just watch the first one."}, {"rating": "6", "text": "So is Mary Poppins Returns practically perfect in every way?  Hardly.  I'm a fan of Emily Blunt and she is solid in the role, although smiles a little less than Julie Andrews.  The movie follows the exact same formula as the original making it predictable.  In the first movie the kids didn't like taking their medicine so Mary came up with a way to make it enjoyable (a spoonful of sugar), in this movie it's bath time.  The singing and dancing are fine throughout, but for me the weak point of the movie is the songs.  I can't remember a single song after watching this movie.  The songs are too wordy, not catchy.  It's not a bad movie but once again it feels that Disney is simply remaking older movies because they have run out of original ideas."}, {"rating": "5", "text": "There's no doubt that I had high expectations going into this movie, considering the original Mary Poppins is one of my favorite Disney movies. While I give credit to the acting and vocals (especially by Blunt as the new Mary Poppins), as well as art design, the film overall is a very mediocre followup. Director Rob Marshall makes what should be an awe-inspiring experience a boring one with lackluster cinematography, a retreading story, and good but forgettable songs that seem to try too hard to emulate many of the classics in the original rather than break any new ground. Overall, this is mediocre followup to a classic film and I am rather disappointed."}, {"rating": "2", "text": "A bad sign watching a movie is thinking mostly negative thoughts and after an hour I was thinking: 1) This really isn't a movie for kids as it is too dark and somber  2) This really isn't a movie for adults as it doesn't capture what made the first film memorable 3) Emily Blunt has talent but she isn't a Julie Andrews or a Mary Poppins  4) Emily Mortimer has that certain smile and would make a better Mary Poppins 5) Will this film get any better? and 6) The songs are pretty lame.There was one positive thought and that was Lin-Manual Miranda was continuing his place on the top of the hill after \"In The Heights\", \"Hamilton\", his score for \"Moana\", being honored on The Kennedy Center Honors this week, plus winning an Emmy Award, A Tony Award, Grammy Awards, the Pulitzer Prize, about to reprise his role as Hamilton opening the show in Puerto Rico and now doing a good job as Jack, the man who lights and shuts off the street lamps in the streets of London during  the Great Slump of the 1930s. Up to the hour and a half point--no pun intended--he is the only bright light.Julie Walker, as the housekeeper, is almost an afterthought while Colin Firth should have been given a mustache to twirl as the villain to do something with the role. As the Banks children Pixie Davies, Nathanael Saleh and Joel Dawson they are given little more than they are expected to while Emily Mortimer, as their aunt, lights up the screen here and there and Ben Whishaw, as their father, really is wooden up to and in the last half hour of the film when he really comes through in a moving scene. Oh, yes, the less said about Meryl Streep, her song and her time on the screen the better.The last half hour in no way makes up for the first 90-95 minutes but the screen does come alive with a song and dance by 93 year-old Dick Van Dyke up on a desk, with movie magic or not, reprising \"Tripping The Light Fantastic\" done earlier in the film by Miranda, along with 93 year-old Angela Lansbury as the Balloon Lady singing one of the better songs from the movie, \"Nowhere To Go but Up\" starting a full cast number.Lin-Manuel Miranda always talks about watching the old song and dance movies and in \"Mary Poppins Returns\" he has two numbers, the first being \"Tripping The Light Fantastic\" and the second, \"Race To Big Ben\", that fulfill any dreams he might have had and brings back the magic of \"Mary Poppins\".\"Mary Poppins Returns\" offers 30 minutes of entertainment in a film that is 130 minutes long and can probably watch Lin-Manuel Miranda, Dick Van Dyke and Angela Lansbury in their show shopping numbers on youtube!"}, {"rating": "6", "text": "“One thing you should know about Mary Poppins: she never explains anything”.This movie had a lot to live up with it being a sequel to a beloved classic. While I’ve seen the original movie on repeat as a child - it never had that massive impact on me like everyone else, but with each re-watch I found more enjoyment and appreciation for everything that went into it.So this being a sequel made me curious and wary; I went into this expecting nothing to avoid any disappointment. I sat down, arms crossed and waited patiently for the trailers to be over. When it started, the first 10 or 20 minutes was fine, but I was still critical. After the first musical number “Can You Imagine That?”, I started to warm up a bit and relax more.However, halfway through the movie I noticed something about myself - there was tears streaming down my cheeks, and for a rare moment, I breathed a sigh of relief and enjoyed the ride. This is the first time in awhile I would call my experience escapism.Emily Blunt was an absolute delight as Mary Poppins. Blunt never imitations Julie Andrews portrayal and makes the role her own. I honestly couldn’t think of anyone else to fill in the shoes of the character than Blunt. Her sassy and deadpan wit makes this super nanny pure magic.The other cast members were also solid: Lin-Manuel Miranda delivers a theatrical performance that elevates the films charm and brought a smile to my face. Ben Whishaw, on the other hand, was so heartbreaking as the grieving Michael Banks. You can feel the pain and stress in his voice. Emily Mortimer is good as Jane Banks , but felt under-use and didn’t offer anything to the story.Also Dick Van Dyke dance scene, while short, was unbelievable. He’s got more energy than any wanna be dancer, and he’s 93 years old.Rob Marshall gives the movie a Broadway-like touch similar to his previous work. The musical sequences with songs like “Nowhere to Go But Up” and \"Can You Imagine That?\" being colorful and a blast to watch, which adds to the escapism. The production design and choreography - mwah. He also tackles the more serious elements where the emotions from the characters are expressed through songs and the performances.For issues: The songs themselves while fun, yet not super memorable and doesn't hold a candle to the 1965 film. After the movie was over, the songs didn't stick with me as I hoped. This might change over time.The main villain played by Colin Firth is so cliched and cartoonist. I started to question why a movie like this needs a bad-guy - although I guess the climax needed to be more intense. He's even got a twirling mustache. When the character first appears on screen, I knew straight away there was something unpleasant about him and the foreshadowing involving an animated sequence was so painfully obvious. His character could have be great if it was written better.Meryl Streep short appearance is so pointless and could've easily been cut out from the final daft. I wasn't sure what accent she was going for.Overall rating: It's not flawless, yet it wasn't an abomination like some expected it to be. I would go as far to call it a satisfying sequel.Perhaps we've learned when day is done, some stuff and nonsense could be fun."}, {"rating": "3", "text": "Saw the movie with my family who liked it, but was an endurance test for me. \"Mary Poppins Returns\" was completely derivative of the classic, but failed in almost every regard. Couldn't they have developed an original idea or story? The songs were out of your typical modern Broadway musical, bland and forgettable--nothing like the original. Emily Blunt is a good actress, but too \"hard\" as Mary Poppins for my taste. I think Lin-Manuel Miranda and Ben Whishaw were just miscast. Miranda tries too hard to be Dick Van Dyke and Whishaw as Michael Banks is an unsympathetic nebbish. I gave the movie 3 stars for the production values, but otherwise found the movie to be a pathetic imitation of the original classic."}, {"rating": "3", "text": "MP was a tough one to seat through, 3 hours at the theater,every song sucked and adults and kids restless."}, {"rating": "3", "text": "This film just does not live up to what the critics have been saying. Disappointing."}, {"rating": "5", "text": "Blah.  It was mildly entertaining, but the plot, songs, and dances are all quite forgettable."}, {"rating": "5", "text": "Basically a copy-paste of original film with great visuals but bundles of PC nonsense."}, {"rating": "6", "text": "Disney seems to rely more and more on their subsidiary studios for both originality and box office returns, as this so called sequel is one of the most disappointing film of 2018.  This flick suffers the exact same problem that Solo experiences the year before. For one, Emily Blunt, as good as she is, can't compare with Julie Andrews. Sure she tried to make the role her own...but she does not have the charisma to pull that role off.  Also, the musical numbers...completely forgettable. Lin Manuel Miranda tried his best, but failed to replicate the amazing musical numbers of the past."}, {"rating": "6", "text": "Acclaimed musical director Rob Marshall employs his \"Into The Woods\" collaborator Emily Blunt to revisit a classic. Somehow the resulting product, \"Mary Poppins Returns,\" ends up simultaneously being one of the most unnecessary and uninspired sequels I've ever seen, yet still a watchable one. A film where its circumstances and central conceits are ultimately more dire than its predecessor's, there's almost nothing about its musical aspects that's worthy of screentime. The musical numbers only serve to distract the main characters from the central conflict of the film. Mary Poppins as a character is borderline inconsequential to the course of events and the songs themselves are almost entirely unremarkable. Still, as someone who's not necessarily a \"Poppins\" purist, it doesn't bother me all that much. It's just a harmless, silly, disposable junk food film. Don't expect much more than that."}, {"rating": "6", "text": "I enjoyed watching this musical - you can tell it was made by fans of the original and great care is taken to tick certain boxes that a fan would expect to see.... sadly the result is somewhat dry in execution with little in the way of memorable songs (exception for me was everything goes turtle!), and the project overall felt more iteration than innovation telling a long drawn out predictable tale with an odd cast of individuals that never quite had a group chemistry I could gel with... That said, if you're a hardcore fan of the original, there could be something here for you and it was made with the kind of calculated love we have grown to expect from the age of Disney's 'reboots & awkwardly late sequels'."}, {"rating": "4", "text": "Technically well done, good casting of a fine Emily Blunt and a competent but entirely interchangeable Lin-Manuel Miranda it's nothing new, nothing special and nothing riveting to behold unlike the groundbreaking Disney classic from the sixties was at the time."}, {"rating": "6", "text": "Emily Blunt is clearly the best thing in this movie, which itself is a fun ride for families with younger children. However, Lin-Manuel Miranda is not very good and brings the movie down the entire time."}], "recommendations": ["mamma_mia_here_we_go_again", "cats", "into_the_woods", "sweeney_todd_the_demon_barber_of_fleet_street", "mary_poppins", "begin_again", "hairspray", "yesterday", "jingle_jangle_a_christmas_journey", "burlesque", "the_parent_trap", "winnie_the_pooh_blood_and_honey", "almost_famous", "the_greatest_showman", "grease", "cruella", "vivo", "charlie_and_the_chocolate_factory", "sing", "walk_the_line", "chicago", "rocketman", "the_sound_of_music", "trolls", "sing_2"]}