{
  "id": 4846,
  "title": "Masterminds",
  "starring": [
    "Zach Galifianakis",
    "Owen Wilson"
  ],
  "runtime": 94,
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "description": "A night guard at an armored car company in the Southern U.S. organizes one of the biggest bank heists in American history.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4CXgye1p8Vr7taDG389QhhHDUZ4.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 4.75,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.730769230769231,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"
    },
    {
      "rating": "7",
      "text": "++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "7",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》*******************************************************"
    },
    {
      "rating": "7",
      "text": "Man tends to do crazy stuffs for a woman, but stealing $17m is too crazy.The film reminded me 'Pain & Gain', only for inspiring from the real and being the comedy flicks. Other than that there's nothing in common between them. I have been expecting a lot from Zack since 'The Hangover', but it was always the near missed opportunities. I'm not saying this was his much needed breakthrough, but quite enjoyable film.An honest man who worked long enough as a guard for a bank, was approached by his ex colleague and her men with an offer. Since he was madly in love with her, he could not say no to it, despite he already got engaged to another woman. As planned the heist goes on and once it was done, he was ditched and ratted out. Now on the run, how he responds to it and the following events decides his fate.Not a great comedy nor a heist film, but it had its moments. The casting was good and it was Zack's show. The rest of them were not into that much, except in the final act. Jason Sudeikis was a bonus. His appearance added more fun. Now I know why Jim Carrey opted out. Owen Wilson's part was not good enough in such a small role, he did good though. Watching it for timepass is fine or even for beyond that seems not a bad try.7/10"
    },
    {
      "rating": "9",
      "text": "\"Masterminds\" is the first movie in a long time where I have actually laughed out loud. Great cast, and Kristen Wiig and Zach Galifianakis are especially funny, but I also got a big kick out of Jason Sudeikis and Owen Wilson. It's based on a true story, so stick around during the credits to see photos of the real people that the movie was based on."
    },
    {
      "rating": "7",
      "text": "I don't know, I guess I like a bit more dumb comedies as usually I disliked previous Kristen Wiig's comedies sometimes because of the aspects in them which made them a bit boring, like Welcome To Me - here the story is quite interesting and actually based on real events. Plus the comedic stuff isn't too over the top or too dumb. Of course it is still dumb, but it is a comedy, what do you expect? All comedies work with dumb jokes. If you don't like dumb jokes, then you need to watch different type of comedies and should have known that Galifianakis and most of the other actors there have maybe 1 or 2 comedies like that or even none?"
    },
    {
      "rating": "9",
      "text": "This comedy about white trash characters performing a dumb heist is perfect! Amazingly written great comedy that makes you laugh to the point your ribs hurt. Great SNL cast filling out hilarious character set and Galafanakis with his signature humor and situational comedy. As good as or better than \"meet the joneses\"."
    },
    {
      "rating": "1",
      "text": "This was one of the worst movies I've ever seen. Anything that was even slightly funny (which were few and far in between) was nothing near original. Truly disappointed."
    },
    {
      "rating": "10",
      "text": "Loved it. Screwball crime caper with gross-out gags. Coen Brothers meets Farrelly Brothers. Kate McKinnon and Jason Sudeikis stand out. Based (loosely!) on a true story."
    },
    {
      "rating": "5",
      "text": "This film is going to really best appeal to juvenile rednecks - and those who can't get enough of the SNL cast Class of 2012. Seriously, it's like one long SNL skit and you just KNOW how bland that's going to be. I got through it though, mainly on the promise of Based on Real Events. Best redneck punchline from it: \"That was like a fart transplant.\""
    },
    {
      "rating": "3",
      "text": "The is was a pretty stupid movie. The movie has a great cast and some genuinely funny moments. Even though it is a so called \"True Story\" there is no way that some of this actually happened. If so wow! There is some crazy/stupid things that happened."
    },
    {
      "rating": "1",
      "text": "I watched this movie on a plane ride back from Scotland. I think I would have rather than plane crashed into the sea. This movie is a series of bad SNL skits strung together back to back. None of the characters make sense, there really isn't a plot, and the acting is subpar."
    },
    {
      "rating": "6",
      "text": "Reminds me of the Smashign Pumpkins song. \"Disarmed.\" Love Galifianakis, Wiig and Wilson. So ..This movie was so perfect for me. I go to heaven every day for three years. They served delicious gyros with just a little too much sauce. The onions were very good but your breath stunk afterward. And after a week or so you get sick of eating the same thing. Would it kill you to offer us some mozzarella sticks, God?I talked with God and he said he was hoping that the Phoenix Coyotes would win the Stanley Cup this year and I had to tell him that they're called the \"Arizona Coyotes\" now. He seemed surprised and said, \"that's a much worse name.\" I agreed and said I would see him tomorrow. He asked if he could come with me and I said it wasn't a good idea because I was very tired.Through God anything is possible, so I'm giving this a 10."
    },
    {
      "rating": "0",
      "text": "One of the worst comedies I've ever seen. Completely wastes a true story with terrible jokes, a scattershot plot, poor and over-the-top acting and cheap direction."
    },
    {
      "rating": "4",
      "text": "Jesus with cat eyes. That's like the only funny thing in this. Also the cast, working with very little. At least Jared Hess's other films were bats - exceptionally weird and go for broke. This is broad and dumb."
    },
    {
      "rating": "3",
      "text": "I went to see this movie with one of my two best-friends. He couldn't stop laughing all through-out the movie, and I couldn't understand why. It unfortunately doesn't build up and its amazing cast doesn't make up for its rotten humour. Other than some funny but forgettable jokes that make you giggle, this movie is otherwise a miss."
    },
    {
      "rating": "6",
      "text": "Zach Galifianakis plays the kind of simpleton that he does so well (and usually to comic effect). He's a guard for an armored car company who's talked into stealing millions by the equally dense woman he has a crush on (Kristen Wiig, who underplays her role with less successful results). The ironic title means that stupidity is glorified into a clueless cast of characters. Some of the gags land a laff, but others just try too hard. The supporting roles add to the fun, especially Kate McKinnon & Leslie Jones.  The lively energy keeps it moving and the quirky attempts at humor sometime succeed. NOTE: See the real people on which the movie is based during the credits."
    },
    {
      "rating": "9",
      "text": "Come on and lighten up!!  No=this won't ever win any academy awards, will it make your sides hurt from laughing=YES!!  If you like stupid dumb comedies like the Hangover series, Wedding Crashers, Due Date, and of course Dinner for Schmucks then you will love this one.  Zach Galifanakis is a riot and pulls off this comedy with the support of others, but most of the humor he does single handed, although hats off to Jason Sudeikis who gives him comedic support as the not so brilliant hired killer Mike McKinney.  There is a laugh a minute in this movie and for me it never dulls, as literally my sides hurt as I did lots of laughing out loud.  Perhaps some don't like this type of humor, but for me I love it.  I will be buying this one when it comes out on dvd so I can relive the scenes and humor and one liners.  I wasn't the only one in the theater lol as I heard everyone else laughing it up too.  Give it a chance I don't think you will be disappointed at all, for me it will be one I relish over and over."
    },
    {
      "rating": "4",
      "text": "galifinakis' character was hilarious but the setting was all wrong. this was messy at best. I was freaked out by all females in the movie which is actually a good thing i guess.... i don't understand why so many always sunny things have to be all over the place but its also a good thing....with a total of three satisfying moments1(parent trap) 2 (locked in the truck) 3(galifinakis) I would say that watching this one more time is gonna be a challenge especially after i felt like the trailer made me think this was going to be awesome."
    },
    {
      "rating": "5",
      "text": "Masterminds doesn't play the minding part exactly the way it was supposed to. Instead, it's just not as funny as it is supposed to feel like. Like Masterminds does what it tries, but fails at what it's supposed to do."
    },
    {
      "rating": "4",
      "text": "A passable comedy, with SNL alums Wiig, McKinnon and Sudeikis. Jared Hess does what he can with so little. It has so little of his original style and enough of Lorne Michaels as a producer, it might as well be one long SNL skit."
    },
    {
      "rating": "9",
      "text": "After seeing low ratings for this film, I wasn’t expecting much but I actually really enjoyed it! The cast is brilliant and i found it really interesting"
    },
    {
      "rating": "7",
      "text": "♡♡♤♡♤♡♤♡♤♡♡♡♡♤♤♤♤♡♡♡♡♤♤♤♤♡♡♡♡♤♤♤♡♡♡¡¿》¿¡¿¡》¡¿¡¿》¿¡¿¡》¿¡¿¡》¡¿¡¡》¡¿¡¿》¿¡¿¡》¿¡¿¡》¡¿¡¿》¡¿"
    },
    {
      "rating": "7",
      "text": "*\"*\"*\"*\"*\"*\"*:*:*:*:*:*:*;*;*;*;*;*:*:*:*:**:*;*;*;*;☆⊙⊙°•°⊙☆☆⊙°•☆⊙°••°⊙☆°°•●°•●°•"
    },
    {
      "rating": "7",
      "text": "Zach is hysterical!Zach commits 100% to his roles, and gives himself wholly to this semi-true story, exaggerated for comic effect. I love a good slapstick, juvenile comedy especially when it's in the nuanced hands of actors like Galifinakis and Wiig. Hess has made me laugh hard before, and after a few turkeys, I wondered if he could repeat the trick. All I can say is I had a great time watching this one, and I laughed out loud a lot. Good comedies are a rare breed, and Masterminds is among my faves."
    }
  ]
}