{"id": 4008, "title": "Master and Commander: The Far Side of the World", "starring": ["Russell Crowe", "Paul Bettany"], "runtime": 138, "genre": ["Adventure", "Drama", "War"], "description": "After an abrupt and violent encounter with a French warship inflicts severe damage upon his ship, a captain of the British Royal Navy begins a chase over two oceans to capture or destroy the enemy, though he must weigh his commitment to duty and ferocious pursuit of glory against the safety of his devoted crew, including the ship's thoughtful surgeon, his best friend.", "releaseYear": "2003", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/s1cVTQEZYn4nSjZLnFbzLP0j8y2.jpg", "categories": {"plot": 7.217391304347826, "acting": 6.285714285714286, "ending": 5.8, "soundtrack": 9.0, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 5.0, "action": 8.0}, "reviews": [{"rating": "10", "text": "This film masquerades as a high-adventure war picture, but is actually at its heart, a simple and perfectly-told story of friendship and camaraderie.  The pursuit of the French vessel, magnificent as it is, is just the backdrop to this elegant, emotionally stirring and intellectually powerful narrative.  Easily one of my top ten favorite films of all time.  All of the haters can go watch something that appeals more to their intellectual level, like Transformers 2."}, {"rating": "10", "text": "The type of people below who say this movie is boring and uninteresting are the same type of people who can not appreciate art. They cite things such as boredom, because they are not intelligent enough to watch the little details that went into making a film of this caliber. This is an excellent film by Peter Weir with an extremely interesting premise and great historical authenticity for a film. It's a very historical movie based in the Napoleonic Wars. So if you're not into history you may not like it so much...but to call it boring, uninteresting, and ill-written is an utter disgrace. It's okay to call something that is **** exactly that. But just because your mind is tuned to follow more formulaic and \"explosive\" movies with complete bull**** does not give you the right to call a finely tuned, acted, written, scored, and directed piece of art such a moniker. Shame on all of those who have done such a thing here, may you forever rot in the sullen lethargy that is your narrow intellect. tl;dr-- Screw you if you don't like this **** **** movie."}, {"rating": "10", "text": "I was really surprised by the low user score that this movie received.  This is one of my favorite movies because it does such a great job of making you feel like you are witnessing what it was really like being on a war ship in the early 1800's.  Through this movie, you are able to participate in an incredible sea adventure as an observer without risking life and limb.  I have heard others state how they find this movie incredibly boring, but that just goes to show how people perceive things differently.  Sometimes you have to have a little patience to see the genius and depth that lay beneath the surface of what may otherwise seem ordinary from a distance."}, {"rating": "10", "text": "With realistic sets, brilliant costumes, and great acting, Master and Commander is not only entertaining but also historically accurate. With a full scale replica of a frigate, and Oscar winning sound design, it is the first film that any boat lover, history scholar,or just adventure seeker should see."}, {"rating": "7", "text": "Really good naval film with strong performances and writing. For the contemplative viewer."}, {"rating": "9", "text": "Really outstanding with great authenticity.  The attention to detail is brilliant as is the acting.  At times you experience the great discomfort of seafaring but always with a confidence that you are in safe hands, even during huge seas.  Very watchable and most enjoyable."}, {"rating": "10", "text": "For all those who gave this film a negative review and for those people wondering about watching it I say this:  If you think that more explosions = more fun and you think that Transformers (Good film) and Transformers 2 (Horrible film)  are the height of movie making then DO NOT watch this film.  It is NOT a traditional action movie.  It is for people who appreciate the art of storytelling and of watching a wonderful script from a classic book series woven into an artfully built crescendo.  A story where the characters are not simply 1 dimensional but are given time on screen to build depth so that you truly feel for them when both wonderful and tragic things occur. Some people call this boring.  THEY ARE WRONG.  They simply have the attention span of a moth.  This is a rich & rewarding movie experience for those with patience and a true appreciation for the craft of epic moviemaking."}, {"rating": "10", "text": "Everything about this movie is perfect. It's authentic and entertaining. It delivers the tactical naval warfare feel.\r I really wish there were more movies like this, but for now this one is one of a kind."}, {"rating": "0", "text": "This was as about as exciting as watching the splinters explode in the flick. The screenplay was terrible, the acting was disappointing, and there was no feeling for any of the characters. If you must see this sh.t take NoDose before you enter to see this NONaction boring film. Complete unadulterated crap."}, {"rating": "0", "text": "Max we're nuts? Take a look at the Metacritic scores and then take a good look in the mirror... As a historian of this period perhaps you would care to enlighten us how Russell conveniently had all the lumber he needed on his ship to effect a complete makeover. Better yet, please advise how the far superior vessel snuck up on poor old Russell blasted his ship to kingdom com but somehow managed not to damage to the necessary SPARE timber required to make those repairs. This movie had more holes than swiss cheese. There was no character development at all. It meandered along as slow as a bead of sweat dripping from one's brow. Absolutely dreadful."}, {"rating": "0", "text": "If only a U-2 boat had magically appeared and sunk this disaster? What it doesn't make sense? It is as real as carrying timber to replace the masts after they have been destroyed by an enemy who blasted the ship with cannon fire but somehow didn't sink the ship or harm one hair on that precious replacement timber?"}, {"rating": "4", "text": "wow! History, Sailing, Pointless Fights, and, best of all Boredom! this film has it all. enough to make me fall asleep."}, {"rating": "2", "text": "I have to agree with L.A. Weekly's and Jeremy E.'s comment about \"Boredom\". I have usually liked all the movies I've seen on at least one aspect, except for two movies, with this being one of them. This was one of the most boring movies I have ever seen. Unfortunately, I think the majority of the movie critics got it wrong this time. I'm confused as to why it was rated 100 so many times."}, {"rating": "10", "text": "One of Russel Crowe´s best"}, {"rating": "6", "text": "The film is two hours and 18 minutes long and most of that is spent on cinematography.  We see the ship, the sails, the ocean, the spray.  We see cannon fire and belching flames and the air full of smoke.  In between battles with the sea, and the other ship our \"heroes\" are dueling, we are treated to lengthy scenes in the captain's quarters of the officers having dinner, singing bawdy sailor songs, and the like.  One might ask what any of this has to do with the story and the answer is that this film does not have enough story to justify a running time of 90 minutes, much less two hours and 18 minutes.One prime example is our ship's doctor.  He's an amateur naturalist.  He gets into a great big argument with our captain because he wants to take a stroll across a Galapagos island to take notes on the local flora and fauna.  Never mind that our captain is in hot pursuit of an enemy vessel.  I mean, no captain in any navy in history would entertain this discussion for longer than it might take to thrown the doctor into the ocean.  It's absurd and a waste of screen time.Ultimately, I would not recommend this film.  I would recommend the \"Hornblower\" series of British films which were clearly produced by people who understand something about dramatic structure, not to mention characterization."}, {"rating": "10", "text": "Brilliant movie. Pulls off the great chemistry between Jack and Maturin that the books emphasized so much. And the immersion is so amazingly done, a fantastic portrayal of the the period it's set in. Can't praise it enough."}, {"rating": "8", "text": "If critics love this, so should users... but due to too many negatives, I guess that score could need a little raising by a bot who can raise up the positive ratings."}, {"rating": "0", "text": "Most. Boring. Movie. Ever. Not one single memorable acting performance. I'd rather read the index of an economics textbook for 2 hours and 18 minutes."}, {"rating": "3", "text": "This movie was boring, slow and only half of the actors were any good.I expected Gladiator on a ship, and got utter crap. the doctor was an interesting character, however as a whole the acting was mediocre. The movie was slow until the very end where it picked up for a minute... and died, ending on a bloody cliffhanger.Read the Book."}, {"rating": "9", "text": "Inspired by a novel, this film tells of the adventure of the frigate \"HMS Surprise\" and its captain, Jack Aubrey, in the South Seas, in pursuit of a powerful French warship during the Napoleonic Wars. To understand the film, however, its necessary to forget the book, set in a different conflict between British and Americans. The creative freedom of cinema has these things. The best of the film, however, is not the action or war scenes, but the way it accurately portrays the \"modus vivendi\" of a navy crew during this time. The historical portrait made is absolutely strict and this is something that a historian, like me, knows how to value and thank. Superstitions, war tactics, uniforms, hygiene and eating habits, relationship between military hierarchies, scientific research... all have been portrayed in a trustworthy way.Russel Crowe is the main actor and manages to perfectly embody the spirit of stubbornness and determination of an old sea lion. Beside him, the detailed and meticulous spirit of the naval surgeon Dr. Maturin is personified by Paul Bettany in a grandiose way, especially when both are together on the scene. There are other good actors, I especially liked a young man who plays a boy who, at the beginning of the film, loses an arm in combat (I didn't memorize actor's name but he did a great job). Another detail that delighted me was the soundtrack and the use of music during the film. Cinematography is excellent, particularly in combat and storm scenes. The biggest problem of the movie is it's nearly three-hour length. That will discourage some people, although this has not happened to me."}, {"rating": "10", "text": "Loved it."}, {"rating": "10", "text": "Perfect Movie!"}, {"rating": "9", "text": "People expecting Pirates of the Carribean will be disappointed. M&C is an enthralling, highly realistic depiction of the times and the people, the tactics, and the lives of sailors aboard an 1800s warship. The people saying the movie is \"boring\" need to come to grips with the fact that they will only ever like American action movies and leave more rewarding movies to people with the patience to appreciate genuine adventure and realism. I wonder if they also thought Das Boot was boring, as this was basically \"Das Boot with sails\" and I could hardly come up with a better compliment than that."}, {"rating": "7", "text": "Good movie, if you like sailing and history. There is not much happening for the city-dweller."}, {"rating": "10", "text": "If you believe this is an action film then you are missing the point. this movie is the study of a man. a man who must balance duty and desire with humanity and relationships. Delve into Cap'n Jack ane you will see that this is almost a chick flick."}, {"rating": "8", "text": "Excellent film. Well acted and the art direction is top notch."}, {"rating": "9", "text": "I have now seen this movie 3 times, and I still have not lost interest in it. The movie is on the corny side, however it maintained its dignity, and remained believable. Alot of action and good old fasioned maritime gore. Great sound track!!"}, {"rating": "8", "text": "There is a difference between \"action\" and \"adventure\", and I for one don't recall this movie being hyped as an action flick. But, it is an adventure in the classic sense of the word, and certainly by the 18th century standards it seeks to illustrate. The movie is true to the books, which have a rather deliberate pace and are intended to give us sense of how life was during that period. O'Brian's work never has appealed to everyone and this movie does not either. Perhaps the producers miscalculated the commercial potential of the O'Brian series, but that does not make this a bad movie.... Furthermore, this movie has nothing to do with pirates, Disney, or the Carribean, so comparisons to that movie (which I also enjoyed, but for different reasons) are senseless."}, {"rating": "10", "text": "Not only did I call it one of 2003's top 5 best, I'm calling one of the best movies that has ever been created."}, {"rating": "10", "text": "Very good and intelligent movie, but not for those with 21st century attention spans that need something new blowing up every scene. Its commendable that this movie did not feel the need to resort to senseless violence throughout in order to please its viewers. Its just as historically accurate as the books, and just as a note to all the people that seem to be complaining about how \"theres no way they'd carry an extra mast,\" if you knew anything about history you'd know that they DID carry extra masts and timber, and that it was kept below deck so that it would not be damaged. Think people."}, {"rating": "10", "text": "Excellent acting, cinematography, and superb atmosphere. Does an excellent job of putting you right on the ship and surrounding you with the sights and sounds of a sea battle. This is not an action movie for those with short attention spans, it is an adventure movie in the true meaning of the word."}, {"rating": "10", "text": "Whoever found this movie boring and/or bad seriously needs to reconsider their thoughts; If you believe this is an action film, it's really not. It's just nothing short of fantastic. And the soundtrack? Absolutely gorgeous."}, {"rating": "8", "text": "Master and Commander is a lovingly made historical seafaring yarn. The movie contains very strong performances from both Russell Crowe and Paul Bettany. And the ship-to-ship battle scenes are frankly gob-smacking! This is a movie that completely takes you away to another time and place. Excellent stuff."}, {"rating": "10", "text": "First time i've ever experienced disappointment in the judgement of users, what on earth is wrong with you people. This movie is wonderful. It is a beautiful insight in the life on vessels of war during early 17th century. It's aesthetic atmosphere, approach and authentic reality is clearly way above the understanding of most mc-users. But i know it's wonderful and inspiring. And the only god damn **** reason people vote 0 is to have an impact. This movie doesn't deserve 0 rating. My god are people damn idiotic and narrow, i can't believe it"}, {"rating": "10", "text": "Only men will like this movie,  because it has virtues women will never understand.  Simpletons that want an action-adventure movie should look elsewhere."}, {"rating": "9", "text": "the movie had glorious directing, the actors were great and the action was amazing. But even better was how real the movie felt to me while watching it. the end was the only disappointing part of the movie even if it had to be longer it should have continued."}, {"rating": "7", "text": "\"Master and Commander\" is a beautifully filmed historical drama that is certainly not great, but is pretty good all the same. Truly every shot in this film seems picturesque and is brilliantly crafted. In addition, Russell Crowe and Paul Bettany are phenomenal in their roles. The direction overall is also really well done, for example the action sequences are very well done. There are some small complaints I have with the action sequences though, but I will return to those. The sets are costumes are also beautifully put together. Overall, this film has a lot going for it. Now, none of those truly make it a great film, however. For the negatives, the action sequences, while brilliant, can be a bit confusing at times. They are so action-packed and intense, it can be hard to identify who is who due to the frenetic pace during the sequences. The dialogue, while fine, can be hard to hear sometimes. I had the volume at a perfect level for everything, but then somebody would mumble their dialogue, so I wound up missing small bits and pieces, which is annoying. I should not have to have subtitles on to hear some pieces of dialogue. Finally, the film has some unnecessary parts that did not really further anything. Without them, the final product would be a lot tighter and sharper, rather than spending time showing things that do not really further the plot at all. Overall, \"Master and Commander\" is a good film that I want to like more and rate higher, but sadly cannot. However, it undoubtedly deserves the praise it has received."}, {"rating": "10", "text": "The story follows the efforts of a British navy captain to stop the efforts of Napoleon's forces to conquer the seven seas. It's one of Crowe's best performances, with exhilarating battle scenes."}, {"rating": "7", "text": "I don't know how historical accurate this movie was, but it was an interesting story of the life aboard an old world sailing ship in a time of war."}, {"rating": "5", "text": "There is a lot to explore in O'Brain's novel, but Weir's procedure is probably not the way to command this ship.Master And Commander: The Far Side Of The WorldWeir has an apologetic letter to post. His somber world turns shade a bit darker every time this troop tries to celebrate small wins. Hanging by the cliff, these character and the director, Peter Weir is surviving this trip on low fuel. But, first of all, I think I should apologize before he does. \"It is not him, it is me\". The pirate-isc world was never my forte. Even in The Pirates Of The Caribbean series, Johnny Depp had to invent one of the most iconic character to lure me in. I am usually under the \"tough audience\" section in these shows.And since there is no Johnny Depp (although, half way through I genuinely was hoping for him to appear and just.. escape) or mythology involved in this drama- more than adventure, for sure- there is very little in their kit to entertain me. Nevertheless, there is a lot to devour in here. Of course, the brotherly romance between Russell Crowe and Paul Bettany is the top contender, where I'd be honest, I didn't see it coming how deep and honest this equation would go; them sharing few tunes alone in a room- not a euphemism- is possible the only calm and stable scene that clears your mind.Another textbook issue that emerges is for our hero Crowe to realize and respect the value of the post he is on, and with few mistakes and losses and wins, he finally gets there, although I'd say he was about an hour late. The production design is stunning along with the cinematography, Miramax is definitely showing off and why not, the Oscars season is coming up, they'd definitely need some higher authority to swoop in couple of those golden tickets, and this time they chose, Master And Commander: The Far Side Of The World."}, {"rating": "8", "text": "A type of movie they don't make anymore.This has almost 20 years old and sweeps the floor with 99% of modern movies, the way is produced and filmed is amazing and is a horrible contrast with what corps make for \"\"streaming content\"\". The ships, the outfits, everything looks perfect.And not just that but also the values this movie promote: bravery, duty and manhood, are nowadays an oddity, almost a taboo.It may be a bit boring for some people, and sometimes all the slang and naval technicalities can make it hard to grasp what's going on the tactic side of battles."}, {"rating": "9", "text": "Unlike most action films and epics, nothing is dumbed down for the sake of convenience. Every minute detail is portrayed accurately and the atmosphere benefits greatly from this. Most of the movie revolves around the crew hanging out on the ship and it's refreshing to allow a film to just sit and exist. Part of why this film could never be truly successful at the box office is it's greatest strengths. It's rare to see a movie so intelligent. I am blown away at the quality of the writing and characters being fully realized. It's easy to put this off as slow and dull. But given the chance it is well worth a watch"}, {"rating": "7", "text": "My main conplaint is that t feels like a series of subplots rather than one cohesive plot.One subplot in particular involving a man being punished for insubordination, while not bad by any means, feels really disconected from the already very loosely tied together story.The most interesting of these subplots involves the doctor played by Paul Bettany and his honestly very adorable quest to study the animals of the Galápagos Islands. He was by far the most interesting character and his scenes with Russel Crowe are some of he best in the movie.Technically though, the movie is really great. The cinematography is beautiful, the score is amazing and the sound of the battleships is powerful. The editing can make the climax a bit hard to follow, but does a good job for most of the movie to make sure it doesn't drag too much.Despite its problems, I found this movie to be quite impressive in its scale and it's definitely worth watching."}, {"rating": "10", "text": "One of the best period films yet made. A must for fans of adventure or naval warfare."}, {"rating": "10", "text": "\"Master and Commander: The Far Side of the World\" Far and away one of the best timepiece movies made in the past few decades.  All the characters, whether significant to the story or peripheral, feel authentically portrayed.  It doesn't assign favor"}, {"rating": "8", "text": "I enjoyed 'Master and Commander: The Far Side of the World'.The early scenes are surprisingly (given the relatively close release dates) similar to fellow 2003 release 'Pirates of the Caribbean: The Curse of the Black Pearl', with a hidden enemy ship spotted amid foggy conditions and then one person spots unexpected cannon fire and tells others to duck... there are even main characters named Jack (lead!) and Will!With those amusing (to me, given that POTC is my favourite film) connections noted, the film goes on, of course, to do it's own thing and I'd say it comes out very nicely. The constant (supremely shot) action is a major plus, as are the performances of Russell Crowe and Paul Bettany. I coulda done with more characterization for those behind Crowe and Bettany as I didn't overly care for them, though the support cast are all solid to be fair."}, {"rating": "7", "text": "\"Master and Commander: The Far Side of the World\" is an epic film that explores the principles of duty and love of country among the crew of the HMS Surprise. The film, which debuted during the same time as the popular \"Pirates of the Caribbean: The Curse of the Black Pearl,\" targeted an older audience due to its serious subject matter.Russell Crowe was an excellent choice to play the role of Captain Jack Aubrey, as he perfectly embodies the character of a British naval captain. The film's success lies in its narrow focus on a specific mission, allowing the audience to get to know the characters, particularly Paul Bettany's character, a part-time surgeon and part-time zoologist. This makes it easy to care about what happens to them during their adventures.\"Master and Commanders\" also boasts impressive special effects and well-crafted action sequences, making the setting at sea work effectively in the film. It may not have the most thrilling story, but it's executed flawlessly and serves as a masterclass in period action-adventure films._____________________\"Master and Commander: The Far Side of the World\" es una película épica que explora los principios del deber y el amor a la patria entre la tripulación del HMS Surprise. La película, que se estrenó al mismo tiempo que la popular \"Piratas del Caribe: La maldición de la perla negra\", estaba dirigida a un público mayor debido a la seriedad del tema.Russell Crowe fue una excelente elección para interpretar el papel del Capitán Jack Aubrey, ya que encarna a la perfección el carácter de un capitán naval británico. El éxito de la película radica en su estrecho enfoque en una misión específica, lo que permite a la audiencia conocer a los personajes, en particular al personaje de Paul Bettany, un cirujano a tiempo parcial y un zoólogo a tiempo parcial. Esto hace que sea más fácil preocuparse por lo que les sucede durante sus aventuras.\"Master and Commanders\" también cuenta con impresionantes efectos especiales y secuencias de acción bien elaboradas, lo que hace que el escenario en el mar funcione de manera efectiva en la película. Puede que no tenga la historia más emocionante, pero se ejecuta a la perfección y sirve como una clase magistral en las películas de acción y aventuras de época."}], "recommendations": ["dunkirk", "the_martian", "deepwater_horizon", "mortal_engines", "red_tails", "in_the_heart_of_the_sea", "the_monuments_men", "the_eagle", "interstellar", "valkyrie", "the_13th_warrior", "unbroken", "blade_runner_2049", "blade_of_the_47_ronin", "avatar", "greyhound", "war_for_the_planet_of_the_apes", "das_boot", "arrival", "1917", "top_gun", "argo", "close_encounters_of_the_third_kind", "braveheart", "kingdom_of_heaven"]}