{
  "id": 4813,
  "title": "Match Point",
  "starring": [
    "Jonathan Rhys Meyers",
    "Scarlett Johansson"
  ],
  "runtime": 124,
  "genre": [
    "Drama",
    "Thriller",
    "Crime",
    "Romance"
  ],
  "description": "Chris, a former tennis player, looks for work as an instructor. He meets Tom Hewett, a wealthy young man whose sister Chloe fall in love with Chris. But Chris has his eye on Tom's fiancee Nola.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vHjEVTD8ucuwKSFOZJeyAnTZYli.jpg",
  "categories": {
    "plot": 4.466666666666667,
    "acting": 3.4705882352941178,
    "ending": 5.636363636363637,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is one of my favorite movie ever. It's a very smart plot (normal for Woody), about a ambicious and smart tennis player, who uses his interest in high culture to penetrate the upper class. Chris is completely amoral. He just coldly calculates the probability of success. Woody plays well with the theme of luck (which is common in his movies), including two interesting scenes, one at the begginning, with a tennis ball touching the net  and luck defining in which side of the court it is going to fall, and another one at the end that makes you anticipate, wrongly, the end of the movie. Scarlett is gorgeous. Myers delivered a good performance. The movie oscilates a lot in its plot, as luck is seemingly defining the path the characters take, and the end tends to be not what you expected (unless you know Allen well). It is philosophical, entertaining, full of suspense and sexy. A masterpiece in my opinion. Dostoevsky would be proud, despite the alternative, nietzschean ending."
    },
    {
      "rating": "5",
      "text": "Dark and atmospheric, \"Match Point\" is also, especially with those operatic insertions, just too pretentious for its own good. I found hard to believe what the Jonathan Rhys-Meyers character does to get out of his predicament. A different Allen movie doesn't necessarily translate into a very good one.."
    },
    {
      "rating": "5",
      "text": "The movie was full of great ideas only half-baked. I thought I would love it shortly into it, but I barely made it to the end. Woody Allen needs someone on his team to take care of the details. I was aggravated by the waste of the potential this movie had."
    },
    {
      "rating": "5",
      "text": "Woody Allen's huge return to form (not). Well crafted but predictable, almost totally lacking in the sharp humour that distinguishes the best Allen scripts. Johannson looks uncomfortable throughout with her daggy and dreary role, and the final Sophoclean cameo doesn't mend things. Time to prefer younger directors, evidently Allen is no Bunuel or Huston who is going to hold his nerve and pull off that very late masterpiece."
    },
    {
      "rating": "10",
      "text": "A great contemporary cinema adaption for \"Crime and Punishment\" in which crime is justifiable for social ascension and not for the harm an old usurer does to society."
    },
    {
      "rating": "10",
      "text": "Woody allen is definitely back. Great film and acting. absorbing.all characters played their roles well!!a real woody allen ending./ we are not always dealt the best of cards!!!"
    },
    {
      "rating": "10",
      "text": "It's like night and day from some of his recent films. It's entertaining, brilliant, interesting, and perfectly cast. The reviewers are way underrating this film. Woody-prejudice abounds. But this film is not a Woody Allen film--it's just a really good film....great storytelling, classic and modern with a palpable tension. It's a model film."
    },
    {
      "rating": "10",
      "text": "The best one I've seen for months."
    },
    {
      "rating": "0",
      "text": "I just can't believe how awful this film is and yet it reviewed so well by many. I think this is a case of people focusing on Allens excellent back catalogue of former glories and not treating this as a standalone film. The script is so bad, that it made me hate it despite the normally likeable leads."
    },
    {
      "rating": "3",
      "text": "Appalling. The acting is fine, the filmmaking is skilled, yes; but this movie is essentially just \"Crimes and Misdemeanors\" all over again. There was no need to make this movie; Mr. Konigsberg already said what he had to say in that earlier film. And all he has to say is that he is perfectly justified in having lived his selfish, amoral life. It's more of the same garbage the John Cusack author-stand-in-character spewed in \"Bullets Over Broadway\": artists are special, artists don't have to behave morally, artists can do whatever they want, including screwing and marrying the daughters of their wives and the sisters of their children. Please. Spare me."
    },
    {
      "rating": "1",
      "text": "Am I the only person who hated this film?!?! It feels like Woody Allen had 2 bottles of Shiraz and decided to write a little film! As my friend said \"this is Woody Allen's burp\" The acting is laughable, the script is awful and since when does it not rain in London?!?! just because there were 3 mini coopers in one scene doesnt mean its London! Awful awful awful!"
    },
    {
      "rating": "9",
      "text": "In tennis, if the ball drops forward - you win, if it drops backwards - you don't. In Woody Allen's new film, it drops forward - Game, Set, Match. I, for one, have never thought Mr. Allens career was ever in a slump. Any film written and directed by Woody Allen has been worthy of my 10 dollar admission, but in Matchpoint, he's left the comedy in Manhattan and moved his setting to London and once again made a movie that I'll drop another 10 bucks on to see it again! The critics are all saying Woody is back, well he's not back, He has just moved up another rung on his cinematic ladder. Imagine, a New Yorker making movies in London, I seem to remember that it worked for Kubrick too, but we don't have to wait 7 years for the next Woody Allen film!! Yes Virginia, there is a Woody Allen."
    },
    {
      "rating": "4",
      "text": "Do not spend a single minute considering MATCH POINT. It's Woody Allen (by Woody Allen) for Dummies. One A-Plot and no anything else-plots as not to confuse anyone (possibly and especially him and his obviously depleted sensibility). There are direct lifts of dialogue from C & M, no foolin' (\"You mean if I won't leave my wife, you'll go to her and tell her...\" crap like that). It crosses that delicate line from tension to tedium at nearly every opportunity. With a THEME (capitals, mine) (Luck Over Greatness) that's boring, obscure and meaningless to anyone who ever grew intellectually under his tutelege. Woody is so squeamish about depicting sex (pants on, blankets up to the neckline) and so it cripples him from accurately and genuinely portraying the mania that accompanies it. The lovers end up looking like they've had too many Starbucks mocha grandes or some such."
    },
    {
      "rating": "2",
      "text": "Absolute drudgery!"
    },
    {
      "rating": "10",
      "text": "An excellent return to the crime & punishment theme Allen first visited in Crimes and Misdemeaners. Here the plot is simplified and laid bare, though with a sinister atmosphere that lurks even in the \"happy\" corners of the film. The acting is top notch and the denoument works perfectly."
    },
    {
      "rating": "10",
      "text": "A Must see. All the people that are giving low ratings don't have the brain power, nor the culture to Understand Woody Allen's Genius. I'm still thinking about this movie...truly a great work."
    },
    {
      "rating": "0",
      "text": "Following two painfully slow and pointless hours viewing his latest, I'm still nowhere on the road to appreciation of Allen films -- one-dimensional women and men who are jerks and get away with in -- all in a faux upper class setting -- not so clever, insightful, or fabulous in my opinion."
    },
    {
      "rating": "10",
      "text": "Provocative and entertaining. Although I don't necessarily agree with director/writer Woody Allen's point of view on matters of fate and morality, I appreciate his ability to ask thought-provoking questions on the nature of life."
    },
    {
      "rating": "9",
      "text": "Much better than average adult movie. Not many out there any more!"
    },
    {
      "rating": "2",
      "text": "Hugely disappointing. Movie is shallow, characters are flat. I was expecting to see plot and characters that would move me in similar way as Closer, but I was totally turned off. Woody Allen fails to unleash the potential of the characters, which act mechanically. Scarlett Johansson's monotonous role hugely fails to leverage her talent. Jonathan Rhys-Meyers' role gave him potential to shine but he fails to deliver the goods. Only Emily Mortimer as Chloe seems to perform consistently and with some sentimental background. Shame."
    },
    {
      "rating": "9",
      "text": "Any half-way literate person will love this movie. The entire second half or so is a wonderfully done modernization of Dostoevsky's \"Crime and Punishment,\" with some interesting twists and turns. Actually of the people I know who disliked this film, none of them had read \"Crime and Punishment\"--so maybe being intelligent makes this film more enjoyable."
    },
    {
      "rating": "9",
      "text": "Luck has everything to do with it as does sexual passion."
    },
    {
      "rating": "8",
      "text": "Although I disagree with Dr. Suess (the poster) that having read \"Crime and Punishment\" makes you intelligent, I did find it quite a nice surprise to see how the classic found its way into the movie. It was very satisfying. I do find it curious that hardly any of the other critics (the official ones) noted it, but overall it was a great movie, however a little broken in two, which wasn't all that bad."
    },
    {
      "rating": "8",
      "text": "Brilliantly captures British upper class. Well written, provocative storyline, well acted. Defintely very very good with moments where the insights make it great."
    },
    {
      "rating": "0",
      "text": "I realize that I am going against the grain here, but I really, really, hated this movie. If I hadn't had to write a review for the school paper, I would have walked out, which I had never done. If you want to see how bad Closer would be without Clive Owen, then Match Point is the movie for you. It is completely irredeemable."
    },
    {
      "rating": "0",
      "text": "most uncomfortable movie i have ever seen - felt like it lasted 5 hours instead of two."
    },
    {
      "rating": "8",
      "text": "Nudity would've been right for this movie. Ludivine Sagnier, if she could learn an American accent, would've been the right girl. During the filming of \"The Island\", it was reported that Scarlett Johansson volunteered to go topless, but Michael Bay needed to pull in a PG-13 rating. The love scenes between Chris(Jonathan Rhys Meyer) and Nola end just before things get interesting. We need to see what Chris sees, but the hiding of Johansson's birthday suit puts lust and greed on unequal footing, so the decision made between these two powerful emotions seems like the plausible one to make if you're a sociopath. \"Match Point\" is a good film, but it's no better or worse than \"Melinda and Melinda\" and \"Sweet and Lowdown\"."
    },
    {
      "rating": "5",
      "text": "Like with most recent Woody Allen movies, proven actors are maddeningly wasted in two-dimensional supporting roles bringing the kind of character depth you'd find in a Banana Republic Holiday Story. The excellent above the line actors (including Brian Cox, Emily Mortimer, Matthew Goode and Penelope Wilton) are immaculately dressed and filmed with absolutely nothing original to do or say. In Allen's world, the obscenely wealthy Hewett clan just sip G&Ts, play polo and go to the opera - evoking unintentional laughs in this Serious Woody Allen Film. Maybe it's the director's commentary to paint the British upper class so broadly, but the problem with gutting the family of character is the viewer is forced to wade through strings of unbelievably hollow and inconsequential scenes and chatter to reach the mildly interesting parts. Allen effectively zeroes in on the film"
    },
    {
      "rating": "0",
      "text": "Without doubt the worst film I've ever paid to see. It's odd how critical acclaim seems to be divided across the Atlantic. Generally, the American papers loved it, the British papers loathed it. As a Londoner who's been happily settled in San Francisco for many years, I'm ASTONISHED by the fact that this film has garnered any favourable reviews at all. It is a risible movie. The script is absurd, the location/accents inauthentic, the plot ridiculous, the acting appalling - Jonathan whats-his-name is just unbearable....and while Scarlett looks lovely, she has nothing to play with here... I estimate that a third of the audience walked out when I saw this last Saturday. I did stay to the end - happily heckling, laughing and sympathising with the remaining audience. Utter sh.t. Go see it - you'll be as astonished as i was."
    },
    {
      "rating": "0",
      "text": "I don't usually give movies \"10s\" or \"0s\" - but if it's deserved, it's deserved. I'm not even sure where to start with this movie: the writing was *ghastly*, cliched, pompous, heavy-handed. I ended up loathing every character - not that I have to like characters to like a movie, but there has to be *something* that makes the whole thing worth your time. The characters were too shallow to permit any kind of understanding of the \"human condition.\" I lived in England for a little while and *cringed* at all the blatant and ridiculous stereotypes. And to top it all off, it was *boring*! I was looking at my watch only a half-an-hour in. By the time the third or fourth false ending rolled along, I was literally groaning in my seat. The ghosts/guilty apparitions in the kitchen?? The ridiculous dialog between the police detectives?? The convenient fact that a heroin addict found the ring?? And *yes* I get that it's a movie about luck (had that theme pretty much crammed in my ear within the first few minutes), but that's just **bad** writing. UGH. The acting was all right, given what the poor actors had to work with. The sex was cliched, uninteresting. There wasn't a single new or interesting or provocative image or message in this whole overly-long movie. Really and truly bad. I can't believe the critics like it. Full of literary/musical/cultural allusions, yes, aren't we all smart? But relentlessly superficial and banal, and, no, I don't think *that's* the point. The movie took itself far too seriously for that to have been the point. That's it. I'm officially done with Woody Allen."
    },
    {
      "rating": "10",
      "text": "A truly Awesome film......Great acting....The writing is superb. This is a must see film. If you hate Woody Allen; You'll love him now.."
    },
    {
      "rating": "10",
      "text": "Woody Allen's most brilliant work in many a year. Unlike the ridiculous King Kong, this film had actors with real dialogue and a director with outstanding skills. Although it starts slowly, it builds until it actually grasps its audience in conflict. You find yourself unsure how to resolve the conflict until a desparate act is committed. From this point, you finally realize that in life, it doesn't matter how good you truly are? All it takes is a luck and being in the right place at the right time; or sometimes, unfortunately in the wrong place at the wrong time. Woody Allen dispells the notion that good things happen to good people and bad things happen to bad people. Luck can be both good and bad. Absolutely thought provoking? Worth the watch if you stay with it."
    },
    {
      "rating": "10",
      "text": "A marvelous, stunning flim. The 3 of us who went the other night still can't stop thinking about it. The casting is perfect, the story sublime. If you appreciate more to film than the latest Vin Diesel vehicle, go see this. It's great."
    },
    {
      "rating": "8",
      "text": "I was kind of muddling through this one throughout the first two thirds of the film, and was pretty unimpressed. It was kind of slow, kind of boring at times, and I agreed with some of the naysayers that the film was lacking any oomph. However, the end of the movie changed all of that for me. This film will hardly hold up with Allen's greatest works, but this was an extremely solid effort, and he took what could have been a completely vanilla movie and turned it into something my wife and I were talking about the rest of the night. No, it's not as good as \"Crimes and Misdemeanors\" by any stretch of the imagination. But it is a good film by its own right, and is a very different film thematically. Here, Woody questions the ideas of luck, class, character, and opportunity very successfully. For those that say the dialogue is boring, I say you weren't paying attention enough to the story. There are several hints dropped along the way, and judgments are made about every character. The miracle here is that Scarlett Johansson's Nola, who at first glance seems like an airheaded nymph, turns out to be the moral center of the film. This film is a thinker; don't let the slow pace fool you. You won't get it if you're not paying full attention."
    },
    {
      "rating": "0",
      "text": "Woody Allen has always been a bore. And still is a bore!"
    },
    {
      "rating": "10",
      "text": "Fantastic from start to finish. Excellent film perhaps the best of 2005."
    },
    {
      "rating": "1",
      "text": "I have just returned from the cinema and have to warn you all out there to wait until this movie appears on your television sets on a Sunday afternoon, just so you have the option to turn the channel over. It was so boring that it could have easily been a 2 part drama on television, and a pretty average one at that. I totally agree with the comments made by Heather W so I'm not going to be repetative and just point you in the direction of her post. (Apart from the not liking Woody Allen anymore, But word of advice, Stick to comedy Woody)."
    },
    {
      "rating": "7",
      "text": "Although the pace is often maddeningly slow, the plot is intriguing enough though not entirely original. Allen's still got it, and he proves that by staying away from his trademark wit and humor, instead providing a tense and troubling film."
    },
    {
      "rating": "10",
      "text": "Chilling, intensely fascinating nail-biter. You'll want to watch it again just to pick up on all the nuances. One of those layered classics you can discuss for hours afterward."
    },
    {
      "rating": "0",
      "text": "I am shocked at the grotesque judgement of professional critics who have given good reviews. It is almost as bad as the worst film of all time, 'Breaking the Waters.' Forget that it is contrived in the cheapest way, Dostoevski's Crime and Punishment, the crooning of Caruso, the lame tennis metaphors, the acting is horrible, and their is nothing to redeem the wast of time. Films like this makeme want to demand my money back. They are a fraud. Reviewers who compared it to Robert Altman's, The Player, are out of their mind. Let's note some differences. The lead character was sympathetic, his dead protagonist unsympathetic, his death propelled by accidental rage and passion. Here we have an unsympathetic character who coldly plots the murder of his pregant girlfriend and carries it out. Why was this set in England? It is An American Tragedy merged with A Place in the Sun, inspired by Crime and Punishment, with a single twist that let's Liz Taylor and Montgomery Clift drive off into the sunset together. In the opening of this dirty little film, my wife's first reaction was that the lead character reminded her of Montgomery Clift. And we knew nothing in advance about the story. I felt unclean after watching it. Simply awful."
    },
    {
      "rating": "3",
      "text": "This film was appalling. The characters' motives were unclear, there was very little chemistry, and Scarlette Johansson's acting was atrocious. It left me with a sick feeling in my stomach."
    },
    {
      "rating": "2",
      "text": "Great wrapping, shame about the plot. If you consider yourself an above average intelligent person with an appreciation , then stay away from this one, because you will be disappointed. And if you're not, then you're not, and your reaction to this movie is proof. It wasn't even funny! Sic transit gloria Woody. And pity the actors and crew; this is a waste of talent."
    },
    {
      "rating": "2",
      "text": "So predictable, and that's because it was so unoriginal. You can't blame the actors for acting poorly in this film(for signing on maybe) when the dialogue is this pretentious with zero subtlety. Every scene is either a waste of time gap filler or based on ideas we've seen a hundred times. I never was a huge fan of Allen but this movie is a joke. Best Picture nominee, dear god."
    },
    {
      "rating": "2",
      "text": "Hugely overrated film. Was so disappointed with it in so many ways. No character was believable or well-developed, the dialogue was rubbish, the plot seemed to have been hatched by a 6 year old and Scarlett Johanssen was completely wasted. She is too good for this banal crap."
    },
    {
      "rating": "10",
      "text": "Best film of the year, Woody's back!"
    },
    {
      "rating": "7",
      "text": "Woody Allen abandons his usual neurotic New Yorker genre to tell the story of a man who ascends to the top of the London upper-crust, and is faced with losing it all due to his infidelity. The tale is told slowly, but the acting, writing and screenplay are all first-rate, so it doesnt drag. The suspense which at first is lacking kicks in toward the end and the film really holds your attention. No great fireworks, and not superlative, but a well-crafted film worth seeing."
    },
    {
      "rating": "9",
      "text": "One of Allen's best, period, not to mention of the top films of the year. Great acting from overall smaller time actors, great dialogue and exciting, best of all it's a movie you'll think about a long time after you see it."
    },
    {
      "rating": "1",
      "text": "What a bore and a drag. too long too predictable dont waste u r money. Better off being packaged as a Channel 5 movie (UK) or a BBC multi part drama."
    },
    {
      "rating": "10",
      "text": "Plain old stupid luck explains away all of the plot holes. That is what makes this all so enticing. Why was any of the characters a super genius? Of course not. Just that the family had everything go its way. As for the unlucky American Sexy Beauty, nothing ever went right for her. Wrong place at the wrong time. And that is what life is about. Now do you get it?"
    },
    {
      "rating": "10",
      "text": "One of the best films of the year. Not for those with IQ of a body temperature, though."
    }
  ]
}