{
  "id": 4565,
  "title": "Maverick",
  "starring": [
    "Mel Gibson",
    "Jodie Foster"
  ],
  "runtime": 127,
  "genre": [
    "Action",
    "Adventure",
    "Comedy",
    "Drama",
    "Western"
  ],
  "description": "Maverick is a gambler who would rather con someone than fight them, and needs an additional three thousand dollars in order to enter a winner-takes-all poker game that begins in a few days, so he joins forces with a woman gambler with a marvellous southern accent, and the two try and enter the game.",
  "releaseYear": "1994",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cf4L3VW5nEHIaU3pOMZSIoBQmDP.jpg",
  "categories": {
    "plot": 6.2,
    "acting": 6.333333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.333333333333333,
    "funny": 6.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "This film is especially suitable for all those who don't like Westerns because think they're never more than train robberies and duels at sunset. Set in the Wild West, this comedy shows the adventurous way that Bret Maverick enters the most lucrative poker tournament in the region. It's a funny story that harmoniously combines action and adventure and where Mel Gibson plays the leading role. Despite his consecration, this actor is no stranger to light comedies (think of \"What Women Want\"), even though these aren't the kind of jobs he likes to bet. He has Jodie Foster and James Garner as supporting actors and Alfred Molina as a villain, but he manages to stand out from them and carry the film on his back in a very enjoyable way. The fact is they never seemed committed, giving Gibson a lot of space to shine even when everyone was on scene. The result, however, is frankly pleasant.This film is not a work of art nor was it thought to be. It's made for entertain the public and does so easily, with jokes, funny dialogues and action scenes where comedy comes from situations in which protagonist is involved, usually against his will. As usual in comedies, the characters are light and even somewhat stereotyped. The Indians also appear in the film, which makes fun of preconceived ideas about them. Sets and costumes are also good, and wear what we normally associate with Far West. Not worth looking for an exceptional script, great characters or a dramatic show. This movie is to watch without thinking. So sit back and enjoy."
    },
    {
      "rating": "7",
      "text": "I remember watching this film around the time it first came out & I really, really enjoyed it... powered by 3 very capable actors & a wonderful supportive cast."
    },
    {
      "rating": "7",
      "text": "Light-hearted, colourful and all in all a fun movie, Maverick offers a script full of entertaining twists and turns filled with memorable characters trying to outplay each other."
    }
  ],
  "recommendations": [
    "the_nice_guys",
    "some_like_it_hot",
    "johnny_english_strikes_again",
    "snatch",
    "in_bruges",
    "men_in_black",
    "kingsman_the_secret_service",
    "hot_shots",
    "fargo",
    "keeping_up_with_the_joneses",
    "spenser_confidential",
    "charade",
    "role_models",
    "american_ultra",
    "logan_lucky",
    "the_royal_tenenbaums",
    "central_intelligence",
    "lawless",
    "blockers",
    "spy",
    "the_gentlemen",
    "trading_places",
    "mortdecai",
    "life_after_beth",
    "the_fifth_element"
  ]
}