{"id": 1824, "title": "Max Steel", "starring": ["Ben Winchell", "Josh Brener"], "runtime": 92, "genre": ["Action", "Adventure", "Science Fiction"], "description": "The adventures of teenager Max McGrath and alien companion Steel, who must harness and combine their tremendous new powers to evolve into the turbo-charged superhero Max Steel.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/AuEzNLF8yvzd169guYEFisqvy5z.jpg", "categories": {"plot": 2.9545454545454546, "acting": 2.6666666666666665, "ending": 4.333333333333333, "soundtrack": 5.0, "cinematography": 0.3333333333333333, "familyFriendly": 3.8333333333333335, "funny": 3.0, "action": 3.7777777777777777}, "reviews": [{"rating": "1", "text": "Max Steel is hard to define.  It's just there on screen.  What happens in this supposed film is just a giant sloppy mess.  Andy Garcia and Maria Bello must have really got payed.  Especially Garcia who is just sleep walking through this thing until that amazing fight scene at the end of course.  F"}, {"rating": "4", "text": "From its thinly sketched teen protagonist to its deluge of hero-will-rise clichés, Max Steel evinces all of the imagination and ambition you’d expect from a movie based on a bestselling line of action figures."}, {"rating": "0", "text": "Bad acting and boring movie. This is the type of movie that makes you ask yourself, how could a team of people wake up early every morning to work on this?. This movie does not deserve to be seen."}, {"rating": "0", "text": "An awful attempt at creating any decent action or spectacle, Max Steel could only interest fans of the original action figure, and may go down as one of the worst films of 2016."}, {"rating": "0", "text": "Where do I even begin right now with this movie? Perhaps I should start with the mindset of the people on set. Word is that they wanted this movie to be PG, but they lost the appeal. Perhaps if they cut out the image of someone pulling out a piece of glass from their leg, maybe this movie would have been PG-rated. While I painfully go through this review, keep in mind that these are the people we're dealing with. Their thought process appears to be topsy-turvy.\rMax Steel is the thankfully ill-fated adaptation of a line of action figure toys brought to us by Mattel, and if I had to sum up the plot, I would point to Transformers (2007), saying that the two movie have a rather similar plot (not the same, but somewhat similar). Good grief, this movie is cinematic cyanide through and through.\rThe plotline is continually stupid, followed by the cinematography, which is even worse (especially during one particular scene where the camera couldn't stop cutting from one place to another every 10 or so seconds). The characters are not only bland, but inert and completely weak. Yet, the movie expects me to like a romance between two characters that proves to be even more bland, formulaic, and stupid. These issues are just the tip of the iceberg when it comes to the problems with this sci-fi time-waster. Even a 12 minute video rant won't be enough for me to summarize this atrocity that deliberately pursued the Golden Raspberry Awards with a seal of disavowal."}, {"rating": "9", "text": "I liked the movie is interesting and very exciting and different from the usual I always see the same Marvel formula in superhero movies, and I hope they get a sequel, I know they can improve."}, {"rating": "1", "text": "Good god, where do I even begin?Max Steel is the worst movie i've seen this year.  It's unbelievably lazily thrown together, with choppy editing, some of the worst acting of the year, terrible writing, and an incomprehensible story that makes absolutely no sense whatsoever.  Max himself is so unlikable, stupid, cowardly, and whiny.  When he learns that he has this weird new power, and meets this weird robot, he doesn't even freak out that much.  It's not: \"JESUS, WHAT THE F!@# IS HAPPENING WITH ME?!\"  It's: \"Woah... what's going on?\"  Max himself is so bland and unoriginal, it's hard to really emphasize with the guy.  Plus, the story is slow and boring, I actually almost fell asleep.  At 4 in the afternoon.  That's not a good sign when you're supposed to be a cool superhero movie.  Aside from terrible cinematography and awful editing, there really isn't much else to talk about.  Max Steel is the most forgettable, uninteresting, unfunny, and terribly made movie i've seen in 2016 so far.  Avoid at all costs.Max Steel gets a 1/10."}, {"rating": "8", "text": "It's an entertaining, fun and very interesting movie, it's a pity that it's so hated."}, {"rating": "4", "text": "Unfortunately, as four Transformers movies weren't enough, once again we are met in a world where a mysterious alien named Steel who is closely stuck together with a 16-year old named Max McGrath. Sounds completely interesting right? Until they merge together, which in this case, that's where they stop bringing the originality bag in action, instead forcing us to deal with whatever's on screen and leave with minor disappointment and a big, major meh. Pass on this one while you can."}, {"rating": "0", "text": "the film tedious. uninteresting. I could hardly watch until the thirtieth minute and that's it. I can not believe that such a boring film could shoot at the universal studio"}, {"rating": "4", "text": "From its thinly sketched teen protagonist to its deluge of hero-will-rise clichés, Max Steel evinces all of the imagination and ambition you’d expect from a movie based on a bestselling line of action figures."}, {"rating": "7", "text": "With two animated TV series already under their belt, Mattel tries their hand at bringing their long-running action figure line into live-action form on the big-screen. Based on the 2013 reimagining series that ran on Disney XD, \"Max Steel\" is another entry in the ever-growing superhero film market that is currently being dominated by the comic book bigshots Marvel and DC. Max Steel is an admirable attempt at getting another series going, but was ultimately doomed to be DOA due to the fact that it's a more obscure character and clearly just didn't have the flash or history of it's competition. That's not to say it's all bad though. In fact, Max Steel can be quite entertaining. It's just that a reliance on formula holds it back. It's pretty much your standard superhero origin story. You can see bits of Raimi's Spider-Man as Max McGrath plays around with his newly discovered powers, the plot itself is derivative of those two Amazing Spider-Man movies, and the villain feels like he was pulled straight from 2008's Iron Man. It's a hodgepodge of borrowed ideas tied together with the character's own original lore, which I must say is surprisingly well-handled in that you get an answer to all your questions by the end of the film. Further explanation as to the reasoning behind those explanations, like what actually causes Max's weird powers in the first place isn't something the movie gets into. Oh, so he's filled with Tachyon energy. Why? Because aliens? Okay I guess. The writing is just lacking a little something needed to stand up amongst it's very successful peers.The action scenes in the movie are fine and the characters themselves are pretty likable. Even believable. Particularly Max himself. Ben Winchell does a great job in the lead role. The dialog itself is surprisingly great as well. The interactions between characters feel real right up until some cheesy dialog during the final showdown. It's this kind of stuff that kept me engaged and entertained even though the movie isn't exactly the next great superhero epic. Even Max's personal dramas of loneliness and an absent father are relatable in a way that this year's Power Ranger's movie was. Luckily, this movie is much better in the action department. The humorous dialog from Josh Brener as \"Steel\" is also much appreciated.Overall, Max Steel isn't as bad as a lot of movie based on toys have been. It by no means soars to new heights, but can at least prove to be a suitable way to pass the time between the next Marvel and DC film if you really find yourself needing your superhero fix. It should come as no surprise though that the real audience for this movie are the kids who enjoyed the Disney XD show. They'll have a blast watching their once animated hero brought to life in live-action form in his own feature film. Parents and older siblings might even find themselves enjoying it too. So long as they go this knowing it isn't a real standout in any way."}, {"rating": "1", "text": "SPOILERS AHEAD.What comes to mind watching this movie is a lame attempt from the early 2000's to try out something new before superhero movies were big.  But now superhero movies have been taken seriously for over a decade and there's no excuse for this kind of bad writing.It starts out interesting enough but soon delves into a snorefest.  The first half of the movie I feel like Max is constantly running from something. STOP RUNNING AND DO SOMETHING INTERESTING, DAMN IT. When agents are chasing him there's nothing interesting to it. No badass fights...just Max doing what he does best, running. The first real fight he has is with a wind-like creature and like everything else, is uneventful. He does an energy blast to take it down and that's it. The fight seems very pointless and even by the end of the movie it has you scratching your head. The second fight is the last and with the main villain.  This fight is also uneventful where nothing cool happens. Most of it is the villain monologuing. When a villain has to explain the movie to you in one of the last scenes it shows how lazy the writers are. Don't have a character explain it all to me at the end, show me the story throughout the movie. Make me care about the villain and his motives, don't just vomit the point during the last fight. Give them interesting dialogue instead. Some other points:I'm not sure what tone they were going for. It seemed to have a semi-serious tone but when Steel shows up the tone changes to a corny comedy. If it was going to be a corny comedy it should have started out as such. When Steel shows up Max's mom shouts from downstairs, \"dinner is ready\" (or something along those lines) but she can't hear Max when he's yelling and breaking stuff because he's freaked out when Steel appears? Also, nobody in the film seems to notice Steel. When Max keeps him in his backpack, Steel will be talking and Max can hear him but nobody else seems to really notice.  It's supposed to be for comedic relief  but it doesn't work if it doesn't make sense. The whole movie screams of crappy lazy writing.Why did Max get his powers when they moved to that specific place? I don't think it was explained in the movie. The movie would have been so much better if it focused less on story and just tried to be a fun action-packed beat em up superhero movie. The story was so boring, didn't make sense, so obviously lazy, and devoid of any good action. They should have given just a little bit of story (that made sense) and made Max into a badass instead. Wrecking the day of the agents, having cool boss battles, etc.  Even if it ended up being mediocre it would have been a fun afternoon watch.There's a lot more that's wrong with the movie but this is the stuff that comes to mind right now."}, {"rating": "7", "text": "It's a pretty acceptable movie, and I think they're stupid that it's so hated without meaning."}, {"rating": "10", "text": "I don't know why people post bad review but I watched the mvoieand I really liked the film its Full of Action & high Fantasy...( I don't know may there was less marketing efforts etc which makes Box Office negative report but I watched the film and this film full of action and high fantasy and its Tremendous)Regards"}, {"rating": "5", "text": "A new kid on the block with the superpower.I am not saying the film was terrible, but the timing was bad. There are loads of great sci-fi films were made recently and still coming out. So to compete with them, they have to go through alteration, even if they loose the origins of their film's theme concept. This story is same as many similar themed flicks. For me, it looked like a mini Superman film, but made for kids.The best thing about it was, keeping everything simple. And then the pace, which actually somewhat saved the film. I hooked to it from the beginning till the conclusion, but familiarity is what killed my interest and entertainment. The characters were okay, not developed well enough. But keeping young audience in mind, it does good. Because going deep is unnecessary stretch.The story of a high school boy who transferred back to a small town where has born. As he begins to hear a lot about his father from the local people, he becomes motivated to know more about him. But one day when something goes wrong, the next day he wakes up with great power. Not knowing how to handle it, he befriends with an unusual creature and together they fight those who are after them.Initially I thought it was related to 'Real Steel', but realised only while watching it it is completely different. From the director of 'Sorority Row', I think he did nothing wrong. Those who watch less films would enjoy it better. Visually okay, with all those graphics. Since it is PG13, I would say the target audience is the little ones. So from their perspective, it is acceptable. But I warn the grownups, stay away, or be like them while watching it, in order to get entertained.5/10"}, {"rating": "0", "text": "Literally the worst superhero movie ever. This is on my list of the top 10 worst movies I have ever seen. Almost no action in it. Horrible acting from the lead actor (Ben Winchell) and the lead actress (Ana Villafañe). Brainless, nonsensical plot. The voice acting for Steel was horrible. The editing is horrible. The cinematography is horrible. The pacing is atrocious. The main character Max McGrath (Ben Winchell) is completely boring, poorly acted, and has no depth and the rest of the characters have no depth either. Max's crush/girlfriend, Sophia Martinez (Ana Villafañe) didn't really have a purpose in the story and didn't even feel like a character. Steel was very annoying and Josh Brener (voice actor of Steel) did a **** job at voice acting. The villain twist was so painfully predictable from the start. This movie was very extremely boring from start to finish. Worst movie of 2016."}, {"rating": "10", "text": "Spider-Man: Far From Home is a 2019 American superhero film based on the Marvel Comics character Spider-Man, co-produced by Columbia Pictures and Marvel Studios, and distributed by Sony Pictures Releasing. It is the sequel to Spider-Man: Homecoming (2017) and the 23rd film in the Marvel Cinematic Universe (MCU). The film was directed by Jon Watts, written by Chris McKenna and Erik Sommers, and stars Tom Holland as Peter Parker / Spider-Man, alongside Samuel L. Jackson, Zendaya, Cobie Smulders, Jon Favreau, J. B. Smoove, Jacob Batalon, Martin Starr, Marisa Tomei, and Jake Gyllenhaal. In the film, Parker is recruited by Nick Fury (Jackson) and Mysterio (Gyllenhaal) to face the Elementals while he is on a school trip to Europe.Discussions for a sequel to Spider-Man: Homecoming began by October 2016, and the project was confirmed later that year. Holland, Watts, and the writers were all set to return by the end of 2017. In 2018, Jackson and Gyllenhaal joined the cast as Fury and Mysterio, respectively. Holland revealed the sequel's title ahead of filming, which began that July and took place in England, the Czech Republic, Italy, and the New York metropolitan area. Production wrapped in October 2018. The marketing campaign is one of the most expensive for a film ever and attempted to avoid revealing spoilers for Avengers: Endgame prior to its April 2019 release.Spider-Man: Far From Home premiered at the TCL Chinese Theatre on June 26, 2019, and was theatrically released in the United States on July 2, as the last film in Phase Three of the MCU. The film received positive reviews with praise for its humor, action sequences, visuals, and the performances of Holland and Gyllenhaal. It grossed over $1.1 billion worldwide, making it the first Spider-Man film to pass the billion-dollar mark, the fourth-highest-grossing film of 2019, and became Sony Pictures' highest-grossing film and the 24th-highest-grossing film of all time. A sequel, Spider-Man: No Way Home, was released in December 2021."}], "recommendations": ["infinite", "transformers_the_last_knight", "teenage_mutant_ninja_turtles", "the_old_guard", "kingsman_the_golden_circle", "bumblebee", "terminator_salvation", "jurassic_world_fallen_kingdom", "maze_runner_the_scorch_trials", "pirates_of_the_caribbean_on_stranger_tides", "riddick", "surrogates", "pirates_of_the_caribbean_dead_men_tell_no_tales", "independence_day_resurgence", "x_men_apocalypse", "jumper", "x_men_origins_wolverine", "the_new_mutants", "tomb_raider", "xxx_return_of_xander_cage", "battleship", "transformers_age_of_extinction", "bloodshot", "seventh_son", "terminator_genisys"]}