{
  "id": 410,
  "title": "Maze Runner: The Death Cure",
  "starring": [
    "Dylan O'Brien",
    "Kaya Scodelario"
  ],
  "runtime": 143,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "Thomas leads his group of escaped Gladers on their final and most dangerous mission yet. To save their friends, they must break into the legendary Last City, a WCKD-controlled labyrinth that may turn out to be the deadliest maze of all. Anyone who makes it out alive will get answers to the questions the Gladers have been asking since they first arrived in the maze.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2zYfzA3TBwrMC8tfFbpiTLODde0.jpg",
  "categories": {
    "plot": 6.4,
    "acting": 7.5625,
    "ending": 6.56,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 7.612903225806452
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I don't really like to give 10 on anything but this movie is just so incredible, it was worth waiting 3 years. I never tought that i'll cry watching a movie. And there was action all the time so you won't get bored. Also the visual effects are perfect. Overall my favorite movie for now."
    },
    {
      "rating": "10",
      "text": "A Very Good Movie.!! That is how you finish off the Series. I applaud the actors, directors, and all the stunt/special FX people involved in this movie. Thanks You All.."
    },
    {
      "rating": "7",
      "text": "A really well made, emotional, and satisfying closing to the series. The action is awesome, the cast and their chemistry is great, and it's 2 and a half hour run-time never feels excessive. Might be my favorite of the series, even."
    },
    {
      "rating": "5",
      "text": "Anyone who's familiar with the Maze Runner franchise will most likely get a kick out of this one. Anyone else though will have to wonder how much of a finale was all wasted to just pure disappointment coming from the hard work that had all the effort to become a lot better than it expected to come out as. Curing this installment is going to take a long time and I sure wish it didn't have to go this way."
    },
    {
      "rating": "3",
      "text": "Ok.  It's over.  My gut feeling is just that the story went in the wrong direction way back in the first film.  Remember the first film?  Maze Runner....kids wake up with no memories in a glade surrounded by a crazy maze that changed and rearranged itself every night.  It was fascinating! What a concept!  Why are they there?  Why did they have their memory wiped?  Can they solve the mystery of the maze and escape?   Oh, wait.  The maze has been COMPLETELY mapped.  Now this guy Thomas shows up and boom! with no real experience he leads them out....and blah blah blah.  I would have LOVED a first movie dedicated to all the adventures BEFORE Thomas showed up --- let's see all their adventures mapping the maze, creating a community, and organizing their social roles.  Let's learn more about Newt, Frypan, Minho, Gally and all the others.  It's called \"character development\"!!  There was so much rich material that could have been explored. But then it was off to the \"Scorch Trials\" which, to be honest, was a snoozefest.  Trials?  What trials?  ooh....it's all a trap and now we have to run through a desert and then, betrayal! Capture! Cliffhanger!  (not really, it's all too predictable at this point).  Now, finally we have the ending, we have \"The Death Cure\".   None of this makes sense....we have to torment and torture kids (in their 20s and maybe early 30s?) so their blood is somehow \"stronger\"?  What?  That makes no sense.  And we have to kill them to take their blood?  Basic science says you can donate weekly and even twice weekly if you are in good health and eat right.  But, in these movies, the kids have to be tormented and killed for their blood?  Let's hear some REAL science behind that.  Oh, we don't get deep dialogue.  Just shallow garbage.  Stupid.  Then we have Rebels taking over a walled city DESTROY the city because...you know, they don't need a place to be safe from the infected and they don't need the medical building to continue searching for a cure.... WHAT?  And who is their leader and why should we care about that guy and his rebellion?  And how can they bring down a whole city when there is a trained equipped Army?  Skyscrapers falling? Seriously? Then we find out that Thomas IS the cure (of course he is) but NO ONE WANTS TO SAVE THE WORLD except the evil people?? Yeah. That makes sense.   Let's just go off to live on a beach instead.  After we kill off Newt for no good reason -- wasn't he immune???? And, of course, Theresa needs to die too because she betrayed her friends and caused many of them to get killed or be tortured, or both.    Basically, all the potential of the first movie was thrown away and destroyed in an effort to make what is basically a couple of zombie movies with shallow characters and impossible escapes/coincidences...etc.  Yeah. The train stopped EXACTLY next to the hidden people.  Yeah.  The bus is driven down random streets but a crane just happens to be able to get to it to pick it up.... all these heroes from the sky!! Deus Ex Machina!! We are saved!!! Boring. Overdone.  Yawn.   Honestly, let's go back to the maze and the mystery of the FIRST movie and write an entirely different story as to who these kids are and why they were there.  It certainly couldn't be worse than this trilogy.  Let's talk about this city, all those people in suits going to/from jobs?  What jobs? Who manufactures their clothing?  Where does their food come from?  Etc.  Also, let's talk about all those mazes --- Where are the construction crews that, presumably, built multiple mazes over what had to have taken years...while dodging zombies?  You can build all these mazes and robot monsters...but don't have the means or funds to create MORE SAFE HAVENS???  What committee voted to build mazes instead of funding walled cities?? How stupid...sounds like wasteful government spending.  The whole premise of these movies as zombie movies just falls apart.  Somewhere, deeper, there is a far better story that could have been told.  This series is just too derivative of everything from Mad Maxx and The Hunger Games to Resident Evil and 28 Days Later and every other dystopian story of the past 20 years.  It just doesn't work as a zombie flick series.  This should have been more of a Sci-Fi Story from the first movie and the maze....such a wasted opportunity."
    },
    {
      "rating": "10",
      "text": "Only giving it a 10 to counter the trolls who feel the need to give it a one.Realistically I'd give it a 8.5 as there is brilliant set pieces, an amazing score by John Paesano, some breathtaking visuals that stuck to me even after the movie was over, and the great acting from the whole cast. Everybody puts their all in, even the adult actors."
    },
    {
      "rating": "4",
      "text": "30 minutes too long, and because i started to get bored i started to think....how can only 200ish people make a whole city burn to the ground in less than an hour? Especially when that city is full of superior armed forces with superior firepower etc"
    },
    {
      "rating": "7",
      "text": "Maze Runner: The Death Cure is the final installment in the MR trilogy and, for the climactic film, was relatively anti-climactic. The actions sequences in this film were intense and well filmed, and were very engaging all round and fun to watch. Dylan O'Brien as Thomas was yet again very good, and his friendship with Newt (played by Thomas Brodie-Sangster) was well written and its arc was very touching. However, this was probably the most engaging storyline in the film, despite the film being called 'The Death Cure'. The story lacked depth and didn't invest me as much as the final film in a franchise should, as is the case of the other two films (especially 'The Scorch Trials'), and the set-up for the film was quite poor and it felt really rushed, which is ironic; the run-time is 2.5 hours, another thing which maybe could've been avoided). However, it was well directed as Wes Ball succeeded in creating a sense of urgency and high-stakes, especially in the last half hour of the film. Production was also pretty high calibre. All in all, its probably one of those films that you'll watch with friends and go 'Wow' at the action scenes and the production, but forget about it the next day."
    },
    {
      "rating": "9",
      "text": "This movie is one the best conclusions in a trilogy. There is great acting, action scenes, emotional depth. However there some minor plot holes that didn't make sense, but other than that it was probably the best out of the trilogy."
    },
    {
      "rating": "8",
      "text": "Wes Ball's Maze Runner: The Death Cure is a fantastic end to a great trilogy. This film is also easily the best one in the trilogy. The action in this film was amazing, and the performances were great. But my complaints with this film is that its full of cliches. In the end, this is a great film and is very enjoyable."
    },
    {
      "rating": "6",
      "text": "Good but not great, the acting was good especially Thomas Brodie-Sangstar who portrays Newt. however it does take what was a good book and makes it quite generic and average"
    },
    {
      "rating": "10",
      "text": "این قسمت که به عنوان آخرین قسمت دونده هزارتو است بهترین قسمتی بود که دیده بودم واقعا این سه گانه خارق العاده و شاهکار بود امیدوارم که ادامه داشته باشه"
    },
    {
      "rating": "6",
      "text": "Didn't even see the first two installments tbh. I just tagged along with a friend who really wanted to see this, so naturally I had no idea what was going on really. The film had its decent and entertaining action moments, but considering this was the final film, it felt pretty rushed and half-assed if you ask me even with its nearly two-and-a-half-hour runtime. With the exception of Dylan O'Brien and Will Poulter, the acting from everyone else was rather poor. Overall, maybe some who saw the first two might get more out of this than I did obviously, but with the lukewarm response this has been receiving by most, it's probably a bit of a gamble."
    },
    {
      "rating": "4",
      "text": "Once The Death Cure realizes it has strayed too far from its source material, it just resolves to tons of action with little or no plot. It is impressive, that another young adult trilogy has successfully completed its run, and still entertains fans of the trilogy and the books"
    },
    {
      "rating": "10",
      "text": "This movie just put out what it should've put in the 2nd one! With a lot of parts of the book, it now must be recognize as one of the best action movies of all time, not just because it's my favorite trilogy, but cause it REALLY IS! Y'all should see on cinemas, won't be lost of time, I swear! All in all, teresa and newt dies, two of my favorite ones, really don't know why thomas didn't die lol."
    },
    {
      "rating": "10",
      "text": "Relax guys, if you want to see a movie with really follow some book parts, you're in the right way. Go watch it and say by yourself. Particurlaly, is one of the best movies I've ever seen, with a lot of action scenes that get out our breath! I love this trilogy,is the best, ever and ever!!"
    },
    {
      "rating": "4",
      "text": "Бегущий в Лабиринте: Лекарство от смерти- скучное и затянутое кино. Персонажи больно не раскрываются. Сюжет непонятный, слишком много всего в нем. Экшен ради экшена. Ну вот, что хорошо в фильме, так это съемка и визуальные эффекты. Может быть вам фильм понравится, так как мне предыдущие две картины не особо понравились, и от этой мало, что я ждал."
    },
    {
      "rating": "9",
      "text": "So an emotional movie, as the end of this series, maze runner is very successful as the story will be missed by fans of this series. This film teaches about how loyalty to friends, family, and people around us. Besides that, although everything in this movie is perfect, Dylan O'Brien as Thomas is less playing his emotions as the main character, luckily this movie has a very strong sad plot."
    },
    {
      "rating": "10",
      "text": "Thoroughly enjoyed the movie. Critics are being far to hard on it IMO. What you get is an entertaining action movie, with solid acting and some emotion inducing moments. Movie probably isn't a 10, more of an 8.5 but I've given it a 10 to offset the low reviews of all the haters."
    },
    {
      "rating": "6",
      "text": "This 3rd and final entry finds the crew on a mission to save other youths who have immunity to the virus that's ravaging the world. They must penetrate the Last City with its minimally impressive modern touches. The story is fairly predictable and so is the action. Luckily, the film is mostly well paced and features enough adventure to keep it interesting. This will prove enjoyably fulfilling for fans of the series, but people who don't hit the demographic may just find it another noisy, melodramatic post-apocalyptic adventure."
    },
    {
      "rating": "8",
      "text": "The Maze Runner series was one of the best book series I've read in the last few years. I obviously get excited when something I've read hits the big screen, even though I know the film usually won't be as good as the book was. I have found that when film makers try to stick to the original story, as they did in The Hunger Games, the films are terrific. When they just take pieces and basically write their own story, it's usually an epic failure, i.e. Allegiant. In the first installment of Maze Runner, the film diverged and was disappointing, but the second film followed the book to a tee, and was terrific, what would happen in the third? Right off the bat, as I feared, the story is completely different and very few elements from the book are even used in the film, however, in the rarest of rare cases, the way the film makers re-wrote the story, actually improved upon it! Dylan O'Brien returns as Thomas and this is the film where his character really broke out and came to life as the hero we see in the novels. I honestly didn't see him as Thomas until I watched this film, he was that good. As for his other half, AKA Teresa (Kaya Scodelario), she was in a completely different role than in the novel, but likewise gave a much stronger performance than she did in the other two films. The final standout was Thomas Sangster, who I've spoke about before. He is fantastic in everything he does, but he doesn't do a whole lot! I really would like to see him do more and break out, it's a mystery to me why he doesn't. As a whole, The Death Cure was not the best in the book series, but it was the best in the film series. Many critics complained that it was too long, but I say take a look at what they did with the last book of the Divergent series. Alligiant was split into two and how well did that turn out? The only knock on this film is that one of my favorite actors, Jacob Lofland, didn't have more screen time as Aries, but aside from that this was a perfect conclusion to the film series, and a better ending than the one that was originally written for this franchise."
    },
    {
      "rating": "7",
      "text": "Great finale. The film is very entertaining and action packed. The action scenes are breath-taking and the CGI is incredible. But it has 2 issues: 1st, the runningtime, I felt it was too long; 2nd, how a lot of problems are solved by coincidence.But, still a very good film to kill some time. Watch it in the theater, is better like that."
    },
    {
      "rating": "8",
      "text": "Incredible movie that deserves some love. This movie exceeded my expectations and kept me entertained at its grueling 140 minutes. Very well crafted, Maze Runner: The Death Cure had me entertained from start to finish."
    },
    {
      "rating": "8",
      "text": "Overall Rating: 8/10Cons: The film is a bit too long. While action packed, the first half of the film is drawn out, and it takes an hour to really pick up steam.Pros: The visuals and action sequences are outstanding. This film is a huge improvement over the second and is closer to the source material. The climax is gut-wrenching and the final few minutes are heart-wrenching. Very satisfying send-off for the series.Consensus: The Death Cure packs in enough thrills and visuals to fill its overly-long runtime, finishing this YA trilogy  on an emotionally satisfying high note."
    },
    {
      "rating": "9",
      "text": "Maze Runner: The Death Cure is a fantastic conclusion to the Maze Runner trilogy. For the material they had to work with, they did an amazing job. The largest issue comes from the story material of the novel being a bit cliche, and a bit too predictable at points. But the movie adaptation knocks it out of the park with fantastic direction and performances. There are some truly great and emotional moments throughout the movie that make you care for the characters. The performances, especially Dylan O'Brien, really sell their characters. And the action in this movie is hands down the best of the three movies. The pace of the movie is great; action, surprises, and character moments are well placed keeping the movie entertaining throughout. I'd have to watch it again, but I'd argue it is the best of the three movies."
    },
    {
      "rating": "4",
      "text": "There's is a lot wrong with this movie, but first i'm gonna start with the positive. Very well acted, wasn't expecting such nice and tidy acting, I could actually feel their hatred for Teresa and Teresa's guilt. Some of the action scenes are really entertaining.But the script is such a mess. The use of Deus Ex Machina right in the start of the second act, where they are surrounded by cranks, and then well all of a sudden, they are saved by people who were following them? I think? Added a character who apparently was boss of the cranks and starts a big war, but we don't who the hell he is, so we barely know a character, but he has a huge effect in the movie.Bringing Gally back from the dead and barely explaining how... the guy got a spear to the chest, you have to explain how he's back or how the hell he survived.Newt's death is irrelevant, because he dies to make Thomas aware that he can save a lot of people by providing his blood for the cure, and they don't use the cure, instead they end the movie by going to a safe haven... what the hell, you have the cure that can save humanity in your blood use it.So even though some parts are indeed entertaining, there are a lot of things that seriously annoyed me in this movie"
    },
    {
      "rating": "7",
      "text": "Without having to have seen the previous entries in this franchise; Maze Runner:The Death Cure excels in character chemistry, visuals, world building, and overall plot. While some of the story can be predictable and flat at times, and some of the newer editions to the cast can feel pretty wasted in the overall story; The Death Cure is an overall well made film that sends the dystopian teen genre of films on a somewhat high note- compared to some other franchise endings in this genre."
    },
    {
      "rating": "10",
      "text": "this movie has cool storyline and an so many emotional ride. well done wes ball and james dashner"
    },
    {
      "rating": "10",
      "text": "Watch Maze Runner: The Death Cure Full Movies Online Free HD ᐈᐉ http://4k.mediafilm.link/?do=watch&id=336843Maze Runner: The Death Cure Off Genre : Action, Mystery, Science Fiction, ThrillerStars : Dylan O'Brien, Thomas Brodie-Sangster, Ki Hong Lee, Kaya Scodelario, Rosa Salazar, Giancarlo EspositoRelease : 2018-01-17Runtime : 142 min."
    },
    {
      "rating": "7",
      "text": "This film was not anything I expected! While it didn't blow me away as something new and exciting, it did offer some genuinely entertaining action sequences and great acting. I just feel that the film was way too long and had multiple scenes that were boring and uneventful as best."
    },
    {
      "rating": "10",
      "text": "It was amazing. Today I watched this movie and was shocked by it. I was told that he was wonderful ,but i did not expect so much. I did not expect such an end, but the director ,the actors ,the scenarists(writers) did his job perfectly well. This is one of the best movies i have ever seen. 10 of 10."
    },
    {
      "rating": "10",
      "text": "It was very sad, but very amazing. I will miss this movie series very much."
    },
    {
      "rating": "10",
      "text": "This movie was the best out of the three. Lots of action and big budget. This movie sums up the maze runner franchise perfectly. I recommend this movie to the people that have read the books and watched the first two movies."
    },
    {
      "rating": "7",
      "text": "Excelente como para una película, lamentblemente, pudimos habernos dado cuenta que como adapatación es muy mala. Muy bueno efectos visuales y buen momento de anexar canciones de fondo. Sin duda, es la mejor de las tres, no comparada con el libro, pero buena sí es."
    },
    {
      "rating": "0",
      "text": "its like a **** bro........................................................"
    },
    {
      "rating": "9",
      "text": "This was such a great movie and probably the best of the series. I have never been so fully engaged in a movie before. This movie had everything. Action, Emotion, and a very good story line. The only reason I gave it a 9 and not a 10 was because Newt died. Newt was my favorite character and I was almost in tears when I watched that scene where he died. I know that in every good series a character has to die, but I just wish it wasn't Newt."
    },
    {
      "rating": "10",
      "text": "It's my favorite movie. I like everything about it, I would watch it endlessly"
    },
    {
      "rating": "8",
      "text": "The long-awaited conclusion to one of the last dystopian YA film series is finally here. Despite being another Maze Runner where there's no actual maze, this is much more in line with what the first film was like than the post-apocalyptic zombie flick we got last time. The Death Cure is kind of coasting by on emotion and spectacle as there are still issues with the storytelling.Overall it does a satisfactory job of giving these characters an ending to their troubles. I was still left with a lot of questions that never really got satisfactory answers though. Like just why putting the twentysomethings in the maze caused them to secrete some life-saving enzyme in the first place. We learn why Thomas has been so special this entire time, but his role in WCKD before being inducted into the mazes is made even more confusing. I also felt like my opinions on the actual villains was supposed to flip-flop at least 30 times before the credits rolled. Particularly in regards to Teresa. Then there's the question of how that one dude managed to come back from the dead.This is all kind of easy to overlook in the minute-to-minute action though. Things. Get. Crazy. Plus at this point in the game we've all pretty much grown to love these characters and are just invested in seeing their conflicts resolved. I mean we've put up with the plotting issues this far so what's one more outing here at the end? Come for the scale, balls out action, and sweet, sweet resolution. Seriously, I can't praise the action enough. Maze Runner proves once again to be the most violent YA series to hit the screens. The shootouts and fist fights are huge and brutal. There are regular explosions and big stunts. The Death Cure? More like the boredom cure. It does things that The Hunger Games and Divergent just didn't."
    },
    {
      "rating": "5",
      "text": "Fairly epic conclusion but absolutely chockers with plot holes. Probably best of trilogy though."
    },
    {
      "rating": "2",
      "text": "This was a movie that just wouldn't end.  The story line was weak through all three movies.  I never really could get way the original characters had to live in the Maze.  The second movie ever did tie in well as to the correlation of why living in the Maze would be helpful to a cure for the outside apocalyptic world.  This last movie just didn't have a good story line I could get behind.  The ending was a bust and dragged on and on and on and   .....   I also think each movie was worse than its predecessor.  The first movie I actually liked.  The two sequels were a big waste of time."
    },
    {
      "rating": "6",
      "text": "I give it a very decent 6.5 out of 10. Stunning action pieces that should make some teams from other blockbusters with double the budget reconsider things. Fantastic visuals. The film flows thanks to it and also thanks to great performances by a good part of the cast. The writing is the weakest part, but it is also the case for many of these blockbusters in general. Maybe the weakest film in the trilogy was the second, so this last one tries to reconnect all the things. And does it successfully in my opinion. Towards the end I was clearly invested in what this group of people were going through. Pure entertainment and some emotional investment. Recommendable."
    },
    {
      "rating": "2",
      "text": "this movie series has lost all its excitement. there is neither a maze nor a mystery."
    },
    {
      "rating": "6",
      "text": "\"Maze Runner: The Death Cure\" ends the franchise on a thrilling and action-packed, if generic note."
    },
    {
      "rating": "7",
      "text": "There was part near the beginning when I mumbled \"Deus Ex Machina\". My wife says \"I'm not sure what that really means\". I says, \"It means god from the machine. As in some machine comes in and saves the day.\" She says, \"So like that truck that just appeared out of nowhere and is literally a machine.\" \"Yup!\". That sums up my problem with the movie. Other than, the movie is great. If you want to end a series, this is the end for it. You have people die, buildings destroyed, folks infected, mazes to run, Jesus Christ references, and final no-cliffhanger finish. The characters are also interesting in their own way as they often turn on surprising motivations. This makes the end more character driven than plot driven and I love it.The action set pieces are rather fantastic for this kind of young-adult post-apocalyptic movie. There's none of the usual running in the woods. Instead we have stunts on trains, amazing gun fights, and some crazy work with a crane. I hope this pushes the imagination of this genre forward. All in all, the Maze Runner series is much better than films like Divergent and The 5th Wave. I'll even go so far as to say it is Hunger Games level of quality. Maybe it doesn't have the same star power but I don't think movies need it. I feel like the series as a whole would be much better received if it wasn't in such a crowded market of young adult post-apocalyptic movies."
    },
    {
      "rating": "7",
      "text": "\"The Death Cure\" ends the Maze Runner trilogy on a relatively strong, action-packed note."
    },
    {
      "rating": "6",
      "text": "A maze which may have had many other exits.  \"The Death Cure\" began its commercial run as one of the first offers of the year as it was the month of January that served to enjoy the last adventure into WCKD's roots for long-time fans who were still true and curious moviegoers who wished to overlook the first two films — an unhealthy decision. — Briefly, the film returns seasoned as usual with dangerous-action scenes, two of all them at the level of its predecessor, with some surprising sacrifices plot but with an incompetent and illogical resolution that leaves a rather bitter taste on the world of this franchise. It was supposed to make a big name for itself, which, sadly, did not happen that way. I can imagine screenwriters and executives, avid for more but willing less, sitting at the same table discussing the different — absolute? — closing possibilities to this treacherous trilogy. They were of course conditioned by the book written by Dashner from which they had to adhere their ideas, however, it's perceptible the dependent additive has managed to balance the degree of honesty and divergence with the inspiration source, screenwriters' narrative additions and executives' postulates, in a comparable amount, are even praiseworthy at certain times, but not fascinating and even jarring and laughable. At first glance and although the writers could not move freely at all — although in Hollywood times we see that this isn't an impediment —, betting to go back a place from they just get out seems incoherent, a simple mechanism setting up more action and ostentatious moments, only voided sporadically by tools that blind for a limited time extremely melodramatic lines or melancholic dramatic scenes. The story is commonly designed, that is to say, we follow the fight of the hero, he's defeated several times, but finally wins, the interesting and peculiar thing is that on the way loses important supporters, ergo there are two significant heart-breaking moments that take a vital role in main character's personal development that boost the purpose of destroying WCKD. It's hard to find ways to turn a standard ending into a memorable one, but not impossible, and I don't mean pessimistic conclusions, just, getting something different, something the spectator doesn't expect, sadly, this feature film chooses common solutions, falling into also habitual cinematographic oblivion.It's already a custom that over-the-top set-pieces offer good-approach choreographies, which, although are not at the level of those present in the second installment, excite and provide a dazzling experience as soon as a cohort of infected arises. These moments are acceptable and even enjoyable, however, there are a couple of sequences that go beyond. On this occasion, the first sequence shares the setting of one of the previous installments, with the daring young runners jumping, as if they were superheroes, from the top of a building. The second and personally the best-sketched-and-accomplished sequence is starring Rosa Salazar and an autobus full with innocents, and despite it doesn't get a completely true result, it made my hair stand on end for the fate of the kids in that unstable bus; an excellent moment, the only one I'd say.Aesthetically, it does not become a focus of praise either. Keeping a predominant place for darkness and a little presence of vivid colors, the film becomes a little dull, no different settings or racking focus are used, simply, the camera follows or remains static to the actions of the characters. This doesn't mean that it is lackluster and anodyne, it's just one more rescue in which the colors don't have the role they should, leaving expectant to the spectator by a much better visual splendor. Of course, special effects used to get this futuristic city are fantastic and complex, they never feel synthetic or manipulative, as in the compendium of buildings or whitish laboratories take place two key moments. Thus, the conclusion of film trilogy \"Maze Runner\" at the hands of Wes Ball, the same filmmaker of all the three movies, provides an independent film, endless, but dynamic, laughable but entertaining, cliché about the hopeful fate of its characters. \"The Death Cure\" shows a good handful of set-pieces and won't mean a tortuous or incoherent time for those who decide to buy a ticket, however, for the most loyal fans and readers will be an idea that relegates great opportunities to stick an ideal conclusion, predicted and lack of the surprise factor. Even so, as a whole, the saga, despite being below Katniss Everdeen's tetralogy but far above \"Tris\" Prior's unfinished tetralogy, is worthy of a Sunday afternoon to enjoy run-of-the-mill Hollywood adaptations brimmed with action, where what matters is not how getting out of the maze, but, ironically, looking for a way to get back in."
    },
    {
      "rating": "5",
      "text": "\"Maze Runner: The Death Cure\" was a good conclusion, although the mistakes were almost the same, only that it was a little better, the development of the story is good although it was not well executed, and the characters as always good, the ending was at least satisfactory, although franchise had an average execution was a great effort in achieving launch this adaptation of James Dashner."
    },
    {
      "rating": "6",
      "text": "Após uma espera longa, Maze Runner: The Death Cure finalmente se exibiu nos cinemas. Dos 3 filmes para mim é talvez o que gostei menos e achei muita vezes meio jogado algumas cenas, mas no todo o filme acaba por ser bom tendo os seus momentos marcantes. Destaque para a trilogia em si que foi boa, mas depois do primeiro filme, que foi muito bom, as coisas mudaram muito e não para melhor. No geral é um filme que ve-se bem e tem uma história bem composta."
    },
    {
      "rating": "7",
      "text": "Dans la digne lignée de cette trilogie \"labyrinthe\" !Ce dernier opus signe un scénario très satisfaisant, aux scènes d'action plus rythmée Je garde néanmoins le meilleur souvenir pour le 1 et sa maitrise du mystère tendu. La véritable évolution pour le 2 qui poursuit \"The last of Us\"... Quant à ce 3e opus plus dans la démesure que tous les autres poussent à nous faire demander \"faut-il réellement plus ? \" Heureusement, il ne délaisse pas le côté charmant qui fait tout le mystère de cette trilogie.Un brin d'émotion encadrée d'un univers post-apocalyptique renversant.."
    },
    {
      "rating": "8",
      "text": "Was it worth the almost 3-year wait, yes it was (mostly)? Maze Runner: the Death Cure is by no means a fantastic movie, it is however highly enjoyable. It starts out with a fantastic train heist sequence that pulls you into the movie and it keeps chugging along (pun intended) for awhile. Then it kinda slows down in the middle and becomes sorta melodramatic for a bit, which I didn't understand; while it was the weakest part of the movie it did have some standout scenes. What made the whole movie for me was the last 40 to 50 minutes of it, filled with amazing action sequences and some really great (not to mention terribly sad) character scenes. And then we wrap it all up with a fantastic ending, which was easily the best part of the movie. Another thing I loved is that I enjoyed it more than the book, it wasn't irritating, although the dialogue was cheesy and incredibly predictable. I knew what characters were going to say before they said it and was like they're going to say that and then they did say just that. That happened about 20 times. Overall, it had a better story than the Scorch Trials movie and was much more engaging. This one or the first one is probably the best of the trilogy, and thank goodness that it was a trilogy. B"
    }
  ]
}