{"id": 4329, "title": "Me and Earl and the Dying Girl", "starring": ["Olivia Cooke", "Thomas Mann"], "runtime": 105, "genre": ["Drama", "Comedy"], "description": "Greg is coasting through senior year of high school as anonymously as possible, avoiding social interactions like the plague while secretly making spirited, bizarre films with Earl, his only friend. But both his anonymity and friendship threaten to unravel when his mother forces him to befriend a classmate with leukemia.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/eLjS2bLMjln2n2I73Xu6TaANPDZ.jpg", "categories": {"plot": 7.304347826086956, "acting": 7.644444444444445, "ending": 7.538461538461538, "soundtrack": 7.0, "cinematography": 8.25, "familyFriendly": 6.0, "funny": 7.107142857142857, "action": 8.0}, "reviews": [{"rating": "10", "text": "\"Me And Earl And The Dying Girl\" perfectly synthesizes Wes Anderson and John Hughes's filmic tones, earnestly gutpunches the audience's collective heart with honest pathos, and achieves a bullseye in the follow-through of nearly every joke it delivers. In short, it wins. Take a victory lap Alfonso Gomez-Rejon."}, {"rating": "8", "text": "THIS IS THE PART THAT I BEGIN MY REVIEW AND INTRODUCE THE FILM WITH A CLEVER HOOK\r You would never think that a title with the words “dying girl” would be the most buzzed about film at Sundance 2015, causing a bidding war that would eventually be won by Fox Searchlight Pictures for a whopping $12 million, the largest distribution purchase in the history of the fest. But alas, Me and Earl and the Dying Girl is a true testament to the power of YA pop culture, and a young adult film infused with the current obsession with cancer-driven teen fiction.\r Following in the footsteps of the widely popular The Fault in Our Stars and my personal favourite cancer-comedy 50/50, Me and Earl and the Dying Girl is a mix of both, with a hint of 500 Days of Summer in for good indie measure.\r Thankfully, Me and Earl and the Dying Girl is miles ahead of the aforementioned Stars and is easily one of the most wryly self-aware and raucously comedic films of the year.\r The ironic aspect of Me and Earl is that cancer has never really been at the front-row of comedy in the real world. Although it is one of the most devastating diseases of our time, consuming the lives of many loved ones, cancer, in this instance, sets up one of the most endearing and authentic cinematic friendships seen on screen, in a very long time.\r Now if you are all thinking, how in the hell is a film about a very pending friendship between two boys and a girl recently diagnosed with leukaemia one of the funniest and best films of the year? All I’d have to say is “Respect the Research” and find out for yourself.\r THIS IS THE PART WHERE I EXPLAIN MY COMMENTARIES ON THE FILM\r One of the many (and I’m talking about a ton) charms of Me and Earl is its ability to share so many universal and relatable truths to its audience. The fact remains, Rachel Kushner (Olivia Cooke) is a seventeen-year old girl who is recently diagnosed with Leukaemia. Greg Gaines (Thomas Mann) is a smart-talking, quick responding, social leper who has serious issues with the word friendship and a great appreciation for hipster and event-garde culture (including Warhol, Herzog and B-films). Earl (RJ Cyler), the innocent by-stander in all of this, is your typical high-schooler who obsesses mostly with ****  Yet, these three unique characters and the serious and lighthearted issues they face in a small Pittsburg high school offer some of the most insightful and emotional responses from an audience in the year 2015.\r Based on Jesse Andrews’ book of the same name, the author was able to adapt his own book into a screenplay, keeping its infectious charm and wit intact. Luckily for us, Andrews’ book has been described as a book made to be read by anyone; anyone who has gone to high school, anyone who has lost someone they love, or grew up with a family, or has wondered what life is all about.\r Directed by Alfonso Gomez-Rejon, a sophomore feature following his debut horror film The Town That Dreaded Sundown, the film blends a very inauspicious mix of quirk at first by beginning the story with an abundance of stop-motion animation, flashbacks, and some very obvious film-school favourites including; the long take; pans; and long shots. Rejon, who began his career as a personal assistant to Martin Scorsese, shows his range as a charming director who is able to not only amp up the quirk factor, but also get the best performances from his actors and characters to help narrate the story to uncontrollable moments of laughter. Much like its main character Greg (Thomas Mann) and his inability to obtain normal friendships or accept the obvious classes created in any high school setting, Rejon embraces the main essence of Andrews’ novel, loss and love and stays true to its unique nerdiness, owning every second of it.\r THIS IS THE PART WHERE I…TALK\r It was the best of times, it was the worst of times, and for the most part, Me and Earl and the Dying Girl is easily one of the most satisfying films of 2015, and not for the usual ingredients that make an indie film so great either. While most indie films are applauded and hailed for their quirky soundtracks, incredible acting discoveries, and new finds, Me and Earl has an interesting quality of brining back the old, and making it cool again. Rejon, an obvious film enthusiast and lover of classics (Criterion quality to B-movie selections) sends great satisfaction of allowing his feature of reminiscing on these classic films in a fringe-type cinematic wet dream. His rehashing, mockery yet clear praise and reference to classic films shows his great admiration and love for film as a whole. While Greg and Earl half-heartedly remake some of their favourtite films, we get a clear sense of what makes them great friends, their ability to embrace their immaturity and playfulness. Rejon pulls it off through and through, that boys will be boys, while Mann and Cyler really hit that notion out of the par throughout each scene."}, {"rating": "9", "text": "I'll admit I'm a sucker for these coming of age films and this one is no exception.  The performances are great from all these young actors.  Finally I really appreciated the way they mixed comedy and drama by creating those fun movies.  A"}, {"rating": "9", "text": "What a quirky film this is, I LOVED IT. Hands down one of the best films I have seen so far in the year 2015. Sweet. clever, gust bustingly hilarious, emotionally powerful, well acted with an excellent screenplay to top it off. Director Alfonso Gomez-Rejon crafts one of the most unique looking movies of the year, this is his own style of film making that made it even more special. This is a movie made for movie fans and I loved every second of it from start to finish."}, {"rating": "9", "text": "This is a Brilliant coming of age / teen romance movie lovers picture. It is clear from the outset that the film makers behind this are fans of Cinema and it is unabashedly displayed throughout this piece. from the stunning dialogue to the carefully constructed composition this picture has shot to the top of my list for this year. I can not recommend it more."}, {"rating": "7", "text": "\"Me and Earl\" is a very good movie, but not as great as the critics would have one believe. The beginning, especially, wanders over the teenage angst map, and I wondered if it was going to be worthwhile at all. As the movie progresses, and we learn about Olivia Cooke's cancer, it gets down to cases, and begins to show dramatic progress. It never really completely comes together as a story, but it is watchable. Knowing what we do now, I probably would have waited until it became available as streaming or DVD."}, {"rating": "8", "text": "Fine performances, an offbeat musical score, and Greg’s not-always-reliable narrative voice lift what might have been an ordinary weepie into indie heaven, as director, writer, and cast get it all right—or just about all right (the less positive reviews make some good points, but such worries did not intrude much on my enjoyment or appreciation of the film )."}, {"rating": "8", "text": "Me and Earl and the Dying Girl is a very well and uniquely directed movie by Alfonso Gomez-Rejon. We've seen some similar movies to this but this movie can find the balance and the right placement between the humor and the sad part of the story. This movie is equally well acted by the entire cast especially Thomas Mann who can play an awkward character realistically without me feeling awkward watching it.\rThis movie is also beautifully written by the author of the book which I think it's very important as he can tell very deeply about the main important character he created, Greg. I think it's interesting how He wrote Greg and Rachel as the realest characters in this movie and make others as these comical and not so serious supporting characters. I think it's important because this whole movie is supposed to tell how this dying girl can somehow change Greg's view in life. And we get to see all of that in a very deep personal way without getting distracted  by the supporting cast. I also love how this movie is wrapped up with such a clear and positive message."}, {"rating": "8", "text": "A funny, deeply affecting comedy-drama about the trials of growing up (and having to do so faster than expected). Despite the picture's YA protagonists, this is anything but YA fare, incisively written and with smart portrayals beyond the performers' years. The film takes viewers on an emotional rollercoaster ride through a series of highs and lows, all filled with wit and an array of clever, laugh-out-loud classic film references. Keep those hankies handy, too."}, {"rating": "8", "text": "A film that manages to rise above the average \"dying teen\" drama.\r This one kind of sucked me in. I sat down ready to see yet another \"cute teen with cancer\" story and really got swept up in this fairly odd suburban fantasy.\r While you will find all the John Green tropes that have proved so popular of late with the YA set, Alfonso Gomez-Rejon elevates the material with a practiced eye and a true understanding of the awkwardness of certain moments. The script is effortlessly clever and surprisingly funny.\r Prepare to give it all your attention for the 100 minutes required."}, {"rating": "10", "text": "Hipster came to mind while I watched this film. Then I reasoned: this is so unlike any other coming-of-age film. It's not necessarily hipster, it's just completely unique. Alejandro Gomez-Rejon crafted such a human film led by unlikeable characters. The actors made me see their complex characters through their raw performances. I love love loved the film. It's beautiful. Witty, too.\r I feel like I could watch this film endlessly and would still shed tears from sadness and laughter."}, {"rating": "10", "text": "This is one of the most underrated and best movies of this year. The movie is flawless. The plot was so simple and great. The casting was perfect and everyone gave their best performance. The characters were so relatable which makes the movie even more interesting . The movie teaches us so many lessons like girls and boys can still be friends , the friends you know may surprise you and more. The last act of the movie is the best last act I've seen this year. It will destroy you thoroughly emotionally. I can guarantee 90% people will cry at the end. The score was absolutely great. The cinematography was so good and unique from other Hollywood movies. The movie even has a great twisted sense of humour.\r In the end I recommend everyone to watch this movie as soon as possible."}, {"rating": "8", "text": "Who: Thomas Mann, Ron Swanson, New Frank Castle, and Superstar as Denise Kushner\rWhat: A similar high school experience to mine except my girlfriend wasn't dying, my chemistry teacher wasn't from The Walking Dead and my best friend was white\rWhere: The most entertaining place in the world to watch, but you would jump off of a bridge before you went back: High School\rWhen (Can I watch again): When you're on a date and you want something more serious than Date Night, or any Rom Com ever\rWhy: This is an original coming of age story that you truly shouldn't miss out on if you're a fan of Perks of Being a Wallflower or John Hughes"}, {"rating": "10", "text": "Beautifully told sorry. Script is amazing, not made in a mainstream way. Direction is great. The movie is definetly worth watching. This film will be something I will not forget."}, {"rating": "7", "text": "A movie about teenagers facing death of one of their own.  To see how they handled it emotionally was the crux of the movie and it was well done.  But the subplots left me wanting."}, {"rating": "7", "text": "A very cute sequel to The Fault in Our Stars, only without romance and lesser characters. Movie is very peculiar about one character only through out and at the end we get to know what goes on in Rachel's head. Which is most touching moment. While it is very neat and touching, I wished there were little more complexity and length."}, {"rating": "10", "text": "A tragic, beautiful, uplifting testament to youth, friendship, and maturity. Endlessly powerful and hilarious. The acting is fantastic and the writing is clever. See this movie now!"}, {"rating": "10", "text": "This is one of the most underrated and unknown arthouse dramas I have ever seen. This movie touched me in ways that I did not know movies could, and I love movies! The story nails highschool as I knew it in the 2000s decade, and I really related to all of the characters. I don't want to say too much about this movie, but this is honestly one of the best movies I have ever seen, and if you are a serious film lover, don't look up too much about this movie, just watch it blind, and you will be blown away."}, {"rating": "8", "text": "As creative and original as it is moving and funny.  Me and Earl and the Dying Girl brings clarity and humor to a time and situation that are confusing and humorless."}, {"rating": "3", "text": "Though I hate to limit myself, regarding genres of movies, after last week’s “Dope” and this week’s “Me And Earl And The Dying Girl” (from here on refereed to as “Earl”) each about 3 nerdy/geek kids and each, seemingly, critic’s darlings, I think I will add teenage movies about nerds to my list with westerns, horror, violent, raunchy boy/man, comic strip and most sci-fi pictures I will avoid seeing. (Hey, I am looking forward to “Magic Mike XXL” next week, what can I tell you?)\r In the case of “Earl” and “Dope” I think there is definitely a very wide generation gap. The last time I saw my teens was 60 years ago and though I enjoyed “The Fault Is In Our Stars” last year it was more of a drama than teenage angst. There is some humor in “Earl” regarding the movies that Earl (RJ Cyler) and Geg (the ‘Me’-- Thomas Mann) make redoing classics, especially the titles they give their films. Olivia Cooke is certainly endearing as ‘the dying girl, Rachel, while Greg grows up over the course of the film and Earl is a wise young man before his time.\r Molly Shannon as Rachel’s single mother and Connie Britton as Greg’s mother, both overbearing parents, along with Nick Offerman as his beatnik father---by the way Earl doesn’t have any parents and lives with his older brother who threatens Greg with telling him his dog will bite off his face--and Jon Bernthal as a teacher and, more or less, a guidance counselor to the boys, are sort of annoying adults you will find in most pictures about teenagers though the latter less than the others.\r “Earl” is being sold as a comedy, a sort of John Hughes movie with lessons to be learned. Greg is constantly reminding the audience--there is a lot of voice over-- that Rachel doesn’t die and there are screen titles telling the passing of time and where we are at in the story. As a social misfit Thomas Mann carries the film and RJ Cyer is his effective sidekick and shows his many sides. Olivia Cooke is endearing as the dying girl who has leukemia and is very instrumental is helping Greg grow up.\r The direction by Alfonso Gomez-Rejon is all over the place, somewhat like the movies the boys make, while the screenplay by Jesse Andrews, who wrote the best selling novel, is low key without trying to tell the audience how to feel. The director of photography shows off Pittsburgh, Pennsylvania, almost always in a glow of light, even in the night scenes.\r I laughed once and that was the boys film take-off of “Midnight Cowboy”  with the “Everybody’s Talking” theme song and, for a comedy, laughing once is not a good endorsement.\r I left the theatre wondering whatever happened to the girl who got stood up on prom night--maybe that’s the sequel?"}, {"rating": "7", "text": "Film script tries too hard.  It's not a bad film, but the first 35-40 minutes is a bit weak, and generally it falls flat.  The characters are cardboard cut-out, and they're written to be more interesting than they are, for instance it's unbelievable that lead had a perfect intricate social system in school as it pretty much falls apart the moment you try to depict it on screen. Earl is written as a stereotypical 'black guy' with no depth. Lots of inconsistencies in the film, such as being raised on foreign speciality foods, but insulting people eating foreign speciality foods, and Greg's personality in general.  In fact pretty much all the characters are unlikeable.  Rachel's the most likeable character, but of course she would be as a Manic Pixie Dream Girl.\r Anything that pays homage to classic films seems to be massively overhyped by critics, and any drama about cancer seems to get massively overhyped too in the same way Be Kind Rewind (2008) was overhyped 7 years ago and 50/50 was overhyped 4 years ago. So this film, focusing on both, seems to be getting far more attention than I believe it deserves.  Honestly I don't see this being any better than 2002's A Night To Remember.\r That being said the short films (or at least what we as an audience get to see of them) are pretty cool, and honestly I'd have preferred if that took more of a centrepiece of the movie for the first half, and the characters developed more fluidly, as the actual script and characters is bland."}, {"rating": "4", "text": "Earl” suffers from too muchitis. Voice over over kill and labeled scenes make dialogue redundant\ras we are told what to think and even what not to think! Twice! So we shut off our brains become\rless engaged and emotionally disconnected for the first 100 minutes. All this drowns in Ryan Murphyistic stylization- who knows how to balance it with crazy plot and even crazier characters. Casting also hits and misses - Earl and Me good- but the dying girl has been doing a nice job for the past two seasons dying on the TV series Bates Motel while being the object of an outcast teen’s fixation. Sound familiar? And when the moment we’ve been waiting for finally comes- the impact is quickly dissipated - by more voice over from here and beyond. It is the best of films. It is the worst of films."}, {"rating": "7", "text": "Unlike \"The Fault in Our Stars,\" which approaches teen cancer as a romance, this film goes for a quirky approach. Thomas Mann plays a high school senior, pressured by his mother to spend time with a classmate (Olivia Cooke) who has leukemia. He and his best friend (RJ Cyler) also make parodies of great films, a subplot that provides some witty cinema in-jokes (stay thru the credits for a complete list of titles). The film's eccentric humor is often clever and fun, although it sometimes try too hard. Once the story hits rocky ground, things quickly fall into emotional drama. Director Alfonso Gomez-Rejon has peppered the proceedings with witty angles (literally and figuratively) that add to the movie's oddball charms."}, {"rating": "5", "text": "As this year's Sundance darling, I anticipated a much more meaningful look at adolescence and cancer. Instead, we're left with this bland cancer dramedy which uses the subject matter less effectively than last year's FAULT IN OUR STARS. The undertones of Wes Anderson and John Hughes are pleasant - but the film is missing the heart which those films typically depict."}, {"rating": "8", "text": "Funny, heartwarming, touching, and heart wrenching, Me & Earl & the Dying Girl features hopefully breakout performances from new stars in Thomas Mann, Olivia Cooke, and Ronald Cyler II. In addition, the direction from sophomore director Alfonso Gomez-Rejon is gentle and he is comfortable taking a backseat to his young stars here and letting them go, which is perfect. An honest look at both high school, friendships, and death, Me & Earl & the Dying Girl is funny from beginning to end and guaranteed to make you fight back tears (a fight you will more than likely lose). The film is also a film nerds wet dream with so many references and mentions of classic films that the film itself is as much as an homage to classic films as the amateur films made by the characters. Though there are better coming of age dramedies out there, Me & Earl & the Dying Girl is certainly one of the better ones I have seen thanks to great acting, directing, writing, and a heartfelt story that feels so relatable it almost hurts. It is hard to imagine this one not winding up as one of my favorite films of 2015."}, {"rating": "9", "text": "A beautiful coming of age film with outstanding performances across the board. A fantastic script and excellent directing make \"Me and Earl and the Dying Girl\" one of the best movies of the year."}, {"rating": "6", "text": "A very well done little film where all the actors do a good job. However I have to say I expected a little bit more. Towards the end there´s kind of a twist that I didn´t see coming, which should be good, but I couldn´t really enjoy it. The tone of the film is too sad overall with no special moments to compensate it."}, {"rating": "9", "text": "A poignant, funny, moving, unique, and expertly created movie.  It does occasionally cover some well tread ground but its wit, quirky style, and unbridled emotion overwhelm any complaints. To call the characters 3-dimensional is an understatement, and the performances are all just about perfect. It's without a doubt a movie everyone should watch. One of my favorite of the year so far without a doubt."}, {"rating": "9", "text": "Another cancer themed movie which at first I wasn't sure about. but I watched it and it gave me a whole The Fault In Our Stars vibe. However, this is basically not a romance and more about friendship. Just be careful, cause you're opting for around 20 minutes of non-stop sobbing. Me & Earl & the Dying Girl is a unique film in its own way, pushing all the cliches aside. The first 30 minutes may fall a bit flat but after that it gets better and better."}, {"rating": "9", "text": "\"Me And Earl And The Dying Girl\" is a revaluation. Similar to \"The Fault in Our Stars\" or \"50/50\" but without the romance. We see this movie a ton of times: boy meets girl or vice versa, turns out girl or boy has cancer and is dying, they fall in love and one of them dies. Like i said, we've been down this road a couple times but this film was incredibly different, its a film about friendship in the face of loss and death and how you can make an impact on the lives with even the bleakest of outcomes. I loved this movie"}, {"rating": "6", "text": "I think that Me and Earl and the Dying Girl is a good movie.. I just didn't like it. I found the performances in the movie fairly dry to start out with but they did get a lot better as the film went on. I also felt like a film with heavy emotional plot like this would have more character development, sure the characters were complex but by the end of the film I still didn't really feel like I knew them. I think this is more of a hipster film and I'm sure there are going to be many people who find something they like about this movie I just wasn't satisfied. I really found several of the jokes kind of lame as well. I like the avoidance of clichés in this film which is difficult with teen cancer film, but I'd take 50/50 over this movie any day, but that's just my opinion."}, {"rating": "6", "text": "\"Me and Earl...\" is an earnest effort, and an admirable one, but it's never as witty or subversive as it thinks it is, coming across more as a self-conscious and uneven effort to mesh the populist appeal of \"The Fault in Our Stars\" with the quirky sensibilities of \"Juno\" rather than something truly unique. As a result, it can never find the right line between comedy and pathos and cannot handle either with particular consistency or efficacy. Some of it is funny and some of it is moving. Most of it is too uneven to truly be either. There is too much promise to write this off completely - the acting is very, very good and the finale is handled with such incredible delicacy and grace you can scarcely believe it's from the same film. But all in all it's a muddled affair that cannot reconcile its eccentricities with its emotions."}, {"rating": "9", "text": "Dentre todas as coisas do longa, o roteiro se destaca. O humor sarcástico do filme nos ajuda a contar uma história amarga que tem como objetivo nos lembrar o tempo inteiro que o longa não é só mais um clichê de adolescentes com câncer. A direção do filme é louvável , e usa aspectos dos curtas criados por Greg para ajudar a contar a história, com metalinguagens e cheio de referencias, Me and Earl and the Dying Girl é uma experiencia nova, utilizando coisas que já conhecemos de uma forma totalmente original e brincando com todo e qualquer tipo de esteriótipo de forma despretensiosa."}, {"rating": "8", "text": "Me Earl and the Dying girl is a movie best described as both Charming and Tragic. it has a really good cast and an excellent screenplay by the books author. I don't believe it will be for everyone and that's mainly down to the fact that a lot of people will have seen this kind of plot and it won't offer too many suprises but I really enjoyed it"}, {"rating": "10", "text": "This movie is a highly original masterpiece, following in the contradictory footprints of normal \"rom-coms\" that you can predict the ending from the first second of the movie! Incredible performances, dark humor and quirky moments makes this film awesome. You will cry like a **** at the end. BEWARE!"}, {"rating": "5", "text": "I was expecting much more from Me and Earl and the Dying Girl than what I got. Sure, some parts of it were super entertaining, sad, and great, but the other scenes were just boring and useless to the film."}, {"rating": "9", "text": "Biggest surprise of the year for me. Compare this with the Fault in our Stars and you can clearly see why this one succeeds. The direction and cinematography is 10/10. It has an artistic flair that doesn't make this a simple adaption of the book. Very well paced, characters are developed perfectly (although it would have been nice to see more earl). Best young adult film in years."}, {"rating": "9", "text": "One of my favorites..................................................................................................................................."}, {"rating": "8", "text": "Me and Earl and the Dying Girl is hilarious, and touching. All of the charters are likeable even the main charter who kind of a dick. The ending is amazing if this would be any other movie the ending would be cheesy and lame but the ending is touching and sad. Racheal dies in the when Greg shows her the film he made for her."}, {"rating": "5", "text": "Alright, my expecttations for this one were very high, so I unfortunately was a little disappointed.  The actors are all great (what a cast!), but the direction for this film was just off.  The director seems much more concerned with his shots and the cinematography than what is actually happening with the story or the characters.  I really didn't connect with it (despite some touching work by the kids and Connie Britton) - they just tried way too hard to make it an art house film when that isn't what this story is."}, {"rating": "8", "text": "One of the most moving, emotional movies I've ever watched. The humor is quirky and dark, and adds to the tone of the movie. I felt extremely depressed by the movie's dark, sad, original conclusion. Go watch it. I can't really explain what makes this movie great."}, {"rating": "7", "text": "This is a comedy drama film which covers themes including death, friendship, humiliation and awkwardness. This is a comedy, a quirky comedy but its very much a cringe-enducing form of comedy - a sort of dark comedy very much about social awkwardness, the pitfalls of being less than the all popular guy at the end of high school, i.e. secondary school. There isn't a laughter track or anything like that. It features narration, which is done very much in a blase, whatever, lets just explain this and then I'll move on and get out of your way, kind of a way. It has the feel of an indie cult classic, although I don't honestly remember when I first heard about it but I did enjoy it.Greg has an interesting hobby, which is making parodies of classic films with who he calls his co-worker Earl, rather than a friend. These are obviously done on a much, much lower budget and we're shown a number of covers for said films, which have quite funny word pun type titles, such as 'Rosemary Baby Carrots', 'Brew Velvet' and 'A Sockwork Orange'. I found the clips of said film parodies quite amusing and endearing to an extent - their made via puppet/stop motion animation styles, think papier mache props and the like.I felt sorry for Greg, as I can fairly easily remember what its like to feel like an awkward outsider at school, as he's clearly shown to be. It is quite a quirky film and it reminded me a bit of Napolean Dynamite, although the main character isn't as comic and doesn't stand out in the way that the titular character of that film did.Cast wise, Greg is played by Thomas Mann. He seems pretty much like a regular joe American mid teen. He comes across as relatively apathetic - I'm not sure how else I could describe him. Meanwhile, Earl is played by RJ Cyler, Olivia Cooke plays said dying girl Rachel and Molly Shannon plays Denise.I liked the way the film comes across, with numerous new scenes starting with text across the screen saying the name of that new scene, basically saying what Greg was thinking at that time, such as 'the time Rachel had just started treatment', 'the time I felt so awkward I just had to say something' (as if that only ever happens once, eh?). Content wise, the film features mild sex references and partial nudity. There are instances of mild violence but nothing gorey or graphic is shown as such. There is some swearing and drug reference are also made but otherwise there's little likely to offend people, although obviously the story and themes are pretty sobering and sad. The film has been given a 12 rating due to this.I think it says something about inevitability - its quite a sobering thought. Its definitely (inevitably) not a laugh out loud hilarious type of a film but I did find some parts amusing, although I accept it won't appeal to everyone. I wouldn't say its entirely a drama film, there is a fair amount of quirkiness present - its a bit hard to describe, other than a quirky indie comedy/drama film.Some of the music played was surprisingly distinctive.Tracks featured include In Dreams by Roy Orbison, Trouble by Cat Stevens and I'll Come Running by Brian Eno. Some well known classical pieces played include the Ride of the Valkyries and a few piano pieces which I have no idea what their called.I'd recommend this film, as I found it to be an amusing, quirky, somewhat thought provoking film, one which I imagine quite a few people could relate to. Its an interesting watch, so I'd recommend it on that basis."}, {"rating": "8", "text": "Really a brilliant movie characters were very realistic and we're portrayed beautifully there is no cheesy romantic side to this film which I really like , cause in the end that's not what always happens .Olivia cooke , Thomas mann and rj cyler were brilliant this is a must watch very realistic teen movie that every teenager should check out"}, {"rating": "8", "text": "Walks a fine line between poignant and chessy, and on the whole it stays on the right side.A touching movie, with just the right amount of humour."}], "recommendations": ["the_edge_of_seventeen", "moonrise_kingdom", "eddie_the_eagle", "10_things_i_hate_about_you", "the_spectacular_now", "the_fault_in_our_stars", "instant_family", "lady_bird", "the_perks_of_being_a_wallflower", "the_upside", "the_big_sick", "booksmart", "paddington_2", "the_king_of_staten_island", "me_before_you", "groundhog_day", "the_intern", "the_royal_tenenbaums", "eternal_sunshine_of_the_spotless_mind", "silver_linings_playbook", "little_miss_sunshine", "christopher_robin", "hugo", "palm_springs", "jojo_rabbit"]}