{
  "id": 381,
  "title": "Me Before You",
  "starring": [
    "Emilia Clarke",
    "Sam Claflin"
  ],
  "runtime": 110,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/Ia3dzj5LnCj1ZBdlVeJrbKJQxG.jpg",
  "categories": {
    "plot": 5.852459016393443,
    "acting": 6.208333333333333,
    "ending": 5.666666666666667,
    "soundtrack": 5.555555555555555,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 6.545454545454546,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "6",
      "text": "This film is well shot and looks great the story is just okay though.  Emilia Clarke and Sam Claflin both give great performances and show strong chemistry.  The film is very standard though with not much making it unique. B-"
    },
    {
      "rating": "6",
      "text": "It's always said that the best love stories are either the ones that are forbidden, or the ones that have a couple who may never stand a chance together. 'Me Before You' is an adaptation of the 2012 novel written by Jojo Moyes, it focuses on a woman in her mid-20s named Louisa Clark (Emilia Clarke of 'Game of Thrones'), who has been laid off a cafe that she worked at for six years. She becomes eager to find a new job fast in order to earn money for her family. She ends up finding work as a caretaker for a paralyzed man named Will Traynor (Sam Claflin), who was left unable to use the rest of his body after an accident of being run over by a motorcycle two years before. Louisa tries her best to bring some sense of joy into Will, who is cold and cynical since he became paralyzed. She tries a number of different things to lift his spirits, but for a while, nothing seems to work. It also seems that Louisa is putting her work before her boyfriend, Patrick (Matthew Lewis), who becomes frustrated when she cannot find the time and effort for him, and is spending more time with another man whom she's only known for a few months. She becomes tired of Patrick's jealousy and he becomes tired of her inattentive behavior. Louisa also learns the harsh truth about Will, she decides to take him abroad on holidays and making him realize that just because he is paralyzed, there is no stopping him. They end up falling in love. 'Me Before You' is a well-made romantic drama, and Clarke and Claflin do share some terrific chemistry that should hook even the most cold-hearted movie-goer. But, underneath all that drama, and all those emotions lie a very paint-by-numbers and cliched love story that we have seen time and time again. It reminded me of a French movie called 'The Intouchables' (2012), or \"Untouchable\" as it is called in some countries. That movie worked because, well, it wasn't necessarily a love story, but we got beneath the characters there. Here, you just have a typical, happy-go-lucky girl taking care of a devil-may-care, crippled man. I admired the characters for a while, but once I knew where the plot was going, the spark fizzled out. I'm sure even those who haven't read Jojo Moyes' book, and has seen every romantic drama ever, will know how the movie will start and end. Good effort for the most part, but utterly predictable and not quite as special."
    },
    {
      "rating": "6",
      "text": "Moyes & Sharrock Expel Romanticism In A Hard-Hitting Love Story\r Big expectations waited of the best-selling book adaptation of Jojo Moyes on the big screen, attributing it the label of dramatic film of the date, after the emotional \"The Fault in Our Stars\" broke hearts around the world; surely, you will require a box of tissues, nevertheless, the film does not provoke enough tears for utilize more than one. The romantic film goes through a fatiguing period, tired of the renowned \"clichés\" of the genre; implausible is find feature romance films like the stories written by the talented Nicholas Sparks - \" The Choice \", his last invention does not achieved good receptions -, apparently, this film genre will be condemned to the adaptations or reboots of Hollywood, nevertheless, occasionally, small underutilized gems come to light.\r Emilia Clarke - Yes, the blonde girl of \"Game of Thrones\" and Sarah Connor of the massacred \"Terminator Genisys\" last year - plays Louisa \"Lou\" Clark, a eccentric young lady, who lives with her working-class parents. Lou loses her job in the coffee shop of the village, which puts her in a delicate matter, lack of money. Her only employment oportunity is to be caretaker of a 30-year-old man suffering paralysis of the shoulders down - owing to a motorcycle accident -, that handsome man with sense of black humor, sarcastic attitude, million euro in his bank account, hardened heart, and possessor of a perfect smile is Will Traynor (Sam Claflin has acuity to make to cry ( remember to Finnick Odair of \"The Hunger games\"). With a black and white striped coat, dresses with butterflies and vegetables, psychedelic heels and other strangenesses of the fashion, Lou invades in the life of Will to superficially transform his thoughts, thoughts decided to practice his assisted suicide at a clinic in Switzerland. Striking, cloying and sentimental plot, dispenser of laughs, tears and doctrines do not focused.\r \"Me Before You\" does not get away of the habitual absurdities of a romance novel, perfect for lovers of the genre, but tedious and repetitive for the general public. Despite the exhausted use of romantic elements, Moyes, Neustadter and Weber know to place and represent every triviality  harmoniously, the first kiss, Clark shaving to Will, a powerful storm behind the female lead role and even avoid some recurrences to innovate with own circumstances and phrases (Bumblebee Tights). Repeatedly, we have seen impossible loves owing the difference of social classes, and although the difference of status is present, the film is focused in another type of differences. The script fulfills the demands of any woman in love with chocolate and popcorn, nevertheless, objectively, it violates the real context with impossibilities and events of tales of fairy, hiding the suffering with the beauty, the reality with pink unicorns e hippopotamus, and until certain point is refreshing and requested for the genre, nevertheless, it is its sensitive subject in the ending, which be really affected by the strategy , and therefore, it affects the film in general.\r Thea Sharrock - writer and film and English theater director - follows the story of the book to the letter, neglecting necessary and original ideas. Who do you wish to listen to Ed Sheeran, while you are on the verge of tears? Pop music atmosphere is profound and even memorable (Not Today by Imagine Dragons), unfortunately, these are located in incorrect times, destabilising the balance and the process of the scene. Furthermore of its youthful soundtrack, the performances hold firm progress of the story, Clarke does not exaggerate her character, and if she does, it has satisfactory effects and thanks to her beautiful and infectious laughter, development gets a decent progress. Caflin is a bit more discreet and without Clarke as Lou, it would have been a matter of seconds. Nevertheless, it is the swift development of a controversial issue which absorbs the negative criticisms. In the plot, Will is decided to die with dignity, (Spoiler: and he did it), the film portrays the life of disabled people as \"different\" and in certain part it is, nevertheless, the lightness with that they deal the ending is as necessary as negative. Necessary, because they do not turn to the romantic drama of the path towards death, but negative, because they insinuates that the days of a disabled person are useless and the best solution is suicide. \"Me Before You\" has the function of telling a love story, the film did not want to meddle in dangerous waters, but, unfortunately, it did it.\r \"Me Before You\" benefits from the chemistry of its protagonists, the idealized environments and some lines worthy of Spark, but the futility of euthanasia in the film, destroys the built and paves the way for finding some errors more. With the quality of the romance films of today, \"Me Before You\" is a tempting and sentimental proposal, full of corny-romanticism, teaching rewarding lessons as go on, live each moment and question the unexpected turnaround of life."
    },
    {
      "rating": "6",
      "text": "\"Me Before You\" is an amazing adaptation, because I expected something poignant and dramatic, but I carry, most comic moments, but the end turned purposes cried at the end, Emilia Clarke and Sam Claflin, were very good personifying their characters in the book."
    },
    {
      "rating": "6",
      "text": "A film with an interesting plot; eye-catching photography; nice interpretations and an acceptable story-telling, mixed with a predicable end, a very simple direction, not colored enough landscapes, suspense-free and a dull beginning."
    },
    {
      "rating": "5",
      "text": "Me Before You nails every tragic love story trope to a T. I loved the cliches too much too hate it! It's definitely a funny film to watch with friends, even if the plot, cinematography, and awful soundtrack are completely uninspired."
    },
    {
      "rating": "5",
      "text": "Before I start the review, there are two things that I should note. First, I'm a male. Second, I never read the book that this is based on. Now that that's settled, let's move on.\r Me Before You is half good and half bad. The good is that there are many hilarious moments in the film and great cinematography. This gives off a warm and cheerful feeling. The acting performances are also above par. The story itself is unique as it talks about disability and controversial life decisions. It's certainly better than a lot of other romance movies.\r Here's the bad. First off, while the story is unique, the way the story is told is in the most cliched manner possible. The characters are all stereotypes- cheerful and perfect main character, grumpy rich dude, and goofy douchebag boyfriend. This makes it hard to relate to the characters. The ending is also predictable and many story elements are contrived. This also is super melodramatic as the music and backgrounds force the viewer to cry. Not to mention that the film lacks the intelligence to fully explore the subject of disability and life choices.\r Overall, Me Before You has its goods and bads. I should note that while I didn't cry at all, 95% of the mostly female audience did. I'm just not the target for this kind of film. In the end, Me Before You is just mediocre."
    },
    {
      "rating": "5",
      "text": "For a romance movie this was... okay. Not too stupid, not too unrealistically frustrating, it was colorful and funny at times. However, it still stands as a cliché romance ''chick flick''. It may just not be for me, but I felt like I have seen movies like this a thousand times before."
    },
    {
      "rating": "1",
      "text": "Although heroes don't have to be strong people with extraordinary abilities and normal people can also make stories, showing weak people and mixing it with romantic/heroic music and theme is disturbing and also can make a not-so-good effect on young watchers.\rWe see a girl who doesn't have characteristic borders, she enters a disrespectful job just for money, gets stock there and doesn't even feel sorry for ending her seven years old relationship with her loving boyfriend.\rI should also mention weak acting, specially by Emilia Clarke. The whole movie, including the plot, acting, etc, just looked so fake and unreal. I name it a failed Chick Flick."
    },
    {
      "rating": "5",
      "text": "What I deeply dislike in this movie - and I find quite insulting - is the very shallow message that life is worth living just because you are rich, you are a financial shark, and like extreme sports."
    },
    {
      "rating": "10",
      "text": "Exceptional! The film manages to touch us with its intense history, humorous and at the same time sad. It makes us cry, sending us a love story unimaginable, naive and beautiful. Applauding the protagonists and the whole team that brought us this brilliant work! Thank you very much. I'll watch often."
    },
    {
      "rating": "10",
      "text": "Flawless masterpeice. This movie was the best movie I have watched in a while! I may not be a fan of Drama and Romance, but when I saw the movie, I was not disappointed, and I am sure you will not be dissappointed either! The soundtrack and story were amazing and it was beutifullly paced.  Definitely worth seeing!"
    },
    {
      "rating": "8",
      "text": "This is an excellent film coming from the point of view of a young disabled person, I found the film extremely moving and although it is based on a sensitive topic, it is good to see some more mainstream coverage of this topic within the media. I only wish that the film was given more publicity as it presents a very real set of circumstances which some disabled people face and I think this film is not just for entertainment purposes but to also make people more aware of disability and romance, in addition I hope that there are more films like this in the future which cover a similar topic or situation. I felt that I was able to relate to the film. Despite my overall positive reception of the film I am a little disappointed by some aspects of the film for instance some aspects are a poor representation of real life and its a little frustrating to see this inaccuracy in the way it is presented. I was particularly annoyed with how it presented this attractive young woman falling in love with a disabled man in such a way that almost made it feel as if it was out of pity than anything else, and if it was a representation of real love then unfortunately, in reality the chances of an attractive young woman falling in love with a disabled man are very slim because sadly many people are too shallow. However, I digress. Overall it was a great film."
    },
    {
      "rating": "10",
      "text": "Incredible movie, heart-breaking plot, superb acting performances and beautiful songs (Not Today, Unsteady, Photograph and Don't Forget About Me are my fav). Emilia and Sam portray the characters and their unique personalities excellently. Romantic is not my favourite genre but Me Before You is such a fantastic movie"
    },
    {
      "rating": "7",
      "text": "A good, solid romantic comedy that doesn't pander all that much - doesn't take the easy ways out through the script. Mother of Dragons is great in it, as is the male lead.  This is one of those critics-be-damned sort of movies.  If you think this is your cup of tea, go with it - you'll probably love it."
    },
    {
      "rating": "9",
      "text": "beautiful and funny, with a amazing soundtrack with songs how; photograph, thinking out loud and don't forget about me... but not is perfect, even yes so beautiful"
    },
    {
      "rating": "5",
      "text": "The film is thought to be an inspiring love story revolving around a caretaker trying to motivate a disabled to begin a brand whole new chapter of life but sadly it turns out to be the other way round. Focusing more than half of the running time in glib romance, there are some funny moments between the main characters that are enjoyable but the development of the plot has wasted several important thought provoking themes - controversy of the suffering between the disabled and the people around, struggle to live and find courage to regain confidence with physical impairment, sensitive subject on committing suicide and self willingness to survive as well as care, support and inspiration from a true love. Both Emilia Clarke and Sam Claflin deliver their performance well while the choices of songs are pretty beautiful including the powerful scores composed by Craig Armstrong yet all these are unable to compensate the poor character and relationship developments. Perhaps the story should have reorganized by adding on more depth into the sufferings of the handicap, further converting into some positive inspirations rather than just steamrolling the value of life."
    },
    {
      "rating": "0",
      "text": "I have watched two films about quadriplegia this week.\rThe Theory of Everything is the brilliant real-life account of Stephen Hawkings and his incredible first wife, through their struggle and hardship of the onset of his illness, through to their divorce - magnificently directed and acted, and portrayed with real dignity and worth. It teaches you something about human existence and strength.\rThe other, Me before You, is a fictional romantic comedy idealisation of suffering with cringe-worthy acting, poor direction, glib soundtrack choices and offensively on-the-nose dialogue. It is also, incidentally, about euthanasia. But not in a serious way. That would be too correct and not fun.\rI found the former utterly rewarding and a delight, and the latter utterly offensive. As someone who has had a serious illness, and with at least two years where I seriously did not wish to exist, I can see how in the absence of potential for recovery and with the presence of great pain and infirmity, euthanasia might become a viable option. There is a serious film to be made about such things. It should be well-acted, with greater insight, directorship, and dignity. It should be on-the-nose in the right way. Maybe such a film already exists, I am not any sort of film buff.\rBut what it should not be, ever, is a whimsical sexual fantasy for working-class females."
    },
    {
      "rating": "5",
      "text": "Me Before You is another film that leaves me with mixed feelings.  While it is a cheesy romance story that I am not the target audience for, I at least gave it a good go and I thought it was doing an alright job up until it bought in the euthanasia sub plot that felt incredibly out of place and whilst admirable to try and put in the ‘right to die message’ it didn’t feel like it was handled well and I have to agree with Film Brain’s review of it, like 7 Pounds it does send out an alarming message by the end of the film, which, despite the fact that I believe people should have the right to die when they choose, I wasn’t sure that this film quite got it right."
    },
    {
      "rating": "5",
      "text": "The cast is okay, the adaptation is fine. There is noting to hate about this film, but there is nothing to love about it. Me Before You is a 110 minutes long unsurprising, non-offensive teenage dream without worrying about being too humiliated, just slightly embarrassing."
    },
    {
      "rating": "0",
      "text": "He kills himself and she goes and spends a bunch of money in Paris.... The End............................................................................................................................................................"
    },
    {
      "rating": "7",
      "text": "If you're familiar with Emilia Clarke from \"Game of Thrones\" (she's the blonde Khaleesi, Mother of Dragons) you'll be surprised by this dramatically different performance. Her character is an extremely cheerful, slightly kooky woman with a delightful fashion sense. She's hired as caretaker/companion for a handsome man who's confined to a wheelchair (Sam Claflin). He's pretty much given up on life until her smiling charms cheer him up. But keep your hankies ready, ladies, cause the outcome is not what you'd expect. This pretty much follows the \"weepie\" formula with prominent music that contributes to the romantic mood (of course, it includes Adele). Even with it's familiar structure, the winning performances by the two leads and the upbeat writing make this a sweetly charming chick flick."
    },
    {
      "rating": "5",
      "text": "Although the movie isn't that bad, if you read the book first, you realize how much the movie left out. If the movie had followed the book exactly, it would be much more enjoyable."
    },
    {
      "rating": "1",
      "text": "This film is dreadful. I know it is not real life but the amount of inaccuracies made it unbearable to watch. The characters were all complete cliches and stereotypes. The acting of Emilia Clarke was like Rene Zellweger as Bridget jones x 1000. So over the top klutzy and cutesie. It was ridiculous that the character is described as 'working class Cornish' but has an accent that the Queen of England would be proud of. It is also far fetched that someone working in a failing Cornish cafe on the minimum wage (and we woudl rarely tip in such a place in the UK) was supporting a family of 4 plus her sister's baby. Her gurning and eyebrows were very distracting and I couldnt take anything she said seriously. I didnt 'buy' for one minute that Will had any romantic interest in her and it came across that she had just become a good friend. I kept expecting something exciting to happen, but it never did and the whole film ended on a predictable whimper. In fact I have just realised that the whole film is like what Americans believe we live like in Britain, but that .5% of the population do. It was just schmaltzy cliches from beginning to end. Why did she get teh job at the interview? She had no experience and answered the questions with stupid answers? Who on earth were the other candidates, apparently there were some. I dread to think. I think from that moment of complete ludicrousness I guessed correctly this film would be just a crazy mess that made no sense but played a few nice, if not depressing, songs. Did it make me cry? No."
    },
    {
      "rating": "0",
      "text": "A wel-intentioned and competently shot movie, with a heartwarming love story at its core. But the mediocre writing and the awkward overacting really didn't do it for me. The very generic character arcs and overused plot line didn't help either. It looked and sounded good, but the actual content was really lackluster. I would only recommend it to people that need their cheesy love story fix."
    },
    {
      "rating": "5",
      "text": "Me Before You is a cheesy experience for those who have already tried movies worth loving and remembering because that's what drama is really about. Spend a ticket or not."
    },
    {
      "rating": "2",
      "text": "I HATED this movie! The truth is, I don't want to do too much homework before seeing a movie. I just read the short plot and watched the trailer. And, taking count of the title, I thought it would be a romantic movie (not romantic comedy, just romance) and maybe with a liiittle bit of drama because of the situation. I've read that there is a book and the movie was based on it. Well, I think that whoever had the idea of turning that book into a movie, had no clue what people need! It was \"The Fault In Our Stars\" all over. People don't need these kinds of movies. They will watch them once and that's all. They will NEVER want to destroy their days watching it twice. A movie does not need to make people laugh, just to make them feel good and even optimistic sometimes. The point that he helped her start her life at last did not interest me at all when, on the other side, they show a young man that has EVERYTHING (most people are not as comfortable as he was) giving up his life. When you give an example like this, how can you try to inspire people with the girl's story?"
    },
    {
      "rating": "0",
      "text": "I really wanted to like this movie, but the writing and acting kept letting me down. Emilia Clarke's performance was consistently irritating, being excessively excited and overplaying every emotion. She's a terrible actress. Sam Claflin's performance, on the other hand, could have been this movie's saving grace if it wasn't for the silly screenwriting which was lacking in humor, creativity and maturity. Save two precious hours of your life. Don't watch this movie."
    },
    {
      "rating": "7",
      "text": "Changing one's fixed mind is not an easy task.\r Based on the novel of the same name, directed by a new lady filmmaker. This British film has two young sensation Sam Claflin and Emilia Clarke in the important roles. The story of a young man who was paralysed recently meets his new caretaker. Initially they both won't fit for each other, but after some time everything changes when they together do some outdoor activities. While the film progress, it only gets more emotional. Besides, it's fun watching the first two acts, particularly the performances from both the lead strikes strongly.\r After a very long time I watched a good tearjerker, but not that strong. It is a simple story, there's no big adventure or romance in it. That's right, it is not a romance film and if you decide to watch expecting one, you will be definitely disappointed. Also slightly it delivers a bad message like the negativity for being one seriously ill and alive. This issue is only on the humanity ground, but afterall everyone entitled to do what they want, because it's their life.\r Anyway, the film avoids the usual cliché. Like there's no scene that you had seen in other similar theme repeats here. Deliberately avoided to make it a fresh piece. Basically, if you observe closely the both two lead characters, they had a different agenda about their life. Particularly the caretaker never ever tried anything seriously to accomplish her undertaking.\r On the other hand, those parts were very realistic, but still gives us a cinematic experience due to the fancy screen presentation. Surely a good watch, I think everyone should watch it, because there's no drugs, sexes or nudes or even the strong kissing scenes. Only the main theme is something disturbing, particularly for the tender-hearted people. Other than that, I hope you watch it if you haven't yet.\r 7/10"
    },
    {
      "rating": "8",
      "text": "I feel like this was the best way to turn this story into a film. And with Emilia Clarke's energy it's all pretty much perfected, even though there are few moments that came out a bit rushed or forced. But it didn't affect my experience at all with this movie. Definitely recommended if you like these types of movies!"
    },
    {
      "rating": "9",
      "text": "Me Before You is a romantic drama film directed by Thea Sharrock based on the novel by Jojo Moyes with the same name. The film stars Emilia Clarke, Sam Claflin, Jenna Coleman, Charles Dance, Matthew Lewis, Ben Lloyd-Hughes and Janet McTeer.\rThe movie is about a girl named Lou Clark who is desperate for a job and so the goes on to take care of a recently paralyzed man from a rich family, who she slowly creates a bond with.\rThis is a well made movie with amazing performances all around, especially by the amazing Emilia Clarke who gives a wonderful performance on the leading role. By her side is Sam Claflin who plays Will Traynor, and he does a very good job too.\rIt is a movie filled with heart breaking emotional scenes, very good cinematography and a brilliant score by Craig Armstrong that makes Me Before You as a whole one of the best romances there are. Sure it has some problems, and the ending will leave some people confused and angry but overall this movie works on so many levels that those flaws are hardly even noticeable as the good outweighs the bad by a lot."
    },
    {
      "rating": "10",
      "text": "Es bellísima, está cargada de una nobleza y un amor puro y verdadero realmente conmovedores, destacó la actuación de Emilia Clarke, la cual transmite muchísimo sentimiento."
    },
    {
      "rating": "10",
      "text": "I watched it yesterday night and literally bawled my eyes off! I loved the book and the movie gave it his well deserved justice! I'm only sad that they cut out a good part of Lou's story (due to time, I guess), but I'm still pretty satisfied (some quotes from the movie were actual lines from the book and I cried lolz). Emilia and Sam gave an AMAZING performance, they left me speechless and they made me cry the whole time. Emilia IS Lou Clark and Sam IS Will Traynor! I had imagined Nathan WAAAY DIFFERENT, but I liked him too. And Matthew also! He gave some justice to Pat (whom I hated in the books lol). Just, go and see it! You won't regret it! And read the book, too!"
    },
    {
      "rating": "7",
      "text": "-Me Before You is a 2016 American-British romantic drama film directed by Thea Sharrock and adapted by Jojo Moyes from her 2012 novel of the same name. The film stars Emilia Clarke, Sam Claflin, Jenna Coleman, Charles Dance, Matthew Lewis, Ben Lloyd-Hughes and Janet McTeer. The film was released on June 3, 2016 in the United States, received mixed reviews and has grossed over $72 million.\r --Critical response:\r -Me Before You has received mixed reviews from critics. On Rotten Tomatoes the film has a rating of 57%, based on 118 reviews, with an average rating is 5.6/10. The site's critical consensus reads, \"Me Before You benefits from Emilia Clarke and Sam Claflin's alluring chemistry, although it isn't enough to compensate for its clumsy treatment of a sensitive subject.\" On Metacritic the film has a score of 51 out of 100, based on 36 critics, indicating \"mixed or average reviews\". On CinemaScore, audiences gave the film an average grade of \"A\" on an A+ to F scale.\r --Controversy:\r -The film has suffered a backlash from many people in the disabled community due to what they perceive as an underlying message that people with disabilities are a burden on their families and careers, and claim the film promotes the view that people are better off dead than disabled. They view the film as advocating suicide so that their loved ones can \"live boldly\". The #MeBeforeEuthanasia backlash has been led by celebrities with disabilities such as Liz Carr, Penny Pepper, and Cherylee Houston."
    },
    {
      "rating": "8",
      "text": "Me Before You takes and innovative new story and executes it beautifully. With a great cast and an interesting story I can say that I am very impressed. Emilia Clarke and Sam Claflin are convincing and had my eyes glued to the screen and created an emotional attachment between me and the characters making me truly show concern for the characters on screen. The story was brought straight to life! This was one of my favorite films this year. I would recommend that you give this movie a try, even I was doubtful from the start, but I can truly say that what you see will surprise you!"
    },
    {
      "rating": "9",
      "text": "I loved this film. From beginning to end, the story progressed naturally. None of the chemistry seemed force either. However, I do wish that the movie could explain Lou's chipper demeanor more so, and I wish that the movie explored how Will first dealt with the result of his accident, like months after, instead of just seeing two years after. Overall, if you love romantic dramas with two attractive leads with actual chemistry, then this movie is worth seeing."
    },
    {
      "rating": "8",
      "text": "If you want to watch a story about love, but in a way that make your tears come up - that is your movie.The story is simple. Rich guy with lost soul and a poor girl with a full hearth met and helps each other to find what was lost in their lives until now.Simple movie, but with a lot of drama. You will like it for sure!"
    },
    {
      "rating": "7",
      "text": "Game of Thrones ile yıldızını oldukça parlatan Emilia Clarke dizi oyunculuğuna devam etmeyip sinema sektörüne atılmak istediğini oldukça belirtiyor. Oyunculuğunu göstermek için bu güzel film teklifini kabul eden Emilia çok güzel bir oyunculuk sergiliyor ve ortaya eğlenceli ve güzel bir aşk filmi çıkıyor."
    },
    {
      "rating": "10",
      "text": "This movie was beautiful and heartbreaking. Emilia Clarke and Sam Claflin's chemistry was terrific and their acting was stupendous. This movie made me cry a lot. Definitely one of my favorite romance movies of all time. An A+ romance movie."
    },
    {
      "rating": "10",
      "text": "O filme além de ser incrível, é tocante parabéns a equipe que fez parte e ao elenco"
    },
    {
      "rating": "7",
      "text": "Okay so I actually dug this one. Is it wickedly cliche? Yes. Does Emilia Clarke have weird eyebrows and a smile that literally consumes her face? Yes. Yet, like a mozzarella stick with stringy cheese or a cake with a thick layer of frosting on top, Me Before You is so cheesy and sweet, it is irresistible. From beginning to end, it was the film equivalent of taking said mozzarella stick and seeing how far you could pull the cheese before it breaks.\r Starring Emilia Clarke as Louisa Clark, a lower class girl from England, Me Before You is a film billed as a romance, but for me, it almost came across as decidedly anti-love (or, at the very least, denying the power of love to a degree). The unsuspecting Louisa is hired to work as the hired to be the caretaker of Will Traynor (Sam Claflin), a now quadriplegic man who was once an active and vibrant young man. While he still may be that man, Will most certainly does not recognize this. For this element, Me Before You could often double as a harrowing look at how depression can consume you. From beginning to end, the audience is shown the life within Will. Louisa most certainly brings that life out of a him like a flowing river, in large part due to their delicious chemistry, but Will does not see this. Instead, he looks forlornly at his life before his accident and is often confronted with this element, whether it be through his ex-girlfriend, his constant bouts with pneumonia, or old photographs. Around every turn, he is reminded of who he was. It is this element that courted controversy as people deemed Me Before You to be stating that death is the only acceptable path for disabled people. This, to me, is misguided. Rather, the film is an exploration of the depression that took a hold of Will after his accident. We know he is still Will. Louisa knows it. His parents know it. Yet, Will cannot come to grips with this drastic life change. The end result is a film that showcases how love cannot overcome all. It is not the prescription drug that will fix every situation. Instead, one must love themselves when they look in the mirror. They must be okay with who they are, for all of their unique elements. Without this, nothing will break the hold of one's own mind.\r While Me Before You's romance may be quite cliche and its soundtrack lifted from every teenage girl's iTunes account (two Ed Sheeran songs, including new romance film staple, \"Thinking Out Loud\"), but its thematic elements regarding depression and self-acceptance are so deeply moving, I can easily look past its faults. It is an imperfect film with a spotty performance from Clarke in the lead role, as well as a pretty nondescript one from Chaflin who is good, but nothing incredible. The scenery is impeccable and most certainly capitalized upon with some stellar shots of the views. Additionally, Louisa's relationship with ex?-boyfriend Patrick (Matthew Lewis) does nothing to make the audience like her. Rather, she is cheating on him with Will. This poor characterization is a blight on the writing and only exacerbated by Clarke.\r Between cheating and incessant eyebrow movements, the film can easily become grating if it were not as tearjerkingly melodramatic as it is, which is fine since i love a good melodrama. Clarke and Chaflin have great chemistry, but the real quality of this film is in its exploration of this depressed man's last days and the realization that love cannot heal all wounds. It is like painting a wall to cover a hole in the wall. It may brighten things up or change things up a bit, but the hole is still there and must be addressed in some other way. For Me Before You, its guts in sticking to this life truth is impressive, but also thoroughly heartwrenching to watch unfold. Get the tissues ready."
    },
    {
      "rating": "6",
      "text": "Good movie. This is one of the best Drama/Romance films I've seen in the past couple years. I was very shocked I liked it as much as I did. Very strong performances from Emilia Clarke and Sam Claflin along with great chemistry. The movie was very touching and emotional at points, and I was very engaged throughout the film."
    },
    {
      "rating": "6",
      "text": "Me Before You seems to be every tragic love story rolled into one largely goofy teenage rom-com. There was the occasional funny moment, but the weak chemistry & acting of the two leads spoiled anything that could have come from the thought provoking premise of this story."
    },
    {
      "rating": "10",
      "text": "Beautiful movie, Did not know the actors, was very impressed when I found out Emilia Clarke was in that role and really enjoyed her acting, was perfect for the role."
    },
    {
      "rating": "9",
      "text": "This movie is adorable! Story-line is perfect. And Emilia killed it. Her brows need an award I swear! A movie with drama genre, hooking you up for the whole time is worth this rating.*Spoiler*I don't know what is with the critics or the low score, but I think it was okay for him to choose death. He was an intelligent man. He knew he couldn't face the fact that someday she will regret having married him, even if it's for an instant it would kill him seeing her like that. The little happy moments that he had were tearing. And Emilia did really really great for a cheerful girl. I do think Emilia overdid it at one or two places though but that is okay.I loved this movie very much!!!"
    },
    {
      "rating": "10",
      "text": "This movie is about death of dignity. Louisa, who has to make money for her family, looked for a new job because the place she worked at had closed down. At the same time, a family is looking for someone to take care of their son, Will, who had an accidental injury. A few years ago before he met her, he had a traffic accident and his body was paralyzed except from his neck up. Through her job, she fell in love with him.Will had been suicidal for a long time. When Louisa figured this out, she organized various trips and adventures to show Will that life is worth living, despite his disability. She planned some enjoyable activities and they had a lot of fun. However, he didn’t change his initial plan to kill himself because he thought he would never make her happy and also he wants her to live a normal life. In the end, he wrote a letter for her and took his life with dignity.A few weeks after Will's death, she went to Paris and she reread the letter. In it he told her to “just live well” and he left her enough money to follow her dreams.Actually Me Before You was originally a book. It was written by Jojo Mayes. It was published in 2012 and a sequel titled After You was released in 2015. The film was released in 2016. It received great literary acclaim, including being nominated for a Goodreads Choice Award. The movie stars Emilia Clarke as Louisa Clarke and Sam Claflin as Will Turner.I usually watch a mystery movie like Saw instead of a romantic movie. The reason why I watched Me Before You is my favorite actor stars in it. Now it has become my favorite movie not only because I like him, but also because I like the story.I didn’t know about dignity of death at all, so at first I didn’t think it’s good way to relieve from suffering because it’s a kind of suicide. However, through watching this movie, I understood how he felt so bad about his life. This movie is not only serious but also funny sometimes because Louisa is very outgoing and funny. Will had become a different person because of his traffic accident, but thanks to her character, he became like he was before he had the traffic accident.Some people say that this promotes view that people are better off dead than disabled and it has suffered a backlash from many people in the disability rights movement. I can understand why they think so but this movie is worth watching. Since I think dignity of death is not a familiar topic for us, it gives us a good opportunity to think about it. If you watch this movie, you will definitely change the way you think about dignity of death. I hope you will like this review and watch Me Before You."
    },
    {
      "rating": "3",
      "text": "How can disability be discussed in such a chick flick movie? Please show your respect."
    },
    {
      "rating": "10",
      "text": "Life's ultimate redemption to succeed in life. Love at the hill top deciding whether to step forward or back. #lovedit"
    },
    {
      "rating": "8",
      "text": "The problem with Me Before You is it leaves its message about disability a little bit open to interpretation.The two leads Emilia and Sam however have amazing chemistry and as a love story those two make it really compelling, perfect casting for the roles."
    },
    {
      "rating": "9",
      "text": "The adaptation couldn't be better imo. Sure I understand the criticism behind the general message some people might receive about disability but that part of the story is in the books and they weren't gonna give it a brand new ending. It's a beautiful love story, take it as that and you'll be very pleased because both actors are very charming throughout the whole movie."
    }
  ],
  "recommendations": [
    "the_fault_in_our_stars",
    "collateral_beauty",
    "her",
    "blue_valentine",
    "the_notebook",
    "about_time",
    "closer",
    "the_age_of_adaline",
    "five_feet_apart",
    "the_intern",
    "manchester_by_the_sea",
    "the_perks_of_being_a_wallflower",
    "the_glass_castle",
    "the_big_sick",
    "brokeback_mountain",
    "all_the_bright_places",
    "the_blind_side",
    "the_curious_case_of_benjamin_button",
    "revolutionary_road",
    "hereafter",
    "lady_bird",
    "love_actually",
    "seeking_a_friend_for_the_end_of_the_world",
    "the_descendants",
    "the_upside"
  ]
}