{
  "id": 858,
  "title": "Mean Girls",
  "starring": [
    "Lindsay Lohan",
    "Rachel McAdams"
  ],
  "runtime": 97,
  "genre": [
    "Comedy"
  ],
  "description": "Cady Heron is a hit with The Plastics, the A-list girl clique at her new school, until she makes the mistake of falling for Aaron Samuels, the ex-boyfriend of alpha Plastic Regina George.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/alKvY5LuVcXraRBfi5UtVV8Ii6Y.jpg",
  "categories": {
    "plot": 6.928571428571429,
    "acting": 7.2105263157894735,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 2.0,
    "familyFriendly": 6.0,
    "funny": 7.25,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Previously home schooled in Africa Cady Heron (Lohan) has recently moved to a small town near Chicago and immediately runs afoul of the notorious Regina George. Along with her two friends she soon devises a plan to get her own back.Being a thirty year old male I guess I am not exactly the target audience for this film but seeing as it was written by Tina Fey, creator of the excellent 30 Rock, I was hoping for a few more out and out laughs and the movie can also border on being slightly too ‘Disney’ in the way everyone learns their lesson in the end. Despite this Mean Girls makes for an enjoyable watch as it is clear that this is a subject matter that is close to the heart of Fey. Her immense writing talent is demonstrated in the way she injects heart into the script making the audience sympathize for characters that could easily come across as unlikable. The performances from the cast also help to move the film along at a good pace. Lohan is particularly good and with all her recent problems it is easy to forget what a talented actress she is."
    },
    {
      "rating": "10",
      "text": "Women and Men alike love this movie. When a movie that is 'strictly made' for a certain group appeals to EVERYONE, then you have a success on your hands. The writing, acting and cast are all spot on. This movie never gets old"
    },
    {
      "rating": "9",
      "text": "Mean Girls isn't your typical lame teen movie, and for that its starting to become a classic. Its got some really great dialogue that'll keep people quoting it for a long time. The casting and performances are also great, as well as the comedy throughout. It is a coming of age movie all adolescents should see."
    },
    {
      "rating": "9",
      "text": "as a mean girl I self identify this way.  Everyone needs to be told what theyre doing wrong by me.  and I do it in a way that amuses me.  i recommend this movie"
    },
    {
      "rating": "7",
      "text": "Pretty much one of the best teen comedy movies. I watched it with my mother and we both laughed hard."
    },
    {
      "rating": "10",
      "text": "This is a great amkerican movie... Rachel McAdams do a fantastic job... Lindsay LOhan is good. Mean Girls is a fantastic movie!"
    },
    {
      "rating": "10",
      "text": "This movie is funny and entertaining. The acting and characters act great. This movie had great plot as well, it's bland kinda but overall its fine. This movie is great."
    },
    {
      "rating": "10",
      "text": "I LOVE this film! Its one of my all time faves and Rachel Mcadams & Lindsey Lohan were fab! Watch it every year at christmas and am still meaning to get a cute miss santa outfit in tribute. Its a great chick flick and one that should be on everyones shelves. Plus I think everyone can relate to the kind of girls in the film. Am I right?"
    },
    {
      "rating": "10",
      "text": "There comes a time in every girl's awkward high school years where she is offered a place at the cool-girl table. For Cady Heron, (Lindsay Lohan) the main character in the comedy, â"
    },
    {
      "rating": "8",
      "text": "Not a bad flick, way better than the sequel. I don't laugh that much during movies, but this movie did the whole character thing pretty good so I found myself laughing quite often. Some corny moments, some cliches, but mostly an enjoyable movie.\rRecommended."
    },
    {
      "rating": "2",
      "text": "Awful. Boring. Dumb. Poorly constructed. Poehler is the only saving's grace."
    },
    {
      "rating": "5",
      "text": "Best movie ever? Why? I really wantto say something....... It's not that good."
    },
    {
      "rating": "0",
      "text": "Boring, dumb, and annoying!"
    },
    {
      "rating": "5",
      "text": "I only watched the last hour of the movie and from what I've watched, the movie is OK at best. Lohan acts okay and the plot is original enough."
    },
    {
      "rating": "0",
      "text": "So far in my life, my past illnesses include a stomach virus, a case of pink-eye, a case of the flu, and two sinus infections. All of those combined were more enjoyable than watching this movie."
    },
    {
      "rating": "2",
      "text": "I haven't seen this movie when it came out because it's clearly a girls' movie and didn't seem funny to me. A few days ago I read that the movie became a cult movie, but wasn't successful in the beginning due to a lack of marketing. So I thought: I might have been wrong; Let's watch.I read that Lindsay practically carried the movie. Well, I don't know about that. She definitely was a special kind of a cutie, but otherwise her acting was not structurally better than that of others.Now on to the funny part. Well... oof. If you like run-off-the-mill jokes then you're set, but otherwise the \"funny' entirely depended on the wacky stick figures.Was there a plot? Yes. Two plots; Lindsay trying to get a boyfriend which was being sabotaged and secondly the preparation of the revenge by a ugly or alternative girl (or something) who was wronged by the three beauties. Lindsay is stuck in the middle of all of this. The plot elements jump from branch to branch like a blind monkey stung by a bee (maybe a queen bee). But we can't have anything intelligent can we? Just like the girls, the plot evolves in random directions from second to second.An odd thing sticks out: many actors looked like they were imported straight out of Jewish communities; All of the relevant roles are occupied by Ashkenazi's and Khazarians. I was tempted to check whether this was co-produced with Israel.The perpetuation of culture is blatant, something the very industry and their media buddies attack whites for. \"Smart\" Asians, \"Girls with feelings\" (fat girls), outsiders (uglies), nerds, the stereotyping never ends.The shallowness of the movie - bunch of girls acting out like 12 year old spoiled brats - should have been its appeal and I had some expectations, but the execution wasn't done well at all, other than the technicalities such as the camerawork and editing.Don't fall for the user score (unusually much higher than paid off professional reviewers). Having read a bunch of perfect 10 reviews, it's clear to me that bots and \"affiliate\" reviews are at play here. This is 100% exclusively a chick flick, and for most of them it may be a tad too dumb."
    },
    {
      "rating": "10",
      "text": "One of the best movies I've ever seen, literately!"
    },
    {
      "rating": "10",
      "text": "I love this movie and the outfits."
    },
    {
      "rating": "10",
      "text": "That is the most amazing movie, im doing my speech on it! i love Rachel McAdams."
    },
    {
      "rating": "10",
      "text": "Fantastic movie!! Not just girls will love this film - guys will too! LOL (laugh out loud) funny but still is about real life situations."
    },
    {
      "rating": "7",
      "text": "A surprisingly decent chick flick... although the plot runs pretty close to most rom-com's, this one somehow finds the wit and humor that most of them lack. It's almost worth watching the second time. Take it from me... if you watch one chick flick, make 'Mean Girls' that one."
    },
    {
      "rating": "10",
      "text": "Brilliant film. Any person wanting to chill out or have a laugh i think you should watch it."
    },
    {
      "rating": "8",
      "text": "The screenplay is witty and punchy. Lindsay Lohan is perfect for her character. If you liked Freaky Friday. You will LOVE this one."
    },
    {
      "rating": "10",
      "text": "This was such a cool movie! I can't believe some people don't like it. evil bad people...(inaudible muttering...). Yeah."
    },
    {
      "rating": "10",
      "text": "I LOVE this movie, it's soo true...and I know every line..its very good.  It's probably the only movie guys and girls will watch and both love and dye laughing."
    },
    {
      "rating": "6",
      "text": "This movie was okay. But, I really do not think this movie is good for little kids. Like, when that girl talks about her wide-set vagina.. I mean thats just nasty!! And, I'm not exactly for gays anyways, so the queer that was her friend was weird too for me. But, I can't choose how the movie will go. The movie was too bad, I like how in the end, she realized who her true friends were. And how the plastics broke up and continued to talk to others too. It may not have had a good beginning but it had a great end!"
    },
    {
      "rating": "8",
      "text": "I avoided watching this movie as i thought it would be some no-brainer teen chick flick. but after my girlfriend convinced me to watch it i was in hysterics superb i was screaming \"awww kevin G\" for weeks afterwards."
    },
    {
      "rating": "10",
      "text": "That movie was wonderful i love every person in it."
    },
    {
      "rating": "10",
      "text": "Absolutly fabulous! Loved the film, watched it exactly 57 times... Sick, I know, but it's worth it!"
    },
    {
      "rating": "10",
      "text": "I think that this movie is OK, and my friend said it was awesome, here she is. This movie let you know what kind of maen girls that you could find in your grade and I just loved it!"
    },
    {
      "rating": "10",
      "text": "This movie never gets old, Tina Fey and Lindsay Lohan are HILARIOUS! Totally 100% worth seeing. One of my favorites."
    },
    {
      "rating": "10",
      "text": "You are a freaking poopooing dummy if you didn't at least give it an 8. it's actually a pretty good movie and has a great message. i own it. i own you too if you didn't like it. psssssssh"
    },
    {
      "rating": "7",
      "text": "SNL head writer Tina Fey's first film is a huge sucess. I was expecting it to be stupid, but it was actually cleverly funny and relateable to a lot of people who ever went to High School or are in High School. Females that is. Lindsay Lohan plays your typical goodie goodie and The Hot Chick's Rachel McAdams plays the popular girl at school who Lohan's character befriends only to get revenge upon. Former and current SNL members have cameos in this including Tim Meadows as the school principle, Amy Poehler as McAdams \"trying to be hip\" mom with a horrible boob job, Ana Gasteyer as Lohan's estranged mother and Tina Fey (the writer of the film) as the geeky but still kind of cool math teacher. I'd recommend Mean Girls to anybody looking for a good laugh who likes revenge films."
    },
    {
      "rating": "7",
      "text": "Certainly not the 'best move ever' but also not 'really dumb.' It falls somewhere in between. It's witty and catchy, but only superficially. If you're looking for really good filmmaking, look elsewhere. If you're looking for something entertaining, this will suit your needs."
    },
    {
      "rating": "10",
      "text": "This movie is the best! We are watching it in English and I love it! It's hilarious but oh so true!!"
    },
    {
      "rating": "10",
      "text": "I am a 17 year old guy and have never enjoyed any \"chick flick\" (for lack of a better term) in my life except for Mean Girls. I am disgusted that critics gave this movie such a low rating while raving on and on about Babel, a movie which anybody who is the least bit cultured will find ridiculously unintelligible. I guess thats what happens when Americans influence pop culture so strongly."
    },
    {
      "rating": "10",
      "text": "One of my favorite movies. If your a teenager and you haven't seen it, more then 2 times in a row, you will get laughed. 3 best quotes from the 2 best people. \"Shes a life ruiner, She ruins people's lives.\" \"Hey get out of here, OMG! DANA DEVITO I LOVE YOUR WORK\" and... of course \"SUCK ON THAT! AYAYAYAYA!\""
    },
    {
      "rating": "8",
      "text": "By the look of both the trailer and poster, you'd think that this is an awful chick flick when actually Tina Fey's film that she penned herself based from her school experiences and the book \"Queen Bees and Wannabees\" is actually a great, well constructed and intelligent film. The writing is sharp and witty and the performances delivered by both Lohan and McAdams are so cut-throat, raw and dark that you really see who they're characters are. I was surprised by how well the story was created and the cast react to each other extremely well."
    },
    {
      "rating": "6",
      "text": "Cady Heron (Lindsay Lohan) grew up in Africa and is home-schooled, well, until now. Her parents move to America and decide that it's time for Cady to start high school. Then Cady is left to struggle with the non-written laws of the human world. The film is basically a chick-flick, with a high school theme.Cady makes friends with the Plastics, who are the royalty of their school. They're these three beautiful girls, one of them stupid, one of them the servant bee, and one of them the queen bee. Queen bee, Regina George (Rachel McAdams), is both smart and evil, and the most glamorous of them all. First, Cady makes friends with them but after she sees Regina steal her crush from her, she plots a plan against the Plastics with two outsiders, Janis and Damian.I had never watched a Lindsay Lohan movie before, and I'm surprised that she can actually act. She looked right for the role, and wow, she was looking decent before all those drugs and partying. She could've progressed into a good actress. Rachel McAdams makes a good smug, plotting, evil **** We're bored of seeing her in romantic dramas one after another, she must try different roles. Amanda Seyfried looked like she was having fun playing the stupid blonde, and that makes the viewers have fun too. And the girl who plays the outsider Janis, Lizzy Caplan, she's the chick from Cloverfield, in case \"Who was that girl?\" got stuck in your head.Well, it's not a deep, meaningful movie. You can watch it just to have fun, or to spend 1,5 hours not thinking deeply. It's a high school comedy with girls plotting against each other, but it's not that bad. The cast is good. There is even Tina Fey. And the Janitor from Scrubs. It's watchable."
    },
    {
      "rating": "6",
      "text": "It might seems one more teen movie at a school, but the idea of the movie goes furthermore. Mean Girls can portrays very well what really happens in the girlâ"
    },
    {
      "rating": "7",
      "text": "This Is A Good Movie :DOverall The Writing Is Good, As Well As The Acting.. Lacey Chabert Does A Great Job!I Do Think In The Middle On The Film, It Lost Some Of The Touch..Overall Good Movie.."
    },
    {
      "rating": "7",
      "text": "Sassy as a high school gossiper, funnier than Kevin Hart, and surprisingly detailed than the map of Texas, \"Mean Girls\" is a enjoyable movie with some excellent performances from Rachel McAdams as it drives into the two-sided heart of high school life."
    },
    {
      "rating": "7",
      "text": "Far from surprisingly that Tina Fey wrote the sharp sassiness of this comic gold. One of the most quotable films of the naughties, Mean Girls is fab and fresh--not too much some of Lindsay Lohan's best work."
    },
    {
      "rating": "8",
      "text": "I usually don't like these kind of movies but i found Mean Girls quite funny. The script was really good by Tina Fey at that is where I think the movie stood out in my opinion."
    },
    {
      "rating": "9",
      "text": "I don't care who you are, you know this a very funny movie. This is Lohan at her best. Tina Fey's script is clever and has a great message for all teenage girls that applies to everybody."
    },
    {
      "rating": "8",
      "text": "OK, so chick flicks are normally the lowest form of entertainment next to reality TV, so why is Mean Girls an 8/10? Allow me to explain, Cady Heron has been home schooled her entire life, now she has moved to America and is put into an actual school. Completely out of her depth she seeks for friends where she can find them and ends up becoming a 'plastic', one of the best looking, and most highly feared women in school. However as she begins to truly become a plastic to impress a guy she soon realises how wrong she was.\rMean Girls on pen and paper sounds like every other chick flick but its much more than that, for anyone who went to school in the 21st century, its like being back in school. Every social class is portrayed wonderfully by a fantastic cast, not to mention that it is actually funny for both men and women. Mean Girls is one of the gems hidden in an overcrowded, poorly done genre and worth a try for anyone looking for a funny, feel good film."
    },
    {
      "rating": "8",
      "text": "This is definitely a very solid little flick. The script from Tina Fey is really strong, particularly when it comes to comedy. The jokes pretty much unanimously work very well and the one liners are great. Lots of quotable lines, as has been obvious since this film's release. Rachel McAdams, Lacey Chabert, and Amanda Seyfried, are all really good, especially McAdams. Lindsay Lohan is also great and this should have been a star-making turn for her and watching this makes me sad thinking of all the lost potential for her. The film is certainly very chick flicky, but is a good one at that and is still enjoyable to me as a guy. Plus, even though is focuses on the problems facing girls in high school, a lot of the things they discuss about high school rings true all the same. Overall, this one is an easy one to watch and even easier to enjoy. Obviously not an Oscar-worthy film, but a quality flick all the same."
    },
    {
      "rating": "7",
      "text": "One of those movies that isn't incredibly hilarious, isn't incredibly interesting and isn't incredibly unique...but is just enough of all of those things to make you watch it over and over and over and over and over and over and over and over again. The fact that Lindsay Lohan was an absolute dime doesn't hurt either."
    },
    {
      "rating": "10",
      "text": "A quality teenage film that explains many high school experiences for everyone, even guys. It's the ultimate clique film that really tells the true tales of what high school girls have to go through, and this whole burn book (which even my school had) situation and how it turns one against another. This film also had Lohan at her best before she spiraled downwards :P Not only do the youngsters perform well but the adults are great in this also. Overall a solid film and one everyone must see."
    },
    {
      "rating": "7",
      "text": "This movie is really funny and represents American teen generation. Good acting and story deserves my positive score  7/10, and if you haven't watch it, then trust SEROJ, it's fun."
    }
  ]
}