{
  "id": 1285,
  "title": "Mechanic: Resurrection",
  "starring": [
    "Jason Statham",
    "Jessica Alba"
  ],
  "runtime": 98,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "Arthur Bishop thought he had put his murderous past behind him when his most formidable foe kidnaps the love of his life. Now he is forced to travel the globe to complete three impossible assassinations, and do what he does best, make them look like accidents.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/h651SE7s5z9hbKDiwn38Iubkz5w.jpg",
  "categories": {
    "plot": 4.481481481481482,
    "acting": 5.0,
    "ending": 5.25,
    "soundtrack": 5.0,
    "cinematography": 2.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 4.954545454545454
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I didn't think it was terrible like most people have been saying simply because I went in expecting nothing more than the usual mindless yet fun popcorn action I've come to expect from Jason Statham and that's exactly what I got. Yes it's certainly far from groundbreaking or amazing, but it's also not the terrible God-awful film everyone else wants you to believe it is. It's still a stupid fun time while it lasts. I feel as though most critics and audiences have been exaggerating their opinions on how terrible they think this film is, maybe that's just me though."
    },
    {
      "rating": "1",
      "text": "I don't know why, but I thought I was watching a terrible Transporter movie. This movie offered NOTHING, Just boring fight scenes and uninteresting plot. I want to forget this movie and I don't want to see it ever again. Jason Statham, please, think about what you're doing here. To throw this off the bat, I want to see this Jason in John Wick movies. That will be badass."
    },
    {
      "rating": "6",
      "text": "Never though that Statham will perform as Bishop again after The Mechanic in 2011 (that was a disappointment). The reason that i wanna see this sequel is the cast. Is not just Statham alone but along with Tommy Lee Jones (Academy Award winner), Jessica Alba and international martial actress from Malaysia - Michelle Yeoh.\r The story begins with Bishop that begin to enjoy his retirement - tired and sick of all the murderers he planned but then a beautiful Thai girl approached him and offering 3 jobs or get killed. but off course Bishop easily handled this girl and the thugs she bring along with her through a brutal hand combat and escape.\r Then Bishop move far away to Thailand and warmly welcomed by his old friend - Mei (Michelle Yeoh).Then soon Bishop reluctantly have to save an attractive girl - Gina (Jessica Alba) whom being beaten by a guy named Frank - just to find out that all was just a set up to spying on him. But, Bishop got another plan, since he already know who behind all this, he intend to finish this once and for all.\r Then Bishop meet Crain, a man who hold his grudge upon Bishop for so long - but want Bishop to do 3 hard tasks - murder high profiles villains - but with his expertise - the killing must look like accident.\r Bishop easily finished his 2 first tasks - but then he realized that Crain got something behind this all schemes. So,he decide to collaborate with the 3rd target - Max Adams (Tommy Lee Jones), the most powerful gun dealers in all Europea Continent.\r Again, that this sequel still far from my expectation. I was hope that this sequel will bring more escalation on every aspect, the characters, the conflicts, character development. But, turn out to be only 2 element added to this sequel 1)Bishop's love story and 2)action package.\r I do really like some \"humour\" elements inserted but still not enough to make me Laugh Out Loud. Also i was really keen when Bishop finally find out that Gina reluctantly \"working\" for Crain, but then just so easily Bishop finally fall in love with Gina. A person like Bishop.\r I really enjoy when Bishop create the accident to kill Cook. And that was really original idea (at least from where i belong).\r But the funny thing is : the terms of the assignment was the killing must 100% look like accident or Crain will kill Gina. The 1st task was done not really look like accident.\r The other thing, i always enjoy Tommy Lee Jones perform as Max Adams. His performance reminds me of his perform in Under Siege...eccentric but i can feel the vicious behind it. But then, that just it..this sequel didn't give enough space to develop Max's character.\r Guess, The Mechanic Resurrcetion is just another typical action movie will be soon forgotten as you put your feet into your doorstep or maybe soon as you leave the building."
    },
    {
      "rating": "7",
      "text": "If you want an action flick to entertain you, this is a good one.  Picking up where the Mechanic left off, this is a plot within a plot.  He wants to retire but a villain from his past has a score to settle.  Makes for more action, less plot, but that's what I was expecting."
    },
    {
      "rating": "5",
      "text": "Nothing more than a mindless action flick, Resurrection has plenty of stunts and visual splendor to make up for its recycled plot and cliched dialogue."
    },
    {
      "rating": "7",
      "text": "I think if you like Jason Statham's action movies, then you will enjoy this one too. Yes, it had a bit over the top scenario and some scenes were a bit too unreallistic, but as it is an action movie I can forgive that. Not the best movie from Stathem, but still enjoyable"
    },
    {
      "rating": "8",
      "text": "this is not a movie, it's a mindless action flick, you will have a fun time if you are aware of this probably you will have a fun time, don't pay attention to critics because as a movie this doesn't work but it's more like Comando with Arnold Schwarzenegger, so you are aware."
    },
    {
      "rating": "5",
      "text": "A cliché plot doesn't always mean death for an action movie. As long as the star, stunts, and fights are up to snuff then viewers can still find themselves having a good time. While the movie provides some thrilling moments, Statham's Mechanic sequel ultimately falls short thanks to a strange focus on acting and storytelling. Both of which aren't handled very well.Despite his pedigree, Statham isn't unfamiliar with more story-driven action flicks. Take Homefront for example, which did a pretty great job of juggling both character-driven writing and the star's remarkable physicality. Here though the amount of predictability is just painful. The emphasis on the romance between Statham and Abla is where this is most notable. It's also punctuated by awful dialog and the fact that Abla just can't act. The action is mostly solid though. When things finally get going it's almost enough to make you forget about how bad everything else is. It's even quite fun at times. The hits themselves Statham is forced to pull of are quite exciting and inventive. Near the end it starts to rely on formulaic shoot outs, but at least that's better than the writing. Plus you're treated to some gorgeous scenery. Of course even that gets hurt by some bad green screen and CGI work here and there. There are times where you can clearly see the budget restraints. The direction also seems a tad amateurish. Did we really need those lengthy fade to blacks before the next scene? At times though this is actually a strength. It (unintentionally) harkens back to those cheesy action hits of the 80's. When it comes to action movies there are plenty of better alternatives out there. However there are also plenty of worse ones as well. But why waste your time with something so middling? Ultimately this just serves as a reminder of why Statham isn't exactly as big of a name as he could be. He's got the presence and skills, but so far he just hasn't had the movies.5.9/10"
    },
    {
      "rating": "4",
      "text": "While the action set-pieces set on exotic locations are admittedly thrilling, Jason Statham’s sequel to 2011’s The Mechanic falters with an insane amount of plot holes, as well as a first act that poorly sets up the film to follow."
    },
    {
      "rating": "3",
      "text": "It's interesting to see a movie that is written without a story. I know a lot of movies have little story, especially in big blockbusters where the story is written around big action and loud effects. However, if you want to see a movie with a complete lack of story and with horrible effects to make up for it... then go see 'Mechanic: Resurrection'."
    },
    {
      "rating": "3",
      "text": "Is it too early to place my vote for the worst movie of 2016 ?\rLet's start off by saying that I am a fan of Jason Statham particularly the Transporter trilogy.\rBut watching his latest  flick begs the question,\rwhy would anyone 'resurrect' 2011's the Mechanic ?\rSure no action fan is expecting a great screenplay or sparkling dialogue.\rBut in spite of some impressive international locales and a few decent action set pieces,\rthe Mechanic 2 makes little use of Stathams badass charm or humor.\rAt his best his work can be ridiculous fun, expertly choreographed with a healthy dose of\radrenaline packed fun.\rThis time out it's an offering that's hyper edited, lacking even a decent villain, this might be the longest 90 minutes that you'll spend in a theater.\rAnd the movies best special effect ?\rA bizarre cameo from no less than Tommy Lee Jones.\rI've often said that eventually Michael Caine or Morgan Freeman will appear in every movie.\rAfter cameo's in three low rent films this year meet their heir apparent.\rSave this one for a slow night on HBO."
    },
    {
      "rating": "9",
      "text": "This is an action movie, and delivers on its promise to be an action movie.  I enjoyed it.  No gaps in the action.  If this is what your looking for from a movie, I recommend it highly.  If your looking for plausible, you will not like it."
    },
    {
      "rating": "10",
      "text": "Epik, best eva!!!  Jason STation has arrived, keep your hands and feet in the ride has begun.  Watch this movie for your daily dose of action and adrenaline requirement."
    },
    {
      "rating": "8",
      "text": "Entertaining popcorn flick!amazing action with the hinge of stunts well performed!3 missions were engaging to watch.every next move is as predicted yet felt entertaining to watch!"
    },
    {
      "rating": "6",
      "text": "After going underground at the end of the 2011 flic, hired assassin Jason Statham returns to kill again. He's backed into a corner, thanx partly to his quick romance with Jessica Alba, who's basically reduced to being the damsel in distress. As expected, he kicks ass and kills plenty, but this sequel has him setting more traps and creating elaborate schemes. There's less hand-to-hand fighting, which is his strength. What fights are there, aren't often special. Statham fans will probably enjoy his steely character and some good moves, but will find less cool action than expected."
    },
    {
      "rating": "5",
      "text": "An action \"R\" film with Statham and Alba, but alas, there's no b00b. Yes, Jessica as Gina plays his love interest in this serviceable fight/assassin film but at 36 yrs old Jessica is still playing 16. Yes, there's a love scene but it's heavily darkened/shadowed, why even cast her? She has the draw of Keanu Reeves. Not a waste, yet not a thrill."
    },
    {
      "rating": "6",
      "text": "Falling in love is a trap, but some men risk everything for it.This is an unexpected sequel. Actually, I was looking for other sequels from Statham's filmography, particularly the third 'Crank'. I think the idea of going for it was good and the film was not that bad, if your purpose of a watch is time pass. The story was so bad, but the filmmaking was excellent. Because it was made by a renowned German director. Only if he had got a better script, the outcome would have been different. So it's the actors and the director makes it watchable. Other than that, this film falls into the average category.The story follows after Arthur Bishop was found living in Brasil by some people who know him. Then he narrowly escapes from there and lands in Southeast Asia, where he meets Gina, a woman struggling from domestic violence. But he soon discovers that's a setup. After she was taken captive by an international criminal, now he has to follow his instruction to set her free. So the action begins where he takes a series of missions across the globe and how it all ends follows in the rest of the narration,It's good to see Jason Statham back to his signature role. This is what he's good at. Even if the story is not good, that's okay, because Statham's presence is a very comfortable to watch without any trouble. Jessica Alba as well, I haven't seen her in any major hit film at the recent time. Even though the film was received below average, it kind of puts them both back on the track.Definitely they both needed this breakthrough. There's a third film is coming, it's not official yet, but the conclusion was a hint where Tommy Lee Jones can be seen in an important role in the next part. You won't like this film, but surely enjoy it if you are a Statham's fan, that's the only reason to go for it.6/10"
    },
    {
      "rating": "1",
      "text": "Loud, noisy and rushed stuff. Resurrection messes up the straight forward formula of making a Jason Statham film, and injects the sequel with boring fistfights/gunplay, a terrible plot and downright cringe worthy dialogue. There are a few scenes that are very well shot, and choreographed. Even though every actor in the film is a letdown, I always saw a bored Tommy Lee Jones who could have made for a weekend ticket. Some action setpieces, especially the ones on the yacht, are exciting and exhilirating. Sadly, those 30 minutes cannot cover up the mess that is Mechanic: Resurrection. It is boring, lousy and loud, and really makes you want cover your ears with pillows."
    },
    {
      "rating": "4",
      "text": "If you're in the mood, Mechanic Resurrection is a great guilty pleasure. No one was clamoring for a sequel of Jason Statham's remake of the 70's Charles Bronson assassin flick, but here it is anyway. The opening is a kind of homage/rip off of a James Bond open, with an actually well staged fight in a restaurant that moves to the top of a suspended railcar and ends with our hero jumping off and landing on the back of a passing hang-glider (holy Roger Moore!). From there, Statham meets activist Jessica Alba, where after an evening of giggling (which I guess passes as chemistry) they fall into bed/love together. She gets kidnapped and Statham is forced to assassinate three targets to make up the rest of the movie. The \"hits\" are rushed, for time, and a lot of detail is looked over. The prison hit alone could have been a movie by itself. And for an assassin that specializes in \"accidents\", he sure kills A LOT of people in the traditional ways, plenty of gunfire. Statham attacks the villain's boat at one point, kills about 50 henchmen, gets captured, and is forced to perform the last hit (after killing about half of the villain's men). It's that kind of movie."
    },
    {
      "rating": "3",
      "text": "I love a good Jason Statham action film but this isn't one of them. Too many of the action scenes are spoilt by obvious green screen backgrounds and digital CGI effects'so it all feels a bit fake . The producers have tried to make this like a James Bond film with locations all over the world so the scenery is great but the story is borderline ludicrous. Jessica Alba's character, especially, makes no sense. Poor Michelle Yeow - so good in Crouching Tiger Hidden Dragon - is wasted here. Jason is Jason."
    },
    {
      "rating": "8",
      "text": "From the very first minutes you know what you are in for. The CGI wasn't particularly good, especially for a big budget movie, some of the acting wasn't all too good either, but it was very entertaining and the story was interesting. It's not the best action movie of 2016, but it's still worth a watch."
    },
    {
      "rating": "2",
      "text": "I just finished watching this movie on Netflix and the action did hold my interest.  But it didn't take long for me to realize that the movie really had no plot at all.  It was just basically Statham trying to save a damsel in distress (Jessica Alba). The hero does best when he has little dialogue.  And there is little meaningful dialogue in this film.  Just action.  And the acting isn't very good.  Alba is terrible in this film. Maybe she just couldn't shine in a movie lacking a plot and in which her role is simplistic.   But if you like the lead actor, and you like violence, this is your film.  For people who demand an intelligent plot and better acting, it's not. Killing people in dramatic ways.  Lots and lots of killing. Poor acting.  That's the gist of this film.  And there's not much more."
    },
    {
      "rating": "2",
      "text": "\"Mindless action movie.\"  Yeah, not this time, not ever.\rThe Mechanic: Resurrection is the much needed sequel to the cult classic of the same name.   I've heard many people give this movie a free pass because it's just Jason Statham spouting out one-liners.  Well, just because it's entertaining doesn't mean it's good.  There's no substance to the film, it's literally just J-Statham fighting bad guys in disorienting camera shots, terrible green-screen shots, and terrible special effects.  Sprinkle that in with some laughably bad acting and forced romance that you hardly buy, and you have a movie that you can get wasted on.  I can understand if you want to give it a good score and call it a guilty pleasure movie, but you have to understand that this is NOT a good movie.  From a critical standpoint, this movie is complete garbage.  However, if you wanna have fun with some buddies, crack open a few cold ones and enjoy the hilarity.\r The Mechanic: Resurrection gets a 2/10."
    },
    {
      "rating": "2",
      "text": "I expect one thing from a Jason Statham movie. One thing and that's entertainment. Well Jason you certainly didn't deliver this time. Aside from one half way decent scene this is nowhere near the standard of the first Mechanic. You get the usual Jason beating up half the world and the rest of the movie plays out like a very bad video game and descends into a boring mess. Also featuring Jessica Alba who has the personality of a rock and Tommy Lee Jones in his pyjamas. Not recommended."
    },
    {
      "rating": "5",
      "text": "Nothing much seen in Mechanic: Resurrection. I believe it has a little pair of good things and bad things at the same time, but when I saw this one, I had no idea what they were going for and what's the goal in this film. It's like they're trying to cut right into the conclusion. An additional pair of 30 minutes should've been used here. Maybe that might make this a somehow better movie."
    },
    {
      "rating": "6",
      "text": "If you want to judge this movie plot wise, you'd give it a big fat 0. The Story makes no sense what so ever, new characters jumping in every 10 minutes leaving the typical movie goer clueless. But when it comes to action scenes, this movie really does it very well. It's a typical Jason Statham action flick where he just goes around killing people and blowing **** up with really nothing else happening. For any action drunk person i would recommend watching this movie."
    },
    {
      "rating": "5",
      "text": "Этот фильм является типичным фильмом Джейсона Стетхэма, сюжет примитивный, актёрская игра удручает, в фильме нет какой-либо динамики. Из плюсов я могу отметить только сцену с бассейном, она  получилось довольно крутой"
    },
    {
      "rating": "4",
      "text": "Mechanic: Resurrection is the Hitman: Agent 47 of 2016 with a moderate upgrade: it is at least much better when Jason Statham is killing people.\rMaybe if it was continuous action the way Hardcore Henry was, I would have spared it a great deal of trouble. But alas, that's not the case when a dreadfully boring love story is at play between the five and forty-minute marks. Yep, like all cliché Hollywood action films these days, there has to be a love story taking up a third of the entire movie that serves as pointless filler in order to make the concept somewhat human. Did the scriptwriter forget about flashbacks and the creation of mystery while making this film?\rAs with many action movies in this category such as this movie, the characters are one-dimensional cut-outs and the plot is quite stupid. Except for entertainment value from Jason Statham and the plot after the forty minute mark, nothing else was at least good in this movie."
    },
    {
      "rating": "0",
      "text": "Tiens, tiens, une stathamerie de plus… mais réalisée par le metteur en scène allemand Dennis Gansel (La Vague, Nous Sommes La Nuit…), ce qui explique notre curiosité certaine alors que nous nous tenons bien entendu toujours à bonne distance des infâmes stathameries de (toujours) fort bas étage !Bien mal nous en a pris, car le ‘miracle’ n’a pas eu lieu et le réalisateur allemand prometteur a fait de la merde de A à Z ! Statham reste en effet égal à lui-même (c’est-à-dire simplement …nul) et le scénar de nanar, de ce nanar haut de gamme plus précisément, reste une grosse daube à la con, complètement conne et grotesque.. à mi-chemin entre un Bourne et… quoi donc au juste ? une vague connerie de film à la con. Une stathamerie en somme !Le plus étonnant est d’y retrouver aussi Michelle Yeoh et… Jessica Alba ! les pauvrettes… enfin, façon de parler. Mais tout de même, elles font un peu de peine à errer dans cette daube pas regardable. Car dès que l’action se pointe, le film n’est pas regardable du tout : c’est cut, c’est zoomé, c’est move… mal cadré également, ça tremble, ça secoue… c’est de la merde ! comme tout le reste, de toute façon. Alors, direction la poubelle, et ne reviens pas !"
    },
    {
      "rating": "4",
      "text": "Mechanic ResurrectionUne énorme déceptionLe scénario démarre bien.Mais à un moment il y a un piège, l[spoiler]    e piège dit qu'elle est un piège    [/spoiler]    et le héros saute dedans sans raison.... Bla-bla-bla...Voilà la base du scénario....Pour le reste les méchants son pas très futé ... il ne tire pas, il monte les escaliers sans écouté d'ou vienne les tires enfin bref j'ai plu suffisamment de souvenirs tellement il ne ma pas choquer. Mise à par certaine phase d'action ce film ne vaut pas grand-chose...Une musique je ne sais plus....Effet spécial, ouille sa pique les yeux....L'acteur \"Jason Statham\" était la seule raison pour laquelle je suis allé au cinéma et puis c'est tout, si vous aimez Jason Statham alors vous pouvez aimer. Allé le voir si vous éte fan de Jason StathamSinon aller voir autre chose ;)"
    }
  ]
}