{"id": 3051, "title": "Meet the Fockers", "starring": ["Ben Stiller", "Robert De Niro"], "runtime": 115, "genre": ["Comedy", "Romance"], "description": "Hard-to-crack ex-CIA man Jack Byrnes and his wife Dina head for the warmer climes of Florida to meet the parents of their son-in-law-to-be, Greg Focker. Unlike their happily matched offspring, the future in-laws find themselves in a situation of opposites that definitely do not attract.", "releaseYear": "2004", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/yr63jamc8NuEXUNQPX1fyjoEF2Q.jpg", "categories": {"plot": 6.5, "acting": 4.5, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.0, "funny": 3.5, "action": 5.0}, "reviews": [{"rating": "8", "text": "ihhiihigugughiihihgujgjgjgjgugugguugguigugugguugugugguugugugugugjgug,,,,,,ssdddds.........,,,,,,,..............."}, {"rating": "3", "text": "If you never tire of all of the sex and bathroom humor spewing forth every night on TV sitcoms, then this is the movie for you. This movie abandons the original and creative comedy of \"Meet the Parents\", in favor of the same old \"potty\" humor we see everywhere else. About the only cheap comedy gag they didn't use was dressing men in women's clothing, but I'm sure if they would have thought of it, we'd have seen DeNiro in drag."}, {"rating": "4", "text": "In Meet the Parents the hapless Focker (Stiller) met his fiancées parents and, while it was far from perfect, it certainly provided enough laughs to make for a worthwhile watch. This sequel, which now see's Fockers hippy parents join in on the act, is a pale imitation however despite the all the acting talent on show. There are a couple of humorous scenes but most jokes, for me at least, just fell flat meaning I was bored well before the final credits of what is a fairly lazy sequel."}, {"rating": "6", "text": "Eh it was ok. It didnt dwell on the first film too much but it didnt do enough to really set itself apart either. The cast is good but the story is too generic and features a lot of generic jokes. Its funny though and worth the watch, Just dont expect to be amazed by it."}, {"rating": "8", "text": "I think the addition of Hoffman and Streisand did wonders for the cast. It was a solid film overall and was well worth watching. A good sequel to what is becoming a good franchise."}, {"rating": "4", "text": "Everything has changed. \"Meet the Fockers\", unlike its prequel, contains too much of the Hollywood spirit with the obvious-OBVIOUS family-romance-comedy-whatever formula we all watch."}, {"rating": "2", "text": "A wasted cast is amongst a very lazy, laid back movie that you can tell the writers didn't care about because it wasn't that funny and a bit too raunchy even though it was kind of funny you couldn't find a soul to this film anywhere. I give this movie 20%."}, {"rating": "8", "text": "While it does contain strong hints to it's predecessor, Meet The Fockers gets plenty of fresh humor from the addition of Hoffman and Streisand, and the content is delivered perfectly by a great cast."}, {"rating": "3", "text": "It was just bad. It was like writers have 1 night to write their homework and they have started pretty late. I remember it was so boring I could not wait the end. Maybe it's not that bad, but I have watch better comedies, that I could recommend - the good old Mrs. Doubtfire, The 40 Year Old Virgin, The House Bunny, The Hot Chick, 10 things I hate about you and many more."}, {"rating": "10", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "4", "text": "An unfortunate and obvious follow-up to Meet the Parents. The addition of Hoffman and Streisand is wonderful; however, not nearly enough to save this franchise."}, {"rating": "3", "text": "About 1/10 of the laughs of Meet the Parents."}, {"rating": "0", "text": "Meet the Parents is one of my favorite comedies. This sequel is so appallingly bad I wish I could erase it from memory. I'm not sure what audience they were going after but they abandoned all the fans of the original. If you find the sex life of old people amusing then this might be for you but seriously, how long can you laugh at the same stuff again and again. Avoid this gutter trash and, unlike the original, definitely don't let your kids watch it. They'll just get depressed (and disgusted)."}, {"rating": "7", "text": "Liked it as much as I did the origial. The addition of Hoffman and Streisand definently added new life to the film. I am really suprised that critics and users didn't like it more. It' a good comedy."}, {"rating": "5", "text": "I was actually a little disappointed. It didn't live up to the originals standards at all. The performances were great but it didn't have a lot of funny parts which is surprising since the first one was hilarious. The third one saved it big time."}, {"rating": "7", "text": "What we have here is something rare - a good sequal. Meet the Fockers has the same all-too-familiar famililal awkwardness and dysfunctional Jewish hilarity as Meet the Parents while gently pushing the plot to the edges of absurdity. If only they had left it at that..."}, {"rating": "4", "text": "it was barry poppoins..Meet The FockersJust as the first one, it pretty much is exhaustingly same which comes as a shock looking at the cast; no amount of funny could have saved the script."}, {"rating": "0", "text": "Devoid of any real humor and without any class, this is, except for the luminous and wasted Blythe Danner, a truly dreadful film."}, {"rating": "6", "text": "I always enjoyed watching this one quite a bit a few years ago due to it being on ITV2. I watched it today and I surprised that it wasn't as good as I remembered like there's good moments throughout the movie but it's not as funny and entertaining as I remembered it to be."}], "recommendations": ["night_at_the_museum", "neighbors", "blended", "neighbors_2_sorority_rising", "little_fockers", "ted", "a_bad_moms_christmas", "the_three_stooges", "old_school", "step_brothers", "sisters", "good_boys", "parental_guidance", "just_friends", "hall_pass", "jackass_presents_bad_grandpa", "the_wedding_ringer", "bad_santa", "rough_night", "hot_tub_time_machine", "sex_drive", "date_night", "what_happens_in_vegas", "30_minutes_or_less", "bad_santa_2"]}