{
  "id": 2529,
  "title": "Meet Joe Black",
  "starring": [
    "Brad Pitt",
    "Anthony Hopkins"
  ],
  "runtime": 178,
  "genre": [
    "Fantasy",
    "Drama",
    "Romance"
  ],
  "description": "When the grim reaper comes to collect the soul of megamogul Bill Parrish, he arrives with a proposition: Host him for a \"vacation\" among the living in trade for a few more days of existence. Parrish agrees, and using the pseudonym Joe Black, Death begins taking part in Parrish's daily agenda and falls in love with the man's daughter. Yet when Black's holiday is over, so is Parrish's life.",
  "releaseYear": "1998",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fDPAjvfPMomkKF7cMRmL5Anak61.jpg",
  "categories": {
    "plot": 7.181818181818182,
    "acting": 7.833333333333333,
    "ending": 9.5,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 5.0,
    "funny": 8.0,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It's a movie-miracle!The plot is great and Anthony Hopkins is..fantastic!Brad Pitt is great too!In the end you will cry for much time..It's unbelievable!"
    },
    {
      "rating": "9",
      "text": "Exceptional acting. Every character is crucial to the script here. The script is truly rich for eevry character. Even Tambor's Quince, a truly minor character, is especially paramount to understanding this movie's characters. If you can accept the premise (and I don't see why it is so hard for so many) then this movie is well worth your time. And to all those who say \"less is more,\" maybe it is a bit too long, but no movie is perfect, and most all the dialogue and deliveries are amazing. And I sat through Braveheart the same as all of you and loved it. If a movie is interesting, I'll stay. It is smart dialogue with an excellent score, fantastic cinematography, superb direction, and a great cast. It's unfathomable that this man went on to direct the unintelligable Gigli."
    },
    {
      "rating": "9",
      "text": "This movie is incredible.I've seen it around 7-8 times.The acting is right on and it is a great story.It should of got better reviews cause its a great movie experience.I rate it a 9.2."
    },
    {
      "rating": "9",
      "text": "First of all, the reason that the Brad Pitt's character is so stale through most of the movie is because he plays DEATH! What did you expect? The movie is exceptionally long, but I cannot think of a scene I would want to exclude [other than Brad speaking to the Jamaican woman]. The score is nothing less than brilliant; Thomas Newman is a genius. The scenes fit together seemlessly. At the very least, this film is intelligent and entertaining. If viewers are too bored with this movie, I suggest taking more riddelin and watching Die Hard twice...it'll still take three hours, but you'll get to see Bruce Willis blow stuff up. If you actually want to watch a well-thought-out, relatively original film, you'll not be dissapointed."
    },
    {
      "rating": "8",
      "text": "Meet Joe Black is a beautiful, little film (yes I just said an 180 minute film was little). It features great performances by Brad Pitt and Anthony Hopkins. This movie isn't for the action-oriented crowd. This movie is slow and deep."
    },
    {
      "rating": "0",
      "text": "I have a habit, which makes me waste a lot of time, I don't leave a movie unfinished, it can be the biggest crap, I must stay until the end. this was the case with this garbage I came across, unfortunately, today.The film is so lame, it impressed me, I was laughing, it seems comedy, it actually seems ironic, how ridiculous it is.but I'm not even going to devote much time to talking about the film, I'm just going to mention some of the countless nonsense. first, the old man to whom \"death\" ascribes some dignity, is simply a mediocre, idiot, stupid, unhappy old man. this old man is portrayed as a hero in the film, he is a \"good man\", who according to death goes to paradise, like a good Christian.the most bizarre thing is that the moral of the movie is that money doesn't buy happiness, but the movie just preaches the values ​​of luxury all the time, the hero is the old man who won in life and is **** rich, there is not a single black character, or poor, in the script.another bizarre point is that the film preaches the lie all the time, note that no one (not even death) is able to tell the reality lol kkkkkk. each one is lying to the other, as if it were perfectly plausible.I'm really going to think 20 times before I see an American movie again.North American culture is the most despicable on planet earth, there's no way!!!"
    },
    {
      "rating": "10",
      "text": "This is one of my all time top ten movies, can watch it over and over again, Hopkins at his best, Pitt, who I usually don't like or at least am indifferent too, is perfect as Death experiencing life in someone else's body.  Claire Floriani (sp.? sorry) is ethereal, attractive and interesting without being a classic ten.  The supporting cast all great in integral to the story.  I often feel that long movies are just that, under-edited and overblown, never felt that way about this flick, not a wasted moment, and every moment a pleasure to watch on the screen.  The scene where Hopkins gets mad at death, \"remember who you are talking to\"  \"I don't give a damn\" is epic."
    },
    {
      "rating": "9",
      "text": "I think giving this movie less than 6 is a bit unfair, but I understand it is about taste but less than that?. To me is a 8.5 or 9. I am know a snob about movies, although I do know about arts. I love European movies, Hollywood movies, South American movies...as long as they are good and transmit feeling and have a point, and are good (in ther genre) I enjoy them.  I actually have the Meet Joe's Black dvd at home, because this is a great movie to enjoy if one just want to relax, smile, and at the same time experience some deep emotions. This movie is not complex,but it is never dull either. I wouldn't call it predictable for I believe it is original. I don't think the producers atempted to create an utterly profound movie; still, I believe they wanted to give a different perspective in regards to life, dead and human relationships, without being too heavy or 'trascendental'. To me, they wanted to transmit feeling but just in a light, refreshing way. I did enjoy the performances too, and I believe people who didn't enjoy this movie is probably because they were expecting to see, something that this movie was not meant to be. This film has no overly high pretentions, yet, it was a movie rich in beautiful moments, and diversity of characters. Whenever I watch Meet Joe Black I get a delitghful feeling... It is a very unique, sweet, sensible movie, that will make you smile if you let it to do so!.. I never get tired of it!And yeah! As somebody said...it is not that Brad Pitt was stale, or cold, or expresionless...but he was playing the DEATH for God's sake! Better performance, impossible, he was outstanding! Likewise, Anthony  Hopkins was magnificent! I felt his character! I did feel for him! and Claire Danes...she was perfect for the role...! Overall, the movie always felt real! How often can we find beauty when we meet Death?"
    },
    {
      "rating": "10",
      "text": "One of the best movies ever. However if you are an movie lover who needs  violence with a lot of blood, sex and vulgar dialogs, do yourself a favor and do not waste your time.\rEveryone else...enjoy!"
    },
    {
      "rating": "9",
      "text": "Very good movie, didn't realise how long it was until the I saw the time at the end but I wouldn't remove any scene. The only thing I wasn't much for was the ending, the last 1-2 minutes should have been omitted."
    },
    {
      "rating": "4",
      "text": "I must agree with  the  naysayers .   The dialog  is tedious  to say the least.  But, most seem to knock Brad and praise  Anthony Hopkins.  I think they were  equally boring.  In fact practically all the spoken words by the entire cast will put you to sleep.  I wanted to scream at them to say something worthwhile, please!  At least the leading lady and man were easy to look at.  Where can I get my hair done like Brad Pitts?  Never mind, I don't have  enough hair  left!  Don't know what the ladies found tearful about this movie.  I am going to get a suit and tie like Brad's in the cafe.......maybe a hairpiece too!"
    },
    {
      "rating": "6",
      "text": "The excellent movie with great cast. The plot is simple and excessively romaticized. But as the game Anthony Hopkins and Brad Pitt is fine, only for the sake of it it is worth watching this movie."
    },
    {
      "rating": "8",
      "text": "Meet Joe Black. Taxes and death. Quite an unusual story and excellent acting. Brad Pitt and his character Joe Black deserve special praise, who often changes from a sweet and funny guy to a harsh, cold and insensitive person."
    },
    {
      "rating": "6",
      "text": "In this film, Death takes the body of a person to be able to approach William Parrish, a media mogul to whom she asks for information about human life. Speaking in these terms, it looks like an old tale brought to this day. However, although the idea is good and the film has truly beautiful moments, its far from perfect. The film is quite elegant and has a beautiful cinematography, full of warm colors and little contrast, as if everything developed in a late afternoon or next to a fireplace. The actors are veterans that we like to see working, the environments, sets and costumes are exquisite... its good, the film has quality! Brad Pitt and Anthony Hopkins make a good pair when they split the screen, being able to get the best of each other, as well as being both icons of male charm, each on its own way. Claire Forlani also made a good, very restrained but strong performance, although the romance with Pitt's character is as cold and impersonal as his character. I said the movie was not perfect, remember? Beginning with the actors, Pitt made several mistakes and did certain things he shouldn't. His character is always lacking in human warmth and, if Death really wanted to learn more about humanity, this was something that should have gradually emerged in this character, especially when he falls in love. Love is the most intense and transformative human feeling and this is never suggested to us... I don't know if Pitt accepts without criticism everything directors and writers say he has to do, but it's his duty not to let his character fall, so he should have had the perception of the mistake that would be to keep such coldness from a certain point. But there are more problems: the script has an excellent main plot but is too dense and there are too many subplots, and that only helps to get the film out of focus. The director, Martin Brest, did a good job filming but clearly didn't give great relevance to pre and post production. He should have scrutinized the script better, eliminating some things, as well as requiring the editing team to cut out what was left over. And there's plenty of leftovers in a super slow movie, which drags on for three hours without any need, with overly long or ancillary scenes. It's a beautiful movie, but it's tedious to watch because we just lost the patience needed to watch something so long and so empty."
    },
    {
      "rating": "5",
      "text": "Quite possibly the \"first-draft-iest\" movie I've ever seen, if there were such a superlative, \"Meet Joe Black\" has some terrific ideas in it, but it's all nearly done away with in favor of flowery dialogue, non-essential narrative excess and a muddling of character. This is an odd movie for me to talk about, as I've always found its concept fascinating. I've also been clinically unable to unearth it from the old, never-ending backlog of movies I have to see. Until now, that is. This in mind, though, I don't think I would have expected this movie to be about what it's actually about, preconceived notions notwithstanding. Without giving away too much, there's a tremendously awkward, clunky and at times troubling dynamic involving how Brad Pitt's \"Death\" comes to be corporeal. I just could not get on board with the idea, even with the satisfying manner in which it comes to an end. As briefly alluded to up top, this movie's runtime is nearly unforgivable. It's three hours long. It did not need to be three hours long. Cut something. I'm looking at you, unnecessary corporate shenanigans subplot. That said, the score for this is quite simply some of the best music you'll probably ever hear in a movie, regardless of the fact that the accompanying images hold little to no weight for at least 85% of the runtime. If you ever wanted to hear a composer work his proverbial ass off to make a movie a seem more interesting, take a listen to what Thomas Newman's done here. It's sublime. All in all, \"Meet Joe Black\" means well and is handsomely crafted, but I just felt unquestionably distant from the highfalutin nature of it all."
    },
    {
      "rating": "6",
      "text": "/    /"
    },
    {
      "rating": "9",
      "text": "brilliant story,beautiful ending,interesting script and good performances from the actors"
    }
  ]
}