{"id": 1626, "title": "Meet the Robinsons", "starring": ["Jordan Fry", "Wesley Singerman"], "runtime": 95, "genre": ["Animation", "Comedy", "Family"], "description": "Lewis, a brilliant young inventor, is keen on creating a time machine to find his mother, who abandoned him in an orphanage. Things take a turn when he meets Wilbur Robinson and his family.", "releaseYear": "2007", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/dBFnxopMSB3vKPV4Zl1wDYuurCn.jpg", "categories": {"plot": 6.314285714285714, "acting": 5.8125, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.583333333333333, "funny": 6.090909090909091, "action": 5.5}, "reviews": [{"rating": "9", "text": "Geez, this is so underrated and forgotten. It's amazing; one of Disney's best movies, and definitely their best CGI movie! Memorable characters, a funny villain and a clever premise! This should have won best animated feature in 2007."}, {"rating": "8", "text": "It was a surprisingly good movie."}, {"rating": "9", "text": "It's a travesty how forgotten this masterpiece is. Whenever someone says \"Disney Classic\" they always think of The Lion King or Beauty and the Beast but very few people think of this. The villain is funny, the characters are likeable and the story is great. An underappreciated Disney gem."}, {"rating": "8", "text": "It's a little decent and it'll be a family film about families all in different ways. Surely an underrated Disney film and it deserves a bit more than that."}, {"rating": "9", "text": "Meet The Robinsons is one of the Disney films from my childhood that kinda fell into obscurity. I remember when it first came out not being really interested in it but then one day I caught it on TV and it totally changed my mind. It is a great story with a lot of great messages for children and adults. The motto \"Keep Moving Forward\" is the obvious lesson to learn which of course means dont let the past hold you back and learn from failure. The other lessons are a bit less obvious. I wont go into them in this review since I think its up to the viewer to pick it up on their own. The one thing I think this movie has going against it is it looks like a cheap Pixar knock off. The animation at times can look cheap and when you realize it was made by Disney you are left wondering what happened. Overall the movie is fantastic and I highly recommend showing it to your kids"}, {"rating": "10", "text": "My gosh, I can't believe how severely underrated this movie has been! It is definitely one of the best kid's movies I've watched (and I've seen a few), and the only one that I watch regularly under my own steam."}, {"rating": "4", "text": "A generic, inoffensive attempt at Disney trying to make a Pixar film and failing. I can't imagine anybody, children or adults, having an overwhelming positive take on this because of how incredibly bland it is. The only funny part is in the trailer, and after having seen it so many damn times, it was exhausted seeing it in full context. Step it up, Disney."}, {"rating": "9", "text": "Great manic fun with a beautiful visual style from William Joyce."}, {"rating": "3", "text": "Rarely has any movie--any genre, animated or not--so completely, frustratingly, maddeningly self-destructed in so many different ways after such a promising, enjoyable start. Lewis, an orphaned child who grows up to be a pre-adolescent would-be inventor (with a hairstyle that's probably meant to evoke Back to the Future's Doc Brown but put me more uncomfortably in mind of There's Something About Mary) builds a portable time machine in hopes of visiting the past and discovering his real parentage...until his plans get interrupted by a slightly older boy from the future who needs his help and a stereotypical, Oil Can Harry-type villainous figure looking to throw several monkey wrenches into the works. This Disney-produced CGI film's early scenes--set in Lewis's orphanage and at his school's science fair--are fun, and feature several amusing characters: an overcaffeinated teacher, a dimly self-important coach (who wears the most potentially obscene pair of shorts ever seen in a G-rated feature) and the orphanage's appealingly levelheaded director (warmly voiced by Angela Bassett). Once the time travel begins, everything falls apart. The futuristic Robinson family that Lewis encounters in his adventure is apparently three parts the Sycamore clan from Frank Capra's You Can't Take It With You and two parts the Addams family; they (and this picture) suffer from the same malady that thoroughly wrecked Madagascar, Robots, Shark Tale, nearly every Simpsons episode of the last ten years and every Family Guy episode period--a willful lack of comic discipline on the part of the filmmakers and writers that allows them self-permitted carte blanche to throw every joke they came up with in script conferences (no matter how unfunny, tasteless or character-inappropriate), guaranteeing a singularly annoying moviegoing experience to be followed in three months by a DVD with no deleted scenes. Worst of all is this movie's astonishingly heartless climax, in which a peripheral character we care about is left out in the cold and the only plot element in which we had any emotional stake is cavalierly dismissed. The movie's theme, delivered with predictable sledgehammer subtlety, is to forget the past and look to the future--a philosophy the movie ascribes to Walt Disney himself--but all the brightly-colored if unimaginative design, 3-D gimmickry and the apparent eleventh-hour participation of Pixar genius John Lassiter in a futile attempt to patch this mess together doesn't change the fact that the kids in my audience (who spent a lot of Meet the Robinsons' running time chasing each other up and down the aisles and throwing popcorn) were far more interested in the vintage Mickey Mouse cartoon that preceded this. Roger Ebert once postulated that it's impossible to make a good movie that features a hot air balloon (and later admitted that he forgot The Wizard of Oz). Well, repeated viewings of It's A Wonderful Life, the Back to the Future movies, the Terminator films, Time After Time and (of course) the 1960 version of The Time Machine could convince many moviegoers that it's equally impossible to make a BAD film that features a time-travel device. No, it isn't."}, {"rating": "3", "text": "I'm a big fan of animation, (and the offspring of a long-time Disney employee), but I was especially disappointed by this film. The \"plastic\" (or plaster?) appearance of the characters was not at all charming, and the jokes were stunningly flat. I saw it on DVD, having missed the 3D theatrical release, and had to fight the urge to turn it off before it finished."}, {"rating": "2", "text": "An absolutely despicable waste of time and an insult to animated cinema, Meet the Robinsons is not funny or entertaining at all, and is easily one of the ten worst films I've ever seen. I only give it a 2 because it has nice CGI animation, other than that it's a horrible mess of monumental proportions. Another fantastic reason for why I have such difficulty liking these animated films."}, {"rating": "9", "text": "this is way better than Chicken Little"}, {"rating": "3", "text": "For a Disney film, I never felt so disappointed after seeing something like this. I mean Cars was a little bizarre and forgettable in my opinion, but this was worse. I saw this in theaters with my parents when it came out. I was around 16, and was thinking that maybe I'm getting too old for Disney. After I saw this, I never saw it again. The characters are forgettable, the dialogue was confusing that I don't think a kid would understand word their saying. The story I will admit is pretty creative, but it doesn't hold up and feels kinda bland even if its Disney. After I saw this, I was about to give up on Disney. This movie almost made me want to avoid the surprisingly greatest ones coming after it like Up, Wall-E, Tangled, Toy Story 3, and Brave. This almost killed my Disney spirit, and its so sad to believe that would ever happen."}, {"rating": "6", "text": "It's Not Bad ...But I Wouldn't Ask To See This Movie Again Or Buy The DVD Or Blu-Ray... As I Said It's Not Bad But It's Boring"}, {"rating": "7", "text": "The 3D version is visually stupefying."}, {"rating": "8", "text": "its a very funny animated movie that is great for the kids it could have a bit more morals to it but it was a film for the kids."}, {"rating": "8", "text": "it's a really good movie. It is something different which has a lot of imagination, though it can be better. Characters could have had more personality and even more action could be added."}, {"rating": "10", "text": "it has a neat phrase Keep Moving Forward."}, {"rating": "10", "text": "This is a great childrens movie that moves at a good pace for short attention spans and has a feel good moral theme that all children should hear."}, {"rating": "7", "text": "Glad to see the critics are mostly liking this. I was thoroughly entertained by this one, which falls somewhere between \"Over the Hedge\" and \"Flushed Away\" for me (for those familiar with other recent animated offerings). It works on multiple levels, and though the story may not be completely original, it has the feel of something you have not seen before. Trust me, you could be dishing your hard-earned dollars for sooooooo much less... Well recommended."}, {"rating": "10", "text": "really good disney film that goes back to disney's roots, a really good film for children, teenagers, and parents. Really good message and reminds us of the disney films we grew up with."}, {"rating": "10", "text": "I thought this movie was great! I saw it twice and in 3-D. I just love it. I thought it had a great story and a great message for kids. This movie is def. for all ages soo get out there and see it!!"}, {"rating": "0", "text": "This movie was so bad I just about threw up on myself! It was a total disgrace to disney!"}, {"rating": "10", "text": "I love this movie. A little predictable and a few consistency issues but the message is inspiring on a personal level for me. This is one of my favorite movies."}, {"rating": "10", "text": "I think this will be a comeback for disney animation and a great source of neat material as well."}, {"rating": "0", "text": "This movie is terrible and a disgrace to Disney. If you have any respect for classic Disney or even for yourself, DO NOT see this movie."}, {"rating": "7", "text": "3D Animation is superb, but the story will be quite confusing to young children but nevertheless a lot of fun."}, {"rating": "10", "text": "Incredibly underrates by critics, this film should amass a cult following in the future. Disney's most moving animated feature since \"Lilo & Stitch,\" \"Robinsons\" combines a wildly imaginative visual style with a sweetly moving family story. I laughed lots, and cried even more. A perfect little gem."}, {"rating": "9", "text": "I have to agree with the critic who said this movie must be made for kids w/ ADD...the first 2/3 of this is film is a frenetic rollercoaster ride. It's not until the last 30 min that it settles down and the story comes full circle. And then I cried, because I'm a sap."}, {"rating": "7", "text": "Great movie. It was actually entertaining enough I'll admit. Worth a watch."}, {"rating": "7", "text": "Taking in account that it's a animation movie for kids, it's quite fun to watch. Cliche jokes that turn out pretty funny and crazy characters to roll it all up. I had lots of fun watching this."}, {"rating": "6", "text": "It is a mix of old and new ideas that work out pretty well. This is very family friendly and the plot may be outrageous, but the charm remains."}, {"rating": "6", "text": "Mildly entertaining animation with some good humour and a decent story but average visuals."}, {"rating": "6", "text": "Son interesantes los personajes y de por sí los viajes en el tiempo, pero en algún momento parece no tener sentido e incluso no parece tener el sello de Disney."}, {"rating": "5", "text": "This effort from Disney is ok for the under 10 crowd, but teenagers and adults alike will tire of this tepid film. The bright colors are overwhelming on the eyes, the characters are not very interesting, and the plot is confusing. There are very few laughs and it moves too slowly for my taste. On the other hand, the message is positive, but that's about it. If a little more effort was put in, this movie could have risen to its potential."}, {"rating": "8", "text": "Funny, interesting with a perfect twist to conclude."}, {"rating": "5", "text": "While not even close to the past of Disney, \"Meet the Robinsons\" is average as to expect, but its still quirky and fun at times. With strange characters like time-traveling dinosaurs and singing toads (annoying, but bearable), it's not too bad, but the main characters could have used alot of more development on them. It does have blandness in it with story and all, but you can sometimes feel some sympathy towards the main character, so thats okay. While it's tepid and all, kids will love it, but Disney fans would probably be annoyed how its Disney's third film in a row that fails to deliver much."}, {"rating": "5", "text": "'Meet the Robinsons' is as formulaic as it is quirky. The film becomes boring rather quickly, and the orphanage subplot is a sob story winded far too long. There are some laughs, but not enough from what I would expect from Disney"}, {"rating": "4", "text": "Meet the Robinsons is that kind of annoying kids movie where the protagonist is so innocent and gullible that he ends up being unlikable by the end. It's too bad, as the story had real potential."}, {"rating": "7", "text": "While I'm generally familiar with Disney's \"post-Renaissance\" films from the 2000s on (especially the more recent ventures), \"Meet the Robinsons\" was one of the few post-Renaissance films I didn't really catch when it first came out. Sure, it looked cool, and I remembered trying to watch it once as a child, but I fell asleep during it (I was really young and it was late at night and all that), so seeing that it was on Netflix gave me the itch to give the film a shot and see what it had to offer, and sure enough, it was a solidly enjoyable flick! Charming and emotional with great characters and some decently inventive animation, \"Meet the Robinsons\" twists and turns in plenty of interesting ways and makes for some very fun family entertainment. Sure, you can tell this was one of Disney's first CGI ventures because the animation hasn't aged well in certain areas, and you can tell this was a film from Disney's post-Renaissance slump because there's definitely some pretty cliché moments, but with so much humor and emotion, there's definitely a lot to love about \"Meet the Robinsons\" and it's definitely worth giving a shot."}, {"rating": "6", "text": "Meet the Robinsons is extremely underrated.\rA very intriguing story intermixed with a very good message, Meet the Robinsons succeeds to be a fun loving kids movie."}, {"rating": "6", "text": "Meet the Robinsons , it was almost good movie , excellent plot, touching the end but throughout most of the movie a bit boring , but the family of the future if it is pure imagination."}, {"rating": "7", "text": "Meet the Robinsons is a delightful family sci-fi film, and one of Disney's strongest 2000's work. Many of the characters are likable, and the villain does its job of being unlikable. Very underrated movie."}, {"rating": "7", "text": "Una comedia animada bastante entretenida con una historia muy buena de viajes en el tiempo."}, {"rating": "7", "text": "Overall it was enjoyable, but had one big downfall. I will get to the bad part later, but it has great parts I want to talk about first. The story was really good, a mix of many things together. The animation was amazing, and had no faults. They had one bad part, the characters are not good. They should have made them have better stories, and they feel like characters from a different movie. It was enjoyable overall."}, {"rating": "8", "text": "A movie that explores time is always interesting and this movie doesn't let down: the plot is interesting, the villain is very good and the characters overall are well explored. However, I felt like it has serious pacing issues - some parts of the movie are way too slow and some parts wrap up too quickly."}, {"rating": "7", "text": "It has some noticeable plot holes here and there, but overall is a very good movie with nice plot twists and nice character development. It however sacrifices some complexity for the younger audience and it isnt groundbreaking in terms of animation for a 2007 animated movie, but it does the job just fine."}, {"rating": "9", "text": "A really funny and engaging movie. The animation holds up to this day and moves at a fast but good pace."}, {"rating": "10", "text": "Esta película siempre me ha dejado un gran recuerdo, me encanta. Ha sido una de mis favoritas de la infancia."}, {"rating": "9", "text": "this movie is awesome and amazing! i rate this movie a 9/10! the 2nd movie of walt disney animation studios on CGI"}], "recommendations": ["atlantis_the_lost_empire", "the_croods", "hotel_transylvania", "ice_age_the_meltdown", "zootopia", "the_lego_movie", "my_little_pony_the_movie", "rise_of_the_guardians", "rio_2", "hotel_transylvania_2", "home_on_the_range", "cloudy_with_a_chance_of_meatballs_2", "bolt", "ferdinand", "shaun_the_sheep_movie", "turbo", "paranorman", "despicable_me_2", "ice_age_continental_drift", "the_peanuts_movie", "storks", "puss_in_boots_the_last_wish", "hotel_transylvania_3_summer_vacation", "monsters_university", "incredibles_2"]}