{
  "id": 4507,
  "title": "Meet Dave",
  "starring": [
    "Eddie Murphy",
    "Elizabeth Banks"
  ],
  "runtime": 90,
  "genre": [
    "Comedy",
    "Science Fiction",
    "Adventure",
    "Family"
  ],
  "description": "A crew of miniature aliens operate a spaceship that has a human form. While trying to save their planet, the aliens encounter a new problem, as their ship becomes smitten with an Earth woman.",
  "releaseYear": "2008",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3Qfav5aVRcZmq854olMjJ795JJ2.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 7.5,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 5.0,
    "funny": 5.125,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Most New Yorkers aren't the trusting sort. Most New York moms would be hesitant about leaving their sons home alone with a stranger they barely knew. After hitting a brother from another planet with her car, Gina Morrison(Elizabeth Banks) discerns nothing at all peculiar about his \"coincidental\" materialization across her apartment window, or the fact that he's injury-free, without a trace of bloody muss on his body and natty attire. \"Meet Dave\" is a comedy, but a comedy needs some semblance of realism in order for the farcial circumstances to provoke unstrained laughter from the audience. In Ron Howard's \"Splash\", the mermaid played by Daryl Hannah may act unusual, but not unusual enough to try our patience. Even when \"Madison\" shatters all the lobster tanks as she says her name using the aquatic parlance(right then and there, the Tom Hanks character should recognize that the girl isn't human), we permit the film some leeway, because the mermaid had seemed human enough to our satisfaction. That's why \"Meet Dave\" doesn't work. Dave's behavior is so erratic, the mother should either drive this odd behaving man to a hospital for a full psychiatric evaluation, or stay far, far, far away. She seems stupid. And stupid people are anathemic to comedy. An even bigger mess posited by the film's refusal to enmesh the fantastical in a lifelike milieu, are the aliens themselves, who seem suitably human before they supposedly acquire our cultural and social norms. The only flash of wit on display in \"Meet Dave\" is the alien's Chinese surname, in conjunction with the spoof for Nike's \"I am Tiger Woods\" television advert(the one where people of all colors claimed to be Eldrick). Like Dave, Woods is not completely black(he's actually 1/2 Asian, 1/4 Black, and 1/4 American Indian), even though the golfing phenom is marketed like he was a brother from another planet."
    },
    {
      "rating": "1",
      "text": "What an embarrassing movie. What a waste of talent. Perhaps it's American humour of some sort, that I don't understand. Maybe it's just for small children. Shame, I love Eddie Murphy. It could have been so much better, the idea was very good."
    },
    {
      "rating": "0",
      "text": "Annoying."
    },
    {
      "rating": "10",
      "text": "Made me laugh."
    },
    {
      "rating": "10",
      "text": "Good comedy by my favorite actor Eddie Murphy. I found only his acting was good, but i felt the effects could have been made better. Overall i like it."
    },
    {
      "rating": "0",
      "text": "It's pretty interesting how much unfunny trash people have allowed Eddie Murphy to make in the last 20+ years. Steve Martin is one of his true rivals; he hasn't done anything that wasn't violently uncomic in a few decades either, and yet he too keeps getting leading roles in superfluous gross-out 'family' pics and other similar dreck. That people are still giving Murphy what looks like vanity projects, and that people watch it, is simply mind-blowing. I guess people really are that stupid."
    },
    {
      "rating": "0",
      "text": "Horrible. Save us all and just retire Mr. Murphy, your films are crap."
    },
    {
      "rating": "8",
      "text": "A load of great actors and actresses. Dave is seriously funny. I'm about to watch it again.\r Watch it online for free: https://www.primewire.ag/watch-545-Meet-Dave-online-free"
    },
    {
      "rating": "7",
      "text": "Unlike these other 4 I'm going to give this movie a realistic review. It was a very good comedy, but it wasn't the best. It had good moments, with funny or sometimes unfunny stereotypes. And seeing Eddie Murphy, pilot Eddie Murphy as an alien unfamiliar in Earth Culture was hilarious. Towards the end, the movie they had the cliche 'Alien says good bye to humanity to leave' and the 'Two characters fall in love' which made me like it less. Deffinately worth seeing in theaters. Won't be your favorite though."
    },
    {
      "rating": "5",
      "text": "This movie isn't really horrible but it's not that great either.  The plot is insanely predictable and not really that interesting.  Most of the jokes are bland and not that funny, there are a few that caught me off guard and did make me laugh.  This is just your standard fish out of water in New York story.  Overall this movie isn't anything special and you aren't missing anything if you don't see it but there are far worse movies that you can watch and you wont be to disappointed if you catch it on TV or get it as a cheap rental."
    },
    {
      "rating": "4",
      "text": "es entretenida pero no del todo convincente para mas clificacion me quede en un 4.6 pero no alcanza a un cinco porque falta aun mas para algo mas expansivo en la comedia, pero sin embargo es muy poco ridiculo es algo pasajero que se intento aprovechar"
    },
    {
      "rating": "6",
      "text": "Despite it's cringe worthy humour and an over the top boring and predictable ending, this family friendly movie is not a total disaster. The acting wasn't too bad, the movie was entertaining for the most part and the plot, although predictable and unoriginal was still interesting enough to keep the viewer at the very least, a little bit interested. All in all, it's not as bad as people say it is, but it's not a good movie either."
    },
    {
      "rating": "4",
      "text": "Like Disney's second Shaggy Dog remake, this is another one of Brain Robbins' movies we find him better for. Even though the backtalk is not acceptable here, but really."
    },
    {
      "rating": "0",
      "text": "Le grimaçant Eddie Murphy nous sort une de ses pantalonnades de golios dont il a le secret !... alors, tous aux abris, car la merde vole très bas et ça va chier dans le ventilo...On a donc un festival de grimaces et de gros yeux, car ça, il sait faire, Eddie, rouler des yeux ! on a aussi une solderie de gags sortis de Vidéogag ou plutôt récupérés (très vraisemblablement), des gags dont personne ne voulait, pas même Vidéogag...C'est poussif, ultra débile et aussi ennuyeux que super débile ou aussi super gogol qu'archi chiant : on salue la prouesse et on dit chapeau pour le boulot abattu parce que putain ça troue le cul, un naveton pareil !"
    },
    {
      "rating": "6",
      "text": "----------------------------------6.0/10-----------------------------------"
    }
  ]
}