{
  "id": 3284,
  "title": "Meet the Parents",
  "starring": [
    "Ben Stiller",
    "Robert De Niro"
  ],
  "runtime": 108,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Greg Focker is ready to marry his girlfriend, Pam, but before he pops the question, he must win over her formidable father, humorless former CIA agent Jack Byrnes, at the wedding of Pam's sister. As Greg bends over backward to make a good impression, his visit to the Byrnes home turns into a hilarious series of disasters, and everything that can go wrong does, all under Jack's critical, hawklike gaze.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5tXJ9ctuyEOMUFLaeqRisbXowWs.jpg",
  "categories": {
    "plot": 5.375,
    "acting": 6.5,
    "ending": 5.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 5.333333333333333,
    "funny": 7.12,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is one of Ben Stiller's best movies. It remains consistently funny throughout and there are great performances from all of the actors. It is a lot of fun when everything goes wrong."
    },
    {
      "rating": "9",
      "text": "Meet the Parents is the kind of Hollywood Comedy that Hollywood WISHES it could make today. First off, almost 18 years later, it's still hysterical. The performances are really, really good, and the story and characters are so real and memorable. If you are looking for a good comedy, check this out!!!"
    },
    {
      "rating": "9",
      "text": "Meet the Parents is a great comedy for anyone to watch. its very family friendly, perfect amount of humor, and somewhat reminds me of what will happen when I bring home my fiancee for the first time. This movie will definitely make you want to watch the second movie and the acting is pretty great. Since this was the first movie in the series, this particular one is the best one. If you want a good laugh, this is the movie for you."
    },
    {
      "rating": "9",
      "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°°●°●°●°●°●°●°●°●°=_=_=_=_=_==_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_="
    },
    {
      "rating": "9",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "9",
      "text": "First off, I would give this a 9.25 out of 10. It's really funny. Acting is good. Score all right, and a good story. All thought the rest of series have been not great, , this one was really great. Overall, this is a great comedy. If you like a great comedy, then this is for you."
    },
    {
      "rating": "9",
      "text": "An amazingly fresh and original comedy that is flat at hilarious. Robert De Niro is perfect for his part like everybody else but he had the best performance in this movie. I would recommend this to anyone that likes to laugh really hard and really loud."
    },
    {
      "rating": "7",
      "text": "\"Meet the Parents\" is a appropriately lengthened family movie with decent acting. It's a very obvious comedy-family formula Hollywood loves to use, but surprisingly this movie's one of its kind."
    },
    {
      "rating": "8",
      "text": "A rather good comedy, Can be a little boring at times but it was enjoyable. De Nero played his role perfectly and the chemistry he had with stiller shows on screen. Well worth watching."
    },
    {
      "rating": "0",
      "text": "This movie was terrible. Anyone who thinks the definition of comedy is to have the one likeable and the only fleshed out character of the film to be bullied for two straight hours by one dimensional dickheads, should not have any creative control over a movie. It was a terrible watch. After seeing one character whom the movie depicts as totally normal and perfect for a girl get undeservedly trashed for a whole film, youd expect some kind of retribution which the film doesnt even attempt to offer. Oh yeah, and the girl for whom he suffers all this humiliation for is depicted as selfish, absent, cold, uncaring and vacuous. A movie which shouldnt have been made. With the cutting edge comedians now working TV, this kind of comedy was done to death 60 years ago. And much better ..."
    },
    {
      "rating": "8",
      "text": "An extremely funny film. Robert De Niro is flat out brilliant and works perfectly in this film by keeping to his gangster style.From cat piss on the ashes to robert de niro asking ben stiller if he could milk him cause he had nipples,  this movie has new ways to entertain."
    },
    {
      "rating": "7",
      "text": "Not one of my favorite comedies, but it isn't bad. Definitely better than the second part. DeNiro's face expressions were priceless. The whole movie is fine, but far not the funniest comedy."
    },
    {
      "rating": "6",
      "text": "An overall decent movie, even though I can really not stand some of the actors. Best parts of the movie obviously involve DeNiro, whose non-verbal performance and facial expressions make the movie worth watching."
    },
    {
      "rating": "9",
      "text": "Come, on movie raters - 6.6? That's the average? This movie is undeniably funny, and even kid of sweet in parts. HIlaroious entertainment and great family fare - so who are these knuckleheads that keep giving it 0s or 1s? Come on, guys, this movie is a scream!"
    },
    {
      "rating": "7",
      "text": "Meet the Parents is consistently funny (just the fact that the main character is named 'Gaylord Focker' had me in stitches), and it reveals a hilarious chemistry between DeNiro and Stiller. It's a classic battle with the soon to be in-laws."
    },
    {
      "rating": "9",
      "text": "Ignore all those snobby critics! This film made me laugh, and thats the whole point of watching a comedy."
    },
    {
      "rating": "7",
      "text": "Very overrated movie, but that's not to say it's bad in the least. It made me laugh here and there, and gave me chuckles for most of the movie. I usually don't laugh at these movies because I feel pretty bad for the character, which is why I think it's important to make the character a bit unsympathetic, that way feelings don't get in the way of comedy."
    },
    {
      "rating": "7",
      "text": "Stiller does a good job but it's De Niro that really steals the show in this movie. It's funny from start to finish and a pretty enjoyable comedy to watch."
    },
    {
      "rating": "6",
      "text": "As per the title, it's all about family. We've all been here. Meet the Parents is meant to be relatable and we love it that way. It's really, really funny."
    },
    {
      "rating": "8",
      "text": "There are some very funny moments in the movie, but sometimes it is a bit too onesided and unrealistic. Top acting though."
    },
    {
      "rating": "7",
      "text": "May seem to be funny at some points, but it's a flat-out. What doesn't stop this movie from getting to the negatives is how the story usually just keeps moving on and on without caring about any of its flaws."
    },
    {
      "rating": "8",
      "text": "An enjoyable comedy with lots of laughs from start to finish with a brilliant cast and even one of the best composers, Randy Newman. He creates a great soundtrack for the movie which works quite well for this movie."
    },
    {
      "rating": "7",
      "text": "i still laugh at this **** looking at robert de niro in a comedy movie making people laugh??? watch this."
    },
    {
      "rating": "9",
      "text": "A very funny movie. From cat piss on the ashes to robert de niro asking ben stiller if he could milk him cause he had nipples (don't ask) this movie has new ways to entertain. In my opinion, not the best film in the entire world unlike T, and not as unique as other in-law films, but then again it's both an in-law film and it isn't, but in its own unique way it is, so a great film and the parents should watch this one before meeting your daughters 32 (give or take a few) year old boyfriend. You;ll find out ways to make sure he isn't interested in her breasts nothing more, making this a bit of a documentary."
    },
    {
      "rating": "8",
      "text": "It was a good comedy and family movie."
    },
    {
      "rating": "5",
      "text": "Some quite funny bits and De Niro is good but ultimately settles for too much farce to be good."
    },
    {
      "rating": "4",
      "text": "be nice to this one..Meet The ParentsA surprise from Ben as it doesn't go anywhere; neither does the character nor the script, just some one liners helps you survive it."
    },
    {
      "rating": "8",
      "text": "You can still laugh at Gaylord Focker, it's been ages since I last saw the film, but it hasn't lost its charm.Strong cast and lots of funny situations and dialogues, classic."
    },
    {
      "rating": "10",
      "text": "Greg's MCAT scores are (out of 15): 14 Verbal reasoning, 13 Physical Sciences, 15 Biological Sciences, and an R on the Writing Sample (very high)."
    },
    {
      "rating": "8",
      "text": "A family friendly and entertaining comedy.This is one of Stiller's best movies and arguably De Niro's finest comedic performance."
    },
    {
      "rating": "9",
      "text": "¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤•••••••••••••••••••••••••••••••"
    },
    {
      "rating": "9",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;::;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "9",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"
    },
    {
      "rating": "9",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●●♡●♡●♡●♡●♡●♡●♡●♡●●♡*.*.*.*.*.*.*.*.*.*.*.*.*"
    }
  ]
}