{
  "id": 360,
  "title": "Megamind",
  "starring": [
    "Will Ferrell",
    "Tina Fey"
  ],
  "runtime": 96,
  "genre": [
    "Animation",
    "Action",
    "Comedy",
    "Family",
    "Science Fiction"
  ],
  "description": "Bumbling supervillain Megamind finally defeats his nemesis, the superhero Metro Man. But without a hero, he loses all purpose and must find new meaning to his life.",
  "releaseYear": "2010",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uZ9ytt3sPTx62XTfN56ILSuYWRe.jpg",
  "categories": {
    "plot": 7.1,
    "acting": 7.222222222222222,
    "ending": 7.666666666666667,
    "soundtrack": 7.666666666666667,
    "cinematography": 3.0,
    "familyFriendly": 7.0625,
    "funny": 7.4,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Great movie for the whole family! Great voices and quite a few twists! Very funny and very happy with the story line and ending, you won't be disappointed. To the critics: who cares if its a Superman sattire? It's a great movie!"
    },
    {
      "rating": "8",
      "text": "Great movie! i especially like the concept of the bad guy wanting to be good. the story is also very good, Will Ferell did a great job in this movie."
    },
    {
      "rating": "9",
      "text": "Megamind may be somewhat similar to Despicable Me, but it has a lot that makes it more unique. It is a lot more adventurous and daring and it feels like a great comic book story."
    },
    {
      "rating": "10",
      "text": "I love this movie best kid's film ever, very funny, very entertaining and very good. u will not regret seeing this!!! and it has the very good twist ending!"
    },
    {
      "rating": "7",
      "text": "I was pleasantly surprised that I actually enjoyed the movie, which is the reason I gave a 7. But technically speaking, the story is incredibly ordinary, the voice acting is average and the whole concept was dull and boring. The scenes of the movie, though, are very funny and a little bit intriguing, which incredibly saved the movie. Not a perfect movie, but it is definitely worth watching for............"
    },
    {
      "rating": "7",
      "text": "A city without a hero is indeed a bummer, but for the villain, it could be a catastrophe. Why formulate a nifty plot that will overtake the world if no one out there is good enough to challenge it? Where's the fun in building an enormous, vicious, dancing machine if no man of equal awesomeness will stand up to it? Megamind (Will Ferrell) knows this feeling all too well.\r When he was just a little infant, with skin as blue as an Avatar's and with a head as large as a papaya, Megamind (Brad Pitt) was sent to earth by his parents right before their planet was obliterated by a natural calamity. Just as we humans are about to complain again about the typhoons and global warming in our planet, we see theirs get sucked into a black hole.\r Read more here: http://localmoviereview.com/megamind-movie-review/"
    },
    {
      "rating": "7",
      "text": "\"Megamind\" has the \"bad guy quality\" that has been shown in \"Despicable Me\", but is able to shine will more clever humor than what \"Despicable Me\" had to offer. While it does use recycled material (or what seems to be) from \"The Incredibles\", it still is a somewhat original film with its characters. While no where even close to \"The Incredibles\", \"Megamind\" is still enjoyable, and its characters are likable. Its humor and storytelling is not too bad, but still could have been worked on, as sometimes the story feels written by a committee with its overdoing plot points. Despite these flaws, the film is able to work, as its voice work and animation is enjoyable to watch, leaving audiences in for a treat of laughs."
    },
    {
      "rating": "7",
      "text": "Not as intelligent or even as humorous as it thinks it is, but Megamind stills has plenty of surprising wit and well designed special effects to make it fun entertainment for kids and adults."
    },
    {
      "rating": "8",
      "text": "As far as Dreamworks movies go, I do prefer Prince of Egypt, Shrek and How to Train Your Dragon, but Megamind is one of the studio's better movies. While the film loses its way in the story just towards the end, and slackens in the pace a tad at that point, it is still smart and very entertaining. In general, the pace is fast and furious, while the story is original and exciting. I also enjoyed the voice acting, I don't care for Will Ferell but still thought he was brilliant as the zany and very lovable titular character, while Brad Pitt also entertains and Tina Fey is suitably sassy. The characters all add a lot to the movie, Megamind for me is one of the better title characters in a Dreamworks film.The film is also hilarious, the dialogue is funny and smart and the sight gags and references come by thick and fast. I particularly loved Ferell's Marlon Brando impression, one of the better laughs of the film. The music is memorable and energetic, with some nice song choices, while the animation is fantastic, very crisp and smooth with some amazing colours. All in all, this is not Dreamworks' best, but it is one of their better and funniest movies. I do recommend it, it is terrific fun. 8/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "OMG, this film was phenomenal. Jonah Hill & Will Ferrell were fantastic. So can not believe I waited so long to finally watch this. So hope they would consider a sequel someday."
    },
    {
      "rating": "10",
      "text": "Megamind is a piece of art and needs to be watched by every single human in existence."
    },
    {
      "rating": "6",
      "text": "The movie is admittedly fun to watch....for the sake of the kids. All those audience critics who are experienced in watching dream works animation will be very familiar with the tedious formula of the 'bad guy becomes good guy after experiencing enlightenment' dream works ALWAYS uses."
    },
    {
      "rating": "10",
      "text": "This movie was a lot of fun.  Suitable for all ages.  I caught the 3D version, and it was very well done.  Will Farrell was very funny as Megamind.  If you like his comedy, you will like this movie."
    },
    {
      "rating": "10",
      "text": "This movie will leave you scratching your head, asking yourself 'what just happened?'. Will Ferrell at his best! Megamind will blow your mind, and this is no joke!"
    },
    {
      "rating": "8",
      "text": "This film is definitely worth a watch. The graphics were very good and the story had some fun twists. Unfortunately like all recent disney movies, (except for toy story 3) it lacks the charm that the old disney had.It does have some charm though and it has a decent story."
    },
    {
      "rating": "6",
      "text": "Not nearly as funny as it should be mostly because of the talented voice cast, or as entertaining, but it brings laughs, originality, and dazzling animation. I give this film 61%."
    },
    {
      "rating": "8",
      "text": "Soundtrack was great and the movie was a lot of fun.  Many people in the theater laughed out loud throughout the movie and I found myself doing so as well.  It was good but not great.  Don't listen to the haters.  Anyone delving too deep into the plot or character development missed the reason for going to an animated movie in the first place.  The kids enjoyed it and so did I.  Thats all that matters to me."
    },
    {
      "rating": "8",
      "text": "A very enjoyable movie that turned out to be better than I thought it would, despite the rip off from Superman in the beginning of the movie."
    },
    {
      "rating": "10",
      "text": "This movie addresses an interesting question; what defines a super hero?  Or for that matter, what defines a villain?  In Megamind we find Will Farrell playing a super-villain now lacking a hero to match himself against.  In a fit of boredom he attempts to create a different challenge and finds himself defending the city he loves to torment.  This film accomplished something wonderful; it made me feel like a kid again.  I found myself smiling uncontrollably in the climax of the movie and cheering for the good(?) guy as brains clashed against its old time foe, brawn.  A must for anyone that still secretly hopes for super powers, adult or child."
    },
    {
      "rating": "5",
      "text": "Nothing special, very mediocre.  It seems as if dreamwoks was always tryng to beat pixar and never succeeded... Even the last shreks were pretty bad. MM can be entertaining... But on a very \"theres nothing left to see\" way."
    },
    {
      "rating": "5",
      "text": "In a year (or two) with some great animated films, Megamind is a dive back towards mediocrity. It's along the lines of the majority of other DreamWorks releases, a perfectly fine movie for kids to go see, with a good amount of chuckles but devoid of any kind of creativity or innovation when it comes to audiences over the age of 13. The animation and voice acting are pefectly okay, with Tina Fey being the only real stand out. A good movie for children, it's mildly funny and standard for anyone else."
    },
    {
      "rating": "8",
      "text": "\"Megamind is clever & ingenious as it is humorous & fun to watch , Will Ferrell brings his A game in this one of kind heartfelt animated movie .. that will have you laughing , some moments get a little sloppy and predictable at times but its still worth it\" .. B+"
    },
    {
      "rating": "6",
      "text": "A supervillain that was never really a bad guy, a super hero that is tired of being good and a dumb superhero that becomes nasty is a messy recipe.  Nevertheless, it was quite enjoyable at times."
    },
    {
      "rating": "5",
      "text": "Completely unoffensive in its mediocrity, as it provides a few laughs with what it thinks is an atypical story but is ultimately predictable and just another generic Dreamworks animated film. I did have higher hopes for this one though because of the voice cast."
    },
    {
      "rating": "7",
      "text": "Megamind, a supervillian conquers his nemesis, Metro Man and takes over the city, but gets bored and has no one left to fight. He creates a new foe, Titan, also known as Hal, and teaches him to use his powers for good. Instead, he sets out to destroy the world, and feeling like he has no choice, Megamind must save the day for the first time in his life.I saw it twice from January to February of 2011. The first time was 2D and the second was 3D. I have no time to waste, so I will make my opinion of this movie.Bad: It lacked an emotional feeling, the storytelling was weak and a fewer aspects of the story would've been better.Good: The CGI animation and art design were great, The acting was perfect. Will Ferell was great as Megamind, Brad Pitt did very well as Metro Man, David Cross was great as Minion and the rest of the actors did well. The characters were very likable, The action scenes were solid, The comedy was very clever, and the music score was good.Megamind doesn't top with Dreamwork Animation's previous animated efforts, but its an entertaining movie with great acting, solid action scenes, and good comedy.7/10"
    },
    {
      "rating": "9",
      "text": "Nine year old daughter says it is the best movie she ever saw!I have to admit I found myself laughing out loud more than a few times while watchingthis animated 3D movie. I even forgot I was wearing those 3D glasses."
    },
    {
      "rating": "7",
      "text": "This movie is exactly what you'd expect really, it's very funny in places and the cgi is outstanding, the plot isn't too childish and the characters are pretty funny. DVD Rental: Will Ferrell x The Incredibles = Do It"
    },
    {
      "rating": "4",
      "text": "I have to admit Mega mind was over dramatic. The whole plot kept me sleepy. I cant complain my child loved it but I didn't neither did my husband so needless to say it is not a movie that the whole family can enjoy. There were parts were they were trying to hard to be funny but they were not, i laughed at some parts and some parts tickled my humor but other then that I do recommend this movie for someone with an over active sense of humor. but each opinion is different from one another you might like it and you might not either way the choice is yours"
    },
    {
      "rating": "4",
      "text": "A mediocre, borderline bad movie.Before I watched it, I expect it to be another great movie like Shrek, enjoyable for children, yet entertaining even to adults too. I was very, very wrong.Megamind is filled with overly-cliched characters and a somewhat interesting plot, but Megamind himself is too jolly to be taken seriously as a villain, a jester or a fun-loving rule breaker maybe, but definitely not a villain. The crazy train (which I loved) insert is not helping either.It's strange I am at a loss for words to make comment about Megamind, I can't really explicitly named the problems, something about it just makes me feel wrong."
    },
    {
      "rating": "3",
      "text": "What a bore. Virtually no laughs throughout the whole movie. The 3D was non-existant, the plot was unoriginal, and the trailer literally gave everything away. After seeing what Dreamworks was capable of with \"How to Train Your Dragon\", this is beyond disappointing."
    },
    {
      "rating": "3",
      "text": "Very disappointed, Will Ferrell is a star not a cartoon voice. I wanted to see this movie so bad but the plot disappointed me so bad, who wants to see the villain become good I thought Brad Pitt was going to make a comeback and save the world. Great idea with the twist but didn't work as a kids movie. I will say that there some really funny parts but wasn't worth the time."
    },
    {
      "rating": "3",
      "text": "This movie is a disaster.  Utterly charmless, it was the first time I was really aware of the difference between a star, and Voice Actor.  As funny as Ferrell & Fey can be, vocally they are not interesting.  I miss Paul Frees, Hans Conried and the rest of that generation.  And I was born well after they did their work.  Avoid this movie."
    },
    {
      "rating": "3",
      "text": "The movie is a rehash of screen-bytes from several other movies, strung together in a pastiche of cliches. The move seemed unable to decide who was a good person and who was  a bad person. The writers present the idea that  by pretending to be someone you are not,  you can win genuine love and become an admirable person. The movie seems wish us to believe that, when the lie is revealed,  the liar becomes a hero. The plot couldn't seem to decide who the intended audience was... one minute it was frenetic smash 'em up cartoon violence, and the next morose existential self-loathing recriminations that seemed to  bore the entire audience. The color in the 3D version was exceptionally poor -  weak and watery.  We love good animated films, such as Toy Story, Monsters Inc., and Despicable Me. Sadly, Megamind is more mindless than entertaining."
    },
    {
      "rating": "8",
      "text": "I'm an adult now (18 years old) so I thought this might be a bit \"kiddish\" and predictable. However, I ended up grinning and laughing throughout the movie, even though it didn't have a complicated plot or anything. The characters were lovable, dynamic, and hilarious in their own respects! I would recommend this movie for anyone regardless of age, it is also definitely a feel-good movie."
    },
    {
      "rating": "7",
      "text": "I thought this movie was funny but I was surprised that it had heart. It was really sad. Will Ferrell's voice is all you need for a movie to be funny. It also has a great soundtrack."
    },
    {
      "rating": "7",
      "text": "Entertaining and visually well crafted animated feature.  Yet another movie that did not need to be in 3D, though I saw it that way.  Brad Pitt seems to be doing an impression of his friend George Clooney, but is out of the movie so early it doesn't really matter.  Will Ferrell does a nice job.  The bad guy becoming a good guy angle is cute too.  But for those 8-9-10 reviews, did you give Toy Story 3 a 14?  This is cute and has a nice message, but it is not even close to any of the TS films.  Rating inflation in movies is just like grade inflation in school, everything is not a 10."
    },
    {
      "rating": "5",
      "text": "Beautiful 3-d animation, cool action sequences and decent plot oddly missing humor. There are some chuckles, but bad drama isn't fun in a kid flick."
    },
    {
      "rating": "8",
      "text": "Megamind is a great movie and I thought it was something new and creative.\r My only problem with it is that the humor is not laugh at loud humor.\r Still, the jokes were still funny."
    },
    {
      "rating": "8",
      "text": "The hugely entertaining new movie of stars is Megamind, which contains a very surprisingly unpredictable plot, unusual for any other superhero movie: Villain tries to thwart hero, hero beats villain, villain is defeated, hero saves the day, blah, blah, blah. But this film went much deeper than that, with the would-be-villain wanting to be the hero at the ending, & not being too much of a bad guy, after all. With a smart & fresh sense of cool comedy to add to this, Megamind is surely something you will not want to miss."
    },
    {
      "rating": "9",
      "text": "While this film isn't quite perfect, it is close enough that you don't even care. I was pleasantly suprised with the outcome. The characters are well written, and stick to themselves, and act as they should in the heat of the moment, unlike the majority of kids charavters these days. The imagery, while not as whimsical or colorful as Tangled, but it fits. Facial expressions and weather effects are spot on. My one complaint is to have more Minion! He is the real star here!"
    },
    {
      "rating": "10",
      "text": "I really enjoyed this movie. Though the relationship between Megamind and minion was kinda creepy, like a mother son thing. The scenes from the school were totally funny though!"
    },
    {
      "rating": "6",
      "text": "With an easy blend of comedy and action, Megamind doesn't stand out as one of the animation of the year. But it does however, convince its audience that they will like it coming out of the theater. It is not as slick as The Incredibles and the 3D scenes aren't amazing as How to Train Your Dragon, but you'll enjoy it. Megamind is about a supervillain and a superhero battling since they were born. Megamind, a blue guy with a big head, spends his whole life trying to kill Metroman (Brad Pitt). While the city hates him, he's convince that when he kills Metroman, the citizens will obey him. But when he finally \"killed\" Metroman, he found out that his life no longer has a purpose. He has nothing else to do rather than stealing stuff from the city. At this point, I think the movie is trying to get out the message that you have to live life with a purpose, or something like that. But in the end, we know Metroman is alive and Megamind gets locked up again. (There is a whole other subplot that's I'm not going to get in.) Will Ferrell's voice as Megamind is irrepleacable but Tina Fey and Brad Pitt were just unnessecary. Jonah Hill was way better than the two combined but that was because he was one of the big character. They tried to do a lot of stuff in 3D that weren't suppose to work in 3D. But at least they tried. 3-dimensional effects isn't that hard, but I felt like it took them forever in this film and get those effects going. Megamind isn't bad, it is great to say the least. But it lies between the it's-so-bad-that-it's-good type of movie."
    },
    {
      "rating": "6",
      "text": "My brother boldly declared \"Mega Mind was mega stupid!\" after seeing it. I would not go as far as he did with his statement, but I did feel that it was a mediocre effort by the filmmakers. Will Ferrell is hilarious as an actor, but as a cartoon voice we are left without his facial expressions and body language which always lend to his humor. The opening sequence was probably the funniest portion of the movie before we settle into another story of a bad guy who realizes he isn't so bad after all (Despicable Me?). You will get a few laughs from this movie, but do not go into it expecting to see a Shrek (the first one) or Toy Story quality story."
    },
    {
      "rating": "6",
      "text": "Megamind sadly does not redeem Will Farrel, it's just a mediocre movie about redemption, I give it credit for trying to teach you something and being unique, but it doesn't save it from mediocrity."
    },
    {
      "rating": "10",
      "text": "The movie is BRILLIANT! I am a guy who doesn't visit big screens much at all but I saw this one TWICE! The stereoscopy was brilliant! The background score,facial acting(animation),the characters everything was SUPER AMAZING! This movie (in 3d) is seriously like a ride which you would like to ride on again and again,irrespective of its story,because any UBER FUN ride doesn't require a story anyways.People might have totally opposite reviews regarding the story but I loved it as the FUN totally synchronized with how the movie progressed.Its a must see for all ages.Enjoy the super EVIL Megamind!"
    },
    {
      "rating": "7",
      "text": "Will Ferrell fan here:) Everything he does is just awesome, but animation is superb, sound great, story fun, really suitable for all generations. Action packed comedy with great plot!"
    },
    {
      "rating": "9",
      "text": "This movie is hilarious! Will Ferrell is hilarious, and I'm being serious! I don't think he has been this funny since Elf as far as his cleaner films go; if you like some of his raunchier films then you might disagree with me on that. But in all seriousness, the humour is pretty off the wall and fast paced; the off the wall description might not be all that descriptive, but the lines are like, \"Okay now let's continue with some witty banter, you first.....Ahhhhhh!.....Hmmmm, I don't really know where to go with that\". Basically it's a fun film, what might look like a lesser comedy/animated flick is suprisingly clever and worth the $19.99 I spent to buy it when all the other copies were rented out at all the Redboxes and Blockbusters (and when I say Blockbusters, I mean Blockbuster). So, to sum it up: Overall: It is a funny Will Ferrell movie, not THE funniest comedy ever or anything, but it made me laugh and my taste in humour is along the lines of Monty Python and Bill Murray; hope that helps. Signature 9/10 SS"
    },
    {
      "rating": "8",
      "text": "Will Ferrell shows his genius once more in the film, everything about his character is engaging, funny and then funny some more. The film is beautifully put together with awesome visuals and an awesome soundtrack too.  Watched it with my two year old son who was laughing throughout, although I think he was laughing at me laughing at the film... even so, we were both in stitches!"
    },
    {
      "rating": "9",
      "text": "This movie was great I had a lot of fun with it!!! In my opinion it's a instant classic and I hope they make a second part and dnt give me the mediocre crap this movie was funny and well worth watching and owning on DVD! Some people just need a sence of humor"
    },
    {
      "rating": "8",
      "text": "I think one word could describe how I felt after watching this movie, and it is surprise! I was not expecting anything too fantastic when I sat down to watch it, but as it finished I found myself pleased and I even had some laughs along the way! The plot was more developed then I was expecting, which is probably the reason I enjoyed the movie so much. The characters develop well, and I really enjoyed this one, check it out sometime!"
    }
  ],
  "recommendations": [
    "peter_rabbit",
    "despicable_me_2",
    "monsters_vs_aliens",
    "minions",
    "the_green_hornet",
    "hotel_transylvania_2",
    "the_lego_movie",
    "shazam",
    "hotel_transylvania",
    "puss_in_boots_the_last_wish",
    "shazam_fury_of_the_gods",
    "storks",
    "guardians_of_the_galaxy",
    "deadpool",
    "spies_in_disguise",
    "captain_underpants_the_first_epic_movie",
    "deadpool_2",
    "barnyard",
    "zombieland_double_tap",
    "the_spongebob_movie_sponge_out_of_water",
    "ice_age_the_meltdown",
    "incredibles_2",
    "turbo",
    "alvin_and_the_chipmunks",
    "the_croods"
  ]
}