{"id": 3295, "title": "Memoirs of a Geisha", "starring": ["Zhang Ziyi", "Gong Li"], "runtime": 146, "genre": ["Drama", "Romance", "History"], "description": "A sweeping romantic epic set in Japan in the years before World War II, a penniless Japanese child is torn from her family to work as a maid in a geisha house.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/pBwYsQaSTgnPphIy02DJjCF2cqs.jpg", "categories": {"plot": 7.333333333333333, "acting": 7.407407407407407, "ending": 5.0, "soundtrack": 10.0, "cinematography": 7.5, "familyFriendly": 6.0, "funny": 10.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "Memoirs of a Geisha is a special movie because of two things, first is not a stereotype love story, and it shows very accurately a piece of Japanese culture.Starting by the love story, here we see an orphan girl taken against her will to an okiya in order to become a geisha, looking for something that she cannot have, true love. In this point is where this sentimental story stands apart from the rest. When talking about a geisha, we refer to a person with the purpose of entertaining a man, but without falling in love.The illustration of the Japanese culture in this film is also significant, some concepts that demonstrate it are: first, the ability and capacity of improving life are determinate by the year of birth and the element that rules a person. Then we have the idea of making everything a ritual, putting aside the routine. Finally, the special meaning that gives the Japanese nation to the geishas; who are known as artist not prostitutes, and selling their skills not their body. This idea evolved with the years, until the war starts; with the arrival of the American troops the materialism is unleashed and the ancient culture is corrupted.With strong performances by Zhang Ziyi (highlighting the scene of the presentation as a geisha), Ken Watanabe, Koji Yakusho and Gong Li, this film treats a beautiful and mysterious subject, accompanied by an amazing screenplay and overwhelming music. It is unbelievable that a Hollywood production could capture a bit of the oriental culture."}, {"rating": "3", "text": "The film is well acted, over-dramatic, and is a visual masterpiece. But the Hollywood soap opera based on a Japanese story overrun with a badly spoken English screenplay using Chinese actors is unavoidably silly. The film disserves to be honored for its superb visual costumes, make-up and design, but unfortunately that is it."}, {"rating": "5", "text": "ziyi zhang is a mediocre actress at best and is not respected at all in china, unlike gong li who is. Ziyi zhang is only famous for her looks (which arent that fantastic either)"}, {"rating": "10", "text": "this is an amazing film that protrays Japan in a terrible time period of war with such beauty and grace. i love this movie."}, {"rating": "8", "text": "Considering the comments about the oriental casting in hollywood films, I feel that more than the fact that chinese actors are playing japanse characters, overall its a film that encapsulates the essence of a \"worth-watching\" film. The film may not portray the characteristics of a typical japanese geisha, but at the same time portrays it in such a way that the viewers are intrigued and keep them wanting for more. Prior to this movie I had no idea what a geisha was or they even existed for that matter. but this film has made me want to read more about them. From a purely cinematic view, John william's scores are absolutely wonderful and gives a whole new meaning to east-based movies. The elaborate costumes are sure to catch one's eyes. the visual appeal of the entire movie is high. The physical landscapes are very convincing even though certain scenes were shot in South California. Overall this movie is worth-watching."}, {"rating": "7", "text": "The movie is visually delightful and the sountrack eases your senses. It might throw up a few good ideas for interior designers!! But it is no longer is a 'memoir', that the book was. The treatment is melodramatic and immature. Maybe they should have struck to the book more as understanding a 'Geisha's life is no easy job."}, {"rating": "7", "text": "I always find movies about different cultures interesting. The movie almost felt like a documentary because I knew NOTHING about geishas before this movie. I did enjoy it though. The movie did kinda drag by the end, but there was a lot of plot to cover. The lead actress (both young and old versions) did very well. This movie will probably go over better with the female population, but males can enjoy it too (i did). Just sit back and enjoy the beautiful costumes and sets."}, {"rating": "5", "text": "I said \"OK, let's go see a 'chick flick'. I owe you one.\" My vote for mediocrity. Great photography --- lush; it's best feature. Alas, this is a boring movie. All style and little substance with garbled dialogue to boot. Next time we can see a movie that reviewers and this critic agree is worth seeing."}, {"rating": "10", "text": "Great Cinematography and the 3 Chinese actresses as Japanese was pulled off masterfully. From someone who's lived in Japan, Zhang Ziyi's performance was breathtaking."}, {"rating": "9", "text": "Excellent writing and cinematography! love the actors. Powerful!!!"}, {"rating": "0", "text": "Not so memorable because I fell asleep. It was that uninteresting. Dull."}, {"rating": "2", "text": "This movie was better than a sleeping pill. Im being generous with a 2 rating."}, {"rating": "10", "text": "Stunningly beautiful and deeply touching."}, {"rating": "10", "text": "Beautiful."}, {"rating": "10", "text": "The leading actress, Ziyi, is astonishing! An Oscar-worthy."}, {"rating": "2", "text": "The dance looks like a Vegas show."}, {"rating": "6", "text": "Beautiful women, beautiful sets. Its like you're looking at Vogue Japan. But then the women open their mouths, and things get ugly. Its not that the English dialogue is poor, its that these performers, for the most part, speak English in an almost cliche way. Couldnt they have hired Lucy Liu or Sandra Oh? There's something crazy about hiring \"English as a Second Language\" actors for an American movie. And then it turns out most of them are Chinese playing Japanese! What kind of faux authenticity was Rob Marshall shooting for? And honestly, the love story boils down to a pederast loves a baby hooker. Isnt that romantic."}, {"rating": "3", "text": "If only the Geisha had a memory of a Crouching Tiger or even a Flying Dagger or two it might have given her Memoirs something worth making into a major motion picture instead of spending 100 million for cinematography, art direction and costume design Oscar nominations."}, {"rating": "6", "text": "I respected the book for its vivid depiction of that era in Japan's history, but was never truly entertained because of its emotional coldness. The film suffers from the same problem, only more so. Beautiful to look at, but never truly involving. Ziyi Zhang truly shines though."}, {"rating": "8", "text": "despite what some of the other reviewers have said, i think this has a fair bit of depth - certainly much more than something like house of flying daggers. i thoroughly enjoyed it. the score is fantastic and the world of the geishas is captivating."}, {"rating": "7", "text": "The music, the costumes, the cinematography ... they're all stunningly beautiful! The actors are great as usual (Watanabe, Yeoh, and Zang are the best Asia has to offer and rank up there with the best of dramatic actors, in my opinion). The only downside is what you see in the reviews, a lack of depth, maybe? That's not to say that we don't care about the actors or the outcome, but it could have been tied together better. The movie seemed to lose a little steam in the last 1/2 also but I didn't walk away feeling cheated or let down. It was a nice story and a joy to watch."}, {"rating": "10", "text": "This movie wasone of the best adaptations from book to film. I was thoroughly engrossed in the stunning cinema photography and the fine acting by young Sayurin in particular. The music score was moving as well as the romantic story."}, {"rating": "8", "text": "I really liked this movie and thought is was entertainig. Also, I don't understand the backlash of critcs and some of the viewers. Hello! Its a story picture about characters. Those knuckleheads who were bored probably like 50 Cent movies and comedies about 40 yr old virgins."}, {"rating": "8", "text": "I can't understand why a lot of people complain about the chinese playing japanese characters, and speaking in inglish and stuff, if you don't like that kind of movie, just don't go to see it. It's a chick flick, and its good..."}, {"rating": "3", "text": "Well shot, wonderful costumes etc but the visuals couldn't rescue what is essentially melodrama. One dimensional almost cartoonish characters, terrible acting and it just plain plodded along. Disappointing really as the book was great."}, {"rating": "8", "text": "A great film... very artistic... took my breath away."}, {"rating": "10", "text": "This was a visual masterpiece that stuck true to the Golden's novel. People who condemn it went into watching the movies not knowing the type of story it is. While the back of the DVD describes it as a Cinderalla story, and that is true, it is not the point of the story. Yes, it's what drives Chiyo to continue on the path, but what choice did she have. Besides it's not going to be a cheesey romance. People need to have some understanding of Japanese culture, especially during that time period. That society in Kyouto is beyond the understanding of most Americans if they don't care to look into the history behind it. Yes, it had American flair but what did you expect? This film was wonderfully done and only the ignorant condemn it and what it represents. (As for the Asians who condemn this story I make no remark. They would know it better then most Americans. They are the only ones who have a right to.)"}, {"rating": "5", "text": "Costumes were amazing. visually, the production value was there... the english was painful but zhang zi yi's looks didnt make it horrible. i wish they just casted japanese people and spoke in their native tongue with subs. the book was much better."}, {"rating": "9", "text": "Fans of the book will probably enjoy this visually stunning movie. But why does Hollywood always have to put in a dig at Americans? In the book, the Americans were not particularly odious, and the Minister was Japanese. In the movie, he is a boorish \"Ugly American,\" and of course, the Americans are all \"bastards.\""}, {"rating": "3", "text": "The movie is visually beautiful. Amazing costumes, scenery, etc. But as the movie stands out by itself, it shows out to be a dramatic \"Showgirls\", a slimy romantic story, a soap-opera launched straight to theaters."}, {"rating": "4", "text": "It should be banned in Japan because of the use of Chinese actresses - the same 3 leads in all Asian films - portraying of all things profound in the Japanese culture, Geishas. No one who funded this project had the intelligence to think of how this looks to the Asian audience because it is white-washed from America."}, {"rating": "10", "text": "The three main actresses derserve to win oscars."}, {"rating": "7", "text": "Like a sumptuous, lavish, stunningly produced Lifetime movie. A thin plot, terrible dialogue, poor acting but incredible to look at."}, {"rating": "3", "text": "Ugh. Not what I was expecting. The acting is awful. How was this ever touted as an awards worthy film? Blech!"}, {"rating": "8", "text": "Loved it!!"}, {"rating": "10", "text": "Oscar-Worthy. Gong Li and Ziyi Zhang once again prove that they are the greatest actresses in the world."}, {"rating": "5", "text": "The costumes, cinematography, and musical score are top-notch. The story, however, meanders and there's never any real emotional pull to make us care about any of the characters. It seemed much longer than it actually is."}, {"rating": "3", "text": "Anyone else notice that the lead musical score (done by Hans Zimmer) was EXACTLY the same as the one done in \"The Last Samurai\"? What a disappointment."}, {"rating": "3", "text": "Very ordinary movie. Don't waste your money. If you must see it then wait until it is playing in the $1 dollar movie."}, {"rating": "10", "text": "I loved it. I think you need to free your mind from choppy English and focus on the story, set in beautiful scenery just before WWII. It is a story of perseverance and survival in the strict Japanese community of geisha. And a predictable yet unexpected happy ending. I thought it was wonderful. Critics have to be more open minded and understand that passion is not in love scenes and sexual acts, but sometimes lies in silence and even absense of emotion."}, {"rating": "7", "text": "I was put off by the bad reviews...but upon viewing it myself, I was pleasantly surprised. Not bad."}, {"rating": "8", "text": "Pretty good movie, at times impressive cinematography (opening scene), a very promising young \"lead\" actress, a movie I would be glad to see again."}, {"rating": "4", "text": "Not only does the film fail to stay true to the book, it is a disgrace to it. If you have read the book you'll see what I mean. Obviously I did not expect the film to be just like the book, but its just ridiculous. The film seems to miss everything the book is about, it does not capture the life of Saguri or of a geisha for that matter. It is a pity that Rob Marshall had to destroy such a great story."}, {"rating": "1", "text": "a complete bore. hollywood meets contemporary Asian film-making and makes a mess of it."}, {"rating": "7", "text": "Yes, it's melodramatic and not very subtle. But as a fairytale, it works and is quite entertaining. The scenery is beautiful and so is the score, featuring Yo Yo Ma and Itzhak Pearlman. And Gong Li plays the Wicked Stepsister role with real relish."}, {"rating": "10", "text": "great movie! yes they are chinese actresses but then they pulled it off. they'r great! i think it's the most romantic film I've ever watched..to those who criticize it wrongly, you should I think watch it several times, I think you just didn't listen to the dialogue, you just didn' get it. you should read between the lines also. the script was fantastic! Ziyi and the other casts performance are incredible stellar. two-thumbs up to you guys! trully, each of the leading actors and actresses deserve more than an oscard award. great! they are really Asia's best!"}, {"rating": "5", "text": "Stunningly designed, beautifully photographed, marvelously costumed, sharply edited, expertly scored, very well acted...and yet not nearly all it could have been."}, {"rating": "8", "text": "An unusual but beautifully told story that stays with you."}, {"rating": "10", "text": "Excellent movie"}, {"rating": "10", "text": "GREAT MOVIE! I love it. Obviously, Japanese actresses aren't \"ALL\" that. And the history of geisha in Japan isn't all that glamorous anyways, so does it matter if the movie use Japanese actresses? Asians are asians. So for a movie on Eiffel Towel that's to be played in English, do all the actors/actresses need to be French? It doesn't matter, as long as they look Caucasian. Same for this Memoir of Geisha movie, as long as the actresses/actors are Asian, that's all that mattered."}], "recommendations": ["marie_antoinette", "the_great_gatsby", "moulin_rouge", "blade_of_the_47_ronin", "youth", "the_last_samurai", "samson", "casablanca", "the_last_of_the_mohicans", "my_name_is_khan", "amadeus", "roma", "alexander", "the_english_patient", "upside_down", "blood_diamond", "perfume_the_story_of_a_murderer", "victor_frankenstein", "eternals", "the_favourite", "cruella", "the_best_exotic_marigold_hotel", "annette", "the_man_in_the_iron_mask", "kingdom_of_heaven"]}