{
  "id": 1093,
  "title": "Men in Black: International",
  "starring": [
    "Chris Hemsworth",
    "Tessa Thompson"
  ],
  "runtime": 115,
  "genre": [
    "Comedy",
    "Science Fiction",
    "Action"
  ],
  "description": "The Men in Black have always protected the Earth from the scum of the universe. In this new adventure, they tackle their biggest, most global threat to date: a mole in the Men in Black organization.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dPrUPFcgLfNbmDL8V69vcrTyEfb.jpg",
  "categories": {
    "plot": 2.6333333333333333,
    "acting": 2.242424242424242,
    "ending": 2.6666666666666665,
    "soundtrack": 1.5,
    "cinematography": 5.0,
    "familyFriendly": 3.3333333333333335,
    "funny": 1.9230769230769231,
    "action": 3.25
  },
  "reviews": [
    {
      "rating": "1",
      "text": "This is so bad. Absolutely idiotic plot, stupid scenes, unfunny jokes, characters often just laugh just like that, actions of heroes are unmotivated, all subject turns or are read at the very beginning of the movie, or simply stupid and illogical."
    },
    {
      "rating": "3",
      "text": "I love both Hemsworth and Thompson but this film is just *so* bland. It lazily slugs along from set piece to set piece, and then tries to present us with a twist that was obvious from the trailer. Waste of talent and your time, someone please use a neuralyzer on me..."
    },
    {
      "rating": "3",
      "text": "The story revolves around a week plot. Very predictive and old-age screenplay. Hemsworth has been involved only for Glamour and stardom, there was absolutely no strong character or pre-story behind Agent H. The story revolve around Tessa Thompson, Protagonist. All the supporting characters, Including Liam Neeson couldn't save the film. I clearly missed humor of previous MIB movies, Could hardly laugh despite hearing Kumail Nanjiani's voice. Overall, If they are planning to do it again, I will strongly recommend them device a strong plot."
    },
    {
      "rating": "3",
      "text": "This movie is the definition of okay.And for a MIB movie where the universe is literally the limit in terms what you can do plot wise, is utterly unacceptable.It plods methodically from set piece to set piece, with no real purpose, and no real concern for justifying why the characters do and say anything. To then limply reach a thoroughly predictable and underwhelming conclusion that could have been written by a 7 year old.To find some positives, the visuals are perfectly acceptable (most of the time), the soundtrack is inoffensive, and the cast do what they can with the miserable screen play they were given.This project should have been canned, or at least shelved until they could get a competent writer on board to give them something worth making a film for. Instead of reinvigorating this franchise, I believe they have killed it. Which is a real shame.3/10, don’t waste time or money on this. Catch it on Netflix in 2 months time if you really want to."
    },
    {
      "rating": "5",
      "text": "The movie wasn't that good. It didn't have enough action and i like the original cast with will smith and Tommy lee Jones."
    },
    {
      "rating": "1",
      "text": "a perfect example of what happens to a movie if you don't follow the \"show, don't tell\" principle and combine it with a mary sue and a god complex. Men in Black was good because Will Smith had severe flaws was bade at certain things and it was funny because he had to learn a lot of things fast and on the fly. In this Movie the producers make the same boring old mistake.. the main protagonist is flawless from the get go. no character progression, no needs, just a \"want this\" and some over worldly mad skills derived out of (shown) nowhere and being at the right place at the right time because the flawlessness of the main protagonist was supposed to be there.. no struggle, no flight, no development no personal involvement.. It's like Hollywood forgot how to make good and interessting movies.. i hope this era of Highjacking films for clumsy remakes goes away very soon.."
    },
    {
      "rating": "1",
      "text": "A complete waste of time. I haven't been so bored watching a movie in awhile.The alien designs was unimaginative, the effects are terrible, the comedy falls flat, the characters suck, and Chris Hemsworth and Tessa Thompson lacked any chemistry this time around.There was nothing here that I liked."
    },
    {
      "rating": "2",
      "text": "The reason the first two MIB movies worked out so well was you had one steel backbone character who knew the ropes (Tommy Lee Jones) and one smartass recruit (Will Smith). In this movie both Helmsworth and the girl were both wierdo goofs. Helmsworth was too busy flitting around with his pretty boy B.S. and the girl was just wierd. That means there was no strong character foil for both to play off each other. Next, the storyline was convoluted and difficult to follow. Because of the name 'international' in the title they now had to figure out how to get different countries in the film and because of that, the writers had a hard time. I give this one star and a half. The worst MIB movie to date."
    },
    {
      "rating": "2",
      "text": "The main character perfectly encapsulates everything wrong with this movie. There is absolutely nothing entertaining about following an obnoxiously plucky, hyper-competent, characterless, unfunny protagonist in your sci-fi comedy film. This character isn't given any stakes or strong motivations. This character doesn't struggle at any point. This character doesn't learn anything throughout the story. She's boring to the point of infuriating. It certainly doesn't help that no one else in this movie is funny either. Bad comedies are probably the most unfortunate type of bad movie. Most bad movies have the potential of being funny by virtue of how bad they are. Bad comedies are already inherently unfunny. They're effectively worthless. That's what this movie is: worthless."
    },
    {
      "rating": "3",
      "text": "Worst mib ive watched with some horrific acting. Really predictable and boring through the whole movie. Probably the worst acting performances from liam neeson, chris hemsworth and then that chick who plays the valkary in thor, she was horrible."
    },
    {
      "rating": "2",
      "text": "does anybody remember the story? because it's forgettable. worst of the franchises i wish it never had been made"
    },
    {
      "rating": "2",
      "text": "MIB International is just a painfully boring movie. It isn't funny, the action scenes seem very out of place and it absolutely fails to capture your interest. And let's be honest, Replacing the chemistry that Jones and Smith had is a tall order and try as they might, Hemsworth and Thompson don't even come close to matching that."
    },
    {
      "rating": "2",
      "text": "This is the perfect movie to show you how a screwup a sure thing. MiB would draw based on the name and this movie ruined even that. I would not watch this again if I was PAID to for anything less than $500. Even then I would wear headphones and take a nap during it."
    },
    {
      "rating": "1",
      "text": "This is surely the worst Men in Black. Special effects worthy of first release in 1997. The Eiffel Tower is pitiful. The bad guys are very stylized, but too simple. All pushed by a minimalist scenario does not do anything good. Men In Black 3 that I did not appreciate so much; after reviewing it, it can be said that Will Smith does the job that Chris Hemsworth #Thor will not be able to do because he does not have the class. He remains in the role of Thor.Voici surement le pire Men in Black. Des effets spéciaux dignes du premier sorti en 1997. La tour Eiffel est pitoyable. Les méchants sont très stylisés, mais trop simples. Le tout poussé par un scénario minimaliste ne donne rien de bon. Men In Black 3 que je n'avais pas tant apprécié; après l'avoir revue ont peux dire que Will Smith fait le travail que Chris Hemsworth #Thor ne pourra pas faire, car il n'a pas la classe. Il reste dans le rôle de Thor."
    },
    {
      "rating": "3",
      "text": "This movie was written by two people and it was still a predictable mess... I also wasn't a huge fan of how this was directed/edited/whatever, it felt a little choppy and like scenes got cut off too early sometimes. However, I loved Tessa Thompson, Chris Hemsworth, Rebecca Ferguson and Kumail Nanjiani."
    },
    {
      "rating": "2",
      "text": "Hombres de negro: internacional es pésima estos remake dejan en evidencia la poca creatividad de Hollywood"
    },
    {
      "rating": "0",
      "text": "Worst of the mib series. poor graphics. hoped will smith would return as well as tom lee jones"
    },
    {
      "rating": "0",
      "text": "What a terrible piece of crap. Men in Black was fun in the 90s and with its original cast. This is by far too little and too, too late."
    },
    {
      "rating": "4",
      "text": "I have to write a seventy five character review. This movie can be summed up with one word. Meh."
    },
    {
      "rating": "1",
      "text": "Everything in this movie is bad.The story, writing, acting, special effects, everything is just awful. I can't remember a good thing about it. And Tessa Thompson sucks, why did they bother with her. It's even not funny at all. Avoid it and believe the bad reviews, unless you're 8 or 10 or something."
    },
    {
      "rating": "0",
      "text": "my eyes burn when I see this garbage, the politically correct version of men in black is not even the shadow of what it once was."
    },
    {
      "rating": "3",
      "text": "Hemsworth is still carrying that goofy confidence in his body language and Thompson, her new state of bloated coolness, the suit suits, the job doesn't.Men In Black: InternationalF. Gary Gray, I thought, usually is the guy to carry on franchises with equal respect as they start on with. If not increase the hype but will surely continue the momentum of the chase that drives the fans to cinema. Of course, these are all hypothetical thoughts you wander before going on in this cash grab chapter of a popular franchise that lately has been struggling aplenty in order to be politically correct, compromising both quality and the agenda that births that whole drama; ironic, right! Now, before I go through train of various disappointing elements, let me point out the primary and the surprising one.The visual effects and physical sequences- the one thing these big banner film thrives for- are practically straight out wrong, as in they have somehow forgot to account in the distance and time factor in doing so; from showcasing a vehicle zooming, to a creature in a jetpack boosting off, it is odd and uncomfortable to swallow all. And on the other hand, the best asset is the creativity on how varied number of creatures are presented, these tiny aspects keep giving us hope in this overlong two hours of journey- basically a slow death.The storytelling mostly follows the Copy-Paste system from other passable buddy cop films which to be frank isn't done properly, ergo, the result is worse than that. The antics, nothing but loud bangs, the jokes, desperate attempts for cheap shot and emotions, fairly shallow. The only character that you are going to look forward to, is Kumail Nanjiani's voicing as Pawny whose affirmatively positive comments are flat out hilarious. Men In Black: International, the name gives it all away, from the locations to the transparency of the characters, I mean still holding on to their obvious hidden card, is not actually arrogant but simply ignorant."
    },
    {
      "rating": "0",
      "text": "This was not men in black. This was sacrilege. Hollywood is also on a role with there agenda"
    },
    {
      "rating": "2",
      "text": "This movie is crap .Because action scenes bad and there is a boring spread on film.I am sleep in cinema. Especially crushed under John Wick 3. This is not a MİB"
    },
    {
      "rating": "3",
      "text": "MIB: International is easily one of the worst films I have ever seen. The entire film never entertained me, and the storyline was predictable from the start. I actually fell asleep for a part of the film; the last time this happened was during Jason Bourne in 2016. I haven’t seen any of the other MIB films yet, but this one makes me uninterested. (25/100)"
    },
    {
      "rating": "0",
      "text": "this movie sucked so bad. its nothing like the original. there is nothing there for the actors to work with. the entire thing was re-imagined poorly. there is no cool banter between the seasoned pro and the newbie here - it just sucked. zero. do not pay to see"
    },
    {
      "rating": "3",
      "text": "It’s just guardians of the galaxy but with 2 characters instead of 4. I like how Thor is in it but isn’t he supposed to be fat? Doesn’t feel like a marvel movie at all and this is probably the worst marvel movie ever sense Iron Man 2."
    },
    {
      "rating": "0",
      "text": "SJW garbage. Who thought this was a good idea? 'Why is it MEN in black anyway?' - good idea! A big middle finger to every guy who just wanted to watch a movie."
    },
    {
      "rating": "3",
      "text": "Not much to say more than, bleh, the movie was so boring and bad that i found it hard to watch. I've never been a huge fan of remakes of older movies, but this was just a terrible remake of the original. The actors/actresses somewhat made up for the poor writing and boring plot, but their performances definitely weren't close to enough to save this disaster."
    },
    {
      "rating": "3",
      "text": "This is another example of get woke go broke. This story is very bad, I mean really really bad. Almos everything the female character did is solve all the problem, by luck, yes, by the freaking luck!The visual effect is not really impressive. But the evil guy is so predictable. The final boss is weak as weak, there is only one effect hit landed on it, and killed it......"
    },
    {
      "rating": "0",
      "text": "Another sequel no one asked for. If anything you should of made Will and Tommy a requirement to continue with this movie. Because they didn't and just trying to milk old franchise cause money money money. I haven't watched it and I don't need to. The trailer is all I need to see to know it was going to be terrible."
    },
    {
      "rating": "3",
      "text": "its a jumbled mess of a movie, it makes no sense. most of the scenes don't reveal any important or relevant information concerning the plot. and the characters are boring and hallow. it tried to be funny, and i cringed. it tried to be serious, i cringed. I didn't enjoy a single part of this move and i regret watching it. so please do yourself a favor and go watch something else."
    },
    {
      "rating": "0",
      "text": "Horrible and predictable movie. Helmsworth could not save it. Tessa Thompson is an example of an \"it girl\" who is a horrible actress that Hollywood keeps trying to shove down our throats even though no one is asking to see her movies. Another example of a horrible actress that keeps getting hired is Clara Delevigne."
    },
    {
      "rating": "1",
      "text": "- The chemistry between two lead actor and actress is non-existent- The usage of MIB lore / style is missing- The movie tried to establish a bond between a man and a woman whilst pushing a \"women power\" in a cringy way with the (Men in Black? People in Black? Women in Black? debate and \"all knowing omnipotent woman\" character) message making it impossible- Humor does not exist, everything is so meh. How many times is Hemsworth will let people use him as an underdog alpha-male being taught his place amongst powerful wamen scenario, I really don't wanna know- Tessa Thompson and Hemsworth played as themselves... again. I miss the actors and actresses of old, who used to put some different flavor in each individual character they played- I won't even go for the plot... They didn't even try, what a shameIn fact this much of dissection is somewhat overkill for this movie. But for the memory of THE three MIB movies, these must be said."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)A brand stripped to the bone but that Sony and Columbia will insist on re-proposing until they'll come back to invent something new."
    },
    {
      "rating": "0",
      "text": "Without the charisma of Will Smith or Tommy Lee Jones! Instead full of PC SJW Agenda. This wasn´t what I´m looking for. Too bad another franchise gets down the drain. I can not understand, why Hollywood don´t wanna earn money anymore by creating good movies and interesting characters."
    },
    {
      "rating": "0",
      "text": "Everything in this movie is bad.The story, writing, acting, special effects, everything is just awful. I can't remember a good thing about it. And Tessa Thompson sucks, why did they bother with her. It's even not funny at all"
    },
    {
      "rating": "0",
      "text": "Skip this. Stephen Spielberg has made some good movies, but this is not one of them. He has taken a series that began strong--with humor and imagination--and turned the fourth into bland acting, unimaginative special effects, and no reason to root for anyone. You can always tell when Spielberg is totally out of good ideas when the music track is painfully loud."
    },
    {
      "rating": "2",
      "text": "I long for the days when writers in Hollywood actually cared about their creative content. There are so many movie franchises that should have ended years ago, such as The Terminator saga, Toy Story, Star Wars, Jurassic Park, and Pirates of the Caribbean. These filmmakers can't just leave what's already great alone. Of course, there are a few exceptions every here and there. However, Men In Black: International is not one of them. The majority of awful sequels these days definitely outweighs the anomalies. There are some moviegoers who don't mind Chris Hemsworth and Tessa Thompson being paired together in this film. Needless to say, these two were already featured once before in Thor: Ragnarok. With MIB: International, it doesn't feel like a MIB movie without Tommy Lee Jones and Will Smith. They should have stopped after MIB III. Most people don't want non-Marvel movies to imitate Marvel comic book films. It's not necessary, it's just cringe. Yes, this includes the casting. It may have been better to replace Thompson's character with Will Smith's. This way, Agent J, who is Will Smith, can show Chris Hemsworth the ropes. On second thought, it's not like this hasn't already been done before. Like I said before, this series ideally was supposed to end with MIB III. The golden guideline for screenwriters should be aiming for a trilogy, not winging it and milking it with four films, or five, or six movies. It's too much. Copycats are the last thing that Hollywood needs right now. Creative writing in this 21st century has become a forgotten necessity in the film industry. They care more about their politics than they do about their stories and characters."
    },
    {
      "rating": "5",
      "text": "Yet another example of a 2019 movie whose quality has suffered greatly from studio meddling. Though this hasn't been dealt nearly as bad of a hand as, say, \"Hellboy\" or \"Dark Phoenix,\" I still can't see how someone could look at all of the rumors of on-set rewrites and bureaucratic in-fighting and call this \"business as usual\" blockbuster filmmaking. \"Men In Black: International\" is messily plotted, featuring low-brow humor and character work, and an overall lack of the kind of wonderment and fun that made the prior successes so memorable. Again, it's definitely not the worst version of itself I went in expecting, but it leaves a whole truckload to be desired."
    },
    {
      "rating": "1",
      "text": "This movie was absolutely atrocious.Bro, I just went and saw this movie because I love Men in Black, this movie was horrendous. Agent H: The greatest field agent that never actually saved the world. He is completely incompetent, and is not knowledgeable of almost anything. Basically, he's a party boy who used his good looks to swarm his way to the top. Agent M(olly): Mary Sue, who was a shut in her entire life, yet is not socially awkward. Has never been in a fight, but defeats a galactic goddess of death. A hacker who used NASA sites to track down MIB actions, while also TURNING DOWN the FBI and CIA, but don't think about that too hard.... Then waltz's into MIB headquarters, to get interrogated which turns into a job interview. She gives the female chief a few fashion complements, and tells her she's smart and has no life. Gets hired on the spot.Now, immediately gets to choose her weapon, is a complete dbag, disses the name of the whole organization. \"Men in Black, why not people in Black, or humans in Black?\".... It's based on a myth about aliens who obduct people. They look like emotionless creatures, dressed in all black suits, and resemble Men... Men in Black... Ffs....Brand new agent, just gets sent on a special duty to England.. ya know, as new recruits do. Is following top agents around, just casually hangs out with a top agent. F's up the mission, that's fine.Ends up obtaining a super weapon, that at some point in the movie she fires just because, creates a Grand canyon in the middle of the desert. And not one government agency shows up. Then travels to the goddess of death whom she defeats, who apparently has extremely high security system with many bodyguards, but she just gets on the island because they weren't paying attention or something. Basically like Bond villains, in a world where there's a secret agency above the CIA or FBI surveillance, but apparently have ADT security systems LOL.A psych out ending, with the villains that have been built up being a bait and switch.   Confronts actual villain, this is where it is revealed that agent h never actually save the world. Apparently High T has always been possessed since 2016.  Pawns grappling hook can withstand a black hole / vortex that can make people travel across the universe. agent h gets the keys to the whole organization, despite not actually saving the world, despite not being  competent in almost any single particular way, and his main rival in the organization gives him the keys because of respect or some BS. And he gets the nomination because the possessed high T, had recommended him before as a good leader. Despite not having shown one single good leadership quality.  Agent m knows how to fly the cars and everything, just cause... Guaranteed the people who say they like this film, willl have the most generic responses. the people that dislike this film, will tell you exactly why it was trash.Man I don't feel like typing anymore there is just so much wrong with this movie, and I will never trust an angry Joe review"
    },
    {
      "rating": "5",
      "text": "All special effects ,no heart. They abandon the MIB core mythos and just resort to blasting everything in sight with big weapons. Feminist dialogue running thru the film as well.The actors are just slumming it."
    },
    {
      "rating": "3",
      "text": "I was looking forward to see this movie, (mainly because of Chris H). but it wasnt as good as I thought it would be. I actually fell asleep about halfway through. It would be okay for younger kids who may not have seen the origional"
    },
    {
      "rating": "3",
      "text": "MIB is a franchise with no reason to continue. It's novelty worn off and any good idea has already be done. This movie has nothing new to bring to the table as pretty much everything is just copied from previous. To the point of being desperate as new elements are quickly pushed away and forgotten in favour of cliches like a mcguffin, alien sidekick, \"MIB is compromised\", etc. meanwhile the characters show little new in personality.Such a shame cause Tessa Thompson isn't bad at all and seems to do her best. Especially the first half, but the movie quickly turns mediocre at best and no amount of star-power is going to fix that."
    },
    {
      "rating": "0",
      "text": "This movie is a piece of garbage, bad characters, bad guion and the aliens were really bad just like this movie."
    },
    {
      "rating": "4",
      "text": "Frankly I had no expectations, first of all because I wasn't excited to see it but I was hoping it would work. It wasn't so.Men in Black: International is a very poor excuse to try to keep alive a franchise that should no longer be alive.What's the use of believing that they can renew it if they didn't make any effort to refresh it? Because that's the point: If you're trying to preserve this franchise then you should be trying to do something different.Ok, you lost the original protagonists. Then don't try the same dynamic between characters believing that somehow it will be different because now one of those characters is a woman.The strongest point is the chemistry between the main characters, after all both Chris Hemsworth and Tessa Thompson had already shown it in Thor: Ragnarok. Unfortunately Hemsworth is not so funny here while Thompson doesn't have a strong personality in this story either.Honestly I really thought this was an inert film. Slight entertainment and almost no comedy. A big misfire without a doubt."
    },
    {
      "rating": "0",
      "text": "This is the **** thing that I ever saw this movie is **** not sure if I should get it in the morning"
    },
    {
      "rating": "2",
      "text": "This \"new\" Men in Black entry is just pure garbage. I'm feel so bad for Liam Neeson and Chris Hemsworth to have starred in this crap of a film. Still can't believe how stupid and boring is this sequel. I've expected something correct since this was from the director of The Negociator, but I've probably missed that he also directed Fast and Furious 8 more recently..."
    },
    {
      "rating": "1",
      "text": "это высер, помойка, каловый поток. Это не смотрите, не с чего сделать выводы. Зачем потратили на это ресурсы"
    },
    {
      "rating": "0",
      "text": "This movie is a total garbage. Just terrible. Don't waste your time and money"
    }
  ]
}