{
  "id": 2261,
  "title": "Men in Black II",
  "starring": [
    "Will Smith",
    "Tommy Lee Jones"
  ],
  "runtime": 88,
  "genre": [
    "Action",
    "Adventure",
    "Comedy",
    "Science Fiction"
  ],
  "description": "Kay and Jay reunite to provide our best, last and only line of defense against a sinister seductress who levels the toughest challenge yet to the MIB's untarnished mission statement – protecting Earth from the scum of the universe. It's been four years since the alien-seeking agents averted an intergalactic disaster of epic proportions. Now it's a race against the clock as Jay must convince Kay – who not only has absolutely no memory of his time spent with the MIB, but is also the only living person left with the expertise to save the galaxy – to reunite with the MIB before the earth submits to ultimate destruction.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/enA22EPyzc2WQ1VVyY7zxresQQr.jpg",
  "categories": {
    "plot": 5.444444444444445,
    "acting": 5.416666666666667,
    "ending": 5.333333333333333,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 5.818181818181818,
    "funny": 5.7727272727272725,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "8",
      "text": "While still a worthy sequel, MIB II goes for a bit more of a comedic route which works pretty well but at the same time in small doses is the way to go. Everything we loved about the first film is still present here which is great, and its great to have the main players back as well as some new additions. As far as sequels go its not up there as the best, and I feel the third was better than this one, but overall it will still appeal to the same audiences of the original"
    },
    {
      "rating": "8",
      "text": "Hey guys, good job on rating the game with your only point being stupid upvoters.The movie is great, while not as great as the first one still delivers and is very watchable."
    },
    {
      "rating": "4",
      "text": "a poor excuse for a sequel felt like the same plot almost from the first  with jones and smith reversing there roles abit. the jokes wernt as good and after seeing it i could care less to ever see it again . a very forgettable film."
    },
    {
      "rating": "6",
      "text": "While Men in Black II lacks the charm and comedic timing of the first movie, there are still a lot of enjoyable performances and moments. The film sometimes gets caught up in itself, and can be confusing at times, but Will Smith and Tommy Lee Jones maintain their infectious chemistry and are sure to entertain and delight."
    },
    {
      "rating": "5",
      "text": "\"Men in Black 2\" entertains the audience with joy, but it's not worth it compared to its prequel."
    },
    {
      "rating": "6",
      "text": "not as good as the original, but this was definitely worth a shot."
    },
    {
      "rating": "6",
      "text": "Not as bad as many claim it is, but no where as good either. Considering the tone and standard the first movie left, this movie was a step backwards. Replaying all the jokes from the first movie (except then they were fresh and funny.)  Overall: While it still is enjoyable, it really does feel more like a cheap cash-in."
    },
    {
      "rating": "6",
      "text": "A pretty pedestrian sequel that while entertaining lacks a lot of the fun of its predecessor.  It was close between a 5 or a 6, but it's fun enough for a mild recommendation."
    },
    {
      "rating": "5",
      "text": "Back in Lack. That's all I have to say about this movie. Fans will pretty much enjoy this while people like us will only get entertained in some of the parts."
    },
    {
      "rating": "7",
      "text": "MIBII is not as interesting as the first film in the franchise, but it's funny and it satisfies its viewers. Will Smith and Tommy Lee Jones are still in fine tune."
    },
    {
      "rating": "7",
      "text": "A good sequel. Sexy, soulful and entertaining."
    },
    {
      "rating": "10",
      "text": "man, you can make James bond, mission impossible and tons of secret agents films but this is the most original thing I've ever seen, maybe not as good as the original but still pretty good film for me"
    },
    {
      "rating": "5",
      "text": "Not as good as the original at all. MIB II doesn't have the same energy or charisma the first installment had, and doesn't have any memorable moments."
    },
    {
      "rating": "0",
      "text": "This is probably the worst sequel ever made - bar none. A zero is fair due to the moronic upvoters."
    },
    {
      "rating": "9",
      "text": "Although it's not as good as 1, it's still cool."
    },
    {
      "rating": "5",
      "text": "Definitely not as good as the original, but it is a sequel, so such is expected. Still has some funny moments, and Jones once again delivers amazingly. Boyle, on the other hand, did a very poor job. Some of the fight choreography was just corny when compared to the original. The after effects of the neuralizer are altered a bit. Story isn't as neat as the first. All in all, it's enjoyable, but not lovable."
    },
    {
      "rating": "6",
      "text": "Has many problems but is reasonably entertaining and has a great ending. Acting is good."
    },
    {
      "rating": "6",
      "text": "Men in Black II is a fun and entertaining little sci-fi comedy romp, but just feels far too generic and typical to resonate. Even more, it is not even fresh at this point, given the existence of the original. If the original did not exist, this one would be far better because there is nothing particularly wrong here. The aliens are well designed, the acting is fine, the dog is hysterical, and the plot is compelling, but it feels incredibly by-the-books and safe. For this, it never becomes extraordinary or even particularly good. Men in Black II winds up being an easily digestible film that is entertaining and funny, but brings nothing unique to the table. This ultimately hurts the film and the overall product, though I certainly enjoyed this."
    },
    {
      "rating": "7",
      "text": "Better than the first one, that's for sure.\rBetter than the first one, that's for sure.\rBetter than the first one, that's for sure.\rBetter than the first one, that's for sure."
    },
    {
      "rating": "6",
      "text": "Clearly not as good as the first MiB. the humour is not so good and the story doesnt have many surprises. The effects are perfect though."
    },
    {
      "rating": "6",
      "text": "More or less, the usual sequel. The comedy and thrills desiccate within the end of the first half, and they fail to recuperate. I'l say this; the chemistry of Lee Jones and Smith never gives way to the overdrawn plot and characters"
    },
    {
      "rating": "6",
      "text": "The Men in Black are back.\rA fair sequel with enjoyable moments of charming humor, Men in Black II continues it's successful run with a similar plot but advanced wit."
    },
    {
      "rating": "5",
      "text": "The Charm Is Gone, Only At Round 2Sadly, MIB 2 isn’t very good and wastes all the potential it had despite another good performances from Jones and Smith."
    },
    {
      "rating": "6",
      "text": "Stupid plot but good mix of action and comedy it's a nice change from the first one."
    },
    {
      "rating": "6",
      "text": "This movie is mostly recycled MIB, with new parts that waver between bad and good. Frank and the worms score some moments, though, as well as some other aliens. Overall, though, there are better choices in this genre."
    },
    {
      "rating": "5",
      "text": "I often hear the question \"can sequels surpass their original?\r Well in MIB2, this isn't the case, it is nowhere near as good as the first, which I loved by the way.\r I was glad that Will Smith & Tommy Lee Jones were back, but wasn't completely convinced by Laura Flynn Boyle.\r Was disappointed to see that Linda Fiorentino was missing from the cast, as I felt she added some much needed glamour to the first film.\r Here's hoping they improve for MIB 3."
    },
    {
      "rating": "8",
      "text": "It is one of the good sequels for blockbuster movies. It is not as unique and refreshing as the first movie but has a great story, improves on the established lore and gets the fine mixture of seriousness and craziness of the franchise right. This includes the humor which was a strength of both movie. Like I already said for the prequel: It helps a lot that the movie takes itself not that serious and uses a lot of opportunities to make fun of (alien) conspiracy theories. It has of cause slapstick, situational humor, quirky characters and gadgets that would be excellent in superhero comic books. Some might even be to crazy or unbelievable for comic book science ;-). Just as set up: The Men in Black are based on a real life UFO conspiracy theory (I hesitate to use the word real life in connection with conspiracy theories). These are men in black suits looking like or claiming to be government agents who are speaking with people who have seen UFOs or other related strange things. They want that the people remain quite about the incidents and often they are threatening or bullying those people. The movie uses this idea to full potential as the Men in Black are a super secret agency that are policing aliens on earth and protecting mankind while keeping everything secret from public and government knowledge (No human except themselves on earth knows that they exist including even former members). It is set a few years after the conclusion of the first movie. Agent J (Will Smith) has worked his way up to being the top MIB agent but has never found a partner there while former agent K (Tommy Lee Jones) works in retirement at a post office (Of cause without any memories of his true past). This changes when the dangerous alien Serleena comes to earth to uncover a secret from the past and agent K is the key to this. This is the set up for the movie. I say it takes a while too long for me to get the duo back in action but then it fully delivers. I will say that the story is partly better than the first movie but also weaker in other parts. Clarification: Starts slower, is less refreshing but in the second half surpass the first movie (Overall I would say the sequel losses slightly). However the lore, worldbuilding and humor works excellent. They put a lot of effort into creating the feeling of the movie and mixture of hilarious humor and seriousness. If you make a movie enjoyable, interesting and immersive you can get away with a lot of stuff. Be warned that this can be a make or break point for others. The actors did a great job in the movie. A lot is around the dynamic and good chemistry between Will Smith and Tommy Lee Jones. These 2 are carrying the movie and make this a good experience. With Lara Flynn Boyle as Seerlena we got a new intimidating antagonist. She is truly enjoyable but also the hit or miss kind as others see her as failure (I disagree). Johnny Knoxville as a double role as henchman with a unique ability. Rosario Dawson is good in this. (To much spoilers if I go into details). There are of cause some returning characters and cameos. Good cast and for the genre also quite competent. Visually the special effects are again great and they get the look or better said aesthetics of the right. It aged good and fits the narrative. Soundtrack is O.K. for me but not awesome enough to be in a top 10 list. Overall this was an enjoyable sequel. Not as good as the original but definitely worth watching."
    },
    {
      "rating": "5",
      "text": "hombres de negro II es buena pero ha perdido al emocion de la primera la lucha es muy corta es aburrida contra la mujer extaterreste que parecia que moria y no y asi"
    },
    {
      "rating": "4",
      "text": "Men in Black II would be a thoroughly entertaining affair if it wasn't for one thing: the plot. The annoying and pointless storyline is a constant irritant because it diverts our attention from the real reason to see this movie - the easygoing chemistry between actors Tommy Lee Jones and Will Smith. These two slide so smoothly into their odd couple, buddy roles that an enjoyable motion picture could be made by having them sit next to each other and trade quips. Unfortunately, Men in Black II decides to surround these characters with a narrative that is so limp and idiotic that it can't even stand up when judged by the standards of comedies, let alone those of science fiction adventures.\r Aside from the Jones/Smith camaraderie, one could easily argue that Men in Black II's most prominent asset is its brevity. This movie clocks in at 80 minutes (!) - a laudable trait in an era when films tend to be bloated and overlong. Then again, the subject matter of Men in Black II is so anemic than it can't effectively sustain even its skinny running length, so, unlike its crisp predecessor, it feels protracted. That's a sure sign that director Barry Sonnenfeld didn't have much to work with.\r One of the film's supposed selling points is its special effects. However, the CGI work - as has too often become the case in recent years - calls attention to itself. The chief monster, played in human form by Lara Flynn Boyle, is as obviously a special effect as any creature to come along in the last five-or-so years. The rest of the aliens look like Star Wars rejects. These kinds of visual effects were a lot more impressive in 1997, when the original Men in Black arrived in multiplexes. Back then, CGI wasn't as all-pervasive as it is today. Then, its use seemed creative. Now, it seems lazy.\r The movie delivers what most people will be expecting it to deliver. Will Smith has his share of very funny moments. Tommy Lee Jones is the consummate straight man. There are aliens everywhere - big, small, furry, not-so-furry... If there could be said to be a \"Men in Black\" formula, this movie follows it rigorously. That's one of Men in Black II's chief problems - this is not a spontaneous joyride into science fiction comedy; it's a product. It was put together with one thing in mind - bringing the same people together on-screen in the hope that the box-office numbers will be similar.\r Viewed as a cartoon come to life, Men in Black II does the job, albeit barely. It's not nearly as fresh or enjoyable as its predecessor, but there are enough high points to keep this from being a complete waste of time. For those who want more of the same - go ahead, throw down your eight bucks. Men in Black II took five years and a number of false starts to reach the screen because of behind-the-scenes difficulties. Hopefully, no matter how much money this movie makes, those troubles will prevent there from being a Men in Black III. This franchise has already run out of steam. Let the Men in Black loosen their ties and rest in peace."
    },
    {
      "rating": "6",
      "text": "Just for the record, I loved the first Men in Black movie, it was funny, original and just enormously enjoyable. This sequel is not as good, but it is perfectly decent considering how awful some sequels have been. The stunts, special effects are gadgetry are just impeccable, as are the sets and cinematography, and Will Smith and Tommy Lee Jones still make for a charismatic and entertaining duo. I also liked Rip Torn and Rosario Dawson. The pacing is also fine, not as fast paced but efficient enough, and the music was catchy. However, the script does have too many weak spots(some of Smith's jokes are somewhat amusing though) and while the plot starts off great it meanders. The direction wasn't as brisk or as innovative either, and the ending was a little too silly for me. Overall, decent sequel but not great. 6/10 Bethany Cox"
    },
    {
      "rating": "4",
      "text": "Defending Earth, With Worms and a Talking Pug!\r Five summers ago, Barry Sonnenfeld's \"Men in Black\" opened on Independence Day weekend and made a ton of money, beating heavily hyped franchise pictures like \"Batman and Robin\" and \"The Lost World: Jurassic Park.\" To celebrate the anniversary of his insurgent victory over those weary sequels to earlier hits, Mr. Sonnenfeld has reassembled much of the original \"Men in Black\" cast and crew — Will Smith, Tommy Lee Jones, Rip Torn, Tony Shalhoub, a talking dog and, above all, the alien makeup maestro Rick Baker — to create, of all things, a sequel.\r At the end of the first \"Men in Black,\" Agent Kay (Mr. Jones) voluntarily underwent neuralization, a process by which all knowledge of the presence of space aliens in our midst, and of the existence of a secret government agency devoted to keeping track of them, is erased from the mind. That movie, a kinetic, whimsical pastiche of sci-fi spoofing and creepy-crawly costume design, had a similar effect, effervescing like a soda-pop bubble and vanishing into the pop-cultural ether.\r The second bottle, which opens today nationwide, is as fizzy as the first, but not quite as refreshing. The pleasurable, eye-popping sense of surprise has diminished, and the teasingly referential attitude shows signs of fatigue. The \"X-Files,\" which was the first movie's obvious satiric peg, has faded into syndication limbo, and paranoia is not as much fun as it used to be. Therefore, most of the allusions in \"Men in Black II\" are to the earlier \"Men in Black.\" (Martha Stewart and Michael Jackson both make cameo appearances that poke mild fun at their public images and are likely to provoke louder and nastier laughter than they or the filmmakers intended.)\r Within the trivial, ingratiating scope of its ambition, though, the sequel is pleasant enough. This is a picture that demands nothing of its audience, and not much more from its stars. (They, on the other hand, demanded quite a lot for showing up.)\r Mr. Jones and Mr. Smith once again don their black suits and neuralizer-resistant sunglasses, along with their baggy interracial-buddy-movie personas. Mr. Smith, who has recently broadened his range with his impressive performance in Michael Mann's \"Ali,\" slides back into a more familiar mix of bravado and silliness. Mr. Jones's line readings are beyond deadpan; each one is delivered as though he had just been awakened from a nap.\r At the beginning, Agent Jay (Mr. Smith) has still not adjusted to the absence of Kay, his mentor and tormentor. His new partner is a blubbery doofus (Patrick Warburton), who is quickly neuralized to make way for that motor-mouth dog. But the latest alien threat, which takes the seductive shape of Lara Flynn Boyle (whose cold-blooded charm is augmented by scaly reptilian appurtenances, including an extendable green tongue), can be handled only with Kay's help. He is tracked down at a Cape Cod post office and hastily deneuralized by the buck-toothed alien played by Mr. Shalhoub. Jay, meanwhile, develops a crush on a civilian (Rosario Dawson), who, in violation of agency protocol, he neglects to neuralize.\r There is much more, of course. Johnny Knoxville, the feral host of MTV's \"Jackass,\" is on hand, with an extra head, as Ms. Boyle's repellent sidekick. The two of them are at the forefront of an interplanetary conspiracy that obscurely threatens all life on Earth and that also involves a distant planet's light source. None of the intricacies of the plot are terribly difficult to figure out, or all that important.\r The movie really belongs to Mr. Baker, whose witty prosthetic creations crowd the screen in an impressive, exhausting display of inventiveness. A gaggle of swinging Rat-Pack-inspired hematodes called the Worm Guys pretty much steal the picture, and are likely to reap, for a time, the benefits of stardom — late-night talk-show appearances, product endorsements and relentless overexposure — until the next sequel (\"Austin Powers in Goldmember\"? \"Stuart Little 2\"? \"Return of the Battleship Potemkin\"?) comes along to send them, rich and happy, into oblivion."
    },
    {
      "rating": "3",
      "text": "For a handful of dollars... more.In this movie, we return to the world of MIB to follow a crisis where, business as usual, the Earth can be destroyed by aliens who are very angry with us. In the first line of defense is Agent Jay (Will Smith), that we saw in the first movie. Now he is a senior officer with much experience in his work, however, he will need the help of his former partner, Kay (Tommy Lee Jones) who is retired and whom the memory has been erased. Its a sequel to the first film, made a few years later and keeping the same actors and director. The script, this time, its signed by Robert Gordon.Like many sequels, this one failed to keep the original movie level. If the first film was a comedy that worked well, this one barely works as comedy, focusing too much on a kind of \"re-reading\" and \"rewriting\" of situational and contextual jokes that we saw in the first film. So, who saw the first may not find funny the second one. It's like eating every day the same dinner: sickens and loses joke. Not much to talk about the interpretations of two protagonists: both kept well their characters and, if the film didn't please someone, probably the fault was not theirs but the one who wrote the dialogs and jokes. What saves the film from being a total and complete failure are the massive special effects (they always sell) and the romantic sub-plot associated with Kay's past, who gives some dramatic depth to the story.When we watch the release of a sequel there are always two possible justifications. First: critics loved the first film and this has resulted in awards and notoriety; second: the audience loved the first film and this has resulted in a commercial success, a blockbuster. Personally, I think this sequel was launched with only one objective: to profit at the expenses of those who liked the first film. Its the cinema industry making money as best she knows. It's pity."
    },
    {
      "rating": "7",
      "text": "As long as you can get past a couple of cringe worthy moments, this is a fun and entertaining sequel... even if its not as good as the original"
    },
    {
      "rating": "8",
      "text": "Not as good as the first, but still pretty good. This time agent J has to make agent K remember who he is. Agent K needs his help on a case. Again really funny movie, especially the tiny aliens."
    },
    {
      "rating": "10",
      "text": "nojdownqojeofmcodndouudysbhwndidjiijjjjjioihygdemnbbvcxzasdfghjlooiuttreewegh"
    },
    {
      "rating": "8",
      "text": ",,,,,,,,,,,,,,,,,,,........`````````````````````````````++++++++++++++++++++++++++++》》》》》》》》》》》》》》》》》》"
    },
    {
      "rating": "8",
      "text": "----------------------------------8.4/10-----------------------------------"
    },
    {
      "rating": "6",
      "text": "This film is the weakest of the original trilogy, still beautiful and fun but not up to par with the other two, too full of self-citations and stuff already seen. However, entertaining and amusing film, even if without too many pretensions and without plot inventiveness."
    }
  ]
}