{
  "id": 1787,
  "title": "Men of Honor",
  "starring": [
    "Robert De Niro",
    "Cuba Gooding Jr."
  ],
  "runtime": 129,
  "genre": [
    "Drama"
  ],
  "description": "Against formidable odds -- and an old-school diving instructor embittered by the U.S. Navy's new, less prejudicial policies -- Carl Brashear sets his sights on becoming the Navy's first African-American master diver in this uplifting true story. Their relationship starts out on the rocks, but fate ultimately conspires to bring the men together into a setting of mutual respect, triumph and honor.",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wNUAnXV1mzOOfvnVBIYsalkk078.jpg",
  "categories": {
    "plot": 7.090909090909091,
    "acting": 7.142857142857143,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I am so surprised how this film didn't get any award !! Also how De Niro and Cuba who made a great performance didn't get an Oscar or golden globe at least for their role ?!The film is amazing and you have to watch it."
    },
    {
      "rating": "10",
      "text": "This film has a great message that has several ways to interpret you I at least understood so you have to study to work have a good job and engage in life see this film is very good."
    },
    {
      "rating": "8",
      "text": "The real fact story of Carl Brashear Jr. who has to break several rules and laws for achieve his highest goal: getting a place in the dangerous world of marine scuba diving. Cuba Gooding Jr. in one his most mature roles is brilliant. Stimulating but nothing else. Deserves a chance."
    },
    {
      "rating": "7",
      "text": "An inspirational story with some shortcomings. I enjoyed this film despite the hackneyed plot and the one-dimensional presentation."
    },
    {
      "rating": "7",
      "text": "This is a historical drama with themes including racism, integration and self motivation. I felt it was quite an eye opening film, clearly depicting the sort of racism which was presumably rife at the time its set in. I can't say it wasn't a hard watch at times but it seemed pretty realistic, a gritty realism if anything.I felt that Cuba Gooding Jnr did very well in his portrayal of Chief Carl Brashear, someone who seemed quite self assured and who was putting his all in to doing the best he could, in the situations he found himself in, with the odds inevitably somewhat against him. He looked at times both quite steely and determined and also rather emotionally vulnerable at times, understandably so. He comes across as someone who feels he owes it to people of his community, of his ethnicity presumably, to do the best he possibly can, to represent them and make the most of the opportunities he's apparently been given. The film features an impressive cast and as well as Cuba Gooding Jnr., Robert De Niro lays the other main character, that of his naval chief (boss) Billy Sunday. His character is also quite a stalwort, determined and if anything more self assured than Carl and as such, it was hardly a change of direction as far as De Niro's roles go, as he tends to play such people (that is aside from the more recent comedy roles he's taken on). Those two aside, other cast members include Charlize Theron as Gwen Sunday and Hal Holbrook as 'Mr. Pappy'.I felt that the two main characters and how their lives effectively intertwined was quite intriguing and bittersweet. This is quite a moral film, in that it depicts racism (and, to a lesser extent, alcoholism) and I felt it clearly showed it (certainly racism) to be discriminatory and negative, as it should be of course. Perhaps you could say its a somewhat typical Hollywood style film in pushing obvious principles towards the viewer but in the case of this title, I have no real issues with it. You could say its a bit cheesy, with a fairly heavy use, or reliance, of music to exaggerate and emphasis the emotional aspects of the plot but for the most part I thought it was well made. Said music is mostly classical in nature, some rousing numbers with crescendos and also some jazz pieces are heard as well.Content wise, this film features profanities including racist remarks, there are one or two sexual references made and violence mostly in the form of fist fights. Some characters are shown to be heavy drinkers and there are one or two frightening scenes when events happen suddenly, which could potentially frighten or traumatise very young viewers. The film carries a 15 rating to reflect this content.I felt that for the most part this was a well made film which features decent cast performances, although it is a little cheesy and sentimental. It felt like a worthy watch to me though and it is a story which I believe to be at least partially based on a true story, so as such its worth seeing, to get an idea of what things were like for such people at that time. I also feel that 'everyone has issues' is a phrase which very much applies in relation to this film - as such, it is relatively thought provoking. Another phrase that seems apt and which comes to mind, in relation to this film, is 'to swim against the tide'.Yes I would recommend this film, on the basis that it features a good cast and thus performances, its an emotive and interesting plot and in general it felt well made. It is a bit cheesy and sentimental at times and possibly it slightly over relies on the musical score but otherwise I can't really fault it, so I'd recommend it on that basis."
    }
  ]
}