{"id": 2107, "title": "Men in Black", "starring": ["Tommy Lee Jones", "Will Smith"], "runtime": 98, "genre": ["Action", "Adventure", "Comedy", "Science Fiction"], "description": "After a police chase with an otherworldly being, a New York City cop is recruited as an agent in a top-secret organization established to monitor and police alien activity on Earth: the Men in Black. Agent Kay and new recruit Agent Jay find themselves in the middle of a deadly plot by an intergalactic terrorist who has arrived on Earth to assassinate two ambassadors from opposing galaxies.", "releaseYear": "1997", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/uLOmOF5IzWoyrgIF5MfUnh5pa1X.jpg", "categories": {"plot": 7.473684210526316, "acting": 8.5, "ending": 8.75, "soundtrack": 10.0, "cinematography": 9.0, "familyFriendly": 6.0, "funny": 7.714285714285714, "action": 8.625}, "reviews": [{"rating": "10", "text": "One of the best sci-fi comedies ever that plays perfectly off of the chemistry of its phenomenal leads and it's lighthearted and smart but still somewhat crazy plot."}, {"rating": "9", "text": "A great science fiction movie that will make us see that we are not alone."}, {"rating": "9", "text": "I utterly adored this movie when it came out. Still do, but my feeling towards it have mellowed over the years. It's funny, original and has one of the best lines in human history: \"A person is smart. People are dumb, panicky dangerous animals and you know it.\" I love that line and it more or less defines my personal ideology. Overall: MIB was a fantastic movie of its time and is and always will be a great classic."}, {"rating": "8", "text": "a funny commendy with will smith and tommy lee jones they have great chemistry in this film . a decent plot that feels like it was just over to fast and not really given more time to devilpe into some thing more intresting with the focus being more on jokes . still a good film ."}, {"rating": "8", "text": "Initially the plot may seem slow and coiled, but after some of the film we discover one of the best pairs of pop culture interpreted by exelente W.Smith and TLJones, besides a story that bet on its originality."}, {"rating": "8", "text": "Men In Black will always be remembered for its two hilarious front men and it's famous \"mind-zapping\" tool that is frequently used throughout the series. Although not the best, Men In Black almost makes it there."}, {"rating": "10", "text": "I can't think of a single complaint I have about this movie. It's a great film that you can rewatch again and again. The casting choices were absolutely perfect, the special effects are dazzling (for their time), the story isn't hard to follow (but it's not too simple either), it's funny, and it's got great action sequences. A perfect action-comedy."}, {"rating": "8", "text": "In terms of storyline, the film is pretty much disposable. But in terms of performances and over-the-top action, it's a slam dunk: Men In Black is a blast."}, {"rating": "10", "text": "A science fiction comedy that was a surprise hit and created a successful franchise. It strengths are the awesome humor, hilarious ideas and concepts, special effects and of cause the actors. The Men in Black are based on a real life UFO conspiracy theory (I hesitate to use the word real life in connection with conspiracy theories). These are men in black suits looking like or claiming to be government agents who are speaking with people who have seen UFOs or other related strange things. They want that the people remain quite about the incidents and often they are threatening or bullying those people. The movie uses this idea to full potential as the Men in Black are a super secret agency that are policing aliens on earth and protecting mankind while keeping everything secret from public and government knowledge (No human except themselves on earth knows that they exist including even former members). It helps a lot that the movie takes itself not that serious and uses a lot of opportunities to make fun of (alien) conspiracy theories. It has of cause slapstick, situational humor, quirky characters and gadgets that would be excellent in superhero comic books. Some might even be to crazy or unbelievable for comic book science ;-). After the awesome set up introduction scene we follow officer James Darrell Edwards pursuing a suspect who has some strange characteristics. This is taken some interest in him and ends with a job offer wilder than what he can imagine. I like the story, set up and world building. It is a perfect mixture of seriousness and humor. If done in a bad way it would be just hilarious or even unbelievable. Here I never doubted anything and the movie was enjoyable from beginning to end. I just remembered an advice for movie makers “If you make the movie enjoyable, interesting and immersive you can get away with a lot of stuff”. I want to praise the script and ideas. This movie is so full of ideas that set up a remarkable world and lore. I will also praise the actors. Lets start with Will Smith as James Darrell Edwards. He is the new guy who enters wonderland. He is funny, entertaining and it is one of his best performances (in comedy!). Tommy Lee Jones as Kevin Brown is the stereotype of the awesome no nonsense agent. He is the yin to the yang and together they are quite enjoyable. Vincent D’Onofrio is a great antagonist. I cant spoil why but he made an impact and positive impression. For the side characters we have the excellent Frank the pug, Linda Fiorentino as (Dr.) Laurel Weaver, Rip Torn as Zed and of cause the worm guys;-). I truly enjoyed the cast. Visually the special effects were amazing for its time and aged impressively well. ILM (Industrial Light & Magic) are legends in the business for many good reasons. The soundtrack is good too. I almost had forgotten that Will Smith was also a rapper. Overall this was a pleasant surprise for my friends and me. It was one of the best movies of that year. It is carefully made as missteps would make a laughingstock out of it. I recommend it as it is refreshing, entertaining and has great humor atop of funny ideas."}, {"rating": "9", "text": "Men in Black is great fun from start to finish. If you care to look past the rather ridiculous plot (only occasionally), this is hugely enjoyable. The cinematography is skillful likewise with the direction, and the special effects are wonderful. The script is irreverent, and there are some truly great performances. Will Smith proves here he CAN act, and Tommy Lee Jones as usual is marvellous. Both make a unique and hilarious double act. Then there is fine support from underrated actor Rip Torn and from Linda Fiorentino, who is a talented actress that hasn't earned herself a high acting profile yet. The finale is a little overblown, but you cannot deny this is a fun film. 9/10 Bethany Cox"}, {"rating": "9", "text": "it is a good alien movie, Will smith is a good distraction, and the future teach(especially the guns) are flat out awesome. I think that Will Smith did not disappoint in this movie"}, {"rating": "8", "text": "A classic 1990s Sci Fi comedy that has stood the test of time, Men in Black is just as charming and funny as it was upon release. This is a great movie night option, and one that now has the added backing of nostalgia. Tommy Lee Jones and Will Smith are iconic in this movie, and Barry Sonnenfeld's direction is fast paced and well timed. Don't miss Men in Black!"}, {"rating": "9", "text": "Hilarious ClassicMen In Black is clever, funny, goofy, creative, well written and outright lovable."}, {"rating": "10", "text": "Absolutely hilarious. Great writing, cast, and acting. Tons of re-watch value. In any case, I would recommend the original over 2 and 3. One of the best science fiction comedies."}, {"rating": "9", "text": "This movie definitely knows how to merge comedy, adventure and science fiction, toasting with the very charismatic characters played by Will Smith and Tommy Lee Jones, who are in perfect tune and have great moments of humor (although Lee Jones has a serious character in hands)."}, {"rating": "10", "text": "A+ *************************************************************************"}, {"rating": "10", "text": "The sunglasses used by the Men in Black are the Ray-Ban \"Predator 2\" glasses. After the film's release, Ray-Ban reported that sales of these glasses tripled from $1.6 million to $5 million."}, {"rating": "7", "text": "Very funny in parts very slow in others the rest is all good and very enjoyable ."}, {"rating": "9", "text": "knkninubugyfdtesestfuninomokintfesesgyjiijugihokinyftdyghiihtdrdfuuhihihugkooinihguyt"}, {"rating": "9", "text": "----------------------------------8.6/10-----------------------------------"}, {"rating": "10", "text": "Tommy Lee and will Smkith rocks in this this movie, i hope they come back as pairs again, because they are good together."}, {"rating": "8", "text": "\"Men in Black\" is a beast in entertaining the audience. It's joyfully unpredictable and fun with great characters. Great job, Barry Sonfield!!!"}, {"rating": "8", "text": "Really entertaining overall. Funny, action-packed, and intriguing, Men in Black is successful on really every front you could ask from a summer blockbuster. Not ground-breaking cinema in the least, this one is still a fun watch with great performances from Tommy Lee Jones and Will Smith."}, {"rating": "8", "text": "A solidly conceived sci-fi action flick that embraces it silliness and offers up a bountiful mass of thrilling laughs."}, {"rating": "7", "text": "Men in Black was such an entertaining well acted sci-fi comedy.  I enjoyed the chemistry between Tommy Lee Jones and Will Smith and the bugs are kind of cool."}, {"rating": "8", "text": "Few words in my vocabulary can describe 'Men in Black' other than interesting. Will Smith's comic dialogue coupled with Lee Jones' cynical role generate a fair amount of laughs. The CGI doesn't really the hurt the film, like most times in a live-action movie."}, {"rating": "10", "text": "This movie promised to be a fun, action packed sci fi comedy. It delivered on that 10/10 it definitely aint no documentary for those of you who are confused."}, {"rating": "8", "text": "An urban leyend made as movie that works as well. Especially for well balanced action and comedy, and because the SFX serve the movie, not reverse. Shocking chemistry Jones - Smith."}, {"rating": "8", "text": "A favourite 90's flick of mine that never gets old no matter how many times I've seen it, and was also one of the first more mature films I watched growing up (as I would have only been around 7 when I first saw it). Jones & Smith play off each other perfectly in this Sci-Fi/Comedy/Action flick that has a nice blend of all three genres. There have been similar films to this but I think MIB pulled it off the best thanks to the actors and characters, and its one of those classic 90's flicks."}, {"rating": "7", "text": "Really enjoyable SciFi comedy with great acting and humour. Smith and Lee Jones are perfect."}, {"rating": "10", "text": "Awesome. One of my favorite sci-fi flicks."}, {"rating": "8", "text": "Here comes the Men in Black. they won't let you remember."}, {"rating": "5", "text": "Men in Black is a fun effects driven blockbuster. It doesn't excel in any particular category but entertains throughout the run time. Linda Fiorentino is easy on the eyes too."}, {"rating": "5", "text": "Men In Black was entertaining in many ways however there were 2 reasons I found that severely limited it. 1- The Jokes while funny seemed to be more important than the actual story. The jokes seemed to keep the story going.2- The story was second rate due to the jokes, too many jokes and not enough story for my taste. Make me laugh, but make a creative story line to keep me encapsulated and interested.Because the storyline was run by the jokes, and the jokes weighed down what little there was of the story, the movie came off to me as more of a comedy series on youtube than a quality movie.At the same time, I love fun comedy and thought the movie made for fun, though pointless TV. In conclusion MIB is very fun, IF your only looking for a laugh. Otherwise your looking as the wrong movie."}, {"rating": "5", "text": "Men in Black has some funny scenes with interesting characters that make the story move along. Will smith came across as annoying and irritating throughout the film."}, {"rating": "6", "text": "A mildly entertaining movie, but it's as generic as it gets.\rA mildly entertaining movie, but it's as generic as it gets.\rA mildly entertaining movie, but it's as generic as it gets."}, {"rating": "7", "text": "A very,very overrated movie.It's a good movie but it does not at all deserve the praise it gets.The movie is quirky,has great special effects,and is funny,but it is also kind of dull."}, {"rating": "7", "text": "Men in Black attracts like a magnet.\rAn extremely smart and comical extra terrestrial adventure, twisted with humanizing moments and characteristics. Will Smith and Tommy Lee Jones click together in this well directed action comedy."}, {"rating": "3", "text": "I don't care for Will Smith, as he is WAY over the top with his \"street cred\" attitude in every single show or movie I have ever seen him in.  I don't get it. He is simply not nearly bad ass enough to have that much ego.  Further, MIB movie contains the all too familiar cranky, veteran partner in Tommy Lee Jones who strikes me as just a crotchety old man throughout the whole thing.  Great for kids, maybe, but MIB will likely not date well, so the longevity it will have with even the 13 and under demographic remains to be seen."}, {"rating": "8", "text": "Have you ever seen a tabloid headline like this: \"Woman gives birth to son of six-headed alien\"? Men in Black, the new science fiction comedy from cinematographer-turned-director Barry Sonnenfeld (Get Shorty), postulates that such stories are not the result of fertile imaginations, but accurate representations of the truth. You see, ever since the 1960s, Earth has become an intergalactic hideout for aliens in need of a place to lie low for a while. Currently, there are over 1500 visitors, most in New York City (based on personal experience, that number may be low), and their ranks include such high-profile names as Sylvester Stallone (he obviously had trouble mastering the language), Newt Gengrich (guess what he looks like in his natural form), and Dennis Rodman (who knew?).\r In many ways, Men in Black is the movie that Mars Attacks! wanted to be, but wasn't. This is a snappy, clever, often-funny motion picture that provides the perfect blend of science fiction-style action with comic dialogue. The screenplay, credited to Ed Solomon (and based on the Marvel comic book by Lowell Cunningham) has a sly, sophisticated edge that many blockbuster scripts lack. Sonnenfeld's direction is crisp and the editing is tight, resulting in a film that clocks in at a mere ninety-five minutes, which proves to be a nearly-perfect length.\r That's not to say that the movie is of masterpiece status, or even light on flaws. There are plenty of minor problems along the way, and the ending is somewhat rushed and anticlimactic. On the whole, however, viewers are less likely to remember the glitches than the clever one-liners, subtle parodies, and effective use of visual effects to integrate aliens into everyday existence. Men in Black's deliciously unconventional spirit lends a refreshing twist to a premise that has fueled numerous conspiracy theory movies and one currently-popular television series.\r The chief pleasure of Men in Black isn't being dazzled by the special effects, but enjoying the deadpan performances of Tommy Lee Jones (whose offhand attitude towards the most bizarre events would make Jack Webb proud) and Will Smith. This is a rare case when the multi-million dollar, computer-generated creatures don't upstage their real-life co-stars. Smith and Jones are a fine pair, and the film's focus on them never wavers. However, while the two leads can't complain about screen-time, the supporting players have all been short-changed. Linda Fiorentino, who gets third billing, is vastly underused, appearing only peripherally throughout. Vincent D'Onofrio (as the bad alien's human host) and Rip Torn (as Zed, the leader of the Men in Black) don't fare much better.\r A word of caution for those who expect to see Independence Day 2: despite the attempts of certain marketing campaigns to link the two, they're vastly different in scope and intent. Men in Black is an outright comedy (in fact, some of its satire is directed at movies like last year's box office champ), not a pastiche of worn sci-fi/adventure elements, and there's no big space battle to be found. In fact, from the opening credits to the closing ones, our heroes stay firmly rooted on terra firma. Those accepting Men in Black for what it is will likely agree that this is one of 1997's more satisfying big-budget offerings."}, {"rating": "8", "text": "I present to you... possibly one of the best movies featuring both Tommy Lee Jones and Will Smith. You'll pretty much enjoy it the same way as I did and you're going to love it."}, {"rating": "7", "text": "Men in Black is a film that sins of a cliché argument too seen already even in its time, 22 years ago.Its special effects are mostly lazy, and the aliens do not stand out in the dark, not because of their limited screen time or their uninspired design.However, it incorporates elements that work well, such as the Men in Black Agency and the protagonists, making this a funny movie."}, {"rating": "7", "text": "This movie was a favorite for a lot of people in the 90's and kids growing up from the 90's as well. The director is already a favorite of mine just because of addams family thank you Barry Sonnenfeld for that one and this one. MIB doesn't hit a dark tone like its comic did but out of all that humor you see some very dark speculations like the great attractor and the way they combine certain sightings or weird historical facts that led to nowhere this movie was very good and inspired many after it. The Buddy cop routine was dead wasted by the time MIB showed up but somehow it just worked with Will Smith and Tommy Lee Jones leading the charge."}, {"rating": "9", "text": "It's fun, hilarious, and refreshing! It has an absolutely peculiar plot and overall weirdness (in a good way) to it. It's the main reason as to why I want to see 'Men in Black: International'."}, {"rating": "10", "text": "Will and Tommy make a hilarious comedy duo. There is also plenty of action and alien effects."}, {"rating": "10", "text": "The driver smuggling illegal aliens along a road marked \"375\" claims to have been \"fishing in Cuernavaca.\" 375 refers to Nevada State Road 375, known as the \"Extraterrestrial Highway\" for being near Area 51. Cuernavaca is the Mexican city which British ufologist Gordon Creighton claimed a flying saucer had crashed near in 1951 and the saucer's dead aliens thereupon whisked away by the U.S. Air Force with Mexico's alleged cooperation."}, {"rating": "7", "text": "MIB isn't anything more than it is...lite-headed, sci-fi spoof carried well by two great actors. But if that's all you want, MIB will do the job. Don't be fooled by the image of two guys carrying big guns, as the action's not a big priority, and thus isn't impressive. For great alien-blasting action, watch Starship Troopers."}, {"rating": "9", "text": "The Men in Black are a highly funded yet, top secret government agency, set up to deal with alien life in the galaxy and on Earth. When the agents discover a deadly plot involving an intergalactic terrorist to mismatched agents must work together to present a catastrophe.Men in Black is without doubt one of the best movies of the 90’s. Will Smith and Tommy Lee Jones prove to be a great on screen team and provide plenty of great action, and plenty of laughs. The sequels may have all been a let down, but the original is still a great watch."}, {"rating": "9", "text": "Very entertaining movie with a good and surprising story. The humour was good also. Only Will Smith was a bit annoying with his overcool acting."}, {"rating": "10", "text": "My favourite alien comedy. Will Smith is as good as always, the concept is briliant, movie is full of fresh ideas and now a true classic. Highly recomended."}], "recommendations": ["men_in_black_ii", "evolution", "mars_attacks", "the_nice_guys", "wild_wild_west", "johnny_english_strikes_again", "iron_man", "the_fifth_element", "the_gentlemen", "thor_ragnarok", "demolition_man", "madagascar_escape_2_africa", "austin_powers_international_man_of_mystery", "ghostbusters", "captain_america_the_first_avenger", "last_action_hero", "american_ultra", "snatch", "kingsman_the_secret_service", "robots", "the_losers", "red_2", "the_league_of_extraordinary_gentlemen", "paul", "guardians_of_the_galaxy"]}