{
  "id": 3575,
  "title": "Mercury Rising",
  "starring": [
    "Bruce Willis",
    "Alec Baldwin"
  ],
  "runtime": 111,
  "genre": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Renegade FBI agent Art Jeffries protects a nine-year-old autistic boy who has cracked the government's new \"unbreakable\" code.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/60AAso6I2TzQCy2SjqtzPni8csA.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 5.0,
    "ending": 8.0,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "When I saw this film I was very surprised because I seemed to notice similarities with \"The Sixth Sense\", a film that was released the following year, in 1999. Let's see: in both films, Bruce Willis is the protagonist and acts with a special child (for different reasons), trying to help her in something. The same main actor, the same structure supporting the two scripts, the involvement of a child in both films, the temporal proximity between productions... it can't just be a coincidence... or can it?In this film, Willis brings to life an FBI agent, expert in covert operations, who will, however, become interested in the situation of a boy, autistic and with a strong inclination to solve riddles and advanced mental problems, whose parents were mysteriously murdered. His action will, however, trigger an enormous operation, moved by secret elements within the American governmental apparatus, whose objective is to kill that boy. The reason? Inadvertently, he ended up breaking a high-security military code in which the government had invested millions, and which they believed to be the most advanced ever.The film starts off very well, and it develops in a satisfactory way. Despite this, it never seems to be a cohesive work, perhaps because of a deficient editing work... it seems like a patchwork, in which the narrative line does not always make sense and which becomes more disjointed as the ending approaches, and the script does desperate efforts not to leave loose ends. The pace is quite good, and the action scenes are well done, although the tension and suspense don't always really work.Willis proved to be an excellent protagonist. This role, moreover, seems to have been tailored to the qualities of this actor, who will achieve, at this stage of his career, several hits that will make him a name to be taken into account by Hollywood producers. Despite being very young, Miko Hughes also disentangled himself very well from his role, despite not being particularly demanding in my opinion. Alec Baldwin is a solid and consistent villain, and makes a restrained but effective participation.Technically, it's a film that has solidity and quality. Not being a blockbuster, nor having the expressiveness and visual grandeur of the films in that record, it is committed to using quality visual and special effects, especially in action scenes. The cinematography is also very good and atmospheric, and the locations used in filming helped a lot. The soundtrack is not very noticeable, but it contributes merit notes to a well-rounded overall picture."
    },
    {
      "rating": "8",
      "text": "Well what can I say about the film is that i really enjoyed the movie. I really like how the movie shows how the guilt that Art has after seeing that teenager die in the beginning of the movie really made him want to help and save Simon who is also a child. That is one of the main plot points that i really liked of this film. I know some of you people might think that their isnt much in this movie well you wrong this movie is a classic in its own genre it shows how far a good man will go to save a child in need of saving."
    },
    {
      "rating": "6",
      "text": "Not nearly as bad as most critics would have you think.  I didn't feel that having the kid be autistic was exploitative, and Willis brings his great action stuff.  Even Baldwin wasn't TOO terrible."
    }
  ],
  "recommendations": [
    "sicario_day_of_the_soldado",
    "beirut",
    "body_of_lies",
    "man_on_fire",
    "a_most_violent_year",
    "the_sum_of_all_fears",
    "the_equalizer_2",
    "the_gunman",
    "child_44",
    "good_time",
    "the_accountant",
    "mark_felt_the_man_who_brought_down_the_white_house",
    "morgan",
    "what_happened_to_monday",
    "a_most_wanted_man",
    "cube",
    "hell_or_high_water",
    "white_boy_rick",
    "minority_report",
    "blackhat",
    "no_sudden_move",
    "gothika",
    "argo",
    "broken_city",
    "deepwater_horizon"
  ]
}