{
  "id": 4616,
  "title": "Miami Vice",
  "starring": [
    "Colin Farrell",
    "Jamie Foxx"
  ],
  "runtime": 132,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "A case involving drug lords and murder in South Florida takes a personal turn for undercover detectives Sonny Crockett and Ricardo Tubbs. Unorthodox Crockett gets involved romantically with the Chinese-Cuban wife of a trafficker of arms and drugs, while Tubbs deals with an assault on those he loves.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1KGD2g0wOc7WBfHc5G19reLHQxk.jpg",
  "categories": {
    "plot": 5.571428571428571,
    "acting": 5.5,
    "ending": 5.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 1.0,
    "action": 6.862068965517241
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Other than the names and setting, the movie incarnation of Miami Vice seems to have very little in common with the show that inspired it, which I imagine will disappoint anyone who checked it out hoping for some retro reminiscing. The acting was extremely stiff, the plot was uninteresting and extremely cliched, and the setting was far too modern. While there was a couple decent action scenes and some may like the \"romances\" - but you'd be better off watching some re-runs of the original series or better made action movies."
    },
    {
      "rating": "10",
      "text": "Miami Vice is hands down one of my favorite films of all time. I don't quite understand why it was never received well but I think it's just amazing. Colin Farrell and Jamie Foxx are both great, as well are the rest of the supporting cast, Michael Mann did an incredible job directing the movie, the plot develops well and is very interesting, the action scenes are done brilliantly, etc. Honestly, I don't think there's a single flaw in the movie. It's definitely different, so I guess some people expected something else. It's not your typical action flick, that's for sure. It's almost more of an action-thriller in how it's filmed and presented to the viewer. The shaky cam and camera angles and effects work when used because of the overall feel. I'm not saying everyone will love it because it is a bit slower and replaces dialogue with introspection from the actors forcing the audience to pick up on the subtleties and nuances of the plot's development. Those things aren't in your face so some people might get bored with it. Not me. I thought it was great."
    },
    {
      "rating": "5",
      "text": "Decent. Apparently what most people consider Vice's biggest selling-point is what I consider its biggest flaw. The scenes change rather rapidly, and little is revealed through dialogue (with the exception of a few key moments). It's basically Heat with Sonny and Rico, except that this formula worked for Heat and makes Vice seem a little awkward. As if the premise of the movie wasn't already far-fetched (vice cops who live on the beach, wear designer clothes and drive expensive sports cars), the ending is pure fantasy (not to mention pure idiocy). It is also quite lengthy at 2 hrs 20 min; proper editing could have easily eliminated about 10-15 minutes. It is worth renting if you like movies about undercover police work and if nothing else catches your eye. I really can't recommend owning it."
    },
    {
      "rating": "10",
      "text": "Classic stuff from Mr. Mann. Enjoyed it more the second time. What's really diffrerent about this show is that it looks like a Hollywood blockbuster but plays out like an indie."
    },
    {
      "rating": "8",
      "text": "Miami Vice is a truly excellent film from Micheal Mann. It's superbly acted and beautifully shot. The gun-play is satisfyingly meaty and intense but the real heart of this movie is the chemistry that blossoms between Gong Li and Colin Farrell. A phenomenal film from start to finish."
    },
    {
      "rating": "3",
      "text": "This was a horrid waste of time. My girlfriend practically fell asleep the movie was so slow and uninspired. The acting did not at all pull me into the emotion of the caste. The 'shaky' camera effects are old and headache inducing. Why can't I just sit anymore and see a scene with 2 people holding a conversation without having the camera shake? Either hire a new camera man or get a better tripod. It's not live it's not cops it's not smart or cute anymore. The 'smart parts' weren't that smart and 90% of the movie was utterly pointless leaving us saying \"why are they doing this again?\" and not because the easily predicatible plot was anything hard to understand, but because what they were doing was flat out a waste of time and energy."
    },
    {
      "rating": "1",
      "text": "Whatever happened to the Michael Mann I know and love? Satan, leave his body! This was the most meandering, pointless, self-congratulatory and unnecessarily long movie I've seen all year. They could"
    },
    {
      "rating": "9",
      "text": "excellent. very atmospheric. gun battles were loud and terrifying. couldn't understand what the heck they were saying some of the time. farrell speaks in a odd formal way at the start. on par with collateral."
    },
    {
      "rating": "8",
      "text": "Best cops and robbers since...Heat."
    },
    {
      "rating": "0",
      "text": "It was bad. I have seen bad movies before but this one tops the list as one of the worst movies ive ever seen. The movie kept dragging on, and pretty much from the beginning to the end i was confused to what was going on in the story. The rare action scenes were nice but they were considerably short compared to there 3 or 4 crappy sex scenes. The acting was BAD. They hired like 3 or 4 well known actors and basically got all these unknowns (which I don"
    },
    {
      "rating": "9",
      "text": "I went to see this movie expecting the worst. All the user reviews were horrible. Boy are they wrong! Go see this movie! Beautifal cinematography, stellar acting (Colin Ferrell is awesome as Sonny), good dialogue, and great action. Overall it was a fantastic moviegoing experience and I'd highly recommend this film to everyone!"
    },
    {
      "rating": "10",
      "text": "Great movie with non-stop action and suspense..a must see even if you were too young to have seen the original series with Don Johnson. Collin Ferrell really brings it home in this one."
    },
    {
      "rating": "2",
      "text": "It's disappointing when the creator of Miami Vice can't save this on the big screen--script wise, it was silly. Visually, it was very good. There is no on-screen chemistry between Colin Farrell and Gong Li. If we are to believe that Farrell would stretch the limits of the law for his love, then the chemistry should have been as palatable as Pitt and Jolie in Mr/Mrs Smith. Plus Farrell really looks bad--bad hair dye job, bad physical condition--really bloated and obvious lack of skin shown to the audience (vis-a-vis Jamie Foxx and his hot bod), and did I say bad hair? Don't waste your money to see this, wait for the DVD."
    },
    {
      "rating": "9",
      "text": "Much, much better than I expected. Understated performances, emotionally satisfying storyline, great action sequences (but not too many of them, thank god! I am getting very sick of endless explosions in every movie). Jamie Foxx once more shows himself to be best actor around at present, and Colin Farrell is pretty good as well. Gong Li is terrific in her first English speaking role. The romance with Farrell really works.The baddies are also terrifying in their malevolence and believability. And the scenes in Cuba are terrific. Overall, a better film than Heat, and nearly as good as Collateral."
    },
    {
      "rating": "10",
      "text": "I am not sure what everyone has been critizing this for. Too long? No way! Not enough action? Are you kidding me? There doesn't have to be tremendous blow em' ups to provide action. I loved this movie. As has been discussed here, in the media, etc. this is NOT the Miami Vice of long ago. Gone are the pastel shirts and buddy-buddy jokes. This is down and dirty no holds barred Miami Vice. The filming is raw, the sex scenes are fantastic and sexy Colin Farrell, well he's no Don Johnson!!!"
    },
    {
      "rating": "8",
      "text": "While it's definetely not Mann's best work, I still found it to be quite enjoyable. Personally I'm glad the movie was more serious and intense than the show was. It was a little slow at times but made up for it when things started to pick up. Outside of the shaky camera, it looked great too. I recommend it."
    },
    {
      "rating": "2",
      "text": "Terrible! Walked out. Zero chemistry between love interests. Uninteresting dialogue, boring action, worst movie i've seen in a while."
    },
    {
      "rating": "3",
      "text": "I hated this movie. I fell asleep 3 times during it, because there is nothing exciting in it."
    },
    {
      "rating": "8",
      "text": "I'm getting pretty sick of those people saying that there is no chemistry between Farrell and Foxx- what do you expect, for them to kiss?? These characters are meant to be professionals who reside within a corrupt, bloody and violent environment. Mann is exploring the conflict in these characters of being in such an environment and having to supress their emotion. As a result Crockett and Tubbs have to be cold hearted. The fact that there are so many sex scenes? Perhaps to show that real love cannot exist within these surroundings. Miami Vice is not supposed to be 'glamourous' or 'rewarding'. Mann should be praised at not conforming to 'Hollywood' style 'wrappings'. The characters are meant to be distanced from the viewer. This is perhaps why we struggle to understand the dialogue and the speech. Mann does not want the middle class viewer to say to themselves--'oh I can connect with these characters, now I understand what this kind of life is all about' and then switch off the Tv or leave the cinema to return to milk and cookies and a warm bed. Crockett and Tubbs are meant to be difficult. People complain that there is essentially no story, which is absolutely dim-witted. The story is at its basic level a drugs bust. There thats it: what more do you want, aliens? The Lock Ness monster? A talking square of sponge? This film is searching for a gritty realism and that means no resolved endings or reformed charcaters, no closure or final resolutions which the viewer can be 'satisfied' that everything has fallen into place. The title only comes up at the end because nothing has changed: there will always be guns, drugs and killings. There will always be vice, and no Crockett or Tubbs can change this."
    },
    {
      "rating": "3",
      "text": "Did anyone ever give Jamie Foxx a script...was there a script?? Agonizingly rehashed"
    },
    {
      "rating": "9",
      "text": "This was a grat action filled movie. I was on my seat every minute."
    },
    {
      "rating": "2",
      "text": "Simply one of the worst movies I have ever seen. There is a terrible sex scene. I nearly vomited all over my popcorn... Incomprehensible and unbelievable plot. Cliches strewn everywhere like a field of cow dung. Loved getting out of the theatre!"
    },
    {
      "rating": "10",
      "text": "Very classy and well-told with reverence to the original/Great, realistic action and lucid, neon cinematography."
    },
    {
      "rating": "4",
      "text": "Read: \"Charlotte Observer - Lawrence Toppman\"'s review at 38... It's right on! And the only reason why I gave it a rating as favorable as a 4 is because the deaths look very cool... nothing else."
    },
    {
      "rating": "2",
      "text": "I truly cannot remember the last time I had a more excrutiating movie-going experience. The acting was so over the top and self-absorbed and the dialogue was so melodramatic and overcooked I thought I was looking at a terrible opera about the dangers of the drug trade. Sprinkled with gratuitous and pointless shower sex scenes, of course. I will credit the cinematography and action choreography however. They were very well done and definitely the highlights of the movie. It really makes you wish that the majority of the film revolved around these action scenes since a) they are very well shot, gritty and exciting and b) the actors aren't talking. It's those talking times when the movie really begins to derail and unfortunately it takes up a majority of the 2.5 hours you're stuck in the theater, uncomfortably shifting waiting for the train wreck to end. Perhaps I'm being overly critical, but this is what I sincerely felt throughout the entire movie and all but one of the 5 friends I saw the movie with felt the same way. I really believe my 2 is generous. In any case I still respect Michael Mann as a director and would recommend any of his other films, but if you haven't seen Miami Vice already, spare yourself the pain and wasted time and see The Insider, Heat or Collateral. Any of those films is time far better spent."
    },
    {
      "rating": "8",
      "text": "The way this film is shot, edited and scored, the actors and the words coming out of the their mouths almost don't matter. This is a beautiful, beautiful action movie with real thrills in the action scenes and envious fast cars, boats and women. A real fun ride for a summer night."
    },
    {
      "rating": "2",
      "text": "One star for Naomie Harris, who had the guts to demand a body double for her preposterously unnecessary nude scenes; another star for one brief second in a nightclub when Ms. Harris's character Trudy Joplin and Elizabeth Rodriguez's Gina Calabrese exchange the sort of knowing, connected, smart glance that the guys try-- and fail-- to exchange for the entire film. Not that it's easy to see expressions on anyone's faces in this sea of mud. When you're shooting a post-apocalyptic zombie flick like \"28 Days Later\" on a zero budget, digital video is fine. It is not fine when your budget, oh Mr. Michael Mann, is supposedly $150 million. \"Miami Vice\" is the worst kind of movie: it has absolutely nothing engaging about it. It's as though they took a film-- any film-- and squeezed all the life and humor and intrigue and excitement out of it. There's nothing here but a cold, bitter, muddily shot shell of a film. Colin Farrell and Jamie Fox have nothing in the way of chemistry; they have nothing but amazingly bad haircuts. The highly touted (how can you spot the boy review writers in this picture?) sex scenes are pointless and perfunctory. Intelligible, intelligent dialogue-- anywhere?-- nope. Characters we can give a rat's patootie about? Are you kidding? Mr. Farrell and Miss Harris in life-or-death rasslin' matches with their adopted accents. Ooh, yeah-- and it ain't pretty. Come to think of it, none of \"Miami Vice\" is pretty. Except for the clouds. And I can see those for free. A bitter, bad-spirited, unrewarding, and unentertaining film. Stay home and watch \"Heat\" instead."
    },
    {
      "rating": "8",
      "text": "After sitting through \"Pirates of the Caribbean: Dead Man's Chest,\" this was a blessing in a sense. Easy to follow story line (Unlike Pirates which the most ill-contrived piece of pure crap for a script). Kilo's of Coc, big guns, bad guys, love interests, etc... But their were a few of those moments that you just loved about movies. When people in the theater let out, all together, \"ohhh D*mnnnn.\" It has a enough well composed action sequences to make me reccomend it. Go to the theater and see it. Or Rent, don't buy."
    },
    {
      "rating": "9",
      "text": "Hyper-realistic, chilling, scary movie about REALLY bad drug dealer types and the people fighting them. If your a fan of Michael Mann (I am) you will love his signature look and pacing - its better than ever. The drama and action are first-rate. The only reason I didn't give Miami Vice a 10 is because the film was a bit long - there a few scenes that could have be trimmed back."
    },
    {
      "rating": "8",
      "text": "Excellent movie by michael mann. not his best, but still very well made. you arent spoonfed everything word for word. you actually have to pay attention, and that is rare nowadays."
    },
    {
      "rating": "0",
      "text": "This was the biggest movie disappointment I have ever seen. Not enough action, they must have been trying to save money. No car chases, no boat chases, no tension or suspense. No funny dialog. In fact most of the dialog was practically impossible to understand. The movie is full of sex scenes (2 shower scenes, michael mann must have a thing about sex in the shower) that are neither sexy nor bring any emotion to this movie. The plot is so full of holes from the improbable to the unfinished story lines. Don't waste your money...."
    },
    {
      "rating": "6",
      "text": "Flat looking. Ordinary. This is what $150 million gets you nowadays?"
    },
    {
      "rating": "7",
      "text": "Fun and exciting! Michael Mann is a great visual and stylistic director. Engaging action sequences."
    },
    {
      "rating": "1",
      "text": "One of the worst films I have seen in a long time. Completely and utterly unoriginal. There is nothing in this movie that hasn't been done a thousand times, and better. Tries to be a more serious \"Bad Boys\" and fails miserably. Michael Mann's camera work, while used to great effect in \"Collateral,\" only serves to emphasize the horrible overacting and banal dialogue. Farrell's and Foxx's charisma are nowhere to be found in this film. Avoid it like the plague."
    },
    {
      "rating": "8",
      "text": "It's a solid,sexy, shooty movie full of grit, speed, damaged people and real drama. It's no classic, but it's rather better than the name might leadmyou to expect."
    },
    {
      "rating": "0",
      "text": "Huge fan of Michael Mann. This movie was incredibly disappointing and BORING! We walked out. What a waste of money. How irresponsible - think of all the children in third world countries this terrible movie could have fed! Make a donation to something worthwhile instead. It will definitely be more enjoyable!"
    },
    {
      "rating": "2",
      "text": "I admit I'm not the brightest bulb in the Cristmas tree, but I found the plot terribly difficult to follow. To me, an intriguing story is the core of a good movie. In this movie, I had the hardest time figuring out who was who, what was what, and what people's motivations were. Ya, I guess it was about two undercover cops infiltrating a drug gang because all the agents at all the federal agencies were known by the drug lords. But beyond that, what really happened? And the dialogue? \"There's undercover, then there's which way is up.\" Way too cool for me. If you like Michael Mann and Jamie Foxx, see \"Collateral\", a movie with a lot more edge."
    },
    {
      "rating": "9",
      "text": "Quite possibly the best action movie...the Bad Boys Antithesis. well done."
    },
    {
      "rating": "9",
      "text": "I have read a lot of complaints about this movie and I only have 1 thing to say: \"this is not Bad Boys 2 with a gunfight, car chase, and/or explosion every 5-10 minutes!\". True to Mann's style (and the Miami Vice TV show that HE PRODUCED) much of the movie is setting-up each character's individual path. SO when all of the different characters' paths finally meet, there is conflict (example being Heat: you see Deniro's path and Pacino's path and ultimately you know at some point these 2 paths have to meet and it will be very bad for 1 of them). Definitely 1 of the better movies I saw this Summer!"
    },
    {
      "rating": "9",
      "text": "Michael Mann does well with mysterious characters in simple plots, so there is a lot left to mull over after the credits roll in Miami Vice. As usual for Mann, the visual complexity of the film matches and enhances that of the story--the story of those choices people must make while clamped in the vice of a dark, uncertain world. I found myself very involved with the characters, whether in disgust and terror or admiration and sympathy, and I really, really enjoyed this film."
    },
    {
      "rating": "9",
      "text": "Little jumpy to follow, but good fun."
    },
    {
      "rating": "10",
      "text": "The name Miami Vice it the only thing that hurts the movie. A realistic action movie that is fairly dark. Its a little hard to follow in the beginning, but the camera work is amazing."
    },
    {
      "rating": "1",
      "text": "Worst Michael Mann movie - EVER!"
    },
    {
      "rating": "4",
      "text": "I agree with much of what has been said. What was the point of the film ? Did the Archangel character get caught ? Could they really let Ging Li go ? How can an \"action\" film be so boring ? And finally ..\"I'm a fiend for mojitos\". Aaack!"
    },
    {
      "rating": "2",
      "text": "I walked out. Need I say more?"
    },
    {
      "rating": "7",
      "text": "I wasn't expecting as much as I got. At best it's an exhilarating, compassionate study of the fragility of masculine ideals; at worst it reminds you what made Heat so good."
    },
    {
      "rating": "8",
      "text": "I had the pleasure of seeing \"Miami Vice\" last evening, and I have to say that it was quite good. It was not exactly perfect, but I felt that it was well directed, and possessed just enough action and just enough story to keep things interesting and to keep the movie from becoming a big dumb action flick. Not to say that big dumb action flicks are always unwanted, it's just that it is nice to see a remake of a hit T.V. series not take the easy way out and, instead, develop an almost great plot with subperb characters. All in all, the movie deserves a look from those of you who enjoy an action movie with brains."
    },
    {
      "rating": "8",
      "text": "Unlike the TV series, don't expect a light, hip, pastel colored movie. This movie is very dark with superb cinematography and style typical of Michael Mann. Not a lot of action, but when it comes, it's memorable. Colin Farell is surprisingly good, while the Tubbs' role is not developed enough to give Jamie Foxx a chance to shine. Very good supporting characters and acting."
    },
    {
      "rating": "9",
      "text": "This was a classic Micheal Mann vehicle...tight, beautifully filmed, alpha male dialogue, and with his underapprecaited penchant for believable romance. With the exception of Farrell's somewhat one dimensional speech pattern (sounding to me as crisp and monosyllabic as the famous \"da Bears\" crew from Saturday NIght Live - compelete with one of their porn mustaches) but theer is no denying his movie star charsima and the heat with soon to be superstar Gong Li an out and out pure mega-talent. I just kept thinking how something/someone like Val Kilmer's Heat performance would have been so much stronger than Farrell. Foxx and the rest play their Mann thing perfectly. It was a movie that always kept things in the beliveable realm and just another gem in an amazing carreer. Mann is the best out their today. Hey wouldn't it be fun to see Mann and Tarrentino lock up for the ultimate testosterone movie...let's say, Mann write for the cops ...Tarrantino writes the bad guys' dialogue. Mann directs the night scenes and Tarrantino takes the day... and we just go along for the ultimate guy's ride."
    },
    {
      "rating": "7",
      "text": "I liked it less than Heat and Collateral, but I still quite liked it. Visually is was really strong, and interesting. It just did not look like a Hollywood movie at all. I thought the acting was fine but yeah, there was a lack of chemistry between Farrell and Gong Li. By the way, to the person bellow who said he looked bloated n' all that -- dude broke a rib and herniated two discs preparing for this movie, so that might be why he didn't get nekked. I think, for a movie that was 2.5 hours long, it could've given us a bit more about the characters. I'm too young to know a thing about the TV series and couldn't care less about it. So, as far as I know, these two guys were just walking cliches. Which was okay, cos the movie was very well done, stylish. Oh, also: the bad guys here are awesome. The younger guy is hilarious, tho he is not really overly comedic. And the head honcho was really, reeeeally menacing, in a way movie drug kingpins aren't usually, even though they're supposed to be. Lastly, it seems a lot of people just donlt like Collin Farrel. I keep hearing randomly people with no association to one another come out and say they simply do not like him. Personally I don't mind him, and, I loved his bad hair and mustache. Somehow it just fit the character."
    }
  ]
}