{"id": 1852, "title": "Midnight Sun", "starring": ["Bella Thorne", "Patrick Schwarzenegger"], "runtime": 91, "genre": ["Romance", "Drama"], "description": "Katie, a 17-year-old, has been sheltered since childhood and confined to her house during the day by a rare disease that makes even the smallest amount of sunlight deadly. Fate intervenes when she meets Charlie and they embark on a summer romance.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/vPG2zEKPXhovPW9S91SRnwr5JM1.jpg", "categories": {"plot": 6.5, "acting": 6.928571428571429, "ending": 6.0, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 5.0, "funny": 7.0, "action": 7.0}, "reviews": [{"rating": "2", "text": "This is the funniest movie that I've seen since Thor Ragnarok. It's so laughably trite and horribly executed. The two points are for the pop songs being actually decent, a rarity in a film like this, and for the lead character being performed pretty well amongst a sea of mediocre-terrible performances.Split between giving this a 2 or 3."}, {"rating": "2", "text": "This was a **** snoozefest. I'm sorry but if some teen still eats this crap, well they failed in life."}, {"rating": "7", "text": "Of the 7 movies, I have seen so far in March, the 2 best ones revolved around teenagers. The first “Love, Simon” is the first Hollywood production dealing with a gay male teenager coming out in high school and the reactions of his friends, schoolmates, males, females and his parents. It is a smart, thoughtful and touching film about someone ‘different’ that should be seen.In the second film, “Midnight Sun” the main character is a straight teenage female who is also different in the sense she has xeroderma pigmentosum or XP, a very rare disease that makes her hypersensitive to the sun and has spent most of her life indoors being homeschooled and very little interaction with people, let alone other teenagers. Her mother died when she was 5, though I don’t recall if it was of the same disease.Katie’s father is devoted to her and does everything he can to fulfill her life with both being aware it will be shortened no matter what care they take. Her best friend Morgan since childhood visits every day, and it is due to her that Katie finally meets Charlie who she has watched for years passing by her house and becomes the love of her young life.“Midnight Sun” is a tearjerker and the screenplay by Kenji Bando and direction by Scott Speer tugs at the heartstrings manipulates the audience’s feelings, throws in a few laughs and in spite of a few missteps delivers the goods.Bella Thorne as Katie is beautiful, obviously talented, has good chemistry with all the actors, especially with Patrick Schwarzenegger as Charlie. Yes, Patrick is the son of Arnold and though not as muscle-bound as his father was at the same age but he is better looking with definite model looks as one scene in his underwear will attest to. He does make an impression in his first starring role and could likely have a modest screen career.Rob Riggle as Katie’s father does an excellent job and Quinn Shepard as Morgan has the ‘second banana’ role down pat getting the needed laughs along with the best friend empathy needed.Though it is corny here and there and has a major misstep of making Katie a singer, the young leads are so appealing that you get caught up, not only in their romance but, their fight to get her home before the sun comes up.It was recently said by 2—count them—two—friends that yes I may have lost my sense of humor as I’ve grown old but “Midnight Sun” proves that my tear ducts are still over flowering!"}, {"rating": "10", "text": "Such a great film, I laughed, I cried and I also enjoyed the music. Both Bella Thorne's and Patrick Schwarzenegger's performance was outstanding."}, {"rating": "6", "text": "Underrated for the cheesy love story, rightfully so. BUT also underrated for it's complex emotional value and the message of the movie. Despite the awfully executed love story, the life lesson of the movie was to great to shrug. The acting was above average at best for most part, which did not radiate immersion but the script and the creative turn of events did. The cliche/corny love story fastly fades away and get's overshadowed by the meaningful interactions of the characters that really mattered in the plot of the movie. Sadly the supporting actress outperformed the main protagonist and did not help the plot to develop, also due to Shepard's pure and raw beauty plus the hipster style made the common scenes about her and not about the protagonist. At the end half of the elements where handled badly and executed poorly, though the rest of the elements where handled with care to detail and with emotion that created a very powerful emotional aura and had it's  deep artistic moment and delivered the message the movie set out to bestow on the audience.Overall it's a cheesy above average movie with great message and a poorly executed super cliche love story."}, {"rating": "10", "text": "Okay really obsessed with this movie, I think I am going to be watching this movie many more times it's just beautiful, I have no idea why this movie is just sticking with me, maybe because it is a beautiful movie or I just really enjoyed watching it. This movie is one of those movies that you watch and it sticks around in your head for a little while longer, for example I watched five feet apart and that movie was stuck in my head for a good couple of weeks, why?"}, {"rating": "2", "text": "Potentially the worst movie I've ever seen. Hacky acting on top of a plot that fundamentally makes zero sense. Teen romance movies don't have to be trash, as shown by Love, Simon, but this one went right ahead anyway."}, {"rating": "10", "text": "First of all, this film is a drama. And as a drama I put this film 10, for the emotions that it causes."}, {"rating": "10", "text": "This movie made me smile, laugh, and cry. It is a real tear jerker and I honestly just loved this movie."}, {"rating": "10", "text": ".Better Than I ExpectedAs a frequent movie goer, this was just about my only choice today since I've seen the other movies that are playing now. I was pleasantly surprised by this movie. I expected it to cater to teenagers, which is mostly did, but as a person in my 70s, I enjoyed it too. It does tug at the heartstrings, which I find manipulative, but it wasn't too hard to hold back the tears. The acting is very good except for Schwarzenegger, who is just OK as an actor, but his being so easy on the eyes makes up for it. The plot is predictable; anyone can pretty much guess correctly what's going to happen along the way, but for a romance-type movie, that's just what they do. And there are some plot holes, like Katie knowing how to swim when she's never been in the sun and her house doesn't have a swimming pool, and her attending a swim meet to watch Charlie swim but no explanation as to how she got from her house safely to the car and from the car safely to the swim arena. She had on a hoodie, but if that's all it takes, she could go out more often during the day instead of having been cooped up in her house during the day for all of her life. And if exposure to the sun for one day is deadly, how did she get home from the hospital when she was born before they knew she had this disorder. None the less, it's a good enough movie - just a little sappy - but I think the kids will love it."}, {"rating": "10", "text": "Great movie with very real emotion.  Highly recommend for almost anyone. The Schwarzenegger kid’s acting was pretty rough, and that probably hurt the reviews, but everyone else is excellent. writing and cinematography are excellent as well."}, {"rating": "10", "text": "Loved the movie. I honestly do not understand the low critic scores for it."}], "recommendations": ["the_spectacular_now", "if_i_stay", "the_notebook", "the_vow", "a_walk_to_remember", "we_bought_a_zoo", "the_lake_house", "instant_family", "spanglish", "the_edge_of_seventeen", "silver_linings_playbook", "the_king_of_staten_island", "magic_mikes_last_dance", "the_lucky_one", "17_again", "chef", "the_fault_in_our_stars", "me_before_you", "lady_bird", "the_last_song", "the_perks_of_being_a_wallflower", "the_curious_case_of_benjamin_button", "juno", "the_intern", "the_holiday"]}