{
  "id": 2127,
  "title": "Midnight in the Switchgrass",
  "starring": [
    "Megan Fox",
    "Bruce Willis"
  ],
  "runtime": 99,
  "genre": [
    "Crime",
    "Mystery",
    "Thriller",
    "Action"
  ],
  "description": "FBI Agent Karl Helter and his partner Rebecca Lombardo are very close to busting a sex-trafficking ring. When they realize their investigation has crossed the path of a brutal serial killer, they team up with a Texas Ranger to put an end to the infamous 'Truck Stop Killer'.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1OTSuh2HNcTRfme8caU8DjgJ39K.jpg",
  "categories": {
    "plot": 1.0,
    "acting": 1.0,
    "ending": 1.0,
    "soundtrack": 5.0,
    "cinematography": 1.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "I should have known not to waste my time. Bruce Willis seemed to have stopped caring about the quality of his work a long time ago. Half of his shots were the back of his head, as he obviously didn't stick around to add any value.Shoddy directing and dialogue.Only thing good about the film is the title."
    },
    {
      "rating": "1",
      "text": "One of the worst crime movies ever. Seems like nobody who worked on it gave a crap about it. The editing is the worst ive seen in a while with continuity issues and annoying cuts everywhere. No cinematography to speak of. Bruce Willis doesnt act in it at all he just sits and talks like a robot. Story is not interesting at all."
    },
    {
      "rating": "1",
      "text": "What did i watch.. seriously..Its a crime-thriller drama of the most generic kind.Bruce Willis and Megan Fox plays the most unusual FBI duo that crosses path with Emile Hirsch in a string of murders involving killed sex-workers dumped along the interstate in Pensacola.Early on we are treated to who the killer is.. (YES. All suspense gone for the rest of the movie).No motif or m.o is at any way given to why he kills, other that he love to sniff his victims clothes.Bruce Willis is on the cover poster, but he is in it for 10-15 min. before he bails Fox for unknown reasons, leaving her and Hirsch to hunt down our \"mysterious\" killer. After this, the movie drops any care in the world and the pace speeds up to conclude this poor thriller.Sadly our kick ass heroine gets abducted by our villain, and Emile finds her again with such an effortless investigation of just checking a surveillance camera.. Wow..The ending has little to be desired of.. It's poor and rushed.Fox stabs him.. the end.Don´t bother."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "1",
      "text": "(Mauro Lanari)On the end credits, the debutant Emmett thanks Scorsese and it is the most surprising moment of the movie, in which Willis by now acts only sitting, inexpressive and embalmed, ad Megan Fox shows off her incorrupt beauty wanting to make us believe she is an expert in Taekwondo. Pure garbage."
    }
  ]
}