{
  "id": 4555,
  "title": "Midnight Special",
  "starring": [
    "Michael Shannon",
    "Jaeden Martell"
  ],
  "runtime": 112,
  "genre": [
    "Adventure",
    "Drama",
    "Science Fiction"
  ],
  "description": "A father and son go on the run after the dad learns his child possesses special powers.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hgDRq1l4ATxwufWjILKsYtglbI6.jpg",
  "categories": {
    "plot": 6.575,
    "acting": 6.838709677419355,
    "ending": 6.038461538461538,
    "soundtrack": 7.0,
    "cinematography": 8.0,
    "familyFriendly": 5.4,
    "funny": 6.333333333333333,
    "action": 6.2
  },
  "reviews": [
    {
      "rating": "9",
      "text": "An excellent film.  I'm a Jeff Nichols fan - loved Take Shelter and MUD in particular - so I wasn't surprised to have enjoyed this one.  I appreciate that he doesn't dwell on exposition and just throws you into a partially evolved story.  Joel Edgerton is terrific in this film, as is Adam Driver - neither of whom did I realize were in it.  But the actor who plays the boy - who was in St. Vincent - is amazing."
    },
    {
      "rating": "8",
      "text": "Starring the wonderfully angry Michael Shannon, and his son who go on the run after they discover he possesses special powers. Also featuring, Joel Edgerton, Kirsten Dunst and Kylo Ren. This one is very unique, keeps you guessing and overall enjoyable. Can't say anything more, just go and see this one. Highly recommended."
    },
    {
      "rating": "8",
      "text": "This is one of those films where you come out of the cinema feeling elated and want to get everyone you know to watch it, yet you are lost for words on how to describe it and possibly wondering whether their take of this film will be as rewarding to them as it was to you.  Because in reality this film is merely but an emotional journey and whether what happens on the screen makes sense or not is not really important.  And you cannot really even pinpoint the genre: is it a film about parenthood, or about a getaway, or maybe perhaps about a religion and the need to believe, or even is it simply a science fiction thriller? Whatever it is Mike Nichols delivers once again a thoroughly enjoyable film with an amazing cast including Michael Shannon, Joel Edgerton, Adam Driver, Sam Shepard and of course the young Jaeden Lieberher."
    },
    {
      "rating": "7",
      "text": "Jeff Nichols does an excellent job and grabbing you at the beginning and then slowly reeling you in to his story.  Its refreshing to see a film with some originality to it and Midnight Special accomplishes that even if it doesn't fully explain itself at the end."
    },
    {
      "rating": "7",
      "text": "A well made, well acted film that while slow at times keeps you interested throughout.  As the case with Jeff Nichols films they are paced very methodically which you either embrace or you don't I'm more in the former than the latter.  B+"
    },
    {
      "rating": "7",
      "text": "What shine's with this movie is Jeff Nichols directing. His writing, not so much. The story is sparse, gleans intentionally on elements that could be so much more. The characters work, simply because they do except kirsten dunst. Her role could have been completely ignored and nothing would be lost here. The finale comes short.  This is worth a watch though."
    },
    {
      "rating": "8",
      "text": "Featuring stand-out performances, impressive direction, and a stellar story-line, Midnight Special is an emotional and original Sci-Fi thriller, even with its loose ends."
    },
    {
      "rating": "7",
      "text": "Midnight Special is a good old- school science fiction movie. The acting is superb from all the people involved, not to mention the great special effects. The most unique thing about this though is the way the story is told. The film starts right during the action and we the audience only see a dad running away with his son, who has unexplained supernatural powers. The government and a religious Texas ranch are after the boy for reasons we don't know. But the story ingeniously reveals what's going on, the backstory, and the plot in teaspoon fulls. More information is told as the film goes on. This way, the audience gets engrossed into the story as things are revealed to them along the way and the conclusion becomes unpredictable. There's just an original feel to all of this with good action and suspense. However, once the ending does come up, this original story cops out to an E.T.- esque ending in which many questions are left simply unanswered and unexplained. While details are revealed during the story, not enough of them are given. In addition, the pacing is too slow in certain areas, thus cutting down the tension. Overall though, this mostly different and original sci- fi film mostly succeeds."
    },
    {
      "rating": "8",
      "text": "A father (Michael Shannon) is on the run from a religious cult and the FBI with his young son, who has special powers. There's a constant sense of ominous portent, potential danger and unknown consequences. And the final payoff is pretty cool. The cast does a good job of taking matters seriously and the special effects are simple, yet convincing. This is a low-budget sci-fi thriller than poses more questions than it answers. Still, there's enough mystery and tension to make for a compelling experience. Not really sure why the title (based on the song) is relevant."
    },
    {
      "rating": "7",
      "text": "Pretty cool science-fiction film that is well-directed and pretty well-written with good acting, visuals and music also."
    },
    {
      "rating": "8",
      "text": "Truly well acted by the whole cast and original enough to keep you interested until the end. You have the cult chasing after the boy they view as a prophet, The government who views him as a weapon and then you have the father who simply wants to protect his son from all this madness around him. It's definitely a love-hate movie but I really enjoyed it."
    },
    {
      "rating": "8",
      "text": "Midnight Special is a wonderfully unique and adventurous film. The acting across the board is very good, but the real star here are the technical elements. The special effects are terrific, especially in a scene where we see the boy with his eyes and the light coursing through his veins. The ending sequence also features terrific special effects and give the film a feeling along the lines of Spielberg's 70s and 80s science fiction classics due to the sense of wonder it inspires. The sense of mystery is highlighted by the film's synth-like score that really threatens to steal the show at times. Its low notes put you right on the edge and add this air of mystery that leaves you guessing until the very end. The lighting and cinematography are also top-notch, especially with the film largely taking place at night. It is always hard to shoot at night, but Midnight Special makes it look easy and, even better, the lighting lets you see everything, yet keep enough shrouded in darkness to make it both visually pleasing and mysterious. This film has a lot going on, is quite slow, and does not have a pay-off many will appreciate. However, I certainly did appreciate these elements. The slow pacing never arose as an issue because enough is going on to really keep you hooked and zoned in on what is going on in the film. Additionally, the ending is perfect simply because the proceeding 1 hour and 40 minutes were so mysterious. A mysterious ending is the only way to end this one as the characters never showed any level of understanding as to what was happening to the boy. Thus, it only makes sense that they remain in the dark along with us and get looked at as if they are crazy. Overall, Midnight Special is a special film that is wholly unique and highlights that Jeff Nichols is one of the best directors working today."
    },
    {
      "rating": "8",
      "text": "Mysteriously fascinating and totally riveting from start to finish, but not without fault. Takes a few missteps here and there, but is overall very satisfying. Writer/director Jeff Nichols does a fantastic job building an increasingly suspenseful tone and keeping things interesting while being a slow burn. The performances are top notch, specifically Adam Driver and Kirsten Dunst, and they all play completely developed and engaging characters. I was thoroughly impressed by the visually striking, well-acted, thought-provoking Midnight Special."
    },
    {
      "rating": "7",
      "text": "A secret road adventure during the dark hours!\r So the Jeff Nichols and Micahel Shannon saga continues. This is theirs 4th film together in the last nine years and all of them were well accepted. Now they are into sci-fi for this, which is kind of a road movie that resembles hundreds of other films. Only thematically, but in parts it looks different, especially for being too realistic as what the director is famous for. Finally, something is not a comedy or a full of CGI, yet still it is a wonderful sci-fi-drama with some thrill moments.\r It opened like the midway of the story. We obviously have to wait for a proper explanation to know what's going on, who is the child and where they're taking him. So it all begins with two armed men driving a young kid on the dark hours. Only we know is that they are protecting the boy from the government people, but the film took some time to give a clear picture of the condition. In the meantime, I started my prediction game, but I expected the film to clarify how it all began. It never cared about that part, only moved forward and that's how we're going to get some answers where a few might feel its a let down.\r The negative of the film is you won't fully understand it, but it is not an incomplete story, just designed that way that leaves for the viewer to add their own perspectives to where the writer left blank spaces. Like I said the people are comparing it with the similar films and I did not care about that, but I disappointed with the conclusion. It was neatly folded, I actually liked it, but it was not fresh, especially it totally mirrors 'Tomorrowland'. Now I know why Warner Bros moved it from last year to this year's release.\r It might be a coincident because the director who is also the writer has a good reputation, so I believe it is definitely not a steal, just a common creative that we've already seen many films like that. Overall, this film is worth, but might not satisfy the Jeff Nichols fans, because like I said plenty of times before in my reviews, now it the sci-fi era and every filmmaker and film-star want to board on that plane. So it did not spare Jeff Nichols as well.\r 7/10"
    },
    {
      "rating": "9",
      "text": "Now this is what sci-fi should be -- a gripping, smartly written adventure that hooks you early and keeps you riveted all the way through. The film's climax is, admittedly, slightly stretched out, but that's a small price to pay for everything else this well-crafted release has to offer. If you like a hefty dose of intelligence and sophistication with your science fiction, don't miss this one."
    },
    {
      "rating": "8",
      "text": "It's like a really good episode of the X-Files.\r Midnight Special owes a lot of its plot to Starman (1984) and its overall feel to the Steven Spielberg oeuvre but it's a wonderful little sci-fi pursuit flick.\r Like a really good episode of the X-Files, it doesn't answer all your questions but is well worth the ride. Also worth mentioning, this movie full establishes Adam Driver as this generation's Jeff Goldblum."
    },
    {
      "rating": "8",
      "text": "It's indeed a special science fiction thriller inspired by director/writer Jeff Nichols' own life experience who enjoys telling a story at his own vision that's not intently made for general audiences. The film revolves around a kid with supernatural abilities that has similarities to Spielberg's E.T., Close Encounters of the Third Kind and a little bit of Tomorrowland; its thin plot progresses slowly, less family friendly and humorless but it manages to engage audiences by triggering the eagerness to crack for all secrets behind the mystery. The entire journey is dangerous and emotional thanks to the outstanding performance by Michael Shannon as a caring father and well supported by the charming performance of the son by Jaeden Lieberher. It has limited but powerful scores, it does not reveal all secrets and end ambiguously, rather most importantly the science fiction acts as a metaphor to the beauty of parenthood - faith and sacrifice of parents to ensure the happiness of their children."
    },
    {
      "rating": "7",
      "text": "Fantastic film. Very strong performances and a very interesting story. Movie def takes influences from \"Superman\" as the movie hints at during a scene."
    },
    {
      "rating": "9",
      "text": "Beautiful film with an intriguing story that captivated me. I was on the edge of my seat, wanting to know, wanting to understand. I struggled with wanting the journey to end so I could see, but also fearful and sad that it would end. A must see."
    },
    {
      "rating": "7",
      "text": "This was an interesting movie.  Was it about a child abduction? a religious cult? a government conspiracy? superhuman powers? an alternate world on another dimension?  So how did this kid get born from 2 normal human beings?  It was interesting to watch but a mash up of too many ideas."
    },
    {
      "rating": "8",
      "text": "It was refreshing, in watching this movie, to watch something that didn't feel the need to thickly lather on exposition at its very beginning. We know very little at the beginning of the film, and the gaps are filled in along the way, at a natural pace. \"Midnight Special\" is decidedly subtle, for the most part- the one issue I have with the film is that climax actually overplays its hand a bit too much, making the central mystery a bit too physical and literal. The ending remains just ambiguous and emotionally resonant enough for me to swallow the whole final act, however.\rI certainly couldn't find fault with \"Special\"'s cast, which is one for the ages. The consistently great Michael Shannon manages to be startlingly heart-wrenching as the lead character, the father of a boy with unexplainable powers; Kirsten Dunst steals the third act of the film with just one reaction shot as the child's mother; Adam Driver is funny and awed as an NSA agent assigned to track the boy; Joel Edgerton is warm and driven as Shannon's second; Sam Shepard is fearsome and smug in a small role as a cult leader; Bill Camp makes for a soulful thug. And Jaeden Lieberher, the boy himself, chooses correctly to make the character the most even-headed of the film.\rThe film is masterfully directed by Jeff Nichols; one gorgeous shot I can recall immediately is of military vehicles rolling over a hilly road just as the sun is coming up. The score is a bit of an earworm, and sets the tone of the film well.\rI've hesitated to include anything regarding the plot of this movie, but I hope I've established its best elements. Please, go see it, as it's one of the best of the year so far."
    },
    {
      "rating": "10",
      "text": "I must thank jeff nichols for this film perfect and rich in emotions, michael shannon is once again in top form as he was in the incredible “ take shelter” , love at first sight of the year, cheer."
    },
    {
      "rating": "8",
      "text": "We join the characters in a motel room. Who they are, and where they've come from, become slowly more apparent as the journey continues towards an unrevealed destination. The eventual revelation could hit you either of two ways, a bit like a certain yeast-based sandwich filling.\rWhere this film really succeeds is presentation and camerawork. Together cinematographer Adam Stone and director / writer Jeff Nichols immediately give the film an urgent, mysterious atmosphere that rarely vanishes, right from the opening title appearing in front of the receding bumper of a throaty Chevelle, speeding through the night.\r A tense, mysterious American road movie with a divisive plot twist, a film that needs to be seen at the cinema"
    },
    {
      "rating": "9",
      "text": "Midnight Special is one of the rare movies in the Science Fiction genre that manages to feel so human while still maintaining an incredibly powerful mystique."
    },
    {
      "rating": "9",
      "text": "'If it's not too much to ask, could you punch me in the face?' (Agent Sevier to Lucas the cop)MIDNIGHT SPECIAL is loaded with great actors. Michael Shannon, Joel Edgerton, Kirsten Dunst,Adam Driver,Sam Shepard and the young boy played by Jaeden Lieberher.\rA father has taken his son back from a cult leader and members are sent to bring the boy back. The FBI raids the cult farm and the entire cult is questioned about the boy and his whereabouts. The boy, Alton, wears goggles and is shielded from daylight and the sun as they travel at night and tape cardboard to the motel windows. It is as much a family film as it is a sci-fi/chase film."
    },
    {
      "rating": "10",
      "text": "This was a kind of cerebral, slow moving, almost small in scope sci-fi film. I absolutely loved it. The acting, the sense of place, the mystery. I don't think it would have had as much impact if everything had been explained. I can't wait to see it again."
    },
    {
      "rating": "8",
      "text": "Definitely had a tinge of the Steven Spielberg magic throughout, with a mysterious story helped by excellent performances from Michael Shannon and Joel Edgerton. The atmosphere that was created (in part by the excellent cinematography) was often awe-inspiring, feeling ultra retro and subtly futuristic at the same time. Despite the ending being a little anti-climatic, Midnight Special is a strong sci-fi debut for Jeff Nichols."
    },
    {
      "rating": "9",
      "text": "I have only one word after watching this film, WOW. This is one of the best films I have ever seen in my life. The actors were good. Jaeden Lieberher portrays his character well making him intriguing. I also loved Michael Shannon and Kirsten Dunst on their portrayal as well as Adam Driver. The plot was great, it was intense and intriguing that you can't wait on the next scene."
    },
    {
      "rating": "9",
      "text": "This movie manages to throw you into the story with very little explanation while also being pretty slow and quiet. Midnight Special spends very little time answering questions or explaining what's happening. It could be frustrating to some but it just added to the magic of the story for me.There was something reminiscent of 70s-era Spielberg, where things felt just a little less safe and where the fantastic could be both inspiring and dangerous. I was really drawn into the quiet, intimate story and was invested in these characters.I found the effects really well done. They were beautiful and strange. Near the end of the film, the way they used used the effects left a huge impact. They didn't draw attention to themselves and that just made it all that much more special."
    },
    {
      "rating": "8",
      "text": "This is a really really good movie that has many subtle things that really gets overlooked IMO."
    },
    {
      "rating": "8",
      "text": "On the slower side, yes. But it never felt slow, since the superb acting and mystery kept your attention.If you find movies like \"Transformers\" entertaining, this probably isn't your cup of tea."
    },
    {
      "rating": "3",
      "text": "A Highly Disappointing SF Film Mashup\r *** Spoilers ***\r It's partially the casting, partially the direction sinking this film. Mostly it's a script cobbed together from \"ET,\" \"Starman,\" a dash of \"CE3K,\" the Superman legend, \"Village of the Damned,\" and generic child-in-jeopardy tale. That's the most amazing, and disappointing, aspect of \"Midnight Special\" - that the creative and original Jeff Nichols wrote a shamefully derivative script filled with plot holes large enough to fly a mothership through.\r After a mysterious, compelling first act, \"Midnight Special\" turns into a boring chase/race-against-time story of an extraordinary, luminous boy with 'powers and abilities far beyond that of mortal men' sought by the Feds and a cultish church who venerate him because he speaks coordinates in tongues. This boy comes from \"a world-on-world\" whose inhabitants watch over us. (Given the state of the world, they're doing a crappy job.) The explanation tracks more like angels from another dimension than aliens.\r The boy, played by Jaeden Lieberher, fails to create sympathy through all the chaos. The wonderful Kirsten Dunst has never been more wasted in a placeholder role as the boy's mom. Shannon is his hulking father. Edgerton only serviceable as a tag along State Trooper. They dodge bullets on a lumbering path to specific Florida coordinates where the boy has a date with destiny; the merging of dimension X and our pitiful dimension. Other luminous beings spirit the boy away and POOF - the convergence disappears. Big deal! A most unsatisfying and anticlimactic end that does not inspire the wonder the special effects technicians hoped it would despite Mom's mugging at the otherworldly architecture.\r It might occur this is a Jesus allegory with a 'birth' of a messiah from common parents. There's not a glimmer of that (save some 'fire from Heaven'). Early on, there was promise of social commentary about our over-surveilled lives. Nope. That's not present either. Also lacking, commentary about people steeping in religious fervor to fill absences in themselves. The church members, including Sam Shepherd, are bland.\r \"Midnight Special\" adds no subtext to a story begging for some. Even the title derived from the song doesn't track. \"Let the Midnight Special shine a light on me.\" Okay, he did shine light, but the Feds - after everyone within a hundred mile radius sees the other world - still prosecute and jail Dad and the Trooper. That we're deaf, dumb and blind in a mysterious Universe is not a lot to be left with after two hours.\r Too much mystery ruins a film - the slight flash of light in Dad's eyes at fade out an example. Without the proper setup, too much mystery makes \"Midnight Special\" an uncooked, epic misfire in this dimension or any other. Give it a pass."
    },
    {
      "rating": "2",
      "text": "Really see no reason for this Scientologists meet the Mormons meet Close Encounters as no new territory is explored.   As in “Room” we are brought in at the end of a moppet E.T.’s journey with his “phone home\" palms. And for two parents with no chemistry at all - it’s a wonder how this little boy was ever conceived. Or was he? Or who cares?  Add in the skeptics, the Gov’t., and the believers and four days turn into a boring endless road trip.  More puzzling is why the boy needs any help at all since he does what he wants when he wants and then doesn’t for dramatic purposes.  Midnight Special is anything but."
    },
    {
      "rating": "5",
      "text": "Frustratingly dull and even pretentious feeling. Mud and Take Shelter were perfect films and none of the things that made them successful were much present in Midnight Special. For instance, the special effects in Midnight Special drew attention to the movie's low budget, whereas in Take Shelter the low tech, barely there use of visual effects actually increased the feeling of realness. I hate to trash the work of a filmmaker I admire but I really regretted seeing this and would warn against it."
    },
    {
      "rating": "9",
      "text": "Oh how I long to watch this again on the big screen! Whilst there is an occasionally frustrating lack of exposition here, I found myself utterly entranced by this story, and I thoroughly enjoyed the teasing manner in which this gripping storyline unfurls. The performances were exceptional, and it was especially pleasing to see yet another child actor who was polished and thoroughly believable. The originality of the concept and polished, subtle execution was thoroughly enjoyable and I found myself completely beguiled by the experience. 9.02/10"
    },
    {
      "rating": "4",
      "text": "dull and self serious, i wanted to throw a sheet over all their heads!  this invisible layer of higher consciousness actually exists.  it's dubai.  R.I.P zaha hadid."
    },
    {
      "rating": "1",
      "text": "I was so excited walking into Midnight Special, but I was very disappointed. The film was very slow, and had little action. It had no point to it, and the ending was just stupid. Overall, Midnight Special is very disappointing."
    },
    {
      "rating": "0",
      "text": "Lens flare and vagueness substitute for substance (I used to call this kind of vagueness 'mystery', but real mystery is inspiring and creates a sense of wonder). The supposed sci-fi is just a MacGuffin for a boring fugitive movie. You no doubt wonder why there was no explanation... it's because they have no explanation for you. This is the new Emperor's New Clothes of film-making. You are impressed because you think you are supposed to be impressed. Well played Hollywood."
    },
    {
      "rating": "4",
      "text": "Midnight Special, for me, was a disappointment. It has a great start, but devolves into a convoluted, frustrating work that's ultimately pointless on the surface level. I'm certain there's a deeper meaning, but unlike Jeff Nichols' previous work, which I've loved, I don't feel the slightest bit compelled to dig deeper. It's essentially a religious E.T. flick. The only problem, is that it's never clear what the significance of this religious figure of a kid really is. Maybe it's worth a second viewing to find out more, but the frustrating amount of ambiguity is daunting to even think about.\r The cast is mostly great - Adam Driver being a particularly fun addition, simply because of his character's comedic awkwardness and overall relatable lack of understanding. I took issue with Jaeden Lieberher's performance - he plays Alton, the Jesus-angel-kid - simply because he lacked emotion for most of the movie. He was a stoic mystery, which is fine on paper, but it's not a character you can relate to - especially considering all of what he's been through during the events of the film.\r It's difficult to play off faith in something, and while Midnight Special makes it absolutely clear that whatever Alton's goal is, it's the real deal, I couldn't help but feel everyone was just blindly following him. I was expecting Alton to have some kind of darker role in the grand scheme of things, but in the end, I can't really say he even has a good role. It ends as ambiguously as it started and based on what the movie gives us, it feels painfully pointless."
    },
    {
      "rating": "2",
      "text": "Drive around with a kid, get chased on the road by various parties because the child is special in some way.\rSome shooting, some special effects, some mystery, blah, blah.\rThe ending is the same as every other SciFi film - it's doesn't explain much.\rRubbish."
    },
    {
      "rating": "3",
      "text": "Hmm, I recognize this was a work of spirit for the creator. My main complaint is that it seems an example of our times reliance on what has come before."
    },
    {
      "rating": "3",
      "text": "The film was very slowly paced, and was more of a fantasy film than any kind of science fiction.  There are so many questions.  Why would the father give legal custody of his son to a cult leader?  Can you actually do that, or would the court refuse?  Why do the kid's powers seem to arbitrarily be whatever is needed at that point for the plot?  Did his mother somehow sleep with a glow person?  If not, why is he a glow person? Why are the mother, father and father's friend all in the movie, when their characters serve identical roles?  It seems that some mysteries will never be answered."
    },
    {
      "rating": "3",
      "text": "A bit like E.T without the sugar.\r You are dropped in to the middle of the story and the key characters are introduced quickly, although very little in the way of back story.  There is very little positive or negative made of the boys powers other than he can here things and is sensitive to light and sound.  The transition of the a bunch of religious nuts following him the full force of the US military and intelligence is not believable.  Hard to believe how easy it is for a clap out truck to smash through America's finest defences.  Very few people seem to die even when shot from close range.  The final unveiling of the alien world is rubbish.  The world looks like something from a 1930s comic which light of style but no practical relevance.  Turns out the aliens are juxtaposed on our world but invisible and just snooping on us for the hell of it.  Quite why the boy is one of them having been born on Earth is not made clear.\r For me too many loose ends and lack of depth is the story."
    },
    {
      "rating": "3",
      "text": "I usually don't write reviews but the critics were so wrong I had to warn you about this one. It was so boring although it did have a clever idea for the story. It never answers the questions it poses and had a totally letdown of an ending, if you want to call it that."
    },
    {
      "rating": "2",
      "text": "Whatever people saw in this meandering and utterly lackluster sci-fi americana was missed on me. Nichols has steered well off course since the brilliant Take Shelter and I hope he rights the ship soon."
    },
    {
      "rating": "1",
      "text": "If you're old enough to remember back to the late 70's early 80's you'll identify Close Encounters & Escape From Witch Mountain as the basis for this movie with a little 90's Powder thrown in, but this is a pale shadow of those movies with almost no dialogue of note and no character development, with an ending that leaves nothing but regret you should have spent this 1hr and 51 minutes doing anything else.  This movie was dreck."
    },
    {
      "rating": "2",
      "text": "Everyone's so serious and broody in this film, it gets boring. Plus they're all mumbling to each other in their serious tones and you can hardly hear what they're saying. I think Michael Shannon's a great actor but he has one expression throughout the entire movie. The kid has no personality whatsoever and just sits there like a lemon for most of the film. The plot unfolds slowly in a contrived manner which aims to tease you whereas I ended up just saying, 'please, someone, just fill us in.' Everybody knows more than they divulge to the viewer from the get go and the result of this is that things move along very slowly with nothing significant happening for ages. I tuned out by the end and put on my headphones in, whilst on the screen I could see that the payload does arrive eventually, but too little too late."
    },
    {
      "rating": "1",
      "text": "This is not a very good movie...don't be fooled by high ratings...this is very derivative of \"Close encounters\" except that was better and original. Don' t waste your time on it."
    },
    {
      "rating": "10",
      "text": "\"Midnight Special\" is thrilling, emotional, exquisite, intricate, beautiful, wonderful, and inspiring. A fantastic and original sci-fi thriller with great performances and a gripping plot."
    },
    {
      "rating": "1",
      "text": "Another family drama hero movie it barely scratches sci-fi genre well it was the last genre in the row so ok, the movie is boring, it is short , it is full of still portraits , it is cheap , it is slow , it has a dying rithm just like very old men are , 1 000 000 idiots could write it better , i watch a lot of sci-fi and 99% dissapoint , it is nothing like the trailer no epic action , ingenuity or originality nothing you have never seen, this is not epic sci-fi this is more like rubber , but the cast was good ."
    }
  ]
}