{"id": 3872, "title": "Midnight in Paris", "starring": ["Owen Wilson", "Rachel McAdams"], "runtime": 94, "genre": ["Fantasy", "Comedy", "Romance"], "description": "A romantic comedy about a family traveling to the French capital for business. The party includes a young engaged couple forced to confront the illusion that a life different from their own is better.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/4wBG5kbfagTQclETblPRRGihk0I.jpg", "categories": {"plot": 5.576923076923077, "acting": 5.928571428571429, "ending": 4.5, "soundtrack": 9.0, "cinematography": 7.5, "familyFriendly": 5.777777777777778, "funny": 7.636363636363637, "action": 5.0}, "reviews": [{"rating": "10", "text": "Mr. Allen has rediscovered himself in the form of Owen Wilson and filled him with the verbal wit the younger Woody use to speak. I sat in a full theater two times and joined the others in a practice called \"laughing out loud\" through the entire film. The characters and cinematic rhythm moved with the beauty of classic Woody films such as \"Manhattan\". The second viewing filled me with more laughter."}, {"rating": "7", "text": "A film that sadly doesn't live up to it's hype. Sure, seeing Woody Allen go back to his roots with Owen Wilson that can become a spot on copycat of Allen himself at times is great. However, Wilson's charm isn't enough to film the multiple gaps in realism that a film of this fantasy and magnitude needs. Simply, Midnight In Paris tries to be an artsy magical fantasy for adults but falls apart because of the carelessness of the script."}, {"rating": "10", "text": "One of the many fine elements that truly makes this film work is Woody Allen's uncanny casting of not only the principle players but of his circa 1920's \"Lost Generation\" cast.  Without giving anything away story-wise, his casting of \"Ernest Hemingway\" (Corey Stoll) was so spot on in look and voice that I (as an acknowledge fan & Hemingway scholar) froze in my tracks. Same goes for \"F. Scott Fitzgerald\" (Tom Hiddleston) and \"Gertrude Stein\" (Kathy Bates!). If you enjoy reading the Novels and Writings of America's creative men and women writers living in Paris in the 1920's, you will die and ....want to go to....Paris!"}, {"rating": "8", "text": "Could this be the best movie of the year? Well, so far, at least... Midnight in Paris is one of the smartest, most creative movies of the year, that certainly met my high expectations. Allen's verbose screenplay is funny, ironic and appropriately mysterious, which supplements the 'lack-of-explanation' behind Gill's time traveling adventures. The whimsical cast is luminous, particularly Corey Stoll whose receiving little traction for his small, but booming performance as Hemingway; stealing all the scenes he's in. The story-telling is a triumph, teaching one to appreciate the present for what it is, despite all that is going on. All this works well with the fine production, particularly its cinematography and time altering costumes and sets. There's not much to complain about here... 2 thumbs up."}, {"rating": "9", "text": "I reserve \"10\" for best of all time or by my ratings an A+. Mr. Allen has created an A, excellent, exquisite film. Beside the \"meaning\" or intention, the upside and downside of living in nostalgia, I was taken away by this film. Mr Wilson perfectly channels Mr Allen; dialogue, mannerisms, and all. It made me drift a bit into the period, the people, the wonder, the times. I have never been to Paris but I wanted to move to that period. The music, the cinematography, the rain. But alas, that's knowing what I know now and of course that is the false hope of nostalgia. A wonderful film."}, {"rating": "8", "text": "The poster of \"Midnight in Paris\" perfectly summarizes the whole movie. You have Owen Wilson walking through the streets. He's the character that is front and center. Writer/director Woody Allen uses Wilson to share his own thoughts about what it means to live in the present and admire the past. Then you have the magical backdrop of Paris behind Wilson. Behind Allen's camera, the streets of Paris beautifully come alive in this film. You feel sucked into the look and style of it all. Allen has always been a master at capturing a setting, but he really outdoes himself here. And beneath all of the beauty and insight comes a sharply funny script from Allen and a pitch-perfect performance from Owen Wilson. Allen gives him the prototypical \"Woody Allen\" character, and he completely embraces it and makes it his own. All in all, \"Midnight in Paris\" is a magically charming movie. It's one of those films that will leave you with a big fat grin on your face, and at the same time, it will leave you in awe of such a beautiful city like Paris."}, {"rating": "4", "text": "This movie was uninteresting. Woody Allen's other works are far superior to this mindless attempt of a movie. The movie seems creative, but lacks so much. It was just plain boring. So many great actors gone to waste except for Wilson who is already a big pile of waste. My first impressions appeared to be correct."}, {"rating": "10", "text": "Midnight in Paris is great. It perfectly mixes the Twilight Zone with a romantic comedy. It's full of witty humor and great acting. Then entire time you're gripped by both Owen Wilson's great performance as the confused writer and by the beauty that is Paris that Woody Allen highlights upon moment that he gets the chance. The movie is indeed artistic making it pleasant to watch and even more enjoyable to the eyes. I could see how this movie could not be your cup of tea but I can't see how anyone could say that it's bad."}, {"rating": "9", "text": "The return of Woody Allen is in full swing ushered in by (of all people!) Owen Wilson.  The film takes a lighthearted jaunt through history and while the tale is familiar, the humor and splendid visuals help this film rise above most."}, {"rating": "10", "text": "I had no clue, this movie would be so good.I actually never heard of it, before I watched it. It turned out to be an instant Classic! I loved the idea of walking around in different times. This movie inspired me big time!"}, {"rating": "8", "text": "\"Midnight in Paris\" is a wonderful movie and its central theme about reactionism is wonderfully unfolded. Also, Paris looks great in midnight (during a day too)."}, {"rating": "8", "text": "Woody Allen makes a wonderful film that really transports the audience away in Midnight in Paris. It's an uplifting watch, and very romantic. It's also got a couple of great morals that will stick with once the credits roll. At times the script can be overly verbose and drag a little bit, but the visuals are so gorgeous you might not even notice. Definitely worth checking out."}, {"rating": "7", "text": "Somehow can't explain the oscar for best writing .. it's not bad, but not perfect and deffinetly something was missing. It was a little bit boring on moments, flat, nothing much happend.. But the idea of wanting to live in other century was good and I liked how the protagonist decided at the end to stay where he is, to stay in his time (2010) and to live his own life. The movie was really charming and sweet with not the most original storyline, I must say. Overall it's decent and relaxing movie."}, {"rating": "7", "text": "Midnight in Paris was a total surprise. This film not only is a journey through artistic figures but also a ride across Woody Allen’s movies. The bunch of artists that appear in the picture and the way they are characterized takes you to the edge. The ones that are more remarkable to me are Salvador Dali, Ernest Hemingway, Luis Bunuel, Scott and Zelda Fitzgerald.About the other movies of Woody Allen, first we have the character established by this director in Zelig, using the body of Owen Wilson. Second, the feeling of belonging and the fear of rejection that has the protagonist about the group of artists, is similar to Woody Allen and Diane Keaton’s about society in Annie Hall. Third, it is evident that the couple relationship of the film is influenced by the ones of Vicky Cristina Barcelona and Hannah and Her Sisters. Fourth, Owen Wilson takes shelter in his book to escape from his life, in the same way Mia Farrow refuges in the movies in The Purple Rose of Cairo. Fifth, the protagonist writes a novel and does not care about what others think about it, as the old man of Whatever Works. Finally, the movie has two big breaks in the plot, like the breaks of Match Point.The concepts treated by this picture are also amazing, the topic of the golden age and the way it turns into a vicious circle and the story inside a story, because Owen Wilson writes about what he is living without noticing that. Only Woody can manage such great film."}, {"rating": "8", "text": "I'm ashamed of myself that I never watched a single Woody Allen movie until now. \"Midnight in Paris\" is just simply dazzling. The script is smart and provokes intriguing ideas, Owen Wilson is a crappy actor, but not in this movie; Woody Allen pulls out his usefulness and makes him act in his superior form. This is a film any moviegoer or book lover can enjoy altogether."}, {"rating": "10", "text": "It may not boast the depth of his classic films, but the sweetly sentimental Midnight in Paris is funny and charming enough to satisfy this Woody Allen fan."}, {"rating": "7", "text": "A generally enjoyable, clever movie with an interesting premise, Certainly the best Woody Allen movie in at least 15 years (which isn't saying much). At the same time, you get the feeling that either Woody is in over his head, or that he really is the kind of humanities major, overly awed hack writer that he he portrays in the main character Gil. (Of course, Woody anticipates this kind of criticism in the character of the pseudo-intellectual Paul, which is itself a kind of set-up.) I would have preferred less (albeit amusing) name-dropping and greater development of the personas of the artists he so admires. My biggest criticism is that Woody seems to feel the need to spell out his point (i.e., about  the problems in over-idealizing the past) for the audience, which suggest that most viewers aren't capable of figuring the point out for themselves (which may be true). P.S. Marion Cotillard is luminous, both in her acting and in appearance."}, {"rating": "5", "text": "Although I WANTED to like this, and I agree with others that the long list of expatriate artists that are \"visited\" were intriguing, the script just felt so forced and high-fallootin' in an effort to be \"intellectual\" that I never fell for the spell Allen wanted me to go under. Allen also uses Olsen Wilson as his surrogate \"puppet\", seemingly forcing him to use Allen's own rhythms, phrasings, and speech patterns throughout his entire performance. Although I enjoyed the nicely detailed art direction and Marion Cotillard is always interesting, overall, the film is flat, redundant, and surprisingly, only sporadically \"funny\".  Not worthy of the early Oscar buzz that it was once receiving which has now (rightfully) waned."}, {"rating": "1", "text": "I watched this movie because it was supposed to be one of the best of the year.  What a disappointment.  I have seen much better writing and acting in independent student productions.  Other than proving that Paris is a beautiful city, I really think that this movie was rather pointless."}, {"rating": "4", "text": "If you really like most all Woody Allen films, you will probably like this one. Considered as breezy entertainment, it is as you might expect better than most Hollywood fare, but that bar is not too high. Owen Wilson becomes boring as he is given few good lines, portraying a perpetually confused and boring person, and the occasional Woody Allen quip seems out of character for the goy Texas boy. Adrian Brody as Dali is by far the best, and I suspect it is because he did an improv on his role and everyone liked it, while the others are too submissive to Alen's uninspired direction. Perhaps the most disappointing feature is how un-emotive Paris is; how hard is it to miss when combining Paris and nostalgia? A big problem is that even the \"real\" characters are such extreme caricatures, you just can get too interested. I became bored by Allen's latest sleepwalking exercise."}, {"rating": "4", "text": "I thought I was going to love this movie, but I didn't. 45 minutes into it I was looking at the clock, pretty bored & trying to remember how many minutes long it was.  The acting seemed forced, predictable & dull.  Although the potential for a great movie was all right there, something big was missing & it flat lined."}, {"rating": "8", "text": "It is refreshing to be able to watch something that feels fresh, a story that has not been told before.  Midnight in Paris is based on great script and is brilliantly edited and directed.  If the casting was different this could have been a masterpiece."}, {"rating": "1", "text": "All my favorite critics LOVED this, yet it was one of the most boring films I've seen in years.  I like old literary figures: that's not the problem.  Every character, especially the historical figures, were gross caricatures.  It's safe to say Woody Allen doesn't know or care much about these people, beyond their wikipedia entries.  The story was dumb, and the dialogue was on the level of an original high school play."}, {"rating": "10", "text": "This is Woody Allen's best movie in years. Not only a favorite of the critics, but a movie the public will love, too. Owen Wilson is perfect for the role and the supporting cast is terrific. A fun (and funny) fantasy that is definitely worth seeing."}, {"rating": "10", "text": "A perfect movie - smart, funny, beautifully shot and written. Woody Allen on top of his game combing aspects of the old - Annie Hall, Manhattan; the middle years Purple Rose of Cairo; and the rich luster of recent films Match Point, Vicky Cristina Barcelona with a new spin. Owen Wilson is perfect as \"Woody\"."}, {"rating": "4", "text": "Midnight in Paris is two films wrapped up into one and its all the worse for it. The scenes set in 1920's Paris with Owen Wilson's Gil interacting with famous writers, painters and artists such as Ernest Hemingway and Salvador Dali, are incredibly electric and fun (if not funny) but its juxtaposed with a thoroughly boring modern day tale of nostalgia vs looking to the future which just lets the whole film down. Gil only seems to be having fun when in the past which is funny because the moments in the past are the only fun ones in the movie. Rachel Mcadams who is usually a treat seems to be itching for something else to do, with her not seemingly understanding her character well enough. Finally the film doesn't seem to know where its heading with it seeming to know it wants to critique something but then changing its mind on what it wants to critique. It would be a much more rounded film if the narrative wasn't split so much and if Allen knew what he wanted to say as a director or as this film seems to suggest, an artist."}, {"rating": "9", "text": "Original beyond belief featuring strong performances and charm and laughs and just an amazing story. Woody Allen directs an amazing movie. With a bit of low budget charm.  I give this 94% of a good movie."}, {"rating": "3", "text": "Should be titled \"Forest Gump in Paris\". Nothing more than a cliche romance occasionally highlighted by the most one dimensional and plastic portrayal of famous historical figures. Witless and corny."}, {"rating": "2", "text": "CAUTION: SMUG ALERT ON HIGH!  I can't think of many other films with the pretension of this one.  Watching it reminded me of the story, \"The Emperor's New Clothes,\" if you don't like it, you're stupid (or so the hoighty-toighty would have you believe).  Stories and conflicts go unresolved as the plainly miscast Owen Wilson stumbles and bumbles through a story with an interesting premise, but with more holes than Swiss cheese.  The pretentious professor offers some laughs, but is severely under-developed.  The characters are painfully one-dimensional and chug along through yuk-yuk uninformed and unfunny political and history jokes that you better laugh at, lest you be exposed as a conservative and/or unintellectual.  One diamond in the rough is Marion Cotillard's performance, which pulls more than its fair share in this dreadful affair."}, {"rating": "10", "text": "I loved this movie!  Owen Wilson was great in his role, the script was crisp and witty, you really relate to the characters.  Very funny and creative, the best Woody Allen movie in years..please go see it!"}, {"rating": "8", "text": "It is a very engaging, highly beautiful film. Just as Gil (Wilson) is mesmerised with the beauty of Paris, so is Allen in his portrayal of the French capital. With beautiful shots of Paris, with some great cinematography, Allen manages to illustrate why Gil loves Paris so much. Asides that, technically, the film is rather well done, with some great production design. The acting is also very good, with a surprisingly precise Owen Wilson, usually engaging Cotillard, and surprisingly entertaining Kathy Bates. The film, in many ways, is a critique of nostalgia and the power it has over people. Allen makes that rather clear, and it is always entertaining to see how this film has been looked at (and criticised) by both critics and fans as \"not quite as good\" as Woody's films at his peak... Could have been an intentional commentary of the director - or maybe I'm reading too much into it. Nonetheless, highly entertaining and charming film, definitely worth seeing!"}, {"rating": "0", "text": "This is the worst movie I've ever seen. It's another boring indie flick for hipsters about spoiled rich people who are stupid and hallucinating. The obscure references alienate normal people. Critics are truly stupid nowadays. Don't read or believe any positive reviews about this movie. They are shills."}, {"rating": "10", "text": "Any fan of Woody Allen should see this film. Anyone who has ever been enchanted by Gertrude Stein's circle of artists and writers will LOVE this film. One of his very best, similar in tone to \"Purple Rose of Cairo.\""}, {"rating": "8", "text": "Being a huge Woody Allen fan I had to go see this movie even though, as I write this, it is in limited release.  That means driving about 30 miles for me.  Was it worth it?  Yes.  Woody has made many successful \"fantasy\" films in the past (A Midsummer Night's Sex Comedy, Zelig, The Purple Rose of Cairo, Alice to name a few) and I love all of them.  I haven't been a big Owen Wilson fan in the past, but he does a great job in the Woody role for this film.  You can't help but think of Woody when hearing this dialogue, however, because it is so similar to other Woody films.  I'm not going to give away any of the plot except to say that something magical happens at Midnight, and Gil (the Owen Wilson Character) learns about his current life from the experiences.  Everyone in the movie is wonderful.  Woody is one of those directors that is capable of getting the absolute best out of actors.  Woody is on a role lately with Vicky Cristina Barcelona, Match Point and Whatever Works being excellent films."}, {"rating": "7", "text": "This movie is Woody Allen's love affair with Paris. It is warm and tender. The cinematography is outstanding. Still, I would not call it Allen's best. Some parts of the movie are quite cheesy.  Hearing Owen Wilson speak is as if listening to Woody. I found it somewhat annoying. As if Wilson is playing Woody himself. But overall, quite a good piece of entertainment."}, {"rating": "2", "text": "A movable feast ends up as mere piffle! Such a first-class cast, winning conceit, and gorgeously photographed Paris. First of all, the film is too short. It needed another 20 minutes to explore the conflict it sets up. More fundamentally, the writing is problematic because it lacks motivation: Wood Allen needed a believable foil in our hero's in-laws to be as driven and obsessed as he becomes. Clearly, Allen knows no right-wingers, so we get caricature. If he reads the New York Times and needed to know about non-leftists, all he needed to know about them could come from columnist David Brooks. Brooks observes that the further right-wing you go politically, the nicer and nicer people become. And why is that? Because in government, media, and universities - and even elite big business - these outcasts have to be all airs among the dominating and powerful left. Now, with this in mind, our hero ought to have been repelled not by petty meanness and humorlessness, but niceness gone nuts! Treacly, Minnesota nice on powdered sugar and maple syrup. On other words, coma inducing saccharin manners. Instead, Allen simply re-cycles his grasping Jewish shrews for a WASP-y Republican mother-in-law (\"It's always the maid!\" she cries when a peal necklace is stolen). The effect to simply too insincere - too feckless and unbelievable. Furthermore, the motivation for our protagonist to STAY in Paris of the past would have had greater complexity and acquired meaningful depth one can identify with. Instead, the result is too much like Woody moving to Hollywood - out of his element amidst all the shallow veneer. Thus,  promising beginnings really disappoint in a \"Midnight in Paris.\""}, {"rating": "7", "text": "At first I had a little problem listening to Owen Wilson playing Woody Allen; however, once the story progressed to the \"midnight\" part, I was intrigued and had a lot of fun. Some of the characters begin to go a little stock towards the end, but all-in-all a nice picture."}, {"rating": "5", "text": "Entertaining, nicely written story that is unfortunately miscast with Owen Wilson. He continues to play the nitwit and gets handsomely rewarded for it. Go figure. We gave it a C+ but it would have gotten a much higher grade with the proper lead. The female lead was so-so as well but the ensemble cast was excellent."}, {"rating": "4", "text": "Not nearly as good as his last films (Vicky.., Whatever Works, Cassandra's Dream, Match Point...).  I chuckled a couple times as the script contains Woody's usual intelligent humor, which keeps his fans coming back for more.  However, the plot is too simple and I was glad when it was over.  Oh, and Kathy Bates gave her worst performance ever -- wooden.  The lead, Owen Wilson gave a B+ performance.  Several curvaceous young female characters."}, {"rating": "4", "text": "I agree that the film is beautiful, but Woody Allen has not outgrown the same old tired sexual politics that are evident in his films from the 70s!! For example, the main character is encouraged to get with the enlightened French romantic ways when he is told that a man may love 2 women for their different attributes, HOWEVER, the women in the film who have more than one love interest are conveyed in a negative light (the unlikeable fiance that has an affair with the pedantic guy or the woman that has ultimately unsatisfying relationships with multiple men). Woody â"}, {"rating": "9", "text": "This is the typical movie that, if you hear the storyline, you may think it's dumb as hell. If you watch it, it's heaven. I love Woody Allen's movies, and I liked this one as well. Owen Wilson proved he's much more of a Hollywood film star. I loved Marion Cotillard in the role of Adriana. The message of the movie is really interesting also. Fantastic movie, screw the haters."}, {"rating": "9", "text": "Woody Allen's best film in years!  He penned a sweet, charming and poignant script, assembled a top-notch cast, and directed them with grace and elegance  in this beautifully shot movie.  Owen Wilson is utterly charming and wonderful in this role.  Nostalgia can be a cancer if one stops living in the moment, and Midnight In Paris humorously reveals the consequences of believing in \"the good old days\".  I loved this movie!"}, {"rating": "9", "text": "Watched this at Nova, Lygon St, with 9th class sound.  Though the soundtrack was not demanding and therefore Nova was able to reproduce this laid-back french-style fantasy that is intended and was capable of drawing me into the atmosphere.  Storyline is somewhat linear so I did not have to think to figure out what was happening (watched afterwork) but just sit back and relax, even just for the visual.  As for visual, benchmark is far surpassed that expected in terms of both decorative choice and cinematography.I did not expected it to be that great of a movie; thought it was just one of those weird movies for the minority with tastes.  But it was!!  This is one of the few movies that gets me into a lasting mood after the movie!!! =)"}, {"rating": "4", "text": "Once in a while Woody Allen revives his impulse for lo-fi fantastical, while still satirizing the discontents of the bourgeoisie. Owen Wilson is one of the better conduits for the Allen-persona since itâ"}, {"rating": "5", "text": "If one was mixing a movie **** the recipe for this one would be one part insufferable New York liberal intellectualism, one part Woody Allen semi-autobiographical self-rationalization, and one part beautifully filmed breezy Parisian travelogue with a refreshing plot twist.  In short, it is standard Woody Allen fare.  In Midnight in Paris, we find self-doubting and discontented liberal screenwriter Gil (a pseudo Woody Allen character portrayed by Owen Wilson) wandering the streets of Paris while beset by a shrewish fiancÃ© (Rachel McAdams), her cartoonishly moronic conservative parents (Mimi Kennedy and Kurt Fuller), and the overbearing pseudo-intellectual Paul (Michael Sheen).  If it all sounds familiar â"}, {"rating": "2", "text": "I'm a highly selective Allen fan (likes: Purple Rose of Cairo, Radio Days, Play It Again Sam), but I was lured to this movie by the great-sounding premise and a huge weakness for Paris. Trouble was, the movie was all premise. The historical characters were witless caricatures; it took zero imagination to write their parts. The male lead was painful to watch, but then his part was thankless. Woody aimed for magic, and I know a lot of people think he hit it, but for me it was a boring, flat, listless disappointment."}, {"rating": "5", "text": "Midnight in Paris has a interesting story but as the movie goes on you begin looking at the screen and see it is still Owen Wilson who acts the same in every movie. parts are interesting and parts are not so much. you leave with a feeling of what just happened and not quite in a good way."}, {"rating": "7", "text": "I had a smile on my face for most of the movie. Just one of those films where you sit back, relax and enjoy it. Owen Wilson was perfect for this role. The only parts I didn't like were the scenes with Léa Seydoux. I had to Google her just to make sure she's an actual actress, and not some random model or something that was given the part because she's pretty. She was absolutely terrible IMO."}, {"rating": "10", "text": "I know that my review must be 150 characters or more, but I have only one things to say about this movie. Perfect. My favorite Woody Allan film after Annie Hall"}, {"rating": "10", "text": "Next to Annie Hall and Manhattan, Midnight in Paris is Allen's most original and enchanting film. The cast is perfect, as is the setting, tone, and tunes of the 20s."}], "recommendations": ["vicky_cristina_barcelona", "wonder_wheel", "the_royal_tenenbaums", "match_point", "notting_hill", "american_hustle", "charade", "blue_jasmine", "me_and_earl_and_the_dying_girl", "fading_gigolo", "eddie_the_eagle", "the_upside", "the_grand_budapest_hotel", "the_second_best_exotic_marigold_hotel", "the_longest_ride", "inherent_vice", "morning_glory", "10_things_i_hate_about_you", "eternal_sunshine_of_the_spotless_mind", "big_eyes", "yesterday", "the_terminal", "what_women_want", "lucky_number_slevin", "logan_lucky"]}