{
  "id": 1322,
  "title": "Midsommar",
  "starring": [
    "Florence Pugh",
    "Jack Reynor"
  ],
  "runtime": 147,
  "genre": [
    "Horror",
    "Drama",
    "Mystery"
  ],
  "description": "Several friends travel to Sweden to study as anthropologists a summer festival that is held every ninety years in the remote hometown of one of them. What begins as a dream vacation in a place where the sun never sets, gradually turns into a dark nightmare as the mysterious inhabitants invite them to participate in their disturbing festive activities.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7LEI8ulZzO5gy9Ww2NVCrKmHeDZ.jpg",
  "categories": {
    "plot": 1.5517241379310345,
    "acting": 1.736842105263158,
    "ending": 2.4444444444444446,
    "soundtrack": 2.0,
    "cinematography": 1.0,
    "familyFriendly": 1.8,
    "funny": 0.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Movie dragged on & on, none of the characters are likable, it's weird & gory for the the sake of being weird & gory.  Very predictable, very overrated & poorly written,  the only good thing is it's cinematography but that's not enough to make a good movie. I'm dumbfounded by the 10 scores, this movie is so far from perfect it's laughable and you do laugh, not with the movie but at the movie. It also explains why I had to go to the other side of town to watch it as only one theater was showing it in my state (less than a fortnight in from release date) -  that says it all really, no one's watching this garbage."
    },
    {
      "rating": "0",
      "text": "I 've not laughed so much internally since watching \"Carry On Screaming\". I say internally because I was watching it in an arthouse cinema and an \"arthouse\" crowd is too polite and too emotionally controlled to respond honestly when viewing trash. I should have guessed by the way this film disappeared quickly from the multiplexes that the general viewing public had been warned off this film through word of mouth and I think the money men who backed it might be worried that word had got around that this self-indulgent, vanity project written and directed by Ari Aster was never going to get much affection from the viewing public.Sadly, the film carried a reputation before it that equated it with the horror classics such as \"The Shining\", \"The Wicker Man\" and the more recent \"Kill List\" - a high bar that a fast-paced,quickly-told prologue implied might be happening here.But no, weirdness and predictability of the \"look behind you\" type takes over and the standard horror beats had me mentally betting who was going to go first. Much has been made by the critics of the film being set in daylight and being full of springtime colour. For me this was a novelty that quickly wore off. This is a long film - 140 minutes - and the director has plenty of opportunities to satisfy the true horror fan. But when the level of spending on plastic flowers outweighs the amount spent on prosthetic makeup, you know you won't be jumping out of your seat too many times.I wish I'd been there when Aster pitched this movie to the money men - that would have made an interesting film in its' own right. I'm sure he used the phrases \"horror\", \"isolated pagan cult\" \"Sweden\", \"drugs\", \"sex\", \"blond Nordic types\", \"naive young Americans\", \"sunshine\", \"strange forbidden buildings\", etc... to beguile them into parting with their money. For me this is his second strike. \"Hereditary\" had a couple of decent shocks but never achieved the level of quality given to it by the critics. The same thing has happened here. I hope that by participating in it , the careers of Will Poulter, Jack Reynor and even the \"bombproof\" Florence Pugh are not going to go down the plughole - anyone remember Milly Shapiro or Alex Wolff?If you expect a horror film - don't go. If you expect a gory thriller  -  don't go.If you expect a travelogue about the way isolated communities can develop in the manner of a National Geographic film - this is the film for you !!"
    },
    {
      "rating": "1",
      "text": "I was excited for this movie going in and quickly it became apparent that I would be let down. For someone that can enjoy a slower pace horror film, I had to force myself to stay in my seat and not evacuate the theater. Everyone in the theater, including myself, were laughing at parts that were meant to be gruesome. Midsommar is the worst, most drawn out, boring, overrated \"horror\" movie I've ever seen."
    },
    {
      "rating": "1",
      "text": "Ari Aster is a talented cinematographer but should leave the script writing to someone else. This isn't an original story, it's been done before & better in The Wickerman 1973. This version has drugs added with cheap shock value gore & sex. Grim, grisly and downright sickening.  If you enjoy that kind of thing then be my guest, but this isn't for me."
    },
    {
      "rating": "0",
      "text": "There's nothing original in this film, Ari Aster is a hack, the only thing missing is the large wicker man burning at the end.  If the first 2 hours doesn't bore you to death or you haven't walked out, you'll then endure a further 30 minutes of gratuitous violence, gore & sex.  Disturbing viewing for all the wrong reasons."
    },
    {
      "rating": "0",
      "text": "This movie is 2 hours of boredom, then 30 minutes of absurd pretentious sex & gore..."
    },
    {
      "rating": "0",
      "text": "God awful movie, 2 1/2 hours I won't get back!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "1",
      "text": "A second big thumbs down from me, Aster is an awful writer, hopeless at character building, where you don't care about them.  You get enough psychedelic mushroom drinking in this trash to put you off for life, gruesome shock gore for the sake of gore. Predictable & slow. The only good point is its visual design. I won't be paying to watch any more of his movies again..."
    },
    {
      "rating": "1",
      "text": "This is the one time you really should save yourself wasting 2 & 1/2 hours of your time and take heed of the many negative reviews listed here......"
    },
    {
      "rating": "1",
      "text": "super slow, after everything is said an done you are left feeling cheated out of being scared."
    },
    {
      "rating": "0",
      "text": "Worst movie I have seen in the last 5 years. I've read several explanations of the movie and it still remains zero for me. Whoever rated it above a 5 must be bots."
    },
    {
      "rating": "0",
      "text": "This has got to be one of the worst movies I've seen in 5 plus years. There were so many hidden innuendos and pictures in the movie that never quite made sense and we're never clarified. I truly feel like I wasted two and a half hours of my life. I totally feel like I was left out of the fact that you had to be under some mind-altering drug to even remotely sit through this crap. Even if you have a chance to see this movie for free take a pass and do something else!!!"
    },
    {
      "rating": "0",
      "text": "Midsommar is absolutely nauseating from the start of act two onward. There's no reason to care for anyone in the film, nor does it go anywhere interesting. It's eerie, loud, stagnant, and dare I say, a complete misfire on behalf of my favorite company in the film business - A24. The scariest part of this film is that there's those who are crazy enough to recommend it to others... Standards out of whack, I suppose..."
    },
    {
      "rating": "2",
      "text": "As someone else commented 'a film school project'. Trash is one thing. Trash masquerading as something profound, even art is something else. Like Aronofsky's dire mother! Midsommar is just style and no real substance whatsoever. Avoid."
    },
    {
      "rating": "1",
      "text": "This movie was horrible.  I'm not about to go into some trivial reach to dig deep about why this movie should be good.  It's not.  Critics honestly owe me the 2 1/2 hours back that I spent watching this garbage.  If someone wasn't crying in the film, then they were basically yodeling, or getting led off to get killed... And nobody made a big deal about that because apparently, missing people are normal when on foreign soil miles from normal civilization. SMH. The film is garbage.  Save yourself and do something better with the time you would waste watching the crap."
    },
    {
      "rating": "0",
      "text": "Another film bashing traditional european pagan culture and heritage. Also the theme of codependency is so overplayed in modern culture where we are told to be hyper atomised individuals. Never explores the positives of our natural need for reliance on our loved ones or community."
    },
    {
      "rating": "0",
      "text": "Perfectly summed up by a fellow viewer walking out of the cinema at the same time as me: ”well that’s two and a half hours of my life I’m you’re never going to get back”. I have never been so dissatisfied by a movie that I wasn’t even sure what to expect from it. It’s not that it’s poorly acted (mostly) or that it’s poorly directed; because it’s not. The problem with the movie is that, for a film sold on its ability to make the viewer feel creeped out, it never feels creepy it just feels strange... and laughably so. This is by far one of the funniest movies I have ever watched, not because it was trying to be but because I, and a lot of the others in the cinema, were laughing AT the movie. There is no character development, no sensical plot and no need for half of the scenes to even be included or as long as they are. I am baffled by the critical success that this movie has become as it’s just a bad movie. I could remove scenes or characters and it wouldn’t make a difference to the movie. The things the movie did well it didn’t do enough with and there is no resolution or repercussions for the things that happens over the course of the movie. I can imagine people that enjoyed the movie will read this and say “you just didn’t understand” or “it’s trying to be confusing and vague because that’s how the main character is feeling through the movie” but that doesn’t make a good movie. In fact there was nothing to enjoy in this movie, nobody to route for and not enough happening over the 146 minute run time to get really engaged in the film and this is why this is the closest I have ever came to walking out of a movie over an hour in and the only time I have ever written a review of a movie as to warn people to not bother going to see this one."
    },
    {
      "rating": "0",
      "text": "Well definitely two hours of our lives that we will never get back!!! Most bizarre movie we have ever saw in our lives! My husband said that,  “I will NEVER EVER EVER get to pick out a movie again!” We literally laughed as we were walking out, shaking our heads and asking ourselves, “What the hell did we just watch?” Bloody, gory, disturbing.. Don’t waste your time, unless you are truly are disturbed."
    },
    {
      "rating": "3",
      "text": "Although beautifully filmed and chock full of surprisingly grabbing humor, this meandering, overlong, frequently predictable smart horror offering tries the viewer's patience early on in the first act, relentlessly carrying through to the end. While presented as a story about psychological health and well-being painted on the canvas of an allegedly suspenseful thriller, the picture comes up woefully short in the fright department (even though it tries to compensate for that with ample gratuitous gore), largely because, at a 2:20 runtime, it takes far too long to reach its final destination (which is easily visible from miles away). Florence Pugh's often-overwrought performance in this \"Wicker Man\" knock-off becomes tiresome, almost laughable, as the story wears on...and on...and on as it inches toward its wholly unfulfilling conclusion. Save your money."
    },
    {
      "rating": "2",
      "text": "Ugh, such a film school project. And painfully long. Cinematography is great, but so much detail is ripped off from the original version of The Wicker Man that Ari Aster should get a lawyer. Clueless, soulless young friends making ridiculous choices, zero dramatic tension--yeah, bring a book. Midsommar may fuel a new Oscar category, though--the \"Woulda Coulda Shoulda.\" Really, if you like grownup creepy without being bludgeoned by the filmmaker's unoriginality, go find that TWM 1973 cult classic, which also has a great soundtrack by Paul Giovanni."
    },
    {
      "rating": "0",
      "text": "It is stupid as what... I wish I had spent my time better then watching this..."
    },
    {
      "rating": "1",
      "text": "Midsommar is a movie that tries to claim it's deep while swimming around in a puddle of blood. It is overly graphic for the sake of being so and has so many subplots that eventually end up leading nowhere that you might question the two and a half runtime. It has an overwhelming sense of dread throughout but it isn't rewarding. Far too on the nose for any of the foreshadowing to feel paid off and is just in your face about it. The director is so self indulgent in everything he does that watching it I kept wondering when scenes would end. That being said art direction and cinematography were really well done but they couldn't save the movie from this disaster of a script."
    },
    {
      "rating": "3",
      "text": "A horribly tedious and derivative film that falls far short of the director’s first effort. Not one surprise in store here. It is obvious what is going to happen the second they arrive at the commune. There is not one person in this movie who does not come across as either annoying, repugnant, or both. The American college students are universally awful characters, particularly Dani’s hateful dolt of a boyfriend Christian. It is also far too long (2 h. 27 min.) This is simply undercooked torture porn that, unforgivably, puts on the pretense of being something better than torture porn. It is not scary or interesting in the slightest. If you’re in the mood for some good horror revolving around bizarre pagan rituals, just watch the Wicker Man."
    },
    {
      "rating": "1",
      "text": "Folks - look at the USER reviews. It's pretty much a divided crowd -- you will either love this movie or hate it. For me, the movie should have been categorized as \"Absurdity, Pretentiousness, Gore\"  there is very little suspense or thrills. Basically it's an overbloated film where the director is in love with himself and every shot and scene. You sit through basically 2 hrs of NOTHINGNESS until things turn to horror and absurdity. Imagine going to a movie that was about a wedding and in the movie EVERY BORING DETAIL was presented i.e., the cake cutting, every dance, every speech, every boring bit of the ritual. THAT'S WHERE the 2 hr 25mins comes from!!!!   This is NOT a horror movie until the last 30mins. My advice read the synopsis and then just sneak in and watch the last 30mins of the flick. You missed NOTHING."
    },
    {
      "rating": "0",
      "text": "This film was absolutely gross and disturbing. It is just a more gruesome version of The Wicker Man."
    },
    {
      "rating": "0",
      "text": "Makes Wicker Man look like a kids movie. If you want watch disturbing scenes of murder then you will love this movie. Also if you like the Alarma TV show then you will like this one also."
    },
    {
      "rating": "1",
      "text": "I hate everyone that rated this movie favorably. I should have listened to the bad reviews. This movie was a pile of steaming poo. Save your money."
    },
    {
      "rating": "0",
      "text": "This is 2.5 hours of my life that were wasted. I kept saying No, no, no and NO when I left. Don't waste your time. Badly done, so slow and there is no connection with the audience to the screen and vice versa. Nothing will pull you in, there is no climax, it's a wanna be badly made if there was a worst comparison to Standly Kubrick in weird and different this would be it and that would be an insult to Stanley. This movie was absolutely terrible. TERRIBLE."
    },
    {
      "rating": "1",
      "text": "Trying to be provocative but really just perverted.  Left with a headache.  Slow"
    },
    {
      "rating": "0",
      "text": "THIS IS NOT A Horor Film but more an adaptation of “cult-culture” (There I said it first. Copy-protected lol). There are disturbing images in this film but NO monsters or spooky things. The storyline is a 3 star and the picture quality is a 4 star. However, I give this Film a 1 Star because it wasn’t what I was expecting. AND next time I will do a better job checking reviews before wasting $13 on a ticket and $14.99 on popcorn/soda. I would ask for my money back if I wasn’t embarrassed and already moved on, an hour after leaving early."
    },
    {
      "rating": "0",
      "text": "What is WRONG with these filmmakers? Seriously. Something is wrong with them. Why pay $ to observe their twistedness?"
    },
    {
      "rating": "3",
      "text": "Replace ‘swedes in sweden’ with ‘pygmies in the congo’ and this movie goes from “horror movie” to “national geographic”.  Really theres nothing scary and if this is just what they do every 90 years so be it.  Super boring till the end.  Id have trimmed the whole mushroom scene for something like a bonding bear hunt."
    },
    {
      "rating": "3",
      "text": "God, this movie was slow. The 2.5 hour runtime is crazy long for what it is. Though the acting is good, the only relief is Will Poulter's clever one-liners and decent acting. The rest of the movie is steaming garbage. Everybody in the theatre laughed at what scenes were meant to be horrifying, and the weird premise is so off-putting. There is no plot twist that isn't foreseeable from the beginning. This film is not nearly as good as Hereditary and should be skipped. If the boredom doesn't get you first, the laughable writing will."
    },
    {
      "rating": "10",
      "text": "saw it 2 times and i can now say - perfectly written, perfectly acted, perfectly directed, perfect cinematography. it's an instant classic, my favorite movie of the year, probably my favorite since Call Me By Your Name - and i've though a lot about this and i've decided that thos one is my new favorite horror film. has aot of details so i recommend watching it more than once. but it's really perfect"
    },
    {
      "rating": "1",
      "text": "A family reunion in a Scandinavian village becomes a bloody pagan slaughterhouse wherein the foreign guests become human sacrifices.  We haven't seen this before?  Sure we have. Leaving the auditorium after the movie, someone snorted \"Nihilistic garbage,\" and I think that was a good appraisal of the film.  The movie is tedious and predictable and gratuitously gory.  It also has distinctly anti-white and anti-Christian undercurrents.  In one advertising image, two young people are walking through a lovely pastoral setting toward what appears to be a wooden cross.  What unsubtle message does that send about Christianity, in general?  What message does it send about how the creator of this slop regards Christians?  Would he have made such a movie about a village in his ancestral homeland, Israel, a movie in which the villagers are discovered to be practicing the \"Blood Libel,\" and abducting and sacrificing tourist Christian children?  Of course not.  In \"Midsommar,\" portraying some of the victim visitors as nonwhites -- visitors to a lily white Swedish hamlet -- is also some nasty messaging, on one level or another. Visually, this film is engaging and vivid and colorful.  The story is mildly interesting, but predictable.  I am nonetheless ashamed that any Christian or Swede agreed to participate in this spectacle."
    },
    {
      "rating": "1",
      "text": "Once again I fell for a critics' hyped \"horror\" flick and surprise surprise, it sucked. Ok, it is well shot and directed, with good photography, but it is also slow and dragging, with quite a few story holes and really boring. It is certainly not \"horror\" and please people, do not compare it with the epos of modern horror, \"The Witch\"."
    },
    {
      "rating": "2",
      "text": "This movie was a directionless, disingenuous, disaster. It feels like it goes forever and what little plot there is it meanders through like there is no hurry or impetus to get any type of resolution. The characters are thin with little or no development.  Normally in a movie of this nature there is some kind of growth or obstacle for the protagonist to \"get over\" but the main character starts and ends the same way.  im sure that if you reversed the genders of Dani and Christian, and showed a previously faithful, patient and supportive woman, being drugged and coerced into having sex that she didnt particularly want then being condemned to burn to death by her jealous boyfriend then people would not being singing the praises of this movie in quite the same way.Midsommar is a boring, tedious, dumb and pretentious piece of cinematic excrement."
    },
    {
      "rating": "2",
      "text": "Midsommar is nonsense. A cult of screaming lunatics \"haunt\" the druggie vacationers. Wow, so original, right? You think the government can't track them there when their families report them missing? There is no suspense - zero! The victims willingly let the killing happen, and it moves so slowly that even the most naive audience could predict what happens next."
    },
    {
      "rating": "2",
      "text": "I do not understand the love this film gets. It's without a doubt one of the worst films I have ever seen. Boring is putting it lightly. This was an absolute snoozefest."
    },
    {
      "rating": "2",
      "text": "In the pursuit of creativity and innovation to the horror genre, this film goes beyond the disorienting and uncomfortable stage set in the beginning to something much worse. It feels like the sole intent was to be unique and shocking, which it is, but this is at the expense of being anything that has substance."
    },
    {
      "rating": "0",
      "text": "What a waste of time! This movie is horrible, boring and nonsensical, the scenes are dragged to the limit of sanity. The first 15 mins in the movie I thought, that's could be good, then they go to Sweden, and another movie starts, one I really didn't care for and would certainly have lived better without! A very, very ugly and boring movie."
    },
    {
      "rating": "0",
      "text": "This is without a doubt the worst movie I have ever seen. I kid you not. Do not see it at all costs. It was so bad that the two other people in the theater walked out crying at the end because they wasted their money on it. The fact that this movie has generally positive reviews is absolutely asinine. Giant orgy that has no real reason to exist aside, this movie is boring and predictable as all hell. Every character is infuriatingly bland and the only part of the movie I enjoyed was seeing them each killed off because I no longer had to suffer anymore. It’s paced terribly, too. This crap fest is nearly 3 hours when it could’ve easily been a 1/3rd of that. Scenes go on forever and there’s absolutely no tension because anybody could see what’s going to happen next. Do not watch this movie. Do not. It is not good. It is not even so bad it’s good. It’s just plain bad. Watch literally anything else instead"
    },
    {
      "rating": "9",
      "text": "Scary in such an interesting way. Made me feel like I was on drugs myself a few times. Just an incredible cult movie done better than any I've seen. Also, Florence is absolutely amazing in every single thing she does. This just proves it even more. She is the best part of this movie."
    },
    {
      "rating": "3",
      "text": "Another film from Ari Aster which I didn't like that much. The only thing that works in this movie is the visual part. The pagan village looks beautiful and is created with the attention to detail. The music, dances and singing are also great. The horror part is grotesque to the point of only laughable. People laughed at the absurdity of the scenes during my screening. Tonally this movie sucks. It tries to be a pointless ironic horror entertainment, psychological drama and initiate deep philosophical conversations - all in one. It achieves only the first goal - pointless entertainment. \"Midsommar\" is too ridiculous to start a more serious conversation about anything. And I think Ari Aster tried to say here something about ego/individuality culture vs collective culture. Criticise and ridicule organised religion and comfort people find in rituals and false ideas of belonging to \"the family\". Something about adult children subconsciously wanting the death of theirs parents as a form of liberation. But all those ideas fall flat because the plot of this movie is so ridiculous that it doesn't encourage that kind of discussion. It is just to weak of a movie even on the superficial level to start a conversation about deeper meanings. I also don't understand the praise that Florence Pugh receives for her performance in this movie. Yes, at the beginning she's great, but with the progression of the plot, her character becomes less and less real or interesting. All the characters in this movie act like ideas of people and not real people. I've read reviews which said that the main character's boyfriend is a jerk. Well, Dani also was very unlikable (all the characters in the movie were). She was very needy and she was as toxic in their relationship as her boyfriend. If it comes to her psychological trauma I think the director forget to show us what was her family like. That would perhaps create the ground for some kind of pay off in the finale and the ideas behind her sister's decision. \"Midsommar\" looks beautiful at times, but the plot is too weak, ridicules and laughable to provoke viewers to dive deeper. Very shallow and pointless movie. As an entertainment is a pointless B-movie. And it's not that original. It's derivative of Robert Eggers' \"The Witch\", Ari's own first movie \"Hereditary\", and many more. Only the superficial folk aspect of it is kinda new and interesting. Very pretentious artsy-farsty movie. I say \"no\" to Ari Aster and \"Yes\" to Robert Eggers. From those two Eggers is a far more focused director."
    },
    {
      "rating": "0",
      "text": "The distortion of the so-called pagan tradition is outrageous in this film. The production wrote that did thorough research on it and the result is quite disturbing. Making a horror type of movie is one thing but distorting so much and put the cult label like this is just not ethical whatsoever"
    },
    {
      "rating": "0",
      "text": "The only reason why this movie is considered horror, is because it has been reviewed by emotionally immature (also very sheltered from life and the brutal nature of reality) people. It is very bright and colorful, but that's about it. The characters are simply shallow beyond belief, caricatures of stereotypes at best. Very pretentious, unoriginal, uses clichés and all too common tropes. Far too long and boring. Another movie that can be summed up in the trailer without loosing much."
    },
    {
      "rating": "0",
      "text": "Absolutely terrible. Never have I seen a director show so much potential (Hereditary) and fall so flat the 2nd time around. Boring. Uninteresting. Slow. All the things about movies you do not want are here on full display."
    },
    {
      "rating": "1",
      "text": "Honestly, where do I begin. The entire start scene has absolutely nothing to do with the movie, the movie was so slow it felt like 4 or 5 hours, at no point was it really scary, at no point does it really draw you in, the characters are just moronic .... the only genuine death from this movie would have been me dying from boredom but somehow I made it through. Please watch this movie just so you can marvel at how bad it is."
    },
    {
      "rating": "4",
      "text": "Weird and gory for the sake of being weird and gory. Drags on too long and I didn't care for the characters at all. Strangely predictable as well. It was directed well but that's the only positive I can give it. Very overrated"
    },
    {
      "rating": "5",
      "text": "One year after the excellent debut, Paul Asay directed his second film.  Is a year enough for an artist to create a good movie?  We know that production companies try to make more and more money by exploiting the phenomenon of the moment and this seems to me one of those cases.  Unfortunately midsommar is a failed film.  I say unfortunately because Asay has some directorial (and writing) qualities out of the ordinary, with an exceptional ability to create tension.  But if the beautiful first short part of the film makes you think you are at the consecration of an artist, the second part, that takes a completely different path from what we saw earlier, is lackluster and takes refuge in situations  seen in too many films and to become more and more a bad copy of \"The wicker man\", with an ending that makes you smile rather then letting the viewer think, or put anxiety. It would seem almost as if two different scripts had been joined.  The photography is beautiful but  points excessively to aesthetics and symmetry even when there is no need for it, ending only in a mannerism.  Too bad, because I repeat, the first half hour left us thinking about another great film"
    }
  ],
  "recommendations": [
    "hereditary",
    "the_devil_inside",
    "the_strangers",
    "the_hateful_eight",
    "bird_box",
    "the_happening",
    "unfriended",
    "chernobyl_diaries",
    "the_host",
    "the_pyramid",
    "shut_in",
    "the_mist",
    "the_lobster",
    "splice",
    "old",
    "i_care_a_lot",
    "the_twilight_saga_breaking_dawn_part_1",
    "malignant",
    "paranormal_activity_4",
    "knowing",
    "2012",
    "unfriended_dark_web",
    "the_emoji_movie",
    "host",
    "cloverfield"
  ]
}