{
  "id": 1588,
  "title": "Midway",
  "starring": [
    "Ed Skrein",
    "Patrick Wilson"
  ],
  "runtime": 138,
  "genre": [
    "Action",
    "Drama",
    "War",
    "History",
    "Adventure"
  ],
  "description": "The story of the Battle of Midway, and the leaders and soldiers who used their instincts, fortitude and bravery to overcome massive odds.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hj8pyoNnynGeJTAbl7jcLZO8Uhx.jpg",
  "categories": {
    "plot": 5.448275862068965,
    "acting": 4.214285714285714,
    "ending": 3.5,
    "soundtrack": 2.6666666666666665,
    "cinematography": 5.5,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 7.909090909090909
  },
  "reviews": [
    {
      "rating": "4",
      "text": "(Mauro Lanari)After the first half I realized that I hadn't understood the plan of the US counter-offensive, after the second half that I hadn't understood the vicissitudes of too many characters. A blockbusters expert like Emmerich was unable to provide me with a script that wasn't chaotic or that kept me focusing enough to follow it."
    },
    {
      "rating": "0",
      "text": "It's an overly-produced mess of a movie that poorly utilizes the talent of the cast and does a severe disservice to the real-life events that this film is based on. There are so many better military films available, Please don't waste your time on this trash."
    },
    {
      "rating": "0",
      "text": "I never give movies a zero however incompetent they are made. This one is the exception, because besides it's many flaws, arcade cgi, poor acting, totally imposible airmanouvres it's something worse. It's a racist white wash and its deliberate. You will see no black American in this movie. How do I know that it is deliberate? Remeber the guy at pearl harbor jumping behind the gun and shooting down a Japanese plane? That happened. That's famous because it was done by a black man and he didn't get a medal because of that fact. They made him white like every other american soldier in this movie."
    },
    {
      "rating": "4",
      "text": "This film was slightly better than I thought it was going to be. It’s not a good movie but it’s not terrible but what do I expect from director Roland Emmerich. It’s definitely one of his better films but that isn’t saying a lot. This has to be one of the worst scripts of the year. Every single line of dialogue was awful and insufferable. It was obvious that all the film cared about was its visual effects instead of its script and characters. Even though the characters are based on real people, they still feel very bland and boring. I don’t know why they put Nick Jonas in this movie other than to just have him in the film. The acting from most of them isn’t half bad. They are trying their hardest with the material they are given and do a good job for what the film is going for. Aaron Eckhart for his limited screen time probably gives the best performance of the entire film. Ed Skrein does a pretty terrible American accent though. There were aspects to the presentation of the film I did appreciate. Before I saw the film, I did some research on the Battle of Midway and the film was actually very historically accurate. The dive bombers did miss a lot of shots and maybe only one or two would manage to land a hit on the Japanese carriers. While some may call that cheesy within the film, it was historically accurate. I also like how the film didn’t demonize the Japanese unlike a certain 2001 film (Pearl Harbor). It shows them as human too and that they were doing what they had to do to protect themselves and to follow orders. The action scenes weren’t half bad but mostly forgettable although some scenes did look really cool. The visual effects weren’t that bad either. They were pretty meh in the beginning but they got better as the film went along. Another thing I will give the film credit for was that it was for the most part entertaining. I didn’t ever feel bored even with the 2 and a half hour runtime but that might be an issue for some. The music sounded like stock war film music and there was a large amount of war film cliches thrown into the film which were very obnoxious. Some scenes are loud enough where some actors have to overdub their voices but it wasn’t properly synced up at some points which took me out of the film a little. Overall, Midway may be entertaining and very historically accurate but it falls victim to an awful script, bland characters, and too many typical war film cliches."
    },
    {
      "rating": "2",
      "text": "2 for CGI. You guys earned it. Should probably give one more dor tying Nick Jonas to an anchor and drowning him. Jesus this sucked. Never have I heard such terrible \"caricaturized\" accents and dialogue. The battle scenes couldn't even make up for it. Stop remaking movies, Hollywood. Its lazy and you suck at it."
    },
    {
      "rating": "5",
      "text": "Unfortunately, Midway plays like a disjointed, star studded documentary than a coherent movie. The one thing you will notice right away is how much the movie jumps around, and if you don't pay attention, you'll get confused since we are jumping forward in time and in between places frequently and without much warning. Then we have some side plots that go nowhere. This movie could do without the whole Doolittle raid, the submarine, and the director trying to make a movie on midway. It feels like they are trying to fit in as many tidbits of historical info as they can. Instead, it could focus a bit more on midway and everyone stationed there(for a movie about midway, there is awfully little of it) and have more focus on the operation. As it stands there is no build up and you can't definitely tell when the time for the attack has come. To be frank this movie is not that historically accurate either.One other thing is the CGI. At best it looks like the best from a video game cinematic, at worse it looks like some cable channel's documentary.About the acting I think it was ok, the actors gave their best. But they weren't given much time or space to breat as the movie just jumped around constantly.Overall I thing it's a passable, albeit mediocre film."
    },
    {
      "rating": "9",
      "text": "I am trying to balance out all the bad reviews here which don't make a lot of sense.  If you study history you will like this movie.  The lead in where they discuss tactics from tora tora tora is missing and there are certain segments of the battle which are missing.  The battle is much more entertaining if you explains all the tactics used and the decisions the admirals had to make on the spot.  They should have started the movie after pearl harbor and followed the two pilots that had two hits each, that should have been the movie.  They extended the movie by having pearl harbor and then added even more subplots which weren't relevant. I would just have focused on the intelligence breakthrough and the actions on the deck of each admiral, plus follow a few pilots."
    },
    {
      "rating": "3",
      "text": "I’ve been in the Marines for 22 years and I love war movies. I am familiar with the Battle of Midway from my military education and was excited to see this movie.I’ll keep it simple - don’t waste your time. Read a book instead.1. Bad acting and cheesy characters. I wholly doubt these actual heroes were at all as lame as they are portrayed.2. Battle scenes are corny and the actors feign emotion throughout. . Not believable.3. Japanese actors did great, good job boys"
    },
    {
      "rating": "10",
      "text": "What a great old fashioned war movie that is about the history and not 60 minutes of silly backstory that has nothing to do with history. I read about the so called lines of dialog being somehow not to 2019 standards but did anyone ever stop to think that is how people may have talked back then. The special effects were top notch and the only fault I could find was that it was not detailed enough but I could understand as this movie covered all the battles between the start of the war, Pearl Harbor, Doolittles Raid, Coral Sea and Midway. Each could have been a movie unto itself. Best war picture I have seen in years!"
    },
    {
      "rating": "4",
      "text": "Midway was the area in the Pacific where the Americans took on the Japanese after Pearl Harbor, marking a turning point in WWII. In an attempt to add a human slant to this battle-chocked war movie, the story is populated stories of several actual heroes. Director Roland Emmerich is known for his big disaster flix and this one has plenty of firepower…however, the CGI isn't always convincing. Despite all of the action, much of the drama feels like a throwback to 50s war movies replete with corny dialogue and bad acting. History buffs might enjoy the ride and anyone who likes watching dive bombers and big explosions may be thrilled. Those hoping for much more will likely endure a failed mission."
    },
    {
      "rating": "3",
      "text": "The makers of this movie should be ashamed of themselves.  There is almost no way to tell what is going on.  There is a lot of flying action, but not much story."
    },
    {
      "rating": "4",
      "text": "Roland Emmerich suffers the same excesses that Michael Bay. It goes more for the show than for the substance and surprisingly several elements that once afflicted Pearl Harbor also afflict Midway and therein lies the problem: If there's no action, the film has nothing and therefore even if you fill the screen with explosions, eventually as a viewer you will look for something else and unfortunately you will not find it."
    },
    {
      "rating": "9",
      "text": "I was pleasantly surprised by how many accurate details this movie got right about the events portrayed, from crap American torpedoes to Yorktown being repaired in record time and showing almost all the air attacks that the Americans threw at the IJN... Not the best story but really well done and as accurate as can be expected from Hollywood."
    },
    {
      "rating": "10",
      "text": "Great movie much better than Perl Harbor. It is classic war movies without any hidden agenda, so rare nowadays."
    },
    {
      "rating": "10",
      "text": "This is a well-done film, certainly better than the 1976 Battle of Midway. I was expecting to see a farse equivalent to the Pearl Harbor movie from a few years back.  I was surprised to see that Emmerich followed the actual history leading up to the the battle and the engagement itself was very close to what actually happened."
    },
    {
      "rating": "10",
      "text": "It is an awesome movie. If you don’t like history too much, you won’t enjoy it. But if you like action and even like history a little bit, you’ll have plenty of fun"
    },
    {
      "rating": "6",
      "text": "While the film is entertaining overall, it also has extremely outdated CGI that is very noticeable as well as some B movie acting."
    },
    {
      "rating": "3",
      "text": "If Michael Bay's 'Pearl Harbor' (2001) was too pretentiously romantic and historically inaccurate for you, the best thing I can say about Roland Emmerich's 'Midway' is that, it does take a more accurate look on the attacks on Pearl Harbor, but everything else about this film makes me wish it was handled by a different filmmaker. The film stars Ed Skrein as Lieutenant Richard Best, and his journey through this picture in becoming a daring pilot to save the Americans from the Japanese attack. Skrein is a good actor, whose had many different and successful roles, but here, his accent feels too fake and put-on, it also doesn't help that the dialogue, which was given to him by Wes Tooke, wants him to ham-up the cliched hero talk and over-exaggerate everything he says. He lives a rather peaceful life with his wife Anne (Mandy Moore) and daughter. The film is 2 hours and 18 minutes long, and I can definitely confirm that the pace of the film makes you feel every minute that goes by. There are so many characters here to focus on who don't get as many pivotal moments until the movie ends. We have Lieutenant Commander Edwin Layton (Patrick Wilson) who tries his best to figure out a way that the Americans can defeat Japan and prevent more lives at risk. The battle sequences are fine, but the main issue I took with this film is the very bright color palette. There is a lot of yellow here that is being emphasized on screen. The picture doesn't feel gritty or at least horrifying when you take into account what the characters have to go through here. Plus, the film is PG-13, which is the same mistake made with 'Pearl Harbor' (2001), there is no sense of horror or disturbance. Many of the deaths you see on screen won't stick with you, at least not in the way Steven Spielberg's 'Saving Private Ryan' (1998) did. I understand it's unfair to compare 'Midway' or any other war film to 'Saving Private Ryan' (1998), but if you want to make an effective war film, that's how it's done. Or at least, try to find other reasons why that worked. Overall, this is a forgettable movie filled with over-the-top and clustered action, some hammy acting and crummy dialogue. I think it's safe to say that the legacy of the people we see here will only be seen through the history books."
    },
    {
      "rating": "8",
      "text": "Despite some cheesy dialogue, Midway is an entertaining movie with solid acting and visuals that offers a more balanced perspective of the US/Japanese Pacific war."
    },
    {
      "rating": "0",
      "text": "Possibly the worst movie I’ve seen in the last 10 years.  It’s like a video game cut scene, all cg, terrible acting, terrible plot, the polar opposite of a movie like Saving Private Ryan.  Absolute trash."
    },
    {
      "rating": "2",
      "text": "Typical Hollywood.  Midway with blinders. The movie should be titled \"Enterprise-CV-6\", NOT \"MIDWAY\".  What was \"mentioned\" is accurate enough, but blatantly exclusive to the Enterprise CV6, to the exclusion of practically every other American Carrier in the Pacific 1942.  Lexington (mentioned once), Yorktown (mentioned twice), Hornet (mentioned once).  Good coverage of attack on Pearl Harbor (Dec 1941).  Good coverage on Doolittle raid (Enterprise and Hornet Apr 1942).  Decent coverage of Gilbert Raid (Enterprise May 1942).  No mention of Solomon Raids (Yorktown May 1942).  Piss poor coverage on Battle of Coral Sea (They show a glimpse of Lexington being lost, NEVER mention the Yorktown, but boy they make mention of the Enterprise and how it almost got there....  As for the battle of Midway, Yorktown is only mentioned twice (as being repaired at Pearl Harbor, and then being lost at end of Midway), and the Hornet is never mentioned at all. They cover Admiral Halsey getting sick prior to Midway, cover Admiral Spruance being put in charge of TF-16, and never mention once Admiral Fletcher (TF-17 / Yorktown) being in Tactical command of all American effort at Midway.Again, the movie needs to be retitled \"Enterprise CV-6\"."
    },
    {
      "rating": "0",
      "text": "bs movie, everyone kept clapping at any fkn dramatic music or explosion, not worth your time or money if you have normal things to do"
    },
    {
      "rating": "5",
      "text": "Emmerich's inconsistencies surely prove himself to be Michael Bay version 1.5. The first 25 minutes of Pearl Harbour attack could be just the best part this film has to offer with well-paced action sequences and dialogue. The rest is purely bits and pieces of dramatic and repetitive battles with some subplots added into the mix to prove the heroic and unbelievable choices that Navy pilots make. The Aaron Eckhart's subplot is even more ridculous, following his journey into China then nowhere to be seen till the very end of the film. With so many lazy and fast-jumping edits, Emmerich loses traction in the later part of the film, giving the audience little to none of the anticipation that the Pearl Harbour Attack built up."
    },
    {
      "rating": "10",
      "text": "The movie is terrific. To clear up some confusion, the picture is about the BATTLE. Ninety percent plus of the dialog is expositional, acquainting the viewer with the military situation, which is the point. It isn't an exploration of character, and doesn't pretend to be. But it is quite accurate historically, and the action sequences give the audience a real sense of what dive bombing a warship in the face of intense anti-aircraft fire must be like. That's the real point."
    },
    {
      "rating": "3",
      "text": "Bleech. The main character has a very funky accent (after researching it seems he's British- why couldnt they have hired an American actor instead?), and his scenes are very awkward and distracting. In fact the non-battle sequences are devoid of any drama and characterization that its all laughable.The characters are all archetypes, and dont seem to be very realistic even though they are based on real life people. The script has no suspense or thrills- it seems more like a highlight reel of what happened on Pearl Harbor to the Battle of Midway. Even the Doolittle Raid takes up about five minutes- I think they included it because half the backers of this movie are Chinese. Let's not forget the cringe worthy dialogue too.The original Charlton Heston movie was better- if it only had better special effects like this one it would have been a classic."
    },
    {
      "rating": "10",
      "text": "Brilliant film, ignore the trolls giving it a zero because they hate America or were expecting Schindler's list. A very entertaining movie and I recomend anyone see this on the big screen as soon  as possible."
    },
    {
      "rating": "6",
      "text": "When I heard Mandy Moore was in this a thought flashed in my head that her character would sink all four Japanese carriers with the Millennium Falcon while \"Fight Song\" played in the background. But no, the Independence Day director played it straight but sadly with mediocre results. The cgi action ranges from convincing to laughably silly. The dialog is hokey and the cowboy pilot gets way too much screen time. Still, I didn't hate it, but I wouldn't watch it again even free on Amazon Prime."
    },
    {
      "rating": "5",
      "text": "For a movie with a lot of action, I was a little bored.This is helmed by disaster movie director Roland Emmerich. He is a guy who found his voice in the 90's, and this movie kind of feels like it was made during that decade. The execution is too light for its own good. I don't mean this in a complimentary way. Dialogue is undercooked and at times cliched. I felt like a lot of good actors were wasted here. There is a lot of quick jumping from scene-to-scene. Yes, I know this is one of those war movies that look at many players, but even by the standards of these types of films, the scenes often don't hold weight.Also, this movie feels kind of odd for today. More recent war movies have tried to look at the more realistic and darker elements of the subject and the human toll and psychology of it all. Not that this movie isn't about human sacrifice, but this tries to be more of a crowdpleaser like the war films of yesteryear. It feels out of place in today's climate.    Of course, I could just be jaded. If you want to see movie honoring those who died for our county, then this might be for you. The movie does a good job of laying out how the battle of Midway went down on both the American and Japanese fronts and evoking the old feel of wide-scale military battle films. Emmerich maintains his eye for action. The combat scenes are all done well. The computer graphics aren't the best; none of them look realistic enough. In Emmerich's defense, I give him credit for showing a lot of them during full daylight scenes, which is trickier than doing them during night or in grey/blue lighting. Also, props to hair and costumes in this. Overall, this is a movie that looks good enough but just doesn't stand out."
    },
    {
      "rating": "10",
      "text": "Great movie, I loved the story and characters, I It had me on the edge of my seat the whole time"
    },
    {
      "rating": "7",
      "text": "Alot of fun. Great visuals. Characters are pretty generic which is what keeps it from being a better movie."
    },
    {
      "rating": "1",
      "text": "Expectations were not great due to the previews but this was god awful. Cg explosions, terrible acting, horrific lines and unbelievable characters (actors) that looked every bit of Hollywood plastic surgeons’ canvas. Sad when Woody Harrelson is the best actor. Ed Skrein was bruuuuuuutal, Dennis Quaid ... ok I will stop there. This had the potentional of being a great film on a great battle but it was terrible. When looking at Band of Brothers and The Pacific this movie was complete garbage and 2hrs I will never get back."
    },
    {
      "rating": "3",
      "text": "An arcade game of a movie, and not in a good way.  Cartoonish characters everywhere, with dialogue like a bad Saturday Night Live sketch of the period: \"Look, I ain't gonna sugarcoat it, boys.\"   They get a British rapper to play the lead character, a Jersey boy!  Maybe his accent was from the Jersey English Channel Islands. He tried for a tough guy;  kind of a cross between a wisecracking John Garfield with the look of a smirking James Dean.  And failed utterly.  The flight scenes were right out of video games, but the ones that don't bear any relation to the physics of flight.  The Japanese fighters in the Pearl Harbor scenes always dramatically flying between the tightly docked ships, which means that they were strafing open water;  the steeply diving plane disappears right in front of the landing deck .  .  . only to miraculously rise up at the last instant for a perfect landing.  Yayyyy!  Riiiigggghhhhht.   An almost comically bad movie that does no justice to perhaps the most pivotal battle in the history of warfare."
    },
    {
      "rating": "9",
      "text": "In a word fantastic. As if you were sitting on the plane next to the pilots. CGI, visuals and sound design are phenomenal. I do not know if the story is historcal correct entirely but I really recommend it for the casual viewer."
    },
    {
      "rating": "3",
      "text": "Clunky and dull. They set out with a great idea but instead slapped some scenes together with no glue in between and called it good. I know Emmerich is known for not making great films but at least he tries to have a story, this had nothing."
    },
    {
      "rating": "9",
      "text": "The screenplay may be informative, corny and cliched by turn, but it serviceably showcases the visuals which are exhilarating. overall this is criminally underrated and a bloody good watch. Go and see a real popcorn movie and enjoy!"
    },
    {
      "rating": "7",
      "text": "Midway is a typical American fighter about World War II. Maximum pathos and heroism, minimum logic and historical credibility. Fortunately here did not praise American heroism and showed for the most part everything as it is, the effects are excellent and the cast is not bad. In general, a good film, on a very bad topic in the cinema."
    },
    {
      "rating": "10",
      "text": "Just saw this film over the weekend and damn was it good.  Having had my father and three uncles serving in WW2, it's nice to see that people still remember when America was a great nation."
    },
    {
      "rating": "9",
      "text": "Great film and reasonably close to the history. Doesn't do Spruance justice I think."
    },
    {
      "rating": "10",
      "text": "For once, Hollywood presented the correct rankings for the military. In addition, although I am not a WW2 buff and was discharged in 1963 from the U.S. Naval Air Corps, other aspects of the movie that would not have existed during my enlistment, could have been 20 years in the past.The movement of the plot was interesting, the soap kept to a minimum, unlike the Charleston Heston film of the 1970s and the action was believable. If, though, you prefer to watch unbelievable car chases and fighting where a single emaciated male, employing martial arts, defeats a dozen weight lifter, this film would not, in the least, interest you"
    },
    {
      "rating": "9",
      "text": "This movie is an excellent telling of the story of the Battle Of Midway. Excellent casting, definitely Emmerich's best film since Stonewall. If the film doesn't stir you a bit, you might not be an American...."
    },
    {
      "rating": "9",
      "text": "I loved Midway!  Unfortunately, we are taught very little about these monumental battles coming up through school.   I have learned alot about The great Battle of Midway in the last 10 years through some excellent documentaries.  It is very difficult to fully tell the story in a 2 hour Hollywood movie.  However, I think they did a pretty good job."
    },
    {
      "rating": "0",
      "text": "Bad so nasty to much GGI efect so badly and borring movie, dont waste your time"
    },
    {
      "rating": "0",
      "text": "I probably should not add any justification to this $chlock's existence, but since Hollyweird created it I feel compelled, so here goes. I don't know when the producers/directors/screen geniuses in Tarnished Tinsel Town are going to figure out that they have no talent whatsoever for historical dramas of this nature, but I hope it occurs in the next 1,000 year or so. Anyway, this film is everything I expected: Typical, Boring, Lame, Formulaic. . . and the cast, the plotting, and the dialogue can only be described as Terrible. But hey, what do I know? People are bored, and $chlock sells. Bottom line: You'd be better off watching one of the YouBoob video documentaries on this event and spending the money on lottery tickets!"
    },
    {
      "rating": "10",
      "text": "Dont let any of these negative reviews dissuade you from seeing this. It is the best movie ive ever seen with negative reviews from critics. I've seen it twice and plan to go again. I absolutely love this movie. Go see it!!"
    },
    {
      "rating": "8",
      "text": "I'm not much of a war movie fan in general... but I signed on for this and knew (probably) what to expect. Heroic acts,and tearful stressed wimmenfolk, check. Predictable dialog... okay. That said, it was gritty, gorgeous, well-acted and full of well-researched details. Direction and art direction was delicious. And I'm not sure how to describe it.... the intense and wonderfully planned battle scenes were done with intimate lighting and textural details that were just incredibly stirring to watch. Even the interiors with Japanese military were stirring. If you care about action films at all, and don't mind a little big symphony patriotism going on... this is a well-crafted artwork that should not be missed. How anyone could gripe about this in terms of content and a little romantic vibe compared to all the schlocky sci-fi and superhero remakes out there is really beyond me."
    },
    {
      "rating": "10",
      "text": "Excellent, accurate depiction of the battle of Midway would give 8 but to balance intellectually challenged people who went for historic movie and ended up disappointed because they expected something else I'm giving full 10."
    },
    {
      "rating": "9",
      "text": "I was mighty impressed with this movie. Some would call it old-fashioned but instead I would label it “classic” as it harks back to the likes of Twelve O’Clock High and the John Ford war movies (Ford is a minor character in this movie as he shot documentary footage during the battle of Midway). Emmerich doesn’t try to be flashy. He tries to simply tell the tale as historically accurately as possible. That lack of flash pays off because anyone watching the battle scenes can only marvel at the bravery of the young men who put their life on the line amidst the hail of artillery fire coming their way. The critics (again!) got it wrong with their bad reviews. Highly recommended."
    },
    {
      "rating": "6",
      "text": "Midway is not your typical historical action movie. It tries to resemble old glories and strives to give the spectator a good representation of the historical facts that happened before the Battle of Midway.It is certainly BETTER than Pearl Harbor, but it's sluggish on most of the scenes before the actual battle. There are many characters involved so you have to keep your attention up and running, especially if you are not a history buff or you do not know what happened in the Battle itself.The air battles are good, but sometimes, especially in the Pearl Harbor introduction, feel ARCADEISH and GAMEY. But the graphical representation of a task force at sea seems to be taken directly from photographs of the era.Dive bombing attacks are done really well but exaggerated in some points due to drama and script requests.Midway, in the end, is a DECENT war movie, it has the taste of old glories with a side of modern quirks. Does this save the movie ?Nope. But it's 'fun'. Definitely not for the historical buff, but it's ok."
    },
    {
      "rating": "8",
      "text": "It's similar to Pearl Harbor but with better graphics, dialogues, and a more neutral aspect.The tension, sound effects, atmosphere helped me to feel like I'm actually in the warzone.I've watched it in a cinema so your experience might be different if you watch it at home."
    },
    {
      "rating": "8",
      "text": "I don't know why so many bad reviews - I really enjoyed it. Ok, I might get critics reviews but so many negative ones from users. Especially as on other sites higher reviews so weird. But to me I enjoyed it and I thought it was nice it also showed Japanese side too. Maybe only minus it tried to show most of the characters involved and didn't show too much of just one to get too emotionally attached? besides that all was nice"
    }
  ]
}