{
  "id": 3376,
  "title": "Mighty Morphin Power Rangers: The Movie",
  "starring": [
    "Jason David Frank",
    "Steve Cardenas"
  ],
  "runtime": 96,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction",
    "Fantasy"
  ],
  "description": "Six incredible teens out-maneuver and defeat evil everywhere as the Mighty Morphin Power Rangers, but this time the Power Rangers may have met their match when they face off with Ivan Ooze, the most sinister monster the galaxy has ever seen.",
  "releaseYear": "1995",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pcLbHqs80dchv0byHivhdwHKEup.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.0,
    "ending": 5.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Laughably GoofyWith awful acting, cheesy as hell dialogue, and effects that look like a PS1/N64 cutscene, Mighty Morphin Power Rangers: The Movie is a terrible yet hilarious film that’s “So bad, It’s good”"
    },
    {
      "rating": "6",
      "text": "Okay, if you forgive the banal dialogue and the plot contrivances, plus the fact the film tends to become silly and cheesy, it is really mindless fun aimed at kids. Yes the script is weak, and the story is suggestive of an extended TV episode, and does get very silly at times. Despite all this, it does have a sense of fun, and not as bad as the rating makes it out to be. The music is good, and an unrecognisable Paul Freeman as the villainous Ivan Ooze is surprisingly good, with some excellent delivery of the film's best lines. Ooze is not only scary but incredibly funny as well, and Freeman the great actor he is nailed that on the head. The performances on the whole are decent, certainly not Oscar worthy material, and there are some well staged fights, even if the effects are nothing special. I will confess I don't like the TV show that much, but despite the failings that this film has, it is fun to watch. 6/10 Bethany Cox."
    },
    {
      "rating": "10",
      "text": "Great kids movie. I loved it when I was little. Some movies can only be appreciated if you grew up with it."
    },
    {
      "rating": "6",
      "text": "Ahhh… my childhood, I watched this movie and I found it very enjoyable. The movie is very stupid, weird, cheesy, and sometimes makes no sense in the laws of physics, but that’s why I love this movie, It’s good for laughs and nostalgia."
    }
  ],
  "recommendations": [
    "megamind",
    "fantastic_four",
    "monsters_vs_aliens",
    "the_green_hornet",
    "shazam_fury_of_the_gods",
    "peter_rabbit",
    "journey_to_the_center_of_the_earth",
    "the_three_musketeers",
    "sherlock_gnomes",
    "the_pacifier",
    "bedazzled",
    "aquaman",
    "scooby_doo_2_monsters_unleashed",
    "deadpool",
    "hercules",
    "dolittle",
    "pitch_perfect_2",
    "oz_the_great_and_powerful",
    "robots",
    "van_helsing",
    "alvin_and_the_chipmunks",
    "the_mummy",
    "guardians_of_the_galaxy",
    "deadpool_2",
    "this_means_war"
  ]
}