{"id": 2600, "title": "Mile 22", "starring": ["Mark Wahlberg", "Lauren Cohan"], "runtime": 95, "genre": ["Action", "Thriller"], "description": "An elite group of American operatives, aided by a top-secret tactical command team, must transport an asset who holds life-threatening information to an extraction point 22 miles away through the hostile streets of an Asian city.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/2L8ehd95eSW9x7KINYtZmRkAlrZ.jpg", "categories": {"plot": 4.0, "acting": 3.9285714285714284, "ending": 4.769230769230769, "soundtrack": 5.0, "cinematography": 3.25, "familyFriendly": 3.0, "funny": 3.3333333333333335, "action": 4.512195121951219}, "reviews": [{"rating": "3", "text": "Cretinous drivel.Poorly plotted.Poorly delivered.Mark Wahlberg's character and performance are ridiculous.In no way do the special-ops or oversight characters seem genuinely professional.Attempts to generate human interest are lamely cliche in the main.This is one of those times when the critic score is more realistic than the user score.The twist at the end wasn't bad but was unsatisfying.Meh...-ccs"}, {"rating": "3", "text": "following the wrong directions..Mile 22Mile 22 is a plot driven mind-numbing action feature with an agenda of an \"in and out\" missions that all goes horribly and expectedly wrong. Wahlberg's last few unstable features corners him to shake Berg's magic hat and draw out the card from it but unfortunately this time, it isn't the card that anyone was seeking for, not even the makers. It inherently gets difficult to rub on a genre that is already almost explored in each way, and addition to that when you feed the audience a wafer thin concept and expects them to be blown away by the blazing barrels; it's a bit much. Not only does the feature surfs around the surface, the characters that it forcibly installs is just pathetically one-dimensional. One of the primary reason why it fails on levels, is its antagonist, which is not kept under any shade but is just non-existent, leaving the audience with the stakes that are all hoax and all distraction. The anticipated twists and turns which are mundane in such genres, is so independent from any of the incidents occurred in the feature, that it nullifies itself; the viewers couldn't care less. It doesn't have any circle that comes around or makes sense, nor any arc or gist to stand on the self-created slippery ground. As much as exciting it is to experience sharp sound effects, its heightened version latter, shucks it all way. A decent background score or cinematography is pure myth in here, although the camera work is intriguing and convincing whose credit goes to Berg's experience. The choreographed action sequences are enthralling with all the actors working hard and investing all their chips in, especially Uwais who easily is the highlight of it. Berg's world in here seems like the first draft of the script, where his weaving of the structure in front of the audience takes out every inch of the thrill that was about to hit them. Wahlberg is annoyingly loud and disappointingly unstable in his portrayal where no supporting cast like Cohan, Rousey and Malkovich, is supporting him. Berg; the director, still needs some work to do especially to work with his editing department, since all crisp is purely hazardous. Few action sequences and sharp sound effects are the only high points of this sinking feature. Mile 22 has a long way to go, probably more than it titles for, but in the end it too wouldn't matter since they are following the wrong directions."}, {"rating": "8", "text": "Love the actors, very good action.Story is ok but hey its an Actionmovie.Thanks Peter Berg"}, {"rating": "3", "text": "Mile 22 starts out with a bang and has an excellent surprise action sequence - however after that the story becomes less enticing.  Mark Wahlburg's character for whatever reason is very annoying and can't seem to keep his emotions in check.  You would expect a more level headed individual for a person in his position but that unfortunately is not the case.  Wahlberg's character comes off as a narcissistic, emotionally unstable lunatic who is constantly snapping a Lance Armstrong type bracelet against his wrist.  Both his personality and the bracelet snapping become more and more annoying as the movie progresses.  What makes this movie somewhat watchable is the mind numbing action sequences but with nothing else to provide beyond that - I have to give a 3/10."}, {"rating": "10", "text": "I just saw this movie which I can’t remember the name but it has Agent Marky Mark in it and a girl who looks hot but she’s dangerous and can’t wear makeup but if she was in a makeup role she probably could maybe be as hot as the Black Widow girl. Also that girl wrestler who’s trying to act now who should just keep wrestling.They work for a secret organization that’s more secret than the CIA that’s called the ADHD.The story is there’s hardly any killing for the first two minutes and then lots when they go out and get in cars and trucks and fight guys on motorcycles. The hot girl has phone calls with a mean husband and wants to talk to the daughter but he won’t let her but that part goes away. The big boss is cool because he’s called Mother (the guys are called chess pieces and then children) and he has all these cameras that say their heartbeats and stuff and he’s super cool because he has bobble-heads that go into a special case and he wears old-fashioned sneakers.The style is sometimes Mother says philosophy and I think Marky Mark does too but he talks really fast and lots so I couldn’t tell. And Marky Mark always snaps a rubber band and the bad guy is always touching his fingers to his thumbs and that was the only dumb part of the movie that I wish they didn’t have because I wanted it to stop all the time.No scene lasts for more than five seconds so the movie goes by really fast and I won’t give away the ending but I will say what a surprise.The only thing I couldn’t figure out was why there were no policemen or ambulance men or firemen. And I don’t think there were any people on the street. But to sum up WOW GREAT MOVIE TEN STARS UP."}, {"rating": "7", "text": "So many professional critics give \"red\" ratings while their colleagues rate the same movie \"green\".  Users almost always rate movies with the higher critic scores because we score on whether we had a good time watching for the most part.  Yes, I had a hard time following the close-up, rapid-cut hand to hand combat scenes, but overall the story and the characters were engaging and I was not disappointed."}, {"rating": "9", "text": "This was a decent action movie. The trailers did not ruin it.The pacing was generally good. The critics panned this for no reason."}, {"rating": "10", "text": "One hour and thirty minutes of pure fun and adrenaline. Love Mark and the fantastic Rhonda. Movie is quick, slick and “oh what a rush.”"}, {"rating": "5", "text": "Mark Walhberg is extremely annoying and misogynistic in this movie, like he's trying to take Mel Gibson's place as biggest A-hole in Hollywood.  He seems to yell in a very self-indulgent way at mostly female characters throughout the movie and seems to just like to hear hear himself spout long sentences.  If he wasn't such a turnoff the movie would have been more tolerable IMHO."}, {"rating": "6", "text": "Not nearly Peter Berg's best effort but I was still entertained. Overall a low to solid 6 a B-."}, {"rating": "3", "text": "With little to none editing skills, this film could be the worst ever made by Berg."}, {"rating": "3", "text": "Just came back after watching Mile 22 and boy if it wasn't ridiculously bad.This movie sticks to the 1998 mentality of action movies which doesn't work today anymore. With ridiculous and weak plot and hyper aggressive protagonists. For starters, they show us how Mark Wahlberg has 'special abilities' and thus joined The Overwatch, yet, none was shown in the movie. Did I miss something here?Lauren Cohan who's divorced with a daughter can't hold her emotions and behaves like a teen which is so silly since she's supposedly a trained agent. The f-bombs are everywhere among the team at every sentence and Wahlberg should talk aggressively to make you feel more intense even for the unnecessary lines.About the city the whole film was based on, it was supposed to be in some South Eastern Asian country. Instead, they decided to take it in Columbia. Like seriously? Just to save some budget?Won't go through all the silly plot like 7 motorbikes could easily take down a fleet of \"The greatest country in the world\" by surprise, or the ridiculous scene where they needed a plane to take down a car blocking the way to the runway, or the implied political correctness statements by female agents, one by Cohan saying \"You think if I'm a woman I can't hurt you?\" to Uwais and the female programmer who says \"Most code is written by men, so I can see this code is written by a woman.\" This is the most stupid sentence I've heard. As a software engineer myself, you can't \"distinguish\" a code if it's written by a man or woman, and no, you can't identify the ethnicity either. It's not a poet or a literature piece. It's like saying this math formula was written by man or woman. But I can say this movie was written by a 12-year-old!Sure, the 'twist' in the end was so funny and bad. It should be a shame for the intelligence of the US of A if such incident happened in real life."}, {"rating": "2", "text": "If you're in the mood for a mindless action movie then find something else because Mile 22 is absolutely awful. CIA agent Marky Mark and friends team up to escort a police officer with sensitive information out of the country before the bad guys get him. Mile 22 is the boring escort mission in your standard video game. Dull, predictable and if given the choice you should skip it.James Silva (Mark Wahlberg) has quickly become one of the most hated movie characters in movie history. I wanted to jump into the screen and punch him in his smug face just so he would shut up and that was just within the first fifteen minutes. I feel like the only reason they cast Iko Uwais is to remind us of The Raid and maybe the action will make up for the laugh out loud script and the mediocre cast. The action might have made up for it but unfortunately it was near impossible to make out anything that was happening due to the poor editing/shaky cam. I cannot understand the reason behind this because with a 16 rating it wasn't to hide the violence it was just a mess. I'm a fan of The Raid, how could you not be, yet Iwo Uwais in Mile 22 was completely wasted. A simple idea that in the right hands could have been a crowd pleasing action flick. Even with the short running time it still felt dragged out and bland. Not recommended, definitely skip this one."}, {"rating": "3", "text": "A film with Peter Berg directing and Mark Wahlberg starring, normally a true story and normally brilliant as well but this is not. Not a true story either. The opening moments I thought wow what a start, then it all started to fall apart. Very violent, stupid amounts of strong language and a silly story, with a silly ending, unfortunately not a film I’ll be owning anytime soon, at least it only cost 90p to rent."}, {"rating": "7", "text": "ตอนแรกก็ไม่คิดจะดูหรอกเพราะโดนด่าเยอะมาก 555+พอดีเราได้สิทธิ์ตั๋วฟรี จากสะสมแต้มฝาน้ำตรา Singha Drinking Water อันนี้ขอขอบคุณมากจิงๆแต่ไม่รู้จะดูเรื่องไรดี เลยจัดเรื่องนี้ไปก่อนเลยความรู้สึกหลังดูแย่ไหมก็ไม่คอยแย่เท่าไร ซีนขู๊เดือดตลอดเกือบทั้งเรื่อง Iko Uwais คือดีงามมาก ทั้งหน้าตา หุ่น ลีลาบู๊เต็ม10 ไปเลยเดือดโหดเลือดสาดไปอีกกกกแถมตอนจบมีหักมุมอีก เหวอแดกสิรอไรตอนแรกก็เออ คงคิดยิงมันส์ กำจัดได้ก็จบง่ายๆแต่ไม่เลยแถมมีปูเหมือนจะมีภาคต่ออีก 555+ข้อเสีย- รำคาญบทของ Mark Wahlberg พูดมาก ขี้บ่น ไม่รู้คิดยังไงเอาคนป่วยไปโพลาร์ มาเข้าหน่วยเนี่ย น่าจับคู่กับอิแยลลี่ ใน หมู่บ้านสราญแลนด์ ศึกรักข้ามรั้ว มาก ไปโพลาร์พอกันเลย 555 ถึงมาร์คเท่ก็จิง แต่บทนี้ไม่ไหวเลยทั้งขำทั้งโมโห อ่านซับไม่ทันจนร้องขอชีวิตเลย- การตัดต่อโครตวัลนาบี ซีรีย์เรื่อง Sharp Objects มากที่ตัดฉับไวๆสลับไปมา ถ้าอยากตัดแบบนี้ แล้วออกมาไม่ดีคือพังมาก โครตพังบอกเลย สรุป ใครที่คิดมาดู ข้อแรกข้อเดียวคือทำหัวให้โล่งให้สุด แล้วดูเอามันส์อย่างเดียว จบ... (ปล.ถ้าเป็นติ่ง Iko Uwais คุ้มตังคุ้มเวลาแน่)"}, {"rating": "2", "text": "Mile 22 follows James Silva (Mark Wahlberg) and his team of covert operatives as they attempt to get a man, who has valuable information which could stop potential future terrorist attacks, out of the country. This film is terrible. Mark Wahlberg's character is quite possible the most arrogant and poorly written \"intelligent\" protagonist I've seen in a long time. My guess is that the writer wanted him to come off similar to how Mark Zuckerberg does in The Social Network: a super smart *******, but instead he comes off as a dude who thinks he is smarter than he actually is and just constantly yells at people. Lauren Cohan's character is also not written very well and her anger issues (spawning from her messy divorce) seem drastically overdramatic. The story of Mile 22 isn't anything to write home about, either, as the entire film is about them trying to extract a police officer who says he has the codes needed to unlock a hard drive that has the locations of materials that could be used for terrorist attacks. That isn't really the problem, though, as my main issue with this film's story is how it tries to get the audience to play the guessing game of \"who's the bad guy\" while painting it on the wall in red paint. There's a huge reveal at the end where I'm guessing they thought the audience would be thinking \"holy cow\", but instead I was just severely disappointed. The editing in this film is also absolutely atrocious. In some fight scenes, there would be about three cuts between when someone goes to throw a punch and when it actually makes contact. It's completely disorienting and while I could still keep up with what was happening, it was honestly just too much. It got to the point where the constant cutting was seriously annoying me. The best thing about this film is the somewhat realistic gun play. That's basically the only positive thing I have to say. Overall, this is one of the worst films I've watched in a long time. And I say this because generally whenever I give a film a very negative review I can at least say that it was a competently made film, but I can't say that for this one. It's bad all around."}, {"rating": "0", "text": "This is the most convoluted disjointed unbelievable clown show I ever saw.  Not even Mark Wahlberg could save this one.  I'm certain that he is embarassed on his way to the bank."}, {"rating": "3", "text": "if ur lookin for: a good \"action movie\" - 3/10if ur lookin for: how not to do a action movie manual - 10/10"}, {"rating": "8", "text": "Literally was on the edge of my seat from the very beginning... & that ending... Maaaaaaan, if they don't have another film, I'll be mighty disappointed."}, {"rating": "0", "text": "disappointing Mark!!! Do not choose the wrong way that Cage and Reeves entered. Siberia and this one are the worst movies of the year!!!"}, {"rating": "3", "text": "This was one of the more disappointing movies I have seen in awhile. It lacked in character development, and whenever a character died the only thing you thought was \"wait, who was that charter, what was their name?\" And they truly wasted their best asset in this movie. An no, I'm not talking about Mark Wahlberg or Rhonda Rousey, I mean Iko Uwais. Best known for his work in the foreign movie The Raid. He is an amazing martial artist and every scene he was doing his thing, they ruined with many cut scenes and \"shaky\" cam footage. They took these ok to solid action movie actors, added a plot done many times before, threw a lazy \"twist\" at the end, and turned into what should have been a straight to DVD movie."}, {"rating": "6", "text": "Mark Wahlberg teams up for the 4th time with director Peter Berg. They've made some great action films together (Lone Survivor, Deepwater Horizon & Patriots Day). This is their least successful collaboration, but it's still got some solid physical engagement. Wahlberg plays the leader of a highly-specialized secret ops team that's assigned to transport an \"asset\" 22 miles thru a highly inhospitable city. There are slammin' fights (with the best featuring Iko Uwais), destructive car chases and high-kill shootouts. On the down side, the script is cluttered with too much fast, impenetrable chatter, attempting to sound like Aaron Sorkin dialogue without the smarts. People don't see this genre for the words and there's sufficient violence to satisfy fans."}, {"rating": "4", "text": "A toxic protagonist kills the entire thing. I could have dealt with confused narrative that can't decide if it wants to be a nuanced look at the lives of paramilitary operatives or a first-person shooter game. Even the subpar editing everyone keeps talking about didn't bother me. I liked the action for its barrage of blood and gunfire. Mile 22 was even nice enough to include Iko Uwais kicking butt all The Raid style. I just couldn't enjoy any of it because front and center the entire running time is Wahlberg's character James Silva verbally assaulting friends and foes alike.You know you have a problem when everyone you come into contact with wonders what your major malfunction is. They toss around theories of narcissism or some kind of dissociative disorder, but I find myself siding with the character that said \"he's just an *sshole.\"That's it. That's really all I can say. I've sat down to write this review I don't known how many times now and have hit a roadblock every single one of them. The protagonist's presence is so overbearing that it's hard to notice anything else in the movie. Other than the bloodshed that is. Which means that Mile 22 wastes both Iko Uwais and Lauren Cohan. Mark Wahlberg and Peter Berg's winning streak has come to an end, and it's all thanks to one terrible lead character."}, {"rating": "5", "text": "This was actually a pretty decent, watchable movie. The cast was good, Marky Mark was great and the story was solid. What the film suffered from was terrible editing that made all of the action scenes look incredibly sloppy and the borderline criminal underuse of Iko Uwais. If someone went back and re-edited this movie, It would have been a lot better."}, {"rating": "5", "text": "It's a weird movie. You go in expecting your average action packed romp and instead you get half a movie spent portraying the least likeable characters in the whole history of movies and the latter half with the by the number action you were promised. But the whole thing feels very detached since you end up not caring about anybody and most likely just wishing for this rag tag band of aholes to die..."}, {"rating": "2", "text": "Danke für dieses Actionfeuerwerk ohne Sinn und Verstand. Wahlbergs Charakter ist so blass wie ein Geist. Die Story eiert vor sich hin und man ärgert sich so einen Scheiß angekuckt zu haben."}, {"rating": "7", "text": "A good action flick that just works. The ending is not amazing, and the plot is nothing special, but it delivers great action sequences. The Walking Dead's Lauren Cohan is interesting to see as covert operative. Rousey does an ok job with the few lines she gets. Malkovich has a weird kind of carpet like hair that's not his. Bottom line: it works."}, {"rating": "7", "text": "A spy \"thriller\"action movie enveloped into interrogation. The cinematography overcut and shaky, but cuts are placed between punches, not instead of them, like in the current usa \"cinematography\". Writing is as inaccurate with technology and fake russian as old action movies of the golden age. The story is okay and the plot is good, though. The characters are nice and performances fit perfectly."}, {"rating": "9", "text": "Thoroughly enjoyed it. Relatively simple premise with some terrific action set pieces. Good all-round cast. I love the Berg, Wahlberg combo. Looking forward to the sequels!"}, {"rating": "7", "text": "I found this movie a great action movie. Maybe some things were lacking but still interesting to watch in general."}, {"rating": "4", "text": "\"Mile 22\" was a bit of a loose film, although the story was good, the characters and their performances were very bad, the location in the Bogotá movie is not at all like a South Asian city, and photography is very bad with many cuts of 2 seconds that are tiresome, the director Peter Berg took out the worst movie of his career perhaps near Battleship, and the worst thing is that it comes with his acting formula, Mark Wahlberg who acted badly in the film, but the good thing is that He thanked my country Colombia for allowing him to make this film."}, {"rating": "4", "text": "12 years ago when Mark Whalberg got an Oscar nomination things seemed to look good for him but apparently his plans were different and he only got mediocre films after that, until 2010 when he made The Fighter. He got Golden Globe nomination and good reviews for his work. Once again everything seemed fine but he did not learn and since then his career has come to less in films that haven't done anything for his career except to swell his wallet.Now he delivers Mile 22, his fourth consecutive collaboration with director Peter Berg, ironically the quality of his collaborations has been decreasing and definitely Mile 22 is the worst of all, especially for the way he takes its style and narrative rhythm of the book by Paul Greengrass and his Jason Bourne trilogy.It's clear that Mile 22 has a very different approach to the other collaborations of Wahlberg and Berg, especially taking into account that the other three are based on real events, but undoubtedly Mile 22 points to a very basic entertainment and therefore more simplistic.It's a thriller of far-fetched and frenetic action that will probably be liked by any action fan who only looks for bullets and explosions but those who look for something more resonant will not find it here. It's not necessarily bad, but it definitely makes you wonder if it was worth it and in my case it wasn't."}, {"rating": "7", "text": "Maybe I am weird, but I think it was refreshing film, better than most current action films with uncommon plot. Ronda and other actors could be used better, but generally, I was satisfied."}, {"rating": "4", "text": "With its tiresome storyline, \"Mile 22 \" Does not convince us even with its considerable action scenes. Slow, without much base on something central (objective) to worry about. Its high point lies in the conclusion where they bet everything to make the film reasonable, risking the little dignity that the film still had. Hasty. 4.2/10"}, {"rating": "3", "text": "Até salvaria umas lutinhas e uma sequências de explosões que não arranham o super-homem da vez, por conveniência... Mas \"só\" pelo personagem do Mark Wahlberg ser extremamente insuportável e histérico, e o plot do filme ter saído de um episódio de série com alto orçamento, merece o lugar onde vão parar os filmes com 3 estrelas"}, {"rating": "5", "text": "The film itself it cool in how it portrays a black op like team. How the small detail of them signing “resignation” papers to the CIA in case they get caught so that the CIA can deny they work for them. Cool things like that and the drones/IT parts are simple but really show how insane our “heroes” are. No spoiler here but Mark is a crazy a**hole. The beginning is fun with some cool shots and wicked modern-day technology and modern tactics that really show off how intense an operation, like the beginning one is. Mark has some one liners that are kind of funny but really, he is just a massive d***. He has this problem where he thinks too fast and to slow that down he snaps a rubber band on his wrist. The pain makes him come back to our level, cool idea but in the end, you get annoyed with the snap. If you put Tom Hanks Captain Miller from SPR and give him this tick. I would love that, but since Mark is not nice and you don’t care/root for him it doesn’t work out as well. The action is cool but very shaky. There is no John Wick type action scene. By that I mean that the action is not shot in a wide angle with minimal cuts just pure action. This doesn’t have that; a lot of cuts happen for no reason."}, {"rating": "7", "text": "Good action scene, good characters, simple story, apparently you'll get a little bit angry about the ending. A good trailer and an OK movie."}, {"rating": "3", "text": "Some absolutely awesome choreography and action trapped inside one of the most poorly shot films I've ever seen. Quickshot scenes that jump forward, backward left and right, make me think the target audience for this was a goldfish. In all actuality it's a sleight of hand trick to throw one off of a plot twist that may have the honor of being the most obvious twist in film history. It's just too bad no one was there to say \"hey maybe we should deliver a cohesive story and give the audience some some credit for thei intelligence\". The closing song for the film sums it uo perfectly"}, {"rating": "6", "text": "Esta buena la acción, y el final la salva, pero en general la historia es mala y predecible. Parece q a todos les pagaron por salir 5min."}, {"rating": "7", "text": "Marks team goes down one by one in this delivery mission. awesome twist ending thats worth watching."}, {"rating": "0", "text": "The camera guys really suck. The whole movie is lame, boring, doesn’t really make sense. Not worth watching."}], "recommendations": ["infinite", "jason_bourne", "vantage_point", "the_old_guard", "the_ice_road", "the_november_man", "jolt", "the_mechanic", "furious_7", "miami_vice", "angel_has_fallen", "taken_3", "haywire", "kingsman_the_golden_circle", "sabotage", "mission_impossible_ii", "xxx_return_of_xander_cage", "free_fire", "salt", "the_commuter", "london_has_fallen", "skyscraper", "the_taking_of_pelham_1_2_3", "max_steel", "the_kingdom"]}