{
  "id": 3115,
  "title": "Million Dollar Baby",
  "starring": [
    "Hilary Swank",
    "Clint Eastwood"
  ],
  "runtime": 132,
  "genre": [
    "Drama"
  ],
  "description": "Despondent over a painful estrangement from his daughter, trainer Frankie Dunn isn't prepared for boxer Maggie Fitzgerald to enter his life. But Maggie's determined to go pro and to convince Dunn and his cohort to help her.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2ti3l1OeB8G94yyqfAI7nmMZUbA.jpg",
  "categories": {
    "plot": 7.76,
    "acting": 7.59375,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 1.6666666666666667,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Swank, annoying as she is, uses everything we hate about her to plow into the the role. There'll be talks about the great performance she delivered. It wasn't great. The role just suited her. Eastwood and Freeman, on the other hand, are phenomenal."
    },
    {
      "rating": "10",
      "text": "Best movie  of all time. Greatest Acting by the main 3 actors, best directing in years, amazing script, completely absorbing."
    },
    {
      "rating": "9",
      "text": "Strong and Powerful! A touching story proved with sweat and pain, and the same time - with beauty and grace of boxing goddess! This sport-drama is one which surely leaves a warm spark into our hearts!"
    },
    {
      "rating": "9",
      "text": "There are few movies that can tug at me emotionally. But This one put me on the verge of tears. You fall in love with Swank and her character. The way she compliments the performances of Morgan Freeman and Clint Eastwood just creates a powerhouse of a movie. Well done. Boxing is a sport that tends to show up in movies a lot but that is only because it has so many metaphorical connotations and digs at our own willpower to be fighters in our own lives, which is personified in this film. It's a different angle considering the fighter is a female. It gives more room to broaden the audience and be a significant and entertaining stand point for both guys and girls. It confronts the conflict of families, what makes them and what breaks them. It brings reality to the cost of chasing a dream. Watch it. The end will make you want to strangle someone, or just cry, one of the two."
    },
    {
      "rating": "10",
      "text": "Let me first qualify that I've done many reviews on here and never given anything a 10. I save 10's for the rare movie that goes beyond being a movie. A movie that actually touches your soul. In addition to having tons of heart to it, the story, acting, directing and score are all first rate as well. Anyone who rates this film less than an 8 clearly has serious personal issues. Films don't get much better than this."
    },
    {
      "rating": "10",
      "text": "Million dollar baby is a story about a female boxer who decides in her early 30's to star boxing.She goes to a gym to exercise and there she finds a coach. Million times if you see that film a tear will come out from your eye. A depressive sport movie that it is really touching and it shows friendship and love. Million dollar baby also shows how difficult is for a person that loves you to decide whether you are going to live or die. Hillary Swank was amazing in that movie. I don't know how she did that. I actually thought that i was feeling what she was feeling. I don't understand the negative reviews and I don't want to spend any time telling my opinion for them and i simply understand that some people don't have a heart. That's all I have to say for that masterpiece."
    },
    {
      "rating": "10",
      "text": "A brilliant masterpiece! For me, this is one of the best films of the decade. This is the film that Clint Eastwood will be remembered for. Such a great, touching story. Hilary Swank and Morgan Freeman are simply stunning!"
    },
    {
      "rating": "8",
      "text": "Clint Eastwood's \"Million Dollar Baby\" illustrates Hilary swank (Beast performance) as a under-seen boxer emerging to her fame and ultimately, to her downfall. As expected from Clint Eastwood, the film is filmed and written richly and immensely. It certainly is one of the year's best."
    },
    {
      "rating": "4",
      "text": "Still amazes me that this got so much attention. Clint Eastwood is a great filmmaker and has made some masterpieces, but this movie was sluggish and simply too predictable. I love the surprises in Unforgiven and Gran Torino and several others, but this one was not even close to Clint's best. I even enjoyed J. Edgar better than this film."
    },
    {
      "rating": "5",
      "text": "Bottom Line: Best Picture?  Iâ"
    },
    {
      "rating": "3",
      "text": "OVERRATED! This movie gets one point each for the dedication of Eastwood, Swank, and especially Freeman. But come on! The boxing throughout is portrayed in a very superficial, disingenuous manner, and I am by no means a boxing fan. A dozen consecutive first round KOs? Why not aim for a little realism here? And the \"twist.\" Let's just say that wouldn't happen, and if it did **SPOILER ALERT** they'd hang the \"scabby kraut\" from the rafters. Did Maggie really \"not win\"? She was felled by A Cheap Shot After the Bell. Hello DQ, followed by lynch mob.\rThe title character's family is the most ridiculous caricature of a selfish white trash family. Give them some kind of dimension, ANYthing. Instead, they're slaveringly selfish Mickey Mouse-emblazoned louts with thick drawls and thicker torsos. Ho hum."
    },
    {
      "rating": "4",
      "text": "One of Eastwood's worst movies, and one of the most overrated films in recent years. The plot was not orginal as Indira said. The film was formulaic and cliche ridden."
    },
    {
      "rating": "3",
      "text": "I thought that this film was well-made; beautiful direction from Clint Eastwood and terrific performances from everyone in the cast. However, I had some problems with some of the material. The depiction of poor people in the film was ignorant and offensive; Haggis seems to think that all poor people are white-trash slobs who don't even care about their loved ones. Also, the film seems to think that one is better off dead than paralyzed, I suggest that Paul Haggis views \"The Diving Bell and the Butterfly,\" the best film of 2007, and a much finer picture than this one."
    },
    {
      "rating": "0",
      "text": "Maudlin garbage. The worst example of emotional manipulation I've seen in a long time. As the tragedies piled on, I had a hard time keeping from laughing. The only excuse for this kind of contrived plotting is if it were actually true."
    },
    {
      "rating": "4",
      "text": "Good plot premise BUT...both Morgan Freeman and Clint Eastwood \"mailed it in\". They trotted out two-dimensional cliches of their characters. I doubt if director Eastwood was critical of any scenes either of them played in. Hilary Swank didn't look like even a woman boxer. The best performances were the actors playing the cheezy relatives playing for dough even as she realizes there is little hope. Eastwood should have been more self-critical & Freeman should have put more into his role. A mediocre effort from a talented ensemble."
    },
    {
      "rating": "2",
      "text": "Sorry, this is totally unbelievable. What a sentimental mess from beginning to end. I am trying to write something nice about this, but Mr Eastwood, I love you and therefore I forgive you for this."
    },
    {
      "rating": "0",
      "text": "If there were a prize awarded for the largest collection of whopping fat cliches in a movie, this maudlin mess would win hands down over any movie in recent memory. It would also break the needle off the sentimentalometer. It's all served up with the straightest of faces, a classic recipe for unintentional comedy. Yes, that's right, when maggie somehow manages to suffer a broken neck at the the hands of a malicious stool, i laughed. Whilst all around me, the sound of sniffling noses signalled breaking hearts by the score. perhaps someday when the impenetrable eastwood mystique finally begins to dissipate, people will awaken as if from a dream and say,"
    },
    {
      "rating": "0",
      "text": "came out of this movie furious -- and I'm a Clint Eastwood fan........\r This movie is just an overbearing piece of propaganda for sanctioning euthanasia -- or as it is commonly known -- MURDER.....\r Life ain't fair, as this movie graphically illustrates,,,,,but murdering the unfortunate among us just makes it worse....\r Yet another example of a film suggesting that \"situational ethics\" trump \"absolute truths\"\r The Hollywood loonies could do us all a favor by taking some of those \"painkillers\" that Eastwood gave to Swank at the end of this disgusting film..."
    },
    {
      "rating": "3",
      "text": "Great actors and director... interesting story... terrible ending! I was looking forward to renting this move and enjoyed it right up to the final five minutes - it bothers me that murder is Ok if its done under the right circumstances or for the right reason."
    },
    {
      "rating": "0",
      "text": "Truly horrid film. The acting is contrived, the plot is unbelievably sappy and the concept overdone."
    },
    {
      "rating": "0",
      "text": "The worst boxing movie I have ever seen. In fact one of the worst movies ever made. You don't have to work too hard now days to fool people. For those who thought it was OK go and watch a proper boxing movie like Raging Bull. The movie was clearly made for, well you know those less fortunate in society."
    },
    {
      "rating": "0",
      "text": "Along with \"Lost in Translation\", one of the worst films of 00's. Clint's recent work has been crassly over praised. This film is sentimental, ridiculous and formulaic."
    },
    {
      "rating": "4",
      "text": "Really not as good as it is described. Only in the mainstream Oscar industry it is. Compared to a independant film about euthenasia, million dollar baby is nothing."
    },
    {
      "rating": "2",
      "text": "The most depressing film I've seen since Mystic River.  MR was basically unrelenting in keeping my mood low but Million Dollar Baby was good for about the first 3/4's until the main character becomes a quadrapelegic, then has her legs amputated, then wants to die but can't get any assistance so she bites her tongue to try to bleed to death, then is saved but keeps trying to kill herself, then finally succeeds in getting help to die.  Fortunately, I survived this movie and learned that I will have to do more thorough research before going to a film."
    },
    {
      "rating": "3",
      "text": "Simply put, this movie was just not good. I was so excited when it came out on DVD because I felt left out during the Oscars. Now that I've seen it, I think people say it's good because the \"right\" people say it's good (Hollywood is, after all, an industry of followers who can't form their own opinions). But the \"right\" people have been wrong about a lot lately (Aviator, Sideways, etc.). None of the actors had any depth, the story was too long, and the plot was both unbelievable and predictable. The writers didn't develop the B-line at all (Frank's alienation from his daughter) and Maggie's family was just too exaggerated to be believed. Actually, the only likeable character in the movie was Dangerous! I tried to convince myself that the movie was good-- that perhaps I was just distracted or apathetic-- but turns out, my gut instinct was right: Million Dollar Baby is another Hollywood miss that got backed by the right people because of Clint Eastwood."
    },
    {
      "rating": "0",
      "text": "will i watch million dollar baby or will i stick a needle in my eye. Its a difficult decision but i think il go with the needle. Why anyone would want to watch this miserable pile of crap is beyond me but the taste of the unwashed masses generally does. Avoid like the plague"
    },
    {
      "rating": "10",
      "text": "Clint Eastwood's best and brightest, a true masterpiece if there ever was one in the realm of sports dramas. Even as the film approaches 14 years, it still is incredibly well written and extremely well acted for its time as well as incredibly touching till the very end. Few films weigh as heavy on you like Million Dollar Baby, its a riveting powerhouse of a film."
    },
    {
      "rating": "8",
      "text": "Clint Eastwood's Million Dollar Baby is undoubtedly one of the best of the 2000s, great direction from Eastwood, great performances from Swank, Eastwood, Freeman and the talented supporting cast"
    },
    {
      "rating": "9",
      "text": "Million Dollar Baby is about a passionate female boxer who wants to make it with the guidance of frankie dunn played by (clint eastwood) clint eastwod also directed this movie and did a great job of it. hillary swank delivers a great performance in this as well as the rest of the cast. dont want to give much away, but this is a just see!"
    },
    {
      "rating": "3",
      "text": "Million Dollar Baby fait partie de ces films qui n'ont qu'un seul but : faire chialer le public ; il n'a d'ailleurs été fait que dans ce seul but avec les 3 petites notes de piano récurrentes qui n'ont pas d'autre but que d'ouvrir les vannes (en grand).A cet effet, le scénario met tous les moyens en oeuvre pour que les vannes restent ouvertes non seulement au bon moment mais également un peu avant, progressivement, et de plus en plus jusqu'à l'inondation finale. Clint en fait donc des tonnes, à la fois dans le pathos et la misère sociale, à faire mourir de honte les Misérables de notre grand Victor Hugo national.Or, trop c'est trop, on n'est quand même pas complètement con même si son chiale avec les autres, parce que c'est triste, oui, mais c'est clairement exagéré et le mot est faible, très faible. On en arrive à un tel point que lorsqu'ils coupent la pauvrette, on s'esclaffe... la coupe est pleine, Clint, arrête ça déborde ! mais rassurez-vous, on garde des larmes en réserve pour la toute fin.C'est dommage d'en avoir rajouté autant, car la crédibilité est sérieusement mise à mal, y compris lors de \"l'accident\", invraisemblable... Dommage également pour la justesse des sentiments, de cette amitié qui se construit entre la boxeuse et son manager, entre la fille paumée et le vieux bougre. Même qu'on s'habituait au rabâchage de la voix off du barbon Morgan Freeman, toujours prêt à pérorer à la moindre occasion...Le drame, que dis-je, le mélodrame est un genre très difficile et on a vite fait de tomber dans la caricature, ce dont ce bon vieux Clint ne se prive décidément pas à maintes reprises. Encore dommage pour Hilary pas vraiment hilarante sur ce coup mais qui sait rester la plus sobre des trois entre elle et les bonzes désabusés : elle interprète excellement cette ingénue du malheur......malgré les seaux d'eau que lui balance Papy parce que Papy Clint trouve qu'il n'y en a pas assez. Tout cela est gâché, sévèrement gâché alors que pourtant la mise en scène est d'une remarquable précision... j'allais dire \"sobre\" mais avec un scénar' pareil, on repassera.La pleurnicherie à un million de dollars donc... mais qui ne les vaut certainement pas."
    },
    {
      "rating": "10",
      "text": "It boggles the mind that some people cannot appreciate this for the masterpiece it is. Sure, MAYBE some of the events wouldn't have happened the way they did in the movie, but in the end, isn't the only thing that matters the story the film tells? Don't tell me you can't suspend your disbelief just a little bit."
    },
    {
      "rating": "10",
      "text": "GREAT MOVIE!!!"
    },
    {
      "rating": "9",
      "text": "Well written and thought out film that actually addresses some of the issues we see in society today. The score was a little overdone in some places but the general flow of the film was enjoyable and left the viewer to contemplate his/her own issues related to the ending."
    },
    {
      "rating": "8",
      "text": "Nice flow, many genuinely poignant moments. A little pretentious in spots (an east German prostitute boxer who fights dirty, come on), and ultimately enlightened defeatism, but genuinely so. Great energetic can-do performance by Swank."
    },
    {
      "rating": "10",
      "text": "Never hits a false note, never breaks from its melancholy, reminiscent tone."
    },
    {
      "rating": "9",
      "text": "Any movie that can achieve such depth of character deserves greater respect than this movie seems to be getting. There are three major characters all of which are amazingly realistic!"
    },
    {
      "rating": "8",
      "text": "The Academy Awards' jury has a tendency to favour those dramatic motion pictures that feature protagonists' lives opersating on many levels. Million Dollar Baby is the winner of Best Motion Picture of 2004 at the 77th Academy Awards, besides winning three more Oscars including the one for Best Performance by an Actress in a Leading Role, played by Hilary Swank. But for me this movie is chiefly about the anguished life of its male protagonist, Frank Dunn, a senile boxing trainer trying to make amends for his disturbing elusive past. He is guilt-ridden and attends the Mass everyday. He writes to his (estranged) daughter every week, hoping for a reconciliation with her. And we do not have to wait for long until we find out that his other actions are equally unclear. Their motive(s) is/are never described: (1) He is shown as attending the Mass for twenty-three years, but why he keeps pissing off the Father by asking real inane religious questions is never hinted at. (2) What is the reason behind his constant attempt to learn Gaelic? We cannot come close to even guess that. Is it his hobby-horse or is it just another minute revelation connected to his unknown past? Answer for yourself. (3) Why does Frank try to prevent Willie Jones to have his shot, until the latter loses his patience and finally leaves the old trainer ending eight-years of their professional bonding. But one thing ramains clear: Frankie's life experiences really proves that if a life's course is that of his, then indeed \"Tough ain't Enough\". What is required in addition to toughness is endurance-an endurnce to fight with your inner demon, to be able to sustain by grappling with melancholy memories, haunting thoughts and a hopeless existence. Frank Dunn painstakingly manages to do that. What really thrilled me about this movie are not the boxing fights, most of which I believe have been handled amateurishly, but its intense climax. You just quietly (and sadly) watch Maggie's physical condition going from bad to worse, ultimately reaching a deadlock when her existence only indicates a virtual endless death-in-life experience. This calls for her release in euthanasia, which is given to her by Frank thus increasing his own anguish to its highest level. The act leaves Frank alone and despair, gloomy and with probably a single hope to attain absolution, sooner than later. But till that hope sustains, he attempts to find a little peace at \"a place set in the cedars and oak trees, somewhere between nowhere and goodbye. But that's probably wishful thinking.\" This psychologically motivating and emotionally engaging movie is worth a watch. Strictly recommendable!"
    },
    {
      "rating": "10",
      "text": "The Best Film of the Year. On the outside 'Million Dollar Baby' seems like a boxing picture, but it's really a character study of the three characters involved (played expertly by Clint Eastwood, Hilary Swank and Morgan Freeman). Before I saw the film, I thought it was going to be a tacky and sappy girl boxing movie, but it wasn't. I find even after I've seen it, it's hard to convince people the film is not like that, and it's not a conventional formulatic boxing film like Rocky, but that it is something a hell of a lot deeper.  After seeing the film for a second time, I found that it really has no weak points other then being a little slow towards the beginning (which was essential in order to tell the story correctly.) Clint Eastwood not only does an outstanding job directing this soon-to-be-classic, but he also produces the film, composes a spellbinding musical score, and gives his very best screen performance as Frankie Dunn, a down-on-his-luck boxing manager who decides to take on a wannabe female boxer. Morgan Freeman provides us with a quiet yet extremely effective performance as Frankie's long-time friend and partner. Not only does Freeman play this part, but his character narrates the story, so the whole movie is told from this character's perspective. The on-screen chemistry between Eastwood and Freeman is too incredible for words, a chemistry that was only once before seen in 1992's Best Picture winner 'Unforgiven', that was also made by Eastwood. The best peformance of the film obviously comes from Hilary Swank as the average trailer-trash restaurant waitress who's one true passion is for boxing. Swank delivers a tour-de-force performance, and along with Eastwood it's also her best on-screen acting performance. Ms. Swank knows her character very well, and it shows that she didn't just memorize the lines of the character, but she embodied the character. Overall, when you see the film you don't see the three actors, but the characters they portray. 'Million Dollar Baby' is my choice for Best Picture, along with the Oscars for Best Actress, Best Supporting Actor, Best Director, Best Film Editing and Best Original Score. I give\r'Million Dollar Baby' an 'A'."
    },
    {
      "rating": "10",
      "text": "Incredible Movie. Acting first rate."
    },
    {
      "rating": "10",
      "text": "A bitter movie, Million Dollar Baby shows, in a direct and merciless way, several aspecets of our miserable cruel lives. If you enjoy seeing the same old predictable stuff on the screen, this is NOT a movie for you."
    },
    {
      "rating": "10",
      "text": "The actors don't play the characters, they breathe them. The essence of emotion was never better captured by anything in recent cinema."
    },
    {
      "rating": "10",
      "text": "It is the best movie I have ever seen. It is sensitive as much as entertaining. I have never seen such a great mix of such deep emotions. It was the first movie that has made me cry.!!! It needs to be good!!!"
    },
    {
      "rating": "10",
      "text": "A drama about triumph that triumphs itself. I think I will have a hard time choosing: This or Vertigo?, for my #1 movie."
    },
    {
      "rating": "10",
      "text": "The thing about boxing movies is there are very few possible endings: either our boxer wins or our boxer loses, with few exceptions, which in my mind excuses some of the cliches here.  This movie deserves all the praise it has received: it is wonderfully written, beautifully acted, poignant and sparse, like Mystic River.  Eastwood has an eye for great films.  Some of the characters are flat, but there does not NEED to be more than three rounded characters in a film, especially this one, so I did not mind Maggie's horrible family: for godssakes, it's incredible that Hollywood has produced a movie with round characters in the first place.  And I cannot understand the argument of Eastwood's \"politics\" that have so offended: this movie, like all good movies, does not argue one way or the other: what is important is that you believe Maggie asked him for it, and that you believe Frankie did it, because it is in the end about the characters involved.  Anyone so caught up in the \"politics\" here has mistaken this drama for something done by Michael Moore."
    },
    {
      "rating": "10",
      "text": "Alright, people that hated this, I don't care. I think this movie is an excellent film. Sure, it's a bit dreary and dark, but not all THAT dark Dave S. I love this movie, one of the best films of all time. After crap like against the ropes, it's good that great boxing films like This and Cinderella Man are in the picture."
    },
    {
      "rating": "9",
      "text": "Great movie. One of my all-time favorites, and among the best in '04. Hilary Swank is amazing. A definite must-see."
    },
    {
      "rating": "10",
      "text": "One of the best movies I've seen lately."
    },
    {
      "rating": "10",
      "text": "No one does it better then Mr. Clint, his films reminds us why we love movies so much."
    },
    {
      "rating": "10",
      "text": "This movie made me crying. it reached me really! it tells much about us humans and made me write a book \"Sinn des Lebens\"! it tells about our dreams hopes and what hurts us. i want to say: EVERYONE WHO THINKS THIS IS A BOXINGFILM IS A FOOL! that the boxing scenes are only secondary. this is one of the best films ive ever seen."
    },
    {
      "rating": "9",
      "text": "This movie is riveting. Definetly on the top list."
    }
  ]
}