{"id": 3383, "title": "Minari", "starring": ["Steven Yeun", "Han Yeri"], "runtime": 115, "genre": ["Drama"], "description": "A Korean American family moves to an Arkansas farm in search of its own American dream. Amidst the challenges of this new life in the strange and rugged Ozarks, they discover the undeniable resilience of family and what really makes a home.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/6mPNdmjdbVKPITv3LLCmQoKs9Zw.jpg", "categories": {"plot": 8.0, "acting": 7.8, "ending": 8.857142857142858, "soundtrack": 5.0, "cinematography": 7.666666666666667, "familyFriendly": 6.0, "funny": 8.0, "action": 8.333333333333334}, "reviews": [{"rating": "10", "text": "This is the movie that should win the Oscar for best picture, flat out, hands down, no questions asked. Director Lee Isaac Chung's heartfelt domestic drama about a South Korean immigrant family seeking a fresh start and a better tomorrow in 1980s rural Arkansas is just the kind of movie that we need right now, much as \"Moonlight\" was the film we needed in 2016. The picture's exquisite cinematography, nuanced script and narrative, and superb ensemble cast make for a moving cinematic experience that leaves viewers with a warm glow that lasts long after the movie's final frame. Richly deserving of the many accolades and award nominations it has received thus far, \"Minari\" truly stands out among this year's field of contenders, masterfully and lovingly handled in virtually every respect. I can't speak highly enough about the quality of this film and its power to help heal an ailing nation."}, {"rating": "8", "text": "“A broken ding-dong”‘Minari’ is one of those \"slice of life\" movies set in 1980’s Arkansas, where a Korean family try to start a farm and make ends meet. This is the type of movie that even though the story is about a Korean immigrant family, you can still draw a deep emotional connection to it.While the subject matter can have its dramatic elements, but it’s not to say the movie doesn’t have a sense of humor. It’s funny and incredibly endearing to watch. The movie does a great job of making you care about this family and you wish everything would work out for them. All thanks to the amazing script that helps flesh out the characters and made them all complex.The performances from Steven Yeun, Han Ye-ri, and Youn Yuh-jung were all fantastic. Even from the child actors, Alan S. Kim and Noel Cho, gave great performances, especially during the more dramatic parts of the movie. Just goes to show there are great child actors out there.The score, composed by Emile Mosseri, was superb and mixed Western and eastern styles to create a uniquely rich score. The movie itself looks so warm and sunny. The bright sun made all the mixture of different colors like green and blue look so luminous, it felt peaceful.I can tell a story like this came from a personal place from director Lee Isaac Chung. You see, he came from a Korean family and he spend his childhood in Arkansas. The story was told from the heart and it was beautiful to watch.Overall rating: A touching and heartfelt movie that deserves all the praise it’s getting. If you get the chance, check this one out."}, {"rating": "9", "text": "Beautiful Film. So glad I was able to see it at Sundance in 2020. Hopefully everyone can see it in a theater in 2021."}, {"rating": "9", "text": "Minari is an emotionally engaging and beautiful film. I had just learned this film existed a few weeks ago but since this film was getting such high praise I went into this with pretty high expectations. This is such a gentle yet emotionally straining film, it’s truly a special experience to watch. The plot is great it’s an entertaining and deeply engaging story. It starts off as a story that has been told before but becomes much much more. The pacing is great from the first scene until the credits role it’s well paced. The acting is great Steven Yeun and Yeri Han give great performances. Yuh-Jung Youn gives a fantastic supporting performance, she is easily one of the best parts of this film. Alan S. Kim and Noel Cho give great child performances as well.The direction is fantastic from Lee Isaac Chung, his direction is incredibly impressive and you can tell he was very passionate about making this. The script is great it’s a memorable and very well written script. The cinematography is fantastic, this film is full of shots that are so beautiful it’ll make your jaw drop. There is a certain shot where Jacob and Monica are watching the kids playing in the hospital waiting room and the camera focuses back and forth on the two faces. That one shot perfectly captures the story of the characters in less than a minute. The editing is great and the score is great as well.The comedy is very subtle but when there is comedy it’s wholesomely funny. In terms of the Oscars there’s a strong possibility that this will sadly be overlooked/snubbed. If this did get it’s deserved attention from the academy I feel this would probably get nominated for Best Picture, Best Original Screenplay, Best Cinematography, and Best Supporting Actress: Yuh-Jung Youn. The ending scenes of the film are very emotional and the last shot is just brilliant. Overall Minari is wonderfully wholesome and emotionally engaging film that is truly a special movie. 94% A"}, {"rating": "9", "text": "This is a beautiful film. Steven Yuen and Will Paxton are real standouts in a great cast. I love the tapestry of culture, generations, and faith and how seemlessly they are interwoven. While this is a very Korean story, it's also a very American story reflecting three wonderfully subtle takes on the immigrant narrative."}, {"rating": "7", "text": "\"Minari\" tem muito a agradecer ás atuações de Alan Kim e Youn Yuh-jung, peças fundamentais para que ele fosse um bom filme. Youn Yuh-jung em particular, minha atriz coadjuvante favorita da temporada de premiações até o momento. Não posso deixar passar, também, o ótimo trabalho de fotografia feito por Lachlan Milne. Tive problemas com o ritmo do filme, mas garanto que você não irá dormir enquanto Youn Yuh-jung estiver em cena."}, {"rating": "9", "text": "A great family film, and one of the better American dream stories I’ve seen in some time. This is a beautiful, funny film with a big heart."}, {"rating": "9", "text": "A24 no decepciona con 'Minari', una historia de superación personal y unión familiar, acompañada de buenas actuaciones, buena dirección y fotografía."}, {"rating": "8", "text": "Minari reflects perfectly what being a family means. Emotional and sad but with a great message."}, {"rating": "10", "text": "This movie teachs you a great meaning 'if u work hard, you will succeed and not lose faith even you lost everything, You can start again from zero'"}, {"rating": "8", "text": "A tender and heartwarming take on immigration. Although the whole family delivers great and funny moments, the bond between the kid and the grandmother is the best part of the film. By recovering some of his childhood memories, director Lee Isaac Chung gives the American dream its old meaning back."}, {"rating": "10", "text": "Overflowing with love, passion, and truth, Minari is the must-see film of the season. Featuring impressive cinematography, strong writing, and an incredible ensemble, the film tells a powerfully relatable story about family, sacrifice, resilience, and the beauty of small and unexpected victories. Steven Yeun, Han Ye-ri, Alan Kim, and Youn Yuh-jung all deserve Oscar recognition for their performances, Lee Isaac Chung deserves Best Director, and the film itself deserves the highest prize."}, {"rating": "8", "text": "Such a beautiful, meaningful, and profound film. Lee Isaac Chung has made cinema centered on human emotions to tell us that life is good and can be better. Sometimes when the wind is devastating, we need to be like Minari; Trying our best to grow as much as we can, No matter the circumstances. Sometimes we just need to say Thank You and, at the same time, fight for making a better life. And Sometimes, when the world makes us give it a stick so it can beat us, We just need to find the thinnest and finest one. Then the pain won't be that much, and We will move on.I really enjoyed this film; I liked it."}, {"rating": "7", "text": "This is a tender and touching film about an immigrant Korean family that moves to 1980s Arkansas in order to start a farm and search for the American dream. It's a rather straightforward premise told in a simple yet intimate way, with beautiful cinematography throughout, along with heartwarming performances from all involved, most notably Steven Yeun as the father of the family, newcomer Alan Kim as his adorable young son, and Yuh-Jung Youn as the salty yet endearing grandmother of the family. While the film does feel rather pedestrian in its execution for the most part, the performances, camera-work, and message of hope are what help to maintain the film's charm and tenderness. Overall, it's a family drama that is likely to touch your soul, but admittedly is heavy with emotion too, which may make it feel a little rough at times. Still though, it's undoubtedly a great depiction of family and human spirit and resilience."}, {"rating": "8", "text": "Minari won both of the drama awards (The grand jury and the audience agreed.) at the 2020 Sundance Film Festival and rightfully so!"}, {"rating": "9", "text": "Minari is one of the most inspirational family films I have watched in years. This exceptional cast pushes the limits of their family dynamic, as well as our hearts, as we see them struggle with everyday life problems. Jacob, played by Steven Yeun, moves from California to a Farmland in Arkansas with his family. The goal is to build a sustainable farm and live the American dream while dealing with many real-life issues that test the resilience of the household. He and his wife, Monica, played by Han Ye-ri, are recent immigrants from Korea in search of a better life for their kids. Jacob's dream of owning a farm brings the family to Arkansas with the purchase of a large farm and a house made out of an eighteen-wheeler. Monica is not fully happy with this plan for many reasons but goes along with the move to keep the family together. Director Lee Isaac Chung wrote and directed this semi-autobiographical film in 2018, ironically around a time he was considering retiring from directing. Though not a factual documentary, Chung included many memories into the film based on his childhood home in Arkansas. The fact that the film is based on many important moments in Chung's life is the driving force of the film. Early memories help to define who we are and Chung uses Jacob's son, David, as our guide through the film, allowing the audience to witness all these beautiful moments in his life unfold before their eyes. Moments of discovery, moments of understanding, and moments that teach him life lessons. Every member of David's family teaches him something important about life at some point in the film and these moments will define him for the rest of his life. Many of these important life lessons come from his relationship with his grandmother Soonja, who he spends all day with while his parents are at work. The two often travel down to the creek where they have started a small garden of their own with a plant from Korea called Minari, echoing the much larger garden of American vegetables that Jacob has grown.Their kids Anne (Noel Cho) and David (Alan Kim) are at a very delicate age in their lives and Monica knows that their new environment will be a major change for them. One of her fears is the loss of their Korean culture because there are only a few Koreans in the new town they live in. Monica's mother moving in to help out with the kids is one of the ways they try and keep the Korean traditions thriving in the house. David also has some unexplained medical issues early on and living in the middle of nowhere poses an issue in the case that a hospital is needed for him. All of these issues are just some of the things that the family deals with which are easy to sympathize with.  The family is also struggling with their faith in the film. Having moved to a new town, working new jobs, and balancing new priorities, Monica worries that the kids are not going to practice their faith as often due to the town not having a Korean Church, but they choose to attend the towns Sunday mass in order to provide their children with an outlet to continue practicing their faith as well as interact with other local kids. Ironically, as everyone struggles with their issues, the one character that seems to be the happiest is also the most faithful in the film; Jacob's farm helper, Paul, is an extremely dedicated Christian who carries a cross around town each Sunday. To the Yi family, he comes off as a nut but he is often the voice of reason and offers his opinion in many situations, even though he is often discredited. As the head of the household, Jacob often has to deal with very difficult decisions that sometimes put the family at risk, and he often makes these decisions without even discussing them with Monica. Jacob's desire to succeed sometimes clouds his judgment and puts his family in harm's way but that he lives with his choices and continues to fight tomorrow. Regardless of how big or small; any choice you make in life has a repercussion and many of the choices made by the characters, seem to come full circle in the film. They often present themselves as new problems or make situations worse, however, it is the family's determination to learn and grow through these decisions that is most important. I really connected with this film and the Yi family, so much so that each member taught me something about myself in one way or another. Minari is now available on all Video on Demand platforms."}, {"rating": "10", "text": "o melhor da award season ,tão lindo e tão tocante minari trata de um assunto que as vezes passa despercebi mas ele é necessario."}, {"rating": "2", "text": "This movie sucks. It is way too slow, the grandmother is a **** character. The movie is just a sequence of catastrophes. Trivial and boring. I was hungry at the end. I would have preferred beating my nuts instead watch this movie."}, {"rating": "1", "text": "Boring. Just boring.A story about a farmer.  nothing more.  the storylines are not revealed, they have not heard about the motivation of the characters at all.  it would be better to have seen half of the Justice League during this time.  what an Oscar nomination for?"}, {"rating": "10", "text": "A gorgeous, achingly personal yet universally relatable tale of the immigrant American experience with expert performances all around."}, {"rating": "0", "text": "bad movie. so boring. yawned many times, yoon yeojung was good at acting but she was even better in 계춘할망 and numerous other korean movies. if people think this is the peak of her acting n she deserves an oscar for it, she deserves 100x oscars for all the other work she did that were way more amazing in my opinion. and as a korean american, i did not relate to minari in one bit, which is strange. maybe director lee isaac had a very niche experience. o well. idk why people could relate so well to this movie. did not see anything i see in my own immigrant experience in the US or relationships in my family. oh well _ (shrug shoulder)"}, {"rating": "7", "text": "Minari transmite alegría, paz, esperanza y empatía, todos y cada uno de los integrantes de la familia son lo suficientemente simpáticos como para sentir cariño por ellos pese a que el desarrollo de los mismos sea escaso, el problema es que para los temas que aborda se siente demasiado larga y su ritmo es muy plano careciendo además de un desenlace que haga sentir satisfecho al espectador, lo que sí fue excelente en su totalidad es su banda sonora, es bellísima."}, {"rating": "9", "text": "The search for the American dream and a better future, this time from the perspective of a Korean family. The approach has an almost documentary flavor due to its realistic style, which is a counterweight in favor, which compensates for its calm pace."}, {"rating": "5", "text": "Heartfelt amazing movie with wonderful acting- especially from Steven Yeun and the funny Grandmother!"}, {"rating": "9", "text": "Nominated for 6 academy awards and deserved to win every single one of them."}, {"rating": "6", "text": "Steven Yeun (The Walking Dead) plays the father of a young Korean immigrant family who moves from California to Arkansas, where he plans to start a farm. Considering this was the 80s, there was surprisingly no racial pushback from this small Southern town. Instead, they deal with growing his crops and family challenges (including the grandmother who arrives from Korea). The cast, along with director Lee Isaac Chung, has created characters that are real and quietly involving. It runs longer than needed and never gets especially involving, but it is a low-key, modest human drama. (Mostly in Korean with subtitles)"}, {"rating": "6", "text": "Minari revolves around a family trying to live out the \"American Dream\" after moving from California to Arkansas to start a farm. There are plenty of touching and funny moments throughout and good acting by the cast that helps drive the film despite a couple of flaws that keep it down.The movie struggles in the second half as it plays out rather predictably while also dealing with an incredibly slow pace that the first half didn't deal with. It brings the movie down quite a bit IMO but it doesn't make it unwatchable. If you're looking for a decent drama to watch then, by all means, give it a shot, but I think it can hit one too many familiar tropes along the way that prevent it from truly being great."}, {"rating": "10", "text": "A small gem of a movie. A wonderful universal story of family, immigrants, hardship, love and starting a new life."}, {"rating": "4", "text": "The lighting was perfect.  Seriously, what am I expected to say?  “Minari” is not a movie.  You watch a series of terrible events and 2 hours in, the credits roll.  The acting and editing were actually very good, but there just isn't a story here, and without that, I cannot recommend this to anyone.  I give it a D, just don’t bother."}, {"rating": "7", "text": "Surely an interesting movie with realistic problems and some sad scenes. But somehow it was a bit too long and I didnt like the drama of Monica, she made even more problems."}, {"rating": "8", "text": "I'm usually turned off by films that seem baited for awards, and this film surely is. But that doesn't stop ne from loving this quaint and at times charmingly funny piece of work. Truly worth it's praises. Many moments that will have you reaching for tissues for sorrow and tears of joy.  A beautiful film for sure."}, {"rating": "9", "text": "A beautiful film with outstanding performances by all the cast, especially, Yeun, Kim, and Youn.  Kim is such an adorable kid I and I wanted to exchange both of my kids for just one of him.  Oh, and Mountain Dew is off my shopping list from now on."}, {"rating": "9", "text": "Minari Roots Deeply Planted in Resilience of Korean Family: Written and directed by Lee Issac Chung, \"Minari\" follows the Yi family, Jacob, Monica, their 2 children Anne and David and maternal Grandmother, Korean immigrants seeking to live their dream in 1980's America, when father Jacob buys land and moves them all to rural Arkansas to start a farm and garden growing Korean vegetables for wholesale market. The struggles and challenges they face in achieving the dream creates friction, but ultimately strengthens their bond as a family. Simple, relatable story, the film is beautifully shot and the acting from the cast is flawless."}, {"rating": "9", "text": "Minari tells a very intimate and authentic story about a Korean American family trying to adapt to rural American values. It has a heart-wrenching story with phenomenal performances, great sound design, a sparse but wonderful score, beautiful cinematography and shots.Minari is a film that people should watch once in their lives."}, {"rating": "10", "text": "A look at what it's really like to start completely over.  A tale that resonated with me as a person from a small town in the Midwest and someone who has restarted their life."}, {"rating": "8", "text": "Minari is an equal parts universal and humane family-centric story heartfelt immigrant story that explores the American Dream with effortless sensitivity by emphasising the necessity of strenuous labour to achieve a fulfilling livelihood, all the while emanating wholesome vibes mostly distilled from a sense of childlike wonder. I just hoped it didn't resort to melodrama at the end, as that sort of betrayed its naturalistic approach that kept the movie afloat, in the first place, from succumbing to its conventional plot.(8/10)"}, {"rating": "9", "text": "Minari feels both familiar and unique at the same time. It is certainly a special movie which I very much recommend. It has earned 6 Oscar nominations, including Best Picture and I think it is deserving of the recognition and praise it has so far received. Writer-director Lee Isaac Chung based this story of a Korean family settling in rural Arkansas in the 1980’s to start a farm on his own similar childhood experiences. In dramatizing his own story, Chung has made a film that is personal and relatable even if you are not Korean, or a farmer, or an immigrant. If you’ve tried chasing any part of the American dream, you’ll recognize something in Minari.Stephen Yuen and Yeri Han play Jacob and Monica, a Korean couple who have just moved from California to Arkansas with their two young children, Anne and David, to pursue Jacob’s dream of having a big farm—like the Garden of Eden—that will thrive and allow the family to do the same. Monica is skeptical to say the least, especially when she sees the trailer on the plain plot of land that is to be their new home. Adding to her anxiety is David’s heart murmur and how far away they are from a city and a hospital. The arrival of Monica’s mother, Soonja, complicates some things (like the sleeping arrangement in the small trailer) and livens up others.Minari’s focus is on the relationship that shy 6-year-old David has with his outspoken grandmother, Soonja. This isn’t a cutesy movie about a little boy and his sassy grandma, though they certainly have that dynamic. David doesn’t like that she doesn’t act like a “real” grandma: she doesn’t bake cookies, she swears, watches wrestling, and drinks Mountain Dew. Yuh-jung Youn as Soonja steals every scene and is far and away the standout performer of the film. She has earned a well-deserved Best Supporting Actress Oscar nomination and would be my choice to win if I were allowed to pick the winners. She isn’t just funny—which she is—or the character most out of place in this new home—which she is—but the emotions she stirs and her relationship with David are the heart of the movie. Alan Kim as David is just what you hope for in a child actor. He does not draw attention to himself and his behavior always comes across as natural, not contrived, even when he is playing a gross prank of his grandma. They share a wonderful, quiet scene together at a creek near the farm where she plants minari, a leafy vegetable; it is my favorite scene in the movie.Steven Yeun, nominated for the Best Actor Oscar, and Yeri Han work very well together as a believable married couple. He is determined but not bullheaded and she is not unsupportive or a nag but is justifiably feeling isolated and concerned. It is clear that they care for each other and even though they are at a place where their future together is uncertain, we do not feel that they have a bad marriage. Will Patton, a familiar face even if you don’t recognize his name, has a small role with a notable performance as the kindhearted but very eccentric local who gladly helps Jacob on the farm. He speaks in tongues randomly and, in a scene late in the movie, performs an exorcism that is simultaneously comical and emotional.The beautiful Oscar nominated score by Emile Mosseri would be my pick to win that category, again, if I were allowed to pick the winners. It is ethereal and enchanting and brimming with pathos. Chung has a tenderness in his direction and his screenplay—both are Oscar nominated—towards each of the characters and their points of view. My only real complaint is the plot contrivance that leads to the climax, but it is not a major strike against the movie because it drives the drama of the story forward and the final moments won me back easily. From start to finish Minari is filled with the kind of small, intimate and affecting moments that are so rarely done well on screen. Wonderful, wonderful Minari indeed."}, {"rating": "4", "text": "(Mauro Lanari)\"Minari is not... a great or memorable movie... In the long run... it pays for its calm pace ...., perhaps failing to fully entrench in the viewer the emotions that he would like to cultivate\" (Marco Catenacci). And how could it have been otherwise? By dint of subdued, minimalist and asphyxiated intimism, discreet, delicate and modest poetics of everyday life, spasmodic, extremistic, paroxysmal hunt for symbols and a sermon more pedantic of the various preachers on stage (\"All you need is love\"), there is no room for the real dimension of the protagonists of the biopic. And the Academy could have directly rewarded the Beatles of '67."}, {"rating": "7", "text": "This film has quite a charming feel to it. It clearly shows a family who are trying to do well for themselves and find their own Korean community/identity in America, although not everything goes well and perhaps the love isn't as strong between some members. Its very much a film about 'the American dream' - making your own success and getting on as best you can. Its got funny moments and some more serious moments. I liked the scenes with the young boy and the grandmother (who he resents), them trying to get on and she trying to pass some knowledge down to him. There is definitely a sense of childhood innocence, with the film/camera showing things from the young son's perspective, primarily. it's a subtle film but by no means a bad one.Something ironic I noticed was one of the weirder characters seemed to be the local American guy who behaved erratically around the family when featured from time to time.Not a bad watch, this film is worth seeing, yes."}, {"rating": "8", "text": "Minari was nominated for 6 Academy Awards this week, including Best Picture; so, I had to see what all the hype was about. Minari has been in select theaters for about a month and is available for rent on demand, but I can't say that I had heard much about the film until recently. Written and directed by Lee Isaac Chung, who received nominations for both, Minari tells the story of a Korean-American family that relocates from California to a farm in Arkansas in the 1980s. The father, Jacob Yi (Steven Yeun), has a plan to grow Korean vegetables in order to set his family on a path to the American Dream; and the mother, Monica (Yeri Han), strives to improve her skills as a chicken sexer to support the family as she continues to be skeptical of Jacob's ambitions. The promotion for this film says that this is the movie we need right now. We shall see.It is obvious that this is a personal story for Lee Isaac Chung. The family dynamics are depicted very tenderly, and although there are differences and arguments between the parents, neither is painted as a villain. Both Jacob and Monica want what's best for their family. We see much of the film through the eyes of the youngest Yi family member, David, who is played by Alan Kim in a remarkable performance for such a young child. There is a newness of the Arkansas landscape and the distant surrounding community that they all have to get acclimated to. While the plot of Minari is pretty basic just following whether Jacob will be successful in establishing his farm, once Monica's mother (Youn Yuh-jung) shows up a new energy and conflict is brought to the film.All the parts of Minari come together to create a satisfying whole. Chung focuses of the members of the family such that each one has a personality and a stake in what's happening. The cast that was brought together do great work. I certainly understand why Yeun and Yuh-jung were nominated for their acting and why Alan Kim will be a kid popping up in order movies in the future. Moreover, the lush landscapes of rural Arkansas look very inviting and the score heighten the emotional heft of the movie. For me, Minari was surprisingly enjoyable for an otherwise straightforward family drama.In conclusion, Minari is tender and emotional. More than ever, it does seem like it could be the movie we need right now. It reminds all of us about the typical American family that just wants its piece of the American Dream. Chung's personal touches makes Minari enjoyable and impactful. If you get a chance, get a big box of popcorn and watch this film."}, {"rating": "8", "text": "This American-South Korean indie film reflects memories from director Lee Isaac Chung's childhood. After manageable living conditions in California, the South Korean family of four Yi moves to rural Arkansas, where the father wants to start a farm. This decision causes tension with his wife. The two children try to distract themselves from the arguments between their parents. However, they are bored most of the time until their hitherto unknown grandmother strides into their lives.The great strength of Minari lies in its outstanding cast and their chemistry with each other. There is no clear protagonist, they all get their own storylines and experiences. Alan Kim, as the youngest son David, is already confronted with fundamental situations. He and his big sister Anne (Noel Kate Cho) have several moments where unconditional sibling love is communicated in a very simple way. This makes their bond enormously natural and real. The most profound relationship, however, is shared by David and his grandmother Soon-ja, played by the fantastic Yoon Yeo-jeong. Although they don't get up to operating temperature at first because David refuses to acknowledge Soon-ja's anti-granny ways (she doesn't cook or bake and uses swear words), the two grow closer as the film progresses. Every time they share the screen, hilarious and emotional dialogue is guaranteed. Exclusively the latter applies to Steven Yeun and Han Ye-ri, who play the two parents Jacob and Monica. Although their mutual love is always palpable, they are in a continuous conflict that reaches its climax at the end. Jacob wants to leave sorting chicks behind and prove himself to his family with his own farm. Monica, on the other hand, is tired of living in a trailer and doing Jacob's bidding and is eager to give her children an adequate home. Both embody a couple that seems stable on the surface but is crumbling badly underneath.In addition to the fantastic actors, Chung Minari's direction adds the finishing touches. The script is funny, gets under the skin and gives someone the realistic picture of a family that wants to start a new and better life in the land of many opportunities. But the American dream is really only a secondary matter in Minari. Rather, Chung captures a natural and down-to-earth mood with stunning camerawork, a beautiful score and a lot of focus on the atmospheric mood. This makes the film a technical masterpiece that takes a lot of time in some scenes and therefore often seems almost still. This can sometimes seem tedious, but is completely in keeping with the overall feel of the film. While the first two acts of Minari focus on a lot of build-up and interpersonal interactions, things come to a head enormously in the last third. The film is told in a matter-of-fact way. Its inner and outer beauty makes Minari the feel-good experience of 2020!"}, {"rating": "10", "text": "Loved it. Laughed, teared up, more than I expected. I thought that this movie would feel heavy, maybe be about discrimination. It wasn't like that at all. Highly original, great acting, including the child actors (which is unusual). Recommended!"}, {"rating": "8", "text": "this show is an 8 for me and watching it proves that it's a worthy oscar contender. not the first hr but the last bit really poignant and shows us what the title is for. this show does not want you to pity them but to fight along their struggle. very realistic, no melodrama and true to the strong Korean people.we understood the subtle inference to Christianity, not to mock but to show the cynics that there's a God that sees further than our narrow vision of life.very tempting to include a spoiler but it has been a long while since someone did a good clever beautiful ending. not easy these days where most good movies just end with lots of wordy explanations"}, {"rating": "10", "text": "Moving and poignant movie that will make you sob, Menari will catch your attention right off the bat"}, {"rating": "10", "text": "The movie is simply relatable to a immesurable level. The film has connected well with the viewer. I have not gone into the details of all the work required to make such a masterpiece. But I can acknowledge certain factors that really stood out to me. The acting to start with was on point. Struggling family.quarrels and argument between the parents while theit innocent children sit witnessing the horror trying to prevent the only adults whom they trust from fighting. The movie starts wholesome and slightly whacky with its own humour which any viewer would love. The narration the flow and everything to do with the story has been done well. I cannot emphasize how well the story has been written to make  this whole experience seem life-like, real true. The grandma I feel has potrayed her role beyond well. I think no other grandma could've outshone her except the viewers own. This is because the grandma has so successfully captured the essence of a slightly offset,cracked, flawed grandma that actually is real. the story so beutifully jumps between the stage two characters if the child and the grandma. The viewer does not really know whom to feel empathic for. The acting really allows the transition of the sadness for characters by the viewers, smooth. The last climactic chaos was so well placed  it just cannot be complemented enough. The best scene out of the whole movie has to be the walk which the grandma takes post causing her clumsy mistake. The walk was of shame, guilt, escape. We could see in her eyes the pain the sorrow. Even though she wanted to apologize she couldn't cause it would not save the goods from being destroyed. Nearly all viewers at a certain age in their lives feel like giving up or running away so that they don't act as an obstacle for the ones around them. That Same emotion was extremely well potrayed by her in that  scene . Following the same masterpiece level scen was another beautiful moment. Where the whole family was sleeping on the floor together showing unity and the grandma sitting, Staring at them. She was thinking about the loss , or that's what the viewers understands from her devasted emotions and still eyes. Over all I think the film has touched my heart. I am not someone who would cry to moving frames but this one for sure did crack me open vulnerable. It was too real. A real masterpiece."}, {"rating": "8", "text": "As part of an asian family growing up and assimilating in a western country, I really related to this film. I love the little asian culture nuanced jokes, especially involving the grandma. It's a real down-to-earth and wholesome film. The acting especially from the two leads is outstanding. Steven Yuen thoroughly deserved his Oscar nomination for this."}, {"rating": "7", "text": "Academy Awards don't lie. Best Picture, Director, and Screenplay are all appropriate. I especially liked the fox supporting actor award. But the Golden Glove was silly. Foreign language movie award... What do you mean, \"Go back to your country!\" to Americans?As a Korean, there were many American elements that were difficult to understand. But it was the best drama movie of 2020, and it must be a great movie.I believe there will be a day when the world will be excited in the language of movies beyond the barrier of subtitles, which is about an inch long."}, {"rating": "10", "text": "It's that kind of movie who made you feel happier at the end and after of that, and the score was perfect, sometimes I felt high."}, {"rating": "10", "text": "One of the best movies of the new decade. It's truly amazing along with the brilliant performances of the actors."}, {"rating": "9", "text": "Great and sweet story with some great performances to go along with it. One of A24's best."}], "recommendations": ["belfast", "lion", "american_beauty", "the_glass_castle", "the_impossible", "captain_fantastic", "nomadland", "leave_no_trace", "legends_of_the_fall", "call_me_by_your_name", "stand_by_me_doraemon_2", "disobedience", "the_florida_project", "the_danish_girl", "the_boy_who_harnessed_the_wind", "gifted", "carol", "first_they_killed_my_father", "manchester_by_the_sea", "only_the_brave", "dead_poets_society", "the_white_tiger", "green_book", "blue_valentine", "the_descendants"]}