{
  "id": 4038,
  "title": "Mindhunters",
  "starring": [
    "Kathryn Morris",
    "Jonny Lee Miller"
  ],
  "runtime": 106,
  "genre": [
    "Mystery",
    "Thriller",
    "Crime"
  ],
  "description": "Trainees in the FBI's psychological profiling program must put their training into practice when they discover a killer in their midst.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uTTGRvnqCI9ZC7WkyP9u7XRiOaA.jpg",
  "categories": {
    "plot": 6.5,
    "acting": 9.0,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "My favorite movie. It's got a great mystery storyline, mixed in with some comedy and good acting. Suspenseful. Funny. Awesome! I recommend this movie to everyone who enjoys good, fun movies, rather than \"artsy\" (boring/stupid) films"
    },
    {
      "rating": "10",
      "text": "Literally my favourite movie ever. i saw mindhunters on tv and then went and bought it on dvd as well and watched it another couple times. i loved every bit of it every single time i watched it. it was violent, scary,funny, and even smart, everything you could want in a movie. film critics are a bunch of idiots."
    },
    {
      "rating": "1",
      "text": "Stupid and moronic even if flashy and expensive looking. How can so much money be poared into something so blatently dumb? How many extra dollars would it take to develop a plot with even an atom of credibility."
    },
    {
      "rating": "4",
      "text": "I can't complain about the cast and the visual style but the story is **** Still, if you enjoy the cruel \"who dies next\" type of story it might be the right movie to watch."
    },
    {
      "rating": "10",
      "text": "One of my favourite films, it has really good plot and setting, fast action and of course, a lot of twists. Everything that good thriller should have, but better."
    },
    {
      "rating": "10",
      "text": "I absolutely loved it."
    },
    {
      "rating": "8",
      "text": "Really not sure where all the extreme negative comments are coming from. Thrillers are my favorite genre - I watch a ton of them. And this one had me entertained throughout. Yes, they end up alone on a island, which has been done before. It's a writing device people - one that is allowed to be used more than once in the history of film. I found the writing original and compelling, even if it wasn't always perfect. The production values were good, and the score was well done."
    },
    {
      "rating": "10",
      "text": "I think this film is just great.. it's full of surprises. It keeps you in the suspense. This movie will keep you guessing who is the murderer but then it will prove you wrong. so guess again and again... until you are sure who did it. I really like this film"
    },
    {
      "rating": "7",
      "text": "The cast of Mind Hunters is as weird and diverse as any movie can get, but what turned me on to this film was the fact that it was Directed by Renny Harlin. Harlin is a legend in the world of action films, responsible for such films as Die Hard 2, 12 Rounds, & The Long Kiss Goodnight. He usually doesn't waste his time on direct-to-video films, and prefers to feature his own people, but the story here was so good, that he must of made an exception. Mind Hunters follows seven FBI agents who are training to be profilers, under the watch of the toughest trainer there ever was, Jake Harris (Val Kilmer). For their final test, the group goes to a small island the navy uses for training, and must work together in order to catch a serial killer that doesn't exist or do they? Once they begin their investigation, the group quickly come to realize that the scene is booby trapped and they are cut off from the outside world, trapped on an island with a killer. While having a unique location and a terrific director, what I really enjoyed about this film was how it was more than just some slasher film. This group isn't just a bunch of frat girls running from a guy in a hockey mask, they are trained, intelligent, FBI agents, trying to figure out which one of them is responsible for setting the rest up. This film features all the fighting, gun battles, and chases that you get in a typical action thriller, but there is also a methodical obsession among the group to find the one that betrayed them, and for that this film is unique. Kathryn Morris stars and has more than enough experience playing a detective, after sever years on Cold Case. Likewise LL Cool J has played a cop on numerous occasions, most recently on NCIS: Los Angles. Going into the film, I wasn't all that crazy about this cast, but once I got into it, I realized that they were brought together, because all of these guys have plays cops, FBI agents, or some kind of law enforcer in the past. That mix of unique personalities and experience help this film, because what the cast lacks in talent, they make up for with experience. Mind Hunters isn't something you've never seen before, but it brings together several different common themes in a new way and it will keep you on the edge of your seat."
    },
    {
      "rating": "9",
      "text": "A good who done it thriller. The idea is based on the Agatha Christie novel “And then there were none” which is one of her best stories. This kind of movies rises and falls with the actors / actors performance and luckily the whole cast delivers. The pace of the story is well chosen and creates a lot of suspense. Each time you think you know the culprit its subverts your expectations in a good way. The final has an interesting showdown (A similar test was done by the Mythbusters) and is satisfying. This film is worth watching and owning on DVD / Blue ray."
    },
    {
      "rating": "7",
      "text": "What is wrong with critics' score??? This was a decent movie. Interesting and fun for 2005. I remember watching back then and loving it. Sure, it does not hold up THAT well for 2020 but it was still fun to watch again. Of course, movie has tons of plot holes and average acting, but I can excuse that for 2005 movie."
    },
    {
      "rating": "8",
      "text": "Mindhunters is a good thriller based on Ten Little **** Mindhunters is devoid of most of the shortcomings of its genre's films. The plot has excellent dynamics, there is no long prelude. The death scenes themselves are original and do not duplicate each other. The cast is certainly not the best thing in the film, but there is no fake in the actors' game either. Mindhunters has low critical ratings, I honestly don't understand why. Yes, this is a film for one evening, but the thriller first of all needs to be evaluated about the presentation of the plot and suspense. And in Mindhunters, everything is fine with suspense, the film constantly keeps on its toes. I advise everyone to watch."
    },
    {
      "rating": "8",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"
    }
  ],
  "recommendations": [
    "the_bank_job",
    "army_of_thieves",
    "a_walk_among_the_tombstones",
    "escape_plan",
    "the_last_witch_hunter",
    "den_of_thieves",
    "from_dusk_till_dawn",
    "rocknrolla",
    "vacancy",
    "wrath_of_man",
    "edge_of_tomorrow",
    "the_usual_suspects",
    "the_island",
    "minority_report",
    "copshop",
    "twelve_monkeys",
    "cube",
    "triple_frontier",
    "seeking_justice",
    "disturbia",
    "bright",
    "a_perfect_getaway",
    "looper",
    "now_you_see_me",
    "lucky_number_slevin"
  ]
}