{
  "id": 1833,
  "title": "Minions: The Rise of Gru",
  "starring": [
    "Pierre Coffin",
    "Steve Carell"
  ],
  "runtime": 87,
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "A fanboy of a supervillain supergroup known as the Vicious 6, Gru hatches a plan to become evil enough to join them, with the backup of his followers, the Minions.",
  "releaseYear": "2022",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wKiOkZTN9lUUUNZLmtnwubZYONg.jpg",
  "categories": {
    "plot": 6.45,
    "acting": 6.764705882352941,
    "ending": 6.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 6.5625,
    "funny": 5.611111111111111,
    "action": 7.4
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is the second movie and series of all time, only the MCU (Morbius Cinematic Universe) is better."
    },
    {
      "rating": "9",
      "text": "Surprisingly StrongAfter being delayed a WHOLE TWO YEARS, Minions: The Rise Of Gru is finally here and I am very happy to report that this film exceeded my expectations as this entry in the franchise still has Beautiful animation, Fantastic voice performances, Fun action, A nice balance between the Gru and Minion plots (50% a Despicable Me prequel and 50% a Minions sequel), Genuine heartfelt moments, The 70s look and feel is gru-vy (No pun intended), and of course the Minions are absolutely hilarious and are definitely at their funniest since at least the second Despicable Me. Overall, Minions: The Rise Of Gru is a massive improvement over it’s 2015 predecessor and the best film in the franchise since Despicable Me 2 and If you want to simply have fun if you’re feeling down, I think this film will help cheer you up."
    },
    {
      "rating": "10",
      "text": "Such an amazing movie. Everything about it is perfect. The cinematography, the writing, the characters. It is a must watch, highly recommended."
    },
    {
      "rating": "10",
      "text": "The best movie ever I cry for like 8min because the movie was too good it is a 10/10 for me"
    },
    {
      "rating": "10",
      "text": "this is the greatest piece of film ever made. hoooly **** this but morbius to shame"
    },
    {
      "rating": "10",
      "text": "This is quite possibly the greatest movie I’ve ever seen. Steve Carell brings some of his greatest acting to a masterfully written lead, creating a wacky experience for the ages. Never before in my experience has a movie received such rapturous applause, something people don’t really do in the UK normally. 10/10, I can’t wait to come back to this gem in the future."
    },
    {
      "rating": "10",
      "text": "Stephen Hawking, Alfred Einstein, Bill Nye the Science Guy, Micheal Morbius, Bob, Kevin, Joe. What do all these people have in common? They are brilliant. Geniuses, even. Minions: The Rise of Gru has changed my life. It's masterful. I have no flaws, no nitpicks nothing. The only thing I can say is to move aside Morbius. Minions: The Rise of Gru has made 1 Minbillion dollars at the box office so far and the Minion sweep will never let up."
    },
    {
      "rating": "10",
      "text": "Best movie of all time!!!❤ I've never seen anything better. It's even better than Joe."
    },
    {
      "rating": "10",
      "text": "i have never seen such a masterpiece in my life, this is  one of the best minions movies in the franchise and definitely in illumination, only being behind in the first despicable me, the animation is truly stellar with the story being insane, it delivered what it promised and gave more of gru which we all wanted that the first minions lacked. There are very few criticisms i have of this movie and would probably have to watch it again in cinema in order to find the smallest misconceptions in the movie, which is probably gru's weapon not malfuncioning which is incredibly minor. I must say this move is a must watch, I'm not even saying this as a joke or a meme you must watch this its a breathtaking experience. Easily a 10/10"
    },
    {
      "rating": "10",
      "text": "I was a master piece I loved GRU he had so much emotion to become a villain but they didn't expect him to the villain society"
    },
    {
      "rating": "10",
      "text": "This is the movie of all time. This movie is greater than Morbius. Make sure to watch this in your business suit drip. Minions and gru acted so well in their poignant performances, and it is evident that this live action film used no VFX. 10/1"
    },
    {
      "rating": "8",
      "text": "E-Value: 8Acting: 8Plot: 7The story of the Minions’ past continue in this instalment where they are join by their current boss which they later continue serving him in the future Despicable Me instalments, Felonius Gru (Carell).Seven years after the events of the first movie, the Minions (Coffin) have been serving Gru as their loyal minions to help him achieve his dream of becoming a supervillain. One day, Gru receives an audition invitation to join a supervillain team called Vicious 6 which is now lead by Bella Bottom (P. Henson), after the death of the team’s founder, Wild Knuckles.Gru attends the audition but the outcome is very poor because the Vicious 6 look down on him for being a child. Eager to prove himself and them wrong, Gru steals the Zodiac Stone which the Vicious 6 stole it years ago during a heist. As he is being chased by the Vicious 6, Gru gives the stone to Otto, one of the Minions, and they will meet back at his hideout while he along with the other Minions: Kevin, Stuart and Bob distract them.Back in the hideout, Gru and the other Minions are furious to find out that Otto has trade away the Zodiac Stone for a pet rock with some random kid at a birthday party. To make matter worse, the stone is now under the hands of kid’s uncle, who is now on route to San Francisco. Gru goes after the stone while elsewhere, there is another person who wants the Zodiac Stone as well besides the Vicious 6.Compare to the first Minions movie, this movie improved in many ways. For one, the movie not only focus on the Minions as the main protagonist but also include Gru in the role as well. In addition, this movie feels much closer to a Despicable Me movie. Neither the Minions nor Gru steals the spotlight each other throughout the movie. Gru has a great character developments in this movie and his interactions with the Minions is still heartwarming to watch on big screen. The humours in this movie is much better and improved than the previous movie.In terms of animation, Illumination still have done great job in that department and suffer no downfall. The casts have done a great in the voice acting as well especially Steve Carell, who still retains the charm of voicing Gru. Let’s not forget about Pierre Coffin, who once again did a great job in voicing all the Minions. The plot of the movie is fine and easy enough to follow without any complications.Despite the improvement from the first movie, this movie have major mistakes. First, there is a continuity error in this movie. Gru is said to be an eleven years old boy in this movie but he still looks the same like he was at the end of the first movie with no sign of aging at all. Next, the other members of Vicious 6 are generally flat characters and generic henchmen. Not only they do not have many lines but they are all voiced by well-known celebrity actors. This is really a waste of their talents in such a small role. The studios should have gone with lesser known actors instead of hiring celebrity actors.Nevertheless, the movie is still fun to watch. Kids will definitely enjoy this movie. You can bring you kids to watch this movie on the weekends. Even if you are not a kid but have watch all Despicable Me movies, you should definitely catch this one."
    },
    {
      "rating": "0",
      "text": "Horribly below average movie has absolutely no inspiration or passion whatsoever"
    },
    {
      "rating": "7",
      "text": "While I'm not a fan of Illumination and their many bad movies, The Minions franchise is always an exception from me. Something about the movies feels nostalgic and funny, and not a waste of two hours of my life. I wasn't a fan of the first Minions movie, so I wasn't interested in this one at all. The Rise of Gru is much better though, as it features more Gru and it's not just all Minions. The story is pretty good, but it has some plotholes. Then again it's an Illumination movie, plotholes are bound. There's a lot of fun parts in the story that are just super weird, but really good. The animation is a massive highlight in my opinion, it looks SO fresh and clean. The characters look creative and different, and it plays the idea of the mid 70s very well with costumes and songs. The soundtrack is good, but it's nothing to write home about other then some pop culture references in songs and the medley playing every now and then. Honestly the action is a pretty good highlight of this movie, the fight scenes for some reason are pretty entertaining. My only flaws are the pretty solid-sized plotholes, the McGuffin not being used much, and the comedy isn't too good at times. But this is enjoyable for people who like the Minions franchise and for kids. Highlight is definitely the animation and the callbacks and references to previous films. I'd go see this movie, the hype for it and memes from it are golden."
    },
    {
      "rating": "10",
      "text": "I would give this film an 11 if I could. Never before have I been so invested in a plot, it’s characters and the conflict at stake. BANANA"
    },
    {
      "rating": "9",
      "text": "Honestly it connects the minions lore pretty well. It the writers did a good job at making references to the older movies in the franchise. It's Also pretty goofy at times. I think if you liked the old minions movies you will like this one"
    },
    {
      "rating": "9",
      "text": "Great Film! Way better than the 1st one. Loved the humor and we finally got to see more of Gru! 9/10"
    },
    {
      "rating": "10",
      "text": "This is arguably the best movie of 2022, and I wouldn't be surprised if it gets an oscar nomination like Boss Baby. 10 Bananas out of 10. I will be seeing this movie at least 2 more times."
    },
    {
      "rating": "10",
      "text": "What a movie, truly incredible. When Kevin saved everyone it brought a tear to my eye. I found myself in mourning when gru died. Better than the legend morbius."
    },
    {
      "rating": "10",
      "text": "it is the best illumination entertainments film I have ever watched, I would give this film a legendary 100.00/100 if you haven't seen it, you must, it is the best illumination entertainment film ever, P:S it has definitely been worth a 7 year wait"
    },
    {
      "rating": "10",
      "text": "The Minion Sweep has arrived to cleanse Hollywood of the FILTH. First movie to make over 100 MINIOLLION DOLLARS. The only part of this movie that I didnt like was that it ended, for it meant i must return to my agonizing life where i was not indulging in the glory of Minions: the Rise of Gru. I watched this movie while sitting next to Martin Scorsese, and he wept, for he knew his trash filmography was nothing but dirt under the boot of this cinematic Epoch. I regret that i have merely 10 score to give this masterpiece."
    },
    {
      "rating": "10",
      "text": "Minions The Rise Of Gru Was a Prefect I Love Gru Because Steve Carell as Gru Was Perfect so I Give 100/100 and 10/10 Vote Cause I Love The Minions"
    },
    {
      "rating": "10",
      "text": "best move ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "This movie is THE best movie  of all time. When i watched it i could FEEL my change as a person. Before watching this movie i was a lonely nerd, but AFTER watching it i feel like i have been reborn. This experience is on ONLY rivaled by the likes of Morbius. I loved when gru said the famous phrase: \"It's gruin' time!\" When i heard that i felt truly understood as an intellectual. Overall this movie is a 10/10 and i recommend it for the whole family ESPECIALLY when wearing suits."
    },
    {
      "rating": "0",
      "text": "Please stop making this garbage... This is nothing but stupid silly sounds and mindless slapstick meant to keep children hypnotized for an hour or so. The minions are never funny and these movies are absolutely pathetic."
    },
    {
      "rating": "7",
      "text": "Uncomplicated movie, able to be enjoyed by everyone. No apparent agenda. Kids movie made for kids, instead of more preachy pandering and virtue signaling."
    },
    {
      "rating": "2",
      "text": "Minion fan-servicing piece of trash.Completely forgettable, the story is absolutely garbage, and the jokes are lame and sub-par.Nicely animated tough, but that's all.The sad, sad thing is that Metacritic doesn't do anything against fake chinese bots that keep upvoting themselves with their fake 10 star reviews, and the producers paying them."
    },
    {
      "rating": "4",
      "text": "Sitting here wishing I was either born in a more recent generation or that my sense of humor was more attuned to this kind of thing. Because, as it stands now, this was just not my thing. From the inconsequential and disjointed storytelling, to the elementary jokes, I honestly found myself treasuring the fact that this thing was under 90 minutes. That isn't to say you're less of a person or filmgoer for enjoying this. If anything, the fact that movies like this are enjoyed by so many and disliked by far less is a testament to the prevailing element of subjectivity in this art form. I look at a scene involving the titular characters absolutely butchering the Rolling Stones's \"You Can't Always Get What You Want\" as an affront to the ears, while others regard it with jollity. That's life. Either way, there's no end in sight for these films. The powers-that-be will keep making them and I suppose I'll keep giving them a shot. Didn't work out for me this time, however."
    },
    {
      "rating": "10",
      "text": "Si esta película fuera de Disney la llenarían de elogios, pero como no es así la califican de manera mediocre, en lo personal se me hizo muy divertida y disfrutable tal cual lo fue la primera entrega en su momento."
    },
    {
      "rating": "5",
      "text": "The Minions have the problem that their fame after their appearance in Despicable Me forced them to be over-exploited.They were precisely what their name meant. They were funny, colourful, flashy characters and became one of the standout elements of the film, while it was understood that they were just comic relief.2015's Minions proved they couldn't sustain a whole film and now with The Rise of Gru, which could basically be called Despicable Me 0.5, they fix that issue with Gru's addition because he represents someone at the centre of the narrative taking the lead.What follows is more of the same. A formula that doesn't dare to change anything and not that it needs to because, despite its flaws, Illumination Entertainment seems to know who they are making this film for.The animation is impeccable and the humor will work more than well for its target audience.Because that needs to be emphasised to the professional critics who think the characters should have given more for the older audience.And it's not about treating kids like idiots with silly jokes, but this is still a kids' film, and they just want to have a good time with characters they have fun with, and Minions: The Rise of Gru delivers in that regard.My 4-year-old niece was the best proof of that.If you're over the age of 10 and you were expecting something more transcendental from characters who just talk gibberish and have a childlike behavior, that's a problem of your own expectations."
    },
    {
      "rating": "3",
      "text": "Not as bad as I thought it was going to be but still not very good either. It’s definitely very enjoyable though. There isn’t a ton to say about this movie as it’s a stereotypical Illumination movie. Animation is weird, voice acting is fine, humor isn’t that funny, and feels like like a cash grab which a decent majority of this film feels like. This is one of the “better” movies that Illumination has put out though. There are some moments here where the film is actually kind of funny. The airplane stuff would work as a fun short film if they released that on its own. The film got a ton more unintentional laughs out of me though. I was laughing at how stupid the film was which definitely wasn’t the intention of the studio but it definitely did make the film much more enjoyable that way. Its got some fun moments sprinkled ever so sparingly thrown out but it’s not worth watching the whole thing for it as when the film isn’t on the minions then it’s dreadful. I don’t care about Gru or the villains at all and their dynamic is incredibly weak and Alan Arkin’s voice acting for Wild Knuckles is dreadful. The story itself is incredibly boring as well but thankfully the somewhat funny moments here and there don’t make it a chore to sit through. Plus the film is short anyway so it won’t feel too long. If you really want to watch this film then definitely watch it with friends as it will be 100 times more fun watching it that way than watching it by yourself."
    },
    {
      "rating": "1",
      "text": "Minions 2 is better than the original, but still being mediocre like most of the films of this saga"
    },
    {
      "rating": "8",
      "text": "I wasn't expecting much beforehand, but now here I am typing something I never thought I would type a month ago: a sequel to the Minions movie is actually more engaging and enjoyable to watch than Pixar's underwhelming Buzz Lightyear spin-off.It helps that the memes surrounding this film resulted in a bunch of people in the audience I was with dressing up in fancy suits and hollering with unabashed glee at the opening titles like it was a Marvel movie. That made me smile."
    },
    {
      "rating": "0",
      "text": "Another once great animation franchise is bee destroyed by another terrible and pointless sequel // prequel made for cash in reasons.First three despicaple me films were awesome and were even good for adult audience.Sadly after part 3 decline begun first with the silly minions stand alone film and now with this terrible prequel.What can i say ?Stick to the first 3 films and avoid all the rest.Grade F."
    },
    {
      "rating": "9",
      "text": "I enjoyed the movie a lot. I love the goofyness of the minions. I can't wait for the next movie !:-D"
    },
    {
      "rating": "7",
      "text": "Tu veux rire ? Tu ne sais pas parler ? Alors Banana !Do you want to laugh? You don't know how to speak? So Banana!"
    },
    {
      "rating": "7",
      "text": "This movie made me gru up in ways I did not expect. I definitely needed another minions after waiting forever. They should release a new minions movie every year,,,, scratch that every week. I can't get enough of this!"
    },
    {
      "rating": "5",
      "text": "It seems like most of the 10/10 reviews are trolling, copying a meme.I thought it was very average, the animation was as good as would be expected and the story was OK, it wasn't very funny no-one in the cinema laughed out loud at any of the humour throughout the entire runtime. I thought the previous Minions/Despicable Me movies were so much better, this felt like just a by-the-numbers mediocre sequel."
    },
    {
      "rating": "8",
      "text": "Muito divertido e bem engraçado. Minions 2 ( que na verdade deveria ser meu malvado favorito 4: a origem de gru) consegue se superior ao anterior, e os varios easter eggs e referencias vão satisfazer o publico"
    },
    {
      "rating": "10",
      "text": "I love the Despicable Me/Minion Universe and this movie does not disappoint.  In fact, it is one of the best because it does a great job of tying together the 2 franchises along with the great writing of a funny and heart-warming story!"
    },
    {
      "rating": "9",
      "text": "Nice setting and story, fantastic animation and silly jokes. Exactly what you would expect from a Minions movie. Fun for young and old!"
    },
    {
      "rating": "4",
      "text": "Tive que ir ver por causa dos memes dos cara indo de terno ver e nossa que decepção kkkk. O filme é ruim e ponto ele é muito muito bobo sem graça usa as mesmas piadas toda hora e vai ficando chato. O filme não tem conteúdo algum tem uma hora e meia de puro nada vei não desenvolve muito o gru e fica em 3 minion a sl chato ruim e o modelo da cabeça de dragão da mulher parece o esquilo de era do gelo por algum motivo kkkkkkkkkkk. Melhor parte do filme é a viagem de moto do minion gordinho aquela ali foi top."
    },
    {
      "rating": "10",
      "text": "Where is he?Where is my beloved Vector?I sometimes am shaken up at night, full of ecstasy from the false hopes of my dear Vector coming back.With every instalment it seems more and more hopeless, a world without Vector is not a world worth living in.I spend all fleeting moments of my, now, useless life searching for him, finding the one who shined over me, just like how the moon shone over him."
    },
    {
      "rating": "10",
      "text": "It's always fun to watch these little marshmallows sing and dance. Certainly a fun family film"
    },
    {
      "rating": "6",
      "text": "In the heart of the 1970s, amid a flurry of feathered hair and flared jeans, Gru is growing up in the suburbs. A fanboy of a supervillain supergroup known as the Vicious 6, Gru hatches a plan to become evil enough to join them. Luckily, he gets some mayhem-making backup from his loyal followers, the Minions. Together, Kevin, Stuart, Bob"
    },
    {
      "rating": "7",
      "text": "A surprisingly good mindlessly fun ride, a much better movie than the first one"
    },
    {
      "rating": "10",
      "text": "This is the greatest movie I have ever seen in my life. It has everything. Love, betrayal, action, comedy, etc. It is funny, happy, sad, beautiful, and best of all Minions. This is a cinematic masterpiece and a movie that I will cherish for my whole life. When I am on my deathbed, I want to be watching this. This movie makes my tear up with joy every time I watch it, and that will never change. My favourite part was when Gru said, \"It's minionin' time!\" Please watch this movie. It will change your life like it changed mine. I have a girlfriend now because of this movie. I'm planning on proposing soon. I love her. She will be with me for the rest of my life. She is everything to me and I love everything about her. She is the most beautiful woman in the world. I love her an amount I cannot describe. But I don't love her as much as I love the Minions. God bless.- Tyrone Wilder, PhD"
    },
    {
      "rating": "10",
      "text": "This is the 3rd best movie I have ever watched. 2nd best is American Psycho, and the #1 best movie is Morbius"
    },
    {
      "rating": "10",
      "text": "I used to hate minions but I Gru up. Truly the filmest movie ever 100/10. The moment when Gru said \"Minions, it is time for me to rise\" gave me goosebumps. It was undeniably marvelous."
    },
    {
      "rating": "8",
      "text": "Great funny movie. Really nothing more to say, just a fun and funny time. Some of the jokes are great, and the voice acting is great. The characters are all really interesting and funny, and oddly deep for a Minions movie. I’d definitely recommend it as a good family movie."
    }
  ],
  "recommendations": [
    "the_lego_movie",
    "sonic_the_hedgehog_2",
    "ghostbusters_afterlife",
    "peter_rabbit",
    "despicable_me_2",
    "over_the_hedge",
    "thor_ragnarok",
    "the_spongebob_squarepants_movie",
    "ice_age_the_meltdown",
    "minions",
    "hotel_transylvania_2",
    "night_at_the_museum_battle_of_the_smithsonian",
    "guardians_of_the_galaxy",
    "the_green_hornet",
    "free_guy",
    "tmnt",
    "ghostbusters",
    "megamind",
    "alvin_and_the_chipmunks_chipwrecked",
    "the_spongebob_movie_sponge_out_of_water",
    "tomorrowland",
    "sonic_the_hedgehog",
    "entourage",
    "ice_age_dawn_of_the_dinosaurs",
    "coming_2_america"
  ]
}