{
  "id": 1871,
  "title": "Minions",
  "starring": [
    "Sandra Bullock",
    "Jon Hamm"
  ],
  "runtime": 91,
  "genre": [
    "Family",
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "description": "Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world.",
  "releaseYear": "2015",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vlOgaxUiMOA8sPDG9n3VhQabnEi.jpg",
  "categories": {
    "plot": 4.5777777777777775,
    "acting": 4.4,
    "ending": 2.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 5.571428571428571,
    "funny": 4.815789473684211,
    "action": 5.666666666666667
  },
  "reviews": [
    {
      "rating": "0",
      "text": "This 'movie*' was so unfunny, so unoriginal, so repetitive and it teaches your kids that to be evil is a cool** thing. The animation looked bad. It was just fart jokes and other immature things. My 6 year-old  son saw it and it gave him autism.\r *It wasn't a movie, it was just a rerun of the despicable me, without any good characters in it.\r**The minions aren't cool."
    },
    {
      "rating": "0",
      "text": "I HATE this movie. It is the MOST disappointing follow up to some great movies EVER. I mean we've already seen that it doesn't work if you put the comedic relief in its own movie. (Like Kronk's New Groove) Except, Kronk's New Groove was BETTER than Minions, and Kronk's New Groove is a Disney Toon Studios movie. I expect more in Despicable Me 3."
    },
    {
      "rating": "0",
      "text": "this movie is just plan dumb plus i hate all the minons they r so ugly and dumb i hate it btw all the movies suck i hate them all just go watch steven universe is much better"
    },
    {
      "rating": "7",
      "text": "Silly Minions from Despicable Me are just as silly and adorable in this prequel of the aforementioned cartoon. There is nothing deep in this type of humor, so if you didn't like Minions and their jibber-jabber during the previous two installments, chances are you will find this ridiculous and/or annoying. For the fans, they should still find stuff to enjoy. Not to say that it could have been done much better and funnier, but still... Funniest stuff for me comes at the beginning (which was basically all the stuff from the trailers) and in the end, where I had some genuine LOL moments. The stuff in between is \"hit or miss\", but it was enough entertain me. The movie is not too long by today's standards, which is another plus."
    },
    {
      "rating": "5",
      "text": "Minions is the prequel film that explains how the Minions came to be and how they met their master, Gru. Being a fan of the first 2 Despicable Me films, I was very hopeful that this would be good, but also very scared, because honestly, there's not enough substance to carry a whole film. Overall, it's not as good as the films before it, but it is still a nice addition to the franchise. I thought hearing just the minions for an hour and a half would get very tiresome, but they managed to make it work by adding human characters, while still keeping focus on the Minions. In this film we have an all-star cast that ranges from Sandra Bullock to Geoffrey Rush and Micheal Keaton. They all did a fine job at the rules they were given. I do have a few complaints with the film. It does seem to drag on a little bit but still manages to pick itself back up by the finale. A lot of the jokes were pointed towards kids, even more so than both Despicable Me, but the best jokes are the ones that kids may not get. There is a ton of references to 60's culture, and it's pretty cool to see something for the adults to enjoy.My biggest problem is that the story is really all over the place, It can't really stay focused on one thing for more than 10 minutes, and it gets a bit distracting. Overall, with a killer soundtrack and a ton of humor kids and adults will enjoy, even with the crumby story and a few flat jokes, Minions is still an enjoyable animated film, just not the best one this year."
    },
    {
      "rating": "7",
      "text": "As a child, I enjoyed the film. It was perfectly stupid but funny at the same time. It's amazing how developed a character can be without speaking throughout the entire film. I wouldn't have thought most adults would enjoy this, it's a very childish film but it's great for young kids and families. I would recommend this film to any family with children under 15! Great family fun!"
    },
    {
      "rating": "7",
      "text": "People clearly had their expectations set too high here. The Minions are simple characters so it's not like a movie based around them would be Pixar level! I enjoyed the film for what it was, it's great if you just want to sit back and watch some slapstick. The weakest link though, is Scarlett Overkill. Her name is actually pretty fitting because she's too over-the-top and frankly, annoying. I mean, one minute her dress flaps like a normal dress and the next it's a cannon? Also there is only one place she could have put the missiles up there and you do not want to know where it is. But the Minions carry the movie surprisingly well, the movie is pretty enjoyable. Watch it for some laughs. It's better than they give it credit for."
    },
    {
      "rating": "9",
      "text": "I soo love this movie because these minions are too cute. They also have one of the best soundtracks and I enjoyed watching this film.\r Check it here http://www.watchfree.to/watch-2a3082-Minions-movie-online-free-putlocker.html"
    },
    {
      "rating": "6",
      "text": "The Minions pretty much had their moments. Good, but a bit bad at the same time. It's pretty much one of the watchable movies (Along with Despicable Me and 2) to stay in tune for Despicable Me 3 coming on your way."
    },
    {
      "rating": "0",
      "text": "The Minions used to be o.k. and all, but now their popularity has gone too far. What was bad about this movie was focusing on the now annoying minions and very surreal parts."
    },
    {
      "rating": "4",
      "text": "This prequels is where the franchise starting going downhill with bad sequels. Minions is a disappointing prequel to the good Despicable Me films. The backstory part of the film is great, but the rest is just forgettable. Fortunately, the animation, set in the 1960s, is pretty good. Unfortunately, the plot is not good with uninteresting characters. In fact, this film is titled Minions, but it only focuses on three Minions. Also, the humor starts to get annoying this time around. I was disappointed with this prequel and Minions proves that the Despicable Me series has overstayed its welcome."
    },
    {
      "rating": "3",
      "text": "It's a mindless comedy and you need to go in expecting that or you definetly will not enjoy this film. Minions is dumb but funny slapstick humor. Bullock and Hamm are also great in their roles. Unfortunately, most of the good slapstick was given away in the trailers, hurting my rating of this film. Minions is a film that you can get a kick out of watching once, but no more than that."
    },
    {
      "rating": "3",
      "text": "The Minions were so good and so funny in both \"Despicable\" movies. I expected more of the same, but did not get it. The funniest part of this movie actually takes place before the the movie starts. After that it's a few moderate chuckles on top of a really thin story. I did not expect Citizen Cane, but I did expect something on par with the \"Despicable\" movies. This is not even close."
    },
    {
      "rating": "9",
      "text": "Again, the critics were wrong. Okay they fooled me, even the audience score, which I usually rely on at rotten tomatoes was at 68%!!! Like seriously, this is actually entertaining and fun. I wasn't disappointed at all and this was exactly what I paid $10 for. From the opening scene, I knew this would be funny. Sandra Bullock is good as the villain, and the minions are cute. Great lead up to Despicable Me and made sense as they couldn't keep a leader, but found Gru. On the downside, the theater wasn't as crowded as Inside Out was and my theater was sold out but only had 96 seats."
    },
    {
      "rating": "4",
      "text": "A Hodge podge of ideas are never successfully converted into a totally successful story and this ‘Despicable Me’ offshoot can really only be recommended to Minion fans. The animation is very good and the soundtrack is wonderfully interjected with some classic 60’s songs. Also for the adult movie buffs in the audience there are plenty of references to other films one of which, if I’m not mistaken, is a homage to ‘The creature from the Black Lagoon’? The villain here voiced by Sandra Bullock is the aptly titled Scarlet Overkill. However, the character lacks the sinister villainy of Despicable Me’s ‘Gru’. I don’t wish to be too harsh on the film because there are some truly inspired moments. The early narrated scenes depicting the Minions in search of the greatest villain they can find is a lot of fun as are the scenes at the Tower of London. Unfortunately, though, not being a true Minion convert I watched proceedings rather impassively laughing at only a couple of inspired sight gags. Ultimately, one is left to conclude that this is a film for children or diehard fans only."
    },
    {
      "rating": "7",
      "text": "Minions is ok. it's fairly funny and had some cool characters. but the problem is that without the Despicable Me cast there is way too much of the minions and it doesn't fully work and just seems like a ton of sequences that have been tied together rather loosely. i also thought the really talented cast were wasted. that being said i enjoyed the film and i think some of the best moments are the background gags but it need to be better written to keep the entire audience engaged. oh and the 3D was good but slightly too gimmicky"
    },
    {
      "rating": "3",
      "text": "The villain is poorly cast (Sandra Bullock). Very one dimensional character. Can be blown up, smashed by a chandelier but cant withstand an ice blast...Cmon. The whole movie is like a terrible SNL skit but it has to last an hour and a half. Kids will eat it up of course but adults and parent will be bored."
    },
    {
      "rating": "0",
      "text": "I stood in the pouring rain in California, hailed a cab and wasted twenty dollars of my own money to see this abomination with my family. Let me state to emphasize, THIS MOVIE IS AN ABSOLUTE **** WASTE OF YOUR MONEY AND TIME. No subtitles on the generic minion main characters throughout the entire movie. No Gru until the very end and even then its just his toddler form. But the biggest crime? SANDRA BULLOCK WRITTEN BORING?! That is NOT how you make use of a good actress movie...NO....just no.\r Minions need a master find master master dies rinse and repeat until you gouge your eyes out so you never have to see such a retarded movie ever again. NONE of the charm of Despicable Me 1 and 2, all hollow and all the characters ARE NOT....FUNNY. I laughed all of four times, my father fell asleep the entire time and then he woke up at the end and said and I'll never forget this **** \"That movie was two hours too long.\" And I agree.\r STAY THE **** AWAY FROM MINIONS THIS MOVIE IS POISON!"
    },
    {
      "rating": "2",
      "text": "This movie is for anybody without a sane sense of humor, or for anybody has not passed the age of  'Oh cutie!'. The plot is awful and stupid, and the characters don't make any sense."
    },
    {
      "rating": "0",
      "text": "minions the movie ruined my life all my friends and my family post minion memes and i get cyberbullied and everyone doesnt like me  HELP??????????????! jump"
    },
    {
      "rating": "8",
      "text": "A riot of invention and slapstick humour, Minions is sure to delight little kids and adults who are still kids at heart. Always the best thing about the Despicable Me movies, the Minions breakout in their very own origin story detailing their centuries long search for an evil master to serve. With little in the way of dialogue, and a plot thats gossamer thin, Minions works thanks to brilliant creative writing and inspired voice work. A blast from start to finish"
    },
    {
      "rating": "0",
      "text": "Illumination Entertainment made this movie... so the Illuminati made this movie. As predicted, it has made them money, so much of it, in fact that they are the 2nd highest grossing animated movie of all time. Do not support this movie, unless you want to support the Illuminati."
    },
    {
      "rating": "7",
      "text": "Sure, this isn't close to the level of both Despicable Me films, but if you feel like turning your brain off and having a good laugh you should watch this. It's fun and adorable and there are quite a few hidden jokes too. Not a super quality film by any means, but this is mainly for children, and they'll enjoy the hell out of this."
    },
    {
      "rating": "3",
      "text": "The movie is ultimately bad. The Despicable me I, II were much more interesting. It looks like this movie was outsourced to some cheap and lousy company. I cannot believe that it was created by the same team."
    },
    {
      "rating": "8",
      "text": "In an age of below mediocre kids films such as Home, Tommorowland, Planes, with the list growing ever larger. Minions is a film that no only works well but complements the source material on which it is based upon, working with colorful new characters such as Herb and Scarlet Overkill played by Jon Hamm and Sandra Bullock, respectively who give great performances in their first voice roles ever as the despicable villains of the film, but it is the main highlight of the film that is of course Pierre Coffin who portrays the odd and somewhat mentally challenged Kevin, Bob and Stuart on a quest to find a new master who is evil diabolical and of course has a high mortality rate. Filled with the occasional slapstick humor and moments of complete goofiness. The minion movie is well worth a watch for any age group"
    },
    {
      "rating": "5",
      "text": "I was never a big fan of Despicable Me (haven't seen the second one) but Minions turning out so mediocre still disappointed me because the trailer promised a fun film that seemed to be a lot better than what we ended up having. The problem is a lack of engaging story-line, there were no real stakes to it.\r At the start of the film I was fairly amused but by middle I felt bored. If there had been another protagonist to focus on maybe that would have made things better. Like say a character who can actually speak English and who we could root for because the Minions alone can't carry this film. It's now abundantly clear that they belong in the background.\r Also there was nothing special about Scarlet Overkill. Gru at least was a distinctive character whereas Scarlet was the Strong Independent Woman that we have seen a million times before. So the film also failed in having a memorable villain.\r So basically if you are an adult and you still have retained your love for animated films then there is nothing for you here. It has a few fun bits here and there but nothing to recommend it for."
    },
    {
      "rating": "5",
      "text": "I love the minions. Somewhat ironically, but almost nostalgically. Although Despicable Me came out only about 5 years ago, but Universal wastes no time with Minions. Give the people what they want! (Although I'm not sure this is quite what the people want. I didn't need to see a minion in a thong.)\r Centuries of young minion life has been shortened to a mere 90 minutes. We saw the best and the worst times, but still there was no real plot to speak of. The minions are funny (to a certain extent) and the movie did what one should expect it to do – have many banana-crazy minions running around every which way. That's what it does best and that's what I wish it would have focused on. Without a clear destination or point to the story, I was as lost as Bob and Stuart and Kevin were while trying to find their new supervillain.\r I didn't like Scarlet Overkill. I probably wasn't supposed to either, but that doesn't change the fact that she was an unreliable and one-dimensional character. I wanted to see the real Scarlet, not the power-hungry queen. Or maybe even see the minions stand up for themselves! I was disappointed with the story past their despair ice caves. I would have rather watched the minions in that cave for 90 minutes than watch the lifeless action sequence with the oddball villains that seemed strikingly out of place.\r Being a third sequel, I never had high expectations. This isn't Toy Story, and you're not going to cry. You'll laugh a couple times, cringe a few more, and walk out of the theater with a shrug. I wish I could have as much as enthusiasm as Bob did, but that is completely unrealistic."
    },
    {
      "rating": "0",
      "text": "This movie is a perfect example of what happens when you take a movie series too far. No one needed to know the minions backstory, all people care about is the humor in the movie. I was amazingly excited to see this, and when I saw it, I hated it. Limited Laughs, barely any English, and just a boring and not cute plot. MINIONS will make you want the 91 minutes back in your life, it sure did for me."
    },
    {
      "rating": "8",
      "text": "My Granddaughter loved it, and in the end, that's all that really matters...\r I also was amused throughout, and this is from someone who hates animated movies..."
    },
    {
      "rating": "10",
      "text": "i want a minion to fist mei want a minion to fist mei want a minion to fist mei want a minion to fist mei want a minion to fist mei want a minion to fist me"
    },
    {
      "rating": "0",
      "text": "What's wrong with this idea?  Let's make a cartoon with hundreds of ugly dwarfs whom you can't understand and let's make it VIOLENT, the main premise, the search for a villain to worship. Not entertaining, not funny.  The ONLY memorable thing about the movie was I had to pay $2 more than my 4&6 yr old grandchildren."
    },
    {
      "rating": "8",
      "text": "Short, but effective injections of comedy. Tied with moderate, yet satisfying character development with minimal dialogue. Minions is a refreshing family film, filled with fresh fun for the summer."
    },
    {
      "rating": "0",
      "text": "i hate the minions i hate the minions i hate the minions i hate the minions i hate the minions i hate the minions i hate the minions i hate the minions i hate the minions i hate the minions i hate the minions"
    },
    {
      "rating": "0",
      "text": "After seeing this movie, I've lost my will to live. My father left the movie about half way in and I haven't seen him since. My mother has taken her own life and I'm sitting here with a rope and a gun just trying to find out how I want to go."
    },
    {
      "rating": "0",
      "text": "Pesima Pelicula Aburrida..Realmente ME ESTABA DURMIENDO observando tanta tonteria recurrente chistes sin sentido, de lo peor que he observado\r Los efectos graficos de los primeros 5 minutos de la pelicula excelentes, el resto de la pelicula para olvidar, 2 villanos Scarlett y Herb crudos, desabridos\r Realmente una pelicula no puede depender de tanta tonteria y estupideces recurrentes, personajes bobos como los minions, que sirven como acompañantes y dan un giro necesario en las peliculas de GRU, pero mas de 90 minutos REALMENTE FASTIDIAN.\r Humor BOBO\r Cinepolis en Mexico esperaba salas llenas  , sin embargo sus salas quedaron SEMIVACIAS, no fue el boom que tanto esperaban.\r La Sala en la que me encontraba se encontraba en SILENCIO, solo uno que otro niño se reia, al final los comentarios de la gente fueron que estuvo PATETICA, CHAFA, GUARRA.\r Realmente me dolieron los 53 pesos que me salio el 3D.\r PESIMA PELICULA"
    },
    {
      "rating": "3",
      "text": "If you liked the Minions is DM then you will be bummed.  This movie has a bad and convoluted story, with no real payoff, and very few laughs. What a disappointment."
    },
    {
      "rating": "6",
      "text": "I had my doubts about this movie. Minions are annoying nowadays and are abused as a meaning of selling merchandise. But this film ticked most of the boxes needed for a good animation film. To start negatively, this film was rushed as f*ck. Honestly, scarlet overkill had just the worst build up to an antagonist I've ever seen in a movie. It was so quick and should've started with a little more context. Also, the action sequences were too rushed and should've had a more quick slapstick humour to them (i'm not saying they didn'y, but more would be nice). This being said, the comedy in this movie was exemplary as the minions are just too adorable in trying to understand a foreign world to them. The references to British pop culture in the 60's/70's were on point and added great comedic value to a film that means both children and adults will enjoy. Not the worst, but really not the best animated film out there."
    },
    {
      "rating": "4",
      "text": "this is another franchise that has been milked for money, I dont really like the movies made in 2014 and 15 because the movie industries have ran out of idea, the movie does have a little bit of humor but its a little to repetitive and also in the trailer they made it look a little bit more promising(already knowing movie isnt going to be to great because of the previous ones), but they made it look interesting how they made people curious of were did the come from. In the story I didnt like how the did the beginning to much, expecting something a little more different but you know its whatever"
    },
    {
      "rating": "6",
      "text": "Anyone who has seen either \"Despicable Me\" knows that the minions are the cutest characters in the movies. Their occasionally intelligible jibberish never gets old and the silly slapstick always generates a smile, if not a laff. Three of them set out to find a new evil boss, only to get sidetracked with a plot to save the world. Most of the action is set in '60s London and the swinging period soundtrack adds upbeat nostalgic fun. While some of the gags are genuinely funny (and there are plenty of in-jokes for the grownups), the story wears thin and an endless energy makes up for true hilarity. Still, less discriminating younger viewers are bound to be delighted. NOTE: Stay thru the credits for a Beatles song featuring the entire cast."
    },
    {
      "rating": "6",
      "text": "Honestly the real and main reason why the studio (Universal) decided to make this movie at all is because how popular Minions is , they just everywhere know from toys to even some ride in Universal Amusement Park.\r For me personally i'm okay with that , i mean i'm a big fan of these little yellow guy since the first Despicable Me in 2010 but overall i have to say that Minions is not a bad movie but it's also could be a lot better especially comparison to the first two Despicable Me that a lot better than this\r first off the script it's horrible super cookie cutter cliche boring script that you pretty much getting tired of it , it's super predictable , lack imagination or any real story driven it's like they just search \"how to write a movie script\" in google and just do it exactly that.\r Another thing that kind a let me down is the other main character in this movie besides minions and that is Scarlett Overkill voice by Sandra Bullock , she's awful really just another cookie cutter part of this movie , the character itself is boring repetitive predictable and not even likable at all she's just doing her bad stuff without any real background to it even though they try to force her terrible background in to our mouth but it's just terrible storytelling.\r BUT but even though a lot of part in this movie is a let down , one thing that Minions fans should at least feel safe going into this movie is for sure the minions itself ,they're still cute funny and likable character the same character we know and love from the previous Despicable Me , so if you going to this movie just for this reason and you're a big minions fan there's no reason why you should not see this movie but other than that it's just another cliche mediocre movie that pass the test but never at the top of the class."
    },
    {
      "rating": "7",
      "text": "7--Good for the Kids, Not so Much for the Adults\r It’s an animated spin-off film starring creatures that talk gibberish. Obviously you shouldn’t be asking for much with a movie like that. But that shouldn’t be an excuse for this film to be average. I really liked the first Despicable Me movie, and the second one was OK to me. (In my opinion, it didn’t live up to it’s predecessor). With “Minions”, I was cautiously optimistic.\r This movie made me think of another animated spin-off that came out a while ago, “Penguins of Madagascar”. They both suffer from similar issues. Both films feature the antics of (previously-supporting) cast members who mostly provided comic relief. While the minions just mess around and spout nonsense, there still was opportunity to maybe tell a story with them. Unfortunately, the filmmakers failed to do this as best as they could have.\r The Nelson family were an amusing bunch of characters, but I think their roles should’ve been expanded. As they’re the first humans Kevin, Stuart, and Bob meet, they should’ve had more importance and influence on them. The minions are so impressionable, yet the Nelson’s don’t leave any lasting influence or mark? Scarlet Overkill (Sandra Bullock) and her husband Herb are both fun characters, but neither of them are ever fully developed or made unique in any way. The minions themselves are what you’d expect.\r The plot of the movie revolves around villains attempting to steal the Queen’s crown. Herb’s gadgets make this relatively easy, but if he had them all along, why didn’t Scarlet use them to steal the crown earlier? She’s very capable, but for some reason lets the minions do the work for her. Why?\r I think one of the main reasons this movie exists is to sell merchandise--particularly toys. “Minions” is ultimately a dumb, but harmless kid film. It doesn't live up to the first two Despicable Me movies. It's definitely not as good as Inside Out, which came out a few weeks ago. But if you want to watch it, I recommend renting it or seeing it on Netflix.\r I have reviewed 40 movies (on Metacritic and IMDB), some recent ones, including: Inside Out, Avengers: Age of Ultron, Fast and Furious 7, The Divergent Series: Insurgent, Taken 3, and more. I also review TV shows.\r Notes:\rThe minions’ submissive nature and tendency to have a villainous master was actually a pretty interesting concept IMO. It had never occurred to me that the minions had actively sought out masters; in ‘Despicable Me’ they are all just shown to be employed by Gru and their origins are never really explained."
    },
    {
      "rating": "4",
      "text": "I never got the point while watching the despicable movies, why I should find minions funny, and apart from a few chuckles, this film dedicated entirely to them felt like I wasting too much money on something I shouldn't have."
    },
    {
      "rating": "6",
      "text": "While the minions themselves aren't capable of carrying their own movie with a coherent plot and characters, Minions is enjoyable, amusing escapist fun that small children will undoubtedly enjoy with its dumb slapstick humour."
    },
    {
      "rating": "3",
      "text": "If you've ever seen Despicable Me or its sequel, you will definitely remember the little yellow tic-tacs called the Minions. They stole the show in almost every scene they were in, and they were memorable and cute little sidekicks. However, too much of a good thing isn't necessarily a good thing, and the origin story for the Minions is the perfect example of that. Minions shows what those little bananas did before they met Gru as they journey to the International Supervillain Convention in 1968 and become henchmen to the world's most notorious villain, Scarlet Overkill. The issues with Minions are present from the very first scene and continue throughout the entire film. Much of the humor, as agonizing as this sounds, is supposed to come from the way the Minions talk. That wears out its welcome extremely quickly as you can imagine. Even the jokes that don't concern the Minions are reused numerous times throughout the film, making this movie tedious and repetitive. That could be somewhat forgiven if Minions had interesting characters or a compelling enough story, but unfortunately, this film has none of that. The Minions aren't exactly dramatic characters; they're always the sidekicks, destined to be overshadowed by the villains they serve. Even Scarlet Overkill is a fairly generic villain. She doesn't have any sort of special powers or a unique personality to distinguish herself from other power-hungry female villains. There's never any sort of drama or development with her character. Now onto the unfocused and rushed plot. If you have the attention span of a goldfish, you might find the plot of Minions to be fun, but anyone else will feel like they're being suffocated by the insanity of this film. This movie just never takes a break. There's never a moment where you can calm your senses from the insanity of the previous scene, and it's not because it's some action-packed spectacle. It seemed like the filmmakers were trying to fit as much as they possibly could into each scene so that much younger kids wouldn't be bored. Minions might entertain the least demanding moviegoers and their very young children, but anyone else should stay away from the contrived plot, tired jokes and dull characters littered throughout this movie."
    },
    {
      "rating": "9",
      "text": "this was not what i had in mind going in to see the minions but however it was cute funny and  entertaining enough to atleast admit i liked it really missed the girls though wish they would have atleast shown up but it was good enough i loved bob"
    },
    {
      "rating": "6",
      "text": "While it's not oscar-worthy by any means. Minions is still a fun movie, a lot of the jokes are funny the presentation is great, and the soundtrack is good but not very memorable. Unfortunately the story isn't very deep and Scarlett Overkill isn't a very good villain."
    },
    {
      "rating": "3",
      "text": "The minions are great sidekicks, and sometimes they have hit such hilarious moments in the despicable me franchise that it was hard to dislike them, they are such good characters for comedic effect. But for comedic effect only. They truly cannot carry their own film, and their repeated jokes and gags get rapidly boring, only appealing to the kind of audience who enjoys raunchy and mindless humour. And that is about everything I can say about minions, because this movie is stretched to such thin material, that I find no purpose in talking about story or character development or moral messages because there are none. I would recommend seeing this film if you are a die-hard fan of this franchise, because if you are not, chances are you will end up disliking this film. (P.S, I would not show this film to a kid younger than 6 years old, sometimes it crosses the line)"
    },
    {
      "rating": "6",
      "text": "I thought the first two Despicable Me films were very enjoyable, but the highlight of both movies were the Minions. I thought they were hilarious. However, I thought they worked well as side characters, I didn't think they would be able to hold their own film. I still hold that opinion. Although the first two films were for families to enjoy, this one is for children. Your kids will laugh their faces off at this, but I don't think its as enjoyable for the parents. Sandra Bullock wasn't the greatest as the main antagonist, however Jon Hamm was a highlight in the film. I found him very entertaining in the role that he played, and he was the funniest thing in this movie. The main (Minion) characters, Stuart, Kevin and Bob were very entertaining, but most of it was slapstick humour you'll find funny the first time you watch it, probably not the next million times your kids chuck the DVD on (Kind of like the first Cars). I'll give the film credit, as its just a bit of harmless fun for the kids, but its not a great film in general. My final thoughts on this film are: Your kids will love it, but try to avoid buying it on DVD when it comes out, and avoid millions of viewings!"
    },
    {
      "rating": "7",
      "text": "Although having an uninteresting plot, it is a hilarious film with the Minions doing what is expected of them: to entertain. (Had a lot of laughs in the run of the movie.)"
    },
    {
      "rating": "3",
      "text": "The worst part about this film is the great comical opportunities it had, the final result was unfunny slapstick and the rare joke that was actually funny. The story was boring and the minions' language is now intelligible Spanish,Italian and English; it's as if there was no effort put into this movie. The minions were one of the best parts of the original Despicable Me films, but here they tried to give each one a personality and that just didn't work out, all of the characters were not memorable, I wouldn't have cared in they had all died, that would have done for a better story anyways."
    }
  ]
}