{"id": 2855, "title": "Minority Report", "starring": ["Tom Cruise", "Colin Farrell"], "runtime": 145, "genre": ["Action", "Thriller", "Science Fiction", "Mystery"], "description": "John Anderton is a top 'Precrime' cop in the late-21st century, when technology can predict crimes before they're committed. But Anderton becomes the quarry when another investigator targets him for a murder charge.", "releaseYear": "2002", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/qtgFcnwh9dAFLocsDk2ySDVS8UF.jpg", "categories": {"plot": 7.770833333333333, "acting": 8.6875, "ending": 7.571428571428571, "soundtrack": 5.0, "cinematography": 9.0, "familyFriendly": 6.0, "funny": 8.0, "action": 8.238095238095237}, "reviews": [{"rating": "8", "text": "Steven Spielberg? Tom Cruise? Seriously i was not expecting much from this movie, but I was wrong, as it turned out to be a \"mature\" science fiction movie. I liked how Mr. Spielber presented 2054 A.D. (Even if He was too optimistic I am afraid...), where \"Pre-Cogs\" predict crimes beforehand. This whole \"Pre-cog\" method of peacekeeping, and it use in more and more places every day, raise interesting ethical questions. Is the person really guilty if he/she has not committed  the crime yet, because \"Precrime\" arrested him/her based on the prediction of \"Pre-cogs\"? Are \"Pre-cogs\" infallible? What if they make mistakes sometimes? Is If they do make mistakes, is it worth it for the greater good? Is it ethical to keep \"Pre-cogs\" sedated and placed in a room in their whole life to serve the law, basically taking away they chance to a normal life? These are some of the questions the movie ask from the viewer, while the plot unfolds. The movies main plot is also interesting and keep you seated the whole run time. It is about John Anderton who heads Precrime, and believes the system's flawlessness. However one day the \"Pre-cogs\" predict that Anderton will commit a murder himself in the next 36 hours. Anderton decides to get to the mystery's core by finding out the 'minority report' which means the prediction of the female \"Pre-cog\" Agatha that \"might\" tell a different story and prove Anderton innocent. I can only recommend the movie. It has some interesting twist and turns. Tom Cruise's character is layered and the actors all did a great job in their roles."}, {"rating": "9", "text": "It was very good"}, {"rating": "10", "text": "Again, it's one of those films that are perfect because the mix of action and storytelling just works. While being still another approach to time paradoxes, Spielberg's direction and the dark, original plot elevate Minority Report to something special."}, {"rating": "0", "text": "\"Everybody Runs\". Yeah, away from the damn cinema screen. A convoluted, contrived, predictable and uninteresting mess. The concepts that this movie uses are such an assault on common intelligence. If this movie were a person, it would kick you in the balls, steal your wallet, wave it in your face and then try and advertise itself to you that you just had a good time sitting through it."}, {"rating": "0", "text": "The most boring film I have ever seen in my life."}, {"rating": "3", "text": "It seemed a bit confused to me, in that it couldn't figure out whether to be a thriller or a family comedy. You have very dark moments followed immediately by cute vignettes. It didn't jive well for me. The special effects are beautiful yes; they usefully serve to distract you from the horribly convoluted plot. In an ironic twist, the movie includes far more subplots and \"gotchas\" than the original text. One thing I didn't really care for about the visuals, though, is the bizarre use of color. I found it rather disturbing and oddly reminiscent of Gladiator's butchering of color. The ending, to use a borrowed phrase, is \"spielberged\". It would have been fine, had the movie finished about a half-hour before it actually did. If you've seen it, then you know what I'm talking about; if you haven't then I don't really want to spoil it for you. Lastly, I feel as though Phil Dick ought to be rolling in his grave over this movie. The \"take home\" message of the movie is diametrically opposed to that of the short story on which it's based. This would almost be ok (but not really), if I had agreed with the movie more, but I don't. If you think I'm some kind of purist that just doesn't like screen adaptations, you'd be right. But in this particular case, I saw the movie first; in fact, I hated the movie so much I almost didn't bother with the short story."}, {"rating": "5", "text": "Minority Report is thrilling and has some great special effects, but the entire plot is impossible--and I don't mean the being able to see the future thing. If you really pay attention to the plot you'll see that even in a world where precogs exist, the plot would not be able to happen. Acting is good though, and it did leave me entertained for the first five times that I watched it. But this most recent watching was when I noticed the plot holes."}, {"rating": "5", "text": "What a shame! Minority Report starts out with a cool premise, but it doesn't know how to explore its philosophy and ideas. The movie ends up turning into a kind of peculiar, non-sensical utopia with product placement and strange plot lines. Some of the movie is just so random it doesn't make an impact. Cruise, Farrell and von Sidow are fine as the leads, but they're trapped in a movie that Mr. Spielberg could've done much more with."}, {"rating": "9", "text": "Full on high octane action and kinetic sci-fi thrills, Steven Speilberg's \"Minority Report\" is one of the smartest and realistic science fiction movies of the 2000's."}, {"rating": "10", "text": "One of the most underestimated Sci-fi movies. Unexpected turn of events, good pictures and acting, too. An essay on crime prevention and system flaws from the perspective of the future, many compare it to the also futurist anime ."}, {"rating": "10", "text": "An unlikely classic in amongst endless Spielberg garbage."}, {"rating": "9", "text": "This is my favourite Spielberg movie, but I know it's not the best of the ones he has done. Anyway the acting is nice, the story is interesting and the visuals are stunning."}, {"rating": "8", "text": "Awesome movie, as one of the critics said, it manages to mix a whole bunch of themes into one, and it pleases mostly everyone who will see it. Great special effects, very good acting/casting, and that unique Spielburg style directing you don't see anywhere else. I took one point off because of the ending, as someone before me said, was just too narrated, or forced, as some of Spielburgs movies are. It would've been better if they just let the movie end directly after the climax, instead of having Cruise explain what happened afterward. The other point I took off was because, although the movie is a great thriller, it does seem to lack action, or freshness, after you've seen it. But, as long as you don't \"overwatch\" it to keep the movie fresh, I'd really recommend buying this. Awesome movie..."}, {"rating": "8", "text": "I really liked this movie. It was actoin packed and Tom Cruse really impressed me. The one thing i didn't like abput it was that it was very confusing, and a little over the edge."}, {"rating": "10", "text": "Minority Report is an exceptional piece of work, another great movie form Steven Spielberg and Tom Cruise that shows you a whole new side to the Sci-Fi world. Minority report tells the story of John Anderson, the head of a experimental division that catches criminals before they commit the crime.All things are going well until someone sets Anderson up for murder. Now He's got one chance to clear his name try to find who set him up and why. Minority Report is an amazing film steeped in outstanding special effects and an amazing story based on the short story by the legendary king of Sci-Fi Phillip K. Dick, Tom Cruise is in top form and delivers one of his best and most potent action performances, solidifying why he is one of the best in the business. This film is an amazing example that shows what would happen if we had the power to prevent crimes before they would ever committed. IT shows that a power like that should never be used, but it could also be a benefit to our society. Minority Report is an exceptional Sci-Fi ride that you just don't want to miss. it's a movie that will keep you coming back to it for more."}, {"rating": "7", "text": "\"Minority Report\" is one of those stylish, self-conscious, intricate science fiction events that generate plenty of discussions about its subject matter after it finishes. Themes such as the right to exercise your own free will, the decadence of privacy and the importance of family as the base for a balanced life in society are approached. The setting is futuristc. The overall tone of people's lives in 2054 is hopelessly murky. Director Steven Spielberg uses his tremendous skill as a prodigious technical director to bring jaw-dropping action sequences to life here, not to mention his dead-on ability to emulate the tense atmosphere of classic film noir, now blended with what can be described as a touch of realistic fantasy. The screenplay is mundane at best, though, for there are a couple of weak plot twists which end up causing a feeling of not enough innovation when it comes to building a relevant plot. This 102 million dollar thriller did not amaze audiences, afterall. Either because these people considered it too distant and dark as an escapist entertainment or, probaby, they simply disassociated it from those big, generic summer blockbusters. Mr. Spielberg achieved a slightly pretentious, enormously nice-looking motion picture, but not a particulary memorable one, so to speak. It ultimately lacks some depth and substance. As a Spielberg film, \"Minority Report\" can easily be labelled as average only. If compared to similar flicks, it is definetely above average."}, {"rating": "10", "text": "Greatest sc fi movie since Blade Runner: Spielberg-Cruise-K Dick trio, what more can you ask?"}, {"rating": "9", "text": "Man, this one fooled me big time. It started out like a pure adventure film, like a Raiders or something, and then turned into a conspiracy thriller/poilitical commentary. Once Cruise gets Halo'ed, the film loses a lost of momentum. The ending was well done, it's just that all of the suspense was lost once he wasn't on the run anymore. Despite that, this is probably the single film with the most individually memorable scenes."}, {"rating": "5", "text": "A good movie for some but with boring drama. Loved the visual effects, but besides the not-so-much suspense and action, I could have expected much more."}, {"rating": "7", "text": "Minority Report is a fun movie but at times a bit to complex and Sci-fi for my liking. Don't take this wrong, Minority Report is action packed and full of twists and turns but perhaps I was lucky and just guessed right but I saw the future too. Cruise and Farrell do a great job and the graphics are top notch."}, {"rating": "9", "text": "A perhaps surreal futuristic science-fiction thriller, Cruise perfects it by staying in control of his all-guns-blazing urges but brandishes a tricky yet fascinating personality. The ending comes extremely close to letting it all go in Spielberg style, but it felt like a matter of the poignancy involved when dealing with sensitive areas, alongside the corruption and multi-faceted look of each of the characters. Besides, it still had the action, just with the intellectual superiority, hard-hitting, thought-provoking and the haunting strangeness in both the visuals and the story that many other films don't have. The plot twists were careful enough not to tie you in knots, but remembered the audience knew that it was a science-fiction thriller, and ended up creating something intelligent and mind-blowing at the same time. Strangely, this is both Cruise's and Spielberg's best film that I have seen so far."}, {"rating": "8", "text": "A very clever film with great visuals and design, good acting and writing and great action."}, {"rating": "10", "text": "Enjoyed every second of this movie it was great, spectacular, wonderful and most of all exciting a thriller you should definitely see you could watch this movie a 100 times and you would still enjoy it"}, {"rating": "8", "text": "Minority Report is one of the most unique films I've seen. Tom Cruise stars in his role as John Anderton, lead officer in Washington, D.C.'s pre-crime division set in the mid-21st century. \"Pre-crime\" is a concept that revolves around the ability to stop murders before they happen thanks to three \"precogs\" and their ability to see into the future. This is an inherently controversial way to 'solve' crime but is largely accepted because it seems perfect considering that no murders had been committed in the six year experiment. The conflict is introduced when Cruise finds out that he is the next expected murderer. This puts him on the run from the division he once led and on an investigation to find out how he is supposedly going to murder someone he's never met. The action isn't overdone but rather placed well throughout the film. The combat sequences could've been better but they were still enjoyable. A few of the plot points were a little weak also but there weren't actual holes or anything. The acting was solid with Cruise and a supporting cast of Colin Farrell and Max von Sydow among others. The best part of the film, though, was the interesting plot. Even with the few weak parts it's just a very interesting story that develops nicely. Many movies struggle with the concept of the future being predicted but Minority Report does a great job and is very entertaining."}, {"rating": "8", "text": "Most people don't recognize the name Phillip K. Dick and when you read his name, you probably just snickered. He might not have had an easy childhood with a name like that and you may not recognize his name, but he is to Science Fiction what Stephen King is to Horror. The films Blade Runner, Total Recall, Screamers, Paycheck, A Scanner Darkly, Next, & The Adjustment Bureau were all based on stories or books that he wrote. Minority Report is yet another of his stories developed for the big screen and one of the most popular. This ingenious film was Directed by Stephen Spielberg and starred Tom Cruise. I am by no means a fan of Tom Cruise, in fact, I've made it a point over the last few years to avoid seeing anything he is in, but this was one film I couldn't miss. To his credit Cruise was very good and exciting throughout, showing a lot of charisma, it was unexpected, but a welcome change from what we normally see from him. This terrific futuristic tale tells the story of pre-crime, a system in which high functioning autistics can predict murders with a very narrow margin of error. John Anderton (Tom Cruise) is the lead investigator, whose job it is to stop these crimes before they happen. Things are going well for him, that is until his name comes out of the machine and he becomes a target of his own men. The story was deep, yet somewhat complicated, as I was confused at several points in the movie, but that's how you know it's good Science Fiction. The action and chase sequences were fantastic, as was the direction and special effects. The story does however leave some lose ends and I found the precogs to be more than somewhat creepy. It almost seemed like these disabled people were being abused for their unique abilities and not a single character in the film had any issues with that. Minority Report is a long, complex story, but it's fast paced, visually impactful, and will make you think. It only took thirty years, but you can finally add a Tom Cruise film to the list of movies I enjoyed."}, {"rating": "4", "text": "Inconsistent visually, Terribly bad action scenes, and an inconsistent plot as well. It's not that good of a movie to be honest and I could barely sit through it. They took an interesting premise and ruined it."}, {"rating": "10", "text": "\"Minority Report\", directed by Steven Spielberg, is an ingenious and powerful sci-fi. It's also dark, heart-pounding and intense. This is the kind of movie that I have always wanted to see: an unpredictable plot combined with ferocious action and stunning visuals. Honestly, the worst thing about this film is the title."}, {"rating": "7", "text": "Overall, I definitely enjoyed this one. Tom Cruise does very well in this role and I also really enjoyed Colin Farrell here. The look and feel of the film is also really well done and the second half of the film is fantastic. In addition, the special effects are well done and the story, though slow forming, is very well put together and engrossing. However, on the negative side, the first half is iffy for me. As we are introduced to this futuristic world with no murders, the explanations and presentation of everything is spotty at best, leaving the viewer a tad confused and, at times, bored. However, once you finally wrap your head around everything, the film really takes off. I never really thought the \"action\" sequences were phenomenal, but otherwise, everything really began to click and the film had a very exciting and tense conclusion."}, {"rating": "9", "text": "A great example of qualitative sci-fi. The storyline is logical, has no even plot holes and everything is well explained. The cast is awesome, so are the memorable and well-written characters with their own motivation. The visual design|style is outstanding too."}, {"rating": "7", "text": "yeah i thought it was pretty good, it did not blow me away though. Some of the action was really good and some was too cgi heavy that it lost me completely. The jet pack scene was awesome. The whole plot had some nice twists in it and near the end it really started to win me over. The first half however felt like a remake of an old swartzenegger movie kind of like the 6th day meets total recall. In the end though it does have enough of its own personality to come off as fresh and a cut above most sci-fi."}, {"rating": "8", "text": "Um dos melhores ficções científicas e suspense já feito."}, {"rating": "6", "text": "An okay popcorn movie. It's not Raiders of the lost ark to me nor Last crusade to me, just okay."}, {"rating": "9", "text": "Based on the short story by the legendary Philip K. Dick, Steven Spielberg's \"Minority Report\" was an incredibly interesting experience. I'd have to say that this film is easily one of the best science fiction films of the 2000s. The overall premise of the movie is really novel as well as provocative, and all the performances help to ...tell this complex narrative with great intensity. The film's story also delves into some very complex literary topics, such as: determinism vs. free-will, legality vs. politics, and Self-perception. One of my favorite aspects of the film is the way it's shot. In terms of lighting, Spielberg used a deep contrast between lights and darks which really helps to give the film a sort of a badass neo-noir feel. Spielberg also bleach-bypassed the negatives of the film in order to desaturate the colors of overlit scenes. Both of these technical aspects helped to achieve the very unique visual style that this movie has to offer - I style that I found relevant to the rest of the movie's tone. In terms of action, there's a pretty good shovelful of these really badass set pieces that Spielberg is known best for. Also, Spielberg reunites with John Williams to create yet another amazing soundtrack. My only problem with the movie was the ending. While it was pretty uplifting, I didn't really think it fit the tone of the rest of the movie. However, it doesn't take away from the film in any way - I still enjoyed the movie immensely and a happy ending never hurts. Anyway, in the end, I think that \"Minority Report\" was a near seamless film that was as interesting as it was aesthetic, and fun."}, {"rating": "8", "text": "Spielberg? Sci-fi? Tom Cruise? How can you go wrong? \"Minority Report\" is a delightfully entertaining and thoroughly engrossing film. I don't know why it took me so long to get around to seeing it  this is another Spielberg masterpiece."}, {"rating": "8", "text": "A well-made dystopian film about the role of police and public safety VS individual rights. The film has a unique look and the action sequences are tense with well paced plot points."}, {"rating": "9", "text": "A truly great movie hindered by a couple of minor flaws.  First and foremost this is one of Spielberg's best movies, and I can't believe it only received one Oscar nomination.  Better than none, but still.  The movie is thought provoking and should be watched more than once in order to soak everything in better.  The unique bleached look to the film is just about perfect, and the futuristic world of the film is impressive.  It has moments of true emotion and the acting is just about flawless as well.  It's only flaws are that the last couple of minutes weren't that great, and some of the cop on the run action wasn't as engaging as it should have been.  Not that no action was any good, it's just that some big moments fell kinda flat.  These are just nitpicks however in a film destined to be remembered as a classic.  It's one of those rare movies that actually uses an ambitious premise well throughout the entire film and not just the beginning."}, {"rating": "10", "text": "This is probably one of the best movies Steven Spielberg has made and one of the best movies ever made. It is so brilliant, the acting is wonderful, the visuals are stunning, everything in this movie works"}, {"rating": "8", "text": "Spielberg can be such a blessing and a curse at the same time for a movie.  I feel like \"Minority Report\" succeeds despite his tendencies.  I have a theory that Spielberg intentionally hires actors who give quirky performances in an attempt to make the movie memorable, but it just ends up being distracting to an otherwise really good movie.   Also, ILM, totally blew it here.  The backgrounds look incredible, but any time the movie focuses in an a CGI element, it looks so bad that it takes me out of the experience.  I give it a B, next time you’re in the mood for a movie, this one won’t disappoint."}, {"rating": "8", "text": "Minority Report exceeds in the majority.\rA breathtakingly genius concept of a future without crime that becomes overwhelmingly corrupt. Tom Cruise achieves massive success."}, {"rating": "10", "text": "This is the most thrilling science-fiction movie I have ever watched that is directed by Steven Spielberg. With excellent plot, combined with absolutely professional and successful performances of the cast, Minority Report is an amazing film which reminds me of other impressive ones such as Rian Johnson's Looper or Christopher Nolan's Inception. I definitely recommend this one"}, {"rating": "9", "text": "This has always been one of my favorite films.  Coming right on the heels of A.I., it continues the blend of science fiction and a beautiful yet sad future, and it does it with a  Blade Runner twist or two that loads it with action and testosterone.  It's a good fit 10 years after it was made in today's sci-fi storylines and it gives you a lot to see and think about.  Pay attention to as many details as you can, keep the popcorn handy, and be prepared to enjoy this amazing take on crime, love, and predestination.  The first ten minutes tell you what to expect; the last ten minutes prove you were wrong.  Wow!  Cruise has never been better and Spielberg does it again.  See it."}, {"rating": "7", "text": "Brilliantly directed but poorly written. The plot often skips logic and the ending is a complete cop-out but Minority Report is thrillingly entertaining and visually gorgeous."}, {"rating": "5", "text": "The whole movie contradicts itself constantly. It might have been a theme that the facts about the trio of pre-crime humans was falsified because of government being all government, but it wasn't conveyed well at all. At the beginning they say that only murder can be seen into the future, but then they have an advertisement saying that it could prevent other things like rape, and from then on they act as though the ad was true, but then at the end they say only murder can be detected again because it fits the movie's agenda.\r #Inconsistent"}, {"rating": "9", "text": "Extremely good! Very interesting sci-fi ideas with lots of action. The story is well-written and well paced. Also apart from the \"seeing into the future thing\" it's not a ridiculously non-realistic vision of the 2050s."}, {"rating": "10", "text": "There is a lot to like and love here.  Visual appeal is at its highest and finest with this film.  Special effects are one of a kind and second to none.  A gripping story that goes for an absolute thrill ride.  I can't put it down anytime I decide to watch it.  It's an action-packed, crime mystery with twists and turns all the way through.  I love the way it looks on the screen with all its technical glory.  Tom Cruise shines as the Detective who won't be beat.  Prepare for a futuristic eye scan"}, {"rating": "9", "text": "The reason I am giving 9/10 is because this movie is one of the best futuristic-type of movies that make you feel like it could happen one day (at least some aspects of it such as AI predicting people's actions (and murders) from behaviour of people). Movie also predicts some technology that is real today such as MR (mixed reality), Facetime and retina recognition. Mind you this movie is from 2002 but created way before that.Tom Cruise is amazing and all actors do good job overall. Steven Spielberg does great job with amazing camera shots and angles. Movie isn't perfect but pacing is very well done compared to movie length, which is a lot. Plot twists are real good but some things are not handled well (such as a character death) and some movie-lore-related paradoxes. Movie tries to handle them somehow but once you think deeper, it stops making sense. Overall, amazing movie. Cyberpunk (blade runner) vibes!"}, {"rating": "8", "text": "Spielberg nunca hace una mala película (salvo Indiana Jones y la calavera de cristal) y acá lo demuestra haciendo esta obra futurista que habla sobre lo impredecible y como el sistema puede manipular a la gente siempre que se le de esa responsabilidad. Ya el hecho de que Anderton escuche \"La inconclusa\" es una metáfora de toda la película."}, {"rating": "8", "text": "One of best screenplays based on a tale of Philip K. Dick. The use of SFX is well measured without affecting the plot that has quite effective twists but a naive, sift end. One of lesser best role of Tom Cruise."}, {"rating": "8", "text": "Like so many Hollywood movies, this movie pairs stunning visuals and awesome techniques with a mediocre, unconvincing story.  In this case the insistent flash-bang-whiz helps to make up the deficit, as the viewer has no time to reflect on how bizarre and silly much of the story is.  So watch and enjoy the spectacle, but don't worry too much about holes in the plot or cookie-cutter characters.  A few barely functioning psychics float in a pool at police headquarters, and occasionally they get a vision of a murder about to take place, which results in a wooden ball rolling down a chute and into the hands of detective John Anderton, who quickly tries to locate and then shut down the crime before it can happen.  John has issues of his own, such as drug use, the disappearance of his young son, and the subsequent collapse of his marriage.  Then one day Anderton himself is fingered by the \"pre-cogs\" and he has to go on the lam and try to figure out who is out to get him and why.  This leads to a few plot twists and an unconvincing wrap-up.  But there are enough memorable moments - such as Anderton being followed by video ads in a shopping mall, a scientist and her amazing, moving plants, and mechanical spiders that invade an area on behalf of the police and identify people by shining a beam into their eyes - to make this an exciting ride."}, {"rating": "9", "text": "Very FunMinority Report is a very well done film by Steven Spielberg and a much needed one after how disappointing A.I. was."}], "recommendations": ["upgrade", "looper", "moon", "oblivion", "reminiscence", "fantastic_beasts_the_crimes_of_grindelwald", "zodiac", "the_equalizer_2", "cube", "sicario_day_of_the_soldado", "blackhat", "mission_impossible", "twelve_monkeys", "what_happened_to_monday", "sherlock_holmes", "the_invasion", "the_hunger_games_catching_fire", "coherence", "captive_state", "inception", "the_accountant", "the_prestige", "valerian_and_the_city_of_a_thousand_planets", "midnight_special", "arrival"]}