{"id": 1003, "title": "Miracles from Heaven", "starring": ["Jennifer Garner", "Kylie Rogers"], "runtime": 119, "genre": ["Family", "Drama"], "description": "When Christy discovers her 10-year-old daughter Anna has a rare, incurable disease, she becomes a ferocious advocate for her daughter’s healing as she searches for a solution. After Anna has a freak accident and falls three stories, a miracle unfolds in the wake of her dramatic rescue that leaves medical specialists mystified, her family restored and their community inspired.", "releaseYear": "2016", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/hz9VF1TfaM0D04pYneSXUkNeOZv.jpg", "categories": {"plot": 8.173913043478262, "acting": 7.809523809523809, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "Miracles From Heaven (a story based on true happenings) is an excellent movie from every perspective. This story is about a family, it's about hope, struggle, faith and commitment. It's about pushing through and overcoming from many angles. Tears will flow during this beautiful yet shocking, tough and growth provoking reality. Yes, this family has a relationship with God ...and it was encouraging to witness. It's a movie that explains the beauty and strength that resides in faith... but this is not a religious movie (it's a very well done depiction of circumstances that actually took place... it's one families real life happenings). The acting was excellent (Jennifer absolutely shined and so did many others) ...the directing and editing was superb (this movie touched the entire audience that I was a part of... hearts were impacted and tears were falling). I highly recommend this movie to all people (more movies should inspire audiences like this). A Great Experience!!!"}, {"rating": "3", "text": "...The movie itself, is bad. It isn't overly preachy, and has a great performance from Jennifer Garner. But it's really dumb. There are useless characters that are introduced then ignored until the end, and then we're supposed to suddenly care about them. The whole film to me was just extremely flat and one-dimensional. And I know my experience is what made me hate this film so much, but I can't separate the two. The experience and the film go hand-in-hand and I had a terrible experience thus making me hate the film as well. I can't say this is the worst film of the year, but I can say it's the worst theater experience I will probably ever endure..."}, {"rating": "4", "text": "I liked the movie ,but was disappointed that they used a black woman for the role of Angela the waitress  who befriended them.  Angela was in fact white.  Is this not PC over kill."}, {"rating": "8", "text": "A surprisingly good faith-based family drama that's decidedly a cut above most of the trite, formulaic, dogmatic offerings typical of this genre. With a focus that's more spiritual than religious, the film delves into some rather heady metaphysical topics through its refreshingly candid writing, backed by fine performances and appealing special effects. Even though the picture's narrative is fairly predictable and has a distinct point of view, it never relies on overly simplified dialogue, blatant moralizing or one-dimensional characters who look like they've just stepped out of Sunday school class. Don't let the cynics or the subject matter steer you away from this one; give it a fair shake, and you might be pleasantly surprised."}, {"rating": "8", "text": "Family film, though the length may get to the little ones (149 min).  Only the most cynical will find nothing of emotional value.  Bring the Kleenex.  Other faith based films tend to hit you over the head with the religion.  This one does not, and in the end, that is its most redeeming quality."}, {"rating": "10", "text": "great movie. great actors. film not about religion. film about family, people, relation, hope and love. jennifer garner terrific, but other actors also so good."}, {"rating": "1", "text": "If your a religious, you will like this movie. If your not, like me, then you wont enjoy it. Just like that other movie, i was forced to watch this because my family is religion."}, {"rating": "7", "text": "Based on a true story, one family has their seemingly perfect life turned upside-down when one of their daughters comes down with a mysterious medical issue. If you've seen the trailer, then you know how all of this plays out. It's a common complaint today for trailers to give away too many of the film's surprises, but this movie has the first trailer that I've ever witnessed spoil the entire thing.\r Okay, so maybe not the ENTIRE thing, but you'll know how the main parts play out before going in if you watch it. So does that mean there's no point in watching it? Not necessarily. The moments leading up to the big reveal are still sweet, touching, and even heartbreaking enough to keep things enjoyable. Something that is made possible by a truly incredible cast.\r While perhaps not given the best dialog, Jennifer Garner's mother who is out to do anything to save her baby girl is nothing less than 100% believable. Young actress Kylie Rogers really has you believing the pain her character is going through. The rest of the cast, while not given as much to do, are just as great at selling the emotions on display.\r Now this is a faith-based film. So expect messages of Jesus and faith to be found within. The big hook here is that a little girl's life was saved by a miracle after all. That being said, it's not as preachy as one would expect. It still sneaks it's little Sunday school lessons here and there, with the big sermon saved for near the end, but for the most part the focus is in fact on the story itself. Given the fact that it isn't constantly bombarding you with a nonstop sermon like so many other faith-based films do, Miracles from Heaven will likely be more tolerable for non-believers. Still not a win for them though.\r All in all despite being a touch predictable here and there, as well as being outright spoiled by it's trailer, Miracles from Heaven still has enough power to pull at the heartstrings. No, not because of it's message of faith. Those moments are really just preaching to the choir. It's emotional because this is a story about a child going through a horrible situation while her mother does everything she can to fix things. The performances by Garner and Rogers sell the entire thing. It's a sweet and sad movie. One that does get in it's own way at times, but still good in the end. Even if perhaps it ends up being only for a certain audience."}, {"rating": "10", "text": "Miracles from heaven is an amazing movie, I have watched this movie more than 5 times and still loving. I think everyone should watch it. It's also an emotional movie, I cried when I watched it."}, {"rating": "7", "text": "Rating is heightened due to the story being a true story.  Acting was very good as was the filming. As I have stated in the past if you are a believer the movie will be more entertaining & meaningful.  Worth your time & ticket cost."}, {"rating": "10", "text": "I have never seen such a touching and powerful true story in almost my entire life. This is one of the best christian movies out there and I definitely recommend it. The acting was phenomenal for everyone, not just Jennifer Garner. I really think this is a really fun and interesting movie for the whole family to watch. It is a bit long and obviously predictable, but this movie defnitely had me watching and at some point, almost in tears. (97/100)"}, {"rating": "5", "text": "The movie is better than most faith based films. Aside from Jennifer's performance which is great and a interesting plot which never fully goes to where it needs to. The movie ends up becoming another preaching to the quire type film."}, {"rating": "7", "text": "Pretty cliché movie about a girl who is terminally sick and gets well, except it's true!  This movie was done in real life mode; with a sick daughter, the mother loses her faith in God and stops going to church.  Not your churchy movie story line.  My one objection to this movie is the parents going into debt, the house, the land, credit cards, everything.  If they didn't get a movie/book deal, we'd be reading about them in the newspapers, another homeless family who lost everything.  I don't know how many other families that see this movie will do likewise, but I'm sure more than a few will wind up homeless."}, {"rating": "9", "text": "This true story is touching hartwarming and a sweet story if you don't believe in god please look around you because everything you see god made and then believe in god like me"}, {"rating": "9", "text": "Recently, there has been movies coming out claiming that heaven is real: like “90 Minutes in Heaven” and “Heaven Is For Real.” After those movies came out, “Miracles From Heaven” came right after. Miracles from Heaven was based off a true story. This story is a very emotional especially to those who are parents because you will be able to relate or start thinking “What if this happened to my daughter/son?”\rThe movie tells a story about a young girl, Anna Beam (Kylie Rogers) and her family’s sad story that turned out to be an incredible and memorable story.  She was fine at first but then started to get pains in her stomach. She went to several doctors to find out what was going on and finally they said she has a rare, incurable disorder that leaves her unable to digest food. Her mother and father, Christy Beam (Jennifer Garner) ,  searches everywhere for a cure for her daughter but didn’t have any luck. Until one day, Anna was messing around on a hollow tree with her 2 sisters, Abbie and Adelynn Beam. Anna fell in the tree and didn’t get hurt and her disorder was miraculously gone.\rThis movie was directed by Patricia Riggens. Patricia is a Mexican film director. She is known for directing the film Lemonade Mouth in 2011 and Under the Same Moon in 2007. Patricia took a family's story and brought it into a movie. She brings to life the despair felt by the family. She showed how the mother desperately searched everywhere to try and find a cure for her daughter making risks and sacrifices along the way. Patricia Riggens showed that the mother loved and cared for her daughter a bunch.\rThe movie showed the perspective of Anna so the audience can see and feel the emotion the character (Anna Beam) is feeling. It also shows how the mother is losing hope more and more as she continues to search for a cure but is unable to find one. Christy Beam did not give up, though, she continued because she can’t stand to see her child in pain. Although I did not like how the dad and the sisters were not involved as much. The movie only shows the mother rushing around trying to search for a cure. The father, Kevin Beam (Martin Henderson) didn’t even want her to leave with any to go search. If I were him, I would have gone with them Something could have happened while Christy and Anna were away or something could have happened to Anna and Christy that they would have needed help but instead, they went alone but other than that they seemed to be parents that cared about their kids a ton. The father and the other kids, Abby and Hailey Beam.\rOverall, did a great job directing the film. She could have cleared it up a bit more; it seemed the mother cared for the child more than the father. Other than that, this story was an amazing, emotional story that is one of my favorites."}, {"rating": "10", "text": "A true storyMiracle ... or how to remain optimistic. I won't say that you have to believe in God because faith is omnipresent in this film. But, whatever you are going through, because of this film, you will know that you will never be alone anymore. It is a wonderful film which shows you that you should never give up. It is impossible not to cry but what a beautiful film. The actors are amazing. Jennifer Garner is perfect in this role.What else can I say ? It is a incredible story and I just can tell you that you should see this film."}], "recommendations": ["wonder", "heaven_is_for_real", "i_can_only_imagine", "the_hunt", "collateral_beauty", "me_before_you", "the_book_of_henry", "the_glass_castle", "courageous", "into_the_wild", "the_descendants", "flipped", "i_still_believe", "bridge_to_terabithia", "the_florida_project", "blue_valentine", "the_fault_in_our_stars", "the_notebook", "the_perks_of_being_a_wallflower", "manchester_by_the_sea", "brokeback_mountain", "captain_fantastic", "the_pursuit_of_happyness", "if_i_stay", "about_time"]}