{"id": 3060, "title": "Mirrors", "starring": ["Kiefer Sutherland", "Paula Patton"], "runtime": 111, "genre": ["Horror", "Mystery", "Thriller", "Drama", "Fantasy"], "description": "An ex-cop and his family are the target of an evil force that is using mirrors as a gateway into their home.", "releaseYear": "2008", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/bt5a4ThyLpLTsia2e2ZTLzQjXO0.jpg", "categories": {"plot": 4.296296296296297, "acting": 5.352941176470588, "ending": 2.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "With some gruesome deaths,great acting performances and interesting and original story,mirrors had everything to keep the viewer entertained but,unfortunately,the movie falls in the classical clichés."}, {"rating": "10", "text": "I Thought it was very Jumpy, and a great film to watch in the dark, why all these bad reviews?"}, {"rating": "10", "text": "This movie very good at what it set out to do: to give the creeps every time you pass by a mirror!  There is something inherently scary about mirrors anyway - the pristine reflection of our own visage can unsettle anyone who goes to the bathroom in the middle of the night and forgets how they look. Then add the ability of your reflection to act beyond your control, and to kill you, and that is a strong plot point.It is given further grounding by steadily revealing something that people used to believe, that reflective objects or surfaces, such as blood or water, were considered a conduit to the spiritual world in ancient times.  The acting is great and there is more to the atmosphere than just \"bad\" lighting.  The sets are terrific, and wonderfully done.  Overall I think this should have received much better reviews, but often critics are not very adept at reviewing the horror genre."}, {"rating": "5", "text": "This movie is bad in general .... But it is well made."}, {"rating": "2", "text": "This movie was uttely pointless and a waste of an attractive cast's talents. The script is garbage and the acting could be a lot better."}, {"rating": "2", "text": "The plot was so unclear & confusing.... there was (I think) a ghost (burning woman in dept store), then there were some demons which possessed 'Ana'... all muddled up & seemingly appeared for different reasons. Sutherland's acting was not bad though. I must thank the guy next to me who kept jumping off from the occasional boo! scenes. It was him who kept me awake during the whole movie."}, {"rating": "1", "text": "I just saw this, and it was literally the stupidest movie I've ever seen. I'm not exaggerating. I've seen Turkish Star Wars, I've seen Plan 9 From Outer Space, and I've seen 2 Girls 1 Cup, and Mirrors is the worst of them. Sutherland must REALLY have needed the money. Watch out for the sequel, where instead of mirrors being horrific dangerous nightmares, pez dispensers will be."}, {"rating": "0", "text": "One of the worst movies ever. The plot doesn't make any sense, and when you think it's about to end, it suddenly introduces a Nun-turned-Monster so ridiculous I was speechless. And the scariest thing about it it's a pigeon. I want my money back."}, {"rating": "5", "text": "I'm slightly disappointed by this one. It started out as a sort of slasher, then quickly turned into investigation, then into supernatural. Slasher movies aren't necessarily my favorites, and I don't like how it quickly turned into an investigation movie and a boring one at that. Investigation in horror can be done right if it's coherent and interesting, which this one was not. The Ring is a great example of an investigation horror film. When it turned into supernatural, that was more of what I was expecting from this film, but it still wasn't terribly entertaining or even scary in the slightest. I think this went more for the \"cool effects\" route. Speaking of which, the mirror effects did look great, and it was probably the best part of the movie... but if the special effects are the high point of a film, I don't think you're gonna get any quality entertainment."}, {"rating": "2", "text": "A typical Hollywood horror movie with a lot of blood/gore/boredom.The plot is pretty much forced like every other standard horror movie but it does bring its own uniqueness with the mirrors element of the movie.Unfortunately, a lot of it is very weak and see-through forcing many characters to do things that are questionable.Kiefer Sutherland's acting is pretty solid and he does carry the movie. Sadly he alone is not enough as the plot is very forced with sudden and pointless jump scares which are quite predictable and meh.The ending tries to be interesting and it does have a ring to it but sadly it's pretty much poor executed.A fun-flick to see with friends, popcorn and a couple of drinks.As a single experience, those who are looking for a horror-chill experience might not find what they seek within this movie.+ Mediocre acting+ The movie looks nice overall+ A simple but cool idea regarding the mirrors- Stupid jump scares- Forced plot- Common predictable horror props throughout the runtime"}, {"rating": "2", "text": "It's not enough having a 7 years of bad luck if you broke them, in this movie mirrors can kill you. Don't say..."}, {"rating": "9", "text": "Excellent movie, Kiefer Sutherland was great, the story slacked a little near the end, but otherwise fantastic!"}, {"rating": "7", "text": "A enjoyable movie and very underrated which fullfills its purpose very well, recommended viewing."}, {"rating": "1", "text": "Horrible B-horror movie that has to compensate the lack of atmosphere and a decent story with huge amounts of blood and gore..."}, {"rating": "10", "text": "Really good movie."}, {"rating": "8", "text": "This movie was good, not GREAT! But good, I thought Kiefer was pretty good. And that jaw-ripping part scared the crap out of me! Even with Amy Smart nude, I still couldn't keep my eyes off the jaw, instead of where other people were paying attention to. Overall, it's a good movie. It's been awhile since I sat down and enjoyed a GOOD horror film."}, {"rating": "3", "text": "Meh. It's a typical \"horror\" flick that has little-to-no sense. The characters are poorly developed and lacking in substance. Also, the jaw part was very unncessary, even though the gore was laughable at points."}, {"rating": "7", "text": "Very good movie. Not as good as The hills have eyes yet there were some parts that were pretty creepy. The jaw part was unexpected but I thought it added the gore to the movie. Overall, somewhat disappointing ending, but I thought it was worth the money for the ticket."}, {"rating": "9", "text": "Kiefer was very good - plot a little thin but still enjoyable."}, {"rating": "9", "text": "A good horror flick. Good acting and some surprising moments. Very entertaining movie. Much better then the critics say."}, {"rating": "2", "text": "I'm so close to giving this a 1. It was a really bad movie with plot holes and other things I cant even begin to describe."}, {"rating": "2", "text": "People saying the movie had plot holes must not give the movies they watch any thought at all. The movie really doesn't have any plot holes. It is what it is. The ending is meant for you to thank back through the movie a little and you can easily figure out what happened. That being said...the movie was pretty bad. Nothing really scary about it. Lame story. Decent acting. I like Kiefer but I laughed everytime he screamed a cuss word for no reason in the movie. Literally every scene his character had an outburst and ends the scene saying \"God Damn*t\" or \"Sh*t!\". I've also read a couple reviews saying how the special effects are one of the positive things about it. Really? There were a few special effects in the movie that looked so bad or cheesy that it really distracted me from the scene. First instance was when Kiefer's character caught on fire. It was so obviously CGI that it looked bad. The way the Ana's character's face gets distorted looked so cheesy as well as the faces in the mirrors trying to push out. Overall not a good movie. This coming from someone who enjoyed Aja's first 2 movies. High Tension (Switchblade Romance I believe is the original title) and The Hills Have Eyes remake. Loved both of those...what went wrong with this movie? The whole idea was poor from the start I think."}, {"rating": "7", "text": "Very freeky, i saw it in the movies and liked it."}, {"rating": "5", "text": "Some good special effects, nice production but it's story is far fetched and not very frightening. It all looks very familiar and it lacks originality. The performances are fine. Empty and doesn't involve the viewer."}, {"rating": "9", "text": "Outstanding and gripping supernatural thriller. Solid performances for Kiefer Sutherland and Paula Patton complimented the roller-coaster ride of exhilarating special effects from Director Aja. The fascinating back story ties the present to the past nicely and one is kept on the edge of their seat while searching for an explanation. Absolute goosebump material and definitely one of the more memorable movies of the genre in recent years."}, {"rating": "6", "text": "A mirror doesn't account for the negative space that lies beyond the parameters of its reflection. But within this negative space, the replicas find safe passage. These roaming imitations seek signification from the next mirror which gives them a fleeting sense of corporeality before their authentic equivalent carelessly resigns them back into the oblivion of being hypothetical. No wonder the department store demon scratches out the name of the person that could set its bastardized form loose from the life-supporting looking glass. These mirror men, these mirror women, they're only auxiliary members of the human league. Ben(Kiefer Sutherland) is their latest hope for deliverance from this reactionist netherworld. At one point in \"Mirrors\", the nightwatchman catches on fire, but the invisible flames doesn't deter him from returning to the Mayflower, a department store-cum-mausoleum, ravaged by an inferno. In an old-school haunted house film such as \"The Amityville Horror\", the movie would be essentially over if the Lutz family had the common sense to pack up and leave. The success of this genre is contingent on its characters being stupid. They're gluttons for punishment. These people are often painfully slow in catching the hint. But the nightwatchman has no choice in the matter; his work follows him home, his family suddenly placed in jeopardy. Asian horror movies pioneered the novel idea that an entity no longer needed to be confined to its originating jurisdiction. Since the malevolent presence exists wherever there's a mirror handy, Ben can remain at the department store without \"Mirrors\" resorting to the autonomy of the idiot plot. It's not M. Night Shyamalan's \"The Sixth Sense\", but \"Mirrors\" delivers its fair share of chills, most notably, a particularly grisly murder that wouldn't have passed muster with the MPAA had this been an independent production. It's dramatically effective, however, because now Ben is emotionally invested in his war with the reflecting consciousness, a vendetta. Now this job for the ex-cop is personal. Driven by the summer blockbuster mentality, however, \"Mirrors\" climaxes with a little too much brio(borrowed from William Freidkin's \"The Exorcist\"), but its disquieting coda almost elevates this junky remake of Sung-ho Kim's \"Geoul sokeuro\" from close-call to guilty pleasure."}, {"rating": "8", "text": "Not very enticing story - good gore - Sutherland is excellent."}, {"rating": "10", "text": "I totally loved this movie, it was so freaky.. especially the little girl Anna when she was possessed and then when she was old.. I dont know why ppl always give it a low rating.. im sure they'd never even be able to plot a good movie."}, {"rating": "5", "text": "Long: YES, Scary: YES, Cinematography: BAD, Plot: BAD, Cast: OK, Recomend to watch: NOT on the cinema but rent the DVD"}, {"rating": "6", "text": "The night watchman for an abandoned department store begins to question his sanity when he begins experiencing horrific images from within the store mirrors. As the visions transform into a terrifying reality, Ben must unravel the mystery behind the store's sordid past or face the wrath of the restless spirits within. Alexandre Aja's third foray into feature-length Horror is a considerable let down after the smash hits HIGH TENSION and THE HILLS HAVE EYES remake. MIRRORS never presents a consistent canon when it comes to the extent of the spirits' powers. First, it seems that they have the power to posses a person after looking in the mirror, then it seems they can steal the person's identity, entirely. The spirits are able to jump from the haunted location in to any other building with no established rule set, either, and their complete ability to interact with our world is dubious at best. It all seems so convenient and contrived that it becomes impossible to suspend disbelief. Kiefer Sutherland is outrageously over-the-top and can't be taken seriously in the role. Where the mirror motif offered Aja the potential to provide supreme tension and eerie atmosphere, he squanders every opportunity to unnerve the audience by using cheap shocks and excessive gore instead of a creating a slow suspense and creepy mood. The passive observer may take some pleasure in a few unexpected jumps, but it is difficult to ignore the logical inconsistencies and poor plotting."}, {"rating": "1", "text": "This movie was a good blood fest but a terrible plot that shoots it down into a spiral of sci-fi twist and leads to everything just looking backwards. Don't waste your time."}, {"rating": "5", "text": "Well that's me dome looking in the mirror.\r The story is about a ex-cop lands an odd job working as a security guard at a burnt down shopping center in New York City. The blaze killed dozens of people over 50 years ago and strange things have been happening since. When he starts seeing odd things in the mirrors he begins to look for answers. He has to find out why the fire was started and what the mirrors want from him before it is too late.\r This movie can be scary and gross with the blood and gore, but it dose have it's dull and flat moments that sometimes made it hard to watch at times."}, {"rating": "1", "text": "I haven't seen the film \"Mirrors\" is supposed to be based on, but the end result is simply awful. The plot lacks any consistency whatsoever. It's literally just one plot device after the other, making the film entirely pointless and boring to watch. Most of the ideas seem to come from a bunch of 15-year-olds smoking pot at their parent' attic and trying to come up with something similar to \"Poltergeist\" or \"The Ring\" but failing at it in every possible way. I rarely felt so ripped off as I felt after watching \"Mirrors\". If you like to see a film that tries to include all the clichés of famous horror films and fails miserably, try \"Mirrors\". Otherwise, try a better film."}, {"rating": "7", "text": "This film starts very well and takes advantage of good horror premises that, however, are nothing really new: other films have already used mirrors, and their supernatural and psychological connections. In this case, the film brings a good ghost story involving the mirrors of an old luxury department store. However, director and screenwriter Alexandre Aja was not able to give us a satisfactory conclusion to a film that starts so well.The script, really, starts off in the best way, introducing us to the main character, a former New York policeman who killed a person in a shootout, getting psychologically shaken and abandoning the police. With alcoholism, the end of his career and marriage, the unwanted post as a night guard in an abandoned building is unavoidable. And that's how we got to know the Mayflower, a multi-story luxury department store that was badly damaged in a fire. It won't be long before he discovers that the building has a past and that there's something dark that seeks to do evil through the store's mirrors.The biggest problem I found with this movie is the insipid way it ends. In fact, by going through the archaic clichés involving psychiatric hospitals, the film completely disappoints us and introducing a nun into the story was even stranger. I don't even want to talk about the open ending, bad enough to make us want to slap the film's director. There are, however, good horror scenes, quite macabre deaths to make us widen our eyes and a good job of suspense and atmosphere that give the film a pleasant tension.The cast is led by Kiefer Sutherland, an actor capable enough for the task, but who, however, does not go beyond the average. Even so, he is the best actor present and the one that stands out the most. Jason Flemyng and Julian Glover barely appear, Paula Patton and Amy Smart are boring and seem to be there only because it takes a good-looking actress or two for the movie to work.Technically, the film displays very good and well-executed cinematography, which takes full advantage of the decaying building (located in Bucharest, capital of Romania) and the darkness that reigns inside. The film also has good scenarios and an effective soundtrack, although not memorable."}, {"rating": "5", "text": "Suspended police officer takes a job as a night guardsman at an abandoned department store that has far too many mirrors but then, he starts to have visions and realises the mirrors are making people do things and it turns out the department store was built on the site of a mass suicide at a mental asylum."}, {"rating": "10", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;;:;;;;::::;;;;:;:;:;:;:;:;:;:;:;:;:;:;:;"}, {"rating": "8", "text": "[][][][][][][][][][][][][][][][][][][][][][][][][][][][]!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}], "recommendations": ["the_forest", "the_possession_of_hannah_grace", "crawl", "annabelle_creation", "the_ritual", "antlers", "the_descent", "dark_skies", "chernobyl_diaries", "the_invisible_man", "the_woman_in_black", "annabelle", "winchester", "p2", "devil", "vacancy", "the_crazies", "lights_out", "the_boy", "the_conjuring", "event_horizon", "oculus", "malignant", "sinister_2", "scary_stories_to_tell_in_the_dark"]}