{
  "id": 3330,
  "title": "Mission: Impossible II",
  "starring": [
    "Tom Cruise",
    "Dougray Scott"
  ],
  "runtime": 123,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "With computer genius Luther Stickell at his side and a beautiful thief on his mind, agent Ethan Hunt races across Australia and Spain to stop a former IMF agent from unleashing a genetically engineered biological weapon called Chimera. This mission, should Hunt choose to accept it, plunges him into the center of an international crisis of terrifying magnitude.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1VMWLpk9VXyYcEZ8w3uUhp0OF1v.jpg",
  "categories": {
    "plot": 5.2272727272727275,
    "acting": 4.9411764705882355,
    "ending": 5.0,
    "soundtrack": 5.5,
    "cinematography": 5.333333333333333,
    "familyFriendly": 4.625,
    "funny": 7.0,
    "action": 5.352112676056338
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I love the way John Woo is filming every scene, and although the movie isn´t perfect, cinematicly this, for me, is the best of the MI films."
    },
    {
      "rating": "10",
      "text": "Hands down the best Mission Impossible movie out of  the 3 movies made so far.  The chemistry between Tom Cruise and Thandie was delish!  This is the only movie out of the franchise that I can watch over and over and over again without fail.  The car scene, the bike scene the scenes thru out he entire movie keeps me riverted.  Tom should have made MI-3 with Thandie and kept it going but I am sure Hollywood had something to do with him changing from a black romantic female lead.  I'm just glad he did not go with the wooden Hallie Berry who though beautiful is meh when acting.  I would have loved to see MI-4 with Thandie but he's not going that way so hopefully if he continues the franchise he will bring her back on board."
    },
    {
      "rating": "8",
      "text": "The mission if you accept it, is to recover the sample of a virus in vitro capable of killing thr world populacy. This chapter maintains the esence of the original series and saves the best for the second hour with action and fight sequences, and motorcycle chases that, although exaggerated, are an adreanaline rush. For binge with a huge bowl of popcorn."
    },
    {
      "rating": "9",
      "text": "The plot is taken more seriously than the first with tension and thrills on a adventure of suspense and amazingly violent action. I know a lot of you think the first is better, but it's more serious than the first."
    },
    {
      "rating": "6",
      "text": "Just like the first \"Mission: Impossible\" film was entirely different to the TV show it was based on, \"Mission: Impossible II\" is nothing like it's 1996 predecessor. The slow, tension building pace Palma used in the first film, has been replaced by John Woo's love of fast paced action and insane shootouts. Woo draws from the auteurist action movies he made in the east like \"The Killer\" in order to bring his own brand of high octane action to western filmmaking.\r If anyone doubted how different Woo's style would be, he immediately distances his style from the first film in the first 5 minutes. Whilst \"Mission: Impossible\" had its agents receive missions in stylish way that resembled a Bond movie, with a cassette tape being delivered on a plane before detonating in a puff of smoke, that approach was apparently not extreme enough for the generation that made films like \"Bad Boys\" a hit. So instead the mission is delivered to Hunt as he climbs a cliff, with a helicopter firing down the assignment in a missile containing a pair of sunglasses, which he listens to before they explode in a ball of flame. It's completely pointless and serves no purpose to the plot. But it's still an awesome introduction to the film, and sets the tone for the ludicrous and enjoyable action to come.\r To match ridiculous action sequences like this, the plot is similarly as ridiculous and over the top. This time Ethan's mission is to retrieve and destroy a genetically engineered disease called 'Chimera', before a group of terrorists led by formal IMF agent Sean Ambrose (Dougray Scott) get a hold of it and release it to the public. To get close to him Ethan is told to recruit Sean's ex- girlfriend Nyah Nordoff-Hall (Thandie Newton) so she can seduce him. But of course as the typical American action hero, Hunt falls in love with her and thus must both stop the terrorists and save the girl.\r Coincidentally, just like the first film had a heavy Hitchcock influence through its visual style and slow pacing, this film has a plot that is heavily inspired by Hitchcock's \"Notorious\". However unlike Notorious where there was a genuine connection between the two leads, here Cruise and Newton share no such chemistry. They hardly even spend any time together, having only a short amount of screen time with a little flirting, a short car race, and a single night of passion. But for the action movie formula, this is apparently enough to justify them being madly in love.\r This wouldn't be a problem if this film did the same as the first \"Mission: Impossible\" and spent minimal time on character and story. But here a great portion of the film hinges on Cruise worrying for her and it doesn't work since no real connection is established between the pair. There's also several plot holes and continuity errors, with characters just showing up in random places with no explanation whatsoever. Although in the films defence, supposedly the original cut was intended to be over 3 hours long, but had to be cut down for a cinematic release which would explain most of these problems.\r Regardless, it's easy to look past this weak plotting, because as always Woo's real strength relies on his action sequences. And as usual he's on top form. He transforms Cruise from the stealthy espionage spy he played in the first film, into an all American action hero similar to the likes of John Rambo.\r Hunt fights through seemingly unbeatable odds, gunning down terrorists and blowing up cars, all whilst hardly gaining a single scratch because he's just that deadly. And of course Woo throws all his usual trademarks into the mix, like Cruise constantly dual wielding pistols, the gratuitous but cool slow motion and of course random doves being thrown into the climax.\r But even for a director like Woo who made his name through over the top sequences like the one take hallway sequence in \"Hard Boiled\", this still feels a little overdone. For example, at one point in the film when Cruise is breaking into a terrorist hideout, a door blows up and a dove literally flies through the flames. Moments like this are so ridiculous that they end up feeling less like a genuine action movie and more like a flat out parody.\r Even with these moments that go a little too far, it can't be denied that nobody does action quite the same as Woo does it. If his brand of insane violence didn't appeal in his previous work like \"Face Off\" or \"A Better Tomorrow\", it won't appeal here. But if you do enjoy his adrenaline fuelled style, then you'll likely enjoy it here. And whilst it may not be the strongest of the series, it's nonetheless another fun outing for the \"Mission: Impossible\" franchise."
    },
    {
      "rating": "5",
      "text": "Your cranium may crave more substance, but your eyes will feast on the amazing action sequences.\rMission Impossible 2 gets a 6/10\rC+\r2.5/5 stars........."
    },
    {
      "rating": "3",
      "text": "Unlike its fast paced predecessor MI2 is anything but entertaining.\rWith a slow redundant plot and stick think gun wielding henchmen for characters, MI2 loses the magic and becomes yawn worthy."
    },
    {
      "rating": "10",
      "text": "This is the best Mission Impossible, John Woo made a good job with this film. The action is as I lwant the action to be. Enjoyable, funny and extreme. M:I-2 rules!"
    },
    {
      "rating": "5",
      "text": "Sadly, John Woo's poor direction on \"Mission Impossible 2\" even makes the action crappy."
    },
    {
      "rating": "6",
      "text": "I got so bored, but Tom Cruise wasn't so bad."
    },
    {
      "rating": "2",
      "text": "I can see Tom Cruise and the other producers' logic when they hired John Woo to direct Mission: Impossible II - getting a big-name action director to helm the second installment of a big-name thriller franchise makes complete sense. Unfortunately, what John Woo turned M:I-2 into was an English-language Hong Kong action movie, and not a good one. At times his direction of the action scenes borders on self-parody, and I'm not certain Woo has noticed. We get it John, you like your wire-work, your slow-motion jumping-through-the-air-whilst-shooting, but I think I speak for the vast majority when I say we'd much rather see Chow Yun-fat doing it in Hard Boiled or a Better Tommorrow and looking cool than Mr. Cruise doing it in this knockoff and looking pretty damn silly. On the subject of the pocket-sized actor, in the first film, Cruise's Ethan Hunt was a character you could get behind - despite his **** he was likeable, his motivations understandable, but this time round he's just a smug, self-indulgent douchebag (putting it mildly), and his hair is stupid. I could write a whole page on the hair in this film - with all the slow-motion shots of hair billowing in the wind, it's like a Loreal ad! Concerning the rest of the cast, Thandie Newton is irritating as the love interest, Dougray Scott and Richard Roxburgh make bland villains in comparison to the baddies in the first film, and Brendan Gleeson and Anthony Hopkins should be ashamed by appearing in the film at all, brief though their time on screen is (i swear Hopkins only said yes to have something to do between scenes in Hannibal). Thank goodness for Ving Rhames, who reprises the role of Luther Stickell the effortlessly cool hacker - he's still an incredibly fun character, but just isn't on the screen for long enough. Even after all these gripes, my main problem with M:I-2 is the decision to make a novelty of the first film a major plot device in this film. Yes, I'm talking about the ultra-realistic face masks people use when they need to look a doppelganger of someone else. It's a lazy and unconvincing concept for a plot element, and you always see it coming. Plus it's never explained why people's eyes aren't a different colour. Mission: Impossible II has completely lost the fun factor of the first film. Yes, the action scenes are just as big, if not bigger, and exceptionally competent, but Woo's direction is lazy and with too much tendency to reference the infinitely better films he directed in the 80s and 90s. The performances are lacklustre, the script laughable, and tone extremely uneven. It's not quite the worst action film I've ever seen, but I can find little that's right with the film, and a whole lot that's wrong with it."
    },
    {
      "rating": "7",
      "text": "The film is mindless and many of the plot point we're expected to believe really do come off as \"impossible\". This isn't a spy film grounded in realism though, and the action scenes are masterfully choreographed by John Woo."
    },
    {
      "rating": "4",
      "text": "What the hell? What is this? Is this supposed to be an improvement? This is so boring, but I will admit it's got better action than the first movie and Tom Cruise is awesome in it, but this is such a stupid & cliché written sequel. I don't care for any of these characters, there's so many slow-mo shots, the chemistry between Cruise and Newton is terribly forced, and it's SOOOO BORING. God damn it. That's 2 hours of my life I'm never getting back..."
    },
    {
      "rating": "5",
      "text": "I didn't enjoy it, at all. The characters felt empty somehow. The plot was worse than the first, and very boring. I don't understand the good reviews."
    },
    {
      "rating": "7",
      "text": "The Weakest in a great series but entertaining after you realize your watching John Woo make a James Bond inspired cartoon. It is nowhere near as sophisticated at the 1st or as involving as the 3rd or as funny as the fourth but it is still a very well made B movie. John Woo is a pretentious but unique action film maker, he indulges in slow motion but it's interesting how he edits action scenes, the problems with the film is that the script is under mediocre with a bad performance from the villan. By the way Ghost Protocol (the 4th) has some of the best action scenes ever made (that story has a few problems also though)"
    },
    {
      "rating": "4",
      "text": "I think my high hopes were shattered for this film, because I felt disappointed that it did not live up to the previous film's well-crafted plot and intertwining cool action sequences. This I felt, lacked the former and added more of the latter. The beginning was strong, but as it neared the end it went downhill, and the only thing that stopped this from hitting rock bottom was Tom Cruise's ability to pull off cool action stunts - specifically the fight between him and Ambrose added a little more drama, although any other fighting was purely for showing. Thandie Newton failed to add anything to the film, merely just a manipulative prop. In the end, the only thing that saved the film was Tom Cruise himself, but eventually it just ended up being a fun-of-the-flair cheesy mega action flick. My favourite part, though, was in the pharmaceutical lab."
    },
    {
      "rating": "5",
      "text": "John Woo doesn't do enough good action and better stunts with this movie and the drama, same old boringness. I wished this movie had improved to its better standards, but it did not."
    },
    {
      "rating": "4",
      "text": "The Hollywood milk it dry theme....  There has to be more creative scripts out there to throw money at. I guess the bond theory is in play tho. Average and I watched it. Good to have on when you are doing something else at the same time and want a distraction in the background."
    },
    {
      "rating": "5",
      "text": "Mission Impossible 2 has flaws, many many flaws but its main problem is John Woo brings his signature stylised action but overdoes it. From the unnecessary twirling during gunfights to his signature doves itâ"
    },
    {
      "rating": "7",
      "text": "Well, I just reviewed the first one, so you had to know the second one was sure to follow. That is the draw of these films, every one likes them for different reasons, and as soon as you watch one, you want to see them all. Despite the old line about sequels, personally, I liked this one a lot better than the first. The story line was much closer to what I expected to see from this franchise, and this time, John Woo was Directing. I generally don't care for his writing, but when it comes to Directing action films, he's one of the best. In the second installment of Mission: Impossible, Ethan Hunt (Tom Cruise) is after a former agent, but not quite sure about what he's planning to do. As he follows the trail, Ethan learns the man has developed a deadly virus, and Ethan's mission, should he choose to accept it, is to save the day. Tom Cruise is his usual self and the action sequences are textbook John Woo, so why is this rated 3 1/2 stars you may ask? The answer is the storyline, because in a film like this, where it's all about special effects and hot bodies, the only thing that makes it different from a million other pictures is the story, and this one hits the nail on the head."
    },
    {
      "rating": "6",
      "text": "Far and away the WORST of all the Mission Impossible movies. The jokey opening scenes which go on for a good half hour fall flat. The whole opening act is just off and utterly lacks suspense because they try to turn the movie into a comedy romance which is NOT why I watch Mission Impossible movies. The action especially in the first portion is overdone and tedious. Fans of John Woo (the director of this one) are rabid cult members who will call anything he makes the \"best\" so disregard those reviews. The movie does pick up in the latter half and isn't bad, not great but not bad, and Thandie Newton is a very sexy co-star at her most beautiful in this movie. But overall this movie is too long and the opening half hour is bad. Mission Impossible III, IV, and V are all great. V is a little old-school, feels a bit like an old movie, which I loved but some may not. Mission Impossible I is good but not great. And the word is that Mission Impossible VI is the best of all. But Mission Impossible II is at the bottom of the list. Skip it and come back to it after you see them all, if you're still dying for more."
    },
    {
      "rating": "4",
      "text": "Great action sequences complimented by a boring plot. Action movies should keep you on the edge of your seat waiting for what happens, but with the predictability and lack of intrigue packed into this one, it's a slow two hours."
    },
    {
      "rating": "5",
      "text": "\"II\" is not a particularly good sequel, but don't worry:\"Tis' but a flesh wound\" on the M:I series. The third and fourth are much better, especially the fourth. So enjoy this one for what it is, and know that there is light at the end of the tunnel."
    },
    {
      "rating": "6",
      "text": "Its the worst of the Mission: Impossible franchise, but that doesn't make it bad, its just... okay. Tom Cruise is still great in this film though, as always."
    },
    {
      "rating": "7",
      "text": "Not as great as you guys expected it to be... like we wanted it to be... 'IMPOSSIBLE!'... as the title said, but it at least works as a decent charm for the Mission: Impossible franchise."
    },
    {
      "rating": "5",
      "text": "WHAT I LIKED: Mission: Impossible returns, and it's just as gripping as before. This time the anti is upped thanks to the addition of some (albeit cheesy) character development and a higher-stakes story. It's big, brash and exciting stuff, and is exactly what we will come to expect from this franchise (especially where the first 3 movies are concerned.)\rWHAT I DIDN'T LIKE: It's also just as confusing and ridiculous as the last movie, thus it feels like it asks us to take it a little too seriously when it's so cliched. Style over substance describes this one in particular down to a tee.\rVERDICT: Mission: Impossible is always just a bit of fun, but it is a confusing and cheesy bit of fun. This time around is nothing new, but it's still pretty enjoyable too."
    },
    {
      "rating": "0",
      "text": "Après le premier épisode réalisé par Brian de Palma, Mission Impossible se paye un autre réalisateur de luxe, à savoir l'épatant John Woo auteur des films les plus fous, les plus violents de Hongkong...Le souci, hélas, c'est que Monsieur Woo après son examen de passage vite fait (mais bien fait) avec Hard Target s'est très vite et trop vite coulé dans le moule de la réalisation hollywoodienne basique en y insérant de temps à autre et avec force maladresses ses quelques vieux tics qui ont fait sa réputation : on a donc quelques ralentis mais le réalisateur est en vérité méconnaissable : le cadrage et le montage sont généralement indignes de lui et le reste donne l'impression qu'il se caricature lui-même.En outre, l'histoire complètement débile qui lorgne décidément trop sur les james_bonderies et les cacades aberrantes nous ennuie résolument, le film ne parvenant jamais à nous distraire même au troisième degré... car tout ça se prend très au sérieux, y compris la romance bidon avec la petite grognasse Thandie Newton qui n'a clairement pas inventé l'eau chaude et encore moins l'eau tiède.Quant au petit Tom, il pose encore plus que d'habitude, il roule des mécaniques comme une Harley repeinte au rouleau et s'avère totalement insupportable. Ce MI2 a donc gagné ses galons de navet surdimensionné, un navet Triple A devenu Triple Z."
    },
    {
      "rating": "5",
      "text": "A scientist creates a virus named Chimera together with it's antidote, turns out that it got stolen by some terrorists that are led by an ex-agent. Ethan Hunt with his team need to develop a plan, to find out where the guy is and recover the virus, while the terrorist is planning to spread the virus around the country and then the whole world, for finally he can be able to sell his antidote and get a millionaire man. Directed by John Woo.The premise of this movie is very cliche and nothing exciting, the structure in this one is very conventional. The story of the movie is very simple, and is very purchasable, you can believe in what is happening, the main plot is one that sustains itself, but isn't special in any part, wich would depend of the development of it to become somethings really nice, but overall it is very silly, the villain until some point make sense, but at the very end it just become ridiculous, like they did forgot something. At the beginning they trie to force a relationship that it was way to fast and not very nicely done. They even keeped the same kind of team from the previous movie, a guy in a helicopter and other in a van with the computer, it wasn't bad, but definely not the best thing. The villain is completely unilateral, he didn't had different aspects or layers he is just one thing. The movie got some plot twists involving the masks, but also was very used in the first movie, i personally didn't bough those twists, but i can't lie that some of them were pretty cool, i just can't imagine how they have a mask of everybody that exists, it felt wrong, but it was nice. There are some good sequences, some fun moments with the right suspension of disbelief or even not. There is one sequence wich is a fear of getting cough that they worked with it very well, cameras, sounds and the right amount of subtleties.I believe that the actors delivered very well what they had in their hands. Tom Cruise was able to maintain the Ethan Hunt that he first created a few years ago, he could still be sarcastic with those random smiles and also could be serious and demonstrate concern. Thandie Newton also did a good job, she could convince as a thief credited, she expressed confidence and cleverness in her voice, even that in some dramatic moments it didn't convinced me that much, she did a good job. Dougray Scott had one job, be a unilateral villain that wanted to be rich doing bad things, it wasn't the better of the characters, but he did what he could. Ving Rhames is back as Luther, he wasn't so nice as in the first one, but he was very functional and gave me some nice laughs, he convinced in doing his things and gave some nice dramatic partis with his concern in his voice. John polson was more of a relief comic, he worked, gave me some laughs and was the conveyor for the group. Anthonny Hopkins is also in this movie, he doesn't have much to do, but the few time that he is in, i gotta say the he worked considering what he had to do.The action in this movie was just awful, i hate when they start to make the character do some acrobatics fights just to make it look cool, because it looks ridiculous mostly of the time, when someone needs to punch the other to knock him down, and instead of just do it, he does a back flip first and then strikes him, for me that is terrible. In some moments they use a slow motion to put some drama in the action, but for me it didn't worked out every time, in some moments it just feels ridiculous. They had some decides in the action scenes that i really couldn't understand, it had some really nonsense scenes that was simply ugly, i didn't liked how it was shooted, to much cuts, it couldn't let me feel the sequence, there somethings with cars and motorcycles that was really breathtaking in some moments, but not in the good way. There was some ok moments of gun fire, or a invasion moment, but still, everything is so unrealistic that feels out of place considering how did the first movie make.The cinematography lost that tense aspect, that was using dutch cameras for discovery and unconfortable moments for the character, a camera that really talked to us, in this one that almost never happens, the movie use some zoom in moments, wich work, so as some slow motion moments that mostly of the time felt goofy.The soundtrack in this one had a little change, the main theme is pretty much the same, but now, they put it in a guitar, wich sounded great, and it combined with the more accelerated style of the movie. This movie have some many flaws in the story, it is a simply and silly one. The action scenes aren't good and there is so many bad use of resources here. But even with that you can find some nice moments, it is that bad movie that can make you smile sometimes."
    },
    {
      "rating": "5",
      "text": "With a heavy-handed dialogue that includes a lot of repeated lines, excessive use of slow motion technique, awkward romantic scenes, cringe-worthy melodramatic moments, tons of clichés, sequences that exist for nothing but manipulating, familiar plot, clumsy resolution, and nonsensical decisions. John Woo's MI II is more like a cheesy 007 movie that hasn't aged well. Even the \"impossible mission\" here lacks the tension the original has. Adding insult to injury, it is followed by a long boring scene that I almost fell asleep during it.On the bright side, the last 20 minutes of the movie feature some of the best over-the-top action sequences I've seen in the this century. I'm not kidding, the action set pieces are staggering that I was about to forget how silly this movie is!Also, the opening scenes that came before opening titles were kinda promising, and showed some cool technological equipments and devices.It goes without saying that Tom Cruise is charming as ever specially with this Magnolia long hair.(5/10)"
    },
    {
      "rating": "7",
      "text": "A good attempt at a sequel not amazing but not terrible the story is decent and can be enjoyed."
    },
    {
      "rating": "7",
      "text": "Yes, this movie has cliches everywhere. Yes, its plotline was lifted from an Alfred hitchcock movie. Still, this movie is great fun with action aplenty, and enough plot and startling revelations for anybody."
    },
    {
      "rating": "4",
      "text": "Mission Impossible II is a big dumb action movie done in the big dumb way that is only possible with Jon Wu. The direction in itself leading to tons of crazy gunfire, chases, explosions, slow motion, and doves in itself prevents this film from being particularly good but its frustrating when it is taken into consideration how smart the first film was. The original film restrained the action scenes, minimalized the use of CGI, and a t no point was a gun fired. In this film there are gun fights galore, the film rehashes the iconic scene from the first film except with more CGI, and overall the film lacks any sort of restraint or intelligence in regards to the action scenes that the first film had. The one interesting action scene involves Ethan Hunt being stealthy and for a moment the film was remotely engaging but then it goes back to the big dumb action Jon Wu is known for. Excessive time is spent delving into an excessive romance that lends itself to a plot straight out of Hitchcock’s Notrious that is uninteresting although the love interest is kind of hot. Unless you like dumb Wu action this is a skip as it sh*ts all over what made the first film so good. At the very least though this film provided a cool take on the M.I. theme."
    },
    {
      "rating": "6",
      "text": "Crazy, over the top madness but still quite fun. Some nuts action sequences."
    },
    {
      "rating": "2",
      "text": "This is by far the worst film of the franchise. Woo tries too hard emphasizing the action at set moments and fails to deliver even a some-what interesting story. The characters are shallow, The main villain lacks a clear motivation for his actions and the story just fails to gain any traction nor does it make use of its stellar cast. MI 2 tries too hard to be a James Bond-like film and therein lies the problem. It doesn't have an identity, it only tries to mimic and that is why it pales in comparison to every other movie in the franchise."
    },
    {
      "rating": "10",
      "text": "This is one of John Woo's strongest films, I don't care what Richard Roeper said, it's still has the heart of it, even though I didn't watch the show very much, but I'm aware what's show is about."
    },
    {
      "rating": "6",
      "text": "Mission: Impossible 2 has none of the flare or originality of the first film and feels rather like a regular run of the mill action flick. The ideas are there but the execution is straight out of movie making-101."
    },
    {
      "rating": "7",
      "text": "Solide guter Action-Streifen. Kann man sich immer wieder mal gut anschauen."
    },
    {
      "rating": "3",
      "text": "Tom Cruise has never been in a movie so lackluster as this, so of course I'm kind of surprised that he made into this one alive. This awful movie has got the action dazzling very well, but the plot is idiotically thin, the tone is underwhelming (as the soundtrack) and I couldn't care less about the romance going on in this film. F*ck this.\r 3/10."
    },
    {
      "rating": "8",
      "text": "A really good action movie but not Mission Impossible (look up what it was for decades before the movies if you are interested). Because they did not ruin the iconic Jim Phelps and the movie format became the standard what people think of the franchise I will not rant about it. For itself the movie has an interesting story with good characters that enhance the story. Ethan Hunt is on holiday when a new impossible mission arrives.Another agent posing as Ethan Hunt (via the special masquerade the franchise uses) was tasked to accompany and protect the biochemical expert Dr. Nekhorvich when something goes awfully wrong. He is killed by the agent and he took two samples coded Chimera and Bellerophon. Ethan Hunt has to assign a team and find out what is behind this mess. Like I said the story is good but has some logical flaws if you think about it. The special effects, stunts and action scenes are the bread and butter of the movie (and franchise). It was breathtaking amazing. Overall I enjoyed this movie. While not being a 10/10 it is something I like to rewatch and talk about. An 8/10 is fair for me."
    },
    {
      "rating": "6",
      "text": "Mission Impossible 2 , I am filled with a lot of suspense and action, only a little boring at times , but with a performance of \" Tomsito \" had much consideration and very good performance."
    },
    {
      "rating": "5",
      "text": "What the hell? What is this? Is this supposed to be an improvement? This is so boring, but I will admit it's got better action than the first movie and Tom Cruise is awesome in it, but this is such a stupid & cliché written sequel. I don't care for any of these characters, there's so many slow-mo shots, the chemistry between Cruise and Newton is terribly forced, and it's SOOOO BORING. God damn it. That's 2 hours of my life I'm never getting back!"
    },
    {
      "rating": "6",
      "text": "It’s OkayThough it has crazy stunts from Cruise and great action, MI2 isn’t as good as the first film."
    },
    {
      "rating": "6",
      "text": "The movie was alright. Not as good as the first movie but it’s not terrible"
    },
    {
      "rating": "3",
      "text": "Mission: Impossible II is a delirium that does not work.Plot without sense and convoluted, moments taken from any side, an action that does not work and scenes too exaggerated make this film a nonsense that entertains and little else.Without a doubt, the worst of all (and I still have to see the next ones in the series, but worse than this can not be)."
    },
    {
      "rating": "5",
      "text": "I know that it is full of action, but there are many lacking ingredients. The characters were not well designed and a bit boring not like any other movies from MI series."
    },
    {
      "rating": "6",
      "text": "The first Mission: Impossible film had some excellent moments but the sequel doesn't have anything which is as good. That is real shame too, because this has a very talented cast and one of the best modern action directors in John Woo, but the film is more focused on the action sequences rather than delivering a good narrative that actually gets the audience invested in the characters. This film is fine but don't expect the same standard as the first film because this is no where near that film."
    },
    {
      "rating": "4",
      "text": "The plot is stupid, the characters are usless, and it is beyond cheesey (i mean cheesier than the other MI movies.) There are some decent scenes with good choreography but that's about it. But it's definitely one of those movies where it's so bad it's good. you seriously can not have a bad time watching this monstrosity. That's why i'm not giving it a 2."
    },
    {
      "rating": "3",
      "text": "Esse filme é uma tragedia. Mesmo deixando de lado a logica, é muito difícil se divertir com esse projeto. Os personagens não tem a menor profundidade, e fica bem claro que isso é totalmente ignorado ao redor do filme, e o pior é que o mesmo se leva tão serio que passa a acreditar que é inteligente, onde metade das cenas são os personagens fazendo caras persuasivas e pseudo-espertas. Fora que é super previsível, onde pude adivinhar dois plots sem o menor esforço.Fora a conveniência do roteiro para que determinados rumos sejam tomados.Fica bem claro aqui que se esse filme não foca nos diálogos, personagens, historia, ele deve ser bom nas cenas de ação, correto? Quem dera! As coreografias de luta conseguem ser mirabolantes e ao mesmo tempo sem criatividade, com milhares de cortes entre elas que só ajudam a te deixar mais perdido. E o que falar do slowmotion dramático extremamente mal implementado? Aqui o diretor acha o máximo pôr isso em toda cena. E falando em cinematografia, a mesma está mais perdida do que nunca. Dando enfoque em determinados objetos e cenários sem a menor necessidade, subestimando a inteligencia do publico e a própria capacidade de uma fotografia bem feita, e como citei acima: cortar uma cena em pedaços não a deixa melhor.Quanto ao áudio, apesar de amar as OST de Hans Zimmer, não acho que esse rock funcionou bem aqui."
    },
    {
      "rating": "6",
      "text": "Felt like watching cheezy popcorn flick!good music and acting screenplay and story was okish but felt very boring and slow camera moments were lame watching a shot 2 times to feel yaa somethings happening and slow motions didn't work at all as per 2000 year is concerned yaa slow motion was at peak in movies but didn't work with this movie.some moments were great like anthony hopkins telling its not mission difficult its impossible and some masked moments like kidnapping company owner and the villain at start being dmitri and ethan with his girlfriend.starting was good as he was climbing great mountains.ending was little good but overall worst in franchise and just okay movie."
    },
    {
      "rating": "5",
      "text": "This movie is a lot of fun, but also a lot of stupid.I love John Woo and I love how silly his Hollywood films are, but he was not the right choice for a Mission: Impossible movie. He might bring some badass, over-the-top action, but he also brings a style that's more distracting than anything, and completely changes the characters of Ethan Hunt.Hunt has never been a particularly complex protagonist (most times serving as a vessel for the audience to experience the action), but I've always loved the character. He's kind of a goof, he's good at his job and he's fun to watch. He's not is this edgy, too-cool-for-school action hero that gets laid on the job. I wanted to punch this Ethan in the face.Also, the villain is way too hammy and only loses because he takes an eternity to pull the trigger on Hunt. I do think that his plan however has aged very well considering the current global situation.It does one thing better than the first one though: it rarely gets boring. As much as I enjoy the original, it could get very dull very fast. Here, it never stops. There are boring scenes, sure, but they're rare. The infiltration on the villain's base was really cool.I had fun with this movie, but that doesn't mean I think it's good. Thankfully, the series would only get better and better after this. It's a fun action movie, a passable John Woo film and a pretty weak entry in an otherwise consistently awesome franchise."
    }
  ]
}