{"id": 1083, "title": "Mission: Impossible - Ghost Protocol", "starring": ["Tom Cruise", "Paula Patton"], "runtime": 133, "genre": ["Action", "Thriller", "Adventure"], "description": "Ethan Hunt and his team are racing against time to track down a dangerous terrorist named Hendricks, who has gained access to Russian nuclear launch codes and is planning a strike on the United States. An attempt to stop him ends in an explosion causing severe destruction to the Kremlin and the IMF to be implicated in the bombing, forcing the President to disavow them. No longer being aided by the government, Ethan and his team chase Hendricks around the globe, although they might still be too late to stop a disaster.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/psiWp3VTjznfokmGQG9uqiiknQQ.jpg", "categories": {"plot": 8.0, "acting": 8.333333333333334, "ending": 8.375, "soundtrack": 7.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 8.857142857142858, "action": 8.358695652173912}, "reviews": [{"rating": "8", "text": "The action scenes are the one element that makes this mission great. Not only are they creative, but director Brad Bird handles them like an action master. Personally, I haven't seen action this good since \"Casino Royale.\" Unlike a lot of other recent action films, there's no shaky cam, and the action almost always stays focused on one particular element. In other words, it rarely gets out of hand and overwhelming (unlike the last two \"Transformers\" movies for instance). Take note, this is how action should always be done. It's sad that action this great is now a novelty, but as an action fan, I'll sure as heck take this as a gift. Besides the cinematography, I also thought the makers did a clever job of giving Hunt opportunities to escape his \"impossible\" situations. It was like the creators adapted Matthew Vaughn's philosophy when he made \"Kick-Ass\". The philosophy was this: If there's at most a 1 out of 1000 chance that a character can accomplish the stunts given to them, it's included it in the movie. Is it likely Hunt could have done the things he did? No. Is it possible? Maybe. Adapting this philosophy prevents us from laughing at the action, and it allows us, instead, to just go along for the ride. My only quibble with this film is its running time. With its fairly simple storyline and stock characters, 133 minutes is pushing it just a bit. Luckily, the cast keeps things fresh with Simon Pegg giving an incredibly sharp performance as the techie-nerd comic relief. Tom Cruise also shows us that at 49 he can kick some major ass. This is a must-see for just about any action fan, and it has to be seen in theaters. The visuals are too incredible for you to get the same effect on a television."}, {"rating": "9", "text": "One of the best action movies of the past few years. Very slickly directed & edited it all works really well together. Easy to follow plot which is still a little mysterious & unsettling. Solid acting from all concerned. Tom Cruise gives his best Ethan Hunt since MI1. Paula Patton is both tough & attractive/sexy. Simon Pegg is slightly annoying but also endearing. Jeremy Renner is both mysterious & yet vague. Lea Seydoux is sexy but lethal in the best spy thriller fashion.\r Brad Bird does an excellent job directing here its so well made & effortlessly edited together. ILM do a stunning job on the VFX work it has around 700 shots & most of those are invisible fake backgrounds,/buildings but look very convincing.\r MI4 just really works as an action adventure/spy thriller & travels to at least 4 exotic locations. The way it all comes together is a tribute to the actors/filmmakers that in 2011 they can all make a coherent shaky cam free cinematic experience which can be followed & enjoyed by movie fans of all ages yet still manage to suck you into the story. Its more like a Pierce Brosnan bond movie at times than a Mission Impossible movie but those exotic elements help to tell the story & stop it from boring you as for the first 75% of the running time the action is wall to wall & the plot twists constant so you never get a chance to relax until the slower paced ending which even then has a few twists & some more excitement to deliver.\r Highly recommened for anyone who is a Tom Cruise fan or just wants a great time at the movies."}, {"rating": "7", "text": "\"Mission: Impossible - Ghost Protocol\" finally brings back the spine-tingling action and visuals to its core element as this movie definitely is the summer blockbuster you wouldn't want to miss."}, {"rating": "8", "text": "Ghost Protocol delivers the goods for the Mission Impossible series. MI3 didn't get the credit it was worthy off but MI4 certainly seems to have reignited interest in the franchise. The film is outrageous fun with some incredibly surreal yet exquisite action sequences that are easily on par with Casino Royale, yes that good. The plot up's the ante in terms of the 'impossibility' factor. Ethan Hunt is assigned to lead fellow agents Benji (The awesome Simon Pegg) and Jane Carter (Paula Patton) to infiltrate the Kremlin in Moscow to locate files identifying 'Cobalt' (Michael Nyqvist) who is a Russian consultant aiming to detonate a Nuclear bomb. However, during the mission someone broadcasts across Hunt and co's frequency alerting the Russian's of Ethan and his team which leads to a frantic escape and a bomb detonating in the Kremlin leaving the IMF seemingly responsible for the attack. As a result the Russians believe the act to be an undeclared one of war resulting in the US government initiating Ghost Protocol. Jeremy Renner comes aboard as William Brandt and assists the IMF as they try to stop 'Cobalt' from starting a nuclear war. Straightforward stuff right? Certainly compared to MI3! But the plot is secondary yet it works because the action sequences are handled expertly by Brad Bird. From Ethan climbing Burj Khalifa - the highest building in the world to a car chase amidst a sandstorm they really have gone all out! The new characters introduced are relatively appealing however, personally, Simon Pegg once more is in fantastic form as Benji and really merits all the accolades and plaudits he has been credited with as he is awesome! Paula Patton was a good inclusion as the sexy yet deadly Jane Carter and Jeremy Renner was a decent alternative at times from Cruise although i don't think he is quite ready, if he ever will be, to take the reigns from our Tom just yet. The length of the film is perfectly appropriate aswell it's not as long as MI3 but is timed greatly thus time round. Ghost Protocol is a fine installment in the Mission Impossible franchise. It's an adrenaline filled funfest as a spectacle that delivers some of the the best action in recent memory and definetly takes the franchise to new heights, Brad Bird has handled everything superbly well and one suspects Tom Cruise might be back sooner than we anticpated for a fifth outing!"}, {"rating": "9", "text": "This was an excellent movie all around. The action was genius, haven't seen this good of action sequences in a long time. Brad Bird did a masterful job with this film. Tom Cruise knocks it out of the park again with another great pulse-pounding mission. Jeremy Renner is my favorite actor out there and he did a very good job all around in this movie. He has great promise and a very bright future ahead of him. This movie was plain genius all around. The acting to the visuals, to the action, and of course the highly entertaining story/ plot. The only reason why i give it a 9 and not a 10 is some of the action sequences were very unbelievable, won't go into detail because I don't want to give anything away, but obviously thats expected from a movie like this, but overall, I loved this movie. This is a must-see film. If you like to watch a masterpiece, then go see this now. 9.5/10"}, {"rating": "10", "text": "\"Ghost Protocol is ridonculous,\" in the words of \"How I Met Your Mother\" 's Ted Mosby. He's damn right, even if that is a fictional show. This movie rocked. The action scenes were exciting and exhilarating, and the plot was pretty spot on. Even the script was pretty good, with some funny jokes and realistic conversations. I also loved the gadgets and gizmos they used, whether they were using that screen that simulated objects behind them in the Kremlin, or those gloves Cruise wore that stick to the side of buildings. Really well-done fourth installment. If a fourth installment to a series is this good, you know the series is top notch. I really hope they make a fifth."}, {"rating": "9", "text": "With incredible action sequences and stellar acting all around, Mission Impossible: Ghost Protocol serves a landmark for action popcorn movies with wit, style and fun."}, {"rating": "7", "text": "Tom Cruise is an American Bond, an unbelievably chaste Bond that is, despite having one of the most beautiful women you will ever see in Paula Patton as your co spy. Gorgeous doesn't do her justice. Simon Pegg is the nerd humour, Jeremy Renner is there though not really necessary. The baddies are just baddies and we whizz through Moscow, Dubai and Mumbai in pursuit of them in practically non stop action mode..Not perfect but not far off.."}, {"rating": "10", "text": "wow. this is was definitly better than i thought it was going to be. i was so suprized. the efects were great and a must see on the big screen. Tom cruize really out did him self.  My wife liked it and we have recomended the movie to our friends."}, {"rating": "7", "text": "Mission Impossible Ghost Protocol goes back to what made the first film great the heist action scenes. This is a franchise defined by team-based heists not explosions, action, and running. Brad Bird remembers that delivering three creative, suspenseful, and engaging action scenes that each are a stand out in their own way.  Additionally, there is a strong team dynamic and with an emphasis on the team not Hunt resulting in the only film where all the team members are memorable. For those feeling like the franchise had lost its way this one returns to form and taps back into the show"}, {"rating": "8", "text": "A film that takes the audience from Budapest to Moscow to Dubai to India and maybe a few other international destinations in-between! There is some spectacular looking stunt work and some cracking effects; hats off to those guys! All the performances were very good with Tom Cruise playing Ethan Hunt with his usual aplomb. It was nice to see a little comic relief provided by the inclusion of Simon Pegg; the comedic two-and-fro between him and Jeremy Renner was particularly amusing. Maybe the plot might have been a little over-complicated, but over all I found it a pretty enjoyable watch.\r SteelMonster"}, {"rating": "8", "text": "There's more creativity and class with Ghost Protocol than previous MI films. What really impressed is the cast list for such an action-focused film. But what people really want to see is insanity, and I think it's easy to say that the scaling of a skyskraper in Dubai with an closing sand storm on the horizon qualifies as insanity. Ghost Protocol is totally fun and continues the sound foundation MI3 laid out, even if the superb Phillip Seymour Hoffman isn't the main bad guy this time around."}, {"rating": "9", "text": "MI4 was easily the best action movie of 2011 for me.  This is the kind of movie where you can't imagine someone walking out of the theater unsatisfied.  The MI group is enjoyable and all of them are great actors who each have their moments.  Brad Bird proves he can direct live-action just as well as animation.  The scene in Dubai is worth the price of admission alone."}, {"rating": "9", "text": "Tom Cruise does the MI franchise proud with this latest installment.  Just when you think Hollywood can't outdo itself, along comes a movie like this that reminds you why you drive down to the local cineplex, fight the parking wars, stand in line for a ticket, pay ungodly sums of money at the concession stand and fume over the idiot in front of you that is texting during the entire movie.  You do it because you love to be entertained and transported somewhere else for a couple of hours.  MI:4 does this.  If you are an action fan, this movie is right up your alley.  If you're looking for a reasonably-well constructed plot, you're in for a treat.  No, this movie will never be a classic, but it certainly rides like one.  Go.  Have a good time.  Make sure your popcorn is piping hot while you're at it!"}, {"rating": "9", "text": "The best MI movie yet. and one of the best action spy movie. I do not like the MI movies but this one is a must see. I don't eben like action movies a lot but this one is a must see. They did a fabulous job with picking the cast. Good directing along with plot."}, {"rating": "7", "text": "Light the fuse! Ethan Hunt was the one who ignited the fuse. What I remember most from Ethan Hunt character is that he was the man who killed Jim Phelps! Yes, MISSION: IMPOSSIBLE (1966-1973) was a successful intelligent TV show, Jim Phelps (originally played by Peter Graves) was the leader of thiz highly sophisticated covert team, his charismatic presence had already become a trademark for thiz franchise. Then suddenly, in 1996, Tom Cruise who coming from nowhere, bought thiz franchise and killed Jim Phelps and replaced it with himself as the invincible super whiz named Ethan hunt. At that time, I was very mad and I thought all the fans would do the same. But now, after three previous movies MISSION: IMPOSSIBLE (1996), MISSION: IMPOSSIBLE II (2000), MISSION: IMPOSSIBLE III (2006), including thiz last one, they seem to gradually transform thiz franchise to be a pure action movie, even though still with ultra-cool high tech gadgets. Not just the attractive gadgets, but also high-octane adrenaline stunts, just like thiz time Tom Cruise attempts to climb the world tallest building ever made so far, Burj Khalifa in Dubai. I heard that most of the dangerous stunts were done by Cruise himself. Thiz time, Ethan Hunt forms a smaller team comprising sexy, seductive and extremely lethal Jane Carter (Paula Patton), humorous computer genius Benji Dunn (Simon Pegg) and the mysterious co-agent William Brandt (Jeremy Renner). Its mission is to retrieve the nuclear launch codes before it gets into the wrong hands of international terrorists. In the process, instead, they are accused of masterminding the Kremlin bombing. Now the IMF is disavowed and they are forced to invoke Ghost Protocol, which means they are all alone with the limited resources they have. The Director is Brad Bird who is most renowned as one of the fathers of Pixar animation studios. Thiz is his first live-action movie after successful animations like THE INCREDIBLES (2004) and RATATOUILLE (2007). By the way, in 2012, Brad Bird other colleague Andrew Stanton also will be directing another live-action movie entitled JOHN CARTER. Coincidence? Maybe. I have to admit that thiz movie has consistent paces since the first minute. I note that Tom Cruise repeats at least three specific actions that he has done in previous movies. The first is running from an explosion behind him, the second is climbing the iconic skyscrapers and the last one is taking cover when he is almost crushed by a car! Although it was a kind of repetition, but oh yeah we still enjoy so much.As time goes by, it seems to be MISSION: IMPOSSIBLE has transformed into pure action movie! The only thing left now is its famous instrumental theme song, or maybe the latex face mask, you must know what I mean. Other than that, thiz movie has always been Tom Cruise playground. Personally, I am just OK with that, as long as thiz franchise can maintain its winning formula which is non-stop explosive action scenes. That is all from me. Thiz review will self-destruct in five seconds. Goodluck, Ethan. Visit My Blog on JONNY MOVEE: http://jonnyfendi.blogspot.com"}, {"rating": "7", "text": "Good enough to watch once, maybe twice. Acting wasn't that great, except for Cruise. Good movie. Enough action and kept going well throughout. Blah blah blah, blah blah blah blah blah blah"}, {"rating": "8", "text": "Good fun, great action... Hey, it's Mission Impossible, not the Joy Luck Club.  Think it's too shallow?  Check out Transformers: Dark Side of the Moon or Battle Los Angeles and get back to me."}, {"rating": "8", "text": "When the IMF is implicated in an attack on the Kremlin Ethan Hunt and his team are forced to go rouge in order to clear their name and prevent nuclear war.\r As with most big-budget blockbusters there are a few things that don’t really add up if you think about them too much but it is easy to forgive any plot holes in a movie that is so entertaining. The Mission Impossible franchise is of course famous for its plethora of outrageous gadgets and they are put to use here to create some fantastic set pieces, including the much talked about scene in which Hunt scales the Burj Khalifa in Dubai using only a pair of prototype adhesive gloves. Refreshingly CGI free it is a rare joy to behold such impressive stunt work.\r The chemistry between the small team, on whom much of the movie focuses, is also very good. Benji (Simon Pegg) is given more screen time providing genuine comic relief and the addition of Brandt (Jeremy Renner) as a more down to earth, but equally effective, agent adds a further dimension to proceedings.\r All in all Ghost Protocol is an excellent addition to the series and proof that there is still plenty of life left in Mission Impossible yet."}, {"rating": "9", "text": "Mission: Impossible - Ghost Protocol is the slickest, most entertaining and clever action flick since The Bourne Ultimatum. An action movie really has no right to be such a rounded and well-developed viewing experience, and Brad Bird completely embraces his newfound freedom as a live-action director, and has created an honest-to-goodness balls-out thrill ride. The action is superb - the key set-pieces completely eclipsing everything in the series thus-far. They're not just flawlessly executed either - they're completely original. Who'd have thought we'd see Ethan Hunt fighting his way single-handedly out of a rioting Russian prison accompanied by Dean Martin on loudspeaker? Or scaling the outside of the world's tallest building in Dubai with only the use of some high-tech sticky gloves? Or chasing his target through a ferocious sandstorm? Or in a fantastically brutal final brawl in a car factory? You just don't see scenes like this in everyday action films. It's not all about the action, either. The film has the best cast of the series (Tom Cruise has rarely been better, and both Simon Pegg and franchise newcomer Jeremy Renner impress), and the script is rather good as well (it's nicely self-aware, playfully deconstructing a few of the more ropey trademarks of the series, and pleasingly, writers Andre Nemec and Josh Appelbaum know just when to play dialogue completely straight and when to inject a bit of humour into the situation). The most concrete aspect of the film though, is the story. It's rather simple for a Mission: Impossible film, but it's done extremely well. Sometimes less really is more (except where action is concerned, as mentioned above). Quite simply, it puts the rest of the series to shame."}, {"rating": "7", "text": "The cast was well acted in the film. I particularly praise Simon Pegg and Jeremy Renner for adding their own memorable atmosphere into the mix. The action sequence are also great and the suspense created during the dubai scene is phenomenal. My only problem with this film is the main villain. He isn't explained all that well I feel he could have been more defined from better writing. But to say the least Mission Impossible -Ghost Protocol is probably the best action flick I've seen this year"}, {"rating": "9", "text": "This should have been called 'Chuck' the movie. It's the funny humor of spy films passed, mixed with popcorn candy action that really makes this film stand out. I now want to go back and watch the first three. I just wish the first three were as good as this action masterpiece."}, {"rating": "9", "text": "Wow! This movie is great!  It has great acting and action, with a good plot. It also has great special effects and stunts. You don't have to watch the other three MI's to understand the plot, which I love because it's so hard to find sequels on DVD or Netflix. I highly recommend this movie to everyone, especially action-seekers."}, {"rating": "8", "text": "\"Mission: Impossible - Ghost Protocol\" Se trata fÃ¡cilmente de la mejor de la franquicia. Brad Bird ha sabido muy bien encaminar la cuarta parte de la saga aunque con cierta suspicacia y en momento el guion se tensa mucho como para permitirnos saborear, lo forzado del mismo, pese a esto y tratarse de la primera pelÃ­cula en Live Action de Brad Bird el resultado es verdaderamente fascinante, acciÃ³n y aventura, cumple lo que promete, y bien puede hacerse llamar como la mejor pelÃ­cula de acciÃ³n del 2011."}, {"rating": "8", "text": "When I watched Mission Impossible Ghost Protocol, I watched it for a few reasons. The guy from Lost was in it. Jeremy Renner and that awesome trailer I saw in the theater, plus it had been a long time since I had seen a MI film, even though I wasn't a huge fan to begin with. Let me say the good things about MIGP. The action in this is very good. Obviously the highlight action scene is the Dubai scene with Tom Cruise hanging on the tallest building in the world. There were other good scenes though, like the sandstorm scene. Overall the movie is very well paced for a movie that ran, I think 2 hours even of screen time. The cinematography in this is outstanding in this as well. There was also some good use of gadgets here too. All that aside though, there are more negatives about this movie, than good things. For example, I mentioned that I loved that the guy from Lost was in this, but they end up killing him in the beginning of the movie. Overall the acting is kinda dull, I wouldn't say it's bad acting but, just not great. I also thought that they showed too much stuff in the trailer, and way too many TV spots showed the Dubai tallest building in the world scene. The character development overall is not really here for Tom Cruise. We really don't get any character progression with him in. I mean when you stamp a franchise around a guy, like Bruce Willis has done for Die Hard, you need some character progression and development. There's little to no explanation to what's happened to Tom Cruise in the beginning of the film too. Other characters get some okay back story, like Paula Patton. Jeremy Renner, is supposed to be a bit unknown in this movie, but when he finally reveals the secret it feels like wow, that's the big secret. It's not that I saw it coming or I thought that Renner didn't deliver with his acting, it just wasn't a big secret, even though the very ending was cool. The story in this is also disappointing. I mean the IMF's mission is to stop a nuclear war or bomb. It would be cool if the villain had some motivation in this movie. All you really see him doing in this movie is hold a brief case. I thought the assassin woman was way better. Overall you end up getting a story that is decent, but the Russians don't show that they are really all over these guys. For a movie that is called Mission Impossible, it doesn't seem like the stakes are all that high in the movie. Even though some of the things that they do, like the huge building that Tom Cruise climbs. I don't think you feel the desperation in the mission, because the main villain doesn't seem to be all that serious about taking action, besides using a nuclear bomb, with unclear motivations. I could go on and on about this movie, but I'll say that this movie is an excellent, action movie. I thought that Simon Pegg and Jeremy Renner give good performances. The movie does a good job of throwing impossible scenarios to Ethan Hunt and his team, but the feeling of desperation, is not there enough, like it was in the previous MI movies. It was a cool kick your feet up movie though. There was some creative direction with Brad Bird at the helm, but he doesn't know how to quite direct actors. I'll give him a pass though because this is his first live action movie, he's directed. So if you haven't seen this movie, you should definitely see this, just don't expect something great."}, {"rating": "7", "text": "So, let's just be frank, Tom Cruise freaks me out. I know I am not the only one who feels this way, ever since the man decided to dance on Oprah's sacred couch in a display of frenetic and borderline insanity. Anyway, beyond my particular feelings toward Tom Cruise, this movie is good. I would never say great, no, no, not by a long shot, but it is formidably and  fantastically good at what it is trying to do. In this day and age of movies, that says a lot. Cruise's slightly deranged stare works well for him in this picture, and it doesn't hurt that he is almost solely surrounded by beautiful people. Although I have not seen any other Mission Impossibles, I enjoyed this one, and I am sure you will too."}, {"rating": "8", "text": "Action, action, action.  If you aren't going to see this movie for the action, then don't watch it.  The plot is interesting enough to drive the movie forwards, but don't expect anything groundbreaking.  The acting is nice, and the scenes are well made."}, {"rating": "7", "text": "Having seen all four of the \"Mission Impossible\" movies, I see no rhyme or reason to the ratings of each, when compared to one another. Each has something different as well as much of the same. That's why we go to see them, certainly why I did. None of the sequels had the depth of the first, plot wise. The second had a musical theme revamped and all around great soundtrack (best), which the following two failed to reuse; the effect of the soundtrack was never so well tailored. The second also started a trend that was unmistakable in all three sequels, the acrophobes know it all too well; Cruise hanging from an overhanging escarpment in The Grand Canyon(just to relax-oh yeah) and jumping from a helicopter into the air shaft of a high rise (II), pendulum swinging from one high-rise to another in Shanghai (III), face climbing the world's tallest building with a sand storm coming towards the building (IV).\r The fourth mission, the one which garnered the highest ratings (various sites) was as good as the ones before, but, in my opinion, lacked the depth of the original, plot wise, lacked the impact of the best soundtrack, but did capture all the thrill and the action the previous ones had; being mildly acrophobic, I found myself trying to catch my breath and closing my eyes for a few seconds, just long enough to muster the strength to resume watching the action.\r I may not agree with the critics and other reviewers as to how well this sequel matches up with the others, but I can say with some certitude that if you liked any of the previous ones, you should like this one."}, {"rating": "8", "text": "\"Mission: Impossible - Ghost Protocol\" was the movie that I needed to see of the franchise, but I had to keep the daily special in order, and this was the special opportunity to do it, and now that I saw it I can tell you that I liked it a lot. The intrigue and the atmosphere was certainly exciting and unique, something I did not see in the other films of the franchise, the characters were very good, and the scenes with greater danger, especially the scene of Ethan Hunt climbing the Burj Khalifa outside , it was the most risky thing I saw, in a few words a different and risky movie."}, {"rating": "9", "text": "Good directing, great scenes, intense scenes of course, Ghost protocol has it all. But there are some scenes that just drag a bit. but it's definitely one of the best in the series."}, {"rating": "9", "text": "This is an action movie, and as an action movie it does not disappoint.  From the almost-adrenaline inducing scenes in Dubai to the parts inside the supercomputer in Mumbai, the action is nonstop and pure entertainment.  Good acting, though there's really nothing really to be said about the characters, but if you came to see MI4 for the characters you need to be checked.  Good writing for an action movie.  Great cinematography.  Even the 2 hour running time didn't seem too long.  All in all, Ghost Protocol is a fun ride."}, {"rating": "10", "text": "This time they did everything right. Superb casting with an excellent and in-form Cruise delivering a recital on how an action flick should be made henceforth. Clever dialogues build around, though not only, witty remarks between the characters, along with breathtaking action sequences create a high octane mixture that explodes in a brilliant finale. Best in the series and possibly the best action movie of this decade."}, {"rating": "10", "text": "Favorite action movie of 2011/2012. Lots of extreme action and it has a plot. Tom Cruse is a very good actor. I would go see this movie 10000000000 times and never get tired of it."}, {"rating": "8", "text": "The fourth chapter in the phenomenally popular Mission Impossible series has arrived in theaters and jump starts the franchise with a dynamic ensemble cast and a bold mix of action and adventure with a touch of comedy thrown in. Mission Impossible: Ghost Protocol opens with a daring escape from a Russian prison followed shortly thereafter by an infiltration of the Kremlin and subsequent explosion on the famed Russian landmark. Tom Cruise returns as agent Ethan Hunt and is joined by Jeremy Renner, Simon Pegg, and Paula Patton. Shortly after the explosion at the Kremlin, tensions between the United States and Russia are at an all-time high. As a result, the president initiates Ghost Protocol, which effectively shuts down the Impossible Mission Force and eliminates many of their resources. As a result, Ethan and his team must take on an unsanctioned mission that will take them from Russia to Dubai to Mumbai in a race against time to not only clear the IMF from being blamed for the bombing, but to stop a deranged criminal from using stolen Russian launch codes to unleash a nuclear strike upon America. Ethan and his team bring all manner of weapons and technology to bear against the enemy and while the action sequences are intense and the best in the series to date, they donâ"}, {"rating": "10", "text": "A very entertaining film, and great storyline. Good surprises, sounds are awesome (like hitting impacts etc.) and so is everything else in the film. I highly recommend everyone sees this"}, {"rating": "7", "text": "Didn't regret seeing this movie. I've got my complaints, of course. Mysterious analyst Brandt's (Jeremy Renner) dramatic side-story is never fully realized, the plot feels half-baked at times, and Paula Patton's acting is lackluster. Also, one can't help but wonder how an aging physicist can keep up with a young special agent physically. Still though, this being an action movie, it fails or succeeds based on the merit of said action sequences and they deliver in spades. From a chase scene in the middle of a sandstorm to a fight in an automotive production facility, the viewer gets the sense that the filmmakers made a serious effort to innovate. Rather than seeking to impress the viewer based on the quantity of explosions on the screen at any given moment (like this year's godawful Transformers movie), they instead do so by building tension and maintaining a bizzarre sense of plausibility. There are other good things about this movie, like the colorful locales and effective comic relief, but those elements live to serve the effective action sequences. If you'd like to shut your brain off for an hour and a half and enjoy some of the best original action sequences produced in years, then this film would be a solid investment. If you take yourself too seriously, maybe watch something else."}, {"rating": "10", "text": "I think Ghost Protocol is the best Mission Impossible of the lot. It grips you from beginning to end with high octane fuel filled action. The acting was great and is really quite funny at times especially with 'Sean of the Dead' Star Simon Pegg. The Scenes on the side of the tallest  building in the world are breath taking and keep you on the edge of your seat. Put your reservations of Tom Cruise aside, he did really well in this action packed movie. The only flaw I noticed was, where were the people as Ethan Hunt scaled the side of the glass walled building, surely someone would have noticed? This is one movie in a series that has got better as they progress and not worse."}, {"rating": "8", "text": "A good action movie of 2011 that contain more dangerous stunts and cutscenes. Although similar to The Incredibles from the same director, the action in MI4 is almost really look like it, but the plotting is a little bit confusing."}, {"rating": "9", "text": "This one has everything that we expect from the series: taut action, cool gadgets, exotic locales and elaborate operations. Tom Cruise and his trimmed-down team has to run outside the system to stop a nuclear terrorist, but not before some tense and exciting sequences (especially the amazing climb outside the Burj Khalifa in Dubai). Simon Pegg adds just the right dash of humor, but it's director Brad Bird's ability to keep the accelerator to the floor that makes this film well-paced, non-stop fun."}, {"rating": "10", "text": "I will make this short and sweet. Enough action for 2 or more films here! Paula Patton is gorgeous to look at and holds her own well with nearly an all-male cast. The other scenery is very worthy too! Tom Cruise acquits himself well as do his acting supports. Well directed! In short, highly recommended!"}, {"rating": "9", "text": "http://themuddoctor.blogspot.com/2011/12/mission-impossible-ghost-protocol.htmlMission Impossible â"}, {"rating": "9", "text": "Awesome, awesome movie, the technology used in the movie was appreciated by most likely everyone in the theater. The story wasn't A++ but it was still a good and intricate one. I spotted a few goofs throughout the film but it didn't drag me down from the great action scenes and the beautiful Agent Jane, (Paula Patton). Overall this movie was a funny, awesome, and a good fan service for long time fans of the Mission Impossible series."}, {"rating": "9", "text": "To the low-scorers...lighten up.  This movie isn't meant to win an Oscar; it's meant to captivate an audience with great action scenes and this movie succeeded handily.  I had a blast watching this movie --and I guarantee you will too."}, {"rating": "9", "text": "My favorite of the series, definitely much, much better than 2 or 3. Nice to have the strong supporting cast of Simon Pegg, Jeremy Renner and Paula Patton along for the ride. Brad Bird is hugely successful with his first live action movie, the action is engrossing, the plot is tense (if somewhat predictable and overused, but really how many different things can spies save the world from?) and the humor is well distributed throughout."}, {"rating": "9", "text": "Ghost Protocol's rapid pacing keeps it from hardly getting dull. the movie is well made, with some truly jew-dropping action seances like the tower climb. Yes, it's not the finest movie ever, but it's just so much fun to watch. it's charmingly simple but at the same time amazingly entertaining. there is a cool balance between story, action and comedy that keeps it from being boring . Ghost Protocol is simply a blast"}, {"rating": "7", "text": "I liked Mission Impossible: GP, but it isn't really a good film. Tom Cruise works very hard to make this film energetic, exciting and take the audience to exciting places - Budapest, Moscow, Bombay and Dubai. He even hired Pixar and Animation hero Brad Bird, who mounts a good looking movie that leans in segments closer to Brian DePalma's 1996 blockbuster, which works really well. The IMAX action sequences and Tom Cruise's physicality and willingness to do whatever it takes to regain AAA status in Hollywood delivers an earnest entertainment. It doesn't have an overly suspenseful climax, but the JJ Abrams emotional ending got me, and put some needed depth into the latest Ethan Hunt outing."}, {"rating": "8", "text": "Best Christmas present this year!  The bar is set high for this year's hoilday films with this action packed adventure.  Tom Cruise and the supporting cast were excellent.  Dont miss this!"}, {"rating": "8", "text": "I think the pace of the movie was well done. The action from beginning to end made it enjoyable, it was a bit of a rollercoaster on the \"intensity\" of the action.   The scenery, the fight scenes, the nature/technological obstacles just make the movie come together. You get a nice 'throwback' to some events from Mi3 which was a nice touch, and they even leave it open for a 5th installment, which if it was the same team as this I would definitely go see!  To those that haven't seen it, there were NO extra scenes at the end."}, {"rating": "8", "text": "Ghost Protocol breaks the physics laws and becomes really IMPOSSIBLE. But the action makes the movie something more than expensive and that makes the difference. This movie doesn't need a history between all of it, the ACTION do everything, even with a lot of lies in the physics laws."}, {"rating": "8", "text": "Mission: Impossible - Ghost Protocol is a good movie, nothing that will make you amazed. The story is ok, i am sure that we all have already seen better mission impossible movies, but this one will not disappoint you. Action is a continuous thing, Tom Cruise keeps on doing a great job and make things that certainly will make you lose your breath. Humor is also present in the movie, jokes will appear a lot and in most of them, you will probably, at least, smile. Good film, I recommend you all to watch."}], "recommendations": ["mission_impossible_rogue_nation", "mission_impossible", "angel_has_fallen", "mission_impossible_ii", "the_bourne_ultimatum", "john_wick_chapter_3_parabellum", "the_bourne_supremacy", "the_mechanic", "the_commuter", "quantum_of_solace", "the_equalizer", "the_bourne_legacy", "john_wick_chapter_2", "spectre", "transformers", "boss_level", "lethal_weapon_2", "the_terminator", "mission_impossible_iii", "the_island", "mad_max", "unstoppable", "shooter", "the_fate_of_the_furious", "the_bourne_identity"]}