{"id": 1855, "title": "Mission: Impossible - Rogue Nation", "starring": ["Tom Cruise", "Jeremy Renner"], "runtime": 131, "genre": ["Action", "Adventure"], "description": "Ethan and team take on their most impossible mission yet—eradicating 'The Syndicate', an International and highly-skilled rogue organization committed to destroying the IMF.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/fRJLXQBHK2wyznK5yZbO7vmsuVK.jpg", "categories": {"plot": 8.465116279069768, "acting": 8.5, "ending": 8.2, "soundtrack": 9.5, "cinematography": 9.0, "familyFriendly": 6.0, "funny": 9.0, "action": 8.609375}, "reviews": [{"rating": "10", "text": "Just saw it at the local theater.  The theater has a Thursday Night Preview.  What an Outstanding Movie.  It tells a good story along with all the Action and Special Effects.  (I hate movies that are a bad story with only Special Effects to support it.)   It's a really good Screen Play.  The writers keep you wondering what side the girl is on, and what International Agencies are corrupted.    Good story.  Great entertainment."}, {"rating": "9", "text": "Mission: Impossible is a rare franchise that gets better and better with every movie. Cruise, as always, is fantastic and he helped greatly by his supporting cast. Pegg is a fine lead in the movie as well. The movie is very well directed, The action scenes pretty solid, and the plot as a whole was satisfying enough. The only complaint I have is with the casting of Sean Harris as the main villain. He just wasn't really villain material. I mean, This is a franchise who had actors like Jon Voight and Phillip Seymour Hoffman as the lead villain. I expected a tad better performance than the half mumbled dialogue that Harris performed through out.\r Aside from that, Fantastic movie. Would definitely recommend watching/buying."}, {"rating": "8", "text": "Just when you thought the Mission: Impossible days would be over; once again, another Mission: Impossible film pops out of our eyes and boy... the action was surprising."}, {"rating": "10", "text": "I give it a 10, but 2 points are for the special soundtrack of the \"Mission Impossible\". This movie has always been in competition with \"007 James Bond\" and Congrats for always winning the better point, because the missions that are seen in this movie ( Mission Impossible) are always mentionable/ Describable, and one of the good points of this movie is that it uses new actors from different countries. And it's always made for families and for all of the age ratings. At last, I can say that the \"Mission Impossible\" movies are trustworthy and safe to watch with children."}, {"rating": "7", "text": "Mission impossible rouge nation was the best of the 4 of my opinion, it was filled with action, I liked tom cruises acting and Simon peggs acting to, so yah it was a pretty good movie I would say. And if it was out of ten I would say 7."}, {"rating": "7", "text": "Overall, it dragged a bit too much.  Good story and not over the top (by today's standards anyway) on special effects or CGI.  I think it could've been done well in 100-110 minutes."}, {"rating": "8", "text": "\"Mission Impossible: Rogue Nation\" is the 5th installment of this Tom Cruise franchise which has catapulted Paramount, the property and its star into great fortune. With a fresh script from writer and director Chirstopher Mcquarrie and fine acting by Simon Pegg, Jeremy Renner, Rebecca Ferguson and Alec Baldwin, Mr. Cruise performs admirably in his role as leader of the IMF. The film is fast paced with breathtaking action scenes and a plot that keeps unraveling at the same speed as the action on the screen. Rumored to have performed many of the action scenes himself, Mr. Cruse is the definitive action hero. Although slightly over 2 hours in length, the viewer is never concerned about that because he or she is too busy following what is taking place on the screen. I give the film an 8.0 and trust that most who watch it will be as pleasantly surprised as I was to find that it is a mission possible for some sequels to be as good or better than the original.."}, {"rating": "8", "text": "The older Tom Cruise gets, the more clever he is. Mix some humor with action, this turned out to be another great Mission Impossible movie, even better than Ghost Protocol. The ending isn't quite what I expected because it was modified due to the original ending that was cut and replaced."}, {"rating": "10", "text": "I'm not a huge Tom Cruise fan by any stretch of the imagination.  I go all the way back to the original black and white TV series Mission Impossible with Peter Graves, Martin Landau and Barbara Bain.  When the franchise was reinvented on the Silver Screen with Tom Cruise in the lead I made sure to see them all.  To tell the truth they were enjoyable but in the range of a 7 score.   This latest movie is a 10 as it will keep you on the edge of your seat, has tension, with just enough comic relief and action to make it very enjoyable.  Cruise is masterful in this flick.   The best part is you won't be able to figure out the ending which I'm always able to do.  This one is a sure crowd pleaser so don't miss it."}, {"rating": "8", "text": "Mission Impossible Rogue Nation continues the franchise’s seemingly impossible mission of continuing to make thrilling and exciting movies that are some how as good if not better than its predecessor. The new director does a good job at raising the stakes while still keeping the fun, set pieces, and sense of teamwork that made the fourth one such a highlight. At times, it can feel a tad overwhelming with way too many twists serving to provide an extensive runtime but that is the nature of mission impossible a nature I’m glad the franchise hasn’t lost yet."}, {"rating": "9", "text": "Rogue Nation may be the best M:I movie to date.  The cast remains in-tact from Ghost Protocol but this time there's a more interesting plot, not terribly dissimilar to the first film (minus the internal betrayal).  What really got me going here was the action sequences and the filming.  Everything was so well thought out and captured - the angles were always amazing that I felt like I was almost there.  Movies that feature a lot of movement and action scripting don't always try to do anything too elaborate/interesting, and that can be the make/break of a movie like this.  I don't know why anyone would really hate this movie, but for me I enjoyed it so much I will definitely be catching this one again when it's out on Blu-ray."}, {"rating": "7", "text": "This is a nice, gentle left-turn from the frenetic Bourne-clone spy flicks and destroy-the-world comic book movies of the past few summers.  It's also a bit more action-paced than recent \"thinking\" spy flicks like Tinker, Tailor, Soldier, Spy (which, incidentally, I enjoyed tremendously).  It hits a nice middle-ground between the two extremes and results in an enjoyable movie with familiar characters, an understandable plot, low-body-count action, and a satisfying conclusion.\rIn this installment, the IMF is back to doing what it does best – defending the world from certain annihilation while working without the cover of government protection or authority (again…where does the money come from?).  Ethan Hunt is off the radar, staying one step ahead of the CIA and one step behind his enemy until he is able to reunite his team to do the “Impossible” (thus the title, right?).  There isn’t a lot of new territory here, and “The Syndicate” doesn’t sound all that different from the version of SPECTRE we’ll be seeing later in the year.  However, it is well-crafted and well-executed, and is therefore a good example of what movies do best – escapist and enjoyable.\rThis could be a personal opinion, but \"Rogue Nation\" felt much more like the original movie than any of the others in the series.  Not only do we have an explicit reference to the original NOC-list heist, but the movie’s locations, lighting, and pacing lend it the same air of foreign charm that helped separate the original from predecessor Bond and Bourne movies.  While the movie drags in spaces, there are a few scenes which are balletic in their execution – the complicated “chase” scene above the Vienna Opera House being the most obvious example.\rAll in all, enjoyable and recommended."}, {"rating": "8", "text": "The Tom Cruise lead Mission Impossible movies have become a pretty reliable franchise over the years and, with some standout action set pieces and a suitably outlandish plot, Rouge Nation doesn’t disappoint."}, {"rating": "8", "text": "Tom Cruise really does risk his life in the opening scene of this movie. It is not an optical illusion or a stunt man. It is Cruise himself hanging on for dear life to the side of an airplane that has taken off and become airborne. However, he has been harnessed so that if he had slipped in the filming, he would have presumably survived, falling only a few feet before being secured. But how many actors could perform that stunt even with a harness? One gets the impression that Daniel Craig takes an island vacation when it's time to film the stunts—he relies on a professional double to do the risky stuff.\r This film may at times be a little overwhelmed by the many chase scenes, but the plot keeps the audience guessing about which double agent is betraying whom. Cruise's character, the indefatigable Ethan Hunt, is a man who has a guardian angel sitting on his shoulder so that no real harm can ever befall him. He is a strict purist, a defender of the peace, a human superhero, and as the CIA head (Alec Baldwin) puts it, “the living manifestation of destiny.” (A few critics commented on the guffaws provoked by this line—nobody laughed at my showing in Montreal, but oddly enough, at the end of the film there was a round of applause.) In short, Hunt is to spies as the Dalai Lama is to Buddhist monks.\r The IMF (Impossible Mission Force) is trying to stop the latest incarnation of evil, Solomon Lane (Sean Harris), from assassinating all the heads of state as part of a master plan conducted by the Syndicate, an international crime network. Lane is an insanely criminal mastermind, and in no time at all, he has Hunt captured and hanging by his wrists in a torture chamber. Even Hunt cannot escape from this dilemma until a beautiful double agent, Ilsa Faust (Rebecca Ferguson) enters the room and miraculously releases him. Like Hunt, she is unflappable, invincible, and incorrigible. She is neither Bond girl, nor Bourne girl, nor any kind of girl. Ilsa Faust defies categorization. She is unique.\r Thus begins a bizarre relationship between the two spies based on mutual respect, mutual desire for self-preservation, and mutual attraction, although consummate professionals that they are, they keep their distance from each other. Romance is clearly for mere mortals, a weakness that disciplined ninja-like warriors cannot afford to indulge. For them being impassioned means that you would do anything to save the world, whereas more carnal inclinations are to be derided as juvenile distractions.\r In the end we have what has been termed the American answer to James Bond, and though Ethan Hunt is somewhat lacking in that droll British elegance, our roll-up-your-sleeves kind of folksy spy is actually more appealing. In a world where everyone has been speculating for years about who is going to replace Daniel Craig as the next 007, no one ever asks who is going to replace Tom Cruise. There's a reason for that—he is incontestably irreplaceable. Fortunately, Liam Neeson has set a new precedent with the Taken series, where aging spies who just want to retire are forced back into action because they are simply too good to hang out their gone fishin' sign. Neeson still inspires admiration at 63. Cruise is only 53, and like the character of Ethan Hunt, he can only get better with age."}, {"rating": "7", "text": "Rogue Nation is a nice return to form for the Missions, with a good story and some really clever sequences."}, {"rating": "8", "text": "As advertised, non-stop action and the typical MI story with many twists and turns.  Overall a very good movie - best MI movie yet.  Since this is the fifth MI, some may feel no need for more sequels.  However each story is so much different from the rest as far plot/action/location so certainly room for more MI sequels - why not.   If you've liked previous MI's you will love this one."}, {"rating": "9", "text": "Next to the Avengers: Age of Ultron, this is my favorite movie of the year so far. It was gritty, it was action packed, Tom Cruise and Aleck Baldin were fantastic, and overall, it was a highly enjoyable film."}, {"rating": "9", "text": "The fifth installment of the Mission Impossible franchise is no only the best since the first one, it's also one of the best action films of the last decade."}, {"rating": "7", "text": "Thought this film ran too long, almost 2 hours when the first half (within the plot) is not needed-a trick sort of speak. Some would call that a plot twist I guess. The action was good but certainly too much for a character to survive-but this is not a realistic film either-so shouldn't expect realism.. Further, the flick is not as good as some other MIP flicks. None the less, it was good for a watch, but won't be going into my collection."}, {"rating": "8", "text": "I seriously thought this film was going to beat Ghost Protocol, judging by all the reviews, but it didn't. Ghost Protocol still remains as the best Mission Impossible film in the series in my opinion. That doesn't mean Rogue was a bad movie, because it is definitely better than MI3 and MI2. Some of the scenes in Rouge Nation felt a bit too long, which would've been better if they shortened some of it. The action was great, just like the previous films, it was very suspenseful and engaging. The new girl in this movie was freaking awesome, because she was tough and  sexy at the same time. I hope she returns for the next sequel, because I would definitely go see it just for her. My actual score for this film, 7.8/10. It's not the best Mission Impossible, but it's definitely up there, just one level lower than Ghost Protocol."}, {"rating": "8", "text": "The franchise keeps getting better and better. Action stunning as usual. Great male leading, great partner in crime-friend, and great leading female character. Story is on point and with more quieter moments than the previous installment, but very tense. Overall, a blockbuster of the good type. 8 out of 10."}, {"rating": "10", "text": "Got the DVD and watched the movie, keeps your attention and well made, but what I liked most was watching the movie extra with the commentary of tom cruise and the director as they go through and explain about different scenes and actors they used, great stuff."}, {"rating": "8", "text": "Containing probably some of tensest scenes since the first film, this instalment offers amazing action, plot and characters. My only critique would be the chase scene felt more like a time killer than anything really that new and profound, however the rest of the film is well done."}, {"rating": "9", "text": "From beginning to end the story keeps you on the edge of your seat, the action scenes are epic and continue to out do itself with every MI movie. The writing is done so well that it keeps you wondering about what would happen next. One of its weak points is its villains, not the syndicate, but the boss of the syndicate himself, you would expect someone like him to be intimidating be he just isn't, he is...weird. But this is one of 2015's best movies, the story is great and the action is better."}, {"rating": "8", "text": "Mission: Impossible - Rogue Nation doesn't scale the heights of Mission: Impossible - Ghost Protocol but as an action-thriller, is sleek, complex, entertaining and above all, fun."}, {"rating": "8", "text": "Five episodes in, no film franchise should still feel this fresh. They are still crafting unforgettable and creative sequences that suspend disbelief but don't strain it. Just like watching Hunt rappel from a ceiling in MI1, parachute from a skyscraper in MI2, break out of a Russian prison in MI3, you're not likely to forget his exploits in this one. Beyond the great action, there are solid characters and a fun plot. There's about one too many double-crosses for my taste, but the overall experience is still as fun as ever."}, {"rating": "10", "text": "I had almost accepted the fact that it was too much to ask for a smart, funny, and action-packed movie these days. (I’ve been a bit disappointed with some recent blockbusters this year, which I\renjoyed but know could’ve been better.)  But I was thoroughly happy to be proven wrong when I saw Mission: Impossible--Rogue Nation.\r **Tom Cruise gives his 100% as IMF agent Ethan Hunt--fully embracing the role and doing all the stunts. **Benji (Simon Pegg) is funny (didn’t expect him to be playing CoD at work). He’s juxtaposed well with the slightly cynical and weary Hunt, as he’s more naive and not battle-hardened. **Rebecca Ferguson is convincing in her role--she’s not frail or weak, she’s athletic and actually sort of muscular. She’s not overly sexualized, made a love interest, or a victim.\r **We get an interesting character in Alec Baldwin’s Alan Hunley, director of the CIA--who doesn’t trust the IMF. Director Hunley has gravitas, and he has screen presence. You wonder whether or not he’s helping the Syndicate. **William Brandt (Jeremy Renner) and Luther (Ving Rhames) both needed more screentime.\r The movie kicks off with a big stunt (apparently done by Cruise himself). Once the action starts, it doesn’t let up. Chasing after a MacGuffin and the Syndicate leads Cruise from one location to another, with various members of his team showing up to assist along the way.\r If you want to be judgemental, nothing in ‘Mission Impossible 5’ is over-the-top or mindblowing (in terms of the script and action sequences), but the movie is better than most other films in both of those departments. The script and action scenes are smart, relying more on suspense than eye-candy. Director Christopher McQuarrie succeeds where most have struggled, in terms of balancing a decent script, action, comedy, and characters. The cinematography and editing is well done (as showcased in the Vienna opera scene).\r I definitely wouldn’t say that ‘Rogue Nation’ was too predictable or a bore. I really enjoyed myself when I watched the movie. Action, suspense, sharp dialogue, and humor make the film a treat. The cast helps give the film a contagious and exhilarating energy. I honestly was surprised by some of the film's twists. (But it should be noted that I’m new to the franchise.)\r I think “Rogue Nation” deserves a 10, and not because it’s perfect. The villain wasn’t that memorable, and characters like Luther and Brandt needed more screentime. Nevertheless, it’s the closest a 2015 action film has been to a 10 (at least for me). Director Christopher McQuarrie manages to make old tropes feel fun again, and balance a lot of components to make a great, enjoyable film.\r I have reviewed 43 movies (on Metacritic and IMDB), some recent ones, including: Minions (Despicable Me spin-off), Avengers: Age of Ultron, Fast and Furious 7, The Divergent Series: Insurgent, Taken 3, and more. I also review TV shows."}, {"rating": "8", "text": "This is another great addition to the Mission: Impossible franchise and it's one of the best movies of this summer, although I'd say that I enjoyed this MI a little less than its predecessor because it has a lack of memorable action sequences, although it has two great sequecences, one with a lot of water and other with a high-speed motorcycle pursuit. Very entertaining with a complex plot, good characters and a sense of humor. The best aspect of this film is the female lead, who has great screen presence."}, {"rating": "10", "text": "Mission: Impossible- Rogue Nation 10/10 STARS! Rewatchability Factor: 7/10\rNothing will beat the first MI movie but this one comes close. Can't wait to see the next MI.\r #‎MIOverTheCurrentBond‬ ‪#‎TomCruiseIsFearless‬ ‪#‎NoSpoilers‬ ‪#‎GoodJobHawkeye‬ ‪#‎VingRhamesIsBack‬ ‪#‎ThatEnding‬!"}, {"rating": "8", "text": "\"Mission: Impossible - Rogue Nation\" might be the best one out of this classic franchise, and it's definitely my 2nd favorite movie of the year so far. Needless to say, it was a fantastic experience. The action is the highlight of the movie, but the performances come close to that bar. At this point, there's no denying that Tom Cruise is one of my favorite action stars in Hollywood. He makes Ethan Hunt not only look like a total badass, but also a vulnerable man, and that's what I really like about him. The action, as I said, it's phenomenal and the set-pieces are visually striking, with the \"underwater\" scene being the most impressive element in the film. There was also a few character drama and comedy, but not with a confusing, clichéd romance. Some stuff about the female character just seemed off when it came to what side she was on. That's further answered in the second half of the movie, but I still feel they could have fleshed the character more. You can bring up that they didn't want to reveal the girl's true motivations because they wanted the viewers to keep guessing, but that literally has been done before in previous installments, so yeah, in my opinion, it's kind of clichéd. There are also some moments that are very dumb and not credible at all. Seriously, in the beginning, Ethan enters in the plane and the wind just throws him to the wall with impact and somehow he survives? And during that chase scene in Morocco, the car does a few flips and they survive? Hmm. Nonetheless, \"Rogue Nation\" surprised in how much spectacle the movie could have. The action is awesome, the acting is great, the direction is slick, the movie is so well-paced and the cinematography is dazzling, not to mention, that the script is smart. Honestly, I really liked this movie and even if it has some tiny flaws, it all gets weighed down by all those fronts.\r Final Score: 8/10"}, {"rating": "9", "text": "No fan of action movies or summer blockbusters should miss this.  \"Epic\" in all the best ways for a movie.\r If you like this and missed Edge of Tommorow (Live, Die, Repeat) definitely consider seeing that too.\r An amazing synergy of outstandingly coherent script and production values from top to bottom.\rThe script's need for a certain romantic theme programs the choice of the opera used in the opera sequence.  It works brilliantly."}, {"rating": "8", "text": "Before watching this film: I have watch the first and the fourth film on TV, and the second and third in the cinemas. In my view, the second film is the low point, while the first, despite its confusing plot, is the best one. Overall, the film series follow a film-making formula that, unlike the TV series, revolves around the boldness and non-realistic plans of its main character, Ethan Hunt (Tom Cruise).\r Same thing happens here as with the previous films. Ethan Hunts saves the day again from a couple of unsaveable situations, except that this film is better than the previous three films, perhaps even the first film.\r Who would think the film is great? Most people would love it.\rWho would think the film is only so-so? The elderly may be a bit tired of the car chases, non-realism, etc.\rWho would think the film is lousy? No one.\r Score: 4/5 (no half score). Worth paying to watch it in the cinemas."}, {"rating": "7", "text": "When it comes to Mission Impossible Movies everyone remembers sly spy espionage/ Intense action and Tom Cruise. This movie is no different the action is on point with tons of practical effects and for what isn't still looks real. The story is something different when it comes to the Mission impossible series and it's nice to see the films take a new direction. The actions are also great in MI5, Tom Cruise and the regulars do a great job but then the addition of Alec Baldwin is alright and Jeremy Renner is nice to see with some more screen time, Simon Pegg is also perfect in his roll adding some comedic elements without taking away from action. With this movie you get what you expect out of a Mission Impossible Film, A 2 hour film showcasing Action,Girls,Explosions and Some Humor thrown in to."}, {"rating": "8", "text": "Mission Impossible : Rogue Nation reviewed\rby jd ep\r It's been almost 20 years since Tom Cruise took on the mantle of Ethan Hunt, seemingly the only member of the Impossible Missions Force, and \"Rogue Nation\" is his 5th cinematic outing. This time around, his organization is under fire by CIA boss, Alec Baldwin, and a Senate Sub-committee voting to disband the IMF, stating most of their successes are based off of Luck than actual tactics. Hunt and his team have faced overwhelming odds in past film; from their own leader going rogue, to stopping a super virus, to a really mad Philip Seymour Hoffman, to stopping a nuke mid-air after accidentally blowing up the Kremlin. Now with no more IMF or governmental support, Ethan Hunt is searching for the secret organization that possibly has ties to everything thats happened in the past, known only as \"The Syndicate\" which also has infiltrated the IMF at its heart, and Ethan can only trust his team; Ving Rhames, Simon Pegg and Jeremy Renner. The rest of the films usually introduces a larger cast of team members who inadvertently die on missions or from treachery, but this time its just returners. But this film isn't just about the boys, the female lead.. and really, only woman in the movie, Ilsa Faust played by Rebecca Ferguson (who i thought was Michelle Monaghan at first) does her fair share of asskicking, double / triple crossing... its really kind of hard to tell whose team she's on. There's almost a love story between Hunt and Faust, but Ethan is still married or has a fiancé but she's never addressed, he just let her go at the end of Ghost Protocol.\r Mission Impossible: Rouge Nation is the most fun Mission Impossible ever. It offers epic action sequences, gorgeous locations and big laughs. There's no real character growth or anything, just procedural action sequences, Rogue Nation knows exactly what it is, it's more, more adventure, more humor, more excitement. You know who everyone is, and you know you'll probably never see the female lead again as seems to be the case with M:I female leads, which is sad, because Ferguson carries most of the film. Her character, Faust is the central source of pathos, as her life hangs in the balance, being played with by her government and the baddies and the only person she can trust is Ethan Hunt. Jeremy Renner reprises his role as Brandt, taking the backseat in most of the excitement, Ving Rhames's Luther gets more field time and shows why he's best the guy offsite, while Simon Pegg's Benji is more confident in his role as a hacker turned field agent. Though the centerpointe for all the action is Tom Cruise, whether he's flushing himself down a giant toilet, escaping an opera house, in a motorcycle chase through Morocco or hanging off the side of a cargo plane, there's little Ethan Hunt can't accomplish.\r While Rogue Nation has a stand-alone feel, its also a direct sequel to Ghost Protocol. Never before in a Mission Impossible movie have they ever addressed what happened in any movie before, this one recaps what new audience members may have missed in films past, while also never mentioning what happened with any other members of the IMF. But I can live with that, if I want to see gorgeous set pieces, insane action sequences, Tom Cruise risking his life and Simon Pegg making fun of everything, I'll gladly come back to the theatre for more Mission Impossible films if they just focus on. Where the film felt a bit lacking to me, was in the gadget department. Mission Impossible movies are known for their amazing tech. In Ghost Protocol, the BMW i8 that Ethan drives to the Indian Billionaire's party in, I thought we would never see, it looked too futuristic; In Los Angeles the i8 is everywhere now. While all the heroes drive Bimmers (and one Range Rover) the only cool car thing is a biometric reader on the drivers side window to lock and unlock the car. That seemed cool, and a way to get smudgy windows. The only other cool toy was an automatic lockpick credit card, there were a few unorthodox firearms in the film as well, but no exploding gum, no laser watches or dynamite pens (granted a few of those are Bond staples, but still).\r Go see Mission Impossible: Rogue Nation\r Film Grade : B"}, {"rating": "9", "text": "By the time the fifth installment of a movie franchise rolls around, that series starts to show its age. Not with Mission: Impossible, it seems, because Rogue Nation is yet another incredibly silly yet undeniably entertaining entry in the 17 year old franchise that keeps you on the edge of your seat for the entire movie. This time around, Ethan Hunt is now an international fugitive and must take on his most impossible mission (heh) to bring down the rogue organization Syndicate, who are committed to bring down the IMF. The plot twists keep you on your toes the whole time, and it's really what makes Rogue Nation so thrilling. It does succumb to the normal spy movie goofiness, one time in particular early in the movie that made me shake my head at how ridiculous the whole idea was. The double, triple and quadruple crosses get rather confusing as the plot progresses too. There's never a dull moment in Rogue Nation, a suitably fun and over-the-top summer blockbuster, and it proves that Tom Cruise is an unstoppable action star."}, {"rating": "9", "text": "Rogue Nation no es tan divertida como Ghost Protocol, pero mantiene la esencia pura, clásica y única que solo Misión Imposible puede ofrecer. Al igual que Mad Max, esta quinta parte ofrece unas de las mejores secuencias de acción que podrás ver en este año y muchas de ellas con poco CGI (Aunque Mad Max sigue siendo el Rey de este año) Vuelvo a insistir, es excelente, divertida, emocionante, innovadora y adictiva, una de las mejores películas de este año, pero no supera a su antecesora: GHOST PROTOCOL"}, {"rating": "8", "text": "Even though I feel as if Rogue Nation rehashes a couple plot points from the previous (and superior sequel), it still remains to be a fun, action packed summer blockbuster filled with some of the most memorizing action set pieces I'm recent memory. Tom Cruise once more proves himself that he is one (if not) the greatest action hero of all time. This movie in one word? Awesome."}, {"rating": "9", "text": "Amusing, fun and surprising as it should be. M:I 5 is as good as Ghost Protocol, giving us great characters, a good and smart story, an incredible cast and exciting special effects. Pegg is funny as expected, Harris is an unpredictable villain, Ferguson makes us want her in the franchise forever, Cruise is Cruise. Definitely one of the best missions of Ethan Hunt, can't wait for the next one!"}, {"rating": "9", "text": "Easily to grade as the best of the sequels.  Tons of stunts & action. Characters all were believable. Theater was full of satisfied on-watchers. Never a lull in the story. Guess 8.5 would be more accurate but I just could not give it an 8. Very entertaining & worth the price of admission"}, {"rating": "10", "text": "Another yet thrilling and engaging 'Mission Impossible' that sets out an exhilerating adventure for all the viewers,  chasing the beat of peoples' hearts through suspense and astounding stunts by Tom Cruise."}, {"rating": "8", "text": "Tom Cruise is back for his 5th entry in the Mission Impossible franchise, and not like most sequels, this one does not disappoint. It exceeded my expectations by a long shot and delivered some incredible action sequences. Not as good as Ghost Protocol, but still a very fun time at the movies"}, {"rating": "9", "text": "It isn't a masterpiece, but it's a perfect mission impossible/action movie for sure.  Cast was PERFECT, especially Rebecca Ferguson ( i hope it won't change in the next part).  Plot was gripping and interesting. Stunts were mindblowing. I hope there is gonna be more this kind of movies."}, {"rating": "10", "text": "This is one of the Best Summer Movies and the Best in the Franchise.The Story was great\rand compelling.The Villian was a lot better than the Previous Installement.The action scenes\rwere well Done.It had a Great Intense Scene.The Morroco Chase were the Best thing in the\rWhole Movie.Tom Cruise is still a Badass.He does well in his Role So Does The Whole IMF Group.\rThe stunts were Great and they weren't Over the Top like Furious 7 Thankfully.The Only\rProblem with the Movie was the Jokes went Flat and Rebecca's Character wasn't that suprising.\r In the End Rogue Nation is a Must See Movie .Everybody is going to Love the Movie"}, {"rating": "8", "text": "Mission impossible movies always provide great action, comedy, interesting gadgets and a plot which has twists and turns. Really enjoyed this movie, even though the ending could've had a bit more action and something more to it, but otherwise pretty great action movie!"}, {"rating": "8", "text": "Great effects, brilliant action sequences and an immersive story prove that Christopher McQuarrie can match it with directors such as Brad Bird and JJ Abrams. In fact, McQuarrie provides the best Mission Impossible film yet. The opening scene sets the tone for a spectacular ride. A ride filled with twist and turns and simply outrageous entertainment likely to keep you on the edge of your seat from start to finish."}, {"rating": "10", "text": "Definitely one of my favorite action  movies of all time absolute genius film making! One of the best endings ever! Rebecca Ferguson was really amazing in this as was Tom Cruise of course."}, {"rating": "8", "text": "The fifth Mission Impossible , was more exciting than I saw , especially the scene where Tom Cruise , or say ( in secret and affection ) \" Tomsito \" made ​​well risky and was subject of a plane flying and from the outside , who the hell I could think to do that ?, but the other more charm , good stunts that action certainly leaves us more Mission Impossible emotions with more deliveries"}, {"rating": "9", "text": "Like the trailer of this movie said, ready or not here they come. And BOOM - here comes Rogue Nation, and boy - did it come with a bang. Let me just say right off the bat that, this is probably my favorite Mission Impossible film…by far.\r Gone are the days that you’d need slow motion, flying white doves or lens flairs to make a Mission Impossible film interesting, this brand new installment of the franchise rejuvenises the aging series in an explosive and exciting way. What I like about the Mission films is that, much like the Harry Potter and James Bond movies, each installment of the series brings something different and refreshing, thanks to their ever changing directors. And like the Marvel films, each Mission Impossible embodies a different action genre.\r I have to admit, I wasn’t the biggest fan of Jack Reacher. It was an okay action film that didn’t do much else for me. So when the announcement was made that Christopher McQuarrie was directing the fifth mission impossible I was a little skeptical. Even after I saw the trailer I still had my reservation toward the finished product. I mean I have so much respect for JJ Abrams and Brad Bird that the inner nerd in me, sorta-kinda wished they had picked someone with a better track record. With all that said, the first five minutes into this movie I was convinced that my months and months of worries were for nothing. Like I was sold. I can honestly say right now that this is the best mission impossible film to date.\r Now, my biggest issue with Ghost Protocol was that although it was very entertaining, it didn’t have that edge on your seat suspense like Mission 3 did, and that plus a weak and generic villain robbed away some of the potentially intense moments. This time around, we have a formidable villain who is someone even Ethan refers to during one very nail-biting scene as “his equal”. And his plan is pretty screwed up. He’s not the in your crazy, in your face villain, he’s soft spoken and civil and that’s what makes him so **** dangerous because throughout the film I had this feeling that he was this time bomb waiting to explode. He really raised the stake of the game, and the audience despised him for that, I know I did, when I wanted someone to show him who’s boss, like, I wanted him to be taught a lesson in the end. When a villain gets the audience to feel that way, it’s usually a sign that it’s a very well written character.\r Another well-written character is newcomer to the series, Rebecca Ferguson. I didn’t know who she was before this film. But now, oh yeah. She was such a badass in this movie. Not only that, but she is not your typical Mission Impossible filler girl, she is an actual person with a pretty neat character development and story arc. It’s been a while since the Mission series had a female character with substance and also knows how to kick ass. Her character is such a breath of fresh air that it made an already top-notch movie even more exciting. One of the highlights of the film, in my opinion.\r Of course, then you have the returning characters from the previous movies like Benji, Brandt and Luther who were more or less the side characters but were still pretty much in the picture. They are mostly responsible for the comic relief moments of the movie. And the genuine camaraderie among these characters just makes this team really great. Like you want to root for them to win.\r The biggest thing I like about the direction Chris McQuarrie took the movie is that, it’s acknowledging the fact that this is an aging franchise. It managed to make references to all four previous Mission Impossible movies, and as a long time fan I feel like this was a very a smart move. With the exception of James bond, when a franchise that stretches to as long as 20 years, it usually screams been there done that. But Mission Impossible manages to avoid all that which is very neat.\r Of course, while the movie handled the characters pretty well, its action sequences are just as stellar. Apart from tom cruise dangling in midair on an airplane, a stunt he actually performed himself, there were many other spectacular action scenes, notably, a stunt-filled, high-speed freeway chase that not only provided a neat little throwback to the motorcycle chase from Mission 2, but also kept me holding my breath from its sheer action galore. There is an underwater sequence with no music in the background which really threw the audience into the movie itself and that was breathtakingly intense. This movie probably has the best action scenes in the entire franchise.\r The movie for me is a perfect blend of all four previous Mission Impossibles, and everything just flows so well and fits together seamlessly. I was still thinking about this movies hours after seeing it on opening weekend. It’s what a summer action blockbuster should be, and it’s what every mission impossible fan deserves."}, {"rating": "9", "text": "Despite all the negative attention Tom Cruise has found himself in, he still manages to charm in movies with the latest Mission Impossible movie. And just like the franchise, Tom shows no signs of slowly down, even with age catching up to them both.\rAll the actors do pretty well (especially Simon Pegg, as he almost always does) but even the minor characters do surprisingly well. The stunts? As spectacular as ever. Nothing truly \"tops\" the skyscraper scene in Ghost Protocol, but there is more then enough action to keep you interested. The fight scenes are fantastically shot, but sadly lacking next to any Marvel movie in recent times. But, what the film lacks in fist fights, it makes up for in unexpected laughs and frantic, edge-of-your-seat moments.\rAs far as the movies plot goes, this is not a Christopher Nolan film. There aren't any twists or turns to leave you scratching your head, and almost every \"reveal\" I had predicted. But, for a mindless good time, I cant think of a better alternative."}, {"rating": "10", "text": "Rogue Nation is totally the best in the Mission Impossible franchise. Much better than the preceder, Ghost Protocol. A lot of excitement, amazing action scenes, funny, thrilling, everything was perfect, the cast gives an incredible performance, I totally loved Rogue Nation, this film is the best action film of Tom Cruise so far."}], "recommendations": ["mission_impossible_ghost_protocol", "mission_impossible", "angel_has_fallen", "spectre", "the_bourne_legacy", "quantum_of_solace", "jack_ryan_shadow_recruit", "the_commuter", "the_bourne_ultimatum", "creed_ii", "mission_impossible_iii", "the_equalizer", "mission_impossible_ii", "the_fate_of_the_furious", "the_mechanic", "sherlock_holmes_a_game_of_shadows", "tomorrow_never_dies", "mad_max", "boss_level", "maze_runner_the_death_cure", "shooter", "the_island", "unstoppable", "skyscraper", "avengers_age_of_ultron"]}