{"id": 2364, "title": "Miss Sloane", "starring": ["Jessica Chastain", "Mark Strong"], "runtime": 133, "genre": ["Thriller", "Drama"], "description": "An ambitious lobbyist faces off against the powerful gun lobby in an attempt to pass gun control legislation.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ptfvQlqe2xJiMSewSj52qAVq5z0.jpg", "categories": {"plot": 6.333333333333333, "acting": 7.081081081081081, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.0, "funny": 6.25, "action": 6.888888888888889}, "reviews": [{"rating": "8", "text": "A Complex Heroine\tI thought my character Peppa might be unlikable sometimes, until I saw Jessica Chastain portray an ambitious lobbyist in Miss Sloan. She makes my analytical, occasionally arrogant heroine look like a cuddle-bunny.\tJessica Chastain gives a galvanizing performance, all pale face and wide staring eyes, angles and porcelain. She could be the supercilious Dr. Strange’s twin. Yes, she is shrill. She’s supposed to be. The New York Post states in their one-star slam:“Heavy-handed message movies don’t come more harrumphing than “Miss Sloane,” a clunky dramatization of the gun-control argument liberals still don’t understand is being conducted solely among themselves.”\tThe reviewer is missing the point completely. What the film maker is asking us, the audience, is whether we will accept lobbyist Miss Sloane as a heroine, whether we can pardon her manipulativeness and desire to win at all costs, given that the outcome is exposal of corruption. Just watching her, as she shames members of her team that don’t measure up, and uses a vulnerable woman to whip up public sentiment against the gun lobby, is an experience that is acutely uncomfortable. We understand that she avoids all intimacy, and that every encounter is reduced to a transactional experience. I actually admire director John Madden for resisting the temptation to reveal a back-story that will make us empathize with her. We know she had to lie all through her childhood, but that’s all. He keeps us, as well as the fictional characters who come into contact with Miss Sloane, in the dark about the anguish that makes her so focussed on winning, so brilliant but unbearable.Without divulging all the twists and turns, like she says, she holds the trump card. Her triumph is also her undoing. Like the scorpion, she stings so hard, that it seems she poisons herself.Or is she looking for release? Enigmatic and compelling, admirable and distasteful, Miss Sloane is at once broken and magnificent."}, {"rating": "7", "text": "If you haven’t figured it out already, The Newsroom, the cancelled and highly underwetched, underrated, and heavily missed HBO Dramatic series from the ingenious Aaron Sorkin is absolutely one of my all-time favourite television shows ever created. Given the quip dialogue, snappy political, social and cultural references, not to miss, its absolutely miraculous comedic timing and concurrent content, it is not only one of the best shows to ever premiere on television, but also a necessary viewing. Now if you’re thinking, why in the heck am I mentioning a television show that has nothing to do with the current movie in review, the answer is…everything!Miss Sloane may have been made by any of the talent who brought to life The Newsroom, but add the inclusion of two of the major actors in the show, plus a very apparent and suspicious comparison in delivery of dialogue, and mix all that with one of the best satirical and comedic lobbyist films in Thank You for Smoking, Miss Sloane is a lobbyist film that falls short in over two hours of misconstrued, flashy, politically polished and governmentally red-taped dialogue that not only keeps audience members at bay for the majority of the conversations between characters, but really only keeps the hopes for viewers that the final scenes and pivotal and totally expecting twists by the films end, are so worth this long-gestated and over-winded drama.The story is simple; Elizabeth Sloane (Jessica Chastain) is the most sought after and ambitious lobbyist in D.C. Set against a world of high-stakes power-brokers, government officials and corrupt businessmen, Miss Sloane is up against her toughest opponent when she’s pitted against the heavily armed and lucratively funded arms industry of the United States of America. Leaving her own firm to join forces with a once formidable opponent Rodolfo Schmidt (Mark Strong), Miss Sloane must learn to trust people and others if she wishes to win one of the biggest cases of her life, which is something she is completely unfamiliar with. Upon learning of Miss Sloane’s departure from her current firm, Sloane is surprised in finding that not all alliances are what they seem to be, including her right-hand ally Jane Molloy (Alison Pill), who abandons Sloane and partners up with her opposition. Left with a handful of strangers and new faces, Sloane must learn to work with others or suffer the consequences of taking on too much and inevitably finding her demise to the all-too-powerful United States government and its ties to the very powerful corrupt arms organization.While many films this year have the gracious feeling of being heavily scripted and quite theatrical, Fences and Una for example, the overtly scripted Miss Sloane has its characters reciting lines throughout the film rather than delivering them, especially since the film relies heavily on courtroom jargon that mostly takes the audience away from the story. With the exception of Jessica Chastain, who seems to relish in the highly convoluted word-play of screenwriter Jonathan Perera’s debut script, Chastain elevates to a singular level of performance and acting in Miss Sloane. It is safe and easy to say that Chastain is the singular character who carries her dialogue, the narrative and flow of the film effortlessly, while each and every actor in the film seems to be playing catch-up.While Miss Sloane can easily be judged as a political thriller, the thrilling aspects in the film rely heavily on action/reaction shots of the highly unexpected revelations of its supporting characters. Foresight and overshadowing certain, very touchy, issues dealing with sexual abuse, violence and emotional tragedy, seems to keep Miss Sloane afloat for the majority of its runtime, although, the high anticipation of the verbal sword fighting between characters acts more like cinematic action pieces than narrative adrenaline, something The Newsroom does without trying.As the stress along with the cat-and-mouse games between Sloane and her adversaries unfolds, many questions arise, that are rarely answered, which is frustrating for a viewer. More than anything, one of the most aggravating aspects of Miss Sloane is a lack of empathy or history behind the protagonist’s main ambitions. Sloane, a woman who shares nothing with her peers and amongst her employees, shares a very routine life that sees her eating at the same restaurant each and every night, while her main emotional connection/release is burdened to a very inquisitive and highly curious male escort named Forde (Jake Lacy). The interactions between Forde and Sloane are amongst the best in the film, easily giving audiences a mild understanding of Sloane’s psyche, even when audiences question whether or not a high-stakes lobbyist would actually share such delicate and classified information with, essentially, a high end male prostitute."}, {"rating": "7", "text": "Meet Elizabeth Sloane (Jessica Chastain). A lobbyist is a person paid to convince members of congress, via whatever means necessary as long as it is legal (or not), to vote for a specific issue or cause. This is what Elizabeth does. Working 16 hour days, taking uppers to stay awake, and downers to go to sleep, Miss Sloane approaches her work as a surgeon would approach an operation. She is precise, detailed, intricate, and armed to the teeth with knowledge. However, this is only in her mind. To others, she appears to be a drunk driver weaving between lanes going 75 MPH in a 25 MPH zone. Yet, every move is calculated. When she gets offered a chance to promote anti-gun legislation, it is an offer she cannot refuse as it an issue she actually cares about. As such, everything is on the table to win, even her career.In a powerhouse performance, Jessica Chastain stars as this DC lobbyist that is capable of swaying public opinion with the flick of her wrist and making politicians jump when she says jump. Every misstep is merely a calculated move to distract the opposition and she is always prepared for how to react to any countermove by the enemy. It is as if this were a book she had read before and was merely going through the motions of re-reading it to re-live the moment. Having developed a penchant for playing these tough-minded female leads, Chastain lifts the film up and breathes life into what is a pretty typical political thriller. Without her bravura performance, this film would certainly struggle. Yet, her portrayal as a woman willing to be commit career suicide in order to actually experience a normal life having made a positive impact on the world, is a nuanced and precise performance. Though Elizabeth appears emotionless and calculated at all times, she is a deeply troubled woman. She has no idea where the line between good and bad is mostly prescribed to the philosophical belief that \"the ends justifies the means\". Yet, she is also deeply unhappy. It takes a truly brilliant performance to evoke this feeling without actually expressing it, yet her brutal antihero has just the right tinge of emotional vulnerability to make her sympathetic. She is seen as heartless and cruel, but in moments with prostitute Robert Ford (Jake Lacy), we see that she is not some black pit of emotion. In her private moments, she longs for a normal life and love, a world where she is not attacked for just being.In its plotting, Miss Sloane can play out a bit predictably, but is always captivating. With some whip smart lines in its back pocket, the gun control battle is always center stage with Miss Sloane and her colleagues fighting against her former employers in the battle. Always having some trick up her sleeve to pull off the impossible, the film is entertaining political thriller that can often feel like a mystery with how it keeps the viewer guessing as to what trick she will pull next. Is this moment intentional and part of the plan or did she get caught off-guard and was forced to react quickly? While no political thriller is ever truly original, Miss Sloane's blending of the genre with mystery and this superhero-esque character with nary a flaw in her career and operating weeks ahead of the competition, makes the film's plotting captivating and thoroughly engaging.Yet, this film is undoubtedly a character study. As much as it is about gun control, Miss Sloane - for nearly an hour and fifty minutes - refuses to grandstand. It is reserved and never loses sight of its central character. Cases are made for and against gun control and the audience roots for Miss Sloane and the gun control cause, purely because the film is written in such a way that she is the good guy. As an antihero, however, we see her flaws and her downsides and nearly wind up hoping she gets convicted by the Senate Ethics Committee because we have seen her willingly break the law, but cover her ass. Her brilliance is admirable, but entirely reprehensible with how it skirts around legislation. In essence, she is no better than a mercenary and fights for whoever pays her the most. Yet, gun control - for reasons unknown - speaks to her heart. Willing to work for whatever to make it a reality, this issue being the one that breaks her cold, black heart is a politically timely move in the present world we live in, but also one that speaks to her character's past. She denies having been touched by gun violence and does not reference it, but it is clear that there was something that made her realize that this was \"the\" issue for her. Something made it click in her mind that this was a cause she had to fight for, no matter what the NRA offered her in return for fighting for them. It is quite admirable and shows that she has a heart (regardless of your personal stance on gun control), as she cares deeply about some issue and its impact on everyday Americans. They are not just data points. They are means to an end."}, {"rating": "10", "text": "An absorbing and compelling film that explores the world of Washington lobbying with an exceptional performance by Chastain. Be ready to pay attention as the dialogue comes thick and fast, but your attention will be rewarded as this is one of the most captivating thriller's of the year. Don't listen to all the biased pro-gun negative reviews. Whether you're for or against gun control, you should judge the movie on its own terms."}, {"rating": "0", "text": "Another attempt by Hollywood to push their anti-second amendment agenda down the throats of the American public. In this story the gun owners are the bad guys while Miss Sloane is the \"white knight.\""}, {"rating": "10", "text": "A truly compelling and interesting film with excellent pacing and a really smart twist at the end. Jessica Chastain is a smart and deep character with clear flaws and strengths that gel together nicely. I loved the film immensely."}, {"rating": "0", "text": "I saw the film and then went out and bought a gun for everyone in my family afterwards. It'll be a good holiday season for my family members. Love live the Second Amendment."}, {"rating": "9", "text": "An excellent film that explores the cutthroat world of lobbyists, but smartly does not take sides on the hot-button issue they are lobbying over in this case (gun control). Jessica Chastain gives a magnificent and thoroughly believable performance as a ruthless woman who will do anything to win in the amoral world she works in and the political “rats” whom the competing lobbying firms work to win over. The films only fault was that it was a little too long and could have used some judicious editing."}, {"rating": "6", "text": "Jessica Chastain plays a shrewd DC lobbyist who takes on a major bill in a series of career changing moves. Her performance dominates almost every frame and it's often commanding. She also gets a bit too steely at times. If Aaron Sorkin had been the screenwriter (instead of first timer Jonathan Perera) his crisp way with words would have made the intricacies of the interactions and the continuous twists more compelling. The brusque style with which every dilemma is dispatched reminded me \"House of Cards,\" which I didn't love. As it stands, it's a slick looking (slightly too long) drama with a usually-compelling story and a harsh, but forceful performance by Chastain."}, {"rating": "8", "text": "Great movie! Fast paced, in depth and with great dialogue and acting. Much better than Chastain last movie \"Arrival\" wich was a snoozefest but some how got rated better. This is her acting at her best and possibly her best role to date. She really controlls the scenes and is not over shadowed by her more senior counterparts. Definitely worth your time and probably the one of the most underrated films of 2016."}, {"rating": "0", "text": "The left seems to have a tough time selling their big-government agenda to the free market.Whether it’s the recent Ghostbusters reboot or the collapse of the mainstream media, whenever Americans have a choice in funding something, they seems to avoid liberal projects.Which helps explain why the film “Miss Sloane” absolutely flopped on its opening weekend."}, {"rating": "4", "text": "This movie reminded me of Michael Clayton but never reaching that quality. Chastain's character so annoyed me that it almost ruined the movie for me. She was to cold, too robotic, too scripted, too many plot twists a head that it became unbelievable. Some of the twists did catch you of guard but the story was nothing new. They left the entire film on Chastain's character and your view of that greatly determines your opinion of the film."}, {"rating": "5", "text": "I found the movie very boring and there's a good reason why this NRA-propaganda political movie just nearly bombed for good. First, I love Jessica Chastain's performance as Miss Elizabeth Sloane, a cocky yet informative lobbyist who is looking to find a equality firm and sought out to pass a bill to protect the innocent from buying any guns and firearms until she joins an unlikely group of government backers starts to ruin her moment by accusing her of fraud and purgery. Second, this film wanted supporters to vote for Hillary Clinton as the very first female US President, until it was all taken away by (I'm not going there). Third, there were a few problems with this movie. It tries so much to be a no nonsense thriller, but I felt that Sloane is more or less than a cookie-cuttered version of \"The Adjustment Bureau\" (Wasn't even that bad, but decent political thriller). And I even spend time to shell over 90 minutes where Chastain likes to get all tomboy-ish, instead it was all \"Run For Your Life\" and hide your secrets thing. As for Dave Madden, the guy who gave \"Shakespeare In Love\" to Oscar gold in 1998, I think he did a great job directing this movie. Unlike the shallow writing and overblown setting, Miss Sloane is very generic and Jessica Chainstain showcasing why she did deserve an Oscar nod in \"Zero Dark Thirty\" (One of the most important movies of all time). I give her credit. But Miss Sloane is far from great. Unlike Snowden, Miss Sloane is one of my disappointing movies of 2016. But I sure hope Chastain's a big lucky wild card for the Oscar nominations next year. A Best Supporting Actress Award should be great for her."}, {"rating": "6", "text": "Miss Sloane is the movie made for Jessica Chastain to shine. The story is hard to follow because we are immersed in the little-known world of lobbyist, for that the plot turns out to be original. Basically what it’s portrayed here is the female character from the 20th century, strong, independent women that get the job done and are much more capable than many men. However Miss Sloane takes these to the edge in a very interesting way, the combination of attributes in the protagonist reveals the true nature of rising concept: the contemporary femme fatale. In this person the attraction is not the only weapon, instead she uses wit as proactive measure and reading and authenticating people as deceive measure. Not blinded by that, we also get an insight to Sloane’s inner self and how all said before is a much-needed shield. The situation is that within the plot you are always waiting for something but cannot understand what, making this picture insanely dependent of its outcome. Jessica Chastain is marvelous here giving out a rollercoaster of emotions."}, {"rating": "8", "text": "I may not agree with the politics of the film (of which it wears pretty blatantly on its sleeve), but as a fanboy of Aaron Sorkin I enjoyed its attempts at copying his rapid-fire insult dialogue."}, {"rating": "8", "text": "A mastress stroke!Another American politics, why should I care! If you are saying like that, then you are missing out something wonderful. First of all it was not based on any real, except the gun control theme that rocked the US recently. Nor it was adapted from a book. That's really got me. This was a beautiful screenplay and I could not think how flawlessly someone has written just for a film, not for a book. Secondly, in todays world where the voices were raised for the equal rights/opportunity for women, this film became a great example to head on the right path.It opened with a court scene, then went back to flashback to reveal everything that happened in between period. There's a voting is to take place in the parliament for the introduction of a new bill. The miss Sloane's firm splits over differences and hence two teams fight for one another in the same matter, but to achieve the opposite result. Pursuing the MPs and all other dramatic events takes place, while they are ready to go any length. Then the story comes to an end with a twist with one of them victorious, but a heavy price has to pay it.You might won't like the politics, but this is not one. This is something like the story of an election campaign team. How they work to achieve their goal, particularly keep checking their rivalry. So it was more or less a cat-mouse game kind, but the perspective was not shared equally. The majority of the film was from miss Sloane's angle. Just like from 'Zero Dark Thirty', Chastain has been simply awesome. One of her career best performance for sure. I don't get it how this film had missed the Oscars race. She should have won the best actress award. I might a little late to watch, but I did not miss it. So I hope you too as well not to miss it.8/10"}, {"rating": "8", "text": "It would appear that girls do indeed run the world, and this brilliant drama provides an utterly compelling and tightly paced exploration of one Miss Sloane, magnificently portrayed by Jessica Chastain, a lobbyist and enigma who takes on the NRA. The complex storyline weaves amongst the intricacies of Washington insiders and dealings, providing an unsettling critique of how business gets done in the US capitol. The script is fast and dialogue takes on a Sorkinesque quality, whilst the score and editing keep the audience guessing right up to the tantalising climax. A film well worth your time. 8.87/10"}, {"rating": "7", "text": "So sometimes you take a risk and yoiu are rewarded. Sometimes, the algorithms get it right.  Sometimes I take a look at what Netflix is recommending, and sometimes they label something a hidden gem. Because I am a person of very eclectic and varying tastes, Netflix's (and other companies') algorithms tend to not get it right more often than they get it right. It's a coin flip. Today, Netflix won the coin flip, as I took it's hidden gem suggestion to watch the 2014 film \"Miss Sloane.\"  Jessica Chastain delivers a stunning performance in this indictment of lobbying and our political system. Director John Madden has utilized Chastain and the remainder of this talented cast to best effect, delivering a tightly-wound thriller combined with a well-managed potshot at K-Street and Washington politics.  Chastain is the perfect anti-hero, but such is her magnetic performance that you find yourself rooting for the anti-hero.  It's almost a spoiler to say that there's a small payback for that. Extra bonus you get Sam Waterston, John Lithgow, and even Christine Branaski. Mark Strand, Gugu M'batha-Raw, and Jake Lacy create compelling characters that hurther the plot. Yes, you might find it a bit obvious, and it certainly tackles and easy target, but it does it well. It's two hours well spent, and yes, it is entertaining (asumming my readers know by that I don't mean amusing.) Go and give it a shot. You might be glad you did."}, {"rating": "3", "text": "Le film a le mérite de dresser un portrait peu amène des pratiques du lobbying, très prisées aux Etats-Unis et notamment de celui des trafiquants d'armes euh je veux dire des vendeurs d'armes à feu et des défenseurs du Second Amendement, le droit inaliénable de pouvoir flinguer quand tu veux, où tu veux.On y suit une super biznesse woman et working girl de compétition (Jessica Chastain au top) prête à tout pour faire voter une loi interdisant le port d'armes aux criminels déjà condamnés, quitte à mordre un peu la ligne jaune, car la profession de foi ici, c'est le cynisme d'une partie d'échecs avant tout, quelle que soit la \"cause\" qu'on promeut.Hélas, si on apprécie les louables intentions et la dénonciation qui va avec, la personnalité de Miss Sloane se révèle incohérente (bien qu'elle plaira aux féministes, c'est un fait) dans ses allers et retours entre une \"fin qui justifie les moyens\" et ses atermoiements très naïfs à la Caliméro (une Machiavel -Machiavelle donc- qui nous sort un discours sur la morale, on aura tout entendu...). En outre, le film tente de tirer maladroitement sur la corde sensible et ça se voit un peu trop, en plus de s'étirer en longueurs. La super miss apparaît par ailleurs comme une super héroïne qui a tout prévu : il faudrait l'embaucher dans l'équipe de Mission Impossible ! Le bilan est donc assez mauvais finalement même si la curiosité nous a fait tenir sans piquer du nez jusqu'au bout, de par son sujet éminemment polémique et politique."}, {"rating": "2", "text": "This movie is dead on arrival. Muddled, overlong, overwritten and without an atom of humor. The first-time screenwriter is young enough to feel pointless zipping back and forth in time is clever, when it actually dissipates whatever dramatic effectiveness the story might have had.  The filmmakers obviously believe they have something important to say about government and gun control. They are mistaken and we pay the price for their mistake for well over two dull hours.Chastain, a truly remarkable and versatile actress, has never played such a thin, one-dimensional role. She must have chosen the script because she also felt it had important things to say about gun control. Or perhaps it appealed to her as a total star vehicle, with Chastain appearing in -- and dominating -- nearly every scene. It's the kind of naricisstic, sanctimonious part Barbra Streisand would sell one of her houses to play.The clunky dialogue and awkward speechifying goes on and on and on, finally ending with a \"twist\" that makes the audience yawn and say so what.Jessica, please do your political preaching on your own time.  Don't waste your talent and our time on bungled \"message movies\" like this one."}, {"rating": "7", "text": "I enjoyed this film in terms of seeing a determined lady do her best to 'take on the system' - yes its corny but I do like a decent film about an ambitious woman and I think its fair to say that in the political hub that is Washington DC, women aren't necessarily especially appreciated, or noticed, in terms of their political opinions, at least I assume not. This is definitely an example of a film whereby the lead female character is not afraid to punch seemingly above her weight and I appreciated that.The story itself may be regarded as a little bland but I felt Jessica Chastain did well in playing someone not prepared to not be heard, who pushes to have herself heard and respected - of taking on the system, much like Marcia Clark in the first series of An American Crime Story. I also liked John Lithgows performane as Senator Ronald Sperling, who critiques Madeline Sloanes arguments.I suppose you could argue that this is a typical American underdog type story - not just is it about a female taking on the huge gun industry, taking on a system that has so much financial backing that you can't fail to fear her chances of winning must be very slim but also of course there's the general moral issue of the industry itself, with gun control having been especially scrutinised, or, should I say the very lack of it present in the US these days. The themes are certainly important and respectable but I think there is an element of burnout in people at the moment, as far as watching political issues on TV and in the media is concerned. In any case, while it is perhaps a little bland and perhaps somewhat predictable, overall I'd say its a quite decent film with good performances and as such its worth a watch.Would I recommend it? if the story or/and cast appeal to you then I'd say yes, I recommend it, as its an at times emotional and certainly thought provoking watch, although some may feel it to be a bit PC, so it won't necessarily appeal to all."}, {"rating": "9", "text": "Jessica Chastain kills this role. Overall the cast was very good and the movie did a great job in making something of this nature seem absolutely thrilling."}], "recommendations": ["the_card_counter", "bombshell", "patriots_day", "snowden", "dark_waters", "judas_and_the_black_messiah", "richard_jewell", "just_mercy", "philadelphia", "the_mauritanian", "nightcrawler", "the_guilty", "spotlight", "the_good_shepherd", "the_imitation_game", "official_secrets", "beirut", "blackkklansman", "closed_circuit", "the_reader", "allied", "the_last_duel", "hidden_figures", "the_danish_girl", "the_post"]}