{"id": 2765, "title": "Mission: Impossible", "starring": ["Tom Cruise", "Jon Voight"], "runtime": 110, "genre": ["Adventure", "Action", "Thriller"], "description": "When Ethan Hunt, the leader of a crack espionage team whose perilous operation has gone awry with no explanation, discovers that a mole has penetrated the CIA, he's surprised to learn that he's the No. 1 suspect. To clear his name, Hunt now must ferret out the real double agent and, in the process, even the score.", "releaseYear": "1996", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/l5uxY5m5OInWpcExIpKG6AR3rgL.jpg", "categories": {"plot": 7.066666666666666, "acting": 7.037037037037037, "ending": 6.642857142857143, "soundtrack": 7.666666666666667, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 7.0, "action": 7.0}, "reviews": [{"rating": "7", "text": "Brian De Palma's action blockbuster \"Mission Impossible\" succeeds the impossible job most action movies do; seducing the audience without fear."}, {"rating": "10", "text": "t's been a long time coming. It's April 18th 2006. It's been ten years since this film was released and its second sequel is less than a month away. Now seems like the perfect time to reach back into the wells of my cinematic career and re-examine one of the single most important movies in my life. This is one of the movies that made me fall in love with movies. It made me appreciate the meaning of a good plot, the importance of cerating tension, the methods with which one creates suspense...and how to flawlessly set up, construct, and execute an explosive finalé so effective that you could've swore it gave you an errection. [***SPOILERS***] The movie opens with the simplest of shots: a camera slowly tracking in on a security monitor with an unknown guy hunched keenly over it watching two equally unidentified figures talking in a room. All we know is that we are in Prague. But our ignorance soon turns to astonishment as the layers of this lie - courtesy of fictional(? ) CIA special branch, IMF (Impossible Missions Force) - are stripped away and the truth is revealed. This one opening scene effectively establishes the style for the rest of the film; confused ignorance followed by shocking revelations. DePalma crafts an extraordingary plot of intrigue and betrayal and, of course, impossible missions whose tasks include a pursuit on the roof of a high-speed train and infiltrating the Central Intelligence Agency. But as well-conceived as the plot may be, the cinematography is equally commendable. With a range of shots being able to take the viewer from a sense of extreme panic and disorientation all the way to the most in-your-face shots that allow the action and story to carry the film on their own merits. I've seen other highly commended DePalma works, including 'Scarface' and 'The Untouchables', and whilst the former is exceptional in its style and excecution the latter is miserably out-of-synch with its own content. Even against 'Scarface', 'Mission: Impossible' more than holds its own. In fact, if there is one thing that 'Mission: Impossible' has over 'Scarface', it's the presence of a much more satisfying conclusion and a much more streamlined story. Heck, even the visuals give the reverred 'Scarface' a run for its money. I must have been about twelve or thirteen when I first saw this film, and it's as affecting today as it was all those years ago. Unfortunately, I'm not a member of the 'Star Wars' generation. Nor is my childhood filled with images from 'Star Wars'. My childhood was defined by movies like 'The Neverending Story' and 'The Land Before Time'. 'Mission: Impossible' was one of the first mature films I'd actually seen. It certainly left quite an impact on me...if only for the fact that I resolved I would one day understand the plot completely. Which, you'll be pleased to know, I now do :-D"}, {"rating": "10", "text": "This is the best mission impossible film due to its originality and flair. Remember this film was made in 1996, 10 years ago yet it is still very captivating today."}, {"rating": "8", "text": "Okay, giving Mission: Impossible a 6 is too strong for me. Besides, who couldn't love this film? Those mixed people do not count, and I'll repeat again, those mixed people do not count... unless it's a 4."}, {"rating": "6", "text": "I didn't enjoy it. They didn't have enough action as I expected. The story had plot holes and was hard to follow. I sadly expected more, but the rest of the series isn't great either."}, {"rating": "6", "text": "Many will be surprised that I am reviewing this film, especially twenty years after it was released, but it was Directed by the legendary, Brian De Palma, making it a must see for me. In general, I find these huge franchise films to be fun, some are better than others, but that's usually based on the writing and the cast. In watching the first of the Mission: Impossible films, my expectations were very high, and while Tom Cruise didn't disappoint, Brian De Palma certainly did. The king of mystery could have developed a better story than this. The action sequences were impressive and the special effects were way over the top, but I still felt the story could have been developed a lot more. Maybe being the first film in an eventual franchise, producers wanted to give the series as much action and explosions as possible. If that was the case, they should have called Michael Bay, this film has all the makings of one of his films, not a De Palma film. That being said, the bottom line is that first mission is exactly what you'd expect it to be. Student replacing teacher, in a film that's one chase and fire fight after another. It was entertaining, but not something that requires a whole lot of thinking."}, {"rating": "9", "text": "Mission Impossible (the first) is one of the best in the series, and does justice to the old TV show. All of the familiar elements to the show are there, from gadgets to Cruise saying \"Mission accomplished!\"."}, {"rating": "4", "text": "Even though it's full of great scenes, but the movie failed to make great impressions for everyone. It's not a bad movie. It's like a normal movie but popular because of the later movies."}, {"rating": "3", "text": "The plot is shallow yet hard to follow, there's no action at all and the only good part is very bland and could not be directed any worse. No editing took place at all to capture the intense moment. If the actual \"Mission Impossible\" part lasted half an hour with solid direction and editing it could have been great."}, {"rating": "2", "text": "The movie was exciting and suspenseful, but needed a better adventure."}, {"rating": "9", "text": "While the plot doesn't make complete sense until the very end of the movie, but that's just a minor nuisance from a thrilling spy movie."}, {"rating": "6", "text": "Pretty ridiculous though still enjoyable and Cruise is good. But mostly silliness."}, {"rating": "8", "text": "The first one is a blast of a movie, a bit too complicated in many parts, and too cynical for its own good (hey..that's what you get for hiring Brian De Palma), but it contains some of the best set pieces in the series, including the CIA break in sequence. What a great set piece."}, {"rating": "6", "text": "I found the story's lack of tension to be boring amongst entertaining adventures without enough thrills and suspense along with underrated action sequences. Not that impressive, but it was OK."}, {"rating": "6", "text": "For a summer blockbuster, Mission: Impossible is pretty good, but at the end of the day, an implausible plot with implausible action scenes wind up hurting a well acted film. Overall, it is enjoyable, however."}, {"rating": "6", "text": "I'd like to go on a bit of a tangent: A lot of people think that the first Superman movie is boring, slow-paced, and uninteresting. While I agree that it has a slow pace, I still think it is a very entertaining movie. The reason I bring this up is because those thoughts people have against the first Superman movie are pretty much the same thoughts I have on the first \"Mission: Impossible\".\r It's not a terrible movie, it's just a terribly uninteresting movie. Maybe because its sequels(mainly M:I-III & Ghost Protocol) are much more amusing to watch. Tom Cruise's stunt work is always great to watch, but it's surrounded by a bunch of boring scenes and a very predictable plot. there are scenes I love, like the white room break in, and even the convoluted/preposterous Helicopter chase at the end, but I always end up losing interest after the first 40 minutes.\r The cinematography and theme song are both fantastic, but they're not enough for me to recommend this movie. I'd say skip to the sequels... or at least M:I-III..."}, {"rating": "6", "text": "Mission: Impossible is an exciting spy thriller.\rWith a solid plot and believable characters Mission: Impossible succeeds to entertain the average action lover."}, {"rating": "6", "text": "\"Mission: Impossible\" is an above-average classic with enough spectacle and a likable performance from Tom Cruise to overcome its occasionally convoluted script and disappointing final act."}, {"rating": "1", "text": "This is a great retcon or reboot and probably an 8-9/10. What I cant forgive however is destroying Jim Phelps. He is the hero of Mission Impossible and a legend. He stopped countless villains and saved so many lives. He deserved better. Small spoilers: For those who only known the movies. Mission Impossible was a TV series from 1966-1973 with a revival in 1988/89. Jim Phelps played by Peter Graves is (except the first season) the leader of the team. He is not only a true leader but also a role model for the gentleman good guy. He would rather die than betray his team and organization. For comparison: Think that James Bond is the villain in the next movie with no twist and nonsensical explanation. Then he gets stopped by a new guy that you have never heard of. Ability wise Jim Phelps could easily win. He is a legend and has the ranks to destroy them from within but this is fundamentally against his character. This is the reason for my rating. Without this it is an enjoyable movie with great stunts, memorable scenes and good actors. I also praise the special effects, sets and the memorable soundtrack. Especially the Mission Impossible theme is a timeless classic that I have heard so often but it never gets boring. Like I said in the beginning they could even be better and I still would give a low rating. Overall this is a great movie if you don't know the series. If you knew it it is a betrayal of a hero and beloved character. I often think or compare it with the South Park episode where George Lucas rapes Indiana Jones assisted by Steven Spielberg. A fitting analogy."}, {"rating": "6", "text": "As \"Mission: Impossible - Fallout\" has very good reviews but there is a week left for it to be released, because it is better not to see all the films of the franchise, or at least see the ones I've seen and see the ones I'm missing, see them in order and finally know about the entire franchise and prepare for the last, and what better to start with the first. This turned out to be a very good film with intrigue and action, although with a slow pace I enjoyed it a lot, and with this film, it marks a great initiation of one of the most important franchises of the action genre."}, {"rating": "6", "text": "WHAT I LIKED: The Mission: Impossible formula begins, and it's one that largely works. Get a super, over-complicated plot, then get Ethan and his team to crack the mission before the ticking clock stops. It's a pretty simple idea each time around, but it is a fun formula to watch thanks to some awesome action, crazy stunts, tense moments, and the occasional emotional beat.\rWHAT I DIDN'T LIKE: This formula has it's cons too. The plot is extremely over-complicated, to the point where it feels like a badly collected group of really great scenes.\rVERDICT: 'Mission: Impossible' begins - and it's pretty enjoyable, but nothing more than that."}, {"rating": "6", "text": "Mission: Impossible is a funny movie with some scenes very well staged, but the bizarre script, along with some lazy special effects and an unlikely final scene, create an interesting start to this movie saga."}, {"rating": "5", "text": "Honestly, really boring at times, barely any action, and acting average. The series after the first one is legendary."}, {"rating": "6", "text": "The infiltration in Prague, The break-in at the CIA headquarters, and the climax on the train.This movies has those three awesome sequences and some pretty boring stuff in between.This franchise is one of my favorites in the action genre and part of the reason is because (excluding the second one) each new entry is better than the last. So naturally, coming back to the first one made for very dated, but still fun experience.After the first three films, with Ghsot Protocol, they stopped experimenting, as they had finally found the perfect direction in which to take the rest of the franchise. Those three aforementioned sequences served as the basis for that direction.Usually, when an action franchise abandons their slower, more character driven moments for more spectacle and action set pieces, it is seen as a negative.With Mission: Impossible however, it was a wise desicion, because it became one of the most awesome action series, and I can't think of something more painful than watching Ethan Hunt surfing the 90's Internet for what feels like an eternity again."}, {"rating": "4", "text": "Es demasiado aburrida, casi no hay escenas de acción y carece de emoción. ¡¡¡Terrible!!!"}, {"rating": "8", "text": "I like MI-2 better, but this one certainly is more ambitious plot-wise. The safe-heist and bullet train sequences are keepers, but the other sequences aren't that good. THe plot kept me guessing. However, that complex plot ultimately backfires on itself at the end, failing to achieve it's highly ambitious goal, but you got so many satisfying thrills out of the plot that you can forgive it's somewhat implausible ending."}, {"rating": "7", "text": "A great movie, but such boring drama scenes did not surprise me and Tom Cruise could have done a lot more in this first action adventure movie. Brian De Palma brings a lot of suspense to this one."}, {"rating": "7", "text": "The heist in the middle is amazing and the updated score is great but that’s about it. Works better as a TV show as the film’s plot was drawn out, confusing, predictable, and not that interesting. Ethan Hunt was smart and well acted but I never cared for him or the characters much I just cared for the action which is fun except for the climax, which relies heavily on CGI. It’s a fun movie and a nice translation of a show to film but nothing spectacular. Prefer the focused storytelling of the show and lack of predictability but this was still fun. Fans of the show will be happy to see the film stay true to the spirit of the show brining back various trademarks of the show such as the tapes and the fact that it was able to be translated to a new medium and modernized is impressive. Worth a watch for the middle alone but outside of that not much to recommend."}, {"rating": "9", "text": "Actually a great movie  the best of the move reboot. The story is constantly building new surprises into the plotline, the acting is first-rate, the music score is perfect and the special effects are surprisingly good for the time. Glad I rewatched it, the movie hasn't suffered with time."}, {"rating": "7", "text": "The first of the \"Mission: Impossible\" series, starring Tom Cruise as IMF Agent Ethan Hunt. Brian De Palma (Scarface/The Untouchables) directed as well.When a mission in Prague goes wrong and most of his team killed, Impossible Mission Forces Agent Ethan Hunt realizes that he has been set up by a mole within IMF itself, and he must assemble a rogue crew to clear his name and find out who the traitor actually is.A very entertaining film, but can be a little confusing if you don't like to think while watching a movie. Plus, a very nice cast including Ving Rhames (awesome as always), Jon Voight, Jean Reno and Henry Czerny."}, {"rating": "8", "text": "In a time where a lot of classic TV shows were being given weak cinematic remakes (\"The Flintstones\", \"The Beverly Hillbillies\" etc.), Mission Impossible overcame this negative trend by bringing in Brian De Palma do his own take of the series. With the gadgets of a Bond movie, the pacing of a Hitchcockian thriller, and the stunt work of a great American action movie, De Palma was able to breath new life into a classic show and begun one of the most enduring film franchises in recent memory.\r It stars Tom Cruise as Ethan Hunt, a professional spy, who along with his team accept a mission to retrieve an important file and catch the enemy agent who is attempting to steal it. But things begin to go gravely wrong, with Ethan seemingly left as the lone survivor. After this Ethan is suspected of being a double agent and goes on the run from his own agency, setting out to find the real culprit using whatever methods necessary to clear his name.\r Rather than going the route of more recent spy flicks like \"Kingsman: The Secret Service\" that parodies the spy genre, \"Mission: Impossible\" does the exact opposite. Instead it indulges in all the clichés, with elaborate disguises, high tech gadgets, high octane explosions, double crosses, and many surprise twists. Although one problem with these twists is it's quite easy to poke holes in them, since they're often done with no foreshadowing and there's little logic behind the characters plans. But this never really matters, for this is a film that lives in the moment. These twists mostly exist to draw us further into the nail biting tension and succeed at doing so.\r In spite of De Palma arguably being best known for his iconic shootouts, such as the ending of \"Scarface\" or \"The Untouchables\" stair sequence, here our lead never fires a single gun. Instead of using standard action shoot ups or fist brawls, the film delivers tension with 3 unique action sequences: the opening infiltration of the ball room; the vault heist dangling from a wire on the ceiling in the middle of the film; and the final chase involving a helicopter following a high speed train into a tunnel.\r The ballroom sequence works as a brilliant introduction to this world of spies. We see the cool gadgets, their detailed plans and how similar to other great spies like Bond they keep a sharp wit whilst they do it. At the same time the scene remains unpredictable, with so many things going wrong that it's really uncertain of who will get out alive.\r Then comes the iconic vault heist where Hunt dangles from wires to steal data from a heavily secured vault. This scene has to stand as one of Palma's greatest contributions to cinema. It may take influence from other great heists like Jules Dassin's \"Riffi\", Palma still adds his own unique take on the concept. Largely by bringing so many great elements together in the scene with slow pacing, great stunt work from Cruise and the way that the scene juggles so many risks from the worker who could walk in at any moment to the sweat dripping from Hunt's head.\r Unfortunately the final sequence does not live up to the previous two. The basic concept is cool, with Cruise chasing the villains on top of a speeding train whilst a helicopter chases, but unfortunately it falls flat due to execution. Obviously with a scene like this CGI is a necessity, for actually having a helicopter following a train into a tunnel really would be impossible. But 90's effects just weren't ready to portray a sequence like this authentically. Also whilst the concept of a chase on a speeding train is great, adding in a helicopter just seems like overkill and draws attention to the scenes lack of realism in contrast to the previous tone of the film. Although even with this the chase is still entertaining on a basic level, but just fails to deliver the same tension of previous scenes.\r Besides this it's far from ruining the brilliance that preceded it, with Palma's brilliant execution mixed with the excitement of a great spy thriller allows \"Mission: Impossible\" to overcome all the usual expectations of a typical action movie, and is a heck of a lot of fun because of it."}, {"rating": "7", "text": "What you get from Mission: Impossible is spectacle. And that's all you should want from an action thriller. It doesn't offer you too much more in terms of drama or performance, but the plotting is tight, and the storytelling involving (and this is a real achievement considering the film went into production without a finished script). It's just entertainment at the end of the day, and Brian De Palma's stylish direction makes it a very high-end, polished example of entertainment at that. The set-pieces are extremely well handled (particularly the iconic scene where Ethan Hunt hangs from the ceiling of a high-security CIA vault) and Tom Cruise proves he is more than able to handle the stunt work. Cruise was also one of the main driving-forces behind the film's production, and he's clearly aware what audiences want from an action movie. When judging the cast's performances, there's no-one who particularly stands out - Tom Cruise is serviceable, and Jean Reno plays the same character he plays in every film, though Jon Voight has a decent attempt at reading the mediocre dialogue straight-faced, and at least Vanessa Redgrave appears to be having a lot of fun with her role. Yes, the screenplay is nothing special, the character development a bit lacking, and the cutting-edge-for-the-90s technology Ethan Hunt's team uses in their escapades looks laughably dated to a modern audience. Mission: Impossible is good fun to watch, and as long as you don't dwell on the little details, you can get a lot out of this glossy and engaging, yet undeniably silly thriller."}, {"rating": "8", "text": "A really entertaining action/thriller film from the great Brian De Palma. This is by far the best in the series and by the previews of Ghost Protocol it will probably remain the best."}, {"rating": "10", "text": "This one is a killer! I loved the action and scenario. Even though got some holes in story, it was a less than 2 hours adventure which i will probably never forget."}, {"rating": "10", "text": "Best action movie of the year! This movie is a great installment of the series. A great adrenaline rush!"}, {"rating": "10", "text": "Intriguing, Expertly told and crafted and a great Action performance by Tom Cruise. Also the cinematography is amazing how it suggest paranoia. Also the film is uniquely edited. This is a movie that shows that great direction can really enhance anything! The second best film of 1996 (after Fargo) and while this film was a hit I feel it is slight underrated. Amazing how the film, along with the action scenes don't feel dated at all."}, {"rating": "5", "text": "Despite some minor overacting and a fast-paced plot that doesn't allow much in terms of character development, Mission Impossible is still a decent action movie with a few quality set pieces that clearly indicate it can be bigger and better than what this movie was."}, {"rating": "9", "text": "I wasn't the fan of show, but I am fan of the movie series. It is fun mindless popcorn movie. I can watch anytime I wanted."}, {"rating": "8", "text": "Mission: Impossible is one of those staple 90s films with some of the most iconic action sequences ever in action movies. The ending did anger some fans of the original show but its fresh and original take was really something to be admired."}, {"rating": "7", "text": "Immer noch sehr sehenswerter Action-Film. Kann man sich auch heute noch gut anschauen."}, {"rating": "8", "text": "Watched this again in UHD, from my young teenage memory I recall the plot being quite convoluted and the action somewhat lacking - now mid thirties and this film blew me away by its cinematography and with the sheer ingenuity of its 90's action choreography. Great writing, and superb cast make this a fantastic start to the film series."}, {"rating": "10", "text": "As far as im concerned this movie changed the face of action movies for ever. WTF is wrong with these so called professional reviewers? and why is it that they differ so much from the general public. Idiots. This movie is legendary. Stab yourself with a shoe if you haven't already seen this movie."}, {"rating": "8", "text": "full of special effects, Brian DePalma's update of Mission: Impossible has a lot of sweeping spectacle, but the plot is sometimes convoluted\rmission impossible:8/10"}, {"rating": "9", "text": ".........................................................................................................................................................................not 10 for plot holes & too for little action"}, {"rating": "8", "text": "I thoroughly enjoyed this film. I do agree the plot is confusing and convoluted at times though, but Mission:Impossible is very well made, with stylish cinematography, well chosen locations and inventive lighting. Plus the stunts and special effects are absolutely fantastic. Another strong asset is the music, the main theme is hypnotic and memorable especially, plus Brian DePalma's direction is brilliant. The film does move along very briskly, the script is efficient and the acting is also very well done. Tom Cruise is an actor I don't really care for but he is good here, but Jon Voight, Emanuelle Beart, Ving Rhames and Jean Reno are even better than he is. There are some very memorable scenes especially the burglary of a guarded vault and the Channel Tunnel helicopter pursuit. Overall, very well made and entertaining, if you forget the plot and just let the effects, stunts and visuals blow you away you will not be disappointed. 8/10 Bethany Cox"}, {"rating": "7", "text": "Brian De Palma's action blockbuster \"Mission Impossible\" succeeds the impossible job most action movies do; seducing the audience without fear. Really worth watching!"}, {"rating": "8", "text": "The first episode of the saga is the most closer and respectful to 60s original series, especially for the early 30 minutes. The 110 minutes of footage almost don't fell due the action sequences (the entry at CIA headquarters, the helicopter in the tunnel). The efforts of U2 composer for duplicate the original score are appreciable."}, {"rating": "7", "text": "Je ne l'aime pas le petit Tommy et ses talonnettes, il est comme une grenouille qui bombe le torse et veut finir comme un boeuf mais il ne reste qu'un beauf. Il ne réussit pas cependant à plomber ce gros Triple A inspiré de la vieille série fatiguenaze d'un autre temps ; à cet sujet, je ne saurais me prononcer sur la fidélité du film à la série, car je n'ai jamais réussi à regarder un épisode en entier. Mais don't act.En tout cas, c'est Brian de Palma à la barre et cela se ressent -tout en bien- au visionnage : la réalisation est appliquée, élégante et bien léchée, ce qui donne à la grosse machine hollywoodienne un allant inattendu. Cela reste donc fluide malgré les circonvolutions ou plutôt errements d'un scénario dont la fin justifie les moyens et cette fin ne lésine sur rien pour nous balancer les fameux rebondissements...!A propos de fin, le délire avec le TGV est vraiment grotesque pour ne pas dire super débile mais là encore, il fallait je suppose \"en mettre plein la vue\"... ce vieux ringard de James Bond peut donc aller se rhabiller...Jon Voight est quant à lui un atout sérieux puisqu'il incarne Monsieur Phelps et en ce qui concerne nos deux frenchies (Manue -qui montre à grand-peine un demi téton- et Jeanjean) ils sont juste là comme invités faire-valoir. Le choix de Ving Rhames comme pirate informatique est très discutable voire carrément con : j'ai jamais vu un geek faire de la gonflette et en plus, il ne mange aucune pizza et n'est clairement pas doué. Toujours est-il que le film sait garder un rythme indéniablement trépidant du début à la fin, sans aucun temps mort, virevoltant entre espionnage à la Splinter Cell et cabrioles gadgétisées à la James Bond : un curieux mélange très improbable, sauvé par le grand Brian."}, {"rating": "7", "text": "A Good Action FlickDespite it's fairly conventional story, Mission Impossible has the insane stunts of Tom Cruise and some kick-ass action scenes."}, {"rating": "7", "text": "This first Mission Impossible movie is from the year of 1996 and directed by Brian de Palma.This is one of those espionage and betrayal stories in a secret department of missions. The main character Ethan Hunt have a team of secret agents that need to intercept and prove the theft of a arhive with the name of the secret agents and his pseudonym, otherwise they would be all killed if it comes to wrong hands, during this mission something goes wrong and the story starts getting more intense and curious.The thriller of espionage works a lot in the word itself \"thriller\", while some revelations are happening and you start realizing what is going on together with the character Ethan, some tough things being said while Ethan starts getting tense, the camera starts giving a close in the face of the character, accompanied with a Dutch camera wich worked perfectly well in the whole movie, not just that but also the sound that is used goes getting more creepily increased and that all working together with the character realizing the situation was a great combination of multiple elements in one sequence that i found admirable, how they could express what was happening in Ethan's head an also put the viewer right into it. The building of tension as the story unfolds it is a high point in this movie.The movie does have some heist aspects, where the leader gotta designate what each one will do, and that worked out very well in the movie, like each person that will work in the heist gotta do one specific thing, and they were able to show how important was each of the things in one of the missions, in the other, not that much, somethings felt unnecessary, but overwall it was very functional. One of heist sequences was great, they, before anything, introduce the whole place, what they would have to do, how the security system worked and what could go wrong, introducing this before was perfect because when the action was happening you knew exact what could spoil the mission and how easy that was to happen. So the tension was primary because of that background, that worked out very well.The acting in this movie very functional. Tom Cruise is the big guy here, his character is confident and struggle a lot, Tom did a great job in moments of revealing his expressions were price less in some moments, he can be charismatic and deceitful, he did a great job. Emmanuelle Béart as Claire Phelps didn't convince much, she didn't had much expressions. Ving Rhames as Luther Stickell was another great casting and acting, he convinces in absolute everything that he do and also is a very fun guy, he delievered what he gotta. Jon Voight as Jim Phelps worked out, it is no big deal, but it was functional.The story is interesting, it got you engaged and cheering for Ethan, but there are somethings that really bothered me in that, there is some things that the character takes as absolute true that it comes out of nowhere, it is like someone told him in telepathy, it isn't like he is assuming it, he is guessing. The movie also have some conveniences that feels wrong, like the character would absolute sure about something that doesn't make that much of sense.The sequence at the end was good, the budget wesn't much large and they did a big sequence by it, that doesn't worked 100% but it was cool to see. There is one sequence at the end that didn't make sense, that one atacked other character instead of the other. And there is another thing that felt really wrong, that a situation that a character that came out of nowhere, comes out like magic. But even with that the narrative is interesting, it does have some nice plot twists, and it isn't bothered to explained everything to the viewer, wich is great, it does use a checkhov gun very well and it works.The soundtrack of the music is great and remarkable, composed by Danny Elfman. It is a little noir and have a old investigation climate, a spying atmosphere wich is perfect.The cinematography worked on the cameras, the moving camera that they used was beautiful, the Dutch angle that they used a lot was really beautiful in pretty much every moment, helped to contextualize what was going on, and it was very happy in showing more than one perspective, it showed everyone perspectives, wich was crucial.This movie is a lot of fun, one sequence that surely is unforgetable, a plot that is interesting but isn't the best, characters that are who they are because of the actors, zero deepening in them, a story that seggestion comes out of nowhere and come close to the surreal, but definely a fun espionage adventure with memorable moments."}], "recommendations": ["the_bourne_supremacy", "mission_impossible_ghost_protocol", "mission_impossible_rogue_nation", "mission_impossible_ii", "the_bourne_legacy", "the_bourne_ultimatum", "upgrade", "the_bourne_identity", "minority_report", "wrath_of_man", "the_commuter", "den_of_thieves", "unstoppable", "hunter_killer", "spectre", "quantum_of_solace", "survivor", "jason_bourne", "john_wick_chapter_3_parabellum", "sherlock_holmes_a_game_of_shadows", "the_equalizer_2", "creed_ii", "the_mechanic", "triple_frontier", "the_equalizer"]}