{
  "id": 2771,
  "title": "Mission: Impossible III",
  "starring": [
    "Tom Cruise",
    "Philip Seymour Hoffman"
  ],
  "runtime": 126,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "Retired from active duty to train new IMF agents, Ethan Hunt is called back into action to confront sadistic arms dealer, Owen Davian. Hunt must try to protect his girlfriend while working with his new team to complete the mission.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vKGYCpmQyV9uHybWDzXuII8Los5.jpg",
  "categories": {
    "plot": 5.769230769230769,
    "acting": 6.833333333333333,
    "ending": 6.222222222222222,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 7.25,
    "action": 7.366666666666666
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This film was incredible!!!! Everyone of the cast members is amazing! (Especially Tom and MICHELLE) J.J Well Done!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "By far one of the best action movies. Watch and Chill, don't expect oscar elements. Nothing but great entertainment value."
    },
    {
      "rating": "10",
      "text": "Probably the best action movie ever."
    },
    {
      "rating": "10",
      "text": "Not only is this movie just as good as the first two, but I would even say it was my favorite. With new concepts and a good story line, I thought this movie was excellent!"
    },
    {
      "rating": "6",
      "text": "J.J Abrams sorta made \"Mission Impossible 3\" with a ominous fuse of Brian De Palma's story and John Woo's action. The result? Manageable."
    },
    {
      "rating": "7",
      "text": "One of the best action adventure movies I have ever watched despite a good chill and thrill by the great director of J.J. Abrams. I also liked the great cast and of course a chilling plot."
    },
    {
      "rating": "3",
      "text": "A movie of utter garbage. Every scene was either taken from a better movie or too stupid to have ever have been in any other movie. Just a bunch of rerun nonsense."
    },
    {
      "rating": "5",
      "text": "It was predictable, the story was simple. To sum it up the action saved the movie of getting a 1."
    },
    {
      "rating": "5",
      "text": "Corny and cliche'-riddled, but with exhilirating action scenes. A 2-hr episode of 'Alias' on speed. Good supporting cast, but who can watch Tom Cruise any more without thinking of him jumping on Oprah's couch or spouting his criminally irrational Scientology philsophy... ? And the plot twist is as contrived as they come. There are better movies to rent, for sure."
    },
    {
      "rating": "10",
      "text": "This is, in my opinion, the best \"Mission Impossible\" film yet. Tom Cruise gives the character of Ethan Hunt a level of depth that I didn't find in the other two movies. I also enjoyed Ving Rhames as Arthur Stickell, Hunt's right-hand man. Philip Seymour Hoffman was a better bad guy than anyone in the last two films. My advice: If you haven't seen this, rent or buy it as soon as possible."
    },
    {
      "rating": "3",
      "text": "A 66?! This movie was reviewed better than Pirates 2? I guess that's why they released it at the beginning of the summer. Seriously, friends, maybe I'm blinded by Tom Cruise being crazy and all, but I purposely saw this in the dollar theater, expecting a cliche ridden, over-the-top, stupidly action-packed shooting-fest, and I definitely got my dollar's worth. But that's about it. Really, I do think I'm blinded by Cruise's newly insane-status, but I wasn't the only one who laughed in the theater when Billy Crudup's character asked him if he slept with his \"little sister\" (that Felicity chick, very under-used). Unfortunately, this movie seems to have been the movie-with-which-good-actors-pay-their-bills. Phillip Seymour Hoffman, Lawrence Fishburne, Billy Crudup, Jonathon Rhys-Myers...it's sad. Really. And I was half-way looking forward to seeing Hoffman playing the villian, like really being evil and enjoying it. But, alas, there is mostly him beating up Tom Cruise and very little conspiring with his minions. And the worst part? [***SPOILERS***] What did we all love about the first MI? It was corny and cheesy and no one tried to make it anything else--the plot twist was simple, the lines were drawn, and the hardest thing to follow in the movie was the heliocopter chase. In this one, however, they wanted to add Substance. So there's a cheesy, completely unnecessary scene between two supporting characters, and followed shortly by a completely nonsensical reveal of the \"Real Villain.\" And the cheesiest of all cheesy endings that doesn't deserve to be tacked on to an otherwise decent action trilogy. Why am I complaining so much? Because I can, and because I want to bring the median score of the audience reviews down. Please. Please come down. This movie is worth a good laugh in the dollar theater, but nothing else."
    },
    {
      "rating": "5",
      "text": "Mission Impossible III was a step in the right direction.\rAfter a very disappointing sequel to the spy series, MI3 recaptures some of the magic with a more \"down to earth\" Tom Cruise and a much more realistic basis."
    },
    {
      "rating": "7",
      "text": "J.J Abrams saved the Mission: Impossible franchise from going down the drain, but still as always, not as great as you wanted it to be, but still works."
    },
    {
      "rating": "7",
      "text": "Hey folks! Well I just got back from a lonely midnight show of Tom Cruise's MI:3. I got to say, I am a bit Dissapointed. Not That I was not Entertained. The First 3 Quarters Of the Movie Is what you would expect from a Mission Impossible Flick. [***SPOILERS***] Lots of Action, Haging On wires, Wearing the Villains Face as a mask. Tom Cruise Grinning Like an Idiot every 20 seconds.(I kidd) I was Hooked. The Bridge sequence was amazing. It is The last act where It lost me. The Villain's Demise was not what I was expecting it to be. It was a Tad weak. Don't get me wrong Seymore Hoffman was deliciously evil Through out the movie And to me a character that evil deserves a better kill off then what he got. There was no BIG finale!! Looking back at the First 2 movies(Second being my Favorite) They Got it right. The London terminus sequence on the first and the Bike Chase on the second. This one lacked that punch. And I am sorry. It was WEAK. And I do not think that Ethan Hunt should settle down. And though the action was top notch i would really love for this so called \"new\" directors to stop shaking the damn camera everytime there is action in the frame. i want to enjoy it. not get nosious. All in all it was entertaining, but it was not cinematic enough. it felt like i was watching a tv show. Hmmm...I wonder why? JJ Abrahams Needs to get rescued of that Damn deserted Island."
    },
    {
      "rating": "4",
      "text": "Great action and that's about it. The bad guy seemed like a pushover. Very confusing plot line. And I didn't get the answer to what was the \"rabbit's foot\"."
    },
    {
      "rating": "8",
      "text": "Only the ending sucked....you know if you've seen it. Other than that, just one crazy action scene after another. Way better than the 2nd one (it sucked! come on people! the car wreck scene was so GAY!)."
    },
    {
      "rating": "7",
      "text": "Its quite entertaining, but there's nothing I haven't seen before."
    },
    {
      "rating": "8",
      "text": "A great combination of the the first two movies' strengths. It felt like an extended version of the original television series. Great. If this is any indication of the summer to come, we are in good shape. JJ Abrams Trek venture is now highly anticipated for me. The bridge scene is riveting. Kong and the T-rexes riveting. Give Tom Cruise his props, not one of the three MIs has been a bomb. I feel justified in stating that these films are the closest equivalent to 007 we have. Moms, grandpops, and teenies likes MI. Fanboys stick to Bourne's mole-hunt upon mole-hunt contrived euro-sedan chase sequences. Don't get it twisted, I like those films, choppy editing and all, its just that they has strayed SO far from the brilliant source material. Which brings me full circle. IMF in Peter Graves' day was always about the hacker, the strongman, and the make-up artist. The fact that dude is crazy in real life adds to the believability that Ethan Hunt would do the insane base-jumping stunts in each movie. Oprah's coach was just conditioning. Props to VIC ARMSTRONG the second unit director AND stunt coordinator. He Indy being drug behind the nazi benz cargo truck in Raiders. Cruise and Abrams have managed to interject the Tom's personal life(engagement/googley eyes) into a blockbuster and it took NADA away from the characterization, plot, or tone of the film. Jason Strahams and Karl Urbans take note. This is how to do it. He didn't have me at hello... But MI:3 had me at the lip reading, the execution scene, and moonwalking up and down the Vatican walls. Let see Robert Langdon do that!"
    },
    {
      "rating": "6",
      "text": "It was entertaining... The story was ok... The ending was predictable... Another action movie."
    },
    {
      "rating": "6",
      "text": "Very watchable to the end. Overall alot better then I expected it to be."
    },
    {
      "rating": "4",
      "text": "This was an empthy action/drama movie but definately not a mission impossibble sequel, other than using the franchise name to sell. Plot is very predictible, and the details that make mi1 which was then somewhat gone on mi2 were completely gone on mi3. never mind the fact that Tom Cruise's bocome a really irritating actor."
    },
    {
      "rating": "5",
      "text": "This movie isn't worth the price of admission. You could get the same thrills and sappy drama from any Alias episode (especially the first two seasons). Cruise is boring, the plot predictable. Worst of all is the fact that they forgot to include even one of the elements that made the first MI movie so great!"
    },
    {
      "rating": "2",
      "text": "Not Enough Hoffman. Too much drama that no one really cares about. A honest to god end of a franchise."
    },
    {
      "rating": "8",
      "text": "Tom Cruise isn't a chameleon like Billy Bob Thornton, in which a superior acting ability can make an audience forget his controversial personal life. Ethan Hunt is, indeed, Tom Cruise, here in action star-mode, as opposed to his \"I'm a serious actor\"-mode, in which he says things like \"You complete me,\" and \"Respect the cock.\" When he wears shades(he's crying, yes, but it also could be construed as aloofness towards his Catholic surroundings) at a funeral where crosses are present, we're aware of his religious beliefs. An explosive device(read: potentially, a psychotropic drug) seems to kid his war against psychiatry. He also tells a colleague that his love is \"real\". What surprised me about \"MI3\" is that the official narrative is more fun than the subtext. It's a lot of fun. Keri Russell gives the early scenes a kick in a great casting-against-type performance."
    },
    {
      "rating": "6",
      "text": "Enjoyable but not necessarily a good movie. Lots of action but really no story to support it. Predictable."
    },
    {
      "rating": "8",
      "text": "I think people giving this movie a bad rating are just picky bastards to tell you the truth. You know -- those people, who have to be critical just to be, because they can't sit down and just enjoy a movie for what it is. And anyone ragging on this movie because of Tom Cruise needs to get a life. Who's worse - a scientologist, or a guy who pays more attention to somebody elses life than his own? Anyway, this is a straight up, pumped up action movie; but it has brains, and lotso drama. It's crazy, I was pretty blown away actually. My only quibble is that the dialogue could have been better in a few scenes. Other than that, I was pleasantly surprised. No, it's probably not better than MI:1 -- and anything is better than MI:2. Regardless, go see this movie."
    },
    {
      "rating": "8",
      "text": "Wasn't bad. Better than I expected. It should have been called The Alias Movie. Better than the second, but nowhere near as good as the original."
    },
    {
      "rating": "10",
      "text": "Over the top? Yes, that's why it's so good. Some one also told them to keep the backstabbing plots simple and the action coming. The first movie, way too complicated. Second, better. Third, the best, I think. It kicks butt, and Philip Seymour Hoffman as the bad guy? Very cool."
    },
    {
      "rating": "10",
      "text": "Woah....I mean WOOAAHH...that's a freaking action movie. J.J. Abrams just reinvented how to make one. I was not a fan of his work with Alias, and I found the pilot of Lost to be ok. So, I didn't have all that high of expectations going in, but man....scene after scene after scene of \"edge of your seat\"/penetrating/visionary action. Tom Cruise is at his best here, as is the entire cast. The accompanying score is phenomenal. Shout it from the rafters. J.J. ABRAMS is a freaking genius and Tom is a genius for getting him to do this movie!!!!!"
    },
    {
      "rating": "9",
      "text": "Excellent action, great pace, top performances."
    },
    {
      "rating": "3",
      "text": "The special effects were good but the overall movie was Busch League at best. Very predictable."
    },
    {
      "rating": "3",
      "text": "Even J.J. couldn't put Tommy together again."
    },
    {
      "rating": "9",
      "text": "I simply loved it! pure action and thrill during all the film, enjoyable and great!"
    },
    {
      "rating": "8",
      "text": "I had a hell of a lot of fun with this movie. In fact, there was not a stretch longer than about 2 minutes in the film in which I wasn't grabing my face, pulling my hair, or kicking the seat in front of me because of all the crazy/original sh*t going on on the screen. I came into this movie having somewhat liked the first two and not totally excited to see how Tom probably acts with Katie, but if you're like me, you'll drop that 'tude as soon as the first action sequence kicks into gear. I like \"Alias\" a lot, and this movie seemed like Alias on Steroids. Yes, the cream AND the clear. The storyline wasn't as convoluted as the first one was. Don't want to spoil any plot points. I'll just say that it was worth the $$ to make this thing, so just go see it."
    },
    {
      "rating": "9",
      "text": "Let's get one thing straight, right off the bat: this is not the incredible gem of a movie that was DePalma's 'Mission: Impossible', but it is also significantly...and I mean, significantly...better than John Woo's abysmal attempt at trying to mix oil and water (namely, his own style and the 'M:I' movie franchise) that the world must regretfully refer to as 'Mission: Impossible II'. Within ten seconds of the Paramount logo disappearing into the ether, you are hooked. Utterly hooked. The trademark pre-title sequence is intense and masterfully constructed, and is arguably the best piece of film in the entire movie. And what a place to put it. The plot itself lacks any real complexity, but what it lacks in overt intelligence it more than makes up for in how completely engaging and entertaining it actually is. The emotional beats are right on cue - although this can be called into question slightly in the closing minutes of the movie - and the action scenes are visceral, real and are actually incredibly scary for a PG-13 movie. There are plenty of thoroughly satisfying teamwork sequences that are highly satisfying to watch on a number of levels, and the film thrills, amuses and shocks for its entire duration. Not much can top a showdown between an IMF mentor and student on the top of a speeding bullet train, but Abrams does a damn good job at pitching the stakes of the finalé on a suitably 'impossible' level to mentioned respectfully after Hunt's suicidal Channel Tunnel dash in the first movie. In terms of acting: Cruise is at his superstar best, Hoffman is deliciously evil and wonderful as the entirely uncompassionate bad guy, Rhames is more implemented than ever before and exuding his usual sense of cool, and Simon Pegg delivers some very welcome humour to the movie. There are nods to previous Mission: Impossible movies, including the famed wire-drop from the first film when Hunt and company decide to...get this...infiltrate the Vatican (a scene that is accompanied by a charmingly amusing performance of Cruise going all Italian), and even a small homage to 'Top Gun'. Yes, this is a Tom Cruise film. But - as this movie goes to show - that's no bad thing by any stretch of the imagination. This thing is gripping, enthralling, and surprisingly taught for a movie that clocks in at just over two hours in length. For now, at least, the first movie remains unchallenged as the masterpiece of the franchise. It is the ultimate 'M:I' experience and is crafted with the mastery one would expect from a filmaker like DePalma; Abrams is still a novice by comparison. But, rest assured, 'Mission: Impossible III' is one mission you'll be more than happy to accept as a kick-ass Summer blockbuster that is thoroughly satisfying on every level."
    },
    {
      "rating": "9",
      "text": "The best of the series. It's everything you want it to be."
    },
    {
      "rating": "0",
      "text": "No. Bad, regardless of the amount of apologizing these other idiots are making for it. I had twelve bucks and now it's gone. Thanks, Tom."
    },
    {
      "rating": "9",
      "text": "This is a pure action/thriller movie with lots of 'edge of your seat' thrills. Tom Cruise shows that he still has that movie star 'magic', something that so few actors possess. That's a pretty amazing feat, considering the constant bullying and harassment he receives from the press. Go see this movie, if only to see a true movie star at his best! (The non-stop action and excitement doesn't hurt either)."
    },
    {
      "rating": "10",
      "text": "Explosions, stunts, and espionage....what more could you want?"
    },
    {
      "rating": "8",
      "text": "Well-made movie. Edge of seat stuff with great pacing, nice action sequences + a few laughs here and there. Just let down by the ending which was low-key (maybe i was expecting John Woo's MI:II ending which indeed was spectacular). And i thought Hoffman's Davian was one-dimensional.. i mean, yeah, i'm convinced that he's mean and stuff but not much characterization took place.. what made the guy he was, what's he motivation that kind of stuff, y'know. But hey, it's a pop-corn movie so didn't expect that anyways.."
    },
    {
      "rating": "9",
      "text": "Yes, yes, YES! This movie has everything that belongs in a good action movie, and nothing that doesn't. Go see it!"
    },
    {
      "rating": "1",
      "text": "The first mission impossible I can handle, the second one was okay. The thing that had it going for it was that it had that interesting mission's intersting stories. Reminicent of the recent borne series, the plot was sucessful in engagin the audience. Unfortunately, this one, I can't. The story is hiding somewhere, Cruise is his p*** annoying self (Please, get over yourself, thw whole world would love it if that hapenned) and quite frankly, the missions are boring. Who cares about tthe missions if all you see is explosions? If I wanted to see that, I wuoldn't have gone to the movies. The other parts of the cast are non-existent and I on'y know about you, but watching this, I wondered where the $140,000,000 went. The guy who made alieas and lost is at the helm, which explains alot. When you have a diretor who makes crap TV shows makes a movie, he is likely to make a crap one. Go see Cache instead, far better movie. I'm starting to worry about Hollywood. If this is what the come up with after hundreeds of millions and a star-studded cast, it's not looking good."
    },
    {
      "rating": "5",
      "text": "Were people really clamoring for a 3 mission impossible?? Well the series is getting very stale despite a new director. Abrahms just recyling he better tv shows. Actually all three diffrent mission directors all had better work than the mission movies. Which may be why they are all watchable an not necessarily \"bad\" movies just totally forgetable."
    },
    {
      "rating": "2",
      "text": "Very loud and very, very dumb. Perhaps it's my fault: I've been watching episodes of the old \"Mission Impossible,\" and I've become spoiled. See, the old MI offered, well, missions. Capers. Hell, it offered PLOTS. It let us get to know its villains in order that we could understand what fabulously dangerous people they were. It did not air the private lives of its heroes like so many wincingly embarrassing pairs of Underoos. Its female characters had brains growing between their pretty ears, and they knew how to use those brains. What this miserable, incomprehensible blob of a movie has is NOISE and BLUR. And TOM CRUISE, E-MO-TING. Two stars for the obligatory-- but glorious-- forty seconds in which Phillip Seymour Hoffman pounds the living snot out of Tom Cruise. The rest-- most especially the sickly, sticky-sweet tripe between Ethan Hunt and His Woman-- is trash. I understand now why they delayed getting \"Mission: Impossible Season One\" out on DVD; it would have made Mr. Cruise's latest ego exercise look even stupider than it already is. They even manage to butcher the theme music. Miserable."
    },
    {
      "rating": "2",
      "text": "Tiresome, this show is so out of date. the first scene was more than enough tom cruise. i didn't expect to like his perfromance but everything else was either painful the romance scenes or unoriginal. jj abrams completely mishandled the film. it was bond like a very bad timothy dalton bond movie."
    },
    {
      "rating": "8",
      "text": "This movie was pretty good there wasn't a lot of plot but it was very intense and I thought it was a pretty fun movie."
    },
    {
      "rating": "6",
      "text": "Not the best mission impossible movie for sure.The first movie was the best.It has some good moments and some lame moments.Sometimes it tries to be more serious and sometimes more action oriented.Its like a combination of the two previous movies and unfortunately it doesnt mix. The script is dissapionting and the action isnt very spectacular.The ending sucks and the overall experience isnt as you expeced from a movie like Mission Impossible.The first movie was serious the second was more action focused and this one seems kinda lost in between."
    },
    {
      "rating": "10",
      "text": "tom cruise must be the best actor who ever lived because he takes the impossible and makes it possible."
    },
    {
      "rating": "10",
      "text": "Great ending employer of Tom criuse realizes he was set up and gives him the accommodation he deserves."
    },
    {
      "rating": "8",
      "text": "Hugely entertaining - even if it has the world's most predictable plot twist. Oooo, I wonder who the REAL mole is?"
    }
  ],
  "recommendations": [
    "furious_7",
    "mechanic_resurrection",
    "the_expendables_3",
    "the_fate_of_the_furious",
    "angel_has_fallen",
    "salt",
    "xxx_return_of_xander_cage",
    "venom_let_there_be_carnage",
    "the_expendables",
    "iron_man_2",
    "jack_reacher",
    "the_expendables_2",
    "escape_plan",
    "the_transporter_refueled",
    "lockout",
    "transporter_3",
    "the_mechanic",
    "the_a_team",
    "bloodshot",
    "transporter_2",
    "the_marine",
    "transformers_dark_of_the_moon",
    "jason_bourne",
    "kingsman_the_golden_circle",
    "knight_and_day"
  ]
}