{"id": 3508, "title": "Miss Congeniality", "starring": ["Sandra Bullock", "Benjamin Bratt"], "runtime": 111, "genre": ["Comedy", "Crime", "Action"], "description": "When the local FBI office receives a letter from a terrorist known only as 'The Citizen', it's quickly determined that he's planning his next act at the Miss America beauty pageant. Because tough-as-nails Gracie Hart is the only female Agent at the office, she's chosen to go undercover as the contestant from New Jersey.", "releaseYear": "2000", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/pat3vKaRlB70he4ghwTMydR4TvP.jpg", "categories": {"plot": 6.0, "acting": 8.5, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.5, "action": 5.0}, "reviews": [{"rating": "2", "text": "It's never funny and never exciting; this awkward and outdated comedy is an uncomfortable ride to sit through."}, {"rating": "8", "text": "It's not very humorous, but it's stupid funny and full of fabulous entertainment and pleasure from a beauty pageant. Sandra Bullock does better than expected and plays a clumsy, but fantastic role to teach us a lesson about true beauty."}, {"rating": "7", "text": "People who didn't like this movie must have a difficult time enjoying themselves. Sure it was kind of stupid, but I actually enjoyed Sandra here. Quite funny and just an easy movie to watch for fun."}, {"rating": "7", "text": "Miss Congeniality is one of those movies geared towards girls but is not exactly a chick flick- guys can enjoy it too. Sandra Bullock puts on one of her most annoyingly funny performances to date, and fits it well."}, {"rating": "10", "text": "Why the critic reviews of this movie are so bad? Miss Congeniality is an awesome movie, one of my favourite comedies ever starred by my favourite actress :)"}, {"rating": "10", "text": "Sorry to the critics and other Users, I must have no taste.  Sandra Bullock fits the role in this movie like it was written specially for her.  She's funny in the before, during, and after makeover.  The movie itself is fluff but it's supposed to be a comedy, not Shakespeare.  I don't have many DVDs but this one is in my collection."}, {"rating": "6", "text": "Although the setup is interesting, clunky scripting reduces it to run-of-the-mill but passable entertainment. Still, Bullock's transformation and the eye-candy fo the beauty pagent can be impressive, even if the movie fails to impress as a whole."}, {"rating": "9", "text": "I thought this movie was excellent. Considering Sandra Bullock produced it (which she's never done before) I think it was very entertaining and enjoyable. I would recommend this movie to anyone and everyone!"}, {"rating": "6", "text": "the movie was ok. i found the plot and humour a bit too predictable but  i had an ok time watching it."}, {"rating": "9", "text": "I thought this movie was excellent. Considering Sandra Bullock produced it (which she's never done before) I think it was very entertaining and enjoyable. I would recommend this movie to anyone and everyone!"}, {"rating": "10", "text": "Miss Congeniality is genius in its fashionable concept and a humorous execution that makes up for its writing."}, {"rating": "7", "text": "----------------------------------7.4/10-----------------------------------"}], "recommendations": ["50_first_dates", "murder_mystery", "the_proposal", "get_smart", "zack_and_miri_make_a_porno", "meet_the_parents", "what_happens_in_vegas", "forgetting_sarah_marshall", "the_break_up", "the_longest_yard", "the_watch", "role_models", "friends_with_benefits", "just_go_with_it", "holidate", "vamps", "hubie_halloween", "the_wedding_ringer", "the_green_hornet", "blended", "horrible_bosses", "this_means_war", "yes_man", "johnny_english_reborn", "just_friends"]}