{"id": 1616, "title": "Miss March", "starring": ["Zach Cregger", "Trevor Moore"], "runtime": 89, "genre": ["Comedy", "Romance"], "description": "A young man awakens from a four-year coma to hear that his once virginal high-school sweetheart has since become a centerfold in one of the world's most famous men's magazines. He and his sex-crazed best friend decide to take a cross-country road trip in order to crash a party at the magazine's legendary mansion headquarters and win back the girl.", "releaseYear": "2009", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/cWjaFmJ2pjMcWeKh00PJ3zOBMOq.jpg", "categories": {"plot": 1.3333333333333333, "acting": 2.8823529411764706, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.472222222222222, "action": 7.0}, "reviews": [{"rating": "0", "text": "Worst movie I have ever seen. Could not watch till the end."}, {"rating": "0", "text": "A movie so funny, you don't actually laugh. Though it is somewhat funny to see Hugh Hefner's, vapid, withered, Mumrah-esque form trying to pull of one-liners with zero proficiency."}, {"rating": "0", "text": "Juvenile. And that probably is doing a disservice to juveniles. The most offensive part of this movie is the sexual taunting of a girl who is perhaps 12 or 13 years old. It"}, {"rating": "0", "text": "I'd walk out of this movie if I was watching it on an airplane."}, {"rating": "0", "text": "Heff must be so proud."}, {"rating": "0", "text": "This is the worst movie I have have seen in a theater. I saw a free test screening and I still feel ripped off. The acting was terrible, none of the characters were likable, the plot was completely unoriginal and predictable, and none of the jokes were very funny, unless you think gross things are inherently funny. The only bright side is that it is not that long, so watching it is will only waste an hour and a half of your life."}, {"rating": "0", "text": "To Kara C..... You don't see very many movies, do you? If this is what you consider to be a good film, I'd suggest you check out movies like Slumdog Millionaire or Milk. Then again, maybe you shouldn't 'cause neither of them stars Britney Spears or Mandy Moore. Now that you're finished reading this, go back to your coloring book."}, {"rating": "0", "text": "Absolutely awful. Trever's open-mouth WHOAAAAA in every situation really makes me want to punch him. Can't believe such a conventional piece of garbage came from WKUK people. Please just go stab yourself in the eyeball with something rusty to save yourself the greater pain of watching this movie."}, {"rating": "0", "text": "This movie was awful. I generally like dumb comedies, but this movie makes the dumbest of dumb comedies look like Citizen Kane. None of the jokes were very funny and the main actors more annoying then funny. Terrible, terrible film."}, {"rating": "0", "text": "Don't waste your time watching this one. Completely unfunny. Two thumbs down!"}, {"rating": "0", "text": "If this movie sucked any harder, It would be called \"Hugh Hefner's movie of terrible proportions\"."}, {"rating": "4", "text": "Not any better or worse than most of the sex comedies of this type. The humor is very crude, but there are a few very funny scenes. The two main stars do well enough. Too often in bad taste though."}, {"rating": "0", "text": "One of if not the worst movie I've ever seen. Whoever allowed this piece of shit movie to made should be banned from the movie industry for life. No laughs, other than the fact that it was hilarious how terrible it was. Horrible writing, horrible directing, and horrible acting. If you enjoyed watching this movie even the slightest bit, you must be borderline retarded. Do not waste your time or money on this embarrassment to society."}, {"rating": "0", "text": "This is the worst movie I have ever seen. It made be angry at society for allowing something like this to happen. Yes, it is that bad."}, {"rating": "10", "text": "Movie was fucking hilarious! It deserves a better score just from that one scene \"I stabbed her face!\". But seriously, movie critics are fucking stupid. They have no sense of humor without purpose. This isn't the movie you watch when you're 65 years old, alone in room, without any friends. You should watch this with friends that are at a young enough age to not take life too seriously and enjoy some of the crazy and unbelievable situations that take place."}, {"rating": "10", "text": "If you didn't laugh during this movie then you have no funny bone this movie is super funny."}, {"rating": "10", "text": "I liked this movie. Immature humor at its best. I watched it and I laughed a lot through out it."}, {"rating": "10", "text": "I'm giving miss march a ten just to raise up the average a little bit, this shit is f*cking harsh! This a sketch comedy movie, not a f*cking jarmusch art picture. It's written directed and starring guys who have only ever done sketch comedy, and the movie is just a bunch of sketches tied loosely together and it is f*cking funny godd*mn it. 10!"}, {"rating": "10", "text": "The show \"whitest kids u know\" is a sketch comedy show that the 2 main actors and a couple of other kids got together in college and were able to make it pretty far. i'd go as far as to say this is one of the top 3 funniest movies i've ever seen. that being said, its not for everyone. it is very dirty humor, but im 17 and thats the kind of thing me and my friends think is funny. if i could give it more than 10 i would but thats not an option."}, {"rating": "9", "text": "I thought this movie was hilarious. The acting from Cregger and Moore was perfect for the roles they are playing and the humor in this story was a bit offensive, but still hilarious. This is one of the best movies I've seen in a long time."}, {"rating": "6", "text": "What can I say, college humor usually gets to you."}, {"rating": "7", "text": "This was a good dirty comedy about a virgin and his retard brother who go on a wacky road trip. He stabs his girlfriend in the face with a fork so a bunch of firemen try to kill him. I'm glad to see firemen finally get shat on in a movie because I haven't really seen it happen before so that was great. Craig Robinson's scenes were perfectly placed in as soon as you started feeling the movie was getting stale. Two of the only negative things I can think to say about this movie are that for a dirty R movie the waiting time between boobage is pretty high and there is a part were they had to overdub crackhead in ADR and you can tell they were saying retard. The movie is already rated R so what gives? Anyway this movie has a lot of funny dick and poop jokes so if you find that funny watch it but if you care about plotholes, and lighting, and being all classy then this isn't for you."}, {"rating": "10", "text": "Miss March is a hilarious movie and I don't know why or how it has such low a low metascore. This movie deserves at least half of a watch through and if you don't like the beginning then don't bother with the second half. This movies not for everyone and the production is very low budget but the two actors are downright amazing. 10/10 to raise the user score to something closer than it is right now."}, {"rating": "10", "text": "Trevor Moore and Zach Cregger are hilarious. If you love the whitest kids you know then you'll love this movie, since it shares the same humor. I died laughing, during the movie. Funny!!"}, {"rating": "0", "text": "I am not rating this movie as low as I am for its crass humor, but rather for the fact that there was not a funny moment in the entire film.  If you must see a teen comedy, go watch American Pie again.  Its guaranteed to have more laughs, even if you've already seen it a thousand times."}, {"rating": "8", "text": "I rate them as I see them.  For all you high brow folk out there, you will find no humor in this at all.  For people who can laugh at disturbing and rude humor on any occasion, this is your movie.  It feels like an extremely raunchy sketch TV show, and should be treated as such.  It had a little too much with the poop jokes, but as a dirty, classless film it is hard to be beaten.  So to any of you who give this is a zero, live your high class.  I will be enjoying my no class."}, {"rating": "0", "text": "I enjoy the occasional dirty movie.  I laughed at the American Pie films, I enjoy movies like Road Trip and Old School.  I have seen some of the sketch comedy made by the guys who made this movie and some of it is legitimately hilarious.  That being said, this film was awful, top to bottom. The acting was terrible, none of the characters were likable, the plot was completely unoriginal and predictable, and none of the jokes were very funny. There isn't a single redeming moment in the entire film. Instead of watching this piece of crap go watch Superbad, Road Trip, Old School or any one of thousands of movies that have done this genre better."}, {"rating": "8", "text": "I was actually surprised at how funny this actually is, granted it's definitely vulgar, one or two scenes downright disgusting, and only for that specific audience that find male genital related jokes hilarious (from about 16 to early 20's), and sadly I'm one of those immature and inappropriate people and I've got to admit I did find myself laughing a lot, so if your in that immature category like myself then this is worth a rental."}, {"rating": "3", "text": "For a teen comedy, Miss March is not absolutely awful (see American Pie: Book of Love), yet it is hardly good either. There are some laughs to be had in certain instances, yet some of the scenes either fail to raise a smile, or are merely disgusting. One such scene shows a character who has no penis, just a straw to pee out of. There is no need to actually show this, and it made me feel physically ill. The acting is largely solid, although Tucker becomes irritating quite quickly. All in all, not a horrible film but not one that I would recommend."}, {"rating": "7", "text": "The acting is pretty far from convincing and the events are pretty unbelievable but the movie as some good moments and can keep some (not every) viewers entertained."}, {"rating": "0", "text": "There was a point in time when it seemed like every comedy wanted to copy the success of the popular American Pie franchise. The  time period managed to stretch all the way to 2009 with this disaster flick. One thing to note is that this film has a relatable main character and overall I think Craig Robinson was a bright spot in this movie; however, that is nothing compared to the generic characters and some of the worst writing I have ever seen. I honestly don't remember laughing once throughout the entire film. Just when you think it could not get more stupid, it does. The movie is gross and repulsive from beginning to end. Even though the lead is someone you can empathize with, there is no character development at all leaving a very drawn out and shallow cinematic experience. The acting is almost as bad as the writing (with the exception of Craig Robinson). The comedic deliveries are completely off as most of the acting is just stiff. This movie will make you want to take a shower after watching it, and trust me it is for the worst possible reasons you can imagine."}, {"rating": "7", "text": "To Howard - You sir are a fuking retard, the two movies u listed arent even the same genre. When you do **** like this , it just sounds like u watched 2 good movies ur entire life, becuz you've seen the rotten tomato ratings for it, and start bashing on every other movie. You know wat ? Milk is a horrible movie, u sire need to see star wars to understand wat is a real movie.\r Seriously, u cant take the people who rate this movie 10 and 0 too seriously becuz they are all trolls. they dont understand wat a movie that is rated 0 is like. for me , movie like food fight is a 0.  This movie has its laughter, horsedick was pretty funny and non of the actors are out of characters."}], "recommendations": ["the_hangover", "the_watch", "a_haunted_house", "movie_43", "deuce_bigalow_european_gigolo", "grown_ups", "grown_ups_2", "epic_movie", "meet_the_spartans", "hot_tub_time_machine", "norbit", "jackass_presents_bad_grandpa", "this_is_the_end", "one_year_one_night", "30_minutes_or_less", "the_dictator", "white_chicks", "the_wrong_missy", "not_another_teen_movie", "good_luck_chuck", "scary_movie_5", "dinner_for_schmucks", "dumb_and_dumber_to", "superbad", "couples_retreat"]}