{
  "id": 3135,
  "title": "Moana",
  "starring": [
    "Auli'i Cravalho",
    "Dwayne Johnson"
  ],
  "runtime": 107,
  "genre": [
    "Adventure",
    "Comedy",
    "Family",
    "Animation"
  ],
  "description": "In Ancient Polynesia, when a terrible curse incurred by Maui reaches an impetuous Chieftain's daughter's island, she answers the Ocean's call to seek out the demigod to set things right.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4JeejGugONWpJkbnvL12hVoYEDa.jpg",
  "categories": {
    "plot": 6.350877192982456,
    "acting": 5.666666666666667,
    "ending": 6.0,
    "soundtrack": 7.142857142857143,
    "cinematography": 8.0,
    "familyFriendly": 8.0,
    "funny": 6.3,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Oh my God. This movie is so damn good. It’s not just good, actually. It’s a masterpiece. The music is perfect - we're talking about the best Disney musical in the last 20 years. Stunning animation. Likeable characters. Impressive voice acting. A fun and emotional story. That’s Moana. It’s the movie you didn't know you want to see."
    },
    {
      "rating": "10",
      "text": "This is a fantastic film and a must see. Great music throughout the entire film. Good comedy. The story is a standard story, there won't be any surprises. Many movie tropes are directly rejected in the film. It is well worth seeing. It's as fun as you want it to be."
    },
    {
      "rating": "10",
      "text": "For a while, Walt Disney was considered the best animation studio winning over many fans who praised it for its way of adapting older stories and making them seem both nostalgic and fresh. Impressed by the success of its sibling studio \"Pixar\", Walt Disney decided to step in computer animation, which didn't work out that well for them at first. It wasn't until a couple of years ago that they managed to get their first critical and box office hit. From a number of great movies (Tangled, Wreck-it Ralph, Frozen, Big Hero 6, Zootopia) none of them has touched me as much as \"Moana\".\"Moana\" tells the story of a teenage girl of the same name, living with her parents in a beautiful island in ancient Polynesia. She's the daughter of the chief and she wants to travel far away from her home, which her father doesn't approve. She does it anyway and in her journey to save her people, she's joined by a silly chicken named HeiHei and the demigod Maui.The film has plenty of humor, heart, beautiful imagery and music and three dimensional characters. It's the best musical Disney has made in a while. It's full of twists that are effective and thought provoking. Moana is another flawless addition to the Disney Animation Canon and a must see."
    },
    {
      "rating": "7",
      "text": "The film's heart is in the right place, it is animated beautifully, and it breaks mold by introducing a princess that does not chance after a man.The humor, however, plays on the same type of joke of slapstick and potty joke and makes little to no sense. The songs also don't do much to contribute to the story.Moana is like that PG&J sandwich that is eaten just to be eaten. Good, but not perfect."
    },
    {
      "rating": "9",
      "text": "No Better than Zootopia in terms of Story and Originality, but DAMNIT this Movie still kicks ass! The Characters and Musics are great and the animation is Sweet"
    },
    {
      "rating": "10",
      "text": "After seeing a trailer in 4K from this movie, i just knew i had to have it, and i would like it. A big surprise was how good the music was, but also a high level of detail in graphics, animation, and all different areas in the moves are so wonderful and beleavable. With jokes, great story building, and original characters, i had fun from start to finish. Hope this gets a sequel!"
    },
    {
      "rating": "7",
      "text": "I think I'll hardly ever be able to hate a Disney movie, I try harder, but I can not (except Chicken Little, it's bad it hurts, even in the soul). Moana pretty much shows the same essence of previous works (wow, that's pretty obvious), visually gorgeous, charismatic characters, a cool story and full of adventures. As cool as Moana is, it's far from being a masterpiece or even above average, but I must agree to one thing, the songs from the Disney movies remain sensational."
    },
    {
      "rating": "7",
      "text": "A good musical and another good money maker for Disney. Dont expect much in terms of plot or story telling, but like many other Disney musicals, the tunes are simple, catchy and all around fun to listen to. The story is about the future chief of a tribe that is suffering from impeding famine due to degrading natural resources. Apparently, this was happening because the goddess of nature lost her heart so the future chief gets on a boat and sets out to return the heart to the goddess. She is aided by the ocean gods (or whatever that entity is) and enlists the help of a demi-god (Maui) to help her. The story is not good. For instance, the ocean itself could have accomplished all the goals trivially if it wanted to but instead it got a weak human and a half god to do work which would have taken it literally, a few seconds to accomplish. But this is Disney, so you have to leave your brain at home. Overall the movie is fun hence the good score and kids will have a great time with the music and characters (my 2 year old loved it). I think its time for Disney to change Star Wars to a musical... whats left of it that is..."
    },
    {
      "rating": "8",
      "text": "This movie teaches kids that they know better than their parents.  Parents don't know what's good.  Following their teenage heart to brave all danger toward exciting frontier is the way to go.It's -1 score if I was judging the movie by its educational value to young girls, but since I believe dumb people will do dumb things, movie or not, I give Moana an 8 because it's a beautifully rendered, sung, and acted Disney feature.  Disney entertainment delivered what is expected of them."
    },
    {
      "rating": "5",
      "text": "I don't think Moana will remain in my memory as one of the reasons why Disney is the number 1 animation studio in the world. So predictable and typical."
    },
    {
      "rating": "7",
      "text": "Long story short, Moana was nowhere near as good as Zootopia was, but still nice. The songs were great, the animation was some of the finest computer animation that I had ever seen, and the characters were enjoyable. However, what held it back was the story. The story was very predictable, simplistic, and the side characters weren't interesting."
    },
    {
      "rating": "10",
      "text": "Absolutely amazing. I mean, what would you expect from Disney other than another 10/10. This ranks right up with Frozen and in my opinion, the best animated film of the year."
    },
    {
      "rating": "3",
      "text": "This movie is pointless. The entire movie revolves around her beating Te Ka, aka a lava monster, in order to return the stone, but this goal could have been so easily achieved. Moana was loved by the ocean, and during the entire movie, all I was thinking was, \"Couldn't the ocean just automatically take her to where they were suppose to go, since it was able to do that for her in Maui's case? Could't the ocean just defeat the lava monster, since it was unable to touch the water? If the ocean was able to make a pathway of water in the end scene, then why couldn't it help moana earlier?\" I realize that it would defeat the purpose of the ending part with the volcano being the goddess, but throughout the entire movie I kept thinking that the movie's entire conflict could have been solved very very easily, so what was the point of prolonging it for so long?"
    },
    {
      "rating": "6",
      "text": "Heh. I had so high hopes after Zootopia, but that movie did not met them. Imagine a book, that is really good book, with good plot, good characters and good settings, but when you finish that book you feel something is odd, that book was too long, the begging was way too slow and some its \"crucial\" aspects like songs were overused."
    },
    {
      "rating": "0",
      "text": "GOOD- The animation is competent, though none of the visuals are particularly groundbreaking or creative- Disney learned long ago that if you give the main character ENORMOUS expressive eyes and make them charmingly klutzy it's easy to make the audience like them. That more or less works here, but again, it's a very old formula by now and has become a crutch.- The coconut pirates were amusing.MEDIOCRE- The songs are just meh. They're superficially catchy (not hard to achieve) but lack emotional engagement. Nothing comes remotely close to classic showstoppers like \"Be Our Guest\" or \"A Whole New World\".- The Rock's performance as Maui is so-so, and I say that as a big fan of his. He's got a weird, offputting character design with beady little eyes, a caveman face, and no neck. Honestly he looked more like a villain than a hero.AWFUL- Moana is a huge Mary Sue and has no character arc (OK, she very briefly doubts herself, then instantly gets over it). She has no flaws to overcome and the only growth she experiences is learning to sail her boat. This is lazy, agenda-driven writing. You can't invest in a character if right out of the gate they're the smartest, bravest, free-spirited-est Chosen One of Prophecy and have no room to grow or lessons to learn. It's boring and reads like fanfiction.- Meanwhile the main male characters, Moana's dad and Maui, are stupid, insecure, and pretty much useless. If a kids' movie did this to all its female characters people would be shrieking and gnashing their teeth.- The themes are: 1) home and community and tradition are boring, so leave them all behind as soon as possible! 2) Kids should ignore their lame old parents and listen to their \"inner voice\" instead! Grown-ups just don't get it!3) Men screw everything up, and only women can fix their mistakes! Grrrl power!4) The source of all creation and life is actually a jolly green Gaia spirit! Screw Christianity, it doesn't have a soundtrack by Lin-Manuel Miranda!- There's something ugly about a multinational corporation like Disney employing a bunch of render-farm nerds in Burbank to make a movie that exploits indigenous peoples for the sake of commercialized faux-exoticism. Maybe Pacific Islanders don't need a bunch of American business executives to make movies about them and slap the IP on lunchboxes and t-shirts. Maybe doing that is just a little presumptuous, even if they let a few of them do some voice work as a fig leaf."
    },
    {
      "rating": "10",
      "text": "Moana is the best Disney movie in a while. Excellent art design, great music, and good humor. I appreciate the story as well. It should work well for kids, but there is enough substance for adults. Auli'i Cravalho (Moana) is an excellent voice actress, and an excellent singer that I hope will carve out a career from here. If you watch Disney movies, there is no reason not to watch this one. This is the best movie I've seen this year, but I think that is understating how good it is."
    },
    {
      "rating": "4",
      "text": "Rather dull movie. Plot is primitive, movie should be 20 minutes long maximum. So many songs. Too many songs. Males are dumb, lazy and frightened. Two ladies are courageous and adventurous. Though one of them is confirmed rustic fool. Second is Moana. But she saves the world in the end. Movie by feminists for feminists."
    },
    {
      "rating": "10",
      "text": "This is arguably one of if not the best movie Disney has made in years (and with how good their films usually are, this is saying a lot).To start, the movie has a very enjoyable story. It has an overall simple plot, but the story takes the main characters to many different places with many cool characters and enemies. The movie constantly ups the stakes with every encounter which makes it that much more exciting.The voice acting is fantastic as well, as are the singing. Most of the songs will be classics someday, and the main one is just as catchy as \"Let it Go\". The movie also looks beautiful visually as well.Overall, Moana is a fantastic film that I am glad I saw. I would say this is a must see for any fan of animation, Disney or overall good movies."
    },
    {
      "rating": "10",
      "text": "Great music, great writing, great voice acting, great characters, al, around great, but the number 1 reason I payed money for this movie, is moana is suuuuuuper sexy"
    },
    {
      "rating": "7",
      "text": "The music is a standout (with the possible exception of the dud \"Shiny\"), and Moana's world shines with authenticity and care. The people, ships, animals, costumes all give a taste of Islander life, and I wish that potential felt more realized throughout the film. Several of the recurring gags (tattoo man, the chicken) fell flat for me and weren't handled with typical Disney deftness. A movie I would happy to watch again, though nowhere near the quality of monster-hit Frozen."
    },
    {
      "rating": "10",
      "text": "This movie was amazing. From the spectacular CGI to the funny humor for all ages to the great story. This movie has it all and it will be remembered as an instant disney classic in the same category as aladdin, lion king, beauty and the beast, and toy story. I find no fault in this movie 10/10. This is a movie for all ages to enjoy."
    },
    {
      "rating": "9",
      "text": "Moana (November 2016) is the latest Walt Disney Animation Studios movie following up the extremely clever and fun Zootopia (March 2016) and the record breaking animated movie Finding Dory from Disney/Pixar (June 2016).  Moana is a CG animated film which takes place on a South Pacific island about a young girl named Moana, played by newcomer Auli’i Cravalho, who longs to explore the ocean but is forbidden to leave as a result of her overprotective father who is also the Chief.  To make matters worse, Moana’s Grandmother tells stories to the children of a demigod named Maui (played by Dwayne Johnson) who can change shape and experience wonders of the great sea which are all just out of reach from those stuck on the island.Moana features catchy songs and fantastic animation in addition to a well crafted story that feels both ancient and modern at the same time.  Moana and Maui have excellent chemistry on screen and both Cravalho and Johnson surprised us with their ability to convey humor, emotion and song with their voices.  We were glad to see a female protagonist introduced into the Disney universe who wasn’t part of a love interest or even have a love interest at all – unless you count a love for her people and the ocean.  The movie also does a nice job of conveying Polynesian/Samoan culture and even has a couple of catchy songs sung in Traditional Tokelauan.Overall, Moana is enjoyable and fun to watch – if there was a negative side about the movie it would be that much time is spent with the two characters on a raft and reminded us a bit of the Kevin Costner movie Waterworld.  We would have liked to have seen a secondary plot that may have kept us involved for the rollercoaster ride and maybe even some explanation as to the significance of some of the cultural elements germane to the story."
    },
    {
      "rating": "6",
      "text": "Disney's sharp with Moana is increasing to make it come to the point where this movie can't even be enjoyed completely what it should've been expected. Dwayne Johnson tries his very best in his sudden appearance, but he tries a little off the scale. Comparing this to Disney's previous installment, this intends to be a letdown and it did."
    },
    {
      "rating": "0",
      "text": "My review of this garbage while trying to be funny has been censored. Fine, I will do it again without being funny. Moana is 100% feminist brainwashing and indoctrination, explaining to small children how boys and men are useless while girls and women are perfect and wise. It is crammed full  of the most disgusting and inappropriate sexual symbolism and vile, poisonous messages for small children. It is a complete travesty that something like this can get published. If any of the people who reported my original review accidentally develop a brain in the future, please go protest the evil people at Disney rather than my use of anatomical terms on Metacritic.Seriously, some perspective please. Horrible, divisive, society-destroying brainwashing vs using funny words for private parts in a Metacritic comment. I know which one I would be more upset by. Protect your children from this toxic stew! Anyone who lets their kids watch this movie is a terrible, terrible parent.Clean enough this time, or are you going to report the truth to the moderators again?"
    },
    {
      "rating": "4",
      "text": "I don't know what film the critics saw given the superlative reviews on here, but Moana was the most disappointing Disney film in a long time. The story was, frankly boring, and still managed to be difficult to follow for kids and the parents who, when asked, 'why did she do that?' had to say 'no idea'. Why did she keep falling in the water? Who knows? Was it supposed to be funny? Who knows?Moana's a pretty generic Disney princess heroine (despite the fact she is, to differentiate her from every other Disney princess heroine, only the daughter of a chief), full of moxie (as per usual Disney princess heroine) who must do something to save her island.. or learn something about herself.. or.. I'm not sure!The Rock is marginally amusing as the comic relief. He isn't helped by the dumb jokes he's given. The young actress voicing Moana does her best but isn't noteworthy (I think she was a non-professional and it shows.. or is heard).Lin-Manuel Miranda, who has done such a majestic job with Hamilton, hasn't done himself proud here. The songs just drag on. One song is the chirpy 'You're Welcome' sung by the Rock. It's catchy if nothing else.Frozen's a hard act for a Disney musical to follow, but Moana doesn't even try."
    },
    {
      "rating": "1",
      "text": "Coming off of Frozen and Big Hero Six this was a huge disappointment. The story feels like it was made by the direct-to-video C Team. Where is John Lasseter when you need him? It was better than Chicken Little I suppose. Wait for video, rent it for $1 from red box or something. So sad about this, I wanted it to be great."
    },
    {
      "rating": "0",
      "text": "boring from beginning to end. idiotic singing without any artistic quality. pointless altogether. don't waste your time. if there were not all those songs all the time, maybe at least kids would enjoy it."
    },
    {
      "rating": "9",
      "text": "I don't remember the last time I enjoyed one hour and forty-three minutes, including opening and closing credits, as I did this afternoon watching \"Moana\" (pronounced Mo-anha). I laughed out loud 2-3 times, which is pretty rare for me seeing a movie, and had a big smile on my face for at least 1 hour and 30 minutes while in the remaining time tears!There is so much to talk about while reviewing this film not least of all is the imaginative animation from the colors used, the many different characters, the variations of the sea btu most of all the expressions of each of the characters whether talking or not.Dwayne Johnson, just voted the sexiest man alive, the highest paid actor in the movies and the star of the successful HBO series \"Ballers\" plays Maui and the drawing of his character, with animated tattoos all over his body, is fun in itself. Auli'i Cravalho debuts as Moana has a beautiful voice and plays the princess, though she insists she is not a princess as if that is a wrong thing to be. The banter, written by the screenwriter, Jared Bush, is not only fun but smart. Along with the two co-stars there is grandmother everyone would love to have voiced by Rachel House, the dumbest rooster you will ever see on the screen voiced by Alan Tudyk, Temuera Morrison as Moana's father, Jemaine Clement as a crab that has one of the many excellent songs, Nicole Scherzinger as Moana's mother, who is drawn too young looking more like her sister and my favorite, lovable creature, Puanani Cravalho as the pig!The songs are infectious, strong and one or two might show up as an Oscar nomination. They were written by Lin-Manuel Miranda, of \"Hamilton\" fame, Mark Mancina and Samoan Opetaia Tavita Foa'i.The drawings and the animation of the characters are mind boggling as are the scenes on the ocean and islands.Treat yourself, and take a kid along if you would be too embarrassed going into seeing a 'cartoon' . Animated films of today are not like your parents or even you knew and these are also by Disney with a little/lot of help from Pixar!\"Moana\" is a delightful film that should seen by adults and kids of all ages!"
    },
    {
      "rating": "5",
      "text": "The first half of the movie was great and then it dragged on for the second half, with the story spiriling all over the place. I was in a theater full of children and at the halfway mark the movie lost them...they were getting up and running around and generally bored. They got back into it at the end. The animation was lovely but the story got too convoluted for children and it was too long. These kiddos were in the 7-10 range. That is my barometer for a children's movie and I always try to go and see them with an auditorium full of children. Also the music and lyrics were not very catch like you like in a Children's film. Disappointing."
    },
    {
      "rating": "3",
      "text": "OVERRATED! Great! animations with weak story! if you know Aladdin and Lion king this is nothing like that. This feels boring and not good at all. And the music is bad. except for 2 songs. the crab song and moanas song that they HAD to play 3 times to fill out with."
    },
    {
      "rating": "6",
      "text": "The visuals are absolutely gorgeous - the songs (except for the crab's) are very enjoyable, catchy and funother than that however, it's a paint by numbers Disney Movie, but unlike many of the other disney movies twhere it isn't THAT obviosu and they do twists and turns on their formula - THIS ONE feels like something you've seen a hundred times beforeI'd say go see it but don't expect it to be the new Frozen"
    },
    {
      "rating": "10",
      "text": "This movie was highly entertaining and was enjoyed by every member in my family.  The music was wonderful.  The depth of the plot to explain the culture of the Island people was creative.  The Rock was skilled and extremely entertaining actor.  I feel like I can relate to Hey Hey, the chicken."
    },
    {
      "rating": "10",
      "text": "This is Disney at is best, a fantastic combination of commercial appeal and art. The Disney princess is back, with not even a hint of a romantic interest to distract from her heroic (heroinic?) arc. As a fan of Lin-Manuel Miranda, I am ecstatic about the songs. The themes of islands, heroism, family, and tradition are right up his alley. The Rock is perfectly cast and gives a career-high performance. No one could have done his part better. I am not an expert on Polynesian culture, but everything feels perfectly authentic. They've come a long way since the Tiki Room. And finally, the animation is another step forward for Disney. They've always excelled at rendering water, but the water is literally a character in the story here."
    },
    {
      "rating": "2",
      "text": "Loved Frozen and seeing the reviews on here, figured Moana was a worthy follow up. I thought Zootopia was a great step forward for Disney. One step forward, two steps back. Moana's storyline is perfunctory so the film is full of padding with forgettable songs and repetitive action. It plays much more like a Disney straight to video than a theatrical release. The animation isn't even on par with recent Disney films. This is the first Disney film in a long time that isn't emotionally engaging. Dwight Johnson does his best with the jokey lines he's given, but nobody could save those jokes."
    },
    {
      "rating": "9",
      "text": "A thoroughly enjoyable mythological hero story, where the two main characters interact beautifully with one another. The songs are uplifting, and the visuals are breathtaking. Jemaine Clement as Tamatoa is a definite highlight, but all the voice actors are doing an excellent job. Having watched the movie twice - which I hardly ever too - I can't find a serious flaw with it, except the length, and the somewhat sudden ending. There are some pesky symbolism & social messages, if you're looking for them, but  they're not forced upon the audience like in many other current films, so you can choose to simply enjoy an adventure in which everyone is great in their own way."
    },
    {
      "rating": "7",
      "text": "Faithful to the tradition of Disney’s renaissance era, Moana takes audiences of all ages on a journey with a resourceful young woman who learns her place in the world. Parents will love the tribute toward Polynesian culture, while kids will love the fantastical journey made complete with a fresh color palette. Other than an inappropriately placed gag about urination, Moana has established itself as yet another family-friendly hit by the Disney studio within their CGI renaissance.The wide range of animation styles explored here starts with a two-dimensional storytelling of what Polynesian religion believes brought the islands into existence. In what appears to be a moving tapestry, a wise, grandmotherly voiceover tells us of Mother Island, who raised islands out of the sea and then rested among them. That is, until Maui the shapeshifting demigod stole her heart. Along his path away from Mother Island, he lost the heart, as well as his fish hook that allows him to shapeshift.Then the animation style switches to the traditional computer animation, where an elderly storyteller is speaking to her grandchildren about the story. The one seated in the middle of the pack, the heroine of our story, immediately goes out onto the seashore, where the miraculously animated living water leads her through conch shells to the heart of Mother Island itself: the ocean called her to restore peace to the land.Then this toddler grows up to become Moana, daughter of the chief who wishes to sway away from their traditional ways in order to explore the world. She’s a typical kid’s movie heroine we’ve seen countless times before, and her motive to defy authority is not a good message for our kids, but the empowering musical voice by Auli'i Cravalho plenty makes up for that.Her grandmother pushes her to follow the calling by the ocean to find Maui the demigod so that she can help him retrieve his fish hook and return the heart to Mother Island. It follows out of the tradition followed by her people, as they are not voyagers; but their long-forgotten ancestry says otherwise. Therefore, Moana goes out on the quest, with a google-eyed, dim-witted chicken as her sole companion.Then she meets Maui himself, voiced with a lovable laid-back nature by Dwayne Johnson. He adds the familiar heart and soul expected from any Disney feature, as his tattoos move individually to express his true feelings.Now with the demigod on her voyage, Moana travels elsewhere to find his hook and get to Mother Island. Such stops include an underwater world of fantasy that houses a giant gold-crazy hermit crab. He is not one of the more tolerable portions of the adventure though, as his modes of dialogue includes rambling without a clear punchline to whatever joke he’s attempting to deliver, and an out of place song sung in the style of Paul McCartney.This is among one of the other songs that simply sound odd in melody. Even so, there are several hits in the score, including Moana’s single ballad, “How Far I'll Go,” and the catchy “We Know the Way,” both of which are guaranteed Oscar nominations. Yet none of these songs will catch on as one of Disney’s iconic tunes. In addition, anytime the characters are not singing, they are blatantly telling us through not-so-subtle foreshadowing what will happen later on.Another thing that is difficult to grasp about Moana is the big “so what” of its celebration towards pagan religion. While yes, we should never be afraid to learn about other cultures and their backgrounds, depicting their gods as truth is not the answer to learning about who these people are. I would like for Disney to someday make a big leap in exploring and faithfully retelling the way those of another culture live their day to day lives, as to make up for their poor treatment of non-White races in the past.I cannot see Moana becoming a celebrated classic like Beauty and the Beast, The Lion King, or The Little Mermaid, nor can I see it largely influencing pop culture like Frozen or Zootopia, but it is still a fresh adventure for the young and young at heart to get the ideal expected Disney experience."
    },
    {
      "rating": "6",
      "text": "But where is the pornstar actress Moana? Disappointed all along the 150 characters long and beyond. Pozzi 123456 caco io e puzzi lei. Bored to reach 150 characters"
    },
    {
      "rating": "0",
      "text": "It's generic. Very very generic. It's a cheap knock off of a good princess movie. The characters have great charisma, but if you're the type of person who likes a meaningful story and something memorable, you won't find it here. At best, you'll enjoy the visuals and the the voice acting (despite the characters being painfully shallow). Then the next day you'll forget all about it."
    },
    {
      "rating": "7",
      "text": "A very colorful movie, very pleasant to watch...but bare to the bones story really. Saturday morning cartoon quality, no real conflict of any kind really. I mean, it's a neat uplifting movie, but really without the Disney brand stapled to it no one would give it a second thought."
    },
    {
      "rating": "10",
      "text": "I don't know how Disney does it, but they just continue to impress with their animated films. Every time a new one comes out, I think to myself \"but the last one was so good! How could they even come close to that?\" And then, my expectations are exceeded. Such is the case with Disney's 56th animated film \"Moana,\" which is a fantastic film with a fun story that, while not terribly original, is told well enough to make it feel fresh. On top of that, the characters are great, the music is catchy and memorable, the film is funny, exciting, and heartfelt, and the animation...oh boy, the animation. This is one of the most beautiful animated films I have seen, and watching it all in action just feels so, for lack of a better word, magical. There's no other way I can say it, go see \"Moana.\" And if you end up loving the film after reading this review, well, \"What can I say except, 'you're welcome?'\""
    },
    {
      "rating": "10",
      "text": "This movie is probably one of my favorites, it's beautifully written and the songs are sung just as great. I utterly enjoyed this movie all the way through and I'm sure I will continue to watch it for Many years to come."
    },
    {
      "rating": "8",
      "text": "Compared to other disney movies over the recent years Moana has the highest comedic value with punchlines and jokes around every corner. The animation is excellent; although for a disney movie this is to be expected. The songs are a big part of this movie and were sung beautifully. The core story-line of Moana is simple yet it is engaging. The underlying story, motivations and reasons however bring a lot of questions; especially when it is thought over after the movie ends. Moana is a great disney movie especially for those who watch it purely for enjoyment and laughs. However if one is looking for a well thought out story Moana lacks in comparison to recent disney movies such as Big Hero 6, Inside Out or Zootopia."
    },
    {
      "rating": "3",
      "text": "Moana grabs from a culture ripe with unique stories and narratives to tell, but does completely nothing with it--which is frustrating. The film follows every device and mechanism layed out by every other movie prior to it and somehow plays with them with even more lethargy. It's painfully obvious and predictable. Personally, I wouldn't recommend it just to save the person from an hour and 53 minutes of unrewarding tedium"
    },
    {
      "rating": "8",
      "text": "Disney has struck gold here! The visuals, the music and the sense of adventure are all wonderfully presented in a colourful conglomeration. It doesn't follow a particularly groundbreaking narrative but everything somehow feels sea-air fresh."
    },
    {
      "rating": "10",
      "text": "'Moana' is a visually brilliant movie, where Disney prove there is still space for heroism and dreams when we think they are lost. Thank you Ron Clements and John Musker, you truly are two wonderful directors!"
    },
    {
      "rating": "10",
      "text": "Such an amazing movie.It has been a long time since I've heard such a powerful addicting soundtrack in an animated film.The way they present the culture and the life of a teenager trying to figure out her own ways.Truly beautiful."
    },
    {
      "rating": "8",
      "text": "In the long line of Disney Princess films Moana distinguishes itself with a new setting and by speaking to lineage and importance of tradition and finding your calling. A-"
    },
    {
      "rating": "10",
      "text": "I really enjoyed Moana.  Some of the songs are still in my head days later (and I mean this in a positive way), and the animation and settings were beautiful.  I generally enjoyed the sense of humor, and the story was exciting and optimistic."
    },
    {
      "rating": "0",
      "text": "Moana is rich, colorful, lively, and full of spark. It is a good film, though it is not the best, most groundbreaking animated film. It's storytelling is generic with some slightly new twists. The music is good, but not heart wrenchingly powerful nor emotionally stirring. The animation is amazing, as expected. Moana herself is an endearing character, yet her story seems quite small and downplayed. However, it is Disney. It is, overall, a quality movie experience.P.S. I loved the chicken."
    },
    {
      "rating": "8",
      "text": "Sorry little boys.  Another Disney movie means another Princess movie.  It seems that is all Disney makes anymore, but can you blame them?  \"Frozen\" made about a billion dollars world wide.  This latest Princess film follows the standard formula.  This time an Island Princess leaves home for an adventure (as opposed to leaving a castle, or tree top, etc).  The film looks great, has a few really good songs and a couple not so good, and some humor here and there (although not as funny as some other Princess films like \"Tangled\").  It even boasts the world's stupidest chicken, although that schtick got old pretty quickly.  Moana's traveling companion, Maui, is the standard issue annoying character who fights Moana every step of the way, until the end of course.  Despite the lack of originality it is a well made film and I enjoyed it.  Boys will have to wait for Disney's competition to come up with another \"How to Train Your Dragon\" or \"Kung Fu Panda\" sequel to appeal to them and fill the void left by Disney."
    }
  ],
  "recommendations": [
    "the_princess_and_the_frog",
    "rio_2",
    "trolls",
    "over_the_moon",
    "strange_magic",
    "finding_nemo",
    "rio",
    "tangled",
    "vivo",
    "brave",
    "luca",
    "atlantis_the_lost_empire",
    "the_polar_express",
    "raya_and_the_last_dragon",
    "brother_bear",
    "frozen_ii",
    "pocahontas",
    "the_road_to_el_dorado",
    "aladdin",
    "the_lion_king",
    "anastasia",
    "ferdinand",
    "the_book_of_life",
    "my_little_pony_a_new_generation",
    "sing"
  ]
}