{"id": 2026, "title": "Momentum", "starring": ["Olga Kurylenko", "Morgan Freeman"], "runtime": 96, "genre": ["Action", "Crime", "Thriller"], "description": "When Alex, an infiltration expert with a secret past, accidentally reveals her identity during what should have been a routine heist, she quickly finds herself mixed up in a government conspiracy and entangled in a deadly game of cat-and-mouse with a master assassin and his team of killers.  Armed with her own set of lethal skills, Alex looks to exact revenge for her murdered friends while uncovering the truth.", "releaseYear": "2015", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/rStxrJBaWs3oNQfnQn4LKzG1lQ9.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 5.0, "action": 5.714285714285714}, "reviews": [{"rating": "5", "text": "Momentum may not receive many merits from the story or consistency, but it delivers a decent action for simple movie night.\r It's quite ironic that the title is called Momentum seeing that the pace is rather slow for an action movie. Credit for trying to set up espionage twists along the bullet spree, but things eventually feel like they are conveniently forced to make the heroine look good. Still, Olga Kurylenko does look fittingly attractive and strong for the female role, the action is also fairly presentable for a leisure watch.\r Alex (Olga Kurylenko) is an operative who got caught in a web of conspiracy after a botched heist. She must try to survive from other agents while trying to figure out the secret agenda. Like Milla Jovovich or Angelina Jolie before her, Olga admittedly looks the part. She's nimble and athletic enough to pull off the operative persona, which is already half or even most of the movie's appeal.\r James Purefoy as Mr. Washington is convincing as the antagonist, it feels like he's comfortable on suave charismatic villain after his role in The Following series. Morgan Freeman rounds out the cast, he appears in so many movies lately and for a good reason, relatively. His past few roles might just be supporting ones but he does give air of authority when he's present and a famous name can’t hurt.\r The main problem is the movie tries to incorporate too many angles, be it may the sinister villain and some unexpected allies. However, these subplots don't really mash well together, in the end it resorts to cheap Deus Ex Machina twist and even stalls the pace. Some of the characters might feel out of place or simply appear out of nowhere when plot demands them. The tricks used are far from refined, which make it even more far fetch when the movie tries too hard to sell them.\r These flaws notwithstanding, Momentum does offer what expected of it; a strong female lead shooting through and outsmarting her foes. It may not receive many merits from the story or consistency, at times it seems like watching a femme fatale wearing heavy plot armor. but it delivers a decent action for simple movie night."}, {"rating": "3", "text": "Peu de films ont à la fois un beau ramage et un beau plumage mais nombre d'entre eux ont tout de même -parfois- l'un ou l'autre. Ici, en guise de ramage, on a un scénariage (une sorte de gribouillage de scénario) aussi limité que stupide et en ce qui concerne le plumage, on a un filmage catastrophique, ultra-cut qui file la migraine.Le film veut se donner un air de \"mauvais garçon\" avec ses séances de torture et sa violence de tous les instants mais ne parvient qu'à maintenir notre attention que par son action éffrénée durant les deux premiers tiers, attention qui s'effondre brutalement pour laisser place au long soupir de l'ennui pour s'oxygéner le ciboulot passablement abruti par tant de futilité.Cela dit, ce n'était pas l'action ridicule qui nous maintenait éveillé mais plutôt cette actrice dont j'ai mis 20 mn à me rappeler le nom : belle et sauvage, mais c'est bien sûr !... Olga, la terrible Olga Kurylenko. Je l'aime beaucoup. Ce n'est pas une bonne actrice mais je m'en fous ! J'ai regardé cette connerie jusqu'au bout pour toi, Olga. Enfin, presque jusqu'au bout. Au fait, que vient faire Morgan Freeman dans cette galère ? pauvre vieux !"}, {"rating": "9", "text": "Pretty decent action movie, with a new story. I really appreciate movies that aren't copycatting."}, {"rating": "8", "text": "Watched this movie with very little expectation and was pleasantly surprised! This was a very good movie, lots of action. A few minor things that were wrong but nothing to complain about. It seems it was setting up a sequel, but from the reviews it doubt that will happen.Anyway, its definitely worth watching! As an action movie its good entertainment."}], "recommendations": ["survivor", "jack_ryan_shadow_recruit", "the_commuter", "the_november_man", "the_gunman", "killer_elite", "honest_thief", "the_mechanic", "21_bridges", "parker", "shooter", "the_ice_road", "2_guns", "extraction", "street_kings", "seeking_justice", "angel_has_fallen", "the_equalizer", "wrath_of_man", "american_assassin", "hunter_killer", "collide", "kate", "run_all_night", "mechanic_resurrection"]}