{"id": 3520, "title": "Money Monster", "starring": ["George Clooney", "Julia Roberts"], "runtime": 98, "genre": ["Thriller", "Drama"], "description": "Financial TV host Lee Gates and his producer Patty are put in an extreme situation when an irate investor takes over their studio.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/DlgdAkAKirD01R1mBejhFjS6nQ.jpg", "categories": {"plot": 6.833333333333333, "acting": 6.870967741935484, "ending": 6.222222222222222, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 6.8, "action": 6.666666666666667}, "reviews": [{"rating": "7", "text": "George Clooney plays an arrogant financial advisor on TV whose show is interrupted when a desperate young man (Jack O'Connell) sneaks into the studio and straps a bomb on the star. The show's producer (Julia Roberts) tries to maintain control and calm, as the hostage situation plays out live on the air. The performances are compelling and director Jodie Foster has crafted an interesting and mildly tense drama. She strives to minimize the script's indictments of our financial system and mostly succeeds in keeping the focus on the people. It's never especially riveting, but manages to be an absorbing entertainment."}, {"rating": "6", "text": "While \"Money Monster\" fails to deliver its message about Wall Street AND doesn't feel tense or high stakes enough, it is an entertaining enough real-time thriller bolstered by assured performances from George Clooney, Julia Roberts and Jack O'Connell."}, {"rating": "8", "text": "This movie is pretty good for what it is, but nothing special.\rMoney Monster is directed by Jodie Foster and stars George Clooney, Julia Roberts and Jack O' Connell.  I thorougly enjoyed Money Monster, but it's nothing that I would write home about.  It's a full on, dirty and suspenseful thriller that offers much in terms of acting and storytelling.  While Kyle holds Lee at gunpoint, the entire city outside is in chaos, not only from the fact that a hostage situation outside, but from what Kyle is saying as well.  The whole controversy around the stock market and this supposed \"glitch\" that took everybody's money was interesting to learn about, even if it is complicated.  The acting was spot on, Jack O' Connell executed the best performance of the movie; his constant mood swings and loud personality gave me chills every time he would tell some body to be quiet.  The movie had a solid soundtrack, great characters, and an interesting story that makes you think about real life economics and the government.  It's a solid thriller overall, but as I said before, it isn't anything special.  It's a very good movie, but there's nothing in particular that blows your mind or surprises you.  In the third act of the film, you can pretty much predict what will happen at the end of the movie.  Also, the only thing that stands out about the film is that George Clooney is the star of the film; I felt like if it were any other movie star, the movie would lose it's charm.  Overall, I enjoyed this film for what it was, but it's not something that I would urge everybody to go out and see this minute.\r Money Monster gets an 8/10."}, {"rating": "4", "text": "I thought this movie could have potential if it was a little more grounded and serious. But when I saw George Clooney being goofy and and completely unaware of danger, I wasn't biting. The only message of morality this movie brought was that greed is bad. Nothing special at all."}, {"rating": "9", "text": "Excellent movie. Fast pace. Great acting. Subject relevant. Jodie Foster A+ for directing. Only movie I've seen in years in which people applauded at the end."}, {"rating": "6", "text": "It's tense and entertaining enough until the plot is moved out of the studio. Then it declines steadily into another crime story expose with half of  NYPD in attendance. Clooney is Clooney, Roberts is Roberts, and what could have been an educational movie about Wall Street ends up as predictable as any Hollywood by the numbers yawner."}, {"rating": "7", "text": "You have to have a little patience with this film. Either Jodie Foster or the scriptwriter had trouble with the setup. I thought the satire of the money guru show could have been stronger and I had a very negative reaction to Jack O’Connell (Kyle) who just seemed to be a pain in the butt at first and totally unsympathetic. But gradually this movie built up a head of steam and some real tension, and both George Clooney and Julia Roberts were very good. I think Jodie Foster did a good directing job, and I enjoyed this film, but I also think it could have been a lot better – funnier and more suspenseful and more biting in its message. Spike Lee’s film Inside Man had a much better pace, for example, and the satiric edge was more cutting in The Big Short."}, {"rating": "6", "text": "George Clooney returns for another plain film that intends to solve its own mystery before we can even figure out the case. Money Monster, in this case, is passable."}, {"rating": "10", "text": "I really enjoyed this movie.  It was suspenseful, enraging, and had the right amount of levity.  Julia Roberts and George Clooney were perfect.  Jodie Foster did a wonderful job on the whole film"}, {"rating": "1", "text": "Two movie stars George Clooney and Julia Roberts, and one former movie star and alleged genius director Jodie Foster show they are over-rated and in decline.  The characteristic charm of  Clooney and Roberts does not even shine through even a bit in this film, as the script is too distractingly awful in its implausibility and superficiality, and Foster's clumsy directing is certainly no help. Terrible flop. I hope this is not a sign of the irreversible decline of Clooney, Roberts and Foster."}, {"rating": "3", "text": "As absolutely ludicrous as this premise was (you'll be leaning on the FF button a lot), the truth underneath is that we wouldn't get real answers unless these people's lives were threatened. Otherwise, it's just a parade of above-the-law criminals pleading the Fifth and \"I can't recall\" much like you've seen Hillary's staff do most recently."}, {"rating": "8", "text": "Walking into a movie house to see a film starring George Clooney and Julia Roberts, directed by Jodie Foster, one is expecting to see a good film and “Money Monster” delivers. It brings nothing new to the movie screen but it holds your interest, is a decent thriller and shows two stars at their best along with a supporting cast doing just that by giving strong support.\r The plot sounds very simple but the financial dealings aren’t! Kyle, played by Jack O’Connell, takes flamboyant TV financial host Lee Gates, played by Clooney, hostage while the latter is doing his live show, which Patty Fenn, played by Julia Roberts, produces and directs. Kyle makes Lee put on a rigged bomb vest and threatens to take his finger off the detonator unless it is explained how he lost all his money on a tip given by Lee on his show, which was blamed on a computer glitch.\r The company is owned by Walt Camby, played by Dominic West, a favorite actor of mine, whose communication director, and his mistress, Diane Lester, played by Caitriona Balfe, is in the dark about many things regarding her boss. Some of the best scenes in the movie are between Balfe and Roberts.\r Christopher Denham as a producer wanna be working with Patty has a role underwritten but played well by him and offering humor. Lenny Venito as the lead cameraman on the show, Condola Rashad as an assistant and Emily Meade as Kyle’s girlfriend all make an impression with their time on screen.\r George Clooney is his familiar, wisecracking, mugging self at the beginning and growing stronger as he tries to bind with Jack O’Connell who delivers a difficult role easily. Through it all Julia Roberts is the focus and main strength of the film.\r The screenplay by Jamie Linden, Alan DiFiore and Jim Kouf keeps the suspense going, gives the actors some funny bits and tries to look at all the aspects of Wall Street and how the financial world works but do their best keeping the dealings between Clooney, Roberts and O’Connell at a high level.\r Though the film was suppose to have been shot in real time, a few scenes, outdoors, had to be fudged here and there. Jody Foster, as the director, keeps the tension going, the actors moving briskly and efficiently entertains. Though anything you can say about a thriller will be a spoiler Foster only did two things ‘wrong’, one regarding Roberts which is a personal spoiler for me and another regarding giving some information just a beat too soon.\r “Money Monster” delivers any expectations a movie-goer could want and will certainly satisfy fans of Julia Roberts, George Clooney, Jodie Foster and thrillers."}, {"rating": "7", "text": "Walking into Money Monster, I expected it to be uneventful and boring. But surprisingly, the film keeps the audience entertained from the opening credits to the closing credits."}, {"rating": "8", "text": "A tense, fast paced thriller, this was a very engaging, somewhat stressful, experience. The performances are universally excellent, the script is superb, and the storyline is one which is satisfying and saddening, with a number of well crafted moments which surprise. This has a very similar feel to Inside Man and, though it's not quite as polished, Foster delivers a gripping commentary on the financial crisis and the disconnect between 'Wall Street elites' and the 'everypeople' effected by the fallout of a flawed system. A polished, considered film. 8.04/10"}, {"rating": "1", "text": "The script is terrible, the story is entirely predictable and seen many types before in a slightly different setting. I like Clooney in most movies but he was terrible in this, unfit for the role of Jim Cramer (this is who the movie tried to imitate) as he is too good looking and smooth. Julia Roberts was forgettable. Jodie Foster is enjoyable as an actress but a completely failed director based on this."}, {"rating": "6", "text": "I wanted to like this, really, but I couldn't shake the feeling that it was a lot of \"relevant\" hoopla for a been there done that story. The bad guy is caught and all is good right? Yeah, it's not that easy and I wish the movie had had more cojones at the end to own up to how messy this all really is and how there are no easy answers and no scenarios where \"catching the bad guy\" makes everything all right."}, {"rating": "6", "text": "Money Monster is perfectly adequate. The simple premise provides a suspenseful and high stakes scenario that has great relevance on our world today. Carrying the film are some strong lead performances and somewhat well realized characters. If the film had just fleshed out the other elements so they didn’t feel as standardized this film could’ve been something great. As is it’s fine and a good way to kill time but nothing to sing home about."}, {"rating": "5", "text": "This is just an average thriller. It is suspenseful for about ten minutes and then you can predict everything that going to happen. You know who the villain is, you who the hero is, and the plot is paper thin. I expected more but I still enjoyed watching it.  Still, you have seen this type of movie a million times.  It is forgettable."}, {"rating": "7", "text": "There were a few times the direction was light but overall the movie was entertaining.  There was good drama with George Clooney and Julia Roberts turning in excellent acting jobs.  If you're a New Yorker, give it an extra point . . ."}, {"rating": "4", "text": "The movie is not without it's moments. Since it is a thriller you cannot take a script seriously, but even for a thriller it was ridiculous. The film is starring George Clooney and Julia Roberts, directed by a former star Jodie Foster. In one word the movie can be described as \"mediocre\", in every aspect.\rStill watchable, though, IF you are a big fan of Clooney or Roberts. Still, by the end of the movie I seriously considered leaving. Persevered though."}, {"rating": "4", "text": "Interesting concept, fairly well executed, unfortunately the ending is rather unsatisfying. Money Monster reveals the major plot point and mystery even before the film ends."}, {"rating": "7", "text": "Money Monster is a solid thriller/drama from director Jodie Foster that entertains and thrills, while also having surprising emotional depth. Featuring reliably solid performances from George Clooney and Julia Roberts, the real star here is Jack O'Connell. The next big thing in film, O'Connell continued his tour de force through the acting world with yet another truly powerful performance here in Money Monster. Unhinged, yet entirely emotionally vulnerable, O'Connell shows incredible range in this film that really allows you to feel incredibly sympathetic towards his character. As for the film as a whole, it is a well made and entertaining thriller/drama. It is never too preachy, but is quite conventional and your run-of-the-mill blend of thrills and emotion. That said, Money Monster's well-directed, well-acted, though capable of far more than it amounted to. As it stands, it is a conventional film that more than entertains, but never tries to be anything more than it would up being."}, {"rating": "8", "text": "Try and disregard the prevailing critical message on this first directorial foray into the mainstream thriller for Jodie Foster, for the film remains a wildly entertaining, genuine thrill ride from start to finish. Indeed, \"Money Monster\" is as much a magnificent testament to the power of filmic tension as it is a riotous showcase of the respective dramatic talents involved. And thanks to a carefully-handled message and a killer final act, the film ultimately soars above expectations, delivering an almost completely satisfying cinematic experience."}, {"rating": "6", "text": "What if the experts are wrong! And how it affects the common man!\r Jodie Foster did wonderfully as a captain of the ship. She could have acted in it, instead concentrate only on the direction, so that opportunity went to Julia Robers. With George Clooney onboard for one of the main roles, this was one of the best team to work together, as well the film was very enjoyable. So better than what I thought of it and I feel I should have given a better rating. But one thing is for sure that it was made for the people to have a good time, not for the critics morons.\r A real time narration, takes place in one normal morning is a newsroom studio where the financial expert Lee Gates, going to give his advice to the investor where to put their money. But the show suddenly got hit by an intruder when he takes the host as a hostage. He demands some answers from him regarding what he'd said a week ago in the same show, which led him to lose all his money. With this kind of complication how its going to conclude was nicely told with some edgy scenes towards the end.\r Both, Clooney and Julia was good, but it was Jack O'Connell who hand upper hand. He has done some great films lately and now this, I hope he continues his good work. It was inspired by the real glitch that saw in the stock market, but altered to suit the cinematic, especially turning it into a crime-thriller with some powerful characters to deal such an interesting situation made big differences in its success.\r The writing was good, because, it was kind of realistic like what a common man do and his intentions are when he can't understand the terms the experts speak or give the reason for the loss. So there are some pauses like 'what next' kind of stuffs that intentionally did. Despite a serious thriller, there are some funs. Whom you're going to cheer is up to you, but it keeps your head up all the time with its fine pace and developments. This is not the best among you find from this year, but surely a good watch if your purpose is entertainment or timepass,\r 6/10"}, {"rating": "6", "text": "It starts as a weak try at showing a different side of the despicable business world by using a tv program as a way of doing something \"different\". Like I said, it feels weak. However, as the film progresses, it gaigns some heart to it and the performances, especially from Julia Roberts, become fuller. It is not a fantastic film, but its short run-time helps to make it enjoyable enough and even develop some attachment to the characters. Recommendable."}, {"rating": "7", "text": "Money Monster is a solid thriller that plays like something you may have seen in the 90's.  All the performances are unsurprisingly good and Jodi Foster directs the film well.  I just couldn't get super excited about the it, though it's good none the less.  B+"}, {"rating": "6", "text": "Money monster is a tense thriller with a comedic tone following the larger than life terrorist threat on national tv that goes too far. Gripping to watch but ultimately lacking the richer substance found in better examples of the genre."}, {"rating": "9", "text": "A sometimes-implausible but nevertheless taut thriller that never disappoints. Filmmaker Jodie Foster has delivered her best directorial work here, with a nicely paced, well-acted, edge-of-the-seat offering with just the right touches of social commentary, satirical cynicism, comic relief and lessons in responsibility. George Clooney, Julia Roberts and (especially) Jack O'Connell turn in excellent performances in bringing this showstopper to life, one not to be missed."}, {"rating": "7", "text": "Thoroughly entertaining.\r Clooney and Roberts are the stars but Jack O'Connell brings the sizzle. For some reason people expected this one to be more than just a good time on the edge of your theater seat but it's really just a tense and sometimes funny Wall Street Fable and well worth your time and the ticket price.\r I will say that either the three screenwriters or Jodie Foster (whichever had the most to do with the final product) managed to subvert my expectations and surprise me more than once during Money Monster and for that I am thankful."}, {"rating": "8", "text": "Engaging, thrilling, well-scripted, an absolutely entertaining ride of movie! The story's fresh, and the character's are actually quite believable considering the seriousness of the story. Very well done, Jodie! Kudos!\r *****\rRIP, Kyle Budwell."}, {"rating": "7", "text": "In total agreement with the current user score.  Film is far from being a blockbuster but at the same time is saved by the acting of the stars Clooney & Roberts.  All that being said the story was interesting & believable,  Worth seeing !"}, {"rating": "7", "text": "Pretty good movie by the great Jodi Foster, there definitely is some tension and suspense, the performances are fairly good and the pacing is on point. Nothing original or special about it, it is a competent film that does the job if you want to sit back and shove popcorn down your throat."}, {"rating": "6", "text": "Money Monster was really suspenseful but it wasn't that great either. George Clooney kinda looked like he didn't want this role and the film had a twist, which I thought wasn't that great. The plot was kinda confusing and I thought it was boring and it was disappointing. (55/100)"}, {"rating": "7", "text": "This movie has great acting, story that makes you think and the movie is interesting troughout and doesn't have any points where you feel bored. Of course the story itself is not that unbelievably amazing or whatever, but I did like the movie itself."}, {"rating": "5", "text": "This was surprisingly a decent movie. Overall strong acting and it was very intense and it definitely keeps you on the edge of your seat the entire time. But it did kinda feel a little bit like a TV movie aside from the actors in it."}, {"rating": "6", "text": "\"Money Monster\" was a good but not as interesting as expected , also is very vulgar, but the cast was a very strong and very good point movie. George Clooney, Julia Roberts and Jack O'Connell went very well."}, {"rating": "7", "text": "This was an entertaining and unconventional thriller, but I can see how it would not be a hit in the political climate of 2016. It was a bit predictable in the end, but still worth watching."}, {"rating": "8", "text": "With director Jodie Foster and starring George Clooney, Julia Roberts, and Jack O'Connell this is not one to miss. Exciting, suspenseful and surprisingly funny. All the characters work extremely well together and O’Connell effortlessly steals the show. Highly recommended."}, {"rating": "7", "text": "Well, we see a disgruntled man who lost his nest egg on the stock market.  Hello, hasn't he heard playing the stock market is like gambling at Vegas?  Do Americans really put their money down without knowing how to play the game?  Well, okay, they do.  So this movie is really a character study about the TV \"market guru\" and his producer and their on air repartee.  The rest of the plot we've seen in countless other movies."}, {"rating": "8", "text": "Very impressed with this movie but not sure the \"critics\" actually sat down to watch. George and Julia- very good in their parts . Jack O'Connell very good newcomer. Supporting cast solid. Creative (and timely) story line and great direction by Jody Foster. So where are the 100/99/85 scores ? This is a solid plot with 2016 underlying political overtones. The 1% v the average guy. The updated version of \"Dog Day Afternoon\". Some of it is a stretch but..ITS A MOVIE. Its supposed to entertain. The critics are full of **** Go see the movie. You'll thank me in the morning (after you have re arranged your investment portfolio)"}, {"rating": "7", "text": "This was a great movie with great acting. It was so tense,entertaining and a great wall street movie. George Clooney with a solid performance as always."}, {"rating": "7", "text": "-Money Monster is a 2016 American thriller film directed by Jodie Foster and written by Alan Di Fiore, Jim Kouf and Jamie Linden. The film stars George Clooney (who also co-produced) as Lee Gates, a TV personality who advises his audience on commerce and Wall Street, and who is forcefully interrogated by Kyle Budwell (Jack O'Connell), a grief-stricken bankrupt viewer who lost his money after a previous tip; the film also stars Julia Roberts, Dominic West, Giancarlo Esposito and Caitriona Balfe.\r -Principal photography began on February 27, 2015 in New York City. The film was released by Sony Pictures Entertainment through TriStar Pictures on May 13, 2016, received mixed reviews from critics and has grossed over $66 million.\r --Critical response:\r -Money Monster has received mixed reviews from critics. On Rotten Tomatoes, the film has a rating of 54%, based on 196 reviews, with an average rating of 5.9/10. The site's critical consensus reads, \"Money Monster's strong cast and solidly written story ride a timely wave of socioeconomic anger that's powerful enough to overcome an occasionally muddled approach to its worthy themes.\" On Metacritic, the film has a score of 55 out of 100, based on 44 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B+\" on an A+ to F scale."}, {"rating": "7", "text": "Director Jodie Foster adds a comedic twist to the standard hostage thriller genre and while the stakes never seem that high, the movie is still an enjoyable experience. Led by solid performances from the three leads, the movie plays out in real time (sort of) and manages to maintain interest throughout. The movie however only scratches the surface of its broad themes of corporate greed and media irresponsibility and a larger focus on that could have definitely elevated the movie."}, {"rating": "7", "text": "The pace of the film is nice due to the well-accomplished editing. You do not get bored while watching this movie, regardless of the fact that Money Monster is way too ambitious for it's mediocre story, but it is entertaining enough so don't be so hard on it."}, {"rating": "7", "text": "Money Monster tells the story of Lee Gates (George Clooney); the charismatic host of the financial TV show; Money Monster. After Gates tells his viewers to invest in IBIS Clear Capital, the company experiences a 'glitch' in its logarithm and its stocks plummet; costing shareholders $800 million. But not everyone is satisfied with this explanation. Holding Gates responsible, Kyle Budwell (Jack O'Connell) sneaks onto the live show's set and holds Gates hostage; armed with a gun and a bomb vest strapped to Lee. He invested his entire life savings in IBIS and he wants an explanation for his loss. All broadcasted to the world on Live TV, Lee and his director Patty (Julia Roberts) must get to the bottom of the financial crisis before the gunman completes the unthinkable. Espionage, danger, and corruption ensues as everyone does their best to deal with this delicate situation before it's too late...\r I know some of you will be turned off watching this movie due to the financial jargon, and while it would be beneficial to have knowledge of such jargon before you watch this movie, it isn't compulsory to still gain some enjoyment from this film. It beautifully captures the outrage of a stock market collapse combined with the delicacy and tactics of a hostage situation. However, I feel as though Clooney's natural charisma and lighthearted disposition takes away from this delicate situation a little, appearing somewhat too calm under pressure and therefore lowered the stakes.  There's also a reveal about 2 thirds into the movie that decreases tension as well, but from the exterior stays the same. What works best for a movie like this is the tense ambience that keeps audiences on the edge of their seats, and sometimes it went astray from this central ideal. That was where the plot lost me. But when it does have those tense sequences, boy do they do it well... There were also some moments when the plot moved a little slow. This could've been fixed.\r The main cast was few but quality; George Clooney, Julia Roberts, Jack O'Connell, Caitriona Balfe, Dominic West, and Giancarlo Esposito were among those involved. Julia Roberts was PERFECTION. By far the stand-out in this one. She had the perfect manner for someone who would have been dealing with a situation like this in a role like hers if it were to happen in 'real life'. Fantastic. The others all performed, I think, to their expected standards. Clooney, to his credit, expanded his repertoire for this role, but you can definitely see the normal Clooney shining through. I appreciate the effort by Director Foster to blend together differing genres of Comedy and Drama/ mystery. But unfortunately, unlike the unusual blend of Comedy and Horror in The Visit, it didn't work in this form. It degraded the dramatic appeal of the film which was stellar at times.\r The script, soundtrack, and cinematography were all very good and contributed to that tense and dramatic ambience that audiences feed off of. With some luck there will be some award nominations- it certainly deserves a few. To improve, less focus on trying to maintain a lighthearted ambience within a very serious situation, and try to invent more fresh plot twists to invigorate the drama and keep the plot moving quickly. The movie's underlying purpose I feel was to send a message about financial decisions to the target audiences while blending it into an engaging storyline. This was successful, I walked away from this movie knowing that corruption is everywhere and that I should spend my money wisely.\r To finish, I enjoyed this movie a lot. It had some fantastic elements and strengths, but the biggest thing for me as I've already stated that brings down this movie is the attempt to forcefully blend wildly contrasting genres and their moods into this film. Some characters were nonchalant while others were deadly serious. This movie needed to focus all its energy on its strength; dramatic tension."}, {"rating": "4", "text": "I guess when they rate it R they can use the most filthiest language that they can think of. The movie could be so much better without it. It got so bad I almost walked out of it."}, {"rating": "5", "text": "\"Money Monster\" is a very complex (maybe too much), extreme way of looking at Civilians losing it all on wall street investments. It is very fast-paced and gripping when you watch it but, it does not sit well. My respect and liking of the movie gradually went down to almost extreme dislike. At the end, \"Monster\" just turns out to be a John Doe thriller with algorithms."}, {"rating": "6", "text": "A strong cast is wasted on this somewhat forgettable endeavour. With a pretty straightforward plot, the film manages to somehow straddle a near impossible line between serious comedy and carefree thriller."}, {"rating": "6", "text": "As a pure hostage thriller, Money Monster succeeds. Every minute is tense and keeps your eyes glued to the screen. George Clooney and Julia Roberts both provide great performances and the ending is rather unique. However, this film also tries to say something about Wall Street and the media. Rather, Wall Street is bad, corrupt, and full of greedy people. The Media is cynical and only cares about making news flashy, rather than properly reporting it. Also, that the American people are being ripped off by the corporate system. This is where the film falters. Instead of taking a strong stance on these issues, the film handles all of this more or less as satire and the topics themselves are oversimplified. For example, instead of explaining how Wall Street works, the movie simplifies it to \"it's bad and full of greed\". Nonetheless, as a pure simple and, although forgettable thriller, Money Monster works pretty well."}, {"rating": "5", "text": "Comme son titre l'indique, c'est encore un film sur le krach de 2008 et ses conséquences sur les **** épargnants, ceux qui voulaient gratter encore un peu plus, ceux qui ont joué à la bourse-casino et qui ont perdu... toutes leurs précieuses économies.Oui, c'est révoltant mais quelque part, comme le dit si bien la femme de l'imbécile, il faut vraiment être con, très con pour placer ses 60 000 dollars dans ces maudites actions à la godille... Ainsi à cet égard, le film épingle quelques vérités et surtout du bon sens... Cependant, il joue un peu sur plusieurs tableaux à la fois plaire à tout le monde...Le preneur d'otages est largement dédouané par exemple de son acte terroriste et passe pour une victime alors que le patron magouilleur (certes, du classique...) pointe encore une fois la bêtise des épargnants dont la cupidité est sans limite (des rendements à 18%, putain !) car quand \"tout va bien\", on fanfaronne et le \"système\" est parfait ! Bien sûr, tout cela est discutable et sans doute digne d'être discuté mais pas mal de couacs mettent d'autre part à mal la crédibilité de cette prise d'otages, comme Clooney qui devient copain comme cochon avec le terroriste ou bien la mise au jour d'un complot faramineux en moins de 20 mn chrono... ben voyons et la marmotte, elle fait quoi pendant ce temps...Clooney quant à lui s'agite beaucoup mais n'est pas convaincant pour autant ; heureusement Roberts relève sensiblement le niveau. Un niveau très relevé pour la réalisation de Jodie Foster, décidément et agréablement efficace en tout cas. En dehors de ses considérations de justice sociale bien entendu, la prise d'otages est très bien menée.Le film est donc plaisant mais en même temps souvent énervant dans ses raccourcis invraisemblables et une façon d'arrondir les angles sans véritablement prendre position, histoire de bouffer à tous les râteliers. Ce qui ne contentera personne en définitive."}], "recommendations": ["inside_man", "breach", "all_the_money_in_the_world", "primal_fear", "body_of_lies", "morgan", "suburbicon", "knives_out", "state_of_play", "jack_ryan_shadow_recruit", "the_score", "a_most_wanted_man", "widows", "arbitrage", "hell_or_high_water", "lucky_number_slevin", "the_accountant", "good_time", "triple_9", "broken_city", "the_next_three_days", "unstoppable", "man_on_fire", "the_little_things", "solace"]}