{
  "id": 3536,
  "title": "Moneyball",
  "starring": [
    "Brad Pitt",
    "Jonah Hill"
  ],
  "runtime": 134,
  "genre": [
    "Drama"
  ],
  "description": "The story of Oakland Athletics general manager Billy Beane's successful attempt to put together a baseball team on a budget, by employing computer-generated analysis to draft his players.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4yIQq1e6iOcaZ5rLDG3lZBP3j7a.jpg",
  "categories": {
    "plot": 7.6875,
    "acting": 8.1,
    "ending": 5.545454545454546,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.5,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I'm not sure that this is a GREAT film, but it is certainly emotionally involving to this AL West (and Halos)  fan who followed that 2002 season extremely closely for obvious reasons.  The writers and director made and extremely affecting film out of what could have been a dry subject.  I'm left wondering why the heck Paul DiPodesta didn't want his name associated with the film.  Jonah Hill came off as extremely likable.  And Beane has to be happy with the Pitt treatment.  Great choice in casting Activision CEO Bobby Kotick as the A's owner. I think he nailed the guy."
    },
    {
      "rating": "10",
      "text": "A sport's movie that does not follow the cliche of other sport's movies. Easily the best movie of the year. You don't need to love sports to like this movie. Great performance great script great movie!"
    },
    {
      "rating": "9",
      "text": "Although we have seen the subject materiel before about a failing team trying to be good again, and you sit there and wait for the happy ending. Yet, this film is told so intelligently and it makes the film entertaining. The film is helped even more by the pair of winning and charming performances from Brad Pitt and Jonah Hill. I give this film 88%."
    },
    {
      "rating": "8",
      "text": "Not so much a baseball movie as it is the age-old story of someone trying to fight the system/establishment. The acting was great-- but they could have easily left out the main character's family subplot."
    },
    {
      "rating": "9",
      "text": "â"
    },
    {
      "rating": "9",
      "text": "While the book was made more dramatic for film and concentrated more on the relationship building of Billy Beane and a fictional account of his assistant, Paul DePodesta and others into a new composite character, Peter Brand, Moneyball hits every element of a good baseball movie where it should. Right in the heart. A key line in the film is, \"It's hard not to be romantic about baseball.\" Being a die-hard baseball fan, it's hard not only to not get romantic about baseball, but it's also hard not to be romantic about stories like this. While based on a true story, written by Michael Lewis to explain the sabermatic approach that Billy began taking with his previous GM (when he was an assistant), and continued on with Paul, the movie never mentioned the previous GM and began the story of using the sabermatic method after meeting the fictional Peter Brand, played by Jonah Hill. The acting is the best I've seen Brad Pitt do. He was a great fit for this role and I can see why he produced it. He must have thought the same thing. I've heard Oscar buzz about it, but I don't see it carrying that far. He certainly deserves it more than for the Curious Case of Benjamin Button. Jonah Hill plays seemingly the same character he does in every movie, and does it well. And Philip Seymour Hoffman is perfect as a generic portrayal of uncooperative manager, Art Howe, a portrayal in the film and book that the real Art Howe has heavily criticized and blames Beane's disregard for him. Aaron Sorkin brings his skills as a co-writer of the screenplay to dramatize the story very well and make it palatable for non-sports fans, but for those die-hards like me, Moneyball hits all the right places."
    },
    {
      "rating": "8",
      "text": "A good film......not a great film. Yes, it proves to be entertaining and interesting for those who are not huge fans of baseball and all it's tenured history. Pitt does another great job and Hill is really good as well. This is not a boring film by any stretch, and quite frankly I thought it would be. Its not and the dialogue is crisp and full of life and truth. It really does make you care for the on-screen struggles of these characters and it is enjoyable to watch, save for the downer ending....but hey! They can't argue with what actually happened, right?"
    },
    {
      "rating": "5",
      "text": "Moneyball is a film that you could easily misjudge, it is a sports movie and starring by Brad Pitt, how deep can it get? A lot more than what people think. Moneyball teach you that experience does not mean too much when taking a decision. Sometimes you need to take another point of view or a different way, in order to makes things right. This film shows how two men face their ideals and their fear of change, so as to pull out the baseball team of the loser chart. They resort to math and statistics.This team represents the whole life of manager, the players are his family and when he notice that, he decides to forget about the politic of not get involved, because is easier to let them go; and start doing the opposite. Is predictable what comes of that, the team improved.The performance of Brad Pitt is one the best I have seen in years and Johan Hill surprised me, the only problem of the movie is that it is a little bit slow, but when the plot is as original as this one, the speed of the film is not important."
    },
    {
      "rating": "8",
      "text": "This film takes a relatively mundane subject matter and makes a great film out of it.  Pitt delivers as does Hill.  Great soundtrack and stylistic filming."
    },
    {
      "rating": "9",
      "text": "Aaron Sorkin once again takes a subject (baseball upper management) that should not be exciting, and makes it thrilling.  Both a hilarious and interesting look at what goes on behind the scenes in the world of baseball."
    },
    {
      "rating": "7",
      "text": "Really good film! Perhaps a bit overrated, but it does feature a brilliant script from Aaron Sorkin, and solid performances all around, especially from Brad Pitt."
    },
    {
      "rating": "10",
      "text": "OH MY GOODNESS! What a performance, Jonah Hill and Brad Pitt, you literally couldn’t take your eyes off of them, and not because they take up most of the screen time. Brad Pitt delivers his usual sensational performance, and completely deserves his Oscar nomination for this role. Jonah Hill lived up to my expectation, which pleasantly surprised me as I honestly thought he would just suddenly become the kid from Superbad, (don’t get me wrong I loved Superbad but just it obviously wouldn’t suit this film) Hill really pulled out all the stops for this role and I would of given him the Oscar.\r The simple story of Billy Beane and the trust he puts into Peter Brand (Jonah Hill) and their story of seeking out this baseball ‘outcasts’, and putting together an extraordinary team, is surprising rich and easy to grasp. Supported with a strong screenplay really adds to the intensity of the film.\r I really enjoyed the use of archive footage in the film which when put together with the shots of the actors worked really well, and gave the story that extra ump-ff to remind you that this is a true story and this actually happened. Also the attention to detail in this film was superb, the costumes were made to preciously resemble all of the uniforms of the baseball teams which the Oakland A’s took on during the  2002 baseball season.\r I thoroughly enjoyed the experience I felt by watching this film.\r In hindsight I will admit this is not a film which will grab you unless your in the mood for it, it’s not a film that will grab you by the throat and scream at you to enjoy it, it’s not Die Hard. It’s a beautifully crafted masterpiece which creates an emotional connection with you (if you’re in the right mood) and really sticks with you your feelings towards the characters after the film has finished.  This is definitely a film I would watch again and would recommend to anybody."
    },
    {
      "rating": "9",
      "text": "Love \"Moneyball,\" its's a fantastic film.  Brad Pitt and Jonah Hill are fantastic in this and it's just so well-made and so well-acted, with a fascinating true life story."
    },
    {
      "rating": "8",
      "text": "I found this slow movie to be very interesting. It's not a sports movie in the traditional sense, but the economics of it. Well done."
    },
    {
      "rating": "10",
      "text": "As a relative newcomer to the love of baseball  I was really looking forward to this film. It delivered plenty of runs and hits for two hours of error free baseball movie. I've heard it wasn't letter perfect to history but since I didn't know the story going in any discrepancies or liberties taken were lost on me. The tension was palpable just like a good pitchers dual."
    },
    {
      "rating": "8",
      "text": "\"Moneyball\" is a good film. As MarcDoyle said it's not a great film, but it's emotionally involving. Aaron Sorkin does a great job of this. He uses his witty clever words he did in \"The Social Network\" and applies to Brad Pitt, in which allowing him to stand up at his best as Billy Beane, the man who let the crappy Oaklands Athletics team into historical victory. As much as this is a sports movie, it's also a movie to think carefully about."
    },
    {
      "rating": "10",
      "text": "Simply put: The best baseball film ever made.  There are a few scenes in this film that only someone who has played the game for years could depict.  This film is realistic, yet very \"meta.\"  A fantastic film, and the best baseball film ever made IMO."
    },
    {
      "rating": "9",
      "text": "Pretty blown away by this movie. It connects with it's audience on an intellectual and emotional level. It's a movie you need to keep digging into it's depths and in turn, the film will dug into you. Brad Pitt stars in his best role since Babel and should be considered for an Oscar."
    },
    {
      "rating": "9",
      "text": "Based on a true story, Moneyball is a movie for anybody who has ever dreamed of taking on the system. Brad Pitt stars as Billy Beane, the general manager of the Oakland A's and the guy who assembles the team, who has an epiphany: all of baseball's conventional wisdom is wrong. Forced to reinvent his team on a tight budget, Beane will have to outsmart the richer clubs. The onetime jock teams with Ivy League grad Peter Brand (Jonah Hill) in an unlikely partnership, recruiting bargain players that the scouts call flawed, but all of whom have an ability to get on base, score runs, and win games. It's more than baseball, it's a revolution - one that challenges old school traditions and puts Beane in the crosshairs of those who say he's tearing out the heart and soul of the game."
    },
    {
      "rating": "10",
      "text": "THIS IS THE **** Movie EEEEEEEVVVVVVVVVVVVEEEEEEEEERRRRRRRRRR!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "Jonah Hill and Brad Pitt hit a home run with their performances in Moneyball, a great baseball story with heart. Moneyball is about the troubled life of Billy Beane, the coach of the Oakland A's. heartwarming and thoughtful, Moneyball is the baseball film of the decade. Oscar or Not? Oscar: Best Picture, Best Actor, Best Supporting Actor, Best Adapted Screenplay"
    },
    {
      "rating": "2",
      "text": "I enjoyed most of this movie.It was so realistic about the business of baseball. The flashbacks did lend another dimension and enhanced the root of the story. But,  and a big but, the movie was 12 minutes too long. It was a drag at the end and did nothing but bore the audience. I have been to terrific movies where at the end the  audience claps and cheers even though there is no one to receive the applause. The audience was ready to do the same with this one but by the time it ended they had, had it and just left. Too bad, great beginning and a good ending but the add on at the end including the whole song,again, by his daughter.. not good and the scene at Ebbets field was totally unnecessary"
    },
    {
      "rating": "5",
      "text": "Disclaimers first: could care less about baseball and haven't read the book; but I went with a huge baseball fan, huge A's fan and read the book.  So, it was ok movie, enjoyed the phone trading scenes, which I'm told was introduced by this guy. Told it was a good reproduction of the book, so give the screenplay thumbs up.  But overall, it was slow, slow, slow and way too long, far too many shots, long and short, devoted to Pitt's SERIOUS CONTEMPLATION. Ya, got it the first two times.  So, if you like baseball or read the book, go see it. But otherwise, spend your money some other way."
    },
    {
      "rating": "2",
      "text": "Last night I went to Moneyball. I have heard and seen nothing but positive reviews from those who have seen it thus far. It was okay but curiously, for effect no doubt, devoid of any passion or emotion except when Brad threw things around the clubhouse or at home. Everyone spoke very mannerly and low key, very consciously, except for the coach Billy Beane fired who showed a little genuine passion. Perhaps the fact that all was connected to objective, detached statistics on baseball players they decided to play the movie that way, devoid of passion. Personally, I had more passion in teaching one class than was evident in that whole movie. However, having said that, it was an okay rendering of the information on using stats like on-base percentage to determine a players inherent worth to a team. Still, it is very over-rated!"
    },
    {
      "rating": "0",
      "text": "To this day I have never gone to a movie and become so bored that I fall asleep. Moneyball changed that. For the first quarter of the movie I really enjoyed it but then it just dragged on and got really boring. Some laughs, a good cast, a good story but no entertainment value sadly makes this one of the worst movies I've ever seen."
    },
    {
      "rating": "0",
      "text": "this' a boring movie ever! the movie was too long for nothing.this movie almost caused me to fall asleep, they used 50 million dollar for nothing, this' the most worst and terrible movie that i've ever seen in my life."
    },
    {
      "rating": "7",
      "text": "It's the pitching, stupid. If your team has an ace on the staff, then half the battle is already won. Some pop in the bat doesn't hurt either. The Bears, a motley group of little-league castoffs whom no other team in their division would ever pick, only start to win after their beer-guzzling manager Morris Buttermaker recruits Amanda Wurlitzer, a gender-breaking pitcher with a dominant curve(she's pre-Chelsea Baker, the knuckleball phenom) that the ex-professional ballplayer had decided two years ago was all washed-up as a daughter. On-base percentage doesn't win you games, it's the sound of the ball hitting the catcher's mitt, and the umpire calling the batter out on strikes, swinging or otherwise. In contrast to their former starter Rudi Stein, Amanda is Peppermint Patty to his Charlie Brown; she's unhittable; she keeps her clothes on, but the Bears still lose 1-0, because Lupus, f*****' Lupus, that \"booger-eating moron,\" can't hit the cut-off man from left-field, and lets the game-winning run score. It's not all his fault, though. The Bears can't hit. Never mind the homerun, three games into the season, and the team is still searching for their first baserunner. Coach Buttermaker sees his team's offensive deficiencies, and practically invents Moneyball. So embarrassed was Ahmad by his opening game errors to the Yankees that he hid out in a tree(after a half-inning forfeit), still can't get on base, but the coach knows that the black kid is fast, so the drunkard promises to teach him how to bunt. Ahmad's hero should be Malcolm X, not Hank Aaron, because sabermetrics preaches the theory of \"by any means necessary\". In \"Moneyball\", you half-expect to hear a reprise of Bizet's \"Carmen\", when Oakland A's free-agent pickup Scott Hatteberg, previously the catcher for the Boston Red Sox(damaged goods due to a bum shoulder), makes error upon error, as if the converted first baseman was in communion with Toby Whitewood. To manager Art Howe, he's bad news. But GM Billy Beane, acting on advice from his assistant Peter Brand, a sabermetrics guru, thinks Hatteberg can still play the game. Despite not having Ahmad's wheels, Beane's pet project has the ability to get on base. Hatteberg walks. It's a talent which makes him proportionately more valuable than Mariners' leadoff hitter Ichiro Suzuki, because despite his annual 200 hits, the ten-time all-star swings at a lot of first pitches, resulting in a relatively low on-base percentage, the stat that trumps batting average as the real barometer of worth to the new school, founded by Brand's hero Bill James. Hatteberg, therefore, is worth the trouble, so like Buttermaker teaching Tanner the fundamentals of shortstop, it's Ron Washington's job to make people forget about Giambi by turning the ruined catcher into a functional first baseman. (Washington had his own demon: cocaine.) History shows that Beane's gambit paid off(Hatteberg batted .280, and had a fielding percentage of .994), but it's somewhat misleading and downright downright dishonest, narrative-wise, that \"Moneyball\" should cast this role player as the lynchpin to this financially-strapped team's miracle on the field(the A's sported a payroll three times less than the Yankees: $41M to $126M). Contrary to the sabermetrics propaganda of the film, the 2002 Oakland A's did not win a MLB-high 103 games because Beane traded Carlos Pena to Detroit, which, in effect, forced Howe's hand into playing Hatteberg. It was the pitching, stupid. Oakland had three Amandas: Tim Hudson, Barry Zito, and Mark Mulder. Heck, even the last man in the rotation, Cory Lidle, was more relevant than the pitchers \"Moneyball\" makes mention of: Chad Bradford, a submarine middle reliever, and late-season addition Ricardo Rincon, whose acquisition from the Indians inspires such elation in Brand, you would think that Hudson just threw another shutout. Unlike \"The Bad News Bears\", where the Bears face the Yankees, the A's never did get the chance to square off with the fat cats, losing somewhat ignominiously in the ALDS to the Twins(payroll $40M), who are, perhaps, every bit the underdog that Beane's team was, in five games. The real climax to \"Moneyball\", judging by the postscript, occurs in \"Fever Pitch\", when Jimmy Fallon and Drew Barrymore run onto the field in Yankee Stadium after the Sox clinch the pennant(en route to their World Series win over the Cards), since the film gives Beane's methods all the credit. Does Moneyball work? Well, in the 1976 Michael Ritchie film, while the walks and hit batters keep the Bears alive in that final game with the Yanks, it's Kelly Leak's moonshot that nearly wins it all for the overachievers. Some pop in the bat doesn't hurt. Exhibit A: Miguel Tejada, with his 34 HRs and 131 RBIs. Lucky for the A's, he just swung away, walking only 38 times in 162 games. Then again, Leak doesn't accept the free pass and ends up getting thrown out at home plate."
    },
    {
      "rating": "6",
      "text": "Nice drama about a troubled GM Billy Beane who did not make it as a number one draft choice of the NY Mets.  But he went onto have a very nice career as a GM for the Oakland A's having to play with the big boys {big market clubs} working with about 20% of their capital.  He had a chance to become GM of the Red Sox and turned it down to stay with the A's.  All it proves is that he likes to beat his head against the wall because longterm he can never win.  I would have liked to see more character development because he is in a no win situation.  No questioning his passion for the job but the truth is baseball without a hardcap is a flawed product in which 99% of the times only the big markets can win!  Nice acting but otherwise the movie is going nowhere.  It is never explained why he is such a troubled soul?  I would have loved to see his life unfold.  What is the definition of insanity?  To do the same thing over and over and to expect a different result.  Billy can find talent but has no chance of ever keeping it the way the current state of affairs is managed under Bud Selig.  I live in NYC but feel the small markets have been shut out of competing.  How can you continually root for IBM but that is what Yankee fans do every year as they must buy every new toy on the free agent market.  Very sad commentary on true sportsman who love the game on a level playing field.  If Billy had the same tools to work with he is one of the best in the business.  No one doubts that!  Just another movie going nowhere."
    },
    {
      "rating": "5",
      "text": "Brad Pitt stars as Billy Beane, General Manager for the Oakland A's, who was the first to adopt statistical analysis in assembling a baseball team. Against everybody's suggestion he persists on this path and you can guess the results (or you may know, since this is based on fact). This is pretty much Pitt's movie: He produced it and is in almost every scene. He's engaging enough, but it's Jonah Hill's subdued comic partnership that adds some warmth. Otherwise, it's a non-stop, one-note drive for a man to achieve his vision. While there are a few sports scenes, most of this features people sitting around talking. While it's interesting to watch the narrative unfold, it's never moving or exciting, just flatly informational."
    },
    {
      "rating": "7",
      "text": "Yet another sports film, but at least it isn't about boxing like the last few.  The story is simple, manager Billy Beane of the Oakland Athletics decides to put together a team of supposed misfits using statistical analysis instead of the usual methods because their small market team can't afford the expensive players.  There is a side story showing him with his daughter that adds absolutely nothing to the movie at all - I guess it was put in there to try and get women to see the movie.  It is well written and acted throughout, although there are slow moments.  I have to say, however, I was really happy at the ending.  For most sports movies there is a team or person who is considered the underdog and they come back and win it at the end.  That did not happen here (not a spoiler since the story is based on a real happening and the Oakland Athletics did not win that year).  Overall a decent day at the movies but won't be a blu-ray purchase for me later."
    },
    {
      "rating": "5",
      "text": "Not a bad movie but not unique either.  I was hoping Moneyball would tackle the obvious problem that baseball is absurd with no spending cap.  Instead it was a pretty basic story about a ball club who builds an unlikely team using statistics.  Low intensity type of story with been-there-seen-that characters. Pretty white bread, toast-no-jam kind of story. The irony is that the ending praises the Red Sox for winning with Beane's system when actually the year the Sox won the series they had the SECOND HIGHEST PAYROLL IN THE LEAGUE so you can forget all that b.s. Nice try."
    },
    {
      "rating": "7",
      "text": "Equipped with a deftly slick script, deluges of heart and tenderness in the most latent instances of banalities, ballasted by a winsomely charismatic Pitt, is 2011's \"Moneyball;\" the biopic sports drama that keeps the jargon and economic talk terse, and brings human nature to the forefront. What emerges, is a film about life, laden with its struggles, challenges, losses, and triumphants, with baseball, inconsequentially as its backdrop. For the ardent sports enthusiast, much of the \"art\" of the game is captured, however, it is presented in a manner that is near the fringes of condescension and whose suspension of disbelief and disregard can become offensive to witness. Moreover, the story (albeit \"true\") is deliberately told in fallacy in order to dramatize the truth (can't forget it's Hollywood). This is specifically true in the ball club's roster, of which wasn't as aggregated with misfits as the film suggests. Nevertheless, \"Moneyball\" is a tale that is told with passion, diligence, and finesse, (Zaillian and Sorkin) thanks largely in part to Pitt's amiable character and delivery. While the errors in the film will be hardly noticeable to most, it is certain that the film will leave many thoroughly entertained and ready to dust off the old mitt and get the shoulders warm for throwing. It's bound to earn one's admiration far past the seventh-inning stretch; no stops to concessions for this one."
    },
    {
      "rating": "8",
      "text": "I really tried liking Moneyball, but in the end I couldn't succumb to this. I'm obviously in the minority who didn't enjoy this film that much, but I can admit it was a well meaning film and Pitt gives a decent performance. Despite what people may say, the movie does go into detail with baseball and its statistics. Its easy to assume that a sheer lack of interest in baseball contributed to one's dislike for Moneyball, but that's not the case, it goes a little deeper than that. The story seemed a bit formulaic and the movie was quite longer than it needed to be. It had some sharp dialogue work, but the movie on a whole didn't 'wow' me in any way."
    },
    {
      "rating": "9",
      "text": "The film is hard to describe. I think the best word is \"great\". It's not as good as Aaron Sorkin's last writing achievement, \"The Social Network\", but it still is a hilarious and shocking screenplay. Brad Pitt basically carries the film, with his wingman being Jonah Hill. The other cast members provide chuckles, and it's basically a great film from the writer of \"Social Network\" and the original writer of \"The Blind Side\". Oh, and for Brad-Pitt-Action-Star fans, he does throw chairs around."
    },
    {
      "rating": "5",
      "text": "I really enjoyed the movie and Brad Pitt is excellent.  The problem I have with the movie is I have the disadvantage of actually knowing something about the 2002 Oakland A's.  The film is dishonest because it willfully overstates the impact of a few baseball scrubs and completely ignores the great players the A's already had.  Not only that it willfully misrepresents the fact that Jeremy Giambi (Jason Giambi's brother) played in 124 games for the A's the year before in 2001!  He wasn't a new discovery.  How could the filmmaker not even mention that the A's had one of the best pitching staffs in baseball in 2001 and they were back for 2002:  Barry Zito won 23 games in 2001 and won the Cy Young Award as the league's best pitcher, Mark Mulder won 19 games, Tim Hudson won 15 games.  They are literally never mentioned in the film!  Miguel Tejada is barely mentioned and he was the League MVP batting over .300 with 34 home runs and 131 runs batted in.  Eric Chavez is never mentioned and he hit 34 homers and drove in 109 runs.  David Justice, meanwhile, was kind of a wash out and Scott Hatteberg was important to the team--but, certainly there was already a key group of players in place.  Also, the concept of on base percentage was not new...and the previous A's general manager Sandy Alderson was instrumental in using statistical analysis before Billy Beane arrived.  And, Johnny Damon had had a terrible 2001 season, so letting him go was not without reason anyway.   Also, the Minnesota Twins, who beat the A's in the playoffs, had virtually an identical small payroll and continued to be a more competitive team than the A's over the next decade.  So, my main problem with the film is not to say that the \"moneyball\" approach didn't do anything for the A's--it did.  But, it didn't do everything and they were not alone in using statistical analysis to discover value.  But, that's Hollywood--overstating and making things black and white is their specialty.   Brad Pitt is really getting to be a much better actor as he ages though--he's excellent in the movie."
    },
    {
      "rating": "9",
      "text": "I know little to nothing about baseball and was deeply moved by this film. This movie is, for me, about failure.How to embrace the success that can come from lessons learned through failure?Brad Pitt is on a roll of fine, strong performances and fills the space of Paul Newman and Robert Redford."
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie, as a fan of baseball, I can appreciate this movie. I get the point of this movie when mos people don't. You have to like baseball though. The feel of the movie had it down pact. The actors did their part so well that you could tell the distress and the sense of urgency that they needed when the going got rough. Brad Pitt continues to impress with perfect emotion, as well as Jonah Hill making good work of his supporting actor role."
    },
    {
      "rating": "10",
      "text": "I would have never imagined a movie whose focus is the dialogue would be so great.  Writers and screenplay directors here are geniuses. Pacing is great,  ending is great!"
    },
    {
      "rating": "0",
      "text": "WOW> I dont understand the critics and their mentality. I went for this movie after reading all the positive review. This was was fuc***ing boring. It was so slow and that I actually slept during the movie for about 5 - 10 minutes. This happened to me for the first time ever. I am sure that this movie will win the oscar. After all oscars are meant for such boring movies. eg - Kings speech over the social network or Inception, Hurt locker over Avatar, Slumdog millionaire, etc..."
    },
    {
      "rating": "9",
      "text": "Brad Pitt and Jonah Hill fuel this incredibly acted, fun, feel-good baseball movie. Brad Pitt definitly deserves at least an Oscar nomination for his strong performance."
    },
    {
      "rating": "10",
      "text": "The movie could have ended on a more subtle note, but this is one of the very best films of the year. brad pitt (with The Tree of Life) proved to be THE actor of the year. The editing is PERFECT and ofcourse a screenplay with Steve Zaillan and Aaron Sorkin as the writers will be great. I hope Bennett Miller does not wait 6 years for his next film! This is how mainstream Hollywood produced films should ALWAYS be, it is said we live in a time where this is considered a masterpiece.(But it really is great though)"
    },
    {
      "rating": "10",
      "text": "Excellent and capital movie. The movie is about baseball but also about the right and fair evaluation of performance and individuals. This means looking at FACTS as best as you can. This is valid for sports, your job, you car insurance, your mortgage, etc...A movie those rating agency, presidential candidates, stock traders who only act on rumours should obviously watch. A must see movie for the credit crunch generation."
    },
    {
      "rating": "6",
      "text": "do not know what to write about it. It's pretty much a baseball movie .So when you are watching this movie , you should know a bit about baseball, which I don't know ,so i did not enjoyed it a lot. Only positive thing in here is--brad pitt."
    },
    {
      "rating": "9",
      "text": "major league version of 'Social Network', and also, ending scene might be remembered as one of the best."
    },
    {
      "rating": "8",
      "text": "Really enjoyed this movie. It was a sports movie, but not your typical formula. I thought it had a ton of references that only a hardcore baseball fan would understand, but saw the movie with someone who knows nothing about baseball and they still enjoyed it and got it. Really think Brad Pitt was perfect for this role. He's usually solid in everything, but this might be one of his best performances. Truly believed him as Billy Beane."
    },
    {
      "rating": "8",
      "text": "David doesn't slay Goliath in Moneyball, a smart and entertaining film about the business of baseball, but he finds a way to compete in a game that has an incredibly uneven playing field.  Brad Pitt and Jonah Hill turn in excellent performances in a film that serves as a stern reminder that there will always be small teams scraping to compete but that the big teams will always have the upper hand.  The fact that this seemingly dull concept results in a deeply engaging and surprising moving film is one of the minor miracles of 2011."
    },
    {
      "rating": "4",
      "text": "Simply put, the movie was not that good.  There was nothing new about this movie I have not seen before and the movie was slow for my taste.  Over-rated and not worth a purchase but maybe a rent."
    },
    {
      "rating": "6",
      "text": "I liked it, but honestly can't imagine it holding the interest of anyone who's not a big baseball fan. I have to attribute many of this film's accolades to a not-completely-rational adoration of Brad Pitt and Aaron Sorkin. (An Oscar nod for Jonah Hill? Really?)"
    },
    {
      "rating": "8",
      "text": "What a well-done, well-cast picture.  Not about baseball per se but about the underside that we don't get to see.  Brad Pitt was perfect in and for the role of Billy.  Philip Seymour Hoffman again shows us why he the consummate actor.  One distraction.  I could not stop looking at a maturing Brad Pitt and seeing a younger Robert Redford.  WOW.  Facial expressions, cragginess at the eyes, mannerisms,  They need to do a picture as father-son."
    },
    {
      "rating": "8",
      "text": "Very good movie about something that is very real about baseball.  Professional baseball is different than any other sport, in the sense that some big market teams truly outspend the small market teams.  The movie does a nice job in making this point.  However, it grossly oversimplifies what Moneyball really is, it is not only looking at OBP (on base percentage), as the movie implies.  It is also a movie; it is not historically accurate in a number of ways.  But neither of those flaws detract from the movie being enjoyable.  Brad Pitt is fine playing a good looking ex-jock and Jonah Hill does a nice job playing a made up character (as the person who really was Beane's assistant refused to let his name be used, which led to Paul DePodesta's \"role\" being played as an overweight nerd).  Phillip Seymour-Hoffman is perfect as manager Art Howe, who the movie vilifies (as it also does to scouts).  Perhaps that dichotomy is the biggest weakness of an entertaining film:  creating tension by making the good guys really good and their enemies seemingly (and at the same time) stupid, vicious and mean.  But that's movies for you.  Still an enjoyable film that is worth seeing."
    }
  ]
}