{
  "id": 1011,
  "title": "Monster House",
  "starring": [
    "Mitchel Musso",
    "Sam Lerner"
  ],
  "runtime": 91,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "description": "Monsters under the bed are scary enough, but what happens when an entire house is out to get you? Three teens aim to find out when they go up against a decrepit neighboring home and unlock its frightening secrets.",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zCRPr4bkO3ae0U1134vJ39xZnAG.jpg",
  "categories": {
    "plot": 7.407407407407407,
    "acting": 7.125,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 8.333333333333334,
    "familyFriendly": 6.75,
    "funny": 8.0,
    "action": 7.555555555555555
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The perfect animated film and my favorite film of 2006. So much fun and so many levels of artistic genius behind the great story and dialogue."
    },
    {
      "rating": "8",
      "text": "\"Monster House\" apresenta-nos visuais impecáveis, uma narrativa genial e segura e personagens interessantes. No geral, podemos dizer que é um agradável filme animado de terror.8/10"
    },
    {
      "rating": "10",
      "text": "Monster House ok this is one of my fav movies of all time also it is my fav animation movie the characters is great in this movie the kids are entertaining to have great jokes in the mix so DJ is concerted that the house is real while he keeps stalking it while his friend Chowder are doing the same thing besides that he does not want to do any of the crazy things they have to do to try to kill the house or go inside of it to try to figure out what is happening Jenny to me is an ok character she is not that interesting she is kinda their to give Chowder to do what she wants to do odd way to go with Chowder and her Nebbercracker as the villain is great his performance is great and his wife is the one controlling the house because she is kinda like a supernatural ghost which is odd but is awesome the house looks awesome this is the most beautiful of animation I seen over the years and that is saying something I think this movie is very good I wish they was a sequel to see what the characters been doing sense that trama sadly did not get one I know it would not have been good as the first but I still would of seen something like is said what happened after the troma of this the ending is awesome the house get's out of the area and gets angry starts to try to kill all of them also the ending where  Nebbercracker and his wife dancing was cool after when the house blew up this movie is great I would recommend everyone to see this movie I love it so I give Monster House an A"
    },
    {
      "rating": "6",
      "text": "It's a average blockbuster adventure animation you'll love to see with your kids in a sunny day. Robert Zemeckis does a fine job overall for \"Monster House\", but I expect more from him."
    },
    {
      "rating": "4",
      "text": "Monster House leaves no scares.\rA very average script filled with udder nonsense. The movie feels long and pointless all winding down to a ludicrous ending that really leaves the film nothing to work with."
    },
    {
      "rating": "10",
      "text": "Um dos filmes que eu mais amei na minha infância e assisto até hoje. Pode até dar um pouquinho de medo. A animação é bem feita,tem personagens legais e assombração ilícita,na qual eu amava e amo."
    },
    {
      "rating": "9",
      "text": "Chilling, creative, funny. I was in love with this movie the first time I saw it as a fifth-grader. The title may drive some viewers away, but they made it work-- pretty damn well!"
    },
    {
      "rating": "7",
      "text": "its scary, but perfect"
    },
    {
      "rating": "4",
      "text": "I didn't enjoy this movie, the plot was nasty, unlike Shrek for example Monster House is not a family movie it's a small kids and babies movie."
    },
    {
      "rating": "3",
      "text": "While there was some cleverness, the characters were shallow and predictable, and the entire absurd movie seems to exist as nothing more than part of a marketing scheme for what will undoubtedly be the next great ride - Monster House - at Disney World. Nothing about this film is exceptional, and there are parts that I would call just a little twisted."
    },
    {
      "rating": "5",
      "text": "Great graphics. Not the best or funniest animated movie. The last part was a bit exaggerative but the rest was fairly good."
    },
    {
      "rating": "7",
      "text": "The movie is an average animation with a tiny bit of fright for the children. It has a basic but good story to it, and has some funny moments, along with some creepy ones. This is not a horror movie, it is a comedy animation, yet there are some scary scenes for the children. Not really scary, just a bit. It's a good movie, but it isn't anything better than an average animation. Great fun to watch however, as it is a good movie overall."
    },
    {
      "rating": "7",
      "text": "It wasn't quite what I expected, but this movie has a somewhat cool premise and many great characters. One good thing about it is that it isn't just a Halloween movie. You can enjoy it on other occasions."
    },
    {
      "rating": "7",
      "text": "Terror and animation, a great combination."
    },
    {
      "rating": "7",
      "text": "Monster House actually isn't such a bad movie. Kids will enjoy it , and there are enough scares and some more adult material that parents won't be bored. Zemeckis does a fine job directing, and proves he can master animated as well as live action films once again."
    },
    {
      "rating": "7",
      "text": "Great designs and original story this movie is one of the best of the year.The idea of an haunted house is not original but the context and what the house is doing in this movie,it's pretty awesome"
    },
    {
      "rating": "7",
      "text": "A very decent movie! I liked it as a kid and it was very fun to watch. It has been an annual event to watch this movie every Halloween. I do want to ask though.... about the ending (SPOILERS)...WHY DOES NO ONE SEE THE GIANT MONSTER HOUSE STOMPING AROUND THE NEIGHBORHOOD?! Seriously!"
    },
    {
      "rating": "6",
      "text": "Cute movie, but it didn't live up to my expectations. The kids love it and it would be a great Halloween movie for them."
    },
    {
      "rating": "9",
      "text": "This movie has so many good qualities, and leaves 90% of animated movies in its wake. The camera angles are well thought out, and give a real live-action feel to the proceedings. It has some really intense moments (I'm 28). I thought it would be too scary for kids, but the 8 year old I was with didn't find it too scary, she loved it. The story is unpredictable with a very gruesome explanation of why the house is a monster. When I watched it, I felt like they were taking some chances and didn't smooth over all the rough edges. As stated, the voices are amazing, especially Jason Lee and Steve Buschemi. This movie reminded me a lot of Goonies. Really hilarious, but with some real scares. Heartwarming. Impressive. Nothing better this summer. Amazing. I loved it."
    },
    {
      "rating": "8",
      "text": "This was much better than most reviews gave it credit for. Very entertaining, with amazing effects and solid voice work. Character development and plot leave a bit to be desired (really no arcs to speak of), but you get what you pay for and then some. As far as the kids, they'll be scared for sure but anyone remember watching \"The Witches\" or \"Are you Afraid of the Dark?\""
    },
    {
      "rating": "9",
      "text": "top notch animation ... hilarious comedy that adults and kids will laugh out loud to and a completely original story line that'll please everyone! I thought it was great!"
    },
    {
      "rating": "8",
      "text": "That house scared me more than anything in \"The Omen\", which is why \"Monster House\", perhaps, should've earned a PG-13 rating. It's a truly malevolent creation that has no reservations when it comes to killing children. Sometimes the action is intense(like \"Indiana Jones and the Temple of Doom\"), sometimes it's just loud(like \"The Goonies\". The three pre-teen kids are pretty decent facsimiles of kids we've seen in past amusement park ride-like films of yesteryear, so the danger they court is surprisingly fun, and not at all headache-inducing. The voice-work is excellent, especially the babysitter played by Maggie Gyllenhaal."
    },
    {
      "rating": "7",
      "text": "Solid, but not exceptional work. Not the least bit scary (except, maybe if you're a little kid), but entertaining, with some laughs, and well-written characters. It does get a little carried away with the action at end, making it feel a little too much like just another action movie (although, an animated one) at that point. And how does a house does all the shape-changing this one does, in a surburban neighborhood, without ever being noticed. Maybe a minor question, but one that festers thoughout the movie. Might have been more effective if house was more isolated."
    },
    {
      "rating": "6",
      "text": "I saw this moive 3 weeks ago and u know what it isnt as good as it looks to me the previews of the moive made it look much better than it actullay is."
    },
    {
      "rating": "8",
      "text": "Loved it! This film reminded me of all of the things that scared me when I was a kid. It was a great choice for the group of preteen boys I took with my son. Glad we sent the 2nd grade girls to a different movie, it would have been too scary for them."
    },
    {
      "rating": "9",
      "text": "A fantastic animated feature that unfortunately went underrated or over the heads of most who saw it. This is one of the few films that really seems to understand what pre-pubescent boys are like, and captures it perfectly in a very imaginative setting, with a true visual style. The kids are likeable and unprecocious, and their comedic timing is perfect. The performance capture also makes for some incredibly expressive animation, not to be missed. Also, I have to laugh at the reviewer who figures this is all a marketing scheme for a Disney ride - which is pretty funny considering it was made by Sony."
    },
    {
      "rating": "6",
      "text": "This was a very good movie - except for the one and only fatal flaw I'll mention later. It strikes a nice balance between faux-realism (Sky Captain) and talking whatevers (every other CG movie). The visual styling acheived through performance capture is a very creative, unique, if not over-the-top approach - and actually done well. It certainly adds a layer of organic quality to the acting that most other CGI films miss. Nevertheless, it doesn't skimp on top-tier animation. Like most, it does a nice job retaining the beleivable faux-filmed shot effect, but differentiates again by doing so with zero motion blur. A rare but cool effect. The only problem is that it reveals the limitations of standard 24-30FPS frame rates. That'll probably be coincidentally addressed as soon as HD replaces most DVD players. The characters were expectedly a bit stereotypical, but seemed offset by the convincing dialogue exchanges. They actually made the idea of PG-rated horror targeting kids work without feeling too sappy and calculated for adults, for the most part. While capturing the aspects of live action horror better than expected, it certainly wasn't too scary, crude, or gruesome for children. That wouldn't be true had the same scenes been shot with a real-life quality. Its not as family oriented as anything done by Disney/Pixar, but that's all they do albiet well - why should EVERY CG movie be THE SAME sappy family adventure with these calculated infallible performances that avoid ever sounding like a conversation any real person over 8 could ever relate to? I'm not saying Disney's are bad, on the contrary, but enough critcism that others don't immitate them. I'm still waiting for more PG-13 and (oh my) an R-rated CG movie that follows more along the lines of the anti-family-appeal types such as Antz or Shark Tale. The only thing that made this a 6 out of 10 vs. a 9 out of 10 - warning: [***SPOILERS***]: the ending. At the point where I knew the credits were about to roll, I was sure that nobody that was shown getting killed had any chance of coming back. They were all throwaway characters that deserved it. It was clear the ending would have no stupid epilogue or open ending, so it had NO reason to give any explanation as to what happened to the deceased and how that would affect their community - let people think a little bit. The ending, of course, was cheery in regard to main and uninvolved characters surviving. If any that didn't deserve it in context had died, it would've been quite innappropiate for children. Actually the ending I almost got made far more sense than most live action films that go the other way and overemphasize this unnecessarily grim or unbelievably stupid ending as if trying to pull one over people. I was so glad it didn't do the cheesy, predictable thing that only a true bubble-gum-pop kid-flick that barely cost a few million bucks to make would have any right to do... until it did! Until this, I'd though this movie was above and beyond that worthless tripe. All the characters that died in the movies time frame was resurrected without having learned a single thing. The first was a VERY convincingly portrayed stereotypical drunk stoner drop-out, that has to exist and get killed in every real horror film unless developed any further than that (in which case they still tend to get slashed). So what kind of message is this conveying? I'm confused. They took as much liberty as PG-rating could've possibly allowed by having the clearly underaged \"bones\" hammered while making abusive sexual passes. Add an F-word to that scene and the MPAA would've been questioning if that scene deserved an R-rating. This complete inconsistency really undermined the entire premise that the house was ever something to fear, and that the movie wasn't a total waste of time. If you can pretend this wasn't part of the movie, its still good. Take my advice and hit the stop button as soon as you hear the credit roll coming. Your kids will thank you."
    },
    {
      "rating": "7",
      "text": "This was more like 6.5, but I rounded up. Chowder got me laughing and there was some intrigue to the plot, until the flashback sequence. After that, it was more or less \"scare\" by the numbers. I don't have children, but I agree with Michelle C. about this movie having too many inappropriate scenes for a rating of \"PG\". Uvula, anyone? Stay through the beginning of the credits, if you must see this in the theater."
    },
    {
      "rating": "4",
      "text": "The language was not appropriate for young children. It was scary and not suitable for any child under 10. A huge disappointment!!!"
    },
    {
      "rating": "8",
      "text": "the movie was entertaining, true. However, since it was a children's movie, it was rather short and some of the plot was not evaluated enough, in my opinion. However, it was cute, funny, and good for a weekend show. I recommend it."
    },
    {
      "rating": "9",
      "text": "It was better than expected,a heavy thundrestorm rolled thru our area,temporarily shutting down the projector 3 times.Hearing the storm outside made it even scarrier for my children, thought it was unique."
    },
    {
      "rating": "6",
      "text": "pace yourself when seeing the film ....for one their is pleanty visual galore and some pretty funny scenes but the film fails to continue with that childhood charm that engages you in the first 20 minutes of the film its lost or held back i wont spoil the film but really it should of been thought out alot more that what turned out...another thing the house is the lead and then we end up seein not more than what is featured in the previews ...i wanted to see more ....it will be fun for kids under 7 a lil scary for those but def. not the film the ads promise a dissapointment."
    },
    {
      "rating": "9",
      "text": "Great fun. A throwback to 80's movies that actually depicts children as they really act (and talk). I took my 5 year old, and I found nothing innapropriate language wise."
    },
    {
      "rating": "9",
      "text": "Extreamly well done, with a fun and exctiting story line. If you have a chance to see it in 3D as I did, do so. It's worth the extra dollar for the glasses."
    },
    {
      "rating": "8",
      "text": "Monster House is a very strange movie. It's definitely not a kids movie, but it's also not a not-kids movie. I guess it really does throw back to the old days of \"kid movie,\" like E.T. and Goonies. The script has some of the worst writing I've ever seen/heard, but the CGI cinematography is the best I have ever seen ...ever. So I think it's worth it just for that. They really push the envelope in terms of camera in the 3d environment."
    },
    {
      "rating": "10",
      "text": "This movie was surreal - this awesome animation was impressive. The animation was detailed enough to capture the characters as if it were live action. It was edgy enough for the older audiences without losing the kids' interest. Loved it!"
    },
    {
      "rating": "10",
      "text": "Easily the best flick of the summer, Imaginative, creative, unique and most importantly entertaining. Should definatly pass the test of time like the best young adult movies, notice I said young adult as this is a very intelligent movie for smart kids not kids who are easily entertained by most of the children's crap out there. Definatley in the same league as the \"Goonies\" and \"Monster Squad\". Maybe even better right up there with \"Beetlejuice\" and \" the wizard of Oz\". Highly recommended, don't miss it in the theatres the sound quality and picture are also amazing. Also like to note featuring some of the best voice acting which is the new rage in the last couple years hands down."
    },
    {
      "rating": "7",
      "text": "A decent enough story (one that cleary was a product of Robert Zemeckis), and one of the most interesting styles of animation today combine to make an entertaining movie. But some of the voice acting (such as Jon Heder and Kevin James) feels both unnecessary and forced."
    },
    {
      "rating": "3",
      "text": "Yet another dull, samey CGI to add to the ever growing list. The script was terrible, and the characters were souless."
    },
    {
      "rating": "9",
      "text": "I enjoyed this movie. It reminded me of a flashback to when I used to watch \"youth\" intended movies as a kid. The focus on kids on an Adventure, without the help of adults and being the underdogs. Some potty humor, but a lot of stuff that just went back to basic actions or thinking patterns of ordinary kids. The story was great, and not hard to follow, although it did get a little far-fetched at the end, but who doesn't like a good over-the-top ghost story. I do. Thumbs up."
    },
    {
      "rating": "6",
      "text": "Wacky and funny, but some parts can be quite dull and confusing. The characters were ok. I liked the gamer guy and the cop played by Nick Cannon. One last question: WHAT\"S UP WITH THE CRAZY, FAT CIRCUS LADY?!!! Anger issues"
    },
    {
      "rating": "10",
      "text": "One of the best and most original films of the year. It's ability to go from moments of quiet wonder and human comedy to enormous action set-pieces is astounding. The animation is sublime, though my reaction to it may be an account of having seen it in the impressive Digital 3-D. Hopefully, this will become a Halloween Classic"
    },
    {
      "rating": "9",
      "text": "Yes, this is probably too scary for children younger than 9 or 10, that's why it's rated PG! Why do people think that just because a film is animated that it's a Saturday morning cartoon?! Anyway, I think this movie is beautifully done and thouroughly enjoyable."
    },
    {
      "rating": "9",
      "text": "Great story, lots of jokes for adults. Sound can be a bit overwhelmingly loud, but other than that, completely entertaining."
    },
    {
      "rating": "9",
      "text": "Anaimation was first rate, as was the story line. Well worth the $10 to see the movie. Why parents would bring three and four year olds to a movie called Monster House is beyond me. Definitley a movie for over-ten year olds. Can be very scary for kids at times. More of an adult movie, and very enjoyable. Go see it, without your young children."
    },
    {
      "rating": "5",
      "text": "There was really nothing terribly wrong with this movie but at the same time it really didn't move me. At times it seemed to touch on a deeper message but almost came across as prejudice in a way. Some movies for some reason have soul others do not no matter how good the Special effects and acting may be. Maybe if I was a preteen, having not experienced so much life this movie would be all the more entertaining. So I guess my advise would be is you are an adult with semi-refined tastes, having seen a lot of movies, don't see this one unless you have little choice. This was the case with myself as the movie was a kind of a pre-meet for a potential dating situation."
    },
    {
      "rating": "5",
      "text": "Harry, Ron and Hermione somehow find themselves cast in a nonsensical cartoon about a big scary house that terrorises a whole neigborhood without any adults seeming to notice. A ludicrous plot, uncanny valley facial expressions and multitude of wtf moments. The only funny characters in the whole film are the two cops, and the only funny part was the dog urinating over the halloween pumpkin at the very end."
    },
    {
      "rating": "8",
      "text": "One of many animated films released in the summer of 2006, \"Monster House\" does a fine job of standing out in the crowd as a pretty great film. It's wonderfully designed, smart, inventive, exciting and well-written, all the things you'd expect out of a film with Robert Zemeckis's involvement. Looking for a good Halloween film that tends to get lost among the others? Look no further than \"Monster House.\""
    },
    {
      "rating": "8",
      "text": "Although the cast is not anything special, I think the actors did a good job to embody the characters . The script is well written and has scary moments (not very own for a child under 10 years) , suspense moments , but also funny moments . The final part where the three main characters and Nebbecracker are persecuted by Constance / house spent a little overboard but overall the movie is quite appealing ."
    },
    {
      "rating": "7",
      "text": "Monster House was one of my favorite movies , the plot, the characters and the rest except that I did not show fear , perhaps some scenes but not reactions , but that sympathy for film fans like me."
    }
  ],
  "recommendations": [
    "hotel_transylvania",
    "the_croods",
    "hotel_transylvania_2",
    "goosebumps",
    "the_house_with_a_clock_in_its_walls",
    "paranorman",
    "ice_age_the_meltdown",
    "the_angry_birds_movie",
    "turbo",
    "the_lego_movie",
    "incredibles_2",
    "cloudy_with_a_chance_of_meatballs",
    "coraline",
    "chicken_little",
    "the_tale_of_despereaux",
    "monsters_vs_aliens",
    "wonder_park",
    "ice_age_dawn_of_the_dinosaurs",
    "the_smurfs",
    "minions",
    "meet_the_robinsons",
    "ice_age_continental_drift",
    "goosebumps_2_haunted_halloween",
    "cloudy_with_a_chance_of_meatballs_2",
    "hotel_transylvania_3_summer_vacation"
  ]
}