{
  "id": 620,
  "title": "Monsters University",
  "starring": [
    "Billy Crystal",
    "John Goodman"
  ],
  "runtime": 104,
  "genre": [
    "Animation",
    "Family"
  ],
  "description": "A look at the relationship between Mike and Sulley during their days at Monsters University — when they weren't necessarily the best of friends.",
  "releaseYear": "2013",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/y7thwJ7z5Bplv6vwl6RI0yteaDD.jpg",
  "categories": {
    "plot": 6.470588235294118,
    "acting": 6.421052631578948,
    "ending": 6.777777777777778,
    "soundtrack": 9.0,
    "cinematography": 7.0,
    "familyFriendly": 6.666666666666667,
    "funny": 7.235294117647059,
    "action": 7.111111111111111
  },
  "reviews": [
    {
      "rating": "8",
      "text": "An almost return to form for Pixar after the disaster known as Cars 2. While MU isn't the best pixar movie, and most likely due to the lack of Boo, it provides  solid, cute entertainment."
    },
    {
      "rating": "9",
      "text": "An amazing follow up to the classic Monsters Inc that will leave you wanting more! The soundtrack is great! And the story line is awesome. No matter your age, you will love this movie!"
    },
    {
      "rating": "7",
      "text": "For Pixar, Monsters University stops the bleeding. In the wake of two disappointing films, 2012's lackluster Brave and 2011's misfire Cars 2, the animation company has returned to solid footing with a prequel to their 2001 entry, Monsters Inc. Although there is undoubtedly a financial foundation for mining past successes, Monsters University is nevertheless a charming, family friendly endeavor and, although it falls short of the best Pixar has brought to the screen over its long association with Disney, it's nevertheless worth a trip to the theater, especially for kids.\r As was true of Monsters Inc., Monsters University gets most of its mileage out of the atypical friendship between the big, furry Sullivan (voice of John Goodman) and the little green Cyclops Mike (Billy Crystal). Since Monsters Inc. effectively wrapped up going-forward story possibilities, the creative team elected to go the prequel route, so this is the tale of how Mike and Sullivan met, overcame an initial rivalry, and became friends. Although pitched at a level that won't bore adults, the film's content is kid-centered, complete with life lessons about the values of friendship, cooperation, and believing in oneself and others.\r Monsters University's plot thrives on predictability although there is a moderately surprising twist toward the end that allows the proceedings to extend by about fifteen minutes and provides an opportunity for a little more depth. For adults, the movie is less about narrative than enjoying the back-and-forth repartee of Mike and Sullivan, who have all the chemistry of, say, Felix and Oscar. These two are mismatched buddies in the classic sense and Billy Crystal and John Goodman have no difficulty sliding back into the roles they originated a dozen years ago. And, although Monsters University will appeal strongly to young viewers, it's not juvenile in its approach or content. As a result, those who enjoyed Monsters Inc. as children need not be ashamed of being \"uncool\" by watching Monsters University in their teens. (G-rated movies are generally shunned by anyone over age 12 who isn't a parent.)\r Computer generated animation has long since reached a plateau level where the artwork results in the kinds of \"oohs\" and \"aahs\" that it once did. We rarely notice the richness of detail evident especially in the background the way we once did because every animated film boasts this - it's expected. Monsters University maintains the standard of quality expected from Pixar although, as is too often the case, the incorporation of 3-D is of dubious value. Seen in 2-D, this is a bright, cheerful motion picture. The tradeoff for getting things to pop off the screen is that the colors aren't as vibrant. I feel like a broken record making this comment: some animated films benefit from 3-D but it's hard to argue that Monsters University is one of them.\r Pixar's decision to develop some of their most popular movies into franchises hit a rough patch when Cars 2 failed to perform up to expectations. Monsters University, however, makes the argument that this may have been an unfortunate exception. Although the second Monsters movie won't challenge Toy Story 2 or Toy Story 3 as the best sequel to emerge from the studio, it's a strong enough animated film to rise to the top of summer family-friendly fare. The energy and comedy are strong and the only thing off-color is the palette when seen through 3-D lenses. This isn't a home run for Disney/Pixar but it's a solid double."
    },
    {
      "rating": "10",
      "text": "I was pleasant with Monsters University. I was disappointed with Cars 2 and Brave then I had to see this movie because I love Monsters, Inc. It turns out that Monsters University is surprisingly imaginative and hilarious, with clever moments and insightful animation."
    },
    {
      "rating": "10",
      "text": "If you want to have a great time, if you are sad or simply you want to avoid your problems, \"Monsters University is your film\". It's true Monsters University has no electrifying images but it a good film, like one night at the disco. Laughes are guaranteed."
    },
    {
      "rating": "9",
      "text": "If you're like me and you were extremely disappointed with \"Brave\" and \"Cars 2\" then SEE THIS MOVIE! It only proves that Pixar still has that magic touch that many skeptics were saying had faded. I saw it on an unfortunately small screen and I was still excited the entire time. This movie is also worth seeing in 3D. The animation is amazing. #seeit"
    },
    {
      "rating": "6",
      "text": "Not a bad film but nothing special from Pixar.  I am a big Monsters inc. fan and I really like the characters of Mike and Sully, but I was hoping for a more spirited effort."
    },
    {
      "rating": "6",
      "text": "Monsters University is the new 14th Pixar animated feature and the prequel of the biggest animated classic, Monsters Inc. Since 12 years of making the new prequel where monsters are planning to go college first before they started to work at the company. Monsters Inc. is very creativity film with big laughs, great animation design of monsters, and a great story, but this new movie is quite different and it's not as good as the original. The back story takes place where Mike Wazowski (Billy Crystal) is going to university and he's learning to become a scary monster, so he can scare children in closets around the world. Mike has to team up with Sulley (John Goodman) and the rest of the non scarier students to help them out to prove themselves to become very scary, so that the dean will not kick them out from the university. We meet our colorful friends in the university like Randall from the first movie, two headed monster Terri & Terry Perry, the owner of the club Don Carlton, and the other colorful monsters. The university is pretty cool to look at like the background is pretty neat, the animation is pretty bright, and the design is unique from the first movie. Monsters University is okay for most children and family will enjoy, but unfortunately the movie is pretty average and it wasn't that spectacular like the original movie. The main issue is that characters are not that interested and story needs to take time where both heroes who started at the university. It reminds us that the college and university is coming back to learn something we already knew from the start and we can't quite decide of whether we learn from the past or we want is another generation. Surprisely, the movie tries so hard to make this prequel and it didn't quite expect to coming back to learn everything we already did. Thumb Down."
    },
    {
      "rating": "10",
      "text": "Being as I was a child when the original Monsters Inc. released. I went to this movie with one of my buddies, as we were the only lone late teenagers there it seemed a bit off for the parents we were the two freaking out the most. If you had time as a kid to grow up with these movies they add so many little things from the original one into the movie, they add characters, items, and even phrases. All these little cameos and being able to relive my childhood for that hour and half was amazing. Not just the movie made me appreciate not only the film it self. But growing up sucks. Fantastic piece of nostalgia and a fantastic film."
    },
    {
      "rating": "10",
      "text": "Until Monsters University, a new origin story set several years before the action of Monsters, Inc., [Pixar] had never attempted a prequel. You wonder what took them so long, because the characters Mike (voice of Billy Crystal) and Sulley (John Goodman) are funny enough and their relationship rich enough to make the back story worth telling. The result is a charming addition to the Monsters canon."
    },
    {
      "rating": "9",
      "text": "Pixar, you did it again! Like many other Pixar movies, this one was a charm to watch and it achieved to deliver some good laughs and some surprisingly heartwarming moments. But let's say that it isn't perfect.  It had some very clever and funny jokes but some just felt kinda dumb and meaningless like the majority of the animated movies that have come out in these past years. Also the movie's second act felt a little empty.\rBut at the beginning of MU I was laughing at many clever things that I notices and I was surprised at an unexpected turn that the prologue took. Speaking of surprises, the third act of this movie was my favorite part of it and maybe one of my favorite \"final part\" of any Pixar movie. It was clever, surprising and emotionally charged!\rAlso one little thing that I want to highlight is the university man! They did an awesome job building it and creating the ambient of it. Especially at one scene at night I am gonna say, I felt in Disney Land. It was colorful and living.\rSo in the end this movie was what I expect a good Pixar movie to be and I hope they keep in this direction and not stray into another (I'm talking to you Cars 2)."
    },
    {
      "rating": "9",
      "text": "This a great movie, and an awesome prequel that stays true to original monsters inc feel.  It is great for the whole family, with comedy oriented for both children and adults. This is a type of movie where you dont have to see the original to enjoy, although there may be some references that are from the original movie. After seeing monsters unversity it just makes me want to see monsters inc again. My only complaint about this,and all other pixar movies is the long wait between the sequels, almost ten years wait after every movie!"
    },
    {
      "rating": "8",
      "text": "This isn't an emotional journey. It's not even close to beating wall-e or up. But it is an extravagant adventure. It keeps you on the edge of your seat and has a very good message."
    },
    {
      "rating": "10",
      "text": "It is the best movie I've ever seen. The graphics were really awesome and I was crying at the end. The third act is also very interesting but I don't want to spoil anything. It is simply the best movie I've ever seen."
    },
    {
      "rating": "8",
      "text": "We took the kids to this (8 and 5 years old) and really enjoyed the movie.  Good fun for the whole family and enjoyed it almost as much as the first one."
    },
    {
      "rating": "10",
      "text": "WOW!! What a movie! I got my son to not be scared by watching Monsters Inc. and the sequel did not disappoint. I loved sitting next to him in the audience and watching him light up from cheek to cheek with constant smiles. In fact, watching the movie made me reminisce about the past when I was scared of monsters. Pixar nailed this one and to me, it is an instant childhood classic."
    },
    {
      "rating": "10",
      "text": "This movie is actually good.The movie is funny and has a good story.This movie might not be as good as the first one but still I consider this as one of the best movies this year."
    },
    {
      "rating": "8",
      "text": "This film brought back what Pixar is all about. It had all the action and necessary plot points to entertain the older audience but keep the kids happy with the laughs and seeing their favorite characters. It was enjoyable, fun, and with a message that will help those that are at the point of choosing what to do with their lives. It may not be as great as the original (as it is true with other films) but it is exceptionally better than Pixar's previous two attempts (Brave & Cars 2). Pixar chose accurately when to release this sequel.\rP.S. John Goodman and Billy Crystal are as great as ever."
    },
    {
      "rating": "3",
      "text": "As much I loved Monsterc Inc. , I couldn't enjoy this prequel at all. Maybe it's entertaining for babies, I don't know, but the plot was non-existent and I could not find a single truly funny joke either. It's one of those movie which were obviously only created because the first one was a success and they wanted to make more money despite the fact that they did not have a single idea for a new movie. Don't watch this just because you liked the first one, you probably won't like this one."
    },
    {
      "rating": "7",
      "text": "Monsters University is certainly a step up from the last two disappointments (Cars 2 and Brave), but it isn't quite as good as the original.  The original had Boo, who was the heart and soul of the film.  Without her, the film focuses solely on Mike and Sully and the plot is the basic sorority film you've seen many times.  Most of it was predictable, but it was entertaining and had some good laughs.  I saw it in a full theater with lots of kids and the film captured their attention.  As always, the animation itself is first rate and looks terrific.  I did not see it in 3D so cannot comment on that."
    },
    {
      "rating": "7",
      "text": "Overall Monsters University is not quite as clever, or as funny, as its predecessor but the great cast of characters, and Disney Pixar's usually flair, makes for another enjoyable hour and a half of animated comedy."
    },
    {
      "rating": "8",
      "text": "I will admit that this movie was not as good as the first, but come on, few movies could be that good. If you go to see this movie expecting it to be as good as the first you will be disappointed. Objectively this is a very good movie. It's a bit cheesy at times, but there were plenty of laughs. The subtle tie-ins to the first were creative and laugh-out-loud funny. As adults, we've seen this story before (Revenge of the Nerds, Animal House, etc) but this is new for kids, and my daughters loved it. The animation is exactly what you'd expect from Pixar and the writing is crisp and doesn't get bogged down in character development. If you haven't seen it, please leave your expectations at home. That way, you will enjoy it."
    },
    {
      "rating": "10",
      "text": "Another film to add to Pixar's classics. I enjoyed it even more than the original. While there is no Boo to make the film sentimental, the film's messages are poignant enough without her. Highly recommended."
    },
    {
      "rating": "7",
      "text": "A fitting prequel for Monster's Inc., all the way from first meetings of Mike, Sully and Randall to Mike's inner ambitions to be something he's just not cut out to be. The main reason I didn't give this a higher score is that the ending seemed a bit tacked on and it wasn't as long as I hoped it would be. They seemed to sort of rush the cameos of the first film's characters too, like the Snowman and Roz. Otherwise, the film had that Disney/Pixar charm that I've grown to love, with inventive characters, exciting visuals and the perfect balance of joyous and heart wrenching scenes. It's well worth the price of admission for any fan."
    },
    {
      "rating": "7",
      "text": "Not any better or worse than the original.  Not as great as other Pixar movies, but it still had that charm Monsters Inc had.  It was well written with a basic but enjoyable plot.  I was hoping for a little bit more, but it was solid all around."
    },
    {
      "rating": "7",
      "text": "It may not achieve the quality level of the first one, but 'Monsters University' still have the soul that resides on it's charismatic characters and it's Pixar's best film since 'Toy Story 3'."
    },
    {
      "rating": "7",
      "text": "For Pixar, Monsters University stops the bleeding. In the wake of two disappointing films, 2012's lackluster Brave and 2011's misfire Cars 2, the animation company has returned to solid footing with a prequel to their 2001 entry, Monsters Inc. Although there is undoubtedly a financial foundation for mining past successes, Monsters University is nevertheless a charming, family friendly endeavor and, although it falls short of the best Pixar has brought to the screen over its long association with Disney, it's nevertheless worth a trip to the theater, especially for kids.\r As was true of Monsters Inc., Monsters University gets most of its mileage out of the atypical friendship between the big, furry Sullivan (voice of John Goodman) and the little green Cyclops Mike (Billy Crystal). Since Monsters Inc. effectively wrapped up going-forward story possibilities, the creative team elected to go the prequel route, so this is the tale of how Mike and Sullivan met, overcame an initial rivalry, and became friends. Although pitched at a level that won't bore adults, the film's content is kid-centered, complete with life lessons about the values of friendship, cooperation, and believing in oneself and others.\r Computer generated animation has long since reached a plateau level where the artwork results in the kinds of \"oohs\" and \"aahs\" that it once did. We rarely notice the richness of detail evident especially in the background the way we once did because every animated film boasts this - it's expected. Monsters University maintains the standard of quality expected from Pixar although, as is too often the case, the incorporation of 3-D is of dubious value. Seen in 2-D, this is a bright, cheerful motion picture. The tradeoff for getting things to pop off the screen is that the colors aren't as vibrant. I feel like a broken record making this comment: some animated films benefit from 3-D but it's hard to argue that Monsters University is one of them.\r Pixar's decision to develop some of their most popular movies into franchises hit a rough patch when Cars 2 failed to perform up to expectations. Monsters University, however, makes the argument that this may have been an unfortunate exception. Although the second Monsters movie won't challenge Toy Story 2 or Toy Story 3 as the best sequel to emerge from the studio, it's a strong enough animated film to rise to the top of summer family-friendly fare. The energy and comedy are strong and the only thing off-color is the palette when seen through 3-D lenses. This isn't a home run for Disney/Pixar but it's a solid double."
    },
    {
      "rating": "8",
      "text": "Lots of people either say this sucked, or that this was only decent/okay. I thought it was great! It's bright, colourful and playful. Mike, Sully and Randall return, for more monster-sized fun. It obviously wasn't as good as the first one, but it has a good story and breath-taking animation, so I don't see where all the hate comes from."
    },
    {
      "rating": "8",
      "text": "Okay, I'm sure everyone wanted a sequel more than a prequel, but Pixar's first attempt at a prequel was never done until this came out in 2013 (One of the greatest years) and it's a good one too even though it revealed plot holes to the original Monsters, Inc., but who really cares about that anyways?"
    },
    {
      "rating": "7",
      "text": "Much better than Pixar's last 2 attempts (Cars 2, Brave) a cute fun motion picture, beautifully animated of course, just lacks that special Pixar emotional roller coaster. Still holds some Disney magic, and for a prequel fairly well done. I will have to watch it several more times, but as for now I will say its good, not a Pixar classic, but good."
    },
    {
      "rating": "0",
      "text": "Monsters University is  Pixar's first prequel and none other the less manages to bring the total scope of the story from Pixar's Monsters Inc. (2001). It's flicking sweet and provides more of a solid performance than its sequel (Monster's Inc.) centered on the two main protagonist Mike (Billy Crystal) and Sully (John Goodman). And now for the first time Pixar has introduced their very first prequel this film actually better thought as a fun family entertainment for all ages,\r More on centered from the life of the two main characters. This film shows exactly the whole life of the two and the rest of all the characters in Monsters Inc. Undeniably more good than its sequel better than out to be. It also bring us their bond, closeness, friendship, family, and hilariously funny moments. It has more of the heart from 104 minutes of awesome 3D experience from Pixar\r Rating  9    10"
    },
    {
      "rating": "5",
      "text": "Pixar has created some of the best movies over the last decade because of their originality, cleverness and genuine emotion. Monsters University has virtually none of those qualities which makes the movie like a standard animation film, which is a disappointment for Pixar."
    },
    {
      "rating": "0",
      "text": "The movie should have been called \"A couple of losers in the University\"\rAnd the moral for kids is: Don't waste your time studying. You can be a \"successful loser\"."
    },
    {
      "rating": "2",
      "text": "Nothing exciting here to be found. This movie could have been a movie for the record books but falls way to short. Nothing close to the 1st movie. Wait to see it for free on tv."
    },
    {
      "rating": "6",
      "text": "Eh, it's okay. Not the most fantastic of flicks. It suffer froms just being quite bland. It also feels rather unnecessary. But eh, we got it nonetheless, it's a good time, plays it safe. And is very fun."
    },
    {
      "rating": "5",
      "text": "June 23, 2013\r 'World War Z' is a fast-paced, exciting thriller, which blends the horror, action, and science-fiction genres generally well. Brad Pitt gives a decent performance as Gerry Lane, but the film fails to create a real connection between the viewer and Pitt's family. 'WWZ' ends up being an above average film, which provides a nice new look at an oft-visited idea."
    },
    {
      "rating": "3",
      "text": "This felt like more of a cash grab then an actual movie. The message for kids was rather lame. Certainly not in the league of Up! Or Brave. It wasn't really bad, just meh."
    },
    {
      "rating": "5",
      "text": "Monsters University is once again a failed attempt from Pixar. The jokes were too cheesy, the plot seemed cliche, and it pretty much sucked. Wouldn't recommend it..."
    },
    {
      "rating": "9",
      "text": "I loved backstory to Mike, Sully, and Randall's lives before Monsters Inc.. Getting to see Mike as a little kid was super cute. The writing was fantastic and the movie was funny. The animation and the monsters designs were outstanding. The cast gave excellent voice over performances especially John Goodman, Billy Crystal, John Buscemi, Helen Mirren, Charlie Day, Nathan Fillon, Julia Sweeney, Sean Hayes, Joel Murray, Peter Sohn, and Dave Foley."
    },
    {
      "rating": "6",
      "text": "Monsters University occupies the middle ground when it comes to Pixar sequels.  It's not as innovative or emotionally resonant as Toy Story 2 or 3, but it's a great deal more fun and engaging than the needless Cars 2.  The animation is so gorgeous and the voice work so accomplished, that you almost don't notice that the plot and characters are paper thin."
    },
    {
      "rating": "6",
      "text": "While it may not be Pixar’s finest work Monsters University is still entertaining. The film made me chuckle a few times and as a way to kill some time it was not a bad way to spend it. If you are a little kid or a fan of Monsters Inc. check this one out because you will probably really like it. It is about on the same level as its predecessor providing the same likeable characters from the first film, which fans of the original will be overjoyed to see again, and a cute story that will make you smile and chuckle from time to time. It is slow and boring at times but as the film goes on it becomes more and more engaging making it something that is worth checking out. If you are hoping for something on the same level as Up or Toy Story 3 this film is not for you but if just want to see something cute that will keep you busy for an hour and a half check Monsters University out. This is a cute little film that is more or less as enjoyable as its predecessor."
    },
    {
      "rating": "5",
      "text": "I really expected more from Pixar, especially considering how fantastic Monsters Inc. was. Unfortunately this prequel ends up falling short,. Not only does it fail to live up to its predecessor, but it also fails to live up to Pixar's reputation for animated movies.\r It's got some humorous moments, but everything from plot to the characters falls short in my opinion. It ends up feeling very dull and predictable unlike most of Pixar's previous works. There are some good things here like Charlie Day's character, watching the Randall and Sully rivalry start, and it will keep kids entertained, but it is one of Pixar's lames efforts. It disappointed the huge Monsters Inc. fan in me, and as a prequel it failed to add anything that would make me rethink events of the first movie. Really I expected more from Pixar.\r This is a huge disappointment. It captures none of the Pixar magic and stands beside Cars 2 as one of Pixar's rare disappointments. It may be worth a rental if you were a huge fan of the original and have small kids, but for others it may just be better to skip this and keep those fond memories of Pixar still intact. This does some pretty big damage to their reputation."
    },
    {
      "rating": "6",
      "text": "The higher the bar is set the harder is to keep it. That is the case with the new Pixar's animation movie \"Monsters University\", prequel to \"Monsters, Inc.\" Even though it is a decent Pixar movie, professionally done and pleasant to watch, it is not nearly as good as the first one. \"Monsters, Inc.\" became a classic right away, this one will not…"
    },
    {
      "rating": "6",
      "text": "The animation was, as always, quite spectacular.  As far as laughs and story go, I felt like this fell a little short of what I would expect from a studio with such a legacy.  Is Disney just...forcing them to make these sequels/prequels at this point?  I seem to remember a time when it felt like Pixar was pretty damn creative."
    },
    {
      "rating": "8",
      "text": "I waited 12 years for a sequel to Monsters Inc., (I was looking forward to Boo reuniting with the duo) but we got a prequel instead. Regardless, I enjoyed it.\rThis movie focus more on Mike Wazowski, unlike the previous installment, which mostly focus on Sullivan. The best part of the film is the opening and the ending; the main portion of the film is alright, but the start and the end is great.\rDespite being a follow-up, this film feels like it's its own movie. (instead of trying too hard to make it similar to the original)\r Has room for improvement, but great time regardless. 4 out of 5 stars."
    },
    {
      "rating": "9",
      "text": "NO MAJOR SPOILERS\rThis is basically a love letter for fans of the first movie. Monsters, Inc. was my favorite movie of all time and University has so many details that will have you remind yourself from the first movie. For example, the monster from the first movie that had a human sock stuck in his back shows up a few times and these little moments bring a lot of nostalgia.\rMU isn't the best movie ever; as this is a prequel to Monsters, Inc. it's missing a key emotional element, Boo, which makes it much more a comedy movie than an emotional journey; but Monsters University does have a  lesson to learn from that hasn't been much explored by many other motion pictures and if you see the movie you'll understand me.\rMonsters University isn't as heart warming and well scripted as the first movie, but it isn't really meant to be. It's meant to be a fun prequel serving as a love letter to fans of the brilliant Monsters Inc. And it does so very well."
    },
    {
      "rating": "6",
      "text": "I went into Monsters University with very little in the way of expectations and I came out surprised and disappointed at the same time as the prequel to Monsters Inc is both wonderful and aggravating at the same time. When Mike Wasowksi (Billy Crystal) arrives at Monsters University he meets rebellious James Sullivan (John Goodman) and the two tangle to become the greatest scarers until they are forced to team up to avoid getting expelled. University does manage to avoid the pratfalls of prequels by keeping the story light and narrow in scope while filling the film with a brand new crop of monsters and a few choice cameos for longtime monsters fans. However it also lacks that Monsters Inc had, a no holes barred adventure with a beautiful ending. University is fun and has some action in it but it lacks the guts of its predecessor and feels like its lacking because of it. As usual the animation is stellar with Pixar constantly raising the bar on themselves but it all feels similar. If anything, Monsters Inc has robber University of the awe this film would have caused as a stand alone feature. Crystal and Goodman are having fun doing the voices yet again as these two really come alive. The film depicts the beginning of a beautiful friendship and it finds its heart through this odd couple pairing but it lacks the child like innocence of Inc and ultimately if there is no Boo then you won't be able to achieve the same effect making it a good thing University doesn't try to."
    },
    {
      "rating": "7",
      "text": "Pretty good sequel with great animation and pretty good humour, though lacking a really good villain."
    },
    {
      "rating": "8",
      "text": "Monsters University may not be the Pixar masterpiece that everybody is waiting for, but it sure is one of their more entertaining ones in recent years or so. Again, their attention to detail and animation quality is way above the other studios. While the plot runs around in a straight forward manner, MU ends up strongly, and in an exciting note to boot as well. Nevertheless, we need more of their more original materials from now on, not their sequels. This is where Pixar excels the most."
    },
    {
      "rating": "6",
      "text": "Monsters University is a pretty decent movie but it lacks a lot of the charm the first film had. I think a lot of that has to do with how original the story was initially and how that unique element is lost a bit in further iterations. I think Boo provided a lot of the charm in the first movie as well. It wasn't so obvious until watching a movie without her. Obviously Mike and Sully were both great but the competition with which the film is built upon feels a little weak. I know, it's a children's movie, but that's kind of the problem. While Monsters, Inc. was a film that the adults could appreciate, this one is more of a pure kiddy flick. It's still entertaining to a certain extent but without a lot of the depth from the first one, it's ultimately just a fun kids movie and not much more."
    }
  ],
  "recommendations": [
    "meet_the_robinsons",
    "hotel_transylvania_3_summer_vacation",
    "the_lego_ninjago_movie",
    "incredibles_2",
    "my_little_pony_the_movie",
    "big_hero_6",
    "hotel_transylvania_2",
    "despicable_me_2",
    "turbo",
    "hotel_transylvania",
    "tmnt",
    "smurfs_the_lost_village",
    "cloudy_with_a_chance_of_meatballs_2",
    "the_croods",
    "rio_2",
    "atlantis_the_lost_empire",
    "ice_age_the_meltdown",
    "the_lego_batman_movie",
    "love_and_monsters",
    "bumblebee",
    "the_lego_movie",
    "the_good_dinosaur",
    "penguins_of_madagascar",
    "monster_house",
    "dumbo"
  ]
}