{"id": 2283, "title": "Monster Trucks", "starring": ["Lucas Till", "Jane Levy"], "runtime": 104, "genre": ["Action", "Comedy", "Science Fiction"], "description": "Tripp is a high school senior with a knack for building trucks who makes an incredible discovery - a gas-guzzling creature named Creech. To protect his mischievous new friend, Tripp hides Creech under the hood of his latest creation, turning it into a real-life super-powered Monster Truck. Together, this unlikely duo with a shared taste for speed team up on a wild and unforgettable journey to reunite Creech with his family.", "releaseYear": "2016", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/jDKONUh6CD6M1P0sgOe3RDxy31t.jpg", "categories": {"plot": 6.444444444444445, "acting": 5.857142857142857, "ending": 8.0, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 5.75, "funny": 6.333333333333333, "action": 7.846153846153846}, "reviews": [{"rating": "6", "text": "The Film won't win any awards, but it's definitely not a bad movie. It's silly, crazy, weird, and mostly made for younger kids, but once you realize this, it becomes very enjoyable to sit through. The characters are fun and bizarre, the \"creature\" and overall film is original, and the action is incredibly unrealistic, but boarderline exciting to watch. The plot is fairly thin and the whole time I was left to wonder where all the parents were, but overall, it was worth the ticket price and a great Film to keep the kids, and some adults, amused."}, {"rating": "10", "text": "This is a surprisingly entertaining movie about monsters, trucks, and respect. Most of the action involved the \"Monster Truck\" Creech in vehicle chases with other trucks, pickups, and even a huge super dumptruck. Recommended for family viewing, this is a kid-friendly and feel-good movie that teaches good values."}, {"rating": "8", "text": "why is everyone given it bad reviews i think it's awesome alot of action but I would like it more if it had some comedy but for me a pass make a sequel"}, {"rating": "5", "text": "Clearly not a film designed to be nominated for any awards. Kids will like it, you won't hate it. Entertaining. If you go into it expecting a masterpiece, you will be disappointed."}, {"rating": "10", "text": "Monster Trucks has a beautiful, elegant simplicity to it. It is a beacon of brilliance in film, and all artists and storytellers should look to it for guidance. No, I'm not kidding.Maybe it's just because a lot of dull and poorly-made movies have come out lately, but Monster Trucks blew me away by being so much better than I thought it would be. It has a sensible plot, likable and believable characters, arcs with payoff, foreshadowing, a fantastic cast, and so much more.It's convinced me that it must be harder to make a bad movie than a good one. It begins with a simple premise: what if monster trucks were actually trucks with monsters in them? Then, everything in the movie builds off of or supports that premise. It was carefully thought-out, and it has heart, and it has some seriously awesome action sequences. Everything was meticulously planned, from the tiny brick jokes to the actually important plot stuff.It sounds like sarcasm, but I would easily put Monster Trucks in my top 10 movies of all time if I knew what the other movies on that list were. For me, it beats out any of the big movies recently, like Rogue One or Passengers, and even movies I really liked, like La La Land or Hidden Figures.It's not getting the attention it deserves. Seriously, people, it has monsters, trucks, monsters in trucks, monster trucks, and monsters in monster trucks. And best of all, it makes all of that MAKE SENSE! And be funny! And even maybe make you cry a little bit at the end! What more could you possibly want?!"}, {"rating": "7", "text": "The idea is unabashedly silly, yet Monster Trucks is more involving than it sounds. Characters and conflicts are sharply defined, and director Chris Wedge handles the action with clarity."}, {"rating": "7", "text": "The idea is unabashedly silly, yet Monster Trucks is more involving than it sounds. Characters and conflicts are sharply defined, and director Chris Wedge handles the action with clarity."}, {"rating": "2", "text": "Monster Trucks is a film designed to be enjoyable for children and to be a boring ride for everyone else. If you have nothing else to do than watching your child dying to see this movie, go ahead and do it, but please bring equipment. This film is literally a borefest."}, {"rating": "7", "text": "The idea is unabashedly silly, yet Monster Trucks is more involving than it sounds. Characters and conflicts are sharply defined, and director Chris Wedge handles the action with clarity."}, {"rating": "7", "text": "The idea is unabashedly silly, yet Monster Trucks is more involving than it sounds. Characters and conflicts are sharply defined, and director Chris Wedge handles the action with clarity."}, {"rating": "0", "text": "Watched it opening day. The only reason I heard about this movie was because of the Pizza Party Podcast with Pan-Pizza because Jim Gisriel tried to over hype this movie because it would be funny if a January movie after Star Wars+Oscar Season was hyped up and rallied for even though it was destined to fail. Ever since last summer when I first heard f this movie I thought it was gonna fail financially and critically, which it did. But I also expected more from this movie, with a 200 Million dollar budget (After Marketing) I was expecting huge set pieces and Monster Truck Competitions that could rival Michael Bay's Transformers. Instead I got an awkward and disturbing morphed version of E.T. Having the alien creature your supposed to connect with be treated like nothing more than a car engine, a car lovers toy is just disrespectful and just flat out disturbing compared to a good movie like E.T. The acting was somehow worse than a Tommy Wiseau or Neil Breen Production which is very difficult to top, you have to go out of your way to find actors that bad. My number 1 problem with this film is the lack of set pieces and changing scenery, in other words, THIS MOVIE WAS FILMED INSIDE A 1 MILE RADIUS OVER THE COURSE OF AN AFTERNOON ITS SO CHEAP. WHERE DID THE 100 MILLION GO NICKELODEON?!?!? I THOUGHT YOU WERE BETTER KNOW THAT YOU MADE THE LOUD HOUSE BUT WHAT IS THIS?!?!? DID YOU EVEN TRY?!?!? THIS MOVIE LOOKS LIKE YOU JUST RENTED 3 BIG TRUCKS AND TOOK THEM OUT FOR A DRIVE IN A GREEN FIELD AND THEN MADE A MOVIE AROUND THAT IN POST PRODUCTION!!!!!! THIS MOVIE IS SO EMPTY THE ONLY ENJOYMENT I GOT OUT OF IT WAS LAUGHING AT HOW BAD IT WAS WITH MY FRIENDS AND MAKING JOKES OUT LOUD BECAUSE THE THEATER WAS EMPTY. THE ONLY THING THAT WOULD OF REDEEMED THIS MOVIE IS IF YOU RELEASE JIM GISRIELS ENDING HE MADE UP ON THE PODCAST WHERE BERNIE SANDERS DRIVES CREECH IN A MONSTER TRUCK INTO THE TRUMP INAUGURATION. I watched this on opening day at the AMC Theaters Glendora CA with my best friends and we enjoyed this terrible $h%t movie because we were laughing really hard at how bad it was. What I'm trying to say is DON\"T WATCH THIS MOVIE. Also I'm keeping the free handout stickers and selling them on Ebay in ten years and hopefully it will make me more money than this movie made Paramount."}, {"rating": "10", "text": "Arguably the next step in human evolution. Monster Trucks prove that even thought Donald Trump is {resident that mankind will prevail and defeat the forces of evil."}, {"rating": "7", "text": "The idea is unabashedly silly, yet Monster Trucks is more involving than it sounds. Characters and conflicts are sharply defined, and director Chris Wedge handles the action with clarity."}, {"rating": "7", "text": "The idea is unabashedly silly, yet Monster Trucks is more involving than it sounds. Characters and conflicts are sharply defined, and director Chris Wedge handles the action with clarity."}, {"rating": "5", "text": "Charismatic Lucas Till plays a high-schooler who's humiliated that he's stuck riding a bike, until he befriends a cute creature that inhabits his old truck and leads him on an adventure. This new friend (an impressively realistic blob) is an amphibian cross between a squid and dolphin that lives on oil and loves to power the vehicle. This film was produced by Nickelodeon, which gives you an idea of the approach: good natured characters (even the villains aren't that mean), lots of energetic physical fun (including numerous car chases) and a lively pace. For anyone over about 10 years old this movie might just seem silly, but it should prove an enjoyable escape for the intended young audience."}, {"rating": "4", "text": "This film has some decent visuals but is ultimately loaded with dumbity and nonsense."}, {"rating": "6", "text": "Very intentional film, but could not deliver!There are lots of similarities with other films, maybe not directly. In todays world, it became practice to give kids (and sometimes for women) their own version of what meant for only grownups. So there's no use whining about that. Because those who does might not be the target audience. This is I think purely for kids, otherwise it would have not got bold PG, but like usual for any film, I gave it a try. Even though it's not original, somewhat I enjoyed watching it.The story was in usual pattern that opened with an intro, then moving to unleash the long trapped ancient creatures into the human society. One becomes friend with it and a few starting to hunt it with the rest are as the neutral or unaware of it. There's nothing unpredictable in it. And so the tale comes to halt with a finale where maximum push was given, but overall it fails to impress on the average expectation.Good title, good idea, even the graphics were not bad, but not good enough stunts with okay performances. I feel it could have become a good television series than the film. So they should scrap the idea if they have one for a sequel and instead make a shift to television. Other than what I thought, this is a good entertainer for little kids. So it should be watched by them more than their counterparts.5½/10"}, {"rating": "5", "text": "Though it has moments of swirling ambition and stylized CGI, Monster Trucks proves that a simple children's story doesn't quite work for the general audience anymore."}, {"rating": "10", "text": "One of the best things about the 1988 comedy “Big” was Tom Hanks’s main character, a kid stuck in an adult’s body who used his playful imagination to rise through the ranks of a toy company. At one point, he pitches the idea of a robot toy that turns into a bug, arguing that kids will prefer something that’s both unexpected and fun.The premise of “Monster Trucks” is in that same spirit. What would happen, the film wonders, if cute, otherworldly creatures operated hulking cars (which already appeal to children)? The idea is unabashedly silly, yet “Monster Trucks” is more involving than it sounds. Characters and conflicts are sharply defined, and director Chris Wedge handles the action with clarity.Lucas Till plays Tripp, a sullen high school student who dreams of escaping the North Dakota hamlet where he lives. Tripp has a part-time job in a junkyard, where, during an evening shift, he makes a startling discovery: a giant, oil-guzzling monster with tentacles is hiding there, scrounging through scrapped vehicles for any drop of oil it can find. The monster was once living deep beneath Earth’s surface until a greedy oil executive named Reece (Rob Lowe) destroyed its underground habitat. Tripp nicknames the monster Creech (short for Creature), becoming buddies with it, since it is smart and has big, dopey eyes and a friendly disposition. When the monster takes refuge inside the metal body of the vintage pickup truck Tripp is restoring, the boy sees an opportunity. He rigs the truck so that Creech can serve as its de facto engine.In addition to Lowe, “Monster Trucks” features many familiar character actors in supporting roles. Danny Glover, Amy Ryan, Barry Pepper and Thomas Lennon all make appearances, dialing down their screen personas so that younger audiences can focus on the plot. Since the oil company wants to destroy the monsters — the presence of a new species would mean they must halt drilling operations — the film turns into a contest of wills between Tripp and the evil corporation. Help comes from unexpected sources: Lennon plays a scientist who joins the good guys, and Jane Levy plays Meredith, the plucky if stereotypical girl next door. Screenwriter Derek Connolly shrewdly uses archetypes for many characters, while also leaving room for modest surprises. Motivations may not be complex exactly, but they bear a satisfying resemblance to actual human behavior.The special effects strike an admirable balance between the cutesy and the creepy. Creech, for example, is less humanoid than E.T., but the CGI character designers give him personality and heft. More importantly, Wedge uses the monster-in-a-truck conceit as a springboard for some imaginative chase sequences. With Creech inside, Tripp’s truck can jump, tilt and even climb walls. Unlike Michael Bay of “Transformers” fame, Wedge shoots these sequences carefully, so that we always understand where Tripp is in relation to his pursuers. Camera placement and editing are coherent, not chaotic. (Note to more “serious” action filmmakers: You could learn a thing or two from this film’s respect for spatial elegance.)“Monster Trucks” is far from deep. The good guys don’t experience major life lessons, and the comeuppance meted out to the bad guys is only perfunctory. But the conflict is simple enough so that kids can recognize what’s at stake. Broad gags are thrown in alongside sly jokes — including asides that suggest that the filmmakers know that the 26-year-old Till is way too old to play a teenager.This is a film where adults needn’t count the minutes until the end credits. “Monster Trucks” does not rely on bright, flashy colors to maintain the attention of the intended audience. Long after the novelty of the premise runs out of gas, it’s sheer moviemaking craft that fuels this effects-driven action-family hybrid."}, {"rating": "2", "text": "Another movie with an environmentalist agenda.  I just want to be entertained, not lectured.  This is supposed to be a movie for families and kids, not a politicized leftist propaganda film."}, {"rating": "3", "text": "Yeah. This movie's bad. But... is it even worth me getting angry over it? It's just bland, cliche'd, and unoriginal. Not terrible, but definitely a dud."}, {"rating": "0", "text": "Esto es una basura pero no tanto como lo es la \"era de hielo choque de mundos\" el lo penultimo peor que a sacado A S C O"}, {"rating": "0", "text": "If I had known a nonsensical movie like this was released, I wouldn't have gone to see it. But my idiotic brothers made us go to AMC Theatres, anyway. Long story short, it was terrible. \"Monster Trucks\" was boring, and I didn't even care about the plot, either. There was an instance when Mom took me to the bathroom. I missed a few chunks of the film, but now I don't give a **** because just by watching the five minutes minutes goes to show how ass \"Monster Trucks\" is. I'm even surprised it haven't even gotten any Razzies, as it's the WORST 2017 films ever.Paramount, do better."}, {"rating": "10", "text": "this movie is really crazy and the vehicle is a monster truck literally....."}], "recommendations": ["jurassic_world_fallen_kingdom", "the_predator", "rampage", "crawl", "jurassic_world", "47_meters_down", "the_meg", "doomsday", "cars_2", "pacific_rim", "the_fate_of_the_furious", "teenage_mutant_ninja_turtles", "resident_evil_apocalypse", "max_steel", "xxx_return_of_xander_cage", "transformers_age_of_extinction", "despicable_me_3", "critters", "the_shallows", "race_to_witch_mountain", "love_and_monsters", "planes", "geostorm", "transformers", "lockout"]}