{"id": 56, "title": "Monster Hunter", "starring": ["Milla Jovovich", "Tony Jaa"], "runtime": 104, "genre": ["Action", "Fantasy", "Adventure"], "description": "A portal transports Cpt. Artemis and an elite unit of soldiers to a strange world where powerful monsters rule with deadly ferocity. Faced with relentless danger, the team encounters a mysterious hunter who may be their only hope to find a way home.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/1UCOF11QCw8kcqvce8LKOO6pimh.jpg", "categories": {"plot": 3.676470588235294, "acting": 3.3333333333333335, "ending": 0.8, "soundtrack": 1.3333333333333333, "cinematography": 2.5, "familyFriendly": 4.538461538461538, "funny": 3.2, "action": 4.65}, "reviews": [{"rating": "0", "text": "Paul w. anderson and his wife strike again and ruin yet another movie adaptation of a game which could be a master piece if it was directed by a real director not by this moron, after COMPLETELY ruining the Resident Evil movies i never thought anyone would want his movie to be directed by this moron but yet again capcom let him to ruin another IP"}, {"rating": "2", "text": "I expected the film to be about nothing, and my expectations were met. As a film, it is mediocre at best. But as a movie based on of monster hunter universe it's just rubbish. For whatever it takes - everything is done through the ass, except perhaps for the monster models. As far as I remember, the developers took out the director's brains to make the design of the monsters as close to the game as possible.I would also like to plunge the soundtrack into the mud. There is no proof of a hero remix at all. The whole movie plays some kind of rip-off on daft punk. It feels like the technical task for the soundtrack was written like this:- yo man, we need an OST for a new movie- what genre?- don’t you care?- say no more2 out of 10 purely for the chef's palico"}, {"rating": "0", "text": "Please don't support Paul ws.s Anderson and his terrible films! Also his wife is a trerible actress. It has nothing to do with the Monster Hunter Series."}, {"rating": "3", "text": "Monste Hunter is one of the worst films I've ever witnessed. Bad effects, poorly acted and insulting to the source in every way with such clichés as introducing a non-Earthling to chocolate and seeing them marvel at Velcro. 3/10. Paul W. S. Anderson truly is the big-budget Uwe Boll."}, {"rating": "5", "text": "+Great visual style+Decent soundtrack-Confused tone-Doesnt feel accurate to the gameMonster hunter is a film where I expected less than it delivered. It's entertaining but check your brain at the door please."}, {"rating": "6", "text": "Disclaimer: I am biased as a huge fan of the Monster Hunter series.  I personally enjoyed the movie, but strictly because I got to see some of my favorite monsters on the big screen.This movie was... definitely a movie.  That's about all I can say about it.  Every review that mocks its writing?  Accurate.  The writing is abysmal and I have seen certain Halo fanfics that are comparable in quality.  The character design being horrendous?  Yes.  The monsters themselves being AMAZING?  Absolutely the only selling point of the movie.  There were multiple times when my friend and I were watching this together that we started asking why an event was happening for the third time in the film.  Certain plot points felt like they were put in just to run screen time without having to put more of their presumably expensive CG in.  I personally enjoyed watching this movie, but I cannot in good faith recommend it to anybody who is not a die hard fan with hundreds of hours put into the games.  It's simply not a good movie."}, {"rating": "5", "text": "The plot was very simple. I think could've been better and more interesting, but not really memorable movie. Was pretty average, but watchable"}, {"rating": "0", "text": "THIS WAS THE SINGLE worst movie of my entire lifemy expectations were low BUT HOLY WOW I am still disappointed.This movie was so bad it ruined the actual game for methe first half of the movie is US military propaganda, The rest is just horrible movie cliches and fighting scenes.there's this one character who just keeps saying monster names that's his entire character.EVEN THE PLAICOS in this game were not cute like the original. they treated it like a horror movie at the beginning and just gross for the rest of it.they only included 2 weapons (great sword, without the cool spinny move and dual blades)it was soooooooooooooo bad.I was expecting this movie to be a 4-5/10 but I'm not exaggerating. it's literally the worst movie I have EVER watched. I liked the Warcraft movie, despite the small differences in the lore that ones a 8/10-7/10 to me at least. this... this is genuinely a zero.at least the monster sound effects and roars and textures were the same as the game."}, {"rating": "5", "text": "I would wait for Redbox price, I saw it for free but $6 is pushing it. It is a movie I would have enjoyed more on the big screen with loud surround sound. I saw a Resident Evil in IMAX, and you could feel the chairs shaking as a helicopter was going by. This movie I think is one of those that needs that kind of experience to get the most out of it.I've never played the game, so I can't tell you how closely it follows it. I know when you have Tony Jaa you're expecting fight scenes, you get plenty of those, and they're done well. I'm not sure of his real life English fluency, but Monster Hunter becomes a Hellen Keller story with fight scenes basically.I about died laughing looking at Ron Perlman with hair like Brad Pitt in Troy.  I absolutely hated the Army song they kept singing, as it seemed really half hearted , and annoying."}, {"rating": "0", "text": "Encore l’une de ces (mauvaises) adaptations de jeu vidéo au cinéma ! ce n’est pas nouveau et on s’y attendait ! c’est le contraire qui aurait été surprenant… ou complètement anormal. Rien à « voir » donc ici dans ce « Monster Hunter » sinon un scénar bricolé par quelques stagiaires qui ne se sont pas relu et n’ont rien compris aux conneries qu’ils avaient écrites ; de toute façon, ils avaient la tête dans le cul.Jovovich est en pilote automatique et Jaa, l’acteur thaïlandais est plutôt un faire-valoir qui fait des pirouettes ; de toute façon, ils se reposent sur les effets spéciaux et tout le film se repose sur les effets spéciaux ; etle reste, tout le reste, ils s’en battent les couilles.Il ne faut pas s’étonner alors du désastre mais plutôt de son étendue… à perte de vue. Notons cependant que c’est tiré d’une série de jeux japonais particulièrement idiots, cons et injouables, des tas de merde à n’en plus finir, ceci expliquant cela sans doute. Mais tout de même !Le pire dans tout cela, c’est la réalisation très agitée qui donne mal à la tête : du « cut and move » dans toute son horreur ! la caméra a le tournis et la gerbe et le montage est sur-découpé avec des « pointes » à 4 ou 5 plans par seconde… horrible vous dis-je !"}, {"rating": "1", "text": "This movie is absolute garbage, if you have never played the game it's a cheesy movie with no story and terrible actors. If you have played the games it's nothing short of a spit in the face. CGI is ok and monsters and weapons look as they should."}, {"rating": "0", "text": "F*ck this movie and Paul WS Anderson so hard... As a longtime fan of the Monster Hunter series, I was terrified of the day that Hollywood would come around to bastardize this glorious franchise. Why the hell did it have to be Paul WS Anderson? This movie was completely unnecessary. Absolutely nobody except the producers with dollar signs in their eyes wanted this film.Where do I even begin, I legit don't remember the main character's name and I'm not even 100% sure that we're ever even told her name in the first place. This film has zero plot whatsoever, it just limps around sh*tting it's self along the way. With the turds being what I think is supposed to resemble monster hunts? The \"hunts\" are so hard to follow with constant jump cuts and nonsense. Each monster has a single roar that is just repeated full boar the entire fight. The music is all uninspired and generic action wub wubs.Now on to what pissed me off with this film... How the f*ck is this supposed to represent Monster Hunter? This isn't Monster Hunter, it's goddamn Gate. There is so little Monster Hunter anything in this film outside of a few monsters and like 3 weapons that are generic iron weapons. You can tell that Paul played MHW for like 2 hours and that was it. The lack of knowledge is shocking to me, how do you get away with making a film adaptation with such little understanding of the source material? The Diablos straight up tries to eat them at one point, never mind that fact that Diablos are herbivores. The film then acts like Rathalos is the ultimate end all monster and terrified by all. Come on, I eat Rathalos steaks for breakfast.The absolute number one thing that broke me though, was the ending. Holy Sh*t the ending made my blood boil, they just suddenly throw in Gore F*cking Magala into the mix as a teaser of a sequel that will never get made. F*ck you Paul, Gore Magala... really? The fact that they had Gore Magala just thrown in shows the lack of Monster Hunter knowledge. For those that don't know, there's a little thing called the Frenzy Virus that is caused by Gore Magala. It basically radiates this deadly fart dust that causes painful death that slowly kills those infected as they go mentally insane. This is always a sign of a Gore Magala, always! In the lore, entire cities and towns were abandoned due to Gore Magala and his cooties. This film made me want to become an alcoholic so that I'd forget it's existence.Thank you for listening to my 37 minute rant about why Paul WS Anderson is an assh*le. I hope you enjoyed reading it as much as I will enjoy this bottle of rum I bought to try and forget this film exists."}, {"rating": "6", "text": "As an avid long term fan of the Monster Hunter computer game franchise, I wasn't sure what to expect after I heard about the plot premise of this film, but I decided to watch it all the same and honestly, it was more than what I was expecting. I am neither going to make this review to slam the film or give it praise it doesn't deserve.What I got in this film was a great look into how the Monster Hunter universe could be very wonderfully adapted to the big screen, but unfortunately, I feel it fell very short with the story. The classic tale of being transported from one world to another is such a too often seen trope, it's become damaging, and that's exactly what I see here. I feel there was no need at all to have this whole military unit of our world being ported to the Monster Hunter world. The actors were great choices in my opinion, but I believe the story would of been far better off just being set solely in the MH universe from the get go, no crazy and out of place teleportation trope needed.An example I could give of an idea I would of love to of seen would of been the characters we see being taken and trained up as new Monster Hunters, since we see plenty of the skills and weaponry of the world used in the film. This is where I truly saw moments that I absolutely adored. The use of monster parts, the carving up of the bodies, the demon mode of the dual daggers, this was where the film became the most interesting and fun for me. This is, of course, as a long term fan of the computer game series, so it was great to see all of this for me, as I am sure it was for many other fans like myself. For those who do not know the gaming franchise, I can see how that wouldn't have the same effect, but I don't doubt it still would of been interesting.After all, as a newcomer, you'd be completely introduced to a whole new world and shown how the people of it work with it. Hunting beasts and monsters, using parts of them as armour, weapons and even using venom glands to their advantage. This was all so excellent to see and just fantastically done as this is really the core heart and soul of the Monster Hunter games, going after the next big game to get the parts for new gear and equipment, and it's always so fun to find out what monsters give you what parts.The films visuals were fantastic. Over the years, I've seen the creatures of the MH universe being shown in greater and greater detail, but seeing them on the big screen in all this special effects glory was definitely a treat. They were done right, right down to the little details, so seeing Diablos and Rathalos among others this way was fantastic.There were treats for fans of the computer game franchises as well in the scene of the Palico chef cooking up food, almost exactly like it's seen in the game of Monster Hunter World itself. And the fact that it's fundementally the same Palico, going by the scar blinding its left eye, it's a very wonderful nod to the game, something I really appreciated, espcially as he cooked up some meat just like its done in the game. Loved it!Over all, the film was a chance of showing the Monster Hunter world in a brillant way on the big screen, but it has been hurt, rather sadly, by the fact that the story just isn't as good as it could of been. I never really thought to begin with a live action version of Monster Hunter would ever work, but seeing that this film isn't as awful as I ever expected has given me hope that perhaps there's a chance for a future installment, just with a far better story, if we're lucky. I will always say though, that I think it would do far better as an animated series or film. But only time will tell.The whole thing gets a 6/10 because the visuals, designs, the Monsters, the weapons and gear as well as the nods to the computer game of Monster Hunter World were all so excellently done that it rescues the film from being one of the worst video game adaptations ever, but the story is what is taking away from it getting a higher score.Still, if you're a fan of the game franchise, especially Monster Hunter World, it's worth a watch at least once. It's a fun viewing for fans and non-fans."}, {"rating": "3", "text": "J'avais regardé 1h une soirée et le reste le lendemain. Et ça veut tout dire, j'ai pas pu regarder en entier en une fois.Le film est loin de l'univers du jeu et il y a beaucoup trop d'interprétation, les incohérences trop nombreuses, des cut scènes partout tout le temps, la musique qu'est ce qui c'est passé????, des deus machina qui montre clairement qu'ils voulaient pas s'embêtaient avec certaines explications et certaines scènes.Ce qui est énervant c'est la gue-guerre entre les personnages qui sert à rien à part perdre du temps dans l'histoire et les éléments importants de l'univers de Monster Hunter. Et c'est là que tu comprends que le réalisateur ne doit pas connaitre le jeu ou alors si il le connait, n'a rien retenu ou n'en avait rien à faire.Ne trouvant pas de solution pour expliquer certaines choses pourtant simple quand tu connais l'univers du jeu, le réalisateur fait du remplissage et parfois nous sort du deus machina pour clôturer une situation et ce qui amène parfois à du WTF.Après je mettrais quand même un bon point sur l'humour.Le jeu d'acteur bah c'est bien sans plus, même si par moment on a l'impression que les acteurs sont un peu paumés car ils jouent sur fond vert. On voit qu'ils cherchent un peu à se placer et les interactions avec le virtuel (vide) n'est pas très bien jouer.Pour les effets spéciaux c'est beau, les paysages sont très bien rendu, il y a clairement eu le budget. Même si la post prod et encore passer par là pour foirer certaines scènes. Dommage.Pour les dialogues c'est pas terrible, ça tourne en rond, ça parle pour rien dire, parfois ça n'a même ni queue ni tête et même à un moment vers le milieu du film ils disent carrément l'inverse de ce qu'ils avaient dit juste avant.90% du film ce concentre sur l'histoire du personnage principal et voila. Euh et ce qui fait la licence? Le monde/univers MH? Les origines? pourquoi ce monde? pourquoi les chasseurs? les armes? l'ancienne civilisation? Pouvoir? la traque? la guilde? les monstres (espèces, variant, caractéristiques, spécificité, origine...)? etc... on en parle ou pas? bah quasi pas. Si vous cherchez à connaitre l'univers de MH passer votre chemin, par contre si vous voulez connaitre l'histoire d'un perso ça peut vous intéressez. C'est très autocentrer.Ensuite la musique bon bah voila voila...En gros un film d'action plutôt classique dans sa construction. On sent le film qui profite d'une licence pour faire parler de lui et donner un prétexte à faire un film gros budget. Malheureusement on tombe dans les travers classique du \"on fourni aucun scénar, aucun background, on concentre tout sur les personnages, la baston et la 3D\".Dommage parce que la licence à vraiment du potentiel pour faire quelques chose de complet et offrir plusieurs possibilité de scénario en ce concentrant sur tel ou tel sujet du lore."}, {"rating": "4", "text": "As a fan of the game series, it was a bit of a letdown. For someone who isn't a fan of the series, its fine, but not great. Without a question the best part of this movie is the CG for the monsters, the textures and animations are very high quality and were a treat to see. Tony Ja's character was great, and there were some genuinely cool moments, but overall the story wasn't that great.    It's obvious the writers really wanted to focus on the main character gradually learning more and more about this new world she's in, but the execution doesn't quite stick, and it feels like they focus on this particular aspect way too much. I was constantly finding myself wishing that they'd just removed the concept of the portals altogether and had all the characters be from the Monster Hunter universe.    Overall, the movie is just okay, but not really anything spectacular. For someone unfamiliar with the series already, its probably worth at least watching for the effects. However if you're already a fan of the series I wouldn't get your hopes up, the fights aren't really that good and the only part that really got my hopes up was seeing Gore Magala make an appearance, though it unfortunately doesn't really go anywhere. I would NOT go out of my way to watch this movie a second time, though I must say that the CG and Costuming teams really outdid themselves, the outfits based on characters from the Monster Hunter World game are pretty spot-on and the monsters look awesome.    If they were to make a sequel, my advice would be to please focus more on the monster hunting and less on the main character trying to figure out how stuff works in this universe, let the viewers try and figure some of that out for themselves."}, {"rating": "6", "text": "Well it could have been worse. Paul WS Anderson is still the best Anderson even when he misses the mark and Milla is charming as always."}, {"rating": "2", "text": "Por lo general me gusta la dupla de Paul w.s Anderson y Milla Jovovich, pero esta vez fue una completa decepción, pese a los grandiosos efectos especiales y escenas de acción, no transmite nada salvo un profundo aburrimiento."}, {"rating": "0", "text": "Yet another video game franchise butchered by Hollywood. This movie was so bad that I stopped watching it after 20 minutes as I could not bear listening to the incredibly bad dialogues. The story has nothing to do with the video game franchise either. They took a brand and made something completely different with it. This movie is atrocious and should be forced upon prison residents as torture."}, {"rating": "1", "text": "Terrible film. The character building early on is very cheesy and poorly done and ultimately pointless. Treating the Monster Hunter IP as a different dimension so lame. The cgi and fight scenes look good still, but the speed up and slow down, shaky cam all make it look so cheap in motion."}, {"rating": "5", "text": "Well, considering the Monster Hunter games were below average at best, I didn't have any expectations for this film.  I only saw it because I was bored and had a free movie ticket.  That being said, this movie was surprisingly decent.  Jovovic and Jaa had pretty decent chemistry despite their character's language barrier.  The CG was excellent, and the story was adequate.  This isn't a great movie, but not terrible, either, just completely average.  It deserves no awards consideration obviously, but the trashing of it is undeserved."}, {"rating": "1", "text": "The film is literally worth it. As a fan of the Monster Hunter saga I feel like denouncing you. Looking at it with a non-fan eye I feel like stopping after 2 minutes. Watching my goldfish swimming in the aquarium is also more interesting. It's the classic **** American with military and weapons, added a couple of random things from the video game, a meaningless story, actions made by the characters without meaning. I strongly hope they don't continue with more junk like that. Grade 1 is for graphics only."}, {"rating": "3", "text": "This is less a movie, and more one of those cinematic E3 trailers stretched out to feature length. The plot is literally no deeper than the simple synopsis you can read online. So little thought went into the writing that there isn't even a conclusion. The credits just start rolling in the middle of a big battle. You might think there's some kind of issue going on at your theater when they first pop up, but then the stinger hidden a few seconds in makes it clear that's actually where they decided to leave things. So don't expect any sort of resolution or explanation behind anything.It also couldn't have gotten off on more wrong of a foot with me if it tried, as it quickly throws us in with a group of generic, cringe worthy tough guys and gals that embody the worst of military/soldier stereotypes. None of whom can act. Mercifully, the majority of them are killed off early on, leaving us with Milla Jovovich in the protagonist role as Cpt. Artemis and her costar Tony Jaa to carry the action forward. Unfortunately, both of them are portraying individuals so bland they might as well be actual avatars in a video game. There are no real characters to be found here. At least their chemistry is somewhat cute.About the only thing I can praise in this whole mess outside of some silly humor and the adorable \"Meowscular Chef\" are the visuals. The film is legitimately stunning to look at. Particularly whenever it breaks away from the sterile desert environment. The monster CGI is so good that it even blows the latest Godzilla and Kong movies out of the water. It's clear the budget went here rather than the script.This being a Paul W. S. Anderson film and given my enjoyment of his other works, I expected to have some nice things to say about the action as well. However, I ultimately found all of it to be a bunch of visual noise where each sequence and setpiece was designed to replace a plot, rather than serve one. As evident by the section where Jaa and Jovovich spend what feels like an eternity beating the crap out of each other rather than going ahead and teaming up to escape their predicament like we all know they're going to do anyways.Without a plot to follow or heroes to invest in, Monster Hunter has been left with nothing but its good looks to fill that void and an 1h 45m running time. As pretty as it's sights are they prove not enough to get the job done. There actually needed to be something of substance here to back them up. The lack of any real, meaningful, or even entertaining content to be found left me with a genuine and inexplicable sense of embarrassment to have been in attendance despite being the only person other than the family member I brought with me in the theater at the time. If that's not good enough a reason to stay home and play one of the video games this is based on instead, I don't know what is.3.9/10"}, {"rating": "0", "text": "its a ws Andrew's movie, a worse resident evil movie (somehow) would be the only way to describe it"}, {"rating": "1", "text": "Horrible plot. Horrible villains. The first one was a better movie in every aspect"}, {"rating": "2", "text": "Really disappointed by the way they treat the monster hunter IP. The monster hunter has it's lore and story, why make something so simple and out of the setting.The only redemption is the guy teaching the main actress how to fight the monster."}, {"rating": "10", "text": "It was very surprising, the cgi of the monsters was excellent for a budget of 60 million, Milla and Tony Ja are an explosive couple and have good chemistry, very good photography, hopefully they will confirm their sequel soon."}, {"rating": "8", "text": "Holy S@#t! This movie is PG-13?! The MPAA needs to get its priorities straight. There are some horrific, violent images in the first 20 minutes of this movie very much not suited for young eyes. At one point I wasn’t sure if there was going to be a murder suicide on screen. That aside, I really liked this movie. If you’re a fan of Ron Perlman and Milla Jovovich they don’t disappoint here. I just wish Ron had more screen time. While it is based on the video games of the same name, the story and visuals are a fantasy hodgepodge of “Pitch Black,” “Dune,” “Alien” with a touch of “Tremors” and several other films. While that sounds disastrous there is so much that it can claim its own and kept the movie feeling fresh. Well, as fresh as a Paul W. S. Anderson film can be. So many times I couldn’t quite tell where it was going, and while that’s great I also felt like it was over before it had really started. My one complaint is all of the electronic parts in the score. The the sequenced synthesizers just didn’t fit the overall aesthetic of the movie. They felt like they were invoking a more “Sci-Fi” feel. More traditional orchestrations would have been better."}, {"rating": "7", "text": "Dumb as dog-poop, but decently entertaining. As long as you don't expect any character development beyond \"This is officially above my pay grade!\", you should be fine.Snazzy semi-synthy soundtrack, too. Paul W. S. Anderson's best film since Event Horizon, which might not be saying much, but he's still a darn sight more fun than Michael Bay."}, {"rating": "8", "text": "Gamers are turning into entitled babies...When the Mortal Kombat movie came out in the 90s, I was just so happy to see a game bought to life. I didn't care that they changed things to make it easier for the non-gamers to understand. This movie finds a way to make the gamer crowd and average consumer meet in the middle, without trying to shove decades worth of lore down their throats. This movie was clearly just a set up for part 2.The -2 to my score was because it needed more monsters and more palicos."}, {"rating": "8", "text": "A love letter honoring a video game experience.  Critics who say knowing the source game is crucial may be right.  This is the closest I can recall a movie has come to the look and feel of playing a AAA video game.  This in itself if a big accomplishment. This not Watchmen; this is not even the two thoughtful imaginative Guillermo del Toro Hellboy movies.  This is \"can we write a script enabling a movie to replicate a gameplay experience?\" That the CGI is AAA is way more than I expected.  As critics note, the action scenes are all thoughtfully presented for clarity and drama.  I have been bored with some other WS Anderson movies.  This one seems to benefit from the Capcom and Toho Japanese creators contributions and fine tuning. Mila, Tony and Ron Perlman look and act their their parts.  The surprise singing early on does much to humanize the cannon fodder players."}, {"rating": "10", "text": "Great fun. Lots of action. Very intense action. Kind of like King Kong skull island."}, {"rating": "7", "text": "So for a movie about Tony Jaa and Milla fighting monsters it absolutely delivered.  Apparently the game is Shakespeare cause I see lots of whiny fanboys in the comments (I’ve played the latest game, and it’s not).  CGI was actually great and it some shut off your brain action.  Way better than most video game adaptations."}, {"rating": "7", "text": "I'm a mosnter hunter fan and i like the movie, could be more, but is cool to see my game monsters in a movie"}, {"rating": "0", "text": "Es mala... mala no lo siguiente es asquerosa.... es una ofensa a los juegos. Sin mencionar lo mala y tediosa que se vuelve la historia"}, {"rating": "10", "text": "So to knock at ign, really world building, its a movie your not playing a video game."}, {"rating": "10", "text": "Increíble, acción y efectos a la altura y Milla por supuesto hermosa como siempre"}, {"rating": "2", "text": "Anyone who knows the director and his wife already knows that the film is no good.Jovovich stars in a primitive action flick, and her husband directs it.Qualitatively, it rides on the last Resident Evil and has only primitive action to offer. The 90s action films were better there."}, {"rating": "8", "text": "Action aplenty, some nice interactions between the lead actors. Nice scenery with well choreographed fight scenes with some intense moments with the monsters. Ending maybe a bit soft thou."}, {"rating": "3", "text": "Bad movie.I watched it in 3D at cinema hall & still regret it.The film has nothing good to offer expect some huge monster killing scenes that provide very little entertainment. Milla Jovovich & Tony Jaa did above average acting but it all goes in vain as the story screen play dialogue along with direction was so poor.Skip this movie at any cost! or watch at your own risk!"}, {"rating": "10", "text": "It is a movie focused on players, some people might not be able to feel or understand what the movie wants to show, although Milla Jovovich feels kind of odd at the beggining, later on it mixes pretty well into the franchise."}, {"rating": "10", "text": "The Handler died, meowscular chef best waifu, deformed admiral 10/10 Handler is dead Handler is dead"}, {"rating": "0", "text": "No plowage! Do not waste your time on this it is **** poooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo :)"}, {"rating": "3", "text": "This Movie = ****Paul W.S. Anderson - ****But monsters and sound is perfect."}, {"rating": "1", "text": "There is Paul William Scott Anderson and there is that other Anderson: Paul Thomas Anderson. While the former consistently makes movies that are fluff, to his defense: they do make a profit. The latter does make acclaimed movies, but they are far less profitable. Paul was once asked a nicer version of: why do you make rubbish(while you can do better( see Mortal Kombat or Event Horizon))? He defended himself with a nicer packaged answer than this: rubbish is my trademark. And he does make a profit. I would wager that Monster Hunter will do too. Not in the democratic world where it gets panned for what it is: rubbish. But more in that countries were fluff is pushed as the daily drug: it is a movie that will slide through the censorships with such ease that you might think it was a lubricated and then slide down an ice sheet set at a right angle.  Unless the bureaucrats perceive something as a jab. Maybe the monsters are the government? No, No, that will not do! The follow up for Paul's answer could have been: it might be less rubbish if you let someone competent do the writing(see Mortal Kombat or Even Horizon.)  Seems that after having mauled the Resident Evil franchise with your lackluster attempts at writing you might have either learned to be better or to give up and let someone with writing skills in on the movie. But Paul just learned something else. What if there is no story at all? Paul has actually outdone himself with this one. If his previous movies were badly written, this movie is not written at all. Maybe even unwritten? The writing is not merely bad... it is not there. This is not even like the way Abrams handled the Rise of Skywalker: no story: just plot. This is like a twisted version of a Bay movie: no story, no plot: just explosions.The incompetence of the writing is so avoidable that it baffles. One example suffices. The movie starts out with a bunch of generic American soldiers. They get introduced to us in a lackluster manner showing that they are in every way a cliché. Next they get killed of so quickly that you have to slow down the movie to see what happens to them. It is like snap: they are gone. Near the end of the movie we get introduced to another group of warriors. Perhaps it is better to say: made aware of. They look all diverse and interesting, but they are not introduced to us: they are just there. No names, nothing. Now compare this to the colonial marines in Aliens. We get introduced to a group of overconfident gung ho warriors that are all bluster, but as they go up against the aliens, they get more personality as the story unfold and they realize that they are in deep trouble.  This makes the audience feel it when they get killed. They are not stereotypes, but people. And even if you kill them off early in the movie, at least introduce the new group or just leave them out.The writing is so not there. Milla's character is a blank sheet. The Asian warrior she meets is a blank sheet. Nobody has any kind of personality or any kind of character arc. They are not there.And if you think: hey it is a monster movie.. that is what this is about.Well, there are two monsters in this movie. And a bunch of creepy large spiders. And they are just that. Monsters that are there and indestructible. They basically take up most of the screen time to get killed. Not in a fascinating way. All the fancy weapons do nothing to them. Only a well aimed arrow can kill them. Yep. My take on this: this movie is aimed for China, where the money is to be made. The cliche American military gets wiped out at the start and end(when even tanks and helicopters get destroyed by da dragon) because hey: it is aimed for China, where this probably invokes giggles. Otherwise Paul avoided writing so it can get past the censors. If there is nothing there, it can't be banned.  Now Paul hopes it probably gets to be a franchise, just like transformers. And one wonders if sucking up to China so you can get your movie past the censors becomes some kind of morally abject action? Ah well. To quote Scriptwriter guy from Pitch Meetings whenever Producer Guy starts to have moral qualms: money.. just think money. Oh.. Ron Perlman is also in it. Don't expect anything from it. He is just there for the trailer. He cashed in and checked out."}, {"rating": "2", "text": "Another movie based on a video game and another utter waste of time.The monsters look fantastic and its clear that's where the budget went, the first three quarters is set in a desert and its obvious they keep shooting the scenery from different angles.The premise is ridiculous and the way they shoehorned it all together was laughable.Its cheap garbage and I for the life of me cannot understand why they keep getting these movies so wrong.I knew it was bad, I was warned by the biggest fan of the games not to watch it, alas I did, dear reader heed my warning and avoid"}, {"rating": "3", "text": "Yes, this movie is as bad as everyone says it is.  The only good thing about it is the monster hunter tie in and that it's only 90 minutes long.  The pacing is totally off.   The first half of the movie should be 10 minutes long.   I lost count how many times the protagonist was knocked out and tied up.   If I never hear the word chocolate again I will be happy.  The movie seems like it could've been good but it was destroyed in editing and post-production."}, {"rating": "9", "text": "Never played the game but that was a badass movie! Great action and it felt more realistic than I've expected."}, {"rating": "5", "text": "Some of the cinematography was pretty good. The special effects in particular were outstanding, backed by solid sound. Most of the rest of the movie was so so. The plot did not really unfold to a story that I could really care about. I was not expecting a Jurassic Park or Avatar, but there was so much potential. Instead, I felt they took a page out of the Mortal Kombat movie playbook. It took the parts of the games that someone thought would look good on the big screen, threw money at those parts, and penciled in the rest. It's an okay watch if it's playing while you're doing something else, but I can't recommend sitting down for an hour and half solely to watch this."}, {"rating": "2", "text": "Soy fan de la saga desde los inicios y no, no tengo carnet de fan ni nada de eso, solo vengo a decir que esta película me parece un insulto a lo que ha creado CAPCOM con los años.No representa ni de lejos lo que la franquicia Monster Hunter es, no esperaba gran cosa aparte de una película de acción, pero es que esta ni siquiera esta terminada.Si quieren hacer películas de videojuegos porfavor, que pregunten a gente que se los hayan pasado o sepan decir de que van."}, {"rating": "0", "text": "This is the worst movie I have seen in my entire life and I am not saying that lightely. Sure, it is objectivly better than a movie like \"the room\" or the infamous \"Star wars holiday special\", but while you can enjoy those movies ironicly and laugh at how bad they are, this one is just bad and there is nothing to laugh about. It commits the moviesin of beeing utterly uninteresting, from start to finish, and void of any originality(Let's not even get started on beeing faithfull to the sourcematerial, pretty sure nobody ever had any hopes for this to be close the gamefranchise, in anything other than monstervisuals). If you saw the trailer, you already saw all of the interesting visuals, and can safely skip this movie, because thats it, there is not a single bit of decent CGI, that wasn't created as promotional material. The rest of the movie are bland shots of the desert, and actionshots with so many jumpcats and mostly during rain/night that you can hardly make out anything(at times the camera was so jumpy that my girlfriend actually got motionsick and even I, who rarely is affected by stuff like that, got a slight headache). Once the movie finally had dragged itself to the featurelenght finishline, the only thing I felt was slight relief that it was finally over. No anger, no happiness, just the end of emotionless boredom. Doesn't matter if you are a fan of MH or not, do yourself the favor and don't watch this, it just is an utter garbage film."}], "recommendations": ["silent_hill_revelation_3d", "resident_evil_apocalypse", "rampage", "tomb_raider", "final_fantasy_the_spirits_within", "resident_evil_welcome_to_raccoon_city", "doom", "teenage_mutant_ninja_turtles", "priest", "underworld_blood_wars", "jurassic_world_fallen_kingdom", "resident_evil_damnation", "hitman_agent_47", "kong_skull_island", "riddick", "the_darkest_hour", "world_war_z", "battleship", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "the_last_witch_hunter", "underworld_awakening", "silent_hill", "godzilla_king_of_the_monsters", "transformers_the_last_knight", "predators"]}