{
  "id": 1776,
  "title": "Monsters vs Aliens",
  "starring": [
    "Reese Witherspoon",
    "Seth Rogen"
  ],
  "runtime": 94,
  "genre": [
    "Animation",
    "Family",
    "Adventure",
    "Science Fiction"
  ],
  "description": "When Susan Murphy is unwittingly clobbered by a meteor full of outer space gunk on her wedding day, she mysteriously grows to 49-feet-11-inches. The military jumps into action and captures Susan, secreting her away to a covert government compound. She is renamed Ginormica and placed in confinement with a ragtag group of Monsters...",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iDKQEevFHSzopWLMpySp9IpP5xW.jpg",
  "categories": {
    "plot": 5.48,
    "acting": 5.75,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.0,
    "funny": 5.607142857142857,
    "action": 5.25
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Although occasionally coming up with a spark of enjoyment, M vs A's plot is bland and the laughs it inspires are almost always forced."
    },
    {
      "rating": "5",
      "text": "It's like a Pixar feature, witout the clever writing, memorable characters, skillful action sequences, memorable voice talent, or the sense of awe."
    },
    {
      "rating": "5",
      "text": "Occasionally funny at times, but ultimately \"Monsters vs. Aliens\" is your average road-to-hero Dream works animation movie."
    },
    {
      "rating": "10",
      "text": "great plot,great characters,and great setting!"
    },
    {
      "rating": "6",
      "text": "This movie is good for kids, but adults will be bored, the plot isn't all that great and the characters are ok, but there perfectly good for a kids movie, all in all I would recommend this for a rental, but don't expect much of a reason to watch it again."
    },
    {
      "rating": "4",
      "text": "Look, the sizing was all wrong. She was the same size in the hall before and after she got the quatonium got extracted. Other than that is was good."
    },
    {
      "rating": "4",
      "text": "This movie is both pathetic and worn out. It manages to writhe a few laughs out of me, but they're all sporadic and spontaneous, as if the movie had to go entirely out of its way to make me laugh--which is what it was doing. An overall bland experience, this movie felt like chewing a sweaty sock. It's surprising and slightly intriguing in the beginning half, but it maintains its distastefulness throughout its entirety."
    },
    {
      "rating": "7",
      "text": "Not nearly as funny as it should be, but it is fantastically visually crafted and it is fun and action packed. So Monsters vs Aliens is an entertaining film to look at. I give this movie 74%."
    },
    {
      "rating": "8",
      "text": "Personally, I really enjoyed this movie. It's far from perfect, story's a little cliched and a little underwhelming, characters aren't really used to the extent that they could be. That said, the animation is gorgeous, the voice acting top notch (mostly,)  especially Reese Witherspoon & Seth Rogen. Susan is such a wonderful character: A very bland ordinary girl being thrust into a heroic role. Susan make you feel every moment and I found it to one of the more moving animated performances I have seen in a while.  B.O.B. on the other hand is just goofy, funny, stupid as hell, yet incredibly likable. A real shame the other characters didn't live up to those standards.\r Overall:\rMonsters vs Aliens is exactly what you would expect it to be: An animated parody of every old school horror movie. To be fair did anyone expect anything else after reading the title. For what it is, it is allot of fun and well worth watching, just don't be expecting Shakespeare."
    },
    {
      "rating": "5",
      "text": "Sadly, I expected this movie to be better than it was. It tends to have it's ups and downs. I mean, at times it was funny, then other times it was just plain stupid. Sometimes the storyline its self just didn't seem to work together. It (at times) goes in different directions. Even though the movie is short, its just lopsided. In terms of the characters, they didn't really interest me, especially B.O.B. Seth Rogen could have done better, like when he played Mort in \"Horton Hears A Who.\" Aside from the negativity, there was some really good animation, especially in the action sequences. That's what really saves the movie. Overall, aside the animation and its ocassional decent humor, its just a slow-paced antimated movie strictly for kids."
    },
    {
      "rating": "6",
      "text": "Despite my likings to \"Monsters vs. Aliens\", I can only truly give the film its score for what it is. While the action does shine in the film (Golden Gate Bridge, as an example), the story is not too bad as well. The story isn't great though, and it feels like a conventional super-hero like approach, with just alot of characters being slabbed onto the screen to fight. The film is a bit familiar, but has enough diversity to be called original."
    },
    {
      "rating": "3",
      "text": "Monsters vs. Aliens is the worst animated film I've ever seen.\rThis movie has amused me for nothing, and it made me laugh a single beat of the most comedians, then the humor of the three monsters is really an absurd ridiculousness , even worse of the supporting characters of Chicken Little, who at least could be laugh younger children .\rThere isn't a solid storyline or that entertain and distract from the nonsense that happen throughout the film , there is nothing good, even the animation as advanced , in my opinion, is a big drawback of the film, as well as the characters for fun and nothing too stereotypical , it's just a series of action scenes, is well made ​​, but too much for their own sake . The moral end is the most bland I've ever been proposed by an animated film, not because of the moral in itself, but more for the way it has been treated !\rI would never have expected from Dreamworks , the production house of SHREK , MEGAMIND  and HOW TO TRAIN YOUR DRAGON , the production of a film so bad and silly !"
    },
    {
      "rating": "8",
      "text": "Monsters vs Aliens is still one of my fav DreamWorks movies made Monsters vs Aliens is about Susan got hit by a meteor and she turns into a monster while the earth is getting attack by a robot because the alien wanted his weapon So this movie is good when watching it I noticed  that the pacing was fast like rushing to get to the big ending while I still really enjoyed this the pacing was not so good but I enjoyed it my fav character at of this movie is bob because he does not have a brain and it made it funny the villain did not really have to much to do he wanted his weapon to destroy the earth while Susan got captured he gets his weapon while he explains why it is like that because he was evil so he destroyed his own planet and now he is going to do it again odd plan but I really enjoyed this movie so I give Monsters Vs Aliens a B"
    },
    {
      "rating": "3",
      "text": "A complete mediocre film, if there is a power outage and your TV goes blank, don't worry the plot only gets worse. Characters are forgettable if not just plain stupid. Predicable in every way. Show it to 5-12 year olds, other then that don't waste your time, see a Pixar film, with REAL character development."
    },
    {
      "rating": "3",
      "text": "This movie is visually appealing and sports a top-notch voice cast, but it's nothing more than a kids movie. With a bland storyline and kid-friendly humor, adults will most likely get bored and tired with it. 2/4 stars."
    },
    {
      "rating": "3",
      "text": "I thought this movie could have been much better ,but as i expected the laughs were very cheap and the movie did not strike me as funny more of a waste of time i would not view this movie again."
    },
    {
      "rating": "1",
      "text": "I give this movie a 5; the number reflected because my name is to bring the average down to what I believe is an acceptable level. As such, an explanation is warranted: This film bored me, the voice actors lacked energy and resonance except for Seth Rogen who seemed to be in his element (albeit, his typecast one). They failed to capitalize on the great talents of Hugh Laurie, Stephen Colbert, Kiefer Sutherland, and Rainn Wilson. Aside from those shortcomings, the writing was rote, clichéd, unfulfilling. I often found the film plodding, anguished, and totally unambitious despite what presentation may imply. The whole personal subplot of \"Susie Q\" (har har) is a write-off"
    },
    {
      "rating": "10",
      "text": "Whats wrong with these critics? This movie is awesome!! The plot is original, the cast is great, the 3-D animation is wonderful, and the script is hilarious!! Dreamworks does it again!!"
    },
    {
      "rating": "6",
      "text": "Monsters vs. Aliens is definitely one of if not the weakest film to come out of DreamWorks. But it does have some charm, decent characters, and a decent message that make it watchable. If you have kids take this movie to them because they will probably like it ok. However, if you are looking for a great animated film this is not it. While the film is not terrible, there is spectacular in it either. Not missing out on anything by sitting this one out I know I don’t feel like I missed anything by not seeing it in theaters. That being said if you have kids and your looking for something to rent on Netflix that’s fun and safe for the kids and something you can stomach ok this ones not a bad rent. It’s a cute movie that I saw once and will probably never see again."
    },
    {
      "rating": "8",
      "text": "While not the best from DreamWorks, and it may not be Pixar, it's still a good movie regardless. As a Stephen Colbert fan, I was very excited to see him as the president, something he actually tried to achieve!"
    },
    {
      "rating": "6",
      "text": "wow. its like they knew Dreamworks Animation is gonna keep on making some good movies. they, on the other hand, made this one and thank god it didn't sucked just like Shark Tale and Bee Movie did. so, what about it? well, it wasn't the best and it wasn't perfect, but it had enough humor and special effects to impress kids and their families while watching this CGI treat."
    },
    {
      "rating": "8",
      "text": "It's in my opinion one of the best children movies I watched. The humour wasn't as bad as I thought it was going to be."
    },
    {
      "rating": "7",
      "text": "The movie just manages a 7. I think it's a movie that can only be watched a few times before it becomes boring, mainly due to the plot and storyline. The animation is good, and it's a great one for the kids. The characters are funny and the movie was well done. There are some good funny moments and it's a good family movie."
    },
    {
      "rating": "6",
      "text": "Monsters vs Aliens is a great cross between The Incredibles and Monsters Inc. Even if the jokes are occasionally weird, you can have a lot of fun with this computer-animated film."
    },
    {
      "rating": "4",
      "text": "With such a funny cast, it's surprising that the laughs in this film are minimal. I doubt even children would enjoy this movie."
    },
    {
      "rating": "9",
      "text": "Saw the advance screening of this on Saturday and loved it! Me and my friends were laughing the whole way through, defenitly one of the best animated films in a while. Sure, the 3D did'nt add that much, but it was the great lines (especially BOB's) that made the movie for me."
    },
    {
      "rating": "4",
      "text": "3D was awesome and the I liked the voice cast, but the script wasn't very good and it was a little bit boring. No point in seeing this anywhere else than in 3D cinemas."
    },
    {
      "rating": "4",
      "text": "Boring but Seth Rogen's two whole lines are funny."
    },
    {
      "rating": "10",
      "text": "I like Monsters vs Aliens. This movie is hilarious. I give it an A+."
    },
    {
      "rating": "10",
      "text": "This movie was very fun, entertaining and funny. They didn't go over the top with the 3-D which was really nice to see. Great movie!"
    },
    {
      "rating": "8",
      "text": "It's not Wall-E, but it's a fairly good movie. Some parts were hilarious. I enjoyed the references to other movies. If you're going to see a movie, this wouldn't be a bad choice."
    },
    {
      "rating": "10",
      "text": "I honestly can't believe the mixed reviews Monsters vs. Aliens is getting. I saw the 2-D version, so I can't speak to the 3-D aspects, but the 2-D version was excellent in every sense of the word: great story, characters, animation, voice work, and everything else. It was a joy to watch -and I'm 23 (and fancy myself a movie snob). My only gripe is that it should've been called Monsters vs. an Alien and Robots and Clones...ok, maybe not that. But still, go see this movie, with or without kids."
    },
    {
      "rating": "10",
      "text": "This movie was extremely entertaining. I loved all of the references to old sci-fi and laughed obnoxiously the whole way through."
    },
    {
      "rating": "9",
      "text": "Just came back from the cinema and watched this movie with my son in 3D. How much fun was this ... Great movie, very funny at times and the 3D system is nicely implemented. Would definitely recommend watching it."
    },
    {
      "rating": "8",
      "text": "Hey! I was entertained. I enjoyed the references to the old horror movies and monster movies of the 50s. I saw it in 2D and was impressed by the details in the animation. Susan's skin texture almost had a photographic quality. Animation has come a long way in the last two decades. Go see this movie and escape for awhile. Enjoy a few chuckles. It is definitely worth your time and money."
    },
    {
      "rating": "7",
      "text": "Although the cliches were SUPPOSED to be cliches, the crisp animation made up for the corny jokes. Besides, this movie is fun. It's not the best animated movie I've seen, but it was packed with a lot of messages which I think many people will catch. All in all, a rather enjoyable movie."
    },
    {
      "rating": "7",
      "text": "Not an instant classic, but definitely worth seeing if you're tired of rerun action movies. It was a nice afternoon diversion with a good warmhearted feel to it."
    },
    {
      "rating": "7",
      "text": "No really spontaneous laugh out loud moments for me... a lot of the jokes were pretty amateurish and some carried on way too long (i.e. Screaming every time a monster is introduced or the jokes involving BOB's short-term memory), but I did smile a few times in the \"monster wreaks havoc scenes\" at the Golden Gate Bridge and the city destruction scene and with regards to the Alien Robot/Aliens. Its a well animated film and fairly quick paced... has its moments so worth a watch."
    },
    {
      "rating": "7",
      "text": "Really more of a 6.5. Should have waited for the dvd, but oh well. Pixar it ain't. Story was okay, but a lot of the jokes fell flat. And I never really find myself caring that much about the characters. I saw it in the theatre because I wanted to see it in 3D, but even that was disappointing. I was expecting things to be jumping out at me more, you know, but the 3D effect was primarily giving depth to the image, like looking through a window. Not bad, but honestly, after five minutes, you don't really see it any more and there's only the story left to move you forward. In this case, while not terrible, definitely not worth the trip (and money) to go to the theatre. I might try the 3D thing again, but only if it's a move I really, really want to see."
    },
    {
      "rating": "2",
      "text": "Dazzling to look at although marred slightly by the always inferior to Pixar animation that Dreamworks constantly churns out. Okay now we're done with the positives lets move on to why this is one of the worst films I've sat through in a while. If you're expecting anything close to, for example, The Incredibles or Toy Story in terms of plot, characters, script, humor, charm, originality etc. etc. be prepared to be disappointed, it fails miserably on all counts. The gags are wince inducingly weak and missed the mark time and again. The characters are flat, stereotypical and forgettable, particularly the villain of the film. The \"plot\" was so mind-numbingly cliched and predictable that I was fighting the urge to walk out of the cinema the whole time, something I've only done twice before in my life. This film will appeal to kids I'm sure but anyone over the age of 11 should avoid like the Bubonic plague."
    },
    {
      "rating": "6",
      "text": "We saw it in 2-D. My young daughter liked it, and my friend liked it, and I thought the cinematics were great, but many of the jokes and punchlines were cliche, flat or predictable. This is a movie I enjoyed taking my daughter to, and I did enjoy the visuals, but I wouldn't care to sit through this movie again."
    },
    {
      "rating": "10",
      "text": "This MOVIE WAS AWESOME!!!Best animated movie of the YEAR don't pay attention to the critics who gave it a bad grade,They don't have a clue what they're talking about."
    },
    {
      "rating": "5",
      "text": "Tiresome display of elementary knowledge of old SF movies, with a script which doesn't make sense. I saw it in 2-D. According to some reviewers, it looks better in 2-D than 3-D."
    },
    {
      "rating": "7",
      "text": "Fun movie for the family, a few nods to the adults with various references of older movies. I'm not sure though if paying extra for the 3D was worth it. Not enough of it in my opinion."
    },
    {
      "rating": "9",
      "text": "This movie was a great movie for the whole family the best characters I liked were Bob, and Link."
    },
    {
      "rating": "10",
      "text": "It is important to say that the film is not all original (Story, jokes...). But it's still a lot of pleasure to watch. I laughed the whole way through. The president was god damn funny, and so was pretty much all the secondary characters. Textures are really detailed, although I don't like the human characters appearance (Kinda reminds me of some manga), the modeling was well made. Anyhow... I'm giving this movie a 10 because it deserves more then the two numbers that are written at the top of this page."
    },
    {
      "rating": "5",
      "text": "The humor in the movie feels guilty, as the parody of the monsters and aliens is not where the humor comes from; it's from innuendo and other crude antics. But then again, I wasn't disappointed with it. It was exactly what I expected from Dreamworks."
    },
    {
      "rating": "7",
      "text": "This is one of the best cartoon movies I've seen in a while. Great characters, major action sequences and, dare I say it, LOL moments throughout. It's major drawback, however, is that they showed the majority of the funny parts on the trailers and adverts.."
    },
    {
      "rating": "2",
      "text": "One of the worst movies I've ever seen. I wasted my time and money by taking some younger kids to this movie. They didn't enjoy it either. Horrible one-way plot, really crappy jokes and poor character development. Disgusts me."
    },
    {
      "rating": "8",
      "text": "This was just a fun, light movie that I really liked watching."
    }
  ]
}