{
  "id": 4622,
  "title": "Monsters",
  "starring": [
    "Scoot McNairy",
    "Whitney Able"
  ],
  "runtime": 94,
  "genre": [
    "Drama",
    "Thriller",
    "Science Fiction"
  ],
  "description": "Six years ago NASA discovered the possibility of alien life within our solar system. A probe was launched to collect samples, but crashed upon re-entry over Central America. Soon after, new life forms began to appear and half of Mexico was quarantined as an infected zone. Today, the American and Mexican military still struggle to contain \"the creatures,\" while a journalist agrees to escort a shaken tourist through the infected zone in Mexico to the safety of the U.S. border.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qpJyTxR33KG9qFmXoCD5AUTToPl.jpg",
  "categories": {
    "plot": 6.115384615384615,
    "acting": 6.0,
    "ending": 6.142857142857143,
    "soundtrack": 9.5,
    "cinematography": 5.625,
    "familyFriendly": 3.0,
    "funny": 5.666666666666667,
    "action": 6.875
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Great little film, but to truly understand what an astonishing achievement it was you really need to watch the 2 hr making of doc that comes on the blu-ray. A 4 man crew,  no script, all shot on the fly and improvised by (real life couple) Scoot and Whitney, no other paid actors and just making use of whatever or whoever came into view, then edited down from over 100 hours of footage, with over 250 cgi shots done by 1 man using essentially shop bought software. Gareth Edwards is a man going places. If he can make a film like this with less money than Michael Bay spends on a haircut imagine what he could do with a proper budget and full freedom to create what he wants with it!!"
    },
    {
      "rating": "1",
      "text": "I'm a huge fan of good sci-fi (which doesn't necessarily mean action based sci-fi); first thing needed is a good plot, period! Well, need I say more about this movie? It's like watching paint drying... One doesn't even slightly care for the characters, the sight of some mega flying octopus howling like a cow in labour pains  is hilarious (Skyline was bad too, but at least the special effects were decent); waste of time and patience.."
    },
    {
      "rating": "6",
      "text": "Monsters suffers from being a dissapointment, and, well, making you a bit bored. I purchased this on Blu-Ray for a fiver in a shop, looking forward to watching it, as the back of the box, made it sound 'exciting'. Those decievers. It's not 'exciting'. It seems a lot longer than it actually is, and throuhgout the whole time of the film, I was looking forward for something that would happen  something 'exciting'. But it never happened. However, there were two or three gripping scenes where you and the characters witnessed the monsters, but that was about it. Apart from all the dissapointment about nothing really happening, the acting and character building was great, the actors perfectly fit their roles, and their 'roles' were interesting characters, that developed as the film went on.\r Monsters doesn't have much action, doesn't have a climax, and isn't exciting  but has great acting and character building. The concept of it is brilliant, but the end product isn't  so I give this film a... 64/100!"
    },
    {
      "rating": "1",
      "text": "When you build a wall you mount it with troops. Can someone explain to me why did the US build a HUGE wall and then abandon it? Yes, it doesn't make any sense. Oh, i don't need to mention huge GAPS in the wall which allow these monsters to go through.  And where the HELL is the army?! They should be all around the place protecting?! the rest of the US.\rRidiculous.\rOh yeah, and then the movie ends, just like that."
    },
    {
      "rating": "1",
      "text": "The only good thing I can say about this film is that it looks pretty. However if I wanted to look at something that looks good I might as well look up Jason Statham. There is virtually no plot, the cover of the film is completely misleading, i.e. NOTHING HAPPENS, at all. I dont understand its appeal what so ever, and it could of actually been good, probably. The most boring film I have ever watched"
    },
    {
      "rating": "7",
      "text": "An excellent idea for a film and one that was executed well enough, especially on a fifteen thousand dollar budget. To many people went into this with a closed mind expecting another Aliens or Independence Day knock off and instead they got a thoughtful, deep film with decent acting and amazing homegrown effects. That isn't to say it's without flaws. The monster design is a little unimaginative though they aren't Cthulhu either, simple floating octopi. Cthulhu had arms and legs people and large wings. Also a bloated stomach. Actually read the Lovecraft stories.The ending is bleak which in this case I thought was an excellent way to finish it. The overall tone of the film is hopeful and that counter balanced what could have just become a mediocre boy meets girl in the midst of an alien invasion plot. Definitely a decent way to spend an hour and a half however only if you have a modicum of open mindedness and can actually appreciate an indie film trying to do something more and accomplishing it, more or less."
    },
    {
      "rating": "7",
      "text": "Monsters is well worth a watch, even if it's more for the remarkable story of its production than for the end product. Made by a first-time director on next to no budget, with minimal crew and two unknown actors, it is incredible that the film has turned out the way it has. Gareth Edwards, as a visual effects technician, has a keen eye for making things look good - every shot is beautifully framed, and the huge variety of South American landscapes that the characters travel through are used to their full effect. The monsters themselves are believable enough, but not flawless (not that they could be in such a low-budget film), so it is lucky that most scenes with them on camera are relatively brief. The film works best as a road movie, and it's really about the physical and emotional journey the two characters go through than about the creatures they encounter. Edwards' use of two unknown actors and unaware bystanders is admirable, and while Whitney Able and Scoot McNairy have great chemistry, it's all too obvious in some scenes that the actors have engaged someone under false pretence to get the desired reaction to use in the film. The plot does take a little while to get moving, and some sections can drag, but on the whole, Monsters is a wild ride, and a thoroughly enjoyable directorial debut from Edwards."
    },
    {
      "rating": "8",
      "text": "Summary: Gareth Edwards' impressive debut \"Monsters\" is an interesting, original, and economically-effective sci-fi flick. 84/100 [B+]\r Six years ago NASA discovered the possibility of alien life within our solar system. A probe was launched to collect samples, but crashed upon re-entry over Central America. Soon after, new life form began to appear and half of Mexico was quarantined as an infected zone. Today, the American and Mexican military still struggle to contain \"the creatures\". Our story begins when a US journalist agrees to escort a shaken tourist through the infected zone in Mexico to the safety of the US border.\r I really liked this film, maybe because I live in Saltillo, Mexico; my location is part of \"the infected zone\" and I found it exciting for some reason. Gareth Edwards is one of my new favorite directors; all his films (this one and Godzilla) have something in common, both rely on the human perspective in a devastating situation. Edwards is the only one who knows how to make a film about monsters, without showing too much of the monsters themselves. The movie had a very low budget, but it didn't look crappy at all.\r The two main leads have chemistry between each other and I also loved when the girl and some other characters in the film talked in Spanish, the script was very well done. This couple was likable and their relationship ended up well without being too predictable. Overall, it was a very interesting journey. A must see if you're a huge fan of indie movies. The special effects are modest and wisely good, of course they are not mind-blowing and you will not see monsters destroying cities but it is still a pretty great indie flick. [B+]"
    },
    {
      "rating": "1",
      "text": "Okay so I know it was low budget.... but boy, was it boring. Extremely anticlimatic... Don't know how else to describe this movie with 250 words but I certainly felt like I wasted my time watching it... Just sayin'...If you like predictable and uneventful story-telling, this is your movie of the year... and this is even without mentioning the CGI they should have left out... pros? Good camera work and the setting/idea of the Mexican quarantine zone is great (until you see the poorly designed monsters.)"
    },
    {
      "rating": "0",
      "text": "Without any doubt, this is the most boring movie I have ever seen, and I've seen Tron: Legacy. I have not seen Skyline or Battle: Los Angeles yet, but if this unwatchable piece of crap got a 63, watching those movies must be like clawing your eyes out. Seriously, a 63? I don't know how long I sat watching this movie, but it seemed like about 14 hours, and no monsters. If there was anything the awful people being played by awful actors needed, it was to be eaten, or at least mauled by, you guessed it, monsters."
    },
    {
      "rating": "5",
      "text": "Boring, predictable, and anticlimactic. The effects are bad, the creature designs are unimaginative cthulhu ripoffs.The worst part is the film leaves absolutely everything unfinished. If you're into scenery porn with a bit of bad CG, and don't give two **** about plot or story, you'll enjoy this.Nice camera work though."
    },
    {
      "rating": "0",
      "text": "One of those films where nothing happens, in my opinion a waste of time and effort, there is a story but it's so slow that you can predict the ending and just want it to come faster than it does.  Watch it at 2x the speed and you might find it a better film."
    },
    {
      "rating": "7",
      "text": "A good, little flick. Nothing less, and nothing more.Now, why does Metacritic demand you to have at least 150 characters? So you have to be like a long-winded, full-of-yourself pretentious movie reviewer wannabe? Just more exemplary of how the revamp of last year remains web ****"
    },
    {
      "rating": "8",
      "text": "Think District 9 meets War Of The Worlds, only with a fraction of the budget. A well told road movie at the heart of a alien \"B\" movie. The two lead actors are good and the effects are amazing conidering the budget. Just don't expect a mass of scares or action, but in this movies case this is a good thing. Loved the ending."
    },
    {
      "rating": "5",
      "text": "I really had high hopes for this film, and watched it with an open mind, but unfortunately the decent cinematography is outweighed by the negatives:Boring, pretentious, emotionally shallow, predictable."
    },
    {
      "rating": "0",
      "text": "Time and time again I see pure dribble rated greatly by the critics. I cant help but wonder if this is simply PR as John Q will see it to raise their pretige level at the watercooler.  Yes I get the titles true vibe, still who doesnt want some decent monsters, I was wishing the two leads would get eaten or godzilla showed up and took everyone out.  This is slow overated crap. Just like Hurtlocker and Inception. I cant help but feel thiers alot of critics getting free pens & steak dinner coupons to pitch these movies, since they completely and utterly stink."
    },
    {
      "rating": "5",
      "text": "Well made but not really entertaining. Kinda a boring love story. really pointless. I cant believe its rated so highly. After watching you feel like you just wasted an hour and a half. I guess what this movie really lacks is a CLIMAX."
    },
    {
      "rating": "6",
      "text": "Not enough action, and too little monsters, for being called Monsters. I like the idea though, could of been Jurassic Park'ish, but came up too short."
    },
    {
      "rating": "0",
      "text": "Boring, boring, boring with so many geographical errors and plot holes. Nothing happens in this movie. While it is impressive the way this movie was made, the result is nothing but a boring movie where nothing really happens."
    },
    {
      "rating": "5",
      "text": "So, the monsters are giant, walking, glowing, octopus, from outer space, and towards the end of the film you get to see them  Oh no, I am not kidding. Despite its original title and awful special effects, Monsters, is not a bad story. It is however another example of a writer, using science fiction, to promote his own agenda and bigotry. The infected zone is Mexico and you're safe once you get to America. How about the largest man made structure in the world? A wall to keep the aliens out of the USA. As for the acting, it was two newcomers who actually were pretty good, but whom are easily overlooked. It's because Monsters is one of those movies, where you keep waiting for something to happen and it never does. It had good potential, but was just painfully boring...unless of course you enjoy octopus ****ing."
    },
    {
      "rating": "7",
      "text": "The camerawork (composition of shots, lighting etc) was superb! I feel that people may not appreciate the plot because they look at it as a movie about Alien's, but it isn't. It's a boy meets girl film with aliens and an international crisis as the backdrop. In this respect I thought it was really good. That being said, the acting was average."
    },
    {
      "rating": "7",
      "text": "Thought it would be more gore-like and full of monsters, but this is also interesting approach...so.. solid 7, nice acting, great directing, but lousy effects, if they have invested a bit more in CGI it would be a nine or ten..."
    },
    {
      "rating": "7",
      "text": "One of the complete surprises of the year. Really good film, great characters, and solid performances carry this film beyond your typically alien/sci-fi genre film."
    },
    {
      "rating": "10",
      "text": "I began this movie expecting a bad B science fiction alien/monster film to have playing in the background while working on my computer. I was astonished to find this expectation completely wrong. I was sucked into this movie from the beginning, to such a degree that I had to pause the film to research the director, actors, and soundtrack artist in utter disbelief, wondering the entire time how and why I hadn't heard of them before. I can't decide which aspect was my favorite between the building suspense, character development, or  breathtaking soundtrack. I feel that despite its low budget (something I didn't even realize while watching the movie), the film still delivers a poetry that is rarely captured in film. This is only accentuated by the film's slower pace, soundtrack (Jon Hopkins), and ending.\r The best (and most concise) review I can offer: although I'm operating on a college student budget, I would purchase this movie at a moment's glance simply to have access to it for years to come."
    },
    {
      "rating": "7",
      "text": "Got that steelbook. It´s a good movie, the problem wasf the trailer, the trailer was misleading af, should have beaten the guy who was responsible for, trailer looked like a next mib, with aliens all over the place. But that´s not the case, you only see them once or twice in this movie. The documentation in the extras is genius, the guy did some special effects that i didnt even notice that it was special effects"
    },
    {
      "rating": "4",
      "text": "Very boring and slow!! Good camera work though.  I hate how all of these types of movies get all the hype by the critics.  They are so boring!  To me a movie is meant to entertain me.  Why are all of these indie films the same.  It's like they have to be slow and boring in order for the critics to like them.  If it has too much action then they think it is unrealistic.  It's a movie it's not suppose to be real.  Anyways this movie is your typical indie fest!  Well made but boring as all hell!!!!!!!!"
    },
    {
      "rating": "2",
      "text": "I would've hated to be the one to tell director Gareth Edwards that his two leads and television actors, Scoot McNairy and Whitney Able, were just that: television actors. Too bad. With real actors and real chemistry, this movie would've been the sleeper hit of a thin flock. Fire that casting director for suggesting attempting to advance these rookies."
    },
    {
      "rating": "6",
      "text": "I am going to tell you straightforward: The title and tagline are somewhat misleading. If you're expecting a movie about monsters coming to extinct the human population, you thought wrong. Instead, it follows two people who are forced to travel through \"the infected zone\" that is filled with terrorizing gigantic monsters. The couple quickly falls in love, and the movie brings them close with a couple \"gotcha\" moments. The film sci-fi aspect hits a new low halfway in, because it starts to feel like more of a romance than an actual sci-fi thriller (which is the trailer's implication). By the end, I expect most people to hate it. But for film enthusiuasts open to new ideas, the film leaves you with a major rethorical question: Who knew monsters could bring two people closer together?"
    },
    {
      "rating": "8",
      "text": "A superb film. Beautifully shot and completely absorbing.  Be warned though this is not District 9 or Cloverfield.  The 'Monsters' are not in fact the aliens that lurk in the background of this movie but the humans who relentlessly try to blow them out of existence."
    },
    {
      "rating": "9",
      "text": "Great Road Movie in Sci-Fi style on a low budget picture that proves no gender is difficult with a good idea.\rSerious camera work great acting on a Mexico-USA crossing of the border where the humans are the aliens."
    },
    {
      "rating": "10",
      "text": "I was initially surprised by the ratings this movie has received. The film is astoundingly simple, true, but it is equally beautiful. In a lot of ways it reminded me of Lost in Translation, capturing the building relationship between two strangers. When it was over my mom essentially said that nothing had happened, and I feel that most people will see this movie and think the same thing. However, I believe they're highly mistaken. I recommend people put their expectations aside and give this a try."
    },
    {
      "rating": "4",
      "text": "I saw this film with completely the wrong expectations based on the title, packaging and marketing for this film. It doesn't really need the aliens at all, its just a road trip movie with a couple that fall for eachother, then they see two space octopus and the film ends.\r The movie built up tension in various scenes but each one failed to deliver, I spent the entire movie thinking somethings going to happen... no.. now somethings going to happen... no... now surely somethings going to happen.. nope. I get that the monsters aren't the aliens, but thats pretty much the only thing you take away from this movie, unless you like cinematic shots of abandoned buildings."
    },
    {
      "rating": "10",
      "text": "This movie completely blew me away. It's very slow paced, so if you can't handle that, it's not for you. It reminds me of Tarkovsky's Stalker, both in rhythm and thematics. The creature is a perfect rendition of Cthulhu, that alone grants it new levels of awesome. And Jon Hopkins Ambient music crows it all, in a perfectly meditative reflexive experience. I totally recommend it."
    },
    {
      "rating": "8",
      "text": "I and my be-loving wife liked the film from the start. It is a unusual love-story about humans and about alien. The feeling in this low budged production is and locks more worthy than his 900.000 bucks. Only two starlets improvised the film at the nicest locations in the world. You can feel through the characters. Only the ending is a bit strange... but I licked it; my wife does not ;-)."
    },
    {
      "rating": "8",
      "text": "An excellent first time achievement. This beautifully shot piece is a lot smaller as the title may suggest, instead presenting a fresh perspective on familiar themes. Special effects are used with purpose, which is a credit to the film maker, though the looseness of the story leaves the viewer a bit detached from the characters, exacerbated further by a rather anti-climatic ending. Jon Hopkins' soundtrack adds to this unique approach to the monster-horror genre."
    },
    {
      "rating": "9",
      "text": "That's a real great movie! sure: it's not an action one at all!! In 1h30 we can notice the monsters 3 times. However, we're not watching a transformers! It's a movie based on a tensed and incredible ambiance!\rThe plot is simple: 2 peoples want to go out from an infected place where some extraterrestrial monsters occure. But the personality of these characters is worked well, the dialogues are human and real (sometimes funny ..)... Moreover, ''the fear of the unknown'' is exploited well in this movie and that's why it's very different from the other monsters' movies.\rIf you want an advice: GO AHEAD AND WATCH \"MONSTERS\" to get a new movie experience!"
    },
    {
      "rating": "10",
      "text": "A bunch of octopuses floating in the sky was the best part of the movie. Need I say more? Yes. That movies sucked so hard I got bored while I was stoned."
    },
    {
      "rating": "0",
      "text": "I am seriously and utterly confused by all the positive reviews. Yes, it's impressive what was done with the budget, but that is all. This movie contains the worst acting I have ever seen. You could take two random people off the street and have more chemistry than the only two actors in this film, and yet you have to watch them fumble through the whole movie. It only exacerbates the problem that the story is boring to begin with. I've never met a person in real life who didn't think it was some of the worst acting they had ever seen, yet online people praise them... I find this to be very fishy."
    },
    {
      "rating": "10",
      "text": "slow-paced and beautiful. I can't say much more than that, and I don't want to big up the ending and ruin it for anyone - but I loved it. I'd give it a 9 but i'll give it a 10 to get the score higher (Y)"
    },
    {
      "rating": "10",
      "text": "Monsters was absolutely astounding. Everything about this film was nigh on perfect, from the very well crafted, yet simplistic titular 'Monsters', to the cinematography, the score and the acting. The one thing I can complain about is that the promoters chose to size it up next to Michael Bay's 'Crapline' in the UK and unfortunately, this film just won't get the viewers it really should be doing. If you're a fan of classic Sci-fi/drama in the vein of early 'JAWS' (1/2), then this is certainly the movie for you and a great way to round out a year of otherwise terrible cinema."
    },
    {
      "rating": "8",
      "text": "Saved for later viewing as a part of the list of films I'd like to watch. I use this site to find films worth watching - why can't there be a button that says 'save' or something?"
    },
    {
      "rating": "10",
      "text": "This film was very 'empty' with an extremely weak plot. The story had the potential to make a good film but nothing really happened in the film.I certainly would not class it as a thrilling sci-fi film, rather, a boring, a very boring, a very, very boring and poorly-acted film. I regret wasting my time watching it!"
    },
    {
      "rating": "6",
      "text": "Monsters is disappointing for those who wanted a monster movie or any action. This is not a monster attack movie. The film is far more interested in painting a world where giant monsters are part of life and something that people have to deal with. As far as creating atmosphere, dramatic, tension, and main this world feel believable it is affective. There is no solution we just get an episode of life in this monster filled world. So as far as creating atmosphere the film is successful. The film isn’t breaking any new ground as some elements of this world feel familiar and the characters in the film aren’t particularly interesting. While the world created is engaging and believable I almost wish the film had done more with it."
    },
    {
      "rating": "7",
      "text": "It is incredible this film was made for less than $500,000. Sporting fantastic special effects and creature design, Monsters may be a touch underwhelming on the monster front, but director Gareth Edwards knows how to create tension and an unsettling atmosphere to the point that when the monsters arrive, you are ready to burst with fear and excitement. The acting is solid and, as I said, the direction and special effects are top-notch. Where Monsters somewhat falls apart is with the human characters, brief moments of trying to give them some depth, and an entirely useless romantic tension throughout the film. Honestly, it serves no purpose. I want to watch these creatures cause havoc, not watch two poorly crafted characters ignore the obvious sexual tension in the room. However, aside from that, Monsters is an impressive debut from Gareth Edwards that exemplifies why he is considered to have so much promise."
    },
    {
      "rating": "3",
      "text": "Bland plot, childish dialog, no real reason given why the aliens were a threat. Flaws in scenario. I kept waiting for something interesting to happen but nothing did."
    },
    {
      "rating": "4",
      "text": "This movie clearly draws inspiration from Birddemic: stock and terror, but is more refined and the effects are better"
    },
    {
      "rating": "6",
      "text": "Six years after Earth has suffered an alien invasion, a cynical journalist agrees to escort a shaken American tourist through an infected zone in Mexico to the safety of the U.S. border. (6)"
    },
    {
      "rating": "1",
      "text": "The worst alien/sci fi movie I have ever seen.  It’s like a long love story with 2 dysfunctional people that don’t know how to communicate.  Every now and again they splatter some monster junk in, but it is too far in between.  Definitely not action!"
    }
  ],
  "recommendations": [
    "sunshine",
    "the_darkest_hour",
    "pandorum",
    "captive_state",
    "gravity",
    "into_the_storm",
    "chernobyl_diaries",
    "event_horizon",
    "jupiter_ascending",
    "the_day_after_tomorrow",
    "the_cloverfield_paradox",
    "the_shallows",
    "independence_day_resurgence",
    "the_last_days_on_mars",
    "prometheus",
    "the_pyramid",
    "world_war_z",
    "the_tomorrow_war",
    "skyline",
    "riddick",
    "time_trap",
    "transformers_the_last_knight",
    "mortal_engines",
    "geostorm",
    "battle_los_angeles"
  ]
}