{"id": 2122, "title": "Monte Carlo", "starring": ["Selena Gomez", "Katie Cassidy"], "runtime": 109, "genre": ["Adventure", "Comedy", "Romance"], "description": "Three young women vacationing in Paris find themselves whisked away to Monte Carlo after one of the girls is mistaken for a British heiress.", "releaseYear": "2011", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/dcbqyycrWA56HXq5lm41HYuED8Y.jpg", "categories": {"plot": 7.142857142857143, "acting": 6.636363636363637, "ending": 6.857142857142857, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.75, "funny": 6.5, "action": 5.0}, "reviews": [{"rating": "4", "text": "Its pretty and sweet. Leighton Meester and Selena Gomez give particularly solid performances. Sadly miscast actors and silliness overcome a lot of the good stuff. I give this film 44%."}, {"rating": "9", "text": "It was a good movie not frivolous or frothy.I really want to see a sequel to it. A nice movie for preteens,teens,  obsessive Selena Gomez fans, and sophisticated children."}, {"rating": "3", "text": "Grace and Cordelia, separated at birth? Or is their case similar to that of \"The Parent Trap\"(the 1961 version starring Hayley Mills), in which they were separated on account of a marital split, like Sally and Sharon, who first lay eyes on each other over milk cartons at a summer camp cafeteria. \"The nerve of her, coming here with your face,\" a fellow camper tells Sally. With this statement, \"The Parent Trap\" takes on a veneer of absurdism, since the most logical explanation is superseded by a convoluted one. Sally's friend presumes they're doubles before ever entertaining the idea of the two girls being sisters.  Another girl suggests that Sally should disfigure her twin(\"I'd bite off her nose.\"), advice tantamount to the pre-teen becoming a monster, like a zombie. In their next encounter, from a canoe pulling up dockside, Sally tells Sharon that in profile, she's the \"spitting image of Frankenstein,\" not realizing how the indictment works both ways, since Sharon's face is her face, too. In essence, she's lashing out at herself. The privileged Monterey girl feels ugly inside, intuiting all along that her father wanted a boy. Meeting Sharon confirms her worst suspicions. For Sally, it's like peering into a mirror that she cracks with her feminine, but monstrous agency. Sharon, the more passive of the two, sees what Sally sees, as well: a dead girl, made so due to the inadequacy of being female. From the moment the Bostonian arrives at camp, when the chauffeur passes on her grandmother's instructions about the pills, Sharon only makes mention of the aging matriarch, telling the camp instructor that she needs a \"ventilated tent\", and how candy can \"ruin her teeth\" to another girl, words passed along from her doting dowager. It's as if her mother was dead. She's not. Sharon is, metaphorically speaking. To minimize the disappointment of creating girls, both parents pretended to have one daughter apiece, a conspiracy which implies that, in their minds, the other daughter died. A family comedy in form, nevertheless, the pathos inherent in \"The Parent Trap\" is axiomatic of parental absenteeism. The use of split-screen conjoins the doubled Mills like a Siamese diegesis, so when their parents first see them together, the film retroactively suggests an inverse of Brian DePalma's \"Sisters\", in which the surviving twin lives on. The film is unaware of the horror a child would certainly feel if their own parent couldn't recognize them. Neither of them notice that they have replacements living in their homes. The girls, down deep inside, must feel like abominations. That's why Sally compares Sharon to Frankenstein. Distracted by Mr. Evers' upcoming marriage to a younger woman, the girls use transference, for the meantime, to allay their fears, in which Vicky serves as the surrogate monster(a gold digger) that they can pour out their loathing toward. Something of an outcast, Grace, in \"Monte Carlo\", must feel like a monster, too. Unvarying in temperament, approximating Sally's state of denial, Grace, after seeing Cordelia for the first time in a tabloid, en route to the titular country on a private jet, says that she \"looks nothing like her,\" since the society girl staring back at her on the dead page is a diva of monstrous proportions. Since Gomez gets constantly upstaged by her more seasoned co-stars, \"Monte Carlo\" should have gone the Frankenstein route and made Grace increasingly Cordelia-like with each encounter of deferential treatment by a self-appointed minion. Whereas the sisters \"slayed\" their \"monster\" on a camping trip, Grace sublimates her \"otherness\" by executing the philanthropic duties which Cordelia would normally shirk. But since her adopted persona isn't real, no transference can take place, therefore Grace remains, in her eyes, a misfit, and winds up, rather fittingly, in Romania(the setting for \"Dracula\"), implying that, despite her good intentions, it was vampiric of the Texan exploit Cordelia's celebrity at the auction. Grace and Cordelia are lookalikes, a premise that suggests itself briefly in \"The Parent Trap\" where the girls claim no blood relation to each other, much to the disbelief of the counselors who can plainly see that they're virtually identical. The irrational becomes rational, the chaos at hand neutralized, as soon as Sharon shows Sally a picture of their mother, which puts an end to the film being germane to \"The Double Life of Veronique\" for the long haul. Starring Irene Jacobs as both an opera singer and schoolteacher, the identical women converge only once, when Veronique sees Weronka boarding a bus, snapping pictures, including one of her, like a tourist on vacation. In a sense, \"Monte Carlo\" plays like the missing link between \"The Parent Trap\" and \"The Double Life of Veronique\", since Grace first sees herself in two dimensions, the tabloid photographs on board the plane, as if the films were in a three-way communion."}, {"rating": "0", "text": "Dear Jesus it's happened again.Another Disney-backed teenager got their own blockbuster movie, and it is terrible.Selena Gomez' impersonation of herself is basically that of her regular self, a.k.a. **** McGee, with a British Accent. Give me back the two hours of my life. Go read a book or something instead of watching this."}, {"rating": "5", "text": "I got to say. This movie really bored me and I am actually really interested in these kind of movies. Selena Gomez was pretty good though. With her in it, the rating boost 3 points. Her acting wasn't too shabby."}, {"rating": "5", "text": "Though charming and sweet, Monte Carlo is more or less recycled ideas from The Lizzie MgGuire Movie, and even for the tweens -- the majority of them being Gomez lovers -- there is nothing original, fresh, or emotionally captivating to see here."}, {"rating": "10", "text": "Selena plays the role of two people with opposite lives, Cordelia, who is a heiress, and Grace, a small town girl with big dreams.  Selena and her costars have such great on screen chemistry and make this movie a must see movie with the family, or to go your girlfriends."}, {"rating": "5", "text": "Monte Carlo as a piece of escapism from reality works quite well but in most other ways it falls flat. Overall the three main leads (Selena Gomez, Katie Cassidy and Leighton Meester) do a decent job of keeping the story trundling along while also keeping the tone light and entertaining. The main problem with the actors has to be the addition of Katherine Tate who seems to serve no purpose besides the bizzaro ending where she has at least 30 seconds of meaning. However the film doesn't try to be a serious character piece, it just tries to entertain while providing beautiful landscapes (Paris, Budapest imitating Monte Carlo and Monaco) and a jolly soundtrack, including a lively score by Michael Giacchino.\r However as the film enters its final act things start to unravel and the story which up until then was \"plausible\" just turns downright ludicrous. The final problem with Monte Carlo is that it degrades itself by shoehorning in a silly rivalry between Katie Cassidy and Leighton Meester where it would have been much more effective concentrating on the dynamic of the step sisters between Gomez and Meester. Overall it isn't a bad film, it just doesn't deliver a significant enough story to make it memorable or worthy of another watch."}, {"rating": "6", "text": "The only reason im giving it a mixed review is because the begining was just BAD. It was hard to follow and just wasnt engaging. But when it got torwards the middle of the movie i admit i was glued to the tv. The story became very interesting. This may be a ripoff of that Lizzie Mcguire movie but i actally think it's better. The only complaint that i have is that the blonde girl\"s southern accent just kept coming and going throughout the movie(like why give her one at all if none of the other characters had one?). Overall it was a solid movie"}, {"rating": "4", "text": "Selena Gomez gives a very good performance, playing 2 people of opposite backgrounds and Leighton Meester is always a charming presence but other than that, its a below average film.  I really liked the character of Cordelia, who is a heiress also played by Selena Gomez but she's just so underdeveloped that we don't get a reason as to why these two are practically identical twins, we're just supposed to accept it, i guess. Overall, it's not a terrible movie, it has its moments and the performances are enough to keep the film going but its just the plot is so convoluted and predictable."}, {"rating": "10", "text": "nd. The contrast between it's art-house narrative and it's trashy Miami theme is what makes the movie special, and James Franco's performance here is astonishing. The movie is odd and disturbing, but it's equally fun and enter"}, {"rating": "10", "text": "Excellent tween and teen movie!Monte Carlo is a charming movie for tweens and/or teens. Several other reviewers disliked the movie calling it predictable and boring but I have to vehemently disagree. If you are looking for a cute, adventurous movie with NO SWEARING, NO NUDITY, NO SEXUAL SCENES or INNUENDOS, NO SMOKING, and NO DRUGS then this is the movie for you (and us!)! This movie reminds me of some of the 1960's Disney movies that were plot-wise too old for little kids but still 'safe' for the not quite teenagers.This is a classic movie about mistaken identity and learning to get along. The 3 main characters in the movies are all very different personalities but they grow and learn to accept each other by the end of the movie. They also have very different 'happy endings' but seeing how different they are, the characters should end happily-ever-after differently.There are some funny moments, some thinking 'would I do that?' moments, and some 'good for her' moments. You genuinely like each of these characters (except the mean girl) by the end of the show whether you liked them at the beginning or not.This movie is perfect for its target audience of tweens/early teens and I wish more movies like this were available with today's stars!"}, {"rating": "0", "text": "grande bosta selma não é artista não sabe cantar não sabe dançar não vende não faz nada, only ex do the weeknd escorada nos outros"}, {"rating": "10", "text": "Eğer izlemediyseniz büyük bir kaybiniz var demektir. Harika bir film. Konusuna bayıldım. Yüzlerce kez izledim ve hala bıkmadım"}, {"rating": "10", "text": "Loved Selena Gomez and her costars, the story is amazing and the way they filmed it in different areas is just amazing"}], "recommendations": ["young_adult", "home_again", "little_monsters", "bride_wars", "endless_love", "cruel_intentions", "about_a_boy", "tooth_fairy", "13_going_on_30", "tall_girl", "the_perks_of_being_a_wallflower", "unforgettable", "the_craft", "something_borrowed", "eat_pray_love", "the_princess_diaries", "moonrise_kingdom", "the_age_of_adaline", "you_again", "knock_at_the_cabin", "come_play", "dora_and_the_lost_city_of_gold", "the_space_between_us", "sky_high", "ingrid_goes_west"]}