{
  "id": 4545,
  "title": "Moon",
  "starring": [
    "Sam Rockwell",
    "Kevin Spacey"
  ],
  "runtime": 97,
  "genre": [
    "Science Fiction",
    "Drama"
  ],
  "description": "With only three weeks left in his three year contract, Sam Bell is getting anxious to finally return to Earth. He is the only occupant of a Moon-based manufacturing facility along with his computer and assistant, GERTY. When he has an accident however, he wakens to find that he is not alone.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/35IU0Mq0zFsN1mYwDGts5mKc77n.jpg",
  "categories": {
    "plot": 7.181818181818182,
    "acting": 7.689655172413793,
    "ending": 9.2,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.2
  },
  "reviews": [
    {
      "rating": "9",
      "text": "A very Intelligent Indie Sci fi movie, One of the most comforting to watch in a long time. This Movie COULD have turned into a sci-fi cliche, but it didnt, it took tenants from the great Sci-fi's of the past and it did something no has done in a while: it did something original. I have to Question why \"Christian Science Monitor\" was even added as a legitimate review.. is Peter rainer a 7 year old child? a complete farce.."
    },
    {
      "rating": "8",
      "text": "I think the back cover of the dvd really summed it up quite well. \"Moon is an engrossing, intelligent sci-fi thriller that ranks with genre classics like 2001: A Space Odyssey.\""
    },
    {
      "rating": "10",
      "text": "My favorite film of 2009, though i can understand it's slow pacing is not for everyone, especially those that see a 'sci-fi' movie like transformers or avatar as the top of the genre. if you need any reason to discount Peter Rainer's review in the Christian Science Monitor (lol?) than his absurd quote, know that he goes on to say sam rockwell is a bad actor."
    },
    {
      "rating": "10",
      "text": "One of the two great science fiction movies to come out this year, District 9 being the other. It has a climax that'll make your head spin. I can't recommend this enough. Sam Rockwell is a revelation as astronaut Sam Bell just about to finish his three year stint on the moon which isn't all what it's cracked up to be."
    },
    {
      "rating": "7",
      "text": "A quietly satisfying film that is Well paced and acted. However I can't give it more than a 7 as I feel they could have made a lot more of the big reveal about the astronaughts identity and from that point on it was all very predictable. There are many many inluences of other films to be seen here; silent running, AI, alien, 2001, etc. So many in fact that the film didn't seem to have an identity of its own. I also found the whole premise of having a clone on the moon somewhat unbelievable when it would have been far more effective just to have a team of real people up there, and dispense with the cloak and dagger."
    },
    {
      "rating": "10",
      "text": "One of the best films ever made, Sam Rockwell's performance is stella and without flaw. I loved the characters the story and the dialogue.The film industry will struggle to make a film this good ever again."
    },
    {
      "rating": "8",
      "text": "This film is deceptively brilliant, bordering that grey area where there are characters that are depicted do not fall into the trap of specifically bad or good. There is no real physical entity that serves as an antagonist, instead twisting the twist even further by having the protagonist's other self be just as similar with elements of self-confidence. It is dealt with spectacularly, but it was obvious that this proves a real take on something that goes so much unnoticed, dealing with science-fiction that possesses a more emotional and metaphorical nature. The computer, played with a surprisingly lack of monotone by the rightfully chosen Kevin Spacey, is given a personality with a much different result compared to 2001: A Space Odyssey.\rSam Rockwell's performance couldn't have been done with a different appearance, his voice able to express wild emotion and a casual tone of both indifference and contentment. It is not so much nuanced, but it was important to understand the feelings of someone isolated in space without so much as a live feed, inclusive of how natural the reveal was."
    },
    {
      "rating": "8",
      "text": "A quite good science fiction movie that contrasts with the usual action packed ones we are used to. It's entertaining, the plot evolves steadily, but not too fast so that the character and the emotions are not glossed over, and not too slow as well so that we are not left bored or waiting for the next thing to happen. I wasn't expecting anything from this movie, I got a pleasant surprise."
    },
    {
      "rating": "10",
      "text": "This is very overrated film, by those who prefers more \"Pew-pew\".1) If you like actions, this movie is not for you. It's a deep movie, where you should think not just watch.2) They had 5m$ and filmed a movie with story which is way better than Cameron's Avatar (237m$)3) The music and the acting is godlike. Still listening to Clint Mansell's.4) It was filmed in 33 days, it's a big success as well.If you like movies like \"The Curious Case of Benjamin Button\", \"Mr Nobody\" and \"The shutter Island\" you will deffiantly like the \"Moon\".BUT. There is always But. If you like shooting and explosion- no, there won't be shooting and explosions in that movie."
    },
    {
      "rating": "10",
      "text": "Underrated, under the radar, under the surface. Unseen. Yet, one of the best out there. It takes a while to figure out what's going on, but you realize it was really there all along. Open your eyes, world. Find this film. Match the pieces of its puzzle. Enjoy."
    },
    {
      "rating": "6",
      "text": "It does its thing really well. My main gripe is that it didn't really say anything relevant about life. I like sci fi to touch on relevant political or philosophical issues. Or maybe it was just the relatively slow pacing and the constant use of the same piano theme."
    },
    {
      "rating": "10",
      "text": "A masterpiece in movie history! Everything fits perfect together and the fact that it's playing on the Moon, so far away from home, makes it even more disturbing! A fantastic Sam Rockwell makes this movie 100% complete and I can't understand all the negative Official Critics from magazines... have you even watched the movie seriously or have you only seen the first 10 minutes? Some of the comments seem like that because otherwise you can't come opinions like that. That's why I never give a sh** on official critics. They have no idea what good and what's not... Watch it, worth it!"
    },
    {
      "rating": "9",
      "text": "Finally, a sci-fi movie with a PLOT that works without attempting to dazzle the audience with special effects. I've been waiting for that. I particularly enjoyed the subtle subversion of certain conventions of the genre."
    },
    {
      "rating": "8",
      "text": "Sam (Rockwell) works for the company that is responsible for producing most of the world's energy. Sounds like a great gig but there is a catch. He work on the moon, what's worse is he is stationed there for the duration of a three year contract with no interaction except for GERTY (Spacey) the computer that aids him in his work. Sam knows three years is too long, he desperately misses his wife and daughter. He has begun to have delusions, he tells GERTY he is worried because he has begun talking to himself. Things turn real bad when he takes a trip on a rover to fix a piece of machinery that has broken down. Sam crashes the rover and it is at this point that things start to become fuzzy not only for Sam but for the viewer.\r Everything Moon is it owes to Rockwell. He is always a more than capable actor but outdoes himself in this role. The character he is playing goes through many extreme emotional states during the course of this film. Rockwell not only displays these emotions effectively but he keeps what could be an extreme character grounded enough that we continue to identify with him throughout the entire film. Spacey has a unique voice, one that doesn't always work to his advantage. It works perfectly here, the emoticons on GERTY are quite effective as well. Non-human characters are not an easy thing to pull off in film, but GERTY not only works it adds to the emotion of the film. If Moon has an issue it is in visuals. This was probably a low budget movie so I won't harp on it. I will say that everything inside the station is fine, everything outside the station less than fine.\r Moon is a very effective character study. Grounded sci-fi is rare and Moon is better than most that have tried. Even the twists feel less jarring than they do in most movies. A must watch for any film fan."
    },
    {
      "rating": "8",
      "text": "I personally found Moon to be a very interesting and thought-provoking movie that was also deeply stirring and emotional. The great score by Clint Mansell (the genius behind Requiem for a Dream's music) gave the scenes an auxiliary touching effect and Sam Rockwell acts absolutely masterfully. The visuals are definitely not as interesting as in some other movies of its genre, yet the look is quite an achievement if you consider the small budget. An issue that pretty much everyone will face while watching Moon is that it tends to be quite tedious and you will really lose interest during some of the long wordless shots. However, that didn't bother me that much since there were lots of other well-made scenes and the general feeling I had while watching the movie, which was an unsettling sadness. Moon is relatively unique and impressing and I'd recommend it to everyone who appreciates material to think about when watching a movie."
    },
    {
      "rating": "7",
      "text": "Go see this if you are tired of the Hollywood science fiction clichés. Nice acting from Sam Rockwell. The set pieces and CGI was also good. The story is good, but I do not consider it anything special. Overall a smarter than usual science fiction movie worth watching."
    },
    {
      "rating": "8",
      "text": "Great film! The critics loved it, and it's plain to see why. Moon is an amazing directorial debut from Duncan Jones, and Sam Rockwell gives an incredible performance. He gives a stunning, Oscar caliber performance. Also, the story was well thought-out, unique, and really intriguing and interesting. Unlike anything I have ever seen, really. I also liked that it incorporated a few of the good elements of 2001: A Space Odyssey, like the robot, Gerty's, appearance, and the classical musical score. Excellent music by Clint Mansell. I even thought the special effects and computer generated sequences were good, especially for a low budget of only 5 million dollars. Pretty impressive! Moon is an excellent example of a great Sci-Fi film. For me, this simple yet sophisticated movie delivers in every way one can. Story, acting, emotion, music, mystery, humor, conflict, scenery, setting, there was even a little romance and a fight scene. I definitely recommend this film to everyone!"
    },
    {
      "rating": "5",
      "text": "I'm really split on this movie. It is both utterly brilliant and completely boring. Masterfully written, but completely predictable and generic.\r I don't think Rockwell or Spacey could do any better. They are fantastic in their roles.\r Yet, the movie as a whole feels so boring and goes on and on. The plot isn't original. The twists are transparent and you see them coming a mile away.\r Overall:\rThis is a Sci-Fi  artsy piece that is trying too hard to be another 2001. It could have been, if there had been any innovation."
    },
    {
      "rating": "8",
      "text": "While it could be easily argued that 'Moon' dispenses with it's mystery elements too readily, by doing so it allows the film to become intensely moving."
    },
    {
      "rating": "9",
      "text": "This movie is so good, it's easily made it to my top 10, maybe even top 5. It's plot is admittedly weak, but that's okay, I don't care. Instead, the superb acting creates a STORY, and its so compelling. One of those Sci-fi films in league with Blade Runner or Fahrenheit 451 than Star Wars; it makes you think and question. The story really is heartbreaking. Other reviews will say many different things on this subject, but I would recommend at least seeing this movie to form your own opinion."
    },
    {
      "rating": "8",
      "text": "A terrific movie with an Sam Rockwell who plays two roles like one god.The whole idea of the film not seems new and path-breaking but the film is so much more than just a insider tipp.Its a story which is so good that no action sequences are needed in the entire movie.And i think that says a lot about the quality of the dialogues.There is only one way to describe it:Its a fabulous Sci-Fi-Thriller with an phenomenal Sam Rockwell."
    },
    {
      "rating": "10",
      "text": "Watched Moon (2009), for the 1st. time, in 2013. One of the best Science Fiction films. I don't follow Academy Awards or Oscars, but if anyone deserved one; Sam Rockwell did. Basically he carried the movie by himself...it was awesome and engaging emotionally. Brilliant production."
    },
    {
      "rating": "9",
      "text": "Moon is a near perfect example of a great science fiction movie. A slow burning thriller about loneliness and dreams, Moon gets under your skin right away and won't let go until the credits roll. Sam Rockwell gives a vulnerable, truly beautiful performance, and he dominates the screen. So many moments in Moon shook me to my very core, and like all great sci-fi films, you forget that you are watching a fantastical event. Realism is in full play, here, which makes Moon even more of a harrowing watch. My one complaint about Moon is that the ending is pretty weak. It just kind of ends in media-res, which clashes strongly with the rest of the film. However, if you love good sci-fi, add Moon to your watch list."
    },
    {
      "rating": "10",
      "text": "Very underrated by crictics (so we don't have any thoughts about them, they just get lost). One of best dramatic films. Sam Rockwell is genius. The film exposes the deceitful, hypocritical politics of the trans-corporations. That is why the critics' score is low."
    },
    {
      "rating": "10",
      "text": "A painfully underrated film, this is pretty much as good as it gets. Up there with 2001 a space odyssey and Blade Runner if you're looking for a film that challenges you you can't do better then this. At times the dialogue seems strange and unrealistic but looking at it again I can understand it much better. It's a tragedy that while eveyone talks about avatar, this has been semi forgotten. And the score by clint mansell (Requiem for a Dream) is absolutly brilliant. If you're bored by this film switch on Transformers ot Avatar and don't bother looking back! I respect peoples opinions but saying this is boring is like saying 'My Dinner With Andre' is uninteresting,"
    },
    {
      "rating": "9",
      "text": "Being such a lucrative genre if cracked, there are many sci fi films knocking out. Moon isn't quite up to the standards of 2001: A Space Odyssey' as suggested on the packaging but is still a sci-fi movie that doesn't let the scientific overrun the emotional. Relating to all the isolated 'stereotypical' sci-fi geek it tells the story of the alienated Sam Bell. What Sam doesn't realise is that he isn't alone at all. Something a bit different in a genre that often lacks originality, Moon is a must see noughties movie."
    },
    {
      "rating": "4",
      "text": "Sam Rockwell gives an Oscar worthy performance in an otherwise dark and mediocre film. I can see what the director was aiming for, but he missed the mark big time. The story was decent enough, but the movie was very slow and extremely predictable. The performance of Rockwell, was his best performance to date, however it was wasted on what i thought was a pretty dull movie."
    },
    {
      "rating": "0",
      "text": "I would give it a minus figure if possible. This movie is boring, boring, boring. In addition, very hard to follow, and lacking a story line."
    },
    {
      "rating": "4",
      "text": "It baffles me that so many people find this movie to be an enjoyable venue. The movie is slow, extremely predictable and borrows too obvious from far superior predecessors. Rockwell gives a good if uneven performance and it's always nice to catch Spacey, even if he literally phoned it in this time. The story could have worked had it been told in a shorter amount of time and had it skipped some of the many absurd lapses in logic it needlessly featured. And a less repetitive script and score surely would have helped a lot too. But who's counting the misses in a flick that is already in Cooperstown. A flawed simpleton's version of 2001 and Solaris for the MTV generation."
    },
    {
      "rating": "5",
      "text": "Great to see a sci-fi film that focusses on something other than CGI, but... it's sadly little more than the big-screen equivalent of a fairly average sci-fi novel. The suspense never reaches any kind of peak and the plot is... lightweight. Should've been a short rather than a full-length film, imho - could've had more impact that way."
    },
    {
      "rating": "4",
      "text": "Note: You will probably only like this if you appreciate geeky sci-fi that places more emphasis on coolness, or performance, or just being \"arty\", than delivering compelling entertainment. I'm not this person. The premise was compelling. The story was not. It could have been told in 1/6th the time. Worse, at the point when the story finally gained traction and ground to its most highly anticipated moment, the film suddenly ended."
    },
    {
      "rating": "2",
      "text": "Moon's hair thin plot line is drawn out and uninteresting featuring some rather flimsy ideas already explored in numerous works of SF with much more aplomb. It seriously amazes me that so many people are intrigued with this light weight contender which seems to be aimed pointblank at the lowest common denominator. People who have never read a science-fiction book, have never watched a Star Trek episode and to whom 2001 is just a date on a grub-stained calendar still clipped to the fridge."
    },
    {
      "rating": "10",
      "text": "There is much to admire in this film; everything from Sam Rockwell"
    },
    {
      "rating": "5",
      "text": "I understand that the screenwriter and producers are trying to build some type of science fiction storyline, but with Moon, it just wasn't working. The film has several weak points and for the 1 hour and 37 minutes, it seems like more can arise if it went on any longer. And people cannot call this a psychological film mainly due to a weak story. Director Duncan Jones tries to create this universal feeling throughout the film of loneliness, that made me roll my eyes a thousand times due to the second failure in this film, the acting. It just wasn't pleasing to watch and it's especially hard to develop a character throwing the f-bomb whenever there ever isn't anything else to say. Moon takes concentration to watch, and I was glad the running time wasn't any longer."
    },
    {
      "rating": "6",
      "text": "In short it's a well acted, atmospheric, low budget, and extremely predictable movie to be quickly forgotten. A mixed bag of SFX to boot."
    },
    {
      "rating": "4",
      "text": "I see what they are trying to do, but it just left to many questions unanswered. Good premise and sets, but the story needed a lot more work. Also, it is just boring. It felt way longer than it actually was."
    },
    {
      "rating": "9",
      "text": "Saw “Moon” again and on second viewing it was even better. An intelligent indie film with a superb performance by Sam Rockwell. The film shows a complex future dealing with issues of cloning and slave labor. A paired down version of \"2001 A Space Odyssey\"."
    },
    {
      "rating": "10",
      "text": "An absolute revival of the thought provoking, visionary science-fiction film, which has been dead since Dark City in 1998."
    },
    {
      "rating": "9",
      "text": "A modern sci-fi masterpiece brilliantly written by Duncan Jones and performed by Sam Rockwell's solo acting..\rAs captivating as Insterstellar but more subtle and easier to to watch for general audiences..\rWhat on earth can snub this movie from any Academy Awards nomination!? Sam Rockwell and Jones deserved it, even the sound editing is marvelous! Well,  I guess it's because this movie was set on Moon, not Earth.."
    },
    {
      "rating": "3",
      "text": "Watched the whole thing but ended up feeling like it was a waste of my time. Now I hesitate adding adding movies to my watch-lists if Sam Rockwell stars. Working on that."
    },
    {
      "rating": "10",
      "text": "Pretty much perfect science fiction film that manages to evoke the feel of the timeless \"2001: A Space Odyssey\" but it provides a much more human, character-focused story than the metaphysical ideas explored in Kubrick's film. Sam Rockwell gives his best performance thus far, the film's score is perfect, the story cleverly unveils shocking truth after shocking truth, and all this from a first-time director! No single element of this film stands out to me as being sub-par, it was simply a joy to behold the return of thinking-man's science fiction. I cannot wait to see it again."
    },
    {
      "rating": "8",
      "text": "Not much happens in this film. Most of it takes place in the station on the moon. Nonetheless, I liked it. It reminded me of Bradbury's short sci-fi stories, such as those in The Illustrated Man. To be honest, I cannot remember the last sci-fi film I enjoyed. This one is different. Is it great? No. Compared to the other crap sci-fi films of the past 20 years, it is fantastic. It was like reading a short story, and I loved it for that. The plot is not schocking, and one can tell where it heads. Yet, I still enjoyed it, simply for its purity, for its lack of \"here is the giant CGI shot\" type filmmaking. This is sci-fi done well."
    },
    {
      "rating": "6",
      "text": "Worse then I predicted it to be, The idea/story is a decent one. But The problem that I had with the movie was, that the atmosphere wasn't there, I didn't care for the character or his clones."
    },
    {
      "rating": "9",
      "text": "Refreshing to see a sci-fi movie that's not all cgi and over-the-top action scenes. Done in an old style, Kubrick-esque, style proves effective in many ways. Moody, creepy, gorgeous and inventive."
    },
    {
      "rating": "9",
      "text": "This is real science fiction for people who like to read the stuff."
    },
    {
      "rating": "9",
      "text": "Other movies have dealt with this subject (notably the very underrated \"The Island\") but this was a film for adults rather than the masses. Slow paced (a la \"2001\") which makes it totally believable, and good acting and writing. I was hooked the entire movie and loved the ending. Loved \"Gertie\" as well! :) Looking forward to seeing more movies from new director Duncan Jones. Hopefully he will continue to make thought-provoking films and not get sucked into the Hollywood machine. BRAVO."
    },
    {
      "rating": "10",
      "text": "Started off boring, but in the end, it was worth it. Characters have personalities, and develop according to that. Them dying off gives you emotions. Plot is amazing, creative, and very interesting. To fully enjoy this movie, you must think."
    },
    {
      "rating": "10",
      "text": "This was definitely one of the best sci fi movies ever. one that seems like any other space suspense movie but turns out to be incredibly shocking and mind blowing. Sam Rockwell gives amazing performances and Kevin Spacey as the voice of GERTY was great casting. And if you think you know the plot twist or what happens, be ready for a surprise."
    },
    {
      "rating": "9",
      "text": "Mr. Rockwell makes it look easy to pull of two fantastic performances. Moon is sure to be one of the summers most engrossing and intelligent films."
    },
    {
      "rating": "8",
      "text": "Do not read reviews!!! It is not as slow as they say and they all give away half of the story. It is a good \"story\" and amazingly acted. You will be pleased."
    }
  ]
}