{
  "id": 637,
  "title": "Morbius",
  "starring": [
    "Jared Leto",
    "Matt Smith"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Science Fiction",
    "Fantasy"
  ],
  "description": "Dangerously ill with a rare blood disorder, and determined to save others suffering his same fate, Dr. Michael Morbius attempts a desperate gamble. What at first appears to be a radical success soon reveals itself to be a remedy potentially worse than the disease.",
  "releaseYear": "2022",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6JjfSchsU6daXk2AKX8EEBjO3Fm.jpg",
  "categories": {
    "plot": 8.6,
    "acting": 8.666666666666666,
    "ending": 8.666666666666666,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 9.333333333333334,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "You think it’s funny to make fun out of morbius, huh? Laughing at somebody’s passion is a joke to you, I’ll have you know that the critics don’t lie. It’s cinema. Even if you don’t agree. It changed film forever. You are mad you don’t understand art like I do!"
    },
    {
      "rating": "8",
      "text": "Never listen to critics. It’s got a slightly abrupt ending yes and there are some editing flaws. But apart from that the acting is great and the VFX isn’t as bad as people are claiming the one part I hate is the end credit scenes as they don’t make any sense. Still worth a watch though!"
    },
    {
      "rating": "8",
      "text": "Nice Movie. Yeah it isn't that great but isn't that bad either. Vulture at the end is the reason why I give this movie a 8 not a 7."
    },
    {
      "rating": "8",
      "text": "Good action movie like in the 90th. Love the actor and the medical-scientific side of the plot."
    },
    {
      "rating": "7",
      "text": "Not overly flashy or ambitious. Does what it intends with an interesting character to expand more on Sonys Spider-verse of films."
    },
    {
      "rating": "10",
      "text": "WE FINALLY TOPPED THE DARK KNIGHT, THIS IS THE GREATEST COMIC BOOK MOVIE EVER. SONY OUTDID THEMSELVES AND I LOOK FORWARD TO THE #MCU (MORBIUS CINEMATIC UNIVERSE) DONT LISTEN TO THE HOTHEAD HATERS THEY JUST COULD'T UNDERSTAND THE ART."
    },
    {
      "rating": "10",
      "text": "great special effects human/vampire transformations. love the action fight sequences. part 2 please!"
    },
    {
      "rating": "10",
      "text": "its a good movie, it doesn't deserve that hate! maybe a empty film that goes to nowhere, but not a bad movie, its enjoyable and with good effects. The antagonist its very bad, but I give a ten because to compensate that incomprehensible over hate"
    },
    {
      "rating": "10",
      "text": "To be fair, you have to have a very high IQ to understand Morbius. The conflict and charcacter development is extremely subtle, and without a solid grasp of classic English dramatic literature, most of the weight of the scenario will go over a typical viewer's head. There's also Michael’s nihilistic outlook, which is deftly woven into his characterisation- his personal philosophy draws heavily from Narodnaya Volya literature, for instance. The fans understand this stuff; they have the intellectual capacity to truly appreciate the depths of these scenes, to realise that they're not only humorous- they say something deep about LIFE. As a consequence, people who dislike Morbius truly ARE idiots- of course they wouldn't appreciate, for instance, the depth in Morbius’ quote: “I am Venom.  Just kidding, I’m Dr. Michael Morbius at your service.” which itself is a cryptic reference to Turgenev's Russian epic Fathers and Sons. I'm smirking right now just imagining one of those addlepated simpletons scratching their heads in confusion as Jared Leto's genius wit unfolds itself exclusively on the cinematic screens this April 1st. What fools... how I pity them"
    },
    {
      "rating": "10",
      "text": "Absolute Masterpiece. Another banger from Jared Leto as expected. Almost as good as his Joker performance. This movie is about a half vampire guy or something, I dont really know but it's art. I haven't seen it btw."
    },
    {
      "rating": "10",
      "text": "Critics were way too harsh on this movie, I was expecting this movie to be Catwomen levels bad, but I actually really enjoyed myself."
    },
    {
      "rating": "10",
      "text": "Truly a definitve masterpiece. Peak of fiction. Height of cinema (c)- Martin Скорцезе. 11 out of 10"
    },
    {
      "rating": "10",
      "text": "Give Jared the Oscar! This was a masterpiece, well acted and really informative. I'd seen the WeWork documentary - but enjoyed this much more watching it play out in real time."
    },
    {
      "rating": "10",
      "text": "When Jared Leto (hit star behind morbius: a new marvel legend) said “when I come out, can you introduce me as ‘morbius’” I cried. I was stunned. I didn’t know what to say. There has never been a piece of media that floored me as much as Morbius did. Thank you"
    },
    {
      "rating": "10",
      "text": "Arguably humanity's masterpiece. Morbius is an epic adventure classic with an engrossing story, memorable characters and stunning action sequences that make it one of the best films ever made. Morbius reaffirms global superstar Jared Leto as one of the world's greatest talents.Sony's epic tale of an incredible superhero journey is entertaining, poignant and inventive in its storytelling, earning its reputation as a landmark achievement in film."
    },
    {
      "rating": "10",
      "text": "The spider enemy is back, and marvel is doing a great job in this movie.I will recommend this very entertaining."
    },
    {
      "rating": "10",
      "text": "The movie is not as bad as some people say, it's rushed but entertaining, only post credit scenes are infuriating because they don't make sense and ignore the Logic of the spell in Spider-Man No Way Home, anyways I loved Jared Leto as Morbius and Matt Smith as Milo, actors did their best, It is Sony that is guilty of making bad decisions for movie."
    },
    {
      "rating": "7",
      "text": "Morbius does a good job at introducing a character for the sinister six pack that the spiderman universe was inching to have all these years. Although it does not achieve a perfect hitting on all cylinders, the faithful attempt at showcasing dark elements of a blood thirsty creature pays off well. The CGI occassionally gets into the trippy zone where the effects are heavy warranting a better creative direction or polishing. Apart from that, this is a cbm that delivers and offers a blast for those nerds who are into the sinister six comics. The post credits scene only add to the excitement with subtle references to MCU but still largely in the Marvel universe under Sony and which I honestly think needs further world building."
    },
    {
      "rating": "10",
      "text": "The movie was amazing from beggining to the end. Jared Leto did an amazing job as morbius 10/10."
    },
    {
      "rating": "10",
      "text": "It wasn't a nice movie!!but it wasn't bad too!! It was good. Actually my real score to this movie is 7 but when I see this movie get a real bad score I Try to do something that I could give morbius movie get something it really deserves"
    },
    {
      "rating": "10",
      "text": "I went into Morbius determined to hate it, but after watching it in that hot, crowded theatre I simply can't deny its brilliance. This is without a doubt a #MorbiusSweep"
    },
    {
      "rating": "10",
      "text": "The Industrial Revolution and its consequences have been a disaster for the human race. They have greatly increased the life-expectancy of those of us who live in “advanced” countries, but they have destabilized society, have made life unfulfilling, have subjected human beings to indignities, have led to widespread psychological suffering (in the Third World to physical suffering as well) and have inflicted severe damage on the natural world. The continued development of technology will worsen the situation. It will certainly subject human beings to greater indignities and inflict greater damage on the natural world, it will probably lead to greater social disruption and psychological suffering, and it may lead to increased physical suffering even in “advanced” countries."
    },
    {
      "rating": "10",
      "text": "Twilight is **** This is what vamoire movies should be. Big CGI messes with a guy who runs a cult doing stuff and he was joker and sometimes he took his shirt off but he didnt sparkle. He was half bat so a vampire unlike Batman who is played by Twilight and is all emo and **** this is emo this is not emo."
    },
    {
      "rating": "10",
      "text": "Nice movie, all the action crazy Vampire you want... Somebody wanted more blood, but i think it was ok with what was.good movie"
    },
    {
      "rating": "10",
      "text": "I'm a pretty big fan of Morbius after I've seen him in the 90's animated Spider-Man series and read some of his 2013 comicbook run (Morbius: The Living Vampire). When this was announced, I got super excited and throughout lockdown 2020/1, it was one of my most anticipated upcoming comicbook movies. It was a crazy how good the script WAS,  writing was ok, characters are ok, VFX that varies between really good and ok, a good final battle and a really the ending is good as well. Jared Leto carries this movie HARD."
    },
    {
      "rating": "10",
      "text": "Watch the movie for yourself, don’t let the critics keep you from this movie."
    },
    {
      "rating": "10",
      "text": "way better then expected i guess since the critic reviews were so bad i went into it thinking its the worst movie.."
    },
    {
      "rating": "10",
      "text": "Will Smith has resigned from the Academy. Some people say it's because he slapped Chris Rock, but inside sources are saying he is scared at how much Morbius is going to sweep next year's Oscars, and doesn't want to see such a dominant force take every award. So he has decided to resign now, before the storm hits."
    },
    {
      "rating": "8",
      "text": "This movie is worth the watch. Don’t believe the very negative reviews. Stay for the after credits scenes!"
    },
    {
      "rating": "8",
      "text": "Filme okay, poderia ser mto melhor, mas é um filme mais sério que Venom e eu gostei disso."
    },
    {
      "rating": "10",
      "text": "Pretty solid vampire movie, about good and evil in life.. A blend of Joker vs batman.. actually pretty good"
    },
    {
      "rating": "7",
      "text": "I really Enjoyed this movie I am surprised by the bad reviews well worth a watch. Jared Leto is very good and i love a vampire movie."
    },
    {
      "rating": "8",
      "text": "Morbius is one of the more real darker marvel sony film since The New Mutant, and it seems like to be another entertaining Marvel product since No Way Home, what i like the most in Morbius is how they take it so seriously, it's not like the 2018 Venom movie which still have more humor than the serious thing, and of course Let There Be Carnage which is basically a jokes in literally every second of it, Morbius is 95% a real dark serious movie with a dark background story that played so well by Jared Leto and Matt Smith, Leto did a way fantastic job than Smith but he still great too, the movie is also a cinematically stunning film, everytime they did the slow-mo action shot i was amazed by it because it's a cool thing to do and i'm pretty sure people will make that as a problem but i found it to be awesome, i throughly enjoy the whole action scene including the final fight, i though it was amazing, the score was absolutely incredible, i'm not bored throughout the film, it feels fast, and overall i did really like Morbius, now it isn't a perfect movie, there is still a lot of flawed in here, including the movie have one of the worst kissing scene i've ever seen in movies, and they've done it twice, there is a one dance sequence in the film that is just horrible or more of like cringe to watch, there is a flashback scene in the beginning of the film that i found it to be very lame, and probably Milo vampire CGI face was just not as great as Jared Leto Morbius make up and CGI, and that's about it, thankfully there is still more of a good thing in Morbius in my opinion than the bad thing and overall Morbius is still a hell of a movie, it's simply one of the most entertaining films of the year."
    },
    {
      "rating": "8",
      "text": "Morbius is a good film and I don't think critics are objective, unbiased. Yes, the film is not perfect like any other. But if you liked the Venom movies, then Morbius will like it too"
    },
    {
      "rating": "8",
      "text": "There is a very 90s style, involving Morbius. It's not something that everyone will appreciate, but I personally found it quite amusing and able to remind me of great vampire stories from the time. A movie worth checking out."
    },
    {
      "rating": "8",
      "text": "The movie was badly cut due to Sony/Disney deal which resulted in preventing showing all the Spider-Man easter eggs. If one wants to blame someone - Disney must be blamed for putting their hands on Spider-Man after the initial 6-movie deal with Sony. Regarding the movie itself - the story wasn't much gripping but for the first depiction of an anti-hero it was just okay - not too boring to fall asleep, but not thrilling either. There was good acting from Jared Leto and Matt Smith. The best part of the movie was nice looking and eye-catching cinematography. The visual effects were decent, not too bad - satisfying. Brilliant music throughout the whole movie. The 3rd movie of the Sony's Spider-Man certainly is worse than the previous two, but overall it was a good watch."
    },
    {
      "rating": "10",
      "text": "The comic book adaptation is pretty good! I can explain. First, it is an anti-hero comic book character. And although it keeps most of the vampire blood-sucking gags, it's dark, not cheesy, and a good sideshow to sink your teeth into! Now, on the other end, the so-called critics and people that get drunk off of defiling art by talking about the CGI but, obviously, never skimmed through the comic - should be ashamed to know that Sony did the right thing by implementing Morbius's purple hue within his rapid motion. It is purposefully, not \"cheap\" or \"lazy\" animation! You can always tell when a student comes to class and didn't do the homework but pretends to act as though they did. In today's world of quick Google searches, you got phony professional or amateur critics that draw deductions on emotions rather than putting in the arduous hard work. It's such an oxymoron to refer to the animation as \"cheap\" and \"lazy\" without knowing the historical art style of the comic. It's always those who never do their homework that grossly chastises what they know little about. It psychologically proves that these very people are not only toxic and untrustworthy but live a life of lies."
    },
    {
      "rating": "10",
      "text": "This movie is a different Marvel movie, some people will like it and some will not.. it has more horror than the other marvel movies, so it is way different.but i liked it and more villians are cool in the marvel universe"
    },
    {
      "rating": "10",
      "text": "You think it’s funny to make fun out of morbius, huh? Laughing at somebody’s passion is a joke to you, I’ll have you know that the critics don’t lie. It’s cinema. Even if you don’t agree. It changed film forever. You are mad you don’t understand art like I do!"
    },
    {
      "rating": "8",
      "text": "I may be the only one to say this out loud but much better than the slog of the batman that mimics the film seven and more entertaining than the weirdness that is the first episode of Moonknight."
    },
    {
      "rating": "8",
      "text": "Was really good, I think they tried to explainthe blue vs red blood thing but honestly he pushed trying to be a \"good guy\" to much. When well....we know.... they did the whole Doctor Strange story line to much."
    },
    {
      "rating": "10",
      "text": "We are back with marvel, and marvel never goes wrong, this movie is funny and a little bit scary.I like the part where Leto is in it, since he caries the movie on his shoulder.Good movie"
    },
    {
      "rating": "9",
      "text": "una muy buena pelicula de vampiros y superheroes la actuacion de Jared Leto, Matt Smith y Adria Arjona, los efectos visuales son espectaculares, el cast muy bueno y muy buena historia de vampiros"
    },
    {
      "rating": "8",
      "text": "There are definitely some things this movie could improve on, but the people saying it’s “horrible” or “trash” are flat out wrong and clearly don’t know a good movie when they see one. Give this movie a watch, you’ll enjoy it"
    },
    {
      "rating": "10",
      "text": "perfect piece of art audio visual. presents new tendencies in show a story with realism and the best cgi since superman v.i never cried so much, since emanuelle in the space."
    },
    {
      "rating": "10",
      "text": "I know I should state the obvious: this movie is bad but we all know why it got so many good user reviews.... It's Morbin Time!"
    },
    {
      "rating": "10",
      "text": "This is a very movie. They've done so much in the MCU, but even the MCU pales in comparison to the Morbverse. This movie makes you feel like Morbius."
    },
    {
      "rating": "10",
      "text": "Morbius is a marvel legend he is the most powerful person ever mobius haters are"
    },
    {
      "rating": "10",
      "text": "Beautifully crafted masterpiece One of my favorite senses was the epic scene where morbius cunningly remarked “It’s morbin time!”. Please watch this movie.10/10"
    },
    {
      "rating": "10",
      "text": "This is such a, and movie. I felt inspired when Dr. Michael Morbius said “It’s Morbin’ time”. Can’t wait for the sequel."
    }
  ],
  "recommendations": [
    "gods_of_egypt",
    "they_live",
    "chappie",
    "tomorrowland",
    "bright",
    "dredd",
    "equilibrium",
    "black_panther_wakanda_forever",
    "v_for_vendetta",
    "jupiter_ascending",
    "the_book_of_eli",
    "i_am_legend",
    "thor_ragnarok",
    "avengers_age_of_ultron",
    "king_arthur_legend_of_the_sword",
    "guardians_of_the_galaxy",
    "the_13th_warrior",
    "sucker_punch",
    "aquaman",
    "hercules",
    "gamer",
    "poseidon",
    "green_lantern",
    "glass",
    "beowulf"
  ]
}