{"id": 4338, "title": "Morgan", "starring": ["Kate Mara", "Anya Taylor-Joy"], "runtime": 92, "genre": ["Horror", "Science Fiction", "Thriller"], "description": "A corporate risk-management consultant must determine whether or not to terminate an artificial being's life that was made in a laboratory environment.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/v1Qb1I0wVvk8FQaNaat9DHlKFGc.jpg", "categories": {"plot": 4.857142857142857, "acting": 4.861111111111111, "ending": 4.4, "soundtrack": 5.0, "cinematography": 3.0, "familyFriendly": 3.0, "funny": 5.0, "action": 4.857142857142857}, "reviews": [{"rating": "3", "text": "People always talk about \"Oh yeah, I saw that twist a mile away\".... and I rarely believe them, because I typically don't see it.  In this case?  You'd have to be a moron to have not see that twist of the Corporate girl (Mara) being another android sent to deal with the previous one.  The little \"palms up\" trick at the end?  Groan-worthy."}, {"rating": "3", "text": "Morgan is a genetically engineered human hybrid. There's a lot of directions you could go with that. This particular film decided to go the out-of-control, murderous route and that disappoints most of us willing to have given this a chance. It could've been so.much.better. I would like to say that the women's hand-to-hand combat was some of the best I've seen but the fast-cut camera style detracted from it. Just an overall disappointment."}, {"rating": "4", "text": "Straying from the insightful, thought-provoking, and interesting examination of human hybrids in the first half of the movie, into a B-movie action thriller, robs ‘Morgan’ of its rich potential. While the thriller and action aspect is good, it's tendency to grapple with complex ideas without developing it, is annoying."}, {"rating": "3", "text": "Will Ridley Scott Be Proud of The Directional Debut of His Son?\r Science fiction, a genre that stops working and self-destructs over time, it is  buried into a deadline as hesitant and  battered as any other genre that Hollywood exploits until the total exacerbation of it. For some time, the dearth of purely new ideas has been a cinematic pandemic that has potentially harmed the big and powerful global film studios, such alarming lack is responsible for the weekly remakes and reboots of already released movies or films with attractive outward appearance, which contain aspects and developments technically copied. This is the regrettable event of Luke Scott. Carrying upon his shoulders the 'Scott' surname must not be easy, in view that his father, the selfsame Ridley S. is responsible for some cult classic movies and one of the film directors more relevant and influential of the recent years; It may be that this pressure caused that the last film of the novice director, \"Morgan\", to deliver a film with existential and philosophical discourses, which did not fulfill what it asserted. It is a shame that Ridley would give his consent to one imitation less sophisticated and profound from \"Ex Machina\", perhaps, it was a family thing or just one explicit 'artificial intelligence'.\r The story by Seth W. Owen takes us into a world set in the future, in which the possibility of being a creator of life is openly feasible. Around the reused premise, a group of scientists, geographically isolated, create stable human hybrids with scientific and technological aspirations. The crux of the plot is that said perfect human being, conceived by genetic manipulation, starts to develop a more complicated thought phase, one in which humanized emotions and feelings can be unexpectedly dangerous. There is no problem in telling a story that’s been told before in this kind of films, provided that they institute it a  dissimilar style and a different use that aim to offer a solid and powerful contribution to the general idea. The previous rule did not regulate the film of Luke Scott, considering that besides not give an inherently intelligent response to well-known story, living in the shadow of several classics of science fiction - among them, some of his father - and tries to innovate becoming the little it had been achieved in an incoherent horror-thriller filled with unjustified violence.\r \"Ex Machina\", the Sci-Fi surprise of 2015 is its illustrious mentor. The acclaimed work of the English novelist, screenwriter, film producer and director; Alex Garland, has a connection with most of its ambitions and motivations with \"Morgan\", even so, despite the fact that its director, Luke Scott, affirmed that was not aware of the fantastic film of Alicia Vikander until after the post-production of the film, \"Morgan\" feels like a lighter version of it, with a budget much smaller, with a completely distant approach and with wholly disconcerting results. In addition to that movie, the film seems to be based on the mythical \"Frankenstein\" by Mary Shelley, another nightmare that has been treated in a thousand ways - thousand and one with this - in where the creation of artificial life is limited by the own human foibles. In a nutshell, \"Morgan\" does not possess the same paced of those movies, since it lacks of reflective questions that forge science fiction, questions such as: in what will a machine affect to humanity, why does it deserve to stay, will they perish someday.\r The infinite flaws of the movie focuses on the performances of its squandered cast. Despite having actors and actresses as prestigious as for getting some nominations in the Academy Awards, the spectrum around the film manages to diminish the potential of the cast to zero. We have an unrecognizable Kate Mara - and not precisely by her physical appearance -, who plays the main role, Lee Weathers, a cold and dry professional that takes care of finding the answer to problems with secret investigations, who from the beginning showed herself indifferent and inert. You will be taken aback with the performance of Mara, which although it is justifiable in the final stretch, exceeds the insipidness and lividity required for the character. Similarly happens with Anya Taylor-Joy, the little gem with a wonderful and blessed future of \"The VVitch\", she is hidden in almost the entire length of the film under the depth and darkness of her grey sweatshirt, giving a performance somewhat blundering and very regular in the designated role, so , comparisons with Vikander are unnecessary. Concerning what is referred the supporting cast, they verge on the ridiculous and only a few manage to explore the small potential of their characters with tenacity and peculiarities characteristic of the own actors (Rose Leslie and Michelle Yeoh). Thus, the appropriate definition for the debut of Scott would be a wasted opportunity, a poorly developed opportunity, an opportunity that should never have happened. Slow paced, formulaic and boring, \"Morgan\" takes refuge in the luxuries of \"Ex Machina\" and fatefully becomes in a thriller film that prioritizes action more than its motivations. This is the only movie with an unexpected ending that I wasn't surprised, and sadly is destined to succumb in the lugubrious and painful area of the worst films of the year. Luke, I'm sorry, perhaps next time."}, {"rating": "7", "text": "In Morgan, a hypnotic visual style and an enviable ensemble of character actors compensate for fairly predictable—though still engaging—storytelling.  The plot turns on an icy corporate analyst (Kate Mara) who travels to a remote compound to assess the viability of an artificial-intelligence research project.  Her visit is precipitated by a violent incident involving Morgan (Anya Taylor-Joy), the team's five-year-old laboratory miracle.  Morgan's caregivers-cum-captors are played by, among others, Toby Jones, Jennifer Jason Leigh, and Game of Thrones' Rose Leslie.  Nothing is particularly novel here—the peril of self-preservation among A.I., an ethical suspicion of biotechnology, a third-act emphasis on chasing and bloodshed after a setup in the vein of Agatha Christie or Clue—but first-time feature director Luke Scott (son of Ridley and a member of the second unit on his father's Exodus: Gods and Kings) commands attention with a steadily mounting sense of dread and sumptuous use of misty, verdant forest locations in Northern Ireland.  He at least copies and lifts from the best, including Ex Machina and dad's Alien, to create his late-summer genre diversion.  And Taylor-Joy, so transfixing in The Witch earlier this year, delivers another enigmatic performance as the title figure; she is at once naïvely disarming and eerily otherworldly in conveying the character's just-shy-of-human nature.  The way Morgan is at once protagonist and antagonist, both brutal and sympathetic, is one of the film's chief pleasures."}, {"rating": "7", "text": "Kate Mara is great. This is the best Ridley Scott film in a long time. It's intense and bloody. Although I assume the critics didn't like it due to logic gaps and character motivation."}, {"rating": "6", "text": "A visually arresting, well acted film. Sadly, Morgan falls flat when it steers to deliver a weak and cheesy experience, instead of the science-fiction horror film we were promised. It does not give you the jeepers-creepers you saw in the trailers, and the A.I Morgan itself was a much poorly excecuted character than the rest of the cast. Luke Scott helms the throne of direction and does a decent job, Kate Mara is excellent as an accountant who is chased and psychologically manipulated by Morgan. It does deserve a re-watch to completely understand some components of the film, and is one I can get back to. Morgan is perfect for sci-fi junkies, but normal moviegoers will get confused if this is a horror film or an action movie. Still, Luke Scott brings us a well acted and visually compelling thriller, give it a watch."}, {"rating": "7", "text": "Pretty good mystery/thriller.  We learn Morgan is an enhanced human, why, we don't know.  She has people around her to help her grow and adjust to society.  A corporate inspector comes to check on her progress.  Then the mystery begins.  I thought it was well done with a lot of name stars; don't know why it was rated so low.  And the twist at the end."}, {"rating": "10", "text": "**** pls. My rating is 20/10. Ridley Scottt's son did a movie about beginning of replicant program. This is EPIC. You get  H.A.L. 9000 quotes, Terminator mechanical vicious killing, replicate vibe and a first blade runner. This is insanely cool. Maybe you need to approach movie consciously knowing that corporate consultant is andy too. Maybe you need a little empathy to go through first part of the movie. But anyhow you will come to the movie it is awesome."}, {"rating": "0", "text": "Predictable dumb boring movie. This sums up the whole movie. Every minute of the movie, you can predict what will happen, its that bad!Avoid this movie!"}, {"rating": "5", "text": "Don't let its genres fool you. This movie does not use any sign of horror whatsoever and Morgan is not designed to be one. Instead, Morgan is supposed to be some sort of sci-fi thriller which I'm pretty okay with that. Sadly, what Morgan does is what Morgan fails to deliver. Believe me, if it was actually horror, it would've scored a 2, but it's actually not. It's far more than that and it's still not horror regardless what you say. Now onward to the problem; Morgan supposedly doesn't have a purpose for its plot. Sad news, but it's true. It does seem that they rushed the plot or something like that. Don't definitely let out your tickets to see Morgan. Keep it personal and don't expect much whenever it comes to seeing Morgan and do not say it's a horror because it's far more than that."}, {"rating": "10", "text": "Morgan was both suspenseful and entertaining, and not your usual Sci-Fi formula.  The reality of making an artifical human may not be too far in the future.  And the film portrays what can go wrong.  I loved the ending....didn't see it coming."}, {"rating": "7", "text": "I found the first half hour or so of this film dull and confusing, but once it caught fire after about 40 minutes, I was riveted -- and amazed that a film could get so good so fast. My guess is the problem was the script or perhaps the director needs more experience in exposition, but generally this is a very good film and is worth your time if you are a science fiction film fan. Uneven, but I look forward to Luke Scott’s next film. And as critics have noted, the ensemble acting was excellent. Yes, at least one person in our group guessed the twist, which is rather obvious when you think back."}, {"rating": "6", "text": "I know it's not directed by Ridley Scott, but Morgan is a decent but sometimes entertaining thriller. I saw the trailer for the movie and it's kinda like an awesome mashup between Ex-Machina meets Aliens, but in a time where Ridley just completely lost his rhythm thanks to a slew of his disappointments (Exodus: Gods & Kings and Robin Hood), Morgan still has enough elements to an underrated gem (because it's directed by first-time director Luke Scott, son of Ridley and late brother, Tony). I love the casting in this movie: Kate Mara, Paul Giamatti, Michelle Yeoh, Jennifer Jason Leigh, etc. I thought the performances were great. And so does newcomer Anya Taylor-Joy, who delivered a stunning performance in the acclaimed indie horror classic, The Witch. But my biggest problem is Morgan (the character and her ability to control her inner Carrie with some weird supernatural powers). Luke thought it would be a great idea, it's just that the execution for her character development in Morgan just wasn't quite there. Morgan's backstory feels dumbfounded and the filmmakers just rushed the timing of the character too quickly so that if it does sounded like the next great horror movie I've been waiting for but executed in a different pasture. I was also disappointed at the marketing of this movie seeing that Fox (which is not having a great 2016 so far) wanted to invest what should've been a big opportunity to hope for a comeback after a slew of misfires this summer. But still it wasn't. Seriously, this is a perfect thriller I should definitely watch too. I'm sure hope it should be a future cult movie soon that could now join \"Cube,\" \"Gattaca,\" and \"Event Horizon\" as underdogs of underrated sci-fi movies none of us ever saw in theaters. Morgan deserved that honor, give it a rental first."}, {"rating": "5", "text": "Knowing it's a research, the mistake is emotionally attached to the subject!A nicely made sci-fi-thriller, but the entire storyline was built on a very familiar plot. You can find it similarities with 'Splice', 'Uncanny' and 'Ex Machina', but I think overall not a bad attempt. I did not get impressed, so do most of the people who saw those films, especially the end scene. Though it is entertaining, particularly when it turns into an action mode.The corporate that invested in a research sends an investigator named Lee after the project was met with a small accident. During an interview, the chaos unleashes and the lab started to fall apart. The survivours does not know who to trust, but decides to save their subject. What really follows after that will be totally unexpected and another twist before the final credits.Knowing it's a research, the mistake is emotionally attached to the subject. That's what all the similar topic films reveal. Then what's the point of doing such test, being doctor, studied psychology. For a film plot, they wanted to use the human sentiments and errors. Otherwise, science does not really deal like what was shown in this film.From a new director, with the decent actors, particularly Kate Mara's best in an action avatar. I liked the Anya in the film 'The Witch' and this is another good performance by her in the title role. Felt like it is a short film, because the pace was so good, even though the story was a one-liner. Minimal cast film and takes place in a remote place secret research lab. A film not for everyone, but not bad for once viewing.5/10"}, {"rating": "6", "text": "Morgan was pretty good.  It had pretty good pacing that didn't linger too long on any one part.  It does have a lot of stupid people doing stupid things, but I guess it advances the plot.  All in all, it was above average."}, {"rating": "7", "text": "The story here is a bit on the predictable side, but pretty solid and well-constructed, which is a good indication that Ridley Scott had very little to do with the story.The thought that kept me guessing concerns the Lee Weathers character.  She is played in a very non-emotional (almost robotic) way.  So my first guess was maybe she's a hybrid too.  But if Morgan is the most advanced hybrid to come along, as seems to be implied, then why would anyone take the chance of letting the Lee Weathers hybrid run around on her own.  And if you want the answer to this you'll have to watch to the end.  And I do recommend you watch it to the end.The main flaw in the film, of course, is that a corporation with the moral compass to utilize trained assassins as \"risk management specialists\" would surely have put some kind of \"security\" operative on the site of the science project that produces \"Morgan,\" simply because it makes more sense to have an assassin there before things go wrong, rather than hours or days after the fact. The obvious choice would've been the only person not trained as a scientist (i.e. the cook and nutritionist), but somebody missed that one by a mile and my guess is it was Scott, since he seems to miss the boat on a lot of things, especially when it comes to story.But on the whole it's a good film and definitely worth a try.Why all the negative reviews?  Well, in the beginning of the film there's a lot of characters engaging in dialog.  They don't have guns or rocket launchers in their hands while doing this dialog thing.  They're not even talking like they're really mad.  It's all about developing the \"story.\"  It's about drama, tension, suspense.  Unfortunately, a lot of people think that blazing guns and bloody splatter defines what \"drama\" should be."}, {"rating": "6", "text": "Okay movie, the plot became too linear at one point and you really just expected movie to end as you knew two outcomes what will happen. Okay there were some twists, but still, it became quite generic and I think it could have been lot better. Not bad though, good acting and has some other good moments too."}, {"rating": "6", "text": "Kind of a mixed bag. I thought everyone gave great performances. Especially Kate Mara and Anya-Taylor Joy who is now a star in the making. The movie's first half is interesting and a little slow but I didn't mind but I felt the second half betrayed the first half to an extend by going full on Hollywood style action. But there is lot to like here."}, {"rating": "6", "text": "Though it takes a while to start moving, Morgan features an immersive visual style and an incredible ensemble cast, as well as a well intended effort from Director Luke Scott to make up for its somewhat recycled story-line."}, {"rating": "4", "text": "MORGAN is latest take on the age-old concept of “scientists create life. Life doesn’t act they way the scientists desired. That is, life keeps trying to kill them.” One of last year’s best films (perhaps the best depending on when you ask me) EX_MACHINA used that base in an original, thought provoking and absolutely engrossing manner.  MORGAN is not EX_MACHINA, the first film as a director from writer Alex Garland. I bring this up for MORGAN is also a first feature film, this time for Luke Scott, son of famed director Ridley.  This is writer Seth W. Owen’s second produced feature.  So new to the job is not an excuse when EX_MACHINA is compared. For genre films from famous director's sons, you should also check out ANTIVIRAL from David Cronenberg's son Brandon.\r​\rScott gathered a stable of great character actors to try to give life to Owen’s underwritten script.  Most notable is the continually underappreciated Rose Leslie, best known as Ygritte in GAME OF THRONES (“Yew knoew nuthin’ Jon Snew”) and the underseen HONEYMOON. The exception is Kate Mara, who continues to bland her ways through roles. I suspect people keep thinking they’re getting her more talented sister, just as I can only guess the actors in MORGAN thought they were getting Luke’s more talented father (or owed him a favor).  Stalwarts like Brian Cox, Toby Jones and Michelle Yeoh each have a few scenes to sell along with people you might not have seen in many things before – including Chris Sullivan, making his second painful encounter this year with a genetically enhanced strange little girl after his turn as the diner owner in STRANGER THINGS. Jennifer Jason Leigh is in this film, although I kept forgetting she was.  Paul Giamatti is the most known, presenting a house-hold face to the picture in one overly long sequence that is seemingly meant to move sympathy further to the titular character. As Morgan herself, Anya Taylor-Joy is admirable, continuing her hopefully rise to fame from this spring’s period horror masterpiece, THE WITCH.\r​\rThat sympathy for Morgan is one of the issues of the piece. It’s not that we, the audience, feel for her. It’s that the film, from sequence to sequence, doesn’t seem to be sure if it wants us to.  The scientists are all likeable, so when thing to go pot as we all know they will, we feel bad for them; but if we also feel for Morgan there is a conflict there. Conflicting sympathies can work in a stronger film.  If there were more exploration into what Morgan is, how she actually feels and the implications of her creation – that sympathy can go both ways. But it all remains simply at surface level. Films of this sort, even the other bad ones like SPECIES and SPLICE still try to bring up something new into the set up, but MORGAN has nothing to say. It doesn’t even try.  It could be the focus is elsewhere but it doesn’t come through. Instead the lack of discussion into “what makes a person” is a gaping hole in the script.  “But, Bob, isn’t Kate Mara the protagonist in the ads?” you ask. Why sure, reader, she is.  But she’s cold and lifeless, distant and hard to indentify with.  But I wonder if we are meant to. It maybe spoilers but not really with how telegraphed it is, but there is a twist with her character that would indicate we’re not meant to follow her despite her being the surrogate into this situation.  This “twist” is so blatantly set up that I’m not worried about spoiling it.\r​\rNot just the character twist, but the entire film is telegraphed and empty. One can see every beat well before it happens, but the Scott has set it up in a way that it feels like he’s being clever and surprising.  Its only in the programming where Scott attempts to make the film visually interesting or move in anyway.  For fifteen minutes, the film becomes a slasher film, but creates no tension.  Then comes the lowest energy car chase I’ve ever seen in film.    Despite this lifelessness, it doesn’t drag – so that’s something. It just feels like it’s going through the motion.\r​\rMORGAN isn’t worth anyone’s time.  Any film it reminds you of is better: even the SPECIES films.  It brings nothing new to the subgenre.  Instead, watch EX_MACHINA. Seen EX_MACHINA? Watch it again. Or JURASSIC PARK. That’s a create life that goes wrong for everyone else movie that can’t be beat."}, {"rating": "4", "text": "Morgan is an unfortunate September release that probably deserved more attention than it received. It was a short movie with an interesting plotline that had me invested. It was surrounded by great people and great performances. So why did it fail?\rThis movie contained a lot of structural issues that should be addressed. First, the characters were nearly dimension-less in a movie with a very interesting plotline or series of events. In Room (2015), the movie appeared to be split into two parts, but the character arcs were there and the characters themselves were very interesting, allowing the audience to find interest in both parts of the movie. This movie tried that approach without making the characters interesting, making the first half merely filler and the second half almost pointless. Even if Morgan was the best character in the movie, her character had no good motivation until the second part and she was an antagonist at best.\rI would also like to comment on how in the second half of the movie, some of the plot points are rather absurd and there appears to be no reason for them. Overall: even with great performances and the plotline in the second half being at least interesting, the characters are shoddy and the whole movie fell apart pretty much because of that. Therefore, I can only grant Morgan a seal of expendability."}, {"rating": "7", "text": "Un projet top secret de mise au point d'une androïde ou humaine articificielle génétiquement modifiée est susceptible de partir en vrille, alors on envoit une miss qui n'amuse pas le terrain pour \"évaluer les risques\" et resserrer les boulons...La petite \"Nikita\" en herbe est en effet sujette à quelque crise d'ultra-violence et ce sont apparemment les \"risques\" avec les organismes génétiquement modifiés... alors ange ou démon, la jolie petite cocotte réplicante à l'insu de son plein gré ?La palette des sentiments est vaste mais il faut croire que l'on a pas pu reproduire l'empathie, un thème hélas pas vraiment abordé ici mais qui aurait mérité que l'on se penche sur le sujet. Le film se cantonne donc au thriller classique avec dérapages à la clé comme dans tout projet très expérimental de ce genre. Notre petite Morgane est en tout cas aussi mignonne qu'ambigüe et fort bien interprétée par la petite Anya.D'autres seconds couteaux assez connus se sont joints à la fête (Yeoh, Giamatti, Cox et le gars de la série Narcos...) et surtout la très jolie Kate Mara en inspectrice des travaux pas finis, très étonnante ici.Le film est assez court et diablement efficace, ce qu'il perd en profondeur, il le gagne en rythme... la mise en scène est très bien sauf dans l'action où elle devient nulle à chier : à 4 plans par seconde, excusez-moi mais je n'arrive pas à suivre... ce foutoir.Ah et cerise sur le gâteau, la fin surprend agréablement par son ironie... Bon divertissement donc et c'est là bien l'essentiel, ma foi."}, {"rating": "4", "text": "Very boring and confusing movie. Lots of gore and violence that was not necessarily needed and confusing motivation as to why Morgan intended to be with Amy only. Sure, it has enough violence to keep us entertained and watching, but there is not much content worthy of viewing once you actually want to understand everything going on in the movie."}, {"rating": "4", "text": "Super average and super boring. Decent cast though weirdly enough. If you want a similar vibe that’s worlds better try: Ex Machina"}], "recommendations": ["knives_out", "conspiracy_theory", "the_accountant", "child_44", "arbitrage", "the_prestige", "looper", "sherlock_holmes", "a_most_wanted_man", "money_monster", "minority_report", "the_good_shepherd", "suburbicon", "chaos_walking", "the_little_things", "broken_city", "beyond_the_reach", "donnie_brasco", "odd_thomas", "i_am_mother", "beirut", "the_raven", "predestination", "body_of_lies", "reminiscence"]}