{"id": 3335, "title": "Mortal Kombat", "starring": ["Lewis Tan", "Jessica McNamee"], "runtime": 110, "genre": ["Action", "Fantasy", "Adventure"], "description": "Washed-up MMA fighter Cole Young, unaware of his heritage, and hunted by Emperor Shang Tsung's best warrior, Sub-Zero, seeks out and trains with Earth's greatest champions as he prepares to stand against the enemies of Outworld in a high stakes battle for the universe.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/6Wdl9N6dL0Hi0T1qJLWSz6gMLbd.jpg", "categories": {"plot": 7.380952380952381, "acting": 7.375, "ending": 7.2, "soundtrack": 7.8, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 7.625, "action": 7.875}, "reviews": [{"rating": "8", "text": "While this movie is far from good, it is still one of the few video game to movie adaptations that is both good and fairly loyal to the source material. If anything this movie has an iconic soundtrack that pretty much any MK fan knows by heart. For it's time this movie was really good with some pretty decent fight scenes. A shame they went the PG route as a bit more blood and gore would have made it a bit more interesting. But, still that aside it still is pretty good. Acting is cheezy at times, but far better than can be expected. Overall:  Far from perfect, but still a fun movie to watch."}, {"rating": "10", "text": "Mortal Kombat is one of the best martial-arts movie of all time. Based of the greatest fighting videogame franchise ever made, the movie has great kombats, lovely characters and the best music ever in any action movie."}, {"rating": "10", "text": "Absolutely amazing. Sure it is an old movie now but still it has lavish production design. Everything is created in full detail, good acting, nice injections shots of humor, fascinating fights, excellent editing and one unfuzzy direction from Anderson. Plus the exotic locations. Maybe the story is not serious-which it isn't-but it is presented in a way that makes the movie serious. Another plus-the exotic-atmospheric score by George S.Clinton, the techno soundtrack and the photography. It 's good to see locations that they have a blue feeling(Stage with SubZero), a hellish one(Scorpion) etc.. Cary Hiroyuki Tagawa is simply fantastic!"}, {"rating": "10", "text": "Best video game movie ever! I feel this is the only movie where the filmmakers actually respected the video game source material. I've watched this movie many times as a kid, and I always shout \"MORTAL KOMBAT!\" whenever I feel like it."}, {"rating": "8", "text": "I understand why some people say that this is a mixed bag type of movie. But myself, I honestly thought this was a very cool movie. Sure it's PG-13 and not as gory as the video games, but I still give it credit for some Fatalities, Flawless Victories, really cool fight scenes, and very good choice of casting. My most favorite MK character, Johnny Cage was funny and awesome. The best part was Goro looked great! The animatronics with the face and arms were fantastic that time in 1995. If this movie was made today, it would probably be CG. Sure there are a few problems with the movie, but its still a very good Video Game Based Motion Picture. Out of all of them, this is probably my most favorite out of VG films."}, {"rating": "8", "text": "It's a fun movie to watch and to makes jokes of but it will be remembered for being the best live action video game movie it may not be a great movie but its a pretty ok movie with some awesome fight scenes and colorful characters like sub zero and scorpion."}, {"rating": "4", "text": "Paul W.S Anderson's \"Mortal Kombat\" doesn't play out like a game, but like 32 episodes of 'Power Rangers' fused together. Yes, the movie is that much terrible."}, {"rating": "8", "text": "this is way better than other horrible video game movies"}, {"rating": "10", "text": "4 years since my first review on this movie, and still the best video game movie ever made, Mortal Kombat is what a fighting game movie should be; faithful to the game with a group of well-choreographed fight scenes and spot-on casting that resembles the characters very well, plus, the overall concept is cool, the plot is well-paced, the actors do a great job (especially Robin Shou and Cary-Hiroyuki Tagawa), the cinematography and set designs are wonderful, and for a film released in 1995, the special fx are actually nice to look at, I easily recommend this film to any hardcore gamer (especially those who are fans of the MK franchise)."}, {"rating": "5", "text": "back in the day this game was huge so of course it spawns a movie . as usaul it was a hollywood sell out of a film . well what makes mortal kombat a cool game and the only reason ? fatalities ... that is it . the movie with its PG13 rating pretty much waters it all down and what where left with is some thing so-so , the acting is passable the story does follow the games . the special effects where pretty good. the charicters are one dimensional but they are the same in the game . this movie could have been far worse when you look at the history of games to movies . Mortal Kombat atleast was wachable ."}, {"rating": "8", "text": "Cheesy martial arts fun. It's got overacting, plenty of goofy one-liners, and over-the-top action galore. The plot falls short thanks to simplicity and a lack of focus so the movie just comes off as one long fight scene. That's not really a bad thing. Even with the crappy CGI and bad special effects the movie is still a treat to look at thanks to the fact that it looks almost exactly like the videogames it's based on.\r Admittedly if this wasn't based off of the Mortal Kombat games it probably wouldn't have been watchable. Had they have gone with original characters and themes the issues the movie has wouldn't have been so forgivable. It really is the faithfulness to the source material that keeps it afloat. The only thing it is missing are the series signature gory finishers. The action is noticeably tame in comparison to the games.\r Still, fans of the series should definitely check this out. It might not be the most high-quality film out there, but it's enjoyable and probably the best movie adaption a videogame series like Mortal Kombat could hope for. Even if you are unfamiliar with the games it's based on the action and setting should still keep you entertained provided you like martial arts and don't mind putting up with all of the cheese.\r I give \"Mortal Kombat\" an 8.5/10."}, {"rating": "10", "text": "This is by far the best video game movie ever made!The plot is enjoyable,the fighting is awesome,the acting is good a little cheesy but good.Every fan of MK will be pleased with this movie!"}, {"rating": "10", "text": "Mortal Kombat is still to this day the greatest video game-to-movie adaptation yet! The story follows the first game pretty well, the locations, actors, special effects and stunts were all amazing for its time. Hard to believe the movies almost 20 years old."}, {"rating": "4", "text": "Video game movie adaptations haven't always been the greatest idea. The two mediums don't really come close to each other in terms of direction or design. Having said all that, Mortal Kombat is entertainingly bad."}, {"rating": "0", "text": "Absolutely the worst movie I've ever seen. I was unfortunately dragged to see this instead of some other cool movie at the time that was R-rated because my best friend was asked to take his younger siblings along with him to the movie theater and they were not old enough to see an R-rated movie. So, like a trooper I stuck with to endure this movie while our more scumbag friends ran off to see a better movie. Going in, I didn't have any expectations really. I had played countless hours of Mortal Kombat the video game in the arcade while in high school, and that was a cool game, so I thought, hey, this might not be so bad. Man, was I wrong. Now why would you take a video game filled with extreme graphic violence and then try to turn it into a movie for a General audience aimed at young children? Because you're an idiot without any common sense, that's why! The only \"fatality\" is when one of the fighters stupidly slips and falls off the side of the mountain, there is no blood, no gore, nothing. This was one of the most boring movies I have ever seen. And this is supposed to be an action movie? I'd rather watch somebody play the video game than watch this movie, seriously, watching somebody play the video game is way more entertaining! What a waste of money and time. Don't ever see this movie. Don't rent it. If it comes on TV change the channel! because if you see it, you're gonna have a bad time!"}, {"rating": "10", "text": "Guilty pleasure of mine please excuse....+Made by a Director/production team who actually understood the 90's MK universe+Fights include character moves from the original game+Well chosen cast execute the impressive martial arts choreography with gusto+Story feels like a 90's saturday morning cartoon+Sets and locations breath life to the story+Memorable soundtrack-sequels are just not the same ratio of fun/quality"}, {"rating": "7", "text": "DECENT, Compared to the sequel, considering I found this movie at Walmart few days ago that had both the first and second MK movie on a single disc, I also saw both reviews by Nostalgia Critic!"}, {"rating": "7", "text": "This is easily one of the better films based off of a video game.  Though, it still has numerous flaws, as expected.  If memory serves me well, it is the 4th highest grossing film based off of a video game ever.  The presentation of the characters were hit or miss.  I do like Christopher Lambert's interpretation of Raiden, rather being wise and a little cocky than just the usual all-knowing thunder god.  The action sequences were just okay, but when it came to any fight scenes with Goro, boy did it look clumsy.  I know stop-motion can be unusual to work with, but I've seen more believable stuff from Monty Python.  Obviously, this film did no favors for any of the actors' careers.  Lambert was already established with the Highlander films, Robin Shou did Beverly Hills Ninja with Chris Farley and had a small role in DOA: Dead or Alive, and Bridgette Wilson was in Billy Madison with Adam Sandler....haven't heard anything from any of them since.  A couple of the martial artists, like Chris Casamassa who played Scorpion and Hakim Alston who played Liu Kang's first opponent in the tournament, were on a short-live kids show called WMAC Masters and haven't really done anything since, unless you count what they do in their lives as martial artists.  Overall, as any film, it was just okay.  As a video game based film, it's definitely one of the much better ones."}, {"rating": "10", "text": "One of the greatest action movies ever.I recall those special effects back in the day.Actirs and characters so cool. My favorite actors were the ones playing Sonya and Shang Tsung. Also memorable are C. Lambert, Robin Shou and the guy that played Johnny Cage.Great movie."}, {"rating": "7", "text": "Cool movie. If you liked the games at all, your going to enjoy this."}, {"rating": "10", "text": "Pure fun. And also the best film based on game. I think it really deserves its 10."}, {"rating": "10", "text": "Mortal Kombat is the greatest movie based on a video game ever made, everything about it was great, it followed the game really well, it was well casted, the special effects were pretty decent for it's time, the fight sequences were excellent and the soundtrack was superb, this movie is definately one of my favorite movies of all-time."}, {"rating": "7", "text": "This movie has it's good spots, but the acting could be a little better. It does a great job capturing the intensity and creativity of the Mortal Kombat world."}, {"rating": "10", "text": "One of my top 10 movies of all time. And, the first Movie Based on the Video Game, that captures everything the Game was ment to be."}, {"rating": "7", "text": "I liked this movie too, but I'm surprised it got this good of reviews, especially from critics."}, {"rating": "9", "text": "Alhtough the plot went a little too complicated and seperated from the main idea in it's latter parts, I still found Mortal Kombat fun to watch. Because the plot follows one of the original video games kind of well, I have the strange feeling that people who have played the video game(s) get more out of the movie; hence the better rating by users."}, {"rating": "9", "text": "I noticed this movie has no bad reviews and I couldn't agree more. This movie today is still in my top ten and Is the best video game adaptation to date. The presentation was flawless and the acting was very impressive. One of the best movies I have ever seen."}, {"rating": "9", "text": "There's no need to write a review for this movie in 2019, but I just want to say that for my money it's still the best video game to film adaptation."}, {"rating": "7", "text": "I think it's the perfect cult movie. The cast is spot-on for the characters they portray, The action scenes are enjoyable and it manages to be just the right amount of cheesy where it's comedic but not overly so. Mortal Kombat is such a criminally underrated movie and really one of the better video game based films to ever come out."}, {"rating": "5", "text": "One can enjoy this movie only if you played the video game to see the known character in a movie. But other than that it should be a weird movie: Bad characters, simple story and low budget with outdated special effects."}, {"rating": "6", "text": "This film seemed to be the start of a great franchise. Though it was slightly less than it could have been it delivered great action sequences and favourite characters to the big screen."}, {"rating": "6", "text": "I rented Mortal Kombat on Boxing Day 2013 so I could fill the extra hours of boredom. At the first cutscene when a boy called Chan Kang was killed by Shang Tsung, I was confused but I soon realised that it was a flashback so I continued the movie. The plot is based on the first Mortal Kombat, but then I was thrown off with the fact that there were characters from Mortal Kombat 2. The plot was not constructed or written very well because at the ending when Shao Kahn appears, I was thinking \"Which Mortal Kombat game are they basing the movie on? Mortal Kombat or Mortal Kombat 2??\"\r I liked the fight scenes in the game with my favorite being Johnny Cage vs Scorpion and I also liked some of the jokes that certain characters make in the movie. The funniest part of the movie for me was when Johnny Cage punched Goro in the nuts. The environments were awesome as well for a 90's movie. However, the awful dialogue and the acting that ranged from bad like Christopher Lambert (Raiden) to hilaribad like Cary-Hiroyuki Tagawa (Shang Tsung) who was laughably awful at the role. Memorable quotes from Shang Tsung included \"Your soul is MINE!\", \"Fatality!\" and \"Finish him/her!\". And let's not forget his weird screw face that he does in certain parts of the movie!!! LOL XD\r Overall, it is an alright movie, but it would have been better if the acting was great, the dialogue wasn't cheesy and the plot was re-worked. I am not a fan of Mortal Kombat but I kinda liked the movie."}, {"rating": "7", "text": "While the special effects and story are not well made,The acting and the fight scenes are better that I expected.The tournament is well made,but unfortunately it's hard to get into the movie."}, {"rating": "9", "text": "The extremely rare case of a good video game adaptation. With a bit of improvements and adding of fatalities (Unique feature of the Mortal Kombat games) this would be a cult classic of its genre. It is based on the famous Mortal Kombat fighting video game series. Which had about 18 games at the time of writing and sold more than 25 million copies. There were 2 unique features of the games: 1. They used blue screen to capture real life actors. 2.The games gave you fatalities that are over the top gory executions of your enemies. It was what made the games popular. It was the hot topic on the school yard and the stuff of legends back then;-). Back to the movie: They capture the essence of the games. There is a fighting tournament that determinate the fate of the earth (realm). It was set up to avoid a war as an evil immortal ruler of another realm wants to takeover earth (The term assimilation / merge is closer if I think about it). The best martial artist of earth fight against their best fighters. When earth realm has lost 10 times in a row all will be lost. This times it is serious as earth has lost the last 9 tournaments. The strength of the movie is the good balance between seriousness and taking itself not serious. If this was intentional then this is magnificent and should be praised. Then there is the good humour. I didn't expect to have this many good laughs in this movie. The cast is well chosen. Robin Shou is an incredible Liu Kang. Practical an uncut diamond that will grow in his role.  Linden Ashby nails the role of Johnny Cage. An actor who is also a martial artist that is not taken serious because of his acting role. He is also the stereo type of an American that has the cultural sensibility of a brick (but is a hero underneath). Bridgette Wilson is a fitting Sonja Blade first but a decline for the later parts (Script wise she got demoted / Not the actress fault). The fan favourites Ninjas Scorpion and Sub Zero are underused outside of combat. Christopher Lambert as Raiden should be a mismatch but his acting is so over the top hilarious and entertaining that he became a highlight. The villains are awesome. Cary Hiroyuki Tagawa performance as Shang Tsung puts a smile on your face. He likes to be the bad guy and plotter. Goro (A clay model) is an intimidating opponent that lives to crush his enemies. A martial arts / fighting movie is only good when it has good battles. This movie delivers a lot of good and memorable battles. The best are Johnny Cage vs Scorpion / Goro followed by Liu Kang vs Sub Zero / Reptile and the final battle. The only mismatch is Sonja Blade vs Kano. It would be good but Sonja looks really skinny / inferior in the scenes (Could fix it with better cuts). It must also mention the score. The Mortal Kombat theme is as energizing and awesome today as it was back then. The rest of the score helps to deliver the atmosphere of the movie. Overall this is a good video game adaptation and an enjoyable movie. The main critique from others is pointless. It is not a cultural valuable or intellectual movie. Comparing this to a Shakespearian movie is like rating a fish for his climbing skills."}, {"rating": "3", "text": "Close to no character development and I couldn't of cared less if any of the characters died. The special effects were bad even for the 90's and all of the characters couldn't compare to the game. Killer soundtrack though"}, {"rating": "2", "text": "Back in the days when I was way younger I enjoyed it very much and back then I would easily gave it 10 out of 10. Unfortunately I saw this again last month and... damn my memories are playing tricks on me. I suppose that every child who enjoys Teletubbies now will enjoy them after they hit 20 as much as I enjoyed MK. This move is just plain horrible. You can easily compare it to sharknado and stuff. And I have to give it fair score now.... Welll the score is in this red circle..."}, {"rating": "10", "text": "Unlike it's sequel, this movies plot is respectable. The fight scenes are better than its sequel and the special effects are great for its age. If you are a fan of action movies, this is a must have. I thoroughly enjoyed it!"}, {"rating": "6", "text": "Its amusing that reviews are as good as they are. Its an awful film, but it is also, due to its ridiculous dialogue, awesome soundtrack, and action sequences, hilariously entertaining. Moreover, stays close to the source material, which is nice."}, {"rating": "6", "text": "As a fan of the video game series i enjoyed it, it had the characters down pat along with some really good fight sequences but as a film it is by no means \"great\" the story is quite hollow and the characters while having their mannerisms done correctly they were pretty underdeveloped."}, {"rating": "7", "text": "Disastrously cheesy but eerily intriguing/nostalgic like futa porn overall.\rActing was hammy but Lambert and Ashby's performance did stand out. I feel it was more the fault of the script rather than the cast (for the most part), like the special effects, it had '90 s' written all over it. Tagawa, the actor everyone know though few can name managed to pull off the serious side to an otherwise comedic role if handed to another. What I did like were two of the fight scenes which the original MK soundtrack complimented so perfectly and charged our anticipation, alas it didn't last long. In the end it's not a bad movie but just a sign of the time's limits as well as extensive boundaries in film. You can just tell straight off if a certain production have a cultist following, and this does for good reason. It does have little nods to the game but nothing overly satisfying. Fans; don't expect it to be anything like the game. (PS. dank soundtrack)"}, {"rating": "9", "text": "Ah, I remember seeing it in the theater and those opening credits with the music was shaking the seats. Awesome. So, does it hold up 25 years later? You bet. Cheesy? Yep. Fun? Oh yeah. It's a movie that doesn't pretend to be anything it's not. It's true to the game, it doesn't drag on and the dialog and special effects while silly, is usable. I'm watching it now and have no interest in doing anything else."}, {"rating": "7", "text": "Dumb FunMortal Kombat ain’t smart, But for a fan of action, It’s a dream come true."}, {"rating": "8", "text": "Mortal Kombat. Get over here! Generally speaking, Mortal Kombat is a good transfer of the game to large screens. The battle scenes look great even though Liu Kang constantly screams at them. Loved Rayden by Christopher Lambert."}, {"rating": "7", "text": "This one film gave hope that video games to film adaptations could really work. I waited form 1995 till 2007 for the Hitman movie to drop, damn it. Was this a flawless victory of cinema going? Not quite, but it was fun to watch. With some really cool fight scenes and fight finishers."}, {"rating": "8", "text": "Believe me when I say that the only thing missing from this movie is insane amounts of gore."}, {"rating": "8", "text": "This movie was such a huge part of my childhood. I remember my dad taking me and my friends to a matinee the theater went dark and the theme exploded in digital sound. What followed just blew my mind. Revisiting it now it obviously hasn't aged well. Its undoubtedly goofy, the special effects leave something to be desired and the performances are overly campy. That being said Paul W.S. Anderson future director of the Resident Evil franchise and also responsible for the underrated sci-fi epic Event Horizon directs the proceedings with a straightforward confidence celebrating the corny aspects and relishing in the video game world. Ultra stylish with a killer soundtrack and some great action sequences. Mortal Kombat is truly one of the best video game adaptations.Budget: $18MBox Office: $122.1M8/10"}, {"rating": "6", "text": "Despite how cheesy the movie is, I'll say this is a better video game adaptation by far. The soundtrack is action-pumping, the characters seems more dry and cheesy but in a iconic way, and the fight scenes were cool. I just wish this movie was rated R so we can the blood and guts we were craving for like in the video games. The special effects of this movie was pretty bad to look at in this film, probably didn't have enough budget for computer effects. Overall, is a cheesy movie that lived up to Mortal Kombat."}, {"rating": "10", "text": "Amazing overall aesthetic, interesting story & characters not a whole lot to hate on to be honest. Me, for my part enjoyed it."}, {"rating": "7", "text": "Classic!The 90s chessiness and awesome music in between fight with the mortal kombat characters and the tournament It was a iconic movie, The story was decent and cgi was absurdly bad still enjoyed how cringe and awesome it was, The starting character intros the johnny cage, sonya balde and lui with the princess The chemistry was great, the absurd jokes of johnny cage and the love relations was amazing, The scorpio fight was iconic and the sub-zero water kill was awesome, although the classic characters were dead early still the villian's corny and awesome performance makes it last, The raiden was awesome and the 4hander fight was good, The ending fight at outerworld was decent and the ending with classic iconic pose of all it was an awesome end, Overall it was cheesy, entertaining and an iconic classic!"}, {"rating": "10", "text": "This movie is awesome. Low budget and great result. \"Get over here\" of the century."}], "recommendations": ["hitman", "prince_of_persia_the_sands_of_time", "lara_croft_tomb_raider", "doom", "uncharted", "mortal_kombat_annihilation", "spy_kids_3_d_game_over", "resident_evil_damnation", "silent_hill", "tomb_raider", "the_one", "hercules", "tron_legacy", "sonic_the_hedgehog_2", "silent_hill_revelation_3d", "the_three_musketeers", "bloodshot", "aquaman", "rampage", "superman_ii", "final_fantasy_the_spirits_within", "the_last_witch_hunter", "wreck_it_ralph", "bloodsport", "monster_hunter"]}