{
  "id": 1580,
  "title": "Mortal Engines",
  "starring": [
    "Hera Hilmar",
    "Robert Sheehan"
  ],
  "runtime": 129,
  "genre": [
    "Adventure",
    "Science Fiction"
  ],
  "description": "Many thousands of years in the future, Earth’s cities roam the globe on huge wheels, devouring each other in a struggle for ever diminishing resources. On one of these massive traction cities, the old London, Tom Natsworthy has an unexpected encounter with a mysterious young woman from the wastelands who will change the course of his life forever.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gLhYg9NIvIPKVRTtvzCWnp1qJWG.jpg",
  "categories": {
    "plot": 5.622641509433962,
    "acting": 6.051282051282051,
    "ending": 5.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 2.0,
    "action": 6.421052631578948
  },
  "reviews": [
    {
      "rating": "8",
      "text": "the film is very enjoyable and the visuals are great and the acting was very good. I know it could be better it should be very long series so the details of the very complicated world can be shown better. The fast pace of the film kill its very creative idea."
    },
    {
      "rating": "6",
      "text": "Visually awesome with all kinds of creativity and epic settings that are a blast to watch characters explore but Mortal Engines lacks a lot of soul that other post-apocalyptic films tend to have. This could have been an amazing film if the cast were given better direction and the script was stronger. Because I believe that both of those elements were rushed the film just didn't come off as well as I had expected. Hugo Weaving is a great actor and you could tell that because of the writing and mediocre direction that a lot of quality was left untapped. The movie is entertaining enough but it's constantly fighting its lack of explanation and drumming around a lot of unknown places. Often I found myself wondering why any of the issues in this fictional world matter? Why are certain places important? Why is this major location that gets referenced once or twice so important and what's the beef between some of these rival factions? Because the film gets setup so poorly and there's little effort put into diving into the details I just had a hard time loving this movie, and I really wanted to love it."
    },
    {
      "rating": "6",
      "text": "Mortal Engines is a hit and miss kind of thing. The flashbacks were very detrimental to the movie. Put in order, the story would have benefit from the steady rise in tension and made more sens. The FX are amazing. You won't get bored looking at this movie. The action isn't always great. Sometimes it's very cool, some just plainly generic. The main actors are fine, but all the secondaries are pretty bad. And the dialogues are just poor all the way around especially with the loving part, there is no magic in it (in words). The music is horrible. Doesn't always match what you see on screen. I give it a 62%. It's not a bad film but the only seller are the visuals."
    },
    {
      "rating": "6",
      "text": "The idea of the movie was good, but I think it missed something in the story and also the fact that it focused only on London while they marketed the story like a fight between many cities was quite misleading. Anyway, it's a decent movie, but a bit forgettable for me to give it a higher rating."
    },
    {
      "rating": "6",
      "text": "this could have been so much more than it was, just felt like there was something missing, the acting was good but something just wasn't right, maybe if they used the robot guy more, he was cool."
    },
    {
      "rating": "7",
      "text": "I'm giving this a 7 because, despite it's many flaws, I found it thoroughly entertaining.  Starting with the positives:• The movie is a visual treat, as was expected• The lead actress does an incredible job IMO.  I've never seen her before, but hope to see her again!  Her male co-star does a passable job; no complaints.  In fact, I think the acting was all above average.• I know some found the story boring, but I liked it, aside from some predictable moments.• The pacing was spot on.  Gave the movie room to breathe without getting bogged down.The negatives:• Dumb or overused lines.  Hugo Weaving actually rips a couple lines direct from The Lord of the Rings, which is jarring to hear in another world.  • Plot holes and non-sensical (or non-existent) character motivations.• We don't learn enough about the world.• Terminator in the second act.  Felt like filler.  Plus, we're supposed to feel some emotion at one moment, and I simply didn't.  • Speaking of emotion, I didn't buy the connection between the two leads.  There simply wasn't enough groundwork laid for it.All in all, definitely worth a watch.  I think the critics have been a little too harsh here (as they usually are for fantasy-like movies)."
    },
    {
      "rating": "5",
      "text": "While I like steampunk, this movie is an over-budgeted misguided attempt at something novel. However the storyline is so far out there that it totally failed to get, much less keep, me interested beyond the first few minutes. It's just not a good movie, I don't care who the makers are, it's just not good."
    },
    {
      "rating": "6",
      "text": "When I watched the trailer was one of the curious films but somehow I couldn't love the movie much.The first heads of the film came to me very confused ,continuous war scenes makes people tired.Okay they created a new world, walking cities, but the people were exhausting.Mad Max also had a similar subject in the room action scenes were plenty of movies, but we were not too tired in the scenesthe scenes in the mortal engines began to improve a little bit towards the end of the very mixed film, as we watched the scenes in the star wars.as if i saw a combination of several films in this filmI liked the shrike character and it looked like a Terminator.I liked it all, but his scenes seemed as if they were unnecessary.So the shrink was good, but the subject was a bit unnecessary as if to complete the story.The story is fine, I like the universe and idea created.I can't say anything about the director.Player found the elections very successful, every player has given the film the right so acting is good.Especially jihae mom and i loved her so much that she will be a very big player in the future.I didn't like the film in general but it can be watched."
    },
    {
      "rating": "6",
      "text": "Have you seen Star Wars: Episode IV - A New Hope? Then you already know the plot of this movie. It's a Star Wars rip-off, re-wrapped with steam punk and it's done ok with an enormous budget, but offers nothing new, compelling, or interesting. This is a 2-hour long chase scene with 30 minutes of exposition and no character development that makes anyone feel unique or interesting--except Shrike and Anna Fang. These are the only two characters that are interesting. However, both of these characters are killed so--not that there will be--if there is a sequel, I have no reason to see it."
    },
    {
      "rating": "3",
      "text": "I really disliked Mortal Engines. I thought the story, production, and even a lot of the acting performances to be bland, cliche, or derivative. The lengthy and numerous flashback and exposition scenes did nothing but drag the movie down. The film itself feels very rushed and loud. I didn't find anything of substance here."
    },
    {
      "rating": "7",
      "text": "Went into this movie cold.  My wife and I wanted to try a new theater and this was playing at the right time.  We both loved the movie.  Yes, it did have some plot holes, but it was fun and was actually very well acted.  Go see it, enjoy."
    },
    {
      "rating": "7",
      "text": "This movie had great special effects and kept the scenes as paradise for viewers, even though the story isn't that good"
    },
    {
      "rating": "6",
      "text": "Filme que não me deslumbrou e que achei mal explorado. A ideia do filme prometia mas não foi bem explorada. Os personagens não tinham o carisma necessário e a história foi mal contado e abordada talvez na necessidade de colocar tudo num só filme. Resumindo filme que se vê mas que ficamos com a sensação de querer mais e de que muita coisa não foi bem explorada e que os actores não ajudaram a melhorar a trama."
    },
    {
      "rating": "5",
      "text": "Despite some stunning (and sometimes not so stunning) visuals, this movie never lifts me up to really be enthralled into the setting and story. I think it has an amazing setting, but I miss it being drenched in lore. It could have used a dash of mystery, wonder and soul."
    },
    {
      "rating": "0",
      "text": "It had potential. But imagine if all three lotr were packed into one 2 hour film. You wouldn’t care about the characters. You wouldn’t care about the ring. You wouldn’t care about middle earth. Nothing would really matter cuz you’re just getting cliff notes. That’s how Mortal engines feels."
    },
    {
      "rating": "2",
      "text": "The latest contrivance from Peter Jackson, Mortal Engines is a post-apocalyptic action thriller on wheels. The film was penned and produced by Jackson with newcomer Christian Rivers making his feature film directorial debut under Jackson’s wing. The concept of Mortal Engines is set thousands of years ahead of our time. After what was known of the “Sixty Minute War”, the Earth’s crust has shattered resulting in a large loss of the earth’s surface area and natural resources. The loss of resources is the main motivating factor behind entire cities transforming their societies into moving war machines. Their only goal; strategizing towards conquering one another for resources. These concepts do not stray far from our own political climate in its current state. The amped up and glamorized special effects make these concepts of moving beasts of cities a fantastic steam-punk fuelled spectacle that gets your gears going. The story of Mortal Engines centres around a young apprenticing historian Tom Natsworthy played by Robert Sheehan. The young aspiring aviator unwillingly becomes involved in the attempted murder of the main monopolizing figure of London and Head of Guild of Historians, Thaddeus Valentine (Hugo Weaving). The would-be assassin, Hester Shaw (Hera Hilmar), is a masked and mysterious femme fatale figure with some of the new world’s darkest and deepest secrets. After being mostly unsuccessful with her assassination attempt, no thanks to Tom, Hester and Tom find themselves exiled off of London and into the Great Hunting Ground. Left to face the bleak landscape of the new destructed world alone, a world that director Rivers and the set designer Rosie Guthrie decorate with numerous memorable cinematic set pieces, including a southern bayou style encampment vehicle that rolls and crawls through the landscape with clay formations on its back resembling armour similar to something you would see on an ancient dinosaur or armadillo.After being captured and sold as slaves, Hester and Tom are lucky enough to be saved by top world assassin Anna Fang. Korean pop star and actress Jihae plays Fang, pilot and leader of the anti-establishment force known as the “anti-tractionists” who oppose the mobilization of cities and subsequent warfare that comes with the capitalist nature of it all. Opposing the idea of what the predator cities adopt as “Municipal Darwinism”, Fang steals Hester and Tom as well as the slave market scene from the movie commanding attention. Donning a red leather trench coat tat resembles something out of a colourful parallel world Matrix, Fang saves our main protagonists without a hair falling out-of-place from her Presley style pompadour. this among many others scenes in the film are hard to ignore for its blatent yet often times crazy imitation type scenes. Typically, while films with this type of budget and nature, tend to pay great tribute and homage to some of the films it get inspiration film, Mortal Engine tends to spill a little too much grease on its mirroring scenes.In addition to this array of fresh new faces of actors, the supporting cast also includes Leila George D’Onofrio, playing Katherine Valentine, Thaddeus Valentine’s daughter and at least in portions of the film seeming love interest to Tom. Stephen Lang plays the role of Shrike, a Metal Gear Solid styled undead soldier from a battalion called The Stalkers. While Shrike is made mostly of metal and being undead, Shrike and Hester provide the film with the most emotional parts of the film and perhaps the film’s best subplot, Lang and Hilmar give the majority of the film its beating heart, no matter ow cold the subject material really is.While Mortal Engines will be a hard sell in a jam-packed holiday schedule of films, this dystopian future feature film does some provide audiences with amusing portrayals of the future. Both Rivers and Jackson create a world that is both terrifying to imagine, yet fascinating and hard to look away from. Although the film tries a little too hard on being a Mad Max imitation the film is peppered with popular culture references touching on everything from minions, to Apple products (specifically iPhones) and toasters; displayed and spoken about as if they were ancient relics that providing us humans with some essential and crucial nourishment. One of my favourite and probably the most humorous scenes in the film was when we see Esther pull out a Twinkie to eat. Tom makes a remark at how old the Twinkie is and in a cheeky jab towards the food industry, she diffuses his worries by claiming food from the past even if it is a thousand years old in their case of story and time, “never goes bad”."
    },
    {
      "rating": "7",
      "text": "This is spectacular movie where you can feel all enormity of city and landscape size, especially in 3D vision. Also I saw the small niceness of the actions and history, because of the book is bigger I suggest. However, it's a great movie for evening time"
    },
    {
      "rating": "9",
      "text": "The story of the movie is for sure not the best, but the rest of the movie is great. The steampunk-world looks stunning and and the movie is full of epic scenes. The best fantasy movie i saw this year."
    },
    {
      "rating": "1",
      "text": "I can't recommend anyone see this movie. Even ignoring the source material, it is simply bad as a movie. I had high hopes seeing Peter Jackson attached to the movie, but it seems it did not help it outside the general visuals, which is really the only positive thing I can attribute to this movie. The general plot gave the impression they were just trying to rush me along from one pretty action scene to the next, while failing to actually make me care about, or be invested in,  the characters, their motivations, or the world the story takes place in.After going back and reviewing the plot of the book, I found that many of the central themes and events that made it interesting were also glossed over and prettied up in the movie. They managed to take a very interesting character in Shaw and reduce her to a basic pretty girl with generic motivations and personality. With the personalities of the main characters stripped away, the love story they attempt to shoe-in comes across as forced as I am left wondering why these people who just met look like they are already in love."
    },
    {
      "rating": "7",
      "text": "Not sure why the critics are giving this movie such bad reviews sometimes I ask my self did we see the same movie? Well to each their own. This movie is not bad at all. It's only problem is the character are not fully fleshed out."
    },
    {
      "rating": "7",
      "text": "I'm afraid I'm basically mimicking the general opinion on this, but Mortal Engines is more style than substance.Visually this one of those rare visual masterpieces. Director Christian Rivers was a storyboard artist/visual effects guy on the Lord of the Rings/Hobbit films, and he knows how build a world. The film contains a sort of cyberpunk-ish reality that combines the old and new. Everything from the technology to the clothing to even the natural environment feels completely distinctive. The giant tank-like city of London is something to behold. The opening where we're introduced to the place is such a breathtaking scene.The film also has an impressively designed secondary antagonist in the form of the disturbing and relentless Shrike, a cyber-zombie with a piercing voiceBefore I get into the plot, understand that the story and actors are decent, just not strong enough to sustain the 2 hour, 8 minute run time. The script is by Peter Jackson and his regular co-writers Fran Walsh and Philippa Boyens. Like King Kong and the Hobbit films, they don't realize less is more. Dialogue and some action scenes just go on a little too long. In fairness, the length gives the writers ample time to explain how this busy world works. Even then there are a couple script holes: a character figures out a plot point too quickly without enough plausible context and a supporting character just sort of vanishes once he served his purpose.The film unsuccessfully romantically pairs the two main characters Hester Shaw (Hera Hilmar) and Tom Natsworthy (Robert Sheehan). It does a wonderful job of building a friendship and why they'd trust each other, but the love aspect is unbelievable. It happens too quickly, and they have no chemistry.Plot-wise the standout character is again Shrike. He has the most sympathetic story-line. In the pantheon of good villains from weak films, I hope Shrike ends up being remembered like the Darkness from Legend and not forgotten like Maximillian from the Black Hole.Despite it's clunkiness, I highly recommend you see this just for this experience. You just may want to watch it at home while your washing the dishes or working on a project."
    },
    {
      "rating": "10",
      "text": "Very Good Movie, one of the best i´ve seen this Year.Go and watch it yourself and u´ll be surprised"
    },
    {
      "rating": "7",
      "text": "this is a very unconventional movie with conventional values. mostly great fun to watch yet you may find, in the end, convention sort of eats up the unconventional. still, a mostly fun movie to watch."
    },
    {
      "rating": "6",
      "text": "Not anything too special to be honest, but it does do a few things quite well. The movie is certainly best when it is just a bunch of cool action in its interesting world. The action scenes are well edited and keep you engaged. Sadly the movie also attempts a love story, and i can only say those scenes are boring and cringy, definitely the worst parts of the movie are between the two main characters. The world of mortal engines though is interesting enough to keep the movie going, and those talking/flirting scenes dont last too long. Some of the storylines in the movie are better than others, and a few things dont make sense, but i think it is acceptable just because it has its good action, and i was not expecting much more than that. If a sequal comes out i would probably watch it, just because i find the world of mortal engines interesting enough to follow another mediocre story, just to see more interesting locations and vehicles. 6/10 good enough"
    },
    {
      "rating": "9",
      "text": "Detailed production design provide a visually stunning sci-fi, reminiscing Kerry Conran's 2004 classic bomb SKY CAPTAIN AND THE WORLD OF TOMORROW. Plot is twisted far from the original novel, expect sci-fi of this nature to be bomb in US boxoffice since it has no big names in the cast and not a well-known entity that can create a splash. One of my best of 2018."
    },
    {
      "rating": "8",
      "text": "Enjoyable, non-stop, loud, huge 'world'. Makes me want to read the books. Will watch it again.Downside - the action and pace sometimes gets in the way of the acting and human side of the story telling."
    },
    {
      "rating": "9",
      "text": "Mortal Engines feels fresh: many of the elements have been seen before, but rarely have any of them felt as well done.  Watching the movie for the first time, you feel like there are many layers of depth (moving cities not withstanding), and you are only scratching the surface.  It is occasionally quirky without becoming too excentric to appeal to a mainstream audience.  The visiual style is at times remeniscent of the Lord of the Rings,  though there are moments that seem inspired by Star Wars (in a good way).While there is a message about our use of the planet's resources, the movie is never overbearing, and does not lecture. In short: Mortal Engines is an entertaining movie to watch, with a high level of immersion, and the kind of scenery that  would not have looked out of place in Lord of the Rings."
    },
    {
      "rating": "3",
      "text": "This is probably the very first movie I decided to stop and not to watch almost at the end. The beginning was fine, the idea of ther movie itself was quite fine too, but the end is just atrocious. There was just so many crucial flaws making the movie totally unbelivable. The usual mistake of action movies - where army fails few heroes prevail, but here it was just completely unbelivable. Love strories and fatherdaughter stories are awful and unbelivable too. The only good are city views - thats why I didnt put zero. Id like to recommend this movie, but if I do Id also will have to reccomend to stop the video until the \"happy end\"."
    },
    {
      "rating": "8",
      "text": "What an under-the-radar treat! And a big THANKS to the random writer who made a list of movies that, \"If You Liked, Alita: Battle Angel...\" Amazing that both of these movies garnered such modest fan-fare. But, my running theory is that Mortal Engines crossed boldly into the political realm. The Governor came off as an obvious symbol of the Dalai Lama. Even the city behind the wall--the statics--was an expanded spitting image of Dharamshala. The Mudusa? One look at that futuristic USB thumbdrive with the \"USA\" imprinted onto it and suspicions are only further assured. London representing the United Kingdom; the kamikaze move by the Asian woman fighting for the good guys; there is certainly an abundance of evidence to further the theory. In any case, if this movie didn't drum-up the PR band this could certainly be a reason why.Okay, onto the review.Another metacritic reviewer had the same thought as myself: That Star Wars vibe. It felt as though I was being drawn into a franchise universe--albeit with a MUCH bigger catalog of set-pieces--sorry Death Star. Should go without saying, the CGI was captivating. To be expected with WETA behind the helm, and Peter Jackson's own dedicated art department manager taking the reins on his first big-budget directing role.Yes, there were some questionable writing decisions made. Lazarus cyborg dying from a scissor kick? The blonde daughter--the protagonist's half-sister--and Tom's friend disappearing from the story for no apparent reason just as they could had stepped-in and stopped the Medusa from wreaking havoc? The villain--a writer with honorary political power--suddenly knew how to wield a sword better than a trained warrior? These were three of the biggest offenders that jerked me abruptly from my immersion.Perhaps the production ran short on funding and had to rush something out the door.But, most importantly, I was largely more-so-than-not, immersed.Eight stars, because Mortal Engines took a well-known plot and turned it into an original cinematic experience that deserves a Twinkies' lifetime of praise."
    },
    {
      "rating": "3",
      "text": "awful movie,there were so many holes in the story and o course was too predictable"
    },
    {
      "rating": "7",
      "text": "It's MUCH more fun an emotionally engaging than the critics lead me to believe.  Loved the lead actor and actress, but the breakout star from this film is the the bad-ass Asian actress from the \"Mars\" series on Nat Geo.  She's stellar and should be a big star in the coming years."
    },
    {
      "rating": "9",
      "text": "I find this movie as underrated.  The story is great, and the scenario is well executed.  I believe the real problem isn't the film but the marketting.  This film is more relatable to a Steampunk Star Wars handled by a competent director."
    },
    {
      "rating": "7",
      "text": "This movie has cool steampunk vibe, stunning visual, b-rated story and NPC-like characters."
    },
    {
      "rating": "10",
      "text": "Mortal Engines: Rise - The World of the Traction Cities. Mortal Engines is a different kind of movie, one that brings you closer to the truth.Everyone says don’t believe the hype except of course if the hype is for something to fail. The movie Mortal Engines will be a cult classic – guaranteed. The only question is did you experience it on the big screen when you had the chance? What is the movie about? The real question is how far do you want to go?If we could literally see what our combined actions looked like as a species then it would look like something akin to Mortal Engines. Yes, it is that kind of movie.Even the name ‘Mortal Engines’ signifies that nothing we create lasts forever. If the whole concept of mobile predator cities seems outlandish then remember it was intentionally meant to be so.  The mobile cities are a powerful metaphor for the ridiculousness of our human engineered systems and how far we will go to protect them. This movie poses some of the most profound questions of our age. Such as how far will we go as a species in the fight for limited resources?How far will we go to sustain the unsustainable?"
    },
    {
      "rating": "2",
      "text": "An idea that creates an interesting universe, but lacks something that could make us dream.Une idée qui crée un univers intéressant, mais qui manque de quelque chose qui pourrait nous faire rêver."
    },
    {
      "rating": "6",
      "text": "Truly disappointing. The first half was fantastic. The world was really interesting. Also there are small details that make the world fell more alive. The Action was entertaining and the CGI was Amazing. I thought that Blockbuster Movies should be exactly like that. But than the Second half comes around and its feels like they changed the director and writers. Because than the Movie feels like a bad Star wars rip-off, And the Story becomes pretty predictable. The dialogs also were getting  more uncreative and bland. They also managed to make the characters more like puppets in the second half. Overall the fantastic first half gets destroyed by an boring, uncreative and bland second half. Also the Final was a too long, it felt like it was never ending. This Movie had so much potential but it didn't managed to use it."
    },
    {
      "rating": "0",
      "text": "This film is a disgrace and I cannot bear to watch it,In fact I walked out of the cinema early because I needed to take a break for the crap this film pulls. They ripped of terminator for the villain, and when the villain tries to kill them horribly they immediately feel bad and want them to not die.Additionally, it just yada yadas through %9000 of everything, like the auction when \"hey look a blimp n stuff yeayaeyaeyaey\"!¬"
    },
    {
      "rating": "9",
      "text": "Marketing Fail of the Century! Good movie y'all. Better than about any other in the genre. Very interesting world which is both fantastic and seems real. Design, execution, story, everybody gets an A except the publicity folks need to be fired, and barred from working in the industry ever again."
    },
    {
      "rating": "7",
      "text": "\"Mortal Engines\" is an entirely watchable film, it's a good cohesive plot with a villain AND an anti-villain along with some amazing large-scale visuals so the larger your 4K/HDR tv the better. Along those lines, there's a lot of dark scenes so those with OLED or other true-black tvs will be better served. (originally posted on IMDB 10/12/19)"
    },
    {
      "rating": "9",
      "text": "Steampunk Star Wars. That's what I thought when I watched this movie. Mortal Engines is a little bit like Star Wars in that it creates an entire (steampunk) world from scratch and introduces us to a whole bunch of new, nuanced characters whom we are unfamiliar with, all of them with some backstory, which makes things interesting. It's a whole new world. What I really like about the world of Mortal Engines is that it is unlike any other worlds I've seen before in the movies, so the mechanics of the world is totally different. It's a semi-post apocalyptic world, with a hint of dystopia (yet not dark like many of the modern boring dystopian movies we see today) coupled with a dash of hope and humanity. On the one hand you have the humans which, true to life, want to destroy each other and then on the other hand you have the unquenchability of the human spirit found in steampunk itself told through what is likely the coolest steampunk character I've seen in the movies, Shrike (I won't spoil it for you, but you'll know what I mean when you see the movie).With Weta's involvement and Peter Jackson & co, it is no surprise how real they managed to create this steampunk world, in excellent CGI glory. London on wheels is simply so cool and intimidating. The actors all fit into this world well. I reckon they could make this movie even more interesting by fleshing out the characters quite a bit more. All in all, it is simply such a cool movie. Personally, this is one of the most unexpected movies I've seen in 2018 and it is a pleasant surprise, being so different from the other movies. I love it, my kids loved it too. Highly recommended."
    },
    {
      "rating": "10",
      "text": "Very nice ideas and the world itself, though as I know they are taken form the book series. I enjoyed the movie and can't wait to see more from this series."
    },
    {
      "rating": "10",
      "text": "This is the steampunk version of the star wars, and f***in awesome. Instant get for all engineers, like me."
    },
    {
      "rating": "10",
      "text": "If you like steampunk you will love this movie! While the cities aren't running on steam, it gives you the same feeling. Non-stop action and plenty of twists and turns throughout the movie."
    },
    {
      "rating": "10",
      "text": "I can't believe this movie bombed at the theaters, it was really good and the originality of it was on point. People aren't giving original movies a chance anymore.  The special effects were outstanding, really good acting and intense action throughout, it's a perfect 10 for me."
    },
    {
      "rating": "9",
      "text": "Like Fantastic Beasts 2:  Gindelwald, here is another movie with AAA budget, direction, acting, effects and CONVICTION in each department.  Both are AAA works of craft in feature film making.  What did the USA critics think?  They could not find a reason to take either film seriously and celebrate all the things working so well.    Both movies made multiple times more in foreign markets than in the USA.  More serious fantasy film makers than David Yates and Peter Jackson almost don't exist.   How their latest works of pop art are being denigrated makes me wonder more about what USA critics want in their movies.  Is it that both films fall short of perfection and therefore should be given low ratings?  Is it how neither marketing campaign caught on and became click-bait ($$$ for social media corporations) with billions of Facebook likes to celebrate?  I'm thinking more how serious fantasy film making is now only taken seriously outside Trump's USA.  Unless--the film has billions of likes and corporations can make money off social media around ads, features and trailers for the film.  You may agree with me much weaker films with marketing campaigns which went more viral, often seem to get higher scores; and therefore, attendance."
    },
    {
      "rating": "10",
      "text": "I totally love this movie. It is gorgeous, imaginative, consuming. The storyline is simple and the characters are relatable. The pace is perfect, without long boring scenes. In just 2 hours they have managed to recreate a new fantastic world, surprisingly detailed. I strongly recommend this movie to all those who love adventure movies and fairytales."
    },
    {
      "rating": "5",
      "text": "Adapted from the book series, this bleak future is dominated by enormous, elaborate \"traction cities.\" In this case, the travelling London is a steampunk assemblage of landmarks that tramples thru Europe \"eating\" smaller machine municipalities. It's up to a young couple to save the peaceful static towns from this giant predator. If you can get past the unlikely, unrealistic concept, you'll be left with a traditional post-apocalyptic plot. The action is plentiful, but not special. Given that it was shot and produced by folks in New Zealand (known for their excellent visual effects), you can expect everything to look convincingly real. The filmmaking is sufficiently absorbing, but never exciting or original."
    },
    {
      "rating": "5",
      "text": "Can't help but to feel bad for all the people who did the amazing special effects for this non-sensical, poorly written and directed movie."
    },
    {
      "rating": "4",
      "text": "watched ME with my daughters aged 13 and this is our combined review. We were both underwhelmed as a whole. Characters are one dimensional, effects are below average and the whole thing is just boring. Sometimes London looks like the beast its supposed to be, but most of the sometimes it just looks like cgi gone bad. The final 30 minutes is a steampunk version of Star Wars - A new hope.I expected a lot more..."
    },
    {
      "rating": "3",
      "text": "Started off really well, with some incredibly interesting concepts and a rich back story, and slowly descended into utter anarchy with no discernable logic and events and action, and dialogue that make literally zero sense. There are moments where I felt like I was missing a massive amount of hidden story, there were characters who look at each other or say a line and I feel like there is supposed to be some relationship between them and I'm supposed to know about it. characters make decisions for seemingly no sensible reason, like for example dropping the young girl off in the garden and then flying straight to the weapon that the young girl needed to get to..??? . this asian dissident girl seems to be a big deal and has some heroic death and I have no idea why or who she really is. I really got the sense this must be adapted from some Manga, or a TV series or a really long novel, but the thing is... if you're going to adapt from a larger source material you really need to edit the story so it actually makes sense in a 2 hour film. They did not do a good job with this as it is just a confused mess of garbage.  If you can't include a character's backstory in the film, they should not be in the film making a 'meaningful look' before they crash their ship into the big city on wheels. I don't know who that is, and it just makes me feel like I'm not welcome at your party. Awful film that just made me angry."
    }
  ]
}