{
  "id": 2866,
  "title": "Mortdecai",
  "starring": [
    "Johnny Depp",
    "Gwyneth Paltrow"
  ],
  "runtime": 107,
  "genre": [
    "Comedy",
    "Adventure"
  ],
  "description": "An art dealer, Charles Mortdecai, searches for a stolen painting rumored to contain a secret code that gains access to hidden Nazi gold.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/j7eKGD0n1zRVfKMX6M1kpfavby7.jpg",
  "categories": {
    "plot": 5.170731707317073,
    "acting": 5.093023255813954,
    "ending": 6.0,
    "soundtrack": 10.0,
    "cinematography": 1.0,
    "familyFriendly": 3.0,
    "funny": 5.403846153846154,
    "action": 5.6
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Despite all the negative reviews, I found it very funny.\rThe humour is sometimes stupid, sometimes subtle (you need to know a bit about European and British culture) and it is this combination that made me enjoy the film."
    },
    {
      "rating": "4",
      "text": "There's an alarming trend of steady decline in quality of Johnny Deep's movies. He performs to his strength as quirky characters, but his recent movies haven't been optimal even with the help of talented cast. Mortdecai is probably the worst of the bunch, an insipid action comedy that fails in creating sophisticated humor, needlessly complicated and above all, dangerously boring.\r Mortdecai (Johnny Deep) is a shady art dealer who allegedly dabbles on illegal activities. After several mishandled dealings he suffers quite a significant loss, which pushes him near the brink of bankruptcy. At the same time an art heist occurs, Mortdecai is serendipitously involved in the case. He uses this chance to slither a profit out of the situation. The premise is set for intellect crime with a touch of comedy, but it accomplishes neither as Mortdecai is too placid to be taken seriously and too dull to be amusing.\r The movie also brings a strong line-up of actors, such as Paul Bettany, Ewan McGregor and Gwyneth Paltrow. However, the material makes their characters one dimensional. Script often invests too much on particular scenes or rehearses the same joke far too many times, while skimming on development of the case. It makes the pacing plods on some areas and leaves plot holes on the rest.\r Dialogues are intricate, yet these suave words might not work and may even come off as shallow. It relies heavily on vulgar tone, but its funnier moments are from slapstick, much thanks to Deep and Bettany. Deep's staple appeal is from his exaggerated motion, he does try to personify Mortdecai but the character itself is too corny and lacking charisma. Paul Bettany is a flexible actor, bulk of his previous characters consist of brooding men, but he looks comfortable in a more relaxed persona even moonlighting  as comedy relief.\r It's hard to recommend Mortdecai, the movie, just like the character, is not as charming and clever as it thinks it is. Audience can probably get a few laughs if they set their expectation really low, but that shouldn't happen with such assembly of capable stars."
    },
    {
      "rating": "1",
      "text": "Oh my god January is almost over...thank the **** lord, but first I have to review this peace of cinematic trash With Johnny Depp in it, oh boy.\r The story to Mortdecai is about the British Mi5, his impossibly leggy wife and an international terrorist, debonair art dealer and part time rogue Charlie Mortdecai (Johnny Depp) must traverse the globe armed only with his good looks and special charm in a race to recover a stolen painting rumored to contain the code to a lost bank account filled with Nazi gold.\r Oh Depp why do you keep doing this? you had it all man. The money, the love from the fans, the Oscar nominations and your spot light. Now look at you. Flop after flop at the box office, very low rating on Rotten Tomatoes and me slowly losing faith in you, and this movie is the extra nail to the coffin of Depp's career because this is by far the worst movie of 2015.\r Johnny Depp in this movie was pretty much playing Captain Jack sparrow..again. Nothing much to say about his performance because he's just doing the same performance over and over again. Probably his next movie I bet I'm going to say the same thing that his just doing Jack Sparrow again. Sorry Johnny but you really need to get out of that role of a gay pirate.\r David Koepp is the directed of this movie but he's better known for his screenwriting for such films has: Jurassic Park, Spider-man, Panic Room and Mission Impossible. But has a directed he's...okay, not bad, but not amazing, his writing in some films can come off not so good as well. Now he directs Mortdecai and it's painful to say that the directing in this was pretty piss poor terrible and it's like he wasn't even trying in this, but everyone in this movie seems like they do not give a bull about. No wonder it floped hard at the box office.\r I hear a lot of critics and people even on YouTube saying that the movie has some little chuckles in it, but that didn't happen here with me. I was in complete silent bored out of my mind of this dreadfully bland, hollow of a movie. From start til finish I felt embarrassed watching this movie, I really was.\r I'm sorry but I couldn't find a thing I liked in this movie, not even Gwyneth Paltrow or Ewan McGregor couldn't save this movie from being even close to being alright.\r Mortdecai should be best descried has a embarrassment of movies. This movie is worthy of a Razzie Award, and to the people who disagree with me or think this movie isn't all that bad has I'm putting it out then god I wish I was you right now."
    },
    {
      "rating": "8",
      "text": "I have to say, i can't see how this got so many bad reviews. I loved it! Funny, witty and stupid (in a good way). Too intelligent for some people maybe?"
    },
    {
      "rating": "0",
      "text": "Sweet mother of god! How much **** money does this industry have to flush down the nearest toilet? Not a single laugh, left half way through, save your money and don't go."
    },
    {
      "rating": "0",
      "text": "I don't get a great thrill from going after a movie, but the sheer waste of talent and contempt for the moviegoing public that resides at the heart of \"Mortdecai\" is unreal.  Nobody could have thought this was a good idea while they were making it - it's a showcase for Johnny Depp to mug and overact in every scene he's in.  Everyone else in the film is supposed to be his straight man while he runs around acting like a lunatic. I cannot understand why this film was made or why $60 million was spent on its production.  It absolutely deserves a 0 out of 10 - there's not a laugh in it.  What does exist is a conceit to make a '60s caper comedy without a semblance of a plot, wit, or momentum - Johnny Depp in full gesticulation is supposed to make up for all of that.  Embarrassed for all involved except for Johnny Depp, who clearly knew what he was doing - and did it anyway.  Haven't seen a movie this poor, this miscalculated in many years.  At least the moviegoing public has stayed away and spared themselves the abject boredom of sitting through this disaster."
    },
    {
      "rating": "1",
      "text": "It really is hard to believe how this film turned out so bad. Great cast, good screenwriter and cult source material have been mixed together to create one of the most self indulgent, poorly executed and unfunny comedies in recent memory. Depp plays the title character as a cross between Terry Thomas and a Fast Show character, while the rest of the cast orbit him mugging desperately for the camera to try and get noticed. A cinematic disaster of epic proportions"
    },
    {
      "rating": "3",
      "text": "I thought this movie was going to suck from the moment I watched the trailer. It provided a few smiles but no laughs. It wasn't a very good time at all.\r3/10"
    },
    {
      "rating": "7",
      "text": "Mortdecai is definitely underrated.  The laughs are underrated and Johnny Depp is underrated. For me, it was a fun movie for whatever it is. Its not the best comedy choice and not the best choice for adults with no sense of british humor. The spy concept was good, and I think it gave it an edge to the film. Ewan and Gwyenth were good in supporting roles, but the main surprise was Depp as a british, cocky, sleek and well mustached Mortdecai. Its  fun film with forgivable flaws. Mortdecai deserves a watch on the big screen. Its wild, big and funny."
    },
    {
      "rating": "9",
      "text": "This film was witty, funny and silly - intentionally - throughout. It reminded me of the first Austin Powers film. Don't believe the haters. They are too uptight to appreciate a film such as this."
    },
    {
      "rating": "6",
      "text": "\"Mortdecai\" (2015) has a sense of humor throughout but it does not feature enough laughs to qualify as \"funny\". It is entertaining yet disappointing with some kind of style, great ensemble cast but an indifferent plot."
    },
    {
      "rating": "7",
      "text": "At times it is a delightfully oddball little film. However that quirky weirdness is also what is going to drag the film down for many. It's humor and style are just too British to appeal to everyone. But those looking for a goofy adventure in the vein of the Pink Panther films can find something to enjoy here.\r What we get here is another extravagant performance. He plays his absurd character well even if he can't always make him charming. It's the writings fault he is occasionally annoying. Still some laughs are brought on thanks to the goofiness of the character and the situations he is placed in. The real star of the show though is Paul Bettany playing Mortdecai's ever faithful manservant \"Jock.\" His dynamic with the title character is amusing. The rest of the cast is quite excellent. A few characters are underutilized, but still are in top form.\r As far of the jokes go it has quite a few funny moments. However it will test your stomach for British humor. Quite a bit of it doesn't translate well. Still I found it to be quite an amusing film all the way through. That doesn't change the fact that there are some dull moments in the film's progression. This complain mainly extends to the film's actin sequences. They feel poorly shot and really lack any excitement of flair at all. I get that action isn't the main focus, but given the height the action-movie genre ha reached, even brief excursions into this territory need to have at least a little more than what is offered here if it wants to avoid causing yawns.\r The film's goofiness is really a double-sided coin. On one hand it makes the film something unique and strangely charming, on the other hand many are going to find it to be tedious because of that. I personally think the good outweighs the bad here. With great performances and a quirky sense of humor and style it makes for an enjoyable, if flawed, film that is going to be worth the time of the right audience. It requires an open mind and a bit of taste for foreign humor. Whether or not you can stomach it is just going to come down to personal preference. I personally think it's worth giving a shot. There certainly hasn't been anything like it in a while.\r I give \"Mortdecai\" a 7.4/10."
    },
    {
      "rating": "10",
      "text": "I went into Mortdecai expecting a terrible film, but I left the theater with a smile on my face. This film made me laugh more then I thought and it was actually enjoyable. The critics hated this film, and I usually agree with critics, but I had a lot of fun with Mortdecai. Johnny Deep gives his best performance since Pirates of the Caribbean, and his mustache is a lot less annoying then I thought it would be prior to seeing this film. I still don't understand the R rating, since there are only 2 f-words in the film, and no nudity. I would love to see a sequel since it is my understanding that the book has sequels, so hopefully it'll make money this weekend. I think it deserves a watch if you want to be entertained."
    },
    {
      "rating": "10",
      "text": "Funny. It was funny. Full theater, near-constant laughter, and applause at the end. These negative reviews... they really confuse me.\r The pacing was spot-on, the characters unique, the dynamics of Paltrow and Depp were delicious. Bettany does an amazing job as Jock, the \"manservant\" and all-around badass. McGregor as the bitter spurned lover...\r The music was fantastic, the action lovely (especially the bumbling Mortdecai), the chase scenes well-done, the humor whimsical and silly... it was a solid bumbling sleuth-comedy.\r Look. The movie is silly, but it's silly in the way a lot of older movies were funny. It's clumsy, farcical, but interesting. Some folks have compared it unfavorably to Austin Powers, having apparently never seen the Pink Panther films. It's oddball, zany, and slightly juvenile, yes, but so is life.\r It's not going to win Oscars, or set the world on fire. What it will do is make you laugh, unless you're dead-set against laughing. But people around you will laugh, and have a jolly old time. If you at all have a heart for \"silliness\", give this a shot. I had a blast, I'll be buying the DVD. Just don't expect serious soul-searching or dastardly political intrigue (don't know why you would)."
    },
    {
      "rating": "5",
      "text": "A decent looking film that seems adequately directed. It just needed more jokes. I never felt more disconnected from such a nice looking movie as I have with this one."
    },
    {
      "rating": "9",
      "text": "This movie was a great adaptation.  The critics spoke badly of this movie even before the public had a chance to see it.  This character has great potential as a franchise similar to the great Pink Panther series.  I left the theatre with a smile on my face and wanting more."
    },
    {
      "rating": "10",
      "text": "Great film!  Paul Bettany has loads of fun with JD. Paul Whitehouse does a great cameo, effing and blinding just as in the subtly sophisticated books by Kyril Bonfiglioli on which it is based. The whole audience was laughing hard. The critics don't get it, maybe just flies over their heads.  Some Brits won't like it as it mocks them mercilessly. But take em down I say!"
    },
    {
      "rating": "2",
      "text": "Johnny Depp is known for his eccentric interpretations, which can be marvelous or, in this case, an awkward flop. He plays an upper crust rogue and art scammer with a stupid moustache. There's an unoriginal plot about a stolen painting, but the focus is on his character's supposedly hilarious hijinks and clueless charms. NOT ONE JOKE lands and the supporting cast of impressive talent has taken his lead and avoided all attempts at being funny. The dry direction doesn't offer any help. A new low for Depp."
    },
    {
      "rating": "0",
      "text": "Like watching a clown drink himself to death then this movie is for you. Devoid of any sense of humor or comedic timing full of perverse writing equal to the horror of your balls being rendered apart with a fork.\rDepp apparently wanted to experience flirting with a career failure similar to John Travolta's Battlefield Earth."
    },
    {
      "rating": "1",
      "text": "I was so disappointed with this movie, I even went out of the theater with both hands on my face, ashamed that I had to see Johnny Depp this way. Ewan Mcgregor did his part way better. I could say that it's one of the worst movies from Depp, ever. Don't even watch it at home, it's that bad."
    },
    {
      "rating": "8",
      "text": "Much better than I expected. If you are not into corky silly movies, this is NOT for you. Think \"Pirates in Caribbean\" meet the \"Pink Panther\". Underrated movie, I find that the seriously cynical and uptight, tend to hate it."
    },
    {
      "rating": "8",
      "text": "Despite the bad press I have found this an incredibly enjoyable film, as a fan of the Bonfiglioli novels, I found that whilst the film took liberties with the plot it was true to the spirit and flavour of the original books. Many of the the gags that I have seen criticised in the professional reviews are intact straight , word for word lifts from the novels. I do find it quite annoying the professional film critics write a bout a film based on a novel without bothering to first read the novel.  Many films of this ilk are hammered for NOT being true to the original and this one is being panned for  doing so, damned if one does damned of one doesn't. I understand that this film will probably be completely incomprehensible to most American audiences, and one criticism that I do have is that the film is weakened by the attempts to make it more accessible,  the producers should I believe have gone all out and made a film for British audiences and hopped that it transferred (\" Four Weddings\", \"Downton Abby\", etc).\r Depp's Terry Thomas inspired interpretation of Mortdecai, is actually a much pleasanter character than the original, and in the books Johanna was actually a jewish American, not the frightfully English pseudo Sloane portrayed by GP.    I was disappointed by Ewan Mcgregor's Martland  at times for an actor of his caliber his inability to produce a convincing English Public School accent was surprising. Paltrow who is an American does a better job.\r I did overall though enjoy the film, but less pandering to American audiences would have made it a much better film, it's almost as if the producers started out on the right track and then lost their bottle.  It did though make me go back and re read the originals  a long forgotten pleasure."
    },
    {
      "rating": "5",
      "text": "Depp's character is a rehashed Pirates of the Carribean accent, with the flare of Mr Bean facial contortions. Rare moments, thru the intensely-heavy dialogue, there were moments to chuckle.On the surface, chasing a round the world for something sounds exciting, but in general the movie was not very interesting. There are times when quirky is funny and this movie was not."
    },
    {
      "rating": "3",
      "text": "Mortdecai relies a bit too much on slapstick to be considered witty, and a bit too much on its magnificent (on paper) cast to impress us. After all, the silliness of the act is undeniable, but it's the kind of silliness a child would like.\r While there are plenty of British people playing American characters, this time we see two Americans (Johnny Depp and Gwyneth Paltrow) playing two British characters, and their accents were unfortunately not well studied, resulting in an obvious farce and parody of itself that I'm afraid is not intentional at all."
    },
    {
      "rating": "3",
      "text": "Unfortunately  Johnny Depp become so much cliche and unsightly. this movie have something like 2 ou 3 good and fun scene. Every thing else are horrible."
    },
    {
      "rating": "10",
      "text": "I loved this film because of it fun,lighthearted silliness. Just what is needed sometimes when life seams to be thick with hate and brutality. Films are about their ability to take someone to a place they have never been or away from what they would like to forget. To escape today's realty. Today this film was a blast, exactly what I needed, some light silly positive comedy where the biggest problem was a silly mustache. A perfect movie after a dark tragic day of Paris killings. And it allowed me to forget and escape for that time, which are what movies sometimes are all about!"
    },
    {
      "rating": "5",
      "text": "Made me laugh, but its ability of doing so doesn't make it great. The plot is not so interesting, and the characters are predictable, and their actors don't surprise much on their acts as much as we already know from them. I left the movie theatre feeling entertained with the chuckles I had, but feeling that I'd just watched a poor movie in its content.\r I miss Ichabod Crane (Sleepy Hollow), Dean Corso (The Ninth Gate), George Jung (Blow), and even Captain Jack Sparrow! Can't Johnny Depp surprise us anymore with an outstanding act?"
    },
    {
      "rating": "4",
      "text": "Most not-british british comedy. Despite nice actors - movie is boring, unfanny, bad in general. Things like this happens, when americans trying to do british humor."
    },
    {
      "rating": "5",
      "text": "The very definition of average.\rThis is the type of movie id recommend to a large group who just cant agree what to watch pick this movie and nobody gets their way yet its not to terrible and it has a wide appeal.\rOr a quiet saturday/sunday and you want to be lazy pick up a dvd of this (once its out) and it might make you smile if not laugh its not easy finding lighthearted comedy better then this sadly."
    },
    {
      "rating": "1",
      "text": "Without a doubt, one of the worst Johnny Depp films I've ever seen. Makes \"Dark Shadows\" look like a masterpiece. If I was Depp, I would be very ashamed, as should all the other fine actors involved in this trash."
    },
    {
      "rating": "2",
      "text": "Johnny Depp continues his career downfall with Mortdecai, giving his worst and most pathetic performance of his career. How can an Actor with this much raw talent waste his time in such a terrible film? It wastes the talent of its cast, it wastes the audience time in a muddled mess that fails to be anything that it was going for."
    },
    {
      "rating": "10",
      "text": "Mortdecai is absolutely hilarious!  Depp was clearly influenced by Terry Thomas's English upper class buffoon character in his onscreen persona.  The film is packed with what must seem like endless inside jokes to those uninitiated or imperceptive to this brand of humor.  Therefore with this understanding it would seem highly likely that critics who shredded this film just did not get it.  If you can't stand sitcoms, have watched more than Sesame Street on PBS or simply enjoy subtler humor more often found in British films, then this film may be for you."
    },
    {
      "rating": "1",
      "text": "NOTE: I did not watch the entire film, I got up to the first hour and five minutes and I just gave up immediately. The only other movies I have never finished watching before were 'Catwoman' (2004) and 'The Human Centipede 2 (Full Sequence)' (2011). Already, this is not a good sign for 'Mortdecai'.\r The film, directed by David Koepp (writer of 'Jurassic Park' and 'Spider-Man') stars Johnny Depp as the title character Mortdecai. Filled with charisma, Depp gives a reliably well-rounded performance as the wealthy and eccentric character. The plot, if I can remember which I may not so forgive me, revolves around some stolen painting, and it's up to Mortdecai and Inspector Alistair Martland (Ewan McGregor) to investigate the situation which also had a murder involved.\r Alistair Martland also has a crush on Mortdecai's wife, Johanna (Gwyneth Paltrow), which is a subplot that didn't need to be there, so I don't feel the need to go back and mention it ever again. It's the same old subplot you have seen in many other funnier movies.\r Mortdecai also has good protection from a tough thug whose name is, funny to say, Jock Strapp (Paul Bettany), another character that the screenplay, written by Eric Aronson, tries to make into an interesting character, but does not or fails to do so.\r This film is aggressively unfunny, it tries so hard to be funny, and it just isn't. The comedy maybe timed and rehearsed, but they fall so flat, they cannot be picked back up. The actors here do an admirable job with their performances, but the running joke of Johanna refusing to kiss Mortdecai because of his mustache is unfunny, and ultimately repetitive. I know I haven't seen the film in full, but why should I? If in the first two acts of the film, I did not find myself caring, why should the third act make me care as well?\r Unfunny, too stylish, and it just drags, the first hour of this film felt like 2 hours...and I just couldn't take it anymore."
    },
    {
      "rating": "4",
      "text": "Finally, i watched Mortdecai and i agree that is a low point to Deep's career, however i don't think it's that bad and it's probably my \"guily pleasure\", but The Lone Ranger or Transcendence were even worse...it reminds me of a british spy movie and somehow Deep quickly reminded me of Rowan Atkinson. This movie is a little strange but i really have fun with some jokes, but another just simply were flat and obvious...I think the biggest problem with it is that the sequences were much longer and they just put some scenes unecessary that makes the story go slowly. I think people are only making this movie a disaster because of Deep, who as always and no matter the movie, is great  but i want to see him as a real actor and not a caricature or a simple copy of Jack Sparrow, and the supporting actors like Paltrow, McGregor and especially Bettany are good additions...At the end, is not a disaster that many say, but i can understand because it has some fun but was stupid like that \"balls scene\" and even boring. All i can say is, it's forgettable but still enjoyable enough..."
    },
    {
      "rating": "6",
      "text": "This movie is getting a bad rep from critics, but it is actually a very funny movie. It was not great from a technical aspect, but I found myself laughing in many parts, and even busting out laughing in some. I liked Paul Bettany and Jeff Goldblum, but everyone else was annoying. So check this out despite what critics say."
    },
    {
      "rating": "1",
      "text": "Basado en la trilogía escrita por  Kyril Bonfiglioli, Charlie Mortdecai, es un lord Británico, tratante de arte, timador, bigotudo sensual,que se encuentra en la ruina, solo un golpe de suerte y el robo de un misterioso cuadro perdido Goya, puede sacarlo a él y a su esposa de su hecatombe económica.\r Y si, en efecto, nos encontramos ante la nueva película de Johnny Depp, donde se aleja de los blockbusters ultramillonarios, de Tim Burton y de cualquier película con dignidad y se rebaja a participar y producir un subproducto rancio, anacrónico y patético.\r Debería decirse que en la premisa, pese a ser muy manida o muy clásica,  intentan darle ese toque retro u homenajear al género de ladrones clásico, de aquellos films sesenteros, donde el humor, la sofisticación y el encanto predominaban, pero fracasan estrepitosamente en múltiples aspectos que os relataré a continuación:\r La película es en pocas palabras, una de ladrones y un botín común que todos desean conseguir (como La Pantera Rosa), pero con un humor totalmente desfasado, trasnochado e improcedente , se podría definir como una extraña y grotesca mezcla entre humor finolis de los 60, chistes soeces de caca, culo, pedo, pis y humor británico, mezclado de tal manera que produce como resultado, un humor completamente rancio, infantil, chabacano y vulgar. Debo reconocer que tiene 2 puntos divertidos, pero el resto es vomitivo.\r Después de ver como tiran a la basura una idea, nos encontramos un reparto actuando de manera totalmente fuera de si, David Koepp debe ser muy fan y nostálgico, porque se ve que no sale de su añorada nostalgia de los cojones, y les exige que deben actuar igual que en los 60, y ahi tenemos a personajes sobreactuando, vomitando diálogos rimbombantes que no pegan ni con cola, el único que salvo de tal magna catastrofe filmica es Paul Bettany, creo que era el único que o no se tomo en serio esto, o fue el personaje que menos elaboraron y él hizo su magia.\r Eso es Mortdecai, un film, rancio, pasado de moda, petulante y ridículo como el solo."
    },
    {
      "rating": "6",
      "text": "Reasonably okay movie, with funny scenes here and there. Conversation was noteworthy funny too. Not so much on character development apparently.\r Worth a watch on TV I guess."
    },
    {
      "rating": "5",
      "text": "Nothing impressive. Falls out of memory quickly. I do not get such harsh ratings tho, but yeah, passes the time."
    },
    {
      "rating": "10",
      "text": "loved the cast, positive vibes, good laugh for those who want to! smart lines, witty dialogues, if you are seeking to have fun with silly dispositions then you will love it. can understand why so many bad comments."
    },
    {
      "rating": "7",
      "text": "The two or three good jokes that the film has are immediately overshadowed by Johnny Depp's over the top performance and horrible English accent.[full review in Spanish]\r Watch this movie here for free http://www.watchfree.to/watch-2a12f3-Mortdecai-movie-online-free-putlocker.html"
    },
    {
      "rating": "0",
      "text": "Absolutely terrible. This is for sure johnny depps worst movie. I watched about 30 minutes of it and finally thought i had enough of this nonsense they call a movie. The script was awful yet the plot seemed intriguing. After seeing depp in finding neverland and the pirates of the Caribbean films I know he can do better and feel very sorry he got stuck in such an awful movie. Avoid at all costs"
    },
    {
      "rating": "1",
      "text": "Basado en la trilogía escrita por  Kyril Bonfiglioli, Charlie Mortdecai, es un lord Británico, tratante de arte, timador, bigotudo sensual,que se encuentra en la ruina, solo un golpe de suerte y el robo de un misterioso cuadro perdido Goya, puede sacarlo a él y a su esposa de su hecatombe económica. Y si, en efecto, nos encontramos ante la nueva película de Johnny Depp, donde se aleja de los blockbusters ultramillonarios, de Tim Burton y de cualquier película con dignidad y se rebaja a participar y producir un subproducto rancio, anacrónico y patético.\r Debería decirse que en la premisa, pese a ser muy manida o muy clásica,  intentan darle ese toque retro u homenajear al género de ladrones clásico, de aquellos films sesenteros, donde el humor, la sofisticación y el encanto predominaban, pero fracasan estrepitosamente en múltiples aspectos que os relataré a continuación:\r La película es en pocas palabras, una de ladrones y un botín común que todos desean conseguir (como La Pantera Rosa), pero con un humor totalmente desfasado, trasnochado e improcedente , se podría definir como una extraña y grotesca mezcla entre humor finolis de los 60, chistes soeces de caca, culo, pedo, pis y humor británico, mezclado de tal manera que produce como resultado, un humor completamente rancio, infantil, chabacano y vulgar. Debo reconocer que tiene 2 puntos divertidos, pero el resto es vomitivo.\r Después de ver como tiran a la basura una idea, nos encontramos un reparto actuando de manera totalmente fuera de si, David Koepp debe ser muy fan y nostálgico, porque se ve que no sale de su añorada nostalgia de los cojones, y les exige que deben actuar igual que en los 60, y ahi tenemos a personajes sobreactuando, vomitando diálogos rimbombantes que no pegan ni con cola, el único que salvo de tal magna catastrofe filmica es Paul Bettany, creo que era el único que o no se tomo en serio esto, o fue el personaje que menos elaboraron y él hizo su magia.\r Eso es Mortdecai, un film, rancio, pasado de moda, petulante y ridículo como el solo."
    },
    {
      "rating": "9",
      "text": "An entertaining , laughable movie, i wonder why neither critics nor users haven't been impressed by it. The performances were quite good , specially johnny depp's , who i do not understand why became nominee of golden raspberry awards."
    },
    {
      "rating": "2",
      "text": "Mortdecai is a ''funny film'' with high production values, but the director, the script and its protagonists, do not meet the standard and leave this film in a limbo of irrelevance.I absolutely do not recommend it."
    },
    {
      "rating": "6",
      "text": "This is a comedy crime film, a parody or satire of crime mystery films, featuring themes including fraud, forgery, russian criminals and the British aristocracy. Its very much a character driven film, with the titular character being very much a bizarre, eccentric sort. One of my first thoughts about it was that it seemed an exercise in sheer smugness by Depp (who plays Mortdecai). Certainly his character appears to have the upper hand. I can understand why it gets a bad crit but thankfully, for me personally, I found it to be one of the 'so zany its really quite amusing-ly good' type films. Put it this way - if you take the plot seriously and expect a 100% sharp and witty, original film, then I've little doubt you'll be disappointed but if your ok with watching a film with exaggerated characters, a definite predictability regarding plot development and your ok with some bizarre instances of toilet humour and the like, then you may also find this to be a relatively amusing and entertaining watch. I feared I wouldn't be bothered to watch the rest of it, by how cheesy and smug it seemed after the first twenty minutes or thereabouts but I did find myself **** with some of the truly random and bizarre subjects of humour, once it got going. One such example is a line referring to Mortdecai's collection of old cheeses being a 'weapon of biological warfare'. Its just as well there is no such thing as smell-o-vision in relation to films - well, not yet anyway!.There is narration provided by various characters, all having a rather exaggerated accent (or dialect) but then most of the characters both look and sound somewhat exaggerated, in terms of their demographic (race/social class etc.). It does refer to stereotypes, having a definite 'go' at upper class English types. Mortdecai being the epitome of a British upper class aristocrat, full of airs and graces even in the most unlikely situations, I didn't much care for the character at the start of the film but as the plot (if slowly) developed, I started to warm to him somewhat. Partly why may be due to the fact that the character both provides narration at times (as mentioned earlier) and directly speaks to the audience/viewer at times, as if implying that he knows its all a bit silly and that he doesn't take the film seriously in the slightest. I think that if you take it too seriously, it'd be hard not to be appauled by the cringe-y accents and everything.Cast wise, Johnny Depp plays the titular character, with his Jack Sparrow-esque suave, assertive and smug persona very much at the fore. In this comedy role, he almost comes across as a bit of a Jim Carrey type, in seeming quite hyperactive and enigmatic. He isn't entirely likeable, at first certainly but his eccentricity did end up with me warming to him somewhat. Gwyneth Paltrow plays Mortdecai's partner, Johanna, She does well at playing a hoity-toity housewife - it was amusing enough hearing her say 'the painting of the Duchess was in Bunny's loo!'. I also particularly enjoyed Ewan MacGregor, who played Martland, a police inspector. I quite enjoyed his character - his is a supporting role and his character is a bit less exaggerated compared to Mortdecai and Johanna. Other cast members present include Jeff Goldblum as Krampf (an art dealer), Paul Bettany as Mortdecais assisant, Jock and Olivia Munn as Georgina. Paul Whitehouse (of The Fast Show fame) also appears in a supporting role, as an italian car mechanic called Spinoza.This film features some relatively good camerawork, with some quick and sharp movements and thus a variety of angles used to heighten the tension and make scenes seem quicker and flashier in general. The musical pieces played are fairly generic pieces, mostly incidental music, what you'd expect to hear in a crime/mystery film - mostly instrumental pieces, with strings and woodwind instruments, which add either/or a slightly spooky feel or a sense of slickness to the scene its played in.As a parody/satire film this is certainly a pleasingly silly film - think of settings similar to The Grand Budapest Hotel, with the main character more remiscent of The Mask and storylines perhaps more like those of the Pink Panther films of a few decades back and you wouldn't be a million miles away. I suppose if I ignore my earlier mention of it relying on stereotypes and refer to the parody element, then you could say that its good at pointing fun at the upper classes but im not entirely sure if everyone would necessarily regard it as a parody as such.Its certainly an easy watch (you don't need to pay a great deal of attention to it), its a silly watch, one that some may quite enjoy and some may find having their head in their hands while they cringe throughout. That depends on personal taste and suchlike but for me, I found it a relatively entertaining and amusing watch for the hour and three quarters running time it lasts for."
    },
    {
      "rating": "10",
      "text": "Very funny HAHAHAHA and entertaining. Some movies, can be predictable, like you can easily predict what will happen next.Trust me.. this movie is not like \"some movies\". It deserves high ratings."
    },
    {
      "rating": "9",
      "text": "This shd be a cult classic in the genre of pink panther. The over the top british humour is excellent. A thoroughly enjoyable movie. If you hv read the novels u wd enjoy even more."
    }
  ]
}