{
  "id": 4025,
  "title": "Motherless Brooklyn",
  "starring": [
    "Edward Norton",
    "Bruce Willis"
  ],
  "runtime": 145,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "New York City, 1957. Lionel Essrog, a private detective living with Tourette syndrome, tries to solve the murder of his mentor and best friend, armed only with vague clues and the strength of his obsessive mind.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jjMJy5OxJHpFIaboCklDIYdcfpD.jpg",
  "categories": {
    "plot": 6.5227272727272725,
    "acting": 6.583333333333333,
    "ending": 6.0,
    "soundtrack": 7.8,
    "cinematography": 5.5,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Great film with a great cast. Has a little bit of pacing issues but I feel like that’s almost to be expected in movies like these. Loved the jazz throughout."
    },
    {
      "rating": "10",
      "text": "It's a well executed experience with a great cast and an intriguing story in a setting and with a music that gives you a unique mixture of a lot of different worlds"
    },
    {
      "rating": "6",
      "text": "Well, I really admire movies where there are shown true loyalty, dignity, friendship. This movie owns it. But I guess I just liked the main character and Edward Norton’s performance more then the actual movie and it’s idea."
    },
    {
      "rating": "4",
      "text": "You will be rewarded. But that reward is piled under white lies that are obviously not convincing.Motherless BrooklynEdward Norton, the second time director's definitely-a-first official writing credit, is everything. Has everything. From a commercial look in its bigger picture to an art-sy rhythm in details. You'd think that a script with these qualities will be balanced. And instead if anything it is immensely unsettling. The film tries to be everything and gets only few handful of things right and it had small hands and loose grip. This was the actual \"big reveal\" it was going for. And when it finally discloses the curtains, you are disappointed. I mean they did work hard and had an incredible cast to put up a dazzling show.The film also gives room for the performers and the audience to chew in the material properly. In order to do so the film celebrates, flaunts, milks on probably wrong moments that might be correctly motivated but is amateurishly staged to ever connect with the audience. It explains things more than it should. So it could be smart but it also often suggests that we, the audience are slow along with the characters floating around, swinging a bat that is nowhere near in contact with the ball.It has a background score that doesn't ring a bell and editing that misleads its audience. I can point out ten moments easily where they should have placed and moved the camera differently or would have chosen the other angle shot in post production. The actor-turned-filmmaker has got the former job to the point. We are following him in every frame and never, not even for a second, he, Norton, manipulates us into empathy, with his complex situation in this hefty case. Motherless Brooklyn's cast is cradled carefully, Norton cares the most in the film, it's just that no one looks out for him as he looks out for everyone else."
    },
    {
      "rating": "5",
      "text": "Looks great and is well-acted, but the pacing is turgidJonathan Lethem's 1999 novel Motherless Brooklyn may appear to be an old-fashioned private-eye noir, but in reality, it's about gentrification, institutionalised racism, political corruption, and how such things are woven into New York City's historical fabric. It's a quintessentially postmodern narrative, fracturing the relationship between the physical and the temporal by taking the sensibilities of 1950s noir and supplanting them into an end-of-century milieu. Written for the screen, produced, directed by, and starring Edward Norton, the 1957-set film asks how much corruption are we willing to forgive in a world in which there's a confluence between power and amorality. An average noir mystery, whilst it's aesthetically impressive and the acting is universally excellent, the film can be spectacularly on the nose and didactic. It also moves at a snail's pace, and Norton is never really able to generate any sense of urgency.New York City, 1957. Frank Minna (Bruce Willis) runs a small PI firm staffed by men whom he rescued from an abusive orphanage when they were still children. He's most fond of Lionel Essrog (Norton), who suffers from Tourette Syndrome, and who has a photographic memory. When a meeting between Minna and unidentified parties becomes contentious, tragedy strikes, and Essrog determines to get to the bottom of the case, slowly unearthing a labyrinthine conspiracy involving local government and urban redevelopment plans.Apart from relocating the story to 1957, the most significant change to the plot of the book is the addition of Moses Randolph (Alec Baldwin), who's based on Robert Moses, the man largely responsible for New York's high-way infrastructure, the departure of the Brooklyn Dodgers to LA, the development of Long Island, and whose controversial urban redevelopment philosophies continue to be implemented all over the world. Operating with almost complete autonomy from regulatory oversight, Moses was a narcissist obsessed with power, and an amoral racist, and so too is the character in the film.In terms of genre, the film features many of the trappings of classic noir – the world-weary private eye, the laconic voiceover speaking directly to the audience from an unspecified point in time, the seemingly important clues which ultimately lead nowhere, the seemingly irrelevant clues which ultimately lead somewhere, the smooth jazz score, the smoky jazz clubs, the chiaroscuro lighting. There's even a scene in which Essrog finds an address written on a pack of matches.Motherless Brooklyn's most obvious strength is its aesthetic. Beth Mickle's production design, Michael Ahern's art direction and Amy Roth's costume design are all exceptional, contributing to the nuanced and immersive period-specific tone, with the milieu feeling lived-in and completely authentic. Norton's direction is, for the most part, straightforward and unfussy, but one visual motif he uses several times is shooting directly from Essrog's POV either during or immediately after the character has taken a beating. It's a nice (if somewhat unsubtle) directorial choice, drawing us directly into Essrog's experience when he's at his most vulnerable. On the other hand, the dream scenes are far less effective, feeling as if they're from another film entirely.For all its thematic importance and laudable aesthetic aspects, however, I found Motherless Brooklyn disappointing. The pacing is so lacking in forward-momentum that the story is practically somnolent. Partly because of this, it's a good 20 minutes too long. I understand Norton wanted to let the material breath, but there's a difference between giving the characters and themes room to develop and stalling for the sake of it, and so much of the film feels like the latter. There's also a disconnect between the politics and the detective story. In Chinatown, everything feels organic – the personal and the political are intertwined. In Motherless Brooklyn, however, Norton is never really able to integrate the two. Another issue is that because the novel features 50s values displaced into the last years of the century, the endemic racism is deeply disturbing – society today is more enlightened about such things, but here's a novel in which characters are acting like it's 40 years prior. This is a vital part of Lethem's postmodernist deconstruction of power structures. However, with the film set in the actual 1950s, the racism feels like period-appropriate window dressing, losing virtually most of its thematic potency.An old-fashioned detective story with a lot on its mind, Norton's passion for the material is self-evident. However, that passion hasn't translated into an especially good film. Void of almost any tension, although it looks great, Motherless Brooklyn is a film unsure of its own identity and unable to make us care about much of what it depicts."
    },
    {
      "rating": "8",
      "text": "Motherless Brooklyn, a crime, drama film noir throwback by Edward Norton, tells the story of a gumshoe detective with Tourettes Syndrome, a disorder characterized by involuntary tics, investigating the death of his boss, mentor and adoptive father figure, Frank Minnis, played by Bruce Willis. Edward Norton wrote, directed, starred and produced the film.Edward Norton in Warner Brothers Pictures MOTHERLESS BROOKLYN. (Photo courtesy of Warner Brothers Pictures)A passion project twenty years in the making, Motherless Brooklyn, attempts to re-imagine the famed film noir era. While most noir films were black and white, Norton chose to showcase his work in color. And with a cast including Leslie Mann, Gugu Mbatha-Raw. Bobby Cannavale, Alec Baldwin, and Willem Dafoe, I can certainly understand and appreciate his decision with the film's colorful characters. Norton's performance as Lionel Essrog, the Tourette detective, reminded me of Norton's Oscar-nominated performance as Roy/Aaron in the 1996 crime drama, Primal Fear. It's every bit as impressive though seemingly carries a lighter psychological heft.Alec Baldwin, left, and Edward Norton in Warner Brothers Pictures MOTHERLESS BROOKLYN. (Photo courtesy of Warner Brothers Pictures)In Motherless Brooklyn, Lionel finds his legs in the world of detective investigations after the death/murder of his boss/mentor and adoptive father figure, Frank Minna. Driven to find the truth, Lionel navigates various scenes and worlds of New York City in the 1950s with a rock-hard determination as the film's peripheral characters are uninterested in who killed Frank Minna. Rather, each character has his or her selfish interests to pursue. Lionel, on the other hand, is steadfast and goes to any lengths to pursue the truth going so far as to impersonate a prominent and well-known New York Times newspaper reporter.Edward Norton in Warner Brothers Pictures MOTHERLESS BROOKLYN. (Photo courtesy of Warner Brothers Pictures)Norton's character, Lionel, carries the film from start to finish. Utilizing a traditional, signature noir element, the narrative voice-over, Lionel fills the audience in on background elements as the film dives, reminiscent of Roman Polanski's Chinatown, into a world of gangland violence and shady real estate deals within a flourishing underground entertainment scene.Gugu Mbatha-Raw, left, and Edward Norton in Warner Brothers Pictures MOTHERLESS BROOKLYN. (Photo courtesy of Warner Brothers Pictures)Several other aspects of the film push the work into the apex of top films. The film's musical score by Daniel Pemberton takes a seat with the Miles Davis score in Elevator to the Gallows. Wynton Marsalis and Michael K. Williams deliver an astonishing, melodic trumpeting as Lionel and Gugu Mbatha-Raw's character, Laura, a community, housing fairness activist, share a heartfelt, tender moment. The costuming from Amy Roth,  the cast of characters by Avy Kaufman and production design from Beth Mickle qualify the film as a solid period piece set in the 1950's New York City. And while the mise-en-scene appears simple, it works magically with the calm, cool, polished voice-over narrative of a retrospective Lionel. Interestingly, Norton collaborated heavily with two-time Oscar nominee, Cinematographer Dick Pope.Edward Norton, right, and Willem Dafoe, center, in Warner Brothers Pictures MOTHERLESS BROOKLYN. (Photo courtesy of Warner Brothers Pictures)Granted, with an A-list cast of Hollywood actors, Norton's directorial work would seem to be a walk in the park. Yet, Norton not only directed the film, but he also played the lead role adapting the Jonathan Lethem prize-winning novel of the same name to the screen, and was a major producing partner.With a run time of 144 minutes, Motherless Brooklyn, comes in on time. Some editing and production choices allowed an emotional peek into the \"broken brain\" of Lionel and his coming to terms with his Tourettes that some viewers might find unsettling. Undoubtedly, the film, a Warner Brothers Picture production, is a vehicle for Edward Norton to showcase his talents. Yet, it also sheds light on a ruthless period in the urban planning of New York City providing illumination into today's socio-economic/political environment. Highly recommended."
    },
    {
      "rating": "10",
      "text": "ESTA PELICUL APARENTEMENTE FUECRITICADA POR PUROS SACO WEAS QUE LE CHUPAN EL PIPCO AL JOKER Y NO QUIEREN ACEPTAR QUE \"IF\" ESTA PROBABLEMENTE, SEA DE LO MEJOR DE LOS DEBUT DE DIRECTORES EN EL GENERO DE MISTERIO PD: FINCHER TEN CUIDADO"
    },
    {
      "rating": "10",
      "text": "Motherless Brooklyn and the Joker are two main Oscar contenders this year. Each of these movies brings a very powerful message to its audience. Be sure to check it out in theaters."
    },
    {
      "rating": "10",
      "text": "A thriller in the classic noir style. Norton delivers a great performance worthy of an Oscar nomination. Stylish and sleek!"
    },
    {
      "rating": "8",
      "text": "I scored the movie high because the acting was great (especially Ed Norton and Gugu Mbatha-Raw). The storyline was coherent and you could follow but the pace was noticeably plodding. I would wait till this comes out Pay per View, but I would not miss it. It was a good movie just slow enough to make it borderline tiring."
    },
    {
      "rating": "10",
      "text": "Don't look at all those ratings. Those are the bots who try to undermine the film's quality. Be sure - the movie is nice, nearly 9 out of 10. I give it 10 only 'cause some \"bad people on the right\" decided to bury it and promote Joker instead. That's the truth, though it may sound like a conspiracy theory at first. Just visit all the user's profiles on this page and check their stats. Everybody is literally the same person who has 14 ratings, who writes only 2 reviews (regarding Motherless Brooklyn and Arctic Dogs), giving the movies mad 'zeroes'. And then, there's Joker, rated by them with 10/10. So.. the conclusion: bots, darn!"
    },
    {
      "rating": "10",
      "text": "A film reminiscent of Roman Polansky’s magnificent noir “Chinatown,” “Motherless Brooklyn” is an interesting and beautifully acted film about political corruption, directed by and starring Edward Norton. Although I found the detective’s Tourette’s Syndrome more distracting and annoying than effective, the plot is well-handled and the supporting cast generally excellent."
    },
    {
      "rating": "4",
      "text": "Edward Norton plays a private detective in 50s New York, who also has Tourette Syndrome. Other than the expected twitches and outbursts, it didn't add much interesting to his character. What was especially weird was that everyone in the movie freely accepted it (in the 50s!). Considering that he also wrote and directed, it's pretty apparent that he was looking for an Oscar-bait showcase (remember Rain Man?). He's learned a few things about making a movie, but sadly, his script rambles too much and his direction creates little emotional connection for him or any of the other relationships. The plot revolves around corrupt politicians and a scheme to displace black citizens for the sake of \"progress.\" The film does manage to capture some of the darker elements of film noir, but still lacks much stylistic punch. At 2.5 hours, the slow unraveling of the mystery has no real shocking revelations and lacks interesting depth. This is more a curiosity than an updated extension of the genre."
    },
    {
      "rating": "4",
      "text": "I love the noir era 50s and really respect Ed Norton as an actor. But this is just a mess, and feels like a directorial debut despite being his third go-around. Maybe it would be worth a light recommendation if it wasn’t needlessly 2.5 hours, but *shrugs*"
    },
    {
      "rating": "8",
      "text": "This movie was great, if not a bit rough around the edges.  Ed Nortons love letter to NYC, the production was surprisingly shoddy with more than a few modern out of place buildings/sets for a story told in the 1950's, the acting/directing a bit wooden in places, but overall a real nice flick.  Recommended."
    },
    {
      "rating": "9",
      "text": "I wonder what score reviewers would give if they knew how much of this movie is true? For example Robert Moses (on whom the character of Moses Randolph is based) really did decree that the bridges out to Coney Island should be low enough that buses - carrying black New Yorkers - couldn't fit under them. And he really did invent those powerful entities called \"authorities\" so that he would have more power than the mayor. But that's not what makes this movie so good. What really elevates this film is the directing, the storyline and the uniformly good ensemble acting. Oh - and add Edward Norton's masterful performance as Lionel. All in all, this is simply an enjoyable, satisfying and important film."
    },
    {
      "rating": "2",
      "text": "The opening scene catches your attention, and it slowly dwindles from there. Norton and crew blow on the embers of a worn out agenda. But the fires already gone. The jazz breaks, offer a dreamy state to the movie, and Baldwin's performance offers time for a bathroom break. The movie feels about 30 minutes too long."
    },
    {
      "rating": "6",
      "text": "Audience REACTIONS at its International PREMIERE:"
    },
    {
      "rating": "8",
      "text": "\"Motherless Brooklyn\" is a relaxing and engaging mystery noir that reinforces Edward Norton as a talent in front and behind the cameras."
    },
    {
      "rating": "7",
      "text": "Great casting, soundtrack and cinematography elevate the unoriginal plot in this slow paced mystery drama."
    },
    {
      "rating": "6",
      "text": "This loosely fact-based 1950s crime saga has much going for it but, unfortunately, it doesn't quite pull it all together. The film's superb noir-esque production design, inventive cinematography and ethereal soundtrack create the perfect mood and setting for its stellar cast, including Edward Norton, Alec Baldwin, Bruce Willis, Willem Dafoe, Bobby Cannavale, Gugu Mbatha-Raw and Cherry Jones, creating a vehicle reminiscent of \"Chinatown.\" Sadly, the overlong and, at times, exceedingly convoluted story line becomes difficult to follow, trying the patience of even the most devoted moviegoers. A nice try, but one that doesn't quite knock it out of the park."
    },
    {
      "rating": "9",
      "text": "Grossly underappreciated. Phenomenally acted, really well written.Echoes of Chinatown but there's nothing wrong with that.There is no reason that this movie should be as under appreciated as it is."
    },
    {
      "rating": "6",
      "text": "Overall, I'd have to say the film is a bit tiresome.  It might have done better as a straight detective flick, or as a film delving into a man's mental challenges, but combining the two somehow yields up less than the sum of its parts.  Lionel Essrog is an interesting character but should have remained a supporting character.  He just doesn't have enough of the right stuff, whatever that might be, to carry the movie on his own.The plot, of course, doesn't help.  It's another corrupt fat cat (ho-hum) steamrolling his way over anyone who opposes him and maybe it's time we consigned fat cats to the genre dung heap.  I mean, I'd rather watch a film so tormented that no one, not even Raymond Chandler, can explain it, as long as it's got players like Bogart and Bacall to keep the action entertaining, as in The Big Sleep (1946).On the other hand, I wouldn't mind getting to see a movie that stuck to the original novel.  The author of the original novel described Edward Norton's adaptation by saying, \"It’s as if the book was a dream the movie once had and was trying to remember it...\"Not exactly a ringing endorsement."
    },
    {
      "rating": "9",
      "text": "The efforts of Edward Norton as orchestra man (actor, director, writer and producer) are admirable. The story of an asocial detective who tries to find out who and why killed his mentor looks like -almost- the unknown son of Chinatown. With that not negligible cast, it's too hard not check out."
    },
    {
      "rating": "8",
      "text": "Was looking forward to it ever since the trailer released. Watched it today. Liked it. Wasn't disappointed at all. Although there's still something missing, not enough tension, perhaps. It was really interesting to watch, but the plot is too 'easy', it isn't gripping enough. Feels like it could be better.Anyway, I recommend everyone to see it, it deserves the credit! The actors performed wonderfully: I saw the characters, not actors playing somebody else. Can't wait to see it again, this time at home!P.S.: I really don't know where all the negative reviews are from. I can't get those who fall asleep in cinemas. I just can't. And perhaps, the moderators should check the accounts for bots or smth."
    },
    {
      "rating": "7",
      "text": "I really like the idea of a protagonist with Tourettes, it requires everyone to see past his faults or have no relationship.  The photography by Dick Pope was very nice, his biggest success being Happy Go Lucky.  Ed Norton has apparently tried for 20 years to get this made, an update on Chinatown of sorts.  Bruce Willis is always good but far underused, Alec Baldwin same story-he is much better without anxiety.  I think all these characters could have been elevated by coping with his Tourettes instead of ignoring it, maybe restraining themselves from mocking or defending him more.  I am guessing the success of Birdman made this possible.  I agree it is a vanity project, as such maybe the Ed Norton Character should have been less central."
    },
    {
      "rating": "6",
      "text": "Almost 20 years later Edward Norton decides to go back to the director's chair and this time making the adaptation of a famous criminal novel that he loves.Did things go well? Yes and no.I have the understanding that he changed the decade in which the events of the book take place, because the story of the book occurs in the 90's and the film is located in the 50's.I can't argue if it was a good change because I haven't read the book but it works in the film.However, the problems begin when it's clear that Norton is not an experienced director and the slow pace ends up playing against him and it's not that the quality decreases, is just that stops feeling so interesting. You should definitely have patience.In addition, the mystery is too tangled and with almost two and a half hours of duration; Motherless Brooklyn is a film that feels a bit excessive. Although that's not entirely Norton's fault but of the script as well.Norton fulfills in a basic way as a director but his best work is as an actor and in his own film he shows it and also the rest of the cast. They are who manage to hook you and if it had been otherwise I think this would have been a great failure but things went fine and in general it's not a bad film.Considering how perfectionist Norton considers himself, I don't know if he can say that he achieved the film he dreamed but at least he did it well enough."
    },
    {
      "rating": "9",
      "text": "Old style film noir with great story and characters.The best performance (and direction) from Edward Norton in ages!"
    },
    {
      "rating": "7",
      "text": "This was surprisingly a really good movie. The best part of it was of course the acting with such a great cast of actors that is pretty normal but the guy who played the main character who had tourette syndrome did an exceptional play, he was so good that I almost had to stop and google if he really had it that's just how amazing he was at playing that role. The story was a pretty decent one with a weak ''reveal'' which was fine I guess , I enjoyed the fact that it was also pretty realistic and that the ones that have the power will continue to have it. Some parts were really slow and our guy kept getting knocked out which was getting kinda annoying after the first time but overall a pretty decent movie."
    },
    {
      "rating": "5",
      "text": "It’s been reported that Writer/Director Edward Norton wanted to make a movie based on Jonathan Lethem’s novel “Motherless Brooklyn” ever since the book was published in 1999.  Perhaps this film might have been fresher if Norton hadn’t had twenty years to write and re-write the script.While the book is set in contemporary times, Norton chooses to re-set the film in 1950’s New York City.  This offers the visual advantages of huge, boxy cars careening around corners, suits with impossibly wide lapels and fedoras all around.  There are also opportunities for timeless shots of steam rising through manhole covers in the streets, a lot of streetlights casting long shadows late at night and lingering looks in low-lit lounges, just in case the viewer isn’t fully aware the film is neo-noir.  The costume design, cinematography and even the story line invite inevitable comparisons to 1974’s “Chinatown.”  Unfortunately, the shortcomings of “Motherless Brooklyn” are quite glaring in that light.The story centers on Lionel Essrog (also Norton), sometimes called Motherless or Freakshow.  After his boss and idol Frank Minna (Bruce Willis) is gunned down, Lionel determines to avenge his mentor’s death.  In his dogged pursuit of justice, Lionel still has time to reflect on racism, observe the corrosive effects of unbridled power and to offer a few observations about the intended and unintended consequences of urban planning.  Carrying it all along is a great jazz score by Wynton Marsalis, with Michael Kenneth Williams (“The Wire”) as the trumpet-playing frontman.A core problem for “Motherless Brooklyn” is that it’s way too earnest for the genre.  In stark contrast to Jack Nicholson’s hard-boiled character in “Chinatown,” Lionel’s motives, consistently, are surprisingly pure.  This departure from the genre does offer one key benefit: because the story spends so much time revealing Lionel’s virtues, it reveals clearly his neurological condition (Tourette’s?) while allowing Lionel to retain his dignity, his nervous tics a peripheral quirk not a defining element of the man.Regrettably, most of the other characters are more cardboard cutouts than interesting individuals.  This is particularly unfortunate given the actors involved – Willem Dafoe, Alec Baldwin, Cherry Jones, Bobby Cannavale and Leslie Mann, in addition to the short-lived Willis.  As Laura, Gugu Mbatha-Raw (“Belle”) is a captivating, luminous exception.Finally, the film relies way too much on exposition and way too little on action.  As a result, the film frequently bogs down in talk-heavy, inactive scenes that are plodding, preachy and pedantic.  With a running time of 2:24, that’s simply too much to ask."
    },
    {
      "rating": "10",
      "text": "I really enjoyed the movie. Sound, decorations, acting..Everything was off the charts.Hope to see more movies from Edward Norton in the future."
    },
    {
      "rating": "6",
      "text": "With Motherless Brooklyn, Edward Norton has created a retro mystery, filled with music and laughter, banter and bullets. Noir films might not be popular anymore, but this film serves as a reminder of why they remain such a beloved genre in the film community. Though its script might not always follow through on ideas or subplots, Motherless Brooklyn still presents us with a glimpse into the past, populated with great characters and sweet music. It’s a trail worth following."
    },
    {
      "rating": "10",
      "text": "Just a great movie! Great cast, awesome atmosphere. Especially great game by Edward Norton. I advise the film"
    },
    {
      "rating": "9",
      "text": "Very good pace of a good mystery story... And best of all are the images, during the movie I told mybwife: I could watch this movie even just for the magnificent lighting, each shot was well studied and carried out... Seriously, this movie should at least get an eversgebabkvd 7.5 or 8."
    },
    {
      "rating": "10",
      "text": "I simply can't agree or support the mixed or negative reviews this got by critics. Thoroughly enjoyed this film. great feel throughout the movie, and the soundtrack is now in my playlist for life. Edward poured his heart into this project and the work is exceptional. truly hope this gets the recognition it highly deserves."
    },
    {
      "rating": "7",
      "text": "In the vain of \"Chinatown\" and \"L.A. Confidential\" this P.I. mystery is an enjoyable watch even though at times it is a bit middling and it is a bit bloated.Norton's performance is central to this movie and he does a great job as the lead Lionel."
    },
    {
      "rating": "7",
      "text": "z jednej strony ciekawy i dobrze zagrany, z drugiej zaś moim zdaniem nieco zbyt rozwleczony oraz zbyt prosty i przewidywalny. Przynajmniej klimat na plus"
    }
  ]
}