{
  "id": 2768,
  "title": "mother!",
  "starring": [
    "Jennifer Lawrence",
    "Javier Bardem"
  ],
  "runtime": 121,
  "genre": [
    "Drama",
    "Horror",
    "Mystery"
  ],
  "description": "A couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2yOKarmL8B4oXaLXUdHu882SUbu.jpg",
  "categories": {
    "plot": 4.8,
    "acting": 6.111111111111111,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 2.5,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.75
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Contrary to what some of the critics are saying, anyone with a rudimentary knowledge of Bible themes would 'understand' this poor excuse for a film. I didn't like it because it's just not very good. I was undecided about Aronofsky as a filmmaker, but having seen Noah and mother! I'm convinced he's a fraud."
    },
    {
      "rating": "3",
      "text": "Once you get the idea of who \"mother\" and \"him\" are, it starts to feel very repetitive and heavy-handed.  I can't say I really enjoyed any part of watching it."
    },
    {
      "rating": "2",
      "text": "The movie is basically Aronofsky self-fellating for two hours while Jennifer Lawrence looks on confused, braless in a thin white T-shirt. The movie is the product of drug-fueled, idle egoism. We get it Donnie Darko. If this was his first movie: maybe. But that fact that this came out of an established individual means this is basically all he's got to give creatively. It's not just that the points he's trying to make aren't that interesting or impactful. Its couple with the fact that the movie just isn't filmed or edited all that well. There is no dynamic blocking and loads of sloppy post processing. The movie plays like a comic book and it is not a stylistic choice.Jennifer Lawrence can't act."
    },
    {
      "rating": "1",
      "text": "I think opinions about mother! are divided because audiences will fall into one of two camps: those that believe that Darren Aronofsky is some sort of genius visionary and those that don't. I fall into the latter camp, and only went to see the movie out of morbid curiosity to see what all the fuss is about. All I can say is I wish I hadn't bothered. The word 'pretentious' has been used a lot and it's fitting. If there's any justice, Aronofsky shouldn't be let near a movie set again."
    },
    {
      "rating": "1",
      "text": "Trash is one thing. Trash masquerading as something profound, even art is something else. mother! is the worst kind of movie; one that draws the viewer in on a promise that it doesn't fulfill. Contender for worst movie of this century {so far}."
    },
    {
      "rating": "1",
      "text": "It's hard to adequately put in to words how awful mother! is and I only saw it because Iwon tickets to an advance screening. This should be up for a Razzie; no kidding. .Aronofsky is NOT a visionary, he is as someone else put it, a charlatan.I hope this bombs at the box office and gives everyone involved  pause for thought."
    },
    {
      "rating": "2",
      "text": "I really wanted to like \"Mother!\" since the director has made films that I absolutely adore, such as Pi, The Fountain, and The Wrestler. I even liked parts of \"Requiem for a Dream\" and \"Black Swan.\" It is sad when you compare the likes of \"Mother!\" to these other films.The only thing shocking about \"Mother!\" is how bland it is. You know when you get a joke but you still don't find it funny? Well, I understood the message and allegory of \"Mother!\" but didn't find it interesting or thought provoking in any way at all. The film is so bad that it doesn't even deserve to be called pretentious because that would imply an ounce of ambition or vision on the directors part. It doesn't help that \"Mother!\" has the subtlety of a ten ton hammer and doesn't even add an original spin on its retelling of the bible.Some movies are too smart for their audiences and don't deserve the hatred they receive. \"Mother!\" is not one of them. It is the art-house equivalent of a Transformers film. It deserves to be hated and it deserves to fail. Only gets a 2/10 because I generally like the director."
    },
    {
      "rating": "2",
      "text": "After the travesty that was Noah, I thought Aronofsky might be back on form with mother!. How wrong I was. Of course there will be those that argue that I just don't get it, but really, what is there to 'get'? It may be open to many different interpretations but the viewer needs to be invested enough to care what it all might mean. I just wasn't. I'm calling you out Aronofky. You are a charlatan sir."
    },
    {
      "rating": "2",
      "text": "Pretentious! Obvious! Crap! There -- I said it flat out, with the same kind of in-your-face, virtually nonstop barrage of disgusting imagery that makes up much of the content of this over-the-top exercise in cinematic self-indulgence. Despite several fine performances (particularly Michelle Pfeiffer) and an inventive production design, these assets can't save this morass of religious cliche mixed with contemporary social commentary. See this one at your peril lest you come away from it saying \"There's two hours of my life I'll never get back.\""
    },
    {
      "rating": "1",
      "text": "Arofonsky is channeling David Lynch. If you like David Lynch movies then this one is for you. Pensive expressions, things get worse, more pensive expressions (which Lawrence now uses exclusively in place of actually acting as she did in American Hustle), shouting, things are not what they seem and pasts we can't escape."
    },
    {
      "rating": "2",
      "text": "There's mot much I can add to the other negative reviews here. I wish I had walked out but was curious to see just how bad it could get. In that respect I wasn't disappointed. Pretentious twaddle of the worst kind."
    },
    {
      "rating": "0",
      "text": "Nobody will \"Check the spoiler\" box.  This movie is a waste of time and there is literally nothing to this movie to understand or appreciate.  I only stayed to the end to see if the montage of theatrics somehow had some meaningful message, climax or ANYTHING at the end.  I was not just sadly disappointed, but the end was surprisingly worse than the beginning and middle.  But there really wasn't a \"beginning\" or \"middle\".  It was just **** thrown together on a screen.  Shame on you metacritic for your lie of 7+ on this.  You know this is utter trash."
    },
    {
      "rating": "10",
      "text": "I'm not the kind of person that usually gives 10/10 scores on Metacritic, or even in general, but Mother! is easily my favourite film of the year. It was a captivating, dark, cynical story about love that truly left me unsettled and in awe for hours after I'd seen it. Jennifer Lawrence gives a strong performance in the leading role, and Aronofsky's direction puts us right in her shoes as we experience every step of her intense journey. It's sure to piss of a lot of casual filmgoers and it's not for the faint-hearted, but as someone who loves film and appreciates directors that try new things, Mother! is my favourite film of the year so far, followed by It Comes At Night and Dunkirk"
    },
    {
      "rating": "0",
      "text": "On-the-nose, abandons a performer in Jennifer Lawrence to play a doe-eyed five year old that strains credulity. This film is an example of art made by a director whose world-view I generally agree with—I think the allegorical idea is fascinating—but the art he eventually produced has the effect of taking an allegory and pounding you over the head with it till you scream \"Stop!\" or \"Please!\" or \"No!\" which is, ironically, pretty much the dialogue Lawrence is saddled with."
    },
    {
      "rating": "10",
      "text": "Mother! is a disturbingly brilliant film by Darren Aronofsky with terrific performances by Jennifer Lawrence and Javier Bardem. The religious/mother nature allegory within the film was completely unexpected but welcomed with its beautiful execution. In a way, Mother! reminds me of the creepy, unsettling nature of Kubrick's 'The Shining', focusing on the characters and the environment in which they live as a means of building tension and suspense... Definitely one of the most intense movies I've ever had the pleasure of seeing."
    },
    {
      "rating": "1",
      "text": "“Mother” was written and directed by Darren Aronofsky so at least we can lay the blame for one of the worst pictures I have ever had the misfortune of viewing in many years. Starring Jennifer Lawrence, Javier Bardem, Ed Harris and Michelle Pfeiffer, this film isn’t worthy of the time it takes to write this review except that, by giving an honest summary of it, others will hopefully be dissuaded from going to see it and that I will consider my good deed for the week. It’s difficult to characterize this movie without using such adjectives as insane, unrealistic, absurd and mostly acts of exreme overkill and violence. Much like some modern art pieces, there are some misguided folks who may see allegories and analogies to life in this cinematic disaster but for this viewer, at least, I saw nothing more than ridiculous manifestations of bad writing and directing with supposed horror scenes so bad that, instead of being fear provoking, made them almost laughable. It would have been funnier had I not wasted an evening watching the movie instead of some bad television at home. I give this poorly executed effort by Mr. Aronofsky a one rating, and that goes solely to Ms. Lawrence’s efforts on the film’s behalf. Simply stated this is the “Mother” of bad movies” and deserves your firm boycott of this insult to the viewing audience."
    },
    {
      "rating": "0",
      "text": "What an absolute waste of time. This was THE most annoying movie I have ever seen in my life. Folks, do yourself a favor and skip this one. Three people walked out of the theatre mid-way through and I forced myself to stay to the annoying and unresolved end."
    },
    {
      "rating": "0",
      "text": "If you like pacing done by a crackhead and lighting by Stevie Wonders less sighted brother this movie is for you. I can't go on and list the next 100 reasons not to see this movie. Shaky camera shots throughout will make many nauseous for days afterwards. Do something, anything else than attend this movie. Thank you"
    },
    {
      "rating": "0",
      "text": "Possibly one of the worst movies I have ever seen...a distinction that The Draughtsman's Contract (1982) has held in our house for 35 years.  Tedious, pompous, pretentious claptrap.  No attention to continuity, character or plot development. Why bother? The fools who paid to see this movie are prominently featured throughout.  We know exactly what Aronofsky thinks of his \"fans.\" The house is wonderful though."
    },
    {
      "rating": "0",
      "text": "Well, congratulations to this film! I've honestly never walked out of a movie before in my life...until now! I honestly don't even want to get into this God-awful travesty of a film! All you need to know is that it has absolutely no plot and no sense of direction whatsoever! I'm still trying to decide if what I've just witnessed is one of the worst films I've ever seen or if it was simply director Darren Aronofsky's worst shroom/acid trip that he once had and decided to conceive into a film and force upon us poor audience members! Either way, it's one of the most miserable, unforgivable, and disgusting experiences I've had at the theater in a loooooooooong time!!!!!!!!!!"
    },
    {
      "rating": "0",
      "text": "We all know Darren Aronofsky. Remember Black Swan. Wasn’t that great? Didn’t you just love it? So step right up and see the new Darren Aronofsky movie. It’s so weird and highly controversial, you can’t not see it. It’s Darren Aronofsky so go see Mother! Why not? Well I’ll tell you why not. I like weird and I’d like to think I can tolerate a bit of controversy but damn, even I have a limit. I don’t think I will ever be able to adequately describe how truly terrible Mother! is but I’ll give it my best shot.It’s not that Mother! offended me, or shocked me. I’ve seen far more shocking scenes in movies (looking at you Martyrs) but Mother! has no plot, no narrative, no music, the cinematography doesn’t exist, and the cameraman forgot how to zoom out. There is no sign of any direction. Seriously if this didn’t have Aronofsky’s name on it I doubt it would have even got a cinema release. But wait there’s more, Jennifer Lawrence is giving the worst performance of her career. There’s no script. There is nothing good about Mother! So Darren Aronofsky if your sole goal was to get a reaction well then you’ve sure done it. But a movie so lazy and tiresome comes at a cost. I’ve lost all respect for you as a director and your name means nothing anymore. The only reason I didn’t walk out was the desperate hope that it will eventually get good. I wouldn’t want to walk out only to miss the point, the dramatic conclusion. I’ve watched this much I have to see it through right? Well as I’ve sat through all 121 minutes and without giving away spoilers (not that I could even if I wanted to) I can safely say this movie is not worth sitting through. So don’t go see Mother! It doesn’t deserve your time or your money. I’ve told you to skip Mother! but if you decide the curiosity will get the better of you then best of luck, just remember you can’t un-watch it! Ever! I don't often give zero ratings but Mother! definitely deserves it."
    },
    {
      "rating": "10",
      "text": "This movie is brilliant in all the senses. It cannot be horror as the trailer presented it but it's a clear criticism of the religion and the impact that humans have on the planet earth. We need to celebrate this kind of risk that only a few amount of directors are taking to elevate the cinema. Aronofsky is a director, who gave us brilliant films like requiem for a dream and black swan, and with mother! he doesn't disappoint. Lawrence performance is good (excellent choice of casting), all the members of the crew and all the elements involved in this movie, make it a masterpiece"
    },
    {
      "rating": "10",
      "text": "I think this movie deserves an 8 or 9 out of 10, but mark it at a 10 to counteract all the stupid criticism this movie has garnered. Yes, it's a criticism of religion. Yes, it went completely overboard, but goddamnit, this is a superb movie, from the theme to the acting to the camera shots and even the dialogue. Where it struggles is in pacing, but the mere fact that someone patched together this bunch of madness into such a good movie more than makes up for it. Go into the movie expecting disturbing visuals, but come out pondering what life on earth is."
    },
    {
      "rating": "10",
      "text": "I haven't seen a movie that left me so emotionally and intellectually stimulated since Eternal Sunshine of the Spotless Mind.  This film is like nothing I've ever seen, and I just can't seem to get it out of my head.  Don't go in thinking you're going to see a horror film.  Be prepared to analyze dense allegorical content, and be prepared to read a lot afterward to better understand it.  Just brilliant."
    },
    {
      "rating": "10",
      "text": "This is Aronofsky's rage project. A film that needs to be seen to believed. People will either hate it or love it (I loved it), but one thing is for sure, it is unforgettable. Masterful performances (especially Jennifer Lawrence), direction, cinematography, SOUND DESIGN make this a wholly cinematic experience."
    },
    {
      "rating": "10",
      "text": "Crazy-good! Arofonsky is such a visionary director. This movie will likely polarize the audience, but it's impossible not to recognize his amazing talent. Lawrence is incredible as well. Perfect combo."
    },
    {
      "rating": "10",
      "text": "I walked out of Mother deeply shocked. There were people standing around outside the theater looking dazed and confused. And then I realized just how familiar this stunned state is. This is the madness we are  living each day; pausing before hitting the refresh button on the news webpages, not sure if we are ready for the violence, devastation and pure narcissistic  greed visited upon us each day. Just when it seems like things can't get worse: as in the film,,they do. Great film making. Thanks Darren Aronofsky for the experience of art and reality in the cinema again.  Thanks for connecting  me with what has been buried so deep. WARNING: for the Saturday night movie goer, this is definitely not a date movie."
    },
    {
      "rating": "10",
      "text": "I saw it last night and really liked that movie. It is not like anything you´ve seen before. A story about a couple and their house as well as about the universe, earth, mankind. It´s former title \"Day 6\" is telling a bit more what it is all about, I think. The idea is truly unique and hopefully this movie will make people talk and think and talk again... and then maybe think a bit more of what they can do for our future on earth. And while doing that they can enjoy absolutely magnificent performances by all actors, but mostly by Jennifer Lawrence and Michelle Pfeiffer. Both of them were absolutely Oscar-worthy looking at what I´ve seen this year so far."
    },
    {
      "rating": "7",
      "text": "This is a relatively frenetic film, with lots of shaky camerawork, quite fast paced scenes of initially domesticity but then something goes wrong. Jennifer Lawrence I thought did quite well as the clearly anxious wife, very much sensing things are going to go badly wrong and having to deal with the situation she finds herself in. This is less of a jumpscare heavy sort of a horror film and more of a slightly spooky film with a heavy emphasis on symbols and how you interpret things. There is a fair bit of blood shown across some scenes, so be aware of that. There's also some hushed dialogue which was a bit hard to follow in full, which may frustrate some. I'd say its fairly atmospheric. The tone of voice of some of the male characters is definitely...frustrating and borderline creepy possibly. I imagine a lot of women could relate to the feeling of loss of control, loss of space and privacy that's portrayed in this film. Javier Bardem also gives a pretty decent performance in this claustrophobic film. It won't be a film that will appeal to all and I felt it seemed a bit ludicrous when pace wise it headed towards the last quarter or so but overall its relatively good for what it is, so I suppose I would recommend it, yes."
    },
    {
      "rating": "6",
      "text": "at last i have seen the 'masterpiece'. better than i expected. if it's an allegory for mother earth and her tortured life of being abused, even by her maker 'the poet'.i would not think it's very bad as the acting compensated for the craziness and the mess has a lot of meaning to contemplate on. i thought it's more coherent than Tenet....many things were thrown in including the sacrifice of the son? very disturbing but definitely the message got thro.so many things comes to mind, rosemary baby, green zone war scene, pan's labyrinth....have an open mind... not so bad.... so glad michelle is back as witches of eastwick... remember?"
    },
    {
      "rating": "0",
      "text": "Der Film ist langweilig und regt nur auf. Jennifer Lawrence ist nur dämlich in dem Film und lässt sich auf der Nase rumtanzen. Mit dem Film hat sie sich keinen Gefallen getan. Nur schlecht"
    },
    {
      "rating": "9",
      "text": "While most reviews consist of cheap shots at this movie about its lack of horror as it is classified as such, nobody seems to understand the true meaning behind why this movie was created and why it deserves in my opinion, such a high one. Although I can see many cannot comprehend it, for myself it was obvious the film is a comprehensive allegory for the bible, and poses as what I believe is an anti religion stance. While some say it is a chaotic movie with no direction, when relating scenarios to the bible, it all falls into place. \"Him\" is God, he creates beautiful work, and brings in worshippers and disciples. The two guests in the beginning are Adam and Eve. You can see as \"God\" directs them not to touch the glass figure, \"Eve\" does anyway and drops it. \"God\" banishes them from the study- or Eden - and the guests hurry out. Then, we can see two brothers - Cain and Able - fight for space in the will. This can be related to Cain's birthright, which he kills Able for and flees, just as the Eldest son kills his brother and flees. All throughout the film, each act corresponds with the biblical timeline and of course ends in Armageddon or the apocalypse, and \"god\" is all alone with his mediocre creation destroyed because of his need for admiration. This movie is made is a commentary on how if god is in fact real, his actions show that his love for worshippers is artificial, and the only genuine love he has is for the praise he gets."
    },
    {
      "rating": "0",
      "text": "Aronofsky fait des films bizarres mais le plus souvent tellement bizarres qu'ils sont simplement mauvais et si mauvais qu'on arrive pas à y croire, d'où cette impression bizarre... Alors que lorsqu'on regarde bien, lorsqu'on regarde mieux, on voit bien qu'il fait dans ces cas-là de la merde, de la vraie merde sur laquelle iront se branler quelques pignoufs de Télérama et d'autres étudiants en histoire de l'art du cinéma ouzbèke et afghano-pakistanais.Alors ici, on est pas dans Requiem ou Noé, on est dans la même merde que Black Swan par exemple... ce qui signifie un ennui si épais qu'il faut le découper au couteau... alors qu'on se demande à quoi ça rime ce bordel à chier et ça rime à quoi, cher Darren, ce putain de bordel à cul que t'as foutu ?...Seule la curiosité permet de tenir à peu près la moitié... sans passer à l'avance rapide. Et encore, c'est parce que Michelle m'a bien fait rire (avec Ed Harris, ils font un beau couple du troisième âge, il faut dire !). Mais le reste... et Jennifer Lawrence hélas... toujours aussi mauvaise ! mais bonnasse quand même, certes (et on est parfois récompensé mais pas autant que sur son téléphone... certes !).Et le reste du film, eh bien euh... ça se traîne lamentablement comme un tocard en panne d'inspiration... et devinez qui est ce tocard pas inspiré ? c'est Darren Aronofsky qui a meublé, illustré sa vacuité avec du remplissage de vide et d'inepties pendant deux heures ! rembourse le temps perdu, espèce d'enculé !"
    },
    {
      "rating": "10",
      "text": "It's definitely a masterpiece. Jennifer Lawrence gives the best performance of her career. With each new viewing you get to notice more and more things"
    },
    {
      "rating": "2",
      "text": "Bad beyond words. I resent some of the comments implying that if you don't like this film you're not intelligent enough to 'get' it. The Biblical allegory is so blatantly obvious it's laughable.If you want to see a film of epic proportions which is much more thought provoking , go and see Blade Runner 2049."
    },
    {
      "rating": "0",
      "text": "\"Pure egotism\" and \"Self-indulgent tripe.\" Using the reviews from the Simpsons episode where Mr. Burns submits an art house film called \"A Star is Burns\" is the best way to describe this."
    },
    {
      "rating": "2",
      "text": "This movie was filled with twisted violence and symbolism, which, when combined with religion, can be truly bizarre. It uses people's fear of the unknown against them. The intruders have no logic or goal. They just come up with new ways to be terrible. What frustrated me about it were the numerous comparisons to different topics like the earth or the bible. Because even the writer had no definitive answer. Its just chaos and insanity for the sake of it."
    },
    {
      "rating": "0",
      "text": "Let a bunch of big name actors have a say in a movie and you get \"art\" that is so bad no one wants  to watch it. Actors should stay out of politics and movie direction because they posion everything they touch. Worst movie of the century!!!"
    },
    {
      "rating": "3",
      "text": "This movie is incredibly strange. I like Darren Aronofsky as a director so was really hoping for an enjoyable movie-going experience. Everything was progressing well for the first half. I remember thinking to myself, actually, this isn't so bad.  Then the entire story descended into complete and utter madness. It became a non-sensical, chaotic mess. People around me were laughing, and I couldn't criticise them for it! It's a real shame because the cast as a whole is quite good, although Jennifer Lawrence has the same gormless expression throughout. I think Aronofsky tried to be a little too intellectual with this. It felt very self-indulgent and egotistical as a piece of work. It's definitely unnerving but also frustrating and confusing which doesn't make it an easy watch by any means. At the same time, it's overwrought with religious allegory and moral overtones. Honestly, I wouldn't recommend this to anyone except for sheer curiosity. If you're going to see it anyway, then I recommend waiting until you can do it at home so at least you can pause it, forward it or just stop when you've had enough. Very disappointing."
    },
    {
      "rating": "3",
      "text": "\"mother!\" is a metaphorical movie with completely obvious metaphors (those related to religion are especially so). It's also a movie that clocks in at just under 2 hours, but feels at least 4 hours long."
    },
    {
      "rating": "2",
      "text": "There is lots going on in Mother and plenty of layers and allegory which are so obvious as to bludgeon you over the head but at it's heart it's a vile disturbing movie. Perhaps something for film students to mull over but at it's essence it's a bleak, disturbing mess. Although Jennifer Lawrence is excellent and convincing. Unless your into film at it's most bleak art form avoid this like the plague."
    },
    {
      "rating": "2",
      "text": "I really don't understand how people could like this movie: it is just a mess! It goes in all directions, it is like every time the writer has an idea he put it in the scenario.So, ok maybe they are trying to give multiple messages, some may say that it is good because it is not like other hollywood movies but at the end, no message is really given and at the end of the film it is just pure confusion.Very disappointing, just another intellectual/ego masturbation."
    },
    {
      "rating": "1",
      "text": "OMG, what a painful mess. I kept wondering what went through Jennifer Lawrence's mind, showing up every day to shoot this. Everything is pageant-y. The FX are B-movie-ish....maybe C. The conflict grows & grows to ridiculous levels like a Seth Rogan penis joke bit that just won't end. This movie could've actually been done well, but it takes more than EVERY SINGLE SHOT MUST BE PICTURESQUE, ARTSY & PRETENTIOUS AS IT FOLLOWS JENNIFER LAWRENCE'S FACE THROUGH THE HOUSE, which is just distracting.........room to room to porch to room to room (repeat).1 bit of hope : Kristen Wigg finally enters! (Wait, what? Yes, I know, I know..) Her 30 seconds of lines, total, were of course great. But that hope is lost as the movie only takes a further nosedive into, seriously (I think), Tarantino-grind-core ridiculous grotesque territory (see: From Dusk Till Dawn)The movie's concept could've been cool....but this wasn't......like at all."
    },
    {
      "rating": "3",
      "text": "Sure the acting was alright. I believed them. But the IN YOUR FACE metaphor was laughable. It was a joke. This movie was so pretentious I almost couldn't finish it. It is trying so hard to be shocking it makes me sick. I will never watch this movie again and am thinking twice about watching anything Darren Aronofsky is a part of."
    },
    {
      "rating": "0",
      "text": "Not sure if it is the worst movie ever made, but it is for sure the most pointless."
    },
    {
      "rating": "0",
      "text": "I know people will like bible-bashing, but this was overkill. Those last 40 minutes were totally way too far! And I didn't see any appeal to this movie. Half the time we're just following \"mother\" walk around the house, while the rest of the film is a total confusion bust if you don't know a thing about Genesis (which they totally screwed over). But hey, atheists will continue making movies on what they don't really know about I guess."
    },
    {
      "rating": "7",
      "text": "Worst. Houseguests. EVER.I spent the majority of the movie in a state of perpetual confusion. It's a challenging piece of cinema and in more ways than one. The content can be downright horrifying and it in no way holds your hand when trying to decipher what all of it means. It proves that Darren Aronofsky is not just a filmmaker, but an artist. As problematic as mother! can be, I appreciate him for creating something so provocative.The reason the film is so divisive is because it can be interpreted in a myriad of different ways. Everything is very symbolic. It's also an extremely harsh movie. It's graphic content is both the intelligent, mature work of a tortured soul and the profane temper tantrum of a petulant child. Pretentious, puerile, and poignant.By the time the movie ended I had already changed my interpretation of it several times before forming my own conclusion. Of course I did end up looking up what the film is actually supposed to be about (I just had to know) and found out I was totally wrong. I had picked up on some of the symbolism, but walked away with something totally different for the final message. I don't feel discouraged by this though. I like that it spoke to me in it's own way. That's what makes it good. You may not enjoy mother!. Could end up walking away thinking it's nothing more than a bunch of pretentious, vulgar trash. But at least it will make you feel something and in a way that only art can."
    },
    {
      "rating": "4",
      "text": "I cannot think of this film as anything other than an artistic object drawing its energy from violence against women. Black Swan was similar, but more tolerable. I liked Noah a lot though, and I'm not a Christian. Honestly, I think the character of the artist is Darren Aronofsky. Either this man is psychologically amoral, or he is just plain immoral. What I mean by that is that it looks like this is a work of art \"for the sake of art\", which uses women to shock."
    },
    {
      "rating": "7",
      "text": "Trigger Warning\"You never loved me. You only loved how I loved you.\" ---mother (Jennifer Lawrence) to Him (Javier Bardem)Directed by Darren Aronofsky (\"Black Swan\" and \"Requiem for a Dream\") \"mother!\" is possibly the darkest, most disturbing movie I have ever seen.It is absolutely one of the most affecting.Reviews have been mixed, to put it nicely. But I think the theme of \"mother!\" terrifies some people so much that they choose to be perplexed by it rather than allow themselves to even think about what Aronofsky is suggesting.My take on the film is that it is about God, humans, and our respective relationships with creation and the creative process.Humans are trying to create Heaven on Earth, and God is....well....God created our ability to create. \"mother!\" is about the futility of OUR attempts.It is about nihilism.It is the abyss, looking back at us.Congratulations to Darren Aronofsky: He got it on film."
    },
    {
      "rating": "3",
      "text": "Too graphic. There is a horrific scene of a group of people KILLING and EATING A NEWBORN BABY! Absolutely disgusting!!"
    }
  ]
}