{
  "id": 3619,
  "title": "Moulin Rouge!",
  "starring": [
    "Nicole Kidman",
    "Ewan McGregor"
  ],
  "runtime": 128,
  "genre": [
    "Drama",
    "Romance",
    "Music"
  ],
  "description": "A celebration of love and creative inspiration takes place in the infamous, gaudy and glamorous Parisian nightclub, at the cusp of the 20th century. A young poet, who is plunged into the heady world of Moulin Rouge, begins a passionate affair with the club's most notorious and beautiful star.",
  "releaseYear": "2001",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2kjM5CUZRIU5yOANUowrbJcRL9L.jpg",
  "categories": {
    "plot": 5.714285714285714,
    "acting": 7.176470588235294,
    "ending": 8.5,
    "soundtrack": 6.444444444444445,
    "cinematography": 6.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "If only the solidly composed second half matched the frantic, haphazard, and nearly unwatchable antics of its first. \"Moulin Rouge!,\" with its generally unoriginal soundtrack stylings and chaotic editing, is mostly style over substance."
    },
    {
      "rating": "10",
      "text": "This movie was really great fun in my opinion. I  hardly ever rate movies 10 out of 10, so this must be something. The music is great, the dialogue is very well written, the acting is fabulous, and the movie overall is spectacular spectacular. If you like musicals, this is for you."
    },
    {
      "rating": "10",
      "text": "This is my all-time favourite movie! I adore the fact that the whole movie is set around a love that can't really exist (kind of like Romeo and Juliet, i guess.) However, the songs are beautiful, the actors are amazing and the sets, scenery and colours of the film are really luxurious. The theme is such a refreshing change, all about the Bohemian revolution and their beliefs of beauty, freedom, truth and love, overcoming everything. This movie is perfect. No faults from me!"
    },
    {
      "rating": "10",
      "text": "Moulin Rouge is definitely the best film I have ever seen! First of, I must applaud Baz Luhrmann's great vision and direction - it surely was superb! The technical aspect of the film is extraordinary: amazing film editing, breath-taking cinematography, perfect music and just overall an excellently made film. The actors, though, make the film what it is. Nicole Kidman is ABSOLUTELY PERFECT as Satine, and has become my favourite actress ever since I first watched this masterpiece. One of the best performances I've ever seen on-screen: she sings, she dances, she dies. Perfect summary. But it's also so much more! And Ewan McGregor - who would have thought he could sing like that??? Amazing voice and one just falls in love with him. The supporting cast is also brilliant, especially Jim Broadbent who deservingly took the BAFTA award home for 'Moulin Rouge.'Overall, Moulin Rouge is an eye-candy film for people who truly believe in freedom, beauty, truth, and above all things - love."
    },
    {
      "rating": "10",
      "text": "Truthfully, the best movie I have ever seen. In my entire life. WOW!"
    },
    {
      "rating": "10",
      "text": "By the end of the 90's, the musical movie was dead in the water. That all changed when a little mad man from down under named Baz Luhrman helmed his attempt at \"An English Language Bollywood-style re-imagining of La Traviata using contemporary songs\". We expected a train wreck. What we got was one of the most original, striking, and heartbreaking romantic films of all time. Who doesn't still swoon when Christian sings \"Your Song\"?"
    },
    {
      "rating": "10",
      "text": "VincentV. Is obviously a close-minded individual because this film was a wickedly unique and creative display of art.  The fact the entire cast sang throughout the whole movie was marvelous in itself.  And as if the song selection and delivery weren't entertaining enough, they added a ton of visually stimulating wardrobes and set designs.  I am not a person that enjoys musicals very much, but this movie is so much more than a musical.  I could sit here and type on and on pointing out the many reasons why Moulin Rouge is fabulous movie, but I don't think I would do justice to the movie.  I never get tired if seeing this movie, its always just as entertaining as the first time I saw it.  Stubborn people like VincentV. will probably always give horrible reviews to movies where there's no over-the-top mayhem and/or nudity."
    },
    {
      "rating": "10",
      "text": "Moulin Rouge it's perfect. Why 66 points only?!!? God, It deserves more than that. The passion that it's seen by the way they sing their songs it's unbelievable. Ewan McGregor's work is excellent, and nicole's too. Their are perfect."
    },
    {
      "rating": "5",
      "text": "To be blunt, this movie is stupid.\r But, also allot of fun. The sheer level if idiocy is like looking at an abstract painting come to life. It makes little sense, it's very colorful, and comes off like it is high class garbage (ie like most art.)\r Overall:\rThis movie is the embodiment of the saying, \"it's so bad that it's good.\" Every moment is one WTF moment after the next, yet you keep watching. Kind of like a car accident."
    },
    {
      "rating": "10",
      "text": "After a decade long, Moulin Rouge is still one of my all -time favorite movies. I never get bored of watching it. Ewan's singing and performance is amazing, and I like his version of Your Song the most!"
    },
    {
      "rating": "0",
      "text": "This is a film for people who know nothing of history and don't mind seeing one of the most talented and tragic artists of all time portrayed as a singing and dancing life-of-the-party midget. Never mind that the REAL star of the Moulin Rouge was an obese redhead (a far cry from Kidman) nicknamed \"The Glutton\", never mind that the film is chock full of ridiculous anachronism (who the hell sold these jerks the rights to \"Smells like Teen Spirit\", fer chrissakes??? they should be found and punished. Severely.), never mind that the entire film is directed to look exactly like an extended music video: Ewan MacGregor is SO DREAMY WHEN HE SINGS and that is all that matters! (Ugh, excuse me for just a second: I feel ill.) A lot of people defend this move because they think it's \"romantic\". Well, if your ideal of love and romance is this gaudy, this detached from reality, this superficial, you can keep it. I'll stick with the real thing. This film is strictly for fourteen year old girls. Even a guest appearance by the Green Fairy can't cover the stink of this turd."
    },
    {
      "rating": "2",
      "text": "Moulin Rouge is so contrived, so lame, so up-its-own-a**, and so insultingly unoriginal, it really does make Titanic look like Casablanca. The characters are written horribly, the story is absolute crap, and the movie seems to think it's profound, and no, we are not at least able to enjoy the spectacle, because the movie is shot in such a way that the sets and costumes escape our vision as fleeting as possible. Let's imagine an incredibly shallow movie as a hollow eggshell covered in glitter. Now let's imagine self-importance and pretentiousness as a giant hand around the eggshell, pushing harder the more it believes the movie is spectacular. Do the math."
    },
    {
      "rating": "1",
      "text": "This movie is a complete and utter mess. The camerawork is all over the place, the singing isn't that good, the characters are very flat and have no depth whatsoever and the message about love is incredibly pretentious.My biggest grip is with the message. This movie is supposedly about love. But we never really learn what love really means according to this movie. Saying the word \"love\" a bunch of times does not count as talking about it. Love is arguably the most complex emotion. It's something that should be talked about in great lengths. But this movie never tells us what love is. The type of love that is stressed is the love you have with a significant other. That's not to say that that isn't a type of love worth talking about, but that's not the only type of love there is. What about love for a family member or love for your friends? Even this wouldn't be a problem but the love between the two leads is spontaneous and is not that interesting.The story itself is incredibly thin and worn out.None of the characters are interesting or complex.The camera can never sit still for five seconds.For me, nothing about this movie worked. But it still gets a 1 because the costumes were nice and I cannot stop listening to \"El Tango de Roxanne.\""
    },
    {
      "rating": "1",
      "text": "They disguise how terrible the sets look by covering them up with an endless barrage of open-mouthed sweaty faces in extreme close-up.  However, nothing can mask the god-awful squealing that passes as singing or the amateurish camerawork."
    },
    {
      "rating": "0",
      "text": "Moulin Rouge is and unbearably long movie that was so bad I rather sit around my house and stare at the walls. The music was absolutely terrible and I seriously can't say 1 good thing about the movie other than the fact I will never see it again."
    },
    {
      "rating": "10",
      "text": "It's by far the best movie that I've ever seen. The whole cast is perfect, Ewan McGregor in particular. He has the voice of an angel. The chemistry between each cast member is palpable...just amazing. Costumes, setting, plot, script...everything was phenomenal."
    },
    {
      "rating": "5",
      "text": "What crap! The people who made this movie should get out of Hollywood once in a while... It's bad enough that they substitute medleys for full musical numbers... but they use the WORST of pop music to do it. Oy, what a waste of time."
    },
    {
      "rating": "10",
      "text": "This movie combined the best of musical theatre and modern cinema. The p.d. technology and charming antiquity meet and blend beautifully in this piece. Kudos!"
    },
    {
      "rating": "10",
      "text": "The best of 2001! A masterpiece!"
    },
    {
      "rating": "10",
      "text": "Love it. Used this site for years and this is the only thing I've ever voted on. LOVE IT."
    },
    {
      "rating": "10",
      "text": "Ewan McGrego has one of the most wonderful voices I've ever heard. I absolutely love it. I love this story. It shows how people can truelly fall in love at first site. It's just absolutely beautiful. Anyone that can bring an Elton John love song and make it sound more beautiful than the original is wonderful. Baz Luhrmann chose the perfect man for that job. And Nicole Kidman wasn't so bad herself. He chose a beautiful actress for Satine. Don't think anyone could've pulled it off better than her."
    },
    {
      "rating": "10",
      "text": "This is a frenzied, messy movie musical, but it is highly enjoyable. Nicole Kidman exhibits a range that is almost too astonishing for words: she succeeds in high melodrama, camp, subtlety, comedy, and her singing is just so beautiful. Personally, Jill S., I don't think she falls flat with her comic bits at all. She has perfect timing; the scene in the elephant dressing room in particular really showcases her gifts for comedy. The way she shifts her eyes, raises her eyebrows, and adds that hilariously seductive tone to her voice is pure comic genius. And she's gorgeous beyond belief."
    },
    {
      "rating": "10",
      "text": "This is my favorite movie i could watch it over and over again its the bomb.comb, close friend ginny sites has only seen a few scenes from it and is in love as am I one of the best movies ever created and ever will be ewan mcgregor and nicole kidman are hot togther i love them, there amazing this movie was cast perfectly i would suggest it to everyone."
    },
    {
      "rating": "8",
      "text": "Beautifully acted, directed, designed, photographed, scored and edited, Moulin Rouge is also exciting and quite moving."
    },
    {
      "rating": "1",
      "text": "Awful special effects, poor music, poor singing, poor acting, poor storyline... total suck."
    },
    {
      "rating": "0",
      "text": "What on earth is all the fuss about? How can so many people give 10/10 to this load of rubbish? I would have given it -1 if I coukld! We turned it off after 30 minutes - never to re-visit - and regret wasting those 30 minutes and the price of the DVD. I wouldn't even give this unwatched trash to my worst friend."
    },
    {
      "rating": "5",
      "text": "Good as a musical, bad as a movie, the story is a little simply but its ok, is a good movie to have a good time, but the pint is that is has to be a love story and its too far of it"
    },
    {
      "rating": "7",
      "text": "Bom"
    },
    {
      "rating": "0",
      "text": "One of my most-hated movies. Non-sensical. Anti-logical. Over-done. Pointless. Imbalanced. A visual orgy for people who do not  like to think.\rLike an acid trip while having the flu."
    },
    {
      "rating": "7",
      "text": "\"Moulin Rouge!\" It was an extravagant movie but incredibly emotional. The photography, the costumes and the songs are very good. Nicole Kidman and Ewan McGregor were very charming and very good actors. And the story is beautiful and emotional. At the beginning it was fun but the end is very sad. Very good movie."
    },
    {
      "rating": "10",
      "text": "Moulin Rouge! (2001)Sinopsis:Christian, un joven poeta parisino que abandona el hogar para mudarse al barrio de Montmartre, cuna de la bohemia romántica de finales del siglo pasado y de curiosos personajes y artistas como Toulouse-Lautrec. El sexo, la absenta y el Can Can son las únicas reglas que parecen existir en este barrio que se ha convertido en el centro de la noche parisina y por encima de todo, como gran punto de referencia, el Moulin Rouge, que vive su mayor momento de gloria gracias a Satine. Satine es la estrella del cabaret y la cortesana más deseada, que aspira a convertirse en actriz. Cuando Christian la conoce se enamora perdidamente de ella y la convierte en su musa.Opinión:Para empezar, nunca vi esta película en su momento ni en los años posteriores hasta apenas 15 minutos atrás, no creí que me fuera a gustar, pero la verdad es que acabé viendo estrellitas de lo mucho que me encantó. No es para nada perfecta, tiene varias incoherencias a nivel narrativo, o sea, una película que está basada en una ópera y en una novela, que a su vez está ambientada entre 1899 y 1900 que incorpore a su repertorio canciones de Nirvana y Madonna le restan mucha seriedad al guión, a nivel visual creo que es tal vez demasiado pomposa, lo cual no me molestó, pero puede que a varios les haga explotar los globos oculares, las actuaciones están a la altura, tenemos a una Nicole Kidman divertidisima y llena de sensualidad y por otro lado a un adorable y tímido Ewan McGregor, el cual es un verdadero encanto aquí, ambos hacen una dupla excelente sin lugar a dudas.Pese a las inconsistencias mencionadas, es una película musical lo suficientemente buena para cautivar a aquellos los que les guste el cine de este género, entretiene como es debido a pesar de que para mí gusto es demasiado cursi, de no ser por el reparto, ni siquiera la hubiera visto, una versión encubierta y menos molesta de Romeo y Julieta.Valoración:5 ⭐ de 5 ⭐"
    },
    {
      "rating": "10",
      "text": "My favorite musical of all time. Heartfelt and beautiful.. I Cried. Seen this like a hundred times. Nicole and Ewan surprises, both are perfection. 10/10"
    },
    {
      "rating": "4",
      "text": "the infatuation will end..Moulin Rouge!Despite of being a musical, the background score and the songs in here aren't that good as the makers think. When the feature portrays drama, it seems cheesy and corny and when it focuses on drawing laughs, it looks like they aren't serious about it. Baz Luhrman and Craig Pearce; the writers, have written an uneven paced script that may be good in bits and pieces but not as a whole concrete material. Baz Luhrman's execution skill develops as the film ages on screen for the first half of it seems redundant and unsupervised. The performance is the only key that helps one hold on to this feature as Nicole Kidman and Ewan McGregor are convincingly good in it. Moulin Rouge! is brilliant on technical aspects like costume design, production design and choreography with a stellar performance but what lacks in here is a reason or a soul that makers fails to install in it."
    },
    {
      "rating": "8",
      "text": "This movie is a love letter to classic romance tales. Make sure to put that in your mind!I just couldn't buy the predictability of the story 100 percent. Also, the tonal shifts aren't always smooth. With that being said, Moulin Rogue! is a pure magical experience and a visual feast that became even more moving and engaging with incredible and dynamic performances from Ewan McGregor and Nicole Kidman.(8/10)"
    },
    {
      "rating": "10",
      "text": "I loved it."
    },
    {
      "rating": "10",
      "text": "My all time favorite movie! It allows the watcher to feel as though he or she is actually in the night club. The anachronistic music allows the audience member to really feel the emotions that were experienced during the time that the club was at it's early 20th century high points. The characters are well thought out and deep, and unlike many musicals, it seems believable that these people really would just break out into song together. Everyone should watch this movie several times, because it does take getting used to the hyper activity that is the Moulin Rouge."
    },
    {
      "rating": "10",
      "text": "The plot is, admittedly, nowhere near original. But hey, that wasn't what sold the movie for me. This is an incredible cinematic experience that leaves you breathless by the end. Excellent for fans of drama, romance, comedy, and musicals (or a light combination of all four)!"
    },
    {
      "rating": "9",
      "text": "A dream, a wonderful composition of music (the most powerful language used in the movie) and almost surrealistic photographic scenes. It balances between heaven and hell . A beautiful historical drama shown in a very special way."
    },
    {
      "rating": "10",
      "text": "Fantastic film, great cast, great music. Nicole K. is spectacular spectacular."
    },
    {
      "rating": "10",
      "text": "I loved this movie it deserves way over a ten! It was so much fun to watch, I could watch it over and over again. Definetly is my favorite movie, the music, the acting, the costumes, everything was amazing and definetly worth your time!"
    },
    {
      "rating": "10",
      "text": "The best of 2001! A masterpiece!"
    },
    {
      "rating": "10",
      "text": "The Best Thing You Will Ever Learn is to love and be loved in return... This movie will always be my best."
    },
    {
      "rating": "10",
      "text": "I saw it--several times. I luv it! I bought it-DVD...where is Blu-Ray version?....stunning visual work....filmmakers art masterpiece....Not for the artistically deprived !...which may explain some bewildered comments."
    },
    {
      "rating": "9",
      "text": "A dream, a wonderful composition of music (the most powerful language used in the movie) and almost surrealistic photographic scenes. It balances between heaven and hell . A beautiful historical drama shown in a very special way."
    },
    {
      "rating": "10",
      "text": "This is the best movie in the history of movies!!"
    },
    {
      "rating": "10",
      "text": "This is the best movie in the history of movies!!"
    },
    {
      "rating": "10",
      "text": "This is the best movie in the history of movies!!"
    },
    {
      "rating": "10",
      "text": "Very well organized, a musical audiences were craving for. Beautiful, spectacular."
    },
    {
      "rating": "10",
      "text": "I loved it."
    },
    {
      "rating": "10",
      "text": "This movie is very dynamic and musical. I loved it. Nicole Kidman's Satine and Ewan McGregor's Cristian are very beautiful. I think this movie is great film. I liked Kidman's and McGregor's voices."
    }
  ]
}