{
  "id": 1797,
  "title": "Mowgli: Legend of the Jungle",
  "starring": [
    "Rohan Chand",
    "Christian Bale"
  ],
  "runtime": 105,
  "genre": [
    "Adventure",
    "Drama"
  ],
  "description": "A human child raised by wolves, must face off against a menacing tiger named Shere Khan, as well as his own origins.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/clRnzMsFoMIdC7I5JsG6dnnHH8l.jpg",
  "categories": {
    "plot": 5.8076923076923075,
    "acting": 6.05,
    "ending": 6.2,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Everything that Jungle Book could have been if it hadn't just been a remake of the animated feature. Really enjoyed this!"
    },
    {
      "rating": "5",
      "text": "Perfectly adequate entertainment, and an interesting diversion into the darker aspects of the Jungle Book stories, but suffers from tonal shifts and an inevitable comparison to the (far superior) 2016 Disney version."
    },
    {
      "rating": "5",
      "text": "It was fine for a free movie. As a whole, it was underwhelming, but if you have Netflix, it's a good enough way to spend a little over and hour and a half of your life."
    },
    {
      "rating": "5",
      "text": "Nowhere near as good as The Jungle Book despite some reasonably good visual effects. The telling is just not vital enough. However, the main problem is the disconnect between characters and the actor's voices playing them. Only Cate Blanchett and Benedict Cumberbatch convince as Kaa and Sher Kahn respectively. Otherwise portrayals are lame and embarrassingly unconvincing."
    },
    {
      "rating": "10",
      "text": "I gave a ten it was refreshing. I hated both of Disney’s versions. The young man was an excellent actor. It may have seemed short but it held my interest. I am pleased there were no corny songs, thank God!"
    },
    {
      "rating": "8",
      "text": "First I thought this will be another horrible remake of an old legend, But in fact i was impressive of the work, there was bit CGI fails but it did not affect the work, very moving and emotional sound effect and music hope it will be nominated for an oscar for it, generally this was way better than what i've expected, well done"
    },
    {
      "rating": "9",
      "text": "Never a dull moment in this film. Action packed with amazing visuals and an interesting storyline. The actor who played Mowgli deserves an 'Oscar' for his performance. Family-friendly whilst being a bit more gorey than the Disney version but deserves good reviews. 9/10, brilliant/"
    },
    {
      "rating": "6",
      "text": "What sets this telling of The Jungle Book apart from the others is that it doesn't shy away from the violence. Added blood aside though, I was surprised to find that this isn't necessarily an any less kid-friendly version of the story. In fact, until Mowgli gets swept away by the monkeys the movie doesn't really do anything all that different from the highly sanitized Disney takes.The new takes on the classic characters are interesting. Baloo has a bit of edge, Kaa is something of a jungle prophet, and Shere Khan is actively slaughtering members of the man tribe. All of this hits you right at the beginning preparing you for a darker, more mature take on the source material. To its credit it mostly is. It's just that this newfound grit is constantly being undermined by the silly sense of humor. These may be more grim incarnations of the characters, but they are no less interested in having fun and swapping jokes. This naturally leads to a bit of tonal inconsistency with the content constantly flip-flopping between that of a family movie and something harsher.Mowgli's journey is quite compelling as he finds himself torn between two worlds neither of which he'll ever truly belong to. Even amongst all the more seasoned actors and excellent motion capture performances all helmed by the king of mo-cap Andy Serkis himself, it's Rohan Chand (Bad Words) who stands at the top of the pack. He's very young and doesn't have any sort of physically imposing presence, but he shows skill beyond his years in portraying Mowgli's inner and outer struggle.The action sequences are thrilling. The scene where Baloo and Bagheera try to rescue Mowgli from the monkeys is the highlight of the movie. The plot itself however is uneven in delivering the same kind of epicness. Character motivations are spot-on, but the film ends right as it starts to get really interesting and the final battle is awkwardly handled in terms of bringing everyone together. Scene transitions are also weird at times with their abruptness in finding characters in different situations.Serkis' passion for the project can certainly be felt. The CGI animals look fantastic and the title character has a satisfying arc to follow. It's successful at providing a new take on the classic story even if it doesn't have the best execution. I wish that it would have chosen to stick more with it's depiction of the unforgiving side of the jungle rather than softening the blow with Disney/Marvel style humor and that it did a better job of getting the animals to rally around Mowgli in the final showdown, but the inclusion of darker and more violent content does make for an unforgettable and often exciting version of The Jungle Book story even in the face of its flaws.6.9/10"
    },
    {
      "rating": "5",
      "text": "Better than the Favreau film in many ways but still manages to stuff the plot up badly."
    },
    {
      "rating": "6",
      "text": "An ambitious adaption of the story with a great cast, impressive visuals and a solid story to boot. If you see this film without comparing it to John Farveau's 2016 Jungle Book, which is a different adaptation then you won't be disappointed. The main problem with this film is that it's just too dark for it's own good, having very little-to-no lighthearted moments present. Which was probably done in an attempt to separate itself from Disney's 2016 adaption."
    },
    {
      "rating": "7",
      "text": "Despite weak cgi for some of the animals. I don’t see why critics didn’t like this version as much as the 2016 film. It’s darker but more faithful to the book.Critics make it sound like it loses focus of the story a lot when Mowgli is in the man village. I think the film is pretty solid and under-rated though. Mowgli learns to feel at home in the man village but has to choose between that and the jungle. So the film doesn’t lose track of the stories heart at all. Unlike what Rotten Tomatoes says. Just don’t put it on for your kids. It has no problem being overly detailed with animal deaths. Otherwise I’d probably review it higher. One death scarred me too much though."
    },
    {
      "rating": "4",
      "text": "I feel bad for Andy Serkis.His heart is in the right place and I respect the effort to make it more faithful to original novel, so I can't imagine his frustration of how this turned out.However, my pity doesn't change how incredibly underwhelming I felt about it. If I have to be honest, I was bored at times. The cgi motion capture on the animals looked horrifying, especially on Baloo who looks like he's got every disease ever. Rohan Chand struggles to act around heavy effects for an hour and forty four minutes.I will give it some merit that improves Favreau's version. Cate Blanchett as Kass was far more interesting to watch just by her voice work and big booming presence. Same thing with Benedict Cumberbatch. I already knew going in this was going to be a much darker version, but I was still shocked and surprised at certain scenes for not holding back.Other than that, I can see why this was dumped on Netflix, because I imagine it will be too bleak for the average audience member at your local cinema. It wouldn't last that long anywhere."
    },
    {
      "rating": "4",
      "text": "Mowgli is neither a dark retelling of The Jungle Book nor a family friendly romp. It’s an inert hybrid of the two."
    },
    {
      "rating": "8",
      "text": "Welcome to the jungle, for a version more sharp and dark than Disney. Actually, Kipling´s book was not conceived as fairy tale. The dillema of main characters of what is his right place in the world has it´s appeal. Kids U8 requires guardian."
    },
    {
      "rating": "5",
      "text": "I'm quite divided in this one, i was excited going in, to see another version of these characters, but the more mature look also made it quite boring.What i loved about the original and the remake was exactly what this wasn't, which was kind hearted. But this movie doesn't know what it wants to be, which gives us a mess, with tonal shifts that you can't keep up.The visuals are quite good, but some characters really did not work for me. Serkis' Baloo lost all his charm to be just another, Cumberbatches Shere Khan did not have the gravitas Idris Elba did in the 2016 remake which was a shame, Khan just wanted to kill Mowgli, well, because he was human, and he had already killed his parents, that's quite it. The 3rd act was really underwhelming and really the time mowgli spent on the village was the most boring part. I liked Christian Bale as Bagheera, the visuals, while not perfect were still great, and there was this shocking scene that Mowgli finds his friend on human village dead that really made me gasp.Overall, this movie lacked good and compelling story with good and unique characters"
    },
    {
      "rating": "7",
      "text": "The only thing that \"The Jungle Book (2016)\" did better than this one is the animals visual effects. Apart from that, this movie has a better plot and voice-acting. Some scenes felt unfinished, and at first it's very hard to get used to the animals facial expressions. But once you get used to it, this movie is pretty enjoyable. And no, it's not meant for kids."
    },
    {
      "rating": "6",
      "text": "I give it a six because Andy Serkis' work with motion capture is still phenomenal and above all because of the solid cast he was accompanied by. And even though I hate to make the comparison. This film, despite being darker than Disney'a recent live action version, it fails to reach the same level and above all it's clear that much of the budget went into the creatures because the CGI of the surroundings at times looks really bad.It's not a memorable film and it's understood why Warner sold it to Netflix but it's not a disposable option and at least they managed to rescue it from oblivion."
    },
    {
      "rating": "4",
      "text": "This is a painfully mediocre movie. The dialogue, the CGI, the plot were middle of the road at best. The motion capture was especially bad despite the involvement of Andy Serkis. The creatures looked like an animal-human amalgamation, a mixture of flesh and bone that certainly fell into the realm of the uncanny valley. The Disney Jungle Book remake was certainly not great by any standards, but this movie is much worse than even that was. This movie wasn't awful, and if you enjoyed Disney's The Jungle Book then check this one out, but don't expect too much."
    },
    {
      "rating": "7",
      "text": "The film brings a narrative entirely different from what we were accustomed, taking into greater consideration the dark side, however, leaves to be desired in its miscompleted script. Despite this, the film manages to bring remarkable characters and unique features, with its super high maturity. 7.4/10"
    },
    {
      "rating": "7",
      "text": "If your tired of a Disney telling of a kid being raised by Wolves, you'll get a tale of a kid getting raised by slightly more profane wolves. And Baloo is grumpy this time.T say that i had high expectations would be false, but it did live up to the ones i had. It's a fun and more interesting movie than Disney's Jungle Book, and it actually gets pretty gruesome. Especially with a particular albino wolf who made me sad.CGI looks good, voice acting is good, the story is okay and it entertained me. The ending was a bit underwhelming, but it was still more impressive than Alien: Covenant...I give this movie a 7/10. It is a good movie."
    },
    {
      "rating": "6",
      "text": "I thought this movie was pretty good and much more enjoyable than the 2016 movie. The CGI was great apart from some shot of the jungle and sometimes the action scenes looked like cutscenes from a videogame.The voice acting was great all around, I especially loved Cate Blanchett and Tom Hollander. The kid who is Mowgli is pretty good ( much better than the kid in the jungle book 2016 ). The only time I had a problem with him was when he was trying to cry, it was laughable and took me out of the movie every time.The character, except for Mowgli and Kaa felt pretty bland and boring. I remember Baloo being a goofy and lovable character in the animated movies, but in this movie he is just as serious as everyone else. I like Baloo but it just felt weird.This movie was way more serious and brutal than i was expecting it to be.I think the movie should have had a little lighter tone. It is hard to take a movie with talking animals seriously. Most of the brutal moments did work really well though ( The albino head for example ).I liked the first 2 acts, but the 3rd act felt pretty rushed and was definitely the worst part of the movie.The narration at the end was also very corny and unnecessary.Overall a movie with great voice acting, good cgi, but bland one-dimensional characters and a rushed story."
    },
    {
      "rating": "9",
      "text": "'Mowgli: Legend of the Jungle' delivers on the more realistic side of Rudyard Kipling's famed tale. Since there are way too many cinematic renditions of this tale, I'd rate this at the number two of them all. First, is the original animated Jungle Book. Anyway, yeah, it's realistic and it's really refreshing from Disney's takes on the story. Well done, Andy!"
    },
    {
      "rating": "5",
      "text": "I appreciate the director's view of making a decent movie on Rudyard Kipling's classic book. I understand it is a more dark, modern and \"mature\" approach towards the original movies (1967, 2016). However, I did not like how they did not include the classic songs are any songs at all. That being said, I did love the excellent jungle vistas and scenery as well as the details of the animals."
    },
    {
      "rating": "7",
      "text": "It was fun! Cheesy credits song though, but good for the singer because her voice is lovely."
    },
    {
      "rating": "4",
      "text": "This movie was a well-made tech demo, but it leaves a lot to be desired as a movie. The story is really weird and all over the place. It feels way too fast paced and short in a lot of places, and I’m not sure exactly what this movie is trying to be. It’s not a faithful adaptation of Rudyard Kipling’s The Jungle Book, but it isn’t really doing its own thing either. It’s like a weird mix of the two. Also, the message of the film was really odd. It had an anti-trophy hunting message or something like that, which is not what The Jungle Book is about at all as far as I know! However, what really makes this movie are the effects and the performances. It’s important to note that this movie is directed by legendary performance-capture artist Andy Serkis, who you may know best as Gollum from The Lord of the Rings. The human actors all do a great job, and the movie features some great performance-capture technology on the animal characters. They are less realistic than the 2016 Disney version, but that allows the animal characters to be more expressive, which I think makes it look a lot better. As for which one is a better film, I’d say both Mowgli and the 2016 Jungle Book are about the same in my mind. They are both special effects tech demos that leave a lot to be desired in the story area. Mowgli is worth checking out if you’re curious, it is a Netflix original so you got nothing to lose, but don’t expect the definitive film interpretation of The Jungle Book."
    },
    {
      "rating": "6",
      "text": "I liked the darker interpretation of Mowgli. In addition, there were some nice scenes and a very good CGI, unfortunately Shere Khan was somehow too disproportionate, even if the reason was clear it was a tick over it.Also a tick over there were some scenes that I didn't quite like in the German dubbing, as well as individual CGI faux pas."
    },
    {
      "rating": "6",
      "text": "Okay. Could of been so much better. Seems to try too hard to entertain both adults and kids and the results don't quite hit the mark."
    }
  ],
  "recommendations": [
    "the_call_of_the_wild",
    "maleficent_mistress_of_evil",
    "dumbo",
    "how_to_train_your_dragon_2",
    "the_legend_of_tarzan",
    "the_bfg",
    "the_nutcracker_and_the_four_realms",
    "9",
    "the_witcher_nightmare_of_the_wolf",
    "cruella",
    "alice_through_the_looking_glass",
    "alita_battle_angel",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "the_adventures_of_tintin",
    "pan",
    "oz_the_great_and_powerful",
    "the_book_of_life",
    "maleficent",
    "beowulf",
    "raya_and_the_last_dragon",
    "blade_of_the_47_ronin",
    "bumblebee",
    "a_christmas_carol",
    "frozen_ii",
    "spider_man_into_the_spider_verse"
  ]
}