{"id": 2881, "title": "Moxie", "starring": ["Hadley Robinson", "Lauren Tsai"], "runtime": 111, "genre": ["Comedy", "Drama", "Music"], "description": "Inspired by her mom's rebellious past and a confident new friend, a shy 16-year-old publishes an anonymous zine calling out sexism at her school.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/aLBo1Ca9PggcWY98ItW5ZkdxTuA.jpg", "categories": {"plot": 5.6, "acting": 7.555555555555555, "ending": 9.0, "soundtrack": 4.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 3.6666666666666665, "action": 4.0}, "reviews": [{"rating": "0", "text": "Character development:0Senario:0creativness:0teenager sjw: +999999999999999999999999999999999999"}, {"rating": "5", "text": "It undoubtedly has its heart in the right place, but 'Moxie' is heavy-footed and cringeworthy in most areas.I don't think anyone can disagree with what the film is attempting to shed light on, it gets kudos for what it is trying to say. However, judging it for what it is - a film - it's not good. The dialogue and the way characters act is cringey and done in a way that is so forced. It tells us what we already know, then that's it.None of the characters stood out to me. Of course Vivian (Hadley Robinson) and Lucy (Alycia Pascual-Peña) are the two main stars of the story. The former irritates more than anything, while the latter is poorly written - e.g. for the first 15 minutes or so she's pretty unlikeable, before belatedly and out of nowhere becoming pleasant; in and around Vivian & Co. I mean, not Mitchell (Patrick Schwarzenegger) obviously.A shorter run time as well as a bit more depth and creativity with the characters/plot would've went a long way. It's nothing absolutely terrible, granted. Lastly, cool to see 'The Walking Dead' alum Sydney Park (Kiera) involved."}, {"rating": "0", "text": "Netflix'in klasik feminist filmlerinden biri. Her zaman her yerde her şekilde kadınlar mağdurdur kafasında bir film."}, {"rating": "0", "text": "Since when did unskilled high school football players get scholarships? It's the most competitive sport in college."}, {"rating": "3", "text": "Not exactly sure who this film is for. It’s preaching to its feminist Gen Z choir but doesn’t really go too far, but also unironically depicts every stereotype of young lefties that people love to parody. A few charming moments but just watch Booksmart instead."}, {"rating": "0", "text": "**** this movie and **** the all feminists you already have everything so shut the **** up and don't talk about women's equal rights anymore okay ? just shuut the fuuck up"}, {"rating": "0", "text": "Zaluscv nemiii zutry untrabunka sunafogdozo bűz nyak társaság nem tiszt f a Smer törött"}, {"rating": "1", "text": "This is framed as a teen comedy, but it’s more focused about the message of empowerment. There’s the expected bag of misfits (none of them especially quirky or interesting), the boyfriend who’s too-perfectly supportive (a sweet, charming Nico Hiraga) and the mom who gets the few comic lines (director Amy Poehler). Overall, there’s not a lot of funny business."}, {"rating": "1", "text": "While it's not as bad as the woke reboot of Jay and Silent Bob, it's got the same tone. This is the fantasy of every basic white girl who even thought about going to a BLM protest. Ill-informed pseudo-feminist crab to appeal to 15-25 year old white girls who feel oppressed despite the sum total of \"privilege\" they've enjoyed for their short lives. Pass."}, {"rating": "2", "text": "it was very tiring ... boring! I was surprised that there is a book, but I am not surprised that it is another one of Netflix's productions."}, {"rating": "10", "text": "Really great message about not to stand up to something that’s not right. Great acting and portrays high school in a very correct way"}, {"rating": "9", "text": "This is a positive, heartfelt, thoroughly enjoyable film. It speaks to this exact moment in time, when young women are stepping into movements for racial and gender justice, breaking down barriers, recognizing and embracing intersectional complexities. It's the anti-Mean Girls. It's not playing for laughs, and it's not Hollywoodized; it's a sweet vision of how small acts of courage can create real change."}, {"rating": "10", "text": "Although not fully good at portraying everything and makes some mistakes this movie portrays a much needed movement of showing sexual harrasment in a light that is useful for acknowledging that there is things in life as women we have to deal with that shouldn’t be one of life’s disappointments but something that can be changed. It is not the best representation but in this world this is the first step in right direction. Hopefully representations will improve but because of the overall message it deserves the best."}, {"rating": "10", "text": "Amy Poehler’s Moxie Unites a New Generation of Rebel Girls that gives us good positive messages and good characters that entretain you in the 2 hours that it dures."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "6", "text": "After some triggering incidents at her high school, a student (Hadley Robinson) publishes a zine that launches a feminist movement. This is framed as a teen comedy, but it’s more focused about the message of empowerment. There’s the expected bag of misfits (none of them especially quirky or interesting), the boyfriend who’s too-perfectly supportive (a sweet, charming Nico Hiraga) and the mom who gets the few comic lines (director Amy Poehler). Overall, there’s not a lot of funny business…just good-natured energy. While it’s sufficiently endearing, it will appeal younger audiences who may be looking to get politically motivated."}, {"rating": "4", "text": "As good as the female-led punk soundtrack is to this film the film itself seems totally un-punk in it's reality, and as fun as it was I am disappointed with what Poehler achieved with this project IT'S JUST ALL TOO EASY TO SHOOT THIS FILM DOWN and while I can see it resonating with a young audience the knowing self-aware humor will be the only thing, along with the music, that adults will take from this, it's not good, and it paints a picture of a surreal and slightly messed-up world where characters you don't like are so obviously two-dimensional you question what they are doing, not to mention all the teenagers marching around confidently like young adults, while the adults behave like children and a convincing allegation of rape is trivialised as a spring-board to the next exciting moment in the story...I'm sorry, what? The lead actor holds this story together but this film is a fantasy and I'm not really sure what we're supposed to draw from it, and what is just supposed to be a joke, and that can be a problem"}, {"rating": "9", "text": "Honestly, an amazing movie especially since it's a Netflix movie which is surprising. This movie highlights realistic events that happen to teens in high school especially for the women there. We're told what to wear and what not to wear because the boys can't control themselves. Instead of telling the girls to change their clothes and make them ashamed of their bodies, educate the boys on self-control and manners. This movie shows the importance of that message and I as a teenager myself fully felt connected to this movie. Sure it had some classic cheesy parts but that's what makes it a movie in the end for teens and the production world."}, {"rating": "10", "text": "A great shift into coming of age movies that we need in this day and age. Not necessarily \"comedic\" throughout but definitely inspiring."}, {"rating": "9", "text": "It's preachy, yes but grounded a lot of these things happen in school as a woman I know from personal experience and is a good representation of what feminism means to different people"}, {"rating": "8", "text": "Me gusta el soundtrack, que aparezcan The Lindas Lindas, trata temas que llegan a ser muy comunes"}], "recommendations": ["booksmart", "freedom_writers", "the_perks_of_being_a_wallflower", "young_adult", "captain_fantastic", "lady_bird", "moonrise_kingdom", "i_feel_pretty", "wonder", "the_help", "dora_and_the_lost_city_of_gold", "don_jon", "the_big_sick", "the_intern", "the_spectacular_now", "the_edge_of_seventeen", "cashback", "sky_high", "easy_a", "juno", "me_and_earl_and_the_dying_girl", "jojo_rabbit", "closer", "crazy_rich_asians", "the_witches_of_eastwick"]}