{"id": 4757, "title": "Munich", "starring": ["Eric Bana", "Daniel Craig"], "runtime": 164, "genre": ["Drama", "Action", "History", "Thriller"], "description": "During the 1972 Olympic Games in Munich, eleven Israeli athletes are taken hostage and murdered by a Palestinian terrorist group known as Black September. In retaliation, the Israeli government recruits a group of Mossad agents to track down and execute those responsible for the attack.", "releaseYear": "2005", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/iUekaw96QLInZpsNwRTlRKrZgwm.jpg", "categories": {"plot": 6.95, "acting": 8.117647058823529, "ending": 8.625, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.6}, "reviews": [{"rating": "7", "text": "One thing I feared before seeing the movie, is that they would turn the Palestinians into cliche terrorists. But this didn't happen, thankfully. It was quite even-handed in its approach. It frowned on terror and violence, from both sides, and it also explores their root causes. Eric Bana was cast well as the Mossad agent. The movie would've received a higher rating if it wasn't so long. At close to 3 hours, the movie was overdrawn and was filled with scenes that were unessential to the story. This resulted in a severe loss of momentum in many places. They should've cut these scenes from the main movie and added them in later for the Director's Cut. But do see this movie if you are into history and current events and/or want to see a well-directed and well-acted movie."}, {"rating": "7", "text": "Munich is an arresting drama  thriller about terrorism and the people who do it. The performances on offer here are excellent and the action suitably macabre. The film is a little too long but overall, Munich is excellent stuff."}, {"rating": "7", "text": "Following the murder of eleven Israeli athletes during the Munich Olympics of 1972 a small task force is assigned by Israel's secret service to locate and eliminate all those responsible.\r Being inspired by real events Munich was always going to be a controversial movie but, while it contains tense scenes throughout, it thankfully avoids choosing sides or sensationalizing events. This is more than just a simple case of good guys vs. bad guys and everyones actions can be called into question at some point.\r Every member of the cast really excels at depicting the conflicting emotions and pressures that these sorts of events inflict upon people ensuring that the characters come across as wholly believable meaning that, despite some pacing problems Munich makes for a fairly intriguing watch throughout."}, {"rating": "7", "text": "Far too long imo. Really dragged on the film as long as they could and it would have been a little bit better if it were shorter. The acting was ok at first but it gets better when you get further into it. The action is good as well. idk though, The film just didnt sit well with me for some reason. It was a decent film that never really clicked with me. However the ending was excellent."}, {"rating": "7", "text": "It's a solid movie. Good acting, Action is fine, and it is a bit suspensful at times. However, It never really breaks into that next level of greatest. It's a good movie but not that good."}, {"rating": "9", "text": "Far more than just a \"decent\" movie, Steven Spielberg's examination of Israel's plot to avenge the death of 11 of their athletes caused by Palestinian terrorists in \"Munich\" is a truly fantastic thriller stuffed with relentless plans and explosions that would surely leave you breathless after full-time watch while, at the same time, successfully managing to leave space for humanity as the undercover agents begin to question the righteousness of what they are doing."}, {"rating": "1", "text": "\"Inspired by true events...\"  No kidding.  Even if you know nothing about the historical facts in the movie, the slant is painfully obvious.  The \"good guys\" are jovial, articulate and thoughtful - everyone \"on the other side\" talks heatedly and is armed. The tragedy of Munich and the subsequent events, did not need Steven Spielberg to turn it into this painfully biased tripe.  If you didn't feel him \"playing\" you while watching (sappy clues throughout the movie), well that's where he earned the 1 that I give this movie."}, {"rating": "8", "text": "Four years ago, not long after it all happened, who would've guessed that the American filmmaker most obsessed--haunted, maybe--by the implications and aftermath of September 11, 2001 would be, not Oliver Stone or even Michael Moore, but...the Indiana Jones guy?!!? Four out of five of Steven Spielberg's post-9/11 films (the candy-coated, nostalgic Kennedy-era fluffball Catch Me If You Can being the lone exception) have dealt, implicitly or fairly obviously, with many of America's questions, debates, doubts and fears resulting from that date and continuing through today: the instant SF classic Minority Report examines the most ominous implications of the USA Patriot Act; the sweet, Capraesque fable The terminal, significantly set in an airport, shows people of all nationalities putting aside their fears and misgivings in order to help one another...and this year's earlier War of the Worlds is The Terminal's dark twin, a sour, cynical nightmare in which we trample one another, steal each other's cars, etc., in order to escape the terror from without. Now comes Munich, Spielberg's meticulous, metaphorical examination of the ethics of a nation responding to what any sane person regardless of national origin would identify as an inhuman terrorist attack: where does self-defense end and revenge begin, are they sometimes one and the same, and, most significantly, what permanent effects does meeting-fire-with-fire have on those wielding the flamethrowers? Even though Spielberg and his writers, Tony Kushner and Eric Roth, are depicting a horrific real-life event and its aftermath, I believe that they're asking universal questions that apply to thousands of other historic confrontations. That's why the intense criticism Spielberg has received from certain parts of the Jewish community--some of whom may just as soon have him give back all the awards he won for Schindler's List--are irrelevant. I can certainly understand the feelings of anger and betrayal on many of their parts regarding the movie's humanizing of the Palestinian killers and their accomplices (expressed here at its peak by the tremendously touching final act performed by an otherwise particularly despicable individual when the protagonists retaliate)...but making you movie's villains three-dimensional and even giving them some positive and sympathetic qualities is as old as drama itself; if Munich's enemies were to apply the proper emotional and esthetic distance, they'd see that to excoriate Munich on these grounds is to condemn Alfred Hitchcock for giving us Norman Bates. And in a pivotal scene, in which Israelis and Palestinians discuss the homeland that each side sees as a sacred birthright, we not only see two sides irrevocably separated from one another by an issue that should at least philosophically be common ground, but also Spielberg's pet theme of \"going home\" in its most poignant expression. Munich isn't perfect; it's a bit overlong, with more false endings than Lord of the Rings: The Return of the King, and while Eric Bana as the team leader communicates his character's psychological turmoil superbly, Daniel Craig (Layer Cake) isn't exactly bolstering my confidence in him as 007 Number 6. (And the much-debated sequence near the end in which violence and marital sex bleed into one another had the misfortune to come out just a couple months afer A History of Violence, which used a similar juxtaposition to much more devastating effect.) But Spielberg deserves an enormous amount of credit for asking a number of extremely tough questions and freely admitting he has no answers save maybe the Biblical admonition that there will always be wars and rumors of wars. Whatever your political and religious affiliations and personal sympathies lie, it's hard to deny the power with which Spielberg conveys the very apolitical truism that \"an eye for an eye and a tooth for a tooth leaves everybody blind and toothless\". And no, I don't believe the right wing press's short-sighted nonconclusion that Spielberg would just have the victims of terrorism just lie down, take it and die. Spielberg (who also gave us Saving Private Ryan, remember?) recognizes the necessity of taking decisive action, but is after an even more basic and fundamental human truth: that no matter how justified or even necessary the taking of vengeance is, inevitably it takes its toll on both the person performing the act and the nation ordering it. That's the powerful message Spielberg delivers in Munich, and I think it's about time that those who are taking the film so personally quit heaping abuse on the messenger."}, {"rating": "1", "text": "It's time for Mr. Spielberg after WOW and this effort to retire and go into politics. His ideaology is expressed and not the view of the real world. For example, terrorists do not value human life, ours or theirs and thus they are terrorists. An eye for an eye is written in the Bible. If someone who does not value life at all does a heinour crime to my family I am getting revenge. Not breaking bread with the terrorist. Spielberg belives in turning the other cheek and resolving issues through peaceful negotiation. Message to Speilberg. You can't negotiate with terrorists. When will all of you liberals understand this?"}, {"rating": "4", "text": "Too long, shot in constant darkness and not something I'd recommend."}, {"rating": "0", "text": "Steven Speilberg has finally lost his mind. He now equates the sons and daughters of Isreal equal to, if not less, than the Muslim terrorists who commit all sorts of attrocities on civilization. Just wonder if Spielberg would turn the other cheek if someone he loved was brutally murdered? Somehow I just don't think so. It's sad to see a once great director become a shill for Hollywood's left wing political movement. Barbara Streisand now has a partner in turning the keys of America over to our enemies. Great job Steve as you should feel very proud of yourself? Let's see? War of The Worlds was a total joke and now this? This is typical Michael Moore trailer trash. Not worthy of your time or money."}, {"rating": "8", "text": "I don't know, the whole Arab/Jew mess is a mess with 2 thousand years of in bred hatred. This film is well done and even handed,it's almost feels like a indie documentary. I viewed it as a real-life Mission Impossible and thought it was well done and easy to follow. It's 3 hours long, so be prepared to sit awhile."}, {"rating": "5", "text": "Pedantic. A modest 90 minute tale crammed in to 160 minutes."}, {"rating": "10", "text": "I have been no fan of Speilberg's but this film is incredible. By far the best thing he's done. Multi-layered, using every actor to his best, and no cop out ending, this film makes you think about issues that are controversial in a very personal way. Best film of the year!"}, {"rating": "9", "text": "Though it can't be it is obvious that this movie strives for unbiasedness. It seems most viewers dont see it that way but that is attributed to their own biases. Ontop of that. Out of the million or so scenes encompassing all those settings around the world almost all of them worked. With that accomplishment this film gets my vote for best of the year."}, {"rating": "1", "text": "I saw it and think that if Spielberg wants to make political statements he should go into politics - not use movies as a propaganda to enforce his leftist liberal ideaology. The attack by the terrorists on the Isreali athelets really happened. What follows is Spielberg's fantasy that the retaliation was as bad as the terrorists. He is a fool."}, {"rating": "1", "text": "Speilberg is a fool if he thinks you can negotiate peaceful resolutions with animals."}, {"rating": "6", "text": "Maybe I need to see this filme again to fully grasp all that it's trying to say? I'm not sure? It's not that I didn't enjoy the movie ... the story was fairly compelling ... and Eric Bana is wonderful to watch ... I guess I just went into it with different expectations. I don't see it to be the award worthy film many have made it out to be, but that's not to say it's not a good movie overall and worth a watch."}, {"rating": "9", "text": "Munich is not a movie to enjoy. It is harsh, unflinching and raises uncomfortable questions on a very personal level. It is a film about the roots of violence, the act of denial that it takes to perform acts of violence against your own kind, and the vicious circle of crime and retaliation. The message is: sometimes we do what we feel we have to, even if it means sacrificing that which makes us human. The message is: there is no easy answer. And, as with all great works of art, the film doesn't tell us what to think. It simply tells a story, which could be set in Texas, New Zealand, or the moon. It just happens to use a historic tragedy that has modern implications. Naturally, people are (and will continue to be) upset by this. People want black and white, good and evil. Watching likeable characters perform inhuman acts of violence is not easy to stomach. Neither is having to face the fact that \"the bad guys\" are just like us - they feel they are right, they have families and friends that care for them, and they are scared and horrified and, yes, violent, just like we can be. All of this is centered on a fantastic performance by Eric Bana, who, under Spielberg's masterful direction, manages to squeeze so much life into his confllicted character that I couldn't help but be drawn in. Well worth seeing, but keep an open mind and be aware that this movie is quite violent; it shows what it's really like to shoot another human being: it's ugly and horrifying. And there are no heroes here, just normal people in abnormal circumstances. Thank you, Stephen Spielberg, for showing me that even one of the most famous mainstream director's in the woirld can create art that does what all art should: make the right people feel uncomfortable as hell."}, {"rating": "6", "text": "I think my expectations were too high from Steven Spielberg and all the reviews. It was a good but film could have been less repetitious in number of executions and dealt more with main theme"}, {"rating": "10", "text": "I was surprised at how balanced it was. Speilberg isn't messing around or being lenient on either side. He attacks both Israel and the Palestinians equally and at times really goes to town. I imagine that both sides will be furious with him for some time to come. Some of the conversations in Munich are pretty high-IQ analyses of the situtation and definitely the most un-Hollywood thing i've seen for a while. I think it humanises (and dehumanises) both sides in equal measure. There's a great scene where Eric Bana has a conversation on the balcony with the 'target' he's about to blow up. It gives a personality to somebody who will next be seen as a selection of body parts. Oh yeah, its very violent. Regarding 'crucial facts', the 'truth' doesn't really come into it since this is a *film* of a *novel* which is an *account* of how things *might* have happened. And its not an account of Munich itself (see/read One Day in September). For example, I only felt moved to object to one crashingly obvious bias: one of the final flashbacks to Munich painted the events at the airport in a very black and white \"and then the Palestinians shot all the hostages\" way. By all accounts the stand off at the airport was very confused and we'll never really know how the hostages died (they could have been simply in the crossfire). Otherwise, the portrayal of both sides is pretty fair. The film basically says that vengence is just another form of terrorism and reprisal killings just breed more terror. It doesn't shy away from heavily suggesting that Israel killed people just to make itself feel better rather than because they had anything to do with Munich (cf: US invasion of Afghanistan in response to Sept 11th). In the same way that Black September's response to exile and oppression was to turn to terror, Israel's response to that very terror was to turn to terrorism, ad infinatum... no end ever."}, {"rating": "10", "text": "No words 4 such a Good Movie."}, {"rating": "4", "text": "[***SPOILERS***] Disappointing story which \"re-imagines\" 1972 history. The movie is long and poorly plotted. It was hard to follow due to jumping around from one country to another. They had to concoct odd ways of killing these people, not simply SHOOTING THEM. And then we find out some were NOT EVEN THE TRUE PLO MURDERERS themselves, but other people the Israel group deemed were also bad people. (Really? Why show us eleven pictures and then move to others seemingly not directly involved?) Motivations were blunted and there was so much that was make-believe that it ended up seeming like farce. (People pointing guns at the enemy, while all holed up at a \"safe house,\" one Israeli bombmaker doing things with toys.) I dunno. I'm a big Spielberg fan, but this was not his finest work, and I surely don't see the film as the best of 2005. Postscript: This film opens on 12/23/05 here in Portland, Oregon. All I could think of was it's a kind of a weird pre-Chanukah gift. It does not make me, an American Jew, feel better about the state of Israel and the way it may have acted either now or in the past. 4/10"}, {"rating": "8", "text": "Suspense, drama, Shocking!"}, {"rating": "9", "text": "Just shy of three hours, Munich is an excellent film that is causing a lot of controversy among Jewish groups in the US and Israel, and among Palestinians. By upsetting both groups, director Steven Spielberg has found elusive middle ground that saves the film from being Oliver Stone-preachy while weaving tension and moral ambiguity, from beginning to end. This is the second film based on the 1984 book Vengeance:The True Story of an Israeli Counter-Terrorist Team by Canadian journalist George Jonas, the first being the 1985 HBO made-for-television movie, Sword of Gideon. Mossad agent and ex-bodyguard for Prime Minister Golda Meier, Avner Kauffman (Eric Bana), is asked to head a secret unofficial team on a very dangerous mission that would take him away from his pregnant wife for many months, if not years. He is assigned four other men, most of whom are seemingly unlikely members of an elite hit squad. The only other athletic person is Steve, aggressive and feisty, played by a crackling, magnetic Daniel Craig, the new James Bond. Craig, blonde with deep blue eyes, as revealed in a sniper scene, looks ironically like a perfect example of an Aryan. Ciarán Hinds, who played the Russian President Nemerov in 2002's The Sum of All Fears, is the clean-up guy who removes evidence. Mathieu Kassovitz plays Robert, the toy-maker turned bomb disposal expert turned bomb-maker. Hanns Zischler is Hans, the document forger. Showing up occasionally as the official liaison between Mossad and Avner's team is Geoffrey Rush as Ephraim. Prime Minister Meier endorses the mission by saying \"...every civilization finds it necessary to negotiate compromises with its own values.\" Other dialogue in the film that resonates with the Israeli perspective includes Avner's mother saying that the Jews had to create their own homeland since no one was going to give it to them. These are examples of why Palestinians groups see this film as biased towards Israel, but to dismiss it as such is to sell it short, as it offers dialogue that neither side supports, and that those without a stake in the middle-east - most viewers - will chew on it, right to the film's end. Early on, Avner finds a mysterious source of intelligence who is willing to find the locations of persons of interest who have gone underground, but only on the condition that Avner is working for no government. While he doesn't give up that he is unofficially tied to the Israelis, it's obvious that he is probably Mossad since all his desired targets are Palestinians. As the team assassinate the bad guys throughout Europe, they also learn that the Palestinians retaliate, killing off magnitudes more people. Not mentioned in the film are the Palestinian refugee camps in Syria and Lebanon bombed by Israeli jets in retaliation, four days after the massacre, which was in turn condemned by the UN Security Council. They begin to wonder if their mission is worthwhile and even moral, with arguments about why they aren't just arresting people for trial. Also, some of the Palestinians they kill are shown as being regular humans with families, or cultured and intelligent, rather than as one-dimensional bad guys. They feel guilty about some of their killings and one of the characters becomes very heavily burdened. It's this moral conflict that brings the film its best tension. In one of the most electric scenes, Avner, mistaken for a German, has a conversation with a PLO team leader who explains and justifies the Palestinians struggle with Israel for a homeland. This is one of the scenes that is generating criticism among Jewish groups, even though the director is a prominent Jew and supporter of Israel. Meir Jolobitz, executive director of the New York-based Zionist Organization of America (ZOA), told Aljazeera.net: \"First, the film which claims to be inspired by true events does not reflect true events. Spielberg is inventive. \"Secondly, he tries to humanize Arab terrorists by legitimizing their murder of Jews as their only way to establish a Palestinian state.\" The ZOA has called for a public boycott of the film. At one point in the film, one of the team members talks about how the Israelis could end up becoming killers like the people they are hunting. Team member Carl replied that they have long been like that, since they had to be killers in order to establish the state of Israel. Now, this sort of statement would be seen to be anti-Israeli since it equates the blood shed by creators of modern day Israel to the Palestinian terrorist - a moral equivalence that some will find outrageous. The film didn't seem like almost three hours long to me. I was totally drawn in as the film unfolded within the murky confines of international betrayal with its lack of assurance. Is the family that sources valuable information playing all sides? Do they betray friends for money? Are they really Mossad operatives carefully feeding the unofficial team the finest information? Or, are they helping the Palestinian leadership do a little house cleaning? The flashbacks to the massacre itself are also riveting. There's a lot of juicy, factual story not included, such as the Israeli offer to send in one of their experienced commando teams, which was rejected. The German offer to trade money for the hostages and then have high-ranking German officials switch places with the hostages, also wasn't mentioned. By not pleasing either the Palestinian or the Jewish communities, and yet ironically supporting both by presenting two sides of the dispute in the film, Munich offers a timely opportunity for discourse about sacrificing values in the face of conflict for survival, the increasingly popular moral equivalency debate and on a more basic level, the future of the Israeli-Palestinian relationship, especially in the post-Sharon era. Here's some interesting information from the Wikipedia entry about the Munich Massacre. In the book Striking Back : The 1972 Munich Olympics Massacre and Israel's Deadly Response, published December 20, 2005, by Aaron J. Klein, the author contends that the Mossad only killed one man directly tied to the Munich Massacre, and that was in 1992. He mentions that the real planners had gone into hiding in Eastern Bloc countries and that the ones who were killed off were lesser Palestinian activists. The Mossad made them out to be some of the planners and the PLO trumpeted their importance so the legend of the power of the Mossad grew. The website also contends that in the 1999 book by the only surviving planner of the attack, Abu Daoud, Memoirs of a Palestinian Terrorist, funds for the attack were supplied by Mahmoud Abbas, who is currently the President of the Palestinian Authority."}, {"rating": "3", "text": "I liked \"Sword of Gideon\" much better!"}, {"rating": "1", "text": "The Movie STUNK... Hired assassins don't second guess themselves, They would never have been chosen in the first place if they did... Do you think a Navy Seal would break down in agony doing his duty... Do you think that Killing a Terroist Of Innocence would cause them any reflection of note... Do you think that an organization that chooses to Kill Innocent athletes would EVER stop. Tit for Tat, Let's open the prison doors, surely all those people if we as a society just said Sorry, would instantly become model citizens... more murders on the streets, we just need to be more UNDERSTANDING... In our society if someone breaks the posted speed limit he pays a penatly, yet Speilburg wants me to believe if you kill 11 innocent athletes you should turn the other cheel and Understand them, Maybe he'll pay my next traffic ticket too."}, {"rating": "7", "text": "Wow. When did turning the other cheek become leftist? Pretty sure that's a Jesus thing. What a load of socialist hippie crap, right? You people really need to understand - sometimes movies have a message. Sometimes you may disagree with the message - but don't call it propaganda just because you don't agree. Try closing your mouth for a second and opening your mind to new opinions. Understand that not everyone thinks like you nor are they wrong if they don't. Anywho, as the movie pointed out, the terrorists from Palestine didn't just start killing Jews for no reason. Both sides are equally guilty. It's depressing and hopeless and a neverending cycle (as the film also pointed out) but just blaming Palestinians without acknowledging similar atrocities commited by the other side is ignorant. The movie clearly said that violence leads to more violence - that's nothing political, that's common sense. On the negative side, the movie was way too long, but it was interesting and pretty freakin balanced - especially coming from a Jewish director. A lesser director (and perhaps many of the users commenting here) would have painted the Jewish assasins as heroes and shown no consideration for the Palestinian side of the equation. No one is innocent and no one is a hero for taking another's life. Pretty sure that's a Jesus thing too."}, {"rating": "9", "text": "Did all the people who gave a low score see the same movie as I? Get over the \"not historically accurate to the letter' bit - some people are so anal about that!! The movie labels itself as \"inspired by true events', maybe people don't understand that this doesn't mean it's a biography. It's a great story with fantastic acting and a good message about the fact that terrorists come from all kinds of places and represent all kinds of causes. I reccommend it to anyone with some worldy interest and a love of great film!"}, {"rating": "10", "text": "I haven't seen all of 2005's biggies yet, but I think they will have to go some to beat Munich. It is the year's finest so far. The film is best appreciated by approaching it on two levels; it's a bloody, sexy political thriller and a study of a moral/ethical dilemma. Extremely well-acted, directed, photographed, edited, designed and scored, it is a superb piece of filmmaking that, and this has become an increasingly rare thing in American films, treats its audience with the respect that some of us think we deserve."}, {"rating": "2", "text": "Pretty disapointing movie. I understand Spielberg feeling some Middle Eastern version of \"white man's burden\" and trying to make good but it just doesn't work. The movie is not about a historical event, it is not about the historical events dyring the 1970's that took place following the Munich massacre. It is about how the group of agents sent out to kill those responsible makes contacts, finds the targets, and builds faulty bombs. They go along, one by one, killing targets and along the way develop a dislike for what they're doing. They wonder whether it's worth it. Wow, as though no one has ever thought that before. If it was meant to be a historical movie, it should have included the actual story as opposed to a made-up story about contacts and ineptitude. If it was meant to be a introspective look and an attempt to get people thinking peace in the Middle East, there are a million better stories to do that with."}, {"rating": "1", "text": "Very dull. I did not feel emotionally connected at all to the characters. This movie was lifeless. I thought about walking out halfway through. Not recommended."}, {"rating": "2", "text": "Long and Boring!!! I have a knowledge and interest in the subject, but geez, it was like watching paint dry. I\"m convinced critics who gave it a 10, did so because it was expected with a Spielberg movie. Three people near us in the theater fell asleep. Worst way I've spent 3 hours in a long time."}, {"rating": "10", "text": "I'm pretty sure this guy, Tal L. has not seen the movie and is just trashing it because he can. Obviously, it's a matter of opinion what he thinks of the film in it's point of view and the stand it takes against vengeance. But to say the movie is not technically proficient is just a stupid, nonsense, invalid remark. I feel sorry for people like him...but well, is his loss."}, {"rating": "7", "text": "The first hour and a half or so was absolutely terrific, it was really intense, but i got lost towards the end, it got sort of confusing, but i still liked it a lot"}, {"rating": "8", "text": "Incredible proof that an eye for an eye, a tooth for a tooth, is madness. Good for Spielberg to brave both the Israeli and Arab opinions, let alone America's ."}, {"rating": "4", "text": "Okay... I left the theater certainly feeling deeply affected, though I was definitely skeptical of this emotional feeling, and also felt that I had been manipulated in some way... Furthermore, the last act of the film or so was a little disorienting and I thought that the film set itself up just fine, and then gradually lost its way more and more as the film went on. Also, the Dallas Observer review is absolutely DEAD-ON. It's impeccably written and encpasulates all of my qualms with the film. Thus, I am giving the film a 4, much like metacritic awarded the film a 4 (40) based on Mr. Wilonsky's review."}, {"rating": "10", "text": "Compelling."}, {"rating": "10", "text": "If you fall asleep in this movie, it is a judgment of your character, not the movie's."}, {"rating": "7", "text": "I was uncertain how I felt leaving the cinema. It's a hell of a subject to pick notwithstanding that it's only inspired by events. However, I think that overall its a very good depiction of what could have followed the massacre. Acting was generally strong and period scenes very good. I think to appreciate the film you need to remove yourself from all the current debate about who's right and wrong and look at it for what it is - a story. The fact is that understanding the background helps the understand the story - that's it. I don't believe that comment is being passed one way or the other on Israelis or Palestinians/Arabs. So with all that said, it's a powerful depiction of the fictional aftermath of a terrible event. Not Bambi that's for sure, but without being gratuitously violent - and all the better for that."}, {"rating": "5", "text": "Spielberg attempts to convey the futility of tit-for-tat killing by sujecting his audience to a mind-numbing and unemotional two and a half hours of graphic and gory tit-for-tat killing. Superbly filmed (as always with Spielberg) but offers no helpful ideas on the film's topic."}, {"rating": "9", "text": "I'm only giving my personal point of view, but it had been more than a year that I had'nt been through a movie without checking my watch...The political stance is very ambiguous and gives an interesting outlook at the situation. PS=Frenchman Matthieu Kassovitz rocks!"}, {"rating": "8", "text": "Not perfect but very good.It's very well acted,especially by Eric Bana.Spielberg tried to humanise both sides but there's no pleasing some people.He took true events and used poetic license to make a story out of it.Everyone should remember it's a film,not a documemtary."}, {"rating": "2", "text": "Spielbergs films have a strange mixture of sentimentality and viciousness. Sentimentality: Avners relationship with his wife, the 'cute' toymaker/bombmaker, the distinguished old antique shop owner. Vicious - the killing of the Dutch woman. As with 'Catch me if you can' Spielberg imposes his sentimental pattern of the world onto a far more interesting reality. The most intersting aspects were the set dressing for the 1970's European capitals... the cars, the shirts, the dresses, the hairstyles and the smoking. Two marks that."}, {"rating": "9", "text": "When \"Munich\" finally shows us how the remaining hostages were killed at the airport, the filmmaker crosscuts this tragedy with Avner having relations with his wife. He doesn't seem to be making love to her. There's no eye-to-eye contact. His mind is elsewhere; presumably, on the violent end those Israeli athletes met at the airport. The filmmaker teases us with increments of the whole story throughout its two hour-plus running time, and the last installment is the payoff. In my estimation, however, Avner's mind would be on his comrades, who under his command, die in retaliation against the Palestinian terrorists, and not what we are shown. But this is a minor quibble. \"Munich\" is astonishing the way it gives us nourishing popcorn. The violence, at times, plays like a homage to Martin Scorsese's love of bloodshedding."}, {"rating": "7", "text": "A bit heavy-going, but Eric Bana's fit. So this gets a 7. You can check my working if you like."}, {"rating": "8", "text": "What starts out as a revenge epic becomes a thrilling exploration of the psyche of assasins/terrorists and what it does to everybody. A bold departure from typical fast-paced action flicks."}, {"rating": "4", "text": "Goddard once said that \"cinema is truth 24 frames a second.\" If that is true, then speilberg's cinema is the antithesis of that quote. Spilberg's films are lies 24 frmaes a second, every cut is the truth."}, {"rating": "10", "text": "This is like broke back mountain a really really good movie."}, {"rating": "4", "text": "This is not a film about Munich, its a film about Sept 11 and how should a civalised society response to terrorist attacks. Unforunently it spends too much time on school boy moralising over the rights or wrongs of assinations and yet misses a key moral point of the whole Munich story. The Isreali assasins killed an innocent man after mistaking him for a terrorist."}], "recommendations": ["detroit", "american_sniper", "lone_survivor", "cartel_land", "hotel_mumbai", "zero_dark_thirty", "a_time_to_kill", "22_july", "13_hours_the_secret_soldiers_of_benghazi", "dark_waters", "snowden", "machine_gun_preacher", "the_mauritanian", "united_93", "the_hate_u_give", "patriots_day", "letters_from_iwo_jima", "free_state_of_jones", "the_hurt_locker", "silence", "the_first_purge", "a_clockwork_orange", "crash", "blackkklansman", "green_zone"]}