{
  "id": 2638,
  "title": "Murder on the Orient Express",
  "starring": [
    "Kenneth Branagh",
    "Tom Bateman"
  ],
  "runtime": 114,
  "genre": [
    "Drama",
    "Mystery",
    "Crime"
  ],
  "description": "Genius Belgian detective Hercule Poirot investigates the murder of an American tycoon aboard the Orient Express train.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kc2gJjebceoFgOQbukzPzP8SXVZ.jpg",
  "categories": {
    "plot": 7.181818181818182,
    "acting": 7.0,
    "ending": 6.933333333333334,
    "soundtrack": 8.333333333333334,
    "cinematography": 6.375,
    "familyFriendly": 6.0,
    "funny": 6.666666666666667,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "7",
      "text": "the score is about 6.5 and 7.Dialogues are sometimes a bit cringe-y and uninspired but the acting (Kenneth Branagh, Michele Pfeifer especially) is very good. Not only the acting branagh is good but also the directing one. Shots are surpsingly well constructed most of the time (Like one of the last ones being a quote on a Leonardo Davinci's painting). Overall is a decent film based on a great novel. Worth seing if you are a fan of the genre."
    },
    {
      "rating": "6",
      "text": "A parade of stars and beautifully directed. Kenneth Branagh brings murder-mystery back to the screens. I just wish he could have done so with a more interesting pace. Things can be a slow drag. Especially at the beginning. I also felt I never spent enough time with everybody on the Orient Express. Some potential suspects get hardly any screen-time. Mix that in with how poorly developed everyone is and it never feels like you're given all the pieces Poirot is seeing. A really good film of this nature would allow you to play detective right alongside the protagonist. Unfortunately it feels like there are too many faces and not enough running time to interrogate them all.Despite this I enjoyed my time with the film. It's got a great sense of humor, decent payoff, and a wonderfully quirky detective. I wanted to learn more about Poirot and his backstory. This movie didn't teach me too much about him so I hope the character returns to the screen in the future with a sequel or prequel. It's also just so novel to see a movie like this these days. A shame as they used to be so much more frequent. Did I mention it's very pretty as well? Then there's the number of big names in the ensemble cast to gawk over (Michelle Pfeiffer has still got it)."
    },
    {
      "rating": "8",
      "text": "Don't understand the hate for this movie at all. I thought Branagh did a fantastic job directing and leading as Poirot, which offers his own original take on the character. Yes, It does follow the plot of the book but why change it when it doesn't need changing? If you are a fan of the book, You are gonna enjoy the movie. And the star-studded cast does a great job with what little-shared screen time they have. Depp especially was enjoyable. It's a little slow at times (really just around the middle of the film) but the ending was perfectly performed and executed. Go see it, It's a good film."
    },
    {
      "rating": "9",
      "text": "This is a great movie.  It may not be enjoyable for everybody, but it is great.  It was a relentless investigation and logical inquiry, that ends with amazing music and scenery that equal the greatness of the ideas the protagonist must deal with before he leaves the train and re-enters society.  This was a movie that could have easily never been made, and was risky to make because it is complex throughout, and in this sense it was a huge gift from the creators who would have made money creating a senseless action film."
    },
    {
      "rating": "10",
      "text": "I read a lot of Agatha Christie as a kid and am re-reading some now.  I had read Murder on the Orient Express again about a month before seeing the film so it was fresh.  I loved the film.  Loved Everything about it, especially the cinematography.  I don't understand the mixed reviews."
    },
    {
      "rating": "10",
      "text": "An impressively good movie and faithful adaptation of the legendary Agatha Christie novel. For those of you that did not know. Agatha Christie is the undisputed Queen of murder mystery and detective stories. The number of her sold books is in the hundreds of million maybe past a billion and many of her innovative ideas are still used today. Murder on the Orient Express is one of her most famous story staring Hercule Poirot. The story is inspired by the Lindbergh kidnapping and plays in the Orient Express which was know as King of Train(travels).  I cant spoil the twist or story because the reveal is brilliant as Hercule Poirot is faced with an unsolvable looking problem. Also it teaches him about the meaning of true justice and shows what he is made of. Like I said Agatha Christie was just brilliant with her ideas. Then there are the actors and their performance. Long time I thought no one came close to the legendary performances of David Suchet and Sir Peter Ustinov. Then Kenneth Branagh proved that he plays in the same league. His performance is excellent as he delivers everything including the whims. Small spoiler: The egg scene is correctly representing Hercule Poirot. End of small spoilers. Then we have something like an all-star cast for the other roles with Willem Dafoe, Judi Dench, Johnny Depp, Penelope Cruz, Michelle Pfeiffer, Daisy Ridley and all others. All roles are set with good actors that fully deliver. For me it is one of the best performences in this year. I must also praise the visuals, sets and soundtrack that add to the atmosphere. Maybe purist will remark that the movie makes some variations and additions to the book but they always capture the spirit and it never fells fake. Overall a worthy adaptation and a well made movie. Bonus knowledge: Do you know that the movies Mindhunters, Devil, Princess Bride and many more used also her ideas? Knives Out is also a homage to Agatha Christie."
    },
    {
      "rating": "6",
      "text": "Murder on the Orient Express is a film based on the famous book by Agatha Christy and is directed by Kenneth Branagh who also stars in the film. The plot of film is pretty self explanatory there's a murder on the Orient Express and Kenneth Branagh's character, Hercule Poirot has to solve it. The story is pretty simplistic but could have worked if the mystery wasn't so easy solve. However the acting in this film saves it from being a dud. Add that to the writing being spot on and you got yourself at least an enjoyable film, but not a good one since the mystery is the entire point of the film. In conclusion if your looking for a film to pass the time you can do far worse than this film."
    },
    {
      "rating": "6",
      "text": "\"Murder on the Orient Express\" was a good movie, the characters, the photography, the decorations and above all, the Hercule Poirot character was fascinating, but the story is a bit slow and confusing, you see it, and you do not understand what happen, you have to go deeper into the characters to complete a puzzle of 1000 pieces, and you would take a whole year, wasting your life in solving it, and in some characters, we did not see its origins, but the ending was beautiful and moving."
    },
    {
      "rating": "8",
      "text": "Murder On The Orient Express is directed by Kenneth Branagh and stars Kenneth Branagh as world-famous detective Hercule Poirot. As this story is based on a famous book, some of you might know the story already. For those who don't, the story revolves around Poirot as he travels on The Orient Express, a luxurious European passenger train in 1934. After a murder occurs onboard the train, it's up to him to solve the crime and find out who did it. The other passengers are played by Willem Dafoe, Judi Dench, Johnny Depp, Josh Gad, Michelle Pfeiffer, and Daisy Ridley, among others. As someone who never read the book, I went into this knowing nothing.The story is great, for which I give more credit to original author Agatha Christie than screenwriter Michael Green. Branagh, the star and director does a great job in both areas. His character is rather witty, but also serious. The pacing of this is near-perfect and the mystery aspect both is well done and surprisingly emotional. It also has an old-school feel to it. The story doesn't feel modernized at all and the sets, as well as the costumes are beautiful to look at. The cinematography was well- done as well and was actually shot on film, not digitally. It all adds up to very good, old-fashioned Hollywood movie.However, I would've liked if the film focused a little bit more on the other characters and not Poirot. The tone is also uneven. The 1st act is almost a witty comedy, but it abruptly changes to a serious drama after the murder. In addition, while the sets are great, the backgrounds are mostly computer-generated and they simply look very fake.But on the whole, this is an enjoyable mystery with good directing, good performances, and beautiful set pieces. It also has a nice, old-fashioned feel. If you miss the way Hollywood made movies back then, then you'll appreciate this."
    },
    {
      "rating": "7",
      "text": "Finding so many fat cats in the cast develops assorted expectations. The story based on a classic is a sort of delicacy you shall eat slowly for find the flavor. It cloud be better if not for the plot comes fatigued before the finish line. However, deserves a chance."
    },
    {
      "rating": "8",
      "text": "I have watched the 1974 film and this film over one weekend. This film is better in every aspect that I can think of; the acting, the writing, the scenography, the scale. Don’t listen to the critics."
    },
    {
      "rating": "8",
      "text": "This new version of the one released in 1974 is still have the same attractive, but with better technologies for image and sound. Although Johnny Depp did end his role soon, he completely showed off the feeling of Ratchett that scared to death."
    },
    {
      "rating": "7",
      "text": "Murder on the Orient Express is one of the most famous yellow books in the world. This movie is really good, with the correct mix of suspace, mistery and relax times. Amazing cast, amazing story and a little bit of madness..."
    },
    {
      "rating": "6",
      "text": "I had great expectations about this film, not only for Branagh, but because the film looked good, what the hell, it looked great and what can I say about the cast, a cast full of stars. What could possibly go wrong? Apparently everything, don't get me wrong, I'm not going to say that Murder on the Orient Express is a bad movie, but in reality it is a very weak film, a hollow one, too inclined towards a noir style that never ends up working.Kenneth Branagh opts for a style full of romanticism and mysticism, focused more on giving a classic tone to the story instead of granting it more substance. The story moves with a gross slowness, spend almost 30 minutes in the beginning and nothing has happened, and I say this for people who haven't read the novel or don't know anything about the other adaptations, for them it might feel lethargic.The mystery and the tension depends more on you as an spectator instead of what the script achieves and although most of the actors do their job well, there is nothing out of the ordinary and nobody is doing something memorable.A pity, I really expected a lot more, I cannot deny that I have this enormous feeling of disappointment.I planned to give it fifty points but I gave it sixty for its production values."
    },
    {
      "rating": "7",
      "text": "This movie can definitely feel slow at points and is extremely dialogue heavy...however, the characters and plot are extremely intricate and definitely the savior of this movie."
    },
    {
      "rating": "7",
      "text": "I am a big fan of Agatha Christie and i feel like i can never get enough of detective fiction.I didn't watch the previous Murder On The Orient Express movies but i read the book so i went to this movie without influences of previous movies.So i just want to get this out of the way.Casting is superb.Ok!Now i enjoyed the movie is lighthearted at sometimes and intense and full of mystery on other times.Now this adds some different flouver to tone but it also creates inconsistency.I went to this movie to feel expecting rising tension and danger but it starts with in a very lighttone and in funny way.I said this is great too but it has change in tone at diffent times disturbed me.If you enjoy this kind of consistency it is perfect for you but to me it felt like it would have been far more great if movie had only focused on one tone."
    },
    {
      "rating": "9",
      "text": "Yes it could have been better.  No it was not the original movie. No it could not have been filmed in a better locations.  It was definitely a move to watch on the big screen."
    },
    {
      "rating": "7",
      "text": "What an unexpected ending, initially I feel bored with this movie, apparently the ending wasn't disappointed. This story and plotline are insane."
    },
    {
      "rating": "6",
      "text": "It is a solid movie, still not sure if I could recommend it to you.The acting was top-notch, but the story was lame, they should have given more time to the investigation then to the whole first chapter in the movie which was long."
    },
    {
      "rating": "7",
      "text": "Without disappointed, Kenneth Branagh does a meticulously well prepared job. \"Murder On The Orient Express\" is clever, but complicated. The way the film articulates becomes nauseating and tedious, but, its conclusion totally changes the expectations of those who did not read the book before watching. Nice and light performances. Agatha would appreciate it. 7.1/10"
    },
    {
      "rating": "9",
      "text": "I have never read the book or watched the previous movie.But i can say with satisfaction that i really enjoyed this movie.The actors were great the costumes and set were amazing and in a long time i found myself actually surprised  at who the  culprit is in a crime movie.Loved the twist and i really loved this movie."
    },
    {
      "rating": "9",
      "text": "I keep an eye out for Kenneth Branagh and this movie was a real treat with all the high caliber actors. I never get disinterested when watching this film."
    },
    {
      "rating": "9",
      "text": "Although I have seen this movie before and therefore knew the genius solution of the case, I had fun watching this movie. The set pieces are beautiful, the characters are interesting, the dialogues are well written, and the costumes look almost perfect.But I have to mention, that I due to the fact of how complex the story is, sometimes forgot which name belonged to which character and which relation they had with other characters."
    },
    {
      "rating": "5",
      "text": "This is a good movie to go see with your elderly mother. (Hey, it's the holidays.) There's gorgeous scenery and costumes, some wonderful actors, and a mystery -- at least, if Mom doesn't recall whodunnit from the book or the 1974 film). As a nonfan of Agatha Christie, I enjoyed it despite what to me is a ridiculous ending. It could have used more humor, although Branagh's mustache has some amusing scenes."
    },
    {
      "rating": "5",
      "text": "This movie actually made me sad.  There are very good actors in it and they are all fine in the film.  There are many well framed and beautifully composed shots.  The art direction and the costumes are lovely.  I like Kenneth Branagh's Poirot far more than the Albert Finney version in the earlier film adaptation of this book.  There clearly was money spent on it and effort put into it.  But at the end of the day, it is just a meaningless distraction.  It is neither challenging nor inspiring.  It is neither fun nor suspenseful.  It is just there.  With all the talent, money and effort behind this film, that is sad."
    },
    {
      "rating": "5",
      "text": "Has some decent acting but this is not a great adaption and the ending is hopeless."
    },
    {
      "rating": "5",
      "text": "When was the last time you saw a remake that was better than the original? Long time, if ever, right?  “Murder on the Orient Express”, which opened last week, is a remake of the same film, based on Agatha Christie’s book, that was made in 1974 and directed by Sidney Lumet. This new rendition is directed by Kenneth Branagh who also stars in the film along with his elaborate mustache.Both versions have an all star cast and which is more famous will be in the eyes of the viewer. Ingrid Bergman won a best supporting Oscar for her role which she thought, and expressed, as a mistake. With the exception of Branagh, and that mustache, the only one who has a chance to show off is Michelle Pfeiffer and, by the way, stay for the end credits to hear her sing. Judi Dench is wasted in what is more of a cameo than a supporting role. Also in the film are Penelope Cruz, Johnny Depp, Derek Jacobi, William Dafoe along with newer names such as Daisy Ridley, Olivia Colman and Leslie Odom Jr., none really shining but none embarrassing themselves.The main difference, to me, is that the scenery in the latest version is plusher, visually breathtaking whether shot on location or in a studio.The ‘hook’ of “Murder on the Orient Express” is the solution to the crime that takes place which, at points, can be confusing but the major point of who did it, and why, is obvious enough.There is nothing wrong with this 2017 version with the hour and fifty-four going by at a relaxing time and the sets, costumes, lighting and all of the production aspects are first rate. The question is whether this was really worth a remake and if you should pay to see it or watch the 1974 version for free on youtube."
    },
    {
      "rating": "6",
      "text": "I am a huge Poirot and Agatha Christie fan and honestly this movie fell flat for me. Whatever joy and subtle humour is added to any British film has been sucked dry in this star filled remake. Overall if director and actor Kenneth Branagh had focused on adding to this classic, rather than having cheap short action sequences, CGI set design and odd camera angles, it may have worked better in his favour. Also, Poirot's moustache is supposed to be ridiculous, but not that ridiculous."
    },
    {
      "rating": "6",
      "text": "Still on the fence about this one. While the acting, scenery and production design are great, the story and screenplay itself leaves much to be desired."
    },
    {
      "rating": "8",
      "text": "Good new ecranisation world classicEverything is done at a very decent levelI look forward to continuing"
    },
    {
      "rating": "7",
      "text": "Tiene un comienzo aburrido y poco atrapante pero mediante se va resolviendo el crimen la calidad de la peli aumenta. Gran escenografía y producción sumados a una excelente actuación, esta peli te deja un gusto a lo que puso haber sido."
    },
    {
      "rating": "6",
      "text": "Murder on the Orient Express was pretty average when it comes to murder mystery movies. The cast on its own was great with lots of well known actors but the story itself felt pretty bland and uninteresting."
    },
    {
      "rating": "6",
      "text": "The movie has 2 details because of which it it is possible to look: cast and Agatha Christie's history. On it everything comes to an end, the plot is known and at once clear who is involved in murder, there is no suspense at all. In the general cinema on once if there is nothing to look. And action of the movie is a little tightened."
    },
    {
      "rating": "6",
      "text": "Well,that was both expected and surprising at the same time...If you don't know,I don't have that much of a passion for book-based adaptations and i'm not really one with the Crime and Mystery genre,but Murder On The Orient Express,while being sometimes generic,managed to surprise me at some point.As you might know,this movie is directed by Kenneth Branagh (the same director of Thor and 2015's Cinderella) and,once again,shines in the directing chair. I loved the way the movie was shot,as well as him being the famous Hercule Poirot. And it was refreshing to see Johnny Depp in a decent role,as well as Josh Gad.However,that doesn't stop the fact that it may feel sometimes choppy from a story perspective. The music (composed by The Emoji Movie's Patrick Doyle,poor guy...) and the cinematography make this movie look beautiful,but it could've been better if they got some things right during Act 2,since they try to make the movie somewhat emotional (thing that was better-made during Act 3) and they try to give their \"A+\" cast a bit of screentime. Also,sidenote,the Visual Effects were surprisingly noticeable throughout most of the scenes,even if it's not \"Steppenwolf\" levels of bad. What can I say,it's tollerable,but because of that 2nd Act,it could've improved upon certain things,but I was still okay with the material I sat through. Sure,the pacing and the score are nice (some of the acting too),but the story is so somewhat choppy that quite often makes it look like a soap opera. Or maybe it's just me not really beng into the Mystery genre,i don't know..."
    },
    {
      "rating": "5",
      "text": "The visuals are gorgeous and the acting is decent for the most part, but there are many other problems that hinder this film, most notably from the underwritten script and the rather haphazard handling on the murder itself. It's entertaining, but a little underwhelming. A decent but average film."
    },
    {
      "rating": "6",
      "text": "'Murder on the Oriënt Express' is certainly not the worst detective movie i've seen, but certainly not the best as well. Half of the movie is just Hercule Poirot (Kenneth Branagh) staring in the distance, interogation or Penelope Cruz talking why she doesn't drink and how she will fall just like Lucifer. The movie also tries humor, but got it all wrong.The movie is based on coincidence and fails to connect all the dots. The acting was certainly not bad, we got some great performances by Kenneth Branagh, Daisy Ridley, Johhny Depp and Judi Dench. In general the movie was a big 'MEH'"
    },
    {
      "rating": "5",
      "text": "it is the imbalance..Murder On The Orient ExpressImplanting scattered ideas or tricks with some witty lines and smart adaptation, Murder On The Orient Express is not completely palpable on its own atmosphere as Kenneth seems distracted from the final conclusion"
    },
    {
      "rating": "8",
      "text": "Фильм для читателей Агаты Кристи покажется скучным ввиду сюжета, который им известен, однако мне - зрителю который не читал Убийства..., смотреть его было интересно. Актёры прекрасно подходят данной кинокартине. Отдельной похвалы заслуживает Кеннет Брана. Также радует хорошая картинка и спецэффекты (для того чтобы понять это, надо было посмотреть фильм в кинотеатре). Шутки в фильме не раздражают, а наоборот неплохо дополняют картину. Финальный вердикт: рекомендуется к просмотру лицам, не читавшим оригинальный детектив."
    },
    {
      "rating": "7",
      "text": "Me parece que esta cinta ha sido completamente infravalorada por la crítica. No es un peliculón, no es nada del otro mundo, pero es un buen ejercicio de como revitalizar un clásico con las posibilidades actuales. Me gustó muchísimo la fotografía de la película (no se, tendría algo especial que me llamó la atención), los decorados y el vestuario están incríblemente trabajados y la trama bastante bien llevada (aunque no he leído la obra de Agatha Christie).Buen papel de Brannagh en el personaje de Poirot, nuestro detective protagonista.En general, una película disfrutable, sin muchas pretensiones, que cumple lo que promete. Bastante correcta. Recomendada."
    },
    {
      "rating": "6",
      "text": "I never watched the original film nor read the book it was based off of, but I watched this remake with some low expectations because I am not a fan of boring, intricate, slow-paced crime thrillers with underdeveloped and forgettable characters, but this movie turned out not to be as bad and uninteresting as I initially thought. It was still a slow-paced and boring film, but what saved it from being a TOTAL snooze-fest was the amazing all-star cast (Kenneth Branagh, Johnny Depp, Judi Dench, Willem Dafoe, Penelope Cruz, Josh Gad, Daisy Ridley, etc.), acting, directing, costumes, production value, and shocking but clever plot twist. I love Kenneth Branagh and I am a fan of him as both an actor and director. He, his eccentric but authentic and strong acting, and his character stood out for me in this film."
    },
    {
      "rating": "10",
      "text": "Znakomity film ze świetną kreacją Kenneth Branagh. Niestety niepoprawnościowy i wymagający. Z niejednoznacznym finałem. Daleko zbyt trudny dla współczesnego widza i nieakceptowalny dla wysoko opłacanych, poprawnościowych krytyków. Mało też w nim zupełnie zbędnego efekciarstwa przez co kolejna grupa widzów jest niezadowolona.Właściwie to film ma same zalety a jego zazwyczaj kiepsko uargumentowana krytyka (będąca tylko potwierdzeniem, że największe zalety filmu są rozumiane jako wady) sumują się w wyjątkową sytuację gdzie daję ocenę 10/10."
    },
    {
      "rating": "7",
      "text": "I just love the early 1900s aesthetic of this movie, other than that, it's pretty much a basic crime investigation, with a very unexptected twist and an interesting, yet also very bland main character and a whole roster of different suspects.A good movie."
    },
    {
      "rating": "7",
      "text": "This film features good cinematography, some nice landscape shots and a very decent cast but it didn't entirely stand out to me. The story is a classic and its a fairly atmospheric watch. Its not a bad film as such but it didn't grab me as a great one either. I like that it has a few sub plots and while the plot pace is slow, the element of mystery kept me watching. I thought Branagh gave a relatively decent performance as Poirot too.I'd say its worth a watch, yes."
    },
    {
      "rating": "10",
      "text": "Really good I honestly didn’t expect it to be all of them I was just shocked that it was all of them"
    },
    {
      "rating": "6",
      "text": "Admittedly I enjoyed this movie a little less than expected. It looks beautiful, has an A-list cast and of course is adapted from a book by legendary crime writer Agatha Christie. I took a Christie expert to the theatre with me, who has over the years read everything that bears her name. When Kenneth Branagh appeared on screen for the first time, she turned to me and said: \"No, Nooo, Noooooo\". So if you're a hardcore Hercule Poirot fan, then you may find this hard to watch as Brannagh does not embody that character as faithfully as he is written. If you don't care about that whatsoever then, good news, you'll probably enjoy this incarnation a lot more. There are a lot of very well known actors in this that share screen time with each other and don't take up a lot of individual attention. Daisy Ridley and Michelle Pfeiffer do seem to get more time. Pfeifer is electric; I wish she'd do more movies. Of course, there were no weak performances as you would expect from a group of this calibre. Johnny Depp as much as I love him does ham it up terribly, this seems to be an ongoing feature of all his work these days, but his character is engaging.Overall the pace does seem stilted, and it drags on a little too long for me. Being shot entirely in a studio, all of the environments outside the train were CG, even though they proved stunning. A couple of the backdrops, although pretty, did not look photoreal which you'd expect from a feature like this. The ending set the franchise up for a sequel, Death on the Nile, another Christie book so if you enjoyed this one then there's another to look forward to.  It's a decent movie, and the all-star cast provides a novelty that you won't get in any films these days. Worth a look."
    },
    {
      "rating": "8",
      "text": "Murder on the orient express tells a story not like any other. It provides a neat and thought provoking twist to the whole Murder Mystery ordeal but now that it's appearing on a modern day cinema screen it's given the opportunity to flourish and glow.The first few minute's of the film set up the next hour and a half nicely, we are given an effective introduction to the greatest detective alive (probably) Hercule Poirot played by the charismatic but heavily accented Kenneth Branagh. Through clever scene's we are given insight into Poirot's psychology, attention to detail and personal views on the foundation of his work which succumb to a ruckus later on. All of this is set up nicely with Poirot solving a simple case in Jerusalem where amidst the suspects of a jewel theft the involved Officer is accused and revealed guilty. This introduce's the sense that thing's are not always what they seem in the movie and that no stone is left unturned. After Poirot decides to have a holiday he boards the Orient Express with his useless friend M.Bouc who is played by the witty and attentive Tom Batemen. What follow's is an excellent tracking shot of the Poirot making his way up the train. This is where the Imagery really shine's as well as the Camera work that works appropriately when showing you the wide open space's of mountain rages to the claustrophobic yet comfortable Express train. The Camera is truly one of the best performers of the Movie, most of the time. Murder on the orient express feature's a range of character's from different class's, races and societies with each one being given a brief introduction that reflects both their personalities and influence over the mystery. For example take princess Dragomiroff, played by Judi Dench. Her frustrated attitude towards her maid and the conductor indicate her impatience and believed authority she has over people. This is also seen in her actions as she refuses to enter her recommended cabin and instead moves along the carriage to find one she likes.The casting in this Movie is also fantastic. Johnny Depp gives his character a devious, mysterious and crafty edge while Josh Gad plays his character with a degree of realism and a natural flow to the different emotions felt by the character. We all know that a murder take's place on the train but how its handled in the story is where the Movie produces problems. During the inspection of the Victim's cabin the director made the odd decision to point the camera down at the actors from above which hides their faces. This is the first initial shock of the movie and the actors should act appropriately but because of this technique we cant see such an expressively draining performance. There are also elements of the story that are not included in the book, some of them add a little more to the character's and the relationship they have with one another but some or pointless to say the least and appropriately go nowhere. As someone who has read the book I can say that this is by any merit a faithful adaptation as it provides the same themes, viewpoint and message of the book while using the same methods and crafty storytelling. Of course this movie has issues but no movie is flawless, and appropriate to the story nobody is flawless."
    },
    {
      "rating": "6",
      "text": "The initial set up on the Orient Express is Hollywood at its best, just the right amount of glamour, tension and anticipation. The costume, location and props departments were on top of their game. The camera work pulls out all the stops too, We get every camera shot you could imagine, tracking shots, crane shots, side angled, colour filtered, you name it Orient had it. The express chugs along nicely until we got to the trestle bridge and from here on its weak and becomes just an average flick. The original 1974 movie picked up Oscars but no fear of that here. The contemporary PC agenda which has seeped into the movie industry is dolloped in spades here. It detracts and grates serving only to annoy the viewer. There are also too many star names with too little for each of them to do. Lesser well known names would have worked better. Poirot is suppose to be fastidious and odd. Branagh makes him cool and in the centre of the action all the time. Fans of Agatha Christie will not be happy with that. The logical exposition isn't highlighted. The pleasure of solving an unsolvable case by gradually peeling back the layers isn't here. Rather just emotion and cheesiness. The cat is let out the bag too early and with a thud. We then do a bit of moral wrestling. And Poirot bows to moral ambiguity.Its entertaining but not A standard. Not the last we'll see either. Death on the Nile is coming"
    },
    {
      "rating": "5",
      "text": "A perfectly... fine film. The visuals are gorgeous and the acting is decent for the most part, but there are many other problems that hinder this film. It's a little underwhelming. A decent, but average, film."
    },
    {
      "rating": "7",
      "text": "Interesting crime story not only for Agatha Christie fans. Pleasant to watch."
    },
    {
      "rating": "8",
      "text": "Whats not to like folks? Brannagh is great...charming. The story itself a classic. Good actors abound. And you get what is promised. That can't be said for so many movies. Take grandma, the kids your wife and your mistress. Enjoy."
    }
  ],
  "recommendations": [
    "the_devil_all_the_time",
    "odd_thomas",
    "backdraft",
    "the_great_gatsby",
    "inkheart",
    "the_girl_with_the_dragon_tattoo",
    "victor_frankenstein",
    "nocturnal_animals",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "harry_potter_and_the_order_of_the_phoenix",
    "the_count_of_monte_cristo",
    "the_aviator",
    "the_illusionist",
    "harry_potter_and_the_prisoner_of_azkaban",
    "dune",
    "harry_potter_and_the_chamber_of_secrets",
    "alice_through_the_looking_glass",
    "kingdom_of_heaven",
    "legend",
    "a_most_wanted_man",
    "magnolia",
    "body_of_lies",
    "blood_ties",
    "the_paperboy",
    "oz_the_great_and_powerful"
  ]
}