{"id": 2309, "title": "Murder Mystery", "starring": ["Adam Sandler", "Jennifer Aniston"], "runtime": 97, "genre": ["Comedy", "Mystery"], "description": "On a long-awaited trip to Europe, a New York City cop and his hairdresser wife scramble to solve a baffling murder aboard a billionaire's yacht.", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/bSMSO9xupd4R4vwTPqigHn2quLN.jpg", "categories": {"plot": 5.818181818181818, "acting": 5.555555555555555, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.090909090909091, "action": 7.0}, "reviews": [{"rating": "8", "text": "A delightful romantic comedy with some great character actors who really shine. Anniston and Sandler have wonderful chemistry together and it is the first enjoyable film from Happy Maddison that I’ve seen in a very long time."}, {"rating": "7", "text": "It's no Game Night, but easily the best of the Sandler/Netflix collaborations thus far. It's almost up to the same level of quality that once saw the comedian dominating the box-office back in the day. The production values and concept are on point. It just needed better jokes. Not that it isn't funny. Sandler and Aniston's chemistry ensure that things remain amusing throughout. They're just never hilarious enough to elevate the movie above anything more than the kind of easy watching time passer that Netflix regularly churns out."}, {"rating": "7", "text": "It's too long and it's very cheesy but the b-movie antics are elevated by Jennifer Aniston who steals the show with a solid likable performance. I enjoyed it much more than I expected to as I'm not usually a fan of Adam Sandler movies. Definitely a good one to watch if you want something lighthearted and silly."}, {"rating": "9", "text": "It was overall a great movie! I love those two in movies together! It was a funny drama"}, {"rating": "6", "text": "I had low expectations for this but was pleasantly surprised. I found myself laughing and watched the whole movie through. Jennifer Aniston was great. The premise has been seen before, but the presentation seems fresh. It's not often that I sit through a comedy these days, but found myself enjoying it. Was it brilliant? No. But it was simple fun."}, {"rating": "8", "text": "This is a good movie despite what most critics say. It may have a slightly twisted plot but is definitely worth watching. It features hilarious main cast (Adam sandler, Jennifer aniston) members and is a decent addition to the comedy and thriller genre."}, {"rating": "8", "text": "A surprising funny movie from Adam Sandler. I love the fact that this movie isn't a late night comedy. Of course the film have it's flaws, but in a greater perspective, it's a funny and interesting movie."}, {"rating": "7", "text": "This Adam Sandler film is an improvement from the last work we have seen from him, it works well enough to be entertaining, good supporting cast and not one fart joke."}, {"rating": "0", "text": "This is by far the worst movie of 2019. Sometimes movies are funny just because they reach a very low level intentionally. Unfortunately this one is so boring that you will sleep before enjoying its unintentional mediocrity."}, {"rating": "10", "text": "Super funny and very interesting. Love this movie so much. Extremely sad that it's very underrated"}, {"rating": "3", "text": "One of the most nuanced example set for women empowerment, Sandman has got what these big banners would kill to have for; Aniston will solve it, though.Murder MysteryI try and always give credit to the creators or directors at first, before I start on saying something about the film. But over the years, with plenty of films and other appearances on stages or shows, the Sandman- as Sandler claims himself to be- has remain Sandman all the way through, untouched and unfiltered with only a couple of exceptions. And just like all of them, this one too is a Sandler film. With that same unorthodox method and repetitive familiar jokes and goofy flirty language, the film suffers the same consequences. My brother is a huge fan of his and over the years we have had our fair share of debates.And what this has accounted with, is material against procedure. Adam Sandler is an amazing comedian, and so is his comic timing in his films. But the film, no matter of comedy genre, cannot simply run on gags. The film defines, asks, it to be a collaboration of simply good work from all accounts. Whether it be execution or narration. The goofiness is tolerating, in fact, it is encouraged in a world like such. But the lack of concentration on the state and vocab and command over the characters is never negotiable.My brother often turns down the discussion by announcing it as an escape route from the real world- as any fan would- that has been bugging you for an entire week. But is it really enchanting or engaging enough to get lost? Even an amateur film buff finds it hard to swallow these clunk of rocks, set and told, as the final polished product. So where does this project in Sandler's catalogue lies? Murder Mystery is not his finest or most ambitious work of all but it certainly shines the Sandman label clear and bright with gorgeous locations and his middle age crisis."}, {"rating": "3", "text": "While segments of \"Murder Mystery\" are entertaining, the jokes in James Vanderbilt's script simply does not land often enough. The mystery itself is dumb, and the bickering between Jennifer Aniston and Adam Sandler is annoying. Even as an escapist movie, it's often cringeworthy to watch."}, {"rating": "0", "text": "Thanks for this piece of trash. How could u do this movie after roma. Okurttt"}, {"rating": "1", "text": "Saw this mentioned somewhere, thought I'd give it a try... utter disappointment. Couldn't hold my attention and just became background noise half way through whilst I was doing something else. Just another piece of trashware on Netflix."}, {"rating": "2", "text": "Sexist, Materialistic, Dumb - and actors that jumped the shark ten years ago. I would not recommend this movie to anyone above a 5 year school education."}, {"rating": "8", "text": "I enjoyed this new installment from Adam Sandler very much. Hence, I don't know why this movie got a so low rating. This is your classic typical Adam Sandler comedy. If you like Adam Sandler type of movies, then you will certainly like this one. It has all the Adam Sandler quirks that you are accustomed to, but with more subtlety and sophistication and ofcourse some are borderline absurdity, but thats what we like about Adam Sandler style of humor. The pair up with Jennifer Aniston turned out to be perfect, as Jennifer is a queen of sitcom comedy herself, you can see that she immersed herself perfectly in the comedy world of Adam Sandler. The rest of the cast were quite engaging and by the end of the movie, you wish this could be a franchise and longing for a part 2 !"}, {"rating": "10", "text": "It’s very beautiful because jennifer aniston is magnificentCome stai facendo un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi riopure a ricordo il mio compagno mi piace un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e ieriirieitii itieioegir a me lo chiedi pure a me piace un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi pure a me lo sento più a casa mia sorella è andata a casa mia sorella è una cosa ma non mi piace un sacco di dove siete tutti dei ragazzi che si è il giorno in cui mi sono dimenticato la foto del genere che non ho internet lento di un sacco con me lo chiedi pure a te e papà di più di un sacco con me lo chiedi te e papà di più di un sacco con me lo chiedi pure a te e papà di più di un"}, {"rating": "3", "text": "It could be fascinating movie, but once again we got boring, predictable and stupid film. It's extremely painful to see Aniston and Sandler trying to act. They should to start looking for more challenging projects because they are wasting their talents."}, {"rating": "6", "text": "The movie was pretty decent for a adam sandler movie, although it does have have unrealistic expectations. First of all i'm pretty sure you're not suppose to get off your seats, even if you wanted earplugs. Second of all what type of famous or rich person befriends a cop and his wife of 15 years. It was also pretty unwatchable for me if it includes a scene that's too embarrassing for me to watch (like the scene were Malcolm who asks \"who are you?\") also it was pretty predictable. I predicted that fact that other people die in this movie, but on the other note, the movie was pretty decent although half bad. i'll give this a 6 out of 10"}, {"rating": "10", "text": "This movie is everything you would hope for in a comedic murder mystery. The movie was full of over the top and subtle comedic moments. Adam and Jennifer's roles were on pair with their better films and the over all feel of the movie was fun and exciting and keep me focused through the whole filme."}, {"rating": "1", "text": "I could have enjoyed two episodes of Murder She Wrote in the time I spent groaning and eye-rolling my way through this ninety-minute mess. Sandler and Aniston are not funny, the dialogue is cringeworthy, and the plot is formulaic and predictable. Don't waste your time."}, {"rating": "8", "text": "\"Clue\" style film meets Adam Sandler style silly comedy, set in a beautiful location.  The writing jokes wise is fairly typical sandler, but toned down a bit during the suspenseful parts.  the first 45 minutes or so is quite funny, and the 2nd half is more mystery and some suspense, with still a steady amount of humor. (usually bantering between the two leads, which also worked well in \"Just go with It\".) If you like Adam Sandler movies you will almost for sure like this movie.  I liked it a lot, and enjoyed the silly humor as usual, with a slightly different side plot of mystery and suspense, which kept you guessing as...to who did it..and who did what...Well done comedy, and an enjoyable watch."}, {"rating": "6", "text": "I definitely did not love “Murder Mystery”, but it wasn't absolutely terrible.  Certain things were well thought out.  If it had a different director or editor, I could actually imagine this being pretty decent.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out."}, {"rating": "6", "text": "The premise of this whole film felt like it would have worked in 80s and 90s comedies, however just doesn't cut it in the 21st century. Though the idea was interesting, the bickering American couple trope is so cliche."}, {"rating": "7", "text": "Good comedy with a great cast, Sandler and Aniston have great chemistry and work well together. Clocking in at 97 minutes, the film almost too long for its own good and could have cut out needless plot threads"}, {"rating": "6", "text": "With an interesting cast, a predictable and cliché but always entertaining plot, decent jokes and a fairly good ending, Murder Mystery is a surprisingly fun watch. Although it is far from being a good comedy, it's still a more than decent movie."}, {"rating": "4", "text": "Since a long time Adam Sandler hasn't had a Box Office hit, recently, he tends to make a stupid movies not befitting him, \"Murder Mystery\" is dumb and pointless, it wastes a talented cast, Adam Sandler and Jennifer Aniston last seen together in \"Just Go with It\" and actually it was more funny than this one.The Story is similar to \"Murder on the Orient Express\" but in a funny way, most jokes were stupid thus the performance was same.It's just the kind of movie to turn on one night when you're looking for something fun, silly, and a little mysterious."}, {"rating": "6", "text": "The movie lacks a bit of mystery, and what is missing is replaced by subtle comedy, it's not the standard trying to really make you laugh, but feel good light chuckles. it kind of works, and it's a cozy atmosphere, the reason it might miss the mark, it that it is very easy to see the potential it would have if it took itself more seriously and still brought some subtle funny. but all in all, it's a cozy and fun watch if you don't want to get too invested in something. 5.9/10"}, {"rating": "4", "text": "Not great, but still worth watching.  If this wasn't on Netflix, I would have expected more, but if the only realy expense here is your time, it's worth watching."}, {"rating": "7", "text": "Good light comedy. The plot is simple and trivial, than that reminds novels by Agatha Christie. The black comedy for one viewing there is nothing not applying. Everything is so banal that it is even good."}, {"rating": "4", "text": "I'm aware that the alliance between Adam Sandler and Netflix is successful. It has been fruitful after all with the exception of Hotel Transylvania 3 all the actor's latest films have been in the streaming service including ''The Meyerowitz Stories''; The only film in which he did a good job since ''Reign Over Me''But honestly after all this time it's pointless to call most of his work disappointing. He knows what he sells and the audience consumes it, so anything else I could mention about that it's just irrelevant.This new film simply follows the comedic formula of everything he does and I've gotta say it because frankly I'm not a fan of his work and maybe for Netflix and for him this will be considered a success, I really don't know but for me it's a another boring film and another forgettable film for Netflix's catalog and for the actor's career.Jennifer Aniston? I guess she was there for the paycheck and because he's her friend. Other than that there's really nothing worth mentioning."}, {"rating": "4", "text": "Esta nueva oportunidad de trabajo de Adam Sandler y Jennifer Anniston carece del carisma y química que \"Just go with it\", y es porque la película tiene un guión flojo que falla en darle los tintes de romántica o de acción.\"Murder Mystery\" es la historia de un policía y una peluquera que se hallan en medio de un asesinato, y es su deber limpiar su nombre de la lista de sospechosos mientras buscan al verdadero culpable.La trama aunque ya vista puede funcionar si el grupo y las pistas son lo suficientemente bien jugadas para hacer que uno pueda seguir el misterio por su cuenta, pero aquí se desperdicia esa conexión haciendo del misterio algo sólo de los protagonistas.Si hay que darle unos puntos positivos es gracias a la comedia, no es de la mejor, pero por partes se las arreglan para hacer reír.En general no puedo recomendarla a pesar de que me guste la química de la pareja, el problema pasa por la estructura del film que poco le otorga al espectador."}, {"rating": "5", "text": "Murder Mystery can be good fun at best, but it's mostly a clichéd, generic and forgettable summer comedy."}, {"rating": "2", "text": "Pretty boring. Aniston and Sandler both play the same type of character in every movie."}, {"rating": "4", "text": "this movie was unfortunately a let down, the humour wasn't great and I wouldn't recommend watching this if your looking for a comedy."}, {"rating": "7", "text": "Murder Mystery is the fifth happy Madison and Netflix production and is one of the best out of the four. In my opinion most of these are heavily underrated of course there are bad ones like the ridiculous six and sandy wexler but this and the do over are good. The plot is couple Nick Splitz (Adam Sandler) and his wife Audrey (Jennifer Aniston) take a long overdue honeymoon but while on the plane they run into billionaire Charles Cavendish (Luke Evans) who invites them on their yacht for their honeymoon but on the trip Malcom Quince (Terrance Stamp) is murdered on the boat and since Nick is a detective he must find the killer who include an actress Grace Ballard (Gemma Arterton), Tobias Quince (David Walliams) and other suspects. The movie is based off of the board game murder mystery and is similar in tone of course this movie brings in a lot of hate simply due to the fact that Adam Sandler is in it who is one of the most hated actors in Hollywood. Don’t let the low critic scores fool you it’s a fun movie and has a good final act so I’m going to give it a 7/10"}, {"rating": "4", "text": "The film has a few fun moments. Quite okay for an evening, but there are clearly better offshoots in this genre."}, {"rating": "4", "text": "Es malilla, la típica parodia para ver con amigos de descubrir al asesino, con la típica comedia, que en este caso hay que rebuscar bien la gracia, porque es floja de narices. Construcción de lo más típica pero es fácil de ver. Si ha sido un gran estreno en Netflix por algo será.· Cosas buenas: el reparto mola bastante, tiene algunas ocurrencias molonas y lo dicho, fácil de ver y guay si es con amigos.· Cosas malas: la comedia es muy forzada, aunque tiene toques que te pueden hacer reír si estás de cachondeo. En general la construcción de la película erra bastante.· Conclusión: hay muchas mejores películas de este estilo para ver con amigos, aún así, si no se os ocurre nada más, está bien para echar la tarde."}, {"rating": "2", "text": "Boring as sin, and the jokes don't hit. I think there were only 2 jokes I chuckled at? It isn't even so bad it is good, it is just boring."}, {"rating": "4", "text": "It was a decently funny romp, the plot and pacing is just so wild and so illogical that its hard to stay grounded in the mystery at all."}, {"rating": "5", "text": "It’s a fun movie. It’s silly and enjoyable. It’s nothing ground breaking but it is fun."}], "recommendations": ["the_wedding_ringer", "the_longest_yard", "zack_and_miri_make_a_porno", "identity_thief", "friends_with_benefits", "the_break_up", "50_first_dates", "sandy_wexler", "the_cobbler", "keeping_up_with_the_joneses", "pitch_perfect_2", "forgetting_sarah_marshall", "the_five_year_engagement", "blended", "date_night", "johnny_english_reborn", "central_intelligence", "seven_psychopaths", "night_at_the_museum", "hubie_halloween", "rough_night", "the_watch", "holidate", "the_proposal", "this_means_war"]}