{
  "id": 4579,
  "title": "Music and Lyrics",
  "starring": [
    "Drew Barrymore",
    "Hugh Grant"
  ],
  "runtime": 105,
  "genre": [
    "Comedy",
    "Music",
    "Romance"
  ],
  "description": "A washed-up '80s pop star gets a chance at a comeback when reigning pop diva Cora Corman invites him to write & record a duet with her, but there's a problem--Alex hasn't written a song in years; he's never written lyrics and he has to come up with a hit in a matter of days.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xcdA2WLBNcPXMQB9uA5DqqQvbwe.jpg",
  "categories": {
    "plot": 8.5,
    "acting": 7.75,
    "ending": 7.0,
    "soundtrack": 7.6875,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.3,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Best romantic comedy in years, avoiding the tired cliches that plague the genre. The self-mocking Grant, of his lame fame past is hilarious, and Barrymore is the most natural leading lady staring today. My wife and I loved it. One of those movies that I laughed about long after I left the theater. Only a hopeless cynic would not like this movie."
    },
    {
      "rating": "7",
      "text": "Very cute. Ignore the many jokes that fall a bit flat, the cheap sets and Drew's neurotic Jew shtick and you're left with a sweet romance, Hugh Grant effortlessly carrying a film and most importantly the behind the music stuff. Very similar to That Thing You Do (obviously, since songs by Adam S.)---the music affectionately and effectively parodies different cheesy elements of pop...while at the same time infecting us with a love for the sounds."
    },
    {
      "rating": "8",
      "text": "This is genuinely what it claims to be- a wiity, not too sugary romantic comedy with quite good music and surprisingly good chemistry between Hugh Grant and Drew Barrymore and not overacted or overwritten."
    },
    {
      "rating": "8",
      "text": "Even though you know exactly what is coming, this movie is still great. The chemistry of the main cast is electric, and the movie is smart and fresh."
    },
    {
      "rating": "8",
      "text": "Hugh Grant is Hugh Grant, but that means plenty of funny lines that take conversations in oblique directions. We all knew where this was going to end but it was fun getting there. A few akward moments, but they went by quickly and did not disrupt the flow of the story."
    },
    {
      "rating": "9",
      "text": "What screenwriting course, book or set of self-hypnosis tapes has writer-director Marc Lawrence been availing himself of lately? The man who brought us Miss Congeniality (a thoroughly mediocre script that was made watchable by an extremely engaging cast) and Two Weeks Notice (a desperate, laugh-free effort that even the cast didn't help) has made a 1000% quantum leap over his previous efforts, giving us an uncommonly smart, endearing and consistently funny romantic comedy that's also uncommonly perceptive about the American popular music industry, circa the 1980s and today. The MTV-video parody that opens the film is so delightful, well observed and absolutely spot-on that I was prepared to be let down by everything that followed, and I absolutely wasn't: this tale of how has-been Pop! singer Alex Fletcher (Hugh Grant channeling Andrew Ridgely, the half of Wham! that doubles as a Trivial Pursuit question) and a young woman, Sophie Ridgely (Drew Barrymore, intensifying all the crushes on her that currently exist and undoubtedly starting a few new ones) who's better at writing lyrics than watering plants, get together both professionally and personally is not only beautifully constructed in the manner of some of the best \"battle of the sexes\" comedies of the 1940s and 50s, but features endless bright dialogue, extremely catchy songs that are also accurate period pastiches, and--best of all--two flawed but intelligent, lovable human beings you really care about and root for. Nothing wrong with the supporting players, either: Brad Garrett, as Grant's sweetly resigned manager, rises from the ashes of his embarrassing work in The Pacifier to prove that there really is life after Everybody Loves Raymond, while Kristen Johnston, the rubber-faced Amazon from 3rd Rock from the Sun, is a comic marvel as Barrymore's giddy but wise older sister--the almost-throwaway sequence in which she tries to get her picture taken with Grant is a gem! Equally good, both in conception and interpretation, is Haley Bennett as Cora Corman, the flavor-of-the-month trillion-selling artist that Grant and Barrymore are writing for; Lawrence makes the very smart move of writing her as spoiled but not a brat. (She's predictably wrongheaded in some major ways, but that's because she's young and placed in the middle of an extraordinary situation she doesn't have the experience or wisdom to handle; unlike certain current pop stars we could name, she retains enough decency and common sense to assure us that she'll turn out fundamentally OK when she grows up.) The one common characteristic shared by romantic comedies and horror films (besides the fact that very few of either reach $100 million at the box office) is that in both genres you have to slog through a lot of dreck to find a good one: with every When Harry Met Sally... or Pretty Woman comes a dozen Must Love Dogs, Wedding Dates or Little Black Books. That's why it's so pleasantly surprising to come up with not one but two terrific ones in the last four months: the warm, uncommonly satisfying crowd-pleaser The Holiday and this. If my luck in other areas of life runs parallel to this, perhaps I'm doing the wrong thing at this moment. If you'll excuse me, I think I'm going to run out and buy a whole bunch of lottery tickets!"
    },
    {
      "rating": "10",
      "text": "Hugh Grant just stays adorable. It is so lovely to have him aging right along with me! Very fun movie and a must for anyone who loves vintage Hugh Grant."
    },
    {
      "rating": "5",
      "text": "Methodical delivery slowed this movie down and left at least one sub-plot unexplored. Bu ok if you like seeing Barrymore and Grant together."
    },
    {
      "rating": "5",
      "text": "Hugh Grant on autopilot. Flimsy and not very satisfying but sometimes funny. Fountains of Wayne involvement is the main highlight."
    },
    {
      "rating": "3",
      "text": "Wow, is that Metascore off! I haven't been this bored by a romantic comedy since \"How to Lose a Guy in 10 Days.\" Seriously, I've never seen Hugh Grant with such a blunted edge. Seriously disappointing compared with such films as Bridget Jones, About a Boy, and Notting Hill. Don't bother."
    },
    {
      "rating": "5",
      "text": "This was alright. enjoyable romp although there's not a lot of laughs here and theres zero chemistry between Hugh Grant and Drew Barrymore. Maybe its because, in my opinion, they're dull-as-hell actors. anyway, it was a fair way to while away 90 minutes."
    },
    {
      "rating": "5",
      "text": "Fluffier than most romantic comedies, but the ending makes it watchable."
    },
    {
      "rating": "2",
      "text": "I'm a sucker for Hugh Grant romantic comedies, but this is NOT a good one. If you want to laugh, this is NOT the movie for you."
    },
    {
      "rating": "6",
      "text": "Being a guy who likes movies like Old School and Big Daddy, i was surprised to get a couple of genuine laughs out of this movie. However, since this IS supposed to be a chick flick, that may or may not be a good thing. I actually enjoyed this movie more than my friend (who is a girl). She DIDN'T like it because it wasn't chicky enough, and i liked it because it wasn't too chicky. So all in all, what i guess i'm trying to say, is that this movie doesn't really know what it's doing. Usually in romantic movies i still get that feeling at the end, that feeling that let's you know it's a sweet romantic movie. I didn't get this feeling from this one. In fact i didn't feel anything at all from this... so yeah it's basically just a throwaway film. If you wanna watch a chick flick, go watch The Holiday, and if you want something funny, go watch something funny."
    },
    {
      "rating": "8",
      "text": "Very enjoyable. Drew Barrymore is her usual bubbly self. Hugh Grant is a faded pop star that has a chance to make a comeback writing a song for a current pop star. Personally I didn't like most of the music, but that is sort of the type of music of today. The music that Grant and Barrymore compose is excellent. Nothing objectable in this movie, which is always a refreshing change."
    },
    {
      "rating": "5",
      "text": "The movie begins with a hilariously cheesy 80s-style music video starring Hugh Grant, and then wavers between slightly humorous to forgettable and uninspired the rest of the way. Kristin tries to be funny as Barrymore's big sister, but she doesn't succeed. To top it off, I don't think the core \"song\" that Barrymore and Grant write is all that good to begin with--it's just decent. As in 8 Mile, That Thing You Do, Hustle and Flow, and other films focused on music and lyrics, the main melody needs to be catchy enough for viewers not to get bored. Also, I didn't really buy the romance between Grant and Barrymore, but they're as charming and adorable as you'd expect them to be."
    },
    {
      "rating": "8",
      "text": "A fun romantic comedy. Drew and Hugh play well off each other and the music moves the movie along."
    },
    {
      "rating": "10",
      "text": "This was such a cute movie! I laughed and laughed and it was so much fun! A perfect date movie with all the things you want: romance, comedy, twists and more comedy!"
    },
    {
      "rating": "7",
      "text": "This is lightweight stuff, but it is done with charm, warmth, humor, and good chemistry between Grant and Barrymore. I even kind of liked the music."
    },
    {
      "rating": "8",
      "text": "For those of you who wished \"Hustle and Flow\" was a romantic comedy, your movie has arrived. \"Music and Lyrics\" is surprisingly realistic in showing the creative process. Hugh Grant and Drew Barrymore in their own ditzy way, pull off the same trick of muse contacting as Terrence Howard did in his breakthrough role; this modern-day Brill Building team convinces you that they're actually writing a song, in the moment, with flirty banter that really hits the mark. What Lester Bangs(Phillip Seymour-Hoffman) forecasted as an \"Industry of Cool\" in Cameron Crowe's \"Almost Famous\" and in his legendary essays is the timeline \"Music and Lyrics\" begins with, the inception of MTV(not named here) and its terrible byproduct; the triumph of style over substance. Although Pop bears a superficial resemblance to Wham, these fictitious eighties has-beens can't be Wham. Andrew Ridgley wasn't talented enough to have Alex Fletcher's fledgling career. Pop is more like Simon & Garfunkel reimagined as New Romantics. \"Music and Lyrics is a lot like the Crowe film in that it yearns for the recent past. The early-eighties isn't the late sixties(Haircut One Hundred, anybody?), but at least melody still took precedence over rhythm; best exemplified in \"Music and Lyrics\" when Cora Corman(an excellent Haley Bennett; her character is a perfect balance of innocence, and a self-assurance that vapidness is the new shrewd) thrashes a perfectly functional song you could perform at a karaoke bar."
    },
    {
      "rating": "8",
      "text": "I thought the movie was essentially a funnny look back at those silly 80's bands with the king and queen of the chick flick in Grant and Barrymore leading the way. Somewhere the Flock of Seaguls are cracking up! Great Job!"
    },
    {
      "rating": "9",
      "text": "Although the pattern of the plot is like most other romantic comedies. the texture is something special, I thought. It's not so cliche-laden, the acting and scenes are more realistic. I really liked this movie."
    },
    {
      "rating": "8",
      "text": "Very fun, well-written romantic comedy. Hugh Grant again proves his comedic abilities, while surprising us with an actual singing voice and stage presence. Drew Barrymore again plays her standard \"clueless yet cute\" role."
    },
    {
      "rating": "10",
      "text": "A wonderful \"happy\" movie---a real feel good movie. The spoofing of today's music vs. 1980's music is right on!"
    },
    {
      "rating": "8",
      "text": "A delightful romantic comedy which is a must see for Drew Barrymore fans like me."
    },
    {
      "rating": "8",
      "text": "Highly entertaining. Fairly good plot. Good music."
    },
    {
      "rating": "8",
      "text": "An enjoyable feel-good movie with many genuine laughs."
    },
    {
      "rating": "8",
      "text": "A very enjoyable movie. Anyone who remembers MTV's beginning and danced through the 80s, will find countless ways to laugh at their past -- the style of dance, videos, hair, make-up and music are all spot-on and hilarious. Hugh Grant and Drew have good interaction. No big surprises as it is a romantic comedy, but good banter. Some of Hugh's one liners get a little hidden by his dry style, the quickly moving dialogue and Hugh's accent. I look forward to a second viewing on DVD. The biggest problem -- the Pop! song can get stuck in your head by the end of the movie and you may find yourself 'pop!'-ing in the car or at home."
    },
    {
      "rating": "9",
      "text": "Loved it. Great comedy romance musical with Hugh Grant and Drew Barrymore."
    },
    {
      "rating": "6",
      "text": "I think this is ok for what it is and Hugh Grant looks relaxed and is on form carrying this movie all the way through. Drew Barrimore seems more restrained than I've seen her in other movies but still if you want a rom com these 2 make it. I've even had that song in my head after watching it."
    },
    {
      "rating": "8",
      "text": "In a word. enjoyable... decent date movie, or really for anyone that wants to laugh a little, smile and get good value for your movie dollar. gosh, no violence, no curse words (very, very few) some decent music and a plot! drew and hugh have a medium sized hit here, so see it... even before the dvd comes out."
    },
    {
      "rating": "8",
      "text": "Much more pleasant than I expected. The witty dialogue and subtle - and not so subtle skewering of contemporary pop culture. Hugh Grant plays to type, but I happen to like that type, the somewhat bemused British semi-intellect, and Drew Barrymore displays an intelligence that I was actually unprepared for. And newcomer Haley Bennett was intriguing as the iconic pop diva. Fluff perhaps, but not empty fluff."
    },
    {
      "rating": "10",
      "text": "It was exactly as advertised. Patty, and I loved the movie."
    },
    {
      "rating": "6",
      "text": "Interestingly, compares the melody of a song to be like the attractive first impression of a person, and the lyrics the soul/personality that you get to know better after some time. Gives insight into the life of an average professional songwriter. Other than that, just another very charming love story."
    },
    {
      "rating": "6",
      "text": "Predictable, not particularly funny and cliché. This Hugh Grant romantic comedy is exactly what you would be expecting it to be. At least the soundtrack was quite good and the acting was decent."
    },
    {
      "rating": "6",
      "text": "A fun romantic comedy. Drew and Hugh play well off each other and the music moves the movie along.The songs from this movie are great."
    },
    {
      "rating": "10",
      "text": "Just love this film. It make me smile and feel happy and I love the music too. Well acted by a good cast."
    }
  ],
  "recommendations": [
    "friends_with_benefits",
    "pitch_perfect",
    "50_first_dates",
    "clueless",
    "10_things_i_hate_about_you",
    "leap_year",
    "forgetting_sarah_marshall",
    "grease",
    "notting_hill",
    "pitch_perfect_2",
    "just_like_heaven",
    "blockers",
    "blended",
    "the_break_up",
    "hitch",
    "yesterday",
    "mamma_mia_here_we_go_again",
    "burlesque",
    "sisters",
    "17_again",
    "role_models",
    "george_of_the_jungle",
    "delivery_man",
    "last_vegas",
    "work_it"
  ]
}