{
  "id": 4286,
  "title": "Music",
  "starring": [
    "Kate Hudson",
    "Leslie Odom Jr."
  ],
  "runtime": 107,
  "genre": [
    "Music",
    "Drama"
  ],
  "description": "Zu, a free spirit estranged from her family, suddenly finds herself the sole guardian of her half-sister, Music, a teenager on the autism spectrum whose whole world order has been beautifully crafted by her late grandmother. The film soon challenges whether it is Zu or Music who has a better view of the world, and that love, trust, and being able to be there for each other is everything.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xzDXq7ofNkvIovB6Vb8KZpjqkK0.jpg",
  "categories": {
    "plot": 7.142857142857143,
    "acting": 6.833333333333333,
    "ending": 0.0,
    "soundtrack": 6.7272727272727275,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 0.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Worse than problematic. Imagine every downside of surrounding yourself with sycophants who love the smell of your farts and refuse to say \"no\" to you as a creator. Now, play all of these downsides out to their extent and you get \"Music,\" a film that's not only hopelessly empty and trite, but apt to cause real-life harm. Like, demonstrably. I won't even get into the controversies at hand because they're honestly infuriating, with implications that can get dark pretty fast, so I'll just leave you all with this; there's a scene in here where Sia appears as a fictionalized version of herself, promoting a practice involving her smuggling medicine to third-world countries. I owe you an apology, M. Night Shyamalan in \"Lady In The Water\" - THIS is the most self-absorbed **** I've ever seen. With music-video-like breaks in narrativity that make absolutely no sense and some profoundly cringe-worthy dialogue, \"Music\" has to be one of the most tone-deaf attempts at handling a concept with such sensitive subject matter that I've ever seen in the big leagues."
    },
    {
      "rating": "0",
      "text": "Extremely offensive, problematic, and grotesque are some of the words I'd use to describe Miss Sia's twisted fantasy. Can't believe trash like this is still being produced in 2021, but I guess you live long enough and you get to see everything."
    },
    {
      "rating": "10",
      "text": "Hermosa, increíble!!"
    },
    {
      "rating": "10",
      "text": "It is unbelievable that this great movie is so badly criticized, based on such stupid things as the fact that the actress who plays music does not deserve the role just because she does not have the disability that the character has, for something it is called ACTING!  It is a great pity that they do not know how to appreciate her as it should be. In a few years this movie will become a cult movie.And the only thing that will be frowned upon will be the people who did not know how to appreciate it."
    },
    {
      "rating": "10",
      "text": "Me encanto la película esta hecha con mucho amor y de verdad es muy triste que no se valore esta obra de arte como debe de ser"
    },
    {
      "rating": "10",
      "text": "Realmente artístico Digno de un Oscar De un Grammy Del globo de oro que bien merecido se lo tendría"
    },
    {
      "rating": "10",
      "text": "Es su primer película y a pesar que es un tema muy delicado; Sia pudo manejarlo...Aquellos que la critican y la están queriendo enterrar son aquellos mismos que le dan una buena calificación a películas mediocres sólo porque otros lo hacen porque realmente no tienen originalidad en sus reseñas"
    },
    {
      "rating": "10",
      "text": "Preciosa y hermosa obra ,todo es tan mágico ,no entiendo cómo a alguien no le puede gustar"
    },
    {
      "rating": "10",
      "text": "Es una hermosa película, maravillosa. Es increible la forma en la que todo fue bien personificado, las actrises y actores de lucieron y la musica es de lo mejor."
    },
    {
      "rating": "9",
      "text": "Es una película muy bonita, no solo habla del autismo(como mucha gente cree) sino que trata muchos otros temas tales como la violencia, el machismo, la discriminación, las adicciones, etc. Sia hizo un gran trabajo. ❤️"
    },
    {
      "rating": "10",
      "text": "Es lo máximo, como siempre Sia dando lo mejor!!!!! La película es definitivamente hermosa"
    },
    {
      "rating": "0",
      "text": "One of the worst \"films\" in recent memory. The movie was bad enough on it's own, but actively encouraging the full restraint of autistic people puts the final nail in the goddamn coffin. Anyone giving this a 10 is a blithering moron."
    },
    {
      "rating": "0",
      "text": "I'm more offended by how bad this movie is written and directed by how actually offensive it is"
    },
    {
      "rating": "10",
      "text": "Como me encanta este película. No entiendo como no le pueden gustar esta película: los buenos actores, la magnífica banda sonora... Sia es amor, no odio."
    },
    {
      "rating": "10",
      "text": "It is a movie that can touch your heart and make you laugh at the same time"
    },
    {
      "rating": "10",
      "text": "it's a good movie to watch and the soundtrack contains the best songs, sia is the best singer"
    },
    {
      "rating": "10",
      "text": "Músic a beautiful movie the hate not destroy the love That this film gave us"
    },
    {
      "rating": "10",
      "text": "Music strikes me as an incredibly perfect movie: a good background, a good soundtrack ... I can feel the emotions of the actors. Thank you Sia for making this wonderful piece of art"
    },
    {
      "rating": "0",
      "text": "This movie is not just bad, the story is badly written, and focus on making Music (the teen with autism) seem like a burden to her sister, wich is a terrible person, that doesn't actualy change during the movie. The movie display harmful practices to people with autism, like crushing? seriously?"
    },
    {
      "rating": "0",
      "text": "Fvck you SIA and your hideous wigs. You're a creep, an Ableist and a horrible human being. It's really satisfying that you made this movie for 5 years and everyone is paying dust 'cause you're a horrible person. Hope you will rot forever in Beyoncé' s basement!!! And I'm disappointed that there's 100+ people who thought that this is a good movie. Pick a struggle. #SaveMaddiefromthiscreep"
    },
    {
      "rating": "10",
      "text": "Es una película hermosa, cómo todo lo que haces Sia, ella no merece el odio que está recibiendo en estos momentos"
    },
    {
      "rating": "10",
      "text": "the movie is so good f u beautiful i love the film, so its my opinion and the movie is nice"
    },
    {
      "rating": "8",
      "text": "Disfrute la película, te rompe el corazón para después romperlo y volverlo a reparar.La película suscita polémica por un lado por la elección de la actriz Maddie Ziegler, que interpreta a una joven con autismo sin verse afectada ella misma, y ​​por otro lado por estar teñida de muchos estereotipos sobre el autismo.  La representación del autismo se considera inexacta y peligrosa debido, en parte, a una escena en la que se realiza una técnica de restricción en MUSIC(personaje). Todas estas críticas ponen en tela de juicio el libre albedrío de la directora, que sin embargo debería tener plena libertad de elección de sus actores o actores, y del contenido de las escenas de su propia película.La cantante/directora Sia se disculpo y ahora da solución a los conflictos que pudo causar su película. Como acertadamente apunta la directora, su película \"no es un documental sino una ficción\".   Es buena la iniciativa, su idea de no hacer una generalización de los autistas sino de ilustrar a los llamados autistas no verbales."
    },
    {
      "rating": "10",
      "text": "I love this movie. Sia, thank you for your creativity and sharing this project with us. Los críticos siempre lo serán, no le prestes atención. Sé que tus intenciones fueron otras y no la que ese grupo quiere imponer a todos. Existe el karma. Dios bendiga a todos ✌"
    },
    {
      "rating": "10",
      "text": "La mejor película que he visto.La actuación y la musica impecable. Un urra por Sía y por su equipo."
    },
    {
      "rating": "10",
      "text": "Sia's Music is a wonderful and heartwarming movie! The issues that a young child experiences through a big case of autism are described and displayed very well! This is enhanced by the metaphors shown in the perfectly timed and well executed in-between music videoclips that play during important plot points. Not only are some of those clips colorful and playful, but they also are great as separate pop singles.    To further add to this, drug addiction, alcoholism, family problems, bullying and psychological issues are also being mentioned and incorporated in a realistic way to also heighten the film's awareness messages that is providing. A realistic story with its ups and downs is being told that can happen in any neighborhood nowadays.    I wanted to also touch the controversy that has been going around this film regarding a non-autistic person playing an autistic one (Maddie). To my mind her performance was great and passionate! Working with Sia all these years, she was perfect and already experienced for the dance routines performed in the in-between music clips. In addition, you could see the pain that a girl with such a problem can have in a somewhat of an extreme case. These extreme cases are plentiful in the real world. People and their families suffer from trying to cope and cooperate taking care of such children. Keep in mind that they are some of the most love educing children/people that you can find, despite having such a disorder!    I know there are autistic actors that could have been casted for this. In the role of this specific case of somewhat of an extreme autistic disorder it would have been a difficult time for the child itself. Imagine bringing to the film such a case of an autistic child. That child could have reacted in the painful way on-screen that could affect her mentally for some of the subjects raised in the film in the future. These children need special treatment constantly (as the film itself shows) and some of them are not given that! This film raises some awareness for this and hopefully it will touch a lot of people.In summary:+ Great and realistic story with its cheerful and sad moments+ Excellent acting from all three main actors! Maddie, Kate and Leslie+ Catchy and colorful pop songs+ Nice work from the supporting cast+ May raise some awareness about a lot of issues in our societyI am giving this film a 10/10 based on my overall review and since it's one of the few cases that these issues are raised in such a magical and musical way!"
    },
    {
      "rating": "10",
      "text": "Music es una expresión increíble de inclusión y amor. El soundtrack es simplemente maravilloso."
    },
    {
      "rating": "10",
      "text": "Es una película muy hermosa, me gusta el mensaje que quizo dar Sia, además la musica es muy bbuena, seas recomiendo en serio"
    },
    {
      "rating": "10",
      "text": "La mejor pelicula hasta el momento, es una maravilla.    Gracias diosia"
    },
    {
      "rating": "10",
      "text": "Excelente película, tiene de todo un poco. Me alegra que Sia haya podido hacer este tipo de películas, porque en si no es algo fácil y pues no todos los autistas son iguales, ha tenido su trabajo, tiempo, dedicación y mucho estudio. Y pues los comentarios positivos de las personas que son autistas me hizo dar más intriga en ver la película."
    },
    {
      "rating": "10",
      "text": "Hermosa película, una obra de arte❤Es perfecta, No se como pueden criticarla de mala manera"
    },
    {
      "rating": "10",
      "text": "Hermosa pelicula ❤ Sia dandonos amor como solo ella sabe, La interpretación de Maddie es impecable"
    },
    {
      "rating": "10",
      "text": "Music es una verdadera experiencia cinematográfica con un perfecto uso del color y la melodía, realmente una hermosa forma de mostrar los sentimientos"
    },
    {
      "rating": "10",
      "text": "it's a movie beauty, sia has a bright mind and everything she create is art"
    },
    {
      "rating": "0",
      "text": "Kate Hudson is a terrible actress and in Music it shows with full force - sadly! Her acting is shallow, superficial, emotionless and with absolutely no depth. She deserved the Razzie Award. The Golden Globe Nomination. A BIG JOKE!"
    },
    {
      "rating": "2",
      "text": "Sia, you indeed \"listened to the wrong people\".  One of those people could have listened to was Maddie.  You should have listened to Maddie herself when she was in tears because she knew that her overexagerated portrayal felt more akin to mockery than portrayal.  She was upset because she knew it could hurt people.  She was right.  That aside, the music sequences were amazing and out of this world."
    },
    {
      "rating": "0",
      "text": "this movie is beyond a disgrace for the autistic community. Sia is a liar. The scene where the autistic character is restrained is the exact same action that killed many autistic people before, and woman is encouraging it as a way “to crush (the autistic person) with love”. I guess Eric Parsa’s death was completely irrelevant when she thought of making that scene. furthermore, her teaming up with a hate group to make a film about the victims of said hate group should have been tip number one. for anyone who says that this movie, or sia, is forgivable, i can only hope that karma takes its place"
    },
    {
      "rating": "1",
      "text": "no. maybe you’re just a bad director, Sia. the golden globes should be ashamed"
    },
    {
      "rating": "2",
      "text": "Yikes.If I must be honest, I only checked this one out because of the heated controversy surrounding it. I knew we were in for a dumpster fire when the first trailer dropped and Sia's unprofessional response to the controversy on her Twitter amount.But man, watching the whole movie was so difficult that I can't fully describe it in words. Incredibly embarrassing to watch and doesn't do its subject matter justice. There are some good songs, but it's so chopped together in these music numbers that it felt so disjointed as a whole.This should have never been made."
    },
    {
      "rating": "9",
      "text": "La película es increíble, aunque consigo inconsistencias en la trama puede decir que la ambientación es increíble.Debo decir que hay escenas muy fuertes las cuales me desagradan, pero aparte creo que todo es muy bueno."
    },
    {
      "rating": "0",
      "text": "This is awful. Sia used autism speaks as a source even when it is a known hate group. Instead of listening to autistic people, she lashed out and deleted her Twitter. She gave an “apology” whitch was way too over simplistic and barly took accountability for her actions. It is safe to say she was only sorry that she was getting “canceled” not that she upset people. This movie is filled with harmful autistic stariotypes. Do not watch, or support sia as a whole in any way."
    },
    {
      "rating": "10",
      "text": "La mejor"
    },
    {
      "rating": "0",
      "text": "As someone with autism, all I can say is this movie is offense and insulting on another level. The restraint scenes shown are deadly, harmful, and triggering with no warning at all. Do not support this movie."
    },
    {
      "rating": "0",
      "text": "There depiction of \"Special Needs\" is offensive and potentially dangerous. Bloated excuse for sia to push her music and weird music videos"
    },
    {
      "rating": "0",
      "text": "horribly offensive and the flashing lights make the movie inaccessible for many autistic people! why make a movie about autism and make the movie inaccessible to autistic people? do your research, sia!"
    },
    {
      "rating": "10",
      "text": "A beautifully made movie that was well acted. The soundtrack is amazing and masterfully created the whole atmosphere that provides wonderful character development. Visually the movie is fantastic but also has a gritty feel. Kate Hudson is the standout but Maddie plays her role exemplary. Actors act! Who would’ve thought."
    },
    {
      "rating": "0",
      "text": "it's very funny that they were carefully managing expectations and trying to get woke people to defend this movie ahead of release and it turned out to be Simple Jack 2"
    },
    {
      "rating": "10",
      "text": "the film is too good, people are dedicated to giving hate, more yet they are not being objective, give a positive and cheerful message, do not get carried away by the comments of people who have not even seen the film."
    },
    {
      "rating": "10",
      "text": "The movie is great, it presents moments of sadness and happiness with a very good rhythm. I highly recommend it."
    },
    {
      "rating": "10",
      "text": "Music, in a musical worthy of those 2 dominations to the golden globes, and what to say about Sia.He excelled with the soundtrack, worthy of an Oscar nomination.And the performances of Maddie, Kate and Leslie Jordan in Music, just impeccable, the costumes and sets,"
    }
  ],
  "recommendations": [
    "revolutionary_road",
    "in_the_heights",
    "bohemian_rhapsody",
    "straight_outta_compton",
    "whiplash",
    "blood_diamond",
    "amadeus",
    "i_can_only_imagine",
    "jingle_jangle_a_christmas_journey",
    "annette",
    "yesterday",
    "the_sound_of_music",
    "trainspotting",
    "alexander",
    "hotel_rwanda",
    "captain_fantastic",
    "my_name_is_khan",
    "the_help",
    "her",
    "rocketman",
    "the_greatest_showman",
    "manchester_by_the_sea",
    "black_swan",
    "legends_of_the_fall",
    "youth"
  ]
}