{
  "id": 4080,
  "title": "My Cousin Rachel",
  "starring": [
    "Rachel Weisz",
    "Sam Claflin"
  ],
  "runtime": 106,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "A young Englishman plots revenge against his mysterious, beautiful cousin, believing that she murdered his guardian. But his feelings become complicated as he finds himself falling under the beguiling spell of her charms.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yz9Pnx5tbpZOHWsCD0LtoTCgmLi.jpg",
  "categories": {
    "plot": 5.96875,
    "acting": 6.466666666666667,
    "ending": 5.875,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.333333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Sam Clafin plays a young Englishman whose guardian marries a woman in Italy (yes, Rachel Weisz plays Rachel). Since the guardian dies soon after. he sets out to find seek revenge, only to fall under her spell. Since the story is mostly obvious, what matters is watching the dynamics of their relationship unfold. This happens, but with less energy than needed. The performers are respectable and the period trappings help create attractive images. Despite the story's ambiguity and the impassioned performances, the overall effect is rather distant and not at all emotionally involving."
    },
    {
      "rating": "5",
      "text": "“Did she? Didn’t she? Who was to blame?”Sexual liberation is at the wake of Roger Michell’s newest feature film My Cousin Rachel, yet, it seems that in exchange for sexual liberation for an unknown female protagonist/antagonist, Michell’s screenplay of the classic Daphne Du Maurier novel compromises many crucial elements of narrative and storytelling that has become expected in modern day cinematic storytelling for elements of story that audiences today are almost completely unfamiliar with.Upon the news of his uncle’s sudden death, Philip (Sam Claflin) is outraged that his closest living relative has deceased, despite his very hefty and wealthy inheritance his uncle has left him. Stricken with grief and guilt, Philip travels to Italy to visit a very conspicuous individual in his uncle’s life, his sudden wife and partner Rachel (Rachel Weisz), in order to get more information on his uncle’s mysterious death. Given reason to believe that his cousin Rachel had more of her fair share of blame to account for his beloved uncle, thanks to a mysterious letter left only a mere weeks before his passing, Philip is not surprised to find Rachel nowhere in Italy.Returning back to his estate in Cornwall, Philip begins a life of solitude and resentment, before his cousin Rachel visits the estate of her late husband. Convinced of his position to confront Rachel with news of the letter and his anguish against her, Philip allows Rachel to come forward unbiased and give her interpretation of the story of her husband to Philip. Given Rachel’s immense charm and seduction and almost entirely avoiding anything about his uncle, Philip begins warming up the older woman who once was married to his uncle, despite obvious advances given to him by his childhood friend and love interest Louise Kendall (Holliday Grainger). Infatuating himself with the very experienced and wise older woman, Philip gives himself completely to Rachel’s gaze and begins a courtship that ends/begins with confusion and deception.While the performances of Weisz and Claflin are nothing short of compelling, the issues that plague the film begin long before the film even begins. Stemming from the marketing and advertising end of the film, My Cousin Rachel’s trailer is one that asks many questions, such as; what genre is the film classified under? Is the supernatural going to be an element in the film? Who can we trust? Genre classification was one of the biggest issues lingering over the film, allowing my imagination to take over for a story that ends up being quite subtle and straightforward. The unexpected addition of mystery, thrill and even elements of horror, that the trailer almost unknowingly presents, gave me one of my most confused and unexpected cinematic experiences of the year.While Michell’s script treads more along the gothic dramatic side of things, and the narrative flow follows closer along the lines of Cary Joji Fukunaga Jane Eyre without the very obvious supernatural elements, Michell’s script decipher’s less of the interactions and meanings between Philip and Rachel, and focuses more one the cinematic spectacle of their interactions for the sake of the audience. One of my biggest peeves with the film is how Michell’s direction and script gives almost no merit and trust in his audience, thinking that so many of the obvious foreshadowing and cinematic techniques used to push forward the story, are not noticed. Even by the trailer, it becomes clear the motives and motifs of the characters. Michell, either unwillingly or without notice, assumed that his audience has never seen a mystery film before, which makes the audiences very angry with his narrative and narrative mystery mise-en-scene choices.Misinterpretation, misguidance and mostly misunderstood any modern day audience members, My Cousin Rachel is a very dim-witted attempt to employ master mystery to a story that the audience is already too smart for and anticipating. The original source material, written by Du Marier, employs many symbols that are up or left to interpretation, yet, Michell’s script and direction do not really allow audiences to come up with anything more or than than what is shown on screen, despite its idealized conception of what Rachel represents, how Philip goes about dealing with the issues he is facing in his life, and a story of female empowerment.I will not lie, I found myself dreading writing this review for the simple fact that this film is one where many woman would find liberating. I have to come out and say that, I am by no means a man who discredits or belittles the opinions of women, in fact, I believe in the very real action that respect and equally needs to be taken more seriously for men and women."
    },
    {
      "rating": "7",
      "text": "I enjoyed this engrossing Roger Michell adaptation of the classic Daphne du Maurier novel whose main weakness was uneven acting. Rachel Weisz, Simon Russell Beale, and Iaian Glen were wonderful, but unfortunately Sam Claflin and Holliday Grainger, although both good-looking, were far less interesting to watch or care about. Weisz was great at keeping me guessing with an occasional look or tone of voice about whether she was innocent or an evil fortune hunter, which was important to the original novel and to the film, but Claflin was nice-looking but bland and didn’t make me care very much about Philip or what happened to him, so a lot of the dramatic tension was lost."
    },
    {
      "rating": "8",
      "text": "A damn good costume drama based on novel by Daphne du Maurier published in 1951. It’s the third big screen adaptation so far – this time from the creative mind of Roger Mitchell, the director still best known for 1999’s romantic comedy „Notting Hill“.Mitchell felt so sure of his classic adapating abilities that he also wrote the screenplay which he hasn’t tried before (at least it’s the man’s first writing credit in IMDb). And the double job is well done, too, the movie feels exemplary and enjoyable in every aspect.So, about the mysterious Rachel, played by Rachel Weisz following in Olivia de Havilland’s and Geraldine Chaplin’s footsteps. A fine woman can drive men wild, and all the more so in the world of 19th century rich Englishmen who are used to getting all the fine things they desire.Philip (Sam Claflin) dislikes her at first, believing she is responsible for his guardian’s and best friend’s death whom she was married to. But the radiant widow wins him over in no time, the boy falls hard for her, and then we can only hope to figure out what Rachel is really after. Also playing: Iain Glen, Holliday Grainger, Pierfrancesco Favino et al.If you ask me, a quality costume drama needs to look beautiful and offer good acting above all else, and „My Cousin Rachel“ delivers both in abundance.The visual side is noticeably good-looking without trying to steal the attention from actors or story – all the English countryside almost feels like an important character in its own right. And the cast plays superbly, the central place belonging to Sam Claflin whose competent and nuanceful performance is a joy to witness and carries the story well.Until Rachel enters, of course – Weisz has so much elegance, flame and sheer physical presence that it’s easy to buy her as a mystery woman winning people over instantly wherever she goes.Her character is supposed to intrigue and make us question her true motives till the end, which could easily turn the result into a mediocre B-thriller with lesser actress involved. But Weisz stays classy, natural, and charming however the story twists and turns and depicts the character.In conclusion, I have nothing bad to say about the movie. It’s not always perfect, some developments could have been played out to offer emotional impact, and the final chapter of the story feels perhaps rushed.But I really liked everything the makers did with the material, and I especially applaud the choice to stay subtle and not turn the dramatics up to 11 just because they could have.For example, there’s no „epic“ finale or steamy sensual scenes just to win over some more of that mainstream public. Not that the result isn't sensual."
    },
    {
      "rating": "3",
      "text": "Like sequels, very seldom is a remake of a movie ever as good or, less seldom, ever better and \"My Cousin Rachel\" certainly isn't as good as the original which was made in 1954 and featured Richard Burton in his first American movie earning an Oscar nomination for his role as Philip Ashley. Philip is an orphan and adopted by his cousin, Ambrose, who becomes the father he never knew.Ambrose goes to Italy because of his health where he meets, falls in love and marries Rachel. He writes Philip praising Rachel until suddenly his letters get darker fearing that she is scheming to kill him. Philip races off to Italy but by the time he gets there Ambrose has died and Rachel is gone. He swears vengeance and her and returns to the estate in England that he will soon inherit on his 25th birthday.When Rachel eventually shows up at his door his vengeance turns first into puppy love and then a love so deep, so blind, he decides to turn his inheritance, the estate and jewels, over to her at the stroke of midnight on his birthday. It is then that Philip starts to get sick and as Rachel makes him a special brew of tea he gets even sicker.The question asked at the beginning of the film is \"Did she? Didn't she? Who's to blame?\". During the film the questions become whether she is just a strong woman at the wrong time and place--the 1830s in England--or a dangerous, bewitching woman who goes after what she wants no matter what sinister behavior it involves?Sam Claflin, as Philip, is no Richard Burton and gives the weakest performance in the movie. Rachel Weisz, as Rachel, is a good enough actress that you don't know who she really is and what she wants.The supporting cast, as in many English movies, is strong but the director-writer Roger Michell who based the film on the novel by Daphne du Maurier, brings it into today's world of film by having a sex scene, referring to one of the male characters as 'being more interested in boys than girls\", having the male lead showing a bare backside and doesn't make the love story more interesting or the suspense, mystery scenes more suspenseful and mysterious.The bottom line is I really didn't care if she did it or didn't do it!"
    },
    {
      "rating": "5",
      "text": "This film is a bit of a noble failure complete with beautiful Cornish landscapes, costumes, and nineteenth-century period sets. Cousin Rachel, played by Rachel Weisz, follows a traditional thriller plot based on the black widow theme. Did she or didn’t she poison her husband Ambrose, whose young cousin Philip loved him like a father? Ambrose, a wealthy English landowner, is sent off to the warmer climes of Italy to recover from what would appear to be a respiratory ailment. A man who never had much time for women, he falls madly in love with a widow named Rachel, whose sweetness and kindness is raved about in letters to Philip (Sam Claflin) back in England.  To the family’s surprise, Ambrose marries Rachel in Florence; however, he never makes it home with his new wife because he falls fatally ill with a tumor that affects his brain, making him paranoid and hallucinogenic. His letters now rant about the evil wife who is trying to kill him with her “bitter brew,” the homemade herbal teas she concocts in an attempt to nurse him.Ambrose dies and his estate is in trust until Philip, his heir, turns 25. As the widowed wife, Rachel should have been made heir, but Ambrose’s last will was never signed. Philip goes to Italy to settle the estate, just missing Rachel, who took off after the funeral. He already hates her, convinced that she is sinister and deadly—a woman who married his cousin for his money and, according to Ambrose’s last letters, perhaps helped to dispatch him at the end. Amid this cloud of suspicion, Rachel finally comes to England to visit her late husband’s estate and family. Philip dreads meeting his wicked cousin, stays out late on the day of her arrival, and orders the servants not to feed her until he comes home no matter how hungry she is.And then he meets her. Rachel finally enters the story. She is stately, undeniably beautiful, and oddly sanguine. How does Philip confront her? He immediately falls in love and wants first to give her the family jewels to compensate her for the loss of her legacy, and then shockingly decides to hand over the entire estate to her on his twenty-fifth birthday. Rachel flies into insulted anger over the jewels but, in a paradoxical twist, accepts the estate with equanimity. Philip’s about-face is never fully explicated, except that he curiously finds her to be irresistible and even longs to marry her. Unlikely, given he is barely 25 in the story, and Weisz is playing 40ish; considering the culture of the period, she is too old for him. Weisz has to play a woman who is enigmatic, mysterious, and unknowable, sometimes appearing strangely secretive and malevolent, but at other times cheerful, sunny, and innocuous. Weisz nails the enigmatic part but struggles to switch over to the more lighthearted innocence of the alternate persona.  Philip is young, romantic, and  impressionable. Claflin is believable in the role but the script does not clarify the psychological complexity of his character, which makes his impetuous decisions look absurd. The action is slow. As for the question, did she or didn’t she?, the finale does not leave the question as open-ended as is suggested by Philip’s voiceover narration. The ending resolves the issue in a fashion that is swift and abrupt, and having failed overall to hold the viewer’s interest, the film is disappointing."
    },
    {
      "rating": "5",
      "text": "Beautiful cinematography.  Great costumes.  Acceptable acting.  Slow and boring story. You'll sit there waiting for some drama.  You'll waiting for something to happen.  You wait for some interesting dialog. It will end this way.  \"Rachel my torment.\""
    },
    {
      "rating": "6",
      "text": "A mystery woman from Italy!It is a spectacular film by its wonderful costume displays and fantastic performances. Along with they have shot the entire film in the great locations. I think that's it, that's the film. The story wise, nothing impressive. Might have been one of the best tales in the old days, though at present, we've lots of similar ones and I had seen many films with the same story structure too.Based on the book of the same name and the second film adaptation. The story of an orphan boy who was adopted by his cousin and passed all his wealth to him. Then one day on the edge of his 25th birthday, he meets his cousin's cousin from Italy, Rachel. Her visit changes his life, but it was something more than he has thought of. What is it and how the story ends comes in the later parts.It was a thorough show by none other than Sam Claflin and Rachel Weisz. The story, the scenes were predictable. I had never heard this tale before, so that was a relief, particularly about the end. Even though it was not the best conclusion. In my opinion, it is an okay film. Maybe one time watchable film for decently made. Overall, an average adaptation/remake.6/10"
    },
    {
      "rating": "4",
      "text": "No technical aspects, no major aspects are helping My Cousin Rachel. Why?My Cousin RachelThe writer and director Roger Michell's adaptation of the ironical cynicism is not the joke that they were looking for. That we are looking for. That the author of the novel looked for. Every breath of the film wants to be witty in its tone and sharply confident in its language. The ironic taste in the story then comes alive in the film when the film doesn't feel at all like it should have. Intention is one thing and interpretation, another. The film hangs around between these two phenomenons trying to defy the logistics placed by themselves.Remember, irony is what's needed and what's going to work. Contradiction is a sign of failure. Yet, with all the hokum we see nowadays in cinema, I'd be happy to take this mistake. And it is because at least it aspires to be considered among those elite group. And so what if it is found at the bottom of the list. The attempt is admirable. And also they have got the incredible casting for this period set piece. Rachel Weisz playing the title role is every reason to not speculate her intentions.I don't think I'd have bought anyone else's sweetness or friendly nature if it was not for Rachel's body language. My Cousin Rachel has everything misplaced in an ordered world. Or at least a world that seeks and requires order. Correction is a latter argument that we are going to be tangled in, the first and foremost is privacy and rights. Earning those things is Rachel vividly expressing her vague plans. She has to hesitate and deliberately make mistakes, she has got that part figured lickety split. The supporting character is where the film grows weak especially when it is supporting to an extent that it is almost a parallel role."
    },
    {
      "rating": "6",
      "text": "In the beginning i saw a big potential, but then it has become a boring a little bit, but they redeemed themselves in the ending."
    },
    {
      "rating": "9",
      "text": "Watch My Cousin Rachel Full Movies Online Free HD Watch here --> http://4k.useehd.us/movie/413998/my-cousin-rachel.html.Watch here --> https://ifsanmovies.cf/movie/413998/my-cousin-rachel.html"
    },
    {
      "rating": "7",
      "text": "This is quite an atmospheric film - it has a slow, winding plot but the characters are certainly intriguing and I liked the posh settings, with period costumes and some slightly lavish furniture/interiors shown. I liked the mystery element to it as well. There is quite a bit of hushed dialogue, which may cause an issue for viewers who are hard of hearing perhaps? so that's probably worth mentioning. Its also true that there are scenes where the opposite is true - raised, shouty voices too. There is certainly an element of melodrama present at times. Rachel Weisz does well in her role but I'm not sure I was entirely convinced with Sam Clafin as the main male character, Philip. I wasn't surprised to find this film is based on a novel - it has the feel of a book about it (if that makes any sense) and not in a bad way. I wouldn't say its an especially memorable film and the incidental music felt perhaps a little overbearing at times, plus it won't interest people keen on fast paced films but that aside, I'd recommend it for the settings and characters, I suppose, just don't expect too much. It didn't entirely hit the note (as it were) for me but its not an awful film either."
    }
  ]
}