{"id": 4508, "title": "My Girl", "starring": ["Macaulay Culkin", "Anna Chlumsky"], "runtime": 103, "genre": ["Comedy", "Drama"], "description": "Vada Sultenfuss is obsessed with death. Her mother is dead, and her father runs a funeral parlor. She is also in love with her English teacher, and joins a poetry class over the summer just to impress him. Thomas J., her best friend, is \"allergic to everything\", and sticks with Vada despite her hangups. When Vada's father hires Shelly, and begins to fall for her, things take a turn to the worse...", "releaseYear": "1991", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/qyJJNHteA7BUwQSey05t7qP4vRV.jpg", "categories": {"plot": 6.25, "acting": 9.25, "ending": 10.0, "soundtrack": 10.0, "cinematography": 10.0, "familyFriendly": 8.0, "funny": 9.5, "action": 5.0}, "reviews": [{"rating": "7", "text": "Es una película muy bonita y enternecedora; la trama es sentimental, las actuaciones de los niños son excelentes y la música es muy buena; es una buena película que lamentablemente está muy olvidada."}, {"rating": "10", "text": "----------------------------------9.9/10-----------------------------------"}, {"rating": "10", "text": "... and I am truly sorry it took me so long to see it. It really is as good as the other reviewers say. It is everything the film promised to be, and these were the reasons why I loved other movies like Stand By Me so much. My Girl is beautiful, it is charming and it is poignant. I have been prone to cry in movies like the Elephant Man, Fearless, Camille and Stand By Me, not to mention and you'll probably think me weird Harry Potter 6. Here, especially the ending I bawled like a baby, and I am not afraid to admit that. But what struck me most was the innocence of My Girl. The scenes with the two children are some of the most charming scenes in any film I have seen. The cinematography is beautiful and the scenery is breathtaking. The direction is next to faultless, and the screenplay has a sense of subtlety and poignancy. The film's length is perfect, and the romance between Harry and Shelley wasn't cloying at all. The music is truly beautiful, and brings warmth and beauty to the proceedings. The performances were truly professional, with charming low-key performances from Jamie Lee Curtis and Dan Aykroyd and Anna Chlumsky is wholly believable in a more complex child performance than one would expect from her. And Macaulay Culkin was so cute here, even cuter than he was in the Home Alone movies. The film also has a sweet heart warming story, that avoids becoming overly sentimental. I really hate how under appreciated this gem is. It isn't the best movie ever made, but it doesn't try to be. It is essentially a charming and poignant film, that I think critics have misunderstood in the past. It is more than a bittersweet kids movie, it is simply a pleasant little gem. 10/10 Bethany Cox"}, {"rating": "9", "text": "My Girl has a unique premise about a father and daughter who live and work in a funeral home. The father becomes too preoccupied in his work and neglects his daughter, Vada. Having grown up in a funeral home with death all around her all the time, Vada forms a twisted perspective on death and is at odds with her father. She finds comfort in spending time with her best friend Thomas. These two kids are great in the movie and really remind you of how special childhood is. The movie is filled with some good laughs and lots of emotional scenes that may tear you up."}, {"rating": "5", "text": "I know that some people will consider my qualification unfair but I have my justification: the plot remains to be due when it comes to provoking empathy in the viewer, the characters lack grace and the development of the plot feels slow and bland. With good reason Macaulay Culkin could not with the weight of fame."}, {"rating": "10", "text": "A wonderful and truly moving experience\"My Girl\" is one of those small treasures that, on outward appearance, seems like something it is not. Any general synopsis of the film would lead most people (including myself) to excuse the film as a dine-a-dozen coming-of-age drama with first kisses, raging hormones, and middle school bullies.The truth is, \"My Girl\" has all of those elements (except for the latter; the film takes place during summertime). It isn't the most original story, and it doesn't try to be a masterpiece. Its goal is to entertain the younger viewer and to remind the older viewer of the nostalgic days of innocence and the heartbreaking first encounters with the loss of it.Summer, 1972. Vada Sultenfuss (Anna Chlumsky) is a plucky 11-year-old who spends her summer days with her best pal, Thomas J. (Macaulay Culkin, who is far better here than anything else he's ever done). She dotes on her father, Harry (Dan Aykroid), who works as an in-house mortician. Subsequently, the Sultenfuss house (a grand old Victorian, naturally) is filled with the stench of death, made only worse by Vada's grandmother (Ann Nelson) whose only way of communicating is through her sporadic breaks into popular songs from the 1940s. It's only natural that Vada is also a hypochondriac who often believes she is dying.This is, of course, the summer that Vada grows up. Signs of change first begin when a new woman shows up. Her name is Shelly De Voto (Jamie Lee Curtis), and she works as a makeup artist for the dead bodies. At first she is discouraged by the fact that her clientele are deceased, but when sees that Harry and Vada need an outlet, she gladly takes the job (`They're dead. All they have are their looks,' she cheerfully gleams.) Vada likes Shelly, but when she sees that Harry has developed a crush on her, she feels threatened. She does not want Shelley to take the place of her late mother, who died two days after Vada was born. Her only outlet is Thomas J., with whom she rides her bike to the lake and discusses all of the Big Issues (the meaning of life, love, death, which \u009170s TV family they'd live with.)The other momentous event of the summer is Vada developing her first crush. It isn't Thomas J. (who idolizes her), but her teacher, Mr. Bixler (Griffin Dunne). He teaches a summer writing class at the local college, and Vada enrolls. Besides being the youngest in the class, she is also the only one who hasn't been taken over by 1970s psychedelia (one day, the class takes part in a group meditation.)The strength of \"My Girl\" isn't its story, but its little nuances of innocent bliss. Vada willingly shows a group of glowing boys a dead body. As the ride their bikes, Vada and Thomas J. sing `The Name Game'. When writing poems `from the soul', Vada writes an ode to ice cream. The relationship between Harry and Shelly is sweet, too. Before their first date, Harry's womanizing brother points out that since Harry's last date, a sexual revolution has occurred. Of course, Shelly only desires a proper and old-fashioned gentleman, which very much complicates their first date.Well, I loved this film. As a viewer, I try to watch for inconsistencies in the performances and the script, but this film had none. Dan Aykroid and Jamie Lee Curtis bring a low-key charm to their roles. Both have their flaws, and it sometimes seems they have nothing in common. But for some inexplicable reason, they are brought together and their encounters are tactful, witty, and very real.As for Anna Chlumsky, it can only be said that this young actress sets the standard for all child performances. This is not a performance, in a traditional manner; she eludes all cutesy standards of the traditional child performance, and becomes a complex, multi-dimensional person with true needs. This little girl is extremely intelligent, and when Chlumsky delivers lines beyond her years, she doesn't do it with sarcasm or adorability, but with the oblivious nature that 11-year-olds find themselves in. The world may be changing around her, but she tries her hardest to maintain her sanity and cheerfulness.Though \"My Girl\" is advertised as a kid's film, and kids would probably like it, this film is for adults. It isn't always a happy film, and there is a major tragedy toward the end of the film. But rather than sentimentalize, the tragedy serves as a bridge for young Vada in between the realms of innocence and childhood and the real world of loss and sadness. And as dark as \"My Girl\" may sometimes be, there is always a sense of charm and warmth brought to the screen by the characters. This is a wonderful, wonderful film."}], "recommendations": ["the_princess_diaries", "stand_by_me_doraemon_2", "about_a_boy", "young_adult", "the_bridges_of_madison_county", "endless_love", "the_glass_castle", "adore", "lady_bird", "gifted", "sabrina", "minari", "lion", "monte_carlo", "leave_no_trace", "disobedience", "the_perks_of_being_a_wallflower", "home_again", "call_me_by_your_name", "the_florida_project", "the_age_of_adaline", "captain_fantastic", "dead_poets_society", "13_going_on_30", "the_spectacular_now"]}