{"id": 2591, "title": "My Little Pony: Equestria Girls - Rainbow Rocks", "starring": ["Tara Strong", "Ashleigh Ball"], "runtime": 75, "genre": ["Family", "Animation", "Music"], "description": "Music rules and rainbows rock as Twilight Sparkle and pals compete for the top spot in the Canterlot High \"Mane Event\" talent show. The girls must rock their way to the top, and outshine rival Adagio Dazzle and her band The Dazzlings, to restore harmony back to Canterlot High.", "releaseYear": "2014", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/xcSrR4HXHsFXqjAg8nY7y6JMAG4.jpg", "categories": {"plot": 8.083333333333334, "acting": 7.375, "ending": 9.0, "soundtrack": 8.0, "cinematography": 10.0, "familyFriendly": 9.0, "funny": 9.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "I enjoy it very much,not everything related  with ponys and friendship is just for girls and child,very nice movie,the songs are simple adorable,the characters are nice,the film is enjoyable for all the ages."}, {"rating": "10", "text": "The best movie from Equestria Girls movies. The villains Adagio,Sonata and Aria are the best part of the movie."}, {"rating": "10", "text": "The addition of mermaids and the sequel to Equestria Girls, I was fascinated. Well, really a repentant Sunset and with the opportunity to correct her mistakes, it is something unique to see. The final battle likes more, and well, the post credits scene is enough to know that there will be more of this movie. I liked it and when I saw it on Discovery Kids, I was homesick remembering now."}, {"rating": "8", "text": "Rainbow Rocks is better than it has any right to be. Yes, it is a film for little girls and isn't Shakespeare, but it sets it self apart from other girls films by trying harder.The film contains strong lines and characterization. A good choice from the writers was to have the focus on the reformed villain from the last film Sunset Shimmer helping the others and dealing with her own past and self-doubt. You care a little more about her and the main cast than you think you would.Nice animation for a made-for-video budget. I was especially taken away the by the opening and end credits. Seriously, they're really eye-catching.The songs are stronger than the last film but still nothing to write home to mom about. They're decent but not memorable."}, {"rating": "10", "text": "My Little Pony: Equestria Girls - Rainbow Rocks blows the first movie in the direct-to-video series out of the water with its sharp wit, hilarious humor, and a plot that has a lesson young and old alike can learn from. And the soundtrack is absolutely fantastic, with composition by Daniel Ingram.\r Without giving away any of the story or plot, I must say that it is VERY complex for a \"little girls\" video. I think if I were an 8 year old girl I'd have a pretty hard time following the plot for most of the show, although as an adult I had no issue with it. It's simply another example of how amazing the script-writing is: it feels like a blockbuster Hollywood film the way it flows.\r The animation is also far superior than what we have seen in the latest season of My Little Pony: Friendship is Magic and My Little Pony: Equestria Girls. New facial animations add a bigger variety of expressions, and advanced manipulation of the Flash engine creates at times an almost 3D effect which is truly compelling. While die-hard fans of the show and first movie may be put off at first by the very-different animation style, it is definitely an improvement and I'm excited to see what Season 5 is going to include.\r The music deserves its own paragraph for sure! Daniel Ingram has outdone himself once again, composing an deceivingly simple soundtrack comprised of complex harmonies, and does an excellent job of combining genres into each song. From Pop and Rock 'n Roll to Trance and A Capella, there is a little bit of everything in the movie. I've said it many times and I'll say it again: without Daniel Ingram's brilliant songwriting My Little Pony: Friendship is Magic would not be the popular sensation it is today.\r For statistical purposes, I am a 20 year old Music Major at Cabrillo Community College in Aptos, California. My emphasis is in Voice and Music Education. I  am also a hobbyist PC gamer, FCC Licensed General-class Amateur Radio operator, pianist, and a member of the Church of Jesus Christ of Latter-day Saints. Oh yeah, and I'm also a Brony."}, {"rating": "10", "text": "First thing I have to mention is the over the top great soundtrack, the music from the first movie was ok but not that smashing.\rWhe I compare Rainbow Rocks to the first Equestria girls movie it´s a 100% improvement.\rThe charakters are well written, the villains were beliveable, even the pace of this movie was much better than the first one. Of course the voice acting is top notch like the TV show, the new voices are also well choosen. (I simply love Sonatas voice and her sillyness)\rThe story is a little bit generic but still decent, kids and their parents will definitly enjoy this movie.\rThis set´s the hopes for the third movie pretty high, but I think DHX will not dissapoint anyone."}, {"rating": "10", "text": "Equestria girls 2 sets the bar for childrens movies in my opinion, it had wonderful pacing, humor, characters, villains, and animation, the villains were diverse and unique, the characters all shined and were a blast to watch, the humor was Very funny, but didnt get in the way, it ran smoothly the whole time, amazing music, amazing climax, and amazing animation with little to no flaws make this a 10/10 movie for me."}, {"rating": "10", "text": "The movie is pretty cool for all ages. I am 18 and I admired when I wached the movie, even the second time.(Yep, I watched the two sessions in a row.) It went in one breath. Songs are simply adorable. Some of them needs extended versions. Dj PON3 should have voice. Hasbro may offer Nowacking to take part in voice acting. She is non official voice of Vinyl Scratch."}, {"rating": "8", "text": "A rather pleasant film. The characters are all likable and don't feel like two-dimensional cut-outs. The animation is rather slick especially in the sequence where they rip off Scott Pilgrim (people who have seen the film will know what I mean). The plot isn't absolutely stellar but it's good and has it's certain moments. My favourite part is Sunset Shimmer hanging around with the humane six despite being shunned by the rest of the school. It was a rather nice piece of character development. The comedy and references are great too and no jokes miss the mark. There are only two downsides. One is that the music isn't that good. Some songs are OK but mostly I just skip over them. The other is that there was a sequence where DJ PON3 saved the gang from falling through a trapdoor. It felt to me like a bit of a Deus Ex Machina. But then again, they wouldn't have gotten out any other way. Other than that, this is an all-round good movie with an adorable ending."}, {"rating": "10", "text": "Ok for starters Rainbow Rocks was the best Equestria Girl Movie in the whole series the reason is the Villain like omg Adagio is really good in fact she maybe the best Villain in MLP and for a good reason like you never know what she up to when you first meet her she really smart,she plans really carefully, her Character is awesome and what ever she sings my god she does it good other than that it pretty good like the songs were all awesome like my god there really nailed it with this movie and I hope that they bring another villain like Adagio or in fact just bring her back she has a really good backstory and lore bring her back please!"}, {"rating": "0", "text": "Horrible movie. Plot is worthless, The characters will make you deaf and if not they are super cringe worthy, It honestly feels like a glorified 1950s toys r us ad, and the soundtrack is a -10/10 and the writing is even worse, for example Movie: Magic Magic Magic Satan, Me: SHUT UP!!!!AND THE PACING IS HORRIBLE EVERYONE IS SCREAMING 24/7 365 UNTIL THE END, My only pluses is sunset shimmer , and that is has good morals, still though easily one of the worst kids movies of all time."}, {"rating": "6", "text": "This is normal serial, i recomended of watch. Twilight Sparkl cute, characters very nice."}, {"rating": "1", "text": "this movie is worse than the first MLP Equestria Girls! i just hate my little pony!"}, {"rating": "7", "text": "While it doesn't reach the heights of the show, it clearly is an improvement over its predecesor. The characters are more fleshed out and their conflict is actually believable and essential to the overall story. But without a doubt, Sunset Shimmer steals the spotlight with her simple yet effective redemption arc. The animation is way more expressive and appealing as well. As for the songs, they are more memorable than the ones in the previous movie."}, {"rating": "8", "text": "There are many cartoons for children, and some for teens. About this movie, many adults like this one."}, {"rating": "10", "text": "Great movie, great story, great music. They also did a great job on making me hate the antagonists."}], "recommendations": ["trolls", "rio_2", "rio", "strange_magic", "the_lego_movie_2_the_second_part", "sing_2", "bolt", "the_croods", "vivo", "my_little_pony_the_movie", "ice_age_the_meltdown", "ferdinand", "frozen_ii", "cruella", "over_the_moon", "moana", "rise_of_the_guardians", "winnie_the_pooh_blood_and_honey", "the_secret_life_of_pets_2", "happy_feet_two", "how_to_train_your_dragon_2", "the_tale_of_despereaux", "my_little_pony_a_new_generation", "spies_in_disguise", "rock_dog_2_rock_around_the_park"]}