{
  "id": 4526,
  "title": "My Little Pony: Equestria Girls - Forgotten Friendship",
  "starring": [
    "Ashleigh Ball",
    "Andrea Libman"
  ],
  "runtime": 44,
  "genre": [
    "Animation",
    "Family",
    "Fantasy"
  ],
  "description": "The story follows Sunset Shimmer, who (using her powers) finds out that her friends' memories of her have been mysteriously erased, resulting in them getting amnesia. Determined to set things straight, she'll need Princess Twilight's help from Equestria in order to find out the source of what caused her friends' memory loss.",
  "releaseYear": "2018",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dY7pdaPfbTnJnfnZBjRFprgRuUn.jpg",
  "categories": {
    "plot": 7.111111111111111,
    "acting": 6.5,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.8,
    "funny": 5.6,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Yes, it isn't quite as good as the show. Still, that shouldn't be held against the movie. This spinoff still maintains the MLP franchise's tendency to go beyond the stereotypicalness and obviousness of other girls shows and films. Yeah, the high school format is predictable, but there is something about a pony in a human's body and a battle with a monster at the end that shakes things up some. Dialogue is on point and there are some funny bits. The songs are all forgettable though, I'll give you that."
    },
    {
      "rating": "10",
      "text": "\"Equestria girls\" maybe isn't great as the other EG movies but it's so nice and entertaining because is the first time when you see your favorites ponies in a human form. The songs are great and Sunset Shimmer's transformation it's amazing. Sunset is one of the best villains of this franchise."
    },
    {
      "rating": "7",
      "text": "This movie is pretty good. It’s like the My little pony movie, but better. The reason why this movie is better is that my favorite character gets more screen time on a movie that’s 70 minutes. That’s a good thing and it will always be a good thing."
    },
    {
      "rating": "10",
      "text": "Equestria Girls was a surprise to everyone when it was released, because now the ponies turn human, as if it were dimensional travel. Well, at least we have more of this saga. I enjoyed the movie and when it was released on Discovery Kids, I still remember it. What I say is nostalgia."
    },
    {
      "rating": "1",
      "text": "Equestria Girls has came from a show called my little pony and this little show has made a massive fandom with creative minds from music, art and animations, even i got drawn into the show because of its creative ideas, i think that's why so many boys and girls like the show because of the creativity in its core, anyway on to this movie the reason i rated it s low is because they have lost all of there creativity and done what all girl shows do these days that is going to school (and yes i know its a girls show but they have taken a lot of steps back in to the creative corner) what i don't get there adults in there pony life's they have houses of there own and they also work so why have they suddenly became teens also though out the film i was always wondering why doesn't she just steal the crown back she knows this Celestia isn't her princess and that its for the best if it was stolen back because sunset shimmer has done it already this could of made the film much more interesting seeing her plotting and making shore no one finds out what shes doing then escape but there's much more that could be added and its not like shes living miles away shes in the school library she could of i don't know sneaked around a little they could of brought comedy into it like they did in the show when she sneaks around in the castle, and the main thing im annoyed about is that they made shorter episodes that was more exciting to watch than this whole film was my example is the discord episode there was so much going on in this episode that was great to watch you just wanted to know whats next all the time the film lacks this and so much more from the show if they make another film people keep humans out of it because the writing then goes down a really steep hill"
    },
    {
      "rating": "7",
      "text": "Well, this movie was...interesting. At first I was extremely sceptical. I mean: Ponies turn into real humans? That is weird. But after I've seen it, I have to say: It's not that bad. I'm going to split my rating in some parts.\r PLOT\rYes, the plot...not really amazing: Sunset Shimmer steals Element of Magic, flees into \"real World\", Twilight follows her, meets her friends' human versions....rest is spoilers  It's okay, but not really good.\r Animation/Style\rA negative point. Animation is good as always BUT: Humans are not supposed to have purple/pink/orange/etc. skin! This is just weird! I understand that they wanted to show the characters as humans but not like that...\r Songs\rThe songs are okay. I will list them in order:\rTitle Song Remix: Ewwww...worst thing I've ever heard! This is so bad!\rThis Strange World: It's okay...not really good, but not bad\rTime to come together: best one(in my opinion)...still not that good\rThis is our big night: Way to girly...MlP:FiM never did that before so it was kind of weird\rA Friend for life: it is kind of bad\r Characters\rThe human version of the characters are exactly like the normal versions so that's cool.\r Humor\rIt actually is funny. It does some jokes that were done in the first season again and brings back memories. But it also manages to make a lot of new ones. And, sam thing as in the show: Almost everytime Pinkie Pie talks, it's funny as hell!\r Conclusion\rA movie that is quite okay but it cannot keep up with the high-quality of the TV-Show. It's main problem is(for me) that it is, at certain parts, too girly. Lauren Faust(creator of the TV-Show) stated that she didn't want to create a stereotypical girl show but something everyone can watch. Equestria Girls picks up some of the girl-movie stereotypes(Lauren Faust was not involved in the movie)\rI normally would give it a 6 but because it's My Little Pony I'll raise my rating by ONE WHOLE POINT! WOW! THAT'S SO MUCH!"
    },
    {
      "rating": "5",
      "text": "I love show, but i think that humanized versions looks akward... but if you are Brony or Pegasister, you should watch. Is touching, funny and i like how they remixed theme!"
    },
    {
      "rating": "9",
      "text": "I kept hearing lots of good inputs but also bad inputs on this movie. I figured, I'm already a brony, might as well try this out. I must say, it was better than I originally thought, but it's still not perfect. While the movie overall was good, it lacked length a bit more story development. But let's face it, it's a My Little Pony movie. It was intended for kids.... mostly... So I'll go ahead and give this movie a 9/10. It was simple, but overall fairly entertaining."
    },
    {
      "rating": "8",
      "text": "Pony. Pony pony pony. Pony to the pony. Pony pony. Pony up the pony.\r P-p-p-Pony.\r Pony?\r PONY!\r By the pony. For the pony. And thus, pony, pony pony.\r Pony me. Pony you. We pony.\r Pony,\r The ponies."
    },
    {
      "rating": "7",
      "text": "Not bad. I expected a poor and boring movie for little girls but this is a overall not bad movie. Etertaining if you wanna watch a cartoon movie and you liked My Little Pony."
    },
    {
      "rating": "6",
      "text": "Honestly I don't know what to think of this movie, in a sense I did find it entertaining in a way but...why? I love the show as it is, with it's educational lessons, good animation, great writing, flaws, and all. I appreciate what the show has given to me and to other people (you know who I'm talking about). Now I'm not really the smartest person in the world...Canada, but I really wonder why the writers went down this road and who asked for them to take it? In a sense I really felt they've missed a lot of good opportunities with this idea, I felt they could of pushed the whole  Twilight coming to our world to find some crown  plot thing even better instead of the high school crap that EVERY kids show would taking place in, it's really unnecessary for for kids too... in fact what did the kids learn from this? It doesn't teach kids about high school, it focused on Twilight succeeding in her mission, & that  excuse of a climax is really whimsically unfitting and cliched and just made me face-palmed myself in grief. To make things worst for this movie is that Lauren Faust (the shows creator) hated watching it, why? Because it's everything the show is not and she felt offended by this decision.  But there are things in the movie that can help you enjoy the movie better then it is. Like that one song \"Helping Twilight Win The Crown\"...oops. So yeah the movie to me is a hit and miss. Lost opportunities but an enjoyable movie for both fans and children. To me this is rated 3.5 Elements of Harmony/6. But for this site I'll rate it a 5.. maybe a 6. XD"
    },
    {
      "rating": "10",
      "text": "Last Winter the first images of Equestria Girls were revealed. I was not pleased at first, but as the spring came I was more hyped by seeing the trailers. Alicorn Twilight ends up in a human World after chasing the unicorn villain Sunset Shimmer. Twilight and her friends are humans in this version. Now it's up to Twilight to win her crown back. There are many so many highlights. You don't have to be a hardcore Brony like me to watch this movie. Here is something for everyone like light pop songs, focus on a high school bully that turns into a succubus, a soccer match and lots of shout outs. Derpy shows up at the end. It's no 12 times Oscar nom winner, but a lighthearted fantasy. If only Lyra had a bigger role."
    },
    {
      "rating": "9",
      "text": "Equestria Girls is a brilliant, if unorthodox, silver screen adaptation of the My Little Pony cartoon. As the movie retells the story of the Elements of Harmony from the TV series, the movie reflects the series also reflects the show in another way: It's a perfect example of the elements of a good cartoon. It's funny, it has its dramatic moments, it's entertaining and above all it appeals to all ages, which is a thing the show did without really trying. Perhaps the same could be said of the movie.\r Some of the plot points are a little predictable, but aside from that there isn't really anything bad about this movie. Some plot elements mmay seem a little dark for a child audience, however this isn't really a big deal as the movie seems to be aimed at slightly older girls, dealing with typical high-school problems, which also makes it an excellent movie for children who still watch the show, but are just leaving its target demographic.\r In short, if you're looking for a great movie that the while family will enjoy, Equestria Girls hits the mark perfectly. It's nicely glazed with the girly elements that will appeal to the original target audience of younger girls, but also contains generous helping of drama and plot (no pun intended) to make it an enjoyable experience for the whole family."
    },
    {
      "rating": "8",
      "text": "I LOVE IT. Great storyline, great ending. I love everything about this movie, it has great songs and a great ending, I love the human portrayals of each character."
    },
    {
      "rating": "6",
      "text": "Yeah...\rThis could have been a lot better. I would rather they not humanize the show but instead elaborate on the pony side of it. And since they did humanize it, they could have used a better villain than Sunset Shimmer. I'm still waiting on Hasbro to bring back King Sombra after his tiny appearance in Season 3.\r Despite that, it was great fun. It still retains the pony spirit. The awesome remixed intro theme was awesome. If only Season four would have that as an intro..."
    },
    {
      "rating": "10",
      "text": "I have to say, I expected this movie to be complete and utter bilge, but it wasn't. Even though all the marketing and trailers (bar one) portrayed it as a mindless high school film, it was like an extended episode of the show (except, obviously with humans). I especially like \"It's time for us to come together\" but all the songs were very good as well, so kudos to Daniel Ingram. And Megan McCarthy's writing was very good as well."
    },
    {
      "rating": "6",
      "text": "When the my little pony equestrian girls trailers came along, I expected it to fail because of its change from ponies to humans, but I actually enjoyed the movie. Let me explain:It started after the last episode of my little pony friendship is magic, when Twilight became the princess of Cantalot. She went to stay in Cantalot tower. When she was sleeping in bed that night, somebody crept into her room and stole her crown, and accidentally tripped over Spike and woke Twilight up. Then Twilight chased after the pony thief until he or she jumped into a magical portal to get away. Twilight didn't enter the portal, to make sure it was safe.So she woke up the empress and everybody else, told them what had happened and asked them where the portal lead to. The empress said it lead to an alternate reality. So Twilight jumped in to search of the crown and the pony thief. Spike came along. The rest of the ponies had to stay, so  not to disturb the balance of the dimension. So, when they got to the other side, Twilight was a human and Spike was a dog. Basically, this was an alternate reality where everybody looked and acted like humans. All the characters from the My Little Pony series were there too, in human form. So Twilight decided to go to the nearest school for some unknown reason which doesn't make any sense. It seems forced, very forced. There she meet her long time friends. She also finds pony she saw, the one who stole her crown. Twilight finds out that she is using the crown to win the prom. So Twilight doesn't tell anybody that she's a pony, in case they freak out.  What happens for the rest of the movie is Twilight making a good representation of herself around the school, so she can be the prom queen and get her crown back.\r In truth, it feels like a shallow story that just tries to pat out the movie. I felt a little awkward when the story revealed all it had to offer. Why wouldn't Twilight just get Spike to threaten the pony thief into giving the crown back? It seems a lot shorter and easier way to approach it. Spike's a dog, he can bite off necks and things like that. And then  just run back through the portal before before the police gets there. They don't know what she's done in the other dimension. It's not like you need a good reputation when you're not going to live there anyway. It feels lazy.\r About the voice acting: 80% of it is done ok, though some of the side characters' performances are done quite poorly.\r So no to get to the point of how the movie doesn't fail with the changing pony to human aspect. You see, the case is that Twilight doesn't take on a random life  of another human. She's her own human. She has no parents, no-one to look after her, on her own. No one is forcing her to go to school, she does what she does, there is zero percent child racism added in here, and what happens is actually quite interesting. She doesn't care about this dimension and she never stays. She's only here for the crown. The fact that she makes friends is only for the reputation that she wants. So it succeeds with its ideas.\r So what do I think of the movie over all? It's good! Besides the weak story and some bad voice acting, it's enjoyable. That's not coming from a My Little Pony fan. If you are a fan, it might be a 7/10. So watch it, you won't regret it!"
    },
    {
      "rating": "0",
      "text": "The beginning of the end for this franchise. McCarthy and Vogel are to blame, among others."
    },
    {
      "rating": "2",
      "text": "This is the worse equestria Movie ever. Like come on this stupid but at least we have one new character that really likeable but other than that it bad just watch Rainbow Rocks it so much better"
    },
    {
      "rating": "2",
      "text": "a terrible abomination! i hate my little pony! my little pony sucks! transformers are way better!"
    },
    {
      "rating": "10",
      "text": "I understand some people think this movie is not their type. But some fans will like this also."
    },
    {
      "rating": "8",
      "text": "I really like this movie but I think it sucks but only a little bit it's pretty good otherwise"
    }
  ]
}