{
  "id": 2074,
  "title": "My Little Pony: The Movie",
  "starring": [
    "Tara Strong",
    "Ashleigh Ball"
  ],
  "runtime": 99,
  "genre": [
    "Family",
    "Animation",
    "Music",
    "Adventure",
    "Fantasy"
  ],
  "description": "A new dark force threatens Ponyville, and the Mane 6 – Twilight Sparkle, Applejack, Rainbow Dash, Pinkie Pie, Fluttershy and Rarity – embark on an unforgettable journey beyond Equestria where they meet new friends and exciting challenges on a quest to use the magic of friendship and save their home.",
  "releaseYear": "2017",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8FAkwIBnd5eGlSJBrJfJVMWAbhI.jpg",
  "categories": {
    "plot": 7.444444444444445,
    "acting": 7.58,
    "ending": 7.133333333333334,
    "soundtrack": 8.75,
    "cinematography": 8.0,
    "familyFriendly": 8.0,
    "funny": 7.642857142857143,
    "action": 7.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Movie Critics: They don't like anything that doesn't breach their pompous minds, sorry that MLP isn't Dunkirk or Baby Driver. Regardless, it's less than 10 dollars to see a movie so their job is largely meaningless in today's society other than to bully the obvious movies. They have become as predictable as the movies they watch. Even if this movie doesn't do everything right, the critics were also wrong about Rachet and Clank and Warcraft. Can't you see they just don't like when entertainment from different mediums invades the space they aren't happy with in the first place?"
    },
    {
      "rating": "6",
      "text": "As a big fan of the show, this movie was a mixed bag for me. I still love the characters and the world, a few of the new characters were memorable, and the movie actually got pretty serious and emotional at times. But I have to say, I was still kind of disappointed. I don't love the animation style because it seems to be a little sluggish, and they altered the character designs enough to be noticeable. There's also clearly an attempt to mainstream the movie a little more for people who haven't seen all 7 seasons, which is understandable, but the way they did it hurt the movie too. Because they did this movie so differently from the show, newcomers won't understand what made people love it in the first place and fans of the show will be disappointed. I also didn't like how certain supporting characters who are still important in the show don't even get 1 speaking line in the movie. And you'll probably ask yourself where some really powerful characters are while all this bad stuff is happening. But what's really distracting for me is that in order to create a challenge and add development to the characters, they do and say things that they already would have overcome previously in the show, so a lot of their actions now seem out of character. So while I do like a lot about this movie, and I still enjoyed it, it's not great and it will be disappointing to long time fans. The movie also doesn't have anything to do with what's happening in the show right now, so I'd just wait till it comes out on DVD so you don't have to sit awkwardly in a theater mostly full of kids. It's still a good movie and worth seeing at some point, despite its flaws."
    },
    {
      "rating": "6",
      "text": "The movie is fine. Just fine like the series. It isn't that funny, but it has his moments. The characters aren't great but the main one are, the animation cgi isn't good but the hand draw it is. Is a perfect ok film for the fans and bronys of the franchise"
    },
    {
      "rating": "8",
      "text": "Yeah, this film isn't a masterpiece, but it's definitely fun and should keep the children entertained.Not animated as fluidly as some films, but the bright colors and scenery design are really eye-catching. Songs range from decent to pretty good. (Especially like the villain song.)Now the film's plot isn't the tightest or most original. In order to stop a great threat, the heroes go an adventure through several places where they meet several characters. Not a a lot of time is spent on each new character and location and it does kind of draw away from the main ponies, who there are quite a few to keep track of anyway. Still, the films saves itself with all the little moments. The characters are all fun and there so many little lines and visual gags that are pretty good sprinkled throughout."
    },
    {
      "rating": "4",
      "text": "I am not a brony, but I find the show quite enjoyable. However, the film did not impress me. It's OK. The story itself was predictable, flavourless, and just not unique. I can see it has been dedicated to the franchise's fans too much, and not giving a lot to the rest of the audience, including me. It could just be easily compressed into some two-part finale for a season or something. On the upside, the jokes are acceptable, and the animation is pleasant and colourful. It's just that I was able to find ideas to make the film much more exciting within ten minutes.You may go and see it if you're a fan; you might enjoy it. Personally, it's mediocre and such a huge disappointment."
    },
    {
      "rating": "10",
      "text": "Thanks to creators the good emotions and new inspiration!All fans in my town were excited, as others too.Keep up the good work! ^_^And as always sorry for my bad English... :)"
    },
    {
      "rating": "5",
      "text": "I'm not a Brony (nor have I seen the TV show), so I saw this online because I'd feel a little embarrassed to tell anyone that I, an adult that's not a pony-fan, paid to see My Little Pony. I still saw it anyway with an open mind (loony curiosities, I guess) and it wasn't nearly as bad as I thought it would be.The animation, though simple, is very colorful and full of character. It's a real treat to the eyes (not counting the weird CGI). The songs are adequate, some characters are likeable, the pacing is quick, and its message is sweet and not obnoxiously preachy. As a whole, My Little Pony: The Movie is an decent enough afternoon watch for the whole family... but it's still quite lackluster.The story feels like an extended episode of the TV show with super-predictable elements thrown in. The attempts at humor are kinda weak, half of the songs feel like filler, the villains are one-note and it occasionally dips down in the cutesy-claptrap territory you'd expect in a pony movie. MLP the Movie doesn't really feel cynical or half-baked, but it won't grab a casual viewer's attention either due to how safe it plays. It's a kids movie, sure, but I still don't see how these ponies lured so many people into the Brony fanbase. It's mildly-entertaining, sweet, adventurous, and sometimes charming... but it's also forgettable and uninspired. Average, but I'd take this over The Emoji Movie any day! 5/10"
    },
    {
      "rating": "9",
      "text": "While I'm not a brony, I will admit that this film has a lot more to it than one may think. Very likeable characters, a catchy soundtrack, and a villain (Tempest) that isn't a plot-twist villain, and has legitimate depth.Surprising to say, but I'll definitely recommend My Little Pony: The Movie. It shows the value of friendship in a very nice way and even shows the struggles that come with it."
    },
    {
      "rating": "10",
      "text": "Exactly what i was waiting for. Movie is great, fun and has nice songs. Story is very MLP-ish, so it won't surprise you, which doesn't mean it's the same as always, it's still unique compared to series."
    },
    {
      "rating": "10",
      "text": "The Movie was really good to see. Even if you don't know the TV-show the story and also caracters was explained in a good subtle way. The songs was good and the issue was for young and old. The Artstyle was innovative and inventive advance or the series. Its the smaller details in the background that makes it to a good cartoon film. Just the scene time was short. Some emotional and tragic moments need more time  to act. A Problem that also the Show has. The biggest problem was a small climax and combination with a bad antagonist (the Storm King) But in a impressive way the Film worked without them to me. To my surprise the film worked for me because of some innovations which I misses in Hollywood production nowadays. Thats the reason to give the film 4 of 5 stars. I hope for a next film which erase the weaken points of the film."
    },
    {
      "rating": "8",
      "text": "The 'critic' score for this movie is absolute nonsense. Is the movie perfect? No, but tell me how many movies are. This film provides what many of us would want from a film based on the franchise. Colorful with great animation, superb voice acting and excellent musical accompaniment, mostly. The film does have some pacing issues, a song that I feel was pointless and a mid-film conflict that, while actually emotional, also felt out of character. If you are a fan of this franchise like I am, you will most likely enjoy this movie, because it is good and no snarky film 'critic' can change that fact."
    },
    {
      "rating": "8",
      "text": "To anyone going into this movie expecting Disney, don't get your hopes up. To those who outright hate My Little Pony or are unwilling to give it a chance, this isn't the movie for you. To everyone else this movie is at least worth a view. The artistic styling is amazing and brings the land of Equestria a much needed makeover for size and scale. The acting from the original voice cast from the show \"Friendship is Magic\" and from the celebrity talent is on par with some of the better animated films. The music is amazing and fitting, although a bit pop-heavy at times, but not as much as most of these low budget kids films that float around nowadays. I will admit there are flaws with the film. The pacing is all over the place from time to time and it seems like a lot resolves really fast, but I imagine there is some bit of studio involvement in that or stuff that wouldn't fit and was cut. Also to an outside viewer the relationship of the mane cast might not have the establishment to draw them into the more dramatic moments, but it does enough that maybe it'll draw them to the series to pad out the world and character building far beyond what the movie provides. Does that mean it doesn't work as a standalone film, no. But knowledge of the series really helps.Some of the reference were harmless, some were cringe worthy and had studio \"hoof prints\" all over them, but they didn't take away from the story. Some parents may be off-put by the level of violence that is in the film, but any child who has seen a few episode of Spongebob or the series itself will be fine. Overall I believe that even from an outsider's view point there are a few things that the movie has going for it that makes it worth at least a viewing, even if it's the only one. Much like \"Friendship is Magic\" itself, no sense in knocking it til you try it and who knows, you may have more fun than you think you will.P.S.: To those out there on the internet who have compared this to the Emoji movie or scored it less than the Emoji movie....did you watch that train-wreck of a \"movie\"?"
    },
    {
      "rating": "9",
      "text": "Both me and my family loved this movie. Yes, it was cliché, yes it was \"sappy\" at times, but it was also humorous and had plenty of entertaining moments! It's a film that both children and adults can enjoy, but non-fans of the franchise will likely be disappointed."
    },
    {
      "rating": "8",
      "text": "It was surprisingly good. Decent writing, intimidating villains, superb soundtrack, smooth and expressive animation, and some really breathtaking visuals. Quite frankly, I think just experiencing the musical numbers on the big screen is worth the price of admission. Sure, it may not be high art, and it has it's problems, but there was some real heart behind this film."
    },
    {
      "rating": "9",
      "text": "Greatness. I like how they made all the streak level up.   It helped clearly,   and it also is cool, this movie should succeed,    really!!!!"
    },
    {
      "rating": "8",
      "text": "(Spoiler-Free)[TL;DR at the very bottom of this post. You're welcome.]First off, some of you may be asking \"Why would a grown man like you watch a colourful kid's movie?\" If my [facebook] cover photo doesn't already give it away, I'm simply a Brony and I simply wanted to watch it for my absolute love for the TV show this film came from.Next, let's get to the nitty-gritty:Visuals - Very much worth the watch. This is by far the best modern 2D Animated Feature that has ever hit the big screen in years (I'm looking at you Disney and Dreamworks). Every scene was very pleasant to look at because of how marvellously-detailed the animation was thanks to the ToonBoom Animation software the animators used to make this film such a wondrous visual treat. Kudos to the animators, their hard-work was very rewarding.Sound - Even though the film has a Dolby Atmos mix, I sadly was not able to experience that in the theatre I went to simply because they do not have that setup. Other than that, the sound was very well designed, especially the catchy and adventurous soundtrack it has (thanks to Daniel Ingram for his outstanding musical abilities).Characters - We have the usual Mane 6 (plus Spike the Dragon and others of course) from the Friendship is Magic TV series as part of the main cast. Though the film definitely was more attractive with the extra supporting guest cast enhancing the movie even more so. And the roles those characters had, definitely fulfilled them really well (except for some, though I will not mention them due to the purpose of this review being spoiler-free. #sorrynotsorry).Plot - Now this is where it gets a little iffy. With the context of knowing that this is an official My Little Pony movie to ever hit theatres after the animated film of the same name back in the 1980's (and with the intended audience of not only the Brony fanbase but primarily the families with their kids), the plot was understandably mediocre and somewhat easy to predict. Don't get me wrong, however. The film is still enjoyable for all ages (no matter what the \"neigh\"-sayers will say), thanks to the appropriately-timed and clever funny moments that made us in the audience get a good laugh out of it.Moral/Lesson - I will not spoil exactly what it is, but I can tell you at a personal level, it was very relatable and I'm sure it will be relatable to everyone else, even though the mediocre plot as mentioned earlier, predictably laid it out for simplicity's sake.Final Verdict - with all of these factors in mind, I can say without a doubt, that this wonderful, modern 2D Animated Feature Film gets an 8/10. I know I might have used this score a lot in the past, but I am serious when I say that this film definitely deserved this score.TL;DR: With the factors of the Visuals, Sound, Characters, Plot and the Moral/Lesson coming together, this spectacle of a modern 2D Animated Feature Film to come on the big screen after years of absence was certainly worth the watch, even for just the stunning 2D visuals and soundtrack alone.Thank you for reading, and I hope you guys enjoy(ed) the film too. :)"
    },
    {
      "rating": "10",
      "text": "Movie Critics love to hate, their job is pointless and predictable. The movie is far from terrible and has more heart and character than most animated films these days."
    },
    {
      "rating": "8",
      "text": "The animation is reminiscent of the Disney Renaissance, the characters are likable, and the story was quite enjoyable. ...Albeit a little fast-paced. Say what you will, but I say it's a film worthy of the whole family to enjoy. It MAY be catering towards children and bronies(Which I am among the latter), but if you go into this movie with an open mind, you may end up witnessing something special. Just goes to show you that friendship IS magic."
    },
    {
      "rating": "10",
      "text": "First and foremost, the animation is spectacular. Being able to translate \"show style\" to Toonboom is great. They fixed some of the CG/3d problems from the trailers. Pacing is pretty good for the most part, ending seems a bit rushed though. The voice acting for the show cast and the new characters is pretty good as well. Emily Blunt is simply amazing as Tempest Shadow. There were some times I thought characters were out of character, but thinking about it more, some of these moments make sense. It seems as characters were introduced and established, it would be off to the next scene. What happens to these particular characters, I don't know. Regardless of these slight faults, the movie is still charming like the show and is worth a watch. Whether you're a fan of the source material, or someone who like animation, you will find some joy out of it. I mean, it's no Citizen Kane, but it's pony kino. If you've seen this once, you might want to watch again (to catch more things)."
    },
    {
      "rating": "8",
      "text": "The critics are way too harsh, as usual. While I do think that fans of the tv series will likely get more out of this film than your average movie-goer, it's a huge step ahead of studio garbage like The Emoji Movie and Boss Baby.Actual heart and soul is put into the music, animation, and characters, and it shows. The story itself was probably the weakest aspect of the film, but it's serviceable. Seeing this on the big screen is a HUGE treat for the animation alone."
    },
    {
      "rating": "10",
      "text": "I give this movie an 11/10. I believe that it is an animated feature that most audience members will enjoy.The animation was spectacular. Seriously; you can tell that the animation team spent a lot of effort into every single detail. It really shows.The characters were energetic, likable, and a lot of fun. Although I wish they would have gone more into the backstory of some characters, I still thought that the characters were all great and a real treat to watch.The music was excellent. I have to admit that I was not a fan of the pop song at the beginning of the movie or the one at the end. But the music in the movie itself was quite good and reminiscent of Disney tunes.The character designs were really nice. I personally thought that the among of detail that went into designing the characters was amazing. The designs were sleek and modern. They fit into the movie environment seamlessly.The plot was a bit basic but there were lots of laughs and fun to bee had along the way so it did not take away from my enjoyment of the film.I personally had a really good time watching this movie. I plan on watching it a few more times in theaters with my mom who has also become a fan.I would say that it is a movie that everyone should give a watch. I think fans of the MLP: Friendship Is Magic series are really going to love this film. Non-fans will like it as well, probably for different reasons the fans. But that is what makes this movie great: there really is something for everyone."
    },
    {
      "rating": "7",
      "text": "After watching the movie I could tell the critics aren't fans of the show. The movie itself was fine in my opinion.The villain (the Storm King) felt weak and had a childish personality. A big part of me thinks hasbro should have saved Tirek for this movie. Tempest had more screen time, a better personality, and a clear motivation.The mane 6 had some moments where I also wanted to mentally facepalm but I just kept telling myself this is a movie meant for kids not adults and made it easier to watch.The animation was well done and the effects were beautiful and I loved all the references as well as the many comedic moments that had me and my friends chuckling at this film. It could've been better if the movie used more characters from the show too like Discord.If you are a fan of the show you will enjoy this movie."
    },
    {
      "rating": "8",
      "text": "This is another prime example of how \"critics\" will slam any film that doesn't fit their own agenda and how they will slam a film that fans love for the sake of getting those precious clicks on their site. Don't listen to the critics, this is a movie that will entertain you if you enjoy the series. It has some low points, but overall this is a film well worth the ticket price. A shame that critics once again prove they feel the need to be the contrarians for the sake of remaining relevant. Another reminder that you should listen to the fans and not paid critics.The film is fun loving, adventurous and surprisingly grown up given the source material. Definitely going to be getting it on Bluray down the road."
    },
    {
      "rating": "3",
      "text": "I'm a fan of the series and this movie is mediocre. Fans will rate this highly out of loyalty and forget how badly and one-dimensionally this movie portrays the rich characters from the series, how nonsensical and unnecessary the  whole journey is.Even new characters, that aren't from the series and known to fans recieve bare-bones development as if the whole movie is just an excuse to sell new toy designs following the original popularity.People saying that the animation is reminiscent of classic Disney movies need to expand their horizons and see what really good animation looks like. And the same can be said about the voice actors. The whole thing is bland, soulless and forgettable. Not to mention repeating the same mistakes from the series, insisting that the princesses hold some sort of amazing power that they never use to actually do anything.Unfortunately, fans forget how fast undue praise can kill quality and how fast IP owners will treat the series and movie as advertisement rather than part of the product."
    },
    {
      "rating": "3",
      "text": "Like a dot at the end of a sentence, MLP:Movie marks the end of a legend. From revival of a show that manages to, against all odds, gather million of fans, to a movie that has no ambitions or creativity. Prepare for 90 minutes of shallow characters; generic, contrived and at times nonsensical plot; and lacking-anything-noteworthy entertainment.An utter disappointment."
    },
    {
      "rating": "7",
      "text": "A good little movie. Like a long better than average episode of the show.The biggest flaws I had with the movie was that plot and character development seemed to be from late season 4, like everything since hadn't happened, or hadn't happened yet. But apparently that is because that is when the movie was written."
    },
    {
      "rating": "0",
      "text": "Really one of the worst animated movies I've ever seen. Lot of potential for My Little Pony as a franchise but Hasbro, McCarthy, and Vogel don't seem interested in realizing that potential. Waste of time and talent."
    },
    {
      "rating": "7",
      "text": "What do all movie critics have in common? They have never made a movie. Critics are a little cult of exactly the same minded thinking. MLP delivers almost exactly what is promised. Its cute. Its fun. Its super light hearted. If you want those things go see it."
    },
    {
      "rating": "6",
      "text": "While I'm not a fan of FIM, I can honestly say that the series is really well-made. It utilizes the features that a good animated TV series needs, and I can see why it appealed to adult male and female demographics.As with the film, I was curious to see how it would turn out, so I watched and I was left rather unimpressed because the plot is so simple that I didn't find it to be unique compared to other animated films I've seen. Although, this film was still good the way it was. While I think it wasn't all that, it wasn't a bad movie at all. Many adults may feel the same way as me but kids will definitely love it. It's a very safe and harmless animated film. Critics simply just blew it out of proportion."
    },
    {
      "rating": "10",
      "text": "The Story you all have seen a Million times, but the Style and Charm the MLP Movie does the Tropes, its amazing, the movie has, in its core, the intent to make you happy, if is with Music, the Art, or the Predictable Story, also, for being animated it gains a lot of Art-Style points too, it is really a shame is not doing as well as it could have, the movie is Amazing for the First big budgeted movie in the Modern MLP universe, i really hope for more!"
    },
    {
      "rating": "9",
      "text": "While just being a fan of 2D animation for I feel we need a return of it in theaters. I didn't expect it to My Little Pony to  do this! It has  a lot of lore apparently as they just finished their Seventh season!? as of October(2017) so worried the movie won't hold up to the show? well it does, they masterfully crafted it to subtly give you inside of the characters without boring you with a entire scene of flashbacks. So anyone new to the series will feel not \"as' confused. key points-plot(minor spoiler if you watch the show) - While the story doesn't build upon the show. It instead trades furthering the plot of the show in favor for giving emphasis on the roots of the show itself. The animation has been taken a notch higher in all regards.-Music- takes the prime of this movie and they hit on the nail I feel. Superb voice truly. -length- While it felt a bit longer than it should have been it wasn't table flipping garbage.lastly- with the plot being my only true issue as the show has  a-far- more engaging plot.But I understand they focused on the person who hasn't seen the show. everything else just to me felt like the show just given far more emphasis. Which is what most who like the show -wanted- anyways."
    },
    {
      "rating": "10",
      "text": "Out of all the animated films I have seen this year this one absolutely tops the chart! My Little Pony: The Movie brings 2D Animation back to the big screen in a very colorful and refreshing way that anybody can enjoy! If you are a fan of the series you will absolutely love it and even if you're not it's a really great family fun film for all ages. Story maybe a little rushed but it's forgiven with the wonderful characters, catchy music/songs and the breathtaking animation that the MLP crew has worked so hard on. Let me make this clear, This film wasn't made for the critics...it's more for the fans of the MLP fandom and the Children. Watching this film reminded me so much of the classic Disney renaissance films I grew up with when I was a kid. Critics aren't right with all films and this is one the audience tells a much more positive outlook on it. I highly recommend this to anyone because who knows when we will get another mainstream 2D Animated film."
    },
    {
      "rating": "1",
      "text": "I was a HUGE fan of the show back in 2012. This year the leaked emails came out and revealed Hasbro didn't want Applejack in the show because she's, direct quote, a \"hick\". That takes the wind out of my sails in support of this franchise for me.Aside from that, the movie doesn't really do anything that hasn't already been done before. It attempts to world build, but that's quickly shut down. Vogel, McCarthy and the current writers strike me as clueless. I don't see how it can get much better."
    },
    {
      "rating": "4",
      "text": "If you believe the movie named the same thing from 31 years ago hadn't completely aged well as of today and you are a literal fan of the brand's modern era, there should be a reason to go see My Little Pony: The Movie. Otherwise, please go see a different movie that deserves your hard-earned money."
    },
    {
      "rating": "0",
      "text": "Really just a terrible movie. What were they thinking? I mean, really, what were they thinking? Thousands of years of lore and this is what they came up with? Shameful."
    },
    {
      "rating": "6",
      "text": "This movie is based off a 2010 television series of the same name, which itself is based off the 30+ year old Hasbro toy line. As far as the premise is concerned, it’s the common story where everything is fine in this magical land until the big villain comes to take over. Then it’s up to our main characters to go on a journey to get help in order to defeat the villain and save the day. The biggest surprise with this movie is that it isn’t like what the title implies. This isn’t necessarily a movie that only for little kids. In many respects, My Little Pony is just like a classical Disney movie. You have a big adventurous story and multiple songs. I was actually entertained by this movie and it was surprisingly a lot more emotional and violent than I thought. It’s also not as frantic and loud ad many other kids movies. Adults can find enjoyment in this. As for the target audience, there’s enough jokes and action to keep them happy and the message about the importance of friendship is well delivered. However, My Little Pony: The Movie has too many characters, although I somewhat forgive it since it’s based off of a television series. The premise is fine but not the most original or memorable, and some of the songs are bland. Still, the story itself is strong and it's overall entertaining enough for both kids and adults. It's no Disney or Pixar movie, but still decently fun."
    },
    {
      "rating": "10",
      "text": "My Little Pony: The Movie wants to be more than a toy commercial and succeeds with a serious adventure plot, Disney-quality songs and villains who give you chills – even as adult.PLOTMy Little Pony: The Movie starts in the capital city of Equestria, Canterlot, with a short introduction of Equestria's princesses and Princess Twilight Sparkle's best friends, as well as her loyal dragon assistant Spike, to get the audience up to speed.Princess Twilight's worries about the big Friendship Festival lead into a joyous song, but soon, the happiness gets interrupted as a menacing airship emerges from a dark, foreboding cloud in the sky.Out of it step Commander Tempest Shadow and her partner Grubber, both of them there to conquer Equestria and get ahold of the magic of Equestria's four rulers, on behalf of the Storm King.Princess Twilight can evade the fate of her fellow princesses with the help of one brave citizen, a gray pegasus mare called Derpy Hooves, but vastly outnumbered by the Storm King's invading army, she has to flee after saving one other princess from getting shattered to pieces of the statue she got turned into.After escaping, Princess Twilight and her friends go on a charmingly-classic hero's journey south to find the enigmatic “Queen of the Hippos”, last words said by Twilight's mentor and co-princess, Celestia.Their journey leads them through a variety of different places, including a desert town with nefarious citizens and an underwater capital. Mentions of never seen places like the “Badlands” or the mystic “Blackskull Island” give the audience the immersive feel there's more beyond the screen's confines.CHARACTERSTempest Shadow (Emily Blunt) and Grubber (Michael Peña): The Storm King's commander, a grim unicorn with a broken horn, and her partner.Grubber seems to have joined the Storm King's ranks more for the food than anything else and never appears truly malicious. His interactions with Tempest Shadow give a feeling of mutual understanding and imply a deeper bond between them.The Storm King (Liev Schreiber): A yeti-like, classical tyrant, intent to increase his power and influence via an old relic that can control storms, once charged with magic.Hates Equestria's pony culture and has a tendency for quite refined comments (“Deliver the punchline, Tempest, because this gotta be a joke!”).He fits perfectly into the formula of dark villains the animated TV show has seen across seven seasons.Capper (Taye Diggs): A sly cat, who pretends to help, but has his own interests. Becomes a valuable ally later, inspired by Rarity's generosity.Capt'n Celaeno (Zoe Saldana): Captain of a crew of swashbuckling pirates, who are slaves of the Storm King. Joins the heroes later.Queen Novo (Uzo Aduba): Sympathetic, but relentless, queen of a seapony tribe. Refuses to help to keep her own citizens safe.Princess Skystar (Kristin Chenoweth): Rebellious daughter of Queen Novo, joins the heroes later when everything seems hopeless.SONGSThe songs of My Little Pony: The Movie are memorable pieces of musical delight straight out of equestrian (and non-equestrian) mouths, delivered in a quality that puts them on the same level as Disney's best musical repertoire.The offerings range from happy party songs to Tempest Shadow's own, dark anthem; a chilling performance that reveals her reason for pursuing the path of ruthless villainy.The latter paints a black picture of the mercilessness the world can sometimes meet you with, in a welcomed, cynical and realistic tone one would not expect from “My Little Pony”.Only Sia's “Rainbow” comes across a bit generic and doesn't completely fit Equestria's world, but still provides an enjoyable tune for the movie's grand finish.DEMOGRAPHIC & WRITINGThough “My Little Pony” is commonly seen as a girls show, it presents itself as a movie for all ages/genders, with sharp dialogues and intelligent, mature jokes. More humor comes from the characters simply being themselves, like Rarity showing her best drama queen performance as the journey gets hard, the big strength of the movie's comedy.The all-ages appeal also shows in the finale as a good amount of (non-bloody) violence is needed to fight the last battle, because the power-hungry Storm King does not listen to the “Magic of Friendship”.A significant step-up from the flowery past of the franchise, as well as the recent, brand-defying “Equestria Girls” spin-offs that turn the ponies into humans and focus on boring high-school drama.MESSAGEIn the end, My Little Pony: The Movie manages to offer a positive message: One of tolerance, inclusion and overcoming one's insecurities, without being cheesy, as the path to these values is a long and hard one for some.If you seek a worthwhile My Little Pony adventure on the big screen, then the journey of Princess Twilight and her friends to find a way to defeat the Storm King is the right choice for you."
    },
    {
      "rating": "5",
      "text": "The movie was like all the other My Little Pony stuff that I've seen when I was younger, but that's it. The problem with me is that this movie had an extreme lack of boy characters and just made the whole thing for girls. I don't want to be stereotypical, so I'll put that one aside.However, that one mermaid scene was WAY too short for its advertising and the plot just felt... meh."
    },
    {
      "rating": "0",
      "text": "Man! Ugh! I hate my little pony so much with a flaming burning passion! It’s so girly and horrible!"
    },
    {
      "rating": "1",
      "text": "this movie sucks! why did this franchise got a movie! the characters are dumb crybabies!"
    },
    {
      "rating": "9",
      "text": "I seen FiM since autumn 2011 under the early Brony heydays where Everfree Radio existed. Back in 2014 I think the first fan made non official MLP movie posters was made on the booru and deviantart. I waited for the MLP movie since the spring where the first teaser was out, and the wait was worth it as now the hype is fading. Awesome songs, music and animation. The Friendship Festival is like my fics becoming alive. I would not mind if the movie was 2 hours long to flesh it out. The movie did not make it to the Oscars for best animated feature, but a possible Oscar or Globes runners up for music or songs.Lukas Graham from my country Denmark made the song Off to See the World. The villain the Storm King dies, as Tempest becomes a fan favorite on MLP forums while there are a lot of visual gags in the end credits."
    },
    {
      "rating": "8",
      "text": "All of the soundtracks are nice, the story are easy to guess but at least it had gave you every emotion you need to experience in a film.Side characters scenes are little bit too short, they all are lovable, and at least all of the part have their own songs.I don't see any reason why vote this film in a negative score"
    },
    {
      "rating": "10",
      "text": "I love My Little Pony so much. I really do. It's amazing because I catch up them all with the movie. I always loved amazing Princess Twilight Sparkle."
    },
    {
      "rating": "9",
      "text": "Great FilmSeriously, Don’t listen to the critics with this one, This adaptation of MLP: FIM is really good."
    },
    {
      "rating": "10",
      "text": "One of those Gems that we won't get to see after a few Years or more, a Great Movie to watch especially with Families and Friends beside you! It might not be everyone's cup of tea but for the rest it will be enough to give you some Joys, Wonders and Laughs!A definite Movie that will be part of a String of Classics that will inspire future talents and lives for the future to come!"
    },
    {
      "rating": "7",
      "text": "This Movie is not bad like it not terrible but really not good at the same like Rainbow Rocks like two of the new characters are really good Tempest and Capper which were both awesome in personality and Character but that when the good stuff ends like the prates had really bland personality and there reason sucked really hard, The Storm King is more like a man child than a king which is shameful but at least he died. So in my final rate is 7 out 10 because yes both Tempest and Capper were awesome the others not so much but other than that it ok."
    },
    {
      "rating": "8",
      "text": "Not a perfect movie but it's fine.  If you are brony you'll like the movie."
    },
    {
      "rating": "7",
      "text": "Definitely not a movie for everyone. If you are a fan of My Little Pony, you'll like it. It's nowhere near the dismal score critics give it at all.  It's a bit better than the standard family film in regards as to how it treats the audience and such. You won't find any toilet humor here. By not pandering to a low denominator the film makes an adventure most could get some enjoyment out of.The movie does suffer with cliches as they wanted to play it safe with the plot. Don't expect big revelations as a fan or something completely new as someone unfamiliar to the series. It is a typical go out an adventure kind of story with the baddie chasing them down, the heroes meet new friends, heroes break up in the third act, bad catches the protagonist, heroes reunite and eventually win. Though My Little Pony:The Movie doesn't do anything different in that regard the Tempest Shadow as the villain (not the \"mastermind\") is the best part of the movie. Regarding character, every already established character seems to either regressed, forgotten, or cast to the way side. Twilight Sparkle is the Princess of Friendship with seven seasons of character development and experience solving issues between her and her friends. Yet, she completely does a 180 at the end of the second act and blames all her friends after she makes a poor decision- that of which was also very out of character. Pinkie Pie is her usual self, before the third act break up. Rarity only helps make them friends with Capper. Rainbow Dash just got them into trouble. Lastly, Fluttershy and AJ did next to nothing.What about the villains? The \"main\" villain, who goes by \"The Storm King\" just retreaded ground already in the series. His screen time was minimal and he felt very one-dimensional. There was no motivation or backstory as any bad cliche villain. Tempest is the exact opposite however. She has enough screen time, sings her motivations and is believable and grows throughout the story. The only problem with her is she is a bit gullible when it comes to The Storm King. However she redeems herself ends the movie with a satisfying character arc. Unlike Tempest, most of the other new characters I forgot the first time I watched this movie, which isn't a good sign. The comedic relief Grubber was unnecessary at best, and annoying at worst. Cut him from the script and nothing would change. Captain Celaeno and her pirate parrots were there for the song halfway into the movie and the final fight and that's it. Capper was interesting with his ability to smooth talk his way into trouble, but I still forgot his name after the first viewing. Princess Skystar was the only one would I could actually like enough to remember besides Tempest as she finally gains her desires of having friends in the end. Overall the movie did a pretty poor job with making the new characters memorable.Let's end the negatives and start talking what's great about this movie. First off, the backgrounds are amazing, as is the animation in general. Most of the shots were pure eye candy. I personally didn't like the 3D CGI mixed with 2D animation but that's a personal preference. Every part is fluid and smooth which is surprising given the team's inexperience with the animation program. A lot character movements are awkwardly slow, but most will just ignore that fact. The magic effects are just overall pleasing and Rainbow Dash's Rainboom is a colorful sensation.The designs of this movie probably one of the best parts. The redesign of the interior of Canterlot was well done and more pleasing than the original. The Storm Guard has to be one of my favorite character designs for an enemy army in a very long time. The under water city looks like it it's from The Phantom Menace (and that's a compliment). The character designs for the movie are a bit more cutesy from their original show counterparts but it fits the aesthetic well. The Storm King's design is alright, and Tempest's is excellent.The songs are mostly fun, but forgettable with the exception of Tempest's song which is the only one I actually like to listen to. They feel like filler sometimes or in the case of Celaeno, a quick way to change a character. The show definitely had better songs.Overall it's an alright movie. If you're a fan you'll probably enjoy it but be disappointed by how safe the plot is. If you aren't a fan it's probably not going to make you a Brony, but at least it will show you it's not about dress up and it might entertain a little at some parts. The weak story isn't enough for me to stop rewatches, and despite the shortcomings, it's still a fun movie with excellent design, animation set in a good fantasy universe."
    },
    {
      "rating": "9",
      "text": "I regretted it! I find the movie looks good! Twilight Sparkle and her friends were trying to stop The Storm forces, which is pretty interesting.I'm feeling mostly positive toward the film and the show now!"
    },
    {
      "rating": "8",
      "text": "It's everything you love about the TV show, in movie form. If you're not a fan, watch seasons 1 to 7, become a fan and then watch this movie. I say seasons 1 to 7 because this movie takes place inbetween 7's finale and 8's premiere."
    }
  ],
  "recommendations": [
    "the_lego_movie_2_the_second_part",
    "atlantis_the_lost_empire",
    "frozen_ii",
    "zootopia",
    "the_lego_movie",
    "rio_2",
    "meet_the_robinsons",
    "the_croods",
    "how_to_train_your_dragon_2",
    "happy_feet_two",
    "incredibles_2",
    "tmnt",
    "my_little_pony_a_new_generation",
    "tomorrowland",
    "raya_and_the_last_dragon",
    "despicable_me_2",
    "big_hero_6",
    "smurfs_the_lost_village",
    "onward",
    "paranorman",
    "home_on_the_range",
    "9",
    "rango",
    "turbo",
    "the_peanuts_movie"
  ]
}