{
  "id": 2583,
  "title": "My Life in Ruins",
  "starring": [
    "Nia Vardalos",
    "Richard Dreyfuss"
  ],
  "runtime": 95,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "A Greek tour guide named Georgia attempts to recapture her kefi (Greek for mojo) by guiding a ragtag group of tourists around Greece and showing them the beauty of her native land. Along the way, she manages to open their eyes to the wonders of an exotic foreign land while beginning to see the world through a new set of eyes in the process.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AwjpyCXH2US0dH3AUHhfvQq7pVS.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 7.333333333333333,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I loved this movie which had me in hysterics. Richard Dreyfuss was by far the best. I'm Greek and was not at all insulted by this film."
    },
    {
      "rating": "0",
      "text": "This was the worst movie i've ever seen. i feel bad for richard dreyfuss being a part of it."
    },
    {
      "rating": "3",
      "text": "This movie really stinks. Nia Vardalos isn"
    },
    {
      "rating": "10",
      "text": "I loved it Light and happy funny and entertaining ! no porno or bad language took the kids and was surprised they were enjoying more than me!"
    },
    {
      "rating": "10",
      "text": "Great movie! Kind of predictable, but lighthearted. Loved the character interaction and scenery. I was very entertained throughout the whole movie, without any YAWN moments. If you just want to be entertained and have a good time..then just go see this movie, it's worth the money."
    },
    {
      "rating": "1",
      "text": "Another movie that suingle women over 40 will love. As for everyone else, not so much so."
    },
    {
      "rating": "10",
      "text": "How can one person say \"no emotional attachment\". This movie, altho a wonderful comedy, was also very sentimental. For total entertainment, see this movie. It's a must."
    },
    {
      "rating": "2",
      "text": "Keep in mind that I'm 100% virgin olive oil Greek, so it hurts me even more to say this...save your hard-earned drachmas/euros/dollars and go to a nice Greek restaurant instead of this movie. Don't be fooled...it's NOTHING like My Big Fat Greek Wedding. There's no emotional attachment with any of the characters, and even more disappointing, no insights into the beauty and grandeur of Greece. Very disappointing."
    },
    {
      "rating": "1",
      "text": "Quite frankly the worst movie I've seen in a long, time... like watching a bad 70s movie."
    },
    {
      "rating": "10",
      "text": "No, it's not the best movie out there. Yes, it's terribly cliche. But I absolutely loved it. It's one of those romantic comedy, feel good, everybody has a happy ending, kind of movie."
    },
    {
      "rating": "10",
      "text": "This is a must see. If you've ever been to Europe as part of tour you will relate to much of it. If you haven't then you still will find it so humorous. We laughed, we felt rather sad for the widower, we gushed in the romantic scense. This film evokes many different emotions. But the most important - it's just pure enjoyment."
    },
    {
      "rating": "1",
      "text": "Just plain bad. Don't bother."
    },
    {
      "rating": "7",
      "text": "Just hang loose, relax, and trot along with the guide and enjoy the fun. The bunch of obnoxious international tourists may not be exactly the ambassadors for their countries, or they may not be one's cuppa tea, but believe me, these sorts do exist."
    },
    {
      "rating": "10",
      "text": "I laughed a lot and I liked the Greek actor...he was the bomb!"
    },
    {
      "rating": "4",
      "text": "Bad acting. Lame plot. Brutally superficial dialogue. Yawn."
    },
    {
      "rating": "10",
      "text": "Wonderful movie. Loved the back drop of Greece. I enjoyed it so much I watched it twice. Wanted a little bit more for the ending though."
    },
    {
      "rating": "10",
      "text": "This is one of Richard Dreyfuss' and Nia Vardalos' best movies. It's a great movie for those of you who love Greek food or of all the places you've been in the world,you've never made it to Greece."
    },
    {
      "rating": "10",
      "text": "Anyone who has ever been on a tour through Europe would really appreciate this movie, despite some of it's short comings. Pretty accurate portrayal.  Negativity from the critics is way overdone and clearly based on their personal beliefs/politics and not the merits of the move."
    }
  ]
}