{"id": 2091, "title": "My Spy", "starring": ["Dave Bautista", "Chloe Coleman"], "runtime": 99, "genre": ["Family", "Action", "Comedy"], "description": "A hardened CIA operative finds himself at the mercy of a precocious 9-year-old girl, having been sent undercover to surveil her family.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/n2C6jRK9PtPIs99RQhKtqGlsnsO.jpg", "categories": {"plot": 5.833333333333333, "acting": 5.7, "ending": 5.5, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.363636363636363, "action": 5.0}, "reviews": [{"rating": "5", "text": "I enjoyed it enough, actually has some clever bits, but it’s just safe and mediocre more than anything. Also this is a kids movie? It’s PG-13 with swear words. As interesting as its dozen delays..."}, {"rating": "4", "text": "............................................................................................................ It was very enjoyable!"}, {"rating": "4", "text": "This movie tries more than it succeeds mostly by failing to take its own ideas serious enough for the jokes to land. The casting feels like a mixed bag with strangely emotionless Botox faced Bautista as the titular spy. I felt like they wanted to remake the kindergarten cop but forgot to make their own style along the way. The writing is the biggest fail here. It really was a missed opportunity to make something interesting. Barely watchable. Not worth your time unless you're a massive Bautista fan."}, {"rating": "4", "text": "If the film markers removed all the swear words, this movie would have be for everyone to watch.Because this movie is so stupid and childish."}, {"rating": "6", "text": "5.5 for me - don't expect genius of this movie, it is meant mainly for kids and families so has lots of plotholes and things you will think a bit stupid or unreallistic. But i enjoyed watching it while doing other things at same time so was nice"}, {"rating": "7", "text": "In My Spy, currently on Amazon Prime, a young girl (Chloe Coleman) blackmails a CIA operative on a stakeout (Guardians of the Galaxy's Dave Bautista) into helping her out with her life. I thought this was decent.Let me start out by saying that this is predictable. It's the general story of the odd couple becoming friends and a tough law enforcement/government agent working with kids like Kindergarten Cop and The Pacifier. (This is very The Pacifier). The predictability can at moments make things drag as you can tell what's going to happen and are just waiting for the movie to go where it's going to go. The love interest in particular feels by-the-numbers and rushed and lacks chemistry.Despite all that, this was still an enjoyable time for me. The movie's cookie cutter, but competently handled. It's the two leads that make this movie as they manage to elevate the material and work so well with each other. If you were one of those people that thought that Bautista's character in this film and in his last one Stuber seemed really similar (they are both comically impulsive men of the law), you'll pleased to know you're not just watching the same performance. I thought Bautista works a lot better here. He's a lot more nuanced and easy-to-like. The Last Man on Earth's Kristen Schall also does a decent job as Bautista's partner on the stakeout.Admittedly, there are only a couple of downright funny parts, but the humor generally works and has its charm.This is a PG-13 family film. Most of this is basic family film storyline mixed in with the occasional bit for adults.Overall, I recommend this. It's not perfection, but it's a generally nice film for a group deciding on something to watch on a Friday night."}, {"rating": "4", "text": "Below average entertainer for me.Like many people says it's exactly the big tough guy meets a little girl type movie.Dave Bautista was kind of cool but we have seen better performances from him in the past.Chloe Coleman as the kid is really good she outperforms everyone in acting.The Direction is average too.The Verdict: One time passable watch family-friendly movie."}, {"rating": "9", "text": "My Spy is my favorite comedy movie of 2020, one of my top 10 favorite movies of 2020, and one of my favorite movies of all time. The chemistry between Dave Bautista and Chloe Coleman was phenomenal and so cute. The acting from Dave Bautista, Kristen Schaal, Chloe Coleman, and Parisa Fitz-Henley was outstanding, they were very funny. The writing was excellent and really funny. The music choices were great, every song fit perfectly in the movie. This was a really fun, entertaining, and cute movie."}, {"rating": "6", "text": "(Mauro Lanari)Clean, pleasant, entertaining, free of vulgar or violent scenes: a real rarity for this period."}, {"rating": "7", "text": "Welcome back, Streamers! One benefit of being stuck inside all of the time… is the movies that studios are forced to bring to us. We have been blessed by this mess and I’m grateful for the blessings I have. One of those blessings this week was My Spy. This movie is starring Dave Bautista, as JJ, the meathead C.I.A. agent that gets selected to do the one job he can “handle” by watching a daughter and mother, Chloe Coleman, as Sophie, and Parisa Fitz-Henley, as Kate. We all know what happens after that. This movie is exactly what the trailer shows you (check it out below). If you think it’s going to happen in the movie… Oh, yeah, it’s going to happen. And do you know what? It’s still hilarious. I’ll admit I’d written this movie off when it was coming to the theaters but since it came to a streaming service I had to give it a shot. Here it goes.Dave Bautista, as rigid and mono-tone, as he is, just has “it”. And, by “it,” I mean that comedic gene. Maybe you love him as Drax in the MCU, but you might say it’s the writing. In my opinion, Bautista still hits hard in My Spy. He doesn’t have the range of everyone’s favorite Dwayne Johnson… yet. I think if he gets a few more diverse roles that don’t stifle his growth then he can possibly get there. Did we really think that Arnold Schwarzenegger was going to give us comedic gold throughout the years? We didn’t, but here we are watching Kindergarten Cop and Jingle All the Way every year. On the flip side, Chloe Coleman is just a pleasure. Now, they may have given her all the great lines in this movie, but her comedic acting ability is evident. She jumps off the screen… except in her like cry moment… that was forced trash but otherwise so much fun.Bautista and Coleman give The Rock and Kevin Hart a run for their money in this one and, respectively, they are both the same heights. I doubt we’ll see another Bautista/Coleman team up, but I hope we see each of them in other parts. My Spy provides action, comedy, and that needed feeling of companionship we can’t achieve during the pandemic. This movie created with chemistry and charisma what Coffee and Kareem tried, and failed, to create with vulgarity.Needless to say, I was pleasantly surprised by My Spy. I thought this would be a cliched and predictable big bad guy and little kid flick and it was but like Kindergarten Cop back in the day this was ultimately a guilty pleasure film that I don’t really feel guilty about. As part of the world goes back to quarantining and the other half tries to figure out re-opening properly, grab a bowl of popcorn and check out My Spy on Prime Video."}, {"rating": "0", "text": "While it certainly contains creative comedy. The retuity of its language and humor along with the underdeveloped characters make this Not My Spy."}, {"rating": "10", "text": "It’s a nice movie that you can enjoy with your family or on a date and laugh throughout the entire time."}, {"rating": "8", "text": "Really funny good family film enjoyed it a lot. Batista is really good in this film so is the young girl the actress"}, {"rating": "4", "text": "Okay the actors are good the actions good extremely funny need more of an ending but although my rating is definitely more than it probably should be because I'm a crazy outrageous Batista fan so I give it a ten out of ten but the other actors are great too and the kid is awesome  kid is extremely cute and I lovedI"}, {"rating": "7", "text": "Funny characters and good cast. good time passer. can make you cringe at times though."}, {"rating": "7", "text": "I definitely liked this more than most, decently funny, surprisingly decent action, and very sweet and feel-good. The child actor and Dave Bautista pretty much keep this movie alive and the very boring end of the world plot is put so much on the side that I didn't get too bored."}, {"rating": "10", "text": "Feel good movie all the way and Dave (Bautista) is, and always will be, the nicest and sweatest fella around. Such a nice guy. The rest of the cast also delivers their roles perfectly, truly making this a movie you can have the coziest evening to with your loved ones. I hope there will be a sequel, I even made my profile Just to rate this movie. OMG i havent seen i could rate it 10, i thought 5 was the highest. Make a sequel please. Love M"}], "recommendations": ["17_again", "the_pacifier", "the_proposal", "just_go_with_it", "this_means_war", "night_at_the_museum", "second_act", "the_break_up", "paul_blart_mall_cop", "friends_with_benefits", "the_green_hornet", "pitch_perfect_2", "central_intelligence", "what_happens_in_vegas", "thunder_force", "the_longest_yard", "little_fockers", "zack_and_miri_make_a_porno", "no_strings_attached", "the_change_up", "just_friends", "neighbors", "the_game_plan", "the_other_guys", "the_babysitter"]}