{
  "id": 3309,
  "title": "Mystic River",
  "starring": [
    "Sean Penn",
    "Tim Robbins"
  ],
  "runtime": 138,
  "genre": [
    "Thriller",
    "Crime",
    "Drama",
    "Mystery"
  ],
  "description": "The lives of three men who were childhood friends are shattered when one of them has a family tragedy.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/e2VNohx5jb7I6HUamCuGhKvzXDR.jpg",
  "categories": {
    "plot": 6.72,
    "acting": 7.594594594594595,
    "ending": 6.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 0.0,
    "funny": 5.0,
    "action": 9.333333333333334
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I have watched this film countless times and I still love it. It has a great story, great acting, and its just an overall great film that I love. This is a must see."
    },
    {
      "rating": "6",
      "text": "After re-watching i must say that the plot is nothing speacial. The acting is superb tho and overall its worth a watch."
    },
    {
      "rating": "8",
      "text": "I'm impressed by this thriller, that got me from the beginning. Thrilling for sure. Movie about the childhood trauma, torturing you for a lifetime. About love, friendship, criminals.. basically everything.  I won't give the surprising plot twist away, but it is truly unexpected and I was very excited to see it. Definitely one good thriller that I recommend."
    },
    {
      "rating": "7",
      "text": "Knowing how it's going to end does prepare you to look at it from a more objective point of view, and while I'm still not a huge fan of the ending, it was better than I remembered, even if it's still a somewhat unsatisfying and frustrating conclusion (although that's probably the point).This film is never boring. You're always interested about what's going to happen next, and that's mostly because of the excellent characters and how the film makes us really care for them, which is made easier by the fact that everyone in the cast is incredible.Tim Robbins in particular is absolutely increible. His Oscar winning performance as a tragic survivor of abuse makes us feel for him even when we're not entirely sure if he's as innocent as he says he is.He is by far the best thing about this movie."
    },
    {
      "rating": "8",
      "text": "Sad, macabre and dark film at the same time. Film about unspoken words, loneliness, lies, the vicious circle of violence. Wonderful photography and directing, an ending that is almost anger. one of the best Clint Eastwood movies."
    },
    {
      "rating": "10",
      "text": "People are idiots, SImple as that. Mystic River is a great film - Great acting by the cast, Interesting story, and a very satisfying ending. Sean Penn and Tim Robbins are untouchable in this."
    },
    {
      "rating": "4",
      "text": "wow, I can find some seemingly good aspects about this film if I try, but come on!.. a 10? Award nominations? I just can"
    },
    {
      "rating": "0",
      "text": "This was one of the most pretentious pieces of s..t I've ever seen! It seems all we need for a collective, critic circle jerk is to have Sean, Tim, Kevin, and child molestation in the same film. A story can enlighten, inform, unite, mystify, amuse, or frighten. Can anyone explain to me how this film did any of the above? A trailer that seemed to hint that Tim Robbins's character would track down his molesters with the aid of friends he hadn't seen in years, a plot that my wife and I figured out at the halfway point, and enough dead-end/pointless plot devices to fill Boston Harbor. Above all, this film carried with it the most reviling aspect of 'hip,' modern film-making, and that was the moral vacuum that this film resides in. Thank you for the forum. Jeff Graham-Tulsa, OK."
    },
    {
      "rating": "4",
      "text": "you can sum up Mystic River by two things only, weird and far away from reality.\ri mean it's like watching a movie by Paul Thomas Anderson.\rbecause everything that the characters do in this movie is the exact opposite from what people do in these types of situations.\rmy point is you can't relate to these characters actions at all. a man just told his wife that he killed the wrong guy, and the wife tell him, \"that what kings do\", WHAT.\rand the innocent man who got killed confessed about a crime he didn't commit for no obvious reason, and the people who actually did the murder have no motive at all.\rand it's keep getting weirder and weirder to the point that you keep scratching your head after the movie ends.\ri mean seriously Clint Eastwood.\rand i can't understand why Tim Robbins nabbed an Oscar for best actor, all what he ever did was few face expressions and 4 or 5 lines.\rand Clint Eastwood stretched some scenes way too much so you can relate to the performances but it was iffy and cold for all of them."
    },
    {
      "rating": "10",
      "text": "5.1?????? Movie like Napolean Dynamyte got a better score than this?"
    },
    {
      "rating": "0",
      "text": "How can you make a movie like this and sleep at night. Clint Eastwood should be ashamed. Making a movie like this should bring him down. Clint Eastwood knows better then to show a movie that crap. I give this movie a 0."
    },
    {
      "rating": "5",
      "text": "Eh. Expecting something more interesting. Tried to make twists at the end, but just came out looking lame. What were all the raves about. I think critics just trying to get Eastwood to give them an interview or something. Almost seemed like they wanted to go in the direction of that movie whose name I can't remember right now. Deniro is a Priest. That British chic is in it. Sleepers or something. Anyways...that movie was great...this not."
    },
    {
      "rating": "1",
      "text": "I give it a 1 because one of the aerial shots of Boston was well-done. That, of course, left me with another 136 minutes to calculate the average number of white dots on an Ice Cap (28). Sadly, this intensive labor proved more profound than the movie. One wonders what is going on with our society that so many people would slobber over this film. It may be time to move to Canada."
    },
    {
      "rating": "0",
      "text": "The most overrated movie of all time. Hideous, offensive, and soul-destroying. The kind of movie that tells you life sucks and everything's awful, and then fakes the evidence. Every plot twist is rigged and unbelievable, every line is ponderous and humorless, and the experience leaves you thinking there's nothing that can be accomplished in life. And don't blather to me about the \"powerful acting.\" The best performances in this movie--the fine, quiet work done by Kevin Bacon, Laura Linney, and Laurence Fishburne--were, of course, the least acclaimed. All the praise and Oscars went to the overdone hamming of Penn, Robbins, and Marcia Gay Harden (who, to be fair, was given nothing to play but scaredy-cat.) It was embarrassing seeing the great Ms. Linney trying to make that bogus Lady Macbeth scene at the end believable. One of those movies that's trying to impress you rather than tell a story, which you're supposed to learn a lesson from. \"Life sucks\" is not an original message, nor one that will come as a great surprise to many people, but overpraised hack directors always seem to think they're doing something daring by trotting it out."
    },
    {
      "rating": "10",
      "text": "This film blew me away. At first, you feel for Jimmy, then you slowly grow to hate him. Terrible events always seem to bring these three friends together and I felt like I had been punched in the face when it had finished. Sean Penn brings this energy that feels like the most powerful energy a man can emit. Tim Robbins made me feel so bad for the character of Dave. He did a great job of portraying the mentally deteriorated rape victim. Dave was the character that made me feel so sad. He is like the ultimate hero and ultimate victim of this whole movie. Jimmy's daughter may have been the one that was killed, but Dave was raped as a child, kills a pedophile in the act of molestation, is blamed for the murder of the daughter and is then killed by one of his childhood friends in an act of vengeance. I don't care how big of a stupid loose cannon Jimmy is. I felt like the death of his daughter was almost an excuse to get back into his old ways. I wish that Jimmy could get what was coming to him. Losing a loved one is painful, but this character has no excuse for murder. His accusations were purely based on blinding vengeance. I'm sure that several fathers would kill their daughters murderer which makes me feel like my incredible dislike for Jimmy is a little harsh. Look at this ramble! Eastwood just made me feel for his characters and got me emotionally indulged in his film. Such an accomplishment of acting by every character involved in this movie. Acted to perfection, directed to perfection and written to perfection, Mystic River touches on several issues of lost childhoods, loss and our relationships with others. I can't even think of better things to say about this movie, it was so good. Absolutely incredible film."
    },
    {
      "rating": "2",
      "text": "It was on TV recently and talk about not able to hold my attention.  I popped in now and then to see if I could stand it as there was nothing else on.  Bad."
    },
    {
      "rating": "5",
      "text": "The movie needed better acting. Some scenes were just awkward to watch. An hour could have been cut from this movie easily. Sean Penn saved this movie."
    },
    {
      "rating": "10",
      "text": "This is perplexingly appalling, my fourth favorite (of 180 films) of 2003 has a 4.7 average. This is beyond foolish, but the score is not my statement. Mystic River is a harrowing, well-performed drama. A film similar to classics because it is an emotional thriller. I say more things in a more organized manner but I'm just so struck by how many people hated this. With this and the other two of the other four films that were nominated for best picture were excellent and both have scores pretty low. The browsers of metacritic have to be dumber than the ones of other sites."
    },
    {
      "rating": "10",
      "text": "One of Clint Eastwood's best movies, if not the best. Outstanding cast and direction. Eastwood did a great job with a dark story created by Dennis Lehane. Eastwood stayed true to the storyline."
    },
    {
      "rating": "9",
      "text": "I should give this a 10, but there are two areas of a film that are most important... the beginning and the end. Great movie overall except the artist didn't know when to put down the brush. Sorry Clint, you should have cut out the last scene, we already got the feeling you wanted us to have and the feeling (of disgust) was wonderful. You pushed it farther than it had to go."
    },
    {
      "rating": "10",
      "text": "Anyone who gave this movie less than a 6 needs to have their head scanned. This movie is truly epic, from the cast to the story. You will NEVER see a darker, or deeper story on film. This truly is Clint's masterpiece. I guess it doesn't have enough over-the-top gore or CGI to get a high score from the viewers here...... Pretty damn sad that Mystic River and There Will Be Blood don't get the credit they deserve from you unknowledgable hacks."
    },
    {
      "rating": "10",
      "text": "This is one of the best movies I've seen in the last ten years. Sean Penn's performance is completely masterful, you feel his raw energy whenever it's called for."
    },
    {
      "rating": "4",
      "text": "Like Elliott below, I too was very disappointed with the movie. It was calculated and the actors seemed as though they were trying to outdo each other. It was highly disturbing and consistently gloomy - I can handle distubing fare, but Mystic River is just flat-out unpleasant. I wanted it to end long before it did."
    },
    {
      "rating": "4",
      "text": "A noble effort by Eastwood, but ultimately a movie that leaves the audience unsure if they should really care. The editing is disjointing, the solution to the murder mystery is unsatisfying, the twist is shallow and the acting is the equivalent of the lunatics taking over the asylum."
    },
    {
      "rating": "9",
      "text": "This is hands-down the most depressing movie I've ever seen. Ever. That being said, though, it was really good. It was incredibly well-acted, the plot was great (albeit depressing, of course) and Clint Eastwood, as usual, put his directing talents to work. Although it was still really fucking depressing. Now that I think about it, and without trying to spoil it, the kids in this movie will turn out like the adults in this movie, plagued by tragedy. Still. Depressing."
    },
    {
      "rating": "9",
      "text": "Mystic River never let me down. I heard great things, and they were all true. I was not disappointed by any aspect of the story. I'm glad they spent the extra money to shoot it in Boston instead of Toronto. I really liked the neighborhood they shot it in, it gave it such a human feel to it."
    },
    {
      "rating": "10",
      "text": "This was the best film of the year, one of those all too rare examples of a work that deserves all of the praise bestowed on it. What Clint Eastwood has done here is show once again that understatement will win out over extravagance any time. The film doesn't have a single false note. Brilliantly acted by an ensemble cast who have never given better performances, Mystic River has a deliberate pace that perfectly complements its narrative structure and style. It has been superbly designed, photographed, scored and edited, the result being the full realization of a classical tragic tale."
    },
    {
      "rating": "10",
      "text": "I found this film to be one of the most spiritually profound works to come out of the Hollywood studio system in quite some time. Eastwood sorts through the rubble of his characters' lives with an assurance and patience that's reminiscent of his better works. The film has its ciphers (namely Laura Linney's Lady Macbeth) and its fair share of summarizing speeches"
    },
    {
      "rating": "6",
      "text": "I'm a bit surprised to see the praise this movie's gotten, to be honest. I remember being furious that Sean Penn beat out Bill Murray for the Oscar that year but after finally seeing the movie I can admit that he did a fantastic job certainly worthy of an Academy Award. But the movie itself I can't understand the praise for. There's plenty of gritty and realistic dialogue here and all of it very well-acted but."
    },
    {
      "rating": "8",
      "text": "Clint Eastwood promises a lot but does not deliver what he would have wanted to.Sean Penn & Tim Robbins steal the show by portraying their well written roles like only they can .Though the film does haunt you ,it leaves a lot of loose ends.That said, one cannot take any credit away from Eastwood who manages to deliver yet another rewarding experience though this is obviously not even anywhere near his best."
    },
    {
      "rating": "10",
      "text": "A mesmerizing experience as MR keeps you glued to your seat with a stimulating adventure, ideal character development, and epic performances.  MUST WATCH!"
    },
    {
      "rating": "7",
      "text": "Fairly powerful crime-thriller with good performances, music and writing. Quite sad."
    },
    {
      "rating": "9",
      "text": "Absolutely fantastic! I don't understand why people find it bad! I don't often trust the 'Oscar winner' type of movies, but this movie deserved the award! The actors were all formidable! you couldn't ask for a better cast, because this film has a deluxe- cast! I think some people are usually biased thinking that a big Hollywood movie, is either 'bad' or 'overrated' and, quite frankly, that type of attitude doesn't help a person to appreciate a movie for what it is. I am sorry but I disagree...Hollywood has good and bad movies, same happens in Europe, Latin America, Asia, Africa, and my dear Australia! so just because this is a USA blockbuster  it doesn't mean is a bad movie...and I am not American, but YEAH, I firmly believe this is an excellent movie!"
    },
    {
      "rating": "8",
      "text": "Absolutely loved this movie. Well acted, Kept you interested from start to finish, and it was really good. I am suprised that users have rated it so low."
    },
    {
      "rating": "9",
      "text": "Mystic River is haunting in absolutely every way. There isn't a human truth Clint Eastwood does not successfully touch on and move you with. It's thrilling... and certainly an ensemble to be remembered."
    },
    {
      "rating": "5",
      "text": "Mystic river has plenty of good acting but nothing interesting to say. The movies pace is too slow and in the end I felt empty because the film itself is empty; it's devoid of ideas, meaning, and purpose."
    },
    {
      "rating": "10",
      "text": "First off, this is a 9.5 out of 10. Acting is amazing. Mainly Sean Penn and Tim Robbins. Score is good. Story is great. Real thrilling story. I agree a lot with what spadenx, except the ending. It's all right but he kills an innocent man and they just like \" oh well\". That makes me aggravated. Still a great movie. Overall, this is a great thriller. It'll keep you on guessing. Highly recommended."
    },
    {
      "rating": "10",
      "text": "Sean Penn, Tim Robbins and Kevin Bacon, great actors    ."
    },
    {
      "rating": "10",
      "text": "Great movie    ."
    },
    {
      "rating": "10",
      "text": "My favorite movie    ."
    },
    {
      "rating": "8",
      "text": "This one is tragically beautiful. What this one did really well is instill the dark mood as loss in many different ways acts like a fog that covers the entire film. Overall, the story is really interesting. On the surface, it is simply a crime thriller where they try to find out who did it and what not, but it is also a representation of human suffering and tragedy. In many ways, it shows how these three troubled boys are not unscathed by the things that have happened to them and how all of them have suffered and will suffer profound losses that consume them entirely. I think the script by Brian Helgeland was fantastic and the direction from Clint Eastwood was really good as well. However, the real star is Sean Penn. I thought Tim Robbins and Kevin Bacon were pretty good in their roles here, but Sean Penn stole the entire show. His performance was absolutely marvelous and he really drew you into him, which makes his role in the film all the more believable. It is not surprise that he won for Best Actor.\r In terms of complaints, I see a lot of user reviews calling this one boring and slow, ham-handed, pretentious, and predictable. The only one I can sort of agree with is predictable, though I did not figure it out until the people in the film did (well, part of it, I figured out one part of it early on, but I think we were supposed to). Plus, I do not have a problem with predictability. In addition, this one was anything but boring. It is slow, yes, but it was a perfect showcase of acting and script-driven film. The intensity and sadness of this one were also top-notch and really helped quell any boredom that may set in. As for it being ham-handed or pretentious, no. I honestly do not understand that criticism at all. At no point did I ever find it to be either of those things. It tries to tackle bigger purposes, yes, but that does not mean it is pretentious, especially when it covers it well."
    },
    {
      "rating": "10",
      "text": "One of the most powerful American films of the decade, Mystic River is hypnotic and unforgettable."
    },
    {
      "rating": "9",
      "text": "Friggin' yes! A mid-tempo and ominous thrill ride, overcast from beginning to end by a shadow of dark things to come.  Also, one of the best acting ensembles I've seen. Clint Eastwood is the man, and Mystic River is just another sparkling example."
    },
    {
      "rating": "9",
      "text": "On the one side the plot is sad and has some good twists. There are many famous actors and especially Tim Robbins performance is marvellous. But on the other side the ending is a bit bad, but dont want to spoil that."
    },
    {
      "rating": "7",
      "text": "Mystic River is a very good film but is let down by a story-line that appears to be slightly all over the place and a couple of plot-holes (just my opinion). However, it is a solid, powerful movie and hats off to Clint Eastwood. The actors play their characters very well, especially Kevin Bacon, I really like his character. Definitely worthy of a Best Picture Nomination."
    },
    {
      "rating": "9",
      "text": "It's funny, because a lot of times you'll hear people say \"I didn't like that movie because I couldn't root for any of the characters.\" A lot of people feel that way about this film. All of the characters, in their own way, do bad things. Some are worse than others, yes, but there is no one who you want to \"win,\" because this is a movie where no one wins. The ending is terribly sad, and you walk out of the movie so shocked and dismayed at what happened, because even if you don't root for anyone, you still care so deeply about the characters. You still want the best for them, even if you can't root for them, if you can't stand beside them and say \"I stand for the same ideals that this person stand for.\" You want to know who killed Katie, and you don't want it to be Dave, but do you root for Dave to win? Do you root against whoever you think killed Katie? No. This is an incredibly difficult film to watch, and it will not make you smile. It will make your heart sink, and your eyes tear up. It is so very powerful, and delivers such a strong message, it remains impossible not to watch. The acting is phenomenal, and while both Penn and Robbins won Oscars, the show is stolen by Robbins, who turns in one of the best supporting performances I've ever seen (on par with something out of the Godfather). From the opening scene, with those 3 boys playing hockey in the street, until the closing credits, it is relentless. But it is phenomenal."
    },
    {
      "rating": "9",
      "text": "Absolutely massive movie.With the right collaboration.The movie makes another space in the mind to think about misunderstanding. Awesome directing by Clint Eastwood."
    },
    {
      "rating": "9",
      "text": "Initially the ending of the movie put me off a bit but after a bit of research, I came to the conclusion that Mystic River is a great movie. A gripping, intense and well made film, Mystic River is easily one of Eastwood's best films."
    },
    {
      "rating": "8",
      "text": "Eastwood's Mystic River haunts you for days, it just breaks your heart in half.  Sean Penn, Tim Robbins and Kevin Bacon put on career-best performances."
    },
    {
      "rating": "8",
      "text": "Mystic River is an excellent movie based on the novel of the same name. The film is anchored by a strong cast containing some of the best actors of he past 20 years. Sean Penn delivers one of his strongest performances and wins his first Oscar. Really the early 2000'sare the years where Sean Penn could do no wrong. Tim Robbins also shines as a mysterious character who was also worthy of an Oscar for best supporting actor. It was the first time since 1959 that the winners of Best Actor and Supporting Actor were in the same film. The cast is rounded out by Kevin Bacon, Laurence Fishburne and Marcia Gay Harden. Mystic River is a dark story and a dark film but it could not be displayed any other way. Clint Eastwood who was on the top of his game in the directors chair at this point in his career as well shows that he is a jack of trades in film."
    }
  ],
  "recommendations": [
    "changeling",
    "the_prestige",
    "the_departed",
    "gran_torino",
    "million_dollar_baby",
    "joker",
    "the_devil_all_the_time",
    "american_gangster",
    "the_usual_suspects",
    "american_hustle",
    "inside_man",
    "meet_joe_black",
    "man_on_fire",
    "the_illusionist",
    "a_most_wanted_man",
    "magnolia",
    "hereafter",
    "split",
    "gone_baby_gone",
    "revolutionary_road",
    "lucky_number_slevin",
    "the_godfather_part_iii",
    "black_mass",
    "good_will_hunting",
    "a_beautiful_mind"
  ]
}