{
  "id": 1856,
  "title": "Nacho Libre",
  "starring": [
    "Jack Black",
    "Ana de la Reguera"
  ],
  "runtime": 92,
  "genre": [
    "Comedy",
    "Family"
  ],
  "description": "Nacho Libre is loosely based on the story of Fray Tormenta (\"Friar Storm\"), aka Rev. Sergio Gutierrez Benitez, a real-life Mexican Catholic priest who had a 23-year career as a masked luchador. He competed in order to support the orphanage he directed.",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kh7B91bMl2lZ0mH9WhPfaNUIEQH.jpg",
  "categories": {
    "plot": 8.181818181818182,
    "acting": 7.714285714285714,
    "ending": 9.0,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 7.5,
    "funny": 6.828571428571428,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "ThIS Gaem is DIG SGUstINK!1!!one! The gam play is ah-ful. The mane chracter is so fat and it is hard to when he is like and then you CANNOT sea. I treid. I rely tryd. but. i cannot/. even when he. Look, if you wantt two when it is, then you have to be rely good at disfunctionaeal gams becuase it is when it can so yeah . So like when i watched my frend play this game he like when it and"
    },
    {
      "rating": "1",
      "text": "This movie was horriable. Me and my friends were xpecting somthing funny and it was just plain stupid. We left early b/c it was a waste of a sat. night."
    },
    {
      "rating": "10",
      "text": "hilarious"
    },
    {
      "rating": "8",
      "text": "While Nacho Libre is not a spectacular or amazing accomplishment in filmmaking, it is nonetheless worth watching. I didn't expect to like it but I was pleasantly surprised by its goofy and off-kilter humor reminiscent of its Napoleon Dynamite relative."
    },
    {
      "rating": "10",
      "text": "The funniest thing about this movie was reading the ratings here. It goes a 10, a 0, a 9, a 1etc... and the comments by those who missed the great humor, is the most hilarious of all. The genius of this movie is its perception by some and imperception by others. Black was the funniest ever."
    },
    {
      "rating": "4",
      "text": "I have long been a fan of Jack Black but a quick look at his CV would suggest his movie choices haven't always been the best. For every School of Rock or King Kong he has starred in there has been an Orange County or Envy. Unfortunately, despite coming from the writer and director of the excellent Napoleon Dynamite, this is certainly one of his worst movies to date.\r I have no problem with silly, over the top comedies (Zoolander and Austin Powers are amongst my favourite comic films) but when you can look back and count the number of times a movie made you laugh, twice by the way, there is certainly something wrong. It may not be as bad as anything from the Scary Movie franchise but I certainly won’t be watching again anytime soon."
    },
    {
      "rating": "2",
      "text": "I really wanted to like this movie. At times, I went as far as trying to force myself to laugh. It just wasn't funny... I even fell asleep at the end! Bottomline, if you've seen the previews, you've seen everything there is to see in the movie. Don't waste your money, maybe rent it... if you find a $10 on the ground or something."
    },
    {
      "rating": "0",
      "text": "This film has no redeeming qualities at all. Zero isn't low enough."
    },
    {
      "rating": "3",
      "text": "Just watch the commercial a bunch of times. You'll see the funny bits there and save the popcorn and ticket money for something worth while."
    },
    {
      "rating": "5",
      "text": "Some funny parts but an overall disappointment."
    },
    {
      "rating": "6",
      "text": "Didn't quite work for me. Which is disappointing given what a huge fan I am of Napoleon Dynamite. Like that other Jared Hess comedy, most of the humor comes from watching characters in a slightly cartoonish world do and say ridiculous things in a deadpan manner. Only because this is a Nickelodeon production there are also fart jokes. That's kind of the problem. This is primarily aimed at children so the whole thing is very juvenile. Too juvenile even. There are some themes you can pick out involving being unhappy with your place in life specifically in regards to class and some shots taken at organized religion, but it will all go over the kids' heads while adults will be too annoyed by all the slapstick and gross out gags to care. The are certainly some funny moments, but not enough to keep this from missing the mark with the older members of the family."
    },
    {
      "rating": "10",
      "text": "Too many comedies nowadays rely on crudeness to get over with movie-goers. This movie does not. And guess what? IT WORKS. This is one of the funniest Jack Black movies I've ever seen, combined with a GREAT sound-track it'll just leave you smiling when it's finished, which is what a PROPER comedy should do"
    },
    {
      "rating": "7",
      "text": "silly fun, not as clever as Napoleon by any stretch, however, it makes for some good entertainment. the scene with the midgets that look like ewoks is pretty classic as with his extended soaring from the top turnbuckle. worth the trip"
    },
    {
      "rating": "6",
      "text": "In \"Napoleon Dynamite\", we laughed at the titular star. In \"Nacho Libre\", it's the sidekick who is made to look largely ridiculous. The filmmaker isn't going to make a major star look stupid. Most, if not all, of the laughs aren't generated from the script or situation, but because Esquelto(Richard Montoya) looks dissheveled and speaks funny. It's as if Sara Silverman created Esquelto. Incredibly, the usually hyper Black is almost like a straight man. \"Nacho Libre\" is somewhat redeemed by an atypical premise and a setting that feels at times, otherworldly."
    },
    {
      "rating": "9",
      "text": "It gets a 9 just for Ana de la Reguera alone."
    },
    {
      "rating": "10",
      "text": "freakin ridiculously hilarious. this movie is so retarded funny. Way better than napoleon dynamite. i laughed so hard i started crying. i want it on DVD. \"BAPTIZED!!\" now i'm laughing just thinking about the movie again"
    },
    {
      "rating": "7",
      "text": "Nacho Libre is a good natured family film thats got some fuuny bits but by the response of the thirty 13 year olds in the crowd it was Hilarious, there in lies the problem. Jared Hess tries to capture all the things that made Napolean the hit it was by using that same subdued humor, the\"feel sorry for me\" charasters, even the look of a shoestring budget indie film but he holds the reins on Jack Black so he's merely Father Napolean. It works if that's what you're going to see, but I can't stop hoping Black will finally make a movie that's not so family-friendly and he'll let out that John Belushi in him in something I can't take the kids to see. The song \"A really religious person\" and the one he sings about the nun offer a hint of what i'm talking about. Come on Jack, R-rated comedies are the thing again!"
    },
    {
      "rating": "9",
      "text": "I haven't laughed thismuch at a movie in a long time. I enjoyed Napoleon Dynamite, yes, it had good phrases but never really made me laugh out loud. The Benchwarmers just plain sucked - only laughed once and it was a very gross movie. Nacho Libre had countless funny scenes and had the entire audience laughing out loud. The type of laughing where you laugh until tears are in your eyes sometimes. This movie has a great plot (it has an ACTUAL plot compared to say, Napoleon Dynamite) with all the denumont (sp?), rising action, climax, falling action. It has GREAT acting (especially if you like Jack Black) and was well written. Also the nun is great with her chemistry."
    },
    {
      "rating": "10",
      "text": "I am totally miffed that this movie had not gotten better reviews. Maybe the producers did not pay off the critics or maybe the public in general can't handle a comedy that has some creativity to it. I don't know. What I do know is I laughed out loud from beginning to end. Between all the weird characters they fought, to Jack Blacks improvised songs, to the silly little tights he'd frolic around in, the movie became an instant classic in my book. I highly recommend this movie."
    },
    {
      "rating": "7",
      "text": "In what promises to be a very typical movie summer stuffed with remakes, sequels and comic book adaptations (some of the above quite good; that's not the point) any time you catch sight of such an odd duck as this, you'd do well to heed its quack. This endearingly goofy slapstick opus about a Mexican monk (Jack Black) who, in order to earn money to feed the parish orphans, indulges his fascination for Masked Marvel-type wrestling (much to the displeasure of his priestly superiors) is a true original. (I suppose if you wanted to be really picayune about it you could note some surface similarities between this and a very straightforward 1956 B-movie entitled The Leather Saint, in which John Derek puts on the boxing gloves in order to help the needy of HIS church. You could even wonder if, since both films were Paramount releases, if screenwriter Mike White and director Jared Hess had to pay some royalties. But if you do, that's not just being overly picky...it's being downright anal!) Given Black's usual amusingly over-the-top approach to his roles, which culminated last year in a full-blooded portrayal of Carl Denham in Peter Jackson's King Kong that out-hammed Robert Armstrong's work in the original, it's a real surprise to observe just how much he UNDERPLAYS his role here, and with wonderful results: at times Black even seems to be aping the hilariously off-kilter English dubbing that's a fundamental ingredient of the 1960s Mexican \"Santo\" epics that he and White are obvious devotees of. Like many one-of-a-kind movies, Nacho Libre successfully blends and embraces a number of seeming contradictions: it features almost as many bodily-function-and-fluid gags as Adam Sandler's current Click (including an unforgettable cow-pasture sequence in which Nacho's tag-team partner gets LITERALLY sh*t-faced) but they come off as strangely innocent rather than obnoxious and offensive; Hess's near-Felliniesque depiction of the impoverished locals' grotesque appearances (if there ever was a town dentist, it's apparent that he used pliers and no Novacaine) doesn't make his film difficult to watch, and Nacho's mutual puppy love for a sweet young nun (Ana de la Reguera, who resembles a cross between Anne Hathaway and Winona Ryder, so who can blame him?) is just one of many factors that makes Nacho Libre, in spite of all the bone-crushing ring action, one of the GENTLEST mainstream films of the last few years! Hess, matching the deadpan tone he brought to his 2004 cult smash Napoleon Dynamite, still has some pacing issues to overcome; like his previous film, there are definite slow spots, and Nacho Libre ultimately comes off more as a series of skits than a unified whole. But many of those skits are undeniably smile-inducers, and on the whole Nacho Libre is so engaging, offbeat and weirdly amusing that even though I wasn't at all a Napoleon fan, this makes me want to watch it again and reevaluate it. Who knows--maybe I'll actually vote for Pedro this time!"
    },
    {
      "rating": "4",
      "text": "A sweet and bizarre little movie with beautiful backdrops. This film could have been so much better with a more cohesive story. Jack Black is sincere and silly, per usual. It was weird but nice. That's the best I can tel you about this movie."
    },
    {
      "rating": "9",
      "text": "What I like about this movie and Napoleon Dynamite, is that it's stupid, yet still hilarious! So if you were a fan of the Napoleon Dynamite movie, then you will certainly like this movie, because unlike Napoleon Dynamite, it has a plotpoint throughout the entire movie. You didn't get into the plotpoint of Napoleon Dynamite until nearly the end of the movie. Anyway, it is a very funny movie, and i strongly suggest seeing it if you are a younger audience."
    },
    {
      "rating": "10",
      "text": "If you love Jack Black then you'll love this film. Laughing the WHOLE time through."
    },
    {
      "rating": "10",
      "text": "This movie was just stinking hilarious! Watch it if you have not seen it!"
    },
    {
      "rating": "2",
      "text": "This had to be one of the worst comedies in years. I saw it on a plane but nevertheless there are only so many times you can watch a guy stick his gut out and look for a laugh. A '2\" is generous."
    },
    {
      "rating": "4",
      "text": "I really like Jack Black, but this movie really robbed him of his character. The biggest problem was that the whole movie was too quiet and inactive. No offense to Paramount or the writers of Napolean dynamite, but his movie would be a lot better if anybody else wrote it."
    },
    {
      "rating": "9",
      "text": "It's Hilarious, sweet, deliberartely child-like in it's sensibility,and full of endearing characters. It also boasts one of Jack Black's best perfomances yet... What's not to like?"
    },
    {
      "rating": "0",
      "text": "A horribly, horribly unfunny film. I felt bad for the next few weeks and couldn't study because all I could think about was this movie. It has to be seen to be believed."
    },
    {
      "rating": "9",
      "text": "One of the best laughs I have had in a long time. Its also got a great moral story to go with it."
    },
    {
      "rating": "9",
      "text": "This movie was awsome. It was hilarious. I enjoyed it way more then Napolean Dynamite which i found to be nothing short of disapointing with all the hype surrounding it. This ones good, i enjoyed it alot."
    },
    {
      "rating": "5",
      "text": "Despite Black's attempts to make this film work (singing, accent, tights), the plot was simply underdeveloped, choppy as heck, and lacking in a purpose the audience could get behind. At times the scenes were so random that it seemed more like a sketch comedy show than a coherent film. I wanted to like this film; I had pegged it as a hit from the start. Sadly, this film disapoints. Good try Mr. Black; maybe next time."
    },
    {
      "rating": "10",
      "text": "The critics who are so harsh on this movie obviously didn't watch it with a crowd. People werre literally rolling on the floors. Maybe it was just Lucha fans. I enjoyed it."
    },
    {
      "rating": "9",
      "text": "Hess' style is all over this movie. The quirky characters and his ability to capture a great feel for his location by using many locals in the movie. It's funny and heartwarming at times. Black is great and extremely likeable in the movie. People need to relax and enjoy."
    },
    {
      "rating": "0",
      "text": "A racist, stupid, insulting un-funny so-called comedy that will leave you wishing you had gone to see Cars instead."
    },
    {
      "rating": "9",
      "text": "This movie is hilarious. I talking tears were rolling down my eyes, and I felt outta my chair and hit the ground. When Jack Black starts singing his tribute to the nun around the end of the movie...I thought I was gonna die. TOO Funny. If you're looking for a movie with jokes go check Nacho Libre. If there is a fault for the movie, there are a couple of dry scences and the wrestling matches are whatever."
    },
    {
      "rating": "9",
      "text": "Great movie. Very funny, something I haven't seen in sometime. I love the way Hess can put a movie together. He has a talent that very few in the movie industry possess. It's refreshing to watch something genuinely funny as opposed to the calculated manufactured crap hollywood tries to cram down everyone's throat and tell us it's supposed to be funny. Jack Black is also brilliant."
    },
    {
      "rating": "9",
      "text": "This movie is witty and silly. It takes you to a time in Mexico where the \"Luchador\" was idolized. Reminisant of the days of \"El Santo\". Wonderful movie."
    },
    {
      "rating": "1",
      "text": "This is probably one of the worst movies I've ever seen. The best part of this movie were its TV commercials. The movie's plotline didn't make sense and I found it confusing at many moments throughout the movie. Avoid this movie at all costs; WORST movie of the summer."
    },
    {
      "rating": "9",
      "text": "This was hysterical, with awesome music and catchy, funny phrases. Ok, so it didn't have the best story line, but neither did Napoleon. It's not about the story line-it's how clever the lines are, how interesting the characters are. If you liked Napoleon Dynamite, you'll like this movie. If you like Jack Black and music, you'll like this movie. It's hilarious. Not every movie is meant to \"analyze\" and read into."
    },
    {
      "rating": "0",
      "text": "Pee-you! This one stinks like the farts peppered throughout the film."
    },
    {
      "rating": "7",
      "text": "Very funny. I spent a few days after watching the film running the different lines through my mind. True, the gratuitous fart sounds were cheap but that is only unforgivable if that was all the movie had to offer. I think Nacho Libre was clever and not lacking in depth. Despite the foolery on the surface of the film, I think Hess and wife (who are the Hess brothers?) dealt with issues of identity and religious conviction with subtelty and feeling."
    },
    {
      "rating": "4",
      "text": "See Roger Ebert's review... he got it correct. I am a Jack Black fan and was terribly disappointed. Some interesting & funny scenes, to be sure, but they are very few and far between. School of Rock was so much better. Ah well... even good comedic actors make bad films from time to time. Comedy, I think, is so much harder to pull off and sustain than drama. I mean, JackAss 2 was a much better film, in terms of out and out humor (as gross and infantile as it is)."
    },
    {
      "rating": "9",
      "text": "Not quite as good as Napoleon Dynamite, but just as underrated by the critics. There are two movies here: a weird, subtle successor of Napoleon Dynamite, and and over-the-top Jack Black comedy that embraces its imperfections. These prop each other up like a couple of Hessian nerds, and make for a disjointed but fun movie."
    },
    {
      "rating": "9",
      "text": "One of the funniest movies I've ever seen! Jack Black did such an awesome job."
    },
    {
      "rating": "1",
      "text": "I loved Naplean Dynamite but I turned this movie off after I didn't laugh during the first 40 minutes."
    },
    {
      "rating": "0",
      "text": "Absolutely dreadful. I couldn't make it through it in one sitting. Took me three attempts to see the whole thing, and I felt stupider for having watched it. The only thing that made me laugh (it was a forced laugh) was a fart joke. They then repeated the fart joke, half a dozen times, and it got embarrassing."
    },
    {
      "rating": "9",
      "text": "I guess it's one of those films where you either love the sense of humor or you find it completely unamusing. I laughed the whole way through. Jack Black is hilarious and Ana De La Reguera is angelic and drop-dead gorgeous at the same time (even though she plays a nun). Watch it, just in case you love it."
    },
    {
      "rating": "10",
      "text": "HIlarious. I was crackin' up from beginning to end. Definitly a Jack Black hit."
    },
    {
      "rating": "1",
      "text": "I like Jack Black, but this movie is plain horrible. Honestly, its one of THE worst movies I have seen in my life. I could not watch it in one go, it was that dull. There is no screenplay, no thought to it. It all relies on Black doing his stuff. He is funny at times, but the whole movie is pretty depressing (!)."
    },
    {
      "rating": "10",
      "text": "I just have to give it a ten because I can't stop thinking about so many of my favorite parts. My girlfriend and I bought it for my brothers b-day and I have watched it 3 times since and can't wait to wantch it again. It get's funnier and funnier and funnier! With this talent I could see a sequel even being great...hint..hint. I want more Black and Jimenez. I only remember two farts??? I guess I NEED to watch it again, including watching many of my favorite scenes in slow motion :) Splendidly sweet and stupid...I love it!!!"
    }
  ],
  "recommendations": [
    "one_year_one_night",
    "white_chicks",
    "the_three_stooges",
    "the_dictator",
    "hot_tub_time_machine",
    "jackass_presents_bad_grandpa",
    "this_is_the_end",
    "the_watch",
    "the_hangover",
    "dinner_for_schmucks",
    "a_haunted_house",
    "ted_2",
    "dumb_and_dumber",
    "dumb_and_dumber_to",
    "30_minutes_or_less",
    "scary_movie_4",
    "anchorman_2_the_legend_continues",
    "scary_movie_2",
    "grown_ups",
    "a_million_ways_to_die_in_the_west",
    "tropic_thunder",
    "hot_fuzz",
    "ted",
    "22_jump_street",
    "miss_march"
  ]
}