{
  "id": 4513,
  "title": "Nancy Drew and the Hidden Staircase",
  "starring": [
    "Sophia Lillis",
    "Sam Trammell"
  ],
  "runtime": 89,
  "genre": [
    "Crime",
    "Family",
    "Comedy",
    "Mystery"
  ],
  "description": "Nancy Drew, a smart high schooler with a penchant for keen observation and deduction, stumbles upon the haunting of a local home. A bit of an outsider struggling to fit into her new surroundings, Nancy and her pals set out to solve the mystery, make new friends, and establish their place in the community",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/g805FevFI8BkmvorvyITZ1kGJcr.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 8.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Don't  for a god damn second think about seeing this movie. It doesn't hold a candle to the true Nancy Drew flick with Emma Roberts. This imposter thinks she's rebooting this series but the only thing she'll be rebooting is her career after this movie ruins it."
    },
    {
      "rating": "8",
      "text": "I really enjoyed the movie, it reminded me of the games, and I really love the modern take on Nancy. The acting I quite enjoyed and the plot was very much like the books. There were a few scenes in the beginning that were supposed to be funny but weren't that funny to me, but as the movie went on (like past the 10 minute mark), it got better. This movie was very fun to watch, I believe kids and Nancy Drew fans alike would really enjoy themselves during this film. BUT, you have to remember that this is a MODERN take on Nancy Drew and is only rated PG."
    },
    {
      "rating": "3",
      "text": "Incredibly simplistic, incredibly basic.The Nancy Drew stories are pretty elementary therefore there's very little to grab. No doubt, its intended audiences might enjoy it, but to me was trash."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)The Downey Jr. of \"Sherlock Holmes\" turned into a 16-year-old girl girl with the skateboard: cute but too implausible."
    },
    {
      "rating": "8",
      "text": "It was cute. Not the greatest movie I've ever seen but it really made me want to read the book again. Watching this I remembered how I felt reading the book the first time. I hadn't gotten that feeling in awhile."
    }
  ]
}