{
  "id": 2329,
  "title": "Nanny McPhee",
  "starring": [
    "Emma Thompson",
    "Colin Firth"
  ],
  "runtime": 97,
  "genre": [
    "Fantasy",
    "Comedy",
    "Family"
  ],
  "description": "Widower Cedric Brown hires Nanny McPhee to care for his seven rambunctious children, who have chased away all previous nannies. Taunted by Simon and his siblings, Nanny McPhee uses mystical powers to instill discipline. And when the children's great-aunt and benefactor, Lady Adelaide Stitch, threatens to separate the kids, the family pulls together under the guidance of Nanny McPhee.",
  "releaseYear": "2005",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/j9zWPwaHDWE3K1Mb5RNahzwd3KY.jpg",
  "categories": {
    "plot": 6.25,
    "acting": 7.142857142857143,
    "ending": 7.0,
    "soundtrack": 4.0,
    "cinematography": 7.0,
    "familyFriendly": 6.333333333333333,
    "funny": 7.666666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "very entertaining movie thanks to Emma Thompson."
    },
    {
      "rating": "0",
      "text": "Emma Thompson plays a dumb nanny who does gross things to children and she's a old school  nanny  . it fails to be myfavorite film . trust me it sucks for emma thompson ."
    },
    {
      "rating": "8",
      "text": "Nanny McPhee is a delightful film. Many critics seem to have forgotten that films are made for particular audiences (few of which are composed solely of critics). I went to a press screening and brought along my 10-year-old and his buddy and they had a phenomenal time."
    },
    {
      "rating": "6",
      "text": "This movie was pretty predictable, and didn't have the oomph you could tell it was supposed to have. An enjoyable experiance though, with colors and costumes to keep you interested."
    },
    {
      "rating": "8",
      "text": "This more was a fun forget your day type of movie. Something that yes doesn't shock you but something that you can get lost in and just have fun with."
    },
    {
      "rating": "10",
      "text": "Nanny McPhee is filled with the magic of family love. If you're in the mood for a charming fairy tale, this one will sweep you away."
    },
    {
      "rating": "8",
      "text": "This movie totally captivated my whole family from age 5 to 40. Loved it, especially the donkey scene and the baby in the stew pot scene."
    },
    {
      "rating": "6",
      "text": "Looking at the DVD box and the talented actors, one is expecting a good movie. Alas, it turned out to be predictable and too long. Our kids asked more than once when it would end -- not a good sign!"
    },
    {
      "rating": "3",
      "text": "It would take more than a spoonful of sugar to get this down."
    },
    {
      "rating": "10",
      "text": "Very entertaining. Everyone in our party enjoyed this movie. Some great talent and clever scenes. We are looking forward to adding this to our DVD collection."
    },
    {
      "rating": "7",
      "text": "It is a cute little story about a houseful of horrid kids and an inattentive widower who, with a little help from a stern Nanny (and a little magic), are turned into a happy home. The family's progress can be seen in the Nanny's face!"
    },
    {
      "rating": "7",
      "text": "Fun, but not memorible. A British \"Lemony Snicket\"."
    },
    {
      "rating": "9",
      "text": "The whole movie surprised me. After seeing the ad, I expected a goofy disaster, but instead recieved a glorious, moving \"remake\" of Mary Poppins."
    },
    {
      "rating": "5",
      "text": "It's not a bad movie. It's just not a very good movie either. This would have been better if it were more realistic. The impossible movie magic that that it uses, ruins the real magic it could have had."
    },
    {
      "rating": "8",
      "text": "Charming, surprising - I'll give eight, since I was with my 8 and 3 year olds. Worked marvelously with them."
    },
    {
      "rating": "5",
      "text": "My 4 year old loved it, my 10 year old found it enjoyable but oh so predictable, and I sat there wishing I'd waited for it to come out on video."
    },
    {
      "rating": "5",
      "text": "Purely uninteresting for anyone over the age of 10. It makes little real sense, and certainly lacks an interesting plot. Don't worry about skipping this one everyone!"
    },
    {
      "rating": "9",
      "text": "Inventive, creative, charming and quirky. You can hardly ask for more from a family movie. See it with or without a kid!"
    },
    {
      "rating": "5",
      "text": "You'd think that any children's movie that opens with cannibalism and decapitation (both pretend!) would rank as some kind of instant cult classic along the lines of Willie Wonka and the Chocolate Factory or Time Bandits, but you'd be disappointed at how quickly this slides into utter blandness. Despite its highly stylized, wildly colorful period sets (which look far more art-directed than actually lived-in) this adaptation of Christianna Brand's popular books comes off as...well, rather colorless. I'm sorry to report that a big portion of this falls right into the lap of adapter/star Emma Thompson, who despite playing a character with two warts, a set of eyebrows that makes Frida Kahlo look like Kate Moss, and a nose that makes Thompson appear to have frequently been on the winning end of a series of gin-guzzling contests with W. C. Fields, underplays the title character so much that she comes off as invisible as the hero's late wife, represented by an empty pink armchair. Said widower (Colin Firth), overwhelmed by the bucketload of kids he's not doing well at all at disciplining (although the double-digit broods recently seen onscreen in Yours Mine & Ours, Cheaper by the Dozen 2 and The Prize Winner of Defiance, Ohio make him seem like the Planned Parenthood poster boy by comparison), hires the mysterious, vaguely supernaturally gifted McPhee to instill some order; she not only does that but straightens out his prospects for Wife #2. Among screenwriter Thompson's and director Kirk Jones' sevewral unimaginative decisions is that of making the reduction or elimination of McPhee's facial oddities disappointingly literal: she loses a wart or other imperfection every time she accomplishes a job-related goal, but it would've been far more interesting to render this process a lot more ambiguous (did she really become prettier as she goes along or does it just SEEM that way to the kids because they've grown to love and respect her?) Curiously, the movie's best set piece by far is the one that doesn't involve McPhee at all--it's the cleverly timed sequence where the dad endeavors to protect the Would-Be Wife From Hell from all manner of slapstick sabotage aimed at her by the children. Part of this is because Celia Imrie is not only so much fun to watch and listen to as the predatory, mercenary marriage candidate, but appears to be the only cast member (yes, kids included) who really looks like she's having a good time. Undemanding family films like this are reminiscent of G-rated pablum like Chitty Chitty Bang Bang that parents in the late 1960s took their children to, fervently wishing (either during the film or while excusing themselves for lobby smoke breaks) that ten or twelve movies could be shown in the same building so they could park the kids there while watching something provocative like Easy Rider or Midnight Cowboy. Oh well, if you've got YOUR kids for the afternoon, and Munich or Brokeback Mountain are playing at the same multiplex..."
    },
    {
      "rating": "7",
      "text": "The Story Line Of The Movie Is Average, Because Of The Scenes Where McPhee Makes The Animal's Turn MAGICA!!! :)As For The Child Actors..... Sometimes They Seem To Ruin The Movie For Any One Watching Nanny McPhee... This Film Is Cute For Younger Children Because Of The \"Magic\" And The \"Fun\" Thrown Out In The Movie...The Special Effect's Are So-So Because When The Animals Are Dancing It Looks Fake..This Was Not The Best Or The Worst Movie Of 2006..."
    },
    {
      "rating": "7",
      "text": "The movies colors almost blind me to death, and even though it is pretty childish, the ending feels as true magic that movies can create. Good to enough to enjoy with all the actors."
    },
    {
      "rating": "5",
      "text": "Nanny McPhee an all round family movie for the family but some floors that did not impress my Squeamish brother. Another down side to this movie is the plot is around a slightly dark thought of a man who needs to marry or no rent fair enough but this movie scores a 5.5 out of 10 for its lack of fun and differences in the movie.Still if your looking for a good family movie to watch with a bowl of popcorn GO FOR IT."
    },
    {
      "rating": "8",
      "text": "Few films make me smile. \"Nanny McPhee\" did it the right way, providing gleefully entertaining characters with an enjoyably silly story. Still haven't seen the sequel -- don't know why they made it one -- but this picture will remain as one of my all-time favorite movies, thanks to Emma Thompson's likable performance and joyful character moments.\r Final Score: 8/10."
    },
    {
      "rating": "7",
      "text": "Nanny McPhee is a fun kids movie and overall an enjoyable watch. It has a magical aesthetic to it that I enjoy and that makes the movie feel worthwhile to watch."
    },
    {
      "rating": "4",
      "text": "Jones's fatal attempts of creating a magical music number as Mary Poppins unfortunately fails on all levels in here.Nanny McPheeJones's fatal attempts of creating a magical music number as Mary Poppins unfortunately fails on all levels in here. To what was supposed to play on props and create awestruck delightful moments with the kids, is instead left out dry and unexplored in here. This overly rotten out formulaic structure of the script is not only outdated but is so poorly conceived that it doesn't stand on its own grounds, it contradicts its own nature. The mythical aspects of the storyline that was supposed to attract the viewers, seems like is pretentious and a metaphor gone wrong case.The reasons and concept may have a heart but that heart isn't pumping at all for either the viewers or the characters. The result is pure Sunday morning venture, you have seen this morning before too and the plans that it has for you is something that you are not looking forward to. Having said that, it doesn't suggest that there aren't any good bits in here. The usual sketchy sequences between the kids and a nanny, the tactics used by bratty mischievous kids and the gags that leads to the bonding of the kids to a newer member of the family, somehow in its giddy nature works like a charm.Thomson as the nanny herself who also co-wrote the script, is a delight to watch, her caring nature with productive methods and impressive tricks up her sleeve, elevates the momentum and raises the bar of the feature. On the supporting cast, the younger cast has decently managed to stay on the track along with Firth as the man in charge and Macdonald as the driver, who are convincing on their roles. Nanny McPhee is the perfect gift for your kids but only up till its first half, the second half is a big old sobbing mess."
    },
    {
      "rating": "8",
      "text": "A great movie for the whole familyIn this fantasy movie we find a widower on the verge of a nervous breakdown. Lonely since his wife's death, he has to divide his time between running his funeral home and raising his many children. To make matters worse, the kids are real brats who scare away all the mistresses their father arranges to look after them. But everything changes when a special nurse comes to that house.It is a film clearly aimed at young audiences, but it will certainly be well tolerated by adults. Colorful, cheerful and very fun, has a good story where it conveys good educational values such as respect, friendship, family value. Of course everything is a bit predictable, but even so the movie proves to be catchy. Despite the strength of the kids, who are reserved for the hilarious moments of the movie, the movie is expertly directed by two or three very experienced adult actors who quietly steer it all: I'm talking, of course, about Colin Firth and Emma Thompson, but especially this actress who, in addition to giving life to the lead role, also ensures the writing of the script. She, better than anyone, understood well what the film needed and knew to be up to it. In addition, the film also features the brilliant participation of veteran Angela Lansbury and the sweetness of Kelly Macdonald.Technically, the film bets heavily on CGI and quality visual and sound effects. A bet that surprises us nothing but does not detract from the final product. Good costumes and scenery help, although I had trouble digesting such an overt abuse of the almost ubiquitous green, yellow, and pink colors. This made the movie visually tiring. Patrick Doyle has signed the soundtrack, which looks beautiful in the film, though not exactly in the ear."
    },
    {
      "rating": "8",
      "text": "I still remember seeing this film in theaters for the first time as a child, and I've seen it many more times since. I have thoroughly enjoyed this movie every time. It's fantastical, set in a fantasy world that is similar to our own, much like the common fairy tale set in realism. Colin Firth and Emma Thompson do an incredible job in their roles, as do all of the children. Much like a fairy tale, you can sense what the ending will be early into the film, but not sure how you may end up there. This movie is funny at the appropriate times, especially for children, and is quite frankly, a visually stunning film due to the color choices in costume and set. I would recommend this film to anyone with a child, or anyone who is still young at heart and enjoys tales of magic and overcoming worldly evil."
    }
  ],
  "recommendations": [
    "christopher_robin",
    "paddington",
    "the_kid_who_would_be_king",
    "the_house_with_a_clock_in_its_walls",
    "zathura_a_space_adventure",
    "rise_of_the_guardians",
    "ferdinand",
    "enchanted",
    "dora_and_the_lost_city_of_gold",
    "the_spiderwick_chronicles",
    "moonrise_kingdom",
    "ella_enchanted",
    "rio_2",
    "the_polar_express",
    "the_peanuts_movie",
    "coraline",
    "the_croods",
    "bolt",
    "we_bought_a_zoo",
    "finding_dory",
    "the_willoughbys",
    "hotel_transylvania_2",
    "meet_the_robinsons",
    "nightbooks",
    "stardust"
  ]
}