{
  "id": 3053,
  "title": "National Treasure",
  "starring": [
    "Nicolas Cage",
    "Diane Kruger"
  ],
  "runtime": 131,
  "genre": [
    "Adventure",
    "Action",
    "Thriller",
    "Mystery"
  ],
  "description": "Modern treasure hunters, led by archaeologist Ben Gates, search for a chest of riches rumored to have been stashed away by George Washington, Thomas Jefferson and Benjamin Franklin during the Revolutionary War. The chest's whereabouts may lie in secret clues embedded in the Constitution and the Declaration of Independence, and Gates is in a race to find the gold before his enemies do.",
  "releaseYear": "2004",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pxL6E4GBOPUG6CdkO9cUQN5VMwI.jpg",
  "categories": {
    "plot": 6.681818181818182,
    "acting": 6.142857142857143,
    "ending": 8.833333333333334,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.5,
    "funny": 9.142857142857142,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Definitely not as bad as the critics make it out to be, but National Treasure's storyline is very preposterous. The acting is O.K., and I'd say so is the movie. The history is terrible, however."
    },
    {
      "rating": "9",
      "text": "National Treasure is an enormous flawless movie, and it's very entertaining and exiting.\r The opening scene in National Treasure is completely super, and I really enjoyed the historical references in this wonderful movie. The story might be one of the best ever made, and combined with the enormous well played actors, couldn't this movie be more awesome as it is. National Treasure is an exiting movie that keeps me entertained, and it's also funny. The amount of action in National Treasure is the greatest thing about this movie, because it's so fascinating and entertaining. Another thing that's great about this movie is the music, it's so damn good! The ending in National Treasure is wonderful, and the movie overall never felt boring at any time, which is why I'm giving National treasure a 9/10.\r National Treasure gets a 9/10"
    },
    {
      "rating": "8",
      "text": "I'm not sure if my dvd of National Treasure was the same as the critics but I thought this movie was fantastic. Sure there was some faults here and there but personally I'd rank this on my top 5 N. Cage movies. I thought Sean Bean was great in this film and people that don't like it is probably because they already know about American History so they know that a low of stuff in the movie is BS but I didn't know much about the Founding Fathers etc so I guess I understood it more on a movie persperctive"
    },
    {
      "rating": "10",
      "text": "This is definitely one the critics just couldn't understand.  National Treasure was a fantastic movie, especially for a history geek like me.  Nicolas Cage isn't quite as crazy, Diane Kruger is surprisingly good, and Justin Bartha makes one of the greatest comic reliefs in Riley I've ever seen."
    },
    {
      "rating": "10",
      "text": "A light-hearted film with a great plot, which when combined with its revenue becomes another example of \"Don't trust the critics\". But judging by the \"average rating\" I guess that any film that doesn't have end of the world scenes or over-the-top violence in it is deemed inferior today."
    },
    {
      "rating": "7",
      "text": "National Treasure is Disney's attempt at Indiana Jones and for the most part it works. The films are entertaining in the fact they are simplistic and yet well constructed. National Treasure revolves around Ben Gates (Benjamin Franklin Gates if you want to emphasise a stupid plot device) as he travels the US looking for clues leading to a treasure of unimaginable wealth with the assistance of Tech Wizz Riley Poole, Art Restorer Abigail Chase (if you didn't know it was a chase movie) and his father Patrick Gates. All the while they are trying to stay ahead of a rival treasure hunter Ian Howe. The film moves from set piece to set piece well with the film never really stopping to relax. This unrelenting pace makes the film thoroughly enjoyable. However they still make it easy to follow making the viewing easygoing which is exactly what is needed from a Disney film. That being said the film seriously embraces cheese both in its script and in some of the action and at times its hard not to notice. However the overall feel is one of lighthearted fun and that is exactly what you will have watching the film."
    },
    {
      "rating": "10",
      "text": "National Treasure is an intriguing adventure film with an interesting premise and carefully plotted clues about America's biggest secrets. Nicolas Cage is great as Ben Gates, and this is one of his best roles."
    },
    {
      "rating": "7",
      "text": "Decent FilmIt’s not perfect and can get sloppy at times, But National Treasure is still a fairly interesting film."
    },
    {
      "rating": "6",
      "text": "I love Nicholas Cage in this movie, it's a very clever and fun movie and I'd even say it's an interesting movie for the most part but the biggest negative I've got with this movie would have to be the plot. The plot for the movie had me so muddled to what was happening with the characters at most points but it was a fun movie for the most part."
    },
    {
      "rating": "10",
      "text": "Fantastic movie. Screw the critics."
    },
    {
      "rating": "10",
      "text": "The critics have this all wrong. National Treasure was one of the best movies ever. P.S. There are like 50 guys who gave this a N/A score but said they loved it. What's up with that?"
    },
    {
      "rating": "10",
      "text": "Im shocked at the critics review of this movie. I specifically joined to put my 2cents against them. One of my all time favourites. National Treasure has had a lasting affect on me. I've never met anyone who didn't like it. If you're into a mission impossible style movie this is a must watch. It has action adventure comedy romance and a happy ending, what else could you want in a feel good movie! It had fantastic twists all throughout, in particular the end. Its not the pianist or shindlers list- not all movies are like this nor would we want them all to be."
    },
    {
      "rating": "0",
      "text": "The worst movie script I have ever seen, surpassing even Star Wars Episode III, and that's saying alot."
    },
    {
      "rating": "10",
      "text": "WHY the low ratings?? This movie was AWESOME! Not accurate to history, but SO WHAT?? It was incredibly entertaining!"
    },
    {
      "rating": "3",
      "text": "This wasn't good and it wasn't awful, but it was pretty bad. It was all running and chasing and goodies outwitting baddies etc etc. All the conventional stuff. Plus, on the DVD animatic they have blatantly stolen the Pirates of the Caribbean Soundtrack."
    },
    {
      "rating": "9",
      "text": "A surprisingly entertaining PG film starring Nic Cage! The treasure hunting was whimsical and gripping at times! Definitely a must watch!"
    },
    {
      "rating": "10",
      "text": "One of the best movies I’ve ever seen. Who doesn’t love a movie about a treasure hunt?!"
    },
    {
      "rating": "7",
      "text": "Although some of the characters do need some tuning the clues the story the history it was all perfect that has to be one of the best action movies with a meanigful plot that i have ever seen."
    },
    {
      "rating": "7",
      "text": "A watered-down Indiana Jones with no lasting lessons, but otherwise good taut entertainment with one foot tip-toeing through our national history, the other firmly bolted down in La-La Land."
    },
    {
      "rating": "9",
      "text": "I thought this was a great popcorn flick. Very engrossing and lots of fun. Compare this to the Da Vinci Code movie, where my girlfriend started counting the number times I yawned. Yeah, National Treasure may be a derivative work, but the plain and simple fact is that it works and Da Vinci Code doesn't."
    },
    {
      "rating": "9",
      "text": "An excellent film. Great acting, action, etc. This movie is very believable and appealing to both adults and kids. I loved it. I will never be able to figure out why so many people hate the film, because I thought it was out standing, unlike the sequel. See this movie!"
    },
    {
      "rating": "7",
      "text": "Yeah it was dumb but it was dumb fun, just like the Da Vinci Code. What, did you think the DaVinci code was genius or something? Come on. It's entertaining, it's fun, a bit silly, and a bit fascinating."
    },
    {
      "rating": "9",
      "text": "This is an entertaining movie, which deserves better ratings than it receives on metacritic. Those who criticize the plot as unlikely probably praise movies such as Spiderman and King Kong, so I think they miss the point here. This film fits comfortably into the Indiana Jones style of adventure-comedy-romance genre. It may not be art, or revolutionary, nor challenge the viewer, but it's fun to watch, which is more than I can say for a lot of movies these days. If you like adventure flicks, this one is worth a look."
    },
    {
      "rating": "10",
      "text": "Wow, it's amazing how critics are almost always universally wrong these days. This is a fun, entertaining, and interesting movie. It's thoroughly enjoyable from beginning to end."
    },
    {
      "rating": "7",
      "text": "Despite all its references to things and people of great cultural importance to the USA, National Treasure is a popcorn movie. The plot is absurd, as is nearly every plot twist - but it's all done in good fun, and the turns are executed quickly so that you don't dwell on how outlandish the story is. In terms of a plot living off a massive conspiracy theory, it's more entertainingly executed than things like Da Vinci Code or Conspiracy Theory. Just like those movies, if you go to it for an education, you're asking for disappointment. This movie is good for fast-talking drama, mystery by way of adventure, and attractive people following absurd plans in the name of truth. It's just fun; don't look for anything more than that in it, or you'll lose it."
    },
    {
      "rating": "7",
      "text": "I watched this film to follow a genre that seems to have been lost in Hollywood over recent years, adventure. Its exactly what I got and i thoroughly enjoyed it. There are probably many things wrong with this film but if you just want to relax for a couple of hours and take movie with a pinch of salt, then this film is great. Thoroughly enjoyable plot, good action sequences and a nice enough cast. All good fun."
    },
    {
      "rating": "0",
      "text": "I could write a long review, but I'll save us all a lot of trouble. This movie sucks."
    },
    {
      "rating": "8",
      "text": "It was fun and entertaining throughout. If you liked the rock, or con air, you'll like this."
    },
    {
      "rating": "10",
      "text": "I really don't know how this got such bad ratings. My family & I really enjoyed it."
    },
    {
      "rating": "0",
      "text": "Perfect...for the home version of \"Mystery Science Theater 3000\"...this movie is so bad it is almost laughable...if it were not so flabbergastingly absurd."
    },
    {
      "rating": "10",
      "text": "39/100 for National Treasure? All I can say is WOW, I don't know what movie critics are looking at when watching a film. National Treasure was well-paced with with the right amount of humor and action, and a satisfying payoff when it's all said and done. This is one of my favorites, and am shocked at the lack of kudos given to this film. I watch a movie for entertainment value. Apparently movie critics are looking for something else."
    },
    {
      "rating": "7",
      "text": "Not the best Disney (or general) film ever, but still pretty darn good for my tastes."
    },
    {
      "rating": "8",
      "text": "The first thing that I liked about this movie is that it starts out mysterious. I like these types of movies because it leaves me thinking and is not boring. The second thing that I liked about this movie is that things like clues lead to other things and it keeps you guessing. I did this throughout the whole movie. I had to watch it twice just to get it better."
    },
    {
      "rating": "7",
      "text": "A really interesting and entertaining movie.  Lots of fun and I was really intrigues as to where and what the treasure would be.  There were also lots of good chases and action.  Pretty dece."
    },
    {
      "rating": "7",
      "text": "National Treasure does seem just unbelievable at times, but thanks to its talented cast, its wit and humor it ends up being one of the most entertaining films in recent years. I give this film a solid 74%."
    },
    {
      "rating": "5",
      "text": "There's no doubt that it is a fun and entertaining movie so critics hating on this movie so severely kind of baffles me. My only gripe would be that it ran 20 minutes too long. The movie is incredibly slow at times and it could have been much faster to save it from becoming boring. Other than that, I really have no complaints. The story was entertaining enough, The cast did a good job. It was just needlessly long."
    },
    {
      "rating": "7",
      "text": "Disney has itself written all over this one. Regardless, National Treasure is one of the few historic adventures that may be able to entertain our easily bored audiences of today. Nicolas Cage is more than adequate and, frankly, the story is downright interesting."
    },
    {
      "rating": "8",
      "text": "National Treasure is a wonderful adventure, showing all the great landmarks of this country. Giving us a history lesson never seem boring, even through the eyes of Nicholas Cage. The score was heart pounding and so was the movie."
    },
    {
      "rating": "8",
      "text": "Solid entertainment. Misinterpreted history has never been more fun. The action, the music, the one-liners, they all blend well together. Nice to see some landmarks."
    },
    {
      "rating": "6",
      "text": "\"National Treasure\" is the sort of movie that when you're watching it, you think it's great, but after watching it and you think it through, it's just kinda silly. You'll find many of the historical contents ridiculously inaccurate. Unless you slept through history classes, that is."
    },
    {
      "rating": "5",
      "text": "This film is so much fun! I love History and the film is pretty exciting, and honestly, I can't complain with that. The script and acting is average, but the movie is fun and the characters are likable."
    },
    {
      "rating": "5",
      "text": "National Treasure fails to strike gold.\rWith a very interesting and well thought out premise, National Treasure exceeds to entertain and fails royally to actually explain the motives and decisions of many of the characters."
    },
    {
      "rating": "8",
      "text": "I can't begin to understand how so many people hate this movie, it is a great movie and fun to watch. I really liked it and Nicholas Cage is a great actor. I recommend watching this movie if you haven't already"
    },
    {
      "rating": "6",
      "text": "I remember watching it the day before winter break in History class. At the time, I found it a good movie. Reviewing the movie outside of history class? Not so great. The plot can barely be called a plot, but the actors/actresses try their best. Overall, the movie is a \"meh\", although it makes a nice boredom breaker.\rAnd hey, it has Nic Cage!"
    },
    {
      "rating": "9",
      "text": "OMG. Why all those critics didn't like it? This film is great. Maybe some puzzles are really try-hard and even pro treasure hunter can't be so intelligent to solve it but still idea is brilliant plot is brilliant, this damn movie is brilliant!"
    },
    {
      "rating": "5",
      "text": "If you are not looking to its improbable plot or you are not trying to find all the flaws this movie conceives, \"National Treasure\" is quite a fun ride for you. However, the hammy dialogue and complicated narrative still does not convince me."
    },
    {
      "rating": "5",
      "text": "The critics **** this up big time. This movie does not deserve a 39/100. It has a basic \"Find the treasure\" storyline, though some questionable things such as many of the group turning AGAINST them for some odd and subtle reason and Brown instantly solving every single clue like he is **** Sherlock Holmes x1000 this movie is pretty cool. You don't quite get that much of an excitement from this movie, which you should."
    },
    {
      "rating": "7",
      "text": "Although technically the film wasn't very good (the acting was ok at best and the main plot details we pretty obvious) I had quite a lot of fun watching it. I was able to get into the story and it felt like I was going on this journey with them. I really liked the figuring out the riddles and the adventures and it seems this film is a guilty pleasure of mine."
    },
    {
      "rating": "8",
      "text": "Exceeds Expectations.  The critical reception for this film was terrible.  But the movie itself was very pleasing.  The film thrives from strong direction, a good original screenplay, and strong performances from Nicolas Cage, Diane Kruger, Justin Bartha, John Voight, and Sean Bean"
    },
    {
      "rating": "10",
      "text": "National Treasure is the ultimate adventure movie. There are lots of hilarious scenes with hilarious dialogue, and the suspenseful ending balances it out. I love the historical connections---History is my best class, I always get an A--- although the facts are somewhat stretched, it turns out to be a great mystery.  Nicholas Cage is brilliant as Ben and Diane Kruger is a great choice for her supporting role, I loved the chemistry between Ben and Abigail!\rAlso whoever wrote the score is a musical genius!"
    }
  ]
}