{
  "id": 3134,
  "title": "National Treasure: Book of Secrets",
  "starring": [
    "Nicolas Cage",
    "Jon Voight"
  ],
  "runtime": 124,
  "genre": [
    "Action",
    "Adventure",
    "Mystery",
    "Thriller"
  ],
  "description": "Benjamin Franklin Gates and Dr. Abigail Chase re-team with Riley Poole and, now armed with a stack of long-lost pages from John Wilkes Booth's diary, Ben must follow a clue left there to prove his ancestor's innocence in the assassination of Abraham Lincoln.",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xxoIBbvmTj1ZttzV439jAvoovTw.jpg",
  "categories": {
    "plot": 4.636363636363637,
    "acting": 4.5,
    "ending": 1.5,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 4.9,
    "funny": 4.666666666666667,
    "action": 6.125
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Not as good as the original National Treasure, and even that was pretty horrific. The acting as always, is O.K. It's always the crazy and unbelievable storyline that ruined both movies."
    },
    {
      "rating": "0",
      "text": "The success of this sequel at the box office only goes to prove that once the first movie is a hit no matter how truly awful the subsequent movies are it really doesn't matter. As much as we loved the original the characters, the polar opposite is true with the sequel. It is simply awful with bad acting, writing and directing. In truth it is a movie for idiots. You need to suspend all belief before entering the theater. And even then the story isn't even the slightest bit plausible. They will make another and my recommendation is to wait to see what the moviegoers like us say before putting down our hard earned dollars to watch garbage like this. I feel so cheated."
    },
    {
      "rating": "0",
      "text": "I was robbed. This is a movie for mindless simpletons."
    },
    {
      "rating": "0",
      "text": "A major disappointment of epic productions. I realize in an action adventure story that we have to suspend belief in entering the theater but this was just sooooo bad that no one could get into it. It was sleepwalking for the actors and one really felt embarassed for Helen Mirren. For someone of royal acting ability to take a part in this juvenile crass ridculous motion picture really hurt the most. Shame on you Hollywood for churning out this garbage."
    },
    {
      "rating": "2",
      "text": "What have they done? How do you take a formula that was so great in the original and completely ruin it? Somehow the produers of this awful movie have managed to do that. You need to be completely brain dead to believe this film. Just awful."
    },
    {
      "rating": "0",
      "text": "Leave it to Hollywood to totally screw it up. The story is unbelievable and appears to be written in about an hour. And the acting was just as bad sans Helen Mirren but she must be embarassed to have made such a terrible movie. Big Buzz because of the PR lured us in but word of mouth will quickly kill this Christmas turkey."
    },
    {
      "rating": "1",
      "text": "Brainless twaddle, which is usually fun, but in this movie was merely an empty space into which many dumb and lusterless lines substituted for dialogue and frenetic, physically impossible stunts substituted for action. It reminds me of Mission Impossible Two, but without the memorable theme song. I hope they get it right on number three. Also, if you are Native American, you will despise this movie and the blue-coat it rode in on."
    },
    {
      "rating": "9",
      "text": "Almost so good than the first one movie, but it is not for critics!!, is for people who go to the theaters to enjoy a good couple of hours!."
    },
    {
      "rating": "9",
      "text": "It´s a good and entertaining way of learning history. I liked the actors´ performances and I also enjoyed the scenarios shown."
    },
    {
      "rating": "0",
      "text": "For this turkey of a movie to be number one at the box office three weeks in a row only goes to prove that we are a nation of sheep or that the advertising campaign sold us a pig in a poke. Either way this movie is downright bad from the lame script to the poor acting. Awful."
    },
    {
      "rating": "0",
      "text": "Who writes this stuff? Just dreadful."
    },
    {
      "rating": "0",
      "text": "Let me sum it up perfectly. A movie for idiots made by idiots. If you plan on seeing this turkey check your brains in at the door. Revolting!"
    },
    {
      "rating": "6",
      "text": "Pretty silly action/adventure stuff, with a lame story line. Still, it was an entertaining two hours if you left your brain at home."
    },
    {
      "rating": "3",
      "text": "The movie was poor. Plot was full of flaws and holes and puzzle solving and action sequences (main part of the movie) are uninteresting. Even Cage looked bad. But I didn't expect anything else."
    },
    {
      "rating": "2",
      "text": "This is why ppl don't go to the movies anymore. This movie was just plain insulting to any logical mind. So many unbelievable situations- the car chase in London (where he uses a red light camera to take a picture of the clue, then tosses it overboard to get rid of the bad guys- come on), kidnapping the president, pouring water on the rocks to find the eagle....on an on...OMG someone in Hollywood was itching for their next dollar. Then they wander why ticket sales go down."
    },
    {
      "rating": "10",
      "text": "Well to me this film was FANTASTIC. I know this might be shocking because of what other people are saying but i think Nicolas Cage was a great actor in National treasure 1 and 2. I loved every part of the film."
    },
    {
      "rating": "8",
      "text": "Its getting to the point now where people apparently cant go and enjoy movies anymore, they apparently have to all be oscar worthy/ art house/ or critically acclaimed for them to be any good. there is absolutely nothing wrong with national treasure 2, if you liked the first on you will more than likely like this. please learn how to deal"
    },
    {
      "rating": "5",
      "text": "though seemingly exactly the same all around, it was simply worse than the first one, which was only slightly better than your average adventure flick. Still, it's decent quality family-friendly entertainment, which is hard to find these days without stupid animated animals and the same cliche characters. I did have a serious problem with the plot. It seemed as if the heros had to follow the same path as the first film, but they got into it different. Proving a historical man's innocence and finding another buried treasure just didn't click for me, or the movie (except for one line from Voight). Overall, it's halfway decent and fun, but ia waste of talent from Cage, Voight, and Mirren."
    },
    {
      "rating": "8",
      "text": "This certainly isn't an Academy Award winning movie and it's not nearly as good as the first, but BoS is an wholly entertaining popcorn flick. Yes, the premise is a lot less believable than that of the first, but it fulfills the criteria of a silly yet enjoyable movie. If you liked the first one, you'll like this as well, and if you're looking for a little action/adventure, this is a great and fun movie to watch."
    },
    {
      "rating": "6",
      "text": "It contains all the elements from the original film...But that's the problem: It's virtually the same movie with new locations. Oh, plus Helen Mirren. Not a bad addition, but the popcorn fun is gone."
    },
    {
      "rating": "4",
      "text": "Unlike the first National Treasure in which the events they talked about and the clues seemed quite plausible, that is not the case with this one. Unless you're a small child, nothing in the movie is believable, the clues/chases are dumbed down, and the suspense that was so rampant in the first film is nowhere to be seen in this one. A boring way to spend 2 hours."
    },
    {
      "rating": "7",
      "text": "Well it's not the movie of the year but it's perfect for cheap-Tuesdays."
    },
    {
      "rating": "2",
      "text": "Braindead fun... the ending is an insult to pre -colombine history."
    },
    {
      "rating": "6",
      "text": "Entertaining, tho it lost me at parts. All this trouble to clear an ancestor's name, yet it really doesn't explain how the name got cleared. Also, there never is a really good reason why the bad guy is after the treasure as feverishly as he is."
    },
    {
      "rating": "2",
      "text": "I liked the first film but the sequel is just plain bad. Some of the scenes are just totally cringe-worthy particularly the one where Nick Gage pretends to lose his mind to get arrested. I found this and the so called argumentative banter between Voight and Mirren very uncomfortable to watch. I couldn't wait for this movie to be over."
    },
    {
      "rating": "6",
      "text": "Fun, but not a scratch on the first one."
    },
    {
      "rating": "0",
      "text": "If Stan could give this abomination a 9 then I should be able to give it a minus 90. No suspense whatsoever as whoever wrote this script and directed it must have read Sequels for Dummies. Awful effort all the way around. They should be ashamed to turn out this kind of trash."
    },
    {
      "rating": "1",
      "text": "Great special effects for a video game. But for a movie? A HS kid can write a better more plausable script than this. And the actors walked through their lines as if they were coloring by the numbers."
    },
    {
      "rating": "0",
      "text": "Jason stop sniffing that glue. Obviously you are having fun as you want other moviegoers to be tortured as we were. This movie is a total turkey devoid of anything worth mentioning in a positive review."
    },
    {
      "rating": "8",
      "text": "A good entertaining movie in the tradition of Indiana Jones"
    },
    {
      "rating": "3",
      "text": "If you have an IQ of 60 or less, this film is for you."
    },
    {
      "rating": "5",
      "text": "average movie only useful to pass the time. i sort of wish it was worse because then i would have had fun poking fun at it. unfortunately that wasn't the case. but if ur expecting a lot.....then don't watch it cuz its not a lot."
    },
    {
      "rating": "6",
      "text": "This movie was acceptable, but it really didn't bring new elements to the franchise. I found the first movie more charming than the second, but it just didn't spark me as the first one did. The acting was good, not spectacular, Cage did a fine job but he looked like he was 50 in the story for supposedly being a few years(?) after the first one. The scenario with the bad guy was almost generic, nothing very special but it had it's moments. It wasn't great, it wasn't bad, it was just another movie."
    },
    {
      "rating": "4",
      "text": "Here's the problem with 'National Treasure: Book of Secrets'- it's a complete drag to sit through. And judging by the actors on screen, it was a drag for them to film- not one moment of this film is either genuinely exciting, heart pounding, or nerve-jangling- in short, it's just like the original. Now, I kinda-sorta-maybe tolerated the first one, simply because it at least embraced it's ludicrousy, but this sequel takes itself so seriously that it's near impossible to enjoy. Ed Harris turns in a semi-interesting performance, and the screnwriters were smart to try and expand Nic Cage's parent's love relationship... but when the rest of the movie looks, feels, and plain out is as tired as this reigned in follow-up... well, let's just hope that 'National Treasure 3' brings the fun."
    },
    {
      "rating": "10",
      "text": "A film for everyone except the nerdy \"critics\" who study every scene with a microscope searching for flaws. Once again, the average rating is obviously shenanigans. This film is great, and like its predecessor it has an actual plot, which makes it stand out among the gray sea of run-off-the-mill movies that rely on expensive scenery, overuse of special effects oh and excessive violence."
    },
    {
      "rating": "4",
      "text": "Past the mid-way point of \"National Treasure: Book of Secrets\", Ben(Nicolas Cage) needs a private audience with the president(Bruce Greenwood) so he seals themselves in a secret room much to the chagrin of the secret servicemen. This extra cloak of privacy hardly seems necessary since one of the president's handlers is asked to wait outside. The two men could whisper. It cheats to force action. To help normalize the preposterous, \"National Treasure: Book of Secrets\" has to play straight with its audience. It doesn't. Another instance of convolutional writing takes place at Mt. Vernon when our treasure hunters soak rocks with twelve-ounce litres of bottled water. To make their next clue self-evident, Emily(Helen Mirren) asks aloud, \"Do we have to wet the whole area?\" I laughed because it sounds like an ad-lib; a grand dame pointing out the fallacy of the scene. It's dumb luck that Abigail(Diane Kruger) chooses the right rock to wet. Imagine if Ben or Mitch(Ed Harris) insisted they search for the hidden instructions after the last bottle was emptied by using an alternate liquid? But that would be too cheeky for a film that takes itself way too seriously. Seriously, you wonder how the actors can keep a straight face. This is theater of the absurd."
    },
    {
      "rating": "7",
      "text": "Very suspensful, satisfing sequel."
    },
    {
      "rating": "6",
      "text": "One of those movies that you know is bad, but it's still enjoyable as long as you approach it open minded and not expecting it to be anything great. Nicholas Cage is a dreadful actor, it has to be said. Film is childish and far fetched but for some reason I just enjoyed it start to finish. It's odd."
    },
    {
      "rating": "9",
      "text": "I thought this was a great continuation of the first movie. They didn't make it obvious that they had discovered the first treasure... just the Ferrari. Great action and good puzzles. Must see!"
    },
    {
      "rating": "6",
      "text": "The last forty-five minutes of the film were fascinating and filled with adventure. But other than that the movie was unconparable to the first one. Unless you are really board and have nothing to do at home, I would probably not see this. It wasn't bad. It just was nothing like the original."
    },
    {
      "rating": "10",
      "text": "I have been seeing many, many over the top reviews on this film, and none of them I agree with, this movie was great yeah, one of the year's best, but they keep on saying its an unexpected masterpiece. Well, I thought it was good too, but the experience wasn't that meaningful and didn't inspire much of anything, it was normall, and seemed a bit low in standards, the acting wasn't that great, but the characters in this one get more involved with the situation, their getting more deep into problems they have to face. It makes this movie interesting and very cool. There are many bad spots of acting, especailly by NICOLAS CAGE, but becides all that, this movie easily deserves a 10. Its that simple, this is a masterpiece, I'm not joking, it truly is. It is very good. I was entertained, amused, and the locations are more exciting to look at, the camera work showed the importance of every location. I was impressed. All you got to do is call it the new Indiana Jones or one really, engaging, exciting movie."
    },
    {
      "rating": "8",
      "text": "a good fun movie, which flows along with wit and action and follows along with various mysteries with graceful answers. People who expect the crew to reinvent the plot should not be surprised, if they keep with a proven formula. Nicolas Cage does a good job in his returning role, I enjoyed the additon of Helen Mirren to add depth to Jon Voight's character with their bickering and adventure."
    },
    {
      "rating": "8",
      "text": "The movie was good the plot was a bit thin but was there, although the movie was based on the same pricnable as the first its nice to see that these kind of movies are bing made, its being made for the kids in us all, the puzzles are thought provoking and entertaining, it keeps you wanting more, there is little action to speak of, and it mostly happens at the beginning. for those wanting to see a good movie with the kids (including your self) its somthing worth seeing but if you want to be critical about everyting and want the realism of acutal tresure hunting, you should shy a way from this movie."
    },
    {
      "rating": "8",
      "text": "Good clean family fun. Enjoyable for movie buffs and even at times thrilling. Good holiday movie to see!"
    },
    {
      "rating": "5",
      "text": "First one was better."
    },
    {
      "rating": "2",
      "text": "How does Hollywood take an absolute can't miss follow-up to the original and totally destroy it and the characters. Everything we loved about the first movie is gone in Book of Secrets. Think of the Jaws trilogy after the original and you have the exact same formula that doomed a classic. Nothing here than a bunch of flawed actors collecting a paycheck. And where did they find Riley as he is awful!"
    },
    {
      "rating": "3",
      "text": "As much as I loved the original this sequel is disappointing. It's basically a continuation of the first Treasue except that the nervous suspense that kept us on the edge of our seats is totally absent. In its place is juvenile humor as the actors simply walk through their paces to collect a big fat paycheck. The movie is like one big joke that is repeated and repeated adnauseum until it is no longer funny nor suspenseful. And Ed Harris as the :bad guy\" isn't that bad at all which makes the movie even worse. Theflick is forgotten the minute you leave the theater."
    },
    {
      "rating": "1",
      "text": "You have to be kidding? The first movie was so good that I couldn't wait to see the sequel. And as good as the first one was that is how bad this movie is. You start looking at your watch as this is a grown up version of a video game and a bad one at that. Nothing is realistic, the actors are never in real danger and the ending is ridiculous. Nothing in this movie works although you want to love it. Terrible writing, directing and acting. Quite frankly it is boring and that is hard to do with an action adventure movie. Avoid."
    },
    {
      "rating": "4",
      "text": "Oh so lame, with irony that splatters the walls like so much mud. Ugh, and double ugh."
    },
    {
      "rating": "4",
      "text": "Much ado about nothing. Slow tedious and mundane. The first movie was great but this was the pits."
    }
  ]
}