{
  "id": 256,
  "title": "Need for Speed",
  "starring": [
    "Aaron Paul",
    "Dominic Cooper"
  ],
  "runtime": 132,
  "genre": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "The film revolves around a local street-racer who partners with a rich and arrogant business associate, only to find himself framed by his colleague and sent to prison. After he gets out, he joins a New York-to-Los Angeles race to get revenge. But when the ex-partner learns of the scheme, he puts a massive bounty on the racer's head, forcing him to run a cross-country gauntlet of illegal racers in all manner of supercharged vehicles.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z42kyMizgDKetejusZgucSQsQ4l.jpg",
  "categories": {
    "plot": 6.738095238095238,
    "acting": 7.033333333333333,
    "ending": 8.125,
    "soundtrack": 10.0,
    "cinematography": 3.5,
    "familyFriendly": 6.0,
    "funny": 5.125,
    "action": 7.555555555555555
  },
  "reviews": [
    {
      "rating": "10",
      "text": "First of all I do admit I am a sucker for video game movies. Given that, this movie is awesome. This movie will give fans of the video game series what they should expect. Within the first 10 minutes there is already a race. You will get lots of police chase scenes and lots of crashes with tons of flying parts. There is a decent variety of high end cars you will see. This movie made me want to dust off my PS Vita and play my copy of NFS Most Wanted again. I usually end up falling asleep in the theater for most movies but this is one of those few movies I stayed wide awake the whole time from start to finish."
    },
    {
      "rating": "5",
      "text": "Need for speed delivers the high action racing scenes with very nice cars and some good dramatic tone but it lacks a good narrtitave ..it kind of feels like a average racing movie with nothing really added to the movie genre."
    },
    {
      "rating": "10",
      "text": "My favorite movie ever the story is awsome the soundtrack was perfect don’t believe the critics"
    },
    {
      "rating": "8",
      "text": "This is a beautiful movie and I was not expecting it to be as good as it was. I was shocked at how good the story was, the races, the comedy, and everything else. I am not a fan of racing movies, but if there is a sequel for Need For Speed I will most likely be seeing it!"
    },
    {
      "rating": "9",
      "text": "It's a car-movie. If you're complaining about a shallow story then you're looking in the wrong genre. Of course it was going to be a basic story-line, it's a movie on one of the games with the most ridiculous stories ever, what else did you expect??\r Great action, great POV cams and nicer cars than what we've seen in a movie in quite a few years. I loved it."
    },
    {
      "rating": "10",
      "text": "Playing the game since i was a kid, i'm happy to see that this was a good movie. I hope it will be part 2 also. Absolutely no comparison with  fast and furious boredom."
    },
    {
      "rating": "7",
      "text": "The movie put up on the scene what is happening when you play the already famous game. Rivalry races , cops chases and a lot of crashes. Given that , it's a good movie , maybe not as good as Fast 2 Furious series , but it;s worth seeing it"
    },
    {
      "rating": "10",
      "text": "This was an awesome movie, I have idea what the critics are talking about or where they're coming from. Other then what seems to be a lack of life flowing through their veins on their part, to call this a boring move. Some of it did have some different acting compared to most of hollywoods block busters, is it worse i don't know, acting that diverts it's way from hollywoods standard often seems more natural and relatable.. Personally i enjoyed every minute of it, with a good transition from story to action, i felt connected to the movie as if i could relate.. Many moments of it put me in an oh so comfortable nostalgic state where i could feel some of the good days i have seen through this movie, great movie! - Yeah the girl, i really enjoyed her character, she's smoking too!!\r 10/10 because i fell in love with her, other wise a 9/10."
    },
    {
      "rating": "10",
      "text": "This is best film about the races . Excellent . Amazing story make this film one of the best movies of 2014 . Need for speed is a good series and a good film . Who believes that Need for speed is terrible movie is wrong . Need for speed with Teenage Mutant Ninja Turtles best movies of the 2014 year . I watched Need for speed film in the cinema and Im love this film ."
    },
    {
      "rating": "10",
      "text": "Just a great orginal film. A classic that I've watched over and over. Love it!"
    },
    {
      "rating": "7",
      "text": "i enjoyed when i was small and i enjoy it now. (movie isnt perfect some scenes arent very good but that is at almost every movie"
    },
    {
      "rating": "8",
      "text": "Aunque la película halla salido en 2014... Salió en el peor momento para la saga de Need for Speed, la película en si por así decirlo es un drama de súper coches (no digo que sea mala, de hecho tiene una historia muy original y entretenida, pero el problema es verla, y es que se desenvuelve todo tan rápido que el final queda muy abierto a una segunda película)  Esta película contiene personajes muy cómicos como Benny Jackson (farsante uno),de echo este personaje llega a ser muy importante en la historia... Como cuando Tobey Marshall y Julia Maddon estaban acorralados en el acantilado.Otro personaje que necesito mencionar es a Dino Brewster...este personaje según yo no resultó ser un antagonista muy al nivel de antagonistas de la Saga Need for Speed (aunque Dino tuviera un buen desarrollo en la película no llega al nivel de antagonistas como Razor siendo un antagonista de un juego del 2004 comparado con el antagonista de un película basada en la saga ) A parte que la película hacer ver a Dino como a alguien que no le importa nada (es que literalmente mato Pete Coleman por el echo de que el estaba perdiendo una carrera, pero lo peor es que no tuvo ninguna clase de remordimiento ni culpa por nada)Otra cosa es el tema de las referencias a los juegos de Need for Speed...y es que no se captan tan fácil hasta el punto de que no parezcan referencias si no más bien algo que pusieron en la película sin más, como el Ford Mustang que hace una referencia al BMW M3 GTR (cosa que no parece más por los colores azules que llevan estos dos coches)En fin…esta película esta bien (no al punto de que la recomiende totalmente pero es aceptable).Yo le doy un 8 porque es literalmente la primera y única película de Need for Speed por lo que para ser la primera esta bastante bien."
    },
    {
      "rating": "8",
      "text": "I remember the first time I saw the Fast and the Furious, and how it made me feel after leaving the theatre. By the time the credits rolled, I wanted to get into my car and drive…fast. Unfortunately at the time, I was just barely fourteen years-old and not even able to drive, let alone drive fast. Since then, there have been five more entries to the Fast franchise, a tragic death within the series and an upcoming seventh entry that will no doubt pay homage to the late, great racing action star Paul Walker. Obvious comparisons from this film will be made to the Fast film franchise, but I can assure you that Need for Speed will gracefully race near to, if not speed right in front of the series that made street racing cool.\r When was the last time you saw a car fly? Like actually fly? And I’m not talking about the CGI filled James Bond/science-fiction films that show flying cars with wings as the norm in the future. For the first time in a very long time at the movies, I had fun! I held my arms close, my palms were sweaty, and tension was flowing through me like the warm synthetic engine oil of a race car, and it was all thanks to the high-octane energy of Need for Speed.\r Based on the famous video game franchise of the same name released in 1994, the film had many hurdles to overcome even before its release; horrible track records among critics and in the box office for video game film adaptations (Super Mario Bros., Doom, Max Payne); direct comparisons to the Fast films; and a television star Aaron Paul (Breaking Bad) leading the film. But despite all the hurdles, Need for Speed delivers on its promise for an urgency to entertain, enthral, and perform, giving a whole new realism to the illegal street racing action genre.\r Now the word realism can be misconstrued in the context of this review. The disclaimer at the end of the film does state that “many of the stunts performed were done by trained professionals on closed courses”, including the actors, who had extensive training with street cars and performance racing. Now when I say realism, there is no way we can explain that word without mentioning director Steve Waugh. Waugh, who was a seasoned stunt performer before he became a director (Act of Valor), on films like Bad Boys II, Spider-Man and The Italian Job, opted for genuine stunt performances from his actors, director of photography, and stuntmen, and mostly abandoned the use of CGI in the film, which gives a slight edge to the longing of danger to be put back into filmmaking.\r The video games, which popularized the use of ‘first-person racing’, put gamers in the driver’s seat and revolutionized the way in which racing games were made. Need for Speed may be light on story, completely absurd on intent and plot, and have many two-dimensional characters, but makes up for it in action, thrills, and impulsive entertainment. The film then becomes a blend of buddy comedy/road-trip actioner/hard boiled revenge thriller that will have you rooting for our hero and born underdog Tobey Marshall, with every gear shift and sharp turn ahead.\r The film spends a hefty amount of time establishing its characters, especially its lead Tobey Marshall (Paul). A natural behind the wheel but behind on most of his payments on the shop his late father left him in Mt. Kisco, N.Y,  Marshall makes up for his payments and barely keeps the shop afloat and his close friends employed through a string of minor street races. After a generous offer from an old acquaintance, pro NASCAR driver and suave bad boy Dino Brewster (Dominic Cooper), Marshall sees an opportunity for the business to flourish for him and his group of loyal friends. But after Dino double-crosses Marshall in a race for winner-takes-all, Marshall serves two years in prison, only igniting a burning scheme for vengeance.\r Need for Speed spends a dedicated amount of time behind the wheel with it’s characters. From the moment Marshall is released from prison, he makes his way to California to the infamous, invite only De Leon street race, held by an anonymous organizer. Desperate to use the last car that he and his team worked on, a 50th Anniversary Ford Mustang that Carroll Shelby reportedly worked on before his eventual death in 2012, a car that produces 800+ horsepower and reaches a max speed of 234mph, Marshall and his team, accompanied by the wealthy investor associate Julia (Imogen Poots) race to an unknown location in search of proving Marshall’s innocence and making Brewster pay for the death of his friend."
    },
    {
      "rating": "10",
      "text": "Need for speed has to me at least, everything heart-pounding action from my beloved games ,a great emotional tale ,excellent performances (especially from Michael Keaton and Aaron Paul),a great cast with a funny chemistry,excellent soundtrack ,great sound design ,you can feel like you are there ,you are in the front seat,the director Scott Waugh didn't lie when he pormised us about a trip so fast and incredible ,we wouldn't forget it,honestly the last race had me sweating, shaking in pure exhiliration something that i haven't experinced in a long time from movies.I also think that critics have forgotten how to have fun with these kind of movies,they are wayy too blinded with fast and furious.But need for speed is everything the first fast and furious should have been a crazy ,fun ride with underrated but great actors,Aaron Paul owns his role and he is definetely an incredible actor,who should be in more movies like this,the last race is not only intense but also very nostalgic to the games,where cops start using spike-strips ,roadblocks ,helicopters ,it surely reminds you of the games(mostly nfs rivals and nfs the run).\r but yeah i loved this movie as a big fan of the nfs series and Aaron Paul and Michael Keaton,this is the best videogame-to-movie adaptation out there,if you want to see some great action ,stunts and actors this movie definetely deserves your attention."
    },
    {
      "rating": "8",
      "text": "If you went to watch Need For Speed  to get some deep plot or meaning to life then you deserve to be disappointed. This movie is about cars and racing and it does both reasonably well. The acting may not be the best and the plot is nothing new but its Need For Speed! The cars look amazing and sound even better. I can honestly say this movie is better than some in the Fast & Furious Franchise and much better than the movie Drive( with one driving sequence). They can always improve from here and I hope them make a sequel but this movie deserves a much better score than most are giving it."
    },
    {
      "rating": "7",
      "text": "Firstly it should be stated that I am a big fan of car movies. If you have enjoyed movies such as Gone in 60 Seconds or Fast and Furious, you will most likely enjoy this movie. The car selection isn't all that varied but the action and chase scenes make up for it. The setting is similar to a track from the Need For Speed games, and the overview screen of the race fits in perfectly. The story is nothing to look too deeply into. It has common themes found in most racing movies, aspects like revenge and honor. The characters honestly felt a bit stale only because they seem so familiar. Michael Keaton's role was probably my favorite, though Aaron Paul & Kid Cudi did very good (though I was hoping for some sort of Breaking Bad reference; a perfectly timed **** or crystal blue colored car, anything lol). Overall it was an enjoyable car flick with some great stunt work & very exotic cars."
    },
    {
      "rating": "10",
      "text": "I thought this movie would be terrible considering the other movies based off games (Battleship, Prince of Persia, etc.) but it really surprised me. It was AMAZING. Any FAst and Furious, racing, car fans will have a blast watching this!"
    },
    {
      "rating": "9",
      "text": "Great movie! Certainly better than all the other racing movies I've seen.\r The story is acceptable, the actors are very good (didn't expect less than amazing from Aaron Paul anyway) and the action scenes are marvelous.\r Granted, if you compare it to the all-time masterpieces you might give it a 4, however compared to its genre and to other releases of the same type, I'd definitely give it a 9."
    },
    {
      "rating": "10",
      "text": "This move was a bad**** move because i went to the moves over and over because i like it that much.  I F*******ing like it they should make the second one and 3 one."
    },
    {
      "rating": "10",
      "text": "it's an awesome move!! I liked it more than FF. overall it was an awesome one of 2014 until now. Enjoyed it a lot......................................"
    },
    {
      "rating": "4",
      "text": "Need For Speed has exotic sports car eye-candy and an adequate lead from Aaron Paul going for it, but not much else thanks to an insipid script.  Riddled with boring moments, an overused and annoying Michael Keaton, corny humor from Kid Cudi, methodical plot points, a few pointless camera shots, some unconvincing performances from the supporting cast, generic dialogue and unremarkable race sequences, I was longing for it to end an hour in.  A chore to sit through, Need For Speed and its two-dimensional characters left me relieved when it was over, not satisfied."
    },
    {
      "rating": "7",
      "text": "i'm not the biggest fan of cars but i am a sucker for video game movie adaptations, i felt that this was a really good movie that i found easy to follow with a lot of loveable characters in it. it had a deeper story than i was expected, although i found it to be a bit predictable at times as well. But in the end, all of the driving sequences looked great, and satisfied my need for speedy movies."
    },
    {
      "rating": "5",
      "text": "Saw movie, left feeling confused? Not really what i expected from it. I want to see a sequel to this movie, but not sure how better or worse it can get. Go see the movie but don't expect it to be better than a 5-6 out of 10"
    },
    {
      "rating": "7",
      "text": "I played NFS: Hot Pursuit 2 for many an hour, many a year ago, and if the filmmakers' intent was to create a tribute to the game, they did a hell of a job.  The action sequences are pretty spectacular, and the male/female leads get the job done.  Aaron Paul may well be the modern answer to the Perfect Weapon, Jeff Speakman, but he'll never beat out Jason Statham and the other A or B-list action heroes for roles.  But he's good enough. With moderated expectations, I had a great time with this movie."
    },
    {
      "rating": "9",
      "text": "I personally loved the movie. It was a little slow at first, then it was out of control action and comedy. I saw the movie in 3D and I would recommend it in 3D. I have not played any of the Need for Speed video games, but apparently it has some of the same characters. Hope you enjoy it!"
    },
    {
      "rating": "10",
      "text": "Need For Speed is a excellent movie... Critics claim that the movie's scenes make them feel emotions, and that is why they give it low ratings - HOWEVER that is the goal of the writers, producers and directors of all movies. And now that Need For Speed has succeeded to do so to many reviewers, they complain about it. For me, it's a good thing that emotions are manipulated by the actors' work. And most who complain about the 'brutality' of some scenes (personally I didn't regard them as brutal, but that's just my opinion) are forgetting that - It's only a movie! A great movie at that! Watch the movie, enjoy and write about your opinion.... Just look at the user score vs critic score!"
    },
    {
      "rating": "9",
      "text": "For real just ignore all the bad reviews, if you like fast cars, if you like racing movies, if you like the Fast and Furious movies or if you are a fan of the the Need for Speed games you will really have a good time seeing this movie. I loved it, I didnt care if story isnt the best, or that the cast besides Aaron Paul is not the best, I enjoyed the ride, the races and stunts are really awesome and realistic without CGI, I was impressed !\r Its an awesome movie"
    },
    {
      "rating": "10",
      "text": "Hmm... Actually, those who says that this movie sucks, sucks... It's one of the best racing movies, I've ever watched... I'll b waiting for the return of need for speed... My score 10 is too less for this, I wished I could boost it up by 370km/h.."
    },
    {
      "rating": "10",
      "text": "As usual, the smug liberal hipster critics with broomsticks up their you know whats... are making their usual puns they think are clever to bash a movie they could never understand.  If it's not a movie about a gay man finding himself or a drama about a young boy getting picked on they want nothing to do with it.\r If you love cars, you'll LOVE this move.. If you love need for speed, you will LOVE this movie, if you like high adrenaline palm sweating over the top action, you will LOVE this move.  I LOVE this movie.\r So glad someone is willing to make this even though they know the critics have their heads between their legs."
    },
    {
      "rating": "7",
      "text": "Went to see this last night for my birthday. I don't really see a huge problem with the film. At the very least its better than the first fast and furious film. Cant say it's better than the others though, but its definitely not the worst racing film I've seen. Definitely feels very NFS with the landscape driving and the police chases also.\r Characters can seem a little bland at times but they help to drive the story forward. A couple of plotholes and some moments are predictable; however other moments you won't see coming. Aaron Paul is... good. Better in Breaking Bad but he gives it a good shot as the starring role in the film.\r Thought this was going to be bad; its probably one of the better video game-to-movie adaptations. Better than Prince of Persia methinks."
    },
    {
      "rating": "10",
      "text": "Awesome movie! I love F&F, but NFS much better. Why? Only cars, beautiful driving and effect of the presence, thats why. I'm a big fan of NFS video game series, and i saw many references and fan base in movie. Amazing and accurate actors play, human qualities and whole movie duration keeps us in suspense. Also very cool filmed, amazing views and angles, amazing sounds. I'm sure, that movie will be legendary also like classic \"gone in 60 seconds\", \"vanishing point\" and \"Smokey and the Bandit\" (Pontiac Firebird in NFS movie is great moment)) NFS movie - Live Legend. All in the best traditions and canons NFS series.\rP.S.: F&F? Whats is?\r 10 of 10."
    },
    {
      "rating": "10",
      "text": "I don't see why this movie has a score of 40. If one has half a brain, they will clearly see the developed plot throughout the film. Car fans, this is the movie for us. Speed, fire, smoke, drifts, crashes, etc. There isn't any set of words that describe how fantastic this movie is.\r10/10 will purchase."
    },
    {
      "rating": "10",
      "text": "If im going to say one thing its this, Fast and Furious has a fight now and its already loosing in this one movie there is more police chases more racing and much much higher speeds despite the fact that the race at the end may have been biased towards a specific car, but finally a story that means something. I hope though that they don't crap on this by making a sequel."
    },
    {
      "rating": "6",
      "text": "This movie was better than alright. Not quite \"good\" though.\rThe good: Aaron Paul. He's got a lot of stupid lines to deliver in this movie, but with his subtle tormented acting style not one of them comes off sounding cheesy or forced. That he can make such terrible writing sound organic is worthy of some kind of award.\rImogen Poots. She is a believable person and real sparks are bouncing between her and Aaron Paul, even if her character is completely ridiculous. If only I had a friend who would pay me 3 million dollars to build an uber car and then be willing to loan the finished product back to me!\rThe bad: The plot. It was so predictable it may even have been ripped off from another racing movie. Don't get me wrong. There are individual pieces of it that are good. The part in the convince store for instance. That sequence is, in itself, quite effective. And there are other bits of the film like that. Its that the over-arching plot is so dumb and predictable. The villain is so bland and one dimensional I don't even recall his name. He was just rich douche in leather coat. Its refreshing the main character has an entire team of people helping him race, but not one of them is memorable or really original. Or likable for that matter. We are supposed to accept that these monkeys are car mechanic/support crew extraordinaire and I don't even think we ever see one of them so much as holding a wrench. Probably because it would look so unnatural.\r The ugly: Car wrecks! Car wrecks everywhere! OK this is a reason to see the film. Unlike the Fast and the Furious franchise Need For Speed was shot with a minimum of CGI special effects. They used as many conventional effects as they could pull off. And you can tell. When a window gets smashed for a scene the stunt glass is still there in the next. Still looking real. The car crashes, with one fireball exception, all look real. Vehicle damage and driving physics is believable and consistent throughout. And the world it is set in. Its not sanitized in the way Fast and Furious has become. When they force a car to run into the ditch because they are doing something very illegal, speeding the wrong way down a freeway for instance, you get the feeling whoever was in that car got hurt.\rYou very much get the sensation in this film that the cops are not just bitter old men trying to stop fun, but rather actually trying to protect the public from the colossal amount of damage these street racers cause.\rBasically it comes down to this. If you are a big fan of car chase and car racing films then you can't miss out on this gem. If you are looking for something with character development and a plot that makes sense, you can find more of that in a single episode of Braking Bad. You're better off watching that."
    },
    {
      "rating": "10",
      "text": "I honestly don't get the low rating of the movie. The movie was really good for me and it has to be one of my favorites. I am a fan of Fast and Furious, but I did my best not to compare. Its a movie about cars, and rivalry I guess. What more can a person ask for? The cast was perfect, and there were amazing cars in the movie. Sometimes people get too technical, and they look for negative things that shouldn't be looked upon in the first place. I would recommend this movie with no hesitation whatsoever."
    },
    {
      "rating": "4",
      "text": "Going into this film I didn't expect much other than Aaron Paul to be honest. Being a huge Breaking Bad fan I wanted to see these actors go into other projects and see how they do, Need for Speed however was a wasted potential. With generic characters, and a bland story not even the cars could save this train wreck of a racing movie. The only thing that I found remotely interesting about it is well... the car chases and even then the movie was boring and un-stylized."
    },
    {
      "rating": "5",
      "text": "If you want to see a movie about Mustangs, then this is definitely for you. If you were hoping for interesting races with a diverse range of cars, then you'll be disappointed.﻿"
    },
    {
      "rating": "7",
      "text": "Come on, you guys. You were a little too harsh on this one. In no way is it a revolutionary start for awesome video game movies or Aaron Paul acting in theatre, but its still exactly what you want out of action movies. Great violence (God, that sounded cruel), little bit of humor, good acting, and fast cars. Now that sounds like some fun to me, and of course it's in this movie. The biggest problem is that it's just nothing new and has many cliches. Let's talk about the biggest attraction first: Aaron Paul. He's just as good as he should be, and his love interest is tied up with him. Supporting cast? Nothing more than good. Is it too similiar to Fast and Furious? Some elements are taken straight out of it, but it still feels like Need for Speed very much. The action here is what you'd expect. Cars get damaged and or blown up, but it's introduced amazingly, both looks and awesomeness. The cliche? One of the biggest themes is \"oh I need to get payback on this guy for killing my friend let's go\". Hate it? So do I. Yet, I still enjoyed this flick and walked out thinking it was good."
    },
    {
      "rating": "10",
      "text": "I liked it mostly because I always kept up with NFS series since it started and I liked the racing with exotic cars and muscle cars, the end was ok but that's it."
    },
    {
      "rating": "10",
      "text": "I personally loved it. I don't get the low rating of the movie. The first Fast and Furious  was worst. I loved the fast cars and the adrenalin, and Aaron Paul is amazing , i think he's a great actor."
    },
    {
      "rating": "5",
      "text": "Okay, so the film isn't particularly great. But it isn't bad either. I enjoy this film in parts, but I am equally bored in others. It oscillates from being entertaining and dull in gradual cycles. This film feels like it could use a sequel, it has potential to be better for sure."
    },
    {
      "rating": "9",
      "text": "Very good. I watched it twice and would do it again. Love the races and of course the cars are great too."
    },
    {
      "rating": "5",
      "text": "Need for Speed is a dumb movie, and not a dumb fun one. As far as video game movies go, Need for Speed is certainly not an unwatchable turd like Street Fighter: Legend of Chun-Li. That's because it's really less a video game movie than it is the next Torque or Biker Boyz. So it looks like it's up to Warcraft to be the video game movie that could finally elevate the genre. Despite all the automotive eye candy and action movie elements, Need for Speed never provides the viewer with a sense of escape or abandon. It doesn't make you want to buy the game or go racing out of the cinema parking lot lost in some lead foot fantasy. It makes you want to buy a Volvo and drive 35mph."
    },
    {
      "rating": "7",
      "text": "I had no problem watching it. Aaron Paul was good, Imogen Poots was good, the rest of the cast sucked, but you shouldn't go to this movie for the acting. My problem with the stuns is that I found them intense and a bit disturbing rather than entertaining. They're so realistic that it seems brutal when they occur. Overall, a perfectly decent movie to pass the time til May."
    },
    {
      "rating": "5",
      "text": "I was really looking forward to this action-packed adventure, mainly because of Aaron Paul! Ever since \"Breaking Bad\" ended, I've been waiting to see each of those actors see what they could do on the big screen. And still, I received a great Aaron Paul performance, but not enough of a good movie. \"Need For Speed\" is a murky action movie with a lame and cliched story and an often murky screenplay. The acting  from pretty much everyone else in the movie didn't even stand a chance in comparison to Aaron Paul and even Michael Keaton. The chemistry from the main cast didn't work. They looked like they had fun playing off each other, but there was no spark between any of them; with the exception of Aaron Paul and Imogen Poots. The chemistry between actually and surprisingly worked. Even though their relationship is cliched, you end up buying it. Overall, \"Need For Speed\" is a disappointing action-thrill ride that only presents great action and Aaron Paul, but essentially fails at everything else. I give it a C!"
    },
    {
      "rating": "3",
      "text": "As one knows, acquiring the name of a driving game franchise immediately legitimizes a movie adaptation, giving unique character needed to differentiate it from Fast and Furious. Regardless of how thin plot from any Need for Speed games are, the movie manages to trip itself with overly inconceivably ridiculous story and actually failing an already low expectation. It's a fusion of hot mess with barely any charisma, only offering display of expensive cars, as the movie constantly brags, and high level of stupidity on everything it does. Fans would be better off attending car shows.\r Story is completely absurd, while motivations are necessary as reasons for the lethal unlawful races, the movie would've been better if characters would just race randomly. They make plot holes in every turns; it has surpassed the redeeming point long before they reach finish line. People would do things so numbingly reckless simply because Fast and Furious clearly inspired them, not to mention script and screenplay are done haphazardly, there's little to no humor or emotional investment to be had.\r Aaron Paul as Tobey Marshall tries to put some sense of personality with gruff voice. He looks tense and worried in almost all scenes, probably trying to decipher of the script. Imogen Poots as Julia Maddon is a complete waste of space. Never mind it's stupid for a car dealer to be involved deeply in the first place, she has neither charm nor wit to hold a scene. Probably the purpose she's badly shoehorned is she's blond and has thick English accent, a supposed independent love interest, but she's just nagging, yelling obvious things or trying to ensure the audience how radical the stunts are.\r The rest of ragtag team is stereotype support characters, such as the savvy mechanic, another savvy mechanic who can only be differentiated by stripping erratically, and a pilot who arrives timely with array of aerial vehicles, always cracking jokes. The movie never decides whether they are a fully coordinated team or just a bunch of clowns. And there's Michael Keaton, who passionately wants to sell the movie as if he's a used car salesman. Throwing high tag prices and misleading dramatization of what's actually a life-threatening road rage disguised as a race on par with F1, where the participants are constantly facing the threat of death or incarceration. He does a good job or narrating crash near a bus school and  mocking the police as cool things.\r Its racing scenes are admittedly pretty decent. There are some scenes that utilize camera angles very well, like occasional drivers' perspective or strategically placed shots of near misses and crashes. They exhibit orotund energy, conveying the fast heated rivalry. If only the movie focuses more on this aspect instead of the nonsensical plot, doesn't try too hard to be pretentiously dramatic or funny, it could've been fun to watch. Furthermore, the movie is about two hours, that's a lot of time to drive in obscurity.\r With idiotic story, poor attempt on comedy and altogether bad acting, Need for Speed ruins yet another video game adaptation and hopefully crashes so terribly, there won't be a sequel."
    },
    {
      "rating": "10",
      "text": "is the best racing movie that i have seen before like fast an furious 1 ,2,3 the others aren't  racing need for speed is more realistic i liked very much"
    },
    {
      "rating": "10",
      "text": "What sucks about reviews is the people reviewing. If you expect a good, well written movie, don't review a movie based on a video game and expect anything more than that. For those of us who know the games and know how cheesy the plot line and characters are, and are SUPPOSED to be, we get it and love it. Everything done in the mustang was plausible given the amount of money put into the car. And I think anyone giving a bad review needs to go to a theatre with RPX Real 3D or Dbox seating and re-watch it. You'll love it!!"
    },
    {
      "rating": "4",
      "text": "Honestly I had not heard of the video game on which this was based, but its origins don't surprise me. It is pretty much like watching a video game. Don't get me wrong; Aaron Paul is Aaron Paul, but his character is minimally developed and the supporting cast is mixed at best. The plot is one cliche after another, and it's hard to feel bad for the plucky sidekick who dies, or for the villain's wife who discovers she's the villain's wife, or even to hate the lamely villainous villain. Don't ask who the mysterious announcer who sets up illegal high-stakes drag racing is; the movie won't tell you much about who he is or how he gets away with it.\r The movie somewhat inevitably cheapens the consequences of its action; people die or get injured only when it's convenient for the plot, despite frequent car crashes, and the only real collateral damage from all the mayhem is a homeless guy's cart that they all laugh about (despite the fact that they came a few feet from accidentally killing the guy and probably destroyed his only property). Hilarious. The hero's jail time is likewise scoffed at. That's why it's kind of hard to feel bad for the one guy who actually dies during all this drag racing; everyone is basically a psychopath but suddenly they care about this one twerp who got killed and feel the need to take revenge.\r The movie's upside comes from the visuals of the 3D chases and the occasional mild laugh (this movie needed more of Rami Malek, as many movies do). The car chasing does look good. If that's all you want out of this movie, you'll be satisfied."
    },
    {
      "rating": "10",
      "text": "Best Breaking Bad sequel. Just amazing. As Jessie Pinkman returns to becoming a Meth addict, Walter White gets resurrected from the dead as they both take over the Meth industry."
    }
  ],
  "recommendations": [
    "death_race",
    "furious_7",
    "the_fate_of_the_furious",
    "xxx_return_of_xander_cage",
    "mission_impossible_iii",
    "the_transporter_refueled",
    "premium_rush",
    "skyscraper",
    "lockout",
    "cars_3",
    "angel_has_fallen",
    "tomb_raider",
    "wild_card",
    "infinite",
    "mad_max_fury_road",
    "the_mechanic",
    "the_expendables",
    "the_expendables_2",
    "transporter_3",
    "transporter_2",
    "bloodshot",
    "salt",
    "6_underground",
    "hitman_agent_47",
    "cars_2"
  ]
}