{"id": 1578, "title": "Neighbors 2: Sorority Rising", "starring": ["Seth Rogen", "Zac Efron"], "runtime": 92, "genre": ["Comedy"], "description": "A sorority moves in next door to the home of Mac and Kelly Radner who have a young child. The Radner's enlist their former nemeses from the fraternity to help battle the raucous sisters.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/eyjcLLwxuRXACbglIbwWwaXK9DN.jpg", "categories": {"plot": 5.2631578947368425, "acting": 5.235294117647059, "ending": 6.25, "soundtrack": 5.0, "cinematography": 1.0, "familyFriendly": 3.0, "funny": 5.337662337662338, "action": 5.0}, "reviews": [{"rating": "5", "text": "The movie is funny at times but mostly a dull sequel that gets very distracting with its feminist points and constant talk about \"sexism\"................."}, {"rating": "3", "text": "Compared to the first movie, Neighbors 2 is a disappointment. The sorority is not as funny as the frat and is just used as a device to promote feminism (which is so forced). The sorority actresses are HORRIBLE. Seriously no one talks like that. You can tell a middle aged person wrote the script. Zac Efron and Seth Rogan are hilarious once again yet they can't save the movie. There are so many plot holes to the movie as well. Why couldn't the adults call the police about the weed at the tailgate? Was Rogan and his wife so stupid to not look at their cell phone contacts?  And much more. Ugh. This movie sucks."}, {"rating": "7", "text": "This movie was about par with the first one. You have a lot of the same humor and back and forth between Seth Rogan and the sorority house that you got with the fraternity in the first one.  It wasn't the best comedy I have ever seen, but I enjoyed it."}, {"rating": "6", "text": "It was amusing enough, but let me just cut to the chase and say that the first film was obviously much more fresh and original and therefore was a lot more funny. This one certainly had its moments, but just like any sequel (comedy sequels especially) it heavily relied on nods and gags from the first film in order to the pass the time, almost to the point where it really felt like it was beginning to drag (it honestly felt a tad longer than an hour and a half!) On the upside, the cast was the strongest aspect, with the three main leads Seth Rogen, Rose Byrne, and Zac Efron all very funny and enjoyable once again. However, I can't say the same for the addition of Chloe Grace Moretz, whose talent felt sadly wasted in such an idiotic role. Overall, the main cast is really the only thing that makes it worthwhile, but other than that, it's just not as funny or memorable as the first."}, {"rating": "0", "text": "This movie is so awful. With no humor, and tons of stupidity, the film is just a bore to watch. A true waste of time. If you're looking for an awful comedy to watch, look no further, Neighbors 2 is the movie for you"}, {"rating": "5", "text": "Seth Rogan and Rose Byrne return as the loved up couple who endured their version of Hell on Earth when, during the first film, a fraternity in the house next door to theirs went to war with them over the various shenanigans that happen in a frat-house.\rThis sequel is much the same (but hey, if it ain't broken.... Don't fix it!), but this time it's a sorority who've moved into the vacant property. Lead by the gorgeous Chloe Moretz, these girls want to party as hard as the boys, but without having to 'put out' in order to get into the frat-house parties.\rWith their own home in 'escrow' for 30 days, Rogan and Byrne (along with their two friends) must try to keep the new buyers from finding out they will be living next to a party house!\rZac Efron returns, initially working with the girls to get their house in order (so they can pay the rent... Although nothing is mentioned about other financial outgoings, and none of the girls seem to do any studying!!), but eventually switches sides due to the girls kicking him out when he's outlived his usefulness....\r Cue some familiar gags recycled from the first movie, as well as some decent enough new ones.\r It's a decent enough sequel to a better than average original, but it lacks that 'punch' the first film had. This is mainly down to avoiding the sexuality of the girls. In the original film, the overt masculinity of the frat-boys was really pushed into your face, but in the sequel the director/writers have gone to great lengths to not make the girls into physical objects.\rSo copious drug taking, cool... Using spent tampons as a (rather disgusting) weapon against their neighbours, yes they do that..... And we have to accept that Chloe Moretz's character was a high school loser!!\r This isn't a film I would recommend people actively seek out, it's one to find on Netflix etc on the run up to Christmas."}, {"rating": "1", "text": "First off the lack of cinematic scores was an instant turn off it was almost as corny as those daytime comedy tv shows. And the gay and femimenist propaganda disgusted me and made me not want to watch it. Besides that, the jokes were extremly forcedon you and i felt awkward in the theaters as people seemed to not laugh at the attempted failed jokes. They were so desperate for laughs it wasnt funny(pun intended). The awkward silence in the audience exemplified that! One last thing the disgusting scenes. spoiler alert*** Periods thrown at the window, puking in the face while having sex and the toddler playing with **** was **** forced, gross and stupid. Dont get me wromg it had funny moments but most of it was filler garbage to desperatly get laughs and it didnt work. Some people walked out the theater it was so bad. I will admit the only funny person was Seth Rogan or Zach Efron and I dont even like him."}, {"rating": "5", "text": "Weak sequel. Just about amusing and enjoyable enough to waste a small amount of your life watching, but the novelty of the first film has gone and some of the charm has gone with it. Hard to see how they'll squeeze a third one out of this franchise, but I expect they will and I'll probably give it a look when it comes on TV the following year."}, {"rating": "4", "text": "The movie is so overwhelmed in Social justice warrior commentary that it really kills the fun in many areas. The movie has a lot of moments dont get me wrong. But right when your having fun the movie stops you and says \"sexism\" \"gay rights\" \"feminism\". I just couldnt stomach it. Nevertheless the movie is funny. But id definitely recommend a rent."}, {"rating": "1", "text": "I've never reviewed a movie on metacritic before. In fact, I've never reviewed anything on metacritic before and had to create this account (and go through an email verification). This is the most painful movie I've ever seen. The movie is the most unfunny comedy I've ever had the displeasure of paying money for; it's more political than The Interview, less intelligent than than a Larry the Cable Guy feature film, and more awkward than the juvenile  imbeciles featured in the movie (and I don't just mean the 18-year-old girl antagonists). While the movie occasionally tries to mix up some stereotypes for a genuinely funny moment, it is consistently and swiftly ruined by bad acting and writing. If you mind the hospital bill from the self inflicted gouges in your eyes and the  long waits between any genuinely funny moment (and the fact that you'd have to live with spending ~$10 on this piece of propaganda for the rest of your life), then this movie is probably not for you. If, for some reason, you are a masochistic and want to mix up the usual physical pain for psychological instead, then is movie is for you. Usually my friends and I can make any movie funny by providing some color commentary among our group, but this movie is so blatantly awful that even 7 close friends could not make the best of it. In short, stay away. For the love of Christ, stay far, far away. Movie gets a 1 for at least being semi-coherent.\r Tldr: I wouldn't wish this on my worst enemy. Save the 10 bucks."}, {"rating": "4", "text": "I loved the first Neighbors (hey, it had stupid comedy so it worked), but looking at Neighbors 2 feels so much of a downfall for the franchise. Nicholas Stoller decides to kill his Neighbors franchise so quickly and way too soon by adding too many women into the cast (and let's be honest here, they did not help me love this film anyways (and double honest, they serve the huge role in Sorority Rising and without them, this might change the entire movie and that might be a good thing)) and the laughter is not even there. They abused the comedy way too much here."}, {"rating": "0", "text": "Isn't as good as the original nor a good comedy sequel,it's literally just another pointless sequel that no one asked for.The first one might be good but it doesn't need a sequel cause it didn't do is nothing new,it's just rehashing the original.The characters are more annoying and the jokes are more forced than ever.It's just another shameless comedy sequel that doesn't work."}, {"rating": "3", "text": "Dumb. Dumb, dumb dumb. I mean, this already was a movie, when they did the original. Just girls. The same jokes, the same cliches.  I can't even make it through this dumb movie."}, {"rating": "9", "text": "One of the best comedies of the last year.  If you like the original you will probably like it, as its pretty much that,but mixed with some present day social commentary (womens rights, feminism etc.)  Of course, its pretty funny."}, {"rating": "8", "text": "Neighbors 2: Sorority Rising is a comedy film directed by Nicholas Stoller and written by five different writers. It is the sequel to the surprisingly good and successful Neighbors that came out in 2014. This one has old and new faces on the casting side, with returning names like Seth Rogen, Zac Efron and Rose Byrne, plus new cast members such as the amazingly talented Chloë Grace Moretz on the sorority side, with her new \"sisters\" that are played by Kiersey Clemons and Beanie Feldstein.\rOverall I quiet enjoyed this movie, and in my opinion it is even funnier and better than the first one. The overall casting choices are perfect, and while the old cast is still incredibly funny and likable, Chloë Grace Moretz totally steals the show in my opinion. She's so darn likable and definitely delivers the perfect one-liners that are super funny. Her character is also likable and interesting at the same time. Zac Efron is also a casting choice that really impressed me on the first Neighbors, and while he was funny on that movie, in this one he just takes it to a whole new level. I pretty much have liked this guy in every movie he's been in so far in his career. He certainly has comedic talent and I hope he keeps on doing what he's doing.\rSure some of the jokes and story-lines of this movie feel like a deja-vu from the first movie, but I think that this is just a trend for comedy sequels now. Repeating the same things from the first movie is something that many other comedy sequels have done recently, like Ted 2 and 22 Jump Street. But it worked for both of them and it works for this one too.\rI really liked this movie, and while it is not comedic gold or a classic, it isn't trying to be either. It is a fun and enjoyable summer movie with some great messages about friendship and family thrown in there to make the perfect balance, and in my opinion, a good comedy movie."}, {"rating": "8", "text": "Neighbors 2 delivers on what you paid for: to be a laugh-out loud movie, and it delivers. Essentially flipping the idea of the first movie into having a sorority next door instead of a frat, this movie somehow manages to be even funnier than the original."}, {"rating": "7", "text": "Look, it's literally the exact same movie. Efron goes shirtless, Rogen smokes pot and Rose Byrne is as bae-able as ever. It's not laugh out loud hilarious but I had a goofy smile on my face for a majority of the runtime, and when a comedy sequel can do that it's often enough."}, {"rating": "8", "text": "An extremely funny and smart sequel that's better than the first . It really is a feminist film, but in the best possible way coming from this fan of \"bro\" films.  When are people going to start acknowledging what a funny actor Zac Efron is? He's great in this, and he was awesome in Dirty Grandpa - another totally under-appreciated comedy. Moretz has actually found her wheelhouse role.   And the supporting actors/actresses are brilliant in this film."}, {"rating": "8", "text": "Neighbors 2 succeeds where a lot of comedy sequels fail.   It understands that while some jokes are almost certain to be repeated, you can put a twist on it they will keep it fresh.  Credit goes to the writing and to Director Nicholas Stoller.  This film is a lot of fun.  A-"}, {"rating": "8", "text": "One of the better comedy sequels. Instead of feeling like a total rehash of the first film, Neighbors 2 builds on the first film and further develops the characters. It had a ton of laugh out loud moments. I would definitely recommend."}, {"rating": "0", "text": "Not funny.  Full of useless bad language.  I had to leave after watching the first 20 minutes.  I was hoping it would get better, but it just kept getting worse.  Watching someone getting vomit in their face...not good.  Having to hide \"bongs\" to show their home while a little girl plays with moms **** was just wrong.  Reminds me why I don't pay money to go to the movies if this is what Hollywood it putting out for our viewing pleasure.  I had hope that this would be an entertaining comedy, but it was just a waste of my time and money.  I DO NOT RECOMMEND THIS MOVIE to anyone!"}, {"rating": "9", "text": "I don't understand the critical reception or user reviews at all. Did we see completely different movies? Better than the first in almost every way. Takes advantage of being a sequel in almost every way. Are some of the really good jokes in the trailer? Yes. Is it still worth seeing? Oh yes. Yes yes yes."}, {"rating": "7", "text": "Rogen, Stoller, Byrne, and Efron return with a follow up to the 2014 comedy hit. Like most seemingly unnecessary comedy sequels, It's still possible to appreciate Sorority Rising, but in it's attempts to be bigger and all around better than it's predecessor, it falls short because it tries too hard. There are still plenty of laughs to be had here and this is more than just the same old, same old with a gender swap.There's actually a pretty good idea at the core of this. Not only do we get to enjoy more of Neighbors' humor, but there is a solid message of feminism running throughout (the kind we actually need!). Obviously that's going to offend the simple minded and maybe those who have been misled into believing that the crap these Youtube and other internet personalities is selling is actual feminism, and therefore are turned off by the simple mention of it.While the message is significant to the times, I do find fault with it's presentation. Simply put, this movie is about as subtle as a sledgehammer. The message is fine, but it does sort of have a way of preaching at you every now and then. Some tact would have gone a long way and made things easier to swallow for the more close-minded out there.Anyways, enough about the movie's agenda. The main question one should be asking themselves is if whether or not it is funny. The answer is yes, just not as funny as the first Neighbors. Like I said, it tries too hard. As a result some gags are just too over the top and cartoonish. The results are usually still amusing, but nowhere near the gut-busting level of hilarity the original's had. Sorority Rising has some heart backing things up as well. Themes of parenthood, sisterhood, and brotherhood are all important themes of the movie that remind us that at the end of the day it sucks being alone and so we need to cherish those around us.Surprisingly the best part of the movie isn't the back and forth antics/power struggle Rogen and Byrne have with their neighbors. It's watching Efron's \"Teddy\" find himself and come to terms with growing up. I've said it once and I'll say it again, Efron is an underappreciated comedic talent. He brings a lot of the movie's biggest laughs and sweetest moments. I'd be up for watching a spin-off with just him.Overall Sorority Rising is about what you would expect from a comedy sequel. The characters return and we get to relive the original's humor with new antics. However, it's not as fresh or funny this time around. A solid message and some new jokes do still make it watchable though. So if you were a fan of the original you should still like this one, because at the end of the day it's just funny to watch the young and stupid battle the old and stupid."}, {"rating": "7", "text": "Doesn't quite come away with the same amount of laughs or originality that came from the first one but at face value, Neighbors 2 does exactly what it sets out to do. The charm of the first movie is still ever present in Seth Rogan, Rose Byrne and Zac Efron but the movie ultimately fumbles on itself trying to do too much by heavily relying on outdated gags and nods that made the original what it was. What also hurt the movie in my opinion was that it felt like some sort of vehicle for Chloe Grace Moretz to further her career as an adult, but her acting instead comes off as forced, annoying and needless as a antagonist when compared to Teddy from the first one."}, {"rating": "3", "text": "There are a couple of laugh-out-loud funny moments (two to be exact), but its not enough to rescue this movie. Its a sequel in the most literal sense, if you've seen the first there are no surprises at all. Even if you haven't seen the first film there aren't any real surprises, the plot is shallow and obvious all the way from start to end. Its nauseously politically correct, and for a comedy that doesn't work at all. Its overly preachy and not very funny, not a good formula for a comedy. It also has all the usual college tropes, and is very unimaginative, just a quick cash-in on the success of the first film."}, {"rating": "6", "text": "Seth Rogen and Rose Byrne return (as does almost everybody else from the original) as a couple who've put their home on the market. Their sale is threatened by a trio of Freshman losers who decide to create their own sorority in the house next door. Zac Efron is also back to add a few comic moments and to repeatedly take off his shirt. Although the returning cast members provide some amusement, the female additions aren't especially quirky or fun, which means they don't add any laffs. The film's good-natured, upbeat energy keep it from ever being dull, but it also camouflages the fact that most of this sequel is just a lazy rehash."}, {"rating": "3", "text": "It's a new batch, in the same neighbourhood, but all girls, trying to go wild!\r I thought the first film was a mistake and now there is another one. I thought only people are reacting negatively, it could be much better than the previous one, but this is really a crap. I'm as a film fanatic hate myself to criticise a film like a film critic does, but there is no other option. I don't know who are the target audience, because it was too sexy for teens and definitely adults won't enjoy unless they are similar to what in the film depicted.\r I don't know why, but I disliked all film with Zac Efron in it. Beside, I'm disappointed in Chloe Grace joining this team. A bad decision, she will regret doing it in the future, maybe she's already. Regarding Seth and Byrne, I don't blame them doing this, at least theirs part were much better than the others. Yet there is no laughs, the film ran with totally dry. Maybe the youngsters would enjoy it than anybody else, because I'm sure the grown-up have already seen better ones in the similar style in the 80s and 90s.\r I hope this is it, no more sequels. Particularly not to end up like 'American Pie', but nobody can stop that if B filmmakers take over from here on. At least first film was much better compared between these two. If you are an adult, sure you should skip it. Zac and Chloe won the Teen Choice awards, so now you know who should watch it. No offense to those who liked it, but for me it is one of the top five worst films of the year. I never write the reviews like this, but I feel bad for what this film made me to do.\r 3/10"}, {"rating": "5", "text": "'Bad Neighbors 2: Sorority Rising' is just as uneven as its predecessor, spending too much time on characters who are not real and too animated to make this premise funnier than it should be. Every character is an exaggeration of a certain form, from the mature, albeit, extremely dirty adults right down to the naughty and constantly misbehaving teenagers.\r Seth Rogen and Rose Byrne return as Mac and Kelly, the happily married couple with their daughter. They are planning to sell their house and move elsewhere, as they plan to move within the upcoming 30 days, they discover that they have another set of new neighbors moving in. We meet three college girls; Shelby (Chloe Grace-Moretz), Beth (Kiersey Clemons) and Nora (Beanie Feldstein) who plan to host a sorority club in that house which involves loud parties and a large group of girls getting together and causing chaos.\r Mac and Kelly obviously try to reason with these girls that they can wait 30 days until they move and then host these loud parties. However, the girls get help from Mac and Kelly's former enemy, Teddy (Zac Efron).\r Just like with the previous film, there were moments that made me laugh, however, all of the characters in these movies are so exaggerated to the point of absurdity, I don't believe them as actual human beings. In fact, despite that Rogen and Byrne have chemistry together, I often wonder why they stay together in the first place. Byrne's character comes off as the kind of woman who would separate herself from Mac because of these situations that they land themselves in.\r The movie also tries too hard to be an R-Rated comedy with some crude jokes that feel organic and are timed perfectly, but then there are other crude jokes that just appear early and often, and they feel forced just to get that R-Rating in there.\r It may not be the most expected sequel, but for me, it's more or less the same as the first."}, {"rating": "7", "text": "Well, it's no better or worse than the original Neighbors. Neighbors 2 is basically the same plot, humor, and crude film as the original. Except this time, it's got girls. Lots of girls. Neighbors 2 feels like its feminist and it really has a ton of girls. It's got a couple of jokes and it is slightly entertaining, but I think overall it's the same thing, just with girls. (71/100)"}, {"rating": "6", "text": "This movie didn't really bring many new things compared to the first part. It had some fun moments and some gross/fun moments. But the whole story in my opinion was kind of dumb and repetitive compared to first part."}, {"rating": "4", "text": "Some laughs. Not good as the first film but it was good enough for a sequel. Better than a lot of sequels but The film says \"that's sexist\" \"is that sexist?\" and talks about feminism\" constantly it was annoying."}, {"rating": "6", "text": "Neighbors 2 was a funny, good to have a good time with friends, but too exaggerated sexual and vulgar jokes movie, which make it very sickly the viewer, and if you do not handle it, but well, funny, hardcore and nasty."}, {"rating": "0", "text": "What a gigantic, steaming, pile of yak dung this movie is. Wait, it's not a movie, it's a vulgar, incoherent, and idiotic waste of time and money; it's a sad, disgusting, and completely useless piece of garbage. The person or persons who wrote this are not just childish, they're demented, psychotic, and completely lacking of any morals or values whatsoever. Every single person involved with this crap should be embarrassed, lined up against a wall, and pelted with rotten cantaloupe until they apologize to the entire world for this travesty."}, {"rating": "7", "text": "As a dumb popcorn comedy, it works way better than the first. This is odd, because it's not a stupid movie. It's feminist and progressive while poking fun at the movements. This makes it a hell of a lot funnier than the series of prank gags and awkward moments that comprised the first movie. Rather than going the easy route and focusing on \"hot drunk sorority girls,\" it gives the women personalities and motivations beyond looking great for the male viewers, including gags and discussions that are instant turn-offs but make for great laughs while humanizing the characters."}, {"rating": "7", "text": "loved the first one and this one isn't that bad. The funniest jokes were in the trailer but there was still some funny ones. Even though most of the cast are girls i don't think think this effected the film that much as i thought they had the share of the best jokes."}, {"rating": "6", "text": "Pretty much the hole cast from the 1st movie is back and they do a pretty good job in this its not a great movie but its enjoyable theres some good laughs in it.Zac effron proves again that he's a pretty good comedy actor and seth rogen does a good job everyone does a pretty good performance in it but its just a bit too familiar.But I do recomend you go see this movie."}, {"rating": "6", "text": "This was way better than I expected, but still basically a rehash of the first. Most comedy sequels are entirely unnecessary, but at least this one was entertaining enough."}, {"rating": "7", "text": "Not quite as good as the first one, but still a great movie! I laughed many times while watching this film and highly recommend it to anyone who likes comedy movies!"}, {"rating": "5", "text": "It appears the genders have simply been flipped in this hit/miss sequel, where the crude jokes fly fast and the laughter is few & far between. The story isn't really original considering the first film, and it is often flaunting an annoyingly inconspicuous grab for feminist based humour. It was however saved in part, thanks to the light-heartedness of Seth Rogan & Rose Bryne's characters and their questionable parenting techniques."}, {"rating": "6", "text": "Neighbors 2 is the official sequel to the hit movie, Neighbors, and, no surprise, it functions like any other raunchy comedy.\rAmid this film, however, is the idea that parents and teenagers don't see eye-to-eye. And this film had the option on playing with that theme and developing something valuable off of it. Unfortunately, that doesn't happen. What does happen is a mixture of stupid moments and scenes only there to raise the entertainment value of this movie. The problem now is wasted potential; that sums up everything about this movie in a nutshell.\rThe characters could have been great and the storyline could have been though-provoking, yet hilarious. However, it isn't very funny to begin with, sacrifices potential for entertainment, and becomes formulaic. With everything about this movie already said, I'll grant it a seal of mediocrity."}, {"rating": "7", "text": "“Neighbors 2: Sorority Rising” brings together the entire cast of the first Neighbors movie released on 2014 with a handful of new faces. Seth Rogen and Rose Byrne reprise their roles as a couple, now with their daughter, while Zac Efron is also back as the former frat boy who has problems with his career. Chloe Grace Moretz joins the cast to somehow play as the main antagonist of the movie.Fortunately, it has a better premise than its previous movie. The ideas are supported with punchlines and effective gags, which always keep coming scene after scene. But unlike its predecessor, Neighbors 2 delves deep to cover themes like gender inequality, complexity of feminism, sisterhood and parenthood which has been conveyed with frantic performances and hysterical chemistry from its actors. However does it have unrealistic moments, this movie proves that sequels can be much better than its predecessors.VERDICT: Neighbors 2 borrows its premise from its prequel, and what we’ve got is an even better movie that explores the core ideas of socialism and a dash of humorous contentment."}, {"rating": "3", "text": "A lot of stuff in this movie, was not funny at all. Teddy I felt bad for him, for what the writers did with him. Pathetic, almost too hard to watch. How they let their kid play with mommys vibrating toy throughout the whole thing?? The Tampons? The talk about sexism was too much, almost to the point where after the movie I was like 'was this whole movie, just a a jab at feminism?"}, {"rating": "6", "text": "Another of those unnecessary hit comedy sequels but this one turns out to be surprisingly entertaining. Did not see that coming.The story is mostly the same – young family battling frat house, this time in the form of sorority – and main stars also. Seth Rogen, Rosa Byrne and Zac Efron have a good team going, their chemistry and ability to improvize carry the movie well, even if the screenplay gets thin at places. I love Seth Rogen but many of the comedies depend heavily on the quality of stars' improvization and turn out to be not very inspired. No problem this time around, the results are above average. I actually recommend it over the first one."}, {"rating": "5", "text": "Mediocre SequelSorority Rising is definitely nowhere near as clever and funny as the original and that’s a damn shame."}, {"rating": "6", "text": "\"Neighbors 2: Sorority Rising\" foi muito melhor do que eu esperava, mas, ainda assim, foi basicamente uma repetição do primeiro filme. A maioria das sequências de comédia são totalmente desnecessárias, mas, pelo menos, esta foi bastante divertida."}, {"rating": "6", "text": "\"Neighbors 2: Sorority Rising\" foi muito melhor do que eu esperava, mas, ainda assim, foi basicamente uma repetição do primeiro filme.6/10"}, {"rating": "5", "text": "This sequel was always a certainty to made, it's just a shame they did. Same as the first, just dumber."}], "recommendations": ["rough_night", "ted_2", "the_happytime_murders", "the_change_up", "neighbors", "hall_pass", "the_hangover_part_ii", "knocked_up", "baywatch", "jexi", "jackass_presents_bad_grandpa", "this_is_the_end", "a_million_ways_to_die_in_the_west", "the_hangover", "good_boys", "ted", "thunder_force", "night_at_the_museum", "dinner_for_schmucks", "zoolander_2", "anchorman_2_the_legend_continues", "bad_santa_2", "little_fockers", "30_minutes_or_less", "what_happens_in_vegas"]}