{
  "id": 1561,
  "title": "Neighbors",
  "starring": [
    "Seth Rogen",
    "Rose Byrne"
  ],
  "runtime": 97,
  "genre": [
    "Comedy"
  ],
  "description": "A couple with a newborn baby face unexpected difficulties after they are forced to live next to a fraternity house.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dyO9BQ4M4flTOAzP79rmsz61yAT.jpg",
  "categories": {
    "plot": 6.521739130434782,
    "acting": 6.090909090909091,
    "ending": 6.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.644230769230769,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This movie reminds me a lot of other Seth Rogen films like \"This Is The End\" Or \"Pineapple Express\" but without James Franco. Instead of him , you get his little brother. Witch isn't that bad, The acting is what you expect from a late night comedy that's geared towards people who probably are not sober well watching the film. But the part that you care about in a comedy movie the most is great. The jokes, Offensive, Original and very adult.\rDefinitely get some friends together and watch this as a late night movie."
    },
    {
      "rating": "8",
      "text": "In a summer that is filled to the bone with high levels of explosions, slinging webs, and carnivorous apes. But, on the other hand, if you look closely that lightly seeded throughout the busiest movie going season, we do get a splash of genuine heartfelt comedies. We saw this last year with “We’re The Millers” and the beloved “This Is The End” and previous years with the likes of “Horrible Bosses”. While it comes sooner than expected, with summer 2014 already stacked high with tons of R-rated comedies. The new film “Neighbors” gets to draw first blood.\rFrom the creative team of Seth Rogen, Evan Goldberg, and director Nicholas Stoller. While the film’s premise is intriguing enough, and believe me there are plenty of laughs to go around. However, in terms of the teams best, “Neighbors” is nowhere near the levels as last summer’s “This Is The End”, a film this team also had a huge stake in. However, thanks to the quick witted comedic timing of co-star Zac Efron, and the high velocity and energy levels of on-screen couple, Seth Rogen, and the always funny Rose Byrne “Neighbors” is hilarious. Although the film falls into a slew of typical plot patterns. Though towards the end of the film’s duration, the humor, the jokes, and the message (if you can find it) are more than enough to equip “Neighbors” under another successful entry into the other Seth Rogen films that have preceded it.\r The film follows “Big” Mac Radner (Rogen) and his wife Kelly (Byrne) a young couple with a newborn baby, Stella. Which prohibits them from living a fun, and engaging life. Including their long time friends. This eventually leads to several failed attempts to maintain their old lifestyle (including a decision to take their baby to a rave). These thoughts are immediately thwarted when a fraternity Delta Psi, known for their outrageous parties, move in next door. Lead by president Teddy Sanders (Efron) and VP Pete Ragzolli (Dave Franco). The Couple eventually breaks a secluded promise they endeared to Teddy. Stating that if they had any issues, they won’t call the police and instead talk to them personally. Thus causing a righteous uproar and bidding the war, as the tagline suggests, “Family vs Frat”.\r If we look at the other films Nicholas Stoller has helmed including; “Pineapple Express”, “The Sitter” and...yeah .. “Your Highness”. Speaking literally, “Neighbors” is almost as good, if not better than all of those films. Partially because the film has such a strong story premise that mostly anyone can relate to. While the film’s box office success will be propelled by women fleeing to see Zac Efron with his shirt off 85% of the film. I commend the actor, and truly felt him as a comedian. (This being Efron’s first “real” comedic role, well.. if you count ‘That Awkward Moment”). As with most Rogen-esq films, the writing is top notch. Never does it cease to amaze me, that since “The 40 Year Old Virgin” these descendants of the great Judd Apatow are eerily consistent with every film they put out.\r The film, however, is nothing without this impeccable cast. Lead by Seth Rogen, but the real show stealer must belong to, Rose Byrne as the loveable, yet manipulative wife. While her character is not stereotypical in any way, I felt the role was tailor made just for her. There is also some good supporting work as well from MADTV alum, Ike Barinholtz. And fan favorites Christopher-Mintz Plasse and Dave Franco. The film comes on strong a few times, but the story progress nicely. “Neighbors” also transitions well between some hefty raunchy and lude R-rated behavior, to a more sentimental approach about friendship.\r “Neighbors” on a grander scale as a whole works diligently in the path it’s headed. It caters to it’s young crowd of college students, but also makes it worthwhile for older adults as well. There were moments in this film when I could not see the screen, because, I was laughing too hard. The film easily balances it’s themes, inappropriate humor and value perfectly. Never settling for second hand jokes, the film that has enough quotes to last the summer. Sure there are escalated times of when you may not be laughing enough. However, all the stars are evenly matched and the film no question earns my good graces, as well as, the hefty R-rating bestowed upon it.\r B+\r By: Nate Adams\r Directed By: Nicholas Stoller\rRated: R\rRun-Time: 93 mins\rStudio: Universal Pictures\rRelease Date: May 9th 2014\r Thanks For Stopping By."
    },
    {
      "rating": "8",
      "text": "The thing that makes this film special is that it tries to innovate the studio comedy genre. The performances are fun and so is everything in this. Efron definitely has changed and it's going to do great things for his career."
    },
    {
      "rating": "8",
      "text": "Seth Rogan is absolutely fantastic, there's no going around it. He has a lock on raunchy comedy like no one else in Hollywood. His style and comic timing are almost impeccable and he effortlessly lights up the screen every time we see him. Thriving alongside a talented cast including Zac Efron and Dave Franco, he brings us some of the funniest work of his career."
    },
    {
      "rating": "7",
      "text": "\"Neighbors\" é um filme divertido e surpreendentemente pensativo sobre velhas e novas gerações. Seth Rogan é absolutamente fantástico.7/10"
    },
    {
      "rating": "2",
      "text": "Did I watch the same movie as everyone else? I'm sorry, but I can't laugh at scenes that make no sense. I'm too busy questioning the actions of these characters to care about what's going on in the story. Why do these parents even care about their noisy neighbors? They love partying, doing drugs, and leaving their infant child home alone. Why would these parents care if their baby can't sleep? They are already having intercourse in front of the child... Also, why would a police officer rat out a neighbor that filed a noise complaint? Why would someone dry hump a bush sculptor of a person bent over to get rid of it? Just cut it down! It's like an 8 year old wrote this script. I found myself asking constantly, \"Why is this happening?\" I must have missed the part where I was suppose to laugh. I was expecting to find a funny clever film like This is the End... Oh, how wrong I was. Good job everyone. You fooled me into paying a lot of money to see this garbage. The joke's on me."
    },
    {
      "rating": "1",
      "text": "I had so much wanted to like this. There is 30 minutes of funny material... unforutnately you have to sit through the rest of the movie. Rent it so you can fast forward. It shows that it was cobbled together as a studio project for named hollywood types. When you walk out you will feel like you wasted your time and money. I have no idea why others think this is so funny... because there is so much talking about what they are going to do."
    },
    {
      "rating": "9",
      "text": "Neighbors is just undeniably laugh out loud funny, it is hell-a- arious . If you are going in expecting a typical R rated comedy you are going in blind and that's good for you. If you did not watch the trailers and you are going in blind that is great for you, because every minute in this movie either has a joke or is sweet. Everyone in this movie did a great job, Seth Rogen plays like every Seth Rogen in a movie which is really fun to watch, Rose Byrne is actually very funny in this movie and HOT. Zac Efron is the one Disney lead that did not ruin his life and apparently his movie career is going up and I am happy for him he was so funny in this movie, he can be goofy and douche perfectly well! Apparently this movie is a step forward in its genre, it is unforgettable, hilarious and just so well made I highly recommend it to everyone! Just go see it and you'll know why!"
    },
    {
      "rating": "8",
      "text": "\"Neighbors\" is a funny, entertaining and surprisingly thoughtful film. It’s about old vs. new generations going at it, but at its core, it’s a film that’s about learning when to grow up and take responsibility. The script is infused with hilarious jokes, ridiculous pranks and situations, and intelligent pop-culture references that bridge generations. The story itself is quite enjoyable, even though at times the movie can feel a bit unfocused.\r The characters are colorful and likeable and the actors give some great comedic performances. Seth Rogan is hilarious and provides most of the laughs. His shameless attitude really allows for some awesome and gut wrenchingly funny moments. Zac Effron proves yet again that he is a born star, who will be one of the biggest stars in the near future. His comedic timing is impeccable and he is just so great to watch. Dave Franco is also no short of awesome as well as the rest of the cast.\r Overall, “Neighbors” is a really hilarious film that is not short on laughs and also some valuable life lessons. It has a fun soundtrack and the direction, especially for the party scene are well done. Probably the best comedy of the year and really worth checking out. I give it 4/5"
    },
    {
      "rating": "9",
      "text": "This movie was absolutely hilarious. i don't think i went more than a minute without even chuckling at something. Although it is not as funny as This Is The End, it still holds it own. Zac Efron shows off his comedic skills and surprisingly holds his own against Seth Rogen. The movie has the comedy to appeal to the young college audience, and also the adult with kids humor that will attract parents and grandparents. There were people of all ages in the theater, and they all laughed just the same. I highly recommend watching this movie."
    },
    {
      "rating": "0",
      "text": "The baby was the best actor. To much dick humor, Crude unrealistic plot. Lot of jokes I have seen in other movies played out over and over again. Nothing new, nothing creative. Waste of time."
    },
    {
      "rating": "4",
      "text": "Where Zac Efron is testing himself and trying an assortment of things to broaden his career and avoid being typecast, Seth Rogen is pretty much cashing checks, portraying the lovable oaf-stoner he’s become synonymous with.  The difference between his role here and previous incarnations might be what t-shirt he’s wearing.  Rogen’s presentation of The Seth Rogen Character is one of the problems with Neighbors, a film that wants to live on both sides of the fence, but isn’t made by filmmakers skilled enough to pull it off."
    },
    {
      "rating": "7",
      "text": "Good movie. No more, no less. It was funny, had good characters, decent acting and is sure to please most audiences. Not great, nor oustanding though. Just a solid movie."
    },
    {
      "rating": "3",
      "text": "\"Neighbors\" has been terribly over-rated by most critics. Mostly the flick is the usual mixed bag of tired and gratuitous sex gags. Seth Rogen's schtick is way past it sell-by date. I was pleased to watch the feisty Rose Byrne and I'd very much like to see her in a better picture."
    },
    {
      "rating": "8",
      "text": "I'll admit right off the bat that the comedy isn't the best aspect of this movie.  I was laughing consistently throughout but not much was absolutely hilarious.  That being said, what really makes Neighbors work in my opinion is 1) the acting, which was all very well-done (including from Zac Efron) & had good comedic timing to it, 2) the story, which was engaging all the way through & made the wise choice to stay fairly short length-wise, and 3) the characters, who are all as likeable or unlikeable as the movie wants us to be at any given time, and both main characters go through a good amount of growth, solidified by an interesting ending moral.  Overall definitely worth your time, as long as you lower your expectations a little in he laugh department to focus on other elements.\r (For a long, more in-depth review, look up \"Spin It Reviews\" on YouTube.  I'd appreciate it.)"
    },
    {
      "rating": "6",
      "text": "While the movie can be humorous at times, there is not one scene that is laugh out loud funny, which is disappointing. It still is interesting though ( for the most part)."
    },
    {
      "rating": "0",
      "text": "About as average as a R-rated comedy can get. The typical dick comedy with crude unfunny jokes that are clearly there just for the sake of trying so hard to make you laugh at how repulsive and/or immature they are to get the R-rating. This is the kind of movie you go into expecting a lame sex-joked r-movie and walk out feeling the same way you'd think you'd feel.\r I've been a adult for about a year and it's fun to go out with friends and see a movie, but through my adulthood of seeing these r-rated movies so far they've all been the same, lazy excuse for comedy. I'm done with them. It's time to stick to either kid's films which have at the very least some morsal of originality and funny writing. m|n this movie"
    },
    {
      "rating": "7",
      "text": "While the humor can be good, the plot differs. The story can sometimes be very confusing, and both of the two main characters have boring goals. The characters were okay this movie did make you feel for Zac Efron's character and it also made you feel for Seth Rogan's character. Overall neighbors is a movie that can definitely be supported by its great humor."
    },
    {
      "rating": "0",
      "text": "It Stunk...I didn't laugh once.  The twins that played their kid were better actors than anyone in that movie.  If you haven't seen it...don't waste your money."
    },
    {
      "rating": "9",
      "text": "Gross jokes and scenes were my expectations but there is some depth and tenderness in this film which brought me to view it again. Having lived in a male fraternity in a New England private college, the reality of party life and the immaturity portrayed here are actually realistic. I remember one drunken fraternity brother riding his motorcycle around our dining room to the great amusement of our drunken brothers and the enormous mess that this party created - spraying beer at each other etc., etc. But there was also deep bonding which endured as we shared our lives and growing older and becoming adults seemed so, so far away - just like this fraternity portrayed here. The contrast with the couple next store (really struggling with their transition to adult responsibilities)  provided the depth that was below the surface of all the comedy and tensions. This is a good, funny flick worth seeing."
    },
    {
      "rating": "10",
      "text": "Great laugh-out-loud comedy. Laughs all the way through. All of the cast are stellar. Rogen and Efron have great chemistry and the supporting cast of Dave Franco, Rose Byrne and newcomer Jerrod Carmichael really impress and help to offer more great laughs. 10/10"
    },
    {
      "rating": "6",
      "text": "Lewd, rude and very crude and these are the best bits in this hysterical but often very funny exercise in bad taste. The three leads are great in nailing the material. Seth Rogan, in particular, often seems to be improvising his lines so effortlessly does he articulate them, and Lisa Kudrow is also good fun as an angry Dean.\rAs well as being verbally inspired we are also treated to more than a few deliciously funny sight gags. However, when approaching the home stretch the laughs dry up somewhat, which tends to be a familiar problem with comedies generally. This one achieves more than some and is well worth a watch."
    },
    {
      "rating": "3",
      "text": "NEIGHBORS is too long, not funny though Zac Efron looks great with his shirt off. Haven't filmmakers realized that long drawn out scenes of people having fun are never fun."
    },
    {
      "rating": "6",
      "text": "There are plenty of laughs to be had, but it's not nearly as funny as the initial Metascore (in the 80s?) would suggest.  The trailer makes it seem as though there's a tit-for-tat prank war between the frat and the neighbors, but it's not nearly that cut-and-dried.  Ike Barinholtz steals ever scene he's in.... Booosh!"
    },
    {
      "rating": "0",
      "text": "Ugh. Tedious. Loooong setups for a few extremely funny gags. The pièce de résistance is when the movie turns preachy about how the grown-ups prefer their domestic life.\r On the whole this movie has about as many laughs as a good sit-com (Big Bang Theory). But you have to sit  through 60 additional minutes of **** and pot-smoking to get to them.\r I had much higher (no pun intended) expectations than the movie delivered. I'd like my 1 hour and 37 minutes back, please. The baby was cute, though"
    },
    {
      "rating": "8",
      "text": "Featuring some uproariously multi-faceted waves of humor, brilliantly fleshed out characters, solid performances, and shockingly affecting moments of heart sprinkled throughout, \"Neighbors\" marks yet another successful comedy for Rogen, Goldberg, and Point Grey Pictures stunning filmographic repertoire."
    },
    {
      "rating": "9",
      "text": "New parents Mac and Kelly Radner are worried that with the new responsibility of being parents all of their good times are at an end. When a fraternity moves in next door things get a crazy. A back and forth battle for the neighborhood starts that the Radners use to bring their lives some new excitement.\r Crazy antics, well polished humor, and near-perfect comedic timing make this an absolute laugh riot. The real strength of it is how this whole scenario feels like it could actually take place. The characters are believable thanks to the entire fantastic cast. Efron in particular is enjoyable just because this is something that you might not expect to see him in. The best part about it is that the trailers didn't spoil all of the funny parts. The whole movie is hilarious.\r Admittedly you do have to be a fan of r-rated comedies and Rogen's work. If you are then I see no reason why you wouldn't find this to be the laugh riot I did. So far I think it's the best comedy of this year. If you're looking for some laughs then I recommend you give this a shot. It's pretty much the perfect mix of goofy and raunchy humor. My total score for it is a 9.9/10."
    },
    {
      "rating": "0",
      "text": "First of all I loved Animal House, Pinapple Express, This is the End, Superbad, etc. The laughs are few, the dialogue is terrible, the gags have been seen way too many times. The story is plotless, the child abuse is not funny at all, the racism is completely out of the blue, and Seth Rogan's same stoner act is getting tiring. The scenes are a complete mess with a severe lack of direction. One after the other you start to realize nothing is making sense. I walked about after 1 hour beyond terrible."
    },
    {
      "rating": "10",
      "text": "Hillarious    ."
    },
    {
      "rating": "0",
      "text": "Predictable, formulaic garbage to be fed to the same cretins who quote lines from Old School, South Park, and Family Guy. In other words, it's for unfunny douchebags. Lap it up."
    },
    {
      "rating": "0",
      "text": "Please save your money.Sure, it 's #1 now, but this movie will fall faster than a prom date's panties once word of mouth get's out.There have been very few movies that I have considered walking out of, I even had to apologise to my wife for bringing her along.The shame of it is, I liked Rogen's movies.But this falls flat.I truly believe these positive reviews are mostly from paid shills.They want your money opening weekend. They got mine, don't let then get yours.You were warned."
    },
    {
      "rating": "0",
      "text": "Total garbage movie - from beginning to end.  Don't even see it for free.  Writer, director, and producer need to go back to school to learn something else."
    },
    {
      "rating": "7",
      "text": "Neighbors is funny, I get it, but it never fulfills its goal to be a brilliant comedy film. Seth Rogen plays Mac Radner and Rose Byrne plays Kelly Radner and this movie is about them moving into a new neighbourhood and meeting 50 brothers (led by Zac Efron and Dave Franco). Nicholas Stoller- director of Get Him to The Greek directs. It's a raunchy, over the top comedy film- and at that- its funny. Seth and Rose give good performances but Zac Efron is the best of the bunch, not every Disney star gets pinned. But there are flaws, the frat vs family prank war gets tiring quickly, with mind numbing party scenes which just suck. There are more than 200 sexual jokes in the movie (if that makes you want to watch it). Well, Neighbors is a bluray buy for me, it's really funny but it's flawed."
    },
    {
      "rating": "9",
      "text": "A hilarious new offering from seth rogen and nicholas stoller lives up to the hype. Bad Neighbors the funniest movie of 2014 so far. The chemistry between Seth Rogen and Zac Efron and Rose Byrne is fantastic. Rose is actually the funniest bit of this film. Zac proves himself to be a force of nature in hollywood and he shows in this film that he is here to stay. Yes it has some flaws but everything else is SO GOOD! I can ignore those problems. For me it gets a VERY FRESH! score of 85100"
    },
    {
      "rating": "5",
      "text": "SOUNDED LIKE IT MIGHT BE A BLAST.... BUT AS WITH MOST THINGS THAT SEEM TOO GOOD TO BE TRUE... IT WASNT..  BUT IT WASNT A DUD EITHER.   SORT OF LIKE A CROSS BETWEEN A PG-RATED PROJECT X AND CONTEMPORARY VERSION OF ANIMAL HOUSE.   SOME LAUGHS.. MANY CHUCKLES. NOT A BAD TIME AT THE MOVIES. ZAC AND FRANCO MAKE THE MOVIE WHAT IT IS.. ROGAN IS BECOMING KINDA STALE... YOU BE THE JUDGE"
    },
    {
      "rating": "8",
      "text": "90 minutes of frat vs. new found parents hilarity is just about right for this movie. There us a reason it is rated R, with revealing of private parts and crude humor the movie may turn off very secure minded people. Still if you are between the years of college and new found parenthood, you will have a connection that allows you to love the movie. There is a heart-felt scene shoved in there, for those who are about to leave college and have \"brothers\" who have been with you every step of the way. Actors did a great job( not an oscar winning performance) allowing context and relate-ability with the characters. Still the humor is top-notch in my opinion and makes you kinda wish you were at the epic frat parties presented in the movie.\rThis is a really enjoyable comedy movie that I am willing to share with my friends once in a while, and thus I give this movie a 4 Silver A-stars."
    },
    {
      "rating": "6",
      "text": "Neighbors is an enjoyable, if not, predictable comedy with a fantastic ensemble cast who don't have too much to do.  The movie moves along at a brisk pace and the chemistry between Rogen and Byrne definitely make them likable.  The frat boys are funny, yet one-dimensional.  Sadly the movie falls into sit-com like scenarios which can be amusing and chuckle worthy, but very forgettable in the long run.  The script is paper thin, and the characters story arcs are mere speed bumps in between the comedy.  It isn't a game changer in the world of comedy, but there are worse ways to spend your hour and forty."
    },
    {
      "rating": "2",
      "text": "My adult son told me to see this as he thought it was hilarious.  Just crude juvenile humor in a formula comedy.  The acting was bland without any memorable performances.  Not my cup of tea.  Probably appeals more to today's young teens and young adults.  Sorry but it was just dumb."
    },
    {
      "rating": "6",
      "text": "Seth Rogen and Rose Byrne are a happy new parents, who find a fraternity moving in next door (with Zac Efron as president). This leads to the inevitable lifestyle conflicts and noise complaints. There's a high level of comic energy and some amusing moments, but much of it seems forced. The dialogue between Rogen & Byrne often feels unscripted and goes on too long. Many of the bits are taken too far just for the outrageous effect. The cast is populated with supporting characters that could have been funny, but lacked that extra zing. The good-natured fun and upbeat enthusiasm keeps the film from ever being dull, but it also camouflages the fact that much about it isn't that original or funny."
    },
    {
      "rating": "2",
      "text": "Neighbors is one of the most poorly written and executed comedies I've seen in a long time. The entire concept is terrible and they failed completely at coming up with even a plausible premise. No, this isn't science fiction. You should not be required to throw reality out the window in order to enjoy it. Seth Rogen's typical charm is non-existent in this film and when Dave Franco gives maybe the movie's best performance, you've got to question what you could've been doing during those 90 minutes that wouldn't have been as painful. Bamboo shoots underneath finger nails comes to mind. That being said, there were two redeemable elements to the movie. The first is that Rose Byrne is absolutely gorgeous. She is stunning and should be in more movies than she is. The second is that the fight scene in the end with Rogen and Zac Efron is hilarious. That's honestly the only part in the entire film that was even remotely funny. In all honesty though, those two things are not worth even bothering to watch the film. Twiddle your thumbs instead... you're welcome."
    },
    {
      "rating": "8",
      "text": "Neighbors is an awesome movie. It's absolutely disgusting yet surprisingly insightful about growing up and the unknown future. While not quite as astounding as This is The End, Neighbors starts off the summer in one of the best ways possible."
    },
    {
      "rating": "8",
      "text": "An absolutely hilarious comedy that lived up to my expectations! Neighbors is easily the funniest movie so far this year! While it isn't quite as funny or outrageous as This is the End (at least in my opinion,) it still managed to make me laugh and put a smile on my face multiple times. Seth Rogen was funny as always. Rose Byrne surprisingly steals several scenes with her upbeat performance. Zac Efron and Dave Franco also made for a hilarious duo. Overall, this is one funny comedy that offers some honest laughs and isn't cluttered with too many clichés like most comedies nowadays."
    },
    {
      "rating": "8",
      "text": "In terms of comedic timing, the film is light years beyond anything in recent memory. Although the film tried to give itself a conscience sometimes which was terribly unnecessary. Kind of like if you were eating the most awesome piece of cheesecake ever and randomly some dude just ran up and interrupted it by explaining, ever so briefly, how bad all the sugar and fats were to your body. Ethical Monday morning quarterbacking. Also, the token black guy nailed it in this one."
    },
    {
      "rating": "8",
      "text": "So raunchy but funny for sure. Wasn't expecting the sex scene, caught me off-guard. Not the greatest writing story wise, but kept me laughing. Cool! Love to laugh!"
    },
    {
      "rating": "8",
      "text": "This movie is funny period. The jokes are funny, the physical humor was ridiculously funny and Rogan and Effron were great. Honestly other then a few instances you like these guys and want to party with them."
    },
    {
      "rating": "8",
      "text": "This is a must see if you are a Seth Rogen fan. This is one of my favorite movies he has done, and I am a huge fan of most of his work. It has a great cast that works together well. It will keep you laughing almost the whole time. It is one of the best comedies of the summer."
    },
    {
      "rating": "6",
      "text": "Neighbors touches on some interesting ideas for a comedy but doesn’t do much of interest with them. The couple vs. the frat house can be amusing at times but in the end it comes across more mean-spirited than funny. The film could’ve salvaged this through some message about recapturing one’s youth and this idea is kind of there but never fully explored. The strongest moments in the film come from the Frat House. The actors playing these characters work well with Zac Efron finding a nice role for himself while watching the schenanigans of the frat house, I found myself wishing this was about a bunch of teenagers doing dumb stuff and while we do get that it comes more from the attacks of the neighbors and their cruel intentions. It would’ve been a lesser version of Animal House but I could’ve settled for that. Or even if they wanted the neighbors to join in the house. Instead, the film ends with the frat house being shut down and Rogan smiling as if all is well. For a film that is supposed to make me laugh its hard to smile when my heart is so low. Don’t be mistaken this film is enjoyable with a few decent laughs but it isn’t the brilliant comedy that it could have been."
    },
    {
      "rating": "7",
      "text": "Satisfyingly funny but not quite classic comedy status, Neighbors delivers enough laughs and a decent cast that makes it worth a watch or two.  I'm happy I saw it but I probably won't go out of my way to see it again anytime soon."
    },
    {
      "rating": "4",
      "text": "This is way overrated. The sex jokes have been done countless times before. The plot is stupid. The acting is mostly bad. The only things that i enjoyed were the fight in the end, and - surprisingly - Zac Efron (it was good seeing him shed the Disney-kid persona and try something different).\r This Is The End was a very good movie that made me enthusiastic for Seth Rogen again. It was one of the reasons that made me check this one out. Unfortunately, I find myself greatly disappointed."
    },
    {
      "rating": "6",
      "text": "An enjoyable, if not, predictable comedy with a fantastic ensemble cast who don't have too much to do. The movie moves along at a brisk pace and the frat boys are funny, yet one-dimensional. Sadly the movie falls into sit-com like scenarios which can be amusing and chuckle worthy, but very forgettable in the long run. The script is paper thin, and the characters story arcs are mere speed bumps in between the comedy. It isn't a game changer in the world of comedy, but there are worse ways to spend your hour and forty.\rSadly, still not the movie that will make me like Rogen, i just dont fing him funny at all, and ive seen most of his movies sadly!"
    }
  ],
  "recommendations": [
    "sisters",
    "step_brothers",
    "ted_2",
    "the_wedding_ringer",
    "neighbors_2_sorority_rising",
    "good_boys",
    "this_is_the_end",
    "jackass_presents_bad_grandpa",
    "hall_pass",
    "identity_thief",
    "wanderlust",
    "rough_night",
    "ted",
    "knocked_up",
    "a_million_ways_to_die_in_the_west",
    "forgetting_sarah_marshall",
    "old_school",
    "jexi",
    "blended",
    "30_minutes_or_less",
    "night_at_the_museum",
    "blockers",
    "dinner_for_schmucks",
    "dodgeball_a_true_underdog_story",
    "date_night"
  ]
}