{
  "id": 2339,
  "title": "Nerve",
  "starring": [
    "Emma Roberts",
    "Dave Franco"
  ],
  "runtime": 96,
  "genre": [
    "Mystery",
    "Adventure",
    "Crime"
  ],
  "description": "Industrious high school senior Vee Delmonico has had it with living life on the sidelines. When pressured by friends to join the popular online game Nerve, Vee decides to sign up for just one dare in what seems like harmless fun. But as she finds herself caught up in the thrill of the adrenaline-fueled competition partnered with a mysterious stranger, the game begins to take a sinister turn with increasingly dangerous acts, leading her into a high stakes finale that will determine her entire future.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/c9bCtj58cTov1HjPmpuwq24bcZF.jpg",
  "categories": {
    "plot": 6.17910447761194,
    "acting": 5.666666666666667,
    "ending": 6.125,
    "soundtrack": 7.0,
    "cinematography": 6.333333333333333,
    "familyFriendly": 5.666666666666667,
    "funny": 5.0,
    "action": 6.625
  },
  "reviews": [
    {
      "rating": "7",
      "text": "With \"Nerve,\" \"Catfish\" co-directors Henry Joost and Ariel Schulman re-team to deliver yet another cautionary tale of cyber persuasions, and while the film itself might not entirely stick the landing with its thoroughly inconceivable climax, the movie's prior moments generally hold up pretty well. In fact, I would go so far as to say that \"Nerve's\" first two-thirds is actually pretty captivating, thanks in no small part to some sleek production design and a generally profound sense of timeliness. If you can get past some of the narrative conveniences and eye-roll moments that run rampant in the film's third act, you might actually have a pretty decent time with this one."
    },
    {
      "rating": "8",
      "text": "[8/10]Pros:1. Engaging story with a new concept of augmented-reality gaming.2. Energetic soundtrack.3. Gives an idea of the power(to do good or evil) of Internet and technology.4. Twists and turns in the story like a real thriller.5. Seems like you yourself are part of the game.Cons:1. Emma Roberts and Dave Franco running around the city completing random dares becomes a little boring afterwards.2. Some dare were ridiculous and hard to believe in the real world.Overall, if you don't take it too seriously and watch lightly...You'll have fun :)"
    },
    {
      "rating": "4",
      "text": "If you want to see Emma Roberts and Dave Franco run around the city completing random dares well then is this the movie for you. Or if you actually want to watch something exciting, why not check out the movie this is clearly ripping off, 13: Game of Death. It's got more nerve and less cringe. This on the other hand had the opportunity to take off and then it didn't. It's boring and not worth your money, not recommended."
    },
    {
      "rating": "0",
      "text": "Couldn´t finish watching it... the last half hour is just unbearable. I know that modern teen movies should follow the trend of the times, which right now is dumb teens and their social media, smartphones and ultra low IQ. But if this is where teen cinema is going, then we´re all f****d..."
    },
    {
      "rating": "7",
      "text": "It is a lot of colorful, manic summer fun. Almost feels like Catfish meets Scott Pilgrim vs the World, and Franco and Roberts have solid chemistry. It may not make the most sense if you start to dissect it, but it's about as much in-the-moment fun as I've had at a theater all year."
    },
    {
      "rating": "0",
      "text": "This movie is so random and poorly done I can't even seem to put together a coherent review about it without spoiling parts of the film. It was corny, made no sense in a lot of areas.. And honestly this felt like a 90 minute twitct.tv chat meme. If watching people watching other people stare into a phone while other people record the players do stupid **** with a really bad story line/inconsistent characters is appealing to you, this is your movie!\r Corniest line of the film: \"Ugh, you are such a watcher.\". CRINGE."
    },
    {
      "rating": "6",
      "text": "This is about what I expected with a film involving Dave Franco and Emma Roberts, which is why I rated it 6/10. It appeals heavily towards the preteen to college age crowd, and couldn't have come out at a better time with the Pokemon Go craze still terrorizing the world. The concept of the movie is interesting and it's definitely a new idea, at least from what I can remember. The acting is okay, the script is a little cheesy at times, but overall it's an entertaining movie that kept my attention."
    },
    {
      "rating": "7",
      "text": "I didn't like the plot of the movie. It was predictable and too messy. But some scenes and moments were thrilling and funny, which I appreciated. What I liked the most about Nerve was Dave Franco. While Emma Roberts was great, Dave was outstanding, I really like him as an actor."
    },
    {
      "rating": "5",
      "text": "Too bad there's no point of this film in the first place.  As things literally went out of control in this film, I managed to count how many times I had my excitements and my bores. Somehow my excitements were close to getting to the top."
    },
    {
      "rating": "10",
      "text": "É um sólido thriller que entretém o público. Eu adorei o filme, honestamente. Não sei se a ideia de as pessoas estarem envolvidas num jogo online foi original, mas funcionou perfeitamente com os atores certos e com uma história bem trabalhada. Dave Franco e Emma Roberts provaram ser líderes com uma química notável."
    },
    {
      "rating": "10",
      "text": "One of the best movies you will ever see! Emma Roberts is a great actress and she was so good on the movie with Dave Franco. Vee is a great character."
    },
    {
      "rating": "5",
      "text": "This is a middle of the road thriller that really never seems to get you fully on board.  There is very little character development which leads to the audience not becoming invested through the more thrilling dares.  It isn't a complete waist of time just the finale drags.  C+"
    },
    {
      "rating": "7",
      "text": "The Stunning Surprise Of The Summer\r \"Nerve\" is the homonymous film adaptation of the novel written by Jeanne Ryan, in the same way as the movie, it externalizes a rooted orientation to the young audience. The dynamic is simple: Watcher or Player? \"Nerve\" is an addictive virtual game, within which, you should choose be observer or player. If you decide to be observer will have to subscribe and challenge to the players, something not so novel, perhaps, because it is in what we are immersed day-to-day. If you put yourself in risk to be a player, prepare to meet each challenge proposed by the \"anonymous users\" and to earn money, gradually, Is it suggestive? To some extent, what young people do not know is: Who does the game restrict? considering that, despite there are not rules, certainly, there is one fundamental: If you denounce them, you die, What are they hiding?. The simplicity of its premise goes together almost immediately with the audience due to the parallelism of that apparent utopian world with ours. Aspiring to be more than an entertainment product, the film of Henry Joost and Ariel Schulman succumb in the dangers of Internet and the own morbid fascination that entail to the collective madness, satisfactory at least in the most of its duration by neon lights, fast pace and charming leads.\r The film transfers the monotonous characters of high school and their teen conflicts of youth films to an illusory and accelerated atmosphere, in where they interpret their characters in an attractive way. Nonetheless, the exquisite casting decision transforms and materialize their roles in an imaginative and even realistic journey into submission. After Vee (Emma Roberts) is lost in the paradise of popularity, money and love, it will be only a matter of time to challenge her maturity and wisdom when she feels cornered against a wall of threats and betrayals. It is here, where the stable pace of the plot falls down abysmally, giving short but necessary minutes of relaxation, minutes remunerate with an ending non-apt for people with heart problems. Nevertheless, the background of \"Nerve\" goes beyond the Internet and its insecurities - theme addressed by several summer films, are they warning us about something bad? -, the mechanism is (invisible) Internet privacy to create the unstable world full of vices, obscenities and addictions. The morbid curiosity of people, potential misuse of social networking sites, lack of maturity and autonomy, avarice, betrayal, materialism and thousands of ethical values more that the film tries to mention of a way so relaxed as lucid. You will be surprised with the amount of social problems hidden in the movie and it sadly solves them of unrealistically.\r As well as \"Nerve\" gets an absorbent atmosphere and a frenetic pace, it boasts of fundamental cinematographic flaws. At first instance, the proposal of the first scene reminds us the great-looking recording style employed in \"Unfriended\" or \"Open Windows\", where the operating system of a laptop or whichever media is reflected on the screen so that spectator takes a relative perspective. With running of the run-time, digital interfaces, constant neon lights camouflaged in the black night, (visibly) youthful soundtrack and the aggressive progress of the plot they  lose the value that it deserved, limiting themselves to the thought of artificiality and lack of self-control of a couple of young people. By this, I do not mean that the result was embarrassing, to the contrary, it fascinated but wears down potential, which had helped it to transform in an outstanding thriller. It must be highlighted that, if it hadn't been for the basic and predictable treatment in terms of its visuals and the nuanced plot that they impregnated to its powerful and influential premises, and surely, it would get the name of 'cult film'.\r Apparently, the latest releases will improve the disappointing streak of summer films, which is coming to an end. \"Nerve\" is the best teen film with suspense and action that I've seen, and certainly, it is the surprise of the summer - surprise very similar to \"Unfriended\" in April of the last year - because of it entertains, startle and make us reflect about our participation in that vertiginous virtual world. Nerve knows we’re already playing the game."
    },
    {
      "rating": "8",
      "text": "An entertaining film, short and a cool cast. I like Emma Roberts so I watch all her films hahah. Was waiting a bit more for the end, but it was still good. :)"
    },
    {
      "rating": "8",
      "text": "Everybody loves these Internet games, the Pokemon craze showed that in real life.  So this story was not that far from reality.  It might not be long before the computers will be able to do something similar, and everyone carries a cell phone, and now we have Wi-Fi.  I liked the story line of the girl and her friends, and the mystery man.  I'll give it extra points for original story."
    },
    {
      "rating": "8",
      "text": "It's a good movie to me. I had a good time, the neon colors makes all the movie beautiful, and you don't know how could finish. The end... pfff it would be better."
    },
    {
      "rating": "6",
      "text": "An interesting premise that aims to appease both social media addicts and those who despise social media. The script is cliché and the acting is pretty awkward, but you'll be too distracted by the dizzying pace of events to even notice most of the time."
    },
    {
      "rating": "5",
      "text": "Pros: Good Cinematography a Good concept Okay Things:acting and writing Cons: Lots of plot holes, Stupid/cheesy scenes and the Stupid things that the characters do in the movie"
    },
    {
      "rating": "1",
      "text": "Because I managed to watch this movie to the end, I'll give it a 1 instead of a 0. There's not really much to say about it other than its a teenie movie about a girl and guy doing crazy crap to make money and to be popular. My brain can't manage recalling anything more about it, or anything more to say. Bye."
    },
    {
      "rating": "7",
      "text": "Nerve was actually a decent movie about a group of teenagers playing a perilous cyber-game equivalent to truth or dare. To say the least, the mid-section of this entire movie is what held my attention the longest, as viewers watch these teens partake in not only increasing stakes, but also competitions among each other. Those were the best moments, even if it isn't very deep. Rather, this movie wants to entertain you, which certainly works in this case.\rBut the movie is weighed down by the very beginning and very end. The beginning sets itself up as a cliché instead of, perhaps, introducing a character desiring this sort of gambling. It also eats up fifteen minutes, much of which can be left out. The end insultingly tosses away everything the mid-section of this movie did right and left Vee, the main character, with a weak character arc. Again, I don't blame the mid-section; I blame the ending for this. I would like to talk about the other assorted flaws with this movie's ending, but I don't want to risk a spoiler here. Feel free to watch this movie and take from it what you will."
    },
    {
      "rating": "7",
      "text": "I have to say Nerve is one of the best adrenaline movies I've watched the last couple of years. It has a fast pace but still gives us enough time to enjoy the characters. The actor choice was great,bot Emma and Dave gave us that realistic feeling of the movie and a perfect fit for the main role characters.The side ones were not that great but it didn't affect me that much. The dares are all really exciting and unpredictable, I loved that they combined professional filming with the amateur and realistic one (for the dares).\r The plot is so amazing that when I was re-telling the story to my friends it took them some time to realize i was talking about a movie and not real life situations.The idea is somewhat innovative and well-timed (since today's world is focused on the internet). It has a moral, but that last part was a bit sloppy and cliché which made me give a worse rating than it could have been, it was at parts pretty unrealistic and pathetic. It bothers me that some things in the movie are not explained at all and makes it a bit senseless, but it still reached my expectations and made it really enjoyable to watch.\r To sum it up: big plus to the main actors and the plot itself, but the big downside is they way the movie ends, could have been much better.\r I would recommend it to anyone who love adrenaline-action movies that reflects on real life situation too ( even if it is not based on a true event ).Solid feedback overall."
    },
    {
      "rating": "6",
      "text": "Nerve started off with an interesting setting, a good build up but then eventually didn't quite know what to do with it. I guess there was some core message to be illustrated but it failed to be delivered properly. An interesting idea but a moderate execution."
    },
    {
      "rating": "6",
      "text": "Surprisingly enjoyable for a while, even while you're spotting all the obvious ways it's manipulating and pulling you where it wants. But it really craters at the end, pushing its timely and important message right in your face and slapping you repeatedly with it until nothing and no one can breathe anymore.There was a better way to follow through with this storyline and there were definitely way more uses for a completely unappreciated Juliette Lewis."
    },
    {
      "rating": "7",
      "text": "Emma Roberts & Dave Franco get involved in an online game that dares them to take increasingly dangerous risks. Meanwhile, more and more \"watchers\" goad them on. This spins the concept of Pokémon GO into a social media thriller that's pretty effective. As the challenges escalate, the romance and teen angst amp up (even though both actors are 7-12 years out of range). Sure, it strains credibility, but this unique concept develops with energy and a youth-oriented approach that keeps it involving and fun to \"watch.\""
    },
    {
      "rating": "4",
      "text": "This movie will probably fare better with twelve year olds than it will with adults. The story is flimsy, things just seem to happen and somehow, by some small miracle, work out. The dares are sometimes nice to watch. You'd expect more people to get killed trying dumb crap like this. The acting is okay, for a teen movie of course. In the beginning it manages to engage the viewer, but in the end it just can't deliver in any sort of meaningful way."
    },
    {
      "rating": "8",
      "text": "This piece of teen bubblegum pop cinema is an infectious, hyper-paced, and oddly stirring work. The films tells the story of a safe, predictable teenage girl, Venus/Vee (Emma Roberts) who opts to find take a risk by playing the online game \"Nerve\". This game asks new sign-ups to either be a watcher or a player. Watchers, well, watch. Players are tasked with dares they must complete for serious cash prizes (one such dare rewards $15,000!) depending on the challenge of the dare. Often dangerous, death-defying, illegal, or simply incredibly awkward, the dares increase in difficulty along the way, putting our characters in serious harm. A comment on the culture of anonymity on the internet, Nerve is a fast-paced, fun, and certainly important film that reaches the target demographic incredibly effectively.With all of today's top 100 pop songs as its playlist, as well as incredible usage of technology such as facetime/skype, Facebook, computers, and texting, Nerve is a film aimed at teenagers. However, it is adorned with an authenticity that makes it feel real. It is a film for millennials by millennials. As such, a lot of teenage lingo is included and will likely leave older viewers feeling old. Yet, this hyper, knowledge at your fingertips culture does have a truly positive impact on the film, as it is a very quickly paced movie. Things accelerate quickly and the film races alongside its characters with odd amounts of ease, as it never loses itself or becomes too quick. Instead, its hyper speed really matches the modern society incredibly well, allowing the film to be a great parallel of the 21st century and put it in prime position to critique our world.And critique it certainly does. Highlighting the risks behind internet anonymity, internet game trends, cyber bullying, and peer pressure, Nerve is certainly a film of the moment. In particular, the climax of the film really highlights all of these dangers and shows the lengths our society has been driven to, as a result of being able to hide behind a screen. Though the ending may be in your face, it certainly has to be, given its target. As us millennials are likely staring at our phones, Nerve knows it needs to spell out its message and it certainly does this. However, this force feeding does not undermine the grace or execution of this message. Rather, it only furthers its urgency. In many ways, the climax parallels something out of Ancient Rome or lines Maximus would and did scream out at the crowd in Ridley Scott's Gladiator. Should our society not stop hiding behind a screen, which allows us to commit atrocities, there is certainly a chance we end up like Rome and Nerve recognizes this threat. If the person on the other side of the computer stops being seen as a human by the user, our society is doomed and Nerve is an urgent call to wake up before it is too late.This said, Nerve is hardly all message. Rather, it is still an energetic film without its message and could be categorized as a teen romance to some. The definition of teenage romance with 25-year old Emma Roberts starring as Vee who meets another \"player\", 31-year old Dave Franco who plays the risky daredevil Ian/Sam. In all seriousness, both Roberts and Franco turn in very good performances with terrific chemistry. Though relying upon teenage movie cliches, the duo are really well fleshed out and their characters' chemistry is very good. While some may say that Vee certainly turned on a dime from the beginning to the risk-taker she was at the end, it does feel plausible to me, given Ian/Sam's personality. A risk-taker who Vee was immediately captivated by, she essentially felt the need to play catch-up and fed off of his energy, rather than making a change in her own personality. Rather than changing, she was merely emulating the actions of the man she fell for. That said, these characters are hardly perfect. With useless back stories and supporting characters that are really not that well fleshed out beyond cliches (the friend-zoned hacker guy friend, the slutty best friend, and the Asian friend).Yet, Nerve makes up what it loses in characters with #aesthetic. One may claim there is too much neon in this movie. In fact, it overwhelms one shot towards the beginning. Though it often mirrors reality, Nerve it felt the need to make it almost dream-like or Nicolas Winding Refn movie-esque with every light swapped out for the neon equivalent. With glowing blues, pinks, and yellows, Nerve is one neon-filled film. And I loved it. There is no such thing as too much neon. The one could be one huge lens flare of neon that obscured the entire plot and I would have been completely satisfied. There may be a day where a film comes out with too much neon, but Nerve is not that film. Rather, it creates an oddly surreal looking world that just looks absolutely terrific. Set against the dark gray buildings of New York City, the color palette here really pops."
    },
    {
      "rating": "7",
      "text": "Nerve is a good film with a plot that's so original and very action-packed. Emma Roberts's performance is literally outstanding, and the direction is well-executed. The first half is probably one of the best things I've seen in 2016 so far, only problem is that they should've sped up the evolution of the game in its final and stages and focused more on the aftermath to give it a better conclusion. Other than that, everything works about this well-deserving-to-be-called thriller."
    },
    {
      "rating": "8",
      "text": "Emma Roberts & James Franco along with some special Orange cast members, Nerve is all round excellent performances. Thrilling, fun, fresh and exciting."
    },
    {
      "rating": "7",
      "text": "Nice to see Emma Roberts play an innocent gir for once. She proves that she can do more than just play a **** like in Scream 4, American Horror Story and Scream Queens. Despite being 25. She's like Britt Robertson where she can play a teen still. Plus Dave Franco plays a cool kid for once and pulls it off.Nerve isn't great but it's likeable due to the leads. The story is decent too if you like a cutsie teen version of the movie the Game."
    },
    {
      "rating": "3",
      "text": "Nerve.  I was genuinely excited to see this film because it has a very interesting concept and it’s rather interesting that it has coincidentally come out around a similar time that Pokemon Go has become popular, though obviously that is a complete coincidence.  Nerve is a great film, provided you don’t think about it in any way whatsoever.  The second you do, this is so stupid.  The whole point of the film is that it never explains half of what is going on, so as a result we have little or no idea.  It’s also really unsubtle in its whole commentary on young people’s use of the internet, including YouTube, GEO cashing and trolling and Facebook.  The whole concept of being forced to do dares online for money is actually an interesting idea, but they never really expand upon it and there are a couple of moments which are way too far-fetched and as a result sink the movie.  I will say the ending, despite being incredibly abrupt and anti-climatic and didn’t answer half the lingering questions I had left over was at least a lot better than the messages from Friend Request and the god awful Unfriended.  But it still did not work and this film annoyed the hell out of me because too many people gave this film a pass.  No, it’s a bad film, really stupid and I am going to go against the critical consensus on this one, this is probably one where everyone else likes it and I think it is rubbish for 2016."
    },
    {
      "rating": "6",
      "text": "The movie was really well made, but I found some of the things in the storyline too dumb, especially how they made it that people did not care about others when watching Nerve and also the main characters felt a bit weird, I mean in the sense that I didn't understand their desires and needs how the movie wanted to show it."
    },
    {
      "rating": "7",
      "text": "In love with this movie. The movie was so well written. Finally I saw Emma Roberts (huge fan) doing a character that wasn't just mean or a **** Good plot twists in this one. Lately, every movie has so many plot holes, however I only found two here-Who made the game? We know that every player is a server itself making it hard to find out, but still.-Why does the police not care?"
    },
    {
      "rating": "3",
      "text": "Emma Roberts and Dave Franco's charisma is the only redeemable aspect of this far fetched, plot hole littered mess. Original for sure? Yes it is but the concept is the only thing that remotely worked for this film from start to finish."
    },
    {
      "rating": "8",
      "text": "Nerve's plot may be predictable (and, thus, it has a cliched ending), but anyway, it shows magnificent interpretations, a thrilling storytelling and, thus again, a satisfying result for the audience."
    },
    {
      "rating": "7",
      "text": "No es una peli memorable con el objetivo de dejarte pensando o algo así, es una más que logra divertirte un rato"
    },
    {
      "rating": "8",
      "text": "A solid, entertaining thriller! I really enjoyed this movie. I'm not sure if the idea of people being involved with an online dare game is original, but the story was well developed and flowed nicely. Both Dave Franco and Emma Roberts proved to be worthy leads and had great chemistry together."
    },
    {
      "rating": "7",
      "text": "Though having lost control of itself by the end, Nerve still entertains with its unique characters, concept plot, and originality, even though the story may only cater to young teens."
    },
    {
      "rating": "2",
      "text": "In a word: stupid. Not that I was expecting a techno-teen-thriller (or at least this is how it looked to me from the trailer), but there is no tech, no thriller, just the teen part.\rThe nerd/geeks/hackers have nice outdated network graphics but there is no explanation on \"how\" (or at least \"why\"); the centerless gaming seems to be run by sociopaths (really, everyone was cheering for the V lady to the end, when everyone suddenly wanted her killed) or at least idiots. The decryption of real names from the login IDs is particularly idiotic, but let's pass this.\rBut the transformation of the heroine from one having fears just to talk to the high school male star into escaping almost nude from a store, driving a blind motorcycle race (and being even more insane than the male driver), and walking a (very insecure) staircase between two buildings in just a few hours ... I simply don't buy it.\rThe characters are also sketchy, acting is just ok (with the bad exception of Juliette Lewis mom being exceptionally stupidly scripted and unconvincingly acting - really, all the money disappearing from the family account and the only kid missing, after the older brother died at roughly the same age !). The script is linear, stereotypical characters (the leading pair, the nerd, the bad girl, the mom, and the unnamed evil) - just the directing is good. Might have saved the director for a The Fugitive-like movie.\rNot recommended unless you have nothing better to do. Even so, you'll figure the movie in the first quarter of hour, and what's let to be discovered if we got to see Emma Roberts gorgeous body or not."
    },
    {
      "rating": "5",
      "text": "Nerve is a stereotypical teenage drama with a twist that seems interesting enough, but is poorly executed. Nerve gets points for excellent cinematography, a world that seems living and breathing, and keeping a consistent story throughout. It also structures an underlying message of how we use our phone as a means to feel invincible just because you're behind a screen. However, Nerve has poorly written dialogue, a plot so predictable that you could've guessed by watching the trailers, and has characters so bland they might as well be on a cereal box. The chemistry between our two main characters, Dave Franco and Emma Roberts, is forced and pivots off of cliches created by every teen drama to date. The basic plot to Nerve had so much potential and could've been a lot more philosophical and deep, unfortunately not much can be said about this movie that you will forget that you saw within a couple days."
    },
    {
      "rating": "4",
      "text": "While it is nice to see a movie about a girl coming out of her shell going to take YOLO to the extreme with a guy, this film is ladden with alot of cliques with some of them nearly painful. While the main actress and actor did a fine job with what they were given, the film is rather boring in the first 30 minutes and gets better the more she does the dares, till it just ends and that is really the movie. The pacing for the film was decent but what tone the film wanted to set somewhat mixed going from light hearted, to intense, to mean spirited for no good reason, then to intense, and did it pay off, not really. Still this film more deserves a 4.5/10 and was better than Ghostbusters and hopefully the writer can learn from her mistakes into the next project she is given"
    },
    {
      "rating": "7",
      "text": "Very, very solid script with great (if not slightly hurried) character development for Vee and her friends. Special effects are somewhat overdone (such as the scene where the motorcycle magically comes to a stop two inches from the end of the road... that was probably unnecessary) but are nonetheless believable (to a typical movie degree) and buttress the movie's central motive, which is to be a dramatic thriller. My only true grievance is with the conclusion of the storyline–it's the most obvious thing that could have happened to Vee and her friends and I would've hoped for something a little less expected."
    },
    {
      "rating": "5",
      "text": "Nerve has major elements that work and many that simply don't work. What works is the concept and the message. The concept of a truth or dare mobile phone game is both smart, original, and relevant to today. I feel something like this could happen for real in the future and there are enough dumb people that would play this. The message is how people get desensitized online and how certain actions can mean big consequences. Like the concept, this message is important, original, and relates to today's world. This film shows the dangers of social media and how simple actions can impact people. Overall, the concept is original and the message is important. Not to mention the nice neon- colored cinematography of New York City that gives an interesting look to the city and improves the overall production.What fails on Nerve is that everything else is mediocre. The actors don't convey much emotion and all the characters are all teen stereotypes. It feels like the teens in this were thought up by adults who think they know how teens act. The characters don't feel authentic and aren't worth rooting for. As a thriller, there is little edge- of- your seat action or shocking moments. The conclusion is very predictable and cops- out in an overly safe manner. In addition, while the first two acts were believable; the third act jumps the shark. The plot becomes contrived and completely unbelievable things happen. Overall, Nerve has a nicely original concept and a good message. This is let down by one- note characters, mediocre acting, and a crazy third act that leads to a overly safe ending. Think of Nerve as a PG- 13 Disney Channel movie."
    },
    {
      "rating": "10",
      "text": ":)Blisteringly cool one moment and ridiculously silly the next (much like its high school heroine), this punchy and propulsive late summer surprise is able to capture the way we live now because it displays such a vivid understanding of the reasons why we live that way. Read full review"
    },
    {
      "rating": "8",
      "text": "Not by any means a \"great film\". That being said, it is a fun ride to sit back with some popcorn and enjoy. I thought Emma Roberts and Dave Franco worked very well together and the story kept me entertained throughout despite a few unnecessary aspects. Good movie definitely worth the watch."
    },
    {
      "rating": "4",
      "text": "This movie is pretty meh to be honest. There are several flaws that just don't make sense for example nerve is a dangerous dark web software that could end up killing you. Why is it becoming viral? People are actually encouraging others to do extreme dares for money and you can end up dying. I can understand this movie is trying to show how people would do anything for attention on the internet but they are really over exaggerating. The things they do are dangerous and illegal. They even came up with the stupidest names for websites. They called Reddit \"Shareit\". Why? That sounds so stupid. They didn't even bother to change the logo they just kept the same Reddit logo. I don't wanna go into too much detail otherwise I'd be spoiling the movie if you wanna watch it which I don't discourage you to do so. I would recommend this to social mainstream teenagers age 16-18 but I wouldn't watch it if I were you."
    },
    {
      "rating": "0",
      "text": "Un film pour adolescents et adulescents, c’est-à-dire si bas de plafond et tellement con qu’on n’en croit pas ses yeux ni ses oreilles… et pourtant le sujet des réseaux sochiasses et de l’influence qu’ils ont sur tous les jeunes trous du cul, laissait espérer (sans doute) a priori quelque chose d’un minimum intéressant.Mais ça se cantonne à l’esprit « Jackass » (en moins dégueulasse quand même) et ça baigne dans la naïveté bête et simplette au fil des défis plus idiots les uns que les autres que ces **** cons et petites connes accomplissent pour faire des vues et du fric (du classique chez les youteubés et autres influenceurs de mon cul, bien entendu.En tout cas, c’est rapidement aussi ennuyeux que désespérément stupide, malgré les deux bonnasses et notamment la blondinette Emma Roberts qui porte assez bien son nom, ma foi (de jolis roberts apparemment !). Pas assez voyeur cela dit, y compris pour le spectateur le plus motivé : cette petite daube de film vole au ras du caniveau et tombe directement dans la bouche d’égoût la plus proche. On ne sait pas comment ça finit, de toute façon, on a zappé !"
    },
    {
      "rating": "7",
      "text": "This movie tells about stuff that is more real than what people may think. I liked this movie, It is enjoyable even though It could have been better. VOTE: 7/10"
    },
    {
      "rating": "7",
      "text": "Nerve: first of all, has a wonderful scenario.like the blue whale game was formerly populer game on earth.If we go to the movie,I've sensed disconnections in some scenes,especially in transitions.I can say that there were irregularities or **** in some scenes at camera angles.Because the whole image is either attracted by viewers or broadcast owners, and We can watch the film through their images,I may not have fully understood the balance.The sound of the film is one of my favorite events in the movie,is incredibly adaptable at movie.a good love story that we cannot fully understand from the action of the game is not overlooked.a good film that gave the viewer 1-2 beautiful messages until the last moment.I think the film could be a bit more actionable or a little bit more rushed, maybe a little bit more stressed at the end.But overall it was a nice movie not perfect but nice and I think teenage viewers it likes movie more than other viewers"
    },
    {
      "rating": "10",
      "text": "\"Nerve\" é um excelente filme, com um tema muito bem trabalhado, através de uma história pulsante e intensa.10/10"
    },
    {
      "rating": "5",
      "text": "This is a mystery/thriller film covering themes including computer trust, dares, teen angst and peer pressure. It is very much a teen film, with the characters attending school and so on - probably seniors, around about mid to late teens age wise. I thought the main plot seemed interesting and its certainly quite a relevant film, in as much as teenagers face issues with technology, particularly with social media, with others in their peer groups putting pressure on people to adapt to the newest, latest sites, apps and so on. I liked that at times your shown the city (NYC) from above and everyone who is involved with the 'Nerve' game/app is pointed out via their username displayed above where they currently are (in a flat etc.). It helps to make the viewer feel that the real world is very much also part of the online world - that sense of the online world bleeding in to the real world is quite creepy, although its not really a completely original concept. The film made me think of shows like Jackass, in which adolescents hyped themselves up to do increasingly bizarre and, in their case often quite painful, physical or certainly embarrassing and humiliating dares. I suppose a lot of it comes down to the need for attention and the crave of being respected and popular, something which I can remember quite well from when I was in my mid to late teens. I think I recognised the app people watch the various game players on as being periscope, although there could well be multiple live streaming sites but the use of live comments streaming and the emoticons (love hearts etc.) appearing made me think of that one.Cast wise, I can't say I was particularly impressed by the cast in general. Emma Roberts plays the main character, Vee and I didn't feel she gave a particularly good performance, as in one particular scene she appeared to forget about the circumstances she was in and didn't appear to react very convincingly, in my mind anyway. Other cast members include Dave Franco as Ian, who Vee teams up with, Juliette Lewis as Nancy and Emily Meade as Sydney.Content wise, the film contains partial nudity, some moderate violence and the ocassional use of mild profanities. As the plot develops, things become more serious, with more potentially dangerous dares being requested to the players and as these are being, if hesitatingly, undertook, it could frighten young viewers. Some I found myself feeling a little squeamish and wanting to look away, if but briefly. Due to this, the film has been given a 15 rating in the UK.Music wise, unsurprisingly the film features a quite contemporary sounding score, with upbeat hip-hop, R&B and pop type songs played at times. Regarding the camera work, infrequently there were quite sudden, sharp and jerky camera shots used but that was done to emphasise the fast pace and impulsiveness of the portrayed scene.I like the main plot concept and the issues it brings up but it didn't feel at all extraordinary as such. If anything, I felt it had a TV movie feel to it. I also wondered where the money (being paid for successful completion of each dare) came from. Another potential flaw, although I realise I'm maybe being a bit pedantic, is that I wondered how the heck the said watchers were able to view quite so much via a mobile phone camera, in as much as she was on the move and going to various places, without holding it all the time, so how come when the viewer was shown the live stream, they seemed to have a relatively clear view of her, where was the inevitable shots of a phone inside a bag or something? (yes, I did say I can be pedantic!!). Also, on pretty much the same subject, only another angle, or aspect of it - in this day and age of smartphones, with peoples mobile data presumably used to be able to stay online - how come peoples batteries didn't die? the plot seems to take place over less than 24 hours and yet people were seemingly following events for multiple hours, with live streaming and their phones didn't go dead? I don't believe that to be very realistic at all, as other people may agree(?). Of course thats not really the main point of the film as such but it doesn't really help any films cause if there are fairly obvious unrealistic aspects, like this.To me, there weren't enough answered questions. Overall, it was alright - the ending was quite a surprise to me but it certainly isn't perfect and won't appeal to everyone.I wouldn't go out of your way to see this - if it comes on TV and it interests you, then yes, you may enjoy it. The plot is relatively interesting and some scenes were fairly gripping but I didn't think the performances were especially great. Its alright but I wouldn't say its worth spending much real money to see, so I'll opt for no as far as recommending it is concerned."
    }
  ],
  "recommendations": [
    "what_happened_to_monday",
    "colossal",
    "chaos_walking",
    "sicario_day_of_the_soldado",
    "fifty_shades_darker",
    "contagion",
    "downsizing",
    "limitless",
    "tenet",
    "the_darkest_minds",
    "gone_girl",
    "lucy",
    "children_of_men",
    "anon",
    "brimstone",
    "now_you_see_me",
    "code_8",
    "run_hide_fight",
    "predestination",
    "the_accountant",
    "tomorrowland",
    "the_machinist",
    "coherence",
    "elysium",
    "the_maze_runner"
  ]
}