{
  "id": 1320,
  "title": "Never Back Down",
  "starring": [
    "Sean Faris",
    "Amber Heard"
  ],
  "runtime": 115,
  "genre": [
    "Drama",
    "Action"
  ],
  "description": "Jake, full of anger after his father's death, is just starting to find a place for himself at his new Orlando high school - until Ryan, head of an underground MMA fight club, picks Jake out as a prime opponent. After being trounced by Ryan in front of the entire school, Jake begins training under the firm, moral guidance of a MMA master, where he learns how to fight... and how to avoid a fight. But it becomes obvious that a rematch will be inevitable if Jake wants to stop Ryan and his bullying, once and for all.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8oRUTyP1QAtGDMvRpKZyuyFPG0U.jpg",
  "categories": {
    "plot": 7.0625,
    "acting": 6.823529411764706,
    "ending": 4.5,
    "soundtrack": 5.5,
    "cinematography": 5.5,
    "familyFriendly": 5.75,
    "funny": 5.0,
    "action": 6.3
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I think this movie promotes too much violence in our schools. We don't need these kind of movies influencing the kids in our schools."
    },
    {
      "rating": "2",
      "text": "This movie was a cheap remake of Karate Kid, with about as much quality dialog. The only thing I liked about this movie was well... the fighting. But the storyline and character development, as well as the theme were B-rate at best. Over all it has some fancy moves for MMA lovers, and fight fans but no substance to back it up."
    },
    {
      "rating": "10",
      "text": "never back down is one of the best fighting story movie i have ever saw! i will be glad if there would be another one! thanks!"
    },
    {
      "rating": "10",
      "text": "This movie was so good I loved it they had a great choice in actors."
    },
    {
      "rating": "0",
      "text": "I'll save you 90mins or so of your time: boys dad dies, boy moves to ...orlando (of all places). Boy meets girl, girl has nasty boyfriend. Both boys fight and good boy gets girl. Absolute formulaic crap which should have gone straight to the 1.99 dvd bin. Christiano Ronaldo lookalike does karate kid (badly) with absolutely none of the charm. Worthless film. A complete waste of time. 0/100."
    },
    {
      "rating": "10",
      "text": "Excellent film went in expecting to not find much but was really entertained! Want to go and see it again already!"
    },
    {
      "rating": "8",
      "text": "What made this movie was the decent acting. Everybody fit their roles perfectly so I'll credit there. I always love me some Djimon Hounsou - he's such a great actor! I rated this movie for what it's worth and I'll admit, I did enjoy it. Made me want to get into MMA haha."
    },
    {
      "rating": "1",
      "text": "MMA is not a style, and you cannot have MMA skills. If you cross train with no particular preference (everybody has their main discipline) you are called a \"freestyle\" Martial artist and if you compete in the ultra regulated realm of mixed martial arts you are still a free style martial artists. Stupid movie."
    },
    {
      "rating": "10",
      "text": "I loved this movie. From a martial arts stand point, it was amazing. I liked the story and the editing was superb. Definately one to see."
    },
    {
      "rating": "7",
      "text": "Surprise, surprise; this ain't an oscar contender. But if you go into it looking for something more than a MTV style popcorn flick you're the fool. Yes, its a straight rip of the Karate Kid, but you know what I loved the Karate Kid, the story has been repeated so many times because it works. If you're looking for intellectual stimulation look elsewhere, but if you have a fond nostalgia for Van Damme Bloodsport type flicks this is the one for you."
    },
    {
      "rating": "3",
      "text": "Djimon gives a good performance, but the movie itself was so cliched that i think it was intended to be a comedy. Yes, million dollar baby is cliched too, but at least it has superb performances and excellent direction. You simply don't connect to the characters in this movie"
    },
    {
      "rating": "3",
      "text": "3, only for the professional editing and camera work. Otherwise, ZERO for glorifying violence as an ultimate solution to teenagers in high school."
    },
    {
      "rating": "9",
      "text": "This one of the greatest movies I have seen in a long time and the ending was fantastic."
    },
    {
      "rating": "10",
      "text": "The movie was awesome it also was one type of movie i been looking to see come out so i guess any one thats under 30 would critics this movie openly an widely yet yes their more details i could throw in yet hey the movie was pretty much very detailed which some movies need to express an do when they make them."
    },
    {
      "rating": "10",
      "text": "Great movie!! I love the music in this movie!!!"
    },
    {
      "rating": "10",
      "text": "One of the best movies ive seen in a while, I really connected with the story line and the characters."
    },
    {
      "rating": "5",
      "text": "Not very interesting story, rather mundane and it has all been done so often before. I had a hard time staying interested in the film."
    },
    {
      "rating": "10",
      "text": "10 out of 10 for sure!!!!!!!!!!! this is my favorite movie and i never get tired of watching it over and over again. the actors were great picks!! i think the same as another person in here that said that the older people who rate these movies wont like it as much as us teens do. cuz me and all my friends luv luv luved it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! #1 movie if u ask me!!!!"
    },
    {
      "rating": "5",
      "text": "Not as bad as Haold and Kumar. A worthy effort for a so so script."
    },
    {
      "rating": "2",
      "text": "This is a horrible movie, no doubt.....bad acting, filmed horribly, and its a cookie-cutter twin of \"The Karate Kid\", a film thats far superior and ultimately way more inspiring than this crap. The fights (which is what this movie was riding on) aren't even that interesting to watch and im a avid fan of the UFC and MMA, the fights were VERY poorly choreographed and while they seemed brutal, its nothing some slow-mo \"foot to face\" contact and bone crushing sound effects can't sugar coat. My advice, skip this UFC+The Karate Kid+The O.C.=C.R.A.P. movie and just go rent or buy \"The Karate Kid\", its probably cheap than \"Never Back Down\" and its a WAY better film."
    },
    {
      "rating": "2",
      "text": "This is one of those movies that you'll have to scrape your jaw up off the floor after watching. Unbelievable stupidity (dialog referencing 'The Illiad' is downright painful), moral hypocrisy (and I'm a 'Dexter' fan) and more gay subtext than Top Gun (complete with Tom Cruise look-alike) adds up to a downright painful watch."
    },
    {
      "rating": "10",
      "text": "Karate kid meets fight club, it is by far the best film in the world, it is the best movie made by a living person, no one can touch this film it has gr8 standards."
    },
    {
      "rating": "0",
      "text": "Wow, unredeemable in any way, except for being a marketing tool for product placement of lifestyle obsession. I watched a screening today - even with free tickets this movie lacked everything. Amistad was a great movie, why would Djimon Hounsou be in this trash... Can a movie be held together by plot holes?"
    },
    {
      "rating": "10",
      "text": "This movie is the most incredible movie i have seen for a very long time"
    },
    {
      "rating": "9",
      "text": "I loved the movie and thought it was totally worth seeing. I loved the whole story line of the movie and how he never gives up. If you like movies that keep you on the edge of your seat you will like this one alot :)"
    },
    {
      "rating": "3",
      "text": "I have seen this staff too many times already. This is a boring application of the same old recipe. Poor script, performances and direction."
    },
    {
      "rating": "4",
      "text": "Sport or misdemeanor? Athlete or thug? \"Never Back Down\" doesn't try to boost the sport of mixed-martial arts, which makes \"Never Back Down\" somewhat watchable, without ever being particularly good. If you're old school(here's the test: Do you know what OMD stands for?), you'll wonder why nobody calls the cops. Had \"Never Back Down\" wanted to legitimize the sport, Jake(Sean Faris) and Ryan(Cam Gigandet) would square off in an official tournament. The sport maintains its outsider status, but it does so in the unlikeliest of venues; a high school, which makes \"Never Back Down\" look like \"Fight Club 90210\". It's the strangest sight to see all these well-groomed boys and girls cheering on two preppie gladiators in a knock-down-drag-'em-out fight. Amber(Baja Miller) is a freak; all the girls are, in this \"Karate Kid(The)\" update. They want to see blood. They don't look shy away from pain and suffering like girls used to, say, in 1984, the year of \"sweep the leg\". I'm pretty sure Ali(Elizabeth Shue) flinched each time Daniel(Ralph Macchio) got hit."
    },
    {
      "rating": "9",
      "text": "Once you let go of your expectations, and let this movie take along for the ride, the end result is a very enjoyable (is somewhat flawed), inspiring experience, so much better that the majority of films that have come out recently. See this."
    },
    {
      "rating": "10",
      "text": "This was the best movie I have seen in a long time. I have seen it 3 times in a week!"
    },
    {
      "rating": "10",
      "text": "This movie is truly a work of art that has no match! I am surprised (and angered) from all the people that perceive this movie as a political statement and fail to look at all the time and work that has been invested in this amazing movie.The photography,costumes,acting...etc have all been reduced to trivialities in order to favour of political statements.The fact is that there is no other movie that the actors are speaking ARAMAIC and LATIN and that alone is enough for me to give it a favorable review.I am a Christian and I was very touched by this movie...the Jews were solely responsible for the torment of Jesus - they DEMANDED his crucifixion,so I really cannot find any trace of anti-semitism in this movie (only truth).Furthermore Jesus was (indeed) tortured and humiliated so I cannot understand why people are so critical to the violent scenes.What did they expect to see?Everyone says the movie is violent but no one is willing to say HOW the movie ought to portray Jesus's crucifixion!!!Thats just MORONIC!If I 'shoot' a violent and very graphic documentary about the war in Darfur will you call me deranged? The way I see it every review that judges this movie either on the grounds of anti-semitism or violence is redundant and false because the Jews were indeed responsible and because Jesus was indeed tortured."
    },
    {
      "rating": "10",
      "text": "Loved it 10/10 there scoring system is based upon 100 old guys... thats why all the good movies have crappy reviews."
    },
    {
      "rating": "1",
      "text": "The sole reason i gave this waste of time a 1 Is that there are a couple of good songs in the sound track, and to any high school student out there, violence solves nothing!!"
    },
    {
      "rating": "10",
      "text": "Thought this movie was absolutely amazing, had you attached till the very end, would recommend it to anyone who loves action fight kinda movies. Buying it as soon as it comes out"
    },
    {
      "rating": "9",
      "text": "This movie was pretty good and everything was set up nicely for the big finish."
    },
    {
      "rating": "3",
      "text": "Tom Best basically did wrap this movie up. The movie looked good to be honest but fell so far from the goal line. At least if you threw in some actors that people know of then the movie would have been good. Go watch Fight Club way better fighting movie then this crap"
    },
    {
      "rating": "8",
      "text": "This movie isn't intended for older audiences. It's a good story, the acting is actually decent. It deserves a watch."
    },
    {
      "rating": "1",
      "text": "When I first saw the previews fro this film I said to myself: \"What the hell is the teeny-bopper crap?\". At first, I had already judged it a terrible film, but then I thought hey, let's give it chance, and boy were my first assumptions rights. This movie is awful, but then again, I'm not brain dead or a a teenager who is easily wowed by fight moves that they obviously copied off of Power Rangers and a bunch of pretty white kids (That's what MTV and the CW are for and still all crap all the same). It's a blatant hypocrite \"Violence is not the answer.\" Oh please, Mr. Director, get your head out of your ass! And the worst part is it's got he guy from Blood Diamond, really?! What are you thinkin Djimon?! I know, this movie is for teenagers, but even for them, at this era of time, this is trash, but the music is fine, the only reason i didn't stuff hot nacho cheese in my ears and gouge my eyes out with twizzlers. To anyone who like it: REALLY?!"
    },
    {
      "rating": "1",
      "text": "What a stupid, stupid movie. Not only does Never Back Down succeed in giving martial arts an unnecessary reputation for teaching people how to hurt others whenever they want to, the movie encourages people to be violent and shallow. As a sidenote: the only two people I saw in this movie that had any responsibility whatsoever ALSO HAD A JOB."
    },
    {
      "rating": "6",
      "text": "Bad ass goes to new school, have we been their before. he's old school and tries to develop new school fighting techniques. solid movie. it's been done before though."
    },
    {
      "rating": "10",
      "text": "This movie is definitely worth watching. Not only does it succeed on the fact that it wraps together an interesting story in drama and question but it puts the action in the right place. No more of these silly movies where Vin Disiel-like people defeat full armies. Of course we've seen this kind of movie before, but the plot was put together just fine."
    },
    {
      "rating": "0",
      "text": "1. Could not possibly be more derivative. In this respect the filmmakers should feel ashamed. Not one atom of originality or freshness in this stale rehash of Karate Kid and Fight Club. 2. You know the whole movie from the trailer; in this respect the film just...is bad. Who wants a movie experience in which you know the end from the trailer? Boy gets beat up. At end he beats up bully. 3. Another fine example of Hollywood pumping out lame, uninspired product that panders to a youth audience."
    },
    {
      "rating": "8",
      "text": "I gave this movie a gander on bargain Tuesdays at the local theater. I have to say, from a guy that plays sports, and is a sucker for sports movies, I really enjoyed this movie. Sure some parts were cheesy, but when you caught the cheesy parts, the film would let you know it. The parts with fights getting posted on youtube was probably 90% accurate. The other 10% I left out because people never get that popular from fights on youtube. I found the girl in this movie, Baja, was pretty annoying. She was pretty much the \"dummy proof\" part of the story, where she was just there to say the obvious. If they just got a different girl, or didn't make her such a huge part of the movie, this movie is damn decent in my opinion. Djimon Hounsou, playing the trainer in this movie, was obviously really good. Casting couldn't have gone wrong with Djimon Hounsou. He really amped up the feeling in this movie. I couldn't help but notice how much Sean Faris looks like Tom Cruise, and how his acting techniques are pretty much the same. All he had to scream was \"i want the truth!\" Anyways, his acting was pretty good. Nothing special. He could definatley improve, which he most likely will because he is in two other movies this year. The camera angles were really entertaining, and besides the corniness of how it happened, the story arc was very well executed. Despite critical reviews, you can't help but feel amped when a loser becomes a winner. It's been done a hundred times, and this movie worked a different angle at it. It still worked. I came into this movie laughing, and left pretty surprised. I would definatly recommend to other people to watch this movie. I did not tap out half way through this movie."
    },
    {
      "rating": "10",
      "text": "i think that this film is a briliant contrast between the life of a fighter when hes out there training or in the ring to his life in the family i think that this film was really well thought out and made"
    },
    {
      "rating": "6",
      "text": "I would vote 9...good action fight movie, but the director made Capoeira look ridicule and silly...I teach Capoeira for 25 years and I think he should respect more my art form...also the actor who made the scene should be ashame to do those ridicules movements and get punch in the face...Capoeira is not what the director showed!"
    },
    {
      "rating": "10",
      "text": "Great movie. Even with the low profile actors, it still came out better than most of those \"Hollywood epics\" the dumb critics rave about. Would recommend to all action movie lovers."
    },
    {
      "rating": "10",
      "text": "Best movie i have watched in a while i watched it about 25 times already and i cant stop watching it i vote it a ten and the ppl that say the older ppl that vote wont like it are right cuz they don't like thinks we do were teens we wanan see that sh*t."
    },
    {
      "rating": "10",
      "text": "Sorry for the translation.\r Ok, by now on the merits. I feel a strong sense of sadness when I read reviews of films classified by not lovers like that \"useless, barren, arid, money thrown away, but stupid, like so ...\" and so on. The bitterness then turns into sadness when I hear and see film experts, on television, expressing distaste with sarcasm, maybe even embarrassed about putting something on that particular film has to say.\rPersonally, I am convinced that no film, admitted to public viewing, can be scored with the words used by Jake Tyler, \"useless junk, useless junk. I think this an extreme opinion on a film. If I act in this way, throw in a basket that is a film of a film, I threw away, in every sense, the work of many people. The work, which deserves respect.\r Personally, I am convinced that no film, admitted to public viewing, can be scored with the words used by Jake Tyler, \"useless junk, useless junk. I think this an extreme opinion on a film. If I act in this way, throw in a basket that is a film of a film, I threw away, in every sense, the work of many people. The work, which deserves respect.\r \"Useful\" junk, \". This is a term that I like. In each film there is something good. Extremism, including reviews, I am not convinced.\r The regista. Jeff Wadlow, try looking in a profound way the face of this guy. Incredible. Heard of him and you know why? Why is a person who listens. See also knows those who can listen to a director is crucial. I watch him, always see in him a deep and serenity, is a boy who transmits serenity and confidence. I confess that the two faces, one of Jeff, and indeed that of Jake Tyler (Sean Faris) led me to watching this film. Well, I got in some aspect of the film.\r The guilt.\rFeelings of guilt are terrible whipping, comparable in terms of inner pain, the scourging. Drunken father, Tyler does not replace driving, accident and death of the father. The mother, try to judge the mother, poses and not a little to his son the whole story. When you are aware of the actions committed, good or bad you are and you take all the consequences, show what is called sense of responsibility, maturity. In guilt, however, the mind begins a journey all illogical. Acts, actions, attitudes, no longer have a rational place, we become judges themselves too hard with all its consequences and emotional suffering.\r Wadlow's skill is to show a Tyler, despite all the events, yet master of himself and how? Serious commitment and application in everything he does'. Sport, leaves truce opponent. The school, the shield of Achilles. The brother follows him from afar. It is not an instinctive, see Ryan Mc. Carthy (C. Gigandet, good too).\r And why are so many Tyler and Ryan? Another point in favor of the director Wadlow, parenting behaviors. The smiles of the father of Tyler vs arrogance of the father of Ryan.\r Consequence of this is ... the example by your children. An educator, and every dad is, can leave traces in the boys, who become equal to mine wandering behavior. Beware the examples, dear dad.\r The mother did not help Tyler in, like, metabolize, the death of his father. Consequently, despite all these positive notes, the boy when insulted by the opponent on the field, has a violent reaction, well aware that is a clever thug. And this is worse. How many professional sports, today, paid its weight in gold, with their behavior in inciting violence.\r One last thing, though not like a movie, and this is, is a great gym, we are subject, for budding actors.\r As Homer leaves the narrative of war, to describe the shield of Achilles leads engravings on human nature, even I have to leave, not before I wish you all an affectionate\r Good Ciak!"
    },
    {
      "rating": "10",
      "text": "The greatest fighting film ever made. I have no idea how it's only been given 39, its a complete and utter disgrace. This film changed my life, and everyone should see it. A true masterpiece of cinematography."
    },
    {
      "rating": "6",
      "text": "Premissa fraca,porém o filme foi bem executado,Cam Gigandet dar uma boa performance como vilão,Djimon Hounsou sempre com uma ótima performance,Amber Heard é ótima,e Sean Faris dar uma sólida performance mas não é suficiente para um ótimo filme."
    },
    {
      "rating": "10",
      "text": "Fight Club is better, but thats one of the best fight films ever, so inspiring and motivating. If you watch you will be amazed about the major characters focus."
    }
  ],
  "recommendations": [
    "the_tax_collector",
    "gamer",
    "kick_ass",
    "the_twilight_saga_breaking_dawn_part_1",
    "four_brothers",
    "the_condemned",
    "confessions_of_a_shopaholic",
    "jumper",
    "slumdog_millionaire",
    "abduction",
    "real_steel",
    "seven_pounds",
    "polar",
    "assault_on_wall_street",
    "the_karate_kid",
    "i_am_number_four",
    "crank_high_voltage",
    "the_emoji_movie",
    "gran_torino",
    "the_guardian",
    "spy_kids_all_the_time_in_the_world",
    "code_8",
    "shadow_in_the_cloud",
    "the_twilight_saga_eclipse",
    "we_can_be_heroes"
  ]
}