{
  "id": 4765,
  "title": "New in Town",
  "starring": [
    "Renée Zellweger",
    "Harry Connick Jr."
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Lucy Hill is an ambitious up-and-coming executive living in Miami. She loves her shoes, she loves her cars and she loves climbing the corporate ladder. When she is offered a temporary assignment — in the middle of nowhere — to restructure a manufacturing plant, she jumps at the opportunity, knowing that a big promotion is close at hand. What begins as a straightforward assignment becomes a life-changing experience as Lucy discovers greater meaning in her life and, most unexpectedly, the man of her dreams.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zKQTQ2mmihtk8vwhE3pdfbOwljC.jpg",
  "categories": {
    "plot": 2.6,
    "acting": 2.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Not great, but much more entertaining than the bulk of these reviews would lead you to believe."
    },
    {
      "rating": "4",
      "text": "No worldly sophisticate by any stretch of the imagination, Marge Gunderson(Frances McDormand) displayed all the tell-tale signs of living in a small-town, but she was smart, on her own terms, funny voice notwithstanding. The Brainerd detective is the sort of character that's sorely missing in \"New in Town\", a person who could put the city girl in her place. The waitress tries. At the diner, the waitress ridicules Lucy(Renee Zellweger) for believing that the town of New Ulm celebrates a holiday which pays homage to the gopher. But really, the joke is on the old woman and the diner patrons, because that's the extent of the insularity Lucy surmises these rural folks embody. This company henchwoman makes the Bill Murray character in Harold Ramis' \"Groundhog Day\" seem congenial. At some point, however, Lucy's condesension will come to a halt, and \"voila\", the people she despises suddenly becomes the people she cherishes. But the manner in which Lucy goes about her transformation seems even more unearned than what is usually part and parcel of the rom-com formula. She simply gets into a car accident and emerges from the accident, a changed woman. This near-death experience negates the occasion for these Minnesota denizens to prove their mettle as Lucy's equals, and truly earn her respect. Instead of feeling contempt for these \"lowly\" people, now she pities them. Now she has to save them; her dear, dear underlings. Thanks to an undiagnosed concussion, this professional woman, on the fast track to VP stewardship, can now enjoy the simple things in life, like put on a scarf and join the carollers, as they all hold candles in open-mouthed earnestness around a lighted Christmas tree. For \"New in Town\" to transcend its initial patronizing attitude towards country life, Blanche Gunderson(Sibohan Fallon) needed to launch her \"Tapioca Pudding Boom\" without Lucy's marketing know-how. As for Ted(Harry Connick Jr.), he has the steering wheel column to thank for his good fortune."
    },
    {
      "rating": "5",
      "text": "Renee Zellweger (Lucy) lost a lot of weight and looks fantastic in her designer clothes and shoes. That said, this is your typical"
    },
    {
      "rating": "6",
      "text": "Very predictable romantic comedy, but it still entertains, especially if you are in the mood for a feel good comedy and the cast is very enjoyable. Mindless fluff, but fun."
    },
    {
      "rating": "1",
      "text": "Awful, awful, awful. Patronizing, painfully obvious, creaky, unfunny. This is industry product every bit as gloppy and unsavory as the sludge produced at the movie's New Ulm factory. Written by people who have obviously never actually been within 3,000 miles of the location in question, there's not a credible character (or characterization - Hogan is particularly ridiculous) in the entire enterprise."
    },
    {
      "rating": "6",
      "text": "As bad movies go, I somewhat enjoyed it. Lowered expectations always help. And not paying good money to see it at a theater helps as well. For the reviewers who say there is nothing funny about it at all, that's simply not true.. There Are some funny scenes, and I was able to to overlook the bad, relax and enjoy."
    },
    {
      "rating": "0",
      "text": "Awful. Horrible. I'm from New Ulm and that's why I rented the movie. COMPLETELY UNREALISTIC AND INNACURATE. Not to mention a truly dopey, stupid movie. I like Rene Zellweger and HCJ, but ... what were they thinking?"
    },
    {
      "rating": "3",
      "text": "The first and biggest problem this film has is the fact that it is a romantic comedy. Being one, it does not deviate from the typical rom-com recipe, what-so-ever. Being rather predictable (and by rather I mean completely to an annoying degree), the film does not offer anything new to the audience. The screenplay is simply bad, with a storyline that was maybe innovative back in the 1980s, but now has become the standardised cliche. One the film manages well is to create a positive relationship between the audience and the Minnesotans in the film. Some very cute scenes are in the film, and one cannot but feel warmly towards them, especially Siobhan Fallon's character, who is, by far, the best thing in this bad film. Renee Zellweger is rather bad - her strongest asset here seems to be her body, and it's in a film where that shouldn't be an issue. But yes, Zellweger doesn't give anything good to the film, and one can only wonder why she ever got cast. Maybe trying to re-connect to her Bridget Jones' days? Be it as it may, the film is rather bad and annoying, full of cliches concerning both rom-coms and Minnesota, and with generally pretty bad dialogue and acting, makes \"New in Town\"  be one of those films you could have easily gone without ever watching."
    },
    {
      "rating": "0",
      "text": "Probably one of the worst movies ever. It's equally off-base with its portrayal of \"city people\" and \"country folks'. Both seem to be outdated and stereotypical. Don't waste your time."
    },
    {
      "rating": "3",
      "text": "New in Town drove me out.\rReally poor script, no laughs whatsoever, and bad acting. The movie is bland and utterly worthless, and the ending is barely existent; it just sort of ends when the writers got bored."
    }
  ]
}