{
  "id": 2111,
  "title": "News of the World",
  "starring": [
    "Tom Hanks",
    "Helena Zengel"
  ],
  "runtime": 118,
  "genre": [
    "Drama",
    "Western",
    "Adventure",
    "Action"
  ],
  "description": "A Texan traveling across the wild West bringing the news of the world to local townspeople, agrees to help rescue a young girl who was kidnapped.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fYQCgVRsQTEfUrP7cW5iAFVYOlh.jpg",
  "categories": {
    "plot": 6.243243243243243,
    "acting": 6.541666666666667,
    "ending": 6.857142857142857,
    "soundtrack": 7.0,
    "cinematography": 6.5,
    "familyFriendly": 6.0,
    "funny": 8.5,
    "action": 6.090909090909091
  },
  "reviews": [
    {
      "rating": "8",
      "text": "News of the World is a surprisingly great film from Paul Greengrass, reuniting again with Hanks on this project.  It's a great post modern western that was high in drama, and provide a perspective on early 'newscasters' instead of the usual gun slingers.  Worth a look."
    },
    {
      "rating": "9",
      "text": "Surprisingly engaging and enjoyable old fashioned style Hollywood film that Hollywood doesn't seem to make anymore, Tom Hanks is solid and so is his child co-star in this authentic Paul Greengrass directed western - 9 stars"
    },
    {
      "rating": "6",
      "text": "Though beautifully filmed, well acted by Tom Hanks and Helena Zengel, and occasionally touching, this modestly engaging Western about a former Confederate soldier seeking to deliver an orphaned young girl to her surviving relatives never quite captivates due to slow pacing, episodic storytelling, underdeveloped characterization and predictable sentimentality. As a touring reader of news stories to local settlers, the onetime military man functions like a traveling newsfeed, relating information from newspaper articles that often stirs up emotions among the locals, a less-than-veiled allegory about contemporary media outlets (and one of the more interesting aspects of the story that, unfortunately, doesn't get as much attention as it probably deserves, especially since it provides the basis of the picture's title). All in all, this seems like a half-baked effort that didn't pan out as hoped for, often missing the mark for what it should have been focused on and delivering an overall underwhelming finished product."
    },
    {
      "rating": "10",
      "text": "A clear proof that the western still has stories to share. The odyssey of a war veteran, dedicated to reading and sharing news, and delivering an orphan girl to her closer relatives, arouses the viewer's interest for two hours, with a context that makes clear prejudices that are still in force. Homework."
    },
    {
      "rating": "7",
      "text": "A western cowboy era movie starring Tom Hanks. Cowboy type movies are sort of a dying genre nowadays but it was interesting to see legendary actor Tom Hanks star in one. Additionally, it was being directed by Paul Greengrass who directed some of the best Jason Bourne movies (and worst) and Captain Phillips which also starred Tom Hanks. The summary is \"Five years after the end of the Civil War, Capt. Jefferson Kyle Kidd (Tom Hanks) crosses paths with a 10-year-old girl (Helena Zengel) taken by the Kiowa people. Kidd agrees to escort the child across the harsh and unforgiving plains of Texas. However, the long journey soon turns into a fight for survival as the travelling companions encounter danger at every turn -- both human and natural\". So does this movie manage to achieve its goal or fall into the empty desert?The biggest praise has got to go to Tom Hanks and Helena Zengel performance of the main duos. Tom Hanks gives a subtle weariness and melancholy to his character while still containing compassion that feels genuine. Helena is a child actor so there was some scepticism from me but she delivers with some emotional and even heart-warming performances. The chemistry between the two actors is evident which is why it was such an enormous pleasure to watch both of them. Watching the relationship between these two characters develop from just strangers to that of a family is touching. The scenes where it is just both of them are some of the most enjoyable scenes in the movie and this is thanks to the strong performance from both of them. The supporting cast is really good as well and deliver an effective performance for their representative characters.The movie contains some great cinematography that makes the movie aesthetically striking and gorgeous visually. This is quite a feat considering that a majority of the movie is set in set in some empty fields but the cinematographer, Dariusz Wolski, pulls it off. It is also complemented by great set and costume design that looks authentic and pulls you into the era the movie is set in. The music score by James Newton Howard is also really strong and is effective in representing the scenes. There are some action scenes in the movie and they are very tense with no shaky cam that is seen from the Bourne movies. For the most part, it is a character-driven story but the action scenes are really good when they occur. However, the story is very predictable and even cliche. There is not a lot of originality in this movie and the story is pretty much a beat for a beat tale that has been told so many times before. You can probably guess what is going to happen for the majority of this movie. The heartwarming scenes while done effectively are also things that have been done in previous movies or games. You will see these scenes and feel like you seen them before. There are also some pacing issues with this movie as it can slow at times near the beginning and near the end. Some scenes didn't add much and could have been cut to improve the pacing. Overall, the movie may be very familiar but it is entertaining nonetheless. Thanks to the strong performances and the visually pleasing design of the movie, it is still able to keep you glued to watching it. Under all of its layer, there is a lovely drama that conveys a meaningful message which honestly might be the news the world needs right now."
    },
    {
      "rating": "9",
      "text": "Heartfelt with the perfect amount of excitement. Tom Hanks did a marvelous job."
    },
    {
      "rating": "8",
      "text": "Really enjoyed this. They really paid attention to detail with regard to the post Civil War atmosphere. It was an entirely believable period piece and Hanks is at his best. I see folks complaining about pacing and certain details, but I saw none of these things. I was hooked from day one. I loved when he won over the crowd and started a riot even. Kinda reminded me of The Sisters Brothers, and that's a good thing. The young lady who played Johanna was great."
    },
    {
      "rating": "9",
      "text": "Excellent movie. You need to like westerns to really appreciate it. Good acting. Good story. Good ending... Much better than 90% of the new movies out there."
    },
    {
      "rating": "10",
      "text": "This was a fantastic story. A great western movie that doesn't rely on intense gunfights and killing to be entertaining, although it still manages to have some real tension at times. Anyone rating this movie low has poor taste is a actual good quality movie."
    },
    {
      "rating": "7",
      "text": "Probably one of the bigger departures I've seen a filmmaker take from their typical stylings over the past few years, Paul Greengrass (who's typically known for his compelling forays into docudrama) reunites with his \"Captain Phillips\" star Tom Hanks for \"News Of The World,\" a stately, earnest tale of tenderness in a coarse time and the importance of perspective and objectivity in even darker ones. Its admittedly episodic and novelistic approach to delivering the narrative may prove tiring for some, but with cinematographer Dariusz Wolski and composer James Newton Howard operating at an admirable level of quality, I found even some of the film's more lackluster moments to be at the very least palatable on a superficial level. When this movie is really firing on all cylinders, though, is when it's treating its subject matters with a very topically-minded outlook. Legitimately shocked this didn't bother me more, but these are easily the moments where the movie is shining at its brightest, with the subtle nods towards certain issues plaguing modern society ultimately satisfying this viewer."
    },
    {
      "rating": "7",
      "text": "This western from director Paul Greengrass (The 'Bourne' trilogy, 'Captain Phillips') stars Tom Hanks as a traveler who goes town to town throughout Texas to read the news to townsfolk. During his travels, he finds a young orphaned Kiowa girl and is tasked with bringing her to safety to her remaining living relatives. First off, I love westerns. It's one of my favorite genres. Second, I was a huge fan of 'Captain Phillips', the last film Hanks and Greengrass collaborated on together, so this film had a lot going for it for me, and I'm happy to report that it's very well-done in most regards. There are times where it feels as though it follows a few too many familiar western tropes, but this is largely overshadowed by just about everything else, especially the impressive and impeccable production design and cinematography, which makes you feel transported to right in the middle of the wild west. The majestic musical score from the great James Newton Howard, along with the action and story are sure to keep you gripped as well. Hanks also delivers an always reliably great and heroic lead performance, and even establishes a touching and genuine bond with Helena Zengel, the young actress who plays the Kiowa girl. Overall, it does feel like another formulaic western in some regards, but the epic feel and look of it all, along with Hanks' performance and bond with Zengel makes it plenty enjoyable and worthwhile."
    },
    {
      "rating": "7",
      "text": "\"News of the World\" é o típico filme no qual você não consegue tirar os olhos da tela, ainda que um pouco clichê. Boa parte disso é oriundo, também, da espetacular fotografia de Dariusz Wolski, que consegue encantar e imergir até mesmo quem torce o nariz para filmes de 'faroeste'. Não que precise, mas Tom Hanks evidencia mais uma vez o motivo de ser considerado por muitos como um dos maiores atores de todos os tempos. E eu realmente quero ver o que Helena Zengel ainda tem a nos oferecer em sua estreante carreira na atuação."
    },
    {
      "rating": "6",
      "text": "Wonderfully shot, scored, and designed film with spaghetti Western levels of mediocrity. Wildly predictable with only 1-2 thrilling moments. Newcomer Zengel outshines consistent veteran Hanks. Greengrass doesn't answer why he made this movie."
    },
    {
      "rating": "2",
      "text": "The birth of a new genre ? Woke Westerns ? No that probably started with Kelly Reichardt , but at least hers have some ideas , this Hanks vehicle is just anachronisms , present day popular hipster sentiments about how media should be pure , injected into the Wild West. They didn't call it wild because it was woke .. you know?"
    },
    {
      "rating": "4",
      "text": "I feel like that was a complete waste of time. **** hollywood’s AAA movies/shows. It’s was like getting get my three balls crushed by simontaniously by the four left-side wheels of that mother****ing firetruck. O right after that an avalache of this Assole PC Rating and editing the likely material to sink the adult contenst because rich parents with bullying children screaming until they get what they want! ”from the F/S that are either OK movies novies or below that. Definetly the wosrst thing inte world after mosquitoes are but I bet a there’s a few of you people who’ll probably love it. I’m just too old for this **** Perhaps if I’d watchd in with one of the kids I’s find it facinating! So I can ”see” how"
    },
    {
      "rating": "2",
      "text": "Extremely slow moving movie.  Slightly fragmented story line. (Why do 3 bad guys suddenly appear trying to take the girl for illicit purposes). Weird and out of the blue. Basically its a 2 hour movie you can explain in less than 3 minutes."
    },
    {
      "rating": "8",
      "text": "Comparisons of Zengel to Natalie Portman will surely be made as they are about the same age at start of their respective careers.   After watching Helena’s performance, you realize just how stellar Portman was in the Professional.  Tom Hanks (Captain) gives a folksy rendition as a reader of events from various newspapers of the day.  Cinematography is solid.  The script could be stronger.  Definitely a mixed bag.  Good period piece. The ending I will let you be the judge."
    },
    {
      "rating": "3",
      "text": "Do not wast your time watching this movie. Read the book!!! This \"Tom Hanks\" rescue the world vehicle is terrible. They could have blurred all the faces of every other actor, even Johanna's, in this movie and nothing would have changed in this movie. The book was powerful with well developed characters of native American, Afro-American, and European American decent. There was kindness, greatness, loyalty, weariness, strength and evil intent of many characters across all racial lines. The complexities of the native American cultures is completely lacking in the movie is by far the greatest loss.Paulette Jiles please do not let them use your material again. Terrible adaptation."
    },
    {
      "rating": "0",
      "text": "If we could recycle garbage like Netflix recycles story lines, tropes and characters, global warming would be a thing of the past. This is another total insult to people with average intelligence. 3 examples: 1- Tom Hanks, playing a ...captain fighting against all odds! All aboard!2- Bad cowboys, bad cowboys, bad cowboys, mysterious Indians and bad Germans! Has any German been portrayed as a good guy by Hollywood -unless he saves Jews that is-? Has any Native American been portrayed as bad since 1969?3- Woke culture in god-foresaken Texas in 1870 embodied by \"strong woman\" character."
    },
    {
      "rating": "0",
      "text": "Didn’t thing it was worth anyone’s time and it’s just so cliche. Why couldn’t this girl work? Was she completely helpless and why?"
    },
    {
      "rating": "5",
      "text": "Tom Hanks is Tom Hanks, again. 'News of the World' is a bland western carefully created by Paul Greengrass, who is out of his comfort zone here, resulting in a dull world that desperately tries to be gritty. With an ending that you'll see coming since the ten-minute mark, the road movie concept becomes the only thing that can hook you to the story, but the pace doesn't help at all. There's some value in the commentary about the early media manipulation, but it all gets sidelined by a corny story. Helena Zengell y far is the best thing about it."
    },
    {
      "rating": "2",
      "text": "Tom Hanks is decent as always, but the writing is so bad it's painful to watch this."
    },
    {
      "rating": "5",
      "text": "Hanks is trustworthy as always, but the glacial pace of the narrative gets too far in the way of the enjoyment of this story.The film certainly bets on being absorbing with the slow rhythm, but I have to say that Paul Greengrass made a bad bet with it, especially considering that he's a director who knows how to keep the times well paced. Another uneven addition to his uneven career."
    },
    {
      "rating": "6",
      "text": "(Mauro Lanari)Greengrass and Hanks give themselves to the Western and speak not only to today's U.S., they don't start from Ford (John, not Gerard) to just get to Trump. Two homeless losers who, unlike \"The Way Back\" (Weir 2010), no longer have any destination to reach. As stateless, they will learn to live with each other, to be the mutual reason for their existence. This is reminiscent of the ending of \"The Thing\" (Carpenter 1982): friends or enemies, abandoned on this wasteland, we can try to keep each other company. Overwhelming humanitas. But \"in cauda venenum\" and the last scene frames the story in an Easter context: after three days it is fulfilled a rebirth (of a Nation? of a community? of a solidarity? of a new storytelling in place of the failed métarécits? Boh)"
    },
    {
      "rating": "6",
      "text": "Unfortunately I found gritty realism (for which Greengrass is of course notorious, and I am a huge fan) impacting the nostalgic Western fable caused problems here, the sum of their parts cutting both short, the result was slow and quite often uncomfortable, the brutal realities of that period harder to bear when examined through an honest lens, necessary tropes became difficult to believe too, I was asking how on earth they survived and where all that ammunition was coming from, dramatic moments felt somewhat contrived indeed the language-barrier between the two main characters seemed to be too-easily overcome, they just wouldn't have understood each other...as the story developed I became increasingly unsympathetic with most of the characters...in the end it was an uplifting story with the occasional haunting and brilliant moment but as a piece of art it fell far-short, however considering the challenges faced and the well-culturally-timed and mostly-enjoyable story that was produced, not to mention Hanks finally in a classic and gritty Western role (and I cannot really fault his work here), I am gratefulThis film also screamed out for projection and I for one am more than willing to pay to see it again on a big screen here in the UK, I really hope they consider it, some films just need that space to be fully appreciated"
    },
    {
      "rating": "10",
      "text": "I really like this movie, gunna be a favorite. Its has its 'dark' story moments, but it doesn't make you feel bad for watching it (like so many other movies do) and its got a good heartfelt happy ending (which is also rare these days).I wish there where more modern movies like it."
    },
    {
      "rating": "7",
      "text": "NOTW is a heartwarming if predictable drama with a fantastically well produced western setting with every penny of its budget on the screen. While the cast are excellent, news preaching gimmickery aside, within such an over saturated genre it does little to stand out as a truly original piece. Despite on appearances being a standard 'a to b across a vast landscape' western trope, this was thoughtfully crafted with an interesting mini storyline at each junction and very entertaining with excellent pacing. Well worth a watch for genre fans."
    },
    {
      "rating": "6",
      "text": "It was good, but at times was a bit boring. I mean the story in general was good and had great moments, but for me for it to have higher rating it needed something more and to be more memorable"
    },
    {
      "rating": "4",
      "text": "The attempts to create tension along the way are woeful. At two separate points along the trail, two separate groups of men show up out of nowhere just to announce to Kidd, in so many words, that they will be the bad guys for the next bit."
    },
    {
      "rating": "10",
      "text": "A beautiful traditional Western featuring two virtuoso actors, one of whom happens to be a 12-year-old German kid.  It may be a bit slow-moving for some tastes, but I found the story and the chemistry between Tom and Helena absolutely captivating.  Something wonderful managed to make it out of 2020."
    },
    {
      "rating": "6",
      "text": "An interesting story bogged down by repetitiveness. Tom Hanks is still great as always. He always puts a lot into each of his roles that makes each of his characters stand out from one another with this one being a reluctant father figure who chooses to help those in need. The direction by Paul Greengrass is great. I haven’t seen much of his work but I’m interested in seeing what else he can do besides this and Captain Philips. Both of which Tom Hanks starred in. Helena Zengel is good at points and weak in others so I can’t praise her performance nor can I bash it. This has an interesting concept of a Civil War Captain who travels from town to town reading the news to people stepping outside of his comfort zone to help someone in need. I think this film did a great job at showing the unrest in 1880s Texas. The film shows the tension between the people of Texas and the Union forces stationed there. It also does a good job at making you feel for some of the characters especially Hanks’ character. The cinematography is also great. Greengrass does an incredible job at showing off these great landscapes with each shot feeling a little more different than the last. My big issue with this film comes down to its repetitiveness, pacing, and slow descent into boredom. There is a cool action set piece at the beginning but after that point, the film starts to throw similar situations of peril one after the other. After a while, you start to say to yourself “Haven’t we already seen this before?” It doesn’t help that the pacing is awful at times with some scenes going on for way to long while others are cut way too short like the scene where a town is basically controlled by outlaws. We spend so little time there and it was a very interesting scenario that is cut away from. I also take issue with the resolution of the film being not great. Without spoiling the film, we see what happens and you think that that’s it but then the movie goes on for another 25-30 minutes and it’s really boring aside from one 3 minute long scene with Hanks. It should have ended where I thought it was gonna end. If you like Tom Hanks or Western movies then you might get something out of this but you can wait until it comes out on DVD, Blu-Ray, or rental to watch it."
    },
    {
      "rating": "8",
      "text": "Fairly good movie, Great acting coupled with amazing western cinematography. A bit troubled storyline that is not very well tied together. Out of no where situations pop up from time to time that kind of kill the fluency of the film. But the action keeps going and does not bore you during scenes. Recommended watch by me."
    },
    {
      "rating": "6",
      "text": "A good movie that, sadly, falls flat in so many aspects. It's still enjoyable to watch, it's just that it could have been much, much more. The news-readings, although they're a set up and an angle-point of the story seldom get more than 1 minute of screentime, the child's identity-crisis could've been much better concluded than just her being 'adopted' by the protagonist.I like this movie and it's certainly different from other \"wild west\" movies, but I wouldn't necessarily watch it again."
    },
    {
      "rating": "9",
      "text": "A simple, pure and an emotional story. Tom Hanks was phenomenal in his role and the shots of the west were amazing. A recommendation for people who like slow paced movies."
    },
    {
      "rating": "7",
      "text": "Una nueva película con Tom Hanks; la trama está bien y se disfruta, la recomiendo."
    },
    {
      "rating": "8",
      "text": "Just the fact that this movie talk about a man who his job is read the news in every single town, it's very interesting."
    },
    {
      "rating": "6",
      "text": "Tom Hanks is doing a great job here and the production design is great but the story isn't super interesting."
    }
  ],
  "recommendations": [
    "hell_or_high_water",
    "the_place_beyond_the_pines",
    "a_most_violent_year",
    "beirut",
    "donnie_brasco",
    "the_devil_all_the_time",
    "the_accountant",
    "creed_ii",
    "reminiscence",
    "hugo",
    "the_hunger_games_catching_fire",
    "white_boy_rick",
    "the_finest_hours",
    "american_made",
    "the_terminal",
    "allied",
    "victor_frankenstein",
    "eddie_the_eagle",
    "the_harder_they_fall",
    "a_most_wanted_man",
    "american_gangster",
    "widows",
    "top_gun",
    "rush",
    "eternals"
  ]
}