{
  "id": 3076,
  "title": "Next Gen",
  "starring": [
    "John Krasinski",
    "Charlyne Yi"
  ],
  "runtime": 105,
  "genre": [
    "Animation",
    "Action",
    "Adventure",
    "Comedy",
    "Family",
    "Science Fiction"
  ],
  "description": "A friendship with a top-secret robot turns a lonely girl's life into a thrilling adventure as they take on bullies, evil bots and a scheming madman.",
  "releaseYear": "2018",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hUDDo5MPWM6rc6COQYhaoRNqvhE.jpg",
  "categories": {
    "plot": 6.15,
    "acting": 6.266666666666667,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.666666666666667,
    "funny": 9.0,
    "action": 6.833333333333333
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Well it starts off pretty unlikable, makes some seriously off story choices along the way to end up somehow making it pretty much allright and touching. Animation is great but the story is ho hum and predictable but still, for some wierd reason I'm gonna go with a 7 even if at certain stages it felt more like a 4."
    },
    {
      "rating": "7",
      "text": "This might be the most underrated movie I saw this year. This is a Netflix original animated film about a girl and her killer robot. The animation and action are great, the characters are engaging, and the story is pretty original. Also, this movie is the spiritual successor to 9, my all-time favourite movie! And my friend Dave Colvinson actually worked on it! If you’re browsing through Netflix looking for something to watch, I’d recommend checking this out. I think it’s a good time! Definitely a hidden gem! Spread the word! More people need to see this!"
    },
    {
      "rating": "8",
      "text": "Look, I get why people do not like this movie. It's extremely niche, the villain is generic, it's possibly tonally confused. But I do not care! I had a ton of fun with this movie and absolutely love this! It's not for everyone but if you want a fun, fresh, and absolutely breathtaking animated film on Netflix, go see it!!!The animation is absolutely breathtaking! Which might be surprising considering it's on Netflix and usually smaller, independent animations usually look rather cheep. However Next Gen proves once again that it's not the budget nor the software that makes the movie, but the animators who makes it and know what they are doing. The animation looks like it was made for theaters as the textures and pure scope of the film look absolutely stunning and nothing I have ever seen from a major company like Pixar or Dreamworks. The designs are cartoonish but they look great in 3D! Everyone has a distinct design from the humans to the robots. Even the world too is unique. Making futuristic utopian cities can often come off as generic in modern sci-fi stories, however Next Gen takes full use of the concept that it feels fresh and not stale! And the action scenes are amazing!The story, while admittingly generic, does actually come off as fresh too. While sure the movie does follow the same beats as the kid befriends a robot storyline, what makes it work is that the story is well written with likable characters and a rebellious attitude that you get sucked in. Most people call it Big Hero 6, but I'd say it's more like a mix between the Iron Giant and I, Robot with a dash of Scott Pilgrim. The main character, Mai Su, might be unlikable to some, I actually found her rather refreshing as a main character. Instead of being nice she's all angsty but in a way where you can relate to what she is going through and seeing her grow is honestly a joy. She's unique for a lead hero. And the same can be said about 7723, the main robot hero. Seeing the two of them grow together is enjoyable to watch and by the end I was feeling for the two of them. The movie is smart with the presentation, being a tongue-in-cheek animated kids film but also making you feel for what each character is going through and tackling issues ranging from loss and growing up to even complex topics like human emotions in a robot society. The latter is hard to pull off when there are so many stories that tackle this issue, but the movie works not in originality but just the emotional connection with these characters. I will say that the voice cast could have been better, but they all do a fine job here. Charlyne Yi is solid as Mai Su, John Krasinski is great as 7723, David Cross is absolutely funny doing all the voices for the various robots, and Jason Sudeikis does a good job too as the movie's antagonist.Again I get that this movie isn't made for everyone. But if you do want to watch an animated movie that is fun and different than what the major animated studios are making, PLEASE watch Next Gen! You will not regret it!"
    },
    {
      "rating": "10",
      "text": "This is by far my favorite animated film of the year. The deep philosophical dilemma of what to remember and what to forget is wrenching, and echoed the pain of watching some loved ones slip into dementia and Alzheimer's. Honestly, a few of the negative reviews sound like they were hung up on the trailers or their feelings for other movies to treat this as a work set apart from those expectations. The animation is wonderful, the humor is balanced beautifully with the heartfelt, and the realistic relationship between Mei and Molly had us verbally exclaiming how awesome it was to see a mom who was disconnected and unaware instead of the archetypal overbearing perfection of other animated movie moms. We've been talking a lot about sunk cost lately, and what time is worth. The value of an hour and 46 minutes. Next Gen is worth the sunk cost and more. Frankly, if it were eligible for Academy nominations, this would be my pick for the best animated award."
    },
    {
      "rating": "10",
      "text": "WOW. I thought this was gonna be a \"Big Hero Seven\" clone, but god damn. This movie makes Big Hero Six look like garbage.It does a MUCH better job of exploring the whole idea of friendship between an AI and human. At the same time it explores ideas regarding memory and identity while poking fun ruthlessly about how obsessed some people are with modern gadgets.It's also got a real sense of self awareness to it. It really plays with your expectations, and subverts them really well. It also pulls NO PUNCHES. None of them. It just is like \"hah, you thought we wouldn't go there because this is a kid's movie? THINK AGAIN.\" It really is a smart film, and it expects the audience to be smart as well. It's never stated why her father left, but it lays out some pretty clear clues if you pay attention. Also, the action in this film is just incredible. I haven't seen such a brutal beat down like this between two robots since the final episode of Beast Machines. It's incredible.This blew my mind. BTW, most of the work on this film was done in CANADA. So hat's off to my fellow canadians."
    },
    {
      "rating": "4",
      "text": "In a world seemingly devoid of all property destruction Laws, a girl meets a robot, fights ensue, character building does not.So basically in the beginning of the film (first scene or so) the story establishes that the main characters father left her and her mother, as a result the mother becomes obsessive over robotstechnology to the detriment of all else and thus Mei (Main characterthe daughter) hates them.Unfortunately beyond the first couple scenes, character growth largely grinds to a halt, enemies become friends based after being beat up 1 time, the main robot joins the MC because reasons, and a certain character is straight up murdered after a grand total of maybe 10 mins screen time - on the whole character motivations seem to jump at arbitrary points in the film to the point where common tropes would dictate they end up, but with no story to connect the sourcebeginning point personality to the destination one.By the end of the movie I had a feeling like about half an hour was missing for backstory and world building split between the 2 main characters, bad guy, bad guys partner, and maybe even a bit more history on robots role in society that would have completed this movie, but unfortunately without it the pacing feels rushed, the emotional scenes feel un-earned, and the ending on the whole feels hollow.Beyond this major fault the film has a solid sound track, good animation, and i can see the shadow of a good movie - its just a shame how much the pacing (that reminds me quite heavily of Green lantern's) pulls it down."
    },
    {
      "rating": "4",
      "text": "Boost great visuals, but falls short on story, dialog and character development. Feels a bit like some background scenes were missing."
    },
    {
      "rating": "9",
      "text": "The animation was gorgeous which surprised me for a Netflix original movie. The story was super cute, touching, and well written. The voice over performances were spot on especially Michael Pena, John Krasinski, Jason Sudeikis, David Cross, and Charlyne Yi. One of my favorite Netflix original movies."
    },
    {
      "rating": "9",
      "text": "Lovely visuals and great emotional story telling. Although it felt rushed which made the main character \"Mai\" not relatable at one point."
    },
    {
      "rating": "7",
      "text": "Robot 7723 es una película buena, sorprendentemente tiene buenos gráficos y la historia al principio intenta que los hechos trágicos de Mai con su padre o los abusos escolares parezcan hechos cómicos, pero la película termina volviéndose bastante seria cuando prioriza la relación entre Mai y 7723. Me encanto el hecho de que el Robot tenga que decidir que eliminar y almacenar de su memoria, es algo bastante innovador como concepto argumental. Luego tenemos a Pin como villano que la verdad no esta mal pero es algo genérico y no termina explicando la película para que quería matar a todos. Quizá lo que el quería era un mundo sumido en una tiranía en donde solo los robots mandan ya que según Pin, son perfectos.El final tampoco me pareció la gran maravilla, ya que recuerda bastante a Wall-e (pero peor ejecutado). Otros personajes como el científico no tienen la suficiente participación en la película y faltarían explicar ciertas cositas de su trabajo, pero quitando eso, es una película bastante buena, tomando conceptos de anteriores como Wall-e o Big Hero 6 pero dándole su propia personalidad y un aire único. La recomiendo."
    },
    {
      "rating": "9",
      "text": "Funny movie whit a great message.La película tiene todo: diversión, escenas de acción y un gran mensaje al final."
    },
    {
      "rating": "10",
      "text": "A **** masterpiece and thats putting it lightly i can seriously only recommend it"
    },
    {
      "rating": "4",
      "text": "Chock full of awful, on-the-nose dialogue, glaring plot holes, and unimaginative humor, this film's only redeeming quality is the action sequence at the end and a reasonably interesting villain. Why do all of Netflix's animated films feel like Disney knockoffs? If you want a film about a kid befriending a robot and facing evil together, go watch Big Hero 6."
    },
    {
      "rating": "10",
      "text": "so beautiful that it can make a grown man cry...story is good and I enjoy it so much."
    }
  ],
  "recommendations": [
    "raya_and_the_last_dragon",
    "how_to_train_your_dragon_2",
    "the_good_dinosaur",
    "bumblebee",
    "turbo",
    "incredibles_2",
    "the_secret_life_of_pets_2",
    "big_hero_6",
    "the_croods",
    "9",
    "the_witcher_nightmare_of_the_wolf",
    "how_to_train_your_dragon_the_hidden_world",
    "love_and_monsters",
    "the_iron_giant",
    "frozen_ii",
    "my_little_pony_the_movie",
    "onward",
    "rise_of_the_guardians",
    "super_8",
    "the_call_of_the_wild",
    "bolt",
    "the_secret_life_of_pets",
    "real_steel",
    "ant_man_and_the_wasp_quantumania",
    "spider_man_into_the_spider_verse"
  ]
}