{"id": 3842, "title": "Next", "starring": ["Nicolas Cage", "Julianne Moore"], "runtime": 96, "genre": ["Action", "Science Fiction", "Thriller"], "description": "Las Vegas showroom magician Cris Johnson has a secret which torments him: he can see a few minutes into the future. Sick of the examinations he underwent as a child and the interest of the government and medical establishment in his power, he lies low under an assumed name in Vegas, performing cheap tricks and living off small-time gambling \"winnings.\" But when a terrorist group threatens to detonate a nuclear device in Los Angeles, government agent Callie Ferris must use all her wiles to capture Cris and convince him to help her stop the cataclysm.", "releaseYear": "2007", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/td5uOBW41ib1KGz3g1Kc33BdFyj.jpg", "categories": {"plot": 3.6923076923076925, "acting": 4.0, "ending": 4.470588235294118, "soundtrack": 1.0, "cinematography": 5.0, "familyFriendly": 4.125, "funny": 5.0, "action": 5.428571428571429}, "reviews": [{"rating": "10", "text": "I almost never write reviews but the intense negativity towards this movie really ticks me off so I had to say something.\r There are so many crappy movies out there achieving high ratings yet this one, which both kept me entertained throughout and wanting more when it was over has become subject of a crucifixion.\r I confess that I didn't watch this movie about the time it was released because of how low the scores were (under 5.0 on IMDB at the time) and now that I have seen it I'm shocked at how cruel everyone has been. In fact, I think a lot of people made the same mistake as I have, basing their decision not to watch the movie on the ratings, because its IMDB rating is now over 6.0.\r It's not an Oscar winner, but it's got a clever script, is entertaining, has the beautiful Jessica Biel in it and deserves a lot more than the low ratings it's been given.\r Honestly, I think you haters either have insurmountable expectations or your taste in storytelling has decayed to the level of super cheesy action flicks like the more recent Die Hard installments."}, {"rating": "6", "text": "Not a great movie by any means in fact silly is probably the best adjective to describe it. Acting from the lead actor(s) is poor to say the least, feeling as though they couldn't even bring themselves to believe what they were doing. On a more positive note Jessica Biel does her job of looking stunning very well. On the whole an average movie, the whole idea of seeing into the future does make viewing fun at times but unfortunately its unlikely you will remember it in a weeks time."}, {"rating": "7", "text": "Good entertainment! It's not that easy to make purely entertaining popcorn cinema, and I think they did well with this film! What's wrong with cliché in this genre -- if it's cleverly twisted and not just the 100th repetition. I get easily bored with long action sequences but not in this case because they are quite original. Cage's trademark melancholy character works very well in contrast to the otherwise straightly plotted story. However, if you are looking for realism or deep psychological insight (as I do most of the time), maybe you'd rather look someplace else? With regard to this, many of the negative reviewers just miss the point, because they demand things the film never promised. I enjoyed this film from start to end."}, {"rating": "10", "text": "Ignore what those loser critics have to say. I'd like to see them do better! The story is great and the action is rockin but it all comes together due to a fantastic performance by the supertalented Cage."}, {"rating": "8", "text": "Good movie, very, very entertaining. Recommended for those who like action movies."}, {"rating": "9", "text": "I loved it. If you got pumped after seeing the trailer, ignore the metascore and user rating and go see it. Fan's of fantasy/sci-fi and time manipulation will eat this up. Plus Nicolas Cage is just awesome. Julianne Moore gives another solid performance similar to what she did in Children Of Men, only she has a more substantial role. And how can you go wrong w/ Thomas Kretschmann as the villian? Some might find the twist ending flat, but it's definitely worth the ride. See it in the theater."}, {"rating": "9", "text": "The critics, some of you people, are crazy. This move was crazy! Very imaginative and original. It was put together well, had you on the edge of your seat, everything a good movie needs. I can't believe people are dumb enough to mention how unrealistic it is and all this crap. Wake up call, movies are meant to take you \"out of the box\". If you want to see realism, stick to documentaries! See this movie, and be puzzled as hell by the stupid things people have said about it. It's crazy awesome, bottom line! The only reason I gave it a 9 and not a 10 is because I wanted to see more, but it ended. Great movie!"}, {"rating": "6", "text": "The movie on a whole is really nothing too special, but somehow I found it very entertaining. Cage is as bland as ever, but oddly I like his style of \"acting.\" It's so bad that it's good (at least for me.) One gripe I have give in is the ending. It's just feels like such a cop out, like the writers really had no idea how to give it a good ending.\r Overall:\rA fun movie that can be entertaining at times, but a lackluster ending simply spoils what could have been something special (kinda.)"}, {"rating": "6", "text": "the amazing frank cadillac..NextNext is smart, gripping and fun even though it may lose track for a bit and disappoint you at some points but all in all it definitely is a one time watch."}, {"rating": "3", "text": "Boring, annoying and forgettable. I hated it. Jessica Biel was the only acting and beauty highlight."}, {"rating": "1", "text": "Terrible. A huge waste of time from start to finish. No real character development, plot twists, or even decent special effects. Badly acted, annoying and with the most over-produced soundtrack in film history. A cinematic disaster and a mess to be seriously avoided."}, {"rating": "1", "text": "This movie was awful. Nicolas Cage has chosen to be in some pretty bad movies. The list is getting longer and longer, Nick. You have chosen to be in disaster after disaster. Wicker Man, National Treasure, The Weather Man, World Trade Center, Ghost Rider, Lord of War. \"Next\" is by far his biggest disappointment to date. What ever happened to the Cage we saw in 2003's Matchstick Men, or 2002's Adaptation, or even his 1995 Oscar winning performance in Leaving Las Vegas. Cage is falling apart. It seems that his first half was so much better than the second half he is continuing to destroy."}, {"rating": "3", "text": "If you're not in the mood to see a pair of slumming actors cashing a paycheck, don't see \"Next\"; see their next movie, because Julianne Moore(as a FBI agent) cheats her adoring public this time out by being stingy with the facial expressions(she uses one, a steely determination expressed through squinted eyes), and Nicolas Cage(who introduces the notion of an anti-action star) as a magician/psychic, is too in love with Liz(Jessica Biel), and too busy doing his multiplicty trick, to offer any personality quirks as a diversion from the routine gunplay and explosions. \"Next\" aspires to be, I don't know, \"The Sum Of All Fears\" meets \"What The @#$* Do We Know?\" If you're a big fan of \"Groundhog Day\", your blood will boil at how this film rips off Bill Murray's sweet and hillarious attempts to win Andie McDowell's heart. In \"Next\", Cris' first(and second, third, fourth...) contact to seduce Liz has all the charm... of an action movie. His acquisition of Liz's adoration is so dishonest, it has the effect of ruining that classic sequence from the Harold Ramis classic, because it reveals such a tactic of persistence as being somewhat sleazy. \"Next\" is \"a movie for men who love movies\"(from an old TBS tagline to promote the cable network's array of bad action flicks), and quantum physics."}, {"rating": "1", "text": "Perhaps the worst movie of the year. Even if you buy the premise that a man can see two minutes into the future, the events in the movie are hard to believe. This is also the classic movie where the computer is constantly the \"magic bullet.\" Whenever there is an obstacle or a problem, somehow a computer process can fix it!"}, {"rating": "1", "text": "15 mins into the film, I wanted somebody to look into the future and tell me how the movie ends because it was horrible!"}, {"rating": "2", "text": "This movie is both unplausible lacks logic, real suspense and the (well-known) actors seemed a litte affected to me. There are better ways to spend money, for example to flush it down in a toilet."}, {"rating": "0", "text": "What a total POS movie! Terrible on nearly every level with Cage turning in yet another dreadful, self-indulgent performance. But we all know he's a horrific, vain actor...the real mystery is what dirt Revolution Studios has on Julianne Moore that she continues to make films under their moniker. She is SO much better than this nonsense...but she is pretty terrible in this film as well. After showing some promise in The Illusionist, Jessica Biel turns in a performance that makes her work on Seventh Heaven look like Meryl Streep. All that being said, it's still not outright laughable ala The Wicker Man. Why does crap like this get made? And why do I end up seeing it? =)"}, {"rating": "2", "text": "If the lady with the baby carriage in The French Connection could've seen two minutes into her future, she would've turned the corner to avoid the shooter...and her child would've grown up with a mom. If Chrissie, the girl who went nude swimming at the beginning of Jaws, could've seen two minutes into the future, she would've stayed onshore and had a pleasant, intimate evening with the guy who DIDN'T follow her into the water, causing the shark to swim elsewhere (resulting, of course, in a five-minute movie). And to be really frivolous about this, if Pee Wee in Porky's could've seen two minutes into the future, he could've anticipated which high school girls were going to step into the shower at any given time and claimed the peephole for himself! Obviously, Next's central premise is a fascinating one, and no doubt the Philip K. Dick story played it for all it was worth, but what Lee Tamahori (Die Another Day) and his writers have strangled out of it lurches between deadeningly generic (can we please, please for once have an action/ chase movie that DOESN'T feature a warehouse scene?) and frustratingly incomprehensible, as though it had no future (or past) recall whatsoever. Nicolas Cage plays a Vegas magician/ card player who uses said ability to eke out a living until his life is complicated by a grim FBI agent (Julianne Moore, who looks like she can't wait to get to her favorite leather bar after hours) who wants to use his skills to thwart a mad bomber...in, uh, two minutes?!? A perfunctory, tension-killing romance with Jessica Biel, whose future Cage has strange insights into, adds a smarmily sexist flavor to the proceedings, but the worst of Next's many felonies is a fraudulent pseudo-surprise ending that's the worst of its kind since the thoroughly illogical wrap-up to Alejandro Aja's exuberant shower-o'-gore High Tension two years ago with the notable difference that Aja's movie was actually WORKING before its last few minutes demolished it. You know, if Biel could see two minutes into the future, any script she's handed would induce her to immediately jump ahead to the towel scene and the \"morning-after\" scene in which her character is in bed covered with one of those miracle sheets that simultaneously covers her breasts and protects the movie's PG-13 rating, and having done so to turn it down, realizing that such movies are any attractive young actress's surest ticket to thirtysomething oblivion. If Cage could see two minutes into the future, HE'D automatically nix ANY action, horror or fantasy script handed him, realizing that (mediocre Marvel Comics adaptations released during slow moviegoing times of year notwithstanding) familiarity really is beginning to breed contempt. And if the normally sublime Moore (who's been through a really, really rough patch lately, giving one-note, nails-on-the-board performances in Freedomland, Trust the Man and this) could see two minutes into the future, she'd attach herself like Super Glue to Todd Haynes, who directed her finest work in Safe and Far From Heaven, waiting for the moment in which he's in a terrific mood so she can ask, nay BEG him to pull off a hat trick for her because she (and, God knows, ALL of her fans) desperately can use it. See how much more interesting, fun and worthwhile spending 90 minutes playing this little game can be than wasting them sitting through junk like Next?"}, {"rating": "2", "text": "A lazy film that breaks the most important rule of creative writing...lazy endings. This film has one of the laziest (worst) endings I have ever seen. Horrible film."}, {"rating": "10", "text": ".......................................................................................................................................A Very good Sci-Fi with great performances.... The end is Entertaining with the twist"}, {"rating": "6", "text": "This is a perfect example of a Nicolas Cage movie. You will totally love or totally hate this movie based on how much you love Nicolas Cage doing dumb action stuff."}, {"rating": "10", "text": "Baseado na obra do melhor autor de ficção científica Philip K. Dick. Esse Filme é arrasador,com ótimo roteiro,direção e produção. Cenas de arrebentar de ação,Com muitas cenas originais. Nicolas Cage está excelente como Chris Johnson,Jessica Biel dar uma ótima performance \"Gostosa\",e Julianne Moore arrasa como a policial pavio curto e genial."}, {"rating": "4", "text": "Next is a wasted opportunity.\rThe movie Next is a blast for about the first ten minutes. A great concept and an okay script. It then blunders repeatedly unsure of how to evolve, and ruins everything it started with. The dialogue suddenly becomes horrible and the acting is revolting. A ninety-minute film feels twice as long as it should."}, {"rating": "10", "text": "Uma ficção-científica subestimada.... Um Filme de ação subestimado....   Nicolas Cage,jESsica Biel e Julianne Moore estão ótimos perfeitos... 15 idiotas...."}, {"rating": "10", "text": "sssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssss....    Jessica Biel is so hot!!!!!!!! that scene she is in towel so Tasty,Delicious,Delight"}, {"rating": "10", "text": "........................................................................................................................................................................ Expectacularmente fodinha."}, {"rating": "4", "text": "\" Next\" was a film that regularly entertained but without bad faith , about someone who could see the future , and who changes , as Nicolas Cage was not infallible , let alone the movie turned out very regular , but gave plenty of action ."}, {"rating": "6", "text": "It's actually not that bad. Very interesting concept and nice special effects. Too bad they didn't give Peter Falk a bigger role. Of course if you are a fan of Nick Cage, then who cares."}, {"rating": "10", "text": "...................................................................................................................................................excellent...."}, {"rating": "4", "text": "I enjoyed the movie, until the worst ending ever. I can't believe I wasted my time watching this. I won't rate it lower because it was mostly the ending that was terrible. Other than that, the story is ok."}, {"rating": "6", "text": "Apesar do filme ter uma trama boa, prendendo e nos deixando curiosos, falha em diversos aspectos, como as atuações, personagens, simplismo do roteiro, efeitos especiais - para a época, talvez não fosse medíocre.Até que ele tem um plot interessante, mas acaba de uma maneira tão brusca que faz de nada valer, fora alguns furos que não passam despercebidos."}, {"rating": "3", "text": "While this was quite a diverting movie, it felt rather muddled. There were too many elements present, with the action element (which there is a bit of at the start and then dies down and it comes back after a fair while), a romantic element which felt to some extent rather unbelievable, that she went along with everything and forged the bond with him that she did and when she learnt 'the truth' that she believed him and so on and then there's the other sort of spiritual side, where he talks about his ability and starts to philosophise (if thats a word(?)) about those good ol' issues of life, destiny and fate.There are some pretty cool action scenes in the movie and as I say, it is diverting enough, it should keep you somewhat entertained for the hour and a half or so but all the same, I felt that the way it was written wasn't great, ending up as being a fairly formulaic movie. While I did find the concept behind the story quite interesting (as im always interested in seeing movies that deal with the issues covered), its probably true to say that this is something thats been done better before, in other movies.Its also true that Cage and Moore, as Chris Johnson and Callie Ferris, add an element of depth or quality to the movie, as I felt they both did well at portraying their characters, the others did ok but nothing special. If the script were tightened up and the story tweaked, so to speak, I think it could be better and I'd be rating it differently. I suppose nowadays when we go to watch whats marketed as an action movie, we expect that and the mish mashes present here just didn't entirely seem to 'gel'. I was quite sceptical to start with, like I say it is a bit confusing and throughout there are twists, I think it seems to have been made to confuse you in a way (you'd see what I mean if you see it), so you wonder has this really happened or not? and I suppose it sort of works in a 'ah thats clever' sense, when you realise the twists that are there but I just feel it wasn't done as well as it could have been, your left trying to decide if you understand it or not and the main reason I'm not sure if it really worked, for me anyway, was because of the ending. That was almost like the final straw for me, I wasn't too keen put it that way! in a movie like this, you like to have it end in a satisfying way, even if it is quite 'Hollywood', I wouldn't have minded too much I think but the way this ended, just left me with more questions and a sort of a bad taste in my mouth - that I'd followed it through to just be left at the end even more unsure of quite what happened and what I'm supposed to walk away from it thinking. It definately leaves you with more questions than anything else. The ending will definately annoy some, thats for sure, so don't see it if you want all to be clear cut and simple, this doesn't supply that! though if your somewhat intrigued by the themes present (fate, destiny, time travel) which are if only briefly touched upon, and also if you like movies with at least a bit of a science fiction based feel to them, then this may well be of some interest but, to me it didn't seem to quite 'gel properly together' and work all that well, especially as an action movie.There are some pluses (some nice scenery shots, when Chris is with Liz at what looks like the Grand Canyon and there are some cool action and explosion shots present with the odd bit of CGI that works pretty well too) but its no means the best movie any of the main cast have worked on, put it that way. I do feel that it could have been made better but it felt as if it was written a bit too lazily, featuring too many predictable, even formulaic elements, with the main character developing a relationship with a previous stranger and what happens with that, eh, thats been done to death a bit and then there's the slower parts in the movie where Chris talks about fate and destiny and philosophises, that could be seen as being a bit too sort of cheesy and over done or predictable too. Its a bit too average and just doesn't work as well as I'd hoped.The ending I felt was the biggest disappointment and will most likely exasperate your confusion with it, as far as the story is concerned, I feel. It is clever in one sense but I can't help but feel that it isn't properly explained well enough to really work, the way it seems they tried to make it work. If your like me then by the time the credits are rolling at the end, you'll likely be thinking 'what? thats it?!' so that didn't help at all... I would have liked it to go on a bit more, for it to continue and tie up the loose ends, I think it did possibly end a bit too soon and I couldn't help but feel that it was cheating the audience somewhat at the very end."}, {"rating": "5", "text": "Not a terrible movie, just so so. There are some good moments, but they're far and few between."}], "recommendations": ["jumper", "terminator_genisys", "hancock", "poseidon", "i_am_number_four", "seven_pounds", "now_you_see_me", "the_twilight_saga_eclipse", "the_tax_collector", "man_on_a_ledge", "the_twilight_saga_breaking_dawn_part_1", "glass", "the_new_mutants", "limitless", "shut_in", "shadow_in_the_cloud", "awake", "the_twilight_saga_breaking_dawn_part_2", "vantage_point", "dark_phoenix", "old", "the_hunger_games_mockingjay_part_1", "the_old_guard", "the_guardian", "bird_box"]}