{
  "id": 4325,
  "title": "Night Hunter",
  "starring": [
    "Henry Cavill",
    "Ben Kingsley"
  ],
  "runtime": 95,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "A Minnesota police officer crosses paths with a committed and tireless vigilante as he follows the trail of a ruthless predator responsible for several abductions and murders.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vVYU0x9FRpiJNX7c54ciFnRBVYG.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.0,
    "ending": 1.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "The entire thing just feels unfinished and unloved – which I’m sure was not the case at all but this is such a poor end product. Do you remember that time that you were at university and you were up at 3am with the 9am submission deadline getting closer by the second? Words had ceased to look like words, nothing made sense anymore and it had gotten to the point where you just said **** it” and submitted your essay without bothering to proofread it just so you were able to go and get drunk and forget about it? Yeah. That."
    },
    {
      "rating": "7",
      "text": "Η ιστορία ξεκινά όταν ο υπολοχαγός Marshall (Henry Cavill) συλλαμβάνει έναν κακοποιό του internet και ανακαλύπτει σιγά σιγά πως τα εγκλήματα του δεν σταματούν στην οθόνη του υπολογιστή του.Το καστ εκτός από τον εξαίρετο Cavill (Man of Steel), απαρτίζουν η Alexandra Daddario (Baywatch) στον ρόλο της Rachel, Ben Kingsley (Schindler’s List, Gandhi), Stanley Tucci (The Hunger Games movies, The Lovely Bones), Nathan Fillion και ο Brendan Fletcher."
    },
    {
      "rating": "5",
      "text": "Night Hunter is your typical late night thriller. Everything as been done before and well better, the screenplay just looks like a direct to video from the late '90 but at least the direction was relatively decent. The acting was also more than correct, Brendan Fletcher is really fine and both Henry Calvil and Ben Kingsley was also very decent. Overall a nice turn-off-your-brain movie."
    },
    {
      "rating": "10",
      "text": "Night Hunter is a real edge of your seat thriller, a superb plot written by new Director David Raymond.The so called critics who are slamming this film are both stupid and blind and must have an agenda"
    },
    {
      "rating": "2",
      "text": "It's off to a good start with Cavill and Kingsley right, wrong. The premise is actually very good and it had real potential but the writer(s) have tried too hard to keep the story evolving at an unrealistic pace. The final result is a big pile of contrived nonsense that becomes more absurd by the scene if not the minute. No matter how good the cast is, they can't save this dog. No doubt the cast regret being involved with Night Hunter and they'll leave it off their resume. I certainly regret watching it."
    }
  ]
}