{"id": 3270, "title": "Night at the Museum", "starring": ["Ben Stiller", "Carla Gugino"], "runtime": 108, "genre": ["Action", "Adventure", "Comedy", "Family", "Fantasy"], "description": "Chaos reigns at the natural history museum when night watchman Larry Daley accidentally stirs up an ancient curse, awakening Attila the Hun, an army of gladiators, a Tyrannosaurus rex and other exhibits.", "releaseYear": "2006", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/uY9k8t2FQkMj60obnAnsPKLxHCE.jpg", "categories": {"plot": 6.333333333333333, "acting": 6.5, "ending": 3.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 6.275862068965517, "action": 5.0}, "reviews": [{"rating": "6", "text": "\"Night At the Museum\" is way too formulaic, but hey, at least it makes you laugh."}, {"rating": "8", "text": "It is not as predictable and formulatic as everyone says it is. A great idea is well executed and the result is a fun family film with a lot of good performances."}, {"rating": "10", "text": "Its really amazing film i like bin stiller and his funny films."}, {"rating": "3", "text": "And a long, slow, boring and seemingly endless night it is, too...in short, everything that the Museum of Natural History absolutely is NOT. The partial premise, that this museum is losing money and needs to lay off employees, is flimsier than the footbridge in Indiana Jones and the Temple of Doom, but it's only the beginning of the film's problems: they're compounded by an annoyingly witless, unimaginative script that assumes that merely assembling a cast consisting of Ben Stiller, Robin Williams, Owen Wilson, Dick Van Dyke and Mickey Rooney will automatically grow the laughs and energy that it failed to provide in and of itself. Well, in Aerosmith's immortal words, dream on. Stiller's ineffectual, bumbling schlemiel schtick, which was actually funny once upon a time when he premiered it in There's Something About Mary and followed it up with Meet the Parents, got irreversibly old and tiresome around the time of Along Came Polly roughly 94 movies ago. (An early scene that Stiller shares here with his real-life mom, the legendary comedienne Anne Meara, fails to generate any comic sparks whatsoever because the punchline deals with an invention whose mere mention in a joke renders said joke only slightly less outdated than jokes about streaking or pet rocks. And speaking of lame material, didn't Brokeback Mountain gags die out the week after last year's Oscars...and even if not, what's one doing in what's supposed to be a family film?) Stiller plays a divorced, unemployed father attempting to regain his little boy's respect by taking a night watchman's position at the museum...but he gets more than he expected or prepared for when dinosaurs, cowboys, gladiators and Teddy Roosevelt routinely come to life after the lights go out. The inevitable special effects jamboree that ensues IS genuinely impressive and extremely well done, but since it's in the service of such lackluster material, the result is comparable to Halston or Oscar de la Renta costuming a corpse. And Shawn Levy's traffic-cop direction is forcing me to re-evaluate my long-held ranking of Michael Bay as the biggest hack currently working in Hollywood. Bay may be offensive and obnoxious, but at least he's got a distinctive style. Levy, on the other hand, has specialized almost exclusively in cannibalizing the past: he turned the fine old 1950 Clifton Webb-Myrna Loy period piece Cheaper by the Dozen into just another forgettable slapstick family sitcom that did nothing for Steve Martin except stuff his bank account, and earlier in 2006 he and Martin destroyed Inspector Clouseau for an entire generation. With Night at the Museum, Levy apparently endeavors to do the same for Jurassic Park, The Indian in the Cupboard, Ghostbusters and much, much more, so I guess the man is more ambitious than I initially thought. The real mystery is why America so enthusiastically embraced this thing, making it the Number One box office draw of the Christmas season (outperforming such infinitely superior family fare as Charlotte's Web and even Happy Feet). In contrast, the biggest moneymaker of the previous holiday season was the superb, truly magical fantasy-adventure drama The Chronicles of Narnia: The Lion, the Witch and the Wardrobe; while that was a real diamond, Night at the Museum is a lump of...well, no, I can't say coal because coal at least has the POTENTIAL to eventually become a diamond. Decorum prevents me from going into too much further detail in describing just what it is that most of Night at the Museum constitutes a lump of, except to say that finding it in your Christmas stocking is especially unfortunate because in most parts of the country it's far too cold to open the door and air out the house."}, {"rating": "0", "text": "How can you make a fantasy comedy and not nail even one joke?I honestly don't understand how you can consider this movie good."}, {"rating": "7", "text": "Night at the Museum is a good children's comedy film. Not a good cast and original idea do their job. The kids will definitely like it. The problem is only the absence of a pronounced antagonist and a superficial attitude towards prominent historical figures. I advise everyone to watch, once you should look."}, {"rating": "9", "text": "this movie is one of the best movies from 2006 along with ice age 2 and cars!"}, {"rating": "7", "text": "Enjoyable, this; the script is better than it's been given credit for by the critics and the concept is fun. It doesn't pretend to be anything it's not, but it does what it wants to well. A good film to pass 90 minutes or so with some very funny moments."}, {"rating": "9", "text": "It was a kids movie. A 7 year old does not care about a plot or story line. They just want to be entertained. Its a good basic funny movie. Its good for distracting kids for an hour and 20 min"}, {"rating": "3", "text": "My daughters thought it was funny, but I though it was pretty awful. Ben Stiller is not funny, the \"old guys\" of movie were pathetic, Owen Wilson sounded like he was ad-libbing, and Robin Williams seemed as stiff as the wax figure. Yet another movie with a divorced, hapless dad tyring to impress his kid."}, {"rating": "8", "text": "It is a very funny movie. It is really entertaining movie and is planned very well. A clever film..I loved it!!"}, {"rating": "2", "text": "Just not funny for anyone over the age of 10. Should have dumbed it down even more and made it G-rated."}, {"rating": "10", "text": "How can you not enjoy this? A'C fun comedic adventure film that never takes itself too seriously."}, {"rating": "8", "text": "This movie may seem really bad, but you'll enjoy it. I just wish it was scarier, but ever so slightly. Definitely worth seeing."}, {"rating": "7", "text": "It was pretty good and the critics were right about who it is targeting...but is overall funny."}, {"rating": "6", "text": "Reasonably good family entertainment. Nifty special effects and some good bits of humor help the film coast along during story lags and a mostly languid plot."}, {"rating": "8", "text": "I'm perplexed why this movie got so many mediocre to bad reviews. Maybe with all the hype and promotion people want to shoot it down. It's not serious cinema but it was very entertaining and touching sometimes. The monkey slapping scene was one of the funniest I've seen in any film. Mickey Rooney was hilarious and the Stiller line about the South losing the war but getting \"The Allman Brothers and NASCAR\" was one of my favorites. What's not to like?"}, {"rating": "1", "text": "Great movie if you checked your brains at the door, are under the age of ten, or recently had a lobotomy; otherwise it is moronic."}, {"rating": "7", "text": "Entertaining enough, they could have done more with the idea though."}, {"rating": "9", "text": "As far as family comedies go this was a very solid movie, nothing in the movie was the greatest but all the parts worked out to produce a movie that was entertaining and humorous. Everyone from my younger sister to my mom enjoyed the movie...maybe critics just want movies that appeal to the 18-29 alternative lifestyles crowd."}, {"rating": "3", "text": "Probably a great movie if you're younger than 12-years old. For anybody else, it was a dull 90 minutes. The jokes fell flat, Stiller's slapstick act was even worse, and the laughs were scarce. I might have chuckled a few times. Also disappointing was the poor use of CGI. This movie had lots of potential. It's too bad it was wasted."}, {"rating": "8", "text": "It is a great movie that the whole family can enjoy together. That means that Comedy, Art Film, or Barnie-o-phile snobs will come away disappointed, but everyone else will enjoy the ride."}, {"rating": "10", "text": "This movie was great for my entire family. I didn't think it would be very good, but I found it hilarious and laughed through the whole movie!"}, {"rating": "7", "text": "This movie definitely had some funny moments, but the father-son relationship was terrible, all of Ben Stiller's dialogue was pathetic. It was the secondary characters that made the movie."}, {"rating": "10", "text": "Very good actors & really funny! Two thumbs up!"}, {"rating": "7", "text": "This movie isn't bad, but it isn't AWESOME either. It had a few funny moments and clever scenes."}, {"rating": "6", "text": "Fun, but instantly forgettable."}, {"rating": "10", "text": "I think it was unfair that people rate it 5 or less. I admit the bits with just Ben Stiller were a bit boring, but what is best about it is the minature romans and cowboys, a.k.a. Jedediah and Octavius!"}, {"rating": "8", "text": "I wasn't expecting this movie to be really good, but I was pleseantly suprised. It was funny and exciting, but a bit confusing also. Still, I've never seen a bad Ben Stiller movie. I recommend seeing and buying this movie,"}, {"rating": "8", "text": "This is a quality family comedy movie. Ben Stiller does an amazing job of acting like always. If you don't like him, you won't like the movie. Robin Williams does an excellent job playing his role as well. If you want to laugh, you will enjoy this. It's not a disappointment. If you're going to be snobby and dislike the movie before you even watch it... then you might as well not even watch it!"}, {"rating": "2", "text": "Bland, seen-it-before comedy could be forgivable if this movie spent more time simply running around the museum with its entertaining inhabitants. Unfortunately, most of the movie tries to develop a story, and a terrible one at that."}, {"rating": "10", "text": "This movie is great for both chlidren and adults. Too bad the critics arent smart enough to realize Ben Stiller's comedy style."}, {"rating": "8", "text": "I went into this film expecting some sort of Jumanji clone, but it was actually really good. The actors made the film of course (shouldn't they always?), and while it is clearly a children's film, it was a good Christmas movie that even a man in his twenties (as I am) can enjoy."}, {"rating": "2", "text": "Man this movie had potential, but the last 30 mins were so lame that it brought down the whole movie; what a joke!"}, {"rating": "5", "text": "I agree with the USA Today review. Has the potential to be very funny but they don't properly use the premise. Probably good for kids though."}, {"rating": "8", "text": "This movie may not be the best ever, but it sure was funny and definitely deserved more than a 48. The last thirty minutes, where they tried to turn it into a touchy-feely bad-guys-watch-out-here-come-the-good-guys wasn't as good as could be, but it was very funny! It deserves better ratings than this."}, {"rating": "3", "text": "I was instantly put off by the movie from the opnening scene after being surrounded by classes full of kindergardeners through the previews. This movie could have been a clear cut laugh out loud comedy. But tried to hard. Not only with the jokes, of which a few were funny, but the movie's concept was not. In fact, the concept of the movie made me feel like a three-year-old. It attempts at being touching made me sick to my stomach. Stiller makes a bad move, Williams continues to spiral, and Mickey Rooney gives the only half solid performance in his minor role. The ending of the film was ridiculously lame. Overall, it was depressing."}, {"rating": "8", "text": "I was also surprised it got tepid reviews. It was really pretty good. It had a good spirit without being sappy. Stiller has always played the poor, reasionable slob surrounded by idiots role perfectly. I think 'Nacho Libre' got better reviews, and that movie stank abominably."}, {"rating": "8", "text": "I took my family (kids aged 12, 13, & 16) to see this pic over the weekend, and we really enjoyed it. While not a film with lots of storyline, it did serve up laughs pretty well. I think the critics have unfairly blasted the film."}, {"rating": "6", "text": "It was extremely average. Got off to a decent start but I was just bored during it. I found Ben Stiller kind of annoying, actually, which is weird because I usually like his performances. Some decent special effects and Owen Wilson is a scene-stealer, but...just....nothing special here. There's some humor in the script but director Shawn Levy (proving again after his humorless Cheaper by the Dozen and annoying Pink Panther) is unable to make this movie truly funny. Little kids will love it, though. Older audiences...at least won't be COMPLETELY bored."}, {"rating": "4", "text": "On the whole, I don't mind that I spent $4 to see this at a matinee. I'd be seriously disappointed if I had paid full price. There are a number of snickers, but just one solitary laugh, by my count. The effects are competent (that's a compliment), but not very exciting. The win-respect-from-the-non-custodial-kid and attractive-co-worker subplots are lame, lame, LAME. It's for people who are easily impressed, eg, kids."}, {"rating": "9", "text": "It seems strange to me that comedies like this often seem to get low scores on Metacritic. Anyway, for what the movie was, I thought it was great. It made me laugh and had some touching moments, and some fun cameo apperances. Not a masterpiece of theater but an enjoyable flim - I highly recommend it if you're in the mood for a comedy!!"}, {"rating": "8", "text": "A whole lot better than I thought it was going to be. A good New Year's day movie to see."}, {"rating": "10", "text": "Simply the best movie I've ever seen. It's so entertaining, clever, and just overall humourous."}, {"rating": "3", "text": "Going in, I knew this was geared to kids and families. This does not mean that it doesn't need to have some form of educational value. This would have been a real way to give some meaning to the movie outside of the stale \"role of males\" stereotypes crap. Not clever or engaging, unless you really don't get out much."}, {"rating": "8", "text": "My kids had a wonderful time at this movie, as did my wife and I. I would highly recommend it to anyone looking for a fun fantasy movie that you can be comfortable taking the whole family to."}, {"rating": "7", "text": "Entertaining, safe for kids and inspires learning of history. We could do much worse."}, {"rating": "9", "text": "This was incredibly clever. Perhaps the reviewers looking for pure comedy should check out the Three Stooges or maybe the Simpsons. Anyone with half a brain will appreciate the clever way history is brought forth in this movie."}, {"rating": "6", "text": "Fun popcorn movie, even clever in spots. Standard plot: divorced dad w/o job tries to prove himself to his son. I would think kids would like this. It was amusing to see Ben with his mother at the employment agency!"}, {"rating": "1", "text": "If you thought the remake of \"The Stepford Wives\" was severely flawed at the conceptual stage(were they humans or androids?), \"Night at the Museum\" manages to be even more befuddling as to the nature of such fantastical beings. Why are some museum pieces aware of their true selves(Teddy Roosevelt as played by Robin Williams), while other seem to believe that they're actual historical figures(or animals)? It's just a comedy, I know, but you need to establish some rules and abide by them. Take the mummy for instance; he either should have a face that indicates it's of very, very, very, very mature vintage(if the mummy is genuine), or possess no face whatsoever; just a blank slate of a visage(if the mummy is merely a wax display, why bother with a face at all underneath those bandages?). These lapses in logic would be forgivable if \"Night at the Museum\" was entertaining. It's not. There's no awe factor that these inanimate objects are injected with life. Worst of all, the film doesn't build any suspense in leading up to Larry's supposed-to-be-grand-discovery. \"A Night at the Museum\" shoots its load too early by stupidly going jurassic on us as a way of introduction. It also rips off \"Field of Dreams\"(people do indeed come), and \"Cocoon\"(Dick Van Dyke & Mickey Rooney remind me of the Orbitz ads with Wink Martindale; they're old men so old, you would believe that a magic tablet revived them). And no self-proclaimed history geek alive writing a nine-hundred page book on an \"Indian\" princess looks like Carla Gugino. When she's ready to interview Sacajawea(Mizuo Peck), you wonder(well, you should wonder) how a wax body learned about its representational self. \"Night at the Museum\" has got to be a candidate for worst film to ever gross more than two-hundred million dollars at the box office. It should've tanked."}], "recommendations": ["neighbors", "thunder_force", "little_fockers", "night_at_the_museum_battle_of_the_smithsonian", "paul_blart_mall_cop", "a_million_ways_to_die_in_the_west", "neighbors_2_sorority_rising", "ted", "ted_2", "the_happytime_murders", "step_brothers", "bedtime_stories", "old_school", "grown_ups", "30_minutes_or_less", "jackass_presents_bad_grandpa", "my_spy", "yes_man", "the_pacifier", "bad_santa_2", "friday", "blended", "the_three_stooges", "21_jump_street", "hot_tub_time_machine"]}