{
  "id": 1361,
  "title": "Night of the Living Dead",
  "starring": [
    "Tony Todd",
    "Patricia Tallman"
  ],
  "runtime": 88,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "In this remake of the classic 1968 film, a group of people are trapped inside a farmhouse as legions of the walking dead try to get inside and use them for food.",
  "releaseYear": "1990",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/isp4lCv08asTPNvv8Xe8oQK293n.jpg",
  "categories": {
    "plot": 8.333333333333334,
    "acting": 8.0,
    "ending": 8.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "When the dead come back to life a group of survivors find themselves trapped inside a farmhouse with no obvious means of escape.Released in cinemas back in 1968 Night of the Living Dead was a critical and financial success and it has since gone on to become a cult favourite amongst horror fans. Watching it today some aspects such as the unconvincing zombies, mediocre acting and constant musical score playing throughout most scenes show the films age, and lessen it's impact somewhat, but it remains an effective example of the genre and its influence on subsequent TV and film is undeniable."
    },
    {
      "rating": "8",
      "text": "Night of the Living Dead owns its reputation as one of the most important horror films ever made. Most modern horror films go intensely overboard on both the gore and the pace, while forgetting to include any actual drama for characters to face. George A Romero proved with this film, almost fifty years ago, that he knows how to scare an audience, and really make them think."
    },
    {
      "rating": "8",
      "text": "The arrogance, the miscommunication is horrifying. There is no deal, nothing on the table, no table at all. Everything is up for grabs and burns.Night Of The Living DeadAmong many filmmakers achieving their own various milestones in their first project, this one could be the ideal example, the milestone of that sub genre list- if there is any! The co-writer and director, George A. Romero has a poetic speech. Even rhyming, I would persist. Leaving all the evolutions of ghouls or zombies or whatnot aside, I would like to focus on the structure of the script. It is better if you understand the intentional poem behind all the scenarios in order to truly enjoy this could-arguably-be called popcorn flick. But there is much more than entertainment. Yes, you will get the occasional scare, the hair pulling annoyance to not be able to control and a classic game of pitting one chip against another. But this is one page poem. Written with a mirroring symmetry. It has a start and a finish. Something you won't be able to differentiate. And all the elements in the script is brimming with this ingredient. The dialogues, the intentions, the faulty logistics, worn out philosophises and now even the political incorrectness, some might point out. If someone doesn't get along they would start their equation through that very formula. And even end on it. Their salvation relies upon each other's theories and so does damnation, but then there is arrogance in the air. This eye-for-actually-nothing world hungrily feeds on upright abusive nature. The drapes are off and the humility, sociality comes off shamelessly. The living is scarier than dead ever will be. For in this Night Of The Living Dead, your companions are not only dumb, cold, rancid species (just as you are) but also has a motif. Greedy motives. There always is. It is human to be. Not zombies."
    },
    {
      "rating": "7",
      "text": "Not bad, even in this zombie frenzy era. Slightly dislike how people seeing women at that time."
    },
    {
      "rating": "8",
      "text": "This movie is a great example of what can be done with a limited budget, a simple idea and new actors. Movie is nicely shot and mostly well acted. Movie grabs your attention after 10-15 minutes of the beginning and it keeps you grab to the very end. The ending was expected but not in the way it way.It didn't have bloody scenes which we expect from every zombie movie. It instead depicted scenes of murder, death and cannibalism. The black and white footage involving blood and gore made the movie more effective.I would recommend this film to anybody interested in the art of film making and to those who enjoy the horror genre. Before watching the movie just keep one thing in mind; this was small budget movie of 1968 with new actors and it did great with all this."
    },
    {
      "rating": "8",
      "text": "First in a franchise that inspired many.Some of the acting could have been better though, that's always been a problem I've had with Romero's stuff.One of the best zombie movies though, not that scary but the concept is always horrifying and there are some genuinely disturbing scenes. If you've seen it you know what I'm talking about."
    },
    {
      "rating": "10",
      "text": "Great classic a movie I can come back to and a movie I can recommend to everyone I know"
    },
    {
      "rating": "7",
      "text": "A cool flick that was a good start to a phenomena that would soon grow stale"
    },
    {
      "rating": "8",
      "text": "This is a great piece of filmaking by George A. Romero which direct this movie full of anguish, suspense, horror and quality. It is a film that, while not perfect, will serve as an inspiration for subsequent zombie films."
    },
    {
      "rating": "9",
      "text": "The movie that started it all. Every piece of popular zombie fiction, from movies to TV shows and comics and video games, owes there existence to this film. George Romero's innovative and groundbreaking vision laid the framework for countless years of undead entertainment. Every trope, idea, rule, and moral conundrum you'll see in all of the zombie content that has come out over the years and has yet to can be found here. It's amazing to watch this, think of when it came out, and still see how all zombie fiction is using the exact same ideas. So next time you  are watching an episode of The Walking Dead or playing some Zombies Mode in Call of Duty, just know that they wouldn't exist were it not for \"Night of the Living Dead.\"Of course it wouldn't matter that Romero did it first if he hadn't done it well. Night of the Living Dead holds up remarkably well after all these years. If anything, with the exception of (maybe) the low budget and some inexperienced acting, time might have actually improved this movie. It's black and white visuals, retro soundtrack, and to the basics approach add a tone and atmosphere to this that the refinements of the modern age can't always capture. I will admit that there is a lot of what I guess you could call empty space in the movie. The majority of the time is just watching the characters (mostly just Ben) board up the house they are trying to survive in. It isn't until the cast expands that the action really starts to get going. Like most zombie movies, the struggle survivors find between each other as the result of differing backgrounds and personality is just as large and dangerous to them as that of the undead hoards gathering just outside their defenses. One of the many examples I could cite to show you just how influential this movie was to the countless others of it's ilk that followed in suit.While the low budget, independent nature of the film is something of a two-edged sword, it's clear that one edge is much sharper than the other. Fortunately, it's the one the swordsman doesn't have to worry about cutting (or worse, impaling) himself on. Without a great deal of special effects to rely on, we actually get to see the cast really use tools like fire and such to survive. It's pretty amazing to see our lead use a legitimate torch indoors, smoke and all, on his was outside. It makes the situation more believable. Yes, he's not actually going out there to ward off zombies, but he is risking some burns with that flame. The movie might actually be even creepier due to this smaller scale as well. I particularly enjoyed how the zombies were portrayed without much makeup, making them look more like, well, people. It's their behavior that sets them apart. I also think the way Romero envisioned them is also neat. They are much smarter then what we normally see nowadays, as they have the gumption to do things use tools in basic ways. It's also worth noting how incredibly bleak things are. With it's unforgettable ending and disturbing basement scenes, this is a movie that will stick with you long after you've made it to the final screen. Unlike other zombie fiction, this one even gives us an idea as to what caused the dead to return to feast on the living. Night of the Living Dead is a piece of cinema history. A real game changer that is still influencing the world today. Even though the zombie craze has slowed down a bit as of recently, the undead are still dominating our world. Well, ladies and gentlemen this is where the outbreak started. The late, great George Romero has gone down in history for a reason. You really should check out this starting movie in a series that has still has the ability to enchant and chill even today. Zombie fan or not, horror fan or not, movie buff or not, if you consider yourself a fan of fine cinema then this a must watch. Not only is it historic, but it's also fantastic as well. One of the most important, influential, and just darn enjoyable horror movies ever created."
    },
    {
      "rating": "7",
      "text": "La Noche de los Muertos Vivientes (1968)Sinopsis:Las radiaciones procedentes de un satélite provocan un fenómeno terrorífico: los muertos salen de sus tumbas y atacan a los hombres para alimentarse. La acción comienza en un cementerio de Pennsylvania, donde Barbara, después de ser atacada por un muerto viviente, huye hacia una granja. Allí también se ha refugiado Ben. Ambos construirán barricadas para defenderse de una multitud de despiadados zombies que sólo pueden ser vencidos con un golpe en la cabeza.Opinión:Creo que el haber visto tantas veces el remake de 1990 influyó demasiado en mi reciente percepción sobre la versión original ya que con respeto debo afirmar que el remake es fabuloso y aterrador incluso al día de hoy y la versión original si bien la encontré buenísima, pienso que no ha envejecido bien, pero para ser una película de 1968 de serie B está divina y adelantada a su tiempo.No me gustó que el personaje de Bárbara fuese tan sobreactuado en ciertas ocasiones y tan apagado en la mayoría de la película, cuando en la versión de 1990 pasa del miedo al empoderamiento con excelentes contrastes de actuación, pero bueno, supongo que son estereotipos de la época.Valoración:3.5 ⭐ de 5 ⭐"
    },
    {
      "rating": "6",
      "text": "Seminal in so many ways. Genre defining and sets a darker blueprint than you'd expect. However, if you like this genre you'll have seen everything expanded upon even by Romero himself so it won't hold any surprises. Also despite being \"restored' it's barely watchable with iffy sound and appaling lighting. While like Citizen Kane it's almost required watching for a buff, a casual will probably want their 96 minutes back."
    },
    {
      "rating": "8",
      "text": "The movie film is a government assigned project to broaden and enlight people and glory of nation. Cultural learning is emportant to follow on global basis. We make our nation a better and more convenient place for house and living. Kazakhs are progressive and asstonishing people that with conclusion of project will have new optimistic"
    },
    {
      "rating": "9",
      "text": "A Classic and the classic Zombie Movie which everyone should see once in their life."
    }
  ],
  "recommendations": [
    "28_days_later",
    "dawn_of_the_dead",
    "land_of_the_dead",
    "the_texas_chain_saw_massacre",
    "house_of_1000_corpses",
    "the_girl_with_all_the_gifts",
    "the_crazies",
    "the_remaining",
    "it_follows",
    "30_days_of_night",
    "event_horizon",
    "world_war_z",
    "the_medium",
    "hellraiser",
    "the_conjuring_2",
    "annabelle_comes_home",
    "the_evil_dead",
    "the_conjuring",
    "they_live",
    "paranormal_activity_next_of_kin",
    "chernobyl_diaries",
    "the_pyramid",
    "the_ritual",
    "the_witch",
    "the_collection"
  ]
}