{
  "id": 67,
  "title": "Nightbooks",
  "starring": [
    "Winslow Fegley",
    "Lidya Jewett"
  ],
  "runtime": 103,
  "genre": [
    "Fantasy",
    "Family",
    "Horror"
  ],
  "description": "Alex, a boy obsessed with scary stories, is trapped by a witch in her modern, magical New York City apartment. His original hair-raising tales are the only thing keeping him safe as he desperately tries to find a way out of this twisted place.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/ysJte1iqN8pFQ470tumnViB1wHP.jpg",
  "categories": {
    "plot": 6.625,
    "acting": 7.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Horror for the whole family! I think the most impressive part of the movie for me is its opening. In a brief scene we are introduced to the young protagonist's struggle with fitting in and making friends entirely through the emotions being displayed by the incredibly talented child actor Winslow Fegley and the story being told in the environment. It stands out to me because it subtly lets the viewers know what's going via their own intuitions, rather than simply spelling it out for them the way any other film with kids in mind would. It also means Nightbooks wastes no time in getting going, as immediately after we see the character thrust into supernatural enslavement to a sadistic witch.What follows is admittedly not always as interesting. While the surprisingly frightening dark fantasy imagery and legitimate life-or-death stakes the middle school aged leads face ultimately kept me engaged until the credits rolled, I'd be lying if I said my attention didn't drift towards my phone during the actual plotting until the next big set piece kicked in. That's because the script is full of clichés which can be seen in its rather generic \"stay true to yourself\" message or really in the character of Yazmin as a whole.The biggest problem though might be Krysten Ritter. The former Jessica Jones star is having a bit too much fun hamming it up in her villainous role. Her exaggerated performance and the fact that she herself is just so darn sexy prevent her from ever being a menacing presence. A big difference from what we saw from Anne Hathaway a little less than a year prior.Still, while this may not have anything on Robert Zemeckis' remake of The Witches, if you're looking for something to bring the entire house together this Halloween season Nightbooks is one of the better options out there. Largely because of its little flourishes, such as the inclusion of Chvrches' beautiful cover of The Lost Boys theme song \"Cry Little Sister\" (the vampiric cult classic is acknowledged multiple times throughout), that make it clear director David Yarovesky is just as interested in pandering to the adults in the audience as he is in providing poop and barf gags for the kids watching.7.5/10"
    },
    {
      "rating": "3",
      "text": "Witch abducts kids to read her scary stories and work around her apartment but this is actually to keep the witch from Hansel And Gretel asleep."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "4",
      "text": "Quite boring and pointless.For children, yes, but if not, you will not be able to endure the whole movie"
    },
    {
      "rating": "8",
      "text": "There are some really terrifying scenes but only once it feels like it goes too far for a younger audience. The near-perfect technical side of the production is only let down by some unconvincing cat CGI. Acting was excellent. Really great casting. Love the story and how it was told. The creative side of the production was only let down by some uneven pacing in the first half where it occasionally lost our attention. This is a great family horror, if you can take it! I loved the subtle The Evil Dead (1981) references."
    },
    {
      "rating": "5",
      "text": "I admit that its tone is darker than I expected, and that gives it a bit more personality, but it cannot escape the rules of the young audience to which it's aimed at.It might not be for simple kids, but it doesn't do anything out of the ordinary either.Krysten Ritter was good enough and the two lead kids are fine, and that's pretty much it."
    },
    {
      "rating": "10",
      "text": "This is the best “kids” horror movie in years. All these negative reviews are coming from people who aren’t the target audience. The movie is too intense for anyone under 6, but if you’re looking for a good Halloween spooky movie that the entire family can watch, check it out. It goes up there with The Witches (1990) and Gremlins for PG horror movies."
    },
    {
      "rating": "7",
      "text": "For a long time now I’ve been saying we need more movies that can ease kids into horror. Going straight into the “good stuff” may be a little too unsettling for some kids. Nightbooks can easily be added to a list of great kid friendly, family friendly horror movie. The story touches on a lot of notes that I think are important for kids and adults alike to hear. Is the movie perfect? Far from. But there is a lot I appreciated about this movie.1) Winslow Fegley again proves that incredible acting runs in the family. He and his brother, Oakes, are incredible young actors and I can’t wait to see where his career goes.2) This movie, very ingeniously, covers a myriad of horror movie tropes. I appreciate this because it may help younger viewers find out what kind of scares they enjoy vs what is a little bit too much.It very much feels like this story would have been more well suited as a series. It feels very rushed in a few places. But, overall, it’s a delightful film. I’d say it’s well worth the watch."
    },
    {
      "rating": "10",
      "text": "movie is good and Lidya Jewett is beautiful and works very wellfilme é bom e Lidya Jewett é linda e trabalha muito bem"
    }
  ],
  "recommendations": [
    "the_house_with_a_clock_in_its_walls",
    "the_spiderwick_chronicles",
    "it",
    "coraline",
    "monster_house",
    "mama",
    "ouija_origin_of_evil",
    "orphan",
    "case_39",
    "paranorman",
    "goosebumps",
    "nanny_mcphee",
    "moonrise_kingdom",
    "brightburn",
    "red_riding_hood",
    "the_kid_who_would_be_king",
    "the_witches",
    "annabelle_comes_home",
    "super_8",
    "it_chapter_two",
    "scary_stories_to_tell_in_the_dark",
    "insidious_chapter_3",
    "the_possession",
    "wish_upon",
    "the_curse_of_la_llorona"
  ]
}