{
  "id": 1367,
  "title": "Night at the Museum: Secret of the Tomb",
  "starring": [
    "Ben Stiller",
    "Robin Williams"
  ],
  "runtime": 98,
  "genre": [
    "Adventure",
    "Comedy",
    "Fantasy",
    "Family"
  ],
  "description": "When the magic powers of The Tablet of Ahkmenrah begin to die out, Larry Daley spans the globe, uniting favorite and new characters while embarking on an epic quest to save the magic before it is gone forever.",
  "releaseYear": "2014",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xwgy305K6qDs3D20xUO4OZu1HPY.jpg",
  "categories": {
    "plot": 6.065217391304348,
    "acting": 6.393939393939394,
    "ending": 5.884615384615385,
    "soundtrack": 9.0,
    "cinematography": 6.0,
    "familyFriendly": 6.25,
    "funny": 5.75,
    "action": 6.8
  },
  "reviews": [
    {
      "rating": "1",
      "text": "This was a recycled idea being brought over and over again! This is getting really boring and Shawn Levy really needs to end it now. The first one was good but when Smithsonian came out, I was bummed because it sucked. The Secret Of The Tomb is the WORST of the two, its boring, mind numbing but atleast Ben Stiller and Dan Stevens with ROBIN Wiliiams (His Last Role, R.I.P) were what made me atleast 30 percent interested. Its not even funny anymore, some snappy lines aside this film is the same garbage (washed out Smithsonian). Do not waste your time, because its not the same! The secret of the tomb deserves my 1/10 because at least some actors brought their best. Ignore."
    },
    {
      "rating": "6",
      "text": "Night at the Museum: Secret of the Tomb is a fun family film finale to the adventure trilogy of Larry Daley. What started as a semi-educational spectacle became a trilogy that focused less on the premise and more on the CGI action. The dragging narrative picks up as beloved characters bring their antics to the big screen one last time.\r The lack of an inventive storyline and the subplot revolving around the neanderthal Laa really detracted from the anticipated climactic finish to this franchise. The jokes with that character just seemed so forced and unintelligent in comparison to some of the humour throughout the rest of the franchise.\r In the end this film is a delightfully enjoyable finale to a franchise focused on giving families a reason to go to the theatre together. If you’re a fan of the previous two Museum films, then Night at the Museum: Secret of the Tomb will be a pleasant end to the story of Larry Daley, but some average film-goers may not enjoy the uninventive Night at the CGI Museum."
    },
    {
      "rating": "5",
      "text": "It had its moments. I get the idea they lost some of their creative drive in this movie, and simply made a sequel because it would sell. Sir Lancelot was fun but unfortunately the only interesting character. The rest was recycled from previous movies."
    },
    {
      "rating": "1",
      "text": "Not at all funny, Bad visual effect, bad dialogue, at it seems that the group is just a filler and names without any effect on story. i mean the movie without Williams, Wilson and Kingsley  would not be any different."
    },
    {
      "rating": "5",
      "text": "For the final night, the final movie and the film ended...so so.\r The story is about Museum guard Larry Daley played by Ben Stiller, heads from New York City to London in order to save the magic that brings the displays to life, as the tablet is losing its power.\r A quick recap of the other two Museums films and then I will talk about the third one: The first Night at the Museum film I thought was pretty good and solid family film. It's harmless and very creative of what the creators can do with the famous figures of are history. But the second movie I thought was a big mess. I remembered not laughing that much while watching the film, and is it just me or the movie was like it was pleading for me to laugh at it but I was left in silence for the all film. So yeah I didn't like the second movie but I liked the first and with the third one I can say.... It's better than the second movie, I can say that at least, but I'm going to be honest here, this isn't a good movie, it isn't bad, it's just not that good.\r Ben Stiller once again returns to his character \"Larry Daley\" and this time his character isn't the same character where he will wave his finger out at people and say \"Don't do that I'm telling you\", or \"Hey get away from from that\", yeah that kind of character, but in this he changed a little well since this is the last film and probably the writers of the film thought to themselves \"Yeah he needs to stop being a boss pot and lighten up a little\", and I respect that and Ben Stiller did do good in this.\r All the other cast members all do good even Mickey Rooney and Dick Van Dyke had a scene in this and it was pretty good scene. The movie looks really good has well like the all movie has that Christmas with that light blue color to it.\r Now let's talk about the ending to this movie and this isn't a big spoiler because you know this is the last movie and all the character's have to say their goodbye's and the scene with Robin Williams and Ben Stiller wrap up moment almost had me in tears. It was like Robin Williams himself was saying goodbye not just to Ben Stiller but to us, yes you the people. I know this isn't fully his last movie because there's another movie that his in called Absolutely Anything and that comes on this year where he plays a talking dog and Simon Pegg is in it as well, so that's really his last role, but the goodbye scene in this was pretty sad and Robin did really good in this movie, like he always do.\r Now for the things that didn't really work in my eyes like: The cave man in the movie that's suppose to be the comic relief got on my nervous and if you just take him out of the film the all movie wouldn't feel like it's missing something. The writing in this isn't all that great, yeah it's a kids and family film so yeah I can see why they have to dumb it down, but come on the one liners in this fell so flat to me.\r Night at the Museum: Secret of the Tomb is not a bad film, it's not flawless and the movie isn't trying to be. If somebody ever said to me would I recommend this film to family and kids and I will say yes go a head they would enjoy it... I hope, but it's not for me."
    },
    {
      "rating": "5",
      "text": "The same old story, but this time the action is transplanted to the British Museum. A star studded cast do what they can with a very weak script but they really are fighting a losing battle. A particular low point is the running gag with Stiller's neanderthal doppleganger, which surely someone saw was stunningly unfunny. The highlight comes with a big star cameo near the end. A shame that this may be seen as Robin Williams last film"
    },
    {
      "rating": "5",
      "text": "So the final movie in the trilogy. That's what I'm hoping for. Because when the first movie came I thought it was a nice idea and then its sequel was so bad without any further innovative ideas to add up. I was not expecting the third movie, but it made its way and I give it a try only to get disappointed.\r Ben Stiller is a fine actor and a great director, this trilogy was just a passing cloud in his career, other I would have blamed him for accepting the offer. As we know its a multi star movie, in that I am very happy to see Robin Williams one final time. What a great actor, lucky we had him in our time. The funny thing is I am confused for Rebel Wilson as Melissa McCarthy, but soon after realised.\r The rest of the cast, Wilson, Coogan, Kingsley and other were what to say, their existence were in individual narrow thin lane in a weak story. Badly needed a fresh plot in the well known concept from the last two movies, and it did not give us. Hope the reboot would be very creative in the each three. May be it should set in the Hollywood studios like Marvel, Disney et cetera. Because, as I am a movie fanatic, love to see some of my favourite characters like Gandalf the gray, Joker et cetera, as well as beasts like Godzilla, King Kong et cetera come alive at night. It would be so awesome. Anyway, this movie was just okay for a certain reason. Don't expect high, because it won't serve you.\r 5/10"
    },
    {
      "rating": "1",
      "text": "I really enjoyed the first two of this genre,in particular the second one,but this? utter dross! bitterly disappointed...Don't bother.Perhaps kids will like it,not sure,but they could have made more of an effort,a bit insulting really, shame on you Ben Stiller!!"
    },
    {
      "rating": "1",
      "text": "Atrociously awful. Full of useless filler dialogue, illogical situations and solutions (urinating on lava wouldn't put it out THAT quickly), and a plot so full of holes that it makes termites jealous, Secret of the Tomb spectacularly fails on almost every level. The only reason I'm giving this a 1 is because of the Mickey Rooney/Robin Williams tribute at the end of the film. 1/10, F."
    },
    {
      "rating": "5",
      "text": "Night at the Museum: Secret of the Tomb provides mindless fun and will entertain young viewers but beyond its over reliance of CGI is an abysmal plot recycled from the first two movies."
    },
    {
      "rating": "4",
      "text": "The last night at the museum has its own moments just like the previous two installments, the Egyptian theme and the tomb at the very beginning of the film might bring audiences the feeling of getting back to the first two Mummy films, but soon after that, everything ruins thanks to the easy, lazy story line without a proper exploration on each characters development and to build a logic connection and memory among themselves. It intends to be ridiculous, joyful and hilarious, especially the monkey character, Dexter which impresses the most are all the main factors that the film is suitable for family goers on Christmas. The film would be a complete disaster without Ben Stiller to lead, but this does not save the film to look dull, not so funny with lame jokes, weak scores and to look inert. Overall, it is a disappointment as this family franchise film lacks of inspiring message, burns off the original film's energy and ideas, and ends losing all the magics abruptly."
    },
    {
      "rating": "5",
      "text": "Enjoyed the previous films and was looking forward to this one.  The characters, a new location with tons of history. But I came away feeling cheated. At times the interactions between characters looked awkward, you could see they were going through the motions. Like it was less the movie, more the paycheck. Robin Williams was not at his best and he seems so sad throughout which in retrospect might have been the case. The new characters, the cheeky security girl, the Knight, were ok. The lions from Trafalgar square chasing a laser light was the highlight. It was enjoyable, just I was expecting more. So many historical characters to choose from, a fresher pair of directorial eyes might have helped."
    },
    {
      "rating": "5",
      "text": "This movie is less of what I expected. It’s really funny in some parts, it has good acting, and all the characters you missed are back. Sadly, it’s boring in some another parts, it’s just stupid, it reuses a lot of old jokes that aren’t funny anymore, and it has a lot of subplots that weren’t necessary and just made the movie worst.\rThe first one was cool, the second was a little less good, but this one is just bad."
    },
    {
      "rating": "3",
      "text": "such an average film, just the same as the older films really\r really hate the joke involving the stupid ben stiller like caveman guy just the worst thing about the film made me so angry for some reason, started skipping whenever he appeared because its just bad"
    },
    {
      "rating": "8",
      "text": "This improved the story a lot, by adding more emotion. It ends the trilogy in a great way. They added a new character, who is actually very funny. The best in the series."
    },
    {
      "rating": "8",
      "text": "As a FAMILY movie, it deserves an eight. It's something enjoyable for the adults (especially with Robin Williams' performance) and my 11 and 10 year-olds loved it.  Don't let the critics' score stop you from seeing this one, if it's a family movie you are looking for."
    },
    {
      "rating": "10",
      "text": "A fitting end to a trilogy that was great, especially the second installment. Secret of the Tomb delivers with more emotional scenes than its predecessor, an interesting plot, and funny dialogue. The movie is definitely worthy of Robin Williams' last role."
    },
    {
      "rating": "7",
      "text": "The third installment of the franchise doesn't go on par with the last two films, in terms of pure adventure and entertainment, However it offers a good ending with a powerful main point.Overall it was a good way to end the franchise."
    },
    {
      "rating": "6",
      "text": "Ben Stiller is back at his museum full of historical figures that come alive at night. This sequel's adventure takes them to London's British Museum, where a bunch of new exhibits enter the fray. Again, there are lots of big setups, inane chases and dozens of animated creatures. While this movie could be construed as cute for adults, the movie is really for kids. The plot is silly, but it's about the characters who add personality and fun to the film."
    },
    {
      "rating": "10",
      "text": "We saw Night at the Museum at the Houston Museum of Natural History in their IMAX theatre. We had the best seats and loved this movie! The special effects were fantastic. I wouldn't be surprised if they get a nomination for set decoration, maybe costumes. The scenery and location shots were superb. The story was the weakest part of the movie for most people, but not for us. It was silly, sappy and sentimental. Just what we want to escape to instead of reading the latest horrors in the world. It's about people who have no common interests, no common culture to relate to, and are centuries apart in age and ideals. Yet they mostly get along and care about each other. If only that was real life. It was bittersweet seeing Robin Williams and Mickey Rooney (died at 93 after a 91 year career in show business). The Movie has a wonderful goodbye scene for Robin as Teddy Roosevelt. The good feelings from the movie made us leave happy with the magical theme of people of all kinds getting along, which of course, is fantasy in real life."
    },
    {
      "rating": "8",
      "text": "Great encore presentation from the returning cast and a few new ones. Robin williams gives a wonderful performance that creepingly parallels his now known personal struggles. It makes you shed a tear thinking of what could of been on his mind while showing us one more performance of his Roosevelt. We also get to see Mickey Rooney as lively as ever. This is indeed a great family film and should not be looked over so easily."
    },
    {
      "rating": "6",
      "text": "Oh goody, more of the exact same thing except now in England. So much rehashing and focus on the EXACT SAME CHARACTERS! While I love Robin Williams as much as the next guy, I feel his passing has seriously clouded most people's judgement on this movie as a whole. Everyone want Robin Williams' last movie to be remembered well.\r Well, nuts to that. I will remember him and his great performance, not the movie.\r The effects are about on par with the last two movies and the plot (while a cliché) is better than it was in the first two movies. A weird Hugh Jackman cameo though, funny how he poked fun at himself.\r Overall:\rNight at the Museum 3 is better than the first two movies in terms of humor and writing. BUT, it laughably rehashes almost everything from the fist movie,AGAIN! Even though it is in a whole new country. It also mostly forgets the events of the second movie. All in all the movie on the whole seems to be trying too hard to do what it did right in the last two movies. In that respect, it succeeds. Only problem is that we've seen it all before (except for NeanderStiller, that was stupid.)\r While Williams' performance was great and heartwarming, it was also mostly needless. He was there simply as a promotional tool, when a British historical figure could have fulfilled the same purpose. So sad when it was common knowledge he hated being a sales gimmick. Think about it, if he hadn't been in this movie, would it have done as well? I would hope so, but sadly star power sells."
    },
    {
      "rating": "6",
      "text": "Much better than its predecessor. Night of the Museum 3 offers the wackiness of the original but also with some better humour and character development."
    },
    {
      "rating": "2",
      "text": "BEN STILLER IS ON TOP OF HIS GAME!! The entire time my eye balls were glued to the screen as I watched the iconic movie magic of the ex \"meet the fockers\" legend! I saw the other Night at the Museum movies so natural i was VERY curious to see what these wacky characters were up to next! So me and my cousin went on a movie date to the closest drive-in vendor and sat back and enjoyed! 10 mins in and Ben Stiller already blowing us left and right with his humorous punchlines and silly satire. OH BEN!! At the half way point my cousin was soaking WET from crying of laughter! I got so excited i had to swallow my roars of laughter so i didnt disturb the families around us. Near the end of the film, the wise cracks were still penetrating my ear-holes fast and often. Me and my little cousin left more than satisfied! I recommended this film to all the kids i see in my neighbors apartment. They don't get out much because they are so close to there two dads but I'm sure they would love it!! I know I did! Ben Stiller is almost as good as Adam Sandlar!"
    },
    {
      "rating": "8",
      "text": "Night of the museum is back this the new trilogy, Yea! personally i thought this movie was  gonna be terrible why? cause the last Night of the museum (Night of the museum 2) i hated the kids humor but the movie is fun. But the humor in this movie the humor gets funny, the adventure gets fun and that's what children love when they watch the franchise.The movie has a little bit problems, the humor well its ok i really hated Rebel Wilson's character she was annoying and Not funny at all. Ben Stiller returns he still got it his performance is charming and well funny. Grade B this movie is funny, but the humor has some issues."
    },
    {
      "rating": "4",
      "text": "The movie has somewhat become straganvant, this movie doesnt even deserve funny things and scary things, but it still managed to have a decent story and acting."
    },
    {
      "rating": "8",
      "text": "Fun and bittersweet end of the series. I enjoyed it and makes me want to see the first two again. Robin Williams was excellent. Odd brief appearance by Dick Van Dyke."
    },
    {
      "rating": "7",
      "text": "I just found the free download from this link, is that legal?\ralso it has some other latest movies for free download. any one see this before?\r http://adf.ly/vv2sB"
    },
    {
      "rating": "6",
      "text": "A very kid friendly movie with clean humor...Robin Williams last performance and he was hilarious as usual...A good movie to see with entire family if you can't find a babysitter for the evening. 6 out of 10"
    },
    {
      "rating": "6",
      "text": "I didn't like the first half of the movie, it was kind of lame and drawn out... toward the middle and the end I couldn't stop laughing. I give it a six because it was good over all but I wouldn't go any higher.. good movie and probably end up buying it."
    },
    {
      "rating": "9",
      "text": "this movie a great! and one of the best movies from 2014 along with guardians of the galaxy, captain america 2, transformers 4, planes 2, and big hero 6!"
    },
    {
      "rating": "8",
      "text": "The third Night at the Museum still packs the magic. It may feel a touch familiar, but for once that's not a bad thing. It's great to see the character's I enjoyed in the previous two movies back again with some new faces. It's a family movie with plenty of humor.\r Ben Stiller kind of looks like he's phoning it in every now and then, but the rest of the cast stays strong throughout. Plenty of exciting visual effects, including a spectacular dive into a painting, bring the film to life and make it a magical treat. Some great cameos this time around add to the laughs.\r It might not be anything other than more of the same, but I found it to be enjoyable nonetheless. It's a welcomed sense of deja vu. One that's perfect for family movie night."
    },
    {
      "rating": "5",
      "text": "This third film is probably better than the second, but still aims for stupidity over smarts."
    },
    {
      "rating": "4",
      "text": "A cinema-going in Shanghai with my cousin, who handpicks this comedy sequel for solace because she has freshly gotten out of a tormenting tug-of-war between her parents and her boyfriend, so I dare not to differ.\r A five-year gap between the third venture and its predecessor NIGHT AT THE MUSEUM: BATTLE OF THE SMITHSONIAN (2009, 5/10) not-so-subtly signifies Twentieth Century Fox’s confidence of this money-grubbing family fare is not too strong, or maybe star Ben Stiller’s ballooning cheque is too taxing to meet, anyway, its domestic box-office has been considered a minor misfire ($108 millions income Vs. $127 millions budget after 5 weeks), which may suggest that 3 is always a perfect number for a franchise’s retirement.\r keep reading my review on my blog, google cinema omnivore, thanks"
    },
    {
      "rating": "9",
      "text": "This is an amazing family film, i am shocked this only got mixed reviews. It was funny, it was action packed, it had great prrformances from Ben Stiller and the late Robin Williams, and was a great last installment in the trilogy. I would highly recommend it."
    },
    {
      "rating": "6",
      "text": "Terminar franquicias después de mucho tiempo deja un sabor agridulce para la última película de Robin Williams que hizo en vida. La trama es más de lo mismo."
    },
    {
      "rating": "7",
      "text": "By the third entry in the series, this has become pretty predictable. That doesn't mean it can't be funny because there were lots of moments where I was laughing out loud. I thought it was a great sendoff to the trilogy. Recommended if you liked the first two."
    },
    {
      "rating": "7",
      "text": "The movie could have ended as heartbreaking as the Toy Story 3 if the disco/party scene have not concluded the film. However, of course, the genre is comedy and it intended to leave smiles on the audience' faces. Overall, the movie was worth a watch and a stress relief."
    },
    {
      "rating": "7",
      "text": "Even though I only remember bits and pieces from the first two films, this movie reminded me of my childhood. The acting, of course, was incredible.The scene where Akmenrah met his parents almost, ALMOST, made me tear up. You could read his emotion on his face - his love for his family, even after having not seen them for years. Robin Williams' final lines were more than a bit touching. The SFX were great, too (the constellation scene had me spellbound), but could have been better. The ending, on the other hand, left a bit to be desired. They had it set up well enough, with Akmenrah choosing to stay in London with his family and the tablet, while the others left back for New York, but I was expecting more of a relationship between Larry and Tilly. I was hoping that Larry would teach Tilly about the magic that was now her job every night; I was hoping he would help her learn how to handle the live dinosaurs and tigers and mammoths and war criminals; I was hoping he would at least warn her about what was going on - the two are kindred spirits now, after all. But no, instead the only thing he tells her is that she'll have the \"best job ever.\" Then it jumps to three years later, which disappointed me because I was eager to see how Tilly would handle her new-found responsibility and how Larry fared after the loss of his night show and if Nick ever went to college or not. This wasn't the only part that left me frustrated either. There were scenes when I felt the camera was focusing on entirely the wrong thing. During the roof scene, I wanted to shout at the screen \"Who cares about the monkey when Akmenrah is crumbling to dust after just having reunited with his family for the first time in decades?!?\" Although, in all fairness, this is a children's movie, and children would rather focus on the monkey. There were also some scenes I felt were a little unnecessary, such as the romance between Teddy and Sacagawea that was thrown in there at the last minute just for good measure (come to think of it, did Sacagawea even do anything in this movie? It seems she was just off to the side the whole time. I wasn't paying attention to it while I was watching, but I don't think this movie even passed the Bechdel Test). The same goes for the monkey-kiss scene in the falling action. Just because the main character didn't have a female love interest doesn't mean you can substitute in a monkey. Even though I had my quarrels with the falling action, the resolution ended on a positive note. The magic wasn't gone. It will never be gone. It just moved somewhere else to allow for new adventures and misadventures. With that said, I feel I should emphasize that this film is for children and families, and some of its shortcomings may be excused because of this. Despite its flaws, I actually enjoyed the movie while I was watching it, and if I didn't appreciate these movies enough as a kid, I certainly do now."
    },
    {
      "rating": "7",
      "text": "The first half of the film could've used more laughs, but Night at the Museum: Secret of the Tomb is a refreshing film full of great characters and humor."
    },
    {
      "rating": "9",
      "text": "Piacevole dal primo minuto fino ai titoli di coda,dopo il \"flop\" del secondo episodio,finalmente un degno finale della trilogia,anche se il migliore resta il primo! Consigliato assolutamente se amate fare due risate in assenza di volgarità.\r P.s. Hugh Jackman anche quando non recita in Wolverine è affascinante ahah"
    },
    {
      "rating": "7",
      "text": "Felt it was time for a fitting ending with the passing of Robin Williams and Mickey Rooney.  They done a good job with the movie wrapping up and it was nice to see all them back together again.  I can say the movie was a little slow at times, but did eventually pick up speed and pace.  The story was OK, but could have been better, still I gave it a 7 just for the fact that it was wrapped up nicely so we could all move on from the series."
    },
    {
      "rating": "3",
      "text": "Ben Stiller,intentando despedir la algo famosa trilogía de Noche en el museo,pretendía dejar huella a lo grande,pero lo único que ha conseguido es presentar un trabajo de lo más chirriante y simplón,que dejará a los espectadores con su deseo de que les devuelvan el dinero invertido en tal disparate.\rEn principio,Ben Stiller se mostraba bastante soso desde la segunda entrega de la saga,y aquí sigue igual,sin aportar nada al espectáculo (más bien consigue construir minuto tras minuto un circo para locos)\rLa película no presenta ningún momento especialmente gracioso,un factor que,a buscadores de comedias familiares,les sentará fatal.\rAunque la historia sigue brillando por su originalidad,algún que otro personaje resulta majo al observarlo,y el cameo de Hugh Jackman haya conseguido sacarme una pequeña sonrisa,estamos ante un producto infantiloide sin chicha que resultará aburrido a las personas que ya muestren exigencias viendo películas.PARA NIÑOS QUE TODAVÍA CONSERVEN SU INGENUIDAD AL VER LARGOMETRAJES."
    },
    {
      "rating": "9",
      "text": "Night at the museum : secret of the tomb is a movie which was released in 2015 in France. It was directed by Shawn Levy and written by Thomas Lennon and Robert Ben Garant. The main character is Ben Stiller who plays the night watchman. There are also character in the story we have seen in the previous films, they are played by good actors : Robin Williams is Theodore Roosevelt, Rami Malek is Ahkmenrah, the pharaon. There are new characters in this film, the parents of Ahkmenrah and Lancelot.\rYou must see this movie because it is funny and it is not very long. There is a good acting. There are fantastic special effects when the characters move. The quality of soundtrack is nice and corresponds to the actions.\rIn my opinion, this story follows the last one. I think this is a movie to share with your family to have a good time. It is interesting because trough the characters, we can learn history much better than in books."
    },
    {
      "rating": "10",
      "text": "My boi theodore looking fineeeeeee\rhe bout to bang that sasquatch ass on the back of his horse yo\rYou never know what comes out at night ( ͡° ͜ʖ ͡°)"
    },
    {
      "rating": "0",
      "text": "This movie sucks in every way. There is no plot what so ever.It is ridiculously immature, and it was a very,very, anticlimactic role for Robin William's. Yay evan he could not save the film. Also it is so bad I did not Finnish it."
    },
    {
      "rating": "5",
      "text": "The Museum is back! Except they're going to London for a new adventure. This adventure is predictable and cheesy, but it's still a fun ride for those fans out there."
    },
    {
      "rating": "1",
      "text": "I love this film franchise but this one movie from it I not good. It wasn't as funny as 1 and 2. I had no interest in it when I saw it. It was a boring movie only one funny part in it as well. If they do make a number 4 I hope it's better otherwise I will just stop watching the franchise. :("
    },
    {
      "rating": "7",
      "text": "Definitely the weakest of trilogy but still fun. I loved going to London and seeing all the new exhibits come to life. sir Lancelot was a treat to watch and was probably one of the best character. we also get a fantastically developed back story to the tablet. This movie takes alot of inspiration for the first. For example back is the party scene at the end we get more of robin Williams as teddy Roosevelt more rexy once again because teddy Roosevelt travels with him to London. The action once again is fun and Hugh jack man makes a hilarious cameo. dick van dyke comes back after being absent in the first movie for a short but worth while scene which adds some back story to the tablet. Speaking of which when there were flashbacks to the tablet the ancient Egypt scene were effective and although they were extras no white washing. Micky roony dick van dyke and bill cobs come back briefly but it was good to see them again. Ricky Jarvais as always does great as Larry daily's sassy boss. What keeps this movie from being great are a couple of things. While not completely gone gone is mostly the smart humor Ben stiller seems more grumpy than in the previous too which i didn't like. Russel Wilson as the night guard lady was OK but not the best. Also any scene with laa was not done very well. I understand he was the comic relief but he was not very good but i see it was defiantly a character geared more toward kids. The father son relationship sub plot was completely under developed and didn't add much to the movie. However even with these flaw the movie still maintained the joy the others brought in a fantastic last performance from Robin Williams and mickey roony keeps this movie as one of the weakest yet still enjoyable and a surprisingly satisfying ending to the trilogy films"
    },
    {
      "rating": "6",
      "text": "Night at the Museum III doesn't really work with the two originals, being very obvious, not-much-funny, almost free of real tension, unremarkable characters and not much inventive story-telling. We gotta add that it's some kind of boring and even illogical."
    }
  ],
  "recommendations": [
    "night_at_the_museum_battle_of_the_smithsonian",
    "ghostbusters_ii",
    "hotel_transylvania_2",
    "jumanji_the_next_level",
    "despicable_me_2",
    "jumanji_welcome_to_the_jungle",
    "night_at_the_museum",
    "minions",
    "penguins_of_madagascar",
    "shazam",
    "deadpool_2",
    "the_hangover_part_iii",
    "thor_ragnarok",
    "little_fockers",
    "pirates_of_the_caribbean_dead_men_tell_no_tales",
    "my_spy",
    "goosebumps",
    "the_mummy_returns",
    "shazam_fury_of_the_gods",
    "hancock",
    "incredibles_2",
    "venom_let_there_be_carnage",
    "spies_in_disguise",
    "pirates_of_the_caribbean_on_stranger_tides",
    "coming_2_america"
  ]
}