{
  "id": 1518,
  "title": "Night at the Museum: Battle of the Smithsonian",
  "starring": [
    "Ben Stiller",
    "Amy Adams"
  ],
  "runtime": 105,
  "genre": [
    "Adventure",
    "Fantasy",
    "Action",
    "Comedy",
    "Family"
  ],
  "description": "Hapless museum night watchman Larry Daley must help his living, breathing exhibit friends out of a pickle now that they've been transferred to the archives at the Smithsonian Institution. Larry's (mis)adventures this time include close encounters with Amelia Earhart, Abe Lincoln and Ivan the Terrible.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/l9yAQn6TyrA3gv5xZZkiMMoZsiw.jpg",
  "categories": {
    "plot": 5.466666666666667,
    "acting": 5.2,
    "ending": 5.857142857142857,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.416666666666667,
    "funny": 4.642857142857143,
    "action": 6.75
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Lighten up people, It's meant to be a fun movie. That's just what people don't understand. Some movies are fun and not meant to be taken seriously."
    },
    {
      "rating": "10",
      "text": "A much better movie than its predecessor that brings all the great stuff from the first and adds even more! With an even better story than the last one, it's going to be hard to go back to the original after viewing this!"
    },
    {
      "rating": "4",
      "text": "Yes, any movie critic who can think deeply than others would understand \"Night at the Museum 2\" was a (obviously) unecessary sequel."
    },
    {
      "rating": "7",
      "text": "I found it more fun than the original. Yes, it's preposterous, but at the same time, very amusing. Amy Adams and Hank Azaria are great, and the scene between Johan Hill and Ben Stiller is a comic highlight. Gets a little too silly towards the end, and never really coalesces as a whole, but still, I was entertained."
    },
    {
      "rating": "7",
      "text": "I thought it was better then the first one and the \"second base\" joke was hilarious."
    },
    {
      "rating": "9",
      "text": "I enjoyed the last movie very much, I am sure this one is the same!! FUNNY!!!"
    },
    {
      "rating": "9",
      "text": "Funny, completely entertaining, worth the price of admission. Can't ait to own it on DVD. Ebert, time for you to pack it in!"
    },
    {
      "rating": "9",
      "text": "Thoroughly enjoyable for an 18 year old, a 21 year old, and her parents."
    },
    {
      "rating": "8",
      "text": "Much better than the first one, wittier and even more charming. Every single performance was a gem!"
    },
    {
      "rating": "7",
      "text": "Did nobody notice the editing problem? Custer started off out in the warehouse. Then, he was locked inside the crate with the money and the tablet BEFORE the sun went down. Then, he was rescuing Larry Daley with the motor cycle and side car. Then, he was locked inside the crate again."
    },
    {
      "rating": "10",
      "text": "I loved the special effects and the comedy was very funny. I am 15 and i enjoyed it very much."
    },
    {
      "rating": "8",
      "text": "I really liked the first movie, but I felt this one had a serious lack of central plot. The Earhart character was brilliant, as were several of the new comers, but I didn't feel the same connection I felt with the first movie(dead beat dad trying to redeem himself in his son's eyes) If you've seen the first movie, you owe it to yourself to watch this one, as one definite saving grace is there's what I felt was a better closure for the museum characters than in the first film. Go see this film, but don't expect it to be better than the first."
    },
    {
      "rating": "5",
      "text": "While not a terrible film, Night at the Museum 2 isn't as good as the original, as some much of it is wasted. Major plot points collapse with no real meaning, acting talent is wasted, and there are very few good jokes. Not the worst film ever, but it's hardly a nominee for best film ever either. South of average."
    },
    {
      "rating": "9",
      "text": "Not as good as the original because of the fact Robin Williams barely appeared in the movie. Despite that, everything else was great, especially Hank Azaria."
    },
    {
      "rating": "7",
      "text": "Not bad but quite good as well. Ben Stiller acted pretty well for the movie in my opinion."
    },
    {
      "rating": "1",
      "text": "Sometimes I wonder why I bothered watching this film again. You cannot possibly take this film seriously because this is not supposed to be serious. But neither was it fun. In fact, I don't think it had any redeeming features. There's not actually many funny jokes and as much as it tried, nothing seemed to make this look good. Stiller's performance is just forgettable - he doesn't do anything interesting - and Azaria's performance was the only mildly entertaining thing on screen despite the range of colourful historical characters available, who I don't think even did anything as I recall. The second time I watched it, I barely kept my eyes on the screen and thought about what else I could be doing instead of this. Seems like a pretty childish waste of effort."
    },
    {
      "rating": "0",
      "text": "Even for Ben Stiller this is a total embarrassment. Why the hell would you want to be part of this idiotic film. Also shame on Amy Adams for completely lowering her standards for films. The movie made me sick to my stomach."
    },
    {
      "rating": "3",
      "text": "The movie was no way nearly as good as the first one, this seems to generally be the case for sequels. Special effects where really good. The movie had some funny scenes. The movies special effects carry it all the way to the end. I wouldn't see it again."
    },
    {
      "rating": "2",
      "text": "my children and i really enjoyed the first \"museum\" movie but this one is not worth the price of a ticket. It does have a few funny parts in it but the story is stupid and the movie is a sleeper. I would not even recommend renting this. Just a big waste of a nice Saturday."
    },
    {
      "rating": "0",
      "text": "This movie is so awful! Boring, same story as the first one, way to long and not funny at all. If you can tell a movie is going to be bad 15 minutes in that is not a good sign. I wish I would have slept, like everyone else in my group did."
    },
    {
      "rating": "5",
      "text": "Disappointing, at the very start you can notice it doesn't has anything to do with the first one, You have at the end of de 1st a Stiller that loves his work and realizes that he has found what he was meant to do in life, and also he seems very happy about it. At the star of this one you realize the whole message of the 1st movie was a lie, Larry left his beloved wax friends for what he was supposed to had forgotten and not over.valued at the end of 1st... Very crappy film. Anyways it entertains, has awesome effects and jokes, hilarious at some pint. But then they abused of the Psy-Theraphy he had with Atila at the 1st, but in this one, he does it again n again n again, with every character he founds."
    },
    {
      "rating": "3",
      "text": "Because of the times, General Custer(Bill Hader) was far from being a friend of the Native Americans, but \"Night at the Museum: Battle of the Smithsonian\" subtly paints the cavalry commander during the Indian Wars as a Kevin Costner-type soldier straight out of \"Dances with Wolves\". When Custer tries to nail down the correct pronunciation for the name \"Sacajawea\"(Mizuo Peck), their benign alliance works like a response to the scene in the Costner-directed film where Kicking Bird(Graham Greene) mispronounces Dunbar as \"dumb bear\". While Custer's supporters allege that Arthur Penn's \"Little Big Man\" was a malicious and wrongheaded hatchet job on their man, whom they consider a hero, the Battle of the Smithsonian, in which Custer commandeers, is presented by the filmmaker as the general's chance at redemption, a scenario that some conservative ideologue like the late John Wayne would have certainly approved of. The second chance this new war affords him, in a sense, advocates genocide, because it forces the viewer to revisit the Battle of Little Big Horn as a squandered opportunity to spill more indigenous blood. Before he leads the charge against Kahmunrah(Hank Azaria), Custer waxes nostalgic about how poorly he performed at his last campaign. Contrary to the film's rhetoric, Kahmunrah is not a villain; he and his Egyptian cohorts are only defending their home, the Smithsonian Museum, against foreign invaders. Sound familiar?"
    },
    {
      "rating": "6",
      "text": "Admittedly going in anticipating a clunker the first 25 minutes were painful to sit through from the artificial dialogue, extremely lame spy caper segments, and some awkwardly long amateurish humor (see Stiller's confrontation with a museum guard). Appreciatively, once Stiller gets into the museum (starting with opening the octopus crate) the movie starts to settle into something resembling the first movie. I.e. A movie based on a series of nonsensical special effects and action set pieces paired with innumerable gaps in storyline and reality that surprisingly still has the ability to provide some entertainment. So, if you liked the first... then its conceivable you'll enjoy this one. Just don't over analyze things like... why, ironically, does neither museum have any night guards?"
    },
    {
      "rating": "2",
      "text": "I can't believe I shelled out $11 for this horrible film. I waited and waited for something funny to laugh at, but it never happened. The only funny moment was when Hank Azaria approached Darth Vader and that was shown in all the trailers so I already knew that was coming. Some of the special effects were good so I'm rating it a 2, otherwise it is worthless."
    },
    {
      "rating": "5",
      "text": "NatM: BotS is sort of a hodge-podge of CGI, historical references and comic vignettes stewed together and set to a screaming soundtrack and overwhelming Foley editing. Basically the result is exactly what you expect if you had a massive budget budget and no overriding storytelling goal. There are a few good bits and everything that's been said about Amy Adams is true. Wait for it on cable."
    },
    {
      "rating": "2",
      "text": "Rarely funny and never suspenseful. The script seemed like an afterthought. Ben Stiller needs to be careful. He is becoming associated with an alarming number of bad movies."
    },
    {
      "rating": "2",
      "text": "A lot sillier than the first. Hank Azaria does a good Boris Karloff accent, but that's IT. The stench of Money-Making Sequel hangs heavy."
    },
    {
      "rating": "6",
      "text": "It may seem like an unnecessary sequel, but it is still fun. It is bigger because of being at the Smithsonian museum area, which has a lot more that comes to life."
    },
    {
      "rating": "4",
      "text": "Almost so bad its good but this second film is incredibly stupid and not nearly as funny."
    },
    {
      "rating": "7",
      "text": "Better than the original. The movie decides to utilize even more effectively what made its predecessor so entertaining - exaggerated, caricatured, amusingly overblown characters that don't take themselves seriously in the slightest."
    },
    {
      "rating": "4",
      "text": "I am sorry, I just don't think is a fun movie. I am not expecting a marvellous comedy, but I just don't see anything here that makes me enjoy it. Not even the performances...for couldn't even finish watching it. Good for those who enjoy it, I am happy for them, but I am not one of them...am I charitable if I give this movie a 4? ...well, but I think it may be a 4, and perhaps even a 3..."
    },
    {
      "rating": "5",
      "text": "To call this movie stupid is an understatement, but there is still enough wit to it to keep it going. There are several characters that are truly enjoyable, but the poor effects and childish script hinder it."
    },
    {
      "rating": "4",
      "text": "I really disliked this sequel. \"Night at the Museum: Battle of the Smithsonian\" is a really silly way to make a sequel. It's plot is lame, dull and predictable. Also, we know that the objects turn to life at night and we know that they turn to stone in the day. We don't need to be told a million times."
    },
    {
      "rating": "4",
      "text": "It was funny in places but this sequel could not live up to its predecessor and like so many films before it will struggle on that basis alone. It is meant to be a family/children's film so I can't be too harsh on it. I am sure children will find it funny."
    },
    {
      "rating": "6",
      "text": "This movie seems almost like his previous part."
    },
    {
      "rating": "6",
      "text": "Kind of rehashing the first movie. Luckily they do add allot of new ideas to the mix too.\r Stiller is a bit better this time round. I'm guessing he learned what did and didn't work from the last film. Hank Azaria is just marvelous, almost cartoony, and seriously steals the show.\r Effects improved a little from the last movie. Plot is a bit lame this time round. The whole supernatural bit kinda took the magic and mystery away a bit. Luckily it is only a very small scene that is over just as quickly as it began.\r Overall:\rNight at the Museum 2 is an OKish sequel that is spoiled a bit by all the needless rehashed elements from the first movie. A shame they did put more focus on the newer elements.\ri.e. It's a whole new museum, why on earth did they need to include most of the characters from the first movie. Stiller was enough to link the two"
    },
    {
      "rating": "5",
      "text": "Similar to the first one, but just a step worse.  Unlike the first film some of the new characters didn't work for me.  That being said still a decent watch."
    },
    {
      "rating": "4",
      "text": "I actually enjoyed the first \"Night at the Museum\" movie. But after watching this one, I now know for sure that there won't be a third one. The storyline may be o.k., but when you got bad characters such as Amelia Airhart (Amy Adams) and Kamunrah (Hank Azaria), it really bums you interests on the movie. It did have it's funny moments, like the Jonah Hill and Ben Stiller scene, but most of the time, the humor was just stale and weak. I can't that this movie was just terrible, but it really wasn't good either. Overall, it's just a boring sequel."
    },
    {
      "rating": "4",
      "text": "Quite common to see writers squeeze as much as they can into the sequel, resulting in an over-the-top mess, that fills up the box with ideas and historical references. The jokes are more corny, the acting is stale and lifeless, and the plot becomes more convoluted than the predecessor. I would only recommend this to someone maybe five-seven years old, or a man with the mind of a five or seven year old."
    },
    {
      "rating": "4",
      "text": "Amy Adams puts on a rather good performance as Amelia Earhart, but that's about as far as this movie goes. The scenes and premise are pretty stupid in the sequel."
    },
    {
      "rating": "3",
      "text": "Night at the Museum gets sleepy.\rThe movie picks up nicely where the last let off. The new characters are surprisingly successful, and the story is okay. The movie then gets slothfully sloppy at the end at its struggles to piece together a resolution. Many very fixable plot holes erupt and the entire film nearly unravels."
    },
    {
      "rating": "10",
      "text": "I was shocked seeing the ratings of this movie, Whats wrong with people these days? This movie is awesome cause It's FUN, I guess most people have forgotten what fun is,movies are made to entertain us;to make us happy,not to put us in a gloomy mood for the rest of the day.So'll I say this,ignore these people and go watch this extremely FUN movie."
    },
    {
      "rating": "5",
      "text": "This is a fun movie, less cinematic than the first one, but more ridiculous and on a much bigger scale of \"adventure\". I had fun watching it, but I'll admit, it's more of a kids movie and has no basic point other than wanting to entertain you."
    },
    {
      "rating": "5",
      "text": "The absolute adventurousness is starting to wear off with Battle of the Smithsonian. With Battle of the Smithsonian, it just makes the adventure look incredibly slow."
    },
    {
      "rating": "9",
      "text": "A movie that beats it's predecessor. It takes everything that makes the first so great and makes it even better. More of the fantastic humor and sometimes it's even better humor than the first and new comer hank azaria brings a charming yet deliciously fun evil role to the pharaoh. Some new comers who also shine are Amy Adams as amilia earheart. The one thing i didn't like is robin Williams did not get as much screen time as i would have liked him too same goes with mizuo peck as Sacajawea. Other than that this film was a great fun and was surprised about how good it was especially at number 2."
    },
    {
      "rating": "6",
      "text": "No logra transmitir lo que si la primera peli, pero al menos tiene conceptos nuevos."
    },
    {
      "rating": "8",
      "text": "I enjoyed this more than the original. The characters are more likable now, they have more jokes now. It had improved a lot and it is well worth it to watch it."
    },
    {
      "rating": "7",
      "text": "This film is the sequel to \"The Night at the Museum\" and it happens time after the action of this film. Larry is now a successful man but is surprised by the renovation of the Natural History Museum, where he worked and made friendship with all the creatures and historical figures who are statues during the day and come alive at night. Thus, he will try to prevent his friends from spending the rest of their existence in crates at the Smithsonian Museum, Washington DC. Although it no longer has the novelty impact the first film had, this sequel honoured, most of the time, the previous film. It's humor explores well the way Larry seems to be in permanent disagreement with his new way of life as a businessman, though he cannot see it. The comedy and jokes follow, roughly, the model previously established but they still can be funny enough. The script gives great emphasis to Amelia Earhart, portrayed as fearless and adventurous, but the bad side of that is the great romantic interest between her and Larry, an involvement whose outcome, although romantic and moving, was very predictable and gives us the will to shout \"what's the point?\" Ben Stiller remains impeccable as the protagonist and the supporting cast makes an excellent performance, keeping some of the previous names (Robin Williams, Owen Wilson and Steve Coogan) along with the villain, Hank Azaria, maybe one of the best voice actors of our time. So this is a rare case where sequel was able to honor the previous movie and gives us good entertainment."
    },
    {
      "rating": "3",
      "text": "A really bland and silly sequel to its pretty enjoyable predecessor. Its filled to the brim with lame, dull jokes and a surprisingly boring plot."
    },
    {
      "rating": "7",
      "text": "I found the plot a little confusing in this movie, though it is definitely an entertaining movie but the story wasn't as solid as the original movie. Of course the novelty of the original movie has worn off because this is a sequel and so we already know that the exhibits come to life at night and so on but moreso I found the story a bit confusing. It definitely seemed more like a sequel made to cash in rather than it being a particularly strong movie in terms of plot and even character development, although there are some exceptions. I thought that the character of the evil Kahmunrah was quite good, being slightly camp and not quite what you'd expect, not in a sexual way of course but in a silly way that would make kids laugh im sure. Also Sacajawea returns as the clearly infinitely wiser native American woman who rolls her eyes at the 'evil plans' Kahmunra has, easily pointing out the clear flaw in his plan (of course us women are inifinitely wiser than men, right? lol).What I really liked was that there was some new creative ideas used, not as many as I'd hoped but the one I remember that I thought was clever and enjoyed was a scene whereby Larry and Emilia are in a room full of paintings and the paintings come to life. There's a painting of people skating on an icy lake and you can see them skating and moving apart and then Larry and Emilia end up going into a painting, a photo like painting of celebrations in Time Square at the end of a war (the great war? I don't remember). I thought that was quite creative and interesting, so I enjoyed that scene. There are other fun scenes too, I also enjoyed the part where Larry ends up having to fly this small toy plane and they end up flying outside the institute building at night, which was quite a pretty shot. The dialogue is amusing and fun and it is watchable enough, although I did feel that the story let itself down, so to speak. Of course the movie is made primarily for kids and I have no doubt that children would still enjoy the movie, I also think that its entertaining enough for parents to enjoy some of it so they can watch it once and not be absolutely bored stiff but its not a movie I'd want to watch again. I didn't think it was particularly believable, I mean of course the idea of exhibits coming to life isn't very realistic but I don't mean that, I mean the idea that this previously down on his luck, a bit of a loser night guard has somehow become some successful hot shot businessman in the few years between the first movie and this one and that he'd be able to suddenly jump back into action and be able to access the newly moved exhibits and everything, eh, it just seemed a little too convenient and silly, I mean of course the movie had to work that way and kids likely won't think twice but there was something about the story that felt a bit flat to me, personally, which is a shame because perhaps if they hadn't rushed to write and shoot the sequel (I believe after they saw what a success the original movie was, they did rush to come up with the sequel as soon as they could, which isn't a surprise) it might have received a better reception from older viewing audiences. Of course these movies are made primarily for children though, like I say and so I can't really judge it too harshly because as a kids movie, its certainly not bad. I did hope there'd be more monkey scenes though, for those of us who have seen the first movie you'll remember the face slapping scene(s) which most people enjoyed and there is a similar one in this movie but there isn't all that much of the movie with the monkey featured, which is perhaps a shame since I liked the monkey - lol.If you've seen the first movie and your kids really enjoyed it and want to be entertained then yes, I'd recommend the movie. Don't expect it to be as great as the original movie but of course thats often the case with sequels, their not as fresh and exciting and the stories often aren't as solid as the original movies and that applies to this movie but thats not to say that its a very poor movie either. I felt that it was an enjoyable movie, some dialogue is amusing and there are at least a couple of scenes that stand out that I enjoyed, kids should enjoy it enough to keep them quiet for the hour and 40 odd minutes it lasts but don't expect too much of it and remember it is primarily a kids movie, so I feel I'd be a bit harsh to give it a low rating and I did enjoy some of the scenes, even though I feel underwhelmed by the script, as a kids movie its good enough, so I'm giving it four stars. Judge for yourself based on what I said whether you reckon this is for you and your kids if applicable or not."
    }
  ]
}