{"id": 2011, "title": "Nine Days", "starring": ["Winston Duke", "Zazie Beetz"], "runtime": 124, "genre": ["Drama", "Fantasy"], "description": "A reclusive man conducts a series of interviews with human souls for a chance to be born.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/kl8J3WvzJq6QGX7qNmP0ps4ZTSO.jpg", "categories": {"plot": 5.857142857142857, "acting": 7.25, "ending": 6.8, "soundtrack": 9.0, "cinematography": 9.5, "familyFriendly": 3.0, "funny": 9.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "What does it mean to be alive? What if before being born, we had to interview for the position? While not the first time that a film asks existential questions like what it means to be human, “Nine Days,” Edson Oda’s feature-film debut, they are asked again, yet still in a different way. What if we already knew about the world, and already had our preconceived notions about how the world is, and what can be done about it better or differently?The film starts pretty emptily, starting with Will (Winston Duke) watching different people’s lives, filmed in first person. Watching all of the screens, every day, taking notes. And it is revealed that Will is not just watching these tapes for fun, but he is closely monitoring the lives of those previously selected to live. Other than applicants when one life ends and needs to be filled, Will is joined by his friend, and previous applicant, Kyo (Benedict Wong). Kyo helps assist Will around the house and with the different tasks given to applicants.Kyo will often pop into different interviewers’ homes and likes to indulge in their selections’ lives. One that interests both, and that Will develops quite an attachment to, a violin prodigy known as Amanda. When they gather to enjoy her latest concerto, she dies unexpectedly and thus begins the search for her replacement.Among the applicants for the empty slot, we have the care-free Alex (Tony Hale), the artistic Michael (David Rysdahl), the romantic Maria (Arianna Ortiz), the pessimistic Kane (Bill Skarsgård, and lastly the free-spirited Emma (Zazie Beetz). And as the title suggests, they each will have nine days to prove why they should be chosen to move on from this pre-existence life, and on to the real world as a newborn child. All five of the applicants have their interviews carried out at Will’s home in the desert, with only the natural landscape of whatever state of being they exist in.What is amazing about this film is that nothing is ever really explained more than it needs to be. In something like Pixar’s “Soul,” there is quite a bit of explaining to the world and process of selection. In “Nine Days” however, it’s thrown at the audience much more forward. Albeit, both films are very different in both their approach and target audience. So it is to be understood the difference between the two. Instead of focusing on the different aspects of how the final choice will be made, we focus instead on the characters and their worldview. Whether you view everything in life as a cynic, or maybe through a religious lens, or whatever it might be. There’s room for everything.Most of Will’s questions have this very existential filter on them, that he uses for picking the soul to continue. Many hypothetical situations, and often very heavy. Because that can be when people will show their true natures. In one of the situations, Will shows the applicants a showdown between a current human Fernando, and how he became to be paralyzed. Varied responses come, such as saying they would have fought back without hesitation. Others, making a joke out of the situation, and laugh it off as being too heavy.And throughout this nine-day free trial, some applicants do get eliminated. But before doing so, they get to pick one moment they would like to experience before ceasing existence. Moments that might be taken for granted. Walking along the beach, feeling the sand between your toes. The feeling of waves crashing around your feet. Or even riding your bike down an empty street, feeling the wind through your hair and watching the people and the cars and the buildings fly by you as you pass them.“Nine Days,” through all of asking what it means to be alive, takes the time to celebrate what you receive from existence. All of these small moments add to a larger interpretation of what life is. But we don’t just get exposed to the beauties of life, but to the cruelties that come along. The endless bullying of a child, or the death of a prodigy with a loving family. Winston Duke even describes his downsides. How he had loved the act of performing. How that was the one thing that made him feel alive. But he never pursued that feeling, instead going through the motions of life and never amounting to the person that he wanted to be and knew that he could have been.Other characters like Tony Hale, Bill Skarsgård, and Zazie Beetz, all help to highlight the different aspects of humanity. Giving very thoughtful, and real performances. They lift the film from a high fantasy about natural selection into a deeper drama with passion and heart. The film has visually impressive cinematography (Wyatt Garfield), and the music (Antonio Pinto) is very lovely with a lovely and grounded orchestral theme."}, {"rating": "8", "text": "Adequately expressing the expansive nature of existence in all its various permutations is far from an easy feat in any artistic milieu. But director Edson Oda has done a more than commendable job in his debut feature about an other-dimensional case worker who spends nine days interviewing aspirants to fill a vacancy that's become open in physical reality. It's an experience that tests the character of the candidates, as well as that of the interviewer himself, a once-incarnate being who has mixed feelings about his corporeal existence (and has no apparent desire to return to it). The narrative thus provides viewers with a metaphysical tango in which facilitator and students end up becoming mirrors of one another and where they unwittingly switch roles in teaching and learning life lessons, no matter what reality those instructions may ultimately be applied to. While the narrative is occasionally a little too elusive for its own good, all is gradually and eventually revealed, making for an exceedingly thought-provoking cinematic and philosophical experience. The picture's minimalist but inventive production design, innovative editing and fine performances (particularly those of Independent Spirit Award nominee Benedict Wong and protagonist Winston Duke, who reveals acting chops most viewers probably never realized he possessed) combine for an intriguing and insightful tale, one that will have audience members talking about at length afterward. This little-known indie gem is a must-see for those who appreciate cinema that's both entertaining and enlightening and who like to leave the theater with something to ponder long after the flickering on the screen stops."}, {"rating": "8", "text": "I'm not sure I understand half of \"Nine Days\".  But the half I did understand is deeply moving.  And it is fully beautiful.  If you appreciate tales of struggle, redemption, and transcendence, you'll like this film.  Maybe love it.One could argue that the pacing is a little slow.  Its rich setting and setup engages you, but it gets a slow in the middle.  If you stick with it, the final third flies by.Unlike a lot of \"artsy\" films where I'm lost and content to stay lost, the half that remains unclear to me draws me to watch the film again.  I will be rewarded, I might even be better."}, {"rating": "10", "text": "I am not sure I ever gave a movie a \"10\" before.  But when a movie leaves you wanting more, inspired to write a creative story such as this, and go search who Edson Oda is and what else he has done, then you got to give the props where due.  I would not want to give anything away because the unraveling of this movie package is what makes this movie so special.  The stars, Winston Duke and Zazie Beetz have been bit actors up to now, and when they were given the baton to run, they took off like they had a a jet fuel pack strapped to their backs.  I hope the screenplay, the director and these actors get Oscar consideration.  Please see this in any format you can, because it is so worth seeing."}, {"rating": "3", "text": "Winston Duke’s character is a sort of cross between the stork and a guardian angel. He sits in a craftsman house in the desert, watching the people he “birthed” on old TVs, while recording momentous events on VHS (the retro tech is never explained). When one of his charges dies unexpectedly, 5 new entities (unborn souls?) must interview to become a human. Duke heads a cast of actors who stretch their dramatic talents with involving performances, including Tony Hale, Zazie Beetz and Bill Skarsgård. This is one of those tedious, pretentious experiments that may appeal to people who like esoteric, poetic musings on life. For the rest of us, the pace is deadly and there isn’t really a story, just a string of mind games disguised as tests (and dramatic opportunities for the actors). First time writer/director Edson Oda presents a unique vision and a promising point of view, but not one that will appeal to many mainstream moviegoers."}, {"rating": "6", "text": "Nine Days has quite an ambitious concept. It's actually really ambitious. Yet its director didn't do much with it beyond the clear philosophical and to some extent religious implications.Its own introspection provokes questions that will inevitably go unanswered because the script's approach is clearly designed to function within the confines of what this story portrays.That clearly puts a limit to what it can do and where else it could go, for the simple reason that its theme inevitably falls because of that.I give credit to this film for what it explores and because it does it better than I thought it would. But there's also a lot that remains undeveloped here."}, {"rating": "0", "text": "Slow and boring, The movie tries so hard to get me attached yet I can't recall most of the characters names nor do I connect with them. Will tries to find the person with the best traits for life as if we are born with a personality and stuck with it, the movie implies we are who we are because we are born that way, I disagree! If I was born and raised in different conditions I would never be the same person, because my experiences shaped me and they continue to do that every moment of my life. the group of people he was \"testing\" already had a personality and reacted the way they did because they had experiences, they had lived. But the movie limited this to the girl at the end (Emma) as if she was the unique one and all the rest were generic. Good acting, music, visuals but the story and the ideas and the lines are just bad."}, {"rating": "10", "text": "A movie this well-crafted, thoughtful, and sad comes along once in a while. Add superb acting and luminous cinematography and you have a film you'll want to share with the friends you love the most, and no doubt see again with more friends and your favorite lovers. If it doesn't make you cry you're pretty tough."}, {"rating": "3", "text": "For me it was boring. I know it sends a message and is more philosophical and wants to express it in a different way and while I understood the idea it tries to bring, I found it boring for me. Just not my taste - if you like such movies, then maybe it would be for you, not for me though"}, {"rating": "10", "text": "This beautiful and devastating film will change how you look at life. A must watch."}], "recommendations": ["nomadland", "the_tree_of_life", "a_hidden_life", "leave_no_trace", "donnie_darko", "personal_shopper", "the_boy_who_harnessed_the_wind", "the_florida_project", "into_the_wild", "silence", "20th_century_women", "the_lost_city_of_z", "melancholia", "ingrid_goes_west", "a_ghost_story", "snowden", "her", "searching", "sweat", "the_hate_u_give", "disobedience", "the_road", "the_way_back", "flashback", "first_man"]}