{"id": 3804, "title": "Nine Lives", "starring": ["Kevin Spacey", "Jennifer Garner"], "runtime": 87, "genre": ["Fantasy", "Comedy", "Family"], "description": "A stuffy businessman finds himself trapped inside the body of his family's cat.", "releaseYear": "2016", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/i457G22lL9t2yhEFdYz5Nd1M5DV.jpg", "categories": {"plot": 4.833333333333333, "acting": 7.5, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "Some of the stories were impacting and certainly well-acted, but the film as a whole didn't hold together."}, {"rating": "8", "text": "Robin Wright Penn's scene took my breath away."}, {"rating": "9", "text": "An exceptional, subtle film. It's an adult version of \"Crash.\" Whereas \"Crash\" is mawkish, manipulative, ham-handed and insultingly implausible, \"Nine Lives\" exudes reality and humanity. It compliments the viewer by gently implying its most powerful messages, especially in the final scene. Glenn Close isn't visiting her husband's grave, as nearly every media reviewer seems to believe."}, {"rating": "7", "text": "The two stories featuring Robin Wright Penn and Kathy Baker were exceptional."}, {"rating": "10", "text": "Remarkable and moving."}, {"rating": "9", "text": "This movie was thought-provoking and well worth the time and money to see it. I was especially touched by its illustration of how we are surrounded by people going about their lives--and we may have no clue as to what burdens they are carrying with them. Excellent acting all around. The film is unconventional, and that is a compliment."}, {"rating": "6", "text": "It's nice to see a movie shot like like a play -- each vignette is one continuous shot. But in this play the damaged female characters seem to be living in a play, some other play that we're not privy to. In 2006 a film of distant, unaccountable dreamworlds is not a vision, it's claustrophobia."}, {"rating": "2", "text": "This film had quality moments, but they were all disjointed. There was no continuity or relevance between segments and none of them really made a point. Consequently it was excruciatingly boring."}, {"rating": "1", "text": "Terrible! what was the point of this? the last story was the worst. i thought it was alright, thinking that everything was going to be connected in the end but no! nothing! terrible movie. I watched it because the other user comments made it seem like anyone who likes art movies would like it, but i love art movies and this sucked!"}, {"rating": "5", "text": "Average. While certain stories stand out - Robin Wright at the supermarket and Glenn Close at the cemetary - most are rather boring. I thought the nine different stories should have been more connected and weaved together. I don't expect 'Crash' or 'Pulp Fiction' but this movie seemed rather disjointed. The cinematography (each vignette is one long, continuous shot) is extraordianry, though."}, {"rating": "9", "text": "Lovely, touching and profound."}, {"rating": "10", "text": "This movie was one of the best of the year. It deserves to be nominated for numerous film awards throughout the year. SAG nominee for Outstanding Performance by a Cast in a Motion Picture for Kathy Baker, Amy Brenneman, Elpidia Carrillo, Glenn Close, Stephen Dillane, Dakota Fanning, Lisa Gay Hamilton, Holly Hunter, Robin Wright Penn, and Sissy Spacek and an Oscar for Dakota Fanning!!"}, {"rating": "2", "text": "pointless. you must be an art movie fanatic to enjoy this one..."}], "recommendations": ["the_devil_all_the_time", "cinderella_man", "rush", "magnolia", "gladiator", "legend", "changeling", "the_place_beyond_the_pines", "the_green_mile", "raging_bull", "mystic_river", "creed", "rocky", "the_fighter", "alexander", "the_assassination_of_jesse_james_by_the_coward_robert_ford", "nocturnal_animals", "troy", "atonement", "the_irishman", "joker", "true_grit", "braveheart", "the_shawshank_redemption", "the_godfather_part_iii"]}