{
  "id": 115,
  "title": "Ninja Assassin",
  "starring": [
    "Rain",
    "Naomie Harris"
  ],
  "runtime": 99,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Ninja Assassin follows Raizo, one of the deadliest assassins in the world. Taken from the streets as a child, he was transformed into a trained killer by the Ozunu Clan, a secret society whose very existence is considered a myth. But haunted by the merciless execution of his friend by the Clan, Raizo breaks free from them and vanishes. Now he waits, preparing to exact his revenge.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ipJ4mgqse6uoTRsDyU3TXmva1rt.jpg",
  "categories": {
    "plot": 6.794117647058823,
    "acting": 5.571428571428571,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I am amazed at how unimformed and out of touch the critics in America are. This movie Starred an actor named Rain (Jung Jihoon) who is an actor/model/R&B singer who practices martial arts as a hobby (even though he rivals Bruce Lee and Jackie Chan). Ninja Assassin Tells exactly how deadly Ninjas truly are and lets us see inside the world that many of us are unfamiliar with and which takes us out of our America safety zone. Yet in the midst of it, it shares a love story unlike the lovers in The King and I. Mika, though interesting as a journalist, is played beautifully by Naomi Harris. The story leaves us suspenseful and wanting more. When the movie ended, I heard applause everywhere. I am beginning to see that if critics hate a movie, it mut be good!"
    },
    {
      "rating": "9",
      "text": "This movie is hilarious.  Pure camp action.  The Plot is supposed to suck because it is completely Tongue in Cheek and over the top.  I would give it a 10, if they kept the pace consistent to the crescendo. . . but it's near perfect for what they were trying to do. . .  Kick ass and have a fun romp at the same time!"
    },
    {
      "rating": "10",
      "text": "let's be real you don't go to watch a movie titled ninja assassin for an in depth plot.  you go to see the martial arts ninja action and it delivers in satisfying over the top action sequences coupled with excellent fight scenes.  would anyone watch a movie titled Debbie does Dallas expecting some great story to emerge? no"
    },
    {
      "rating": "10",
      "text": "It gives what I've expected. Great fight scene, great choreography. Would like to see a sequel."
    },
    {
      "rating": "10",
      "text": "The title says it all!!!! There is no better ninja movie that has come out in the last 10 years, so leave the ladies at home grab some pops with the boys and enjoy 1.5 or of merciless slicing and dicing"
    },
    {
      "rating": "9",
      "text": "I loved the story line. It may be gory and really AHHH! like, but I think the story line is much better than some other action films. Although there were many things that were so fake...like how Raizo was like totally attacked by 30 ninjas and survived, it was a really good movie. BE WARNED! A LOT OF GORY ACTION! And people around the age of 30 might not like it! HAHA."
    },
    {
      "rating": "8",
      "text": "It should be noted that this is a bad movie, but that is the point. Being a bad movie makes this movie no less awesome; watching this movie is just like watching a train wreck. That said, I had fun; it is an amazingly awesome blood bath, where every persons blood pressure must be through the roof and a character can lose a half gallon of blood before succumbing to anemia. If you want to see a 90 min cut scene for Ninja Gaiden, then this movie is for you."
    },
    {
      "rating": "8",
      "text": "Excellent karate chop movie. If you are into this kind of movie, then you should have already seen it. Worth the price of admission just for the cgi bodily dismemberment (wish there had been even more) and why did they even try to have a story...I mean c'mon!"
    },
    {
      "rating": "8",
      "text": "Rating this moving on any cinematic scale is absolutely absurd and doing so is simply failure to understand what one has just watched. Ninja Assassin is a vehicle for 80"
    },
    {
      "rating": "6",
      "text": "Definitely not the best movie, the plot was pretty stale...But it has to be checked out if you have any ounce of testosterone in you body. The fight scenes where too cool! Kinda funny knowing the star (Rain), is a Korean/Japanese pop star!!"
    },
    {
      "rating": "10",
      "text": "Loved, loved, loved it. No plot holes, tons of action."
    },
    {
      "rating": "10",
      "text": "Look, please stop looking for the English Patient level of film,character and plot development in a movie called \"Ninja Assassin\". The movie was terrific for its genre, and ushered in a new action star. Something sorely needed. While I understand the plot wasnt the greatest. The action sure was, and the ending was ridiculously aggressive. Rain is the Next Bruce, (Other Asian Action Stars, please hand over the RAIN's ) Pun intended."
    },
    {
      "rating": "10",
      "text": "You get more than you expect. The story and script writing is good. The acting is intense, and believable (Rain is captivating on screen). There is humor. Raizo's story is told through well-paced flashbacks that intersperse the action in a way that leaves you emotionally invested in his character. And of course, the fight scenes are beautifully choreographed, and the hero is a demon incarnate! I was gripped throughout the whole movie, and thought it went by really fast. Loved it."
    },
    {
      "rating": "6",
      "text": "Don't go to this film expecting greatness. If you want mindless action, leave your brain at the door and enjoy this flic for what it is - near nonstop fighting and killing."
    },
    {
      "rating": "8",
      "text": "Is it a perfect film? Certainly not. In fact, if you are something of a movie snob you may find yourself repulsed with Ninja Assassin. However, if you are looking for a simple, mindless action flick with a bevy of Ninjas where you can simply check your brain at the door, Ninja Assassin definitely delivers."
    },
    {
      "rating": "10",
      "text": "I will rate this movie on how much I enjoyed it. If you go into the movie expecting to see the \"real\" stories behind ninjas, you'll be disappointed...mainly because ninjas don't exist. The critics must have expected an oscar performance and a waterproof script going into this movie."
    },
    {
      "rating": "8",
      "text": "There are many types of movies out their, and this movie just happens to fall into one single category which is, Holy Sh#t.!, if you like action movies, and you want to be amazed visually, then watch this movie. Its entertaining, bloody, and pretty sweet."
    },
    {
      "rating": "9",
      "text": "Now heres the thing... if you go to the movies one night to see a great movie, with deep, complex characters, a solid multi-layered story full of twists and a strong emotionally driven plot... dont see this movie if you go to the movies to movies one night just to escape, waste some time and be entertained this is the movie for you (provided you can handle ALOT of blood and gore). I fell into this latter category and i walked away thoroughly happy with how i spent my money. Is it a great movie by technical definition or compared to movies like (two of my personal favorites) Saving Private Ryan or Pan's Labyrinth? No. Its violent, campy escapism at its finest and, lets just be honest, thats all it ever intended itself to be."
    },
    {
      "rating": "9",
      "text": "This movie was awesome. It was probably one of the goriest movies ever made.Lots of action. I'm buying it when it comes out. Fast no slow parts at all."
    },
    {
      "rating": "8",
      "text": "Lots of blood and gore! Great ninja action, but the lighting is too dark and the camera is too shaky sometimes, so it's hard to see what's going on."
    },
    {
      "rating": "8",
      "text": "Obviously this movie is not going to win any awards. It is what is. It's a total guy movie. Like a video game. Total action entertainment with body parts flying all around. You just have to buy into it for an hour and half and have fun watching the action scenes. I really liked it."
    },
    {
      "rating": "9",
      "text": "Alright I'm sick of hearing bad reviews for this movie. The special effects are a overdone and exaggerated, but it's to enhance the movie, but it shouldn't take away from it. I'm pretty sure that the special effects aren't meant to be taken seriously, or meant to look real. The fight scenes are incredible, and for everyone who says \"the story doesn't make sense\" should probably see it again. I personally thought the story was very compelling, and it was emotional in between all the blood. Personally one of my favorite movies by the Wachowski Brothers. Do not hesitate to see this movie, or you'll be missing out on what will soon become a cult classic."
    },
    {
      "rating": "7",
      "text": "if you want to complain about how it was a cinamatic fail then you obviously went for the wrong reasons. The title says it all. Ninja Assassin. I went to see a gory actionfest with mind numbing action. When they weren't talking about the retarded story I got exactly what I wanted. It drops to a 7 for me because there was way to much talking for a ninja flick."
    },
    {
      "rating": "9",
      "text": "This movie is so under-appreciated it is a crime.\r There is a plot, its detailed, and develops well.  There are characters, protagonists antagonists, etc.\r In short it has all the standard trimmings of a story/movie.\r Where this movie excels and possibly puts people off, is the graphic and nearly-over-the-top manner in which the combat/fight scenes are executed.  Yes there is violence.  Lots of it.  Too much? well thats subjective.\r In the end, I think this is the best treatment of the Ninja \"legend\" inclusive of hints of mysticism (shadow-jumping etc.) that I have seen.\r If you liked The Matrix movies you'll love this.\r Do not listen to these absurd reviews saying the movie was bad. It was one of the best martial arts movies I have ever seen. Pure non-stop action and a simple but good plot (a lot more than expected). When I first went to see the movie I knew it would be good but I did not know I would like it this much! I cannot wait to buy it when it comes to DVD and hope they make a second one."
    },
    {
      "rating": "9",
      "text": "\"Ninja Assassin\" knows exactly what it is-A bloody good time. Though, many people mite not care for the offerings that this movie has for us, this movie was really made to be a load of bloody fun! Just sit back, relax, and enjoy gore, the action, and the thrills."
    },
    {
      "rating": "9",
      "text": "This is an excellent movie, you have to watch it 2nd time to really appreciate it.  It is so real although it could be a little bloody, but that is the ninja was famous for.  Of course, for people who don't understand what ninja is all about, it would be difficult for them to enjoy the movie.  The actor Rain is fantastic, and well loved by millions all over asia.  If compare Rain singing on stage normally to what he was in the movie, you realise how much work he had put into this movie.  Well deserve a 9!"
    },
    {
      "rating": "10",
      "text": "It's like being injected with a bloody, gory and jaw dropping drug. Ninja Assassin captures the story of Rain, a student in martial arts. When Rain's bloodthirsty killers shadow him, he uses his carnage to payback and get his lady love who has been captured by the antagonist. NA is a good film, in fact a really good film. The fast paced killings, brilliant martial arts and good story- All done by James McTiguge. This film is about killing and killing works. The visuals are stunning and a bloody good time. This was the only fun, indo, fast and gory film that worked in 2009. This film is not for soft people or people who don't like this genre and blood and gore.  This film is not for everyone. Certainley, not for kids, though. You can't compare it to masterpieces like There Will Be Blood or The Dark Knight. But certainly, rent or buy this film for 9.99 and sit back with buttery popcorn and enjoy the blood, gore and stylized violence. Or buy a ticket if needed. This was a badass movie and the critics are talking s**t about it."
    },
    {
      "rating": "6",
      "text": "The plot of Ninja Assassin is cliched at best and overdone at worst. However, the action scenes are incredible, and the stylized, over-the-top gore is pretty funny, and if you can get over the slow story, the movie is quite an enjoyable background watch."
    },
    {
      "rating": "8",
      "text": "While the acting could've been better, I really enjoyed this movie. Awesome martial arts by Rain. And I loved seeing blood all over the place. Good thing this movie wasn't in 3d though!"
    },
    {
      "rating": "3",
      "text": "There are much better \"ninja\" movies out there than this. That both out perform it in action and story. 70% of the movie is in the dark and you can't see anything. The other 30% things are happening so fast you don't really see any action. and the story is worthless."
    },
    {
      "rating": "10",
      "text": "Award winning Korean Actor Rain stars in this drama that has viewers actually reacting to a movie for a change. From the ouuus and ahhhs to the applaud at the ending, we are blown away by this Korean phenomena. I am startled at how critics of this movie do not know the R&B singer, Rain who stars lead as Raizo. Then again, if critics don't see naked White women performing lewd acts, they never think the movie is worth watching anyway. Love."
    },
    {
      "rating": "10",
      "text": "Do not listen to these absurd reviews saying the movie was bad. It was one of the best martial arts movies I have ever seen. Pure non-stop action and a simple but good plot (a lot more than expected). When I first went to see the movie I knew it would be good but I did not know I would like it this much! I cannot wait to buy it when it comes to DVD and hope they make a second one."
    },
    {
      "rating": "4",
      "text": "\"Ninja Assassin\" is a straight up brutal hack-and-slash film that has fountains of blood oozing out of somebody's head within 5 seconds. The film needs serious trimming."
    },
    {
      "rating": "10",
      "text": "I'm very disappointed with all these \"critics\" giving thumbs down to this masterpiece. If you are a movie \"critic\" and you gave this NINJA movie a thumbs down... you don't know  about Ninjas and NINJA fans.\r This move is exactly what Ninja fans love about Ninjas. It's PERFECT!"
    },
    {
      "rating": "10",
      "text": "Just ignore the \"professional\" reviews about this movie because as usually in these days: when a movie gets only critics by journalists than it's means, that movie is interesting & worth to watch. Ofc., if you don't like gore in movies at all, and you also not fun of ninjas & martial arts, then possibly you have to look for a movie elsewhere. ;) But for the fun of this genre, it's a MUST SEE MOVIE, just too cool to miss, nuff said!"
    },
    {
      "rating": "2",
      "text": "Brutal child beatings issued from other children and the tasteless act of a man beating a child are part & parcel of this flick. Cue in the relentless violence and copious amounts of blood in this senseless and moral repugnant excuse for moviemaking. Sadistic people and sociopaths will rush to see this film"
    },
    {
      "rating": "2",
      "text": "This was a terrible movie in every imaginable way. The story is retarded, the pacing is awful, and I've seen acting on soap operas that put this movie to shame. Normally if it was supposed to be some stupid mindless action movie, I'd let it slide, but even the action sucked! The fight scenes are repetitive and hard to follow. How could they have messed this up so bad?! I mean it's freakin ninjas, how do you make NINJAS LAME!?! Seriously don't waste your money on this, hell even the Twilight movies would be better than this quasi-ninja-wannabe crap."
    },
    {
      "rating": "2",
      "text": "YIKES what a horrible movie. I'm only giving it 1 star for the awesomeness that was the precredits sequence, whcih was pretty well done. But after those 10 minutes, everything goes to hell in a handbasket. Poorly choreographed fights (if you can call them that), the endless CGI blood was a joke, the plot/story was paper thin, the acting was atrocious (outside of Rain, he's actually quite good). Most of all, many of the fight scenes were poorly lit and badly edited, making it impossible to figure out what was going on. Adding to that, these were the noisiest ninjjas I have ever seen..Do yourself a favor save your money for when this comes out at the bargain bin, or rent it on netflix. Just stay home and play Ninja Gaiden instead."
    },
    {
      "rating": "4",
      "text": "A nonstop bloodbath. Cartoonish violence. No point to it. Poorly done."
    },
    {
      "rating": "0",
      "text": "It's so unreal it hurts."
    },
    {
      "rating": "1",
      "text": "This movie was a waste of time. An overall lame attempt to wow the audience with fake looking CG blood and moronic special chain swinging effects which partake 90% of the movie. The plot is nothing less than laughable, I've stepped in puddles less superficial. Anyone less then 16 braincells would find a redeeming quality in this cinematic train wreck."
    },
    {
      "rating": "0",
      "text": "Anyone who gave this movie more than a 1 obviously doesn't know cinema. This movie was repetitive and overly-gory. It lacked a story and was a mess. Nothing could have saved this movie from utter disaster."
    },
    {
      "rating": "4",
      "text": "Overly gory, light on the story. Some people find this awesome. They have school Monday morning."
    },
    {
      "rating": "4",
      "text": "Mika(Naomie Harris) believes in ninjas, so does Maslow(Ben Miles), her superior(for dramatic purposes, this is a mistake), which must place these two on the fringe of respectability among their Europol colleagues, like a latter-day Mulder and Scully, the FBI agents who investigated the unfathomable. Talking about the unfathomable, the opening scene of \"Ninja Assassin\" plays like an X file, as heads are decapitated(and other such bloody mayhem) seemingly out of thin air, so fast is the ninja, he plays more like a ghost than man. Since a belief in these folktale mainstays can be akin to a belief in the supernatural, the filmmaker should have implemented scenes where the pair, especially Mika, face intense skepticism about her ninja fixation from the Europol brass, especially Maslow. \"Ninja Assassin\", of course, has to devote a lot of its running time to the tried and true origin story, but underwriting Mika is a mistake, because she's the story's entry point. When the Europol researcher meets Raizo(Rain), much more ado should be made about this moment from an emotional standpoint. Instead, at Mika's apartment, the good ninja engages in a heated fight with the bad ninja, so the Brit woman reacts to her impending safety, rather than the excitement that the corporeality of these mythical beings have just validated her life's work. The moviegoer only gets a sense of Mika's underdog status, during the scene in which an old Russian lady says that the Europol researcher is the only person who took her KGB agent husband's work seriously. In other words, ninjas are thought to hail from the fictional realm. On a grander scale, \"Ninja Assassin\" can be construed as an expression of our love affair with Japanese popular culture. In Mika's apartment, east finally meets west, and then they hang out, which should have been a lot more fun than what happens on the screen. Since a Korean pop star can't be expected to fight like Jet Li, the fight scenes are shot in a near-blackout."
    },
    {
      "rating": "2",
      "text": "All other standards aside, to me 'Ninja Assassin\" is really flawed on two fundamental levels - first of all, the plot is completely overthought, overwritten, and completely irrelevant to the action onscreen. We don't need a complicated trisecting storyline with braindead characters to complement random limbs getting hacked apart (and believe me, there are plenty of limbs flying around this movie). The second main flaw, to me at least, is the movie's idea of a ninja. To me, ninjas are meant to be unassuming, enigmatic, killers who work alone for some self-defined benefit. Not in this movie. Here, ninjas are essentially as refined as an LA street-gang who run aimlessly around and throw ungodly amounts of ninja stars, which coincidentally sound like loud bullets, which ruins the point of a using a ninja star over a gun. Most of the ninjas in the movie are there to simply get shot down by the SWAT team (the movie wastes no time for epic, romantic battle scenes, save for the few with the Asian superstar Rain). To top it all off, there is not a single smoke bomb! Dammit!"
    },
    {
      "rating": "5",
      "text": "The main Cast of NINJA ASSASIN is Rain, the pop-superstar from South Korea. I had a doubt before watching thiz movie, that Rain could perform convincing in thiz kind of genre. The movie directed by James Mc Teigue, and supported by Wachowski Brothers (THE MATRIX, 1999). Mc Teigue, we remembered him on his last film, V FOR VENDETTA (2005). In this newest feature, Mc Teigue improved with more actions and straight-to-the-point plots. The Actions however had a few weaknesses. The fight-scene is too fast and not focus, despite the special effect already in right measurement. The only thing that I like on thiz movie, is for the first time Ninja aura was revealed better on Hollywood movie. Rain performance was not stable. In one scene he could be an unmerciful Ninja, but on the other scene he shows softer character. I remembered in one scene, when Raizo (Rain character), was being watched on interrogation room. One police said, He is not seems like a Ninja to me,..It is more like a boy-band member. Do not blame him, he is: a boy-band.  Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com"
    },
    {
      "rating": "4",
      "text": "Alright, we get the message - ninjas are cool! Most of the action in the film is extremely well handled (other than a frankly quite laughable chase on foot through speeding traffic) and for the most part the fight scenes are creative, stylised and brutal, with copious assistance from CGI. The film is very obviously a McTeigue/Wachowski collaboration, with similar aesthetics and an identical central theme of revenge as their previous joint effort, V for Vendetta, though it lacks that film's darkness and political subtext. Lead actor Rain, with his dance background, can handle the stunts without difficulty, but he isn't a particularly good actor and his vengeful ninja outcast Raizo doesn't make for a very compelling protagonist. The rest of the cast, particularly Naomie Harris are a little bland and their performances underwhelming. Sho Kosugi, however, makes for a decent, extremely menacing antagonist, the diabolical ninja Lord Ozunu, though Kosugi is simply once again playing the kind of character that made his name. The film's script leaves a lot to be desired, and the story is conventional, occasionally verging on dull. In addition, the finale, though technically accomplished, makes it crystal clear that all you need to defeat an army of highly trained killing machines armed with swords is to carry a lot of guns. Ninja Assassin may be action-packed and gloriously ultraviolent, providing sporadic perverse pleasure, but it's also as dumb as a bag of rocks."
    },
    {
      "rating": "5",
      "text": "Mildly entertaining videogamey film with lots of blood but very little brains."
    },
    {
      "rating": "2",
      "text": "Rain's performance is awesome, but the action really sucks. The blood doesn't have very good visual effects, the film editing is terrible, and the rest of the acting is also terrible. The story is also senseless and lacking depth."
    },
    {
      "rating": "0",
      "text": "Mediocre and predictable plot, Uninspired action scenes with CG blood (for some odd reason) and laughably \"acting\" by the cast makes this film a must miss."
    }
  ],
  "recommendations": [
    "death_race",
    "transporter_2",
    "safe",
    "the_expendables",
    "underworld_blood_wars",
    "salt",
    "underworld_evolution",
    "underworld",
    "immortals",
    "rambo_last_blood",
    "war",
    "furious_7",
    "the_expendables_2",
    "xxx_return_of_xander_cage",
    "underworld_awakening",
    "abraham_lincoln_vampire_hunter",
    "the_marine",
    "doomsday",
    "the_mechanic",
    "polar",
    "hercules",
    "rambo",
    "6_underground",
    "desperado",
    "rambo_first_blood_part_ii"
  ]
}