{
  "id": 1569,
  "title": "No Escape",
  "starring": [
    "Owen Wilson",
    "Lake Bell"
  ],
  "runtime": 103,
  "genre": [
    "Thriller"
  ],
  "description": "In their new overseas home, an American family soon finds themselves caught in the middle of a coup, and they frantically look for a safe escape in an environment where foreigners are being immediately executed.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6WLnzTG4Hz3lFvfZGSsyB8NFGgM.jpg",
  "categories": {
    "plot": 6.914893617021277,
    "acting": 6.682926829268292,
    "ending": 6.142857142857143,
    "soundtrack": 5.0,
    "cinematography": 5.4,
    "familyFriendly": 3.0,
    "funny": 5.75,
    "action": 6.857142857142857
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This movie impressed me more than I thought it would. Is it perfect? Hell no. Is it entertaining? Very.\r The plot is horrible, but I mean, this movie advertised Owen Wilson getting his family out of a tough situation, and that there would be intense, gut wrenching, moments. On this front  No Escape definitely delivered.\r The acting was alright. Owen Wilson killed it. He should consider taking up more serious roles more often. His relationship with his daughters was amazing to watch and I wish I could have seen that relationship in a different movie. Lake Bell did not seem to even have much to offer the movie until the end, but I've definitely seen worse performances in movies of this genre. Pierce Brosnan is Pierce Brosnan. If you love him before this movie, you'll love him now, and vice versa.\r The action sequences were amazing once they stopped using slow mo all the time. The first few scenes are extended out with slow-mo to the point I got bored. Even the roof top scene, which was a scene used heavily in advertising, is watered down by excessive amounts of slow mo, which was a major disappointment. However, as soon as they started using it they stop, and the action sequence become fun and intense again.\r Overall, No Escape is worth the watch if you don't want too think to hard. Sometimes these kind of movies are good, and No Escape has definitely earned its place."
    },
    {
      "rating": "8",
      "text": "The best thing about this movie is that it got bad reviews. Go into this movie with low expectations and you will be very pleasantly surprised. This movie is extremely intense and doesn't let up until the very end.\rYeah it's not an incredible movie but it's miles better than anything that came out in the past 2 weeks. If you need something to see I recommend it. But go in with low expectations so you can enjoy it even more."
    },
    {
      "rating": "7",
      "text": "I actually liked this movie,  Owen Wilson was great, Pierce Brosnan basically played A **** James Bond but he was still good. I even tolerated the kid actors, they were okay. If you've seen Argo would basically seen this movie, but it has its moments, its full of suspense even if some of the plot turns are painfully obvious. This is a good suspense thriller, probably one of Owen wilsons best films recently."
    },
    {
      "rating": "8",
      "text": "Recently hired by an international conglomerate,  an American man (Owen Wilson) spirits his reluctant wife (Lake Bell) and daughters (Sterling Jerins and Claire Geare) from Texas to Southeast Asia.  On their first morning abroad, the fresh start is disrupted by an explosive coup and a subsequent wave of anti-Western mob violence.  With the help of a mysterious, seasoned expatriate (Pierce Brosnan), the family fights to stay a step ahead of their pursuers and escape to bordering Vietnam.  No Escape is a fast, vicious, and highly involving action-suspense film.  Wilson (in a relatively rare, but not unprecedented dramatic role) and Bell exude convincing parental desperation and dismay, while Brosnan is a scene-stealing delight, if a tad underutilized, as the debauched, jovial, unshaven Man with a Past Who Knows the Lay of the Land.  The film zips from one close-call-in-close-quarters set piece to the next, rarely pulling a punch in regard to violence and nicely maintaining momentum and a pervasive atmosphere of claustrophobia and paranoia.  The specter of potential xenophobia is present (this is a film in which a sympathetic white family is contrasted with and pit against a thronging Other, and there will be those who ignore the quality of the acting and craft on display because of this), but the film admirably, if a tad halfheartedly motions to temper this by also indicting Western corporations' acts of exploitation and resource plundering in the Third World.  I for one have no significant problem with a grind-house-spirited film such as this mining stranger-in-a-strange-land unease:  the spatial disorientation, the inability to easily communicate, etc.  After all, it is a real and recognizable experience and, by extension, a perfectly ripe subject for pulp entertainment."
    },
    {
      "rating": "8",
      "text": "This movie is CRIMINALLY underrated.\r I found it scarier and more intense than any horror movie. There's a scene in a hotel room with where Lake Bell's acting and the camera angles make it some of the most threatening and terrifying film-making I've ever seen. The hard-r violence is essential to the film's effectiveness and while people say 12 Years a Slave is hard to watch, (I was unphased), No Escape left a knot in my stomach for a few scenes.\r Owen Wilson does okay, but Lake Bell and Pierce Brosnan are who shine. You get so much emotion from Bell, and I wanted to kill these **** savages to protect her. Pierce Brosnan is such a hardcore badass, I only wish he had more screen time to kill more of them.\r On the down side, there's a LOT of shaky-cam and one scene that has some of the most painfully bad cgi I've seen this decade.\r Definitely worth a watch, a VERY intense thriller.\r I have a video review on my YouTube channel: https://www.youtube.com/watch?v=7vNju1FKo6M"
    },
    {
      "rating": "10",
      "text": "No time wasted getting into the action.  No, it was not a deeply developed plot line nor where the characters complex in the least but it was absolutely the most intense, edge-of-your-seat, gripping action flick I can remember seeing.  I'm not a big action / drama movie fan, but the trailer for this really caught my attention and I'm glad it did."
    },
    {
      "rating": "10",
      "text": "The negative reviews of the film, No Escape, is more proof that people just jump on the internet bandwagon of stupid every. chance. they. get.  It seems that the better the actors are at bringing a scene to life, the more raw emotion the movie evokes, as this one undoubtedly did, the more there will be a movement of unwarranted ridicule, especially if the actors in the film are good, solid, authentic people in real life.\rEach of the stars' performances was entirely engrossing, powerfully believable, with all of the subtleties that give it depth, and the whole bit.  EACH one of them NAILED it:  Owen Wilson, Lake Bell, Pierce Brosnan, down to the two little girls, that I refer to as:  Good Lord, where did they find these tiny, incredibly-skilled actors.\rIt was ABSOLUTELY suspenseful throughout -- but throughout. You should see the fingernail marks on my boyfriend's arm as proof.  The script had no wasted words, and each line was delivered with enough mastery to make you feel like you were truly peeking in on these characters' intimate, crushing, and life-affirming moments.\rThe whole rumor that No Escape made the mistake of having an underlying theme of Westerners:  good guys; foreigners:  violent savages, is also bunk.  The setting is in a Fourth World Country, where --  yes -- there would be violent movements of desperation, and the movie succeeds in reminding the audience of that same group's humanity and compassion -- again, throughout.\rIt was an amazing experience watching No Escape, and shame on all of you who just fell in line with the sabotage dumb-dumb train disguised with adverse, fancy-sounding jargon."
    },
    {
      "rating": "7",
      "text": "I almost didn't rent this because of its low score, but it turned out to be a well acted, exciting action thriller. Here's the deal. Owen Wilson shows up with his wife and two daughters in a SE Asian country (the name of which I don't believe is ever given) for business, only to find that rebels are going after and killing all foreigners in general and Americans in particular, blaming them for wrecking their country. Most immediately they blame a new American owned water works project (which is the very American business Own Wilson is there for). This all unfolds after Owen Wilson leaves his hotel to buy a newspaper. On the way back he sees protesters facing off against police, but the protesters are more than just protesters, they are well armed rebels; they overpower and kill the police and eventually swarm the hotel where Owen Wilson is staying with his family. He rushes in ahead of the rebels and the rest of the film is Owen and his family on the run, with a little help from Pierce Brosnan who adds a lot as a British agent. I had thought Pierce had gotten fat but he looks so good in this, with a simple shave he could pull off another turn as James Bond. A simple but well played plot. Tremendous acting. Fun rental. Not a false note."
    },
    {
      "rating": "7",
      "text": "So Owen Wilson is in this new movie “No Escape”, and this is a whole new role for him, based on his films that I’ve seen. This movie about Jack Dwyer and his family who move to Southeast Asia to start a new life. Jack’s company plans to improve the regions water, and he very quickly finds himself in the midst of an uprising of armed rebels. Essentially **** gets real, really real. Well that doesn’t quite cover it, but thats the way I’m going to put it. Honestly, I really liked this role on him. Not once did I think he was just being Owen Wilson, he becomes Jack, husband and father of two, who is just trying to keep his family safe at any cost. I’d like to rate this at a 9/10 because of the intensity and how enthralled I got with it, but that is a ridiculous rating due to the overall lack of plot. I don’t feel that takes away from it either, it ads to the experience in a way, you’re just as confused as the family. “No Escape” is quite the ride. You really start to think of the situation and how or if you would be able to handle it. Prepare yourself to jump throughout this and to see Pierce Brosnan be an badass.\rOverall this movie is for more of an experience rather than a overly deep story, but it keeps you with it for the 1 hour and 43 minutes of “damn what’s going to happen next?” A definite must see if you’re into the Action, Thriller genr"
    },
    {
      "rating": "8",
      "text": "This was a great movie and you get to see Owen Wilson in a movie which is not a comedy and he actually does it quite well (even though it is unusual I must say). The plot of the movie is interesting, it is intense and it's interesting to watch, especially when the whole action starts."
    },
    {
      "rating": "10",
      "text": "Owen Wilson, a businessman from America, packs up his family and follows his job to Asia where he is surprised by a violent political revolt. The first day of their new journey in Asia turned into the start of the most terrifying experience of their lives. You could feel the unbreakable bond between the family, the fear of survival, and the intense struggle of overcoming the obstacles that were thrown their way.\r I wasn't sure if I was going to like this movie or not, because normally action movies aren't my top picks. However, No Escape kept me on the edge of my seat the entire time. Honestly, as the end credits were rolling I looked down to find my bag still full of popcorn, because I literally felt like I was a part of the action within the movie.\r I am extremely shocked to see this movie get generally unfavorable reviews by the critics, because I thought this was one of the best movies from 2015 thus far. The plot didn't have much depth, however, this movie made you feel like you were a part of the family in the middle of the action.\r Overall, No Escape is a gut-wrenching thriller with a major twist. I encourage everyone to watch it and see for yourselves!!"
    },
    {
      "rating": "7",
      "text": "One of the strongest action thrillers in recent years, this gripping movie cleverly casts actors known for comedy in the central roles.\r Watch this movie for free http://www.watchfree.to/watch-2a44d8-No-Escape-movie-online-free-putlocker.html"
    },
    {
      "rating": "6",
      "text": "So I went to see this yesterday, an action/thriller starring Owen Wilson, Lake Bell and Pierce (I'm not James Bond anymore but I can still use a gun) Brosnan. I had very strong reservations about this, what with the casting choice and the early critic reviews, it is however, hugely intense, fresh and entertaining. I might even say the critics are overly harsh on this, no it's not perfect but it doesn't deserve all the hate. Not too long with good pacing and the ability to let the story unfold. Recommended.\r(the Owen Wilson \"wow\" count only clocked in at 2 throughout the entire film, so that's good)"
    },
    {
      "rating": "10",
      "text": "Absolutely LOVED this movie! I can't speak for those who didn't like it, but for a guy who loves an intense thrill, this movie hit the spot. I wasn't expecting much when I went in, but by the end there were tears in my eyes. Anyone who has a family could not help but be moved by the plight of this father and mother fighting for their lives and the lives of their children. Even days later, I find myself thinking about this movie and wanting to watch it again. If you find the trailer the least bit intriguing, you should not hesitate to see this movie. Don't listen to the nay-sayers, unless you are just looking for a warm and fuzzy feeling. In that case, there's always Jane Eyre.\r On that note, critics don't seem to understand the idea that some movies are about an emotional experience: not necessarily plot or character development. For example, a critic would probably get on the newest roller coaster, scream through the drops and turns, and then give the roller coaster a 2/10 because there was no plot or character development. Those of us who love horror movies, end-of-the-world, and sci-fi/action know that sometimes a movie is about the experience. It's about how it makes you FEEL. Sure, the best kinds of movies have it all, but when you want a good scare, you don't watch \"Citizen Kane\". You watch \"The Ring\". When it comes to moves that are INTENSE, \"No Escape\" is number one without question. You can give it a low rating because you don't like how it makes you feel when you watch innocent people running for their lives, but you can't give it a low rating for emotional intensity. *end rant*"
    },
    {
      "rating": "8",
      "text": "The story is cliché,the movie is predictable and they were using the slow-motion effects a little bit too much but this is one hell of an intense movie.Owen Wilson and Pierce Brosnan are doing a really good and convincing job.Overall a pretty good and entertaining movie."
    },
    {
      "rating": "6",
      "text": "Look, is it good? Not really. But damn it, is it intense. And Wilson does a solid job in a role I didn't think he was capable of pulling off. If all you want is some B-level thrills and some edge-of-you-seat moments, then this will quench your late-summer thirst."
    },
    {
      "rating": "10",
      "text": "I will start by saying that this film blew me away. I mean I was excited for this film ever since watching the trailer months prior but I don't feel it did it enough justice by any means. I mean for a director who has directed the majority of his movies in the Horror genre John Dowdle hit a Home Run with this movie. I will say that this movie isn't for the feint of heart there is a plethora of violence and it doesn't shy away from serious subject matter and the brutality of civil war. I loved the story while it was simple it was set up perfectly. The story is Owen Wilson takes his family to Cambodia or somewhere near there for a relocation for his job and a coup starts up almost as soon as they land and I will leave it at that much. I personally loved Pierce Brosnan in this film he was a very gritty character. I will move onto the acting and this is quick. I feel that everyone was spot on in that department. I will finish with the action it was dark,gritty and realistic. Go and Watch it."
    },
    {
      "rating": "9",
      "text": "Sorry fellow critics ... you failed to apply a proper grade.  Although the movie had a short plot , it placed each and every attendee right in the middle of the chaos. What amount of risk each and everyone of us would take to save our family.  I could feel the action in my gut and related to the turmoil & hard decisions being made every step of the way.  I don't give out 9's very often but you can bet when I do I was moved by the film one way or another,  GO SEE IT FOR YOURSELF"
    },
    {
      "rating": "2",
      "text": "The critics are dead wrong this some racist film but they are correct this it is a horrible movie. Nothing is explained and the mindless action complements nothing. The movie is a massive failure."
    },
    {
      "rating": "4",
      "text": "The opening sequence is so dreadful I nearly plotzed in anticipation. Bad movies like this don't come around often BUT then NO ESCAPE actually gets quite damn good. Another xenophobic B-movie in the tradition of TAKEN. BUT, yest another but, the whole things just falls apart and becomes an unwelcome bore. Totally bummed me out because I was really enjoying myself."
    },
    {
      "rating": "5",
      "text": "No Escape is a cliched, generic action film that struggles framing good action, but does have a few good performances. Seeing Owen Wilson in an action film had me concerned, surprisingly he and Lake Bell gave good performances. Despite that the film fails, for a multitude of reasons, most notably the story. The story is both generic and predictable, on top of that the story is a little too complex. Besides the story almost all of the characters have no development, besides Lake Bell's character who had a good amount of development. The villains were weak as they felt like nothing but faceless villains, if it weren't for one line of dialogue we'd have no idea why they are trying to kill these people. Lastly the camerawork is bad, there's absurd amounts of shaky cam, and the action sequences are almost impossible to follow. In conclusion the generic plot, weak character development and villains, and poorly shot action sequences make No Escape a mediocre action film, despite a good turn by Owen Wilson."
    },
    {
      "rating": "1",
      "text": "they did need pierce brosnon as much as you think they will and neither do I.....there awre so many twists in this thing....there is no escape from this weird movie.....the only thing this missed is one more creepy event involving too much love for the daughters. i feel like even the score shows how the mother killing the guy at the end is unexpected............either way....great locations...a good line in the movie is ....\"Get your family the hell out\".....making the love for me seem almost as much as the daughters....still...it gets a 1 for not making sense to me of all people.....he invented a valve? for water? still owen wilson in are you here has that good scene remember?"
    },
    {
      "rating": "1",
      "text": "No Escape is boring, and besides a few action scenes, the film bore me. But when he was throwing the kids roof to roof that was scary, and when the guy almost made the girl shoot the dad, that was super scary."
    },
    {
      "rating": "2",
      "text": "An incredibly racist offensive movie. A shame for the actors, director, writers.\r If you can get over the gross racism of the whole thing.\rIf you can get over the pitiful explanation Pierce Brosnan has to deliver over why the whole situation happens.\rIif you can get over the massive cliché of the man and woman role.\rf you can get over Lake Bell who does not seem to be able to play anything else than a frightened woman in all her roles.\rIf you are american, and firmly believe the world around you that is definitely out there to murder you, rape your wife and enslave your children.\rIf you think the whole Taken franchise is the best thing cinema has to offer.\rIf you ever got out of your country to always travel inside resorts and fully inclusive solutions.\r Then yes you might like this shame of a movie.\rOwen Wilson gives what he can, though he should seriously think about what kind of message he wants to give his face to.\rThis movie is an insult to its viewers and the whole south east asian region."
    },
    {
      "rating": "3",
      "text": "The acting was nice, but I feel like Owen Wilson is one of the actors that I really can't take seriously. The film takes place so fast that I could not digest the emotions conveyed by the characters most of the time. Finally I consider some angles taken by the director are not the most suitable for the scenes."
    },
    {
      "rating": "4",
      "text": "I cannot resist Owen Wilson being in this movie so the score's at 4 right now. No Escape is just another cheesy disaster movie that we don't even need."
    },
    {
      "rating": "8",
      "text": "Yet another comedy staple (Owen Wilson) takes the action route, as an American businessman who moves his family to an unnamed, poor country in Southeast Asia. Their first day turns into a nightmare when a violent political uprising imperils their lives. Wilson effectively plays a regular guy (and sweet father), who fights back without becoming an action hero. Director John Erick Dowdle has managed to keep each encounter and every chase tightly wound, although he and his brother (Drew) have forced the script's logic into some pretty tight corners. If you're willing to accept the highly improbable situations that keep piling up, you're in for a tense and often riveting ride."
    },
    {
      "rating": "4",
      "text": "Despite some of the appallingly bad reviews of this film, I had to download it from Netflix if only because Owen Wilson and Pierce Brosnan are two of my all-time favorite actors. Fortunately, with a Netflix film, you can watch it on your desktop computer without forcing your unsuspecting spouse to share your fandom preferences, and you can fast-forward the movie over the parts lacking in substance, which in this case was about half the film.\r A lovely young WASPy couple with the bland name of Dwyer (Lake Bell and Owen Wilson) are on their way to an unidentified Southeast Asian country that is possibly Thailand, where the dad has accepted a good job as a waterworks engineer. The movie opens stylishly with high production values as we see the kindly prime minister of this venerable land get assassinated in spite of the watchful eye of his devoted bodyguard. When the bodyguard realizes that his leader has been killed, he commits harakiri.\r From there, we switch suddenly to a happy family of four on an airplane, and the focus is now on the Dwyers. The Dwyers arrive the day of the Revolution, and after enjoying only one peaceful morning in their city hotel, they suddenly realize that they are trapped in the pits of hell. The rebels want to kill all the Westerners in town, which would not seem to be in line with their political agenda, since they presumably want to stage a government coup (the film was originally entitled “The Coup”) and not carry out some kind of fanatical, terrorist mission against all evil Westerners.\r The cinematic tension focuses on the Dwyers’ two little girls since the parents are most concerned about their safety and well-being. For example, when Jack Dwyer comes home from having witnessed a violent street scene and wants his family to leave immediately, the older daughter is missing because she decided to go swimming in the hotel pool by herself even though she’s not old enough to go anywhere by herself. It is necessary for the cinematic suspense, but highly unlikely that the daughter would have slipped past her overprotective mom, who never even noticed she had left the room.\r Owen Wilson is always adorable in comedic scenarios. Here his acting range is being stretched to the limits, but he just about gets to where he needs to be as a desperate dad trying to save his family. Lake Bell, another good comedy actor, is also attempting to reach the outer periphery of her range and also with limited success. It doesn’t help that she has a weak script with lines like, “Oh, man, I’m scared,” as she is about to make a death-defying leap from one rooftop to another. Brosnan’s role as Hammond, a British government agent, is gritty and noticeably downplays his still handsome profile. He explains to Jack Dwyer that his operatives encouraged the now fallen government to allow Western control of the country’s industry, and thus the Brits were indirectly responsible for the upheaval. This role might have given Brosnan some bite, but he is a secondary character that is never fully developed.\r The title “No Escape” has echoes of Sartre’s “No Exit.” But Sartre envisioned hell being a place where one is stuck for eternity with people one does not like, as in the Sartrean proclamation “hell is other people.” In this film hell is Southeast Asia when the masses are out of control, and it’s no longer about eating authentic Thai food and taking quaint photographs of flute players and fishing boats."
    },
    {
      "rating": "5",
      "text": "Reasonably entertaining with good acting but some of the scenes are too unbelievable."
    },
    {
      "rating": "6",
      "text": "Banged up abroad: Hide your wife, hide your kids.\r The best appeal from No Escape is not the anarchic story, return of Owen Wilson to action genre or typical underlying hidden agenda, but the intensely involving atmosphere. The feeling of riot is easily translated on-screen with fast editing and presentable family. Its perilous journey of survival is gripping and while it does have a few problems at latter half, it does enough for an enjoyable thriller.\r Owen Wilson plays as Jack, a father and husband who must relocate his entire family to an exotic country for his new job. Unfortunately for him, the moment he touches down on said country a widespread unrest happens. Angry local mob decides to kill foreigner for alleged economy monopoly, not the kind of activity you'd find on tourist pamphlet, and Jack now must use his wit and lots of luck to save himself and his family.\r Visual is its greatest strength. It has just the right touch of realism from the setting and over-the-top sequences for dire situation. For most of the time camera follows Jack very closely, almost as in documentary perspective but still manages to find the dramatic angles when needs be. It's a great vehicle to create suspense and it has just enough steam to be engaging until the end.\r Jack's family of his wife and two little girls is definitely a decent on-screen characters. It plays the right scenes to tug sympathy from audience. When the moment these girls whimper plays, though the acting or material doesn't hit the realistic effect intended, might even be slightly cheap, it remains a palpable plot device.\r The latter half fares slightly worse than its high octane opening. There are just too many Deus Ex Machina moments when stuff explodes or help comes at the nick of time to be believable. Furthermore, the propaganda agenda feels like it's shoehorned in, mainly to introduce Pierce Brosnan's character. The backstory of the danger itself is far from fully fleshed out.\r It may feel implausible at times, but the pleasant details of the setting and presentation of the turmoil makes No Escape into a delightful action survival."
    },
    {
      "rating": "6",
      "text": "The movie is decent and pretty straightforward. The premise works well for the most part. However, there isn't really anything special about it that makes this movie stand out."
    },
    {
      "rating": "4",
      "text": "In poor taste, but is undeniably thrilling at points. The first half is okay enough, but the second half is very slow and quite boring. Owen Wilson and Lake Bell give respectable performances, but are weak characters."
    },
    {
      "rating": "7",
      "text": "In the ocean of orcas, a family of four penguins seeks a way out.\r It was one of those movies I've lost interest after seeing its trailer. When I decided to watch I had no expectations, but I liked the surprise it gave me. So much better and very entertaining with lots of nail biting momentum. You can't write a review for this without mentioning the terrace scene which was one of the highlights of the movie.\r Remember the 2013 flick 'The Impossible' about a western family while visiting Thailand for a holiday stranded and separated after tsunami struck. Feels like this one is kind of a sequel, because of the similarity and takes place in a neighbouring country, Cambodia. But here the visiting family has to face the threat posed by the men from and during the coup.\r Ups and downs in the acting career are very normal and keeping that pace is essential. Right now Owen Wilson is maintaining it well and a few 2016 releases are the most anticipated ones. Pierce Brosnan's decent limited appearance had a prominent part of the storytelling. Comparing recent wonderful movies, Lake Bell carried out phenomenal stage of her career.\r I thought it would be old fashioned like the 80s and 90s flicks about people trapped in a local conflict. If you are yet to watch it, I'll clear your doubt that it is the same old theme, but amazes you with many thrill scenes. So this movie is very enjoyable and you would have a good time. Not recommended unless if you're not looking for a masterpiece.\r 7/10"
    },
    {
      "rating": "4",
      "text": "It was intense, all right, I gotta tell you that. But, as a movie, No Escape falls apart faster than you think. Owen Wilson didn't deem fit for the role, I mean like I KNEW from the moment the trailer dropped that this was bad casting. He is a comic actor and seeing him in a serious role was out of the bloom and unexpected. The story is about a family who move to Asia, and get ambushed by the government launching an all out war, as the family get stuck in the trenches, their only choice is escape from this hell. The story seemed like a good idea on paper, but when you see it in action, it becomes too damn predictable. Sure, there was plenty of violence and heart stopping chases, but it was mediocre and predictable. Pierce Bronsan was decent as an army soldier that helps the family. Acting overall was alright, I expected much more from these versatile actors. The action sequences are some of the most intense I have EVER SEEN. It may not be the best movie, but No Escape is very, terror filled, heart stopping and intense entertainment. It's a shame that these thrills couldn't be put on a better film."
    },
    {
      "rating": "6",
      "text": "An intense film that really manages to confer the error that sudden brutality can bring to someone used to living in a civilized nation.The children, however, reacted with an entitled stubbornness that doesn't seem likely outside protected suburbia, especially when people are being chopped with machetes a couple of meters away.Pierce Brosnan got too little screen-time for my liking. I was hoping he'd play a bigger role, but that would reduce from the feeling of terrified suspense, which I guess is what the makers were aiming for.They also managed to shove in an anti-western, anti-corporate message that nobody asked for, possibly to please the same people that hated the movie anyway for its \"xenophobia.\"In summary, an above average experience, but nothing Earth shattering."
    },
    {
      "rating": "8",
      "text": "The general consensus of the bad reviews from critics is that NO ESCAPE is a good-to-terrific action thriller that spoiled by racism. But the movie makes clear that all of the violence in the world is a result of first-world meddling and exploitation. It's the story of an American family in a foreign country that is experiencing an out of control violent revolution. It all happens on the first day the family arrives in the country. So there is no chance to bond or communicate or understand the culture. There is an overwhelming war zone environment immediately thrust upon them and in fairness to the filmmakers, another country in the region is portrayed as peaceful, courageous, supportive. All this means, if you want to see a really taut, violent, extremely suspenseful action movie about an American family thrust into overwhelming danger for 24 hours, check it out, while remembering that many who've seen the film are offended by it. I found the writing, direction and performances solid and the creation of suspense powerful. I didn't find it overly racist, but so many people who I respect did have that reaction, so perhaps I'm looking past their objections. You can make up your mind once you've seen it."
    },
    {
      "rating": "7",
      "text": "Full of suspense and tension, No Escape is an action-packed, surprisingly solid slice of entertainment that delivers thrills above it's admittedly one-dimensional characters."
    },
    {
      "rating": "7",
      "text": "Owen Wilson is not the first guy that pops into your head when you think action star but he is not completely unfamiliar with action. He was in a movie called Behind Enemy Lines with Gene Hackman that really could be considered an action movie. Since then Wilson has become more known for comedies, voice over roles and family films. Wilson is good for this role because he is a relatable. No Escape wouldn't work with a big action star. Jack Dwyer (Wilson's character) has something to fight for and he is certainly not invincible, but he will take any risk in order to ensure his family's safety. I think that many people can relate to that. Lake Bell was also great as Annie Dwyer and I think that women could see themselves in her character.\r There are several tense moments in No Escape that are excellent. The characters were in peril for much of the movie. Pierce Brosnan is disappointingly underused in this film but I think he was the best character in the film. He has his own problems but he is good for the sake of good and he bails the Dwyer family out a few times which can actually be one of the movies flaws. It seemed like Brosnan only appeared when the family was in a jam and it looked like there was no way out and then when he saved them he would be gone again. There is also a lack of development, there really isn't much of a backstory given for the main character but still overall No Escape is an exciting and very watchable film."
    },
    {
      "rating": "5",
      "text": "Well I'm not really sure if I actually liked this movie or not. The plot is simple and easy, and the action was somewhat a little off. Like there are action scenes where it left me with a \"What the hell\" face and there are scenes where I said \"Damn\". The movie picked up some fun but than it also left me with no happy ending. Owen Wilson did a decent job and I want to see more from him in future action movies. I personally believe that it could've been better."
    },
    {
      "rating": "10",
      "text": "Great movie, if you have children I think this movie will really hit home with you, it's really a must see movie. Not the best movie ever but a really good movie that will have you at the edge of your seat"
    },
    {
      "rating": "7",
      "text": "It's a good film and a really intense one. I loved the plot behind the storyline and the characters were okay. The wife was pretty and the kids did fine too. Pretty violent film and entertaining, but the only problem is probably how the plot works as the film progresses. (79/100)"
    },
    {
      "rating": "5",
      "text": "\"No Escape \" was very shocking , but why so much disapproval of criticism? , Lacking ? , What went wrong ? , If all goes well this review is for the disapproval of criticism are not so bad , please!. And something more charm to film me by shocking scenes , excellent sobreun coup plot , and know that Lake Bell, looks like Amanda Peet , lol."
    },
    {
      "rating": "10",
      "text": "I thought this movie was fantastic. This is not the genre I usually gravitate to but I didn't not want to stay home Friday night. The popcorn is another big draw for me. I bought the popcorn, but barely touched it because the movie was so mesmerizing. Later I checked the reviews and was disappointed that reviewers gave it such low numbers. Oh well. I definitely disagree with them. 10 out of 10 if your favorite think is intense any second maybe the end type of movies."
    },
    {
      "rating": "4",
      "text": "No Escape is directed and written by John Erik Dowdle. It stars Owen Wilson, Pierce Brosnan, and Lake Bell.\r No escape revolves around a business man and his family's move to Thailand. Prior to this move Jack Dwyer(Owen Wilson) is offered a job in Thailand that he simply can't refuse. This leads him to move his entire family there. Soon there after a riot breaks out and the rioters plan to kill any and all foreigners. Now Jack must find a safe haven for him and his family before they to are are hunted down with no escape.\r No escape is an all-around popcorn flick. That is the fact that must be examined while reviewing this movie. What I mean by this is I didn't have any expectation of an Oscar winner going into this movie. i was looking for a thrilling and energetic movie. Did I get one? Not really.\r I'm not saying No Escape was a terrible movie there were quite a few positives. For one Owen Wilson gives it his all and for the most part his portrayal of Jack Dwyer is very entertaining. Another good performance was that of Pierce Brosnan. He was mostly the comic relief of the movie and succeeded at that. Kudos to you Mr. Bond. I enjoyed the first half of the movie a lot. There was a genuine feeling of dread and some great shots. The cinematography was excellent and gave the film a dark and malicious vibe. The score played perfectly with the cinematography adding some serious suspense. I think the thing I liked most in the first half of the movie is that Owen Wilson was a normal guy not some secret spy trained in acrobatic espionage. The first half of the movie made him vulnerable and that's why it works so well.\r Onto the negatives. I absolutely despised the kids. The younger one was more tolerable seeing that in a situation like that someone that young would react that way. But the 11 year old was the worst. She had to be carried everywhere and was an all-round nuisance to not only her parents but to the audience as well. Equally annoying if not more was the constantly crying Lake Bell in her portrayal of Annie Dwyer. With three central characters this irritating its hard to sympathize. The biggest negative for me was the entire second half. The movie's shaky cam rises as does the utterly unbelievable plot developments especially someone's second coming. The film tries to add depth to the rioters by giving them a half baked motivation touched upon through 4 sentences given nearing the end. It, as expected, fails due to Dowdle's unwillingness to show Americans in a bad light. I think one of the final nails in this inescapable coffin is the fact that somehow in the course of 6 hours Owen Wilson is pulling of Liam Neason level moves. But, the single worst part about the movie was the ending. It was so far fetched and unbelievable that people in my theater left before the credits started rolling. The ending relied on an inside joke that no one really cared about in the first place. Just plain bad.\r I had fun with the first half of No Escape and painfully sat through the second half. I recommend seeing this movie and leaving around the 50 minute mark. Make up your own ending I guarantee it'll be better that the one actually put to the film. No Escape gets a C or a 4/10. There's no escaping the fact that this movie is plain mediocre."
    },
    {
      "rating": "8",
      "text": "This is one of those \"what would you do if this happened to you\" movies.  Wow, a guy from Texas takes his family to some country that borders Vietnam, and gets off the plane not knowing a coup d' tat is about to happen.  The country goes into chaos and foreigners are being targeted.  Makes me think twice about that vacation this summer!  How he gets his family to safety and what he is willing to do is the story line.  I really like a movie that is original, not a miss-mash of movies made before; I've never seen this story before."
    },
    {
      "rating": "5",
      "text": "This plothole riddled mayhem flick starring Owen Wilson and the two worst child actors I've seen all year. Doesn't build any tension because of it being the cliche hollywood remake. It doesn't care about it's characters because you are supposed to care for them because Owen Wilson has kids... I guess? This movie is a fun cheese fest that you can watch with a bunch of friends and have a good time but it is far from perfect or ten out of ten flawless"
    },
    {
      "rating": "8",
      "text": "Le pongo esta calificación porque me sorprendió, una película con Owen Wilson, de acción, de un tipo X que quiere salir de un país oriental en crisis, la cosa no pinta bien, y uno espera que el tipo de un momento a otro se vuelva Rambo o Superman  con el fin de salvar a su familia y dejar limpio el nombre de su país, sin embargo me encontré con una película diferente, algo creíble, obviamente con un par de escenas reforzadas pero pues es una película de acción entonces se le perdona, entretenida y emocionante.\r Me llamó la atención que hay un pedazo que dicen que el que inció todo ese problema fueron los mismo gringos, es extraño ver en una película de ese tipo que digan que los Estados Unidos no son los buenos del paseo y que acepten que tienen algo de culpa."
    },
    {
      "rating": "6",
      "text": "\"No Escape\" é um suspense intenso, sem dúvidas. Possui atuações convincentes - principalmente a do Owen - e boa direção, o que te seguram no sofá até o desfecho final. Todavia, o enredo é absolutamente previsível e, quando os créditos sobem, conclui-se que do modo que o filme é apresentado, a estória acaba por se tornar racista. A origem do conflito central é muito mal explorada, deixando pontas soltas. Ainda assim, se você procura por tensão e ação do começo ao fim, este filme é bastante recomendado."
    },
    {
      "rating": "2",
      "text": "When i saw the trailer for this film i wasn't that excited about it.\rThen i had i day off work and thought what the hell, but soon came to realise man i should have offered to do overtime or even work for free.\rIts not the worst film I've seen but its close"
    },
    {
      "rating": "7",
      "text": "Disaster thriller. Family are caught up in a revolution. Rapidly paced, the threats mostly feel genuine and the family pass from one to another almost without let-up. This will get your adrenalin flowing."
    }
  ],
  "recommendations": [
    "taken",
    "cold_pursuit",
    "the_marksman",
    "3_days_to_kill",
    "the_commuter",
    "the_accountant",
    "those_who_wish_me_dead",
    "the_next_three_days",
    "law_abiding_citizen",
    "unhinged",
    "maggie",
    "no_country_for_old_men",
    "savages",
    "contagion",
    "the_grey",
    "snitch",
    "carriers",
    "colossal",
    "the_equalizer",
    "limitless",
    "man_on_a_ledge",
    "split",
    "ant_man_and_the_wasp_quantumania",
    "flightplan",
    "repo_men"
  ]
}