{"id": 1371, "title": "No Good Deed", "starring": ["Idris Elba", "Taraji P. Henson"], "runtime": 83, "genre": ["Crime", "Thriller"], "description": "Terri is a devoted wife and mother of two, living an ideal suburban life in Atlanta when Colin, a charming but dangerous escaped convict, shows up at her door claiming car trouble. Terri offers her phone to help him but soon learns that no good deed goes unpunished as she finds herself fighting for survival when he invades her home and terrorizes her family.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/wcDLqCS70LsPcovieuQrb311Qr1.jpg", "categories": {"plot": 3.6666666666666665, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "a rather decent movie, and one of the few where milla jovovich really shows her talent as an actress, a seriously underrated piece of cinema..."}, {"rating": "3", "text": "I am a big Samuel Jackson fan, and certainly don't mind seeing Jovovich in anything remotely resembling a movie, but this was a real stinker. Major plot holes abound, and there is nothing to really make you care about any of the players. I did chuckle a few times, but probably not at what the director intended, but rather at the sheer preposterousness of some of the scenes. Unless you really have time to kill and can think of no other way to spend it, you can skip this mess."}, {"rating": "4", "text": "Even though the director does a good job he fails to make this into a good film.  However, it'snot his fault, there's just too mush going on...  Six very individual characters...  A story that's convoluted even before the twists are revealed.  For this film to have been good it needed to be longer, loose characters, or take the story back to bare bones."}], "recommendations": ["now_you_see_me", "the_snowman", "project_power", "tenet", "the_loft", "now_you_see_me_2", "triple_frontier", "21", "inherent_vice", "the_counselor", "solace", "lucky_number_slevin", "the_mountain_between_us", "the_departed", "the_usual_suspects", "the_gambler", "the_prestige", "broken_city", "the_good_liar", "the_number_23", "man_on_a_ledge", "cube", "a_wrinkle_in_time", "bad_times_at_the_el_royale", "gone_girl"]}