{"id": 286, "title": "No Man of God", "starring": ["Elijah Wood", "Luke Kirby"], "runtime": 100, "genre": ["Crime", "Drama", "Thriller", "History"], "description": "The complicated relationship that formed between the FBI analyst Bill Hagmaier and serial killer Ted Bundy during Bundy's final years on death row.", "releaseYear": "2021", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/jJzmSlNorOu6yvHSjXoF0bBcx17.jpg", "categories": {"plot": 5.0, "acting": 4.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "4", "text": "Acting was good but thats about it for me. I mean I saw recently the movie which portrayed more about Bundy and what happened, plus saw other things about the topic and after all that this one felt quite bland. Of course it depicted more the process afterwards, but for me the movie felt too boring mostly."}, {"rating": "6", "text": "This is a film focused on acting.Its two main actors; Elijah Wood and Luke Kirby are the center of attention, although of course relying on the fixation that cinema has for Ted Bundy.Therefore despite having a slightly more focused nuance, the film cannot avoid feeding on the Bundy's myth, because what makes the film attractive is that it deals with a men like him.Would it be the same with an unknown murderer? Doubtful.If you like this movie you should watch Mindhunter on Netflix. A superior approach into the subject, not Bundy though."}, {"rating": "4", "text": "(Mauro Lanari)I did not expect anything at the level of \"Capote\" (Miller 2005), but not even a film reduced to an interminable dialogue between two who have essentially nothing of the \"profiler\" and \"serial killer\". The acting performances go around in circles."}, {"rating": "10", "text": "Wow !!! What a movie. I would like to congratulate Elijah Wood and Luke Kirby for their amazing job. Thanks to Amber who showed us the real Ted Bundy. This is the only movie of Ted that I love."}], "recommendations": ["american_gangster", "mystic_river", "the_departed", "the_devil_all_the_time", "changeling", "public_enemies", "child_44", "perfect_sisters", "gran_torino", "white_boy_rick", "eastern_promises", "inherent_vice", "the_upside", "american_hustle", "donnie_brasco", "greenberg", "the_lovely_bones", "arbitrage", "black_mass", "i_am_sam", "hustlers", "split", "gone_girl", "the_prestige", "knives_out"]}