{
  "id": 769,
  "title": "No Manches Frida",
  "starring": [
    "Omar Chaparro",
    "Martha Higareda"
  ],
  "runtime": 100,
  "genre": [
    "Comedy"
  ],
  "description": "After his release from prison, bank robber Zequi sets off to recover the stolen money that was buried by his dizzy accomplice. He's horrified to learn that a high school gymnasium is now standing over the site where the loot is stashed. Needing to infiltrate the building, Zequi lands a job as a substitute teacher for a group of wild and unruly students. As the ex-con tries to lay down the law, he starts to realize that life in jail may have been easier than trying to deal with rebellious teens.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6HfyXfIEywLa2HvcswKi44dDKxL.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 4.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Vulgar movie with vulgar stereotypes... Fun at times but is this how Latinos want to be portrayed? Based on a German film this movie tries to be funny at the expense of the audience ignorance and stereotypical cartoonish characters. There are many great Spanish speaking movies out there that have substance and a positive message."
    },
    {
      "rating": "0",
      "text": "Walked out of the theatre, Walked out of the theatre, Walked out of the theatre, Walked out of the theatre, Walked out of the theatre... Walked out of the theatre"
    },
    {
      "rating": "10",
      "text": "So funny, I totally loved the cast chemistry. It's kinda impressive to see that the younger cast are the ones who steal the show and ultimately make the movie so enjoyable."
    },
    {
      "rating": "8",
      "text": "Es buena, pero sinceramente da mucho cringe los comportamientos infantiles que les pusieron a los estudiantes, incluso para ser del 2016 ese humor que manejan es muy ñoño y no causa risa, solo me cagaba de risa con las groserías de omar Chaparro y sus payasadas pero dudo que en otros idiomas se disfrute mínimamente la película."
    }
  ],
  "recommendations": [
    "wild_hogs",
    "wanderlust",
    "evan_almighty",
    "mortdecai",
    "tropic_thunder",
    "neighbors",
    "dinner_for_schmucks",
    "sisters",
    "walk_of_shame",
    "this_is_the_end",
    "the_40_year_old_virgin",
    "a_million_ways_to_die_in_the_west",
    "tammy",
    "forgetting_sarah_marshall",
    "couples_retreat",
    "norbit",
    "grown_ups",
    "bridesmaids",
    "borat_cultural_learnings_of_america_for_make_benefit_glorious_nation_of_kazakhstan",
    "blended",
    "sextuplets",
    "hot_tub_time_machine",
    "dirty_grandpa",
    "knocked_up",
    "little_miss_sunshine"
  ]
}