{
  "id": 95,
  "title": "No One Gets Out Alive",
  "starring": [
    "Cristina Rodlo",
    "Marc Menchaca"
  ],
  "runtime": 85,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "An immigrant in search of the American dream is forced to take a room in a boarding house and soon finds herself in a nightmare from which she can't escape.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bZUostLcCZYgcuBuAjmuSkBggiQ.jpg",
  "categories": {
    "plot": 5.2,
    "acting": 5.5,
    "ending": 5.125,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "NO ONE GETS OUT ALIVE is a tight, fun, and spooky horror flick with an intriguing mystery and a great central performance from Cristina Rodlo. Featuring an irresistibly creepy prologue, the film kicks into the creep territory from the get go and never relents. The monster design is absolutely to die for and the ending alone makes the movie worth a watch. Another good addition to the 2021 Halloween season."
    },
    {
      "rating": "4",
      "text": "It tries, but makes overly simplistic mistakes, especially when it comes to how long it takes to tackle the true horror of its subject matter.There are clues of course, but at least in 60 minutes of its 85, this looks more like a drama about an undocumented young woman running out of options, with its relative sequence of scenes spaced with supernatural elements.The final part involves a monster figure who looks quite creepy, but the context is poor, and the resolution is even more so.Netflix filler. No big deal."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)The double metaphor, the political one of the illegal immigrant who collides with the monster of the American dream and the now inevitable one of femicide, could and should have been managed with less insipidness."
    },
    {
      "rating": "6",
      "text": "A rather short and sweet review but I am mostly happy with this film. The trailer seemed to set it up as a different kind've movie but it definitely was not how I expected.I am totally fine with jump scares and horror movies of this type, didn't get many jumps out of me, though definitely has some tense moments that made my partner squeeze my hand extra hard. The story was all sweet, it just felt like the latter end of the movie dialed the crazy up to 11 and it felt a little abrupt, I didn't dislike this switch but it definitely threw me through a loop.The movie ending doesn't leave you with a whole lot of answers so I had to go hunt some theories down on Reddit, my understanding of the plot felt a little too simplistic but some theories on Reddit made me think back fondly, and I enjoy a story that doesn't need to give you answers and just lets you interpret for yourself on what happened.Definitely had some chilling moments and a wacky ending that made it enjoyable and is worth a watch in my opinion. There is a lot of not so good horror movies on Netflix, I don't believe this is one of them."
    },
    {
      "rating": "4",
      "text": "Horror that doesn't have a definite plot until the last ten minutes. Throughout the film it is thought that the danger is not what it ultimately is, and in the end the film is very mundane and not very scary. The monster, however, is aesthetically very beautiful and the ending also explains a bit why some things, but not all. Then the whole part of the document is unnecessarily secondary, has no purpose and could have been easily removed because it seems to have been placed there only to lengthen the broth."
    }
  ]
}