{"id": 330, "title": "No Sudden Move", "starring": ["Don Cheadle", "Benicio del Toro"], "runtime": 115, "genre": ["Crime", "Drama", "Mystery"], "description": "A group of criminals are brought together under mysterious circumstances and have to work together to uncover what's really going on when their simple job goes completely sideways.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/34BmdJkdvRweC3xJJFlOFQ2IbYc.jpg", "categories": {"plot": 5.588235294117647, "acting": 4.8125, "ending": 6.0, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "Man proposes, God disposes and the Devil decomposes. The typical plot of a crime that goes wrong takes its time in the first minutes and then lucidly takes shape, with surprises ready to baffle the viewer. Another achievement of this crime drama is the cast."}, {"rating": "7", "text": "Soderberg returns to the Detroit area, all these years after Out Of Sight, with a tale that feels like Elmore Leonard lite. Small time criminals get involved with what should be a simple heist, that gets twisted and complicated. The cast is stellar across the board, with an uncredited cameo that'll put a smile on your face. It's definitely mid level Soderbergh, but the cast pushes this to above average."}, {"rating": "5", "text": "The movie starts off great in the first hour, but completely falls apart in the second hour due to a messy, convoluted plot involving way more characters than it needed."}, {"rating": "6", "text": "In a way, I can't help feeling a little trace of disappointment, this because of what the film tries and does not materialize.No Sudden Move looks good. It has fine actors starring, and above all it has the experienced hand of Steven Soderbergh in the direction, and yet it fails to exceed the average.No Sudden Move is a story of betrayals, but these are not really outstanding because the mystery created is quite soft.Complication after complication pile up until they lead to a loose and flabby ending.There's not a vibrant pulse that makes the film fascinating or more exhilarating.It's hard for me to find the exact words, but what I'm trying to say is that the film doesn't manage to conjure up enough elements to be more memorable, or at least deliver on what it originally seemed to have promised.For Soderbergh's filmography it will be a medium film. I have no doubts about it.Is not bad, but it won't be one that will shine later on."}, {"rating": "7", "text": "Soderbergh's best film since 'Logan Lucky.' There's a moment when it's kind of difficult to follow all the twists and turns the story has to offer, but 'No Sudden Move' is an entertaining film about the true extent of capitalism and how regular joes are always destined to lose."}, {"rating": "2", "text": "This \"heist\" movie made no sense in the end, the Black mob boss let's the guy go, WITH 5k AFTER being out 25k for his initial ineptitude AND 50k to pay off the cops?  Why would he do this \"deal\"?  For his notebook?  Then why would he let him go?  Also, the writers crack said by Cheadle with a sarcastic eyeroll \"stein yeah I can see how that's a disadvantage\", where this was set in 1950's less than 10 years after 6 million Jews were slaughtered by the Nazis. What a weird bit of antisemitism plugged in there at the end. The style of this movie was there, but the substance was garbage."}, {"rating": "2", "text": "This is an environmental expose of the evils of capitalism disguised as a mediocre heist movie -- with a heaping helping of leftist ideology. On the positive side, it's a top shelf cast delivering solid performances and the film looks good, but you've seen better work from all the actors elsewhere. It's interesting, at first, to try to figure out the puzzling web of characters and their motivations until you learn you can tell the heroes from the bad guys and losers simply by skin color. Easy! Gender too. They even tossed in a couple lesbians, for no apparent reason other than extra virtue signaling by the filmmakers.  It makes the whole thing very predictable and self-congratulatory. Ultimately, and in retrospect, a lot of it, especially the ending, is nonsensical, but that's true of so many movies, it's hard to knock this one in particular. But I can knock it for failing to deliver anything interesting, unique, or memorable."}, {"rating": "0", "text": "A really sloppy, incredibly boring heist movie starring and directed by big names. It was really hard to finish this movie, another form of “content” I feel unsure reviewers actually watched."}, {"rating": "3", "text": "The ingredients were right but the outcome was dull and a bit puzzling. The characters weren't fleshed out, they were simply picked up and sent off, so it was hard to invest yourself. And for three guys with guns, they were really soft-spoken on the job."}, {"rating": "6", "text": "Don Cheadle and Benicio del Toro play 2 low-level criminal types in 50’s Detroit. They’re assigned to retrieve a document, but as expected, things go in mis-directions. This cast is nimble with the performances and director Steven Soderberg keeps things compelling with a bit of low level tension. Even so, the details of the plot are sometimes muddled. Soderberg chose to use extreme wide angle lenses for his period look, but the distortion can be distracting. Don’t mistake this for a typical gangster flick. This film is about interactions, not violence. It’s obvious that an accomplished artist put this together, because it’s absorbing, even when the payoff isn’t especially gratifying. BTW, Brendan Fraser has dramatically gained weight because he’s ramping up to star as a 600lb recluse in THE WHALE by Darren Aronofsky. Also, Matt Damon has an uncredited role."}, {"rating": "5", "text": "Despite a strong cast, the movie is cluttered and the narrative muddy enough to be incomprehensible in places. Too many moving parts, not enough groundwork for their movements to tell a story."}, {"rating": "6", "text": "Star studded cast elevates the average writing material. There are so many twists and turns its harder to engage with any characters as their allegiances change on the fly so often. Cinematography is average but the soundtrack is great. Some cool moments aside there was little to excite compared to so many others in its genre."}, {"rating": "5", "text": "While it had great actors and it seemed that it might be quite interesting, somehow while watching it felt a bit too boring and like lacking something. Like most characters didn't seem that interesting and you didnt get into much story behind them except for Cheadle's character"}, {"rating": "5", "text": "I didn't find this movie particularly interesting. Not only was the story so common, but it just dragged on and on. I thought some of the acting was kinda lousy. Also, I found that there was something off with the camera work and picture quality. Many of the scenes seemed dull and dim and lacking proper lighting. Overall, it was a bit too convoluted for my liking. It just didn't keep me enthused."}, {"rating": "5", "text": "Feels like a movie filmed during a pandemic where a bunch of actors came together with a prized director because there was nothing else to do. The casting of A list actors to play two weasels in Detroit makes zero sense. At least in a movie like uncut gems Sandler felt like he could be that guy. The whole movie just feels forced and never reaches entertaining at any point. I was so bored that the sight of Matt Damon randomly was the most interesting thing that happened. John Hamm wearing a suit was more interesting than most of this movie."}, {"rating": "8", "text": "NO SUDDEN MOVE is a finely acted noir throwback with so many twists and turns you will eventually give up trying to figure out who's working for who. Soderbergh's directing never falters, and his talent is on full display here. With a near two hour runtime the film does have a small pacing issue in the middle but overall it's a great crime thriller."}, {"rating": "6", "text": "Let me say right off the bat that I'm neither a fan of crime caper films nor of Soderbergh. I just came for the cast and they all delivered, with Cheadle, Del Toro and Harbour as the real standouts. As for the story itself, I wasn't ready for it to escalate that quickly and to develop into something extremely convoluted about corporate greed with historical subtext as it does, even with the archival Detroit photos flashing intermittently as Don Cheadle's character, Curt, walks during the opening credits. So it shouldn't come as a surprise that the movie lost me about halfway through. Still, I genuinely admired the 70s look the film has about it, which can be most notable in the wide-angle, panoramic shots with mild barrel lens distortion (intentionally mimicking a by-product of wide-angle shooting in the early 70s, causing a distortion in the corners of the lens) in addition to the retro credits with the funky font and music. No Sudden Move is also immersed in film-noir flair, with a surfeit of low-angle and Dutch-angle shots, emphasizing power and vulnerability, and conveying a sense of tension, respectively. By the way, there is a fair amount of tense moments in the movie, some are competently gradually built-up for and others come in in a sudden influx. Wish I got much more out of this film, though."}, {"rating": "3", "text": "(Mauro Lanari)He had said he would retire after the two seasons of \"The Knick\" (2014-15), but he still wanders around with his misanthropy under the illusion, as already too many times, that it is entertaining. An unbearable tedium that further increases the planetary furnace temperature. At the stake."}, {"rating": "6", "text": "The acting, the sets, the cars and the costumes were great.But the story ran off the rails in the second half of the movie. In the end, I didn't care who lived and who died after all the double and triple crosses.  Thumbs up for the acting and sets. Thumbs down for it's convoluted story."}], "recommendations": ["broken_city", "bad_times_at_the_el_royale", "beyond_the_reach", "cube", "triple_9", "good_time", "widows", "a_most_wanted_man", "survivor", "blackhat", "the_equalizer_2", "bone_tomahawk", "sicario_day_of_the_soldado", "beirut", "the_accountant", "terminal", "the_gunman", "the_little_things", "the_infiltrator", "wrath_of_man", "solace", "reminiscence", "a_most_violent_year", "end_of_watch", "triple_frontier"]}