{
  "id": 35,
  "title": "No Time to Die",
  "starring": [
    "Daniel Craig",
    "Rami Malek"
  ],
  "runtime": 163,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "Bond has left active service and is enjoying a tranquil life in Jamaica. His peace is short-lived when his old friend Felix Leiter from the CIA turns up asking for help. The mission to rescue a kidnapped scientist turns out to be far more treacherous than expected, leading Bond onto the trail of a mysterious villain armed with dangerous new technology.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iUgygt3fscRoKWCV1d0C7FbM9TP.jpg",
  "categories": {
    "plot": 7.413793103448276,
    "acting": 7.955223880597015,
    "ending": 8.08108108108108,
    "soundtrack": 8.0,
    "cinematography": 7.5,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 7.545454545454546
  },
  "reviews": [
    {
      "rating": "2",
      "text": "It isn't a classic. Not really a Bond movie. Felt emotionally draining and depressing to watch. Like a bad drama flick. Too bad, because Bond movies used too be great."
    },
    {
      "rating": "9",
      "text": "No time to die is a dignified farewell to the roughest Bond we've seen at work yet. Where the tough layer of the character was exaggerated in the previous films, it was just the opposite in this film. The whole thing was less over the top and the character was more human than before. The story starts a bit slowly but at the same time provides a solid foundation for the climax of the Daniel Craig series. The 'deadly weapon' in this film, which can be deployed by the 'human touch', is inventive which allows for more deeper way if storytelling. The only downside for me was that the antagonist Safin (although very good acting by Rami Malek) didn't have as much weight and impact as previous 'villians'. Nevertheless, it is a film not to be missed."
    },
    {
      "rating": "9",
      "text": "After 18 months of waiting No Time to Die has finally made it onto the silver screen. The only question remaining is, was it worth the wait? I can assure all of you that absolutely yes it was worth the wait.James Bond (Daniel Craig) is enjoying his retirement with Madeleine (Léa Seydoux). Despite having left active service, his old friend Felix Leiter (Jeffrey Wright) shows up asking for help. Bond is then led onto the trail of a mysterious villain armed with the most dangerous technology in the world. A fitting end to Daniel Craig’s era of James Bond. All his movies have come together (not you Quantum of Solace) to form a great story arc with No Time to Die wrapping up all the loose ends. It’s also far more emotional than I thought it would be and that’s unexpected for a James Bond movie. Craig’s Bond movies did indeed make the character more human and brought the whole franchise to a level more grounded in reality. No ridiculously over the top gadgets or invisible cars. The action sequences and luxurious locations are everything you’d expect in a Bond movie and more. It also has a terrific movie score that calls back to previous Bond movies like On Her Majesty’s Secret Service and Casino Royale.Daniel Craig raised the bar when it came to doing his own stunts to a point where the physical toll it’s taken on him was so bad we nearly almost didn’t get one last movie from him. I’m so glad he did decide to take on the role one more time. No Time to Die is a masterpiece, on the same level as Skyfall and further brings Bond away from the cheesy spy movies of the past. It’s also refreshing to see more women characters kicking ass and not just showing up in a bikini to look good for the camera. Lashana Lynch as a new 00 agent was a great addition to the already star studded cast. Ana de Armas was another great choice for a Bond girl and although she doesn’t have much screen time she made an impact. We all know these type of movies are only as good as their villains and Rami Malek is a terrifyingly eerie villain. Giving a scene stealing performance whenever he is on screen. Right I know this is the longest Bond film to date but despite that I didn’t feel this was overly long at all, there’s a lot packed into it. Compared to Spectre where by the time you’ve reached the third act you’re definitely feeling that it’s a long film. No Time to Die used every one of its 2 hours 43 minutes to entertain and pay homage to old school Bond movies.Daniel Craig is without a doubt my favourite actor to play James Bond, and I’ll go so far as to say he is the best James Bond. His movies reinvented the character and brought new life into an otherwise jaded franchise. No Time to Die is definitely the perfect way to say farewell to Craig as Bond and I will miss him as 007. Whoever they choose to take on the character next has a tough job as the bar is very high and they have some big shoes to fill. The last 18 months has seen the cinema industry struggling greatly to get people back into cinemas and nothing says welcome back to the movies like a new James Bond film. Get yourselves to a cinema and enjoy, highly recommended."
    },
    {
      "rating": "10",
      "text": "This was a fitting send off to Daniel Craige time as Bond and is the most emotional of all of his movies.The villain should have been developed more as for a few of the characters, but the action is great, the story is well told and the story is well told enough for me to enjoy this film."
    },
    {
      "rating": "10",
      "text": "No words to describe but this might be the best 007 movie! Truly a masterpiece!"
    },
    {
      "rating": "8",
      "text": "Well, this is it, this is Daniel Craig's last modern day 007 film and James Bond's final chapter in No Time to Die is a proper way to sendoff Daniel Craig with a bang. No Time to Die is cunning, ferocious, romantic, and stylistic of how this Bond installment presented and the two hour and thirty plus minute runtime makes up for everything after six years in the making. The directing by True Detective's Cary Joji Fukanaga is spot-on when the action sequences and tension blends naturally, the sound design is immaculate, and the new and reoccurring cast of characters are pretty good and well written. It can be a questionable ending for many, but No Time to Die entirely makes up for everything that Spectre has done. And there's no doubt that No Time to Die is worth seeing it at the big screen to help celebrate Daniel Craig's iconic portrayal of the 007 Agent we all know and love for one last time."
    },
    {
      "rating": "7",
      "text": "Way better than the 'Spectre' fiasco, but still not great as 'Skyfall.''No Time to Die' is an homage not just to the franchise as a whole — with many blink-and-you'll-miss-it moments — but to Daniel Craig himself, who says goodbye in the only way possible.Despite visiting familiar places, the film manages to be entertaining; there's you'll usual gadgets and exotic locations, but Cary Fukunaga and the team of writers — including Phoebe Waller-Bridge, whose touch tones down the macho persona around Bond — make the beloved spy face his past, his present, and certainly his future.But, for me, the main problem of the film is the villain. I mean, you don't need to practically name your main villain \"Lucifer\" to imply that he's bad. But, seriously, Safin's motivations never seem clear, neither as his goals, beyond the obvious.Also, I wish they had explored more of Lashana Lynch's character. There was a lot of potential there, but I think she was underdeveloped.Anyway, the main objective of this film was getting rid of the bad taste after the last one, and giving Craig a proper send-off. And I'm glad they did it. Letting go is hard, but not even Bond can't fight the passing of time."
    },
    {
      "rating": "2",
      "text": "After seeing the last Bond it became clear that liberal fascism created a  cultural black hole that will swallow all that it is fun. Danny Boyle refused to Direct this mockery so the found someone who would. What a hot mess of clumsy political correctness, social justice and man bashing."
    },
    {
      "rating": "0",
      "text": "Whatever bozo in Hollywood that thought this was a good idea for a bond movie should be fired!This movie should be called \"how to kill a wonderful franchise and never make money again!Woke people should just quit, all they touch turns to garbage, like this movie. The plot was boring and a hodgepodge of many other movies.This wasnt James bond but some sad man pretending to be james bond to try to suck dollars out of the viewers."
    },
    {
      "rating": "7",
      "text": "The latest Bond flick starts with James Bond, played again by Daniel Craig enjoying a tranquil life in Jamaica with a lover before he is attacked. He manages to fight off his assailants and escape, temporarily parting ways with the woman. We find out this woman’s mother was killed when she was a child in Russia by a strange man with a mask. Bond is working with the CIA at the start of the film and investigating the insidious SPECTRE agency. The man who murdered Bond’s girlfriend’s mother is in charge of SPECTRE and steals a biological weapon from the Russian secret service and plots to use it on society to bring order or some s***. At first Bond thinks Ernst Blofeld is behind this scheme and he interrogated him in prison. Blofeld threatens Bond but is killed off just to make way for the other villain. The other villain kidnaps Bond’s girlfriend and apparent daughter and prepares to use his weapon on humanity. Bond manages to save the day and kill the baddies but is left stranded on the villain’s island lair and apparently dies in an explosion. The movie had a lot of good cinematography and some good action sequences. Bond made several corny quips or puns which is conventional James Bond. The movie introduced a new 007 agent who was a black woman which might irritate some in the anti-woke crowd. The movie also dragged on a bit, it had a long runtime."
    },
    {
      "rating": "8",
      "text": "So, it's come to this. The end of not just any era, but arguably the finest in franchise history. Daniel Craig finally hangs up the shoulder holster and bow tie with \"No Time To Die,\" a bittersweet send-off to Craig's 15-year tenure as 007 and -- in many ways -- the character as a whole. Elevated primarily by Cary Joji Fukunaga's borderline faultless vision for the film on an aesthetic level and Craig's palpable affection and tenderness for the character, \"No Time To Die\" abates the audience's occasional frustrations with the narrative by filling the screen with stunning production design, vibrant cinematography and some franchise-best set pieces. The final act is also truly special. Without giving anything away, I'll say it really was the right ending to go with, but, man, oh, man is it an emotional ride. More than just sad to say this is the last time we'll see Craig playing a character he was truly born to play."
    },
    {
      "rating": "8",
      "text": "Well... Here it is. The end of an era. In his fifth and final act, Daniel Craig's James Bond finds himself forced out of retirement after trying to settle down in favor of a quiet life with Madeline Swann (Lea Seydoux), his love interest from the previous film 'Spectre'. He is soon tasked with stopping an evil mastermind (Rami Malek) from unleashing a mysterious poison upon the world, all while grappling with demons from his past. I gotta be honest, I was really dreading this being the farewell film for Craig's Bond, as he's come to be my absolute favorite actor to portray the iconic British spy over the years. His grounded, flawed, and realistic approach to the character has been unlike any other Bond actor who's come before him, making him a very sympathetic hero. So because I was so sad to see him go, I knew that this film would have to do him and his legacy he's created over the past 15 or so years of portraying the character some pretty solid justice, and fortunately I can report that justice is well-served for his bow-out here. All loose-ends are tied off fittingly, and Bond is truly given the justice and sendoff that he deserved. On top of that, the action sequences are as intense and thrilling to watch as they've ever been in the series. As far as performances go, Craig humanizes Bond more than ever here, and presents him as vulnerable and hesitant, which is something we've never fully seen in the character before. The amount of depth and layers that Craig adds to Bond here with his performance is truly remarkable. Rami Malek is also worth singling out here. Despite playing a rather stereotypical-feeling Bond villain, he manages to make the most of it in a rather subtle and understated yet ultimately chilling and sinister way. Other returning cast members such as Ralph Fiennes as M, Ben Whishaw as Q, Jeffrey Wright as Felix, Naomie Harris as Moneypenny, and Christoph Waltz as Blofeld are all on-point with their performances as well. The addition of some new kick-ass Bond women from actresses Lashana Lynch and Ana de Armas are also a warm welcome. As far as the story and sendoff goes, it does feel a little bit typical of a Bond plot, and while the farewell to Craig's Bond is rather fitting like I said, I will say that there were some aspects of it that felt a little bit rushed and predictable in the final moments, but is mostly overshadowed by the overall buildup to his final moments and the rest of the film's performances and stellar action. I'll truly miss Craig's Bond, but his final film here was a certainly worthy conclusion that's right up there with 'Skyfall' as possibly my second favorite Craig Bond film behind 'Casino Royale' as my favorite. Whoever replaces Craig from here certainly has large shoes to fill and quite the franchise to carry from here."
    },
    {
      "rating": "7",
      "text": "Filme bem meh, da pra passar tempo, mas é bem esquecivel, vale pelo filme ter tido a \"ousadia\" que os outros filmes do 007 não tiveram"
    },
    {
      "rating": "8",
      "text": "Though Daniel Craig said he wanted to slash his wrists, he certainly delivered an astounding final performance as Bond. The opening montage was signature, a long tortuous episode of action and grit. It was really nice to see homage paid to locales, music and friends of Bond’s past, as we took a walk through history of sorts. The speed at which Bond experiences loss and pain is matched by his frenetic efforts to finish one last great mission for his nation and his world. All the fears of an emasculated Bond were way overblown, if anything he epitomized Commander Bond, and got his due respect. This movie is quite emotional and brings the Craig era to a satisfactory close, tying threads going back to Casino Royale. The last half hour really packed a punch to the gut, showing that even Bond is beholden to love, and blood, and will do anything to make things right. The saddest words are indeed ‘we have all the time in the world’."
    },
    {
      "rating": "9",
      "text": "While Ramy Malek's character lacks menace, motivation, and logic, he only really shows up in the third act. The set pieces surrounding him look great, so it's easy to overlook his unimpressive threats, as he appears to pose no real danger to anyone in particular.Having underlined that serious flaw, I gotta say: good god, man! the rest of the movie was AMAZING! So good that you often keep waiting for it to run out of steam, and so it does eventually deflate a little as the film funnels the otherwise surprising script into the stereotypical Bond villain/lair/monologue setup, but I absolutely loved how it got there. As much as it pains me to say, a watch of the mediocre 4th film SPECTRE definitely helped my understanding of this film, so watch them back to back if you (dare) want the full experience.First Two Acts: BRILLIANTThird Act: A mixed bagDaniel Craig: Knocked it out of the parkRating: 8.5 plus .5 bonus points for the A. De Armas scene alone"
    },
    {
      "rating": "7",
      "text": "Not only for hardcore fans... if you'll watch a recap video before the movie or go to see it with someone who saw the movie, you'll understand everything!A great film and a satisfying conclusion to the Daniel Craig saga!***Seen in a cinema***"
    },
    {
      "rating": "7",
      "text": "It is not a perfect ending work, and the plot depth is not as deep as the previous works"
    },
    {
      "rating": "7",
      "text": "Film contained good stunts & intense action scenes. Probably would rate it 7.5. Not overly thrilled with some of the content of the screenplay. Been a James Bond fan since the 1st movie with Sean Connery. No need to input the WOK crap. If this is where the writers are headed they are going to lose a large following including moi !!!"
    },
    {
      "rating": "9",
      "text": "A great Film to end the Craig saga. You get to see some new and some old Charakters in a action and emotion packed movie. The ending isn't something for anyone but for me it was good. The only real downside was that they showed the charakter of Ana de Armas was only used for a few minutes of screentime."
    },
    {
      "rating": "10",
      "text": "I lovw this movie from the start to the finish. It is a very well resembilization of the James Bond Franchise and as well as Daniel Craig's final film!!!"
    },
    {
      "rating": "2",
      "text": "I couldn’t get past the unbelievable age difference and lack of chemistry between the two leads.  Too bad the producers couldn’t have chosen a more age appropriate co-star for Daniel Craig, it might have been worth the price of the ticket if they had."
    },
    {
      "rating": "4",
      "text": "Eh, I wasn't into it. One of the best sequences in this movie was the one with Paloma, because it was fun, action-packed, and because Daniel Craig and Ana de Armas have great chemistry with one another.The rest of it... I get that others may see it differently, but I honestly feel like there was WAY too much focus on Madeleine Swann, and Bond's relationship with her. His relationship with Vesper Lynd in the earlier movies was wound in with the core things you expect from a Bond movie, but in this one the relationship honed in on a lot of the action (including the expense of characters I might have liked to see more of, like Moneypenny, Q, Mallory, Tanner, Paloma, etc."
    },
    {
      "rating": "5",
      "text": "So i dont know how to feel with this movie! James bond is out of character and i am afraid for the next movie. Rami was a Meh villain and i was really hyped of him. I liked the feeling of a Son Connery bond. Action was...Fine i guess nothing bad and also nothing good happened in the action scenes. I pray for the best. 5 !!! Score in the middle."
    },
    {
      "rating": "5",
      "text": "One of the weakest James Bonds possible has no charm at all. Too bad I used the volume of the internet. They wanted to make something The same Alki I gave this just because of the action scenes and the music and the characterization, otherwise the story is not interesting"
    },
    {
      "rating": "5",
      "text": "End of an era, not glorious, not bad... But I'm afraid the next movies will certainly be politically correct. Oh, and WTF Wesley Snipes is here ? More Ana de Armas, and less woke quota."
    },
    {
      "rating": "0",
      "text": "Hands down the worst Bond movie ever. Boring, ridiculous (and not in a good way like the classic Bond films were), infuriating and just plain BAD."
    },
    {
      "rating": "0",
      "text": "Unoriginal, boring, boring, boring. And really cheap move to let Bond die and call the movie \"no time to do\". Oh what a clever title. How old are you? 10? And how dare the producers letting James Bond die?"
    },
    {
      "rating": "0",
      "text": "Such a precarious ending to a film.  It's as if Hollywood feels it is some kind of mission statement to not let people walk away from their services happy. I refused to watch this movie until now and I feel like I could have been happier not watching it at all."
    },
    {
      "rating": "6",
      "text": "So I've been busy lately and was looking forward to sitting down and catching up on a couple of films I wanted to see, Dune and No Time to Die. I decided to see what the critics and the public thought of No Time to Die but to my dismay, somebody named \"Cantongamer\" decided to complain about Bond getting snuffed at the end of said movie. And I'm like, \"Oh great! Now I know Bond dies at the end\". Knowing Bond was a goner pretty much killed my desire to watch No Time to Die. What happened to check the box for Spoiler Alert, Cantongamer? I'm sure Bond dodged some dangerous situations during the movie but knowing he's history at the end, so what? His luck is gonna run out baby, he's got a date with destiny coming. So \"Cantongamer\", next time if you're gonna **** about the biggest plot twist in the whole frickin'movie, please check the Spoiler Alert box for crissakes. Meanwhile, since I haven't seen the movie and probably never will, I'll give it a 6 since that's about what the users call is."
    },
    {
      "rating": "5",
      "text": "It was a classic Bond movie the first quarter into it, but then it dragged on for too long with no purpose. The only action sequence that were up to par and memorable were in Italy, but the rest were quite random to down right unwatchable. The Villiain was forgettable aswell, and his motives just didn't made sense. I know this was supposed to be Daniel Craigs last movie as James Bond, but it was not necessary to make it melodramatic. Previous Bond actors didn't do that aswell. An end of an era, and hopefully some fresh installments for the next."
    },
    {
      "rating": "6",
      "text": "Had a lot of expectations from No Time To Die as it is last movie having Daniel Craig as James Bond. Movie didn't live upto my expectations.First of all it was too long. It could have been half an hour short easily. The direction was also loose. Daniel Craig's performance was good like all the previous parts. I was expecting from Rami Malek but his character and performance, both were bad. You can't feel his character and he looked like a weak villain. His presence was not so strong. Overall, the movie was good but weak direction and weak villian didn't make this movie what this movie was capable of."
    },
    {
      "rating": "5",
      "text": "To be honest I was never that much of a fan of these Craig era films to begin with. His portrayal is rather lacklustre and insipid rather than brooding and enigmatic which I think they were actually going for. As well as that theyre all a little too self indulgent. We didn't need to spend 5 movies with Bond sulking and being often quite depressed coz a girl he knew for all of five minutes died. It's not good writing it's purely soap opera level.This film is no exception to that. He's still mourning the loss over one girl while fawning over the girl from the last movie who was never interesting enough for us to care about in the first place. They devoted so much time on this soap opera sub plot that they forgot to write a semi coherent plot. I was more interested in what the hell Rami Maliks motivation was for everything he was doing than whether Bond was gonna find out he had a daughter with his ex!! Are you serious???"
    },
    {
      "rating": "4",
      "text": "Not the worst Bond movie, but definitely at the bottom. The story was needlessly convoluted and disjointed. Craig's heart doesn't seem in this movie at all. There are way too many characters and plot points that could easily have been cut out. You barely care about half the cast. Action scenes were good but nothing noteworthy. Plot scenes came fast and furious with lots of jumping around and volume/tone/color changes that made them hard to see and hear - or care about. Sadly you can already see them prepping the woke reboots using the all-new cast because they very clearly killed and/or replaced every single possible villain and classic character role with the diversity checklist. Hollywood, if we wanted to get preached at, we'd go to a church. We don't need you ham-fistedly hacking up plot points and characters to cover your checklist of woke-isms. The Bond franchise is dead and it ended with a sad whimper, not a bang."
    },
    {
      "rating": "6",
      "text": "The whole premise of this film is based on revenge, it's not the best James bond movie I have seen and I have seen them all. There are holes in the story where the audience has to presume where bond ends up in the world, getting the big yellow life raft for a sinking ship that had almost sunk as he gets out of it and then is rescued by the big container ship heading where? I hope they continue the honor the author's vision, Ian Flemming, and 007 always is male agents. If not I will say goodbye to the franchise and any future movies."
    },
    {
      "rating": "5",
      "text": "The first 10 minutes of the film are great. Followed by the most boring James Bond movie of all time. It's full of ridiculous dialogue that makes no sense. Instead of thrilling atmosphere, the viewer is offered a series of strange situations. For example, the scientist is more of a comedian. Why is that? Or the scene in Cuba is all artificial. At this point the film becomes a parody and one wants the film to end.There is no point in commenting on the rest."
    },
    {
      "rating": "4",
      "text": "Where to start? Maybe the main point to address is that this movie is a big big wasted opportunity. The 2/3 of the movie are really fine. While everything is to long and could be cut down without losing anything, it is Bond at its best. It is fun, great action, great acting and really feels like Bond.However, the last third is totally disconnected. Once the finale starts I had the feeling of being in a very different movie, maybe in an episode of an old, bad 60ies spy series if that makes sense? We get the weakest Bond villain of all time, he has no motive, no agenda to speak of, he feels like a villain meme. Everything going on in his base makes no sense and is visually very ver strange.Another problem that thing has is trying to connect all movies. Bond should not be serialized, just make one good movie at a time. Casino Royal is awesome because of this fact, they didn't know what will come and just made the best Bond movie the could. What I really have to praise is Ana de Armas. She is so good, her character is the best thing the movie has to offer and I'd love the see an spin-off with her in the lead. There is so much potential there and she is a great actress!All in all I hope the next Bond incarnation will go back to the roots of the franchise. We need a modern incarnation of the Connery era bond movies. Not a feminized something where Bond fights his inner demons more than he fights the big bad guys."
    },
    {
      "rating": "5",
      "text": "Disappointed but not surprised, the movie feels like an American take on James Bond with the social climate included, sprinkles of campus activism here and there. As for the plot, it was very vague a lot of missing information especially about the main villain and Madeleine. The locations where the movie takes place won't blow your mind because it's literally the same as the previous Bonds...."
    },
    {
      "rating": "8",
      "text": "This movie is amazing, just og Watch it. Great action scenes and a beautiful ending to the Daniels Craigs James Bond movies."
    },
    {
      "rating": "10",
      "text": "A fantastic and bimbastic ending to the best Bond of all time. Action packed, emotional and well written."
    },
    {
      "rating": "10",
      "text": "Probably my favorite of the Daniel Craig Bond films, but it’s hard to choose between this and Skyfall. I plan to rewatch this about 100 times!"
    },
    {
      "rating": "10",
      "text": "I mean, is it woke? It is, but they were careful not to shove it down your throat at every turn. Also, Daniel Craig didn't get the Blade Trinity-Wesley Snipes treatment. This is a drama heavy with a healthy serving of action type movie that delves into Bond's trust in women. If you can't stomach actual acting and people emoting while saying their lines then go and watch The Expendables instead. I put this in between Casino Royale and Skyfall. And I thought this was going to bomb hard."
    },
    {
      "rating": "9",
      "text": "Great action, acting and emotional payoff, a great send off for a great Bond."
    },
    {
      "rating": "10",
      "text": "I liked the movie a lot, I really liked Daniel Craig's performance, action sequences, but what I liked the most was the performance of Ana De Armas as Paloma. After 18 months of delay: I finally saw the movie. It is considered one of the best films in the franchise (Daniel Craig's version) And the first movie to feature female characters who fight like Nomi and Paloma. ¡THANK YOU, DANIEL CRAIG!"
    },
    {
      "rating": "10",
      "text": "NO TIME TO DIE REVIEWReviewed on Digitalthis is the perfect goodbye for an amazing performance delivered by Daniel Craig and us, die hardcore fans who were waiting for 6 years for a new release, will not be disappointed.SETTINGNo time to die starts where Spectre was left off: Madeline and James are together enjoying a nice rest, but then after remembering someone from the past trouble strikes again in the most amazing and blockbuster way: 007 finds himself chased by bad guys in an Italian villa and hell is let loose pretty earlier in the movie.A new threat is looming by, and the shadow of Spectre is still hunting both James and Madeline, but now a new horror emerges when a man, Safin, is trying to take down not a specific target but millions of people with a new and deadly weapon.PERFORMANCESI think that after 5 movies we can say that we got accustomed to Daniel’s Craig performance of Bond. Ever since I saw Casino Royale, I knew this new Bond meant business, and Daniel Craig has never failed to perform as the British superspy. For this occasion, the story puts him in an awkward situation, and we will see a more human side of Bond. But that does not mean that he will not kick ass, as he is an agent with a license to kill after all, so I saw a delicate balance being managed in this story.Léa Seydoux brings once again her charming character of Madeline, who now finds herself enthralled by the past of his father, Mr. white, and there is a scene where her past comes to mind, and I believe that is one of the most terrifying scenes I have seen in a Bond movie. Madeline is sweet and charm, and even though she is a therapist, she is also a fierce character, one that you do not know you want to trust.Rami Malek’s character is incredibly well written, and I felt scared by his performance. I mean, Mads Mikkelsen’s Le Chiffre will always be my favorite villain of the last 5 Bond movies, but Safin, the villain of this movie is motivated by not greed nor a specific agenda for becoming more powerful: He simply wants annihilation. That is scary, and his character is presented in a flashback as a very creepy guy, but in the present, he is also very scary. I like Rami Malek’s performance, he did a great job.New to the cast is Lashana Lynch, which I thought it was a little cocky at first, but after a while she starts to grow on you. I thought her jealousy of Bond was kind of stupid, but she is a great buddy for James in this adventure. I mean, at first you do not see much on her, but after a while you see that she waws a good fit for the cast.Ana de Armas performance was great even though was small. She appears amazing in that dress and the party scene was incredible… she also kicks it, and she appears like a soft initiate on the CIA’s paycheck, but she is actually pretty badass. I would have loved to see more of her, as I liked a lot how she interacted with Bond.VISUALSFrom Italy to Jamaica, Cuba to England, and at last to a small island in dispute among Japan and Russia, the movie will move along different locations. Visually, the movie is a non-stop action thriller, and this is one of the main reasons why I love this franchise so much. Every action scene does not disappoint, and yet, at the end of the movie we see moments of pure beauty and love… Cari Joji Fukunaga made an incredible achievement with this movie, as he found balance for the normal action scenes to the story and how it unfolds in the end.This movie is longer than any of the other Bond movies, and there was not a single moment where I felt bored… no, I felt scared, and wanted to know more about the story. Visually is amazing!SOUNDThe music in 007 movies have seldom disappointed. The score always matches the vibe of the scenes, and regardless of being a movie with an incredible soundtrack, I did not find Billie Eilish’s main theme, no time to die, to be that compelling. It is good, but not as good as my best Bond opening song from the 5 movies, which is Casino Royale’s You know my name, performed by late Chris Cornell. Yeah, yeah, many people disliked it, but to me is an amazing songFINAL VERDICT:My final Verdict is a 10 for this movie.Daniel Craig’s last performance brought tears down in one of the final scenes. He is an amazing actor, and his performance as James Bond has paid off elegantly. Since Casino Royale as his introduction, where he literally shut many people’s mouths with his astonishing performance, to this, his final movie as the fabled British superspy… I cannot say that I will not miss him. Just as it happened with Pierce Brosnan, which I enjoy watching as Bond, I will enjoy watching Daniel Craig’s Bond movies until a new Bond is chosen… Honestly, I do not want another Bond, but the franchise must go on. I had the same feeling when Pierce Brosnan had to leave his Walter PPK behind and Daniel Craig took over."
    },
    {
      "rating": "9",
      "text": "A fantastic finish to one of the most influential and success spy series ever.\tJames bonds final outing is a spectacle of homages, new ideas and forward momentum all carried about by a very polished Daniel Craig. After 5 movies of amazing highs and bottom of the barrel low does this film provide a satisfying conclusion to the Craig Bond line? Simply put, yes. This Bond like previous Craig movies focus more on the human aspects of Bond and how his actual personality and emotions have effected him out side of his spy life. Don't take that in a wrong way the movie still does a fantastic balancing at of giving you plenty of action while not turning into a mindless stupid MCU cgi explosion fest. The movie starts out with one of the best openings in a bond film in years told in 2 unique parts. Introducing Bonds new love affair and setting up her child hood back story. An opening set with the suspense and tension of a slasher film this opening offers a disparate direction than any bonds taken.  It's shortly followed up by a chance through and Italian village has breath taking stuns and beautiful locals. Fans of old will rejoice with the choice of Bonds car being a classic db5. The action is tight, well shot and very slick. Craig's bond's have always tried to lend themselves to a more realistic world with less gadgets and tricks. However, this film steps in a pays a little more homage than any of other of Craig's movies. The Db5 has plenty of tricks up it sleeves that will leave classic bond fans with a smile from ear to ear.  While not giving you a beat for beat plot analysis the movie introduced new characters and ties up old ends for classic characters. The introduction of the new 007 has always been shown off plenty of times in trailers. I know what most of us bond fans feel. We hated it. No Bond fan wanted to feel the Social Justice Woke culture push into bond. Pushing a black female agent into 007s roll felt like nothing more than virtue signaling when watching the trailers and the back lash was high. Well I can certainly say the movie doesn't push that agenda. Yes she's there, yes she 007 but in no way does the film seem to be pushing this. Weather they did this because of back lash or not it's really no a detractor from the movie and I don't think you should go into the film with that bias. One of the weakest elements in the movie that needs to be addressed however is the villains and Spectre. Both are done a huge disservice as they simply don't seem to be the of focus the movie. The movie is more interesting in wrapping things up than it is giving satisfying conclusions to classic plot points. 25 movies and the legacy of Spectre is kind of just throw out the window and concluded in 1 to 2 scences. I will however say the party for Spectre in Cuba is one of the high light scenes for the movie. The beautifully stunning Ana De Armas delivers as one of the best bond girls in her very brief Cuba scene. In her brief 10 to 15 minutes of screen time she Nails it epitomizing everything a Bond girl is about. Sexy, bad ass and fun. The main villain of the movie on the other hand doesn't live up what we'd consider an amazing bond Villain. In fact I'd say he's completely forgettable. This is part of the reason its so dishearting that Spectre the over arching Villains of the whole series are concluded with little to no fan fair. Remi Malek is a great actor and does the best with what he's given but, i'd think you'd be hard press to walk away from the movie and even remember his characters name. Go for it, see if you can remember the mains villains name seconds after leaving the theater. Promise you, you cant. His motivations seem muddle and unclear and the threat level that he brings seems pathetic. While there's world ending stakes at hand they never seem important and the tension isn't high.  So while it seems like I've been trashing on the movie very hard, No time to Die is a movie that is the very \"The whole is greater than the sum of its parts\" - Aristotle. The movie combines to make a very polished and enjoyable send off to Daniel Craig and in my opinion the series as a whole. With its long run time of almost 3 hours you won't ever find yourself bored or thinking about the pacing. It's a brisk, fun thrill ride and one not to be missed. I really hope everyone enjoys it as much as me and goes into the movie with an open mind and not pre conceived notions. 9.5/10"
    },
    {
      "rating": "9",
      "text": "No time to die is a fit end for the Daniel Craig era, doing justice to the story told over the last 4 films and finishing off Craig's bond arc. The action was top notch (the Ana De-Armas scene was especially kick-ass), I liked all the supporting cast (even ones I didn't like before like Leà Seydoux's Madeline Swann which was finally flashed out after being completely flat in Spectre). Lashana Lynch's character, Q and bond's daughter (she was so bloody cute) were the standouts for me among them. The soundtrack by the legendary Hans Zimmer is exciting and touching. You quite feel this is the end for bond in this movie, for example when Felix died which was really sad but showed that this group are at the end of their road.the reason I think this is still a 9 and not a 10 like casino royale or Skyfall is because Rami Malek's Safin is quite weak and moustache twirly. His backstory is interesting and gives him depth but his reasons for what he does are really one-dimensional bad guy stuff. although I did like the scene where he gave bond a choice between him and his daughter, which was quite allegorical to bond's needing to choose between staying a cold-blooded robot killing machine, or finally become human again even tough it pains him after vesper's death.Craig himself as always shines as bond and being my personal favorite . He has incredible depth and he is a really well-rounded character who you can relate too even tough he is freaking James Bond! Casino royale was the perfect origin story and it explained how bond became bond (becoming emotionally detached, a killing machine of sorts, and trusting nobody but himself after vesper's betrayal and tragic demise). That also perfectly explains why he ditched Madeline the minute after thinking she betrayed him, not wanting to repeat the past trauma of letting all his guards down and falling for someone who betrays him.the last two movies wrap that story arc quite nicely by making bond trust people again and open up again thanks to his relationship with Madeline who helps him deal with his past trauma, forgive vesper, forgive himself and move on; and also now his daughter who makes him reconsider his priorities. The end for me was bittersweet. It was sad to see Craig's bond bite the dust after the amazing 15 year old run he had, but yet I felt content as I think bond was at peace in his demise. Knowing he was never going to be able to be with his family, but finally moving on and opening up again, having a family and a group of people who love and support him, making the sacrifice for them, and dying a meaningful death for the safety of the world. A satisfying sendoff to my favorite bond. You have left big shoes to fill and you will be missed."
    },
    {
      "rating": "1",
      "text": "A disservice to the most authentic and visceral Bond to date. The way this movie wraps-up the Daniel Craig era is frankly terrible in many aspects and shameful to long-term fans of the franchise. What started as an authentic Bond character that was quite personal with the audience in the sense that he was a human with flaws, weaknesses and bad judgement calls. However, the undefeatable superhero guise of Bond that began with Spectre continues here through the relentless quest to Marvel-ize every action movie to hit the cinema here on after."
    },
    {
      "rating": "10",
      "text": "An Amazing ending for Daniel Craig. Lea Seydoux/Madeleine is a better character. No time to die is one of the better James Bond."
    },
    {
      "rating": "9",
      "text": "J'ai beaucoup aimé ce nouveau James bond que j'attendais avec impatience, le scénario était bon, le jeu d'acteur de Daniel Craig était très bon (comme toujours) et les scènes d'actions étaient dignes d'un James bond. Je trouve juste dommage d'avoir tué James Bond a la fin du film"
    },
    {
      "rating": "0",
      "text": "Superficially polished, but with no chemistry between the main pair, pedestrian progress through a check list of Bond tropes, heavy handed signalling of virtues and writing that leaves the viewer wondering why half of it is happening, but still redeemable, perhaps... and then the ending. Awful."
    }
  ],
  "recommendations": [
    "casino_royale",
    "spectre",
    "skyfall",
    "quantum_of_solace",
    "the_world_is_not_enough",
    "you_only_live_twice",
    "tomorrow_never_dies",
    "creed_ii",
    "x_men_apocalypse",
    "thunderball",
    "x_men_days_of_future_past",
    "man_of_steel",
    "donnie_brasco",
    "diamonds_are_forever",
    "avengers_infinity_war",
    "the_marksman",
    "captain_america_civil_war",
    "mission_impossible_rogue_nation",
    "the_accountant",
    "die_another_day",
    "the_karate_kid_part_ii",
    "the_hunger_games_catching_fire",
    "black_widow",
    "spider_man_no_way_home",
    "the_hunger_games_mockingjay_part_2"
  ]
}