{
  "id": 3365,
  "title": "Noah",
  "starring": [
    "Russell Crowe",
    "Jennifer Connelly"
  ],
  "runtime": 138,
  "genre": [
    "Drama",
    "Adventure"
  ],
  "description": "A man who suffers visions of an apocalyptic deluge takes measures to protect his family from the coming flood.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vVLkHabnF5lVpCpqyhZBI5iCYMA.jpg",
  "categories": {
    "plot": 3.95,
    "acting": 3.357142857142857,
    "ending": 3.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 3.0,
    "action": 3.727272727272727
  },
  "reviews": [
    {
      "rating": "2",
      "text": "This film would be laughable if it wasn't so depressing, and by depressing I mean Aronofsky's blatant disregard for the Bible account he supposedly drew inspiration from.\r I wish I had walked out but I was compelled by a morbid desire to see just how bad it could get. In that respect I wasn't disappointed."
    },
    {
      "rating": "3",
      "text": "While not the worst film I've ever seen, Noah has to be one of, if not the most disappointing.\r I was under no illusion that this would be 100% faithful to the source material, and some embellishment was to be expected, but what Aronofsky has done is inexcusable and absurd.\r What a wasted opportunity."
    },
    {
      "rating": "3",
      "text": "If you believe in the Biblical version of the story of Noah, this is not the movie for you.  However, if you are a transformer fan, you're right at home.  The actors were solid in their performance.  Hollywood creators never cease to amaze me.  How do you get rocks to act like transformers and yet when their job is finished they get beamed up to heaven. I will NOT recommend this movie to my friends."
    },
    {
      "rating": "1",
      "text": "There's a well worn phrase \"if it ain't broke don't fix it\". Why Aronofsky felt the need to tamper with an epic story that would/could have been thrilling and thought provoking in it's unadulterated form baffles me.\r What we've been given instead is a crude lecture on environmentalism fused with an utterly corrupted Bible account and a large dose of misanthrope thrown in for good measure.\r I hope this bombs at the box office and forces everyone involved with this rubbish to give pause for thought."
    },
    {
      "rating": "0",
      "text": "I learned some things from this movie! Apparently Methuselah was Gandalf! And Noah built the ark with the help of rock elementals! And \"righteous in the eyes of God\" means \"psychotic homicidal maniac\"! And when the Bible says \"Noah and Shem and Ham and Japeth, the sons of Noah, and Noah's wife and the three wives of his sons with them, entered the ark\" it REALLY means \"Noah, his wife, his kids, Shem's wife, and this guy who snuck on board and tried to kill Noah\"! And those explicit instructions in Genesis for how to build the ark? Really that was a cryptic acid trip where nothing was really explained. Thank you Darren Aronofsky for setting me straight. I thought that I knew how to read, but apparently I was wrong! And thank you Russel Crowe for your most dynamic performance yet!\r for those who can't tell, this is all sarcasm."
    },
    {
      "rating": "1",
      "text": "I can't believe how many positive reviews there are from professional critics! Were they threatened?! Bribed?! Or did they just see a different movie than me.\r This has surely got to be an early contender for worst movie of the year."
    },
    {
      "rating": "2",
      "text": "What do you get if you mix 130 million dollars, a talented but clearly misguided director and a story believed and respected by hundreds of millions of people around the world.\r In this instance, a nonsensical mess thats what.\r The 2 points are for a few striking scenes in an otherwise dreadful movie."
    },
    {
      "rating": "1",
      "text": "first of all they get almost everything wrong.  If you are going to do a historic piece, you should at least try to keep the story correct. only the names re the same and there is an arc full of animals and birds, etc.  that is where it ends being the story of noah.  Cain kills Able and starts an industrial society, according to the narrator, but since when did people in an industrialized society still run around in ragged clothes and animal skins and use clubs and swords?  And then fallen angels come down to help mankind and are crusted with volcanic rock as punishment from God.  That's so wrong, I'm not even going there. And it just gets worse.  Noah is supposedly given the decision to save or destroy all of mankind, by God, and he chooses to destroy all. so this is offensive  not only Christians, but to anyone who ever saw a great story come to screen, and it was all screwed up by Hollywood."
    },
    {
      "rating": "3",
      "text": "Movie held at best 10% of the biblical version of the story.  Acting is ok but too many rock monsters for my liking - I mean ROCK monsters! LOL. Noah is very scary as a character & not at all likeable. want those 2 1/2 hours of my life back."
    },
    {
      "rating": "0",
      "text": "Absolutely horrible! They made Noah look like a fumbling idiot, chasing down his daughter-n-law trying to murder her twin babies because God said only a certain amount could live. He doubted God in the movie and had no hope. The worst part was the rock monsters with glowing eyes who helped build the ark! Say what???????????????????? What the heck? This was more science fiction then biblical. Who came up with rock monsters???? I couldn't believe my eyes! Worse movie ever! The only thing that resembled the bible story was the name Noah, an ark, rain, and the dove. And get this! The villain in the movie even stowes away with them on the ark after the earth has flooded and Noah's son helps plan his father's murder! Say what? Horrible movie!!!! Don't waste your precious money. I want mine back!"
    },
    {
      "rating": "0",
      "text": "I want to know who is responsible for the story of this film; whoever it was needs to be fired... immediately! I believe fiction can only be taken so far. 0/10 would not watch."
    },
    {
      "rating": "1",
      "text": "Are you kidding me?  What, they ran out of comic book super-heroes to make blockbusters out of so Hollywood is resorting to Bible characters?\rAnd even a bible-based movie has to have talking sci-fi monsters to sell tickets to the masses these days?\rI predict in 20 years people then will be laughing at just how cheezy movies today were - like people laugh today at Godzilla movies from the 60s.\r Besides that, it basically was horrible in most every other way.  Bad acting, fight scene after fight scene, boring CGI scenery.   God help us!"
    },
    {
      "rating": "2",
      "text": "Incoherent, confusing, and completely stupid.  Major plot holes, overlong, and entirely unfun. wayyyyyyyyyy too damn long.  if you have small children accompanying you whilst watching this film, be prepared to give them \"the talk\". not about sex, but about incest.  remember incest=wincest!!!"
    },
    {
      "rating": "3",
      "text": "This was extremely disappointing. Yes the special effects were cool but that was about it. The story line was... Noah-esque perhaps? It had little to nothing to do with the bible story of Noah. Amid a large number of Christian movies coming out at this time, people should be aware going in that it is NOT a Christian. It's really an environmental movie. It was less Charleton Heston's 'The Ten Commandments' and far more 'The Day After Tomorrow' or 'Birdemic'. Just terrible, the whole thing."
    },
    {
      "rating": "9",
      "text": "Simply amazing! I get stuck all the course of the film, to the dip of the plot and to the grandiose special effects. Great acting, great elements of emotion, drama, angst, and very few cliches and predictable elements. People who became negative this movie, most certainly mixed their religion and their beliefs. I as an atheist, I attended an amazing story extremely well executed visually and sonically."
    },
    {
      "rating": "9",
      "text": "Before we start, let's make a note about the controversies surrounding the movie. So many people got sensitive because it wasn't their \"exact interpretation\" of the story. Settle down. Be thankful that someone in HOLLYWOOD actually made a movie about this biblical tale. Now, time to review.  Darren Aronosky (hope I spelled that right) is at it again with one of the most destructive and action-packed tales from the Bible. Who better to do it? Noah is a home run in terms of movie making and sits along with Requiem of a Dream and Black Swan in a stalemate. Everybody in the movie does a fantastic job and all feel equal in terms of skill and screen time. While it doesn't have as much action as you'd expect, the drama is still amazing and even sad at times. Speaking of action, what you do get is phenomenal. Giant rock men fighting against regular men with armor and spears, destructive water effects, and my jaw was open so many times during the action. But sadly, I felt there wasn't enough. I'd never want it to be a Michael Bay kind of movie, but if I got 15-30 minutes more of action, I'd be very satisfied. Another flaw I noticed was that it can be a little hard to follow at times. A few times I thought to myself \"OK...let me think this over...\". While the story can be harsh at times, I appreciated these parts and they make the movie feel like something different. There's so much more to say, but you should already get the gist that you should see this movie. It's worth every penny."
    },
    {
      "rating": "9",
      "text": "I felt this movie was astounding – flawed, but astounding.  It is what it wants to be and it does not bow to convention.  It is both a block buster and a psychological character study.  It is both Biblical and inventive.  It is both digital and auteur.  It is also, obviously, very thought-provoking…which is more than can be said for most big movies these days.\r What this movie is – a VERY loose interpretation of the Biblical flood story, with tiny packets of the Book of Enoch and the Qu’ran to flesh out the back story.  As with most Aronofsky films, it is primarily a psychological study.  What exactly does faith mean when it requires a man to let ALL OF HUMANITY DIE?  If that man is sane, how does he react?  Cope?  Adjust to change?  What are the depths of his despair if he feels that his familial compassion equate to failing his God?  These are the questions posed in Noah, and it does a fairly (but not exceedingly) good job working through them.\r What this movie is not – a Bible study or lesson in Theology.  However, biblical accuracy is not one of my criteria for movie critiques.  It would be akin to stating “Dante’s Inferno is HORRIBLE…there is no evidence for nine circles whatsoever in any religious text!”  Obviously, such a criticism would miss the point.  My suggestion is that if you are looking for Biblical consistency you should probably go see Son of God instead.\r There are some slight flaws (e.g. the strength with which Mickey Rourke carries The Wrestler is in a different league than Russel Crowe’s performance; diversions into implied veganism and earth-first philosophy detract from the larger character study, etc.) but the good outweighs the bad.  I choose to believe this movie is a step in the evolution of movies as both big and thought-provoking, and I quite liked it."
    },
    {
      "rating": "9",
      "text": "I don't get all the negative reviews and hate. On one end people are mad because of this director's interpretation of the story in the Bible. On the other end people won't like it because it has to do with the Bible. And then you will have people not like for other stupid political reasons not even mentioned. I get it.... for some reason the film is polarizing. This movie is NOT the same as the cartoon movie you saw as a kid (yes people that is also one guy's interpretation). However it does have essentially everything that is in the Bible with some artistic flair which is cool with me. Sure they don't say \"God\" but everybody knows \"The Creator\" is \"God\" so whatever... that does kinda bug me but I won't hate on it too much. In any case I enjoyed the movie. It has good action, a pretty faithful telling of the story, interesting take on the pre-flood world, fantastic acting etc. I think you guys need to see the movie for what it is and not make it more than it sets out to be. It's a really good film."
    },
    {
      "rating": "2",
      "text": "bleak, too slow, drab, no laughter, no smile, historically inaccurate not that i care...as i was leaving theater a woman said 'that was horrible'...i tried hard to like it because i liked Aronofsky's 'Wrestler' and 'Pi' and Black Swan a little but this was so drab, drawn out...nothing to it...bad news flick."
    },
    {
      "rating": "1",
      "text": "This movie has zero to do with the true Noah in the Bible, and should be considered blasphemy against the truth of God's history provided for us in the Bible. This is typical Hollywood garbage trying to make money from the hype that followed the popularity of that Bible TV show. Apparently they missed the point they need to follow the real story of the Bible not a made up fantasy using Bible characters and general story back drop. I can just see people who know little to nothing about the truth actually think this is what really happened. Sad very sad indeed, but what should we expect from immoral establishment media who hates Christianity and truth."
    },
    {
      "rating": "1",
      "text": "First hour is fine but then it turns into a talk fest with the director making the mistake that if he shows the characters experiencing emotion we will feel it.... doesn't work. The second half slowly dies until you are just waiting for it to be over. The actors are doing an excellent job but there just isn't enough to save it. Don't waste your money, see it on cable where you can watch the best parts and then turn it off."
    },
    {
      "rating": "10",
      "text": "An incredible movie with great graphics, story and characters. As a christian I do not find a unique interpretation of the Noah story a bad thing. No, on the contrary I think it is a really good thing - if I want to read the actual story, I'll read the Bible. The Noah is not a retelling, but rather an attempt to understand the values and to make the short tale something bigger and more complex. And they did it right - drama made me weep, action made me thrilled, conclusion gave me feeling of hope and happiness"
    },
    {
      "rating": "9",
      "text": "Ultimately, Noah is a powerful but complicated experience that’s deeply fascinating in the way it subverts expectations. It will crash over you like the flood itself, knocking you back, allowing you to take in awe-inspiring visuals but also forcing you to contemplate complex questions. An absorbing character study and an action epic all at once, Noah is a highly ambitious, largely successful outing for its director and star."
    },
    {
      "rating": "2",
      "text": "I walked out of the theater and dearly wished I hadn't wasted $10 and two hours of my life. Have you ever heard of Tommy Wiseau's The Room? That movie was a cinematic masterpiece in comparison."
    },
    {
      "rating": "9",
      "text": "Excellent movie! Highly engaging & greatly acted! Some amazing bible themed CG set pieces spread across! Outstanding score by Clint Mansell will drive you from start to final credit roll!!! Amazing movie"
    },
    {
      "rating": "7",
      "text": "I give it a 7 based on how the movie finishes, not how it started because it had a rather rigid start. I was somewhat bored with the first 15-20 minutes and didn't feel like the story was set up that well, which would have really paid dividends later. But once you get through the odd introduction and get rolling with the film, substance suddenly appears. The fallen angels idea was a fun fantasy insertion and the depiction of Noah at times makes good on the observations found in the book of Genesis and how Noah may not have been what we'd consider a saint but was a foundationally-good and noble man that God could work with to restart mankind after the corruption of Cain. The special effects were pretty solid and the casting was overall well executed. It's not a movie I'd love and I may not watch it again but when the film wrapped up I was at least somewhat happy I watched it. If the second half had been less interesting or fumbled like parts of the first half were, I would have probably come away with an indifferent 5 or 6 rating instead. The building of the ark, which is a significant detail of the original story, is almost glossed over and handed off to supernatural beings (not a spoiler), at least in part. This aspect would have been a huge opportunity to expand upon the trials of the wilderness and Noah's family keeping their ark project a secret but the producers didn't feel the building portion to be all that important to focus on. Worth a watch if you're interested in the story the movie is lifted from but as for historical accuracy/source accuracy, it's probably about 50%-60% accurate and the rest is either creative license and outright Hollywood hogwash."
    },
    {
      "rating": "0",
      "text": "Confused, baffling, overly violent humourless and contrived, Noah suffers from a complete lack of focus and direction (other than into the belly of a difficultly realised arc) which leaves its actors struggling, its epic set pieces cold and its emotional engagement minimal.\r Topped with some bizarre outfit choices, a scattering of rock monsters and Ray Winstone typecast as himself you wind up with a quasi sci-fi epic that lacks the cohesive world of Lord of the Rings (surely there was enough source material in the Bible), the gritty post apocalyptic 90s charm of Water World (wheres Dennis Hopper when you need him) and the full on visceral action of Transformers (epic titans falling from the sky sent to protect humanity anyone) all of which it shamelessly apes.\r Russel Crowe appearing from the depths of a (very brief) drunken stupor wandering down a beach in a Noah era dinner jacket was really the icing on a 2 1/2 hour struggle.\r From the director that brought us the amazing Requiem for a Dream, Black Swan and The Wrestler this is a depressing fall from grace.\r Michael Bay all is forgiven."
    },
    {
      "rating": "2",
      "text": "Noah is one of the worst pieces of crap of 2014. The movie doesn't follow the story correctly and half the events in the movie don't make sense. At least the CGI and acting are decent. But by god what an overrated movie. I would recommend this only to hardcore Darren Aronofsky fans, but no one else. 2/10"
    },
    {
      "rating": "0",
      "text": "I just saw this movie and I regret every minute of it.  This is the first thing I'm doing after the movie was over, writing a review of how bad it was."
    },
    {
      "rating": "3",
      "text": "By far the worst and weaker film in Aronofsky career. It's still hard for me to see how he messed up so bad. Russell Crowe barely does enough while the rest of the cast is as useless as the script."
    },
    {
      "rating": "0",
      "text": "Not Biblical except for a very few references.  The special effects were pedestrian, at best.  We were so disappointed, having looked forward to the movie.  We should have walked out when the first words on the screen were, \"In the beginning, there was.....nothing\"!  Or perhaps when the rock beasts showed up!  Don't waste your time or money!"
    },
    {
      "rating": "10",
      "text": "Amazing visuals, great acting and a really good story. I really didn't know Emma Watson was that good. I enjoyed the movie very much. Not a penny was wasted."
    },
    {
      "rating": "0",
      "text": "If you eat meat then you must die... well that is what this movie is about. Humans are evil because we eat meat and need to be wiped off the earth. The action in the movie was outweighed by the boring boat ride. I noticed a bunch of people walk out at that point. I would have too if I hadn't been with some friends. Turns out I wasn't the only one in my group that wanted to walk out. Not only am I mad that I paid for the movie, but I probably won't watch another movie in theaters for a while. Yep, that bad."
    },
    {
      "rating": "7",
      "text": "An interesting movie to say none the less it never stops amazing you. Finally a religious movie that raises the roof and exposes what will happen to the wicked hearted."
    },
    {
      "rating": "0",
      "text": "NOAH is overproduced and just plain awful. Metacritic requires 150 characters but I can't come up with any more to describe this total vapid mess of a movie."
    },
    {
      "rating": "10",
      "text": "Dont listen to the RELIGIOUS NUT CASES reviewing them they sleep with there dear old  bibles every night and feed their bibles with their mouths. When they walk out of the house its like they are seeing hell so its expected for them to give everything one. Only at night time with there bibles they are truly happy. They are sub human and not to be listened to. There 1 actually means a 7 or higher. but as I said before all they can rate anything is a 1 other then there precious bibles"
    },
    {
      "rating": "10",
      "text": "I don't understand the negative reviews. Cinematography is superior, acting is excellent, story line was made suspenseful. (Pretty good for a biblical movie.) All together - very entertaining."
    },
    {
      "rating": "0",
      "text": "Just saw the movie and it is pure garbage from almost any point of view ,such as , script , acting , costumes,  sets . I nearly walked out several times . Any \"critic\" who rates more than 2 stars don't ever trust again , they don't have a clue."
    },
    {
      "rating": "2",
      "text": "I went with high hopes based on some early screening feedback, talk about disappointment! I expected a lot of story fill in and even some liberties on surrounding events, but most of this movie had absolutely no basis in the biblical account. Noah as presented and played by Crowe was no better than the people that were being destroyed! I am used to Hollywood presenting male characters as weak, flawed and stupid, but c'mon! Plus BORING! at least make it entertaining! Now on to the absolute lack of imagination in stealing from LOTR...The cross between Ents and Trolls that were inserted as a major story driver are not only found NOWHERE in the bible (I know they used the giant Nephilim that are mentioned, but really?}, but  I fully expected as Sauron's army stormed the Ark for Gandalf to step out, plant his staff and yell 'You shall not pass!!!'. The amount of visual theft should have Jackson suing!\r All in all a complete disappointment from the now ubiquitous eco-green theme, to the inserted evolution mantra(I am not a 'young earther'...but I also do not buy the evolution hypothesis that has NO support in the fossil record or cell biology), to the weak, psycho Noah, to the whole finding a mate (the bible clearly says that all 3 sons brought their spouses with them), to the Ark being built in less than 10 years by the rock monster from Galaxy Quest, to the stow away, to the snake skin talisman (what the hell?!?)...it was just all completely ridiculous and a turgid plod to an unfulfilling climax...ugggh, what a waste of money and time!"
    },
    {
      "rating": "0",
      "text": "A Horrible perversion of everything the bible teaches, whats worse is it seems to push a vegan/environmentalist/atheistic point of view down the viewers throat.  It's not a movie so much as it seems to be propaganda by the director."
    },
    {
      "rating": "1",
      "text": "Firstly I should admit that I saw this movie for free - and it was still too expensive. Preachy eco-twaddle delivered through wooden performances in an epic marathon of sheer boredom.\r The movie consists of vacant stares into the distance, a nonsensical script, a fight scene from LOTR all interjected by some random documentary clips. The acting in the crying, emotive, scenes was laughable.\r I gave this movie one star for the only actor who gave a convincing performance - Emma Watson. To put how terrible this movie was into context -  the people beside us in the cinema began playing games on their mobiles about half way through the movie."
    },
    {
      "rating": "0",
      "text": "It is just an awful movie. There is no nicer way of saying that. Forgetting the religious objections completely, the movie is long, boring, and not in the least entertaining. When you add to that the fact that it seems engineered to piss Christians and Jews off, you end up wondering what the hell they were thinking."
    },
    {
      "rating": "3",
      "text": "Aronofsky's film has the same flaw as the Biblical Noah story.  At the end, Noah is still hearing voices from on high and believing that, because of that, he is right, infallible, and righteous.  The history of humanity has been haunted by these voices from on high resulting in most of the wars, killing, and general misery.  Despite the \"killing\" part of his philosophy, the Cainanite (sic.) King was right in his comments about free will.  Noah was a truly evil man."
    },
    {
      "rating": "1",
      "text": "I am a longtime fan of the director so my disappointment here is massive. In a nutshell it is a pro-veganism, pro-ecology,pro-self-hating,pro-social isolation and anti-progress gritty reboot of the known tale of the Bible. The main problem with this movie and its most unforgivable trait is that it tries sadistically hard to enforce those ideals to the viewer, to the point that it makes the viewer actually hate the protagonist and his headstrong self-righteous opinions. The society it shows of Sodom and Gomorrah is clearly a parallel of our society today. The only things that differentiate it is the lack of iphones and presence of rugs. 'We are evil and deserve to be destroyed' he preaches. 'It is a crime against nature to eat an animal' he says and insinuates by showing a man gutting a lamb with his bare hands and eating it raw. This is the work of a raging misanthropist wrapped in a Michael Bay exterior so the masses he hates so much will flock  and pay to watch his delirium.   Despite sharing some of his views,I cannot help but hate this unprecedented ideological enforcement and the movie as a whole as a result. If you can ignore all of the above, the movie has some strong visuals and performances by the cast and maybe you should give it a go. If not stay away."
    },
    {
      "rating": "0",
      "text": "I'm going to step away from all religious interpretations and regard this simply on its merits as a film, not as a traditional biblical story. The problem is, it doesn't really have many merits. This film was simply two hours and fifteen minutes of tedium. The special effects are barely worthy of a SyFy Channel original film. The acting is overly hammy and in some cases mind-numbingly wooden, part of which I feel is the part of the script, which eschews actually writing good dialogue for what seems to be just spewing out statements at random. The editing ranges in style from choppy to lingering overly long on mundane, uninteresting scenes. Everything is just...off. As bad as everything else felt, the score was possibly worse. I've never had issue with the work of Clint Mansell before, but for Noah he's opted for a blaring two note score that just keeps screaming the same two flipping horn blasts in your face over and over again. This is also the first time I would ever describe Aronofsky's directing as \"ham-fisted\". Everything feels overdone, self-indulgent and overproduced. I usually walk out of a Darren Aronofsky film contemplating the themes and mulling it over in my head to uncover deeper meanings. This one only stayed with me as a bad memory."
    },
    {
      "rating": "0",
      "text": "A lot of reviews of Noah discuss the straying from the biblical story or other 'spiritual' aspects of the film. As someone who experiences a great movie as a spiritual journey in itself I found Noah to be complete crap. I actually thought the first few minutes (before Mr Crowe appears) were an elaborate piss take of the actual movie (in fact I still am not sure the people who rated this movie highly saw the same movie I did).\r The garden of eden scenes were high school project quality. The Watchers, the whacky rock transformer Ent giant things, were rejects from Shrek. The characters are inexplicable and lack depth. His two older sons are just horny at the end of the world. At least the older one gets Emma Watson, even if she is barren (like most of the scenery before the magic seed is planted and a giant forest appears). Ham the middle son is just a sexually frustrated teenager with a tyrant for a father. One of the many non-sensical plot twists is when Ham goes searching for bacon (makin' bacon bacon) in the city and falls into a pit of dead bodies. What does he find? The girl of his (wet) dreams. They climb out as it starts to rain (not end of the world rain just a splattering) and everyone goes crazy stupid berserk. They all start charging for the Ark. Ham's babe gets caught in a bear trap and Noah arrives and forces Ham to leave her there to be trampled by the horde. While all this is going on the older brother is boinking Emma Watson who has been given a womb by Noah's grandfather, nutty berry lusting drugged out medieval hippy,  Anthony Hopkins.\r Noah somehow gets the notion in his head that his mission is to get the animals going again and kill all the humans. Ok, we are all sinners but no where in the movie does it really say where Noah got this idea. This creates Noah the Nutjob, hell bent on killing his new grandchildren. His wife begs him to punish her and not kill the children. What exactly this means and how this would appease Noah's distored mission from god seems only to indicate that Noah's wife has no understanding that her husband consumption of grandpa's hallucinogenic tea concoctions has had a permanent effect.\r This sort of nonsense just keeps coming to the very end of the film. I think Aronofsky, Crowe, and everyon else involved will be forgetting this one is in their reprotoire pretty quick."
    },
    {
      "rating": "10",
      "text": "Great film, one of the best of it's year easily. A great Aronofsky film. At least the critics appreciated it, most of you are insane and do you not understand what the medium of film is."
    },
    {
      "rating": "10",
      "text": "Biblical accuracy - pretty accurate, most \"inaccuracies\" are just filling in blanks. Reviews that say otherwise need to reread their Bible.\rThe Creator - using the word \"God\" would be an anachronism. 8(?) generations from Adam and Eve makes sense to still call God \"The Creator.\"\rStone Giants - a bit of Artistic license here - Genesis 6:4 \"The Nephilim were in the earth in those days, and also after that, when the sons of God came unto the daughters of men, and they bare children to them: the same were the mighty men that were of old, the men of renown.\"\rEnvironmentalist agenda - reread Genesis 9:4-5 and Genesis 2. God tells man that they can eat plants but not meat until after the flood and even then man will have to account for it.\r As a Movie - Great Dynamic characters, Stunning Visuals, Story that means something. Pretty Much everything you can look for in a movie."
    },
    {
      "rating": "1",
      "text": "First off, Aronofsky and the bible shouldn't even be in the same sentence. I'm not even a bible nut, I don't have a religion, but holy **** this movie sucked every one of the male animal's testicles, and thoroughly. The rock creatures weren't even original, it was like a play on the tree guardians from The Two Towers. I did go into this movie knowing full well the probability it would be a complete train wreck, I just didn't know how bad of a train wreck it could be. Another thing, what the hell was a bear trap doing in the forest when Ham and the girl were running back? Anyways, the 1 isn't even for this movie, it's for making a love scene between Natalie Portman and Mila Kunis become a reality."
    },
    {
      "rating": "0",
      "text": "A story from the bible meets science fiction with rock monsters!?!?  What were they thinking?  Would have definitely skipped this movie if the trailer showed how truly ridiculous it is.  The rock monsters are not shown in the movie trailer at all!"
    }
  ],
  "recommendations": [
    "exodus_gods_and_kings",
    "children_of_men",
    "sanctum",
    "district_9",
    "prometheus",
    "snowpiercer",
    "apocalypto",
    "the_shape_of_water",
    "greenland",
    "lucy",
    "vivarium",
    "the_titan",
    "divergent",
    "the_counselor",
    "the_lobster",
    "the_book_of_eli",
    "babel",
    "contagion",
    "interstellar",
    "sunshine",
    "antebellum",
    "code_8",
    "after_earth",
    "the_forever_purge",
    "mother"
  ]
}