{
  "id": 109,
  "title": "Nobody",
  "starring": [
    "Bob Odenkirk",
    "Connie Nielsen"
  ],
  "runtime": 92,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "Hutch Mansell, a suburban dad, overlooked husband, nothing neighbor — a \"nobody.\" When two thieves break into his home one night, Hutch's unknown long-simmering rage is ignited and propels him on a brutal path that will uncover dark secrets he fought to leave behind.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oBgWY00bEFeZ9N25wWVyuQddbAo.jpg",
  "categories": {
    "plot": 5.739130434782608,
    "acting": 6.7894736842105265,
    "ending": 8.5,
    "soundtrack": 7.75,
    "cinematography": 6.5,
    "familyFriendly": 3.0,
    "funny": 6.428571428571429,
    "action": 7.630434782608695
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Bob Odenkirk is an unlikely action hero, so he’s cast as a milquetoast accountant with a mediocre family life. After an incident at home, his secret past bubbles up and he goes on a violent rampage, revealing his special set of lethal skills. As revenge flicks go, this one has its share of kills, but without anything new…just lots of careening cars, hard hits and bullseye gunshots. Since there’s an accomplished actor in the lead, he gets the opportunity for a dramatic nod or two. The premise borders on absurd and tasks credibility, but some people might enjoy watching him ferociously kick many asses."
    },
    {
      "rating": "5",
      "text": "Almost a carbon copy of John Wick 1, nothing new, poor \"russia bad\" goon badguy cliché."
    },
    {
      "rating": "8",
      "text": "Wow i was not expecting this movie to be that good. The action,  acting,  story , music and probably everything is excellent. I highly recommend action lovers to watch this movie. Simply excellent"
    },
    {
      "rating": "5",
      "text": "Not sure why this is as hyped as it is. I love Bob Odenkirk, but this was a run of the mill, John Wick clone for me. It almost feels like it's plugging a series or at least a sequel. I just found it super bland and derivative. It's one of many action flicks that uses the dark past trope. Soundtrack and cinematography weren't even that noticeable. Competent but forgettable action movie is the best I can say for it. History of Violence did it way better."
    },
    {
      "rating": "6",
      "text": "It earned the points because basically since the beginning, Nobody makes it clear that it will not try to fool anyone into believing that there is more than what you see.Nobody doesn't come to reinvent anything, and at no time does it seek to do that.This is old-fashioned action. Tough and direct, without concessions and without apologies.I didn't quite buy into Bob Odenkirk's badass performance, but he knows what he's aiming for, and gets the movie off the ground. What can I say? From time to time, movies like this one are necessary to relieve some stress."
    },
    {
      "rating": "6",
      "text": "Very easy, the first part of good even 7.5 but the second part is a 4.Film is good for one time watch."
    },
    {
      "rating": "6",
      "text": "You: Mom, can we have John Wick?Your Mom: No, We have John Wick at home.John Wich at home: Nobody."
    },
    {
      "rating": "3",
      "text": "It seems that whole movie is being copied and it's like a maths question with different values given in it. It posses scenes somewhat copied from The Mechanic, The Transportor, etc. And everything copied from John Wick, just the plot is different and very few scenes are left to be copied.Everyone compares It with John Wick. But John Wick has a whole different Legendary taste. Nobody has a past mystery of his being feared by some of them who knows him. And another mystery is of that cards tattoo on his wrist, Nothing much, The Storyline is decent but the length of the movie concerns much just in one and half hour and less if we cut intro and outro of the movie. This movie is a one-time show you watch and let it go.  There's no much to exaggerate about the details of the movie or to focus on character as movie doesn't offer much to the character other than like a John Wick past mystery. So it's not much amazing while watching the movie. One can while seeing the movie all time think that this was the scene in John Wick and that wasn't\". Nothing much"
    },
    {
      "rating": "3",
      "text": "This movie isn’t that good. It’s performances are stale and every character we are supposed to care about is invincible taking away any stakes it could potentially have. I know it is intentionally supposed to be bad, (at least I hope it is) but it’s not good at being funny while it’s intentionally bad. A lot of the lines are just dumb and not in a funny way."
    },
    {
      "rating": "0",
      "text": "One of the most pointless films I've seen. There's no overarching theme that ties it together, no value present in the film, and a complete lack of subtext. The movie hopes to overcome it, like a \"Mr and Mrs Smith\" or a Michael Bay movie, by \"violent entertainment,\" which at best would get a 1/10. That doesn't come close to justifying all the other film's shortcomings. Gratuitous violence + cookie-cutter, arbitrary plot = bad movie."
    },
    {
      "rating": "8",
      "text": "at a time when the usual release of a movie in theaters is a rare event, the appearance of a great action movie is a good chance to remember that cinema still exists"
    },
    {
      "rating": "8",
      "text": "Nice action movie!Great action moments, good acting.A successful second film for director Ilya Naishulle !! I'm waiting for the next movie from him :)"
    },
    {
      "rating": "10",
      "text": "People say this is a remake of John Wick, but the Dodge Charger is WHITE not BLACK and it is a CAT not a dog.  but otherwise, it is just a terrible day to be a Russian Mobster."
    },
    {
      "rating": "7",
      "text": "John Wick    - Nobody    hitman Backstory  - Soldier backstoryDog    - Cat BraceletBad Guy EA Europe - Bad Guy EA EuropeNon AI Extras    - Non AI ExtrasOK it's fun formula. But change asset and serve again and again. I don't know. Charm gone slowly."
    },
    {
      "rating": "10",
      "text": "must watch film. i came out of the pandemic to watch in theatres and I'm completely satisfied. only wished it was longer"
    },
    {
      "rating": "10",
      "text": "So much violence, Doc from Back to the Future wielding a shotgun and blasting away, and tons of humor to fill a 1 hour and 30 minute slot in your day. Absolutely recommend for action thriller and/or John Wick fans."
    },
    {
      "rating": "8",
      "text": "Another winner from Ilya Naishuller, director of \"Hardcore Henry\" and all-around action movie maestro. \"Nobody\" may not be all that interested in introducing novel premises to the genre, but,  damn it, if it doesn't execute on its well-worn premise in spades. Thrust forth by an impeccably game Bob Odenkirk and held together with stylish direction and enthralling choreography, I'd be hard pressed to say that I've seen another action movie within the past few years that's surprised me more. You also have to appreciate it when an action movie commits to utilizing inventive action sequences throughout. Leave it to the \"John Wick\" franchise's Derek Kolstad to keep things lively and vibrant on that front as well (no pencils to be found in this, however). In the end, would I mind another one of these? Not at all, actually! I'd honestly be happy to see it!"
    },
    {
      "rating": "7",
      "text": "Nobody has a pretty standard 'hitman activates from his civilian cover to get revenge' plot, but it has plenty of style and has its kinetic pacing and decent action choreography keep things interesting. The cast is great here. Good soundtrack also!"
    },
    {
      "rating": "10",
      "text": "This is what I need when there is not John Wick. Great Film. Director Ilja who made Hardcore Henry, made here great work. 10/10"
    },
    {
      "rating": "2",
      "text": "This movie sucks big time. But first, know that the movie is competently made. Lots of violence and crazy action. My problem with this movie is that it feels like one long buildup for a punchline that never comes. Basically, Bob Odenkirk feels emasculated, so he turns to senseless violence at an increasing rate of scale and absurdity. The action got so silly that I became disengaged and uninterested. The plot was so poorly constructed that it felt dreamlike, which destroyed the sense that anything was really at stake, which caused all the action to feel hollow and tedious. At one point the movie itself gets bored with the action and speeds things up with a quick montage of him storming some Russian mafia place and killing hordes of baddies. The story got so nutty that I expected them to reveal that Odenkirk was merely imagining himself as a badass ex-hitman as an escape from the feeling of emasculation. As much as I hate the \"it was all a dream\" trope, it was the only way I could see this movie making sense. But that doesn't happen. Things just get more and more and more stupid until the very end. Like, given the good reviews and the fact that Bob Odenkirk is in it, I thought this movie might actually be good. But I was wrong. This movie sucks big time."
    },
    {
      "rating": "10",
      "text": "Всем советую посмотреть, можно и посмяться, и позлиться. После фильма появлятся желание смотреть бесконечно.На одном дыхании 10 из 10."
    },
    {
      "rating": "10",
      "text": "Nobody is about Hutch Mansell his house gets broken into while that happens his daughter asks about her bracelet and he gets pissed about the first scene where the action starts he did not know one of the people on the bus was Yulian Kuznetsov brother and he gets very mad about tracks him down figure out who did it But my thoughts on the movie It definitely feels like a john wick movie that is my issue but that does not really bother me bob Odenkirk is amazing in this movie his performance is awesome the villain is a little bit weak that is really it I really like this movie this is my fav movie in 2021 so far So I give Nobody An A-"
    },
    {
      "rating": "8",
      "text": "This film was a breath of fresh air for me in the action genre.  Realistic, well-edited, sarcastic at times.  Finally, in Hollywood, they were able to show an adequate image of a Russian gangster, without idiocy (Hello John Wick).  I hope the film will get a good box office and the studio will continue to work with Ilya Naishuller.  :)"
    },
    {
      "rating": "10",
      "text": "Super good movie , I love this movie , the action in this movie was the best ."
    },
    {
      "rating": "10",
      "text": "Lots of action, very sarcastic. Recommended if you like John wick .........."
    },
    {
      "rating": "10",
      "text": "One of the best action movies I saw for a long time!The thing setting apart this movie from other action movies is, that it's very realistic! The hero is getting kicked also, and its great! Nothing like the unrealistic action hero movies, where the hero is getting out without a scratch! Worth every penny to watch!"
    },
    {
      "rating": "10",
      "text": "A breath of fresh air in this woke political **** show of movies we have been served lately."
    },
    {
      "rating": "10",
      "text": "One of the best movies I have seen. Good actors, and good job by Ilya! Reccomend this movie to all!"
    },
    {
      "rating": "0",
      "text": "Джон Уик на минималках. Ничего оригинального."
    },
    {
      "rating": "8",
      "text": "Seriously solid action film. And despite some claims that it's a satire of the genre, that doesn't come through too much and certainly doesn't inhibit the viewer from enjoying it as a straight forward shootem'up. At a time when people need escapist fare more than ever, Hollywood by and large seems only interested in preaching, condescending and scolding rather than allowing people to forget their troubles for 90 minutes. \"Nobody\" is a truly welcome exception to this tone deaf, postmodernist trend. Let's hope it catches on. It would good if the Entertainment industry got back to the business of actually entertaining."
    },
    {
      "rating": "7",
      "text": "Funny but exciting 'satire' from the maker of the John Wick series seemingly placed ordinary 'nobody' played by Bob Odenkirk, kicking Russian mob's asses. Great action sequences, peppered by surprising supporting turns from 'Doc Brown' that will delight film fans everywhere."
    },
    {
      "rating": "10",
      "text": "This was my first movie back at the theater after getting vaxxed, so maybe missing the theater experience has caused me to rate it a point higher than I probably should. However, this movie was excellent. It had the action of a John Wick movie, was more grounded in reality like Taken, and having some gravitas like A History of Violence. If seeing a mash-up of those three movies helmed by the excellent acting of Bob Odenkirk, then I would see this as soon as possible. Can't wait for it to be on streaming for a second viewing."
    },
    {
      "rating": "10",
      "text": "Very great movie. Long long time I didn’t see this amount of violence on cinema screen"
    },
    {
      "rating": "8",
      "text": "I get the comparisons to “John Wick,” but they don’t add up to anything that makes this movie any less entertaining or enjoyable than anything that franchise has put out to date. As a matter of fact, I liked this movie so much more than entire current three chapters of Wick put together. A “style” over “substance” argument can be made because of that. I also felt that, setting aside his character name is Hutch, “Nobody” is a much more relatable movie because the lead character’s life and how that is interestingly portrayed at the start. It’s not a perfect movie. There is only one character that has any story arc and development. That’s not a problem as Hutch is very well fleshed out by Bob Odenkirk, but the real cliché here was the way this was edited. The filming, framing, lighting etc. was fine, but the fast cuts at the top of the film stand out as not being necessary. It was somewhat confusing and did add the the doldrum of the leads hum drum life. I also would have loved to have actual source music cues backing the action when the antagonist was singing the last time. Andy Williams is a good choice, but comes off as an artistic choice that other films have already made and this film is trying to match. I also like this “world” a little more than other mentioned action films as it felt much more grounded. That’s a strange thing to say with all the murders that happen on screen. It’s very violent and has more gore then an average action flick, but it left me with a highly charged sense that I will be watching it again soon. I’d recommend it for anyone who likes explosions and the idea of a mobile mobster 401k."
    },
    {
      "rating": "10",
      "text": "oh boy, what an amazing gem!This movie is just an amazing underdog.I have in with low expectation but this movie blew me away.The delicate humor, the action, the seriousness, the amazing choreography, and more.my only regret is not watching this movie in the cinema, easily passes any other movie in this category... yes I do mean John wick. I really hope they will make a sequel, but I doubt it. it's amazing as it is :)A must see for action lovers :D"
    },
    {
      "rating": "9",
      "text": "This film is one of those cases in which violence is a core part of it and not artificially involved. The surprising thing is not only the action scenes but to see Bob Odenkirk (Breaking bad, Nebraska) and Christopher Lloyd (Back to the future) in inconceivable roles. To see it while you hum No more Mr. nice guy by Alice Cooper."
    },
    {
      "rating": "8",
      "text": "Nobody is a good action movie. It is a bit a copy of John Wick, but the story has certain distinct aspects about it. The way the movie is cut, is very engaging. One of the best edit I have seen. The fighting scenes are very well done and very precise in imagery. The music is a nice touch and diversified. The acting is really good from the main actor. I found the villains to be average at best. Christopher Lloyd is a great presence here with some humour. I give it 78%. Nothing too bad about this movie apart the fact that it recycle a lot of things from other movies."
    },
    {
      "rating": "7",
      "text": "Nobody (2021) is directed by Ilya Naishuller, director of Hardcore Henry, and written by Derek Kolstad who also wrote the first 3 John Wick movies.  David Leitch is also the producer of this and also directed the John Wick series. Seeing who worked on this gave me an expectation of fun and exciting action sequences similar to that of John Wick. The premise is \"Hutch Mansell fails to defend himself or his family when two thieves break into his suburban home one night. The aftermath of the incident soon strikes a match to his long-simmering rage. In a barrage of fists, gunfire and squealing tires, Hutch must now save his wife and son from a dangerous adversary -- and ensure that he will never be underestimated again\". So does Nobody (2021) live up to my expectations or fail miserably?Firstly, Bob Odenkirk gives a great performance as the main character, Hutch Mansell. Bob Odenkirk doesn't look like an action star, no offence, so he perfectly fits the mundane and plain character of Hutch. He is perfect in really making it seem like this guy is really \"nobody\" special. However, when it is time for Hutch to become a super badass, Bob Odenkirk somehow manages to convince the audience that this bland and unimpressive guy is actually able to kick your ass. It feels completely natural and believable. He also does every stunt and it definitely shows. I also have to praise Christopher Lloyd as David Mansell, Hutch's father, as he is playing a role that you wouldn't expect from that actor.The action scenes are as exciting as you would expect. One thing about the action sequences that sets it apart from John Wick is that he isn't perfect and actually gets beaten up a lot. John Wick feels like a superhero and there is never really a feeling that he is actually in danger. In Nobody (2021) it honestly feels like Hutch is vulnerable and that his old age is making him weaker to his opponents to a certain extent. It gives a sense of danger and makes it feel like Hutch could potentially die which I appreciate. Additionally, the tone of this is a lot more comedic and this works well. I did get quite a fair bit of chuckle from certain scenes and it definitely gives a breather from all the murder. Nevertheless, Nobody (2021) feels way too much of a carbon copy of John Wick. There is an action scene where the bad guys invade the main characters home, there is the unfortunate mishap of the bad guys robbing the wrong persons home, there is the main lead coming out of retirement because they did something unforgivable, there is the people being scared of his reputation moment, there is him getting help from friends from old times, there is an evil Russian group that feels beat for beat from John Wick. It just feels kind of lazy and definitely doesn't do anything groundbreaking.The story and characters also lack a lot of polish. I don't end up caring about any of the characters because they don't spend enough time developing them including the main character. They sprinkle in some flashbacks or conversation about the main character that gives a sort of understanding why he is a badass but they don't explore any of the supporting characters. Nobody (2021) begins with him and his wife's relationship being trouble but why? Hutch has a half brother and his dad who appears but we don't get a complete understanding about their relationship either. Nobody (2021) needed 10 more minutes of runtime to explore this. The main Russian villain is just so generic as well that it is kind of disappointing. Overall, I wanted a fun action movie and that's exactly what I got. It didn't surprise me or anything and I feel like it was quite a forgettable movie by the end. However, I had a great time with its 90-minute runtime and I still would love a sequel. Heck I would even love for it to become a part of the John Wick universe and have Hutch meet John Wick. Bob Odenkirk is the biggest reason to give this a watch thanks to his amazing performance and stunt work."
    },
    {
      "rating": "5",
      "text": "Straight up garbage! what a boring most generic movie you can imagine! Netflix makes better movies than this and that's saying  a lot."
    },
    {
      "rating": "10",
      "text": "Great movie, I like the format. Similar to John Wick, I hope they will make collaboration someday."
    },
    {
      "rating": "7",
      "text": "This film isn't going win any major awards let's just gets that out of the way. This film is however very entertaining to go watch. It's funny in its' own corky way. This was definitely worth the money and in the green as far as review goes. If you're bored in this pandemic I highly recommend this film."
    },
    {
      "rating": "8",
      "text": "A good action film with a complicated enough character (for the genre) to make it all satisfying. I agree with those who say there's nothing new here, but why should there be? No need to recreate the wheel."
    },
    {
      "rating": "10",
      "text": "Watched the movie over the weekend. Really enjoyable movie to watch with friends."
    },
    {
      "rating": "10",
      "text": "great movie. the action is satisfying, refreshing, and tho a bit gory at times i can just cover my eyes because you can expect it coming right before it happens. love bob odenkirk. wonderful acting and beautiful movie with great choice of songs that are from old times. (SPOILER) love how all the bad guys die in the end too. justice is served. hooray haha."
    },
    {
      "rating": "10",
      "text": "Sequel... John Wick and Nobody Destroy the World! Nobody was fantastic. Bob O. Is amazing."
    },
    {
      "rating": "8",
      "text": "A great movie but i wish they had explored more about his past...and a bit longer movie it's a bit short but still i want a chapter 2!!"
    },
    {
      "rating": "7",
      "text": "Put your brain in nuetral and go with the silly story. I enjoyed Bob Odenkirk and Christopher Lloyd playing off of each other, and dropping witty bon mots every time that wasted a particularly \"bad\" bay guy. I've seen worse, but this is perfectly fun Saturday afternoon entertainment."
    },
    {
      "rating": "10",
      "text": "I want to say that 'Nobody' is an intriguing story that is quite entertaining, and at the same time makes you more closely follow what is happening on the screen, because it is a really stylish, dynamic and far from stupid show, which has become a real decoration of its genre."
    },
    {
      "rating": "8",
      "text": "No woke ass agenda's, a straight white male lead, and it's just a good fun action movie. Refreshing to enjoy a movie from start to finish without having to deal with Hollywood's typical social political garbage. Thank you! #DontPutArtInABoxHollywood #FeedomOfExpression"
    },
    {
      "rating": "10",
      "text": "Fresh style of an old story giving a new role model to all wannabe hero fathers."
    }
  ],
  "recommendations": [
    "kingsman_the_golden_circle",
    "terminator_genisys",
    "the_a_team",
    "angel_has_fallen",
    "the_guardian",
    "john_wick",
    "wild_card",
    "the_suicide_squad",
    "the_tax_collector",
    "run_all_night",
    "skyscraper",
    "four_brothers",
    "avengers_age_of_ultron",
    "i_am_number_four",
    "hancock",
    "bloodshot",
    "gemini_man",
    "contraband",
    "poseidon",
    "the_equalizer",
    "the_mechanic",
    "the_marine",
    "rocknrolla",
    "glass",
    "furious_7"
  ]
}