{"id": 3049, "title": "Nocturnal Animals", "starring": ["Amy Adams", "Jake Gyllenhaal"], "runtime": 117, "genre": ["Drama", "Thriller"], "description": "Susan Morrow receives a book manuscript from her ex-husband – a man she left 20 years earlier – asking for her opinion of his writing. As she reads, she is drawn into the fictional life of Tony Hastings, a mathematics professor whose family vacation turns violent.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mdLDgQBD0va09npSQX5Zgo2evXM.jpg", "categories": {"plot": 7.438356164383562, "acting": 7.702127659574468, "ending": 7.846153846153846, "soundtrack": 10.0, "cinematography": 7.833333333333333, "familyFriendly": 3.0, "funny": 7.75, "action": 9.285714285714286}, "reviews": [{"rating": "6", "text": "It's brilliantly done, very well acted, the atmosphere Tom Ford has created is very good. It is very stylish and good looking movie, narratively very well done, and the story inside a story is done very well, even for a moment I didn't think that this thing is heavy handed.Acting by Jake Gyllenhaal is awesome, I'm becoming a big fan.Amy Adams, Michael Shannon, Aaron Taylor-Johnson has acted brilliantly as well.But, somehow, you know both the narratives doesn't resonate with each other very well, but it is handled very well and I liked the ending which most people seems to have the problem with.It's going to be a polarising movie, I think Gone Girl fans is going to love it, some people will hate the movie, I'm in somewhere between."}, {"rating": "6", "text": "The movie is a weird mixture of a thriller, drama and grotesque, stylish with a twist.There are three story lines in this movie, they interleave and interfere with each other and that is an interesting idea. Reality mixes up with a fiction novel and with heroine's past. I liked that.There are several great actors in this film. Michael Shannon does not have a big role but boy does he shine there...Also Amy Adams and Jake Gyllenhaal are terrific.What I did not like about the movie was the script. In my opinion it needed a serious rework.As a result, it was interesting to watch with not much of a final impression."}, {"rating": "0", "text": "Complete waste of time. Unhappy housewife realizes she's bored with her life and reminiscences about he former husband. Husband sends novel. Flashbacks. Novel is a boring asf revenge that has no excitement or tension whatsoever. Ending is lame and predictable. Watch porn or something else."}, {"rating": "8", "text": "The movie is ok. It shows two stories line together. The story is powerful and to show the character of main character's ex husband through his novel which is nice.The movie is nicely done. I am not sure I would enjoy as well as the first scene.I am not sure whether the script is trying to make jokes of the modern art."}, {"rating": "5", "text": "While incredibly atmospheric and well shot, Nocturnal Animals ends up being forgettable, if not at some points \"so-bad-it's good.\" Michael Shannon definitely delivers a good performance, but most of the rest of the cast is way too melodramatic, and the script doesn't help. When the credits roll, you'll feel like you watched a run-of-the-mill revenge thriller try way too hard to be an art film."}, {"rating": "4", "text": "When watching a movie, I tend to ask a few simple questions if the story and aesthetics don't appeal to me personally.  Those questions are what is the point of the film?  What does the film add to life?  What does it give the audience?For this movie, which I found neither thrilling, nor particularly dramatic, the answers are as follows.  The point of this film seems to be the exploration of shallow / base and dark human emotions.  Nice.  This film adds nothing to life in my opinion.  The technical aspects are not new, nor are they inspiring as they do not serve a useful point.  While it can be argued that darkness has a use, it, like lightness or positivity needs something to contrast and / or interact with.  A film without humour is a dead object, just as is a film without darkness.  This leads to what it gives the audience - well, it does provide insight into the darker parts of human psychology and adds to nihilist philosophy.  It should probably be classified as a horror film.  I've heard others compare it to some of Lynch's work, but it doesn't have the spunk, the verve, nor the vision of Lost Highway or Mullholland Drive.  It is not phantasmagoric, nor striking in the digesis.I am open to hear what makes this film good. It really isn't in my opinion, but then again ones mood is important when watching films, and mine isn't good today. Heh, this film really didn't help."}, {"rating": "8", "text": "Great movie thank to superb acting by Jake Gyllenhal and Amy Adams. The movie tells the story of a woman reading a book wrote by her ex husband- The real life story is not dat intriguing, but the one of the book is quite good."}, {"rating": "10", "text": "Incredible. This movie is so rich powerful and deep ! Must be seen.The actors play well, the story is intriguing. There is something in it that few movie got."}, {"rating": "5", "text": "Although this is a pretty film, with some decent performances, that's about where it ends - the plot drags for large chunks of the film, and the 'non-ending ending' that seems to be in fashion these days is incredibly unsatisfying. There's a lot of style, but not much substance."}, {"rating": "10", "text": "Powerful, mesmerising, incredible. Nocturnal Animals is a complex story that will stick with you for days. Tom Ford is a genius! I loved the cast: Amy Adams and Jake are stunning"}, {"rating": "7", "text": "I was quite looking forward to checking this film out due to the fact that it would be Tom Ford's first film since his directorial debut clear back from 2009 \"A Single Man\", which proved to be a very beautifully shot and acted film. Rather than just focusing on artistic vision for this film, Ford also gets a little more nitty-gritty this time around as well with a pretty tense and at times violent thriller of a plot. However, the film also felt a little too disjointed for my liking, as it switched back and forth far too often between characters, plot points, etc. And even by the end of the film, it felt as though it just ended while skimming past or not acknowledging certain things, including forgetting about and not resolving a plot point or two. On the plus side, the acting from Amy Adams and Jake Gyllenhaal were great standouts for the film and Ford's keen eye for artistic and aesthetic vision is greatly intact with this film, just as it was with \"A Single Man\". Overall, I felt as though this film wasn't too certain of what direction it wanted to go in often times, as it certainly wasn't as narratively focused or straightforward as \"A Single Man\". Nonetheless, the talented cast and performances along with Ford's unique style and direction helped to make it worthwhile for the most part."}, {"rating": "10", "text": "I had to take a couple days to process this movie. From the opening shot of this film you can already predict on what kind of film \"Nocturnal Animals\" is going to be. Now a forward warning for people who plan on seeing this movie, this is an extremely hard to watch film. No spoilers of course but the first scene in the movie is a bit hard to watch and some of the people I went to watch the movie wanted to walk out of the theater at that moment. If you don't like watching movies with hard to watch imagery and really tough subject matters, I would not recommend seeing this. But for people who really want to see a pretty much, perfectly directed art-film that will get under your skin, \"Nocturnal Animals\" is a must see. I like to describe this movie as a mix of \"No Country For Old Men\" and \"Gone Girl,\" and surprisingly I found myself enjoying this film just as much as I enjoyed those two films. Right off the bat, all the performances in the film are fantastic. The stand out performances for me was for sure Jake Gyllenhaal (who really needs to be nominated for an Oscar by now), Amy Adams, and surprisingly Aaron Taylor-Johnson, who gave a really convincing performance that was very chilling. But my favorite aspect about this film for sure has to be the direction. This film is suspenseful as hell. And the imagery is beautiful and there isn't a scene in this film where I felt bored even though the film is slow paced. Sometimes slow pace can work and sometimes it can't and in this case it definitely work. I most certainly also have to tell you, that this film is so unique. I'll just say for the sake of no spoilers, that there are two stories within' this movie that each have similar connections that really play off a strong theme in the movie that in the end really makes you think. This film makes you think about hard and terrible events that happen in the world today and they really make you process the themes behind them. Overall guys Nocturnal Animals blew me away. This is by far one of the best movies of the year, it's definitely my favorite mystery, drama of the year, and if you're into powerful, intense thrillers that are artsy but not over the top artsy, I think you'll love Nocturnal Animals like I did. For me, overall, Nocturnal Animals gets a score of 10/10 and a grade of an A+."}, {"rating": "9", "text": "Really really good.  The movie hooks you from the beginning imagery daring you to look away.  Disgusted while intrigued.  The story was really good and unpredictable.  Just when you think you have the story figured out, it changes direction and by the end you find yourself completely enthralled and thinking about what you were just shown.  I'd have given the picture a 10, but it didn't leave me with any positive feelings when I left the theater.  However, it was really, really good!"}, {"rating": "9", "text": "That's some terrifying **** right there! Fashion designer Tom Ford has written and directed his second movie, a multifaceted revenge thriller which is even better than his first, 2009's \"A Single Man\".Both are visually stylish, of course, which is expected from fashion guru, both have interesting premise and good actors, and both have this cold, unsettling atmosphere which tries to keep the viewer at some distance.In short, Ford has managed to take everything good from his solid debut project and bring it to the next level with \"Nocturnal Animals\". It's more lively, gripping, effortlessly cool and deeper. There are two stories, interwined in a way which may make viewers wonder whether it's real or imagined by the character. But it is ambiguous in a best possible way, not trying to f--k with our minds and then leave us hanging.An unhappily married woman (Amy Adams) thinks she wants his first husband (Jake Gyllenhaal) back. And she reads his novel, a violent thriller, which seems like a revenge tale. And then things get more, er, complex.On-screen events are exciting already but Ford the writer turns out surprisingly skillful at making it even varied, without getting stuck or losing steam, or letting us think that we know where all this ends up. He even playfully takes jabs at his main fashion job and the lifestyle and personal sacrifices that come with it. And the whole result really makes you feel something for the characters, unlike many of the thrillers that only manage to arouse the viewer during their best bits.It's not mostly about Adams and Gyllenhaal. There is a number of smaller but important characters and cool performances. We have Michael Shannon, Aaron Taylor-Johnson, Isla Fisher, Armie Hammer, Michael Sheen, Laura Linney.The cast is good enough reason to watch it. Everybody adds something worthwhile to the experience, even Sheen and Fisher and especially Linney who all have rather small roles used to move the story along. Shannon brings his usual magnetic mix of cool and creepy. Gyllenhaal manages to move between having balls and ball-less state without turning unbelievable or too heroic. Taylor-Johnson as the bad guy even got a Golden Globe for his work (the only one for the movie although Tom Ford got nominated for both best movie / drama and adapted screenplay). He really deserves it, he is evil at its most subtle and delicious. Delicious to watch, I mean.But I am especially happy about Amy Adams who is often used in the movies as just a pretty face or supporting woman. In 2016, she has had two strong roles, in a thinking man's sci-fi \"Arrival\", and now this. Her screen time may be limited but she surely makes the most of it, captivatingly playing out both worlds that the character has hiding inside her. I believed her both as a lively young woman and the jaded older one that's missing all the ideals that she had decided to throw away long time ago.Based on a novel by Austin Wright which Ford wanted to adapt into two movies initially, one true to original, the other not so much. I am not sure which way he chose ultimately but what a ride, eh?PS No, I am not giving 9 out of 10 to every movie I watch from now on. The last three have been just some of 2016's best of the best."}, {"rating": "6", "text": "Looks great and all the actors deliver. However, plot is lacking. Film suffers from trying to talk about the negative aspects of humanity, but is ultimately about rich white people problems. The story-within-a-story is a bit of a cliched raped-and-revenge story and I don't think the story does enough to justify its existence."}, {"rating": "8", "text": "You can certainly tell that writer/director Tom Ford is also a fashion mogul, cause this film is crammed with stylistic flair: beautiful people, lovely lighting, elegant locations and cool clothes. It's also a somewhat gripping suspense drama. Amy Adams plays a fancy LA gallery owner who gets a copy of her ex-husband's (Jake Gyllenhaal) novel, which is a thinly disguised revenge narrative. The film alternates between her reading it, the story being reenacted and flashbacks to their past relationship. The concept is sometimes clever as it pieces the parts together, but sometimes it's merely dominated by the beauty of the design. Adams and Gyllenhaal are both fine, but the standout performance comes from Michael Shannon as the sheriff.  Even though the movie is compelling and sensual, the drama doesn't always live up to the aesthetics."}, {"rating": "10", "text": "Nocturnal Animals another amazing job of Amy Adams in 2016, a tricky police thriller, filled with suspense, which requires an active viewer who gathers pieces to solve the puzzle. The story is constructed with three fragments: the life of Susan as she reads a manuscript from her ex-husband; the story that tells the book; and the events that surrounded the divorce. Each fragment has its own intrigue worthy of having an individual movie, but here they blend perfectly, jumping from one to other, enriching the next sequences. The protagonists are developed in a very realistic form, with respect but not gently at all, we reach the center of each one, you get to know what moves them, what hunts them, which are their profound desires. As the plot reveals the conflict you realize that not everything is white and black, while one character emerges the other collapses. The secondary roles are not forgotten; everyone has their own struggles, that are independent of the main conflict, but leads them to participate. All these thoughts and feelings are sublimated at the end, in a visceral scene marked by a lack of empathy that is breathtaking. Amy Adams is marvelous, one the best performance of her career, the way she moves, her expressions, skin tone and eyes from a person with the fatigue of living many lives.  Jake Gyllenhaal, Aaron Tyler-Johnson and Michael Shannon are stunning too. The photography and music accompany the purpose of the film."}, {"rating": "7", "text": "It's a pretty good film. Not as good as the trailers make it look, but still, worth watching. The trailers were a little deceptive. What looked like a thriller with Amy Adams being hunted by Jake Gylennhal more about a novel within the story than anything else. I guess I would have enjoyed the movie more if the trailers had been more honest. On the other hand, great story, and great performances from the main cast."}, {"rating": "10", "text": "One of the best movies I have seen in a long time. I don't get the people who say it's pretentious. I guess they just don't like art dealers. I also don't get the people who say it takes swipes at conservatives. That is hilarious considering the entire point of the movie, which was apparently completely lost on that reviewer, reflects a quite conservative point of view. One reviewer in a positive way compares this movie to Gone Girl. If you hated Gone Girl and thought it was garbage as I did, have no fear. The story of this movie is nothing at all like the ridiculous plot of Gone Girl. A woman is married to a handsome guy who cheats on her like there's no tomorrow, and she knows it. She receives a novel manuscript that has been accepted for publication from her ex-husband, whom she did not believe in as a writer at all and whom she left for the handsome guy she is now married to. As she reads his manuscript it is acted out on screen - and it's great - and by the very end when she goes to a restaurant to meet her ex, the whole thing comes together. If you like disturbing well-acted thrillers, if you liked Deliverance for example, you will like Nocturnal Animals. I don't want to say more and give it away except that the novel that's acted out involves violent crime in the southwest, creepy criminals right out of Truman Capote's, In Cold Blood, a desperate husband and a very crusty old detective -- and acting of the highest quality. Of the movies I have digitally rented over the years, I have actually then gone on to purchase maybe half a dozen total, of which this is one."}, {"rating": "8", "text": "Usually, people ask if the film did the book justice. In the case of 'Nocturnal Animals', we should ask that question the other way around. While the book was overly long for its content, contained so many useless details, and had a style as basic as a style can get, the movie is the exact opposit, having the benefits of its incredible Tom Ford direction (it has Tom Ford vibes all over it) and the mesmerizing performances from Amy Adams (who was totally snubbed at the Oscars) and Jake Gyllenhaal. Thrilling and nail-biting, this film is a win!"}, {"rating": "10", "text": "A harrowing tale of revenge directed by Tom Ford and set in the two worlds he knows best – international art and design and Texas (where he was born). It’s no surprise that he would have a great “eye” as a designer for the look of the film, but his deep feeling for his characters and their situation is. His first film (A Single Man) was more design than substance, but not this time. Jake Gyllenhaal has never been better (I think this may be the best performance of his career, partly because it is so believable, natural, and deeply felt) and Amy Adams does wonders at embodying both Texas and New York. And Laura Linney is astonishing. She is so entirely believable that afterwards you say “Was that really Laura Linney?. If you want to see a movie that will really shake you up and perhaps make you see the world just a little differently, go to this film."}, {"rating": "10", "text": "Nocturnal animals is a savage and brutal thriller that stays with you long before you see it. Tom ford is one of the most brave directors working today"}, {"rating": "9", "text": "Nocturnal Animals is an aesthetically intriguing, often uncomfortable and anyway multilayered experience with award-worthy acting (and an applaudable makeup-team). As a side note, it is interesting to see a movie about a reading character and possible recontextualisations in life that follow."}, {"rating": "10", "text": "Very well directed and with sensibility not seen since Antonioni, Nocturnal Animals is a cross between an art house movie and a Noir Thriller. The film starts with some interesting provocation scenes that borrows from David Lynch surreal visuals.Then, it jumps into the main narrative with a precision and technique of a master, a master who must be a fan of Hitchcock and Roman Polanski. The device of the story inside of the story catapults the movie to a different level and because its execution is so flawless one gets carried away also by the novel the main character is reading. Which only a good director would be able to do it.Also is worth to mention, the extreme sensibility of Mr.Ford's eye, an eye that pays attention to details not only in costumes, lighting and acting but also as details in the dynamics of the main character's voice or details in the props.The cinematography of Mr. Seamus McGarvey is very sober but precise and elegant.And the music of Abel Korzeniowski wraps everything with an energy that is completely captivating.Mr. Ford must be very pleased with the overall results, since it is extremely difficult to achieve a film such as Nocturnal Animals which has many layers of information and is both visually entertaining and have an acting that is acutely compelling."}, {"rating": "3", "text": "A waste of 2 hours of my life. Time I will never get back sadly. If you're looking for artsy, pretentious 'films' with storylines and endings that are made purposely to make the makers feel smart, then you'll love this. Otherwise, if you value your time, stay away."}, {"rating": "2", "text": "This is a prime example of a crossover artist who is unfit for the screen, trying to pass off a largely incoherent incomplete script/film that any disciplined writer, director, producer, studio exec would have had re-written several times over.  Self indulgent nonsense is an understatement.  The idea is very interesting, but it was never properly developed for an audience which is what is required in this game called movies for public exhibition.Actors such as the principals here who choose to be in something based on scenes they want to show their stuff off in rather than choosing scripts with the potential to be good movies do nobody a service, particularly the audience and investors.  Besides the severe lacking in story and screenplay know-how on display here is the content on screen itself which is unimaginative to say the least and downright unappealing in any way, shape or form.  It's a lousy scenario ruining the seed of a great idea for a thriller. (not a new idea as I myself had the same basic concept 18 years ago)And any critic or person labeling this thing a thriller is a total jackass!"}, {"rating": "8", "text": "Not at all what I expected, especially after Ford's first feature film, but it's never boring, visually spectacular, and viscerally stimulating. Jake is excellent, as are Amy Adams and Michael Shannon. Since when is Armie Hammer just eye candy in all these movies, by the way?  My only serious criticism of this film is the cold open - totally unnecessary - can't spoil it, but it's almost as if Ford doesn't want this film to screen anywhere between the coasts."}, {"rating": "6", "text": "A stylish though sometimes-pretentious, ultimately unsatisfying exercise in alleged profundity that attempts to use its supposed nuance and subtlety to cover its inherent underdevelopment. Despite strong performances by Amy Adams, Jake Gyllenhaal, Michael Shannon and Aaron Taylor-Johnson, much of its remaining power-packed cast is wasted in what is little more than a collection of throwaway one-scene walk-ons. Its often-preposterous script frequently tries viewer patience (especially in the first hour), despite some half-hearted attempts at trying to redeem itself as the picture races toward an unfulfilling conclusion. Director Tom Ford may have scored big in his debut offering, \"A Single Man,\" but he falls far short of the mark in his sophomore (or is it sophomoric?) effort, one that comes across more like a filmed version of the first draft of a promising screenplay rather than a fully fleshed out, finished product."}, {"rating": "8", "text": "What’s it about?An art gallery owner is haunted by her ex-husband’s novel, a violent thriller she interprets as a veiled threat and a symbolic revenge tale.What did I think?My high expectations for Tom Ford’s second foray into feature films were not disappointed – this stunning thriller creates a world that is both brutal and visually beautiful, telling a story within a story that you won’t expect, and having you on the edge of your seat right to the last frame. An unsettling, violent and stylish film with emotional, powerhouse performances."}, {"rating": "5", "text": "Tom Ford's Nocturnal Animals would have benefitted from even an ounce of subtlety, and with such an A-list cast it quite simply should have been better."}, {"rating": "0", "text": "This movie tries to be artsy, but has nothing to say. Watching this movie is a waste of time. There are so many better thrillers that deal with relationships between men and women that have so much more to say."}, {"rating": "2", "text": "Please don't bother wasting your time or money on this lousy movie.  The only thing provocative or interesting is the title.  And, spoiler alert, yet some more cheap shots against \"conservatives\".  Seriously, it's stylish crap."}, {"rating": "3", "text": "Total garbage. So pretentious. Trying so hard to be artistic and falls miserably. If you're in rubbish conceptual art and pretending you are a genius then this movie is for you. Glorifying depression"}, {"rating": "3", "text": "I expected a complicated and intriguing film. Unfortunately this is a dull strange thinly written tale of dual plotlines that don't connect very well. The lead characters don't have any emotional depth or real connections. I love Amy Adams and Jake Gyllenhaal but here they are lost without real characters to play. Adams is much better in \"Arrival\"."}, {"rating": "10", "text": "This movie is te best movie in 2016 for  me personally and it definitely is under my all-time-top-10.It is so incredibly intense and dark that I was totally in trance after the ending and I had to think about the movie for days.Jake Gyllenhaal shows once again what an amazing actor he is, what makes every movie with him a must-watch."}, {"rating": "0", "text": "Acting was superb on all fronts.  What ruined the picture was Hollywood's constant need to throw in a bigoted line against conservatives and Republicans.....nd fake southern accents to boot. It is a thinker picture, but when will HW make a movie that isn't smug, superior, and condescending."}, {"rating": "2", "text": "First, all the 8/9/10 reviews are studio shills, pure BS. This was a dark, demented, depressing study of a fkt up woman. Guys steer clear, and don't let your girl watch it unless she's a depressive goth type. There's a reason this film only grossed $10M, it's awful regardless of Amy Adams' performance."}, {"rating": "0", "text": "Sometimes a movie contains content that is so vile that it overwhelms whatever else may be positive about it. This, unfortunately, is such a movie. There is the depiction (either implied or shown) of violent rape and murder of a younger woman and daughter. I am no prude, but I simply wanted to kill the three young criminals depicted in the film. I would be ashamed to be associated -- in any way -- with the making of this movie. Were it a book, I would burn it to ash and send it to the author."}, {"rating": "0", "text": "\"Nocturnal Animals\" is one of the worst films of the year. After a beautiful opening title sequence this thriller quickly becomes a horrible film. There isn't an authentic second in this mess. The plot is implausible. Much of their police procedural research is incorrect. The characters are pretentious and unsympathetic. Tom Ford is not an insightful director. He paints these dull characters with a broad, uninspired brush. His screenplay is shallow, clueless, misanthropic, virtue signaling nonsense written in a bubble. The entire two hours rings false. \"Nocturnal Animals\" is not gripping in any way. It is wildly boring. I feel sorry for the cast who are made to look foolish. This film is a folly that leaves a bad taste in your mouth. So bad you'll want your money back. Or at least your two hours. Go watch Terrence Malick's \"Badlands\" instead. That film has a heart. This one does not."}, {"rating": "7", "text": "An interesting and beautifully framed film that works very well from scene to scene. But it's overall impact left me cold and wanting. It's exploration of a superficial group of people may have wound up too much so."}, {"rating": "7", "text": "\"Nocturnal Animals\" is 3 films in one starring Amy Adams and Jake Gyllenhaal. The first is who and what Susan (Adams) is today while the second is the mystery novel that Edward (Gyllenhaal) has written and dedicated to his ex wife Susan while the third is Susan and Edward over 19 years ago when they met and got married.Along the way the have and have nots are explored with Los Angeles being the world of the elite with all glass homes, art galleries, rich good looking men and beautiful women while the rednecks have unending horizons in the flat areas of Texas, men who rape, rob and kill while in both societies people of color are rarely seen.\"Nocturnal Animals\" is the second film directed and written by Tom Ford, the first being the acclaimed \"A Single Man\". The 3 stories are not told in lineral fashion and instead skip back of forth between yesterday, the novel in movie form and today, each time easily followed. We watch Susan read the novel, seeing herself in the the main character Laura and the girl who became the woman she is today.There is violence led by a trio of nasty men, following the frightening Aaron Taylor-Johnson who has no problem moving his bowels on his front porch. There is ugliness starting with the opening credits showing the installation of a gallery exhibit that almost turned me off the film. There is a scene with an aging socialite trying to look like Elizabeth Taylor (Andrea Riseborough) and her gay husband Carlos, played by Michael Sheen. Along the way are the pretty people of Tom Ford's world including Armie Hammer as Susan's husband and a striking cameo by Laura Linney as her mother. On the opposite side are country people who have a lived in face such as detective Bobby played by Michael Shannon. In Edward's novel Isla Fisher plays Susan, called Laura in the book, and Ellie Bamber as the daughter.All the acting is impeccable almost certainly bringing Amy Adams another Oscar nomination though the actress field is pretty crowded this year and maybe, just maybe, bring Jake Gyllenhaal the Oscar he ceratinly deserves for this movie and his total body of work.Tom Ford obviously takes his movie making seriously, has a couple of breath taking scenes when recreating Edward's novel but just falls short of his wanting to make film as art.\"Nocturnal Animals\" is an interesting film but doesn't quite make the must see list except for the acting."}, {"rating": "7", "text": "Nocturnal Animals is the second film by director Tom Ford and, likewise, it is the second film I have seen from him. The famed fashion designer known for his visual style fleshes this out in Nocturnal Animals, starring Amy Adams and Jake Gyllenhaal. Telling the story of a woman who reads the novel of her ex-husband and slowly realizes it has a basis in reality, Nocturnal Animals is a tense, thrilling, and visually arresting film, but it does get a bit too caught up in its style to be anything truly spectacular. As it stands though, it is still a very good sophomore effort from Ford in the director’s chair.As with A Single Man, Nocturnal Animals’ greatest asset is its visuals. The stunning cinematography is not the only area of this, but it is where I will start. The best shot, to me, was of Edward Sheffield (Gyllenhaal) running from the desert to the road and through a barbed wire. Focused on the desert, Gyllenhaal enters the frame at a distance from the right and the camera never moves. No close-up, nothing. Rather, he still in the far third of the screen. The end result is a beautifully staged shot that, for whatever reason, really worked for me. Similarly, gratuitous shots of the desert are a personal favorite of mine and apparently Ford too, given how often he used them. Similarly, shots of cars driving at night or simply the Texas landscape prove to be gorgeous shots. However, as is expected, Ford has a eye for style. From terrific costumes for Amy Adams, great make-up/hairstyling, and great production design with a stunning level of detail, Ford creates a truly beautiful world that makes you want to cloak yourself in its aesthetic appeal.In terms of its plot, Nocturnal Animals occurs in both the non-fictional and fictional with the latter being in Susan's mind as she reads Edward's novel. As she reads, Ford often cuts between her reading and Edward and Sheriff Andes's (Michael Shannon) reenactment of the story. As it progresses, however, Ford often cuts between Susan and fictional Edward doing the exact same thing. Showering. Rising out of a bath. Showering again. Laying in bed in opposite directions. Here, Ford tries to create a connection between the fictional and non-fictional, but undeniably becomes far too focused on creating artistic appeal than anything else. The cuts are pretty, but feel far too indulgent to really land with much power. Fortunately, the plot does save this element with powerful stories that parallel one another. It is clear that Ford is evidently pro-life in this film given his portrayal of abortion in both worlds. Yet, it is incredibly interesting to watch this parallel come together in the plot and even in the title (a nickname given to Susan by real Edward). This is really where much of the intrigue of Nocturnal Animals comes in as, otherwise, it would just  be a pretty typical revenge thriller. Here, it adds another layer and, as such, becomes a truly compelling work worthy of further study.Performance-wise, I would be lying if I said Michael Shannon did not steal the show. As a hard-nosed cop who violently throws up often due to his lung cancer, Shannon does not put on a Texas accent to disappear into his role. Rather, he carries himself with the attitude and swagger of a Texas sheriff and, simply by seeing him walk into frame, you know he means business. Gyllenhaal is also terrific here as the grief stricken Tony Hastings in the fictional world. Powerful and intense, Gyllenhaal brings to the forefront Tony's personal issues with his/Edward's own masculinity and being called \"weak\". Often moved to anguish, Gyllenhaal - though upstaged by Shannon - continues his hot streak of terrific roles and performances. Compared to the men, Adams is far more low-key. Her role is far more subdued and subtle. She plays the role terrifically well, however, capturing the emotionless nature of her character, never showcasing the slightest hint of being broken or phased by those around her.The best piece of Nocturnal Animals is its visuals. Haunting, arresting, and simply gorgeous to view, they are certainly bolstered by a good score that rises at the perfect moments and great acting. Yet, Ford's willingness to indulge in his artistic endeavors far too often do hold the film back a bit, notably during the cross-cutting between Adams and Gyllenhaal and the opening sequence. In this way, Nocturnal Animals is certainly beautifully imperfect."}, {"rating": "6", "text": "The film is beautiful substance.The acting is gripping, heartfelt and overall emotional. Possibly Amy Adams and Jake Gyllenhaal at some of their finest. Great performances all round. The cinematography is oozing of maturity, clarity and style. The Narrative is dark, while metaphorically rich and poignant.  Overall, objectively, it's a quality film. I just personally think that it felt a little flat for me, due to not particularly sympathising with any of the characters or really truly being able to understand them. Which isn't necessarily a bad thing. Also the film is quite emotionally draining. It mad me personally feel awful. It's just alright, in my opinion.I'm curious to see what else Tom Ford has to offer for us! If he decides to create another film!"}, {"rating": "9", "text": "Was expecting to kill some time. Was not expecting to watch an amazing film! Film was amazing and beautiful. Great story, great writing, great actimg. Well worth a watch. It reminds me of a modern day gone with the wind."}, {"rating": "10", "text": "Fashion designer Tom Ford's new film is a fascinating and intricately complex film that compels from beginning to end. The somewhat shocking and bewildering opening makes way for a thrilling thriller of a screenplay that is rich in detail, hitting more than a few nails on the head with regards to the human condition. Performances of all cast members are good but generally un-showy with the possible exceptions being Michael Shannon and Aaron Taylor Johnson. To give away any of the story would be to spoil the tantalising grip the film has whilst unfolding. Suffice it to say that the denouement thoroughly delivers on its tantalising promises. Indeed, the ending is great for those who like to think about what they have seen. Reflection enables one to satisfactorily pull together all the strands of this intelligent and rewarding adult drama whilst still leaving room for debate. As expected the film looks great with special mentions for the brilliant editing and beautifully atmospheric music."}, {"rating": "8", "text": "A film that works because of its performances.  Amy Adams and Jake Gyllenhaal are great as usual, but for me the stand outs are Michael Shannon and Aaron Taylor Johnson.  Both take over the screen when their on it.  Armie Hammer continues with his lifeless performances, though he's not in it enough to ruin it.  All the stories become intertwined but all the stories aren't equal, with the most compelling being the novel.  In the end I appreciated this film for its deep thought even if it doesn't quite hit the bullseye.  A-"}, {"rating": "4", "text": "I know that this was considered one of the best movies that came out in 2016, but for me, I really found it more and more boring while watching - I would have prefered it as a thriller with more revenge based things in the plot, but here it feels like the whole story in the book is some allusion, which, even though is artistic and all that, just is plain boring and makes you more and more disinterest in movie when you watch it."}, {"rating": "9", "text": "A masterclass in breathtaking cinema, with a sublime score, exquisite visual design, subtle performances, and a gripping storyline, this is a film which is a delight to watch. Adams and Gyllenhaal are exceptional, and the precise editing enhances the intricate development and treatment of the relationship between them that is central to the plot. The dialogue between artist and subject, interpretation and criticism is artfully explored in a tense, confronting narrative that will stay with you well after you leave the theatre. 9.68/10"}, {"rating": "9", "text": "Ford's Acute Thriller Concerns You, Affects You and Transmutes YouWho do need Liam Neeson's and Uma Thurman's vindications when we own the \"Nocturnal Animals\" of Tom Ford?Former Gucci and Yves Saint Laurent Creative Director, nowadays, this Texan man is a glorified fashion designer and promptly also of arts audiovisual. His magnum opus (\"A Single Man\") in film world was reminiscent of emotional privacy that may be movies, a stoic and ineffable progression self-absorbed in the visual and subjective. Although it was highly exalted between the critic circle, no one predicted that the second disquisition of neophyte director would be an instant masterpiece. The vogue of his rarefied career resides in fussy concern about detail and aesthetic accuracy by high levels of tastefulness and originality. As dedicated supporter of doctrinal pragmatism, his eminent diplomacy in stroke and gesture is transferred with the same refinement and subtlety to his second project, in which not only continues exhuming his critical eye on the organic, also demonstrates his sole literary faculties with an almighty and poetic screenplay of bitterness, treachery, evocations, hoaxes and superficialities. The seven years out weren't due to a bad primary experience or a cinematic absenteeism, but to that inherent thoroughness that taking him too far.\"Nocturnal Animals\", discretionally based on the novel \"Tony & Susan\" by Austin Wright, presents a narrative structuring in three underlying and sharp rhetorical levels, where the important isn't its specific nature, but interpolation between them through homologous syntactic and artistic components. The first platform and central axis of the celluloid is the paramount film basis, which shuts us away into Susan Morrow's life, a dejected gallery owner belonging to American high society of New York, a forlorn and troubled wealthy woman experiencing a marital crisis and a crestfallen course of life. Among the off- white walls and architectural stairs in the gallery, the director works with acidity his stylistic facet, heterogeneous allegories in anti- heroine's attire and accessories set the ostensible sublimation, very symmetrical and methodical. A sinister but impregnable, obscure but neat, fateful but fascinating scenery; epicurean constructions with extreme creative exquisiteness in where the leading role drag her feet in onerous heels, blackening with ill-fated and deaf footprints of unhappiness, sorrow and need for change. Subliminally, the director lays the foundation with dry and plaster tones, where emphasize the dominating black, effigy of secrecy in characters. Scenic beauty, the magnificence of the costumes, architectural refinement, and passionate exaltation are possible thanks to a stolid Amy Adams, a great role confront subsequently with other reputed acting queens.Edward, her ex-husband, makes contact after 19 years by means of a written document, where is located the manuscript of a book dedicated to her name because she was the promoter for unearthing the hidden mastery. Nonplussed, she assimilates the attached note where he exhorts her to read it. Since then, the intoxicating course prelude, without realizing the violent transfiguration is about to start. Thereon, the uncertainty is going to take a diametrical turn since not just we sink ourselves in an entirely divergent fiction from omniscient and frontispiece point of view, but we immerse into a partial perspective, where Adams' character moves to the involuntary narrator of the second story, which captures the absolute protagonist. A fictional story into another one. It is here where we certify Tom Ford's lavish direction, where the syntactic and aesthetic register is strictly transmuted.Finally, we find preterite level formed by the flashbacks. These external analepses focused their designs on relating us with retrospective conjunctions having an impact on the writing of certain paragraph, one pick to understand the sub-text. After the manuscript has been finished, we contemplate the far-reaching consequences of the stories in its characters, which have symbolically similar conclusions. She is there, totally converted by the light revival of returning to rebuild her past, with an ointment drastically scathing, expectant, noticing until the last second that the protagonist of the book was her authentic silhouette, which provoked all this with an innocuous word, 'weak'. An intricate film ostensibly neo-noir, in where the cardinal thing isn't to unify a level and the other one, it's understanding the semantic as a whole. Nothing will be easy or unmotivated in this intense trip of revenge, in where each interspersed scene has crucial effects in the protagonists. A critical anagnorisis which must be framed, lauded and deified. Tom Ford has established himself as a postmodern film hero because he corroborates that you and I are lethal nocturnal animals."}, {"rating": "8", "text": "Tom Ford directs this artistic and intense story that slowly reels you in and drags you down this dark, devastating path. Horrific and shocking yet you can't look away with an excellent story intertwined with an even better story. Amy Adams, Jake Gyllenhaal, and Michael Shannon are just wonderful. A definite recommendation and a word of advice, if you can manage to time this movie so you purposely miss the opening credits you can thank me later."}], "recommendations": ["the_master", "the_devil_all_the_time", "thoroughbreds", "you_were_never_really_here", "the_place_beyond_the_pines", "21_grams", "the_walk", "ex_machina", "a_most_wanted_man", "the_rover", "the_good_shepherd", "the_beguiled", "the_assassination_of_jesse_james_by_the_coward_robert_ford", "the_last_duel", "a_most_violent_year", "phantom_thread", "hell_or_high_water", "the_ballad_of_buster_scruggs", "unbreakable", "the_great_gatsby", "magnolia", "the_girl_with_the_dragon_tattoo", "black_swan", "hugo", "first_man"]}