{
  "id": 3129,
  "title": "Nocturne",
  "starring": [
    "Sydney Sweeney",
    "Madison Iseman"
  ],
  "runtime": 90,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller",
    "Music"
  ],
  "description": "Inside the halls of an elite arts academy, a timid music student begins to outshine her more accomplished and outgoing twin sister when she discovers a mysterious notebook belonging to a recently deceased classmate.",
  "releaseYear": "2020",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/zJNFiWBGYSMbfTAk6Ygqdj6Rahq.jpg",
  "categories": {
    "plot": 3.5,
    "acting": 3.5,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Twin sisters are accomplished pianists who attend the same performing arts high school. Sibling rivalry turns dark when one of them discovers a mysterious book that changes their lives. This isn’t really a horror film, but a slowly-paced drama with an evil yellow light that causes occasional trauma. This type of haunting specter has been done before and with much more suspense. This version has virtually nothing to recommend it."
    },
    {
      "rating": "5",
      "text": "\"Nocturne\" is another \"Welcome to the Blumhouse\" horror movie dropped together with three others on Amazon Prime. More of a B-movie version of \"Black Swan\" (or the slightly better \"Perfection\" on Netflix), the high school teen drama really weighs it down. And nothing very original either: someone kills themselves in the opening minutes, the protagonist finds her weird evil book, and life starts going her way (or so she thinks). I must have nodded off because for the life of me I don't recall why its even called \"Nocturne.\" The evil book I guess? Pass on this one and watch the much better \"Suspiria\" remake instead."
    },
    {
      "rating": "5",
      "text": "Is Blumhouse dumping into this project the scripts with which it wouldn't have risked in theaters or is the studio limiting itself?Two strikes already, and I'm not excited for the ones that follow."
    },
    {
      "rating": "4",
      "text": "Music school student's suicide leaves opening for piano-playing sisters to compete for a role, one has the dead girl's notebook, plays better but behaves badly and jumps off building."
    },
    {
      "rating": "0",
      "text": "trash movie didn't have Demi-fiend in it. Honestly disappointed. Shin Megami Tensei Nocturne was far better."
    },
    {
      "rating": "0",
      "text": "This movie is bad. It's really bad. Was it supposed to be a joke? Is there a punchline I'm missing? Because this movie is atrocious."
    }
  ],
  "recommendations": [
    "darkness_falls",
    "the_woman_in_black_2_angel_of_death",
    "mama",
    "wish_upon",
    "escape_room",
    "the_house_with_a_clock_in_its_walls",
    "1408",
    "case_39",
    "the_autopsy_of_jane_doe",
    "blair_witch",
    "the_haunting_in_connecticut",
    "ouija_origin_of_evil",
    "the_forest",
    "carrie",
    "the_curse_of_la_llorona",
    "escape_room_tournament_of_champions",
    "the_boy",
    "the_strangers_prey_at_night",
    "happy_death_day",
    "stay_alive",
    "paranormal_activity_the_marked_ones",
    "you_should_have_left",
    "annabelle_comes_home",
    "the_last_house_on_the_left",
    "brightburn"
  ]
}