{
  "id": 1796,
  "title": "Nomadland",
  "starring": [
    "Frances McDormand",
    "David Strathairn"
  ],
  "runtime": 108,
  "genre": [
    "Drama"
  ],
  "description": "A woman in her sixties embarks on a journey through the western United States after losing everything in the Great Recession, living as a van-dwelling modern-day nomad.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8Vc5EOUEIF1EUXuX9eLFf7BvN3P.jpg",
  "categories": {
    "plot": 6.659090909090909,
    "acting": 6.444444444444445,
    "ending": 5.5,
    "soundtrack": 5.666666666666667,
    "cinematography": 6.9,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 6.75
  },
  "reviews": [
    {
      "rating": "0",
      "text": "If the purpose of art is to leave you feeling empty and depressed then this is a masterpiece. Nothing inspiring here, nothing to hold onto or that gives hope. Just a miserable, self-pitying woman wondering around bleak landscapes to sombre piano music. Even the homes she enters seem bereft of joy or life. It was painful to endure. The Director would probably say 'then it served it's purpose.' Gee, thanks mate..."
    },
    {
      "rating": "5",
      "text": "Should have been a documentary. A very interesting look at 'Nomads' . I like the theme of disillusionment w the American Dream but didn't find it to be very interesting. It did make me grateful and it needed to be made. Just not like this. It plods along,  very repetitive and uncaptivating."
    },
    {
      "rating": "6",
      "text": "If you think Nomadland is a great movie you fit into one of two categories:1. You’re either easily emotionally manipulated (i.e., you cry during hallmark movies), or2. While you know New York (or fill in the blank here with your city> does not comprise the entirety of humanity, you need a reminder every once in a while that there’s a whole world out there with different people and (what? really?) nature (gasp!).Emotional manipulation is easy - sprinkle in great cinematography, an excellent score, (you can probably stop there for most of us), but also throw in poetry, sprinkle in a few poignant stories from real people with close-ups of the always stoic Frances McDormand reacting to those real stories – shake, and voila!  The producers and director of this movie-mentory, or docu-movie, or whatever, went to great lengths to make sure we knew most of the actors in this movie are not actors at all, but real people to get the greatest impact from their mostly sad vignettes. I’m glad they decided to not bite off anything controversial – glossing over the long shifts of an Amazon worker, and only very briefly showing the hard labor of a beet harvester (insert clip of Francis struggling to lift a bag of beets here) – but in a film of this type, where most of the heavy lifting is done by real actors, doesn’t there either need to be some story arc or at least a small lesson?  What they did beautifully is present the juxtapositioning of relationships and nature.  Linda or Patty (sorry, they kind of run together for me now) gives a very heartfelt dialog about going to Alaska again to swim with the sharks (or something) before she dies and I’m thinking – OK, now we're going to get to the meat of this thing.  Is she going to leave her friends and the relationships she’s built to die alone in Alaska?  But what I realized is - there really wasn’t much in the way of relationships (at least shown in the film) for her to leave.  Every time the camera dolly would follow Francis through the camp, we didn’t see much human interaction.  Sure, men would sit with pets on their laps, or someone would play the guitar, or people would sit staring into a fire, but nothing very meaningful from a humanity standpoint was going on.  I would go to Alaska too!  And this is where the film let us down.  There’s a sliver of a chance for great art here - a Winesburg, Ohio (Sherwood Anderson) opportunity to show the loneliness of people – a chance to cut the film to help us appreciate the family and friendships we have.  I’m not saying that Francis had to end up staying with Dave at the end, but make us feel the emotional toll of that decision.  Instead, they decided not to make any statements at all – to, I suppose, let the film “speak for itself”.  The problem is it does not."
    },
    {
      "rating": "4",
      "text": "Very good acting, and the movie gives an excellent insight into the plight of seniors who use their car/van/rv as their home.But, it was a slog to get through."
    },
    {
      "rating": "6",
      "text": "“We be the **** of the badlands.”‘Nomadland’ is one of those movies where nothing much happens, but it’s the type of movie you sit back and vibe with it.This is a very attentive movie, where you journey along with this woman (played by Frances McDormand) who is fed up with her old life and decides to go off grid by traveling to different places while living in her van. She’s not homeless, just houseless. She is like a leaf that quietly and casually drifts from location to location. She encounters different people in this community, who are played by real nomads. Throughout the whole movie you are never in one place for too long, you just keep moving on.I’ll give director Chloé Zhao and cinematographer Joshua James Richards major credit for they approach to a story like this. Zhao decision to include real nomads with their actual names in the movie as these characters made the story feel genuine and personal, which helps gives us a solid perspective on what life of a nomad is like but done in a respectful way that doesn’t intrude their lives. The cinematography from Joshua James Richards looks beautiful and does a great job showing off the Western landscape. Some locations can look so cold, and yet, other locations look so tranquil in the sunlight.This movie is worth checking out just for Frances McDormand performance alone, as she is terrific in this movie. She plays Fern, an adventurous woman who is a child at heart, despite dealing with some personal issues from the inside that we are informed about briefly.Also, I thought the real nomads were surprisingly good. I’m not sure if all the scenes with them are scripted or not, but either way I thought they were great.While there’s a lot of things that I enjoyed and appreciated about this movie, but unfortunately it didn’t 100% connect with me on a emotional level. At first, I liked the whole open road freedom to the movie, because since the main character is never in one place, you too become a wanderer, but I also feel it misses the opportunity of a powerful character study, especially with a character like Fern when it’s clear that there’s more underneath the surface with her.I found the pacing of the movie to be an issue for me, because with a two-hour runtime I would sometimes find myself losing interest in the characters and what was happening on screen, as the movie didn’t further develop or do anything with the content and ideas it presents.While the music was appropriately used for certain scenes, but most of the time it felt really distracting and took me out of the scenes.Overall rating: Again, there’s a lot of things that I appreciated about the movie and am interested in what Chloé Zhao has up her sleeves for Marvel’s ‘Eternals’, which I hope gives her the freedom to make whatever she wants in the late future, with the extra cash and name recognition."
    },
    {
      "rating": "6",
      "text": "Like others have said here, the movie is beautiful and well made, but the characters are not very well developed and many scenes left this viewer wanting more."
    },
    {
      "rating": "3",
      "text": "I'd heard about this film for weeks and decided to give it a go. I'm a Frances McDormand fan so I thought, well, lets see what she's up to. Five minutes in I realized I was watching a fictional account of a non fiction book. ( I had no idea that the film was structured that way).  This left me disturbed, annoyed and bit confused . I kept on thinking, why not make this a true documentary with Frances McDormand BEING Frances McDormand and interviewing these wonderful \"Nomads' who live their lives on the fringe of society. I understand how some people see this film as a milestone or a real triumph in character study, but I saw it as a bit of a manipulative exercise in taking real peoples stories and fictionalizing them for the aggrandizement of I can't imagine who. I won't get into the acting because the real people were so much more engaging than the stars, and that was the problem. The directing was at the best description adequate but nowhere near the skills et of someone like Aaron Sorkin, or Emerald Fennell who really created something amazing and impactful with \"Promising Young Woman\". I don't want to take anything away from Ms. Zhao. it takes a lot to get any film made, but in this case, I felt like a nomad myself, wandering between scenes trying to find an emotional truth to what she saw and portrayed onscreen. If this was a true documentary I believe it would have had a lot more impact. As a vehicle for Hollywood stars it fell far short of its intended emotional impact for me."
    },
    {
      "rating": "8",
      "text": "Será difícil alguém terminar as 1h 48m desse filme sem ter uma opinião ao seu respeito, seja ela positiva ou negativa. Acredito que \"Nomadland\" não seja para todos. Tem um aspecto documental e é bastante íntimo. Ele requer uma imersão na narrativa, o que os ótimos trabalhos de Frances na atuação, Chloe na direção e Joshua na fotografia abrem caminho. Se alguém me perguntar sobre o que se trata esse filme, falarei que é sobre uma mulher que experimentou a imensidão e não quis mais sair dela."
    },
    {
      "rating": "8",
      "text": "Frances McDormand gives her all in this timely film about growing old and finding a new path in life, sometimes the road gets a little aimless but ultimately it's a trip worth taking -8 stars"
    },
    {
      "rating": "8",
      "text": "Me gustó la película. Fue como ver un documental con gente real, visualmente es agradable, y la música es muy buena."
    },
    {
      "rating": "8",
      "text": "It's almost a documentary, with such an stunning photography, direction and music. Frances McDormand should win her 3 Academy Award."
    },
    {
      "rating": "8",
      "text": "I loved this film. Frances McDormand is the soul of this story, and without a doubt she's going for her third Oscar.There are many elements that I enjoyed about Nomadland, because it's indisputably an excellent character study, but there's also a big but, and that was decisive for me to take away points from it, and that was the lack of certain authenticity, mixed with an idealism that tries to make you believe that the life this characters have is kind of a dream life. Certainly the film mentions the reasons for its lead character, but never provides a conflict that feels more proactive.Life is not easy, that's true, and perhaps it's not a brutal journey of hardships either, but it seems that everyone is happy and smiling at all times.The material was of course excellent for a documentary, and the director; Chloé Zhao takes a similar visual approach to these, but perhaps spends more time exploring an overly meditative side, rather than criticizing the social and economic conditions that drive or force people to go out and live on the road like McDormand's character.Nomadland is an enriching journey, and as I said, it has its share of issues that I couldn't put aside, but they didn't hinder my enjoyment of its story. It has deservedly earned all the attention it has received, and it will definitely deserve any nominations it gets in the upcoming awards season.So if you're interested in a rewarding film, here's a great candidate."
    },
    {
      "rating": "9",
      "text": "Nomadland is The greatest movie in 2020. It deserved for The Oscars. The cinematography showed a powerful of the nature. Chloé Zhao and Frances McDormand brilliantly conveyed the spirit of the Nomad."
    },
    {
      "rating": "9",
      "text": "An atmospheric indie film to which Chloé Zhao has lent a great deal of down-to-earthness, humanity and poetics with her sensitivity in the director's chair and which is considered a hot contender for this year's Oscar race. Nomadland is a character study of the suddenly \"houseless\" Fern, who tries to adapt to her new life as a nomad as best she can after the death of her husband. On the almost documentary-like followed journey in her van, Fern meets people with different personalities who help her in her new world.  The centre of the film throughout the entire running time is clearly protagonist Fern, played by two-time Oscar winner Frances McDormand. She undergoes all kinds of setbacks and always carries around an inner conflict. She could do better, but wants to take the challenge on herself with all her might. McDormand embodies the basic mood of the film and tells the story of many: she is a victim of the glaring class differences and capitalist overweight in the USA. In the process, she works her fingers to the bone, is constantly on the lookout for new jobs and means well for people. She illustrates what the new situation triggers in her character and how she keeps her head above water. Fern goes hand in hand with the mood of the film: she is unobtrusive, subtle and has a lot of depth. This role is arguably the most important in McDormand's glorious career so far because she represents a group of people who are not seen. The actress lived in a van on a campsite for a few months before the start of filming herself and got acquainted with this kind of life. David Strathairn, as Fern's good friend Dave, is also very important to the protagonist's journey. He makes her conflicted by his obvious intentions and lets us experience the interpersonal component first hand. This comes across in almost every scene in the film, despite the clear main character. The other characters are real-life people, which brings an enormous amount of closeness and authenticity to the film.McDormand carries the plot of the film brilliantly on her shoulders, but the real heroine of Nomadland is its director. You can tell from start to finish that Chloé Zhao cares deeply about this subject matter. She has turned a low-budget independent film into a technical masterpiece against which every action film with elaborate special effects falls short. The cinematography captures lengthy and beautiful shots of the landscape, making the film's actually dreary setting seem colourful and idyllic. The music by Ludovico Einaudi is softly and empathetically composed, making Fern's rides in the van meaningful. Zhao has put together a film that takes its time, but where all the cinematic elements become one big whole. As a result, Nomadland does not create seas of tears despite the sadness of its subject, but a cinematic masterpiece whose basic idea is always present and sticks with one."
    },
    {
      "rating": "10",
      "text": "A powerful character study from start to finish, Zhao plays with themes and backgrounds so masterfully that are mesmerizing."
    },
    {
      "rating": "8",
      "text": "This is not so much a story, but a look at a life style. I've follwed the nomad community for some time - I was looking at taking a job in LA, and I wasn't going to move there, so I seriously looked at van living with regular trips home. I say that because I was surprised to see some of the actual people from the community in the movie. I've followed Bob Wells for years. It made the movie almost a documentary. Having Bob gave it some credibility. The movie gives us a little look at the van life community and may personalize it for some.Frances McDormand did a great job giving the chracter somoe life without needing a lot of fill in. We can feel the desire for independance along with the resulting meloncholy and loneliness."
    },
    {
      "rating": "8",
      "text": "Well I guess it's better to watch it on a weekday like after a hard busy day, it's like food for the soul. Not so complicated just beauty. I think those who lost a beloved one can relate to it much better and stronger."
    },
    {
      "rating": "2",
      "text": "Meandering and romanticizing American poverty. Long pan shots of beautiful landscapes with ambient music == atmosphere although it seems that this is such a common trend in cinema nowadays, but it comes off as rather lazy film-making to me reminiscent of a film-student’s idea of what is “artistic” rather than being particularly deliberate."
    },
    {
      "rating": "4",
      "text": "Well, Streamers, have you heard about this movie called Nomadland? It recently won Best Picture (Drama) and Best Director at the Golden Globes, and now, it is presumably the frontrunner for the top prize at this year's Academy Awards. I heard the buzz - good things - about Nomadland, and realizing that it is now available on Hulu, I decide to see what all the hype is about. By the title of this review, I have given away my opinion, but read below for more.Nomadland's synopsis goes something like this: After the devastation of a small Nevada town by the collapse of the local factory, a lady in her sixties, Fern (Frances McDormand) embarks on an unsettled life living as a modern-day nomad. She moves from place to place in her van, taking seasonal jobs and making her way alone. Nomadland is directed by Chloe Zhao from her script based on a non-fiction book of the same name about the nomad lifestyle. The film features real-life nomads telling fictionalized accounts of their lives as well as breathtaking photography of the American West. Fern is just as devastated as the town was from its economic collapse we learn. It is all set up to be a potentially deeply emotional film about grief, self-discovery and loneliness.Generally, I don't mind character studies, and this nomad lifestyle is intriguing. Why would one decide to live this way? What brought them to where they are? Those questions are explored in Fern's story. Frances McDormand is a good actress and so she's fully embodies this character. However, since the film is also populated with non-actors, who are real-life nomads, it is obvious that there is a naturalistic quality to their presence in the movie. I think it undercuts the fictional narrative. In fact, I'd rather have a documentary about those people and learn the how's and why's of how they came to be nomads. As it is, I was very bored following Fern's story. I checked at least 5 times how long I had to go in this movie. I will say though that the cinematography and the brilliant colors and landscapes of the American West are beautiful, but that is not enough to sustain and almost 2 hour movie.If you have 2 hours to devote to watching a woman travel across the country doing odd jobs and not much else, then Nomadland may be the movie for you. There is potentially an interesting and emotional story here, but as it is, this movie is not what it could be. I'll wait for the documentary about nomads. For this, you only need on popped kernel of popcorn."
    },
    {
      "rating": "4",
      "text": "It has some good minutes. But sadly, most of the time, It's boring and, for sure, overrated."
    },
    {
      "rating": "9",
      "text": "A very poetic take on the crumble of the American dream. Chloé Zhao and Frances McDormand blur the lines between fiction and documentary to bring to the forefront the tales of workers-turned-nomads who have liberated themselves from the tyranny and indifference of an oppressive system. A great meditative film that resonates with every person searching for a real home."
    },
    {
      "rating": "0",
      "text": "I'm 59 years old, and this is bottom 5 worst movies my wife and I have seen. Daughter hated it to. Annoying, not enjoyable and nothing interesting. A complete waste of time. This is like how some artist gets a monkey to draw art and gets artsy people to buy it, who in the end really have no taste at all. There are no spoilers to give, its that boring."
    },
    {
      "rating": "5",
      "text": "A highly overrated film. Watching paint dry is more exciting than watching this movie."
    },
    {
      "rating": "7",
      "text": "This was a difficult move to rate. As a film, it is absolutely brilliant in every aspect. McDormand gives a tour de force performance. The cinematography and musical score are both as close to perfection as they could be. The story is beautiful and touching. But therein lies the problem. The story, a clear indictment of everything that is wrong in the US and the inequalities resulting from unbridled capitalism and plutocratic rule, is just too much on the nice side of prettied up by Hollywood for the suburban and urban elite. While there are many aspects of the nomad life that ring true, and clearly show some effort to be honest, it glosses over way to much of the everyday nitty gritty and the harsh realities. As if work at an Amazon facility were so pleasant. As if working on a sugar beet harvest involved just those few moments shown rather than weeks of constant body-draining effort. As if Fern would really betray her values and take the money from her sister. Sadly, the film serves most to soothe the guilt of the self-proclaimed woke. Yes, the film deserves awards all around - acting, directing, cinematography, score. (Screen adaptation not so much. The book is much more realistic.) I let this film tug at me heartstrings and my love of movies. Then, after letting it sit for a while, I saw it for social failure it is."
    },
    {
      "rating": "0",
      "text": "This is the most boring movie I've ever tried to watch. The fact that it's up for so many Academy Awards is a depressing indictment of the film industry."
    },
    {
      "rating": "9",
      "text": "This quiet and soulful drama stars Frances McDormand as a middle-aged widow who loses everything: her home, her town, and her job due to the great recession and packs up all of her belongings and travels cross-country living in her van and meeting several others just like her. The people who travel and live in vans and RVs and don't live in a house are what's called nomads. Long before seeing this film, I knew it was going to be special, and that it'd likely be among my favorite films of 2020, and sure enough, it absolutely is! I was in tears by the end of this one, and it made me reflect on my own life and the state of the world all while watching it. Everything about the film can be likened to a beautiful poem. From its touching and impactful dialogue to the gorgeous cinematography to the intimate performances from all involved, even the real-life nomads who appear in this. Of course, this is McDormand's film to own, who gives the most heartfelt and personal-feeling performance of her long and already-impressive career. Director Chloe Zhao brings out the best in her and furthermore also has crafted a thought-provoking and all too timely-feeling story of being in search of and hopefully finding oneself in such a large and open yet lost and uncertain world. The fact that this film has been released in the time of Corona makes these themes resonate even more poignantly right now, what with people losing their jobs and not having a house to live in. This film really does hit differently in times like these, and it's hard to imagine it being released in any different time or moment than now. Overall, this film for the most part pretty much met my expectations, and paints such a beautiful yet aching portrait of loss and adventure, and I can say with upmost certainty that this is probably my favorite film of 2020."
    },
    {
      "rating": "10",
      "text": "Masterpiece. Chloe Zamora made a movie that si so silent and yet so powerful. Incredibile."
    },
    {
      "rating": "9",
      "text": "The reality of many, that many ignore. The protagonist does not seem to enjoy the trip, but the viewer does."
    },
    {
      "rating": "10",
      "text": "This is a truly, truly special movie. It captures the beauty of humanity with grace, profundity, and empathy while also painting a nuanced portrait of the social ills of our society. What I love about this film is that, in addition to never patronizing its subjects nor its audience, it's not a movie that exists to just tell you \"what's wrong with America.\" This so easily could have been an angry movie about how we've mistreated these people on the margins of our society, but Chloe Zhao recognized that what these people want is not our sympathy. Instead, she dug deeper and told a compassionate, emotional, beautiful story about the way the human spirit triumphs, grows, and heals even in the face of marginalization and inequity without giving the \"easy\" answers to the social problems it recognizes. Easily among the best of the year."
    },
    {
      "rating": "7",
      "text": "Frances McDormand deserves all the praise she's been getting for this role. The no-mad life was a real eye-opener for me. I don't need to ever see it again, but it's a movie that will stick with you."
    },
    {
      "rating": "2",
      "text": "I'm feeling pretty disappointed so far. I can't stop comparing this to an episode of Dirty Jobs, with Frances McDormand as whatever that guy's name is. All the characters are just monologuing at each other. it's driving me nuts! I really wanted to like this too."
    },
    {
      "rating": "0",
      "text": "If Nomadland achieves anything at the academy it'd be a disgrace to its longstanding heritage of awarding films that leave an impact on its audience,and for me it left just none - not because the issue it addresses is insignificant rather its of prime importance but the presentation is slow, scattered, and doesn't capture your attention for too long. Frances Mcdormand had taken up more challenging roles in the past, and this isnt even near to her best. Finally, this film must be released immediately to the global audience instead of travelling through and garnering festival fever. Only then, can Nomadland be truly judged for its forgettable film-making."
    },
    {
      "rating": "0",
      "text": "boring boring boring boring oh and did i forget to mention boring and boring???"
    },
    {
      "rating": "10",
      "text": "With flawless aesthetics and editing, Chloé Zhao has managed to make one of the most intimate movies to date."
    },
    {
      "rating": "4",
      "text": "The movie continuously contradicts itself. It can't tell if it's a tragic look at people who have fallen out of society, or a spiritual awakening for people duped by the American dream. The characters talk about what a tight-knit community they are, full of independent people, but they also complain they are victims. If the script had chosen one of those themes I think it would have worked better. It just thinks it's more poignant than it is. Oscar bait."
    },
    {
      "rating": "5",
      "text": "Meh, mostly boring slice of life flick, about those who've lost homes, or those who never had them to begin with."
    },
    {
      "rating": "7",
      "text": "This inside look at a little-known community and culture is engaging for about the first two-thirds, but, in the end run, it begins to grow tiresome, leaving viewers wondering when and how it will ever end. Director Chloe Zhao's third feature offering is a notable improvement over her first two outings, but she still needs to refine her craft further to produce the kind of masterpiece she's likely capable of. \"Nomadland\" is a big step in that direction, serving up a heartfelt tale about the American nomadic community and its unconventional followers' love of the freedom it affords, set against the beauty of the country's landscape, depicted here through stunningly gorgeous cinematography. However, the inherent meandering of the protagonist ultimately gets taken a little too far in the film's narrative and could have been trimmed without losing anything. The much-heralded performance of Frances McDormand is adequate but far from the kind of stellar work she's capable of, probably due to the understated nature of her character, a casting decision that maybe should have been reevaluated before filming began. While I can honestly say I liked this film, I can also honestly say that I didn't love it, either. Maybe the fourth time will be the charm for Ms. Zhao."
    },
    {
      "rating": "10",
      "text": "Nomadland is truly a swan song when Frances McDormand gives her very best in this masterfully directed flick by Chloe Zhao. The raw emotion in this film that captures the struggles of homelessness of being a nomad will make you realize something can be possible thanks to the portrayal of this film."
    },
    {
      "rating": "10",
      "text": "Wow. I hadn't heard of this but I saw it on Hulu and saw Frances Mcdormand is in it and because I really like her I immediately pressed play without even reading the description and I was blown away. I really didn't expect to be so moved but I cried at least twice during the runtime. An intimate and poetic film that focuses on human emotion within a critique of American capitalism and modern isolation, if you're not put off by it being slow moving and fairly quiet you will most likely find something transcendent here."
    },
    {
      "rating": "9",
      "text": "Frances McDormand is Endearing as a Wandering Nomad Displaced by the American Recession: \"Nomadland,\" directed by Chloé Zhao (\"The Rider\"), written by Zhao, based on the book by Jessica Bruder, follows the story of Fern, played by the once again brilliant, 2-time Oscar-winner, Frances McDormand, a woman forced to become a Nomad after the losses of her job in 2011 at a shut down factory in Nevada, her home, death of her husband and the town she lived in wiped off the map, all painful misfortunes, the results of the American Recession. Fern buys a van, which she customizes as her new home, and wanders the West in a constant search for work, including taking a seasonal job with other Nomads boxing packages at a large Amazon distribution center. The beauty in Chloé Zhao's direction is her ability to play on realism by mixing actors in the film with non-actors who manage to give equally gritty performances. Joshua James Richards, Zhao's Cinematographer, is truly an artist, capturing the breathtaking landscape of the American West, using his camera to paint an alluring palette of the stark Arizona desert, ominous mountains, long, winding, cold and lonely roads, powerful Pacific coastline, the Redwood Forest and glorious sunrises and sunsets."
    },
    {
      "rating": "7",
      "text": "Nomandland has moments of sublime beauty and poignant sorrow; it is a character study with a careful understated performance by McDormand, but the film isn't really about her.  McDormand's character is as much a vehicle as her van \"Vanguard\", she is a focal point for the indifferent cruelty of capitalism.   The film is slow, it has no direct antagonist, so little dramatic tension.  It is emotionally manipulative, but the moments where it strikes are heart wrenching, but veers away from any sort of scathing critique about the failure of the American dream.  It's worth seeing, but if this is among the best films of 2020, it was a sad and slow year for film."
    },
    {
      "rating": "6",
      "text": "Despite the generally good cinematography and good performance by Frances Mcdormand this movie is an empty shell. It features an almost entirely unlikeable character who never grows substantially sprinkled amongst seemingly random shots of environments. This movie fails on all counts to provide an interesting journey for its character to go through, or for the audience to watch. At every opportunity for something interesting to happen, the story says no. For some reason the filmmaker seems to forget that the primary purpose of cinema is entertainment. Most of the characters, when they do pop up are very bland and mostly forgettable. This movie is only saved by its beautiful shots of landscapes and Frances Mcdormand's portrayal of one of the least interesting characters in the history of cinema. Overall, It is a movie that you can forget exists. I've certainly forgotten most of the movie and I just watched it yesterday. 6/10, and thats me being overly generous."
    },
    {
      "rating": "9",
      "text": "american honey. into the wild. La Loi du marché. - a kind combination of all those great movies of the last decade. McDormand is a star, yet the semi-pro cast supporting her is the real driver of the movie."
    },
    {
      "rating": "10",
      "text": "MASTERPIECE! Will win Oscar for Best Film and Director. A world unveiled with love and compassion."
    },
    {
      "rating": "10",
      "text": "It's an austere, demanding, for some maybe at some moments painful to watch movie, because it shows us such out of the ordinary, unexpected, genre-wise uncharted experience. It's also iconic for our times of rich societies with huge inequalities, with working poor, and contemporary ghost towns. But somehow it all turns out all right, not in a Hollywood sense, but in existential terms of human fate. Thoughtful, well scripted and beautifully photographed film, a masterpiece!"
    },
    {
      "rating": "6",
      "text": "Underwritten.  And what a shame, given the talents of the actors, not only the always-brilliant Frances McDormand but those who aren't professional actors.How powerful this film would've been if the screenwriter had mined these roles and given them the scenes they deserved!  And such opportunities for depth: The relationship with the David Strathairn character, Dave, and Fern's sister, who supplies some exposition about Fern's backstory but allows so little understanding of who are they are in themselves, and to each other. \"Spare\" is what I'd call this kind of writing, and sometimes less is more, but not here.  After spending two hours with Fern, I know her life (in minute detail), but I don't know HER.  Another underdevelopment:  The reasons why these people live with such hardship.  There's a systemic reason, and it has everything to do with the Amazon element that figures so prominently as a setting, while missing the opportunity to contrast its workers' lives with those who profit from them.  I didn't read the book, but I suspect it would've been a great source for the theme of the chasm between rich and poor that is the nation's growing disgrace.  With some flesh on the bones of its script, this movie could have been a true classic. Again:  What a shame."
    },
    {
      "rating": "9",
      "text": "Sometimes we lose the people we hold in our hearts. Without them we are nomads and endlessly look for what we have lost. In all its simplicity this is a fantastic film about the quest to give a lost love a place in our lives. It is not a sad film, it is even hopeful. Frances McDormand is (as always) fantastic."
    },
    {
      "rating": "4",
      "text": "Nomadland has a stunning cinematography, minimalistic directing and great lead actress performance, but it really suffers to deliver the social message with such an apolitical discussion and a painful pacing. The movie brings so many importants them but it doesn't take care to discuss them, forgettable and bland at most."
    },
    {
      "rating": "0",
      "text": "Garbage. No one dies for lack of healthcare or a decent job. They die because they feel like it, or because they are misfits with personal flaws. Go read the book instead."
    },
    {
      "rating": "0",
      "text": "Boring **** **** **** **** boring **** boring **** boring **** and **** **** **** ****"
    }
  ]
}