{
  "id": 4766,
  "title": "Norm of the North",
  "starring": [
    "Rob Schneider",
    "Heather Graham"
  ],
  "runtime": 86,
  "genre": [
    "Adventure",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Polar bear Norm and his three Arctic lemming buddies are forced out into the world once their icy home begins melting and breaking apart. Landing in New York, Norm begins life anew as a performing corporate mascot, only to discover that his new employers are directly responsible for the destruction of his polar home.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ouaoVSV7aOSWTNnQ9iDA1jw0pgg.jpg",
  "categories": {
    "plot": 0.7428571428571429,
    "acting": 0.8846153846153846,
    "ending": 0.75,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 1.2,
    "funny": 0.5555555555555556,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Horrendously animated, incredibly unfunny, and a plot that is laughable at best, Norm of the North is the worst animated movie in recent memory in every single aspect.  It's preachy in it's themes, its jokes fall flat every time, and its animation looks so bad that it is astounding that the film made it to theaters at all.  Do not take your children to see Norm of the North, you're only making them dumber."
    },
    {
      "rating": "0",
      "text": "The only reason to watch this movie, is to help educate your kids on what a truly terrible piece of junk can sometimes, somehow... get a theatrical release. Generic art direction and character design. Stupid story.  Insipid morality but without any common sense. Seemingly ignorant of the ironic criticism it's actually point at itself as a movie. Maybe one or two gags that were possibly meant to be funny for parents? ...Were just offensive and immature humor that might have got a light chuckle in the 1990's at best. Production quality that pales even in comparison to the Coca Cola polar bears commercials. This movie is just terrible. Absolutely deserves the zero it's getting from everyone here. A sad place to see voice talents end up too."
    },
    {
      "rating": "0",
      "text": "For a brief moment Norm of the North made me think in this case Climate change ain't so bad.  That is how unbearable (no pun intended) this film is. It's an absolute embarrassment.  Okay I couldn't help myself.  F"
    },
    {
      "rating": "0",
      "text": "Horrible just Horrible. I've seen it last January,I've never wanted to review this utter crap but because I was so angry I'm just gonna do it.sigh.Here we go.\rThis is the first film I saw in theaters this year and boy,it was bad ass hell,probably the worst animated film of the year or all time.This film is trying to get some audiences but it failed miserably.The children in the theaters was bored and one I mean one was sleeping throughout the film even his parents was bored,some even left the theaters and find it a waste of time.Just look at the failure of this film.People who've saw it might be angry and scar them for life of how horrible just horrible the film was.\rIt was horrendously animated,just look at  each characters,they're lazily designed and again animated.The story is another horribly written  plot that no one will get invested on.The voice acting was also horrible in each character and speaking of the characters,They are annoying,lazily written,horrendously animated,ear f***ng voices and clumsily f**ked."
    },
    {
      "rating": "0",
      "text": "In 2014, we got this heartless un-fun movie called 'The Nut Job' which will get a sequel for some reason. GODDD!!! And than 2016 came and brought Norm Of The Worst. Literally I didn't find this movie as humorous, I just found it as an excuse to make money. The whole film is filled with Cliches that we have seen before. Nothing new, no fun characters, and the humor is just horrendous. I get that it's a kids movie but NO, JUST...NO!"
    },
    {
      "rating": "1",
      "text": "Dear GOD.\rWhen the makers of this film finished it, who looked at this and thought it was ok to release to theaters?! Norm of the North may be entertaining to those who like watching twerking polar bears, but if you're not, do NOT watch this movie. The animation makes it look like something you'd see in the bargain bin at Wal-Mart. The humor isn't even stupidly funny, it's just plain dumb. The plot is paper thin, and the characters are non-existent! Also, can we assess the fact that the star of this movie is Rob Schneider? I'm sure he's a nice guy and all, but out of all of the potential voice actors you've could of gotten, you drag Rob Schneider into the mix. I just... I just can't. This movie is by far the worst animated film i've seen in a theater, and don't give me the argument that it's a kid's movie, and that it'll only entertain kids. When I went and saw this movie, the kids in my theater were bored out of their minds, and when I saw one family walk in, after 20-30 minutes, they left the theater and didn't come back! Seriously, when not even kids can enjoy your film, you've clearly done something wrong. Do not waste your time on this god-awful atrocity.\r Norm of the North gets a 1/10"
    },
    {
      "rating": "0",
      "text": "Somehow manages to look like Foodfight 2. Overall a poor excuse for an eco-friendly message, which is it's only redeeming value that can't even get it up from the zero it deserves."
    },
    {
      "rating": "0",
      "text": "death death death death death death death death death death death death death death death death death death death death death death death death death death death death"
    },
    {
      "rating": "2",
      "text": "Norm Of The North is the worst animated movie I've ever seen in my life and is also among some of the worst movies I've seen as well. The animation for 2016 is disgraceful it looks like it belongs in the late 90s or early 2000s. The characters are annoying and pointless and the lemmings have used some of the worst humour I've ever seen. The voice acting is sub-par I mean Rob Schneider is the main character for crying out loud. There is barely a story in it as well it's mostly trying to send an environmental message to save the Arctic, but by the end of watching the movie you wold want to nuke the hell out of that place. This movie shouldn't be seen or approved by anyone skip this movie entirely!"
    },
    {
      "rating": "0",
      "text": "Norm of the North is more like Norm of the They Never Should Release this on Theaters. This is a unwacthble movie, the animation sucks, the characters are boring, the humor is stupid and the script is so terrible and boring. This is the worst animated film for 2016. Never watch this movie, please. Is horrendous."
    },
    {
      "rating": "0",
      "text": "This movie should be banned\rThis movie shouldn't be seen by any child by any means\rThe animation is obnoxious, the story is boring and makes no sense, the characters are bland, the comedy is lazy and grossing and the movie in general is boring and offensive.\rIts so bad that i feel slightly dumber after watching (o remembering) this\rThe worst animated feature of this year so far"
    },
    {
      "rating": "0",
      "text": "Norm of the North will hopefully never become the Norm of animation, with lazy writing, cheap animation, a hammered in environmental message. The film has characters you just want to ship on an iceberg out away from here."
    },
    {
      "rating": "0",
      "text": "I am staggered this waste of time and effort was put on a cinema screen. it's clear by the awful animation, terrible characters, atrocious acting and terrible script that no one cared making this movie and you shouldn't either just skip it and don't indulge these hacks that insult children intelligence."
    },
    {
      "rating": "0",
      "text": "the worst film I've ever seen, Dear God clean out my eyes. ISIS WILL PROBABLY USE THIS AS TORTURE! Utterly useless, the plot made no sense. God the animation was awful. just never watch it."
    },
    {
      "rating": "0",
      "text": "WOW, is Norm of the North bad! I mean, you have no idea. If this movie was a dog, I'd have it put down. If this movie was a car, I'd have it impounded. If this movie was a starving young woman who pleaded to me for just a bit of my ham and salami sandwich, I WOULD KILL HER! All right, that's a little dark, but you get what I'm getting at. That's the kind of hatred this movie has driven me to. You know it's a terrible film if it has  a stinking twerking bear. Come on, Lionsgate. You're way better than this."
    },
    {
      "rating": "1",
      "text": "This is a pathetic attempt at grabbing childrens attention. Fortunately, this movie got what it deserved. One of the lowest rotten tomato ratings out there, a 21% on metacritic, and 3.7 on IMDb."
    },
    {
      "rating": "3",
      "text": "Norm of the North is a film made for young children, that looks like it was written, produced, and animated by young children. The Film had no understandable flow, and lacks even one moment of thought provoking action. The film as a whole is fairly unfunny, though has moments of comical relief that kind of surprised me. I actually really like the character of Norm, who I felt had the best arc throughout and the best voice work, and his companions, the most untelligable characters in this film, easily offer the most laughs. The plot, however, makes no sense and most of the film tries to feel like it lives in the 21st Century, but is reduced to childish jokes. And in comparison to other animated offers of the year such as Zootopia, Kubo and the Two Strings, and even the slightly overrated The Secret Life of Pets, Norm of the North lacks any depth or even principles in its animation design. In grading the film as it was meant to be presented, a children's film, it works perfect for young kids and is sure to keep them entertained. But to anyone who is over the age of about 9, this is just a bad movie. My 3/10 comes from the fact I really enjoyed the character of Norm and his companions the lemmings made he laugh."
    },
    {
      "rating": "2",
      "text": "Norm of the no worth!Surely my review would annoy those who liked it. But the majority of who saw it was felt just like me. It has been 20 years since the first 3D animated feature film came. Not all the films released in this period were great. Some were technically sounded good and some were stories. If you had seen 'Hoodwinked!', you would know how awesome that story was, despite the poor animation production. But this film failed in all the department.I recently finished watching the first season of 'Trollhunters' and 'Miraculous Ladybug'. Even the television made products were much better than this film. Small budget, small production house et cetera is not an excuse. Thankfully, this is not the only bad animated feature I've seen so far in my life, but sadly it joins the list of those titles.Maybe! The little kids could enjoy it, who does not know to differentiate between good and bad. But for the adults, this is definitely skippable film. The best thing about this film was the message it carried, though, even for an animated film and a fantasy film, not convincing enough. It was kind of very similar to 'Delhi Safari'. In some perspective, I thought it was a remake of that. There are lots of other films similar to this like 'Chole & Theo', 'Happy Feet' and so on that you can try them instead.2/10"
    },
    {
      "rating": "1",
      "text": "This is one of the worst animated movies I've ever seen. It was even worst than Sponge Out Of Water.\r Now let me start out with the positives: for the last 15 minutes, it was a bit entertaining. Animation wasn't bad, but it can be better.\r Now the negatives: The story was unbelievably weak, jokes fell downhill and were the worst part of the movie, characters are uninteresting, it was extremely boring from beginning to end, and some parts it didn't make any sense.\r Don't even get this movie. It's a huge waste of time and money. 1/10."
    },
    {
      "rating": "1",
      "text": "Quite possibly the worst animated film ever made. 'Norm of the North' is unfunny, not clever, not educational, stale and just down-right awful. The film barely has a plot, it barely has characters worth caring about or remembering. It barely even has structure, at times, the editing is so choppy, you can't keep track of the film's narrative. I am just going to keep this review short, this has got to be one of the worst movies out there for children. Not worth to punish your child over."
    },
    {
      "rating": "0",
      "text": "This is even a movie??? I thought i was some sort of advertising or something for kids. It's that bad. It is also one of the lowest rated user scores on Metacritic."
    },
    {
      "rating": "0",
      "text": "Insert Bear pun. What's that? That joke was soulless, repeated before and unfunny? WELL IT'S STILL BETTER THAN THIS PIECE OF **** MOVIE! THE CHARACTERS, HUMOUR AND STORY ARE ALL ****! AND IF I MEET THE ****** WHO DIRECTED THIS, I'LL **** ****** **** HIS ***** UNTIL IT TURNS GREEN!...........(deep breath).......so yeah, I didn't like it."
    },
    {
      "rating": "1",
      "text": "I heard this film was terrible but I didn't expect it to be that bad.  the movie at first was just generic bad but as the film went on, I got a sick feeling in my stomach. The sickness wasn't from any gross-out humor or something vile and vulgar the characters were doing but at the thought that this film shows what utter contempt Hollywood has for the movie-going audience and your children. I started to hate this film but by the end this film disgusted me in a way I never felt before. This is perhaps one of the worst movies I have ever seen somehow make it to the silver screen and get some budget and shows that they think we are a bunch of idiots that will lap up whatever they crank out, but boy are they wrong with me. This film is so bad it makes me respect Jack and Jill, perhaps one of the worst big budget films ever made and shows similar contempt for its audience but this film goes one step farther by targeting children. Personally it should be a challenge for all folks out there to destroy all physical copies of this movie as a civic duty to society"
    },
    {
      "rating": "0",
      "text": "OMG!! this movie is worst than Foodfight, it is a little bit contradictory, the **** animals, as they do not want the humans, those copies of Rutt and Tuck wear hats and play cards, and that copy of Zazu the irritating gull  with glasses, who understands them? And what the **** with that orca who walks out of the water? By the force of gravity he would already be dead. they want to send someone who hates to avoid having humans in the Arctic? If I were Norm i send them to hell, they go lemmings."
    },
    {
      "rating": "0",
      "text": "Any child exposed to this much unfinished animation, juvenile toilet humor and preachy hypocritical tosh should wonder if the cinema is really acting as an animated babysitter or just taking their child's lust for animation as opportunity to sink as low as Norm of the North does."
    },
    {
      "rating": "0",
      "text": "This is easily the worst movie ever. Worse than Ratatoing. Worse than The Little Panda Fighter. Worse than all of video brinquedo's \"movies\". It felt like every minute of this movie was an hour. It was so boring that I would rather watch paint dry."
    },
    {
      "rating": "1",
      "text": "The animation brings it down a lot. The writing brings it down even more. The voice acting takes it to the ground. The fact that it exists brings it beneath the ground, melting it inside the mantle's apathetic magma."
    },
    {
      "rating": "3",
      "text": "Noooooooooo!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "1",
      "text": "What can I say, I was bored the whole movie. The story was way to hard to understand, and had to many plot holes. The voice acting was bad, which wasn't a surprise. The animation also looked bad and felt slow. The characters also were not funny, I never laughed. It is not enjoyable at any point, so stay away from it."
    },
    {
      "rating": "0",
      "text": "How this film was made, no ALLOWED to be shown in cinemas is beyond me! This is one of the biggest atrocities I have come across in recent history. this might just be Rob Schneider's lowest point.The CG is laughably bad by 2016 standards. Imagine Zootopia, but bland, generic and uninspired. As for the jokes, imagine Flame Hyneard from Mega Man X7, but more obnoxious and annoying. ESPECIALLY THOSE DAMN LEMMINGS. I just wish they would act like REAL lemmings and walk off a cliff. Piss jokes, fart jokes and other types of raunchy, uninspired humor come from these hairy testicles. Also, the story is as weak as a half-assed Twilight remake written by Hannah Montannah Essentially, some guy wants to build houses in the north pole for cash, but some polar bear named Norm attempts to stop him and Norm is also the only bear in the north that can speak to humans... for some reason. And he can also dance... for some reaso- WHAT IS GOING ON?!This film should burn... BURN IN HELL. Do not allow your child to watch it. No matter how many times they beg and whine and scream and tantrum for the DVD or Blu-Ray, DO NOT GIVE THESE DIRECTORS ANY MONEY. Peppa Pig, f*cking PEPPA PIG is more tolerable than this **** Now if you'll excuse me, I have to speed up the process of global warming"
    },
    {
      "rating": "0",
      "text": "This was probably a last minute decision made by Lionsgate. The producers weren't even trying for this movie. It makes Alpha and Omega look like Beauty and the Beast. It's best to avoid this un-bearable movie."
    },
    {
      "rating": "0",
      "text": "21% is too **** high for this god damned movie it's just a bunch of cliches, the animation is bad, and Rob Schneider is a **** **** **** This stupid movie could literally kill it's so bad, if the Nazis ran out of gas to kill Jews they would just show them this in the gas chambers, and that's why I rated this 0"
    },
    {
      "rating": "0",
      "text": "I haven't seen this but the footage and trailer I have seen for this movie like the emoji movie but has horrible animation horrible jokes and is the 3rd worst animated movies its proof lionsgate just makes horrible after horrible movie"
    },
    {
      "rating": "0",
      "text": "Ok first i don´t know who the **** gives 10 but he has clearly a **** taste so you better get help.Ive seen better 3D animation in the 90´s it looks like 2001 university project , honestly if you want my opinion just forget this movie ever existed and leave afther you see it."
    },
    {
      "rating": "0",
      "text": "Quite possibly the worst movie I've ever seen, with the possible exception of The Croods. Just stupid. It hurts too much to even review it, but trust me, do NOT waste your money on this. Even my 8 year daughter stated that it was \"not very good\". On top of being worse than seeing a rat in your kitchen, the \"human\" men in this fiasco were greedy, arrogant idiots, while all the women were sweet and genius. The women were even animated to look like women, while the men were little more than glamorized Gumby and Pokey.\rNow, no matter how my life turns out, I will go to my grave with at least one regret. I'll never get those 90 minutes back."
    },
    {
      "rating": "0",
      "text": "Such an incredibly lazy job of making a movie.  From the storyline, dialogue, to the animation, so little effort was put into making this movies, which explains why I found it the worst children's movies I have seen."
    },
    {
      "rating": "0",
      "text": "I only saw the trailer and immediately thought this film was **** and it looked like I was right. This may end up already being the worst film of 2016 even. The filmmakers, to quote Sailor Mercury from Sailor Moon (that's who Kate Higgins also plays, and kids/viewers should see that masterpiece instead), should stick their heads in water and repent their actions!\r But yeah, kids deserve better than this."
    },
    {
      "rating": "1",
      "text": "It's already safe to say Norm of the North is this year's poorest animated film and we're already beginning the year. I don't need to see it to prove whether it's bad. I just needed to watch the trailer for proof. If you have children, they'll probably love it when the rest of us won't."
    },
    {
      "rating": "0",
      "text": "Dumb, lazy and lame! January just started and we probably have one of the worst movies of the year! Don't watch it, save yourselves and your kids from this atrocious embarrassement for your own good!"
    },
    {
      "rating": "0",
      "text": "Norm of the North is a plain horrid movie on its own. You have Rob Shnieder playing a polar bear. The movies' animators looks like they took 1 hour to do the whole movie. This movie is a failure."
    },
    {
      "rating": "0",
      "text": "An unexpected failure. This is the worst animated movie I have ever seen. The story is **** Animation is **** The humor is **** Every peice of this movie is a horrible experience. I guess movies like this get great reviews. On imdb, people actually enjoyed this. I wonder if its just toddlers hacking computers or what."
    },
    {
      "rating": "0",
      "text": "Avoid it like the **** plague.\rCancerous, if you want your kids to suffer from aids before they're 10, make them watch this **** lazy excuse to make a quick buck (like \"The Nut Job\", a 1/10), this gets my worst possible rating since it's so bad some could even find it offensive. Who would enjoy this? No one, under any circumstances, would enjoy this.\rFinal verdict:\rDo not watch, ever, save your time and well-earned money, doesn't even send some sort of message."
    },
    {
      "rating": "0",
      "text": "This may be the WORST animated film in history! It's concept is almost as terrible as the voice work, and tries (annoyingly) to appeal to kids with the non-stop dancing and music. Another note is that it's animation is downright cancerous, it's painful to look at the movie!\r 0/10!!!"
    },
    {
      "rating": "0",
      "text": "Basically a bad mix of all popular animated movies. It has bad humour,  a bad  plot and is kinda boring all around. Dont pay for this uninspired, unfunny animation."
    },
    {
      "rating": "0",
      "text": "Question,who the hell give this a 10 and a 4?what? This movie has no effort at all.The film fails in everything,the animation,the story,the characters and worst,the  soundtrack.The animation is horrendous,the characters are just not interesting or loveable they're annoying and the voice acting is just the worst.The jokes it's bad so bad,I know it's bad even cause I know i'm bad at jokes too.The movie is just a waste of time and waste of Money Norm of the north may have a message but it was executed in the wrong way,it's just so preachy that it wants us to do it by twerking to save the earth."
    },
    {
      "rating": "0",
      "text": "never in my life did i ever think another animated movie would break me. Foodfight did that, the CGI Swan Princess sequels did that, and now this abomination did that too. oh my god! i'm literally at a loss for words right now. i mean, i know i watched this movie when it came out, but i rewatched just to write this review and.... i'm just as shocked as i was when i left the theater. this has to be the worst animated movie i've ever seen in theaters! the writing's absolutely horrendous, the story and plot don't make any god damn sense, the environmental message is painfully obnoxious, the animation's disgusting, the comedy's at its absolute worst and the characters have no brain, no personality and no purpose. i don't think it's necessary for me to tell you guys to go see, cause i don't have to. because anybody with a normal functioning brain wouldn't even sit through 5 minutes of this monstrosity! and if there's any dumb-ass idiot out, trying to defend this with the **** \"It's just a kids movie\", can i ask you: who the hell are you talking about? kids 4 and under, and with a lack of IQ? all the kids in my theater hated the experience of sitting through this movie!\rdon't watch this, ever!!"
    },
    {
      "rating": "1",
      "text": "A big steaming pile of polar bear **** mixed with a big pile of horse **** Pretty much something that you can come to expect with a project that has Rob Schneider involved in some capacity"
    },
    {
      "rating": "0",
      "text": "**** Animations, Awful Characters and a **** Movie, this is why! it is the Worst Movie in cinema because of the unlikable characters, plot doesn't add up any sense and It's Unwatchable! 0/10 this movie is dead dead dead dead! so F%^king Badly! Dead!"
    },
    {
      "rating": "4",
      "text": "The Story is predictable due to its cliches. The Characters are bad. The Animation is subpar at best.\rI dont recomend this movie unless like crap like foodfight"
    },
    {
      "rating": "5",
      "text": "You have grain and bear it! Norm have stop people come to North. I wonder why? Who want live in cold & snowing place? I like to know. So Norm went to NY to say not go to North. Same kind of jokes & just funny."
    }
  ],
  "recommendations": [
    "the_emoji_movie",
    "show_dogs",
    "transformers_revenge_of_the_fallen",
    "dragonball_evolution",
    "alvin_and_the_chipmunks_chipwrecked",
    "the_smurfs",
    "uglydolls",
    "planet_51",
    "the_boss_baby_family_business",
    "doctor_strange_in_the_multiverse_of_madness",
    "free_birds",
    "spy_kids_all_the_time_in_the_world",
    "the_host",
    "home_sweet_home_alone",
    "rim_of_the_world",
    "yogi_bear",
    "2012",
    "escape_from_planet_earth",
    "the_matrix_resurrections",
    "the_bye_bye_man",
    "district_9",
    "chicken_little",
    "the_wild",
    "space_jam_a_new_legacy",
    "the_cat_in_the_hat"
  ]
}