{"id": 3371, "title": "Notting Hill", "starring": ["Julia Roberts", "Hugh Grant"], "runtime": 124, "genre": ["Romance", "Comedy", "Drama"], "description": "William Thacker is a London bookstore owner whose humdrum existence is thrown into romantic turmoil when famous American actress Anna Scott appears in his shop. A chance encounter over spilled orange juice leads to a kiss that blossoms into a full-blown affair. As the average bloke and glamorous movie star draw closer and closer together, they struggle to reconcile their radically different lifestyles in the name of love.", "releaseYear": "1999", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/fQqfLeD7h4nCXK0N5HEa4dAExk1.jpg", "categories": {"plot": 5.947368421052632, "acting": 6.269230769230769, "ending": 6.833333333333333, "soundtrack": 5.5, "cinematography": 7.222222222222222, "familyFriendly": 6.0, "funny": 7.285714285714286, "action": 5.0}, "reviews": [{"rating": "10", "text": "Wow this was amazing. I think this could easily be one of my favourite romantic comedies. The comedy was hilarious and the romance was beautiful. Like with Pretty Woman, it had that class difference and it's such a strong element in these films. William is a bookseller, barely making any money to keep the store open. Anna is an actress and made $15 million in her last film. However, money doesn't stop them from falling in love. In fact, Anna makes all this money and couldn't find happiness, and William without her was stuck in an endless loop of living with no meaning. However, their paths cross and their lives are changed forever.I need to mention how good these ending scenes are in these romantic comedies. They all have the same premise with the one chasing after the other, but every time it's very special and takes your heart away.Normally this genre doesn't do anything special in cinematography but I think this film did a great job, having a lot of rememberable scenes. There were a few continuity errors, however the editor always prioritised emotion and there couldn't be nothing more important.After watching this I've realised that romance/ romantic comedies are my favourite type of film. They're just too beautiful."}, {"rating": "8", "text": "Notting hill is a romantic comedy reliased in 1999 its setting is district of London. It's a love story taking place in Notting Hill where a common guy falls in love with Anna Scott, a movie star played by Julia Roberts. They hang out but because Anna is very famous there are a lot of paparazzi taking photos and sharing them on the news, but they write lies and because of that Anna is very angry with everybody, also with William.. Will the love story go on or not? I like this film and I recommend it because it's lighthearted and pleasant and you can see it with your friends, family or boyfriend. It's perfect for a quiet evening!"}, {"rating": "8", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "3", "text": "This movie was duuuuummmb. It was long and stupid long looks at other characters that led to stupid innuendos that don't work until an ending that just died on the table."}, {"rating": "9", "text": "One of the rare genuine non-cliched romantic films. A movie so sweet and tender, it makes you feel like a wide-eyed child, watching the Looney Tunes for the first time in his life."}, {"rating": "7", "text": "When one of the World's most famous movie stars (played by Julia Roberts) wonders into his book store Will's (Hugh Grant) life is about to change forever.\r Hugh Grant has made some pretty terrible movies of late but, while this isn't up in the same league as Four Wedding's and a Funeral, it does prove that he once made some fairly enjoyable feel good romantic comedies. Funny in places and emotional in others suspend your belief for a couple of hours, sit back and enjoy a bit of light hearted entertainment."}, {"rating": "7", "text": "Notting Hill is a cute and charming late 1990s romantic comedy about a man, William Thacker (Hugh Grant), who meets a girl, movie star Anna Scott (Julia Roberts). Painfully adorable at times, the film has some oddly audacious camera movement from a film of its type, while also being a terrific comedic romp. However, its romantic elements are spotty and wind up being the main weakness of this film from director Roger Michell.\r Comedically, the writing is quintessential Richard Curtis. Sharp and witty, the comedy is not often overt, yet is almost always a winner. The comedy and the delivery from Hugh Grant had me in stitches many a time. This is the type of role where Grant truly shines as an actor, with Notting Hill being a sterling example of his main skillset: charmer with a quick British wit. The comedy here is intensely British from beginning to end, yet it manages to transcend cultural borders with nary a hitch.\r The writing does slack in one area, however: the romance. Shockingly enough for a romantic film, the relationship and romance just did not work as well as expected. Though solid, it was far from expectations. Whilst together, the chemistry between Grant and Roberts is undeniable. The writing reflects this with truly magical sequences of them together that will charm the socks right off your feet with its cuteness. Blended with the aforementioned comedy, Notting Hill was on a good path with these scenes. Yet, its haste it smashing its two lovers together, lack of development of Anna Scott's character, and its resolution all leave a sour taste in your mouth. The end result is that the only conclusion about Anna the viewer can come to is that she is a **** Though Will is head-over-heels with her, we can never understand why. Yes, there is incredible chemistry and passion whilst together. Yet, she keeps dropping the ball and gives very little reason as to why he should try to make it work at all with her. This issue could have been avoided by showcasing her side of things more often and not rushing the romance. Instead, the film slams them together and expects it to work. Whilst it works when they are together, separate the two and things fall apart. The romance lacked justification and its emotion was spotty. By the end, you are convinced they should not be together, in spite of what the film should tell you: that they were meant for each other or some other cheesy reason. I am watching a romantic comedy. Give me cheese. Make me smile because something is so cute. This romance lacks that overall cuteness factor.\r In spite of this, what won me over here is the camera work. Honestly, with the amount of tracking shots, one must wonder if Brian De Palma snuck on set and filmed some scenes in place of Roger Michell. This film loves its tracking shots, especially of Hugh Grant walking through Notting Hill. Another favorite of mine was him and Anna walking at night. This sequence in particular is the most romantic of the entire film and highlights the film's successes both with camera work (not just because of the tracking shot, the shot itself is quite good) and in crafting a romance. The best part of the scene with the duo walking, however, comes in the park. All of a sudden, a medium shot of them reading a park bench dedicated to a couple turns into a truly unique shot that I cannot say I have seen many times before. It is almost as if the camera is strapped to a balloon that was then allowed to float into the air. The end result is a truly striking aerial shot that really takes your breathe away. A final favorite comes with Hugh Grant walking through Notting Hill. Set solely to music, the camera tracks alongside Grant as seasons and time passes seamlessly. I typically hate when a film jumps ahead in time, but Notting Hill executes it so beautifully with a wide array of colors denoting the different seasons, that I have to mark this up sequence as a stroke of genius. Any film that wants to jump ahead in time should be taking notes from this sequence.\r While the film is not as romantic as it could be, tremendous comedic efforts work to overcome the inadequacies of the romance. Plus, a film with this many lovely shots and interesting camera movements cannot be written off too quickly."}, {"rating": "6", "text": "“Notting Hill” was a movie I was hesitantly looking forward to because it stars a bunch of solid actors like Hugh Grant (“Four Weddings and a Funeral”), Julia Roberts (“Erin Brockowich”) and Rhys Ifans (“The Amazing Spiderman”). I had also heard some good things about it. Then again it was a romantic comedy and those are really hit and miss for me… I am however pleased to say that I liked it.\r “Notting Hill” has a very basic plot: simple bookshop owner William Thacker, played by Grant, falls in love with the beautiful moviestar Anna Scott, played by Roberts. The entire movie is then a predictable “will they, won’t they?” ride but it is an enjoyable one at that.\r I have already cited the main cast, Grant, Roberts, Ifans, and they are all great. Hugh Grant is perfect in his role since he delivers his lines with a dry wit that the character demands. Roberts suits her part great as well not only because of her looks but also because of her natural sense of humor. I know Rhys Ifans from “The Amazing Spiderman” where he plays the dead serious professor, Curt Connors. His role in this film is not like Connors. Not at all actually. Here he is an odd-ball, slacker who lives with William, named Spike. I have noticed that characters named Spike are often kooky… Just a fun sidenote.\r Roger Michell is the director helming this film and his directing in this movie is fine. Nothing spectacluar or remarkable like what Edgar Wright does but… fine. He uses some long continuous shots that looks nice and the cinematography is very cool at times.\r The soundtrack in “Notting Hill” is good. I say that it is good because it has one great part and one not so great part. First of all is the orchestral soundtrack wich is not the best. I wouldn’t say it’s sub-par but it feels too cheesy and it beats you over the head sometimes. Then there is the great part, the songs. “When You Say Nothing At All” is such a great song and it fits the film brilliantly. Other songs are played throughout the movie and they are equally fitting,\r “Notting Hill” is a rom-com in it’s purest form. I have already described the basic plot wich is obviously not the strongest part of the film. The best part is however the script. The dialogue is very witty and funny. I cracked up several times thanks to the dry, humorous both style and tone of the talk in the film. However, the dialogue is a double edged sword. While it is funny it is very unbelievable and it feels fake and theater-like. I have no problem with theater but plays and movies are two different mediums and they should not be switched up.\r So in the end, “Notting Hill” is a standard rom-com with funny dialogue and fine acting. The story is compelling enough to keep you invested while not leaving the formula we are used to. If you want to see a fun movie with great chemistry between the actors you may not have to look any further than to “Notting Hill”."}, {"rating": "7", "text": "This is  one of those movies you either like or don't, and I hereby acknowledge there are those who don't. The songs are cringe-inducing, it would be better if it were 10 minutes shorter, and there are sappy moments, but this is a formidable feelgood picture of its time (along w/ Shakespeare In Love). A few real critics have pointed out that it's a rare for romantic comedy to be about something besides the romance. It has things to say about celebrity, and the casting plays off that quite well. It's mostly well written and funny. Supporting kudos to the guy who plays the roommate (Rhys Ifans). Attention was paid to details. The result is not perfect but not sloppy either."}, {"rating": "7", "text": "might vary and fluctuate..Notting HillNotting Hill is a character driven rom-com about an ordinary bookkeeper that falls in love with a highly controversial celebrity. As such genre requires, the chemistry among the lead cast is out of the park whose credit undeniably goes to the stellar performances. Despite of ticking for around two hours, the feature is immensely busy with characters and their sub-plots which is completely competent to the core. The slick humor that is imputed with such nuance that it never feels forced and the tale flows fluently in front of us. Addition to that, it never goes cheesy or sketchy or unnecessarily poignant to manipulate and draw out emotions through it. Curtis, the writer had few windows to manipulate the viewers with the help of his pathos characters but instead keeps the priority of storytelling up front. The writing is sharp, adaptive and gripping with a humane touch that helps keep its pragmatic characters more grounded. The music plays a major role in here with some aptly installed songs that elevates the momentum and doesn't stretch its way too. A decent background score, fine editing, casual costume designing but is unfortunately short on cinematography. It is shot beautifully with light and breezy environment that is appealing to the viewers from the first frame and is maintained with flirty talks and actually stardom. As mentioned earlier, the performance objective is safe and sound with Grant's sensible and hilarious performance and Robert's emotionally challenged one that is supported amazingly by Ifans and Bonneville. The director Michelle's execution might vary and fluctuate but the script by Curtis picks it up every time it falls down. Few hilarious one-liners, complex characters and stellar performances are the high points of the feature. Notting Hill is the card from the deck where there resided such multiple magical rom-coms which at this era seems to go extinct."}, {"rating": "9", "text": "Romance, celebrity and laughs."}, {"rating": "9", "text": "This movie is suck a feel good movie. You can watch it at all times, it cheers up every moment! It's lovely!"}, {"rating": "10", "text": "This film could be the best classics of all time."}, {"rating": "0", "text": "This is a candidate for the worst movie ever made."}, {"rating": "8", "text": "Never thought I'd ever fall this hard for a rom-com, but there's just something about the honest and off-beat awkwardness on display all throughout \"Notting Hill\" that really resonated with me. I've been exposed to the rom-com stylings of Richard Curtis prior to now and, while I've never really been blown away (\"Yesterday\" is pretty good, \"Love, Actually\" is okay) I've always seen his appeal. The wit, the thorough nature to his stories, the emotionality; all of it resonated as above par, but never really disarmed me as much as this has. \"Notting Hill\" is equal amounts affecting and hysterical, featuring terrific work from both Hugh Grant and Julia Roberts. Though, I have to say — for my money — the real MVP of this film has got to be Rhys Ifans, delivering quite possibly the greatest, most committed \"goofy rom-com friend\" performance I've ever seen in any movie like this. Other than the length becoming unfortunately apparent at a few points, I honestly loved this. Truly shocked."}, {"rating": "10", "text": "Boy meets girl; boy loses girl, boy gets girl, boy loses girl, boy wins girl back.  Okay, you get the idea.  But Julia and Hugh in this movie have that magic that doesn't happen very often.  Let's see, Julia and Richard Gere in Pretty Woman.  Great pairing so they made Runaway Bride.  Nope.  So Hugh is a travel book shop owner and Julia is a big time movie star.  What do they have in common?  Maybe movies like this result in a 50% divorce rate.  Enough of that!  It's a great, maybe the best, romantic comedy,  The sound track of love songs really add to the movie so see it with a home theater sound system.  Yes, when I went to London I did go to Notting Hill to see the locations for the movie.  I don't have that many DVDs but this one is in my collection."}, {"rating": "9", "text": "Charming and funny story about the close encounter with a star. The chemistry between Hugh Grant and JUlia Roberts works as a clock; even better with the foolproof british humor. Next time visit London, do not forget a walk at Notting Hill."}, {"rating": "5", "text": "This film is a sort of reverse Cinderella. He is a simple man, who fell in love with a famous actress. The central element of the film does not, therefore, nothing new. The cast, headed by Hugh Grant and Julia Roberts, does a decent job. Most of them has very secondary roles, with the exception of Rhys Ifans, whose character is one of the greatest comic elements of the film.The two main actors are Roberts and Grant, whose characters have features that turn them into allegories of themselves. In fact, Grant's character, a quiet bookseller, discreet to the point of erasing himself, realistic skimming defeatism, is a perfect allegorical representation of the middle-class man, who hardens with each blow that life gives. Roberts character, a famous and successful American actress, represents very well the rich and famous of the magazines and television, with her hidden weaknesses, a total inability to lead an \"normal\" life and a overwhelming desire to have a good family and love life, with several disastrous attempts. To some extent, we can even question whether the two actors were not, almost, to be themselves, since they can recognize in their characters several characteristics of themselves. The history between them is, at least, unlikely: a chance meeting followed by an (even more) unlikely romance shows us that love can overcome all barriers, at least in theory.This romantic comedy, very pleasant and entertaining, is delicious in its details, deeply British and imbued with a strong spirit of self-criticism and irony. This is a very human film, who tries to show feelings, and believe in their strength."}, {"rating": "3", "text": "If you’re a hopeless romantic (as I tend to be) you may last the distance of this way overlong, crudish, fairytale. By the first 20mins, I was getting somewhat restless and my viewing accomplice simply said, enough is enough, then got up and left. I waited to see if it got better – it didn’t.  Hugh Grant is typecast (or should that be miscast?) as the by the numbers coy, clumsy, bookstore owner - while Julia Roberts does her best to convince, as the poor-little-rich-movie star. Both have to deal with a forced, unrealistic, script by the same writing team of ‘4 weddings and a Funeral’ (& it shows) with a dreary slow pace.  Example; if you can swallow the idea that an International Movie Mega-Star beauty, can walk unnoticed through the streets and shops of London - without attracting any Paparazzi! - Or on the other hand, that a nobody, spreading a rumour one night in a local pub, can bring a street blocking avalanche of international press to an unknown ‘private’ address – then you might enjoy this outlandish ‘would-be’ situation comedy.  Ms Roberts knows only too well, how impossible it would be for her character to get away with this super-stretched situation.    It’s amazing what star power can do to convince some audiences to part with their money.  If you happen to be in the right starry-eyed mood (like; newly in love or just won the lottery) you could possibly be the right audience for this fluff – otherwise, don’t expect too much, look for something worthwhile or just steer clear.  If this is being touted as one the best romantic movies of its year – then, seems to suggest there may have been lean pickings on offer. As with too many movies of this era, the soundtrack is overloaded with unnecessary pop songs to fill in for gaps in dialog (and sell S/T CDs).   To each their own.Best point; It offers a role for a disabled character to be shown in a positive light."}, {"rating": "5", "text": "Always a fan of Julia Roberts, but so much of this was unbearably cheesy. Certain plot points. Hugh Grant's roommate. That music."}, {"rating": "10", "text": "Rom-Com heaven. This movie made me laugh as much as it made me cry. Supporting cast is outstanding. Highly recommend."}, {"rating": "8", "text": "●●●●●●●●●●■■■■■■■■■☆☆☆☆☆°°°°》》》¡{}[]{}[](),.\"\"\"****$$$@@@+×÷=+×÷=+×÷=__,_,_,_,.....&.&.&.&.&.&.."}, {"rating": "8", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "8", "text": "*:*:*:*:*:*:*:*:**::*:*;*;**;*;*\"*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "10", "text": "melhor filme que eu ja vi, o fav da mari. juju tb foi obrigada a gostar!!!!!!!!!!!!!!!!!!"}], "recommendations": ["morning_glory", "the_royal_tenenbaums", "eddie_the_eagle", "midnight_in_paris", "while_you_were_sleeping", "american_hustle", "the_terminal", "the_longest_ride", "charade", "the_second_best_exotic_marigold_hotel", "silver_linings_playbook", "crazy_heart", "as_good_as_it_gets", "burnt", "the_intern", "sleeping_with_other_people", "the_tourist", "the_best_exotic_marigold_hotel", "jerry_maguire", "catch_me_if_you_can", "yesterday", "pretty_woman", "a_star_is_born", "me_and_earl_and_the_dying_girl", "begin_again"]}