{"id": 897, "title": "Now You See Me 2", "starring": ["Jesse Eisenberg", "Mark Ruffalo"], "runtime": 129, "genre": ["Crime", "Thriller", "Action", "Mystery"], "description": "One year after outwitting the FBI and winning the public’s adulation with their mind-bending spectacles, the Four Horsemen resurface only to find themselves face to face with a new enemy who enlists them to pull off their most dangerous heist yet.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/A81kDB6a1K86YLlcOtZB27jriJh.jpg", "categories": {"plot": 5.948717948717949, "acting": 5.64, "ending": 5.857142857142857, "soundtrack": 6.0, "cinematography": 5.5, "familyFriendly": 5.266666666666667, "funny": 5.5, "action": 6.4}, "reviews": [{"rating": "4", "text": "This isn't a bad movie nor a great one,it's somewhat in the middle that it is really up to you to decide.\rMe? The movie is an enjoyable dumb film that requires you to turn off your brain,it is also my new guilty pleasure film with magic tricks that are undeniably inconceivable with the power of visual effects.Characters are dull which you won't feel startle of them or even care cause you know they can get a way out of their dumb problems,they feel invincible and you won't get an emotional connection cause all of them are unvarying(Except for the Hulk's character) but only saved by their chemistry cause is on point.Plot is uninteresting and that's all.There is so many continuity errors and pacing issues in the film that can be sometimes noticeable.The movie is cliche or predictable and it makes this film just so generic,mediocre or just a dumb popcorn flick.\r Now You See Me 2 isn't as entertaining as it's predecessor,it didn't brings new to table but brought us the predictable formula and tricks that wants you to throw you brain on the cinema floor or drink a lot of alcohol to get drunk in order to fully enjoy the film if you are a type of person who question everything or skeptic and always nitpicks or too smart to watch this film"}, {"rating": "5", "text": "You walk into \"Now You See Me 2\" knowing what you will get! You check the logic sense of your brain at the door entrance to the theatre because while some of the magic tricks are explained even the screen writer Ed Solomon couldn't or doesn't explain them all just like the nerd in us couldn't explain what was going on except some guys wanted a computer gadget that would let them rule the world.\r This is a movie where you try--and won't succeed--in keeping count of the chases, windows and all sorts of glass that crash, the fights, the double crosses, motorcycles going wild, impossible turns in the story but the cast will keep you on the edge of your seat at certain points though you don't know why or even know how the scene will turn out.\r The director Jon M. Chu, the film editor Stan Salfas and visual effects supervisor Matt Johnson had their work cut out for them and they all succeeded as did the actors from Jesse Eisenberg, Woody Harrelson, Dave Franco, Daniel Radcliffe, Lizzy Caplan, Jay Chou, Sanaa Lathan, David Warshofsky, Tsai Chin to the good, always reliable, veterans Morgan Freeman and Michael Caine. The only misstep is Woody Harrelson's twin but you'll have to see the movie to know what I am talking about though, looking back, it may not have been a misstep.\r \"Now You See Me 2\" is just for sheer entertainment though at 129 minutes it is asking a bit too much from the audience. It may not make sense, it may be all over the place--and world--but it has laughs, suspense, a lot of noise, some thinking for nerds, enough action for fight and chase seekers, even a hinted at love story and certainly an ending that leave a \"Now You See Me\" open for another sequel!"}, {"rating": "6", "text": "Although not quite up to par with its predecessor, as sequels go, this followup to its fun, playful parent is nevertheless entertaining throughout, albeit a bit overlong and, at times, a little forced. Its clever tricks and intriguing twists and turns generally hold viewer interest, though one particular sequence goes on too long for its own good. All in all, a modestly enjoyable afternoon at the show."}, {"rating": "2", "text": "Now you see me 2\rNow you don't  3\rNow that's what I call franchise~!\r..........................................................\r::::::::::::::::::::::::::::::::::::::::::::::::::::::::::"}, {"rating": "7", "text": "As with the original, Now You See Me 2 makes up for its lack of substance with charismatic stars and an intriguing plot. The cast were as good as ever, with Mark Ruffalo, Jesse Eisenberg and Morgan Freeman in particular, adding to their characters and making them more interesting. Isla Fisher's character was missed, but her replacement was energetic enough to fill the void. There were plenty of plot twists (some clever, some a bit far-fetched) to keep your interest throughout. There was a good balence between humour and thrills as well. Bottom Line: if you enjoyed the first one, you'll probably enjoy this. If not, you probably won't think much of it. Hopefully, this does well enough to justify a third instalment in the trilogy."}, {"rating": "1", "text": "The first movie is high on itself, this is even more high on it self. Same with eisenberg... Its just dumb and not as cool as it think it is."}, {"rating": "3", "text": "More than half of the movie is repetitive and shameful with a horrible script, unsalted dialogues, weak effects, jokes worse than Marvel ones, any surprise or detachable scene, predictable end and mediocre performances. They just ruined the movie so bad that this waste of time and money hurts my soul."}, {"rating": "6", "text": "Magical crime. Like most sequels, this is a disappointment. It's overlong and the pace was uneven. The cast do their best though, and its clever enough to keep your mind awake for the whole film."}, {"rating": "1", "text": "After really interesting and cool first part i watched this kind of exaggeration...so sad."}, {"rating": "3", "text": "There are several films about the world of magic and illusionism available, and many are great. This film is just one more, and it followed one of the best, to reveal itself as one of the worst.The story is simple: after the events of the first film, the Horsemen separate and wait for instructions from the Eye. However, if some get tired and give up, others insist. Finally, they are summoned to expose the secrets of a new technological application but everything goes wrong: exposed to the world, they flee and end up in Macau, where they will have to find out who is the person who betrayed them.What can I say about this film? That many of the most interesting and entertaining features of the first film have simply disappeared. Director Jon M. Chu was able to reveal himself to be a nullity by making a hasty film, full of unrealistic and imaginative situations, as well as clichés like the evil twin or the illegitimate son who wants to please his father. Even as a piece of entertainment, this film is quite weak and unable to honor its predecessor.The cast is inherited from the previous film, with few modifications, but they are at a distance from giving us a good job because they weren't entitled to some decent material. So, we have again Jesse Eisenberg, more arrogant than in the first film, James Franco and Woody Harrelson, who will also give life to his character's presumptuous twin brother (a stupid script option, at the very least). Mark Ruffalo, Morgan Freeman and Michael Caine also returned to their characters, and I would say that they are the best actors here. The problem is that they could not do anything to improve the film given that they did not have much visibility (Freeman and Ruffalo, who appear only when necessary, are really underused sometimes). The exit of Isla Fisher (quite intelligent given that she saved herself from a film that would not add anything good to her career) was filled by the entrance of Lizzy Caplan, as a fun character that makes you smile, adding moments of spontaneity and irreverence to a film that, without it, would be more boring. The villain was incarnated by Daniel Radcliffe, but he looks like a cynical caricature, and I was never able to take him seriously.Technically, it's a fairly regular film: on the positive side, I would highlight cinematography, with a good work of light and color, enhanced by the authentic color of the streets of Macau, a former Portuguese colony in China where much of the film takes place. The sets and costumes are good enough and there is some realism and verisimilitude in CGI and in visual and sound effects. The soundtrack, it seemed to me, is inherited from the previous film with few modifications."}, {"rating": "0", "text": "This movie has to many good actors but the story is a waste of time! Boring!"}, {"rating": "0", "text": "this movie has no soul. just watch oceans eleven, it is the same thing but better in every way"}, {"rating": "3", "text": "I really enjoyed the first one, but this sequel has none of the original's assets. Much of the cast is back (Jesse Eisenberg, Woody Harrelson, Dave Franco, Mark Ruffalo & Morgan Freeman) and it's a year later. What's not back is the slick, almost amazing illusions that made the previous one so much fun. It's become more of a Mission-Impossible-style caper with a thin gloss of magic. Too much needless chatter and no smart patter. The action is often confusing and the plot is needlessly convoluted. Don't \"see me\": Just rent or stream the original."}, {"rating": "8", "text": "This movie delivers all expected of magic - theatrics, spectacle, humor and slight of hand. It also delivers awesome characters and a great soundtrack. However, the camera sometimes shakes for no reason and the storyline lacks anything special."}, {"rating": "6", "text": "Now You See Me 2 is a rather mediocre movie. The director is Jon M. Chu director of Justin Bieber: Never Say Never and Jem and the Holograms which are horrible movies and got very low metascores.  What I don't understand is why didn't they have Lewis Letterier back as director and why did Lizzie Caplan replace Isla Fisher.  The movie is flawed but it isn't dreadful.  Overall, it should only be seen if you had nothing better to do or if you liked the first one."}, {"rating": "4", "text": "They missed a golden opportunity by not calling this \"Now You Don't,\" but I digress.\r This is literally the same film as the first. It's got some fun tricks and an amazing cast, but the big \"twist\" at the end is illogical and out of left field. It starts as turn-your-brain-off fun but the film eventually just refuses to end and becomes a chore, and Dave Franco's handsome face can't save it."}, {"rating": "10", "text": "Are you seriously? This film can not be estimated lower than 8, and 5 you bet? I really enjoyed. Although he is not as unpredictable, the first film, but at least keeps the bar. I want to believe in each focus. I advise everyone posmtoret first and second part. You will not regret!"}, {"rating": "9", "text": "The movie was really great, very unpredictable at times which gave me a surprised look at some scenes. Acting very well done, i cant say more since i have never seen the first movie."}, {"rating": "5", "text": "Now You See Me 2 improves upon the original in terms of visual effects and style. However, the characters (aside from Mark Ruffalo) remain one note and the plot here is preposterous from start to finish."}, {"rating": "3", "text": "Too plotless. I liked the 1st. I like all the actors mucho. Thought that would be enough for a 2 hour timeout from an 85-degree June day. Tried to convince myself that it was ok to not have any kind of comprehensible story line; just enjoy the action sequences and the production design and the smart comebacks from well-known box office draws. Sigh. Production design wasn't all that great. Morgan, Mark, Michael, the rest of youse -- I thought I knew ye to be better than this. Guess you all gotta pay the mortgage on your islands and Lear jets."}, {"rating": "5", "text": "Not really much of an improvement over the first one. There's just too much going on. The thing that makes movies like The Prestige and The Illusionist work is that while the magic tricks and their explanations in those movies are unrealistic, they're still in a way believable and shocking and the tricks themselves are impressive. Everything in Now you see me and it's sequel is just downright ridiculous to a point where it's exhausting. There's no real build-up, there's no investment from me personally because I already know that everything happening in the movie is done with CGI, and it's all so predictable. They make the horsemen out to be these superhero magicians that everyone cheers when to me they come across as people on a stage touting magic tricks that aren't even real"}, {"rating": "10", "text": "Very good movie beside there where some things when you stayed like huh? But very good, the cliffhanger part at the end will be told in the third movie (NYSM3). Of course there were some things that were a little off. More fun. More entertaining and the heists were good."}, {"rating": "2", "text": "While the first film was amazing, the sophmore film in the franchise disappoints. The film is boring, and so much more confusing. Instead of enjoying the film, all your doing is trying to figure out whats going on."}, {"rating": "10", "text": "\"Now You See Me 2\" really surprised me. Knowing that it was sequel, I was at the expectation for how it could meet with the success of the first movie, and I can say that it exceeded It. One of the best things of the sequel was the emotion that causes the constant discoveries and how the director makes you stay connected with his film. That's why I found it exciting and captivating. Among an all-star cast and an enthralling story, I think we have an excellent summer movie."}, {"rating": "8", "text": "Very entertaining movie. not so surprising as the first Now You see Me, but it still was unpredictable in a good way and I liked it a lot. Excellent that they casted Radcliffe for this part, given the whole 'magic' subject, made it extra funny."}, {"rating": "9", "text": "Now You See Me 2 is a fairly exciting sequel that I really wanted to see. The original Now You See Me was a very fun film, though hard to understand, but was very thrilling. In this sequel, it's the exact same thing. Now You See Me 2 is very entertaining but once again, it's very hard to follow through, if you forgot little plot details about the original. Yet the magic is back and the amazing cast is once again excellent. Now, Daniel Radcliffe was fine - not amazing. He was just there and it felt like it was for no reason. I really loved the china setting and how it all fits in and that element was really fun. Overall, I actually like this sequel better than the original. I personally think fans of the original should like this one as well as you do get a lot of magic scenes from the movie. The film had a perfect run length and it's just entertaining. Just go watch it when your brain is clear so that you can thoroughly understand it. (90/100)"}, {"rating": "0", "text": "Unbelievable.Unconvincing.Annoying.Dumb.The more they try to be funny and smart ,the dumber they look like,the stronger your feeling to leave the cinema is。"}, {"rating": "6", "text": "It's a dumb fun film.If you like the first film you will feel the same with this,with good characters and a good cast with insane tricks with again a great twist in the end.Now you see me 2 is a must see dumb film."}, {"rating": "0", "text": "A film that have unbelievable magic that wants you to turn off your brain to fully enjoy this messy film.Characters that are one note aside from Mark Ruffalo's character that was given in depth characterization.The film all in all is just cliche with lots of lots of continuity mistakes and pacing issues.It lacks the fun of it's predecessor,they just throw so many tricks that either unbelievable,dumb or again cliche."}, {"rating": "0", "text": "The first one was abysmal and stupid, and I did not think it remotely possible, but this one is even worse. Talk about a waste of some good actors, but this is braindead hollywood at its absolute worst."}, {"rating": "8", "text": "extremely entertaining movie, im going to tell you right now its worth a watch.\r the movie is about magic and resurrecting people (not literally) while being hunted down by Alfred (from the Dark Knight trilogy), his son Walter and the FBI in short.\reveryone gives a great performance, especially Lizzy Caplan who brings so much energy to the movie that elevates it and you and makes almost every scene with her incredibly fun.\rJesse Eisenberg and Mark Ruffalo are basically the stars of the movie and they give a great performance. the other characters do an OK job but nothing spectacular.\r the scenes that contain magic are of the best in the movie even if they are so over the top (Jesse stops the rain) that it makes you think \"nope not a chance that can be done\".\r overall i smiled and laughed throughout the majority of this movie, the story is great, the characters are funny and most of them are well developed (one is particularly annoying) but even with its faults i cant say i didn't have a great time and i really think you should see this movie!"}, {"rating": "5", "text": "You see me, now you don't, now you see me twice, now you don't twice. In a game of Now You See Me, magic is always played on the field such as magic cards and several magic tricks. Sadly, this not only brings the conclusion of this magic madness, but it also brings the tired clichés into action."}, {"rating": "10", "text": "Великолепный фильм имеет оценку в 6.1, в то время, когда у паршивого варкрафта 8.6, что за нахуй?"}, {"rating": "7", "text": "The second movie explains the origins of why the first took place and expands on the concept of magicians trying to work against those that would seek to harm people or use them for personal gains. Now You See Me 2 has plenty of misdirection and plot twists that fuel the \"magic\". It's all very good as a whole but the package isn't quite as special this time around. If you're like me, everything was good but not as great as it could be. The surprises were legitimate but they were in some way expected. Only a few parts of the movie truly made me go \"aha\". Still, it's well worth a watch, assuming you enjoyed the first film enough to think to yourself \"I'd like to see more\", and why wouldn't you? There's a superb cast to watch, just be sure you're watching everything carefully. There's a LOT going on in this sequel. Will there be a third?"}, {"rating": "6", "text": "Sillier and cheesier, this perhaps unnecessary sequel is just concerned about the fun. It doesn't take itself too seriously. It's more excessive with it's visuals and more over the top with it's plot and tricks. While not all of them are bad, it's ridiculous flourishes keep this sequel from attaining what made it's predecessor such a surprise hit. That being said, it's not without it's entertaining moments.\r Things like Woody Harrelson's delightful double performance and the inclusion of the always wonderful Daniel Radcliffe are greatly appreciated. Lizzy Caplan joining the cast is not. Meant to be the comedic relief, Caplan's character ends up being grating instead.\r The plot itself is fine, but it's beats are familiar. It tries to fit in so many different twists and character reveals that it just feels too packed that it's hard to care about everything going on. Maybe it's time to trim down on the number of heroes and villains here.\r Mark Ruffalo gets the majority of the attention here. His character is left with the more serious side of the plot, while Eisenberg and the rest of the horsemen are left to wander around and pull off flashy tricks. Considering they're the ones doing the cool stuff, perhaps we should've been focusing on them.\r So how is the magic in this sequel? That is, after all, the biggest part of the movie. Well, quite frankly they are stunning. There are a lot of cool, crazy things happening onscreen. It's the one part where the movie goes bigger and actually does end up with something better. It also doesn't skimp out on the explanations either. Things like an extended card throwing sequence (not exactly magic, but still cool) and Eisenberg controlling the rain are a treat to watch. The only problem is that it's biggest trick is one you can see coming from a mile away.\r When it comes to the flash, spectacle, and magic tricks this sequel doesn't let viewers down. However when it comes to the plot holding it together it stumbles. Quite a few of it's reveals are obvious and familiar. It's big ending trick is one you'll know how it plays out. It's inability to take itself seriously does lead to some entertainment, but ultimately hurts it in the end. Yet, the horseman still have a few tricks up their sleeves to make it not a total waste of time for fans of the first movie.\r 6.8/10"}, {"rating": "8", "text": "If you like the first one, You'll love this one. The magic is good but what really gets it is the cast that works well together and a surprisingly well written story that keeps you interested from start to finish, Even if it is a little predictable."}, {"rating": "7", "text": "\"Now You See Me 2\" is a worthy successor to the original with another dose of fun and spectacularly deceiving magic tricks and thrilling action sequences that will keep you on the edge of the seat for most of the film.\r While there are some questionable element here and there that I won't spoil for you, I never found they ruined the movie. There is more humorous relief here compared to the original which works both in its favor and sometimes entirely against it, but overall \"Now You See Me 2\" is a fun summer movie that delivers spectacle and wonder in equal parts."}, {"rating": "5", "text": "A bit disappointing.  The first one was dumb, but had decent characters, humor, a slight love story thrown in, and tricks that were actually explained, or at least...sortof...possibly plausable to keep you invested and keep the story grounded and keep me into it.  This film...had very few of those things.  The witty banter is there between the characters which makes it vaguely enjoyable to watch, but the plot is beyond stupid, and the tricks are just over the top and not even believable to the point that you just stop caring about what you are watching, the last trick specifically was quite unrealistic and a poor ending, and one scene in the middle was also laughable in how silly and unrealistic it was.  Also there wasn't much of a love story, I liked Isla Fisher better than the new girl they brought in (she was OK but just OK) and one of the bad guys was just annoying and the other bad guy was predictable.   Poor plot, unbelievable \"Tricks\" that they don't even explain and were just thrown on screen to sell tickets...poor movie overall but mildly entertaining possibly if you liked the first one."}, {"rating": "7", "text": "Following the footsteps of it's predecessor, this more ambitious sequel offers you more unbelievable magic tricks and over the top plot twists in a very convoluted and confusing story. But, with very decent acting performances, impressive and fun to watch tricks and a pretty satisfying conclusion, Now You See Me 2 is an entertaining and fun movie that you will probably enjoy if you liked the first one."}, {"rating": "6", "text": "They should have stopped after the first movie (I gave it a 10/10). There are ideas that work only ones and are wasted in a sequel. This is caused because you expect more and the sequel has to be upped to eleven. I want to say it is not a bad movie but inferior to the first. The twist don't work that great and the final is a little bit unbelievable. I have no complains with the characters. There is some development that fells natural. The visuals and soundtrack are also O.K. My overall complaint would be that the parts of the story are not well fitting and the character chemistry is a bit off. Maybe the first movie has driven my expectations to high (and my rating down). My advice is watch and rate this movie for yourself if its available on TV. You should definitely watch the first one."}, {"rating": "7", "text": "When I heard that there was going to be sequel to now you see me my reaction was \"why in gods name would they make a sequel to a movie that doesn't need one this can only lead to bad things\". Man was I wrong. This movie answer all the questions that I had from the first. Plus I actually did what I wanted the first film to do, focus on the horseman more. Plus add an interesting obstacle for them to overcome. Also the Morgan Freeman character was explored more in this film. Add some great magic tricks and you got a great film."}, {"rating": "7", "text": "An interesting movie, if you like magic tricks (more like movie effects here, but still interesting) and the story is an interesting watch, even though doesn't make sense at some points, but besides that it is pretty ok and the movie is fun."}, {"rating": "8", "text": "Who doesn't like magic?  To see a movie where magic is the tool that the \"heroes\" use to fight their battles is the best.  Okay, it is movie magic, these actors are not real magicians, but it's the whole idea, the twists and turns, that makes the movie go."}, {"rating": "7", "text": "I took my daughter to see this with me after watching the first one with her. We both really enjoyed the film and we both liked the tricks. It was a great date with my 10 year old and I didn't feel it was too advanced for her and I was still entertained."}, {"rating": "8", "text": "Smart, complex and surprisingly impressive, Now You See Me 2 is packed with even more illusionism and tricks than it's predecessors, so the result: a satisfying sequel that brings back it's amazing characters."}, {"rating": "10", "text": "Hacer una secuela de una gran película es complicado, y lo han hecho a la perfección. No se si supera a la primera pero tiene escenas increibles y los personaejes siguen siendo igual de frescos y excelentes. Me encantó de principio a fin, espero la 3."}, {"rating": "7", "text": "Nice movie...enjoyed it a lot. But still I think, Now You See Me 1 was better than this flick...\rThe moments when their final show was live worldwide and the law enforcement couldn't close on them for like hours or so is bit cheesy ( like White House Down, Olympus Has Fallen etc or so ... :) ) I mean countries like them pride themselves on their military power, law enforcement tactics in other movies and ..u get the idea :D"}, {"rating": "10", "text": "First of all, I cannot believe why so many people think this film is not goo enough. The reviews they've given just do not make any sense. I believe that this movie is one of the best I've ever seen. The plot absolutely blew me away. Maybe because I do magic, I think that it's astounding but the fact remains that the dialogue for this movie is indeed deep and provocative. The CGI and special effects were absolutely stunning and the use of real life magic sequences fit perfectly. The twists and turns that finally led to the dramatic finale was stunning. Another great tribute to the world of deception."}, {"rating": "7", "text": "I found the movie really entertaining and fun to watch. the acting is good, magic tricks are excellent and it delivers good entertainment. I did not see the first movie so not sure how it compares but if you are looking for something entertaining and fun to watch this movie will not disappoint you."}, {"rating": "7", "text": "I know this movie is going to be hated because it is not realistic and a bunch of bs but i enjoyed it, it was a fun movie to watch and no i don't believe in magic It is only an illusion"}], "recommendations": ["now_you_see_me", "shazam_fury_of_the_gods", "avengers_age_of_ultron", "kingsman_the_golden_circle", "pirates_of_the_caribbean_on_stranger_tides", "the_last_witch_hunter", "poseidon", "rocknrolla", "hancock", "incredibles_2", "next", "jumper", "project_power", "thor_love_and_thunder", "guardians_of_the_galaxy", "terminator_genisys", "pan", "the_suicide_squad", "thor_the_dark_world", "thor_ragnarok", "hercules", "zombieland_double_tap", "jack_the_giant_slayer", "the_number_23", "lucky_number_slevin"]}