{"id": 596, "title": "Now You See Me", "starring": ["Woody Harrelson", "Morgan Freeman"], "runtime": 116, "genre": ["Thriller", "Crime"], "description": "An FBI agent and an Interpol detective track a team of illusionists who pull off bank heists during their performances and reward their audiences with the money.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/tWsNYbrqy1p1w6K9zRk0mSchztT.jpg", "categories": {"plot": 5.702127659574468, "acting": 5.2727272727272725, "ending": 6.565217391304348, "soundtrack": 5.5, "cinematography": 3.0, "familyFriendly": 6.0, "funny": 6.25, "action": 6.833333333333333}, "reviews": [{"rating": "10", "text": "We thoroughly enjoyed this movie...fun entertainment with a surprising twist at the very end.  Not a lot of magic in the film, but enough to keep you watching for the next trick.  I do not like either Harrelson or Freeman since both seem so arrogant, but the cast just *worked* together.  Certainly a far better movie than a lot I have seen lately, but I go to be lost in the magic of movies, not for any deep psychological studies or great social commentary."}, {"rating": "3", "text": "This movie is not good. The preview is twice the production the movie is. There is no character building, and you are instantly thrust into this story that does not pan out. Do not waste your time."}, {"rating": "3", "text": "\"All flash and no trousers\"  A weird saying, but who's Father isn't full of oddness?   Mine certainly was and he used this expression regularly when something was, basically, bollocks.   Now You See Me falls in to this category.  Cool cast,  flashy effects,  great locations, mixed with a predictable story line, average script and some truly wooden performances  Dave Franco, I'm looking at you.\r It's mindless entertainment for the masses.   Avoid paying cinema ticket price, perhaps watch for free when it hits your PTV provider; provided you are fully up to date with your TV series viewing...."}, {"rating": "7", "text": "Although it suffers from a flat ending and can't help feel fictional, Now You See Me provides great visuals and some smart twists (not the last one!) to succeed."}, {"rating": "5", "text": "Now You See Me has great expectations, but it also has a stale mystery, it lacks a lot of thrill to it too, and the magic is sorta predictable after the first hour passes."}, {"rating": "2", "text": "Nothing gives meaning, everyone see themselves as perfect \"gods\", over the top music, dull story. Dumb and shallow all the way."}, {"rating": "2", "text": "That is what you call 'unlikable' characters. Plus they all acted with some out-of-space arrogance, that were all the way of the movie. And I actually don't know how they all did that, I mean did the director told them to act like rebel-teens who think they are the best? However the whole movie was a disaster. It wasn't interesting at all. Even the voice of Morgan Freeman couldn't save it. It was like a cheap movie - not a little money is invested, but some visuals can't replace screenplay (dialogues.. so poor), one good actor can't compensate 5 fools, who can't act at all and so on.. And no point in the movie, no meaning. Crap."}, {"rating": "3", "text": "Visually appealing movie that is brought down by the very stupid and unbelievable twists that really stretch the suspension of disbelief. Heavy reliance on CGI when trying to show \"magic\" which breaks the illusion that the Four Horsemen are only illusionists. Add to that a pretty pointless and shoehorned romance subplot and you get Now You See Me."}, {"rating": "2", "text": "This was one of my worst movie experiences in the past ten years: terribly derivative, intellectually insulting, and a complete waste of time.  The sequence of events are too convenient for a heist movie, so the magic element had to be thrown in.  However, the magic show scenes are too boring, and the interplay between the characters is too dull to be a magic movie...so some heist element had to be thrown in.  This was my general take  it is neither one nor the other, nor good enough to be either.\r The bright spots in the movie are Dave Franco and Mélanie Laurent (Shosanna from Inglourious Basterds), the only two actors given real characters and a chance to turn in decent performances.  Everyone else plays a smug version of themselves.\r Any specific complaint about the movie would include spoilers, so here are some surface-level observations:\rActing  mediocre, with hints of terrible by Mark Ruffalo.\rPlot  much more convenient than clever, with \"magic\" used to explain away impossible plot points.\rDialog  snarky and witty (excluding Ruffalo's character), but so much so that there are no real characters, just one-liner automatons.\rPlot twists  there are no real plot twists...if you think \"what is the most ridiculous thing that can happen in this situation,\" that is exactly what will happen.\rThe ending  I almost threw up in my empty pop-corn box.  Saccharine doesn't come close to describing it.\rOverall philosophy  Magic exists?  Insurance companies are evil?  Revenge is sweet? Love pops up in the strangest places?"}, {"rating": "0", "text": "This is possibly the worst film i've ever seen, and i'm not saying that lightly. I cannot understand these positive reviews other than they're mentally deficient or paid to do so.\r Basically the plot is a poorly executed mess. The film itself lies to the audience, so when the lame twists happen they just feel like the writers trying to get back on course. It's like a script that's not gone through so much as one revised draft.\r The only way to explain the cast, budget, etc. is that the film simply fell apart in production. Perhaps the emphasis was put on all the wrong aspects.\r If you like this... I can't respect you. It's wholly broken. I'd sooner watch Human Centipede, Battleship or a rom com."}, {"rating": "0", "text": "Intellectually insulting, The story felt like it was written as they were shooting the movie! as did the twists and turns. I couldn't believe people are rating this movie so high!"}, {"rating": "2", "text": "Terrible Movie however it's weirdly entertaining.\rWhat was the whole point in the movie? (spoiler alert)\rMark Ruffalo spent 30 years working his way up in the FBI to exact revenge on some people who were in no way responsible for the death of his father. Is it just me that thinks it stupid that mark ruffalo wants to put Morgan Freeman in prison for simple telling people how his dad did a magic trick, how all of Micheal Cains money is stolen because he didn't pay out on an insurance claim and how they stole half a billion dollars because the company made a safe below standard?\rAnd as for the ending……\rSo mark ruffalo was part of 'the eye' and the four horsemen for no apparent reason put themselves into the public eye as wanted criminals to become part of a secret society. The four horseman have given up their whole lives to help Mark Ruffalo for no reason at all apart from being initiated into a secret society, again which they will gain nothing from.\rSo in conclusion: incredibly far-fetched and far to complicated for no reason, there was no character development and in my opinion one of the worst and most pointless movies i have seen in years…."}, {"rating": "3", "text": "\"Now You See Me\" was itself a type of magic trick. Louis Leterrier uses a great cast with the premise of magic and bank robbery to draw us in. Unfortunately it doesn't take long to realize that instead of character development we get Morgan Freeman explaining the plot after the fact. At no point did I find myself wondering \"how is this going to turn out?\" The magic has little excitement because we know that using CGI, anything is possible. Add that to the fact that the \"big reveal\" is exactly what you would expect and you end up with the feeling that the trick was on you."}, {"rating": "6", "text": "It's fun in the moment. Some entertaining performances and chase scenes. But there are a half dozen plot holes and an ending that is just lazily handed to the audience. Not awful, just nothing special."}, {"rating": "7", "text": "To be honest, I was not expecting much for this movie. It wasn't as hyped as other movies and I would never have known about it if a friend hadn't suggested that we watch it. I have literally jut come home after watching it and I have to say, I enjoyed it. Sure, the characters could have used a little more development, and the movie may seem a little confusing for others, but I was able to keep pace. There is also a rather surprising plot twist (which I won't reveal, obviously). Now You See Me may not be the best movie out there, but it's a pretty good one. Check it out."}, {"rating": "7", "text": "Most reviews of \"Now You See Me\" are comparing this movie to the \"Ocean\" series, but while the elaborate schemes are somewhat similar it really isn't the knockoff one expects.    Rather, the movie follows the work of four magicians who call themselves \"The Four Horsemen\" and thrill audiences with some very intriguing stunts.\rThere is the criminal element as stolen money is involved, but the real story is the wonder of magic itself, or tries to be.    Magic is the type of entertainment best seen in person.    One cannot take magic too seriously when cameras are involved, at least I don't.    There are a couple tricks explained in the movie and like any time you find out how the trick is done, you're surprised either at its simplicity or the amount of preparation that precedes it.\r\"Now You See Me\" is a fast paced fairly light hearted tale, all the actors and actresses turning in good performances, but none are going to be serious Oscar contenders.    The ending has been criticized, but I found it an interesting one.    Yes, some parts were ridiculous, but what movie with any action isn't?    Overall, this is a decent movie, not mindblowing by any stretch, but worth the price of admission."}, {"rating": "8", "text": "How refreshing it is to see a film where the child in you is brought out and bewildered. I found myself smiling from start to finish in awe of the magic and suspense.\r Perhaps it is the magic or rather trickery that had me smiling; you don't know how they do it and a part of you thinks it is magic. But of course you know it isn't there must be a trick. Either way you have a good time regardless. I found myself agasp much in the same way someone would be if they were personally tricked by a magician.\r It is cleverly written, humorous, and has action. What more could you ask from such a fun movie?"}, {"rating": "9", "text": "4 magicians (Jesse Eisenberg, Woody Harrelson, Isla Fisher, Dave Franco) are assembled into a super magic act that showers its audiences with money. Meanwhile, the FBI (Mark Ruffalo) and a magic debunker (Morgan Freeman) are out to bust them. The tricks are cool, the look is glossy, the pace never lags and the writing keeps it tight. Just like a good illusion, it's mostly flashy surface with minimal deep meaning (thankfully). Go expecting slick summer fun and you'll be thoroughly entertained."}, {"rating": "9", "text": "Now you see me is pleasant and a clever surprise, with some fascinating effects and one of a kind cast. I loved what the movie is about and I had a really good time watching it, some problems with the movie that are not worth to talk about, despite mediocre reviews, Now you see me is one of the best of 2013."}, {"rating": "8", "text": "Just came from the theatre and talked all the way home about how much we enjoyed this movie from the very first minute. We felt it was well cast,well directed and totally entertaining. Even the music was catchy. It moved right along, did not spend too much time on character back stories and offered a number of interesting twists. I'd pay  full price) to see it again!"}, {"rating": "8", "text": "I was expecting a lot from this movie, as the premise (magicians AND heists?!?) sounded like a combination made in heaven, and the cast was a dream (Eisenberg and Harrelson back after an awesome Zombieland teamup, and then sprinkle in both Morgan Freeman AND Michael Caine?). This movie should have been a 10. \"Unfortunately,\" it was just an 8. The movie was a lot of fun throughout, wasn't patronizing, had some decent twists, was well acted and directed, and never tried to explain anything supernaturally (which I would have hated as a proud skeptic). It was just a bunch of smart, smooth magicians being awesome. The reason it wasn't a 10? It wasn't perfect, so no 10, and I simply never got goosebumps or was left reeling, which is the standard I hold most 9s to. However, I'd definitely recommend this movie very highly."}, {"rating": "9", "text": "This was a surprisingly good crime thriller. The effects were great, story and actors were all well done. Pacing was good if not better than average for the length and it didn't try to force in room for a sequel or ruin it by showing to much in the previews. A must watch."}, {"rating": "9", "text": "Just ignore all the bad critics and mediocre rate. This movie is incredible!. Even though, It isn't as perfect as The Prestige. But it's absolutely worth to watch! From the beginning till the end, you'll feel the tension and enlightened moment. The twist is awesome. Great job Morgan! you confused me a lot."}, {"rating": "1", "text": "This movie relies on every cliche used in movies and bad writing.  Can Isla Fisher actually act?  The only movie she was remotely good in was The Wedding Crashers.  Woody Harrelson's acting is always great and consistent as is Mark Ruffalo's but in this case, the writing was so awful nothing could help it.  Yuck blech.  At first I thought the movie was a metaphor for the awful Obama administration, but then it digressed into another \"hate the rich guy and the little guy gets screwed\" movie and needs to have his revenge.   Not much of a surprise.  Bring a pillow if you want to snooze.\r Based on reviews of critics here, I wish I had given the Great Gatsby a TEN in retrospect."}, {"rating": "8", "text": "You can get some \"wow\" moments from Now You See Me but limited amount. It's not Ocean's Eleven or Tower Heist. It's a heist movie with wow moments and magicians. Now You See Me was directed by Louis Leterrier, the filmmaker responsible for the European pop-art hit The Transporter  as well as The Incredible Hulk and the Clash of the Titans remake. The film’s magician caper/heist storyline  which was engineered by Boaz Yakin (Prince of Persia) and relative newcomer Edward Ricourt  works in unison with Leterrier’s fine knowledge of cinematic technique. This gives rise to an interesting subtext about the enduring “magic” of movies, the purpose of art as entertainment, and the heightened importance of creative integrity in an age where cynical skepticism sells. Because of that, Now You See Me isn’t so much a character study  one set in the world of magicians  as Christopher Nolan’s The Prestige; instead, it approaches related subject matter from a very different angle and proves equally successful in certain regards. Leterrier’s film trades in the nihilism of The Prestige  in favor of hopefulness  and shows how referencing “movie magic” can be captivating; that is, without either coming off as self-congratulatory or waxing nostalgic about film artistry in an on-the-nose manner.\rThat’s to say: if you’re interested in a suave demonstration of cinematic showmanship (no more, but no less) via a thrill-ride movie featuring devious (yet charming) magic performers, then you might want to consider giving this one a look."}, {"rating": "7", "text": "“Now You See Me” stars Woody Harrelson, Jesse Isenberg, Michael Caine, Morgan Freeman, Mark Ruffalo and Isla Fisher in this film which is basically a poor imitiation of “Oceans Eleven”. The film tells the tale of four prestidigitators as they attempt to work their “magic” in order to commit grand theft (with the emphasis on the word “grand”).\rDirected by Louis Letterier (“The Incredible Hulk”, “Clash of the Titans”) the film never quite achieves its potential and ends up being too slick with events too difficult to believe or follow (despite the poor attempts by its 5 writers to gain that result).\rThis is a movie that is confusing and contrived. Nevertheless, for some strange reason, it keeps the audience interested and involved although none of us were sure exactly what the circumstances were that we were witnessing..\rGood acting by all involved saves the day and earns the film a 7.5 rating but to make this film more than that is a feat even Houdini and Mandrake combined couldn’t accomplish.."}, {"rating": "7", "text": "For what it's worth, it's surprisingly an interesting magic movie. It's entertaining and surprisinlgy well acted. As far as characters go, it's Morgan Freeman and Jesse Eisenberg that steal this movie. Most of the other characters are good, but they weren't as good as I expected them to be. To be honest the only characters I didn't really like was Dave Franco and Isla Fisher. The story was surprisingly interesting. It has certain layers to the story. I mean, you have the heist portion, then you have the action thriller type part, then you have well made drama. There are some scenes that were in a way unrelavent. But don't let that distract you from the story. Overall, it's a well made magic movie."}, {"rating": "1", "text": "WAY too hard to follow\rvery confusing and unbeleivable\rit could have been made much better if it was less technicale and understandable\r now i did go with a girl and was paying attetntion to her also but neither of us understood it and our too friends that went\r i would not recomend this movie"}, {"rating": "6", "text": "It is not a disappointing film, but rather a disappointment of how good it could have been.  There are a lot of great ideas, but then again there are so many holes in the storyline.  There are some great actors, but then again one of the main roles is given to Eisenberg who instead of magical he is quite irritating."}, {"rating": "7", "text": "Fun and flashy to watch; I enjoyed watching the actors and the story unfold.  Not a lot of plot and what there was wasn't particularly  deep, logical or resolved; and no real connection to the characters.  But it was fun, and didn't involve bodily functions, which these days seems to be part of a lot of comedy films.  An amusing and unbelievable heist tale."}, {"rating": "3", "text": "I guess where this film fails the most is that despite it being a film about magic, I didn't really feel any sense of wonder or disbelief.  Nothing about this film was captivating which is a real shame because the premise is a very cool one.  It's just a case of really mediocre execution.  To the film's credit there were some really quite nice camera sequences and the twist at the end, whilst not entirely unpredictable considering the nature of the film was a very good one but the film as a whole felt so empty and unsatisfying.  The characters are probably the worst part of the film.  The main 4 characters were some of the blandest main characters I've seen in a long time and I felt like I couldn't connect with them at all.  They felt so stock, the kind of characters a 13 year old would try to come up with.  The film also tries to be clever in the way it executes a number of things but it just falls short completely.  Personally the worst thing a film can be for me is boring and unsatisfying which is what this film was for me.  There's a few positive factors but overall the film just felt like a waste of time and money."}, {"rating": "8", "text": "One of the most entertaining movie of this year. Great cast, interesting plot with some twists, some fun moments, impressive illusion tricks. Overall it a great time"}, {"rating": "6", "text": "This film had a lot of problems.\r a) There is no lead character, and you just do not know who you are supposed to root for. If you have an ensemble cast, you need to either have them all on the same time or clearly distinguish who is good and who is bad. Hence, all characters in this film were only superficially developed, and you end up not caring about any of them.\r b) Almost nothing is explained. One of the best parts about heist films, which goes double for a film about magic, is when you get to explain everything in every little detail. This was not done. The narrative also had some gaping holes, such as the incredibly advanced technology which is used to create holograms. Never explained.\r c) The twist at the end. I'm trying not to give anything away, but that twist at the end was interchangeable with any other character. The writer obviously just got to the end and thought  I need to think of who the bad guy is going to be\", and just picked a name out of a hat. Disappointing.\r d) A very forced and unnecessary romantic interest.\r HOWEVER.\r The film was nevertheless enjoyable and entertaining, if not a bit predictable at times. The actors gave good performances, but the Harrelson/Eisenberg duo were begging for way more screentime. But despite my problems with it I enjoyed it and was never bored, just wished I had a character I could root for."}, {"rating": "5", "text": "A film about magic that is more about CGI.  There is a strong cast that give good performances and the chemistry is the best part of the film.  Finally the finale of the film doesn't work for me."}, {"rating": "8", "text": "I really don't know how I feel about this film after finally watching it because I was too amped up in watching it that I researched it, read updates from those who saw it and got excited, too excited as my expectations were a bit cheated. (Word of advice, don't read critiques or opinions prior to viewing it) I didn't really read about the film and or have it spoiled for me except seeing previews, videos and hearing so much praise for it that I was expecting mind blowing results but I'm reminded of this saying from Sheldon Cooper (Big Bang Theory) 'You told me it's mind-blowing, so my mind is going into it pre- blown, and once a mind is *pre*-blown, it cannot be *re*-blown.' that is EXACTLY how I felt leaving the theater. It was a great fun movie no doubt. I do not diminish anything about the film but I will say this you have to have the right mindset to thoroughly enjoy it. My only complaint is that there needed to be more development for the four horseman. (It could've used at least another 30 minutes if you ask me) because they needed more screen- time. Im not gonna give anything away but I was not all that blown away in the end. I kinda figured it out. However, great cast, great acting and I WILL see it again. See that is what was brilliant about it. TPTB made it in a way that YOU have to see it again. Whether its for pure enjoyment, catching up or you missed something the first time."}, {"rating": "7", "text": "As the films mantra goes, the closer you look the less you see, but if you are going to enjoy this film it is a wise decision to do exactly the opposite. There is no need to investigate or inspect each and every twist and turn this film throws at you because there are bound to be holes. No, in fact what is best to do in order to enjoy Now You See Me is to simply sit back and take it in for what it is: pure, escapist cinema that delivers a relentlessly fun and entertaining ride that speeds by and leaves you satisfied when the credits begin to roll. Kudos to this movie for being able to stand on its own two feet in a season where every Friday is dominated by a sequel or spin off or re-make or something that is a familiar product that is sure to find an audience somewhere. Now You See Me is a completely original film in the midst of big studio fare that has the star power, the concept, and the appeal to win over those movie-goers who aren't just looking for an escape from the real world, but from the saturated sci-fi superhero adventure genres that are playing on every other screen. That is not to say I don't enjoy those kinds of movies as well and this year has been particularly good so far in terms of summer popcorn entertainment, but simply knowing going into this film that we are up for a fun ride that takes a subject that's commonly considered nerdy, such as magic, and combines it with the formula of a heist film to create something imaginative and fresh is indeed refreshing. Though there are certainly plot holes to be picked apart once people have the ability to re-watch the film several times, upon first viewing this is nothing more than a caper of a good time that has an incredibly strong cast each member of which is doing what they do best, churning out some solid and genuine laughs while balancing the never-serious tone with a fair amount of action and mystery that is compelling and keeps you guessing until the very end.\r read the whole review at www.reviewsfromabed.com"}, {"rating": "6", "text": "I enjoyed the concept of the movie. However, I was hoping they would touch on the little things like the handcuffs, flying scarfs, and so on. I understand the point of the movie but more should have been put into explaining. By the time (over 3/4 way in) they started explaining the movie, however, they (the production team) confused me. Magic or real?\r Director of Photography Mitchell Amundsen must have taken over the photography. I could tell it was him right away, circles around everything!!!! GRRR. It gives me headaches.\r I do enjoy movies that keep me at the edge of my seat. WAY TO GO!!! It kept me on the edge the whole time. HOWEVER, the ending was left pretty wide open in my opinion. A possible sequel?"}, {"rating": "8", "text": "This movie deserves a round of applause. Its intricate, complicated plot and spectacular cast won me over moments into the film. Every single moment I thought I was completely on board with the plot, the following seconds had me second guessing. This film is definitely a favorite of mine. Well done!"}, {"rating": "9", "text": "Go see this movie! You will not be disappointed. I found it to be very clever and it has many twists and turns you will not see coming. I compare it to \"Oceans 11\" and the \"Sting\"."}, {"rating": "9", "text": "\"Well acted, well directed and an amazing concept and story. Now You See Me is the freshest, coolest and one of the most original flicks to come along this year. Filled with surprises at every corner and a stunning final act, its a film you have to see.\"  A-"}, {"rating": "7", "text": "A nice movie with a definitely intriguing plot, good actors but, unfortunately, also with a somewhat letting down conclusion, explaining (or not) things. Worth watching nevertheless."}, {"rating": "8", "text": "I actually found this movie to be very enjoyable, with the unexpected twist at the end that had me and my friends looking at each other with wide eyes, mouths agape, and saying, \"NO WAY!\" haha Loved all the magic, of course, and that it was all mostly explained so we were not left wondering how in the hell they did all those impressive and seemingly impossible tricks. The cast is excellent with good acting to match. The romance angle they put into the story seemed forced, as if they finished the plot already but then some executive came in and said, \"No, this needs some romance in it. Make it happen.\" There are some questionable elements in the plot as well, but not enough to seriously detract from the overall quality of the movie in my opinion."}, {"rating": "3", "text": "There is actually the seed of a good idea here, but the confused execution lets it down. An interesting cast helps and the film is lively enough, but it is all smoke and mirrors. Red herrings abound and there is a surprise revelation at the end, but the improbable premise cannot withstand any serious analysis. An Insistent, almost 70'ish, music score and swirling camera movements try to elevate proceedings to a higher and slicker plane that the material just doesn't deserve. Morgan Freeman redeems himself after his nothing turn in oblivion and some of the editing helps things along."}, {"rating": "2", "text": "This is one of the worst movies i've ever seen! I'm not going to add anything. Watch it if you want, but i don't recommend it. My score is 2/10 ,without no doubt"}, {"rating": "9", "text": "This  movie was incredible. Ignore the ratings on Metacritic and go see this film.  It requires you to think and look in places you would never think to imagine and understand why the trick was happening.  At the end there is a moral compass and core for which we should all live by.  I thoroughly enjoyed this movie because it kept me on the edge my seat from the very beginning to the end.  2 thumbs up!"}, {"rating": "9", "text": "Yet another instance where I am glad I did not listen to the 'professional' reviewers.   This movie kept me entertained every minute.   'Now You See Me' is clever and fun.  I appreciated that there was humor without a bunch of silliness, no long lulls of character back story development, and no sequel set up at the end.    I also like that it was smart, but not overly complicated.   I took my mom and my teenaged kids and everyone was able follow the plot through all the twists and turns.  We all loved it!"}, {"rating": "9", "text": "one of the best this year,the plot will surprise you.you will not be able to take your eyes off.too bad Man of steel steals the light from this movie.if you liked The Prestige ,then you will love this one"}, {"rating": "0", "text": "this the worst movies I have seen so far this year, you would think with a cast like this. it would be good, but it wasn't. this was two hour of my life that I will never get back The entire cast should find new agents. They are all talented enough not to waste their time on stuff like this A bank getting robbed in this movie, I got robbed. The thing you don't see coming sitting through and getting nothing in return. I would rather sit through a boring Las  Vegas magic show. No you me telling every disappear yourselves from this one. If it on for the bad movies like this, you could not appreciate the good one."}, {"rating": "8", "text": "Implausible, yes.  Confusing, yes.  At the end, WTF? Yes, yes, yes.  Still, entertaining as hell.  Suburb cast having a great time, and until everything kind of doesn't fall together, it's far more interesting than the usual summer fare.  You will walk out at the end saying \"wait a minute, what about...\" and will not find a coherent answer.   Doesn't matter, enjoy Woody and Eisenberg having a ball, and Morgan and Michael Caine adding their usual excellent work."}, {"rating": "8", "text": "Everyone that I've talked to has enjoyed this movie. Could it have been better? Sure. But it was fun, entertaining, and well paced. What's more, even though I thought some of the plot was predictable, they did get me at the end."}], "recommendations": ["now_you_see_me_2", "man_on_a_ledge", "the_loft", "shutter_island", "next", "the_prestige", "gone_girl", "the_number_23", "tenet", "bad_times_at_the_el_royale", "a_perfect_getaway", "ready_or_not", "lucky_number_slevin", "hancock", "project_power", "the_usual_suspects", "tomorrowland", "what_happened_to_monday", "the_maze_runner", "limitless", "inherent_vice", "glass", "the_mountain_between_us", "21", "rocknrolla"]}