{"id": 2834, "title": "Oblivion", "starring": ["Tom Cruise", "Morgan Freeman"], "runtime": 124, "genre": ["Action", "Science Fiction", "Adventure", "Mystery"], "description": "Jack Harper is one of the last few drone repairmen stationed on Earth. Part of a massive operation to extract vital resources after decades of war with a terrifying threat known as the Scavs, Jack’s mission is nearly complete. His existence is brought crashing down when he rescues a beautiful  stranger from a downed spacecraft. Her arrival triggers a chain of events that  forces him to question everything he knows and puts the fate of humanity in his hands.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/eO3r38fwnhb58M1YgcjQBd3VNcp.jpg", "categories": {"plot": 7.224137931034483, "acting": 7.285714285714286, "ending": 8.142857142857142, "soundtrack": 9.142857142857142, "cinematography": 7.6, "familyFriendly": 6.0, "funny": 5.0, "action": 7.083333333333333}, "reviews": [{"rating": "9", "text": "While the premise and some factors of the movie may seem underwhelming going in, Oblivion not only delivers, but makes for an enjoyable and smart sci-fi movie well worth the price of admission. The scale of the movie is excellent, set pieces are huge and memorable, the visual feel is tremendous and helps create a genuine atmosphere. With that, the soundtrack by M83 is engrossing and excellent. Tom Cruise plays a solid main role, that didn't sell me at first but did later on, his scenes with Andrea Riseborough are among the best of the film. Add in some unexpected and truly great twists, and I'm happily surprised with this movie and it turns from what I'd expected to be a good movie, to a great one."}, {"rating": "8", "text": "Oblivion is a rare beast, at least for Hollywood, it's actually a real science fiction film. While most sci-fi movies are basically guns in space, or other genres wrapped up in futuristic glitter, Oblivion wears it's sci-fi credentials proudly. It's hardly perfect, it's a bit too long, has 3 endings and borrows liberally from a number of familiar genre elements, but it weaves them together into an enjoyable mystery with beautiful scenery and some impressive set pieces."}, {"rating": "10", "text": "While the movie seems like a mixture of several different science fiction films, it is not fair to say it is unoriginal but it is more of a respectful throw back to the science fiction films of the 1970s. It has some spectacular action, some great concepts, and always beautiful imagery. It's not only worth checking out, its worth seeing, telling your friends about it and then seeing it again!"}, {"rating": "10", "text": "Why didn't i see this in theaters? Probably because it wasn't a sequel or remake. This is by far one of the best original  sci-fi movies i have seen in a long time."}, {"rating": "0", "text": "This movie fell so flat its not even funny! It had horrible acting, a boring plot and characters that no one even cares about. Don't waste your money on this movie!"}, {"rating": "8", "text": "Aesthetically brilliant and plot intriguing, Oblivion shows the true face of Sch-Fi genre. Among the Inception and Interstellar the height of effects, visualization and overall impact are reached to the highest limit, tied also to beautiful sounds and songs. When sci-fi movies engage with depth of feelings, the film becomes completely different. In 'metacritical' way - Must see."}, {"rating": "5", "text": "If you can escape a couple of major plot holes, I found the film an entertaining escape.  As opposed to some of the other reviewers, I found the plot easy to understand and interesting.  However, the execution in the film left a bit to be desired:  i.e. why didn't the humans inform Jack of his situation when they first met?  why didn't jack's wife tell him who she was immediately?  why did the humans hail the orbiting escape pod from earlier knowing all the people on board would be killed?  how?  why now 60 years later?  The film is littered with these questions (very Prometheus-esque).  So believing it all was a bit of an effort, unfortunately.  ...could have been a much better film.  ...shame."}, {"rating": "7", "text": "An enjoyable sci-fi film, but very derivative and a little antiseptic from an emotional standpoint.   The cinematography was absolutely stunning, and the score is gorgeous (a bit like late-period Kubrik scores).  Movie fans should probably see this movie for these two aspects alone.  As for the story, the basic premise is interesting and believable, but a lot of the touches (like the kid at the end) do not make much sense and really don't contribute to the overall story line or movie quality.  And the twist...well, it's been done...and I'll leave it at that.\r With a better director and some script editing, this could have been a masterpiece.  As it stands, it is a decent movie with stunning visuals and soundtrack."}, {"rating": "3", "text": "It's not all bad, the scenery and special effects were excellent, as were the two female Costars. I was also pleasantly surprised to see the Danish actor Nikolaj Coster-Waldau, who did a good job as a sidekick to Morgan Freeman and has gained recent notoriety in the Game of Thrones show.\rThe bad was that of course we've seen this post-apocalyptic plot regurgitated so many times in a few weeks you will have trouble remembering what stood out about this film.\rFinally, the really ugly is Hollywood's continuous insult to our intelligence when casting lead actors. America is so deeply weary of being reminded Tom Cruise is the most amazing man in the universe... Note to Hollywood: please give Cruise a rest."}, {"rating": "7", "text": "Without really being exceptionally amazing, I still found this movie pretty decent.  It certainly did appear to borrow ideas from a lot of my other favorite sci-fi movies, and it didn't always execute the ideas as well as the other films did.  Forgiving that, I still had a fun time."}, {"rating": "7", "text": "While Oblivion is perhaps the worst film I have seen this year thus far, it is still enjoyable and presents us a competent Sci-fi story that feels like it has been pulled from the 1970s full of twists and turns. Sometimes the film feels like its trying to be smarter than it is however, and I have never been too fond of Tom Cruise as an actor. My main complaint of the film however, is that the cinematography at times feels too false and feels like a television programme, while this likely will not be a problem for most people, it cheapened the feel of the film for me and kind of took me out of the experience. The effects are great and you do at least feel something for at least some of the characters throughout the film, although at times it feels like it is just going through the motions. All in all however, the film is enjoyable and the storyline is actually good and makes you think to some extent. Decent, 69/100."}, {"rating": "7", "text": "Oblivion is not one of the worst films of the year but it's not great either. The key thing about it is that it doesn't offer anything new as the director Joseph Kosinski said it pays homage to science-fiction films of 1970s. You will say, \"Oh, I've seen it before!\" a lot while watching it. Another problem is the pace of the film, which is extremely slow at the beginning. The plot takes a lot of time to take-off and that's how I found it boring but I forgot it eventually because the final 30-45 minutes of film are good. What's different about it is that it still manages to entertain you a little because it may not be original but the visual experience it gives you is astonishing, especially with Kosinski's vision and the better production value, it feels like the remixed version of all the sci-fi films released in the past. The best things about this film are its landscapes, the brilliant cinematography by none other than Claudio Miranda and the background score by M83 which is extremely wonderful. I am only disappointed because the main theme could've made it much better and a bigger film but that didn't happen. Acting wise, it's alright. Tom Cruise, Morgan Freeman (I wanted to see more of him), Andrea Riseborough, Olga Kurylenko, Nikolaj Coster-Waldau and Melissa Leo, all of them are good at their roles. In short, the movie didn't waste my time but I can't rate it better than this because Kosinski didn't do justice to it."}, {"rating": "6", "text": "While visually arresting and primed with action-sequences, \"Oblivion\" compromises its technical accomplishments with a disheveled script that helps itself liberally from numerous science fiction films. That being said, that doesn’t mean that much of it’s audience won’t find this fairly engaging and entertaining. Tom Cruise returns to the realms of science fiction, collaborating with director Joseph Kosinski \"Tron: Legacy\" (2010), in a big screen adaptation of his unpublished graphic novel.\r Like a great deal of science fiction films, “Oblivion” requires a lengthy prologue in order to contextualize the viewer to the imaginative world they are being introduced to. In this case, that world is actually our own, just not at all like we know it. In 2077, 60 years after an alien invasion triggered a nuclear war that decimated the planet, the human race has all but abandoned Earth for Titan, the largest of Saturn's moons. Tom Cruise plays Jack Harper, one of the last few drone repairmen stationed on an Earth which has been abandoned for years following decades of war with a group known as the Scavs. Along with his wife Victoria (Andrea Riseborough), they maintain the fleet of drones, protecting the earth from the threat of the Scavs. Yet, when a series of drones go down, and a spaceship crashes with a beautiful survivor Julia (Olga Kurylenko) on board, Jack finds his life changed forever as everything he knows, (or thinks he knows), is blown apart.\r \"Oblivion\" is an incredible piece of visual sci-fi eye candy; sleek, a wonderfully realized world of day-after-tomorrow style technology, including some brutally intense fight sequences. It's one of those films that demands it to be watched on the biggest screen you can possibly find. The world “Oblivion” paints is certainly a striking one, but the emptiness that now dominates the planet inevitably also permeates throughout the picture itself. This is the underlining problem with \"Oblivion.\" The movie comes off as merely a derivative of other well-done, successful science fiction films. So much creativity went into the visual design that apparently little was left when crafting the plot. The movie liberally borrows from “WALL-E” (2008), “Total Recall” (1990), “Independence Day” (1996), “Planet of the Apes” (2001), and “Moon” (2009), that it often veers dangerously close into lawsuit territory.\r \"Oblivion\" is admirable in its look and style, but the film is not unique or exceptional. It holds its own as the mystery initially plays out, and you do find yourself drawn in, but as the pieces begin to slot together, you can't help but feel you've seen it all before. Like the drones  and Cruise himself  “Oblivion” is competent, durable, and undeniably mechanical."}, {"rating": "6", "text": "Oblivion has great audio and visual effects.  Sadly those are the best things within the entire movie.  This movie lacked a good story.  The movie was mainly star-driven.  Tom cruise showed us that even at his age, he could still play a badass.  The movie did deserve a better metascore than it got.  This is a movie that is awesome the first time but never the same again.  I would recommend watching this movie... Once."}, {"rating": "7", "text": "First of all - did anyone notice that 90% of movie plot is a copy from Moon 2112 movie with Sam Rockwell? Same theme - alone in the abandoned world, clones theme, the only friend. Ok, miss Kurilenko makes some difference. But movie itself is good, if I didnt see Moon 2112 I would probably give it at least 8 from 10."}, {"rating": "7", "text": "It was good but forgettable. almost everything that was good with it counteracted with a flaw.  It did get boring in some.parts, but it did keep u on the edge of your seat and.keeps you guessing and not knowing til end\rlike i said it was a good movie with some drawbacks but its nor something ill remember in 10 years like avatar. 7.5/10"}, {"rating": "6", "text": "It has a cool premise and stunning FX in the action scenes, but the film feels too long and lost interest nearer to the end. Though it is nothing of a masterpiece it has some great action and a nice one or two plot twists which got me hooked for a short time. The ending was a nice touch as well, but overall the film dragged for me."}, {"rating": "8", "text": "Visually stunning film - widescale, aesthetic, unhurried and slightly aloof, by it's style bringing reminiscences of \"Lawrence of Arabia\" and \"2001: A Space Odyssey\". Perhaps the visual part, the \"atmosphere\", obscures the story and characters, however the story itself is pretty intriguing, and the characters are interesting. Avoidance of the excessive dynamics is an advantage - this is what clearly distinguishes \"Oblivion\" among the modern sci-fi genre, separating the thoughtful viewer from an emotions consumer, and giving to the first one time to reflect, and to the second one time to get bored and disappointed. That, in general, is well. Any true art must be creative expression and have its audience, rather than try to please everyone by sacrificing sincerity and quality. 8 out of 10."}, {"rating": "8", "text": "I don't understand how this movie Metascore can be only 54.\rUnoriginal? Flaws? Maybe...if you analyze this movie after having watched it. But if what you look for is entertainment, this is a great movie to watch. It may have flaws but they don't weight much on the pleasure to watch it, if you let yourself immerse in the story and the events the movie put you in.\rIt works good and I am sorry I missed it at the cinema."}, {"rating": "10", "text": "This movie is absolutely amazing, the setting, the effects, the story, acting and the soundtracks are just AMAZING. You should definitely check this movie out, you won't regret it!"}, {"rating": "10", "text": "Oblivion is an incredible movie. Not only are the visuals stunning, but the story is beautiful and all the plot-lines are tied up by the end of the movie. Tom Cruise and Morgan Freeman play their parts excellently, and the soundtrack is a masterpiece. Would highly recommend to anyone, especially fans of 70's and modern science fiction."}, {"rating": "5", "text": "I din't actually like Oblivion. It was too hard to understand and it was kind of boring sometimes and i didn't really enjoy it. I didn't understand the whole point and what  was really or not. A waste of 7 euros. Only on Dvd for the special effects which are kinda impressive. I also like the fight Cruise Vs Cruise."}, {"rating": "7", "text": "Many people have addressed that the film seems almost, “routine\" in a sense, because many of the themes portrayed in the film are reminiscent to those from other films before it. However, these criticisms go very far and completely state that “there is nothing special about this film, it’s a blatant rip off of hundreds of sci-fi films before it.\" I have to disagree.\r There is much to love about oblivion, in fact, it’s first half has possibly some of the most creative aspects of a story and setting I've seen."}, {"rating": "6", "text": "Oblivion is very aesthetically pleasing; the visuals are certainly well done. However, a deeper script and more watertight storyline would help to satisfy the movie-goer looking for more than just visuals."}, {"rating": "10", "text": "Oblivion is one of the best movies I've seen this year. I really enjoyed the cgi effects, story kept me curious, acting was really great, acting was awesome. If you're looking for a great Sci-Fi movie, Oblivion is the best choice."}, {"rating": "10", "text": "I loved this movie, I was totally immersed from start to finish.  I have to tip my hat to M83 for their original score as well, it says a lot about a movie when you want to buy the soundtrack after watching it.  I can't say enough about this film, it is definitely a must see."}, {"rating": "9", "text": "Don't you believe any of these young Entitlement Generation snobs.  Oblivion is a great movie.  Mark my words:  this is the Blade Runner of it's time.  Blade Runner was universally panned by critics, and a dud at the box office.  Today, it's considered one of the greatest SciFi movies of all time.  30 years from now, they'll still be watching Oblivion.  Like Blade, this is ultimately a love story:   a pair of souls separated by time, war and science desperately seeking to reunite.  It is one of Tom Cruise's best performances.  The Icelandic scenery mixed with seamless CGI is stunning and restrained.  The pace seems excruciatingly slow, but is perfect for the situation.  With just a couple of small forgettable flaws in the science, the story is completely believable.  Joseph Kosinski's graphic novel background shows in almost every frame, with perfect shot composition and transition.   I was completely captivated by the mise en scene.  (Look it up, kiddies.)  Forget comments about being “derivative” or “unoriginal”.  That’s the nature of science fiction.  Finally, the M83 soundtrack is so perfect, you don't notice it until the wonderful final credits.  Buy or rent it, and you will watch it over and over again.  Tom & Joseph:  you did good.  I look forward to great projects from both of you.  Joseph, I just hope the Disney dreck you have lined up doesn't bring you down.  Yes, we all gotta work."}, {"rating": "7", "text": "I think the critics have been too hard on this one. Stunning cinematography, soundtrack, Olga Kurylenko, and a plot that isn't completely predictable. Getting Tom Cruise involved may have been a mistake (he's something of a ridiculous person these days), but if you like dystopian sci-fi, you'll like Oblivion."}, {"rating": "5", "text": "Not good, not bad. Fun, at least. The turn in the story is kind of funny, the actors choice were fitting, the visuals were pretty. But the conclusion was very poor and the enemy was so uncharismatic... 5, I will stay half the way."}, {"rating": "6", "text": "It was not the best sci-fi movie I have ever seen, but I thought it was good. It started out very good, almost great, then went down to average about half way through, and ended up as what I would describe as a good sci-fi movie for a sci-fi fan. I would not recommend this to a non-sci-fi fan. The visuals were great; the overall story was good too. It's the execution of the second half of the film that was a let-down, especially after the very well designed set-up of the beginning. I was hoping the story would go one way, but it went another way and it was ok, but I had a better path laid out in my head for the second half of the movie while I was watching it. My opinion is that people who make movies are pressured to make them/keep them simple, with less thought provoking storylines and more pop and flash; stories you can wrap up neatly in a bow at the end. I understand it, some of the dumbest movies I've ever seen, made the most money, and in the end, it's a business. However, in the long run, they will need to start making better, smarter, more thought provoking movies; otherwise they will eventually lose everyone. A great place to do this is with sci-fi movies. There is no reason you can't have action, pop and flash, and a great story."}, {"rating": "6", "text": "Despite the fact that the CGI was often quite bad and that the story is cliché and predictable, it was still a rather entertaining and fun action/Sci-Fi flick. The acting was good, the action sequences were well made and the movie was never boring. It's not the best sci-fi movie to come out in recent memory, but it's still a very enjoyable addition to the genre"}, {"rating": "9", "text": "Muy buena, la recomiendo. Todo sorprende, la trama y las imagenes. Desde el comienzo hasta el final te mantiene  boquiabierto. Tremendjo trabajo senor director."}, {"rating": "8", "text": "This movie got me! From the thrilling storyline to the excellent soundtrack by M83 (Inspired By Hans Zimmer) Joseph Kosinski brings you into a visually unique wasted planet earth! The rhythm is fast and you don't have time to get bored, it constantly leaves the watcher wondering what's gonna happen next? Until It Is all revealed in due time. Best psychological Sci-fi movie I have seen in a while and I Highly recommend It!"}, {"rating": "6", "text": "Oblivion works as a technical frontier and benefits from a fine performance from Tom Cruise but on a narrative scale, falls flat from a script that confuses instead of resolving logic gaps."}, {"rating": "7", "text": "Though highly confusing upon initial viewing, Oblivion features a solid story-line, dazzling special effects, and a terrific performance from Tom Cruise that will drown out all of the cliches and plot holes."}, {"rating": "9", "text": "An unexpected treasure. I salute the nerve of producers and director to go with a novel and thoughtful story instead of the n-th sequel or reimagining of some previous success. Major Kudos to the parties responsible! The visuals are gorgeous and breathtaking (with consistent visual design reminiscent of Star Wars at its best), a good supporting score, and fine acting. The consistency is significantly above average (with few and insignificant gaffes or inexplicable moments and absolutely no major plot holes  Thank you!), the pacing wasn't frantic or boring with exposition of characters and backstory well-spaced throughout the movie. I'll probably go see it again, just because movies like this are too few and far in between."}, {"rating": "8", "text": "It was kind of an old school sci-fi, a little slow, with the type of storytelling that creates a good atmosphere by showing how the “everyday future life” is.\rThe CGI is nice, believable, nothing fancy, just as it should be. Loved the sounds.\rActing is OK (yet not specially good as the big names would indicate).\rThe story is consistent, however, there are a few unnecessary scenes, and in some other parts it feels something is missing.\rAlthough there is nothing new in this movie and what we got isn’t perfect it was still enjoyable and worth to watch."}, {"rating": "8", "text": "Its beautiful, its intense, its exciting, and its a bit confusing. But, all in all i really enjoyed this, even though the story was a bit confusing, espesially at the end."}, {"rating": "9", "text": "This movie was very solid all around. I think the writers did a fantastic job with the plot by generating a very engaging story which makes you care about the characters. The story has a few twists and definitely will make you think a little. Furthermore, the special effects are all great with just the right amount of action and I think Cruise is very believable. In the end there really isn't much to complain about. If you are looking for a movie with a really awesome story and great effects I highly suggest this one."}, {"rating": "9", "text": "The emotional weight, strong acting, and impressive visuals are enough to make the film a must-see.  The story is much stronger than its getting credit for, and although some pieces seem familiar, they are grounded in plot and explanations that hardly make them derivative.  This has underrated written all over it."}, {"rating": "8", "text": "First, before you criticize this movie of being too reminiscent of some older sci-fi movies, hop over to Wikipedia and check out the article about this movie.  This movie PAYS HOMAGE to sci-fi movies of the 70s.\r And it has done a great job of doing that.  That's why I loved it.  The tone, the atmosphere, the soundtrack, the sound effects, the décor, etc., all make this movie a pure sci-fi movie.  The storyline is not perfect but it contains enough mysteries and twists to keep me interested for the entire movies. Those who feel the plot was too convoluted are probably too accustomed to linear storyline found in G.I.Joe, Expendable and most super-heroes movies."}, {"rating": "9", "text": "Amazing movie with a plot that will keep you on your toes waiting for the next reveal (while you might guess some of the plot there is no way you will guess it all!). True sci-fi. Best movie I have seen in the last 12 months. Loved it!"}, {"rating": "8", "text": "Very good and thoughtful sci-fi flick.  Underrated here by the critics.  I know it's mixing apples and oranges, but when metacritic gives this a 55 and the lame show Two Broke Girls a 66 you know there is something wrong with this site."}, {"rating": "7", "text": "Beautifully filmed, and, yes, it's hard not to see the shadows of other sci-if movies in Oblivion, but I give it points for the bigger questions.. What is a valid life? If you discovered your life was not as unique as you thought, does that negate your existence?"}, {"rating": "8", "text": "Oblivion is a unsurprisingly great film, I had no doubts that it would be \"great\" ever since I saw the trailer; I didn't lose faith in it after seeing it's mediocre reviews. I disagree with most of them. Oblivion is thrilling with it's explosive action and mind-boggling yet great story-line. The director lets you get to know the characters immensely well (with one or two exceptions...); he also manages to grab your emotions and lets you hang on the edge of your comfy seat/chair. It's not immensely intense or thrilling, but is to a nice extent. The actors portray their characters well, the cinematography is great, the music is good, the story is awesome  all these things are great, but not phenomenal: so I give this film an... 8.4/10!"}, {"rating": "8", "text": "Although i hate tom cruise for being a bad controlling husband and a phsyco scientologist. I actually enjoy oblivion, great and good sci-fi. Good acting as expected from tom. 1st 45 mins kinda confusing, but the story slowly revealed all clues to the end. It's really worth it to watch at the big screen."}, {"rating": "6", "text": "This really is a visual feast but that can't sustain a lightweight, lumbering storyline which is at all times vaguely reminiscent of some past sci-fi film (Silent Running, Omega Man, Moon).  It seems to borrow bits and pieces and wrap them up in outstanding production values.  Morgan Freeman reprises the sort of role he's delivered elsewhere, this time with limited gravitas.  Brilliant CGI but little suspension of disbelief.  The second half is missing some points of logic so that you come away slightly unsatisfied."}, {"rating": "10", "text": "Sadly an underrated movie here on metacritic, fairly close to the movie \"moon\" from an ideological perspective. I was pleasantly surprised to have my (low) expectations exceeded from Hollywood movie. The critics claim the movie does not ask any real questions, or that it does not answer any, but to be honest Oblivion does have it's finer points. One has to wonder if Oblivion is asking the question that no one really wants to know the answer to."}, {"rating": "10", "text": "I honestly LOVED this movie. It's intriguing and engaging until the last minute of the film. Highly recommended. I was worried that the trailers gave away most of the mystery but they barely even scratched the surface of all the mysteries it has to unveil."}, {"rating": "6", "text": "I enjoyed SEEING the film, but once I came outside, I realised the really wasn't that much to it, and I might've wasted my money seeing this in cinemas. I think they paid too much attention to \"super cool\" effects instead of giving the story more substance."}], "recommendations": ["moon", "jupiter_ascending", "valerian_and_the_city_of_a_thousand_planets", "alita_battle_angel", "twelve_monkeys", "serenity", "fantastic_beasts_the_crimes_of_grindelwald", "tron_legacy", "looper", "inception", "edge_of_tomorrow", "eternals", "john_carter", "blade_runner_2049", "minority_report", "tron", "9", "blade_of_the_47_ronin", "tomorrowland", "avengers_age_of_ultron", "the_three_musketeers", "super_8", "rise_of_the_planet_of_the_apes", "the_last_witch_hunter", "doctor_strange"]}