{
  "id": 4506,
  "title": "Octopussy",
  "starring": [
    "Roger Moore",
    "Maud Adams"
  ],
  "runtime": 131,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "James Bond is sent to investigate after a fellow “00” agent is found dead with a priceless Indian Fabergé egg. Bond follows the mystery and uncovers a smuggling scandal and a Russian General who wants to provoke a new World War.",
  "releaseYear": "1983",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yoosZitM9igSk3Sd0sBXIhKlAh1.jpg",
  "categories": {
    "plot": 5.9,
    "acting": 6.7,
    "ending": 5.5,
    "soundtrack": 6.0,
    "cinematography": 5.5,
    "familyFriendly": 5.0,
    "funny": 6.625,
    "action": 6.2727272727272725
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This is one of Roger Moore's finest attempts at James Bond.  He seems to have found a solid balance between the campy one liners and the action needed to make this character his own. Sadly, it would be his second to last performance as the British Agent soon giving way to a new actor to take the reigns. ****"
    },
    {
      "rating": "3",
      "text": "Slightly improved over previous instalments but garbage is still garbage. **** fails to take advantage of solid locations and a decent Bond girl by delivering a pretty uninteresting plot with one of the worst villains this franchise has to offer."
    },
    {
      "rating": "6",
      "text": "What made this 1983 Roger Moore Bond film standout was its provocative title. In terms of plot, it's pretty standard Bond fare, somewhat convoluted and hard to follow. The movie starts with Bond infiltrating a military base in Latin America and has to escape in a minijet. From there, 009 agent dressed as a circus clown and carrying a counterfeit Fabergé egg, crashes into the British ambassador's residence and dies after fleeing two knive-throwing twin Russian assassins. The British suspect the Soviets, and Bond is sent to bid for the Fabergé egg to identify its seller. From there, Bond follows a Saudi prince Kamal Khan to his palace in India. Bond hooks up with an associate of Khan's, a beautiful young woman named Magda who has the tattoo of an octopus she calls her **** Bond later meets **** a beautiful and wealthy businesswoman, smuggler and Khan's associate. She also leads the Octopus cult, of which Magda is a member, which is entirely comprised of women. Traveling to East Germany, Bond infiltrates the circus and discovers that Soviet General Orlov has replaced the Soviet treasures with a nuclear warhead, primed to explode during the circus performance at a US Air Force base in West Germany. Bond manages to deactivate the warhead. Bond and **** return separately to India. Bond arrives at Khan's palace just as **** and her troops launch an assault on the grounds. **** attempts to kill Khan, but is captured by Gobinda. While ****'s team, led by Magda, overpower Khan's guards, Khan and Gobinda abandon the palace, taking **** as a hostage. As they attempt to escape in their airplane, Bond clings to the fuselage and disables an engine and the elevator panel. Struggling with Bond, Gobinda plummets off the plane's roof to his death, and Bond and **** jump off the plane onto a nearby cliff only seconds before Khan fatally crashes into a mountain. At the end, Bond is in bed with **** on her private yacht. The movie suffers from too many cheesy one-liners, and doesn't really have a good iconic villain, though of course the **** Bond girl character is memorable. There is a lot of action and explosions, but some of Bond's exploits like when he is clinging onto an airplane mid-flight require you to suspend too much disbelief."
    },
    {
      "rating": "6",
      "text": "Another entertaining movie for the masses. That means: easy story, bad slapstick humour and some unrealistic action scenes. In addition Roger Moore is even older than in the last movie.But, some action scenes were not bad and the political background is als good for the complexity of the story."
    },
    {
      "rating": "8",
      "text": "Having watched 25 Bonds from Dr.No to Spectre, I place **** at 6/25.Is this really the 6th best movie in the series? Probably not. But I feel this is the top Moore. And it's time to talk about him in detail.Arriving in the series, Moore very openly showed his disdain for the character and role. He said that it was a silly character, that you couldn't take it seriously and that there was only one way to play it, as a buffoon. He acted upon that, and his first movie was a disaster. The second forced him to be serious, and he found his footing on the third.His footing was to make a witty, jokey, lighthearted Bond, that rarely entered violence unless forced. He would joke and play and prance around being witty with the characters around him, fought when he had to, he loved having fun, and that was his Bond.Since his buffoon Bond was that humorous, for good or bad, the movies had to follow suit. His brand of goofy, campy, lighthearted, over the top Bond carried the series throughout the 70s and over half the 80s. And in 1983, **** came out. Near the tail of Moore's era, carrying all of that legacy.And really, that's all there is to say about this movie. We could talk about the scenery, the villain, the delicious Maud Adams, from Man with the Golden Gun, the minor good or bad points. Villain isn't that great, story is so silly, etc.But really, even though one might say \"it's just another Bond\", it's actually a Moore Bond, and the most refined of the Moore Bonds.Moore set foot in Connery's shoes and took so long to get them to fit him, or rather to get entirely new shoes, a new style, a new Bond out there. Movie after movie, in his very long Bond career, he established himself. He grew.**** is the peak of Moore's Bond. His masterpiece. It is the most camp, the most funny, the most lighthearted, the most Moore. It is the most over the top, the funniest, the silliest, the most action-packed, and yet it is also capable of being serious when it needs to, it's witty, it's enjoyable through and through.**** is, alongside Moonraker, the absolute top of what made Moore Bond what it was.It's a delightfully enjoyable string of jokes and silly situations peppered with action scenes and Roger Moore trying to charm his fellows. From start to finish, it's an absolutely enjoyable Moore-a-gogo, running from elephants, charming snakes, chases in cheap indian minicars popping wheelies, getting shot at by a blunderbuss, fighting them off with a tennis racket, throwing people on nail beds, throwing knives, fooling around at auctions, at meetings, fooling around through and through. It's the movie where he ends up disguised as a clown, and in so many ways, what a sendoff.(ignore A View to a Kill, it deserves it anyway)"
    },
    {
      "rating": "6",
      "text": "The thirteenth James Bond movie and a weaker one in the franchise. It would be even rated lower by me but the story and humor works well. Also the plan of the antagonist is interesting enough to be remarkable. After the this times decent intro the story starts when agent 009 delivers a Faberge egg to the British ambassador while dying at the same time. James Bond is set out to investigate this incident. While I like the story and the twists it is divisive for many fans. Some say it is a weak plot while others like me enjoyed the scheme and brilliant evil idea. Even James Bond is baffled for a moment when he understands the full scope. From the characters we get what we expected. Being James Bond becomes an enjoyable routine for Roger Moore. Steven Berkoff as General Orlov is an interesting character. He is clever but also a fanatic and true believer in his ideals. A mixture for a truly dangerous cocktail. Maybe a bit to stereotype for some. Louis Jordan won me over as Kamal Khan but will not be on my top list. Maud Adams is good in her role and I had liked to see what she could do with a better script for her role. I think we have seen all better in the franchise so far. Again for the sets, visual and soundtrack there is nothing to scold for me but also nothing to praise. Overall this is so far the weakest entry in the franchise and while there are some good moments it is pale in comparison. The other movies in the franchise set the bars higher."
    },
    {
      "rating": "4",
      "text": "I have no intention of insulting anybody who likes this film, but I disliked this film. The Bond series may have a couple of bad eggs as well as some golden treasures, and I am sorry to say I consider **** one of the bad eggs.First off, it starts off brilliantly with a great opening sequence, while the locations and cinematography are suitably exotic. Roger Moore is decent as James Bond, apart from some very bizarre moments which I will be describing later, he seems to have toned down a bit, and Steven Berkoff and Louis Jourdan make for a pair of intriguing villains. Oh and **** is sexy.However, plot wise it is probably the most careless in the series. The plot meanders all over the place and lacks focus, complete with some truly bizarre scenes such as Bond in a clown suit(???) and the Tarzan yell in the jungle was for me unintentionally hilarious. The script is also paper-thin save for a few fun one-liners and the direction is disappointingly flat. The film is also too long and is fairly pedestrian, and I admit I have a love/hate relationship with All Time High. Personally I think the one sung by Madonna is the worst Bond song, but this one is for me one of the least melodious or memorable.All in all, pretty disappointing and although a lot will disagree I do consider this the weakest Roger Moore Bond movie. 4/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "Fun Spy movie...but beware...a little different form Connery era films.Like many of Moore-Bond movie it geared towards action-comedy with a little bit of mockery of spy novel cliches.It humor isn't aged very well and it isn't p.c. but it still a very enjoyable film, now on the verge of campy.Try it."
    },
    {
      "rating": "7",
      "text": "Coming out the same year as the non-Eon produced Never Say Never Again, this sixth entry to star the always reliably entertaining Roger Moore is a movie I can’t help but enjoy. It is a prime example of the silly action-comedy tone that dominated most of Moore’s tenure as 007.There tends to be two camps when it comes to the James Bond fandom, those who prefer their Bond to be serious and down-to-earth like the Daniel Craig entries or those who like their Bond fantastical and light-hearted like with Moore and the later Connery affairs.I am personally partial to both approaches and **** takes the campy tone up to 11. This is a movie where James Bond disguises himself as a clown, swings on vines while yelling like Tarzan and there is even a moment of meta-comedy when a snake charmer plays the Bond theme on a flute. It is all very much a tongue-in-cheek action-comedy with Moore’s comic delivery always on-point and the action sequences electrifying (Ex. The train scene)."
    },
    {
      "rating": "3",
      "text": "Moore's trip to India is too much, too much of good stuff- well, not technically- and too much of bad, and still it isn't perfectly balanced.****Glen is back with a more raunchy version. Think of that, more raunchy than what we saw previously, so I guess that's a first. The director John Glen, as always has his track mapped out perfectly in his film. There is no doubt about that. In fact, accounting in both of his project, we can easily say that he likes to go deep, deep in his self-created maze. And just that bit, that very middle chapter is undeniably exhilarating. For as soon as you think, that Roger Moore, the Bond, won't go lower than this, this bottomless pit keeps sucking him or more importantly us, in its exotically well choreographed tricks and treats.The humor is once again, an issue in here, especially the branches it spirals out, it never feels like a part of the narration and surprisingly coming this from a director who at first was an editor ought to be shocking. Digging out another new culture to explore upon, this gives the writers enough space to distract the viewers with stunning set pieces brimmed with colorful lights and embroideries that somehow represents the rich culture along with the staged traditions of India.Similar to previous cliff hanging climax there is another antic like such that is more complex and nail biting than that one, which frankly is the film's double edged sword, for as soon as you start expecting things, it will let you down, even they can promise that. The Bond girl syndrome is respected and given both the title and agenda to run towards or more precisely backwards for Moore's characteristics in the film overpowers every motive and temptations in the film, which I can see that it might be a great idea to glorify the character, but the film suffers in doing so, for you can't take down the title, not even in this franchise, not ****."
    },
    {
      "rating": "3",
      "text": "Directed by John Glen and produced by Albert Broccoli, it has script by Richard Maibaum and George MacDonald Fraser and is the thirteenth film in the franchise. In this film, James Bond investigates the death of another British spy. The trail leads to India, where he allies with **** a daughter of a former enemy who want to save her own skin. The action takes place in the context of \"détente\", a policy of appeasement between the USA and the USSR.Personally, I consider this film as one of the worst in the entire franchise. I appreciate the scenery and the exoticism of the scenes in India, where part of the film took place, or the trip train to West Berlin. All these scenes help, in fact, to make this a very nice film. The script is also good: the theft of Soviet artworks, a nuclear attack on West Berlin are strong themes. The great sin of this film are some scenes that ridiculed the main character. Its sad to see James Bond disguised as clown or gorilla, but even that could be understandable depending on the context. But see 007 to panic, start screaming and running from one side to the other in the middle of a circus tent... I wasn't able to recognize Bond, nor understand how Roger Moore allowed his character was the target of that laughingstock!In this film, besides the central cast inherited from the previous films and the continuation of Roger Moore in the role of 007, it participated Maud Adams in the role of **** Louis Jourdan gave life to the villain, Kamal Khan; Kabir Bedi played Gobinda and Robert Brown assumed the role of M, left vacant by the death of Bernard Lee."
    },
    {
      "rating": "7",
      "text": "This one gets a bad rap when it’s actually a fun outing in the series. It may be anachronistic and slow at times but it encapsulates what’s awesome about the series minus certain things like the infamous Tarzan yell, Roger Moore in his true form a melancholy clown,, and the terrible tennis bit that wasn’t funny like they thought. Hahah! He’s a famous tennis player! Not. Maud Adams returns in a much better role as **** There’s plenty to like about this one that generally doesn’t take itself too seriously."
    },
    {
      "rating": "7",
      "text": "Fun Spy movie...but beware...a little different form Connery era films.Like many of Moore-Bond movie it geared towards action-comedy with a little bit of mockery of spy novel cliches.It humor isn't aged very well and it isn't p.c. but it still a very enjoyable film, n"
    },
    {
      "rating": "7",
      "text": "**** That was something unreal!  Definitely the best part for me with Moore and overall one of the best parts of the whole series.  Incredibly cool plot that I swallowed and a pace that won't let you breathe (especially towards the end).  An incredible event where I wondered how it would turn out and the last 10 minutes of the film are an absolute treat for the eyes.  Good movie that I recommend."
    },
    {
      "rating": "7",
      "text": "A very cheesy and campy that more often than not gets carried away (Bond yelling like Tarzan while swinging through the jungle and dressing like a clown), but it's very entertaining. The cinematography in India is great, and there are plenty of good action scenes, like the opening plane chase and car chase on the train tracks. However, the convoluted and confusing plot is what really kills this plot, so many things happen but it's hard to understand why they're all connected."
    },
    {
      "rating": "6",
      "text": "Roger Moore delivers another solid Bond adventure, full of campy fun despite the lead's aging abilities."
    },
    {
      "rating": "6",
      "text": "Many of the Bond-specific details are present, and they are generally recognised. Moore, though, is becoming older and lacks the virulence that this part calls for. As for the leading lady, Maude Adams, I find both her appearance and performance to be a little underwhelming. Although there were many identifiable Bond themes in this movie, it lacked the grandness and beautiful scenery that I've grown to anticipate from contemporary 007 movies. The narration is mostly reliable, although the plot itself is a little shaky. For fans of James Bond, it's a must-see; for everyone else, give it a look if you're really curious."
    }
  ],
  "recommendations": [
    "the_spy_who_loved_me",
    "tomorrow_never_dies",
    "for_your_eyes_only",
    "the_man_with_the_golden_gun",
    "goldeneye",
    "from_russia_with_love",
    "the_world_is_not_enough",
    "spectre",
    "you_only_live_twice",
    "diamonds_are_forever",
    "die_another_day",
    "the_legend_of_zorro",
    "thunderball",
    "casino_royale",
    "the_league_of_extraordinary_gentlemen",
    "mission_impossible_rogue_nation",
    "red_2",
    "no_time_to_die",
    "true_lies",
    "captain_america_the_winter_soldier",
    "xxx",
    "skyfall",
    "iron_man",
    "shanghai_noon",
    "quantum_of_solace"
  ]
}