{
  "id": 3538,
  "title": "Oculus",
  "starring": [
    "Karen Gillan",
    "Brenton Thwaites"
  ],
  "runtime": 104,
  "genre": [
    "Horror"
  ],
  "description": "A woman tries to exonerate her brother's murder conviction by proving that the crime was committed by a supernatural phenomenon.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yCzR1yKRLiJyTDLgY1ppazXEmdE.jpg",
  "categories": {
    "plot": 6.025,
    "acting": 5.722222222222222,
    "ending": 5.409090909090909,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 4.6
  },
  "reviews": [
    {
      "rating": "0",
      "text": "The movie is extremely slow and builds up to 10 minutes of disappointment at the end. What happens to the main character at the end is utter nonsense, she never trusted the mirror but conveniently at the end she trusts it. I honestly wanted my money back. You can not paint a character to hate something the entire movie (her entire life) and then change that character completely at the end to fit your story arc. It felt cheap and made the movie even worse."
    },
    {
      "rating": "0",
      "text": "Oculus is like biting into a turd burger knowing full well it's going to taste like a big steamy dump. Sadly with that said I still watched the piece of garbage. It is bad. Very bad, terribly bad.\r I will not say much about this piece of filth as I'd rather not relive it. Acting is bad, plot is worse, and the scares are all wanna-be jump scares. It sucks. It gets a zero. End of review."
    },
    {
      "rating": "7",
      "text": "Despite being heavy on tension instead of scares, Oculus never stops generating new ideas on the way up to the end, with a mind bending premise, complex build up with jumps back and fourth in time, and a distinctive ending, Oculus is a memorable film for generations to come."
    },
    {
      "rating": "9",
      "text": "With mind-twist plot and brilliant visual structure, Oculus is easily the best horror film since The Conjuring and the best psychological horror since the phenomenal of Stanley Kubrick's The Shining."
    },
    {
      "rating": "9",
      "text": "This is one of my favorite horror films of all time, and I have NO idea why it has 3.8 currently. 2 words for the people who hate it, BAD TASTE. WATCH IT, it's so good and is worth your time"
    },
    {
      "rating": "8",
      "text": "This is scary, well acted, and well written. My only gripe is that it probably should have been a standard 90-95 minute run time instead of 110 or so as it is. ***Minor spoilers*** This movie has convincing and disturbing portrayals of family violence, anger, discord and fear. You may get upset if you've experienced these things in your own life because these are very accurate depictions of children in fear of their own parents. Otherwise the scares are there and this is a seriously malevolent entity that destroys lives at its leisure. The pace is deliberate, the gore is judicious, and the ending banishes all hope of happiness."
    },
    {
      "rating": "8",
      "text": "An interesting twist on a genre begging for an interesting twist. Two distinct story lines of two siblings horrored past and attempt to confront and resolve that horror in the present. As the story progresses the two story lines become more and more intertwined and the resulting film is an often creepy and scary as it unfolds from the eyes of this girl and boy both as children and grown to adulthood. It centers around a haunted mirror whose influence affects all around it. Seamless transitions from one time to the next keep you on the edge of your seat and the whole time the mirror has us doubting our own eyes. Horror done well with excellent performances all around. Definitely one of my favorites over the last several years."
    },
    {
      "rating": "8",
      "text": "More freaky than scary, and there are a surprisingly scant number of scary moments, this film really does a good job at challenging the audience to think and be engaged as you wonder whether or not what's going on is real or not. Slow build-up and development, but it's worth the wait. I don't watch scary movies often, but at the behest of one of my good friends I watched it and came away impressed and entertained."
    },
    {
      "rating": "9",
      "text": "In a world were jump scares are considered horror, it's nice to see a movie that actually tries to produce an interesting story with very deep psychological undertones that also actually manages to be pretty disturbing at times."
    },
    {
      "rating": "10",
      "text": "Great atmosphere, acting, camerawork, writing, special effects, etc., I could go on. The bottom line is that this is the kind of \"horror\" movie that I diligently wait for. Unfortunately, they are few and far between. If you want the classic campy horror film, go find yourself a copy of Saw or The Hills Have Eyes. If however, you are craving something a little smarter, a little less obvious, and a little more evil, look no further."
    },
    {
      "rating": "8",
      "text": "It is often said that a mirror offers not only a reflection of one’s own physical being, but also a reflection of their soul. The eyes meanwhile are far more subjective, being connected to the human brain which may lie to us more times than we would like to believe. When the physical frame can corrupt the mental existence so easily, how are we truly able to discern between the truth and the false truth. That is precisely what Mike Flanagan explores in his feature-length directorial debut.\r Oculus is a supernatural / psychological horror starring Karen Gillan of Doctor Who fame and adapted from Flanagan’s popular short film Oculus: Chapter 3 – The Man With The Plan. The story begins in 2002 with the Russell family as brother and sister Tim (Brenton Thwaites) and Kaylie (Karen Gillan) try to escape their family after he had killed their mother. We then jump ahead 11 years where we learn that Tim had shot his father and has since been in an Institution. On the day of his release his sister greets him only to announce that she bought ‘it’ and expects him to keep his promise to kill ‘it’. The ‘it’ in question is revealed to be a large antique mirror. After years of clinical supervision Tim has grown to accept the incident on logical and psychological terms. Kaylie however sternly refutes that their father was not to blame and that it was in fact a supernatural phenomenon courtesy of the mirror. Reluctantly, Tim follows his sister back to their old family home where Kaylie has set up an intricate experiment to prove once and for all that the mirror is evil.\r What follows is a run-through of the long list of horrific scenarios each of the mirror’s owners faced, dating back to the 1700s, along with a detailed series of precautions Kaylie has in placed in order to keep the pair from falling too deep into the abyss. You see the primary and unique danger that the mirror seemingly presents is that, as the advertising tagline states, ‘you see what it wants you to see’. For instance, upon biting into an apple, Kaylee ends up pulling shards of a light bulb from her mouth, only afterward to be met with concerned looks from her brother as she has been painfully spitting out mere slices of apple. The rest of the plot is unravelled as the pair attempt to survive in the house whilst reliving their childhood memories of the original event. The juxtaposition of both stories are weaved neatly together in a very smart narrative that constantly places the audience in the same situation as the two leads. It is believed that the mirror causes plants to die and animals to disappear. And yet both are seemingly explained; cameras show Tim and Karen moving the plants, and whilst Karen remembers their pet dog having suddenly disappeared whilst trapped with the mirror, Tim recalls their parents discussing it had to be put down whilst at the doctors. The viewer soon follows this train of thought by their own accord. As children they seemingly could not destroy the mirror, and now they are reluctant to do so without proving its power first. Perhaps this is indeed due to an unspeakable force, or it is simply their refusal to eradicate a symbol of their helplessness when faced with such a traumatic event. Only the viewer can truly decide what to make of the events that unfold.\r In the aftermath of Paranormal Activity, the director of Oculus was initially approached by many studios who wished to turn the project into a found footage movie. Flanagan outright refused and only accepted Intrepid Pictures’ offer under the obligation that it was not found footage. The end result is something of a double-edged sword. On the one hand it lacks what many modern horror audiences love: jump scares and gore. The only element of any noticeable comparison to popular horror films nowadays such as Insidious and Paranormal Activity are the odd humanoid apparitions adorned with glowing eyes. Personally, I found these ‘ghouls’ to be the only notable fault of the film as they simply something we’ve all seen before and not presented in any particularly unique sense. They are simply there to bring in the punters and deliver the odd attempt at being ‘scary’. However the other side to Oculus is what prevails and truly works in this critic’s opinion. The plot, consisting of two interesting stories, is notched up to eleven thanks to an intelligent script that delivers enthralling dialogue, enhanced by the charismatic and somewhat disturbing Gillan, and a slow-burn pace that sucks the viewer in until they soon realise just how deep they have gotten, attempting to figure out just where they are within the timelines and just what is really happening.\rIn avoiding cheap shots and shock value we instead we receive a traditional horror film that harks back to the simpler times - Full Review @ItsMuchMore"
    },
    {
      "rating": "8",
      "text": "\"Oculus\" 10 Scale Rating: 8.0 (Great) ...\r The Good: The best thing about this film is that there is little to no gore in it, yet it gets it's point across. Sufficiently creepy, \"Oculus\" is a creative and well written tale that retains your interest throughout. While Karen Gillan and Brenton Thwaites were more than adequate, the best performances of the film featured Rory Cochran and Katee Sackhoff in flashback sequences. The pair played the parents of the lead characters and help fill in the blanks as to what makes the cursed mirror (the central point of the film) so important. While it won't truly scare you (but what does these days?), it is a well done and entertaining movie with a very satisfying ending.\r The Bad: While it doesn't detract too much from the film, it does rely on the typically \"jumpy\" scenes here and there. I understand the point, but could have done without them. Gillan eventually settles into the role, but is a little awkward and somewhat annoying early on."
    },
    {
      "rating": "8",
      "text": "A truly horrifying horror movies. It has good acting, interesting characters and a completely disturbing story told with great direction and grisly images. This movie got under my skin in many ways and is the best horror movie I've seen in a long time (have no seen babadook keep in mind)."
    },
    {
      "rating": "10",
      "text": "One of the best thriller/horrors I've seen with an extremely creepy story and mind bending occurrences.\r I would love a sequel if it's possible but the cast and crew did an awesome job!!"
    },
    {
      "rating": "9",
      "text": "Oculus is simply a mind-blowing, smart and terrifying movie experience. As I often say, the most scary things are the ones you don't actually see. Yes you do see the \"main\" ghost in the film, and pretty quickly, but it is not what's supposed to be the presence that is the most scary, that one is in your mind and the film portrays that so well, it'll give you major creeps."
    },
    {
      "rating": "8",
      "text": "It's creepy but not scary. It's highly entertaining though and a very good watch.\r Watch it online for free: https://www.primewire.ag/watch-2745787-Oculus-online-free"
    },
    {
      "rating": "9",
      "text": "Good script, strong cast, several quality scares... yeah, it's actually a decent haunted mirror movie!\r Click here  http://www.watchfree.to/watch-29e5bb-Oculus-movie-online-free-putlocker.html"
    },
    {
      "rating": "1",
      "text": "the movie tries it's hardest to write a convincing story, but falls flat on the constant pullback into the past events that don't justify in me caring about any character's deaths. **** kaylie, dumb ****"
    },
    {
      "rating": "7",
      "text": "The suspense in Oculus is created by never allowing the audience (or the characters) to know what is real and what is hallucination. I thought the film was well-acted, but the plot was not very strong and sometimes the action was much too hectic. I was not bored, but the film did not deliver the scares than some less well-made and original horror films do (example: The Purge). Sinister, which I think is a far better film than Oculus, is both well-made and delivers more shocks and shivers, even when I’ve watched it a several  times on cable (without commercials) after seeing it in the theater. So I would say Oculus is an interesting film for horror fans like myself to see once, but it is not very memorable and I guessed the ending long before the end of the film."
    },
    {
      "rating": "8",
      "text": "Oculus is one of the horror films that has a strong plot and an interesting premise to grind in for 105 minutes. Over watching this, I find it scary and very eerie in terms of atmosphere and chilling actions. It's one of the must-sees for this month. You will find it great."
    },
    {
      "rating": "8",
      "text": "The success of the film rests heavily on the acting ability and presence of the two actresses playing Kaylie - Karen Gillan and Annalise Basso. They do an outstanding job.  Rory Cochrane & Katee Sackhoff, two actors that I've liked in prior roles, are really secondary here. Beyond the Kaylies, what truly drives the movie is the sound design and score. Wow, were they powerful. The trailer for this film makes it look just like every other of these creepy, gothic-style films from the last couple of years, but it's got a stripped down, clean feel to it that makes it unique and justifies the metascore.  If only the dude behind me in the theater didn't sound like he was about to cough up a lung for most of the film, I might have enjoyed it even more."
    },
    {
      "rating": "7",
      "text": "I was really impressed considering I didn't have much expectations. The story was interesting and never boring. Even more so, I felt the overall acting was strong. The movie was a nice surprise."
    },
    {
      "rating": "7",
      "text": "While there are moments of horror tropes you’ve certainly seen before — the haunted mirror, the family slowly driven to violence by a menacing force — ‘Oculus’ proves that the devil is in the details. Quite literally."
    },
    {
      "rating": "10",
      "text": "The reason why I trust movie critics over the public is because critics are generally more appreciative of  horror movies, my favorite genre. While critics are often hard on horror movies, the general public is usually even harder on them. I watch a lot of horror movies, and this is the last one I saw that actually scared me."
    },
    {
      "rating": "3",
      "text": "I was in the mood to watch something scary, I heard that this movie was a great horror film, so I was very excited to watch it. I felt that the movie started out slow, I remember it being an hour into the film and I was sitting there bored waiting for the story to build. In my personal opinion, it wasn't a scary movie. I felt the movie was more of a suspense or thriller, but it WAS NOT scary. The whole first hour of the film is the dad being an **** the mom being insecure, and the kids continually crying. And when they finally start to show some creepy stuff, its near the end at that point, and because the build up was so slow, my excitement was already completely gone by the time it got a little creepy. I felt that the creepiness they added, was there just to be there, it didn't really add to the story. The greatest part about the end of the movie is that it was finally over. The film was well shot, and they had great actors, but my main problem is that the story sucked, and it didn't truly feel like a scary movie, because it simply wasn't scary. They had random moments of silence where something would jump out or scream to catch you off guard, but it wasn't done in a way that made you feel scared. It was more like*flinch* **** ...and back to the boring story line."
    },
    {
      "rating": "1",
      "text": "Nothing good for the expectatives, really a bad movie. i was waiting some intense and really scary scenes but pfff, this is a piece of crap, bad movie, bad history.... i will can fill this with all the bad but i dont want lose many time doing this."
    },
    {
      "rating": "3",
      "text": "This film could actually have been a decent one, if only the evil entity that the characters are fighting was actually beatable, but it's not and whatever they do to stop it inevitably fails becuase of the entity's peculiar power. I don't like it when there's no chance for the characters, it makes it all rather pointless. Also, the girl randomly decides to trust the entity towards the end, which makes no sense at all and this only happens because obviously whoever wrote this couldn't come up with anything better to end the story. Disappointing film."
    },
    {
      "rating": "3",
      "text": "I really did not like this film. There wasnt any reason for anything to be happening. And while the idea of the events were taking place in two time periods at the same time for the same characters was a cool idea. It just fell flat on its face for this film. There was no reason for any off the events happening except some ghost in a mirror making the father do the things he did. Some people got killed, for some shock value, but this movie didnt scare me or make me feel anything for the characters one bit. Just an aweful expirience for me."
    },
    {
      "rating": "8",
      "text": "Oculus is probably one of the creepiest movies I have seen in a long time and it disgusted me in some parts...in a good way. If you're a horror fan then this is a must see for you, Although I do recommend that if you do not like gore at all, that you avoid this film."
    },
    {
      "rating": "9",
      "text": "Gee whiz!  A horror movie that does not insult your intelligence.  There are a few thump/bump moments and a couple of shock-in-your-face scenes, but overall \"Oculus\" has a plot that actually tells a satisfying story.  Things happen for a reason.  The movie is not exactly subtle, but it is certainly not the shear nonsense of so many recent horror movies.  The Blu-Ray DVD came out today.  See it!"
    },
    {
      "rating": "3",
      "text": "A predictable, thrillless, tiring, mess is less scary and more what the hell is going on. Where it lacks in scares makes up in set design. The poor dialogue, predictable story, and \"saw it coming after the first 15 minutes\" ending really lets you down once you leave."
    },
    {
      "rating": "9",
      "text": "Oculus is an outstanding horror flick, it has everything you care about in a horror movie with great family tension and musical score (style) that I love."
    },
    {
      "rating": "2",
      "text": "I don't see the merits of this film. The pacing was way too slow, the time-frame jumps around from past to present and back too much, and it just has a '70s B-movie vibe to it. Waste of time."
    },
    {
      "rating": "3",
      "text": "Oculus is one of horror films which have only one reason to see and reason is amazing Redhead Karen Gillan. Remember, Karen Gillan and no other reason.\rEvery few minutes - flashback, maybe you are right that is new way to make horror movie, but I think it is new way to confuse. Worst movie I saw in that genre."
    },
    {
      "rating": "7",
      "text": "To be honest I can't quite understand why the average user score for this movie is quite so low. I'll admit that it does have a few pacing issues but its one of the better 'horror'movies I've seen in a while. The way the movie jumps between the two timelines is well done and, unlike many modern entries in the genre, it doesn't rely on over the top gore or cheap jump scares. The ending was also unexpected yet in keeping with the tone of the film."
    },
    {
      "rating": "6",
      "text": "Director Mike Flanagan and co-writer Jeff Howard expand on their original 30-minute short film about a lethal piece of furniture \"Oculus: Chapter 3\" to a feature-length film. While it's a cut above the usual paranormal thriller, its 105 minute runtime doesn't dramatically improve on its mysterious element and it falls short on dread and tension. While \"Oculus\" slowly develops an unsettling story that cleverly undermines an age-old horror-film cliché, it's never quite as scary or as memorable as one might have hoped.\r After shooting his father and spending years in psychiatric care, Tim Russell (Brenton Thwaites), reunites with his sister Kaylie (Karen Gillan), who claims that an antique mirror in their father's study was what destroyed their family, as well as the families of many owners before them. Tim reluctantly agrees to help Kaylie document the mirror's effects, but all goes awry when it begins to play with their perceptions-intermingling past and present, memory and reality, and forcing them to witness again their parents' violent relationship, with devastating results.\r What's unique about \"Oculus\" is its structure, which cuts back and forth between Tim and Kaylie in 2012 and their experiences 10 years earlier. Flanagan daringly cross cuts between flashbacks and the present, and even sometimes unities the two storylines in the same shot. Flanagan uses the back story to inform the audience of the details of how this started, while at the same time using it to terrorize Tim and Kaylie, who aren't quite sure if what they are seeing -- and doing -- is real or not.\r Flanagan creates a number of eerie visual parallels between the past and present, but eventually the slow-burn suspense sequences and sudden shocks become increasingly repetitive. Throughout the film's slow build-up, Flanagan effectively incorporates some creepy images and the film convincingly earns its frights the old-fashioned way. However, the third act offers an escalation in action accompanied with a scene of shock that doesn't intensify or enhance its predictable, lackluster finale. To his credit, Flanagan takes a dubious premise further than most could. That being said, next time just smash the damn mirror."
    },
    {
      "rating": "6",
      "text": "Oculus is a fresh installation in the horror genre which has an original story, a great cast and a mix of past and present sequences. It has some great jump scares but in the whole the movie doesn't really want to scare, but to thrill and to have a twist ending. I honestly think that the writers were bored  and couldn't find a better way to close the film as it leaves many questions and for sure there is not going to be a sequel and so everybody's question are never going to be answered.It had a great potential, but somewhere in the end it lost it.Could have been muuuuuuch better. Still is something original and a horror movie that needs your attention. Check it out!"
    },
    {
      "rating": "10",
      "text": "After seeing oculus it was one of the greatest scary movie ever . the bad thing was the ending it really sucked . Know  were on the edge of are seats and the thing are minds is \"what the hell is gonna happen next \". Grade A+"
    },
    {
      "rating": "5",
      "text": "Oculus was hard to follow between their past and present and I think that the ending wasn't good. Other than that every thing else was alright. Usually in horror movies something good happens at the end, but not in this one"
    },
    {
      "rating": "9",
      "text": "\"Oculus\" is a very well-made horror film. It relies on a dark atmosphere rather than blood or jump scares, and the mirror is quite interesting and disturbing. The way the story is told, the past and the present being told at the same time and eventually interconnecting towards the end, is pretty cool, but it becomes somewhat confusing in the third act when the past and the present are blended together. It's overall a very satisfying, enjoyable, and interesting movie, and I highly recommend it."
    },
    {
      "rating": "7",
      "text": "A Shakespearean tragedy disguised as a psychological thriller / horror film. The movie has a strong impact if you suspend the expectation to be scared and shocked because it simply doesn't do that.\r Why is that? Because you catch on rather quickly that most of the movie is an illusion. The two main characters are reliving the trauma of their past in real time rather than flashing back to it. The director makes this perfectly obvious by interleaving the past and present, having the past versions of the characters occupy the same space and time as the adult characters. As a result, you realize you can't really believe anything you are seeing and fear arises from what we believe to be real not what we don't. There are a few of those jump out of your skin moments but they are entirely predictable as in someone turns around slowly and 7 Days chic is standing there - meh.\r The story though was heart-wrenching. You have boy, Tim, who inadvertently kills his father and (SPOILER ALERT) sister Kaylee because of this mirror thing from hell. A family is torn apart methodically by a sinister and malevolent force that has killed many others before. The scene at the end sticks in my mind like retina burn from an arc welder; Tim furiously pleading \"It was the mirror\" as he is driven away in a police cruiser and his sister materializing with the signature chromed eyes of the mirror's victims next to his parents with the same telltale trait in the window of the family's old house. Its at the moment when it really sinks in \"Holy sh**, he actually killed his sister, he's the only one of his family still alive, he's going away to the big house, and no one will ever believe it wasn't his fault.\" No happy ending here. Its melancholy, depressing, and truly tragic.\r But not scary. And that is why I have to rate it down. It passes itself off as a horror thriller but its really a tragedy. Came for one thing got something else."
    },
    {
      "rating": "4",
      "text": "A young brother and sister survive the effects of a haunted mirror only to relive the evil 11 years later. The concept had potential and the cross-cutting between their present and past has promise. Unfortunately, the pacing drags, the scares are minimal and the whole thing falls apart."
    },
    {
      "rating": "6",
      "text": "A film that literally makes you crazy, trying to reveal what happened and happened in the silent House away from nothing and close to everything (the typical atmosphere of American terror). Characters maybe fell short in personality and to say confusing conclusion; These two factors caused a slump in my score. But that does not desmerita it cause me a couple of real screams."
    },
    {
      "rating": "7",
      "text": "Perhaps not the scariest horror film, but it is one of the most original. It's atmosphere is filled with tension and uneasiness, and it's constantly playing with the fact that you, just like the characters, can't always believe what you see. That more than makes up for the lack of scares.\r It also helps that it's extremely well acted and has a great plot that will suck you in. It might not be all that scary in the end, but the way the twists and tricks up it's sleeve means it is one that messes with your mind. Trying to figure out what's real and how things are going to play out based on these illusions leads to a satisfying payoff with the ending. It's not perfect, but it stands next to The Conjuring as one of the best horror movies to come out in a long time. A must watch for genre fans."
    },
    {
      "rating": "5",
      "text": "It kept me entertained most of the time but when it comes to be even remotely scary, it fails big time. However, the film is creative and makes for a unique horror movie."
    },
    {
      "rating": "6",
      "text": "Good enough to keep me entertained the whole time, but if your looking for big scares, this isn't the right movie. More of a messes-with-your-mind kinda movie."
    },
    {
      "rating": "6",
      "text": "\"Oculus\"'s ending may leave a poor taste in your mouth, but the brilliant camera and narrative work at hand is undeniable, as well as some fantastic mythological world-building and use of tension."
    },
    {
      "rating": "6",
      "text": "#sosa #Boring #weakScript #badActors No asusta , #goodPhoto buena fotografía . buuuu zzzzzz Es un copy paste mal hecho de películas de terror de culto. Espera a que salga en DVD"
    },
    {
      "rating": "7",
      "text": "A surprisingly entertaining horror film throughout the entire movie.  The creepy moments aren't only in the images but also in the guessing is this real or not.  B+"
    },
    {
      "rating": "5",
      "text": "This is a tricky mirror and you will have to wait for 3 to 4 sequels to nail the damn thing. Hope Tim does not screw in the next one when he comes out of mental hospital after another 10 yrs (that means he'll be  about 31 yrs played by Bradley Cooper)."
    }
  ]
}