{
  "id": 643,
  "title": "Odd Thomas",
  "starring": [
    "Anton Yelchin",
    "Addison Timlin"
  ],
  "runtime": 100,
  "genre": [
    "Mystery",
    "Thriller"
  ],
  "description": "In a California desert town, a short-order cook with clairvoyant abilities encounters a mysterious man with a link to dark, threatening forces.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/skBMhQjHLTU1rp4gutxHp0JuY1C.jpg",
  "categories": {
    "plot": 7.913043478260869,
    "acting": 7.35,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 6.5,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "8",
      "text": "It was faithful enough to the book to keep me hooked for the entirety of the movie. In the book Odd acts as a narrator, which was good, but in the movie it could have done without it, instead just showing the story. Other than that, though, I have no complaints. They even got the ending right. It may not be for everyone, but it is in this writer's opinion that it was a good flick."
    },
    {
      "rating": "9",
      "text": "Odd Thomas is a very well produced, quirky little number from the Director of the Mummy. It basically plays out like a warped episode of Buffy the Vampire slayer in terms of it's tone and direction and the movie is narrated throughout by the main star. The dialogue is very witty, the story is unique and engaging and there are some genuinely creepy moments. This film will probably become a cult classic. It has all the makings of one."
    },
    {
      "rating": "7",
      "text": "One of the movies I expected nothing from, at first. Then you realize it´s an easy going movie, than keeps your attention, with really nice characters. The end, I must say, wasn´t expected, by that time I thought everything was gonna turn out fine for everyone, but the twist was terrible."
    },
    {
      "rating": "9",
      "text": "This is a pretty faithful adaptation of the Dean Koontz book. For some reason, this film faced an uphill battle seemingly from the start. At one time it was indefinitely delayed due to investors retracting promised support. That uphill battle is likely to continue now that it has finally been released as critics try to combat positive viewer response with all sorts of negative analysis. This is very enjoyable to those who have read the source material as well as viewers who have not. I have rented it and will be buying it on DVD as soon as I find it in stores."
    },
    {
      "rating": "10",
      "text": "Having read all the odd series, I, AND MY FAMILY, EVEN THE ONES THAT HAVE NOT READ THEM, LOVED THE MOVIE.  WE MISSED THIS IN THE THEATERS, BUT WOULD HAVE LIKED TO HAVE SEEN IT THERE.  WE ALL ARE HOPING FOR SEQUALS.  PERSONALLY I WOULD CHANGE NOTHING IN THIS FILM. IT REALLY CLOSELY FOLLOWED MOST OF THE BOOK.  I KNOW I WILL BUY THE DVDS FOR ALL SEQUALS, IF AVAILABLE."
    },
    {
      "rating": "6",
      "text": "Odd Thomas – which never saw a public US release and is presently available on Netflix – plays like the pilot of a prime time TV show. There is nothing offensive presented, some of the more violent action occurs offscreen or via obstructed views, there is a little gallows humor, it occasionally dips its visual toes into ever-so-slightly mature waters (a little gore, Timlin in her underwear, etc.), its characters and locations are memorable and intriguing enough to consider a return trip, and the epilogue leaves the door wide open for future installments. I wish it had been a TV pilot because it is far better suited to that media.\r I don’t know that any future installments will ever happen (regardless of screen size), but if they don’t, this installment is just enough quirky fun while it lasts."
    },
    {
      "rating": "8",
      "text": "its not a ten but pretty darn fun. needs to be more broad in scope which is what the sequel seems to be hinting at. the girl is a great actress. dialogue is well written, a bit too smooth.i hope there is a sequel"
    },
    {
      "rating": "4",
      "text": "An almost solid movie horribly tainted by godawful effects. If the effects were at least just alright I could have given it a 7 because of the solid script and cast but, I can't do that. If they do a sequel I hope they improve upon these effects."
    },
    {
      "rating": "7",
      "text": "This movie has an interesting story, it’s well written and the acting is solid. Time well spent."
    },
    {
      "rating": "4",
      "text": "Succeeds at retelling the story that can be found in the eccentric Dean Koontz novel, but fails to juggle all of it's wildly differing tones making it all for naught. It's handling of the mixture of genres which ranges from comedy to romance to horror and everything in between is just as awkward as the dialog. Most of which is pulled directly from the book and doesn't translate to the screen very well. One might be tempted to call Addison Timlin a bad actress after this, but considering what she was given to work with I'd say she did fine. Her lines are often the most unnatural of them all.As someone who has read the entire series I can say that while it is a little disappointing to see certain side-characters relegated to cameos at best the actual liberties taken here are minor. You'll miss out on the stuff with Odd's parents and Ozzie Boone is relegated to a mere cameo, but these were characters who quickly disappeared as the books progressed anyways. For the most part this is a very faithful adaptation in terms of following the events of the source material. It just doesn't have the same spirit.While Odd Thomas the book relishes in it's weirdness and embraces it wholeheartedly to create something unique and lovable, Odd Thomas the movie seems uncomfortable with it's own peculiarity. One would expect that the issue with trying to merge all these different styles together would be tonal inconsistency. But in fact the problem is that there's no tone at all. Stephen Sommers direction is strangely muted. Perhaps as an effort to capture the same deadpan tone of the novels. There's no flair as a result though. Something that makes the wooden actors, bland locales, and low budget all the more apparent.It does have a star in the late Anton Yelchin though. He gave a fully committed performance and was a great Odd Thomas. The movie also does an admirable job of portraying the Bodachs. Mysterious otherworldly monster that feed on pain, suffering, and tragedy. Their appearance may mean that a lot of death is on the way, but they sure do bring a lot of life whenever they're on the screen. More so than the excessively slow motioned action sequences do.What's most shocking and undesirable about the whole thing is that it manages to make a supernatural mystery-thriller about an unassuming fry cook with the ability to see the dead people feel boring and by the numbers. A vanilla adaptation of a story that's anything but. Skip the movie. Read the book. 4.5/10"
    },
    {
      "rating": "8",
      "text": "This is a very fun movie and very enjoyable. I've never read the books before but it made me want to go out and start the series. Although I'd love to see sequels made, and for them to be released in theaters, I personally don't see it happening. The story is pretty single-minded and the fact that William Dafoe is in the movie was wasted on the fact that his character is the very definition of a \"side-character\". He's the only star power that exists in this movie and he was not used very well. Honestly, his presence could have been cut out the movie entirely if not for one major scene toward the end. The movie also suffers from a tone shift that occurs about 7-8 times in the movie. It goes from light-hearted to intense back to light-hearted, and so on. It changes so much you get the feeling that the writers were trying to keep you on your toes but it does nothing but confuse what was happening for me.\rHowever, I do love this movie and the actor's playing the lead characters are wonderful. Anton Yelchin does a great job as Odd and roles with the punches as everything comes. He also does a great job at conveying emotions and you don't see that too much with too many actors. I loved the interactions he had with his girlfriend Stormy were great. I thought the movie had alot of heart and I was able to get pretty emotionally invested in these characters.\rWhile the story isn't that powerful and the tone shifts will spin your head, this is a very well done movie, especially for one not deemed worthy of a U.S. release in theaters. You'll enjoy your time with this movie and that's not something you can say with alot of movies today."
    },
    {
      "rating": "8",
      "text": "Based on the novel by award winning writer, Dean Koontz, comes the wildly successful Odd Thomas. This story was so popular, that it's become an entire series, one that Koontz has worked on almost exclusively since it's release. This unique story focuses on a unique man, with a unique name. Odd (Anton Yelchin) is a short order cook in a small California town, where he lives a relatively normal life with his girlfriend, Stormy. Odd is no different than any other twenty-something in town,  except for the fact that he sees the dead, specifically people who died prematurely and under suspicious circumstances. They can't talk to him, but the spirits lead Odd to the evidence he needs to find the truth. When a strange man comes to town, the spirits lead Odd to be suspicious, and with good cause. Anton Yelchin stars and once again shows off his loveable charisma. There is something about him that makes Yelchin the guy that everyone wants to be friends with, an ability that comes across in every character he plays. Odd is no different, as he is this complete weirdo, but with an innocent quality, that just makes people want to like him. Here he's more than just a lovable goofball, but he's also an unofficial detective and hero, that people turn to in there time of need. Everyone knows he's weird, but few know his secret, one of those being the Chief of Police, played by the legendary Willem Dafoe. Dafoe usually portrays the bad guy, and it was interesting to see him take on a different challenge. Odd Thomas is smart and extremely well written, with a terrific cast, that really brings the story alive with their own unique style. The story may seem like it's a little out there, but it's not just science fiction, it's a story that crosses many genres and has something for everyone, an easy choice for our list of must see movies!"
    },
    {
      "rating": "10",
      "text": "Best movie I've seen in a very very long time!  I'm really not a fan of suspense, but this movie was a lot of fun!  The graphics were fantastic and the story was (in my opinion) better than the book.  Some of the acting could have been a bit better, but most of the characters were actually WRITTEN to be a bit awkward, so most of it is actually very GOOD acting even though a few things seem a bit off.  Excellent movie! Lots of fun.  For those PG parents, there is a small bit of gore and tiny bit of sensuality."
    },
    {
      "rating": "10",
      "text": "An unusual plot twist that you will never guess. Excellent writing and directing. This is kind of a romantic/drama/action/paranormal movie that will keep you on the edge of your seat. This is not one to pass up."
    },
    {
      "rating": "10",
      "text": "Odd Thomas was a good movie. Great actors, nice story line, interesting ending. I really-really hope to see continuation. I hope to see ether a movie or a show with the same story line, and actors."
    },
    {
      "rating": "6",
      "text": "I enjoyed the slowly revealed mystery and Odd's supernatural gifts.  However, some of the side character acting was not amazing, and the ending was disappointing in clichéd ways."
    },
    {
      "rating": "5",
      "text": "An almost solid movie horribly tainted by godawful effects. If the effects were at least just alright I could have given it a 7 because of the solid script and cast but, I can't do that. If they do a sequel, I hope they improve upon these effects."
    },
    {
      "rating": "8",
      "text": "This was a really good movie, I didn't know what to expect, but I'm glad I came across it. Worth the watch.\r Watch it online for free: https://www.primewire.ag/watch-2741837-Odd-Thomas-online-free"
    },
    {
      "rating": "10",
      "text": "loved this film.\ri can't wait for the sequel\rplot twists were great\rromantic, action packed, supernatural,    fest of fun, horror and action.\rAll the family loved this movie."
    },
    {
      "rating": "9",
      "text": "This film is partly based on a successful novel by Dean Koontz. The film revolves around Odd Thomas, a young man who can see and communicate with the souls of the dead and uses this to solve crimes and homicides. For this, he collaborates with the police through a detective whom he is friends with and who knows his gift. He also has a longstanding relationship with Stormy, a young woman with a strong personality and who also helps him.In this film, Odd Thomas is seriously apprehensive when he sees an enormous amount of evil spirits around a repellent-looking man. Knowing that they tend to be attracted to places where a lot of violence is going to happen, he decides to investigate the man and try to stop whatever is about to happen.The film works quite well and, despite the supernatural theme, it was not conceived as a horror film but as a light adventure film, with touches of comedy, for a young audience. The script works quite well although I cannot say if it is true to the original book because I never found it in my mother tongue - Portuguese - and therefore I never read it. But the film successfully establishes an emotional link between the characters and the audience, and we are happy to follow Odd and his girlfriend in their investigations. The ending is good, truly surprising and it's hard not to feel sorry for the characters.The cast is led very effectively by Anton Yelchin, who in this film has one of the most interesting roles of his career (which, as we all know, ended with a very early death, a few years ago). Beside you can see the beautiful Addison Timlin, also very good in the role of Stormy. The chemistry established by the two actors works really well. There is still room for veteran Willem Dafoe, who does his job well.Technically, it is an effective and discreet film, which gives space to the script and the work of the actors to shine and knows how to put itself in the right place. It bets a lot on good cinematography and good special and CGI effects, particularly in scenes with the spirits and in some very well done action and fighting scenes. The sets and costumes also work very well."
    },
    {
      "rating": "3",
      "text": "This movie didn’t get enough credit it’s a damn good movie and emotionally fun to watch I love it every time I watch it I cried. But think it could of been a lot better"
    }
  ]
}