{
  "id": 3356,
  "title": "Official Secrets",
  "starring": [
    "Keira Knightley",
    "Matt Smith"
  ],
  "runtime": 112,
  "genre": [
    "Thriller",
    "History",
    "Drama"
  ],
  "description": "The true story of British intelligence whistleblower Katharine Gun who—prior to the 2003 Iraq invasion—leaked a top-secret NSA memo exposing a joint US-UK illegal spying operation against members of the UN Security Council. The memo proposed blackmailing member states into voting for war.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lyCGqSkT3PqLYQXiWs4FCVJBAYW.jpg",
  "categories": {
    "plot": 7.2,
    "acting": 7.0,
    "ending": 7.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Let's pass on the bad guys all very bad and the good guys all very nice, Keira quickly cracks then stands in front of the govt. Predictable."
    },
    {
      "rating": "9",
      "text": "I am going to rate this film quite high, not because of its subject, but because of the committed and totally convincing performances of the actors, most notably by Keira Knightley, and the sly one contributed by Ralph Fiennes, which borders on scenery chewing (in a positive sense). Who would have thought that a movie about the Iraq War could be compelling and even suspenseful?"
    },
    {
      "rating": "8",
      "text": "A somewhat rote but nevertheless compelling biopic telling the story of British whistleblower Katharine Gun and how she exposed government efforts to strong-arm United Nations Security Council members into sanctioning the 2003 Iraq War based on faulty intelligence, only to subsequently face prosecution (not to mention harassment) under the UK's Official Secrets Act. It's a story not well known outside the UK and one with a message that we should all take to heart. Keira Knightley delivers a knock-out performance as the unlikely and unwitting heroine, backed by a superb supporting cast and the fine direction of filmmaker Gavin Hood. Like the story it's based on, this film hasn't received much attention, but it's definitely a worthwhile view."
    },
    {
      "rating": "9",
      "text": "This is a great movie about a whistleblower.Ms.Gun tries to prevent war.If you are interested in international politics, you will like it Her efforts might be in vain. But people could see a dark side of politics. Today, there was still no peace in the Middle East. Hope we have peace there."
    },
    {
      "rating": "8",
      "text": "It was interesting, sure political movies get mixed reviews usually but I really liked this one.[Realistically] Intense until the last moment."
    },
    {
      "rating": "6",
      "text": "I think I can say with absolute certainty that this is Keira Knightley's best performance in a drama set in a current era and her best film since Colette.It's an ordinary drama but it kept me entertained. It's a bit slow, but I never got bored so that's already a huge benefit.Its director Gavin Hood maintains a good quality but his performance is more at the level of what he did in Eye in the Sky and far from what he achieved in Tsotsi.But still I think it's worth it."
    },
    {
      "rating": "6",
      "text": "So Ralph comes in later, way too late. And still he takes over the film like, um.. you know who must not be named.Official SecretsGavin Hood is so not the director I would think of when a geo-political story is to be deconstructed on the screen. And is probably the only reason why this film works the best than any other maker could have made. We have a general perception by now on how to receive a film. You feel the tone of the film within the first five minutes and start adjusting yourselves accordingly. The assumption is both part of educating yourself on how to catch a film and also the disadvantageous alibi that one cannot get rid off. But every now and then a film comes that is uniquely volatile on the speech and has a spin that you'd be fooled by its nature. Not manipulative just incredibly fresh and uprightly vocal.And that is the only reason why the film works. Against a standard script and a textbook execution, this brand new information flashed in front of you, is why you enjoy a film like this. Yes, enjoy. Entertaining is not the feeling you were hoping to receive in a film like such. And I know it might look like the film is substantially gifted and perhaps is why gripping throughout the course. But it is also the way it is structured.There is real commercial visible in the way every information is passed. And there is nothing bad about that. Endorsing a material and sticking by the promise is what every consumer, viewer could hope for. For a film like Official Secrets that is about the dirty works going under the table the film is awfully clean. And not in some formal, paper-ish style but the old western genre kind. Your space is respectable and everyone gets room, lines, moments to fire the gun; the duel is soothing."
    },
    {
      "rating": "7",
      "text": "A film about a whistleblower – what could be more timely?  (Given the American attention span, this film is, of course, available only in limited release.)  These days, a film about a whistleblower must be hard to make compelling.  There are no clandestine trips to make chalk marks on park benches at midnight or earnest face-to-face conversations in poorly-lit underground garages.  Now, since nearly everything happens on a computer screen, a grimace, a sigh or a raised eyebrow have to substitute for talking, running or other derring-do.  Even so, “Official Secrets” keeps viewers’ attention while patiently stoking their sense of outrage.This film chronicles the true story of Katharine Gun, an analyst working at the Government Communications Headquarters (GCHQ), a part of British intelligence.  On January 31, 2003, Gun and her co-workers received copies of an email from Frank Koza (really his name – Keyser Soze, anyone?), a regional director at the NSA in the US.  Koza wanted British intelligence to help collect dirt on UN staffers who represented Angola, Bulgaria, Cameroon, Chile, Guinea and Pakistan.  The purpose was to pressure these representatives because they represented the “swing votes” on the pending UN resolution to approve the war in Iraq.  Enraged by what she perceived to be an illegal request in furtherance of an illegal war, Gun gave a copy of the email to an activist friend.  Eventually, the email was published in the London newspaper “The Observer,” sparking international outrage and eliminating any prospect that the UN resolution for war would pass.  “Official Secrets” addresses these events and the trial that follows, when Gun is eventually charged under the UK’s Official Secrets Act.A wide variety of recognizable stars participated in this project.  For Keira Knightley (Gun), this role must have been a welcome respite from her recent series of frothy period pieces.  She persuasively portrays Gun as a worker bee with a social conscience and a basic sense of decency.  As her attorney Ben Emmerson, Ralph Fiennes stops just short of literally chewing the scenery.  The film is enriched by performances from Matt Smith (Prince Philip in “The Crown”), Rhys Ifans (Mycroft Holmes on TV’s “Elementary”) and ever-reliable British actors Matthew Goode (“The Crown”), Indira Varma (“Paranoid”) and Ray Panthaki (“Marcella”).  Consistently ominous music from Paul Hepker and Mark Kilian makes sure we are anxious and alarmed in all the appropriate places.Director/Co-Writer Gavin Hood’s previous work includes “Rendition” and “Eye in the Sky,” so be forewarned that this is a film with a point of view.  Even so, Hood’s story keeps the audience engaged and generally sticks to the facts, suppressing the impulse to lecture the audience or nurture a particular political point of view.If you’re willing to accept the premise that a government whistleblower can make a difference by speaking truth to power at great personal cost, this film could be a reassuring couple of hours."
    },
    {
      "rating": "8",
      "text": "I thought Keira gave a cracking performance as the whistleblower Katharine Gun. The story is interesting as it is, of course, based on a true story about a time I remember reasonably well. Its a fairly insightful film and its certainly thought provoking. I'd recommend it, yes."
    },
    {
      "rating": "5",
      "text": "Illustrates perfectly what the British Government is capable of doing regardless of the consequences."
    },
    {
      "rating": "10",
      "text": "It’s no wonder that somebody from the NY Post would rate this movie 38/100  especially when you have facts presented that put the US and the UK in a not so ”favorable” light concerning the war in Irak."
    },
    {
      "rating": "7",
      "text": "A solid enough whistleblower movie but falls short in the suspense department like similar movies such as \"All the President's Men\"."
    },
    {
      "rating": "10",
      "text": "This is an absolute see....Moral Compass....this is what it is....Keira is smashing as always..."
    }
  ]
}