{
  "id": 3312,
  "title": "Office Christmas Party",
  "starring": [
    "Jason Bateman",
    "Olivia Munn"
  ],
  "runtime": 105,
  "genre": [
    "Comedy"
  ],
  "description": "When Carol Vanstone, CEO of the technology company Zenotek, expresses her intention to close the Chicago branch, run by her brother Clay, he and his co-workers organize a Christmas party in an effort to impress a potential client and save their jobs. But the party gets out of control…",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7r3w3cPTbNEIr1imb8zXyeIJCJe.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 6.857142857142857,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.7272727272727275,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Rating - 4.2/10Office Christmas Party, even with its seemingly perfect cast of comedic giants, is nothing more than a poorly written, cliche filled, disposable holiday mess."
    },
    {
      "rating": "5",
      "text": "Not nearly as crazy unhinged as you're hoping. This is after all from (some?) of the writers of The Hangover, and we know that their talk about the madness is way better than the actual thing (see also: Hangover sequels, 21 & Over, Bad Moms, etc). This also explains why the first Hangover is the only one that really works -- it's all after the fact.What you've got here is an old-fashioned Christmas redemption story with a likable cast (Olivia Munn being just one of the boys and inventing new hardware by being a good programmer, err...what?) and a bit of new-fashioned raunch."
    },
    {
      "rating": "6",
      "text": "Josh Gordon and Will Speck’s raunchy ‘Office Christmas Party’ is at its hilarious best when the writers and ensemble let loose on their scripts and characters respectively. Unfortunately, the tight script never lets loose and constrains these moments by placing them in bits that are too far apart."
    },
    {
      "rating": "3",
      "text": "If you could remove every scene with Olivia Munn and Jason Bateman you might have an ok movie. The moronic B-movie \"plot\" destroys an otherwise funny movie."
    },
    {
      "rating": "4",
      "text": "Office Christmas Party has a load of laughs, yet they can't even come out correctly at the correct time as it's supposed to be. A Christmas comedy that cannot be seen without laughing at its failure to laughter."
    },
    {
      "rating": "9",
      "text": "It’s that time of the year ladies and germs, where the Holiday movies come crashing in. However, this time we seem to be onto a winner…2016 is winding down and we have had our fair share of ups and downs. So why not lift the spirit and jump into some festive viewing. This time with the help from Josh Gordon and Will Speck’s ‘Office Christmas Party’.Alright, I know… The title may seem rather off putting, but don’t take this lightly, this film right here is a top running contender to take out quite possibly ‘The Funniest movie of the year’.That’s right you heard it. It is that damn good!Centered around a tech company, this film could not get anymore 2016 if it tried. And man, will it make you depressed about your own lame upcoming Christmas party (better start sneaking that booze in). Featuring a stellar cast of Jason Bateman, Jennifer Aniston, T.J Miller, Olivia Munn and Kate McKinnon just to name a few this film is sure fire, or ‘Lit’ as 2016 has led us to believe.McKinnon continues her onslaught of slaying in everything that she does and doesn’t look like she is about to slow down anytime soon. Her Comedy is fantastic and for any SNL lover out there, I can guarantee that it will leave you in stitches. T.J Miller (best known for his role in Silicon Valley) brings the heat as he works his magical improv into various scenes throughout, many which almost had me spitting out my Pepsi Max as I attempted to take a sip (Hey Pepsi, need a plug, brah?).Without spoiling the films plot, it is pretty simple to guess. Yes it is centered around an Office Christmas party (go figure) but it is a delightful and hilarious film that should be added to any Christmas movie list you may have currently running.Get off the couch, get out of the office, put down the eggnog and stop talking to your creepy cousin. Go see this film right now and join in on the quotes. This has to be the funniest film of the year."
    },
    {
      "rating": "7",
      "text": "How do you rate these types of romps? If they were entertaining, made you laugh/chuckle, then they succeeded. This type isn't about acting prowess and the such, it's about fun with a nut of a moral in there. And it's geared towards those that prefer juvenile sex humor. It features an all-star cast of mostly B and C level celeb-actors, including the token SNL alumni that seem to be in all these films lately."
    },
    {
      "rating": "7",
      "text": "This was a really fun movie, especially if you like TJ Muller's jokes and all that. Even though it was not as fun as I expected and they did put too many good stuff in the trailer, I still found it quite good."
    },
    {
      "rating": "9",
      "text": "What a fun holiday delight this film is. The brilliant ensemble cast headed by Aniston, Munn, Bayer, Bateman and Miller, provide performances that are engaging and entertaining, within a storyline which provides many moments of hilarity. The script is excellent, and whilst it takes a little while to get moving, the momentum builds to a joyful conclusion that will have you laughing uproariously, and eminently quotable one liners which are set to become part of your lexicon from the moment you leave the theatre. Just what a Christmas movie should be. 8.99/10"
    },
    {
      "rating": "7",
      "text": "A Dirty, Intrepid & Indecorous Gift For UsGenerically, major film studios follow a satisfactory pattern of releases with each of their films around year; depending on the genre, they serve certain periods (social, political, economic, holidays, etc) which coincide with the issues to be addressed in the movie, achieving a considerable increase reception and box office is concerned,—dollar bills to be more specific.— Valentine's day is full of insipid romantic movies, April and May share fantasy and action motion pictures, the fantastic summer is favorite season for dominant 'blockbusters', the month of July (4th) is useful for social and political film, autumn serves powerful dramas, October fills movie theaters with horror movies, and November and December (Christmas and New Year) is the perfect time for abominable familiar films.In these agreeable seasons and within the genre, typical American parties are usually starting point to develop the plot of many films of this kind. This recurrent material applies in all situations, from wild college students—brotherhood—(\"Neighbors\") to high school boys out of control (\"Project X\"), from fallacious husbands and boyfriends (\"Hangover\") to disoriented sisters (\"Sisters\"). Crazy American celebrations are almost a requirement in modern comedies. Around this matter, \"Office Christmas Party\" comes undone with a first-rate comedian cast, directors and writers specialized in this area and one holiday really unique. Insufficient Zenotek's branch in Chicago will convert into major Christmas' nightclub.The president of an IT company—Carol Vanston (Jennifer Aniston)—decides to do a very large employment reductions and later closing Chicago's subsidiary down, nevertheless, there's one way to prevent this work tragedy. Her puerile half-brother —Clay (T.J. Miller),— Manager and Chief Technical Officer—Josh Parker (Jason Bateman),— and Engineer-leader of an innovative project around wireless fidelity—Tracey (Olivia Munn)—must incite to financial giant—Walter Davis (Courtney B. Vance)—to work with them. For this one, they decide to invite him to—previously cancelled—office Christmas party and so get to persuade him to accept. Nonetheless, and true to form, things get out of control and that objective and peaceful celebration will turn into a truly tremendous event of drugs, alcohol, and sex.The script was conceived by six people—a very unusual number in this type of movies—: Justin Malen, Laura Solon, and Dan Mazer are responsible for creating the dialog of the characters while Jon Lucas, Scott Moore, and Timothy Dowling are who sketched the story in general. They employ modern technologies as the drive motor in the story, even so, setting cardinal purpose of Christmas aside. Something sad is that film's objective was achieve keeping the company on feet and not enjoy a traditional Christmas period, although, as I said, Christmas is a simple wrapping. The screenplay also presents a social and labor comment in the treatment of its characters, although the unreal plot doesn't fit into a sensible and realistic mind, it can design quite common roles in working life. With regard to lines of the dialog of the actors, you can see that they manage to generate—why not—guffaws with influence of pop culture, however, it does not armor itself from using the narrative comedian clichés of the genre. That imperfection in screenplay is fortuitously compensated with the real employees.Watching the trailer and advertising for the film, what calls the most attention is imagine what the experienced cast can do with a magnificent plot. Most of them have already gained experience in this field—in acclaimed \"SNL\" or comedy movies,— which made the way more simple for the directors, who gave them free rein to extemporize, the result of this is the effective management and funny gags. Like all motion picture, some actors and actresses stand out more than others, such as Miller and McKinnon.Although \"Office Christmas Party\" is not 'tour de force' within comical subgenre and as is periodic with this kind of film, exciting marketing sells a face entirely different from the real—do not bite off more than you can chew'—, it can be a refreshing and extremely entertaining option in volatile commercial cinema showtimes. Christmas tree has made a small and dirty gift in cinemas around the world, and even though it does not have a heart as tempting as its wrapping, this movie instinctively entertains you during its all 105 minutes—it deserves one award for being \"the comedy film that manages to keep its enjoyable pace throughout its (extensive) duration\"—."
    },
    {
      "rating": "6",
      "text": "The cast is solid but the execution is anything but. Office Christmas Party is a muted raunchy comedy that has all the promise of a hilarious, impossible experience that outdoes itself minute after minute. However, instead of writing a bunch of hits, the movie ends up being a few laughs surrounded by a fair amount of filler. I laughed enough and enjoyed it enough to not feel like it was a waste of time but I definitely don't need to see it again. Get a few drinks in you and this will probably be a little but funnier for you."
    },
    {
      "rating": "4",
      "text": "The title pretty much says it all: In an effort to keep their branch open, the management of a high tech firm throws a massive bash to impress a potential client. Mayhem ensues, but with few hilarious antics or genuine laffs. Despite a cast with established comic skills (Jason Bateman, Jennifer Aniston), the only really funny person was Kate McKinnon (T.J. Miller manages a few moments of his lovable dimwit humor). The energy never lags and the large cast features a number of potential new talents, but this script does little to showcase their skills. Despite the promise of hilarious havoc, this movie is a party crasher."
    },
    {
      "rating": "5",
      "text": "Against all odds, the party's on!The title itself a short and sweet synopsis. What happens in the film is a chaos during partying and with the crazy twist and turns, the story head for the conclusion. There's no any difference comparing it with other Christmas party films you had seen. Just the cast and scenario changed, that's all. While the setback for his company branch, the head of the office decides not to compromise on the Christmas celebration thrown to his employees. At the same time, he has to pursue a big client who could save the office from closedown. So his intention turns to impress him at all the cost.Seasonal films like this should be watched when it comes out, which is during the Christmas/December. Because it will achieve a better result with us since we're set for the mood. I missed it then, but watched off the season and even though, I quite enjoyed it. Yeah, this film is not any good, yet nothing stopped me from having some fun. The comedies are cliché, but the actors were good. Fast paced narration, over hundred minutes long. Shot most of the film in a building, there's a little outdoor adventure. Overall, worth a watch, even though a below average film.5/10"
    },
    {
      "rating": "6",
      "text": "If you go on cheap ticket night (Tuesdays here, and you realize this is a dumb movie. You'll enjoy it, don't think of it as anything more than a popcorn movie."
    },
    {
      "rating": "4",
      "text": "Despite a great cast, the film flounders in almost all areas. It's simply trying too hard to be funny (although what can you expect with such a ridiculously dull premise). A few chuckles arose from the eventual mayhem, but there really isn't anything of substance here."
    },
    {
      "rating": "6",
      "text": "This was hillarious. Lots of laughs throughout the entire movie. Not going to be a cult classic or even the best comedy of the year but for sure is money well spent. All cast was having a good time but Aniston totally nailed it. That beautiful women deserves better roles!"
    },
    {
      "rating": "0",
      "text": "This was a successful movie at the box office. Why ? Just why ? It should have flopped hard !!Some movies deserve better than this one."
    },
    {
      "rating": "8",
      "text": "I was very much expecting this to be an immature, juvenile, stupid film that I'd turn off after 30 minutes. I was very pleasantly surprised! The peak of the party does get kind of juvenile, but this is no fluff piece. It's a clever, well written, funny, entertaining film. All star cast and great performances. I'll definitely be re-watching this one in future. Glad I gave it a chance!"
    },
    {
      "rating": "7",
      "text": "Big fan of Christmas movies and Jason Bateman. This movie is better than the reviews and it had its moments."
    },
    {
      "rating": "5",
      "text": "With a cast of comedy heavyweights, even they can't save this movie from it's cliched-ridden, lazy script."
    }
  ],
  "recommendations": [
    "think_like_a_man_too",
    "sisters",
    "neighbors",
    "wanderlust",
    "johnny_english_strikes_again",
    "night_at_the_museum",
    "keeping_up_with_the_joneses",
    "jumanji_the_next_level",
    "the_night_before",
    "logan_lucky",
    "tag",
    "a_million_ways_to_die_in_the_west",
    "the_second_best_exotic_marigold_hotel",
    "palm_springs",
    "pitch_perfect_2",
    "game_night",
    "murder_mystery",
    "the_wedding_ringer",
    "night_at_the_museum_secret_of_the_tomb",
    "blockers",
    "neighbors_2_sorority_rising",
    "a_bad_moms_christmas",
    "the_family",
    "ghostbusters",
    "the_happytime_murders"
  ]
}