{
  "id": 3307,
  "title": "Okja",
  "starring": [
    "Tilda Swinton",
    "Ahn Seo-hyun"
  ],
  "runtime": 122,
  "genre": [
    "Adventure",
    "Drama",
    "Science Fiction",
    "Fantasy"
  ],
  "description": "A young girl named Mija risks everything to prevent a powerful, multi-national company from kidnapping her best friend - a massive animal named Okja.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pHlRr2MfjK77VIIAO7p0R4jhsJI.jpg",
  "categories": {
    "plot": 6.9,
    "acting": 6.275862068965517,
    "ending": 6.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.888888888888889,
    "funny": 7.555555555555555,
    "action": 7.428571428571429
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I didn't expect anything from Okja, mainly because I didn't like Snowpiercer and Netflix doesn't have a great track record when it comes to movies.But I watched it with an open mind, and it is simply a great movie. Behind the simple story of a little girl and her pig, there is a really complex movie with colorful, interesting, flawed and yet very relatable characters.When you see the relationship between Okja and the little girl, other movies like Totoro and Pete's Dragon will come to mind, it's the old tale of the friendship between the animal/mystical creature and a kid. Full of innocence, beauty, and wonder. But the twist here is that this animal is being bred to be eaten.I'm not a vegan, and I am still not a vegan after watching this movie. But reducing this movie to \"eating meat is murder\" would be completely stupid and plain wrong, I would remind people that we see the the girl eating fish and a grand father making chicken stew.Okja is not a real animal, it's an imaginary creature made of CGIs. This is not a documentary about cows going to the slaughterhouse.But this \"Super-pig\" that is Okja, is the catalyst for a lot of questions that we have today about our food. The movie is more about making people think about what is in our plates, how it got there, and where do you draw the line between an intelligent animal like a dog and a animal that is just food like a fish. About the tone of the movie, it successfully shows a harsh reality, but under the light of an excentric imagination. It's a movie where you laugh, cry, hate and think.And to me, it is all the marks of a great movie. I would add that some scenes are really not suitable for children though. This is more PG-13."
    },
    {
      "rating": "10",
      "text": "You would not believe how negative I was about this at first... I didn't even watch the trailers cause I just thought if it's more comedy then they're gonna ruin it but you'll never find any comedy better than this one this year and much much more including friendship, care and love for animals. 10!"
    },
    {
      "rating": "7",
      "text": "The fight against the nature and its commercialisation might as well be a shallow faux pas forward pass, the drama once again, saves the day.OkjaJoon-ho Bong merrily deconstructs the fame of Disney by exploring their own territory, without all the mushy-gushy romance. The result is surprisingly and equally challenging. Usually, when you are diving into a fantasy as such, the product comes out pure only when there is an unflinching promise delivered to every frame, character and element of that storytelling piece. But this project is standing against those theories. And not just for it repetitively grounds the rules with pragmatic structure of the \"fire caught in the forest\" property that an internet comes of. But also the unexplainable and yet vital change in genres that the films conjures.This sojourning structure that builds itself up unfortunately strips away the film into tiny snippets, little clips that never ever condones the previous or the latter format that it is bridged with. This alienated way of telling an emotionally driven story could have been only captured to its true essence by an experienced filmmaker as him. That is of course, not to say that he succeeds every time, all the way. But as mentioned it a testament of his skills to pull off an almost impossible heist that has multiple character played by multiple stars as them.It makes sense now that Jake Gyllenhaal would stay behind the action. The real action already had too much traffic both characters and plot wise. And which also explains why his presence, when entered, in the room, then will be a staggering bolt of thunder, not enlightening but delighting us and destroying the film's ethical morales. Okja maybe, tries too hard to not be that cliched Beauty And The Beast type of film, it may succeed but it undeniably is an effortful adventure, campaign, mission and expression of love- not between the lead character but the shady political deals."
    },
    {
      "rating": "6",
      "text": "While certainly a unique film watching experience, Okja struggles to blend it's satire with it's more dramatic moments. Swinton and Seo-Hyun Ahn are strong, but the rest of the cast is either ridiculously out of place (Gyllenhaal) or given little to nothing to do (Collins, Espacito, Yeun, Bostick). Despite once again creating a film that has strong production value and is beautiful visually, much of Joon-Ho's film is over the top, which takes away from the still somewhat effective and emotional message and commentary that the film was trying to portray."
    },
    {
      "rating": "9",
      "text": "Okja is a trully beautiful film. This is a rare and unique film that is a trully wonder to see. Some moements may not get you (it´s humor) but there´s not to much of it. Tilda Swinton and Jake Gyllenhall are really good, but the little girl Seo-hyeon Ahn is the one that stoles the show. It´s trully worth it, even if you only see it once"
    },
    {
      "rating": "6",
      "text": "I don't think the film was supposed to have an anti-meat message, or if it was, I wasn't bothered by it. I felt it was more anti-corporation (yes, that old chestnut again), which has been done to death and really is a waste of celluloid time. It's like being anti-sunshine, or declaring a war on terror – soundbite nonsense that has no hope of success. What I didn’t like about the film was the acting. The young girl was awkward and seemed ill at ease in front of the camera. Jake Gyllenhaal was just terrible and Tilda Swinton wasn’t much better -  they gave ham-fisted (pun intended) performances that were embarrassing to behold. Having said all that, I liked the big pig thing. He/she/it was cute, in a way that a hippo crossed with a dog would be cute. And who wouldn’t want an animal that craps on demand."
    },
    {
      "rating": "10",
      "text": "If you are a fan of movies that question tradition and authority, this is certainly a movie for you. Even though it is announced as the first vegetarian action film ever, it has a number of other political topics to offer such as the role of corporations and police officers in society, questioning today's state structure in general. That being said, I have to acknowledge the animal rights part as well and point out that it is surprisingly well thought out. Also, the emotion it brings is really inspiring. This movie is thematically something new on the scene and I am eager to see more like it."
    },
    {
      "rating": "10",
      "text": "Brilliant movie that depicts in a geniusly written analogy the destructive impacts of animal agriculture on the environnement (#1 cause of global warming) and on the animals themselves who go through countless mistreatments and inhuman acts."
    },
    {
      "rating": "9",
      "text": "'Okja' is as funny as it is dramatic and that balance works just fine for the movie. Also the message is just as important as we advance full throttle to a similar future."
    },
    {
      "rating": "5",
      "text": "Nothing special here.  An ethical message for the masses about food production and consumption, but delivered with such farce and outrageousness that it's hard to feel anything."
    },
    {
      "rating": "9",
      "text": "Thank you Netflix for bringing us this beautiful tale. Okja hits all the right notes, a wonderfully burlesque satire, a poignant critique of consumerism, a wonderfully human adventure of a little girl with no other motivation than to be reunited with her best friend."
    },
    {
      "rating": "9",
      "text": "I would say user rating are pretty low on this one, movie is great with its awesome production, direction and acting. Extremely entertaining and beautiful."
    },
    {
      "rating": "10",
      "text": "This movie is kind of a hot topic in Seoul these days so I felt I had to watch it. It really impressed me. The story is gripping and well told. Although the main character Mija is often silent her dedication and love for Okja shines through in every scene. It quickly evolved into a strong tale of friendship. There's a great mixture of humour, drama and some sad moments too. Netflix has a bad track record when it comes to movies in my opinion but I'd highly recommend checking out Okja."
    },
    {
      "rating": "9",
      "text": "Okja juggles tones successfully while delivering its thought-provoking message scrutinising livestock, without ever sacrificing action, adventure, humour, satire, and emotion."
    },
    {
      "rating": "10",
      "text": "Okja is a great movie that include deep inspirational concepts behind it.This movie makes you think about the things that are done to animals routinely in our life without being noticed by anyone"
    },
    {
      "rating": "4",
      "text": "There really isn't anything good about this movie. It's mediocre all around. Poor story, poor acting, poor directing. It's not particularly funny, it's not particularly interesting to watch."
    },
    {
      "rating": "5",
      "text": "The humor is cheap. The cgi pig is pretty impressive. I'm fine with the weird **** but a couple of characters go way overboard. Not a very subtle film. I liked the first two acts, the third one is just disappointing"
    },
    {
      "rating": "10",
      "text": "Causes viewers to reflect upon their very own lifestyle, all the while taking them on a rollercoaster of comedy, suspense, conflict and love. Totally worth watching."
    },
    {
      "rating": "1",
      "text": "At whom is this misbegotten Korean-American mashup aimed? Too simpleminded for adults. Not a kid's movie but scripted and acted like a cartoon. Besides, kids are actually smarter than this clumsy polemic. It is (unfortunately) consistent with the director's other films - from Memories of Murder to Snowchaser - although the pervasive flaws seem much more blatant here. The first act is sweet and beautifully composed but when the second act takes the plot downhill (literally), the movie goes with it. The actors (particularly Swinton and Gyllenhall) mug gratingly, infuriatingly throughout. Every semblance of nuance disappears. The bad capitalists are really, really bad. The good animals are really, really good. The dumb comic foils are really, really dumb. Just like this movie. May be the last Bong movie I bother to watch."
    },
    {
      "rating": "8",
      "text": "Given that this was from the director of The Host and Snowpiercer, which I both really enjoyed, as well as the intriguing cast and the hype surrounding its premiere at Cannes, I was interested in giving this view. I'm happy to say that there's definitely a very imaginative and moving story to be told in this film. Sure it may be like several other films in the past in which a child befriends a large creature or thing and has to try and protect it from the government, military, etc., but the performances from the cast consisting of an always reliable Tilda Swinton (taking on dual roles in this one), Paul Dano, Lily Collins, Jake Gyllenhaal, etc., as well as its unique and lively imagination, spirit, and effects really make it worth checking out. Overall, definitely one of Netflix's better and worthwhile films in recent memory."
    },
    {
      "rating": "6",
      "text": "I would like to point out that there is a gross mistranslation/localization of Steven Yeun's line around 58 minutes in - before he jumps into the river, he introduces himself again with his Korean name by saying \"by the way, my name is Koo Soon Beom\" but the English subtitle on Netflix says \"Mija, Try learning English. It will open new doors!\" I find this to be especially patronizing given the situation Mija is in (she doesn't know what is going on because of course, she doesn't speak good English at this point and is deceived by the ALF group). I wonder what kind of message Netflix is trying to convey to its audiences with the translation."
    },
    {
      "rating": "6",
      "text": "I just saw this movie and I was all ready to write a scathing review, despite my ingoing sympathies for both animal rights and dignity and charming Korean actresses, but I have to say,  Jess_Hill already nailed it. So, what she said (see below)."
    },
    {
      "rating": "5",
      "text": "As the movie opened, I took in the surreal mood of the film, hoping for an enjoyable two-hour adventure, but then, at opening minute number five, the mood was instantly demolished with the utterance of the \"mother-of-all-curse-words\", such utterance having no place in what could have been a \"full-family-viewing\" event.  As anyone who consumes animal flesh must undeniably understand, the processing of live animals into edible proteins, fats and minerals is an intensely invasive process which begins with the taking of the life of an animal in order to create a food-stream to support the nutritional needs and to prolong the existence of other carnivorous and omnivorous animals.  While there are limitless alternative non-animal-based food-streams which provide identical or superior nutrition, food choices are based upon availability and individual or group preferences.  The overstated theme of this film was to supposedly provide an affordable and efficient long-term supply of single-breed animal-based food products to feed the populations of starving people worldwide.  While the conflicts which ensued from kidnapping the Super-Pig were easily anticipated, the frenetic, nearly non-stop action and dialog was enjoyable, with the exception of the continuing objectionable language.  The win-lose, lose-win, win again, lose again struggles by the apparent heroine and the clumsy ALF were sufficient to comedically illustrate the extremes by which individuals and groups must drive themselves in order to quash their apparent nemesis; a good lesson to be learned by the youngsters, were it not for the cursing.  As the drama continued and the finale lingered just beyond the not-too-far-off horizon, the terminus was unsurprising, but as a \"full-family-viewing\" event (no bad language), it would have had far greater appeal with viewing youngsters dizzily running about the viewing room and jumping for joy, thankful that at least one such animal, out of the countless millions slaughtered and consumed, would spend an eternity in peace, friendship and life everlasting with her \"foster parent\"."
    },
    {
      "rating": "5",
      "text": "This is a film which truly embodies a quintessential leftist ideology wrapped up in a ham fisted storyline that beats you over the head with its agenda relentlessly; the messaging so painfully flogged that it constantly throws you out of the film with the sheer ludicrousness of what you're seeing and the manner in which it is delivered. The tone oscillates wildly, the creature design is great but poorly rendered, it's too long, and for god's sake don't show this to children. There were some delightful moments in the first act, but the jarring script quickly shatters the illusion that this might be a whimsical cinematic journey. I don't know who this is for, and it feels like a sadly lost opportunity as the reliance on one dimensional caricature and a complete lack of subtlety utterly undercut what could have been an interesting and unique film. The phenomenal cast are done a disservice by the incongruence of the tone and message; Scooby-dooesque hijinks and childlike moments are interlaced with brutal cruelty and violence, but rather than providing a counterpoint or foil, this undermines what should have been an important and powerful message as the film becomes a poor parody rather than the commentary it seeks to be. 4.57/10."
    },
    {
      "rating": "7",
      "text": "Okja is a film that has the task of balancing several different tones throughout the film, and for the most part it does it well.  There are times the film feels a bit scattered, but I had a good time with Okja and the ending was one of sadness but then joy.  B+"
    },
    {
      "rating": "3",
      "text": "With this much intellectual prowess, CGI creativity, financial largess, and directorial talent, the producers should be ashamed they released this poor an excuse for a film.  Only the music excels, and boy does it.  the plot is not original, the performances pedestrian, and the continuity of a broken glass window paine.  there is a much simpler, beautiful movie in there somewhere, but it got lost a long time ago."
    },
    {
      "rating": "9",
      "text": "I love this show. It is a cross between my two favorite things. It is across between Old Yeller and bacon.Great characters. Good plot. Visions of bacon."
    },
    {
      "rating": "2",
      "text": "I did not enjoy this movie at all. Not just the plot, but the tone and flow was nonsensical. There was no overall theme other than \"Farmers are bad.\" Yes, meat processing can be ugly to look at. I will still eat meat. Watching myself poop would be disgusting to watch as well. that does not mean I will stop pooping. Besides, we are talking about stupid animals. They are things with no intelligence. Their purpose is to be made into food. I feel no remorse for watching the most efficient way to create that food from them."
    },
    {
      "rating": "3",
      "text": "I came hoping this was gonna be a great movie..a didn't actually know anything about the movie, didn't even watch any of the trailers....so imagine my surprise.It was a 120 minute propaganda video...basically... OMG guys... the Cringe..... from the relations of this young woman that doesn't seem to study, have friends or communication with no one other than Okja... its never explain why she thought the creature belong to her...when it was given to their farm by a company for a contest... so it was imply that it was temporary... so I don't know what was the deal there... then you get the worst thing in the movie...yep... white knights to the rescue...white American mails and Female...just one... come to the rescue of the animal and the young Japanese woman...and then it began...the propaganda...at that point I realize that I was seing like 5 movies in 1...1...your animal right activist movie2...your safe the environment Green movement movie.3...an anti-GMO movie4...an anti entrepreneur movie (because anyone that actually has something stole it from a poor starving child somewhere) even when the guys (Terrorist) calling themselves ALF (I **** you not) are obviously loaded to travel around the world with equipment causing all sorts of damage that would put ISIS to shame...also the girl and grandfather have a farm...so they are also stealing from a starving kid somewhere in the world.5...and you \"Don't disturb nature...so its better if you don't exist so nature has a chance\" you know? the \"I hate humanity movie even though I'm human\"all the stereotypes...actually surprise that they made the villain a woman...the acting was exaggerated and over the top...i'm surprise of the B movie level of acting from some of the guys acting here like Gyllenhaal.save your time guys watching something worth it...olso forgot...6... the movie where all the adults are morons and only young people and kids are geniuses...yeah...that kind of movie."
    },
    {
      "rating": "0",
      "text": "this was an UNWATCHABLE piece of garbage. unless you're pretentious, and have time to waste... do yourself a favor and skip this one. wow wow wow. there's not getting those 2 hours back~"
    },
    {
      "rating": "3",
      "text": "This was really weird. High profile actors in a crappy korean film. Uninteresting scenes were 15 min too long. If this was supposed to make me feel bad about meat production, it failed completely. Looking forward to those pork chops tonight!"
    },
    {
      "rating": "3",
      "text": "Unfortunatly this film with a great idea behind it. Isn't all in English, it's part English with the rest being Korean. While of course this is accurate since the film is set there for some time, its very distracting having to read subtitles rather then taking in the visual medium."
    },
    {
      "rating": "7",
      "text": "I really wanted this film to be more than a \"slaughterhouses are bad and animals are special movie\" but it adds nothing to any of the feelings or thoughts already expressed on the matter. Don't get me wrong, it's an important message and it's well presented here, but it's done in a mostly darkly cartoonish way that won't radically alter one's perspective. But it is good fun.The movie wants you to care about all the pigs but really it's just Okja that matters. Not to mention it seems to chicken out after it begins to give a conscience to the food factory. As great as saving beautiful animals is, the whole idea behind these pigs is to eliminate world hunger, so like, what does the movie have to say about that moral conundrum? Eh, not much. Okja cute and the girl is too (though she's so one-dimensionally obsessed with Okja she's hard to really care about)."
    },
    {
      "rating": "7",
      "text": "My feelings for the first half of Okja vs the second half make me feel as if I have feelings for two separate films. In the first half of the movie you have delightful absurdist Wes Anderson-esque comedy that introduces the main character and the adorable Okja well. The second half of the film (namely once they get to America) seems falls flat for me however. While the film as a whole attempts to satirize (mostly) industry and (to a part) animal-rights activists it doesn't do either in an effective enough way. It's unclear if the Lucy character (one of the corporate characters played by Swinton) is actually genuine or not. If she is it's a good even-sided view of industry if not the portrayal of industry in this film amounts to a (albeit very amusing) smear of corporate practices and more importantly (or disappointingly) of scientists. The ALF (animal liberation force) is equally confusingly portrayed. In some ways the film clearly wants to poke fun to the organization with things like the member that refuses to eat due to his carbon footprint. Yet in other ways it makes them out to be these pure heros despite the fact that Dano's character beats on of the other ALF members at one point in the film. While the film is amusing and cute neither the ALF or industry is satired in a fair or clear way. This is unfortunate because the message about corporate farms is a good one by unfortunately it got somewhat muddled by the film's inability to take a side and also its inability to bring either side fully to light."
    },
    {
      "rating": "8",
      "text": "An enjoyable film about the relationship between a little girl and her big pig 'Okja'. The direction is outstanding, and the chasing scene in Seoul is truly thrilling and chaotic. On another hand, what truly stands out is Tilda Swinton's performance (I couldn't get my eyes off the screen every time the scene included her). A thought-provoking and multi-thematic piece of work, 'Okja' is a very nice watch."
    },
    {
      "rating": "8",
      "text": "The Ecoterrorists were a bit much, vegan terrorists are pretty annoying SJW jerkoffs, but other than that the movie itself was hilarious, heartfelt, and entertaining. Some of the action scenes, even something as simple as the mountain scene in the beginning really set the tone and bring to life the story. Acting is amazing here, even among the ecoterrorists, and while you'd think Tilda would steal the show, the main star An Seo Hyun is a treasure who plays the most self-determined girl I've seen in years on screen."
    },
    {
      "rating": "7",
      "text": "Okja is weird movie but in a good way    ."
    },
    {
      "rating": "7",
      "text": "Okja is a film divided into two parts; A first sight in a totally beautiful and innocent way, in her how things happen in a recorded way and at the same time cute and beautiful; Already on the second; When history has a critique in the industry, the heavy and sad afafix; And that takes an identity from the film; If a message from the movie was a second part; What when you have just written, then it is a good job, but it is makes a first part forgettable. How performances are very cute; Drama left over for only one or two characters, a film montage itself becomes a bum in the second half of the film; With a final bow fully extended and very caritaco; But leaving a small space for dramatization and reflection; A soundtrack also works only in the first part. Okja is a good movie but this division takes away some of its quality in general; In the first part is beautiful; In the second and sad heavy and can bring a little reflection to those who are watching ....."
    },
    {
      "rating": "7",
      "text": "Okja is a good film, with a really touching story aka the girl and the wonderpig.But it also has some serious problems. Gyllenhaals character is one of the most silly in recent times. And Swinton just manages to make the evil boss trustworthy, bus only just.See it with kids age 12+ for  good thing to do together."
    },
    {
      "rating": "7",
      "text": "Well shot sentimental effects strong movie about a giant genetically enhanced livestock product that connects to a young girl. While not wholly original, it's well shot with excellent direction throughout. Bong Joon ho's trademark humour keeps things light considering some of the heavier concepts at play."
    },
    {
      "rating": "7",
      "text": "I've got a lot of regrets in life, but eating meat while watching this is definitely one of them.\"Okja\" is cute with it's fair share of cartoonist moments. However, things escalate into madness quicker than you think. Making you never look at meat the same way again. Feeling like a one of those creepy Japanese commercials you find on the web. Besides the horror in the meaning, but isn't a story without wonder or spectacle. Basically it's a lot of things all in one.Not as hard hitting as \"Snowpiercer\", but still, there's nothing quite like it. Bong Joon-ho is proving to be my favorite living director.Oh and if 20th Century Fox decides to make a live action Simpson's Movie, please cast Jake Gylenhaal as Ned Flanders. Never thought about it until this little gem came out."
    },
    {
      "rating": "10",
      "text": "This is one of those defining stories after which, nothing is ever the same again."
    },
    {
      "rating": "9",
      "text": "The image on Netflix depicted a big Hippopotamus and that immediatelly made me think it was another Mowgli movie. But when I read this had been written and directed by Joon-Ho Bong from Snowpiercer I had to watch it. Similar to Snowpiercer, Joon plays with social critics, human emotions and constant mood changes. The cast is fantastic with artists like Steven Yeun (Walking Dead), Paul Dano (12 years a slave), Giancarlo Esposito (Breaking Bad), Tilda Swinton (The Hunger Games) and of course Seo-Hyeon Ahn who takes the leading role. Despite her age, I feel she was pretty amazing in transmitting that feeling of anarchy and carelessness for the new world.Okja is a mix of a family movie, social critic documentary and cult drama, so if you're into those three, definitely a catch. Otherwise you might find it bit too bitter. In any case, one of my favorites for sure."
    },
    {
      "rating": "8",
      "text": "entertaining, relevantly disturbing and has quite provocative ambition - is a movie with a brilliantly audacious message that deserves to be seen and remembered."
    },
    {
      "rating": "9",
      "text": "A very weird yet interesting film about the horrors of greed, power, and the meat industry."
    },
    {
      "rating": "5",
      "text": "Even though this film tears at your heartstrings at times, it is quite clear that there is an agenda the film tries to get across. It would not surprise me if many were to leave this film believing in the propaganda they had been told... Animal rights groups might be silly and fun to laugh at, but everyone in the food industry is down right evil. Don't let the cuteness of the super pig fool you (or it's questionable CGI disarm you). By the end of the film the anti-corporation message is made abundantly clear. Not even the amazing performances can save it from itself. D+"
    },
    {
      "rating": "5",
      "text": "It was an okay movie.But for Bong, it was poor.Cant give more than 5.And plus, Netflix movies all suck."
    },
    {
      "rating": "4",
      "text": "In the mountains of South Korea, the young Mija has been sharing a simple life for ten years, surrounded by nature, with her playmate Okja, a specimen of super pig, created in the laboratory by the multinational Mirando. When the Corporation shows up to take the animal back and take it to New York, where it will be crowned the winner of a television contest and then sent to the slaughterhouse together to be marketed on a very large scale, Mija is not there and starts in the pursuit of her best friend, encountering Mirando's intricate marketing plans but also a group of animal rights activists eager to denounce their abuses.This superficial fable directed by bong jon ho proposes a work of animal rights / environmentalist denunciation but ends up hiding a real emptiness."
    },
    {
      "rating": "7",
      "text": "Quite an enjoyable ride. The movie does try to play off as a sort of thriller/comedy but, although not as captivating as Parasite or as funny as Memories of Murder, Bong Joon-ho definitely made a movie to remember with Okja."
    },
    {
      "rating": "10",
      "text": "Bong Joon-ho never ceases to disappoint me. He still doesn't. Okja is one of his best movies ever made. The story is fantastic, the cast, ranges from Koreans like Ahn Seo-hyun, Choi Woo-shik, Yoon Je-moon to many Hollywood talents like Tilda Swinton, Jake Gyllenhaal, Paul Dano, Lily Collins, Steven Yeun and Giancarlo Esposito,... are super amazing. Totally worth watching."
    }
  ],
  "recommendations": [
    "chappie",
    "smallfoot",
    "the_good_dinosaur",
    "the_13th_warrior",
    "babel",
    "colossal",
    "the_boxtrolls",
    "raya_and_the_last_dragon",
    "lucy",
    "the_iron_giant",
    "downsizing",
    "avatar",
    "the_nutcracker_and_the_four_realms",
    "chaos_walking",
    "her",
    "the_lobster",
    "they_live",
    "ratatouille",
    "beowulf",
    "nerve",
    "tomorrowland",
    "crash",
    "no_country_for_old_men",
    "hugo",
    "apocalypto"
  ]
}