{
  "id": 33,
  "title": "Old",
  "starring": [
    "Gael García Bernal",
    "Vicky Krieps"
  ],
  "runtime": 108,
  "genre": [
    "Thriller",
    "Mystery",
    "Horror"
  ],
  "description": "A group of families on a tropical holiday discover that the secluded beach where they are staying is somehow causing them to age rapidly – reducing their entire lives into a single day.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vclShucpUmPhdAOmKgf3B3Z4POD.jpg",
  "categories": {
    "plot": 3.814814814814815,
    "acting": 3.3823529411764706,
    "ending": 4.533333333333333,
    "soundtrack": 8.0,
    "cinematography": 2.0,
    "familyFriendly": 2.6,
    "funny": 3.6666666666666665,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I thought the idea was interesting, but it got somewhat boring eventually. It lacked something basically"
    },
    {
      "rating": "5",
      "text": "A very interesting premise ruined by some bad acting, ugly cinematography, and some of the most atrocious dialogue I've heard recently. The dialogue is so on-the-nose with exposition that it treats the audience like idiots. A little subtlety would've been nice. The execution was just poor. On the plus side, I thought they had some creative ideas with having to do with the affect of time on the characters. Completely average film, I'll watch it once but never revisit it."
    },
    {
      "rating": "10",
      "text": "A very interesting movie! kept me wondering why all this stuff was happening up until the very end! definitely would recommend."
    },
    {
      "rating": "0",
      "text": "You’ve got to be braindead to think this is even a remotely decent piece of work… The script feels like it was written by someone who’s had zero human interaction in their lifetime, and when the characters deliver their lines, it feels like they’re reading them straight from the page for the first time. Altogether, it feels like a first draft error among all aspects that bring a film to life.The acting’s atrocious, the writing’s god-awful, the setting and beating sun wear out its welcome all too fast, and not one single event seems to unfold in a natural or convincing way.I felt a sense of relief that the end runtime was getting closer with each character’s passing."
    },
    {
      "rating": "2",
      "text": "The acting and pace of this movie pull away from what may have been a decent movie.  Even the twist can't redeem this film.  Do yourself a favor and skip this one, even once it is streaming."
    },
    {
      "rating": "0",
      "text": "This film is a perfect parody of itself, I felt like I had aged 30 years when leaving the theater. It gets way too on the nose to be meaningful. The acting is barely passable. The \"twist\" is nothing special at all. I enjoyed nothing about this movie, and I usually can at least have a good time with M Night flicks. Skip it!"
    },
    {
      "rating": "6",
      "text": "I didn't hate this. Felt like a long, Black Mirror episode to me, and that's not a jab, I liked it. Sure, I could nitpick it to death, and once you willfully pop the bubble in which it exists (fairplay, I nicked the bubble analogy from the New Yorker review; he liked it too), you've ruined it. But I enjoyed it because it almost demands you don't think about it too much. \"Soft eyes\" will help."
    },
    {
      "rating": "2",
      "text": "This movie was same as Shyamalan's other movies, only this was bad. The concept was cool but like his most of the movies the execution was average. Many things worked against the movie, especially the acting. None of the actors gave a performance that you would remember. Acting was neither average nor bad, it was worst. I am expecting Worst Actor and Worst Actress nominations and maybe winners from this movie.The concept was different but the reason behind the concept was too much simple. If the writer is making a story then he should have a strong reason supporting the story but like other stories, Shyamalan did bad work here. Shyamalan's stories are always different and unique but the problem comes with the reason he gives at the end of the story. Overall, this movie is just a mare timepass and you may get bored after half way through. But you can watch give it a try for it's different concept."
    },
    {
      "rating": "1",
      "text": "THIS MOVIE IS SO DISAPPOINTING AND A WASTE OF POTENTIAL. The characters deliver their lines like robots and the characters are so DUMB it's funny. This movie is so bad that it is a joy to sit through because you laugh the entire time!! You don't care about anyone who dies because the characters are not developed and have no personality. The character deaths are so random and sudden so when they die you just say WTF XD. This movie should have been a bit longer and should have developed their characters to have a personality so you are shocked and care when they die. They also should have stayed at the resort for longer for world building. Also this movie is SOOO PERDICTABLE. You know the bad guy from the start. Bad Movie But Fun To Watch"
    },
    {
      "rating": "0",
      "text": "IM JARIN!!!!!!Please be M Nights last. Embarrassing. Baffling. Unwatchable."
    },
    {
      "rating": "2",
      "text": "From the man who brought you \"The Happening\"...No spoilers cuz ain't nothing to spoil. Wish it had surprises, but ain't got none. Super weird, fake-sounding dialog. Super weird shots and editing.And doesn't make sense! You can see in the trailer, some people age way faster than others.  No explanation. You'll want your \"fifty years\" back, for sure."
    },
    {
      "rating": "1",
      "text": "M. Night stole money from me and I was duped by the intriguing trailer. My wife and I walked out of the theater before the movie ended. We have never done this before yet this movie was unbearable to watch. Moronic dialogue and horrible acting are what stands out within the first five minutes. It’s astonishing that a studio green lit such childish and elementary writing. Not a single actor/actress in this movie delivered their dialogues naturally either. I hate being duped out of my money."
    },
    {
      "rating": "1",
      "text": "One of most aggressively bad movies I've ever seen. A decent concept, ruined by horrible dialogue, direction, and acting. I can't believe they actually released it. M. Night doesn't seem to have a sense for how real humans talk or the kinds of things they would say. I find any positive responsee mindblowing. Vote no"
    },
    {
      "rating": "3",
      "text": "Feels like a bad episode of 'Lost.' Meh acting, bad dialogue, and weird character development make this film a very forgettable one. 'Old' parts from a good idea of putting the characters against their greatest enemy: mortality; but the way the story unfolds is borderline silly. And what was all that about with those awkward scenes and butt shots? Shyamalan keeps on disappointing."
    },
    {
      "rating": "8",
      "text": "Exciting because of the mystery and the original story. This film quickly manages to grab you through the unknown. Despite the cast that feels akward at times (especially Vicky Krieps as the mother) it is a film that knows how to hold your attention to the end. Maybe it was my cup of tea because of the setting reminds me of the series lost but it is a recommendation for the people who love thrillers in general."
    },
    {
      "rating": "8",
      "text": "An intriguing story that keeps you on the edge of your seat on what's happening on this tropical island, with of course the classic twist that m night shyamalan always brings to his movies, it's definitely worth a watch"
    },
    {
      "rating": "1",
      "text": "Stupid, lazy and boring, I guessed the ending in the first 5 minutes, and it just goes on with what you expect what would happen, i didn't fill any tension throw the whole movie, and i found my self looking at my phone,  The only good thing i can say about this is that the acting is ok."
    },
    {
      "rating": "0",
      "text": "What a mess.There is absolutely no logic the deeper we progress onto the movie, the storyline is messy, the actors are terrible and, worst of all, the dialogue is horrendous. The only positive thing that can be said of the movie is the location with a few beautiful shots of the beach and the set. Yet, the pointless and shameless stereotypes portrayed in this meh on paper production is derailing all the little appreciation we could have from that. Although I enjoy **** horror-thriller movies for how bad they can be (and a few actually become good), I fear there’s nothing of that sort with “Old”, Shyamalan’s 14th movie that hopefully can be his last."
    },
    {
      "rating": "1",
      "text": "Well back to back stinkers ... Pig then Old. We are so desperate to get back to theater watching that we tend to jump at the 1st chance to go see new releases. This comes close to having the most amateurish acting of any film I've watched. A total bomb ... couldn't wait for it to end."
    },
    {
      "rating": "9",
      "text": "Overall the film was very solid. Night seems to be returning to his original form. The twist worked for me and I know for some it won’t. But with that said still everything about this film kept me engaged and thinking the entire time. The beach was truly a horrifying entity."
    },
    {
      "rating": "4",
      "text": "For some time now, more than anything since The Village, I've believed with complete certainty that M. Night Shyamalan is a troll. A big one that enjoys to troll his audience, and many inevitably still fall into his game.I've long been tired of his style. That desperate search for a narrative twist that is on a par with what he achieved in The Sixth Sense.He's been looking for that ever since, even if he doesn't admit it.Since then throughout his entire filmography he has tried the same trick, and with the exception of Unbreakable and his two big studio films, in all of them, absolutely all of them, he has failed.Of course, with the considerable difference in quality. Amid the sober tone of The Village, to the miserable film The Happening ended up being, which continues to be the lowest point of his career. Even beyond Lady in the Water.Old is 100% the same. Shyamalan 101.He constructs an intriguing mystery that of course gets the viewer interested. That always happens in all of his films, but soon as they move forward like an hourglass, grain by grain everything deflates.Of course, the metaphor of time being our killer is super clear, and the fear and terror of our own mortality plays a role in it, but that's when the troll comes in and Shaymalan basically tells you: ''Ha HA HA I caught you''It's almost as if he has a compulsion to surprise the audience with a conclusion that it's supposed to be shocking and at the same time has nothing to do with the expectations created by them, and that would be laudable if those conclusions were at least satisfactory, but Old only reinforces that Shyamalan sucks to write endings and more intelligent dialogue."
    },
    {
      "rating": "8",
      "text": "This is yet another interesting thriller from M. Night. One with a premise that carries most of the movie. The actors play there parts well and realistically react to the horrors that are occurring to them. The movie does seem to slow down while all the characters make dumb choices that keep the movie halted. After a certain point you are just waiting for the inevitable to occur. Overall really unique and enjoyable."
    },
    {
      "rating": "7",
      "text": "Solid movie, kept me entertained the whole time. Wasn't too long and the concept was really cool"
    },
    {
      "rating": "0",
      "text": "Don't waste your time. 0/10 of actor play, 0/10 of storytelling. Worthless movie."
    },
    {
      "rating": "0",
      "text": "This is now the worst movie I've ever seen. Shyamala needs to stop making movies."
    },
    {
      "rating": "7",
      "text": "I've read alot of opinions on this film. I thought it was original, creepy and I liked it. The dialogue is laughable at times and it could have been executed better at certain points BUT when it gets going, it keeps coming at you. I'd recommend seeing it (when you can)"
    },
    {
      "rating": "4",
      "text": "The subject is already apparent from the title and any press/previews. A group of people ends up on a beach where they rapidly age. Since it’s written/directed by M. Night Shyamalan you can hope for a suspenseful approach and dark thrills, plus a surprise twist. The revelation was unexpected, but not shocking. The tension never manifests. It’s just a sci-fi mystery that’s only interest is watching how and when the cast will change. On the plus side, the beach is lovely and Shyamalan’s big-screen style keeps it visually attractive. Other than that, this is just a mediocre episode of The Twilight Zone. BTW, the director introduces the screening with a welcome back to the movies and he has a cameo as the van driver."
    },
    {
      "rating": "4",
      "text": "A fun and enjoyable film but isn’t very good. This feels like a M. Night Shyamalan movie in both a good and bad way. Conceptually, the idea is really interesting. There are a ton of cool ideas that are being tossed around here and some of them feel cool and others feel half baked. The cinematography is really great at points but the editing and some shots can be nauseating. The performances all ALL over the place. The mother is awful while Thomasin McKenzie is weird but the schizophrenic Doctor is great. It’s just weird that there is almost no consistency within the performances and writing. The moral implication of some of these ideas are really weird. If a child ages rapidly, do they have the concept of consent. I say this because one of the children that ages gets pregnant from one of the other kids. It’s really really weird at points like that. M. Night is known to have some cool twists, either really great or so bad that it’s funny, but this was fine. It wasn’t earth shattering but it was an interesting idea. Some of the dialogue is laughable bad at points and the film doesn’t always make sense. There is one person on the beach who has been there for a while but he doesn’t age like the other characters and it’s never explained. There is also an issue with how stabbing works in this film but that dives too much into spoilers about the film. This is definitely an entertaining experience and I would recommend watching this if you want a good laugh."
    },
    {
      "rating": "0",
      "text": "I generally like most of the Shyamalan movies, even the Happening had its good moments for me. But this one is just beyond redemption. It's so boring and bad it's barely watchable. Few good scenes are drowning in the cacophony of cringe dialogues and weird (in a bad way) plot."
    },
    {
      "rating": "5",
      "text": "I mean.... The poster gives away the whole movie. Decent but not great. The whole situation could have been avoided if they'd read the note earlier lol. Bad manners killed everyone. Still an interesting thought exercise if you want it to be about the changes a mind goes through as we age vs the changes we'd experience through our experiences. Whatever. It's OK"
    },
    {
      "rating": "8",
      "text": "Old, like most of Shyamalan's films, is a wild trip and incredibly nuanced with many lessons to learn and morals to absorb. The actors chosen for the roles of this film were spot-on and it was shocking but thoroughly entertaining as well."
    },
    {
      "rating": "10",
      "text": "Once again, M. Night delivers something that it is worth thinking about long after the credits roll. I think it’s one of his more interesting films, particularly the end twist. Overall, I enjoyed it quite a bit."
    },
    {
      "rating": "9",
      "text": "M Night Shyamalan."
    },
    {
      "rating": "3",
      "text": "Жуткая душнина, одно желание что бы скорее кончился, вся интрига раскрыта в трейлерах"
    },
    {
      "rating": "8",
      "text": "Shyamalan continues his positive streak that has been going on since \"the visit\" with this film that fully respects his style. Dazzling direction, absurd characters and grotesque elements. The plot twist in this case is not fully successful and does not do justice to the rest of the film. Despite this, the film is quiet great and is probably among the best of the director. The soundtrack is excellent while the italian dubbing is unfortunately rather poor."
    },
    {
      "rating": "7",
      "text": "M night shamalan has had a rocky array of films, but this is one of the better ones. With Old, M Night goes back to his roots and makes an interesting and captivating enough in the way that they leave the viewer on the edge of their seat. There are some moments that make the movie fall short of great, but for a 7, the movie packs in a good amount of good. I liked the idea displayed and the cast was great to fit the roles. I think the movie succeeds in the cast and ideas thrown around, but some of the execution is weak. 7/10"
    },
    {
      "rating": "9",
      "text": "M Night Shyamalan is a fantastic director. I do not understand why everybody hates him so much. Even his worst movie is still better than most other directors best movies including Spielberg. Old is no exception."
    },
    {
      "rating": "8",
      "text": "Holy baby Jesus and a can of beans this movie was actually really good.M.Night Shamababam did it again and showed us a pretty interesting concept made into a movie. I would've enjoyed it more if there was more backstory in regards to the characters that participated and I kinda disliked the fact that some of them were killed pretty fast and actually kinda stupidly. The acting was pretty great for the most part especially the kids actors.The effects were also pretty good and I wanna give a huge thumbs up for the makeup artists which probably did the biggest job of everyone in the movie since there were constant subtle changes in the characters in every scene. Ending was pretty great kinda reminded me of an entire SCP foundation story which is a big bonus for me since I love that ****"
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "0",
      "text": "Definitely, this script was written by a sexually frustrated junkie with a dumb brain; an actual film experiment went wrong! Well, these definitive vocabularies will describe the film: pathetic, dismal, dreary, heartbreaking, heartrending, melancholy, mournful, sad, saddening, sorry, tearful, asinine, balmy, brainless, bubbleheaded, cockeyed, crackpot, crazy, cuckoo, daffy, daft, dippy, dotty, fatuous, feather-headed, fool, foolish, half-baked, half-witted, harebrained, inept, insane, jerky, kooky (also kookie), loony (also looney), lunatic, lunkheaded, mad, nonsensical, nutty, preposterous, sappy, screwball, senseless, silly, simpleminded, stupid, tomfool, unwise, wacky (also whacky), weak-minded, witless, zany and depressing! An absolute bad example of si-fi and creativity and was definitely written by a sexually frustrated junkie with a dumb brain. The worst depiction follows a cheating wife talking like a three-year-old, a kid who impregnates another kid, a kid asking her mom to change her bra because her breast doesn't fit in. The most horrible part was a cardiothoracic surgeon who doesn't know anything about medicine, so it seemed! Yes, it was a si-fi movie but for instance an example like Angelman syndrome could led a person have Intellectual disability forever and now in this film you depicted a 5 year old developing the brain and understating the full functionality of the human body? Growing one's hunger for sex and blah blah blah, are you kidding me? It could have been described better with unique creativity. And with all this, was this film rated PG-13? What! I couldn't understand why was your camera shaking while filming the movie, was it because to add some special effects? Didn't work though! This is what happens when people don't use their brains anymore! It could have been an epic with the concept, but alas, this experiment was unsuccessful! Don't watch this crap will just frustrate you even further!"
    },
    {
      "rating": "5",
      "text": "Some good twists and bits of horror, but the writing is just so bad. One of his more interesting twists, though."
    },
    {
      "rating": "7",
      "text": "Would you murder hundreds of innocent people to save the lives of millions of people?If you like M. Night Shyamalan films, you will want to watch \"Old\".If you watched M. Night Shyamalan films previously, you wouldn't need to read reviews to know what you would be watching.  This isn't M. Night Shyamalan's best work - but, it is worth watching.  It is based on a French-language Swiss graphic novel \"Sandcastle\" by Pierre Oscar Levy and Frederik Peeters."
    },
    {
      "rating": "8",
      "text": "M Night will probably never reach the height of his career, with his brilliant The Sixth Sense, Unbreakable and Signs.  But he has a career resurgence as of late, and Old maintains that steady streak of quality, quirky thrillers that is his forte. It is surprisingly a heart rending affair and has a strong social commentary on how we approach 'old age' in this modern society."
    },
    {
      "rating": "2",
      "text": "Despite an interesting premise and a beautiful setting, The terrible acting by the cast and the wooden dialogue just tank this movie for me. It honestly made me wonder what M. Night was thinking when he was writing this but maybe next time he should have someone else handle the writing next time."
    },
    {
      "rating": "2",
      "text": "I don’t know why this movie has bad acting, worse dialogue and is truly insulting to the audience’s intelligence with its disjointed events. I feel that all of it on the borderline of being intentional with its silliness that I am not sure if it is a parody or not. Lastly, one of the main reasons I made this review is to say (Watching this movie really made me “Old”), I literally feel that I lost 50 years of my life."
    },
    {
      "rating": "5",
      "text": "Welcome to part XII of \"is M. Night Shyamalan in on the joke or is he being for real this time?\"Weirdness is most assuredly a part of M. Night Shyamalan's style. Even his best films can't seem to escape that one stray line or awkward beat that leaves the audience scratching their heads. At its worst, the weirdness can tank the film (i.e. \"The Happening\"), but ever since \"The Visit,\" however, the above question has entered into the picture with considerable intensity. Is it something he can just turn on and off or is he really being genuine 100% of the time? I have half a mind to believe it's not even a question anymore with \"Old.\" Even in \"The Happening,\" yeah, the overall feel is off, but the ratio of awkwardness is much more subdued, feeling more like an honest-to-God attempt at something higher than it really is. Here, the wackiness is so off-the-wall and rapid fire that I gotta believe there's been a concerted effort to voluntarily mug at the camera, so to speak. In any event, the result is far from boring, wholeheartedly preposterous and an unmitigated brow-furrower. Please bubblewrap M. Night Shyamalan. We need to keep him safe so he can keep making silly **** like this until the end of time. If he does have a genuinely good movie in there somewhere, though, I suppose it wouldn't hurt to see that too. Here's hoping he doesn't think this is one of those."
    },
    {
      "rating": "2",
      "text": "If you figure out the twist about an hour before its revealed its not much of a twist is it? Very predictable film, half the problem is that all the most pivotal and integral part of the movie are already in the lengthy trailer. As others have said, the script, dialogue delivery and interactions between actors are all very awkward and difficult to invest in as you watch."
    },
    {
      "rating": "3",
      "text": "Within 4 minutes I'd figured out the \"cautionary tale\" Shyamalan tried to sneak into the first act. The ending, whilst thought provoking, slightly, just doesn't live up to the build up.You know Shyamalan movies, they ALL have a twist, but when you're a one-trick-pony, your trick better be very, very good. And his trick aren't good, not since Sixth Sense. A long, long, time ago.The actors are all garbage, but its not their fault, the writing is worse, the characters reactions, or lack thereof, are laughable, they simply do not react in a way that someone would if this was actually happening to them.OLD is mediocre, there's just no other way to say it."
    },
    {
      "rating": "6",
      "text": "Torn between a 5 and a 6+Premise+Some creative deaths+Kids in adult bodies was convincing+Some characters coming to terms with death, living entire life in one day, however briefly, is melancholic-OMG the acting from the adults is so bad-There were like 8 warning signs that these people were going to be kidnapped/killed and they ignored all of them-Atrocious camerawork-Kiiiiiinda pedophilic-Lame twist-If M Night thinks his ending is \"morally ambiguous\" then he's a horrible person."
    },
    {
      "rating": "5",
      "text": "The lesson you can all take from Old is if you find yourself en route to a secluded location and your driver is M. Night Shyamalan maybe you need to rethink your decision and get the hell off the bus. I'll give it one thing, I definitely wasn't bored.A family travel to a tropical island for a holiday and discover that the secluded beach they are relaxing at for a few hours is somehow causing them to age rapidly. Naturally everyone freaks out and tries to find a way off the beach before they literally run out of time. I think I can speak for most people when I say the aging process is a real fear many of us have. No one wants to get old. So to base a movie on the premise of aging rapidly is a scary concept. Well at least I thought so. Based on a graphic novel, M. Night has taken an already scary idea and ramped it up to the max. When Prisca (Vicky Krieps) and Guy (Gael García Bernal) realise their children have aged by years in just a few hours panic ensues. It's ridiculous, cringey and the dialogue seems disjointed and a bit like everyone is just reading their lines. There's also the strange editing and close ups that just start to annoy you after a while. I feel Old has a great idea and it's well executed to a point but the more it drags on the more silly it becomes. It doesn't have the same \"oh **** moments that some other M. Night films have. There are a few laughs scattered throughout, only I'm not sure if you're really meant to be laughing at them. I didn't love Old but I didn't hate it either. It has its moments but overall it's not great. The performances from most of the cast seem bland and wooden. I feel this was close to being top tier Shyamalan but Old ends up being somewhere between The Happening and Split.Shyamalan is one of those film makers who really divides audiences, most of you will either love or hate his movies. Old isn't exactly his best but it's not his worst either. Look you get what you expect, the trailer sets it all up so all you have to do is get yourself into a nice air-conditioned cinema, sit back and enjoy this intense thriller. And if you didn't like it, that's fine, and if you loved it that's also fine. Like I said, Shyamalan's movies can be hit or miss, the only way you're going to find out is if you see it for yourself. Recommended for all the M. Night fans."
    }
  ],
  "recommendations": [
    "the_happening",
    "shut_in",
    "awake",
    "house_at_the_end_of_the_street",
    "better_watch_out",
    "the_twilight_saga_breaking_dawn_part_1",
    "the_mist",
    "bird_box",
    "countdown",
    "hereditary",
    "sanctum",
    "next",
    "dark_skies",
    "devil",
    "shadow_in_the_cloud",
    "chernobyl_diaries",
    "would_you_rather",
    "unfriended",
    "slender_man",
    "the_curse_of_la_llorona",
    "marrowbone",
    "unfriended_dark_web",
    "the_eye",
    "the_new_mutants",
    "the_bye_bye_man"
  ]
}