{"id": 2875, "title": "Old Dogs", "starring": ["John Travolta", "Robin Williams"], "runtime": 88, "genre": ["Comedy", "Family"], "description": "Charlie and Dan have been best friends and business partners for thirty years; their Manhattan public relations firm is on the verge of a huge business deal with a Japanese company. With two weeks to sew up the contract, Dan gets a surprise: a woman he married on a drunken impulse nearly nine years before (annulled the next day) shows up to tell him he's the father of her twins, now seven, and she'll be in jail for 14 days for a political protest. Dan volunteers to keep the tykes, although he's up tight and clueless. With Charlie's help is there any way they can be dad and uncle, meet the kids' expectations, and still land the account?", "releaseYear": "2009", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/kBGqhumfOuDCpIErICWPHcXNvah.jpg", "categories": {"plot": 4.0, "acting": 2.4545454545454546, "ending": 4.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 4.6923076923076925, "action": 10.0}, "reviews": [{"rating": "2", "text": "With the start of Vicki's prison term nearing, the environmental activist's two kids need a babysitter while their mom does time in a state penitentary. It's a good thing that mom's one night stand wrote. Of all the people in the world, who better than your shotgun husband, a man you divorced after the liquor turned to pee and never saw again in the proceeding seven years, to feed and dress your flesh and blood. Money, notwithstanding, this man was a twenty-four-hour husband, but that's the movies for you. \"Old Dogs\", aside from being stupid, is also, formally, one of those films where childless professionals discover the joys of parenthood after pursuing successful careers in their respective fields. Robin Williams plays Dan, the dad, and John Travolta plays Charlie, the unwilling uncle-type; they're sports marketers who, in one uncomic comic scene, smear bear poop beneath their eyes by accident, then inexplicably, leave it on, as if both men forgot that animal excrement is gross. As Dan, Williams seemingly returns to those habitual heartwarming roles that moviegoers thought he had sworn off from taking after his career redefining performances in Mark Romanek's \"One Hour Photo\" and Christopher Nolan's \"Insomnia\". This fondness for excessive heartrendering(or is that heart-bludgeoning) theatrics(five words: enema bulb as faux-nose) carries on, but only ostensibly so, as in one scene, where Dan, dressed as a king, has tea with his princess-costumed daughter, which on closer inspection, avoids saccharine sweetness Curiously enough, Dan is in a full-bodied puppet suit, and under Charlie's control. The scene plays like a cry for help. After all, somebody is making Williams have this tender moment with a child actor. There's some anger here, dressed up as slapstick comedy, in which Dan maims a hand model's hands, and Seth Green's balls. And as for Travolta: Has it really been almost thirty years since he slapped around Debra Winger in \"Urban Cowboy\"?"}, {"rating": "0", "text": "This movie.......this movie should be renamed ouch my balls. Yes like that show on Idiocracy. Becuase thats all it was. Painful slapstick humor. This movie is bad. I mean it. It is awful. Its not just the fact that it was even worse than WIld Hogs. Its not just the fact that it has no plot. Its not just the fact it has no character development or even the fact that the jokes are not funny at all. The worst thing about this film is the wasted talent. A movie must be awful if it has Seth Green, Justin Long, Robin WIlliams, John Travolta, and Dax Sheppard, and it still fails to make me crack a smile. Even more idiotic is the fact that they are fixtated on dogs in this movie. They have all these dogs in scenes that there should be no dogs just for the reaction shot. Like when somebody says something odd and the dog looks up and makes a noise. Hey, I have an idea for a drinking game. Take a shot every time a dog has a reaction shot. OOOOHHH even HARDER drinking game. Take a shot for every scene in this movie that sucks...I'm sorry but DIsney, you need to try harder. I saw Up. I saw Bedtime Stories. And I saw Princess and the Frog. I know you guys can make a decent movie if you try. So please, next time, put some effort in it."}, {"rating": "1", "text": "Who says Robin Williams and John Travolta aren't comic actors? I did laugh in sympathy."}, {"rating": "5", "text": "I admit the movie has big flaws, but in the end its a heart warm family movie with Travolta and Robbins on the run."}, {"rating": "7", "text": "Took my 12 and 7 year old grandsons to see it. They gave it a hearty thumbs up. I thought it was OK. I think the critics may have forgotten it wasn't intended to entertain old critics."}, {"rating": "1", "text": "Trust me: This is a bad, bad movie."}, {"rating": "8", "text": "My husband & I enjoyed this movie & thought it was funny. The whole theater was laughing during the whole movie."}, {"rating": "0", "text": "A total train wreck."}, {"rating": "1", "text": "Wow. I've never seen such a disappointing movie ever. Travolta and Williams fail to get any laughs from adults or kids. Bernie Mac, you could have gotten a better farewell. RIP bernie"}, {"rating": "10", "text": "Rather than be boring and agreeable like the rest of you who don't appear to have an original thought among you, how about you go make a better movie. Old Dogs was light and funny, the way I am sure it was meant to be. Any of you 'expert critics' earning the same bucks as Travolta in the brilliant movies you have made lately?"}, {"rating": "10", "text": "A cinematic tour de force. A masterpiece that will eclipse all other films and revolutionize the industry. May seem a little early but..... I smell OSCAR!!!! Watching this was like seeing the face of god!"}, {"rating": "2", "text": "A little part of me died having watched this film. All these positive user reviews from John G etc - which PR or movie company are you working for guys? Seriously - you are all bogus and your reviews are paid-for bogus rubbish."}, {"rating": "10", "text": "This movie really makes me laugh!! Is for enjoying with the family."}, {"rating": "0", "text": "A revolting excuse for a \"film\" which could only be recommended to the intellectually handicapped."}, {"rating": "5", "text": "I didn't see this movie so I am giving it the most neutral rating I can. I would, however, like to address Fallan B's comments below. This individual berates those who gave this movie based on the idiom: \"Lets see you do better\". Are you kidding? Under this premise, the only ones who can dismiss a movie are actors and directors. Heck, the only ones who can PRAISE a movie are actors and directors. So, if my doctors royally screws up a diagnosis, I habe to keep my mouth shut because I am not a doctor? This is rubbish. Movies are NOT made to be viewed only by directors and actors; they are made to be viewed, AND PAID FOR, by the public. SO yes...our opinion sure does matter, whether it be for or against. The idea that we can only criticize a movie if we are a wealthy actor or director is a lazy and juvenile argument."}, {"rating": "10", "text": "This movie is hilarious!!!! How do they rate The wild things a high review and this a bad review is beyond me. Some people truly are upside down. This movie made me laugh so hard I almost gagged!!!! Rent it, you won't regret it..."}, {"rating": "10", "text": "I loved this movie because it had a Gorilla, Recommended!"}, {"rating": "10", "text": "I might be the only idiot around. But I think the movie was excellent. Good job guys!!!"}, {"rating": "0", "text": "The. Worst. Ever."}, {"rating": "10", "text": "This is the best movie I have ever seen. this is great. John travolta was like grease lightning."}, {"rating": "8", "text": "An enjoyable way to spend 88 minutes with my granddaughter. It was full of good old slapstick humor (a la The Three Stooges). A good family movie."}, {"rating": "10", "text": "I found this movie to be hilarious! My mom and I both loved it, and it was refreshing to watch a movie that had no curse words at all."}, {"rating": "9", "text": "I loved this movie. I seem to always love the movies the critics hate."}, {"rating": "6", "text": "It sure as hell isn't a one star film. I'd give it a 6/10. It was a decent family film with some genuinely funny moments in. At least it wasn't as boring as something like 2001, with straight tens. I watched it with my family and it was a pretty nice film to watch. Innocent enough, with plenty of bits of subtle adult humour. It's hardly an oscar-worthy film, but I get annoyed of people jumping on the bandwagon without even watching it, based purely on reviews. You may as well give it a try."}, {"rating": "0", "text": "Old. Dogs. Uhh. OLD. DOGS.  UHHHHHHHHHHH.Old Dogs. **** in your mouth. Old Dogs. **** in your mouth. UHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH"}, {"rating": "1", "text": "Seth green.check Big giant gorilla-check.kid on the toilet farting check. sounds like a real winner dosen't it. This film might as well came out of a dog, because it sure smells like it"}, {"rating": "2", "text": "This truly is a bad movie when compared to the moving pictures that movie makers spend hard time making! Sometimes movies need not to be made because they do not portray a purpose!"}, {"rating": "4", "text": "Old Dogs are put down.\rThe movie easily could have been horrible but just becomes painfully average. As a family movie it succeeds with some clever jokes, but by the end it collapses under a faulty plot."}, {"rating": "1", "text": "Yes, the movie did elicit a chuckle or two from me, but I still have to wonder what Williams and Travolta were thinking when they accepted the roles for this insultingly stupid movie."}, {"rating": "9", "text": "I thought it was super funny."}, {"rating": "0", "text": "I am beginning to wonder why I can't rate something with ZERO stars.  This movie would have definitely be eligible.  Quite possibly the longest 88 minutes of my life."}, {"rating": "8", "text": "While this movie may miss a few marks it's still enjoyable, bringing humor, and a surprisingly touching story to the table, I had a blast watching this, and while there are a lot better movies out there this is still one I will recommend."}, {"rating": "7", "text": "Is it supposed to be an award winning comedy? No of course not, but it is a clean family comedy that delivers all sorts of slapstick and cliche ridden jokes...and guess what if you take it as such it works."}, {"rating": "3", "text": "It's not overwhelmingly horrid -- like most Disney family comedies tend to be -- but it's certainly far from even mildly diverting. Pros: John Travolta and Robin Williams are as charming as they always are. Cons: As charming as Travolta and Williams are, the acting is as dull as the film is itself; overwhelmingly generic; overly cliched; lacks laughs and heart."}, {"rating": "0", "text": "If someone likes this movie, they should be considered dangerously stupid and avoided at all costs. If you happen to encounter a fan of this movie you should immediately perform a citizen's arrest on them for the good of public safety. After you have successfully handcuffed the brain dead 'movie' 'fan', you should contact the authorities as soon as possible. If the fan begins to speak (surprisingly, some of them can talk) cover your ears. Failing to do so may result in permanent brain damage. If you find yourself having to travel through an area heavily populated by 'fans' of Old Dogs you need to bring the proper equipment. Sound cancelling headphones are a must. Defensive weapons are also useful. Multiple daggers may also be required. If you find yourself surrounded by 'fans' of Old Dog, do not panic! Simply cup your hands around your mouth and yell in several directions. The echoes will confuse them and they will become disoriented. Use this opportunity to cut their hamstrings and escape. Though rare, occasionally they may attempt to pursue you. If this is the case, quickly gather a handful of sticks and rocks and arrange them in a line between you and the 'fans'. Typically they will become so frustrated by this minor obstacle that they will often spontaneously burst into flames. If your skin should come in contact with a 'fan', call poison control. While waiting for the ambulance you should treat the infected area with bleach and gin. If no bleach and/or gin is available, amputate the infected area and pray for god's mercy. If you should accidentally view any portion of the 'movie' Old Dogs the only known antidote is the blood of a Dodo bird. Unfortunately, the Dodo is extinct in our current timeline. Not to worry, as these is a solution. Simply build a time-machine and retrieve a sample. In fact, forget the sample. Just use the time-machine to stop yourself from seeing this movie."}, {"rating": "3", "text": "It only had 2 or 3 good laughs. It had potential to be a great comedy but it is plagued with too many problems. Travolta and Williams made the foolish choice to be in this movie."}, {"rating": "3", "text": "So cheap, tired, and stale that even its two likable lead actors can't save it."}, {"rating": "8", "text": "It was funny i think, especially when they thought, they were grandpas, and when they thought that he had got a \"pee pee\" :D................................................"}, {"rating": "1", "text": "You know, I had actually forgotten this movie existed until doing this review. As I'm running through 2009 and thinking \"wow, so many great films that I loved as an 11-year old. I'd love to go back to 2009,\" I came across \"Old Dogs\" and immediately said \"Oh, right...that exists.\" Trust me when I tell you, \"Old Dogs\" is awful. Even with stars John Travolta and Robin Williams headlining it, the film is dull, boring, painfully unfunny, predictable, and all-around bad. This is another case where my only possible praise is that the film is 88 minutes, but that's 88 minutes you'll never get back. Oh, and the actors at least TRY. Not that their performances are GOOD, but at least they try to save this stinker of a movie. Trust me, this film is an atrocity, and you WILL NOT want to watch it. Just ignore it and move on. Please."}, {"rating": "6", "text": "The movie wasn't that funny and it was pretty stupid, but it was entertaining enough and it was decent enough for a family flick.It's not the best family movie around, but if you want some brainless entertainment then, you may like it."}], "recommendations": ["thunder_force", "the_change_up", "a_million_ways_to_die_in_the_west", "night_at_the_museum", "grown_ups", "ted", "zookeeper", "confessions_of_a_shopaholic", "norbit", "evan_almighty", "good_luck_chuck", "yes_man", "the_ridiculous_6", "ted_2", "dinner_for_schmucks", "this_is_the_end", "hot_tub_time_machine", "paul_blart_mall_cop", "little_man", "grown_ups_2", "diary_of_a_wimpy_kid_the_long_haul", "wild_hogs", "21_jump_street", "kangaroo_jack", "little_fockers"]}