{"id": 3069, "title": "Old School", "starring": ["Luke Wilson", "Will Ferrell"], "runtime": 88, "genre": ["Comedy"], "description": "Three friends attempt to recapture their glory days by opening up a fraternity near their alma mater.", "releaseYear": "2003", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/nYtuwNHpEoIbTgS3aFPSEwZNN6l.jpg", "categories": {"plot": 8.0, "acting": 7.5, "ending": 5.0, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.34375, "action": 5.0}, "reviews": [{"rating": "8", "text": "-\"You my boy blue!\"-\"Well, um, actually a pretty nice little Saturday, we're going to go to Home Depot\"-EarmuffsThis movie has more than enough laughs to go around, Very very enjoyable movie."}, {"rating": "9", "text": "A CRIMINAL comedy  It was awesome !!!\rIt's not the story, it was common... It's how it's made... full of funny jokes, crazy situations :)))\rI'm sure that everyone of you know 3 guys exactly like the 3 main characters :D"}, {"rating": "9", "text": "These movie critics are the only people I know that do not like this movie. Sure it is a bit immature and freekishly simple comedy, but a laugh from beginning to end. One of my favorites- Frank the tank baby! Guys forming a frat for losers just to keep a home near a college campus. \"You're my boy Blue!\""}, {"rating": "8", "text": "Old School is a classic 2000's comedy. Overall it is likely one of the best film released starring the so called \"frat-pack\". For me this is really the movie that sets Will Ferrell up for the future he had (Anchorman and Blades of Glory followed and for Vince Vaughn Dodge ball and Wedding Crashers). There were several times hat I found myself in stitches over this movie. Its just as significant now as it was in 2003, and its aged well over the 12 years since its release. If you are a fan of any of the stars in this film Old School is worth watching because this is really the beginning of the revolution for these actors, except for Luke Wilson who we would certainly like to see back in a film like this again."}, {"rating": "8", "text": "Like other Todd Phillips movies, \"Old School\" is as full of characters who display a real arch as much as it is full of laughs.  I find this type of crude humor hilarious, but I don't expect everyone to agree.  I give it a B, next time you’re in the mood for a movie, this one won’t disappoint."}, {"rating": "8", "text": "hihhiihhihiihhihihihihihhi,,,,,,,,,,,,,,,,,,,,..........●●●●●▪▪▪▪■■■■■•••••••••••••■■■■■●●●●●☆☆☆"}, {"rating": "8", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}"}, {"rating": "8", "text": "Mmnnbbvvccxxzzaassddffgghhjkllloppiuuyyyyydjxksmdkmsownsombiigfyfyugugyftdfyugugguguugugguugugugguugugtihihhiniu"}, {"rating": "8", "text": "mmnnbbvvccxxzzaassddffgghhjjllooppiiuuyytttrreewhoihuftd\"\",\".?!;^&*()_+×÷%€@#$%●●☆⊙⊙⊙《》♤{}[]¡¿◇◇▪○°°,..."}, {"rating": "8", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●●¡●¡●¡●¡●¡●¡=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"}, {"rating": "7", "text": "\"Hangover\" Director Todd Phillips delivers a sort of \"Animal House\" throwback with \"Old School\". The film tells the story of Mitch, played by Luke Wilson, whose life basically falls apart before his eyes. He then decides to move in to a house on a college campus. Mitch's friends Frank and Beanie, played by Ferrell and Vaughn, convince him to start a fraternity within the college campus. Hilarity, of course, ensues. I found myself laughing a fair amount in this movie. There were a couple moments that were made me laugh hysterically, but overall the laughs came pretty moderately for me. Luke Wilson is great at playing. . .well the straight man - I feel that that's all he plays in movies unfortunately. And Will Ferrell and Vince Vaughn are excellent as Wilson's flawed but fun friends. Overall I found the movie pretty darn hilarious. Even though some of the subplot stuff was rather annoyingly predictable, the movie still managed to make me laugh a bit."}, {"rating": "10", "text": "One of my favourite movies of the decade! It made me laugh, which is no mean feat. I've only ever heard good things from people I know who've seen it. A must see!"}, {"rating": "7", "text": "Childish, terrible story, vulgar, ridiculous, silly & cliche ridden but made me laugh more than I expected & I enjoyed it..I'm still laughing at the wedding band now. I'm sure I once saw a band like this in Oldham!"}, {"rating": "7", "text": "It wasn't always funny, it was predictable and the characters were cliché but it was still pretty entertaining and the soundtrack was really good. Old School is definitely not a great comedy but it's still good enough to keep you entertained for the entirety of the movie."}, {"rating": "7", "text": "It was funny for the most part, Can get rather boring and stale as well. Acting was solid and there are a lot of hilarious parts through out. It was a solid comedy worth watching."}, {"rating": "6", "text": "A homage to the eighties college movies such as Back To School but it is rescued from mediocrity by a hilarious performance by Will Ferrell. Still worth a watch and it's guaranteed you'll find at least one moment that will make you laugh out loud."}, {"rating": "5", "text": "This movie is flat out stupid. Had some really dumb parts in the film and some that were very funny. Characters are totally worthless and the acting was quite pitiful. Decent enough for a comedy."}, {"rating": "6", "text": "The jokes aren't as frequent as they should be, and it doesn't have much of a plot, but Old School delivers the goods nevertheless. It's a crowd pleaser, with some uproarious monologues from Ferrell."}, {"rating": "4", "text": "So it is about a group not coming but working together. That's the premise and there is no chemistry. And yet I liked it. It is smarter than it pretends to be.Old SchoolTodd Phillips, the co-writer and director, is one of those filmmakers that gets comedy right. We see people take comedy lightly and as a result the comedy starts taking them for granted. As in, even good sketch scenes and one liners have failed repetitively if there is no head or leg to its existence. Over the years, you see these happening.. nay, escalating where you see a series of jokes stitched together in the form of highlight. This post social media world where patience is the last thing on the audience's list.They are usually gobbling over these attention seeking humor. Where the root and stem is chosen, overpowered by the fruit. But what it, if looked at the bigger picture, shows is that there is no need to endure either the hard work by the audience or put up by the makers. And hence comes these few filmmakers who believes in the entire characters. All sides of it. All dimensions.Phillips makes sure you see each side of them before you experience the wildness, the mistakes and their surprising skills. In fact, even his jokes work like that. It starts with an innocent or childish or amateur ideas then leads up to its peak and then we are also shown what the aftermath result is. These layers may get unnoticed if you are mesmerised in Will Ferrell's commitment to physical comedy. Old School is old if looked at the ideas it explores. It sounds like an idea that is pitched to the producers to get them all riled up over the script. Luckily, derivation is not a disadvantage but a proud armour."}, {"rating": "6", "text": "The movie doesn't have much of plot, and it does use well worn tropes, but there a just enough jokes to make this entertaining enough."}, {"rating": "1", "text": "1 vote for Will Ferrell, at least he knows what comedy is. His pratfalling and stupidity is funny. Everything else is beyond bad. Absolutely hateful rip off of Animal House with maybe 4 smirks all film, all Ferrell."}, {"rating": "10", "text": "Loved the movie...a masterpiece. I was pleased to see that it just made Vanity Fair's top 50 films of all time list. Frank the Tank is one of the best characters to come along in a long time. If you don't enjoy this movie, you need to lighten up and live a little. Fart jokes and one liners aside, there is a fair amount of real world insight in the film for those of us at the same stage in life (early 30s)."}, {"rating": "10", "text": "This is a legendary film that should be remembered forever. It is so funny; this must be one of the best films I own. I hope everyone enjoys it as much as I did. If anyone has not seen this the WATCH IT!!! NOW!"}, {"rating": "3", "text": "I don't get it. A few funny moments and a lot of pap."}, {"rating": "4", "text": "A big disappointment. Everyone was saying, \"you gotta see this movie!\" Maybe Will Farrell flailing around with a dart in his neck is funny if you work with zoo animals? This movie is a wannabe Animal House, and its attempts at humor range from sad to irritating. This isn't coming from some highfalutin critic who doesnt appreciate lowbrow jokes. I laughed non-stop at The Longest Yard and The 40 Year old Virgin. If you want silly, raunchy humor, rent one of those two."}, {"rating": "10", "text": "You're my boy Blue!"}, {"rating": "7", "text": "Some very funny moments but nowhere as good as Anchorman."}, {"rating": "10", "text": "This movie is no disappointment forget all the bad reviews. Will ferrell is so funny and this movie is hilarious. A must see. Not appropriate for younger viewers."}, {"rating": "7", "text": "This was the first movie I ever seen with Will Ferrell in it. I thought it was hilarious. The movie ain't really that good, but it's so funny that it doesn't really matter."}], "recommendations": ["neighbors", "step_brothers", "ted", "jackass_presents_bad_grandpa", "grown_ups", "the_hangover", "the_watch", "night_at_the_museum", "american_pie", "eurotrip", "superbad", "hot_tub_time_machine", "the_wedding_ringer", "the_three_stooges", "just_friends", "this_is_the_end", "zoolander", "the_other_guys", "knocked_up", "ted_2", "30_minutes_or_less", "dodgeball_a_true_underdog_story", "jexi", "21_jump_street", "nacho_libre"]}