{
  "id": 55,
  "title": "Oldboy",
  "starring": [
    "Josh Brolin",
    "Elizabeth Olsen"
  ],
  "runtime": 104,
  "genre": [
    "Drama",
    "Thriller",
    "Mystery",
    "Action"
  ],
  "description": "An everyday man has only three and a half days and limited resources to discover why he was imprisoned in a nondescript room for 20 years without any explanation.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iX93YdBrZA1EpGbphmjf4ARj1Za.jpg",
  "categories": {
    "plot": 8.076923076923077,
    "acting": 8.545454545454545,
    "ending": 6.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 7.2,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 4.333333333333333
  },
  "reviews": [
    {
      "rating": "9",
      "text": "\"Oldboy\", a Korean revenge thriller, differs from those western revenge films such as \"Kill Bill\", \"Machete\", or \"Inglourious Basterds\". It doesn't use sword and blood to define revenge, but thought provoking words and tension between the main characters. It's a 'revenge' movie that builds itself unlike other revenge movies."
    },
    {
      "rating": "10",
      "text": "I read critics of people who try to explain that this movie has flaws, that Park Chan-wook is overrated or that this movie's a load of bull. Then I learn what movies they like and it all makes sense. This movie is one of the very few masterpieces that exist in human history. If you don't like this movie or if you think you see a flaw then I ask you to watch again and again and again ad infinitum. Maybe you'll learn of its beauty somewhen."
    },
    {
      "rating": "10",
      "text": "Masterpiece. Critics who gave this movie negative reviews probably didn't understand it or it's simply not their taste. The violence may also be a bit too raw for some. But if you're a true movie fan, within 1 hour into this movie you'll realize that you're watching a true work of cinema art. From the intriguing storyline, raw character portrayal and excellent direction to the explosive twist ending, filled with underlying messages and morals, this is one movie you will never forget. You might even learn a thing or two about revenge."
    },
    {
      "rating": "10",
      "text": "This is the movie that prompted me to dive, head first into Korean drama. The second instalment of the Vengeance trilogy, and by far the best of the three. Oh Dae Su is a modern day Monte Cristo (as is the antagonist, the sociopath) But while the latter is imprisoned by demons  of his mind, poor Oh Dae Su is imprisoned in the literal sense. When he is released, its vengeance VS freedom. Too many times, he could have simply walked away from it all, and lived a happy life, but instead chose the path to vengeance, which leads to one of the most hideous immoral and perverse endings ever. Im not gonna spil it, but the reasoning behind his imprisonment is a bit contrived- and it could have been something a bit more solid, but it is still believable, if you put yourself in the antagonist's mind. Now lets talk art- the cinematography is breathtaking. Obscure angles, too-wide shots, split screens...all this with BOLD bright colors and high contrast, make this movie incredibly pretty to look at.  Theres some pretty epic gorey scenes with a hammer, and a sweet fighting scene set to a beautiful score (This is one of my favorite movie soundtracks, gogo Vivaldi!).\rIts a tragic tale of two mens revenge. One man in the end, dosent get to kill his adversary(and the closure he gets is pretty crappy, once he finds out the why, but hey, when your dealing with a psycho, what can you expect?), while the other succeeds in completely ruining the others life."
    },
    {
      "rating": "10",
      "text": "This movie was a masterpiece. This film is not like any western film that hit the big screen, you can say this movie is completely original. Park Chan-wook does an amazing job of delivering this dark story in a way that keeps your eyes glued to the screen. This movie is very brutal and definitely not for people under the age of 18 because of the topics it deals with and the brutal violence. I would recommend this movie to anyone who enjoys Quintin Taratino movies, or any revenge movies for that matter."
    },
    {
      "rating": "3",
      "text": "A highly overrated movie , it seems that people are taken by \"visual candies\" and cinematography that they loose focus on the plot and story.\rThe movie opens high and intense and grabs you from the beginning , and you'd want to know why Dae-so was imprisoned , but when he gets out and as soon as he meets Mido the first thing that comes to your mind is that she's his daughter, although they try to push that idea away later after that , still that's the first logical explanation you got  , so that ruins the big surprise in the end.\r Also the fight scenes were very strange... why all those (thugs , gangs , security personnel....whatever they are) why they didn't have guns and just shoot him ?!! why are they carrying baseball bats ? and why are they breaking them on walls?!!\rand if his prison room had security camera why they let Dae-so continue digging through the walls all that time? and why didn't he block the sleeping-gas tubes?\r And in the final scenes, Really all that was because of a \"Rumor\"?? 15 years in prison and make him **** his own daughter for a \"Rumor\"!!! and it wasn't a \"Rumor\" !! he said what he saw, what actually happened ...!\r Woo-Jin should've just kicked Dae-so's ass in school and that's it , end of conflict.\rI don't know how things happen in Korea but when the young school girl was pregnant or appeared pregnant no investigation was done by the parents or by school or anyone !!\r Dae-so gave good emotional acting moments towards the end  , but cutting the tongue was just too much  , he could've just killed Woo-Jin and got back to his daughter...\r And the Final scene made everything worse, after all what he knew , that Mido is his daughter and that he was hypnotized to love her for the revenge , even-then Dae-so still went back to hookup with Mido..!!\r The Story is everything in a Movie no matter what genre it is even if it's a psycho / horror or even sci-fi , the story should always make sense."
    },
    {
      "rating": "6",
      "text": "The film kicks off brilliantly and at times is genuinely absorbing but, unfortunately, it fails tie up the story convincingly enough to make it a must see. The histrionics at the film's climax and the cringingly puerile motives at the story's core, spoil an otherwise enjoyable and stylish film."
    },
    {
      "rating": "2",
      "text": "After a thrilling, original premise, we take a two hour trip down mystery lane toward an incredibly unsatisfying solution. The filmmakers must have known this, when they decided to throw in another twist at the end (done to shock us on a pretty shallow level) since the original puzzle solution wasn't worth 2 hours."
    },
    {
      "rating": "10",
      "text": "Excellent."
    },
    {
      "rating": "10",
      "text": "Stunning performanse, stanning soundtrack, and ofcourse story!!!"
    },
    {
      "rating": "10",
      "text": "It was the best movie in my life.never fet so emotionally shocked.a true love story."
    },
    {
      "rating": "10",
      "text": "It is the best revenge flm ever! Just watch it!!!"
    },
    {
      "rating": "10",
      "text": "I'm sorry critics, but it looks like you're just going to have to accept it: Asian cinema rocks and it's going to take over. This is one of the best."
    },
    {
      "rating": "10",
      "text": "A masterpiece. One of the best ever. :)"
    },
    {
      "rating": "6",
      "text": "Very slick but ultimately too sadistic and hollow to fill out its overlong runtime with meaning. Oh, and killing four live octopi (it wasn't just one) can never be justified in making a film."
    },
    {
      "rating": "0",
      "text": "My question is, what is the point of this movie? Besides leaving you with the feeling of being raped. This movie sucked. If you enjoyed this, you probably secretly desire incest with your children. Or you just lack complete empathy or moral center as a human being."
    },
    {
      "rating": "0",
      "text": "Absolutely fucking horrific. Good people are tortured in unbelievably vile ways for having done nothing at all; everyone in the film is pointlessly disturbed and it leaves one with absolutely no satisfaction at the end. I didn't feel that justice had been done, which is the point for me of films like this, I just felt like I'd seen some cool fighting and needless suffering. Watch this if you want to destroy your faith in humanity, watch the far superior Lady Vengeance to have it restored."
    },
    {
      "rating": "10",
      "text": "A personal favourite and one of the best films from asian cinema. The plot centres around the story of Oh Dae-Su, who has been locked up in a room for 15 years. His lack of knowledge about his captors or the motives behind his imprisonment so drives him into insanity, with TV being his â"
    },
    {
      "rating": "10",
      "text": "The film that introduced to Korean Cinema and still my favorite Korean film to date. An incredibly affecting and powerful tale of revenge. A masterpiece."
    },
    {
      "rating": "8",
      "text": "This movie leaved me uncomfortable after and slightly depressed, They're only few movies can made individual paralyzed after this bloody and horrible truth. I still don't know what inside of the director's mind of how he made this film."
    },
    {
      "rating": "10",
      "text": "I'm not even going to write a review, I want to watch this movie over and over again. Why read a review when you could be watching this movie? GO WATCH OLDBOY!! Its a truly amazing film!"
    },
    {
      "rating": "10",
      "text": "Oldboy is a fu****ng great masterpiece. You will never see a film like this. An artistic film like this  It will make you feel pain and sadness but after watching oldboy you will just feel empty. It has great direction and that violence is so disgusting that you will want to watch that film again and again. Oldboy deserves your attention and you will be thrilled by its amazing plot, actors and an ending that you would have never expect. Thumbs up to the sky for that film. A must-watch masterpiece. And I am not lying. I wouldn't score it 10 out of 10 if it was not a great film."
    },
    {
      "rating": "10",
      "text": "Entertaining story, live octopus eating The pace is a little off but worth watching.  I also vouch for the other 2 in the trio and thirst for that matter."
    },
    {
      "rating": "10",
      "text": "It can't be missed. This is one of those films that grab your heart by the aorta and shake it around violently until you have to take a deep breath and recover from the trauma. You don't need to read a review of this movie, you need to watch it tout suite."
    },
    {
      "rating": "10",
      "text": "A powerful film, with a powerful cast, Park Chan-wook's Oldboy is great by all means. It is rare I feel sympathy for a villain, but this film makes it happen with the great writing that went on with it. If you have a soft stomach, this may not be the film for you as it is a revenge film. Like most revenge films it is brutal and, without spoiling anything, has an event occur that was rather harsh to stomach down. If you can get through that, you will end up watching a piece of art in motion. A true masterpiece."
    },
    {
      "rating": "10",
      "text": "I normally avoid foreign films but this revenge drama is simply flawless, with the over the top violence and the brilliant acting elevates this ingenious film to a must see."
    },
    {
      "rating": "6",
      "text": "No me gusta criticar así las películas, pero tengo que decir que 'Oldboy' es una de las películas más raras que he visto nunca. Y es que quería darle una oportunidad al cine coreano y que mejor que con una película de la envergadura de esta. Dicho esto, no me parece mala película dado que esta dirigida y escrita magnificamente, pero para mí es una ida de olla, una fumada, una rayada, llamemoslo como queramos. Es una película que odio después de verla profundamente porque es el típico tipo de película que odio. La doy un 6 porque no puedo suspenderla porque a mí no me guste. Es una buena película por mucho que a mi me pese..."
    },
    {
      "rating": "10",
      "text": "The best Korean movie for you to see and think about other new creative elements in Asian films in the 2000s. The director Chan-wook Park made his masterpiece."
    },
    {
      "rating": "10",
      "text": "Incredible film that pushes back the boundaries. I hate being outsmarted and it doesn't happen much, but this is a film that manages it with some style."
    },
    {
      "rating": "10",
      "text": "Jackie, the point of the movie is not to destroy all your faith in humanity, but to question it. Park actually portrays a good view of humanity. Oldboy tells us that revenge is not the best option. By stripping bare Dae-su and then recreating him as an animalistic beast he is basically showing the depths of human destruction, and how far the want for revenge is from that lowest point. This movie is as close to a masterpiece of cinematography and plot as you could find... The man is a creative genius hell bent on showing the beauty of the human spirit!"
    },
    {
      "rating": "10",
      "text": "Brilliant, brilliant, brilliant. One of the best films I have ever had the privilege to watch. It is a must see film."
    },
    {
      "rating": "10",
      "text": "Absolutely, my favorite, not one of my favorite, this is absolutely the best film and will still be in my whole life. this movie is the most brilliant thriller that has ever made. To every director and wannabes on Earth, this is the main text you shouldn't miss at all, shut your mouth and go for it!!!!"
    },
    {
      "rating": "10",
      "text": "An amazing movie that some critics obviously dont get because there still hoping movies lie brokeback mountain and derailed will rock. Screw you critics, Asian cinema has taken over."
    },
    {
      "rating": "8",
      "text": "After hearing everyone talk about Oldboy in my East Asian Cinema class, I decided take the plunge and see it at the Nuart. I didn?t know what to expect, which is probably a blessing; expectations can go a long way towards ruining a film. Dae-su, the protagonist, starts out as a useless drunk. Then, seemingly for no reason, he is held in a room for fifteen long years, left with only a television to entertain him. His meals come from a slot under his door, and every once and while he?s knocked out with sleeping gas. When he wakes up, his hair has been cut and he?s been given a shave. Through his TV, he learns that he is being charged with the murder of his wife. Someone clearly has revenge on his mind, but who? And for what purpose? Freud would approve. Since the plot hinges on a central revelation, I won't say anything else about it. Instead, I'll talk about some standout scenes. In a cinematic moment that has become infamous already, Dae-su (who looks just beastly with hair teased within an inch of it's life) walks into a sushi bar after being released and asks to eat something \"alive.\" He chomps into a live octopus, but before he can finish, he faints, one tentacle still squirming. On a visceral level, I was repulsed. But then I remembered that this guy just missed out on more than a decade of living and just wanted to feel vital again. In some strange way, my heart went out to him. Eventually, Dae-su figures out where he was incarcerated. So great is his fury that he storms in without any forethought, armed only with a small hammer that he picks up along the way. In a long shot of a hallway, he does battle with his former jailers, displaying an emotion I can only categorize as ?primal rage.\" Even a knife in his back can?t do much more than slow him down. What made the scene captivating was the fact that violence was used to highlight an emotion, rather than for mere shock value. If you have a strong stomach and a taste for black humor, you'd do well to see this movie."
    },
    {
      "rating": "10",
      "text": "No, this movie isn't going to be for everybody, especially for those who truely enjoy mainstream movies in America, where plot, and acting have been replaced by big names, over the top digital effects and an overall warm and fuzzy feeling at the end of the movie. For those who look for something more than American cinema this is at least worth a look. It is rare that I feel I need to take a shower after I watch a movie, and every time I sit down and enjoy it I wonder if I truely am a bad person for doing so. The first time I saw it I was literally stunned. I couldn't speak, I couldn't really do much of anything but digest what I had just witnessed. I'm not sure I can think of any other movie that had that effect on me, and even now I am a bit unsettled after watching it. The style, the topics, the twists, it is all unlike anything most people have ever and will ever see because the American audience prefers to shelter itself from movies like this. My advice, if you want to look outside the box experience Oldboy at least once, start to finish, I'm willing to bet that unless you are an avid watcher of Korean cinema, you won't soon forget the plight of Oh Dae-su."
    },
    {
      "rating": "10",
      "text": "Excellent film."
    },
    {
      "rating": "10",
      "text": "Absolutely unmissable. Choi Min-Sik, Yoo Ji-Tae and Kang Hye-Jung all excel in their roles."
    },
    {
      "rating": "10",
      "text": "There is one disappoiting thing about this movie that got to be mentioned: The violence it contains and the violence the movie is advertising with that make a lot of ppls expect nothing more but a brainless b-movie massacre like for example kill bill is.\r In fact Oldboy is smarter, more entertaining, more emotional and more stunning than most of the high rewarded mainstream hollywood movies. An overall masterpiece in many ways and a loss for every movie fan not watching it.\r Clear 10/10"
    },
    {
      "rating": "7",
      "text": "Although at times visually mesmerising I found it hard to not leave the cinema. Painful viewing left me feeling empty. Not for the weak minded, its stretched my mind. I am left asking myself wether or not that defines a good movie, one that makes you feel bad or uncomfortable."
    },
    {
      "rating": "8",
      "text": "I just saw it, and will definitely go back for the other two in the trilogy. Although I'm not giving it a 10, and can understand some of the criticism here, but that anyone could use the attribute \"hollow\" to describe this movie is beyond belief. Greek tragedy at the core, and really a remarkable meditation on the idea of vengeance. With little dialogue, captures complex relationships and emotions."
    },
    {
      "rating": "10",
      "text": "Out of all the movies I've seen in the past 5 years, this movie was the best and it was made ..5years ago. It's rare that I'm still thinking of a movie days after i watch it. It totally screwed my head up. The ending was Crazy! It just kept pouring on and on and on with twists that I could never have thought of."
    },
    {
      "rating": "10",
      "text": "10,without a doubt.I cried both-first and second time while I was seeing it.Deeply disturbing but utterly beautiful masterpiece."
    },
    {
      "rating": "9",
      "text": "Excellent."
    },
    {
      "rating": "7",
      "text": "Dazzling and sophisticated this film may be, but the fact remains that it's built on a contrived and totally unconvincing plot."
    },
    {
      "rating": "10",
      "text": "Great film, one of the greatest existential dramas in memory. BTW, when 40-year-old-virgin is given similar rating as Oldboy, one can easily voice a volume of criticism of the critics (and perhaps the mysterious rating system of this web site). Is it possible that the last trace of intelligent thinking for the betterment of cinema are readily abandoned under the overwhelming Hollywood assault of sophomoric titles after titles ?"
    },
    {
      "rating": "10",
      "text": "This movie is a unqualified classic. Cinematography, art-direction, screenplay, acting, direction--all pitch-perfect. I've seen some complaints about some of the plot twists, but really, they are so minor compared to other films of this sort that are now hailed as classics that I think this film deserves to be forgiven."
    },
    {
      "rating": "10",
      "text": "Easily the greatest movie ever made."
    },
    {
      "rating": "10",
      "text": "This is one of my all-time favourite movies, and I've only seen it twice (over the last two days)."
    },
    {
      "rating": "10",
      "text": "I can't remember much of anything after seeing this film except feeling completely emotionally spent. I was too busy picking up the pieces of my shattered jaw off the floor."
    },
    {
      "rating": "10",
      "text": "This has to be one of the best made films of all time. This movie is far better than Lady Vengeance; with all due respect, I don't know what Jackie is saying. Of course Oldboy is dark, sick and disturbing, but that's also what makes the film so original . The director does a good job to get people to think about what the outcome will be without losing momentum ."
    }
  ]
}