{"id": 1014, "title": "Olympus Has Fallen", "starring": ["Gerard Butler", "Aaron Eckhart"], "runtime": 120, "genre": ["Action", "Thriller"], "description": "When the White House (Secret Service Code: \"Olympus\") is captured by a terrorist mastermind and the President is kidnapped, disgraced former Presidential guard Mike Banning finds himself trapped within the building. As the national security team scrambles to respond, they are forced to rely on Banning's inside knowledge to help retake the White House, save the President and avert an even bigger disaster.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ei2qjTiDpgKGuoSEntPCSAIhuvQ.jpg", "categories": {"plot": 4.133333333333334, "acting": 3.619047619047619, "ending": 3.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 1.75, "funny": 4.6, "action": 6.304347826086956}, "reviews": [{"rating": "10", "text": "This is a GREAT action movie.  I'm judging it based on an action movie not a movie up for an oscar.  It has a lot of cool action scenes, good plot, well acted and was intense.  I think it is the perfect action movie."}, {"rating": "5", "text": "A competent action flick, perfectly slotted for pre-summer release.  Various plot devices are hardly believable, but you just go with it in this type of movie.  Predictable, but fun."}, {"rating": "6", "text": "This is everything that Die Hard 5 should've been. An all out, over the top, ridiculous action movie, yet is somehow manages to pull it off and give you a thoroughly entertaining experience. With a great cast consisting of Gerard Butler, Aaron Eckhart and Morgan Freeman  they really make this film work. Olympus Has Fallen deals with a North Korean led guerrilla assault, led by former Bond villain Rick Yune, on the White House, where it's left to a guilt ridden Secret Service agent Mike Banning (Butler) to stop the terrorists and save the President (Eckhart.) It's definitely not an original idea but that doesn't prevent you from enjoying the film. It's a heart pounding, adrenaline filled action adventure that seems to take certain inspiration from classics like Die Hard and Under Siege. As unrealistic as it is. The film is very well acted. Morgan Freeman just doesn't deliver an average performance and that's no different here. Eckhart is believable as the idealist President. Yune was a smart and solid choice as the villain of the piece but it's Butler who rediscovers his form. He has had some shockers recently but this is very much normal business resumed. He thrives as an action star and this may just re-ignite him in that area because he gives a superb showing here. Let's be clear it won't win any Academy Awards. But in terms of action it's packed to the limit, adrenaline fuelled, fist pumping, roller-coaster ride that is pure entertainment."}, {"rating": "5", "text": "Olympus Has Fallen felt like a live-action version of a Call of Duty game. They ignore realism and go for as much shock and awe as possible. When I say they \"ignore realism\", I don't mean it looks or feels fake, I mean the major plot points that establish the premise are ridiculously unbelievable and all of the drama hinges on those points. It makes the very well done action sequences tinge of disbelief because the scenario is flawed. As a matter of fact, all of the drama in the film suffers from these flaws. So why did I give it a not-so-terrible rating? Because Gerard Butler is such a BA that he makes this movie incredibly entertaining. The combat and fighting sequences were incredibly well done and the acting throughout, not just by Butler but really the entire cast, is great. The graphics and cinematic elements were done well also. Really, the only flaws in the film were story related but they had such a cascade effect that it hurt the entire film. Overall, I think most people would actually probably enjoy it because they wouldn't get quite as hung up on the minor details as I did but I expected more."}, {"rating": "5", "text": "Like alot have already said, it's quite Die Hard-esque, the attack sequences were pretty decent, but there's an element called \"plausibility\" that they punted and that makes this a one-time watch instead of a classic to view repeatedly. I do wonder, though, if Obama requested a Secret Service briefing to ensure such elements of attack couldn't be exploited."}, {"rating": "4", "text": "The movie is so ludicrous and unrealistic on how it unfolds, that its hard to take anything seriously. Some thrills and action sequences can't make up for the slightly better Sci-Fi channel visual effects."}, {"rating": "5", "text": "A B movie with an A-list cast of actors, they put in a yeomen-like effort but can't salvage the overly generic dialogue and plot. I love action, and that was done reasonably well without being anything special. As some have noted it's kinda like an old-school 80's action film with Gerald Butler standing in for Chuck Norris."}, {"rating": "5", "text": "Watching this movie, i was constantly reminded of the film adaption of Tom Clancy's \"The Sum of All Fears\". Show America being hurt, throw in a male model built secret service agent, some shady, obviously evil baddies and Morgan Freeman. What made TSoAFs a superior film however, was that it always managed to maintain an atmosphere that kept you in doubt as to whether the US would escape intact, even though the film viewer in us kept telling ourselves that of course it would. \"Olympus has Fallen\" never keeps you in doubt that America will come out on top and stronger than ever, or that Aaron Eckhart will come out with his face still in presentable condition. Some [one] good jokes and cathartic action sequences push this entirely unremarkable film up to a 5/10."}, {"rating": "2", "text": "I could only make it through about 30 minutes of this movie. The premise is unbelievable-- somehow a lone aircraft sneaks past all our technologies and takes out several F/A-18s-- this is followed by ground troops appearing in D.C. and several spies in the white house taking out the S.S guarding the President. Of course, no explanation is give for how the ground troops (complete with tanks and trucks) somehow managed to enter our country, or how the spies somehow ended up in the bunker with the President and his personal guard.\r To make this all even more unbelievable, the attackers are Korean. Now, wtf is Korea gonna do to the U.S.? Not a M.F. thing, that's what.\r This film seems to rely on lots and lots of big gunfights-- there were several in the first half hour. Not only were they unimpressive, they were far from making up for the lack of coherent story.\r The 2 is purely for the actors sake. If it wasn't for what I saw out of them, it would be a 0."}, {"rating": "0", "text": "VERY PREDICTABLE! It only takes one main character to save the world.... Crap. There's nothing new that I have watched. The president will be saved no matter what lol if you want to feel good watch this cos it's like fairytale to me"}, {"rating": "3", "text": "Really, really stupid plot.  Action and CGI were fine but the plot did this movie in.  Way too many convenient plot points like all of the three code holders in the same place.  And letting the South Korean delegation in the bunker is just beyond the pale.  How did the bad guys know so much?  And how were they able to gain advanced U.S. weaponry.  Stupid, stupid, stupid!"}, {"rating": "8", "text": "This was actually a lot better than I expected it to be. It had a lot of bloody violence, and the survival count of people that were taken hostage was 4. This was good fun, but definitely not for the squeamish."}, {"rating": "3", "text": "A ridiculous rah rah American political movie that is a joke from start to finish.  The anti terrorist sentiment rules every aspect  with the righteousness of  running rampant over every scene.  Infantile and terribly predictable."}, {"rating": "5", "text": "In Bulgaria this movie is a-l-w-a-y-s on TV. It's like Home Alone of the action movies. It's like women's period - always comes back after month. Gerard Butler fits best in action movies, so no comment on that, he was great.  But the many cliches, also boring scenes (like for example this important people doing nothing), staring-s convert Olympus has Fallen in just another bearable action movie."}, {"rating": "0", "text": "Cliché, cheesy, inane, boring, predictable  all could be used to sum up this horrible movie. It sucked, and I want my money back. Because this is America, and when things suck you should be able to get your $8 back.\r I mean, I'm all about suspending disbelief in watching a movie. But Let's face it, if the only three people in the world with the detonation codes for every single nuclear missile were all being held hostage by a terrorist in the White House bunker  which just happened to be the only place in the world where the detonation codes could be changed  well, I feel pretty confident the order would be given to storm the White House and kill everyone in it  including the President. And if the cops and the Navy SEALS couldn't handle this task, I feel pretty sure every one of us gun toting rednecks would swarm on the White House and demolish it to the ground in about 15 minutes.\r And speaking of stupid, how about that super dooper gun turret they somehow miraculously smuggled into the White House and strategically placed on the roof such that it could shoot down 6 Navy SEAL helicopters??? OMFG! STOOOPID! This movie was Die Hard on steroids. Lame lame lame lame lame, and again, lame. Of course they cap the whole thing off with the proverbial ticking time bomb at the end  that our hero just manages to deactivate at the last second, saving us all from certain doom.\r What has the American population become that they would try to pass off an utterly inane and stupid piece of malarkey like this movie on us as an even marginally plausible scenario for a terrorist attack  never-mind having only one goober inside able to thwart the attack  and we as Americans don't stand up en masse and demand our freakin' money back for this garbage?? Cheesy!"}, {"rating": "0", "text": "This movie was so bad it made me create a profile and write a review.  This is my first.  This is a horrible movie, so transparent in plot and so lacking in style I actually laughed al the way through it. This is a thin and badly made façade to demonise North Korea to justify the US Government going to war. The imagery  was so crude that America is good and NK so bad I laughed, a five year old could see through it.  Avoid, for the love of god and country avoid.  This movie deserves to go down in history as a piece of crude propaganda that Goebbels would be proud of."}, {"rating": "7", "text": "It's essentially the first Die Hard meets Call of Duty: Modern Warfare 2... (and actually, it was way better than that most recent stinky entry in the Die Hard franchise)."}, {"rating": "2", "text": "Laughable plot, careless CGI, anticlimactic ending, and uninteresting characters. I wanted to enjoy myself, but I just couldn't get past all the mindlessness. Watch at your own rate."}, {"rating": "2", "text": "Simply awful, acting is very poor and topic has been done to death.  Needed more to be orginal but it fell short shame really,  I felt rather disapointed I was expecting more."}, {"rating": "8", "text": "A movie that bring the audience right back to 80's action movies. Crappy effects, unbelievable plot and over the top action sequences. This is the recipe to a good old action movie, simple yet many other movies have failed at it like the last stand. Great movie for good old mindless fun.\rI dot think this movie is gonna wipe the oscars but is certainly worth a matinee price."}, {"rating": "1", "text": "Prepare to have your intelligence insulted. Admittedly I saw this on a \"guys night out\" and I was the only one who hated it in our group of four. That's no excuse for such a steaming pile of Hollywood poo. Its so over the top its better as a parody of action flicks rather than an action flick in its own right. (We need the Mystery Science Theater guys to talk over this one.) I want my nine bucks and two hours back."}, {"rating": "3", "text": "Not good. Not good at all. This was the single most over hyped movie I have seen since The Dark Knight Rises. The cgi sucks, the acting is mediocre at best, and it's incredibly boring and tedious."}, {"rating": "0", "text": "Truly a horrible movie.  Not the actors' fault--they did well enough.  Just a dumb plot with completely implausible elements.  Don't watch this.  You'd be better off staying home and watching re-runs of West Wing."}, {"rating": "1", "text": "I can't believe I paid money to watch this movie. Absolutely terrible. The only reason I didn't give it a zero is because there were a few decent parts. If you are a remotely intelligent person you will find this movie's plot repulsive. It makes no sense at all, characters die for no reason, the CGI is awful, just a very poor movie."}, {"rating": "1", "text": "American hubris at it's most heavy handed (and not in the fun way). It goes beyond mere fantasy into nationalistic mutual masturbation.  Every single American cliche is used. For example, as the Secretary of Defense is dragged to the top floor she says the Pledge of Allegiance to steel herself against the possibility of death. Machismo is satisfied in a number of ways with all female characters (except one) either beaten or killed. In the end, of course, America is united through astronomical blood sacrifice to be \"reborn\" and unified. Also, I am pretty sure that Morgan Freeman is wasted as a very weak Speaker of the House. It was almost comical, but so heavy handed and cliched that I couldn't even laugh."}, {"rating": "9", "text": "This is a great action movie. Reminiscent of the original Die Hard and Under Siege. Well acted, high body count and well paced, the film never gets preachy or off topic. Not believable, but still a great experience and still better than the other action movies that have come out this year."}, {"rating": "5", "text": "This script is corny and the acting is very uneven.  Gerard Butler is fine as the main badass.  There is a tremendous 20-25 minute action sequence.  Very uneven film.  Didn't anyone day anything to these people about how stupid this is?  Think Die hard crossed with in the line of fire and ask why?"}, {"rating": "8", "text": "Gerard Butler has had a long string on movie duds, but this one will put him back on solid ground as an intrepid Secret Service agent. After terrorists stage a spectacular attack on the White House and hold President Aaron Eckhart hostage, Butler is the only one who can save the day. As this genre goes, this is pretty much by the numbers, but it's well staged and well acted (who even recognized Melissa Leo in that wig?). The fights are sometimes too jumbled to follow, but the plot (pun intended) offers a frightening theory that's effectively played out."}, {"rating": "0", "text": "Ugh. I've seen the same actors do well in other productions; in this movie, every scene is overacted to the extreme. Never mind the terrible contrieved, inconsistent and unrealistic plot, I believe the director is to blame here. Where else would the actors have gotten the idea to suddenly underperfom like that? As other reviewers have pointed out, trite cliches abound. I am shocked and disappointed that a sequel is in the works. Then again, it could hardly be worse."}, {"rating": "2", "text": "it could be worse and i guess if you can stand another \"oh my god we are all victims\" super patriotic US movie you can live with it as popcorn movie i guess.\rfor the others its 2003ish jack bauer 10 years too late. we have seen everything here better. i left after having watched 70% of the movie.. not worth the lifetime."}, {"rating": "2", "text": "I tried really, really hard to make it past the first half-hour, but it just wasn't possible.  After convincing myself that the terrible dialog was just a brief device to get to the action, and suppressing snickers at the awful character stereotypes, the action arrived and it was  just  awful.\r Really, a C-130 is almost immune to any attack and can take out half a metropolitan center with strafing runs?  Yikes.  Almost every single element was too much to swallow, and I had to say no before a half-hour was up."}, {"rating": "2", "text": "This is a movie so bad, I actually began writing this review while watching it. I'm all for pointless action, but the cliched plot and absolutely implausible takeover of the White House is near maddening. An army of Koreans sneak into the United States, some disguised as delegates who are mysteriously allowed to carry weapons within the White House, manage to capture the President. Meanwhile, the Secret Service, the men and women who are arguably the best trained agents in the world, run mindlessly into the open to take stray bullets from all directions. It's insane how badly this movie is set up from the beginning. It's not just bad, it's insulting. It's doesn't ever try to be funny like it's Jamie Fox counterpart."}, {"rating": "2", "text": "Antoine Fuqua knows how to display brutality in a film, be it physical or psychological and Olympus Has Fallen is bloody and traumatic but overall its a colossal waste of time, money and a plethora of talented actors. The film follows Mike Banning (Gerard Butler) who was the president's lead bodyguard until a tragic accident leaves him warming the bench. However when armed terrorists lay siege to the White House Mike must prove himself by saving not only the president but his son, a young boy who went missing when the gunfire started. Olympus avoids the many action cliches that ruin many a film but in doing so it fails to create any sense of suspense. Everything that happens is without any sense of jeopardy due to the way Mike is shown, he is a killing machine. The film has no tension so therefore it lacks a tone and its looks can be described by just saying the word brown, the film is dark, dingy and dirty and not in a good way, the film is miserably shot. Everything about the film is murky, hard to see and depressing, even in the uplifting moments. It's a film that because of its story is exceptionally bloody but it never really justifies the excessive brutality so by the end the main hero is essentially a sadist and an effective one at that considering he kills a small army in this film. They even attempt to justify his hero status with a girlfriend (Rhada Mitchell) who is literally there to service a plot point that isn't even successfully conveyed. They try a little harder by making him good with kids (because what kind of sociopath would be nice to a child is what I imagine the logic behind this was) as he protects the President's (Aaron Eckhart) son but even this doesn't mesh with the one man army the film is showing you, in fact by the end of the film Banning comes off as a highly trained, highly intelligent serial killer, only he doesn't have to hide any of his crimes. The film is populated with characters so badly written that they are completely unsympathetic. When the President gets threatened you kinda hope they kill him, to be honest, he really deserves it by the end. Melissa Leo gives good tough gal as the Secretary of Defense and Morgan Freeman comes in to literally order coffee and sit and relax. It's a film so remarkably stupid in its writing that the only enjoyable moments are the ones where they aren't talking but even the action fails to maintain your interest. In fact an action scene late into the movie is so hard to see that it sucks the life out of the ending and its a good 5 minute segment of blurry rubbish.  It's a tone deaf mess of an action film that really could have been better."}, {"rating": "4", "text": "Terribly under developed characters that made no sense. Overall plot holes made the action scenes hard to watch. Something that is \"impossible\" is terribly easy in the next scene... in more than one instance. Probably best to avoid this one."}, {"rating": "8", "text": "The rating was just so so on imdb. I thought this would be as terrible as die hard 5, but i was wrong. This one was so much better and much more entertaining than die hard 5. Full throttle action, very enjoyable, intense and great acting. I could have given it 10, but since there were too much civilians killing and massacre scenes therefore i reduce it to 8. This movie worth every  and my time on big screen."}, {"rating": "9", "text": "I first want to say, I am anti-American. Born and raised in Russia, my parents abandoned me because of the economy. I've always blamed that on America.\r I honestly think this could never happen to the White House but it is still a great film to watch. It had me on the edge of my seat. It is quite a cheesy (how many movies have a plot similar to this?) but I didn't mind.\r A great political thriller. I highly recommend it."}, {"rating": "8", "text": "A good action movie full of Gerard Butler's role is good I liked it and as always Starring Morgan Freeman doing another excellent Aaron Eckhart is not far behind as U.S. president"}, {"rating": "9", "text": "Wow. After seeing both White House Down and Olympus Has Fallen, I can confidently say that though the idea is the same of terrorists taking over the Whitehouse, both directors (Roland Emmerich and Antoine Fuqua) made the movies extremely different.\r The movie starts by showing President Benjamin Asher (Aaron Eckhart) and his family at Camp David. Within the first five minutes or so in the movie we can clearly tell that Benjamin and Mike Banning (Gerard Butler, Head of Secret Service) are great friends in and out of work. On the way back from the retreat it is snowing very badly in basically blizzard type weather. Out of nowhere we see a big tree hit the President's Escalade and the van starts to swerve off the road. As all of the Secret Service are trying to pull the car back onto the road, they are able to get the president out, but not his wife gruesomely passes away. Mike takes full credit of this and resigns from his job. Almost two years later he decides to reapply for a job in the Secret Service. He is sitting at his desk when he sees an unknown jet shoot down two American jets and begin open firing on civilians and soon, the White House. Meanwhile President Asher is meeting with Prime Minister Lee (Keong Sim) and aside him, Kang Yeonsak (Rick Yune) who are at the White House during the attack. Kindly Mr. Asher takes them to the bunker along with McMillan, Rodriguez, and others. From there on, a turn of rather predictable events occur such as Koreans turning on Americans and much more.\r I thought that from there forward, Olympus Has Fallen was extremely gory which in my opinion was not necessary at all. Seeing the guts inside one of the hostage’s neck was not necessary to cause the same audience reaction of fear.\r Overall I think that Faqua picked a great cast of actors and actresses and they played their roles at the best of their ability. I honestly do not think that White House Down was better than Olympus Has Fallen or vice versa. I do recommend you see this movie though just go into it with a little bit of caution because there are times where I cringed at the gory scenes.\r The deciding factor of which movie the audience would rather see though basically is would you rather see a comedy action movie (White House Down) or an action thriller (Olympus Has Fallen)."}, {"rating": "0", "text": "Ambitiously stupid movie.  And the sentiment is way past its prime.  I don't think anyone, anywhere gives a **** about the \"United States\" or its whorish capital  of Washington DC.  I was rooting for the Koreans to be quite honest."}, {"rating": "2", "text": "This movie was terrible! Bad acting all around. Nothing made sense. They tried to make the movie shocking with the violence, but it was laughable. Worst movie I've seen in a long time. I thought this movie was going to be better than Die Hard 5 based on the scores, but it was actually worse. I think there were only two good scenes in the movie: when Butler interrogates two bad guys, and when he saves the kid. There were so many scenes where they were trying to be serious, but I couldn't help but laugh out loud because they were so dumb. How this got a mid 40s score from the critics is beyond me."}, {"rating": "9", "text": "What a great F#cking movie. I have no idea why some people are giving it such bad reviews. If you like action thrillers then this movie will get your blood boiling and heart pounding. When certain part of the movie occurred (which will remain nameless as not to spoil anyone) the crowd started cheering and there was an applause at the end of the film. The only downfall that I saw in the movie were some real life inaccuracies. other than that it was one of Gerard Butler's best films."}, {"rating": "8", "text": "This is one wild ride! It will be too much for some people (too much noise, too much blood, etc etc) but that's okay. If you're able to suspend your disbelief, Fuqua's pacing zips along so fast that you bounce over the plot holes. It's like a roller coaster you'll want to get back on as soon as it's over. Butler, Freeman, Basset, Eckhart, et al are terrific! Do not be swayed  see it for yourself"}, {"rating": "5", "text": "According to moviebodycounts.com, (yes, all sorts of information is available on the Internet), Gerard Butler set some sort of top 5 record with his movie “300” and I think he easily breaks that record with a body count of 600 people just in the first half hour of “Olympus Has Fallen”!\r As always one has to check logic at the door when approaching an action film such as this without even talking about a secret service agent, Mike Banning, (Butler) working with the president (Aaron Eckhart) and his wife (Ashley Judd) on Christmas Eve wearing a 5 o’clock shadow! “Olympus Has Fallen” follows the template of hundreds of movies that have come before where one man can fight, kill and escape one threat after another but not one man can escape him.\r The story starts with Banning feeling he has made a mistake and then jumps ahead 18 months to present day.  The president, and some of his staff, including secretary of defense McMillan (Melissa Leo) and vice-president Charlie Rodriguez (Phil Austin)  are held hostage by a North Korean terrorist, Yang (Rick Yune), making Morgan Freeman the acting president  who works with secret service director Lynn Jacobs (Angela Bassett). Connor (Finley Jacobsen) as the president’s son, Dylan McDermott as a friend of Banning’s and Radha Mitchell as the latter’s wife are all important parts of the movie but it is Gerard Butler who is the man in the white hat, who uses the ‘F’ word quite a bit, who comes to the rescue of all and the world. In no way is that a spoiler as you know from the beginning it is not who but you have to find out how the hero will save the day.\r Director Antoine Fuqua, working with a script by Creighton Rothenberger and Katrin Benedikt, plus an excellent CGI crew and a production crew that constructs special, amazing sets, keeps the film going at a fast, sometimes funny pace, defying you to keep an accurate body count.\r “Olympus Has Fallen” is a fun, shake your head, how did they do that, just sit back and relax thriller of a movie with a music soundtrack that, at times, is too loud."}, {"rating": "3", "text": "It's not a terrible film, and it gets your blood up if you're a red-blooded American.  But I think certain directors and producers have a fetish which involves destroying American landmarks, killing American civilians, and desecrating the American flag in really creative ways. Sure, for cheesy movie like this to work, you have to get really pissed at the bad guy for that cathartic payoff at the end.  But the level of destruction and killing in the first half of this film strains credulity and is over-the-top.  Butler's not bad at all in his role, but Morgan Freeman is wasted.  And he's a softie.  Finally, I'm fascinated that Hollywood lacks the sack to make China the enemy in these movies (Red Dawn, etc.)  North Koreans have a tough time scraping together food for their families  they don't have the resources to put together operations like this.  And for what?  The bad guys' motivation is preposterous.  ALL that being said, if you're out for a little brainless fun, it'll work."}, {"rating": "9", "text": "\"Olympus Has Fallen\" is a taunt, exciting, edgy and just a flat out terrific action movie. More along the lines of a Die Hard for this generation, Antoine Fuqua has created one truly kick ass film, Olympus does not fall, in fact its quite the opposite.\".. A-"}, {"rating": "6", "text": "Olympus Has Fallen. Some good things about it and some bad. The bad first, ridiculus plot with some very cringe worthy American propaganda, dodgy special effects and will easily be bettered by the upcoming \"White House Down\". However there is some good points with a great cast and some interesting shots from director Antoine Fuqua. The star however is the action which is crazy and surprisingly hard edged. Its like watching a reboot of an 80's Steven Segal movie and a potential future guilty pleasure!"}, {"rating": "8", "text": "I thoroughly enjoyed this action packed thrill ride of a movie. Yes it does seem completely impossible at times and the secret service looks pretty incompetent but it doesn't take away from the many awesomeness factors. I think the plot does of good job of making you care about its characters and the many twists and turns keep you engaged. All in all the movie can be a little cheesy at times but I highly recommend you see it."}, {"rating": "0", "text": "An absolute piece of  that shows our Secret Service guys as naive idiots has are running into bullets instead of taking cover, arranging defense perimeter and calling for enforcements. Only certified idiots can believe that something like that can indeed happen especially after 9/11. Watching this junk insults my intelligence."}, {"rating": "5", "text": "If you have seen Die Hard, the original, then you've seen this.  So-so remake in which you know how this is ending.  Lot of destruction and people dying.  And our hero?  LOL"}, {"rating": "10", "text": "It's Die Hard in the White House. Olympus has Fallen has a great edgy feeling to it, making the film just like Die Hard movies. The plot was great and the action was mesmerizing. This is the movie for action fanatics but it seems like its more than that. Die Hard 5 is just what I wanted this to be, but the stinky Good Day To Die Hard entered and blowed my mind. Olympus has Fallen is great. Maybe it's the best movie of 2013."}], "recommendations": ["london_has_fallen", "white_house_down", "salt", "taken_3", "doomsday", "the_kingdom", "geostorm", "transformers_age_of_extinction", "mile_22", "battleship", "machete", "the_ice_road", "infinite", "sabotage", "shadow_in_the_cloud", "taken", "unhinged", "the_purge_election_year", "machete_kills", "the_purge_anarchy", "skyscraper", "war_of_the_worlds", "angel_has_fallen", "the_tomorrow_war", "a_good_day_to_die_hard"]}