{"id": 3778, "title": "On the Basis of Sex", "starring": ["Felicity Jones", "Armie Hammer"], "runtime": 120, "genre": ["Drama", "History"], "description": "Young lawyer Ruth Bader Ginsburg teams with her husband Marty to bring a groundbreaking case before the U.S. Court of Appeals and overturn a century of sex discrimination.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/izY9Le3QWtu7xkHq7bjJnuE5yGI.jpg", "categories": {"plot": 7.3076923076923075, "acting": 6.333333333333333, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 6.0, "action": 7.5}, "reviews": [{"rating": "8", "text": "“On the Basis of Sex” is the story of one notable period in the life of Justice RuthBader Ginsburg and how she successfully argued in Federal Court that statutory bias and discrimination based  on a subject’s gender was unconstitutional.Directed by Mimi Leder with a screenplay written by Justice Ginsburg’s  nephew,Daniel Stiepelman, the film portrays this dynamic lady as acrusader for the rights of persons of both sexes and lets the viewer know and understand the tenacity and perseverance of this legal giant. Aptly portrayed by Felicity Jones in the leading role, Ms. Jones  is supported by by Armie Hammer, Sam Waterston and Justin Theroux. Having attended the same law school when Justice Ginsburg studied there, I can personally attest to the very few female law students in attendance  and how extraordinary they had to be in order to gain admission to this restricted legal club .Clearly, Justice Ginsburg is the embodiment of the best of the best of all of them. I give this film an 8 for its interesting story and the entertaining manner in which it was able to relate the historical significance of all that Justice Ginsburg achieved."}, {"rating": "7", "text": "One of last summer's most popular documentaries was RGB, which chronicled the incredible career of Ruth Bader Ginsburg. This biopic dramatizes her marriage and early career up to the landmark case that solidified her crusade as an equal rights activist. Even though Felicity Jones does a decent job of bringing out the character's strengths and doubts, the whole thing feels a bit like a Lifetime flick. The relationship with her husband (Armie Hammer) is sweetly romantic and the repetitive discrimination borders on message movie. The story plays out interestingly enough, but as the crucial trail gets closer, the movie's momentum bogs down with legal wrangling. Even so, it's an interesting and a well-made ode to Ginsburg's intellect and influence."}, {"rating": "6", "text": "On the evening news they announced, that for the first time in her 25 years as a Supreme Court Justice, Ruth Bader Ginsburg would miss hearing oral arguments but would read all the notes taken and vote as was expected of her. After two operations for cancer and bouts of chemo she still shows the fortitude that saw her through a life of having to prove herself.\"On The Basis of Sex\" opens with Ginsberg attending a class of Harvard Law School, only one of nine women in a class of more than 500 men. We see the happy and equal, possibly more equal for her, marriage with her loving, smart husband who knows his wife can do anything she wants and he is there to back her up. For the first hour of the film we see had badly women were treated in the work force, along in many other aspects of everyday life, the comfortable marriage of the Ginsbergs, their children of which the oldest is a daughter who seems to motivate her mother to go a step further than she might be ready to go and how it lead to the Supreme Court.It is in the last 45 minutes that we see Ginsburg in 1975 arguing her first case regarding gender equality but it is for a man, not a woman, who as a caretaker for his mother has been denied $296 as a tax deduction.\"On The Basis of Sex\" is written by Ruth Bader Ginsberg's nephew, Daniel Stiepleman, but as much research as I did I wasn't able to find out who his parents were but he obviously admired, if not worshiped, Martin and Ruth Ginsburg so both are presented as perfect people.Felicity Jones as Ruth Bader Ginsburg really has a one note role but adds what she can to it. Anyone who saw last years documentary \"RBG\" or has seen her interviewed knows the lady is certainly not a one note person. Armie Hammer, as Martin, is excellent as the man who believes in his wife while Cailee Spaeny does a standout job as their teenage daughter Jane.Though it is hard, at first, to accept Sam Waterston as the hard, condescending Dean of Harvard Erwin Griswold, he is just one of the men who thought as he did, including the 3 judges who hear Ginsburg's gender discrimination case.Along with Hammer, Justin Theroux, as a ACLU lawyer, and Christian Mulkey, as the defendant in the  case, are effective in playing the 'good guys'.Kathy Bates in the role of Dorothy Kenyon, an early civil liberties fighter, lawyer and judge, shines in her two scenes.The director, Mimi Leder, does a by the numbers job and somewhere along the line the production staff saw a 'blue' New York. Clothes, signs, lights, door fronts, let alone Ginsburg's major outfit, is blue!\"On The Basis of Sex\" is an enjoyable love story, an interesting gender civil rights lesson, but most of all it shows how a person, a woman, lead a successful life in spite of all that was thrown in her way and gave us a woman who today is admired by many, including her enemies who want to get her off the Court which is a compliment.I recommend a double bill movie night of \"On The Basis of Sex\" for a Hollywood version of Ruth Baded Ginsburg and \"RBG\" to discover who the woman was yesterday and is today."}, {"rating": "7", "text": "An interesting film, but depressing for my friends and I who remember how frustrating, confining, and demeaning the “old days” were – even though I had a father who firmly believed in educating his daughters and who was unfailingly encouraging and supportive – and how difficult things still are. Although her accent failed her at times, Felicity Jones always commanded the audience’s attention and she was ably supported by a very fine cast, although I, for one, found Armie Hammer’s height distracting. This is a weighty film that is never boring, thanks to an excellent cast, including all the supporting actors, and the direction."}, {"rating": "7", "text": "A somewhat formulaic but nevertheless inspiring biopic about the early days of Ruth Bader Ginsburg's career and her efforts to fight for the elimination of sex-based discrimination under the law. With fine, underrated performances by Felicity Jones and Kathy Bates, the film capably walks viewers through the complexities of the legal landscape without resorting to excessive legalese while simultaneously putting a human face on the central issues in question, both in the lives of the protagonist and those for whom she served as advocate. To be sure, the pacing sometimes gets bogged down, and the screenplay tends to unfold in a safe, tried-and-true, somewhat predictable manner. Nevertheless, the inspiration this offering affords and the ideas it champions are well worth the play they get here, something that should prove uplifting to those who seek fairness, equal opportunity and even-handedness in all of their endeavors."}, {"rating": "10", "text": "Great film with a fantastic cast: Felicity Jones, Armie Hammer, Justin Theroux… all of them with wonderful performances. I love Felicity and Armie as de Ginsburg marriage. And the work of Mimi and the writing too. The story of Ruth Bader Ginsburg deserves being known for everybody, not only women, besides especially for men. I give the film a 10."}, {"rating": "6", "text": "One would think “On the Basis of Sex” would have the inside track for offering the definitive take on Ruth Bader Ginsburg.  After all, the screenplay was written by Ginsburg’s nephew, Daniel Stiepelman, whose script was discussed, reviewed and edited by Ginsburg and her daughter, Jane.  Despite this inside information and the artistic license granted this fictionalized version of Ginsburg’s life, the resulting movie does not compare favorably to last year’s more comprehensive, more powerful documentary “R.B.G.”It’s curious that the film focuses so narrowly – a few scenes of Ginsburg at Harvard Law, her early days in NYC beginning in 1959 and an emphasis on her first major gender equality case, Moritz v. IRS, which was argued before the 10th Circuit Court of Appeals in 1972.  Between 1973 and 1976, Ginsburg argued six gender discrimination cases before the US Supreme Court, five of them successfully.  One wonders why the film focuses solely on the beginning of her work on gender equality, while giving no real attention to the legal precedents she helped create for women over succeeding years.  For many, it is Ginsburg’s relentless pursuit of gender equality, accomplished case by case, brick by brick, that has made her so admired.  However, this narrow focus does allow the film to paint a painfully vivid picture of the barriers she had to overcome.  According to this film, women didn’t just cope with glass ceilings, in many cases they lived in glass cages.In general, the cast is first-rate.  As Marty Ginsburg, the ever-supportive spouse, Armie Hammer taps into the same thoughtful, soulful character for which he received a Golden Globe nomination last year for “Call Me By Your Name.”  At key points, Cailee Spaeny, as Ginsburg’s daughter Jane, offers a refreshingly in-your-face activism and assertiveness.  Jane’s personal power shows clearly that the gift of independent thought and capacity to question everything – which RBG received from her mother – was passed on to the next generation.  Unfortunately, Felicity Jones in the lead role just seems out of place.  Jones was wonderful as Stephen Hawking’s wife in “The Theory of Everything” (2014).  Here, she seems to be laboring to tone down her irrepressible perkiness.  Or, perhaps, it’s just that RBG, in this rendering, is just so humorless.The film is particularly incapable of treating the traditionalists who oppose feminism as anything other than bad caricatures.  In one early scene, Law School Dean Erwin Griswold (Sam Waterston) invites the nine female member of the incoming class to dinner at his home.  Once seated, he asks each to introduce herself and explain why she is taking the place of a deserving man.  It all comes across with the subtle nuance of Gallagher hitting a watermelon with a sledgehammer.Many years ago, I recall my father, a thoughtful, decent man, saying that he would be willing to help fund higher educator for his granddaughters “should they prove educable.”  From today’s perspective, it’s jarring to think about that stereotype permeating the thinking of reasonable people.  As much as any other individual today, Ruth Bader Ginsburg has been responsible for changing that point of view.  Unfortunately, “On the Basis of Sex,” fails to do her justice."}, {"rating": "7", "text": "For a film that gets so passionately hot under the collar about change and equal rights, this is quite conventionally made. Felicity Jones does a good acting job, but I'm never convinced that she is anything like the real R B G. Entertaining it is, but a trailblazer it most certainly isn't!"}, {"rating": "10", "text": "This was excellent, an excellent story about a brilliant, brave woman who has done as much for woman's equality as anybody ever.  A real hero, if only everyone had this much courage."}, {"rating": "5", "text": "The relevance of its theme and the good performance of her lead actress will save it from oblivion, but on the other hand this is an historical drama completely made by the book and I say this because the whole narrative structure is built in a basic way and already seen countless times before, because once the main conflict is exposed even if you don't know anything about the real case, it's quite evident that you know how everything will end. And although many times it's said that the journey is better than the destination, in this case it's not so because the journey despite being built with respectable quality, never rises above the average."}, {"rating": "10", "text": "A most watch! Based on real events. There were many woman activists that we have to thanks for, but this story is about a woman that tackled the 'behind the doors'."}, {"rating": "7", "text": "Truly a revolutionary and interesting biopic. It portrayed Ruth Bader Ginsburg's life prior to becoming a Supreme Court Justice. Not only did it provide information on her life, but it also provided an inspirational message to many to stand up for your rights and beliefs."}, {"rating": "7", "text": "This was an interesting watch, in terms of the biographical element, although it is a bit bland in terms of the drama element perhaps. Its mostly court based but then I suppose thats maybe to be expected(!). The performances are decent and I thought it was pretty thought provoking but it may be a little slow and a little bland for some peoples taste. The theme of gender equality is certainly an important one and its worth watching but if the political story isnt of interest to you, then obviously this won't really appeal."}], "recommendations": ["dallas_buyers_club", "bombshell", "erin_brockovich", "american_pastoral", "mary_queen_of_scots", "disobedience", "philadelphia", "the_white_tiger", "the_danish_girl", "my_cousin_rachel", "the_imitation_game", "the_reader", "richard_jewell", "the_miseducation_of_cameron_post", "dead_poets_society", "the_other_boleyn_girl", "the_mauritanian", "colette", "denial", "a_united_kingdom", "just_mercy", "hidden_figures", "ingrid_goes_west", "miss_sloane", "race"]}