{"id": 4324, "title": "Once Upon a Time in Mexico", "starring": ["Antonio Banderas", "Salma Hayek"], "runtime": 102, "genre": ["Action", "Drama", "Mystery"], "description": "Hitman \"El Mariachi\" becomes involved in international espionage involving a psychotic CIA agent and a corrupt Mexican general.", "releaseYear": "2003", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/oY0Yqsj4TwkjELkIHXJimjdbV8M.jpg", "categories": {"plot": 6.833333333333333, "acting": 8.0, "ending": 5.0, "soundtrack": 8.0, "cinematography": 4.0, "familyFriendly": 3.0, "funny": 5.0, "action": 8.0}, "reviews": [{"rating": "9", "text": "It was Johnny Depp's idea for Sands to wear tacky T-shirts. He even sent his sister to Florida to find the tackiest ones from tourist stalls."}, {"rating": "9", "text": "After all the credits, we are treated to one last quick image of Agent Sands (Johnny Depp) with no eyes."}, {"rating": "9", "text": "guyfugugguguugjgjgjhhjihhijh,,,,,,,,,,,,,,..............@#+×=%/_€£^&*().,??!;:\"'▪○●□■☆⊙°•¤《》♤♡◇♧¡¿{}[[》》"}, {"rating": "1", "text": "The most irritating movie I have ever had the misfortune to watch. Would have been better if there was a story instead of blindly jumping from scene to scene. All the BS gunfight scenes make me angry just thinking about them."}, {"rating": "9", "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"}, {"rating": "9", "text": "$+$+$+$+$+$+$+$+$+$+$+$+$+$+$+$+$+$+$+$+$+$+$×$$×$×$×$$×$$$$$$$$$$$$$$$$$$$$$$$$$$%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%"}, {"rating": "9", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$,$,$,$,$,$,$,$,$,$,$,$,$,$,●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》"}, {"rating": "9", "text": "○●○●○●○●○●○●○●○●○●○●○●○●○●○●○●○●○●○÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,,++,+,+,+,+,+,+,+,+,=,=,=,=,=,=,"}, {"rating": "9", "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@:@:@:@:@:@:@:@:;@;@@;;@@:@:@::@:@@;@;@;@;@;@;@;@;@;@;;@"}, {"rating": "9", "text": "¡¿¡¿》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¡¿¡¿》¿¡¿¡》¿¡¿¡》¡¿¡¿》¡¿¡¿》♤♡♤♡♤♡♤♡♡♡♤♤♤♡♡♡♤♤♡♡♤♤◇♤♤♡♡♡♡♤♤♡♤♤♡"}, {"rating": "9", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"}, {"rating": "8", "text": "After Robert Rodriguez made his $7,000 first film \"El Mariachi\" (1992) and his $3 million \"Desperado\" (1995), Quentin Tarantino told him they were the Mexican equivalent of Sergio Leone's first two spaghetti Westerns. After the low-budget ''A Fistful of Dollars'' and ''For a Few Dollars More,'' Leone moved up to bigger budgets for ''The Good, the Bad and the Ugly'' and ''Once Upon a Time in the West''  and therefore, Tarantino told his friend, Rodriguez should now make ''Once Upon a Time in Mexico.'' And so he has, for $30 million  still a relatively modest budget, as action movies go.\r Like Leone's movie, the Rodriguez epic is more interested in the moment, in great shots, in surprises and ironic reversals and closeups of sweaty faces, than in a coherent story. Both movies feed on the music of heroism and lament. Both paint their stories in bold, bright colors. Both go for sensational kills; if Clint Eastwood kills three men with one bullet, Salma Hayek kills four men with four knives, all thrown at once. In my review of \"Desperado,\" I praised Rodriguez for his technical skill and creative energy, but said he hadn't learned to structure a story so we cared about what happened.\r That's still true in \"Once Upon a Time in Mexico,\" but you know what? I didn't mind. I understood the general outlines of the story, I liked the bold strokes he uses to create the characters, and I was amused by the camera work, which includes a lot of shots that are about themselves.\r The actors in a movie like this have to arrive on the screen self-contained; there are flashbacks to their earlier lives, but they explain what happened to them, not who they are. With Antonio Banderas, Salma Hayek and Johnny Depp as his leads, and a supporting cast including Ruben Blades, Eva Mendes, Willem Dafoe and Mickey Rourke, Rodriguez has great faces, bodies, eyes, hair, sneers, snarls and personalities to work with. Banderas is as impassive as Eastwood, Hayek steams with passion, and Johnny Depp steams with something  maybe fermenting memories of \"Pirates of the Caribbean.\" The plot is at least technically a sequel to the first two movies, once again with El Mariachi as a troubadour with a sideline in killing (early in the movie, he  his guitar). I didn't remember the details of the first two films well enough to follow this continuation in detail, but so what? Essentially, El Mariachi (Banderas) is in self-imposed exile after the death of his wife Carolina (Hayek) and their daughter.\r Depp, who is a CIA agent of sorts, tracks him down with the help of a talkative bartender (Cheech Marin). He wants El Mariachi to stop a plot against the president by the drug kingpin Barrillo (Dafoe). Mickey Rourke's role is to carry a little dog in his arms, look sinister, and seem capable of more colorful dialogue than the screenplay provides for him. It's time for him to be rehabilitated in a lead.\r There are lots of fancy shots in the movie, but nothing quite equals a sensational sequence in which Banderas and Hayek, who are chained together, escape from a high-rise apartment and somehow rappel to the ground with one hanging on while the other swings down to the next level. Neat.\r Rodriguez is the one-man band of contemporary filmmakers, making his movies not quite by himself, but almost. His credits here say he \"chopped, shot and scored\" the movie, as well as writing and directing it, and he personally operated the new Sony 24-fps digital Hi-Def camera. As a skeptic about digital feature photography and a supporter of light through celluloid, I have to admit that this movie looks great. Maybe the camera has been improved, maybe the Boeing digital projectors are a step up from the underpowered Texas Instruments machines, but the picture is bright, crisp and detailed. Maybe it was a little too sharp-edged, since there is something to be said for the tactile softness of celluloid, but it was impressive, and an enormous improvement over what I've seen before, including Rodriguez's own \"Spy Kids 2.\" (\"Spy Kids 3-D\" doesn't count because of the murkiness inherent in 3-D.) What bubbles beneath all of Rodriguez's work is an impatient joy in the act of filmmaking. He started with hundreds of home movies when he was a kid, made \"Desperado\" for peanuts and somehow got a studio to buy it, and is still only 35.\r He talks about how easy digital filmmaking makes it for him and the actors  no fussing over lights, no worrying about film costs, lots of freedom to try things different ways. \"Once Upon a Time in Mexico\" sometimes feels as if he's winging it, but you have to admit he has an instinctive, exuberant feel for moving images. I am not sure a thoughtful and coherent story can be made using his methods, but made using his methods, but maybe that's not what he's interested in doing."}, {"rating": "5", "text": "Has some cool stuff like Depp on fire, but is otherwise a bit garbage. Couple of laughs."}, {"rating": "6", "text": "Esse filme  muito mais divertido que seu antecessor, e claro com uma ótima atuação de Johnny Depp.........................................................."}, {"rating": "7", "text": "Once Upon A Time In Mexico is like watching Spy Kids. It's so hard to take seriously because of the cheesiness and sytlized jumbling of action. That's why it's a fun film to watch."}, {"rating": "4", "text": "I'm both glad and disappointed that this movie continued in the footsteps of its prequel \"Desperado\". While this movie goes in the same category as desperado: \"the good bad movies\", it leaves me with mixed feelings. It's good at being bad, But repeating the joke doesn't make it any better. This movie is hilarious, but a bit of step down from its prequel. DO NOT TAKE THIS MOVIE SERIOUSLY LIKE IT WAS INTENDED TO."}, {"rating": "4", "text": "Offers a fatalistic view of the inevitability of political intrigue. And that's the good part. While aspiring to present something memorable, this movie doesn't overcome what even the most casual observer would find to be a bloodbath."}, {"rating": "0", "text": "This movie was absurd, ridiculous perverse and disgraceful. I can see how some liked the camera angles, the color and the energy. They were unique and interesting. However, the graphic violence was excessive and ruined the film for me . How can Rodriguez think we want to see the aftermath of someone's eyes being gouged out or their knees being shot off and burned? The bloody eye sockets and congealed blood ....for a good half hour was completely unnecessary. What could that possibly add to the film? You would be screaming in pain after your eyes were gouged out, not making wry comments and coersing little Mexican boys who don't speak English to guide you by the hand and help you shoot bad guys in the middle of a coup/popular revolution. Absurd! This movie is visual masturbation."}, {"rating": "9", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●●■÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "9", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"}], "recommendations": ["prisoners_of_the_ghostland", "the_great_wall", "armageddon", "blackhat", "guns_akimbo", "the_shallows", "immortals", "the_hateful_eight", "hanna", "300_rise_of_an_empire", "king_arthur_legend_of_the_sword", "lord_of_war", "free_fire", "revenge", "the_american", "public_enemies", "doomsday", "machete", "in_a_valley_of_violence", "top_gun", "mile_22", "mad_max_fury_road", "miami_vice", "hardcore_henry", "transformers_the_last_knight"]}