{
  "id": 2846,
  "title": "Once Upon a Time in Venice",
  "starring": [
    "Bruce Willis",
    "Jason Momoa"
  ],
  "runtime": 94,
  "genre": [
    "Action",
    "Comedy",
    "Thriller",
    "Mystery"
  ],
  "description": "Steve Ford is a private detective in Venice Beach, Calif., who's good with the ladies, bad with the punches and wild about his dog Buddy. When local thugs steal Buddy, Ford turns to Spyder, their devious leader, and forges an unlikely alliance. With help from his best friend, Steve pulls out the big guns to retrieve Spyder's stolen cash and cocaine and save Buddy.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5rr7tQfzS0ARqEea3W9SNSFGRzb.jpg",
  "categories": {
    "plot": 4.428571428571429,
    "acting": 4.555555555555555,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.4,
    "action": 5.25
  },
  "reviews": [
    {
      "rating": "3",
      "text": "One of Bruce Willis's latest films is a very chaotic, comedy-based crime thriller. Unfortunately something went wrong and finally we got something as usual. The plot focuses on the perils of a corrupt cop / detective who loses his doggy through his shady business. An ordinary mongrel for whom the main character is ready for a skateboard in the same underwear. The script turned out to be a torn-down combo of many similar productions, and the actors did not even try to be convincing."
    },
    {
      "rating": "4",
      "text": "Okay obviously its not going to make anyone's top-10 list but I enjoyed Once Upon A Time in Venice. Plot is nothing to write home about, Bruce Willis plays Steve, a Private Detective until one day he pisses off the the wrong people, he owes money to one person then has to do something for another person all to get his beloved dog back. Its nice to see Bruce Willis actually cut loose and have fun for a movie instead of sleep walk through a movie. The movie blunders towards the end where it just abruptly cuts off, leaving loose ends untied."
    },
    {
      "rating": "5",
      "text": "An action comedy about down but still kicking Steve Ford (Bruce Willis), the only private investigator in L.A.-s Venice Beach, who tries to get his life back in order and chases the guys who stole his dog.Also appearing: John Goodman, Jason Momoa, Thomas Middleditch, Famke Janssen, Emily Robinson, Adam Goldberg, Kal Penn, Wood Harris, Tyga, Thom Rivera and others.Have you ever watched a movie and said to yourself: hey, I should be making movies. I could certainly write better than this, so why not try?That’s exactly what brothers Mark and Robb Cullen must have been thinking. They have a reason to feel confident too. Both have been active in TV for years – producing and writing for different series –, and the quality of writing in TV is decidedly higher than in blockbuster movies.The brothers have also written 2010’s action comedy „Cop Out“ starring Bruce Willis and Tracy Morgan, directed by Kevin Smith – the only Kevin Smith movie he didn’t write himself – so they had another good reason to believe that making movies is the next logical step. Not to mention legendary Willis agreeing to star in the new one, too.But nothing is easy just because talented people have made it look so. „Venice“ comes across not as exciting action comedy like the trailers might make you believe but rather a generic TV pilot which lasts for 97 minutes, although 30 would be enough.Sure, the Cullen brothers can write and direct, that’s what they do for living, but they have no good ideas about what to do with those colourful characters and situations they have sucked out of the keyboard.Granted, there is some action and light humor, and something is always happening, but the result is just off. The movie has so little heart or character or world building that it’s difficult to care about any of this.It certainly doesn't help that there's nothing interesting about the main character – it’s just Willis doing his usual schtick. The only near-intriguing character is Jason Momoa’s powerful but also heartful Latino gangster. You may remember him as Khal Drogo from the first season of „Game of Thrones“, and he’s the new superhero Aquaman.Willis has appeared in lots of mediocre or downright crappy movies during his career spanning nearly 40 years now, so „Venice’s“ failure doesn’t hurt him in any way, it’s just business as usual.His performance doesn’t seem tired, but it’s far from exciting either. Some of his misadventures may look kind of interesting in trailers, but seem weak in the actual movie – yes, I am talking about the long skateboarding part in the beginning.Willis has probably lost followers during his \"Nicolas Cage phase\" (appearing in lots of straight-to-video-quality stuff in 2010’s), but there are always some who can't get enough of his trademark bald-head and smirk. If you really like colorful „crime“ comedies, \"Venice\" has something for you too. Everybody else, just beware.The best thing about „Venice“ is that everybody involved at least tried to make something good. So it’s gonna be OK as a part of late night Netflixing or something. But there are surely better entertainment in cinemas at any given time of the year, including right now."
    },
    {
      "rating": "5",
      "text": "Nice to see Bruce Willis in something recent that isn't completely terrible. It's still a rather mediocre movie, but the actor seems to be having some fun and putting in a moderate amount of effort. Something that we haven't seen him do in quite some time. He basically just plays an old dude who refuses to grow up and spends his days getting mixed up in crazy situations as a private detective. Willis has too many years on him to play a character like this in any believable fashion, but the movie is pretty self-aware about it as just about everyone he comes in contact with mentions it in some way.It kind of aimlessly wanders for about the first 30 minutes or so before finally picking up a plot. From there we just watch Willis make crazy deals with different shady individuals in an effort to find his dog and get bombarded by a bunch of weird, underdeveloped side-characters. There's no real action to speak of. Just a very brief shootout in the last ten minutes and the occasional punch thrown. It's really more of a comedy. Not a particularly great one, but the hijinks are pretty amusing.I loved John Goodman in this. He was delightfully droll. Nothing else about Once Upon a Time in Venice really stands out, but it can a suitable time waster. Some humorous moments, a cute dog, and Jessica Gomes' breasts are really all it has to offer. While better than the majority of the stuff he's been in over the past few years, Bruce Willis still has a long way to go before getting back to the quality work we once expected from him.5.8/10"
    },
    {
      "rating": "7",
      "text": "This light action-comedy piece of fluff runs on for a mere 94 minutes and does a far better job of providing some entertainment than most of the bloated gas-bags being shoveled out of Hollywood with run-times exceeding two hours.  The New York Times review complains about long-in-the-tooth Willis beating up much younger men, but neglects to mention Willis getting beat up and knocked out three or four times, and once knocking himself out by trying a diving escape through a window that is anything but open.This is not a great action flick, nor a hilarious knee-slapper, but it does get the job done and is worth a watch.  And I refer the NY Times to security video on YouTube of a 73 year old former US Marine knocking out an armed robber in a 7-11 with a single punch to the jaw."
    },
    {
      "rating": "6",
      "text": "For me this movie is 6.5. I mean it is quite fun and interesting to watch, even though many of the things that happen on screen are quite unrealistic in the way they make their decisions or what is happening, but it is still fun movie, only thing - you forget about it after watching quite fast, so I guess I can't give it a positive rating."
    },
    {
      "rating": "8",
      "text": "Holy s***, this was hilarious. It was so bad that it was really good. And the random stars throughout this flick were excellent. Hell they even had John Goodman & Jason Momoa."
    },
    {
      "rating": "3",
      "text": "I thought a movie with Bruce Willis can't be that bad. Well I got proved wrong."
    }
  ]
}