{
  "id": 1341,
  "title": "Once Upon a Deadpool",
  "starring": [
    "Ryan Reynolds",
    "Josh Brolin"
  ],
  "runtime": 118,
  "genre": [
    "Comedy",
    "Action",
    "Adventure"
  ],
  "description": "A kidnapped Fred Savage is forced to endure Deadpool's PG-13 rendition of Deadpool 2 as a Princess Bride-esque story that's full of magic, wonder & zero F's.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5Ka49BWWyKMXr93YMbH5wLN7aAM.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 3.4,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Deadpool 2 was fine and fun enough on its first watch, but this was straight-up a chore to sit through. The Fred Savage cutaways have their moments, but without the over-the-top gore and R-rated banter, this just feels awkward and bland. The post-credits tribute to Stan Lee is great though, maybe YouTube that in a few months..."
    },
    {
      "rating": "0",
      "text": "This movie is Deadpool 2 but PG13. No blood, not much swearing, some stuff cut out. Then they've added like maybe 4 minutes of Fred Savage in bed and spliced it into the movie 1 minute at a time every 30 minutes.Even if you are 13 years old I would not recommend this. Just wait until you're older and go see the actual movie, you will thank yourself later. I highly recommend not going to see this movie."
    },
    {
      "rating": "0",
      "text": "Love Deadpool 1 and 2. this is nothing but a cash grab and to see if they can make some crappy PG-13 cookie cutter Deadpool movie. A Deadpool that isn't Rated R isn't worth the time to see."
    },
    {
      "rating": "0",
      "text": "This movie is like watching porn, but nobody have sex in it. Don't waste your time"
    },
    {
      "rating": "2",
      "text": "Ni la pude terminar de ver, sólo un niño menor de 10 años podría disfrutar de esto a secas, en general es verdaderamente aburrida..."
    },
    {
      "rating": "10",
      "text": "This film was enjoyable. I like how this Deadpool was a great pg 13 adaptation of mech with a mouth who loves to use curse words."
    },
    {
      "rating": "8",
      "text": "I don’t usually review movies anymore but thought I’d add my score to this one since imo it doesn’t deserve to be rated so low. All in all I really enjoyed OUaD, not as much as the original cut or the first movie, but for what it is, I certainly didn’t hate it.Honestly, I kinda wish the “family friendly” promise was adhered to more closely, but the absence of the over-the-top violence and language didn’t really ruin the film for me.What WAS a little bit of a bummer was the editing of the film. The editors presumably did their best with the time and money they had but there were some obvious moments that really could have been cleaned up better (and some of the storyline felt a little left out at times). Besides that, though, I felt like this was pretty well done.I think the key to enjoying this film is accepting it for what it is, not what it isn’t. No, not quite as good as the original cut, but still a heck of a lot of fun"
    },
    {
      "rating": "3",
      "text": "Basically it's a PG-13 Deadpool 2 but with additional scenes starring Deadpool and Fred Savage. There were a few moments that I laughed. I think that's because Ryan Reynolds and Fred Savage are great together and make some funny jokes but overall this movie was a massive disappointment. Don't waste your time watching this film like I did."
    },
    {
      "rating": "7",
      "text": "This isn't a great movie, but it isn't a bad one either. Still gives us some jokes that were good. I still somewhat enjoyed this for the most part. Even if this was obviously a cash grab."
    },
    {
      "rating": "2",
      "text": "The existence of this cut is a joke in itself, but it stops being funny when you actually watch it. The movie is filled with jokes about how it's PG, baby-proof and fun for the whole family, which will tease any child actually watching it into seeing the R rated cut at some point, with or without permission. It's basically just a PG trailer for an R film, and if you seriously think your kids need that, I can't help you.As for adults, even the most Deadpool-starved among you will be bored by this low-effort gag reel."
    }
  ],
  "recommendations": [
    "the_spongebob_movie_sponge_out_of_water",
    "the_three_stooges",
    "the_babysitter_killer_queen",
    "a_haunted_house",
    "meet_the_spartans",
    "deuce_bigalow_european_gigolo",
    "movie_43",
    "entourage",
    "crank_high_voltage",
    "zombieland_double_tap",
    "one_year_one_night",
    "grown_ups_2",
    "the_dictator",
    "dumb_and_dumber_to",
    "hot_tub_time_machine",
    "venom_let_there_be_carnage",
    "garfield_a_tail_of_two_kitties",
    "30_minutes_or_less",
    "ted_2",
    "night_at_the_museum_battle_of_the_smithsonian",
    "sex_tape",
    "rush_hour_3",
    "scary_movie_5",
    "the_watch",
    "scouts_guide_to_the_zombie_apocalypse"
  ]
}