{
  "id": 882,
  "title": "One Year, One Night",
  "starring": [
    "Nahuel Pérez Biscayart",
    "Noémie Merlant"
  ],
  "runtime": 130,
  "genre": [
    "Drama"
  ],
  "description": "Ramón and Céline are a young couple that attended a concert at the Bataclan theatre in Paris on the fateful night of November 13, 2015. They survive the attack, but when they leave the theatre, they are no longer the same. That night leaves a deep scar on both their lives and each tries to cope with the aftermath as best they can. Céline desperately tries to leave the events behind her, clinging to her previous life, while Ramón repeatedly goes back to that night, trying to remember and understand what happened. Nonetheless, they both face the same key question: how to reconnect and move on together?",
  "releaseYear": "2022",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/4gQMa8BgSYe9CaDJRzJ9TvjS6LX.jpg",
  "categories": {
    "plot": 4.888888888888889,
    "acting": 7.0,
    "ending": 6.666666666666667,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 4.6,
    "funny": 5.951219512195122,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Ok seriously, 95% of the time I agree with most of the critical concensus here. But on this one, I can't believe it has such a low score. The movie was FUNNY, it just was. Sure there were holes in the plot, sure the writers took short cuts, sure the ending wasn't great. But for my money, it was just a simple mostly hilarious movie and my friends and I laughed our asses off to it. Michael Cera was hilarious as he usually is, and he basically stole the best lines from Jack Black David Cross was great too. Year One, don't entirely buy the critical dismissiveness on this one. If you want to laugh, consider seeing this."
    },
    {
      "rating": "2",
      "text": "I rated this movie the total number of times I snickered throughout its entire 97 minutes. It really boils down to the fact that Jack Black and Michael Cera are a bad combo; combine that with the movie's lackluster writing and you get \"Year One.\""
    },
    {
      "rating": "10",
      "text": "This is an example of don't trust the critics. I just saw this movie a few hours ago, and couldn't stop laughing. The entire theater seemed to be in agreement as at times the laughter was drowning out the lines. GREAT comedic movie."
    },
    {
      "rating": "9",
      "text": "This movie is so funny I laughed my pants off my thought is that Michael Cera was better than Jack Black I would say this is a great summer comedy."
    },
    {
      "rating": "10",
      "text": "BEST MOVIE EVER!!!!!! who cares if everything about it sucked. THis movie is the best movie ever its so epic!!! Screw everyone saying that its, \" FLAWED\" this movie doesn't rip off anything, its so origional"
    },
    {
      "rating": "9",
      "text": "Excellent movie, everyone who disliked it can go watch the proposal or maybe enjoy some shindler's list whilst your at it, keep your boring movies to yourselves and let us have our great and fantastic bible spoof films like this its definitely better than any Monty python film."
    },
    {
      "rating": "2",
      "text": "I actually felt my I.Q. level fall at least a few points after this idiot-fest was over. I can also thank this movie for single-handedly destroying my respect for every actor in it, especially the two leads. Paul Rudd, how could you?"
    },
    {
      "rating": "10",
      "text": "There are few movies I can watch over and over. The Matrix, LotR - The Fellowship of the Ring, The Hobbit and I've recently added Year One to this short list. The first time I saw it, I think there was just too much to take in. It's crammed with jokes and subtle body language. If you're stuck up or don't like outrageous humor like Dumb and Dumber, don't bother. I don't feel like reading another \"Woe is me,  this movie is so disgusting/offensive/gross\". Go back to your Downton Abbey.\r Best parts: Michael Cera dancing, \"You can stick your finger in it's hole\", \"Ribbit... Go Away Marlack\", Michael Cera Sleep Over with gassy kid, \"muscle tribe of danger and excellence\", \"What does this look like?\", \"I've seen what you do with your right hand, no thanks.\""
    },
    {
      "rating": "3",
      "text": "It was kind of funny, but it was also full of gross, unnecessary dialogue. Overall, it was O.K., but I am giving it a 3 out of disgust. One of Jack Black, the #1 comedian in the world's weakest movies."
    },
    {
      "rating": "10",
      "text": "I really don't understand the low rating because I absolutely loved this movie. I've watched it several times and could keep on watching it again and again. I wasn't a Jack Black fan before seeing this, but now I'm more interested in seeing his movies. Michael Cera was terrific, as one might expect."
    },
    {
      "rating": "10",
      "text": "Awesome movie. The entire theater was in tears it was so funny."
    },
    {
      "rating": "8",
      "text": "I thought it was a really funny, well made movie. Does not suck. At all."
    },
    {
      "rating": "0",
      "text": "Ummmm... What can I say about this movie? It has disapointed me more then all the past god of war knock-off movies combined. As a christian I am thouroughly offended by the jokes and during the entire film there were bladenly obvious and unclever sexual references and jokes. I'm all for them if there clever and funny (arrested development for example) but I almost hated sopmorical humor after watching this piece of s***. I am not even kidding one of my friends I was watching this with just walked out and I discussed with my other friend wether we should join him or not and now I wish I did. I am not even kidding when I say that I double dipped with my two friends to watch the new (now old) star trek and felt no shame as year one was worth getting paid to watch."
    },
    {
      "rating": "3",
      "text": "Very disappointing. I like Black and Cera, but it just wasn't funny."
    },
    {
      "rating": "0",
      "text": "The entire movie contained forced comedy and lacked imagination. Many actor/actresses should be ashamed that their names and careers are tied to this piece. If you expect nothing from this movie, you are asking for too much."
    },
    {
      "rating": "7",
      "text": "I don't agree with all the negative grades. It was a good movie, funny scenes, jack black is funny as always and everything is ok."
    },
    {
      "rating": "9",
      "text": "Very funny, with jokes very well done, this is really an example of \"do not trust blindly in the critical\", it is worth watching and be sure the writers had a lot of work on the jokes, because they are perfect! To give a low grade for jokes so good, one must be very boring, and is running with all work very well executed! In short: It's worth seeing, and give a good grade, to show these critics  that they are jerks!"
    },
    {
      "rating": "0",
      "text": "The plot had absolutely no direction; it seemed like they thought up the movie as they made it. Michael Cera and Jack Black just flat out didn't work as a comedy team because they rely on completely different kinds of humor, Cera on being quietly awkward and Black on being over the top and dirty. But what made this movie unbearable was that it just wasn't funny. All of the above would've been tolerable if I had laughed a decent amount, but nothing in this movie evoked more than a chuckle. Don't waste your money on this movie. Heck, don't waste a Netflix rental on this movie. It's a waste of 1 hour 40 minutes of your life that you'll wish you had back."
    },
    {
      "rating": "5",
      "text": "I had really high hopes when I heard the concept and saw that it starred Michael Cera and Jack Black. After seeing the trailers, I was really hoping that it would be better than what was shown. Unfortunately, this movie was a bummer. Not horrible- it was still light years better than Land of the Lost- but not great considering the talented roster of supporting actors. It was also a shame to see Jack Black recycling the character we've seen in nearly all of his prior movies. It was appropriate for this type of film, but it just seemed stale, like Will Ferell in LOTL. Michael Cera was great, doing his usual sad sack self deprecating schtick. Overall, this movie seemed like a half-ass Monty Python or Mel Brooks movie. It mostly reminded me how good Life of Brian was. In this case, I set my expectations too high. My benchmark this year for comedies is The Hangover, and this didn't even come close. Wait for the DVD or a matinee and you won't feel like you spent too much."
    },
    {
      "rating": "4",
      "text": "It had it's funny moments but for the most part Year One just dragged on. It seemed like they were aiming for a plot but missed entirely. They do have sum good comedians n this movie but they cant bring comedy 2 a poorly written script. it wud've looked better if they wud've just ad libbed and improved the whole movie...That wud've been worth seeing."
    },
    {
      "rating": "7",
      "text": "Hilarious film throughout. what it lacked though was that the storyline was weak and it had to many sexual preference that you felt it was an rated R film. i did enjoy the chemistry between cera and black and how they always seem to find trouble. however some of the jokes are to outdated and often times overused like jacks weight and cera's virginity. not your top ten movie but it does deliver what its supposed to...laughs"
    },
    {
      "rating": "9",
      "text": "I watched this movie at the cinema and was 15 mins into the movie when i arrived yet i still thought this movie was completely hilarious all the critics that gave it bad rating obviously don't know anything about films, of course there are better parody's out there but none with awesome actors like jack black and/or michael cera their addition to this film helped it place in MY top ten greatest movies of all time."
    },
    {
      "rating": "1",
      "text": "I love Michael Cera. jack black's funny when he's not way over the top. the previews were promising, but this movie was just not funny. nearly all the jokes were just pathetic attempts at a laugh... the script could have been written by a 3rd grader. if you really thought this movie was funny, you're just not smart."
    },
    {
      "rating": "2",
      "text": "Thoroughly disappointing."
    },
    {
      "rating": "2",
      "text": "Jack Black - funny actor. Michael Cera - devoid of humour, charisma and charm. Jokes - ok'ish, but mostly flat."
    },
    {
      "rating": "10",
      "text": "I thought that this movie was hilarious and the actors were the icing on the cake. I didn't think that Jack Black was very funny but Michael Cera was very comical and the pure stupidity of the movie was hysterical!"
    },
    {
      "rating": "2",
      "text": "Even if you love cera or black (i usually dig both) resist the temptation to see Year One. it's boring and not at all funny. these guys should be ashamed."
    },
    {
      "rating": "0",
      "text": "I love Jack Black but this was the worst movie ever! Walked out in the middle--just a horrible movie!"
    },
    {
      "rating": "4",
      "text": "This movie would've gotten a better score from most critics if there was actually a plot in it. It seemed to have a large amount of potential, but overall falls flat. If you want to watch a decent comedy with promising actorscomedians, watch Funny People."
    },
    {
      "rating": "0",
      "text": "I cant believe this is still in theaters i could do a play in my back yard thats better than this!"
    },
    {
      "rating": "7",
      "text": "While nothing special, this movie moves along nicely and provides some good laughs provided that one (a) like this sort of mindless movies (b) is in the mood for some light entertainment."
    },
    {
      "rating": "3",
      "text": "Jack Black was kind of funny, but the rest of this was garbage. Way too much unfunny biblical stuff, too."
    },
    {
      "rating": "6",
      "text": "Not especially funny. It had some gross parts which were entirely unnecessary. I give it a 6 because it makes basic digs at religion."
    },
    {
      "rating": "7",
      "text": "Is this movie really, really stupid? Yes, absolutely. I expected as much. But I did not expect to laugh and enjoy it as much as I did. Perhaps my low, low expectations for this film is what made me enjoy it as much as I did, but I'm not gonna lie, I had an enjoyable movie-going experience."
    },
    {
      "rating": "0",
      "text": "could this movie be any more insulting to GOD? This is one of the few movies I have ever walked out on. It was that bad."
    },
    {
      "rating": "3",
      "text": "\"Year One\" is no \"Life of Brian\", but any film, especially a mainstream one, that dares to satirize(and even question) organized religion, has balls. Whereas \"Monty Python's Life of Brian\" was ideologically similar to Depeche Mode's \"Blasphemous Rumors\"(both movie and song begrudgingly acknowledges the existence of God), \"Year One\" seems more in tune with XTC's \"Dear God\", in which Zed(Jack Black) no longer believes that the \"junk is true\"(paraphrased from the Andy Partridge lyric). The music video for \"Dear God\"(directed by Nick Brandt) shows a small child at the base of a barren tree, conspicuously apple-free. The heretical image challenges the concept of original sin as nothing more than a prefabrication. There's a tree in \"Year One\" too, akin to the Tree of Knowledge(from the Book of Genesis), where Zed takes a bite of the forbidden fruit with the expressed hope that its transgressive flesh will make him wiser. At one point, although the film won't come out and say it, Zed thinks he's Jesus Christ. But then the \"chosen one\" has an epiphany, similar to a hypothetical Jesus losing his faith at the crucifixtion. As the Sodom townsfolk gather rocks at his stoning(this is Zed's Passion), he realizes that nothing happened to him at the Holy of the Holies, so he loses faith and relinquishes his claim on being a savior. Late in the film, he tells the people to \"make your own destiny\"(implying that they forego idolatry and practice free will), because there's \"no pearly gates, no thorny crown\". In spite of its provocative subtext, \"Year One\" is sunk by its own puerility(the usual suspects: urine and poop make cameos). Too bad. Where Zed chooses the girl over being a religious icon, \"Year One\" plays like \"The Last Temptation of Zed\"(in which the Nikos Kazantzakis novel is rewritten when the Christ-like figure succumbs to earthly pleasures for good)."
    },
    {
      "rating": "0",
      "text": "The less said the better. A waste of your time. Avoid."
    },
    {
      "rating": "2",
      "text": "Sure year one had its laughs but it had so many stupid parts that I think this movie could be the worst movie of the summer."
    },
    {
      "rating": "3",
      "text": "Just plain unfunny. It gets a three because I laughed at the trailer."
    },
    {
      "rating": "8",
      "text": "I loved this movie. However, the reason while it isn't a 9 or 10 is because as at this certain point (when the two cave men enter the barbaric city) the jokes sudden stop becoming as fun as they were before and I found myself either not laughing as hard as I was before or not laughing at all. Nonetheless, this is a movie definitely worth checking out that anyone who loves a good comedy should see."
    },
    {
      "rating": "1",
      "text": "Save your money, do not go see this movie. It says it's a comedy, but I barely laughed at all while watching it."
    },
    {
      "rating": "3",
      "text": "Ever seen a promising trailer with very funny cut-scenes but then when you actually see the movie, the feeling you have before eatch of those scenes is somewhat awkward due to how depressingly bad the movie is and then the whole scene is just ruined? That happend to me before each and every scene that had potential to be even remotely funny. This movie is the epitome of whats wrong in our now make-a-quick-buck platformed entertainment industry."
    },
    {
      "rating": "10",
      "text": "This is possibly the best movie of the year. The jokes, from lesbian innuendo to deadpan virginity references, are infinitely funnier than anything that \"great comedies\" like Dr. Strangelove or The Producers could ever come up with. Anyone who didn't like this movie either \"had an IQ of above 80\" or has no knowledge of what great film really is."
    },
    {
      "rating": "9",
      "text": "Hysterically funny from about 10 minutes in to the very end, of course being very susceptible to sexual humor definitely helps."
    },
    {
      "rating": "4",
      "text": "There's more humor in most thrillers than Year One."
    },
    {
      "rating": "6",
      "text": "It's a typical Apatow movie set in the times of the Old Testament. And the Old Testament is perfect for an Apatow movie's sex&fart jokes. Yes, it is a different kind of humour than what Mel Brooks had, but this movie's plot is more comprehensive, I think. If you survive the first 20 minutes, it turns out to be quite funny to reflect today's order of values in the biblical setting."
    },
    {
      "rating": "6",
      "text": "The films opens with a strange but digestible set of caveman gags. The film however seems to continue with the same types of gags throughout various time periods without ever offering anything fresh. My the end of the movie, you are left in a dramatic climax scene full of characters that you have long stopped caring about, in a movie that has definitely overstayed its welcome."
    },
    {
      "rating": "10",
      "text": "Best movie of the year. Micheal Cera should win best supporting actor award. I would rank this as #3 all time behind Felini's 8 1/2 and Citizen Kane, and slightly ahead of Godfather part 1."
    },
    {
      "rating": "7",
      "text": "I will admit, the movie could have been a little more funny then what it actually was, but a decent script and some decent actors, with a decent concept and you got a decent movie."
    },
    {
      "rating": "7",
      "text": "You'll be getting stoned....TODAY!!!!! Classic."
    }
  ]
}