{
  "id": 4551,
  "title": "One Direction: This Is Us",
  "starring": [
    "Harry Styles",
    "Niall Horan"
  ],
  "runtime": 92,
  "genre": [
    "Documentary",
    "Music"
  ],
  "description": "\"One Direction: This Is Us\" is a captivating and intimate all-access look at life on the road for the global music phenomenon. Weaved with stunning live concert footage, this inspiring feature film tells the remarkable story of Niall, Zayn, Liam, Harry and Louis's really like to be One Direction.",
  "releaseYear": "2013",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cxIoYa7uboxiDvWGxdad6fvgpcH.jpg",
  "categories": {
    "plot": 4.666666666666667,
    "acting": 6.666666666666667,
    "ending": 3.0,
    "soundtrack": 8.0,
    "cinematography": 7.0,
    "familyFriendly": 8.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Overview\rAn overview of the rise, and current members, of One Direction.\r Review (with Spoilers)\rBack when I used to watch the original X-Factor these guys were on, but being that boy bands are more miss than hit, at least with my music taste, I would skip their performances. A few years later, after them losing, they are now following in many other musicians’ footsteps and releasing a documentary/ concert movie. But, the question is: can this movie convert you into a fan, or is just made for their established audience?\r Characters & Story\rOf the band you can see Harry, Zayn and Niall are the potential breakouts with Liam and Louis having their place, but not being as charismatic or interesting. The reason for this is three (Harry, Zayn and Niall) all have this sort of appeal in which they seem like they could be the leads. For example, Harry comes off as the sort of modern version of Mick Jagger, though with less drugs; Zayn seems a bit more modern in comparison with him seeming like he would work within a modern emo-pop band; and then Niall seems like your general boy next door, which is his appeal. Together, though Harry and Zayn more so, they seem to get the most focus when it comes to interview segments, seeing their families, or life before fame, than the others.\r As for the film as a whole, between songs from their first two albums and interview segments, as well as us seeing them venture around tour stops, that is what makes up the movie. You learn what they did before X-Factor, slightly, and then what happened in the lead up to their audition; you hear about some of the band drama like Louis and Liam not being fond of one another, during their time on X-Factor; and them once thinking of kicking out Zayn; but for the most part you see a strong brotherhood in which it seems together they are far stronger as a group than they would be as solo artist.\r Praise\r Be it the fact that some members, naturally, have more name recognition than others, it was good, to me, that the people who you’d recognize the most are the ones who got the most screen time. And while I may not be the aimed for demographic, I did like two of the songs within the film. Those two not so great I would want to download them, but I do think when you watch the film, despite how asinine the idea is, you can understand why they are being compared to The Beatles, past them both being British boy bands.\r I mean, One Direction seems physically/ visually fit for the times. They are a bunch of tattooed model looking boys, but they aren’t cookie cutter per se. More so, they are almost like a PG version of the Jackass crew. And, like The Beatles, currently they are in a phase in which their aim, more so, is mainstream music to appeal to a female fan base, no different from when The Beatles were doing “She Loves You,” “I Want To Hold Your Hand” and their other classics. But, the question does remain if the boys’ music will grow up and become deeper, or if they simply will just look edgy, but continue to sing songs which are as shallow as a kiddy pool.\r Criticism\r Let it be known, this film isn’t likely to convert you. For one, there isn’t really any background into any of the songs to make them seem deeper than they appear, and while you must admire their fans for taking them to where they are, between the songs and who we see of their fandom, you can tell that they aren’t trying to appeal to anyone past a female demographic.\r But perhaps my main issue is that there isn’t much of a narrative when it comes to the film. In other concert films there is usually a build toward something, be it like Kevin Hart’s Let Me Explain in which we followed him on his way to Madison Square Garden or Michael Jackson’s This Is It which chronicled his preparations for his would-be arena stay. However, for This Is Us we are basically just following them around in a style no better than what fellow British Band Little Mix had when their band went to Japan, with the only difference being that One Direction goes to more places and Little Mix posted their videos to YouTube. Thus making the film, outside the concert element, feel like bits which could have been put on YouTube years before the film, but they were saving it for a movie in hopes of making as much money Miley Cyrus or Justin Bieber made with their concert films.\r Overall: TV Viewing\r Honestly, I’m not even sure why a fan would buy this unless they are the type of fan which likes to collect everything the band ever put out. I say this because there are likely full, uninterrupted, concerts on YouTube and better interviews also within the same site. So, it makes this film seem like just a ploy for cash, more than something really trying to let you into the boys world and give you the opportunity to get to know them and their music. Because of that, I say this is a TV Viewing type of movie. Something which doesn’t need to be bought, or rented, for it doesn’t have that type of value where it needs to be seen"
    },
    {
      "rating": "5",
      "text": "While \"This Is Us\" was inspirational, charismatic, and affirmed that anything can happen it was still incoherent, sloppy, and without direction (no pun intended). What makes the film sloppy and incoherent is the fact that much of the scenes are out of place. For example, one moment you are listening to them in concert and the next you're seeing them on \"The X-Factor\". Additionally, some scenes give off a staged feeling such as when Liam and Harry are talking on the dock. Finally, it is blatantly obvious by the structure of the film that the studio rushed to get this out there fully knowing that it would make a ton of money."
    },
    {
      "rating": "0",
      "text": "Absolutely appalling waste of money. Poorly constructed documentary, avoid at all costs! Nothing more than a ploy to feed out of 12 year old girls mother's purses."
    },
    {
      "rating": "2",
      "text": "O this movies has 2 sides the directioner side and the normal man side-so this movieon the directioner side is perfect the movie is for teen girls and only they will say it is perfect i had a survey whit my frends whit it so i know,and on the regular male side like me the ,ovie is  pure cuz it is just no do not go and watch it if you do not like 1D i can listen to them but no so my score is 2 and that is it directioners can give it a 10000 but it will not help the movie is  and that is it"
    },
    {
      "rating": "1",
      "text": "If you're like me and think 1D makes ears bleed, then the obviously-scripted terrible humor movie this claims to be (heh, calling it a movie as if its good... trust me its not) will throw constant amateur footage of concerts at you instead of giving any scenes with the group in and if so, it will just be dumb little skits. Bad, ripoff, and it seems like on of those movies quickly made off a TV show just to make money and not entertain you in the slightest. Give it a miss."
    },
    {
      "rating": "9",
      "text": "gent q naja essa nota kkkkkkkk\ramei o filme achei mt bom , mas eu  esperava mais do filme :p\rum beijo pra quem leu até aqui\rbrigada dinada\rvaleu falou"
    },
    {
      "rating": "0",
      "text": "It seems like I have to make up for 150 character for  It's a crapy \"documentary\" about a crappy \"band\", that is only getting positive reviews for 12 year old girls that discovered metacritic."
    },
    {
      "rating": "7",
      "text": "The movie was not top-tier, but it was acceptable. I've listened to One Direction's music also, not a fan, but it's more or less fine, but the hate is unnecessary. Half of the 49 negative reviews are probably from haters who just gave it zero without watching the movie. I also see that some of the people created accounts just to rate this movie a terrible score."
    },
    {
      "rating": "9",
      "text": "This movie was  great. At first I didn't want to go because I didn't like them  but after the movie I love them. I love this movie and it's my favorite movie right now."
    },
    {
      "rating": "6",
      "text": "There are moments of clear absurdity  when the group of guys crafted on a Simon Cowell talent show insist that they can always just be themselves, for instance  and the film does lay on the “wacky kids” and “our fans are so important” gloss with marketing-ploy thickness. But there are moments of screwy honesty  a couple chats with obviously heartsick parents stick out as counterpoints to the celebration  and the actual concert moments are both better entwined and more explosively captured than anything of this popdoc ilk has so far managed (looking at you, Bieber and Perry). In short, there is nothing you wouldn’t expect, but at least it’s all done with flair. And it’s not like it’s made for anyone but the teenage girls who saw the concert the first time through anyway."
    },
    {
      "rating": "10",
      "text": "\"This is us\" is a wonderful documentary/concert movie for everyone. It doesn't matter if you are a fan of one direction or not. The 1D guys are  surprisingly charming, entertaining and also very talented. You'll enjoy it!!!"
    },
    {
      "rating": "3",
      "text": "Let's be clear, if you're not a fan of this guys there's no reason why you should watch this movie. You'll end up being more annoyed than entertained, (The 3D isn't bad but it won't improve your experience) I don't hate 1D as much as other people do, however, It's true when they say that this movie is only meant for their die hard fans."
    },
    {
      "rating": "0",
      "text": "who would make a movie on 1d  there just a bunch of **** who waste there times who  write songs  i rather watch katy perry : this is a part of me then watch this ****"
    },
    {
      "rating": "7",
      "text": "I was just starting to become a fan of One Direction's music when I decided to view this film and it actually helped me understand them better.  The guys themselves are charming, smart and talented.  The image they have to uphold is not.  It was very clear that there's the band and there's the phenomenon - as two separate entities.  Fans on the internet have uncovered just how controlling their management and label really is and it's quite clear in the way the film is formatted (song, \"our fans are great\", screaming fans, song, \"our fans\", screaming fans, song) that the one thing the team behind 1D doesn't want us to know is that the boys are actually well worth their fame and accolades.  They deserve to be praised for their talent and personalities but the label was, at this point, clearly hoping to just cash in and move on.  Go figure, that's the nature of a cutthroat industry, I guess.\r The best parts are when the band just gets to be themselves, and the highlight is when they all describe one another (consider Harry's \"Louis is a great person to just sit and admire what he's like\" and wonder if those rumors about them are in fact true...).  Louis is a deep thinker, has a heart of gold and is a leader but he is also offbeat and unusual, and, as a result, he completely fascinates his bandmates.  They are all drawn to him and he centers them.  Harry is the quintessential Famous Person, but he is incredibly uncomfortable with that being both his destiny and burden.  He shows introspect, intelligence and charm.  Liam is the high achiever, Type A perfectionist who may have spent too much time developing his talent and not enough developing a personality.  He's in the right industry for this, but as a brief argument shows, he can be overbearing in his workaholic nature too.  It's interesting to note he and Louis - the biggest personalities - did in fact clash during their run on X Factor, but they grew past and overcame their differences.  Niall is put forward as a \"goofy lad\" type but is easily the most self assured of the bunch, which might be why the outlandish personalities of the group tend to overlook him a bit.  Not that he cares, he's fine just doing him.  The now-exited Zayn is the heart.  Not \"of the group\", just the heart.  He is quiet, awkward, nerdy and cute.  His dashing good looks make people associate him with a Brad Pitt type persona but in reality he's more like a Matthew Grey Gubler type.  He is introverted, but the band honestly makes him shine.  It's a shame that dynamic ultimately wasn't enough for him to stick around.  See how interesting these guys are?  Their time on camera talking about themselves probably doesn't even amount to ten minutes of film.  It's a shame in a film about One Direction, the men who make up One Direction were not the priority of the filmmakers.\r All of them are wonderfully talented singers and Niall plays guitar.  Harry's voice probably stands out the most because it's powerful but raspy.  Zayn's is conventionally strong and deep.  Louis's voice is as unique and unconventional as his personality.  Liam can do it all and particularly knows how to work a good falsetto.  Niall has a unique nasal tone that somehow works very well and is never annoying or flat.  Their music has become much more rock since this film but you can see the beginnings of it at play here.  They perform a genius cover of Wheatus's Teenage Dirtbag and other performance highlights include I Would and Change My Mind.\r The inclusion of their starstruck parents was sobering, these adults have no idea how to navigate the world of mega fame and are simply left to trail behind their children, weeping with both pride and horror, as they conquer one thing after another.  It must be daunting to go from being the provider and protector to being a mere bystander in your teen/young adult's magnified life.  Disappointingly, all girlfriends are erased/not mentioned.\r The section that actually allows fans to speak for themselves is insightful and handled very well  I was so, impressed when the female fans explained they had formed profound, meaningful friendships with one another based on their love for the band.  Some even appeared to cherish finding that more than finding the band itself, which is just wonderful.  A throwaway line was quite powerful: \"They speak to us the way normal guys don't\".  There's even a goofy \"science\" skit where a (I assume) fake doctor \"explains\" fans chemical reaction to the band: \"The girls aren't crazy, they're just excited\".  And, really, what the hell is wrong with that?\r The film is controlled and too scripted, with everyone forced into neat little boxes and the format is monotonous.  A better film would simply be a fly on the wall documentary, where we see five (now four) fascinating, talented and genuinely interesting men interact naturally, within their isolated fame bubble.  Take away the script, just let them be."
    },
    {
      "rating": "10",
      "text": "It is a great film, which focuses more on how they built their careers from the music and passion of each, and games behind the scenes making it more fun"
    },
    {
      "rating": "10",
      "text": "it was an amazing it was enjoyable and its great for One Direction Fans you should go watch with a your family it was good time i enjoyed it  my son even enjoyed it."
    },
    {
      "rating": "8",
      "text": "A very good film if you are a fan of the boys but understandably if not people would not find it interesting. However it was nice to see the different personalities in the film and how dedicated they were to making their album."
    },
    {
      "rating": "1",
      "text": "dull money grab with no value beyond some trite fan service. he members aren't revealed instead we get sanitized versions of them that fail to captivate or surprise . more of a concert film than anything else."
    },
    {
      "rating": "10",
      "text": "incredible!! unbelieveble! beautiful! i love these guys so much!!!!!!!! all love"
    },
    {
      "rating": "9",
      "text": "a small view behind the tour scenes of one direction, showing live performances and funny camping dialogue"
    },
    {
      "rating": "10",
      "text": "best documentary film for a band, shows the connection between them and their fans and showcases their pure talent!"
    },
    {
      "rating": "10",
      "text": "AmazaynFabulouisExtraordinharryBrilliamPhenomeniallAmazing movie, touching and real. I'm really not into those movies, bit I've been such a fan since the start and watching this movie just makes everything seem so right. They were just five normal kids with abnormal jobs trying to have fun and making the world smile and I think this movie captures that."
    },
    {
      "rating": "9",
      "text": "A nice & humble documentary showing off the 5 boy’s lives outside of the band. I love that it includes a little TMH Tour. It’s definitely a good collection item for the fans to look back on."
    },
    {
      "rating": "10",
      "text": "louis deserves better, let mai boy sing bro??? and **** simon cowell of course"
    },
    {
      "rating": "10",
      "text": "Puras mentiras en este película pero le voy a dar 10 porque alch si me gustan un chingo ctm"
    },
    {
      "rating": "10",
      "text": "amazing guys, their songs are excelent and this movie is just perfect to me. makes me emotional. long live one direction."
    },
    {
      "rating": "10",
      "text": "Best movie I have ever seen. You get an incredible insight in how this crazy life was for them"
    },
    {
      "rating": "10",
      "text": "my opinion is pretty biased, but then again who's isn't, i love one direction so a doccie all about their lives behind the scenes, backstage rituals, HD performances on stage, heartwarming interactions with each other and the fans plus bonus, their mums being the sweetest at the merch store, was pretty awesome to see. if you're not a fan chances are you won't be engaged but if you've ever been curious about THE boyband of the 2010's this is a pretty good crash course in 1D and their meteoric rise to fame and the concert footage!!! teenage dirtbag was delight."
    },
    {
      "rating": "10",
      "text": "Great for fans to have a great time, enjoy their music live and cry with their lies."
    },
    {
      "rating": "10",
      "text": "esse documentário ta incrível. Foi bem legal vê os bastidores de algumas coisas"
    },
    {
      "rating": "10",
      "text": "This is us movie is a masterpiece and amazing it's show's us the development of the boy's life before and after being famous also their love to their fans"
    },
    {
      "rating": "10",
      "text": "i love this guys so much ❤️ ❤️ the movie is amazing, it's really good... :)"
    },
    {
      "rating": "10",
      "text": "I don't see reasons for so many complaints, this documentary is like any other boyband/singers documentary, a silly thing just to distract fans and promote their music"
    }
  ]
}