{
  "id": 2110,
  "title": "Ong Bak 2",
  "starring": [
    "Tony Jaa",
    "Sarunyu Wongkrachang"
  ],
  "runtime": 98,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "Moments from death a young man is rescued by a renowned warrior. Realizing unsurpassed physical potential in the young boy he trains him into the most dangerous man alive. As he becomes a young man he goes on a lone mission of vengeance against the vicious slave traders who enslaved him as a youth and the treacherous warlord who killed his father.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sGyB8kVPQsofyQV1T0jE2d6k4q4.jpg",
  "categories": {
    "plot": 6.4,
    "acting": 5.0,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The story's convoluted and slightly stupid, but my god the actions awesome. i don't get these people saying that the 1st hours dull though, the scuffles and training scenes are great, and the bit where he hammers his childhood captors with a drunken fu style is awesome! it's not warrior king, but it wasn't meant to be, and so we can forgive it for the changes in pace and theme."
    },
    {
      "rating": "3",
      "text": "Fights were good, plot was TERRIBLE."
    },
    {
      "rating": "6",
      "text": "Very weak as a film by itself, but incredible as martial arts picture. Tony Jaa continues to set the screen fighting standard."
    },
    {
      "rating": "4",
      "text": "I prefer the first movie. This one I didn't like so much, is totally different of the first one. Weak."
    },
    {
      "rating": "10",
      "text": "Ok so the the plot is far from amazing but people that is not what these movies are about. This is a martial arts movie and reviewing it as such you cant give it anything less that 10. the combat is simply jaw dropping, especially when u consider that there is no CGI and no wire work. Tony Jaa is a living legend that as it stands due to disagreements over ong bak 3 is now no longer making movies."
    },
    {
      "rating": "7",
      "text": "The story wasn't as strong as that of the first film. The addition of the magic element really made it more a of manga-style film. That's not really a good thing following one of the best blunt edge martial arts films ever made. Even so OB2 is a good action packed flick that should satisfy most martial arts film fans."
    },
    {
      "rating": "6",
      "text": "It's not a terrible movie but it doesn't live up to the first one. The revenge stuff and the time frame for the movie could have been used in a better way than this as there's far too much story and plot here for a martial arts movie. The fight scenes are great though. They really do a good job with the final sequence here and set up for a decent sequel, even if that sequel comes nowhere close to living up to the series name. This is a decent sequel for a great action movie but it probably would have been better the Ong-Bak series had stayed at just one movie."
    }
  ]
}