{
  "id": 2064,
  "title": "Only the Brave",
  "starring": [
    "Josh Brolin",
    "Miles Teller"
  ],
  "runtime": 133,
  "genre": [
    "Drama",
    "Action",
    "History"
  ],
  "description": "Members of the Granite Mountain Hotshots battle deadly wildfires to save an Arizona town.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lC7WdUNLOJI3sllaDGNdFy2GT8g.jpg",
  "categories": {
    "plot": 7.333333333333333,
    "acting": 7.728813559322034,
    "ending": 6.75,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 7.15
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Didn't expect much when i went to the cinema tonight, but boy, how wrong i was! This is a real gem that nobody should miss ! I have worked along the real US firefighters, i have seen that spirit and this film captured that close-to-madness zeal and knowing that you are doing the right thing. Go and see the film, this is the best thing along with the Wind River release in the movies at the moment !"
    },
    {
      "rating": "7",
      "text": "This inspirational movie is not fiction. It is based on a true story of a fire team \"Granite Mountain Hotshots\" from Prescott, Arizona.The movie is quite long and drags at times. But it is necessary to create an atmosphere of the Arizona town and delve into protagonists' lives.I did not know the story of that particular fire team and was not ready for amount of dramatism at the end.This will be more of an analyses than a review.Pluses:- targeting a wide audience;- great casting;- very good performances;- excellent visuals;- extremely emotional ending.Minuses:- cliches;- minor episodes not realistic;- as I already mentioned, a bit too long.Overall, a good powerful movie, worth seeing."
    },
    {
      "rating": "8",
      "text": "“Only the Brave” is not the sort of movie I would go to see but I did and I will tell all others who wouldn’t go see a picture like this go for it and those who are into films like this you got a winner!Aside from being pure entertainment, along with suspense and based on a true story, this is also educational in many ways regarding fires and fighting them. It certainly was for me and far from being boring.Though Josh Brolin almost always gets excellent reviews he doesn’t seem to be able to get to the highest level of stardom and he deserves to as his role as the real Eric Marsh shows that he does.“Only the Brave” is the true story of the ‘Granite Mountain Hotshots’ who fought a fire in Arizona in 2013 that killed more firefighters at one time except for 9/11.With a team of 20 men plus spouses, kids, in-laws, friends, it is pretty hard to get to know everyone in this 2 hours plus film but we met enough of the men and their interactions plus a few of the ‘civilians’ that draw you into every moment of the film and the people involved.Yes there is a Hollywood cliché here and there but even they ring true. The fire scenes and how quickly a fire can overtake acres of land and the many ways firefighters end, or at least delay, the destruction fire can do are total.Just watching this film as the California fires rage on taking everything in its way makes this a must see film to understand what is happening there.I knew very little about the real story this is based on but the screenplay by Ken Nolan and Eric Warren Singer, along with the directing by Joseph Kosinski and the production values, especially the fire scenes, along with the excellent cast, makes it all real.“Only the Brave” is such a good movie that not a person left the auditorium during the end credits even after they showed the real firefighters and who played them.Be sure to see this film on a movie screen to get the full effect of the firefighters, the fires and what made these men so brave!Cast: Josh Brolin, Jennifer Connelly, Jeff Bridges, Mills Tyler, James Badge Dale, Taylor KitschDirector: Joseph KosinskiScreenwriters: Ken Nolan, Eric Warren SingerPG-13 2 hours 13 minutes"
    },
    {
      "rating": "8",
      "text": "Tearjerker towards the end. Good acting. Yet had a few hokey and corny scenes mixed in. Still..You gotta like this one. I'm told many of these characters were researched thourouhly. These men got caught in a fatal situation they had trained for. Circumstances and unpredictable mother nature went against them and cost them their lives. Very sad. But what a..Shining tribute to some very fine brave men."
    },
    {
      "rating": "8",
      "text": "Joseph Kosinski's Only the Brave is a tearjerker of the highest order, in its telling of the story of the Granite Mountain Hot Shots. A team of firefighters who fought fires head-on across the nation but were based in Prescott, Arizona, the all but one of the men in the group were killed in the Yarnell Hill Fire of 2013. Building up to this eventual tragedy, Kosinski's greatest achievement in this film is firmly established long before the men ever report to Yarnell Hill. Through the nearly two hours before this fire, Only the Brave pain-stakingly develops the men as individuals in their private lives and on the job. Though this film is about a tragedy and contains many scenes of firefighting action where the men are able to return home, Only the Brave is a film about these men in life and a celebration of who they were, instead of a film about this disaster. In essence, it is a story of the men and the wives/girlfriends/parents/children/siblings impacted by this tragedy, which allows Only the Brave to be an achingly human and powerful viewing experience.From the very beginning, Kosinski begins to signal that this is not a typical \"based on a true life tragedy\" film. Typically, these films include a brief scene of family followed by some brief bonding before jumping right into the tragedy. Kosinski, instead, takes a unique approach with nearly two hours of family, friendship, and the forging of a bond through fighting fires, before finally reaching that somber day. In the course of this, he introduces us to men such as Eric Marsh (Josh Brolin) and his wife Amanda (Jennifer Connelly). Many character building scenes are devoted solely to Amanda, showing her as a horse loving woman who rehabilitates ones that are neglected and teaches others how to care for horses properly. We see young Brendan McDonough (Miles Teller) do drugs, get arrested, and kicked out of his mother's home, only to learn he is about to become a father. We see Brendan join the group of firefighters, forge a friendship with Chris MacKenzie (Taylor Kitsch) and care for his daughter. In quiet moments, we see the men goof around, make fun of one another, and act like the young men that they are in their private lives. We see them fight fires with great success, even sitting on the edge of the Grand Canyon watching the dying embers of the fire they just fought off pour over into the canyon itself. While much of the focus is on Eric and Brendan to be sure, this is a film about the brotherhood between the firefighters and the people they will eventually leave behind as much as it is one about fighting fires. Never skimming through this character development and consistently taking the time to establish even the most peripheral of characters into enjoyable and recognizable presences in the film, Kosinski manages to make Only the Brave into a celebration of these men as they lived, not how they died. By the time the tragedy happens, these men feel as though they have become part of our own families and our hearts, making the tragedy all the more impactful and emotionally resonant. This is a film that builds great pathos, relatability, and depth in its characters that allows this film to work not just as an action or tragedy film, but as a fully-fledged drama with well-rounded characters across the board, protagonists you identify with and root for, and wife characters who are not just there as background noise instead strong, developed characters in their own right. In having watched many action films - let alone ones based on true stories - Only the Brave stands as one of the rare entries that values every single person it puts on the screen. It treats each with respect and care, capturing the essence of every single person mentioned and allowing the audience to understand who they really were, both in action and in the quiet times.While the film's strong writing certainly helps to bring light to the real men behind these characters, it is often the film's acting that lifts the film up. As superintendent Eric Marsh, Josh Brolin shines in one of his best performances in recent memory. As we see him express doubt over his life, uncertainty about having a kid, and whether or not he wants be a family man or a firefighter, Brolin transforms into Marsh with all of his emotion, authenticity, and inner conflicts. The bond between Miles Teller's Brendan and Taylor Kitsch's Chris is palpable with the two becoming these two men who, after having so much animosity between them at the beginning, became like twin brothers. In traversing the life of the recovering addict Brendan McDonough, the new fatherhood, and the eventual survivor's guilt he experiences, Teller similarly delivers one of his best performances in a truly moving performance. Delivering lines with great feeling and emotion, Teller similarly becomes Brendan."
    },
    {
      "rating": "9",
      "text": "Like other, fact-based dramas that we've seen in the theater as of late (\"Deepwater Horizon,\" \"Patriots Day,\" \"Stronger,\" \"Sully,\" etc.), \"Only The Brave\" is yet another carefully constructed, emotionally resonant look at an event that - quite frankly - every human being should know more about. Though most of the film relies on building up the characters and world, there's just this air of authenticity to the film that honestly makes it all that much more enjoyable and rewarding to watch in the end. From the incredibly well-crafted performances and relationships established between characters, to the respectful and majestic visuals brought to you by director Joseph Koskinski and cinematographer Claudio Miranda, \"Only The Brave\" easily climbs its earnest way up onto the list of 2017's best movies."
    },
    {
      "rating": "10",
      "text": "An extremely well-made drama that is going under the radar.  Only the Brave features a high profile cast and it pays big dividends.  Josh Brolin, Miles Teller, Jennifer Connelley, Taylor Kitsch deliver huge performances that really takes the film to the next level.  The film does a great job covering the life of the firefighters outside of the actual fires showing the toll it takes on the families as well.You really feel family-like bond within the firefighters and the extreme danger they face fighting the fires. It is rare for a Hollywood movie based on true events to be as well-executed as Only the Brave and it is definitely worth the watch."
    },
    {
      "rating": "8",
      "text": "Definitely an inspirational and powerful true story about true heroes! Director Joseph Kosinski (Tron: Legacy, Oblivion) departs from his usual sci-fi fare seamlessly with this film, and delivers an honorable retelling of remarkable and courageous heroes. The cast is solid, with Josh Brolin, Miles Teller, Jeff Bridges, Taylor Kitsch, and Jennifer Connelly all giving outstanding performances! Overall, it does have a few formulaic moments throughout, but it's honorable storytelling and dedication to the real-life heroes it depicts more than makes up for that!"
    },
    {
      "rating": "10",
      "text": "This film beautifully addresses themes of honor, character, perseverance, personal responsibility and community that are sorely wanting in the Weinstein Hollywood. More stories like this one and you might just return your books to the black. Bravo."
    },
    {
      "rating": "9",
      "text": "After seeing worthy productions DUNKIRK, SAME KIND OF DIFFERENT AS ME, BRIGHT STAR (stage musical), and ONLY THE BRAVE over the course of five days this week, I'm surprised to note an interesting intentional trend: the directors/producers of the first three -- all pulled back the reigns from full, true emotional reactions at key moments for their lead characters at the climax of their response to tragedy. In doing so, all three productions shifted me out of the moment and distanced me emotionally from the power of their story.That's the only \"flaw\" of DUNKIRK.ONLY THE BRAVE is the only recent production I've seen that dares to enter such deep emotional spaces with deft skill. And thus for me it is the most satisfying emotional experience of the pack.If a film can convince me I'm watching a live experience with real people -- and then move me to tears, that's a high achievement in my book.But DUNKIRK will win awards for it's epic scale, music/sound design, editing, script, directing, and novel story structure."
    },
    {
      "rating": "9",
      "text": "Strong character development makes story relatable.  Moving movie retelling a tragic day in life of 1st responders.  Excellent!  One of my favorites of 2017"
    },
    {
      "rating": "10",
      "text": "I am so upset that this film got no recognition. This is a must see and one of the best films of the year. Do yourself a favor and watch this movie when you get the chance. The acting is solid, the writing is excellent and compelling, and the direction brings about a vast array of emotions that have you not only laughing, but crying because of truly caring for these characters."
    },
    {
      "rating": "8",
      "text": "One of 2017’s best films. The cast is great (aside from WHIPLASH this is Miles Teller’s best performance) and the fire-fighting sequences, which combined CGI and practical effects, look incredible. It could’ve been trimmed a little in the middle, but you really feel the comradery among the men, and the film does a great job hitting you with an ugly-cry gut punch in the climax."
    },
    {
      "rating": "8",
      "text": "Only the Brave shows a lot of surprises for your same old average true story, but this is way more than a true story. There's too much to say, but that would instantly ruin the excitement of this movie. It may not be an award-winning film, but at least it acts, looks, sounds, and even feels like one."
    },
    {
      "rating": "8",
      "text": "While nothing groundbreaking, particularly original or exceptionally stirring; this big scale true story heroic drama is very well made with an excellent all way round ensemble cast headed by a strong Josh Brolin.  Most importantly in the end it delivers heavy on emotion."
    },
    {
      "rating": "4",
      "text": "Here's another \"Based on the Incredible True Story\" movie so get the tissues ready. I'm getting real sick of all these horrific true story movies that tries its very hardest to reduce you to a blubbering mess by the end of it. After a while they all start to morph into one so while watching Only The Brave I couldn't help but feel like I've seen this exact movie before. Only instead of an oil rig it's a wild fire.This particular true story biopic focuses on the Granite Mountain Hotshots. A tragic story and although the last ten minutes is perhaps the most intense scene in these based on true events movies I only wish I could say the same for the rest of the film. So formulaic it hurts, squeezing in as many overly sentimental scenes of the main characters and their families as it possibly can. And just in case you're not already crying by the end let's not forget the pictures of the real victims saved for the credits. Before they become certified Hotshots we get to meet them as best mates and after twenty minutes in I stopped counting how many times I was hearing the words dude and bro. Just to further drive home the fact that they're such great friends with the best supervisor ever, enter Josh Brolin. Now let's meet Miles Teller, the outsider, the one with the drug problem and has now just had a daughter. Trying to make himself a better person he joins the team and the bromance continues. It moves from scene to scene in a series of mediocre acting and a badly paced story. With the exception of Teller and Brolin every other firefighter was almost a copy and paste of one another and it reduces any character who isn't a Hotshot into a prop. Overly dramatic and cheesy, if there was a way to tell this story onscreen this certainly wasn't it. I lost interest very early on and only regained it towards the end. Not recommended."
    },
    {
      "rating": "6",
      "text": "This is not an action film about firefighting, but a drama about fire fighters. Josh Brolin plays the supervisor of a team of Hotshots and Miles Teller is the troubled loser whose commitment to the squad turns his life around. The actors bring these characters to life, while the good-natured ribbing and comaradarie helps us care for them. There's some incredible images of the majesty and uncontrollable horror of wild fire, but their actual encounters aren't all that riveting. Once you accept that this is more about the people, then you can appreciate their story. Even so, it's not especially compelling (although the final scenes are powerful)."
    },
    {
      "rating": "10",
      "text": "Great movie absolutely love it, pays justice to the real life heroes ¡!!!!!!!!!!!!!!"
    },
    {
      "rating": "7",
      "text": "\"Only The Brave\" is formulaic, somewhat emotionally manipulative and more than a little corny in parts.  But it is also very earnest, emotionally engaging and entertaining.  I was not familiar with the true story of the Granite Mountain Hotshots.  So I did not know exactly what was coming, though it was not that hard to anticipate many of the turns.  Josh Brolin is great as the road weary veteran supervisor of the team.  Miles Teller gives the best, and least obnoxious, performance of his young career as the troubled loser who conquers his demons.  While I really liked him in \"The Spectacular Now\" and I loved \"Whiplash\" as a film, he too often hits the same note as an obnoxious, self-centered jerk (which worked in The Spectacular Now), but not so here.  His character is dynamic and Teller's performance is mature.  Jeff Bridges and Jennifer Connelly give strong supporting performances, as do the other actors playing the other Hotshots and their families.  There may be a bit too much male bonding ribbing in the downtime, but the fire scenes are very well shot and the sound engineering is excellent.  You can feel the onslaught of the fire.  At times, it is laid on a little thick. But, in the end, it is quite entertaining and heartbreaking."
    },
    {
      "rating": "7",
      "text": "Really powerful film with good performances and visuals. Writing is mostly solid."
    },
    {
      "rating": "8",
      "text": "This was a great movie that honored the lives of those firemen who lost theirs.  I do not know if the backstories on each character are accurate but I would like to think that the movie-makers did their homework when creating a movie that is so close to so many people's hearts.  I am sure the story is \"hollywoodized\" but I would like to think that it is pretty accurate.  They do an excellent job of casting and the actors own the parts well.  I can testify that most of the scenes, if not all, are shot on location because I live in AZ and have been to some of these places.  They did a great job of capturing the feelings involved in this tragic incident and honoring those involved."
    },
    {
      "rating": "8",
      "text": "Hollywood releases a \"gotcha\" movie with a telling of the true story and tragedy of a group of Arizona firefighters out of Prescott who become certified as \"hotshots\", the best of the best that risk their lives during fire seasons to put out forest fires all over the parched West and Southwest.    We would indeed be very mean to criticize the intent of this film, but it also reeks of emotional exploitation, and that does the sacrifices of the Granite Mountain Hotshots injustice, all of whom except one who was sent out to scout and base camp at the Yarnell fire perished when ferocious winds switched directions and killed the crew, who were in fireproof bags, but the flames were too hot and their protection just couldn't last long enough for them to outlast the firestorm.    While I always enjoy Josh Brolin, a fine actor if there ever was one, and the rest of the cast are fine in their roles, this film spent more time being a social commentary about the lives of the firefighters and stresses on their families, which, after a while, became the cliche festival we have to put up with from writers taking the easy way out.    Not that such concerns are invalid- far from it.    However, it's repeated over and over - the couples fight, make up, the big picnic and watching the crew harass each other good naturedly, as if to make us feel part of the \"gang\", as it were.    And of course the bar scenes that rightfully cheer the men after saving their town, but cross the line into maudlin quickly.    While I am not one who just wanted nothing but a fire holocaust for a movie, there remained a lack of their actual work in other places, details on how firefighters attack wildfires not just on the ground, but from the air, and other methods that should have presented a more whole picture that would have paid respects to the air crews, firefighters who paratroop behind the fire lines and other equally brave people that were ignored.    In fact, the only mention of the water from aircraft were when they made mistakes.    However, because the movie will raise awareness of the Granite Mountain Hotshots and other heroes in firefighting, one shouldn't dismiss the movie's weaker points.    Just spare us the \"heroic\" commentary, and next time you Hollywood people want to \"recognize\" bravery, avoid the soap opera feel you seem so inclined to throw in.    How about a movie about the Yellowstone Park Fire of 1988?    That cataclysm was beyond imagination, the damage astonishing, and the firefighters from all over the nation equally worthy of your attention in LaLa Land, which itself is surrounded by fires most of the late summer every year."
    },
    {
      "rating": "9",
      "text": "While \"Only the Brave\" has a slow buildup, it pays off in the end. The film is deeply emotional, delicately directed & scripted, and most importantly, honours the real life heroes it is based on well."
    },
    {
      "rating": "8",
      "text": "An emotionally driven biographical drama that focuses on both personal and professional lives of the firefighters involved. Kosinski balances the elements of drama and actions in a well-paced sequence, leaving the audience feel the compelling heroism."
    },
    {
      "rating": "8",
      "text": "\"Only the Brave\" was a very good movie, the history of the Granite Mountain fire extinguishers was wonderful. The performances were magnificent, the special effects very well handled and the story was good, the end made me cry and the homage they made was captivating."
    },
    {
      "rating": "7",
      "text": "The intent of the film maker is to tell a story about brave men who perform a dangerous but necessary job. And for the most part, it succeeds. Its a little rah-rah in part, a little excessively macho in part and there are lines spoken that are straight cliches. If you can deal with that, its a good story with good acting, nice casting and picturesque scenery. I missed the actual story so was taken aback by the ending. I had a tear or two. Its a story worth seeing"
    },
    {
      "rating": "7",
      "text": "Only the Brave is directed by Joseph Kosinski and stars Josh Brolin, Miles Teller, Jennifer Connelly, and Jeff Bridges, among others. The premise centers around the Granite Mountain Hotshots, an elite firefighting crew in which 19 out of 20 of them died in 2013 fighting the Yarnell Hill Fire in Arizona. Based on true events, the story does not necessary focus on the tragedy itself, instead focusing on the history of the hotshots. It focuses specifically on Eric Marsh, the leader of the crew, played by John Brolin. We see him as he tries to get his crew upgraded from a normal fire fighting crew to hotshots. It also focus on Brendan McDonough, a new recruit on the hotshots. After dealing with drug addiction, getting arrested for stealing, and learning that he's going to be a father, he decides to clean up his life by joining the crew.In addition, the movie show the hotshots fighting various fires, we see the deep brotherhood the men have for each other, the stress the job places between the men and their wives, and just how terrifying fires can be. Thanks to special effects, there are many scenes where the camera is up close to a fire and it creates a thrilling experience. The movie illustrates how dangerous their job is and yet shows how they love doing it. You can't help but smile seeing these men saving towns, enjoying what they do, and seeing the close bonds between them. It also shows the local culture very well. What makes the movie unique is its format. The movie is like a combination of a western, a drama, and a thriller. It's overall unique approach to its storytelling helps out the film.However in the last 15 minutes, that's when the tragedy occurs, and when that happens, it's like a giant punch to the gut. The movie ends on a sombering, somewhat bittersweet note. The acting from Josh Brolin was fantastic and Miles Teller also put in a good performance. What holds back the movie is the somewhat uneven directing. Some scenes were too short (like a some of the action scenes) while others went on for too long. But overall, Only The Brave is a good movie and is a respectful tribute to the men of the Granite Mountain Hotshots."
    },
    {
      "rating": "9",
      "text": "The current wave of the movies based on recent historical events relevant to modern American continues. Many of them have been good, but „Only the Brave“ feels clearly like the best one yet.It’s about about the work and personal lifes of forest fire-fighting crew in Arizona, everyday heroes who do important work that most of us would consider too exhausting and inconvenient.„Only the Brave“ has been aimed for awards season, of course, but it is a quality movie in its own right. Literally everything in it is done extremely well. It has suspense, variety, a multifaceted approach to the lives of its main characters,In addition to some magnificent-looking great fires, it’s a real actors’ movie, which means that enjoying the performances is big part of the thrill.And the cast is exemplary: Josh Brolin, Miles Teller, Jeff Bridges, Taylor Kitsch, James Badge Tale, et al. As you can guess by the names, the acting is really solid all around.The best surprise was to see Teller in refreshingly different role, from low-life addict to responsible young man. I almost wished that he wouldn't change, the performance is that enjoyable.There’s even room for small but well-written female character, and Jennifer Connelly attacks it with fire and conviction, so another Supporting Actress Oscar (or at least nomination) following „A Beautiful Mind“ shouldn’t be out of the question.What looks like decorative character on paper has been turned into a beautiful and strong person who feels very real and really stands out among all the goodness the movie has to offer already.Basically, „Only the Brave“ is 133 minutes of competence porn, Real Men and some Real Women doing What’s Necessary for the good of everybody.But it’s done in a way that feels always real, gripping and emotionally relatable, so we can call it the best Hollywood has to offer.And there’s not gonna be a dry eye in the house when this ordinary heroes epic reaches to its end. Go see it. It really is that good."
    },
    {
      "rating": "7",
      "text": "Very solid action emotional drama!My eyes went teary wet!Amazing actors & great acting!Truly worthy to go & see it on the cinema!Highly recommendable movie!"
    },
    {
      "rating": "7",
      "text": "Undoubtedly more than one will believe this film was directed by Peter Berg, let's be honest, it has his style, pleasantly the film turned out to be more satisfying and focused on relevant and interesting things, and also works quite well by making an emphasis on the lives of its protagonists, because that is what this film is all about, after all it's a recreation but also a tribute. The last part is quite emotional and the drama develops satisfactorily and away from emotional manipulation, it is what it is, the lives that were lost in the line of duty without any sort of arrengement. The film has a remarkable cast and everyone does a good job, this is not a masterpiece but it's not a bad movie either, it's a tribute and it's worth it, yeah it's a little longer than it should be, but personally I think it's worth it."
    },
    {
      "rating": "6",
      "text": "Brolin makes you care about everything and he keeps himself at the bottom of the list. No wonder, he is at the top of mine.Only The BraveThe director Joseph Kosinski's films are not something that have caught my eye. And that is saying a lot, considering how his filmography contains one of the biggest, shiniest, loudest colourful CGI films like Tron : Legacy and Oblivion where mind you, once again the biggest star Tom Cruise was roaming about alone. And if you know the spoilers of the film there is more than Tom Cruise in the film- jumble this sentence at your own risk. Also, this is one of those films that has been on my radar but never actually got the chance to see it.And not only because there is Josh Brolin at the heart of it or the film got a good reception but the fact that the film covers different timelines in the story about these indeed brave men. The story hops around a lot. And showcases snippets of character's value, disease and hopefully the hint of medicinal pills that will keep them alive. While doing so the film could easily so loud, cheesy, predictable and amateurish. It is one of the most difficult jobs to pull off.Hence, fascinated by what new method does Kosinski deal with this time jump I was amped for this biography. So what he uses is a sharp, on-your-face editing that embraces these video clips and tells frankly what the deal really is. You get used to with this procedure in these two hours to the extent that you start demanding to be treated like that. Only The Brave is a success on that very note. For it is a story about people living a lifestyle that we cannot imagine or adapt just as the supporting character often fails to and so it has to and it HAS to mold you to that gruesome training that they call routine."
    },
    {
      "rating": "9",
      "text": "เป็นหนังดราม่า ที่ชอบมาก หลังจากดูจบแต่อารมณ์หลังดูจบจะรู้สึก จุกๆ ซึมๆ สะเทือนใจ หลังที่ช่วงแรก ที่มีความรู้สึก อบอุ่นกับมิตรภาพที่งดงาม มีดราม่า สะเทือนอารมณ์บ้าง ก่อนที่จะมาเอามืดแทงคนดูจะร้องไห้ก็ร้องไม่ออก มันตันๆ รู้สึกอยากจะเรอ ก็เรอไม่ออกอีก T T แนะนำห้ามดูอะไรตลกๆก่อนดูเรื่องนี้ มันจะปรับโหมดไม่ทันเลย"
    },
    {
      "rating": "7",
      "text": "This film does well at portraying a close bunch of a friends, a tight unit which sadly suffered from the extreme weather conditions they found themselves battling with. The characters were interesting, their personal issues well brought across and I found it an emotional and also, at times, uplifting watch.It features some good cinematography and special effects and given its based on a true story, I found it all the more moving. I'd recommend it."
    },
    {
      "rating": "7",
      "text": "Es larga y tiene un ritmo algo lento, pero esto se compensa con buenas interpretaciones y momentos conmovedores."
    },
    {
      "rating": "9",
      "text": "Every day, firefighters put their lives in danger to save others, and in 2013, the valiant Granite Mountain Hotshots did the same. This is one of those great movies that succeeds on every front imaginable. In every way, I adored the movie. The film was produced intentionally sentimental by director Joseph Kosinski, who also made sure that the audience would cry at the film's climax. Josh Brolin, Miles Teller, and the rest of the actors performed admirably in the film. The movie's idea was already fantastic; Joseph Kosinski merely needed to polish it, which he did admirably. You don't want to look away from the screen for more than a few seconds since the movie is too addicting in its own way."
    }
  ],
  "recommendations": [
    "everest",
    "the_boy_who_harnessed_the_wind",
    "the_impossible",
    "cast_away",
    "donnie_brasco",
    "the_last_duel",
    "patriots_day",
    "hotel_rwanda",
    "the_place_beyond_the_pines",
    "wind_river",
    "first_man",
    "just_mercy",
    "beirut",
    "flight",
    "hostiles",
    "fighting_with_my_family",
    "manchester_by_the_sea",
    "allied",
    "deepwater_horizon",
    "news_of_the_world",
    "apollo_13",
    "jungle",
    "sin_nombre",
    "hidden_figures",
    "legends_of_the_fall"
  ]
}