{"id": 635, "title": "Orphan", "starring": ["Vera Farmiga", "Peter Sarsgaard"], "runtime": 123, "genre": ["Horror", "Thriller", "Mystery"], "description": "After losing their baby, a married couple adopt 9-year old Esther, who may not be as innocent as she seems.", "releaseYear": "2009", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/lCGpOgoTOGLtZnBiGY9HRg5Xnjd.jpg", "categories": {"plot": 8.11111111111111, "acting": 7.95, "ending": 8.44, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 5.0, "action": 6.5}, "reviews": [{"rating": "10", "text": "I loved this movie. I was on the edge of my seat. The ending was amazing. The story was good. A great thriller! i would definitely recommend this movie!!"}, {"rating": "10", "text": "Excellet Horror ThrillerI have not seen a decent horror film in a long time, but this one is definitely worth the money. Be sure to use the restrooms before the start of the movie, as it is very riveting and suspenseful. Except for one sex scene between the husband and wife, this film can be viewed by mature children accompanied by an adult. It is very well written, and well-balanced. Personally I found this film very entertaining, suspenseful, and the plot cleverly written. Without getting into too much detail and ruining it for everyone else, this movie is in a category in which the story could become true in the future. Isabel Furhman did a great job starring as an orphan adopted by a couple who was looking to fill a void in the family due to an earlier tragedy. Her ability to manipulate her siblings as well as her adoptive father, thoroughly frustrates the mother. As the movie progresses, her manipulative abilities become more apparent and deadly. This is a must-see movie and I said money well spent."}, {"rating": "10", "text": "Orphan is a terrifying horror thriller with brilliant twists that will excite & invigorate you !!!!!!!!!!!!"}, {"rating": "10", "text": "Terrifying -------------------------------------------------------------------------------------------------------"}, {"rating": "10", "text": "Audio/visual unsynchronised Near the end of the film, when Max knocks over the planter in the greenhouse, the crash is heard after it lands."}, {"rating": "10", "text": "Isabelle Fuhrman auditioned for the part of Esther while wearing an old-fashioned dress and ribbons around her wrists and neck."}, {"rating": "8", "text": "As a film critic myself, I get annoyed when people say \"Oh film critics don't give horror movies a chance\" Then I look at this page and despair. Orphan is a terrific entry to the scary-child genre of horror. Featuring a well-modulated build to a delightfully absurd denouement, the picture is a tad overlong, but never anything less than a hoot. It is worth seeing -- if for nothing else -- for a superb juvenile performance by Isabelle Fuhrman. I fear my colleagues need to undergo some genre re-education."}, {"rating": "10", "text": "In earlier drafts of the script, Kate and John go to the orphanage not to see girls for the first time, but to bring presents to Yolanda, a seven-year-old Puerto Rican girl whom they plan on taking home the next day. There, they meet Esther (this scene plays out almost exactly as it does in the finished film). Although she impresses them, especially John, she finds out that they have already planned to adopt Yolanda. The next morning, Sister Judith finds Yolanda hanging in a closet; it is assumed that she died in a kids' game gone wrong, but implied that Esther killed her. John later suggests to Kate that they adopt Esther instead."}, {"rating": "10", "text": "According to the Estonian mental institute records, Esther was born on April 20, the date of Hitler's birthday."}, {"rating": "10", "text": "Near the end of the film, Esther is revealed to have Hypopituitarism. This is a real disorder that is (as the film states) is \"rare\". However, there is treatment available such as growth hormone injections for children to grow at a normal rate. However, the film leaves out that people with this condition are required to take cortisone medications otherwise they could die. Esther would need to be taking pills daily or the injections weekly. (She is never seen doing either)"}, {"rating": "10", "text": "●°●°●°●°●°●°°°●°●°●°●°°●°●°●°●°●°●°●°●°●°●°●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_÷_=_"}, {"rating": "10", "text": "+÷+÷+÷+÷+÷+÷====+÷÷÷÷+÷+÷+÷××××××÷+÷+÷+÷+÷+÷+÷+÷+÷××÷=÷×■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "10", "text": "*:*:*:*:*:*:*:*\"**\"*\"*\"*\"*\"\"*\"*\"**\"¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "10", "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"}, {"rating": "10", "text": "{}{}{}{}{}{}{}{}{}{}{}{}{}{}[][][][][][][][][][][][][][]!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "9", "text": "This film is a very professional and excellent work in the horror genre. It is really a great work and I enjoyed it very much. It is surprising that the critics gave this work such a score. It deserves more than this."}, {"rating": "6", "text": "I guess, this film belongs in the middle - it's not a masterpiece, it's not some useless piece of trash... around it lovers and haters alike, each praising or attacking it for all of its stereotypes... Generally, I liked it, there are sudden twists that made me sit intense all along during the projection. I'll never understand others from the audience usually enjoying snacks when sitting and watching films like 'Orphan'. Isabelle is brilliant but too exposed in her character role, and yes, like many say - you immediately dislike her... not necessarily because of her stereotypical child-like princess charms, but simply because people like this (whether kids or adults) when insisting on being adored and 'your best friends' have a disturbing side to their persona... Amazing how obviously wrong something about Esther is, while naive loving couple oversees the girl's overarticulatedness as something of a virtue. I like the idea of exposing how sinister a manipulator a child can be - confronting adults in their ever-present sense of affection no matter how extreme child's actions might get. There is an explanation for everything - however, psychopathic beaviour is too perverse a game mother nature provided for the human race."}, {"rating": "8", "text": "I love this movie. It was so perfectly made, the girl who plays the main character was so well cast. Definitely has \"The Good Son\" vibes but with a great twist!"}, {"rating": "9", "text": "Orphan is a 2009 horror-thriller film directed by Jaume Collet-Serra. After suffering a miscarriage Kate Coleman decide to adopt Esther, a child in an orphanage who can hit for its sweetness. At home, however, accidents happen that Esther seems responsible. The film manages to convey tension and anxiety to the viewer thanks to strong scenes and incredible Isabelle Fuhrman which proves to be a great actress. Good directing and also good music. The only flaw is the ending that seems to been done in a hurry."}, {"rating": "9", "text": "Isabelle Fuhrman gives a stunning performance in this blood-chilling film."}, {"rating": "10", "text": "It's fun, it's twisted, and I definitely want to see it again. Esther's character was played to a tee, and it all comes together in the end. While the scary, manipulative kid movie is certainly cliche, it manages to pull it off in a refreshing way."}, {"rating": "9", "text": "One of the scariest movies I have ever seen!\rIt is completely real, no ghosts or supernatural things.\rAfter Esther's secret  is revealed, the movie turns into a nervous and bloody shocker!\rThe movie is  definitely underrated!"}, {"rating": "10", "text": "It's a good movie with a good plot twist, the finale it's a little bit bittersweet, but the ending doesn't ruin the movie."}, {"rating": "9", "text": "\"Orphan\" is one of the most shocking movies of the past decade. It starts so relaxed and slowly taking shape infernal cruelty of Esther. Without any doubt, Isabel Fuhrman makes a gorgeous performance, perhaps one of the most terrible villains who have been in the paper recently. Expectant at its best, leaves you on edge in the last frame."}, {"rating": "10", "text": "A great crime thriller and terrifying to believe that this movie is inspired from true eventstruly horrifying movie. Though the genre is not horror, chills ran down my spine, and I couldn't sit back and watch.This is that kind of movie that keeps you glued till the end of it, and that's what the audiences want. A great crime thriller and terrifying to believe that this movie is inspired from true events. Max and Esther were incredibly brilliant and outperformed rest of the cast.It is scary, creepy, terrifying, nail-biting and all of what a crime-mystery lover wants!!!"}, {"rating": "10", "text": "Plot HolesLater on, Sister Abigail discovers and tells Kate that she researched and discovered that the fire at Esther's old adoptive family's house was indeed arson. If Sister Abigail is able to discover that through her research, she would've easily been able to discover that the entire family had been murdered as well, and likely would've also learned that Esther was responsible, since the Estonian mental hospital was fully aware of the entire incident."}, {"rating": "10", "text": "very good child horror movie, with very good plot twist. The acting was sub-par but the girl how played ester should get a oscar. This movie will keep you on the edge of your seats throught out."}, {"rating": "10", "text": "Orphan was a great movie, ive watched it like 20 times, i got my friends into watching it, they like it so far, and the ending is great, for me the characters are very person like, not like in most movies when people walk towards the sound alone, i dont like it when they are dumb, and Esther's characteristics are great, also with Max and Danny, i love horror movies, ive watched alot of horror movies,this is one of the best ive watched"}, {"rating": "10", "text": "jjuhihiihugftrseardfuhiojjookjonmmbczdbjhfswygighijoojojjbyfdrtdbjihiihugugfyyfyfhi"}, {"rating": "9", "text": "Disturbing, well acted horror/suspense film that delivers on all levels, with a shocking twist ending that left me reeling.  The chase scene goes on a bit too far, but otherwise this is  gem of a scare movie."}, {"rating": "10", "text": "Best Film Ever !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!!  !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!! !!!!!"}, {"rating": "9", "text": "I watched Orphan countless times, and I feel like watching it every now and then. It happens that I have just seen it for the hundredth time, so I felt like I should shoutout my favorite film of all time to you people. Without being biased, Orphan does have some issues it is not a perfect film, but I see it as a masterpiece.\r Biased Rating 100%\rTrue Rating 91%"}, {"rating": "7", "text": "I recently rented this movie and saw it for the first time.  Orphan is a new take on an old horror genre - the evil child movie.  But the twist at the end is probably what makes the movie even more disturbing when you watch the movie again.  The bits of dialogue in the film, while not particularly memorable, seem to have a more sinister take in the second viewing.  The acting in the film was especially good.  Isabelle Fuhrman's acting was particularly notable without saying, but it would be folly to overlook the convincing performances of the rest of the cast.  The story itself was good at it's core, but it fell flat at major points, such as pacing and introducing character development at wrong moments.  The latter part of that sentence is especially important, as it seemed that the filmmakers wanted to introduce new flaws in the protagonist to excuse the actions of the antagonist late in the film.  On another note, the movie worked too hard to have a disruptive character (the Orphan) integrate into a disrupted family, almost as if she had some sort of hand in the problems that plagued the family before showing up to wreak havoc.  In a horror movie, one-dimensional characters aren't a problem, but when there's too much depth to potential victims you have trouble following.  Lastly, as mentioned before, the pacing of the film poor and slow.  For some reason, \"Suspense\" was defined as utilizing camera shots and cheap jump shots to establish an atmosphere of \"on edge\" horror.  While it might work for some films, I can't understand why it was used throughout this entire movie, particularly when the antagonist hasn't even shown up.  It began to get old and predictable to a point that when the real horror began, you could tell that the filmmakers weren't even that interested in it anymore.  The film gets this rating for trying to be original and bringing in a strong troupe of performers who did well with what they had to work with.  But the story could have been a little less complex, maybe camped up."}, {"rating": "10", "text": ">>>>>>>>⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙》》》》》》》》》》》》》》》》》》》》"}, {"rating": "8", "text": "This Has A Really God Plot And Acting!\rA Real 8! One Of The Best Writen Horror Movies Of All Time!"}, {"rating": "7", "text": "I am not surprised to see how well this movie was received by the audience. A simple but very well delivered plot that will keep your attention until the last second."}, {"rating": "9", "text": "Personally I love the movie, director successfully has created suspense and mystery, with good acting by actors.Unique story is the another strong part of the movie"}, {"rating": "8", "text": "Super fun! agree with NPR Nathan Lee The movie is, as these things go, enjoyably trashy. but that was fun, i had a great time and everyone else in the theatre."}, {"rating": "9", "text": "Great great flick....scariest and thrilliest movie NOT involving monsters or aliens......scariest thing I've seen since first The Hills Have Eyes......the twist at the end makes the whole movie worth while and then you want to go abck and see again to pick up on the clues. Saarsgard kinda drole but his wife Kate puts up an amazing role and 11 year actress Isabelle is amazing as Esther.....I totally dug it and the shooting was amazing and I thought wife's role amazing drinking problem and all."}, {"rating": "8", "text": "Couple with a dead child adopt a new one but she turns out to be a 30-year-old Estonian trying to kill the mother and sex up the father."}, {"rating": "8", "text": "I was a bit hesitant to see this movie, because to me, the story seemed unbelievable. How evil could a 10 year old girl be, right? ...wrong! Esther is one crazy little  I really didn't think I'd like this movie, but I loved it. Isabelle Fuhrman is amazing in this film. If the performance wasn't in the context of a messed up girl in a horror movie, she would have gotten academy notice, she was THAT good. Jimmy Bennett was also really good playing her adoptive brother, he even did his own stunts. Every time I see this kid he gets better and better, and I think you'll be seeing his name in films for the next fifty years. The parents don't really have a major role in the film, but they were equally as good. The cast was great, the lead was amazing, the story was solid, and there is a hell of a twist at the end, that in and of itself makes this film worth watching."}, {"rating": "8", "text": "Orphan is a really great thriller, not involving ghosts, aliens, possessed girl/boy, monsters, no...this movie is a story that can happen, although the twist is kind of not real, but I don't know, on the other hand I know that orphan is scary because it is about a child who kills, who knows what children can do these days?"}, {"rating": "7", "text": "A family of four is torn apart after adopting a seemingly sweet and intelligent Russian girl. Her mysterious past catches up with them as a series of accidents befall the family members and anyone else that crosses Esther's path. ORPHAN was a big hit upon its release in 2009, despite its many setbacks that keep it from becoming a classic in the killer kids genre. The character of Esther is written and played far too menacingly for her to remain unnoticed. There is no ambiguity in her actions, as she is clearly portrayed as being evil from the very start. As a result, much of the film relies on the shock of her actions rather than the build up or suspense leading up to them. It does, however, manage to maintain the mystery behind her shady background long enough to give the audience one final surprise! Esther's adopted parents are easily the most frustrating parents in recent Horror. Her crackpot mother is irritating and irresponsible, while her idiot father stands completely oblivious to her evil ways in light of the horrible tragedies that are affecting his family. They gain no sympathy or support as a result. If films were graded solely on their twist endings, ORPHAN would rate at the top of its class, but the carelessness of the writing cannot be overcome by the clean cinematography or Isabelle Fuhrman's creepy performance as Esther. -Carl Manes\rI Like Horror Movies"}, {"rating": "8", "text": "The acting was good,especially from Isabelle Fuhrman who did an amazing job as Esther,it was original and entertaining.Some moments might be unbelievable and the twist at the end might seem too far-fetched but, it still is a great thriller."}, {"rating": "8", "text": "Depuis quelques temps, les Espagnols deviennent incontournables dans le style de l'angoisse et de l'horreur (Les Autres, [REC], L'Orphelinat). Nouveau titre Ã  ajouter dans cette collection : Esther ! Un film d'une redoutable efficacitÃ© et d'une perversitÃ© sans nom (au point que l'on croirait voir la fille d'Hannibal Lecter) qui tire partie de son ambiance, de son scÃ©nario (rÃ©vÃ©lation finale inattendue, personnages approfondis, cohÃ©rences scÃ©naristiques...) et de son casting (Vera Farmiga, naturelle, la jeune Isabelle Fuhrman, impressionnante et surtout angoissante). Autant le dire tout de suite, on ne s'en sort pas indemme ! Pour le prouver, cela faisait longtemps que je n'avais pas Ã©tÃ© aussi impressionnÃ© par un film du genre qui pourrait monter aussi haut dans le panthÃ©on, presque au point de sa ranger du cÃ´tÃ© de L'Exorciste. Continuez comme Ã§a, les Espagnols ! Vous vous dÃ©marquez des divertissements \"abrutis\" appelÃ©s films d'horreur amÃ©ricains !"}, {"rating": "7", "text": "This thriller tells the story of a couple who, unable to have more children, decides to adopt a child and gives preference to a seemingly intelligent and docile Russian girl, but she quickly turns out to be much more dangerous than she looks. I loved the story, the central idea of ​​the plot and the way the film develops it in an increasingly clear mood of tension and discomfort. The film does not scare, it prefers to leave us groundless, uncomfortable and worried, easily creating a link between the audience and the main female character, Kate (Vera Farmiga). The final twist plot also pleased me a lot, being something really unexpected and intense. Unfortunately, the film gets lost after that, with an unrealistic and predictable ending. Farmiga is undoubtedly the most notorious actress, with a very psychological and strong interpretation; Isabelle Fuhrman also shone as Esther, alternating between intoxicating sweetness and absolute insensitivity. Peter Sarsgaard is less interesting but shows talent, as was seen in his later films."}, {"rating": "8", "text": "With impressive cinematography, acting and story Orphan deserves a place among the best horror movies of all the time. Tidy, clear, rising with good gradation. Someone send 'This could have been the movie which left you being terrified of young children for the rest of your life', made me laugh. It's not that scary given that it's predictable."}, {"rating": "8", "text": "Um excelente suspense,se você quer terror não é um bom filme. Vera Farmiga é incrível como a única inteligente da família e Isabelle Fuhrman é terrivelmente incrível como a terrível Esther. Bom suspense de ação"}, {"rating": "7", "text": "A thriller movie that will keep you until the end and the end is really good. It has action and some scary scenes I liked the girl and Vera Farmiga. It was better than other thriller-horror movies that are coming out these days..."}, {"rating": "8", "text": "I agree with those who say that is a good because it is. It is engaging, smart, sharp and at time frightening. There are some issues, and perhaps there could have been some improvements. The argument, however, it is smart, and it is difficult to get bored because things are always happening.  In fact, I disagree, with those who say is trashy, and although some scenes are crude, it is not a torture-porn. To me it is something in between horror and thriller. A good mix, because it makes the plot smar. I think you have to give it a chance...forget about the critics, go with an open mind and decide yourself, it may not be your 'cup of tea', or it might...but give it a go! what is there to lose? ..."}], "recommendations": ["case_39", "the_uninvited", "split", "jessabelle", "maggie", "ouija_origin_of_evil", "the_skeleton_key", "the_others", "run", "insidious_chapter_3", "prisoners", "nightbooks", "the_exorcism_of_emily_rose", "the_black_phone", "the_invisible_man", "elle", "mama", "lights_out", "the_lodge", "the_prodigy", "colossal", "the_next_three_days", "i_see_you", "hide_and_seek", "brightburn"]}