{
  "id": 3596,
  "title": "Orphan: First Kill",
  "starring": [
    "Isabelle Fuhrman",
    "Julia Stiles"
  ],
  "runtime": 99,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "After escaping from an Estonian psychiatric facility, Leena Klammer travels to America by impersonating Esther, the missing daughter of a wealthy family. But when her mask starts to slip, she is put against a mother who will protect her family from the murderous “child” at any cost.",
  "releaseYear": "2022",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pHkKbIRoCe7zIFvqan9LFSaQAde.jpg",
  "categories": {
    "plot": 5.8,
    "acting": 6.166666666666667,
    "ending": 7.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 3.0,
    "action": 5.833333333333333
  },
  "reviews": [
    {
      "rating": "3",
      "text": "It's generic in every sense of the word.Nothing more offensive than a action movie being dull. Well, at least Hayden Christensen isn't awful and gives a decent performance. Unfortunately, the same can't be said about Bruce Willis, who's after that pay check again."
    },
    {
      "rating": "6",
      "text": "I'm a fan of Hayden Christensen, i'll admit that i am. I enjoyed his time as Anakin in Star Wars and I respect his decision to quit Hollywood because he felt he \"didn't earn it\" after Star Wars and start fresh with these low budget films. First Kill isn't as bad as advertised, Hayden really brings it in his role for this predicable and watchable thriller. Bruce Willis, who isn't in the film much, again sleepwalks through this without bringing much to the table. The rest of the cast does well and the film is solidly directed. All, in all, First Kill is a watchable film but don't go out of your way to check it out."
    },
    {
      "rating": "6",
      "text": "I love Bruce Willis's acting, but this movie could've been much better. I mean they make it off as an exciting thriller while in the end it turns out to be not as interesting as hoped for and overall quite predictable."
    },
    {
      "rating": "5",
      "text": "I have seen better but you can see the whole thing without doing a big if any, effort."
    },
    {
      "rating": "3",
      "text": "Don't know what happened with these two once great actors career that they are dropping their dignity to join in for a below average movie. First of all the writing is like it the script was done by a 5 year old and being awfully basic and I think dumb is the best attribute I can give it. The directing style is just painful even for your eyes not to even mention the bad style of how the whole movie was shot. The actors just didn't have who to work with. Which doesn't help the movie overall. The plot of the movie was a typical template and the winning formula to an overly exaggerated cliche movie, and a painfully cheese 'Happy Ending'. It had absolutely no depth to it, even the concept of the plot was bad. And based on the fact that this was a thriller it's should be 0/10 because there is nothing thrilling in it. It wasn't fun to watch this movie, if anything it was chore. And it wasn't entertaining either. So overall the movie is a bad movie which did everything they could wrong with a movie. They are lucky that it was produced by a larger publisher."
    },
    {
      "rating": "7",
      "text": "Good enough.I felt satisfied after watching 'First Kill'. Sure it isn't anything extremely memorable or overly creative/unique, but I came away feeling positive about it. It gave me what I wanted from a straight-to-video action film.Hayden Christensen is enjoyable in the lead role, and even Bruce Willis seemed to be trying at least; unlike, in my view anyway, in 2016's 'Precious Cargo'. Gethin Anthony, of 'Game of Thrones' fame, is good too - he features in the best scene of the film with child actor Ty Shelton.The plot is nothing close to being anything fresh, but it's suitable and it held my interest all the way through... I can't really ask for more. 7*."
    },
    {
      "rating": "8",
      "text": "First Kill is the latest film to star Hollywood Star Bruce Willis, however do not mistake this for anything more than a Hayden Christensen film. Hayden Christensen takes the lead and Bruce Willis is very much a secondary character, but please do not let that put you off. This is a great film.The story is pretty simple Will (Hayden Christensen) decides to take his son Danny on a hunting trip to give him confidence after he is bullied at school. Everything is going fine until they witness an attempted murder in the woods, and before you know it Danny (Ty Shelton) find himself kidnapped. What follows next is Will doing whatever it takes to get his son back.After a slowish start, the action picks up after about 20 minutes, and from then till the end it is all very tense and very action packed. Everyone and their granny will spot the twist a mile away, but that never stops the film being very enjoyable. And there is some interesting dynamics which seemed quite original.This film really shows Hayden Christensen at his very best, and although at times it seems that Bruce Willis is just going through the motions, he does his job perfectly fine.It is also worth noting that Danny (Ty Shelton) has to be one of the very very few likeable child actors out there. He plays his part perfectly, and unlike so many young actors who over do it, I never once felt like I wanted him to come to any harm by the kidnapper. So rare these days for a truly likeable young character in a film.Perfect Saturday night viewing. I watched the film from start to finish and after the first 20 minutes had passed, I never checked my phone, or looked away once. And in this day and age a film that can keep my attention is a film I can recommend.8/10"
    }
  ]
}