{
  "id": 2075,
  "title": "Ouija: Origin of Evil",
  "starring": [
    "Elizabeth Reaser",
    "Lulu Wilson"
  ],
  "runtime": 99,
  "genre": [
    "Horror"
  ],
  "description": "In 1965 Los Angeles, a widowed mother and her two daughters add a new stunt to bolster their séance scam business and unwittingly invite authentic evil into their home. When the youngest daughter is overtaken by the merciless spirit, this small family confronts unthinkable fears to save her and send her possessor back to the other side.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cAZk4y7JZswALX6nTf5KXNjPMUE.jpg",
  "categories": {
    "plot": 6.071428571428571,
    "acting": 6.433333333333334,
    "ending": 6.545454545454546,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 5.8,
    "funny": 4.5,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Mike Flanagan is an excellent director and he clearly showed his talent in this creepy horror film, the performances were great and the visuals were pretty well done, I actually liked the third act I don't know why many people complained about it."
    },
    {
      "rating": "8",
      "text": "Flim-flaming, séance-performing woman's daughter can genuinely contact the dead and manages to get herself possessed."
    },
    {
      "rating": "7",
      "text": "Lulu Wilson's excellent performance pulls this movie to thrilling highs. Ouija: Origin of Evil is yet another horror riding off the success of Lights Out & The Conjuring 2. An old-fashioned atmosphere set nearly 50 years earlier from the original. The film certainly works as a stand-alone story, but never quite reaches the standards of 2016 strong showcase of horror. Ouija arrives perfectly for Halloween; horror fans this is a must watch."
    },
    {
      "rating": "10",
      "text": "++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "8",
      "text": "Uuija: Origin of Evil doesn't do anything to break the mold on the horror genre, instead they opt to write and interesting and capable horror film. A fantastic prequel to 2014's Ouija, the pacing of the story, writing and cinematography are all good enough that anyone who fancies horror or paranormal films should be more than content with what they are presented with."
    },
    {
      "rating": "8",
      "text": "Surprisingly great. Probably one of If not the best sequel to a film ever made which isn't saying a lot because the original film was so terrible. Mike Flanagan directs another great film. Him and James Wan are now the best horror directors working in Hollywood today. I loved the time period and the cigarette burns they put on the top right. The acting was superb especially from Annalise Basso and Lulu Wilson who is extremely terrifying. The movie's first half was spectacular but the ending doesn't necessarily fall apart but it becomes a little predictable and cliched."
    },
    {
      "rating": "9",
      "text": "My 14 year old daughter loves these types of movies.  This one was really well done.  I recommend.  9/10."
    },
    {
      "rating": "9",
      "text": "This is real horror, people. This is the real deal. This isn't just your spooky jumpscare flick, no, this film is actual horror. Directed by Mike Flanagan, Ouija: Origin of Evil is an outstanding horror film with an absolutely flawless plot, amazing performances, and solid dark, creepy atmosphere. Mike Flanagan knows how to cause fear, from real, scary things like insanity, grief, death, instead of those little jumpscare flicks that so called \"horror fans\" hold so close to heart. Because of this, he is my personal favorite horror director to this day, and I will stand by that opinion any day. This film is a true depiction of his talent."
    },
    {
      "rating": "8",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    },
    {
      "rating": "10",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•"
    },
    {
      "rating": "8",
      "text": "Synopsis: In 1967 Los Angeles, a widowed mother and her two daughters add a new stunt to bolster their seance scam business and unwittingly invite authentic evil into their home. When the youngest daughter is overtaken by a merciless spirit, the family confronts unthinkable fears to save her and send her possessor back to the other side."
    },
    {
      "rating": "10",
      "text": "This is a fantastically underrated horror film from master Director Mike Flanagan. The original was rubbish but with Flanagan at the helm we get a horror masterpiece with a very old school feel, almost reminiscent of the exorcist. The imagery is very disturbing throughout, along with the actual concept itself. Solid pacing, good acting, all of the elements are in place. It actually scared the living crap out of me. This is how it should be done"
    },
    {
      "rating": "3",
      "text": "Is this supposed to be a scary movie? It felt more like a very dull/confused drama. Save your money and go see something else, anything else for that matter."
    },
    {
      "rating": "7",
      "text": "It was fun. Way more fun than a sequel like that had any rights to be. It had some good scares that defied my expectations and a story that was just engaging enough. It's a shame that it's so lacking in any themes and doesn't provoke any particular thoughts. Still, it's infinitely better than a lot of modern horror movies."
    },
    {
      "rating": "10",
      "text": "OMG!!!!!!!! The best horror movie ALL TIME!!!!!! Congretulation MIke!!!!! 10/10 :)"
    },
    {
      "rating": "7",
      "text": "Director Mike Flanagan has a real eye for horror and he has really began to develop his own unique style.  In this case we have a sequel easily better than its predecessor. B+"
    },
    {
      "rating": "7",
      "text": "Talk about a franchise doing a complete 180. 'Ouija' may be one of the worst horror movies ever, but Mike Flanagan saves this franchise through the use of a genuinely unsettling atmosphere and authentic scares."
    },
    {
      "rating": "8",
      "text": "Mike Flanagan has proven himself once again to be one of the best directors of horror today. He manages to take what I honestly believe to be one of the worst horror movies ever created, \"Ouija,\" and give it a darn fine prequel with \"Origin of Evil.\" He even goes so far as add little flourishes that really sell the late 1960's era setting. He recreates it well and little flourishes that pop onscreen are there to harken back to what it was like watching a movie during that time period as well. These touches are remarkable and make the movie one heck of a period piece. The attention to detail is great.As a horror film it stands alright as well. Admittedly, it's not very scary at all. Yet, Flanagan has some great tricks up his sleeve to make it more than your average jump scare fest. The tone is suitably creepy and bizarre moments are around every corner to set viewers on edge. Of course the real strength in this department comes from the young Lulu Wilson. Her performance is astounding. Better than a lot of actors and actresses who have been in the game for years. She's creepy, sweet, and demented. Perfectly capable of playing both adorable little angel and deformed, vile demon all in the same film. She is what's so creepy about things.I am able to forgive the lack of fright thanks to both the movie's ingenuity and well-written plot. Struggling families are nothing new to horror films, but rarely these days are their struggles so well realized. We witness genuinely fleshed out characters that are backed up by great performances. Little touches of humor and heart add believability to the situation. The set up about these characters running a scam about being able to contact the dead in order to just get by, and then coming across real trouble when they are actually able to make contact is a great one. It's also a very effective prequel tale that ties into it's (awful) predecessor nicely. I don't recommend watching that movie to see for yourself though. Just stick with this one.A perfect example of how something good can come out of something really, really bad. At least when the situation is in the right hands that is. Mike Flanagan outdoes himself by rising above what could have been a simple paycheck and a awfully delivered movie like the first Ouija, and goes out of his way to create another truly great modern horror movie. It may be lacking in actual scares, but it certainly tries harder than the average flick in the genre that hits the screen these days. Give it a shot. It's not perfect, but it certainly stands as a really enjoyable experience and not just because it is a HUGE improvement on it's predecessor."
    },
    {
      "rating": "8",
      "text": "Ouija: Origin of Evil is justice for horror sequels, it's scary, disturbing, clever, well-acted and the best horror movie I've seen in a while. Maybe Mike Flanagan's finest work yet."
    },
    {
      "rating": "8",
      "text": "OUIJA Franchise Is Manumitted by Mike Flanagan\r Ouija Board has gained certain religious veto with the passing of the years, given that  the game designed by Hasbro company by the end of the 19th century with a child guidance, became in a spiritual communicator between the world of the living and the dead. These superstitions around the \"game\" were calamitously squandered  for Universal in 2014 with a film that directly pointed to NO. The equivalent to a creative disaster of horror genre was showed two years ago, however, with a minimum-budget of $5 million dollar, earned around $103,590,271 million, anything unusual with Blumhouse Productions as production company. Because of tremendous economic success which reached such film, a continuation was unavoidable , the surprising thing was that the start with a clean slate produced a frightening prequel, one of the best in the genre so far this year.\r \"Origin of Evil\" takes place in 1967 Los Angeles and tells the backstory of Lina Zander, the character played by Lin Shaye in the first movie. The Zander family is going through an economic, sentimental and labor standstill following the father's death, Roger (Michael Weaver), who died in a car accident. Trying to evade economic suffocation, the family does fake seances in order to help people to contact deceased beloved ones. With a complex and disturbing indication mechanism, they simulate a true communication, achieving give an unfounded peace message to melancholic clients. Despite realistic effect, Alice (Elizabeth Reaser), now family's pillar, decides to add a new element to the spiritism circus, this is where the OUIJA board comes into play. Doris (Lulu Wilson), the youngest daughter, connects to what she thinks is the spirit of her dad, nonetheless, once it has shown clement and reliable, things become sinister because of the fatal oversight of the three main rules: 1. Never play alone, 2. Do not play in a graveyard and 3. Always say goodbye, remember: OUIJA knows all the answers.\r All starts well from the opening of  throwback Universal Pictures logo, which radiates nostalgia and memories in equal parts. Watching again the company logo for the 70's evokes pure sentimentality for those movies that really established the filmic foundations. Together with the emblem, oval and white marks in the upper-right corner of the screen, giving the appearance that the film is still projected in the old format, providing empathy with the context of the story.\r Director and co-writer Mike Flanagan together with Jeff Howard conceived a greater story in all respects to the first film. As it is a prequel, it is not prescriptive that you know the forgettable initial story, since the task of this film is to lay the groundwork for  Laine Morris' story . In addition to serving as main common with the terrible predecessor, it does not show unilateral nor empty characters, but delivers measured and sumptuous dialogs (monologue by Doris) and well-positioned plot twists. Flanagan and Howard are primarily concerned to initiate a solid connection between main roles with the audience, then  hold on us to our seats with calamities suffering them throughout the full-length film. It provides formulaic and common few scares that debilitate what has been achieved, nevertheless, it is remunerated with practical and original jump-scares supported with exaggerated special effects, which overdo the movie of fictions, however, many of them work with the unexpected ending - unpredictable if you were not thinking in Lina's life from the first film.\r In general, performances are permissible and even electrifying because of the consistent link generated in the first half with the affable characters. Doris, the younger star, performs the role debut of her career in great style, shines with her own light and joins the clan of promising girls in horror (Isabelle Fuhrman, Madison Wolfe, Heather Sossaman). Besides, Basso delivers what we must perceive of her character, a girl who is in physical and sexual awakening, Reaser, an enterprising mother and Thomas, a priest who must prevent a tragedy.\r One of the most curious and iterative aspects are its references to classics as modern as ancient. Among these are William Friedkin's \"The Exorcist,\" \"The Conjuring\" by James Wan, \"Oculus\" and \"Hush\", these last two were directed by Flanagan. It extracts helpful techniques and visual pieces, in which predominate faithful and precise touch at the end of the 60's, cars according to the epoch, clothes not so sinister but appropriate and an alarming soundtrack.\r Flanagan does not renovate horror genre with \"Origin of Evil\", but gives a new direction to the franchise, a glittering direction pointing directly to YES. We must keep a close eye on the career of this director, who promises much in atmospheres, stories and settings. Perfect for Halloween, perfect for the loyal horror fans, \"OUIJA\" only is for a demanding public."
    },
    {
      "rating": "3",
      "text": "The movie started out okay, with a nice 60s setting and a decent slow-building creepy atmosphere.  Then it just went full-out ridiculous, which completely destroyed any creepiness it had built up.  I spent the last act of the film laughing and mocking the characters for behaving so weirdly."
    },
    {
      "rating": "9",
      "text": "one of the best horror movies i've seen from this year, plot is good and thick, there's enough action in the second half to keep you exited and keep the adrenaline up. the first half is a good explanation for what is going on since the first movie did not give that much of an explanation this wraps up all the loose ends! definetaly check this out and the first movie aswell."
    },
    {
      "rating": "10",
      "text": "One of the scariest movies I've ever seen. The film keeps you on edge by the fear of the unexpected and offers little to no jumpscares. Now that's a horror movie!"
    },
    {
      "rating": "3",
      "text": "So apparently the origin of evil starts in the 1960s for some reason, how terrifying. A mother and two daughters run a séance scam which becomes all too real when the youngest daughter is inhabited by a spirit. And by that I mean crawling on the walls, scarily whispering at people and sitting in front of the TV with whitened eyes and her jaw hanging open. You know the usual stuff. At some point the script for the movie clearly ran out and everyone decided to just wing it with a bit of improv, and if that wasn't bad enough you're bombarded with endless jump scares quickly followed by a cut to a black screen for \"dramatic effect.\" This works no problem in a trailer but not the movie itself. Not recommended, seriously not worth your money."
    },
    {
      "rating": "7",
      "text": "A suprisingly decent film unlike the terrible original. You actually care for the family even though you know how it`s going to end if you wached the original. It`s not really that scary though."
    },
    {
      "rating": "6",
      "text": "It was OK movie overall.\rYES it could had been much better but anyway..\rIt was frightening scary at times & kept me interested till the end..\rOuija 2 is from the good descent horror films of 2016."
    },
    {
      "rating": "7",
      "text": "It has a nice vintage feel similar to both Conjuring films, but pulls a lot of influence from them, maybe almost too much. However it's still executed quite nicely with solid performances and some genuinely solid scares. They kind of rush the ending and leave it rather grimly depressing but that is what leads into the original Ouija film from 2014 i guess. There are some really cheesy parts strewn in but if you just look at it for what it is you should feel satisfied enough. Definitely another effective horror film of this rare outstanding 2016 horror year."
    },
    {
      "rating": "6",
      "text": "I didn’t see the first Ouija movie, and I thought this one was supposed to be a prequel and explain things. On the contrary, I found it mystifying and with many plot holes. Would I have been able to fill them if I had seen the first movie? That said, I thought the film was very well done (even though I couldn’t quite understand what was going on or who was doing what to whom) – beautifully photographed, very well acted, and nicely paranoid. I just didn’t understand why."
    },
    {
      "rating": "10",
      "text": "Why is this movie not in Cine 1? I want to pay the higher price to watch it again. It was so captivating that My wife, and I didn't even get through our drinks."
    },
    {
      "rating": "5",
      "text": "Comparing this to its poorly-done predecessor, this is actually done and built better as just your average movie itself. As a horror, however, still not trying at it. Good backstory, but terrible horror sequences. Still better than its predecessor."
    },
    {
      "rating": "7",
      "text": "Mike Flanagan is a good director, Doctor Sleep and Oculus probably his best.  This is well photographed, nostalgic looking-love the vintage hairstyles."
    },
    {
      "rating": "7",
      "text": "It seems I'm on a winning streak here in terms of horror movies: this is the third film in the genre I've been to see in the last few months that I can say I enjoyed. The characters in this film are all believable (for the most part) human beings with human emotions, reasoning behind their actions (though that doesn't mean they make the logical choice by any stretch), and problems.\r That said, I wish a horror movie could include a female teenage character without having to turn them into eye candy. Oldest daughter Lina could have been just another whiny, annoying adolescent who ultimately survives by pure dumb luck or gets her come-uppance and is knocked off (we all inevitably cheer when this happens), but thankfully for her she's a little bit more wary that behaving like a spoiled brat isn't going to take her far in the world, and while she does have her irritating moments she is kind, caring, and intelligent (I've got to commend her on her bravery in staying in the house to help search for her sister. I would've gotten the f**k out of there at the first chance I got). Unfortunately, some of this characterization is detracted by by her wardrobe, which was obviously chosen for maximum sex appeal: the girl's bust is flaunted so prominently in the red sweater she wears during the scene that starts all of this it's practically thrust into your face (don't pretend you weren't looking, you dirty liars...), and after that she spends half of the film's runtime in a uniform straight out of \"Criminally Underdressed Catholic Schoolgirls Monthly\". Show me one Catholic school that allows skirts to end midway down the thigh...See? Can't do it. True, part of the reason she's so appealing is because she's characterized in the way that she is (by the power of boners, and teenage hormones!), but still...You get my point.\r Ugh...Did I just defend neo-feminism right there? That's what that feels like? NOT a good feeling. Anyways, the story: in 1969, Alice Zander (Elizabeth Reaser) runs a scam fortune telling parlor with the help of her two daughters, the aforementioned Lina (Annalise Basso) and younger Doris (Lulu Wilson). After the older girl sneaks out (as all teenagers do) to drink and party with her friends, a Ouija board is discovered and played with; of course nothing happens, this being one of the first scenes in the movie, but it does inspire Lina to tell her mother about the board in the hopes of incorporating it into the act. Now, anyone who has watched the first movie (or played the game) is probably familiar with the rules, which means I will save you an explanation of them, but I will tell you that right off the bat they begin breaking every single rule on nearly a 5-minute basis. And characters in horror movies wonder why bad things happen to them...Listen, you probably know the rest from the trailers. A love interest for Lina (Parker Mack) and an exorcist/family friend (Henry Thomas; no offense to Mr. Thomas, I honestly thought his character would turn out to be a sex offender. I mean, he's the principal of a school where girls dress like something straight out of erotic anime fan-fiction) are inevitably added to give the movie a few male characters, and I don't think it's revealing too much to say that they both (also inevitably) bite the dust. You can't call spoilers on me for this one, this is Horror 101: in ghost movies, the boyfriend and the priest always die.\r The third act is what I have the most trouble with in this movie, and if you go see it, there's no doubt in my mind that you will feel the same. Overall, the movie is competently made--as in many films of the same genre, the first act gets off to a slow but gradually rewarding start as the characters chalk up the things happening to some good \"miracle\" or innocent coincidence, a direct pathway into the second act where they begin to figure out the sinister nature behind what's going on more--but Part Three is where it goes from enjoyable familiarity to tolerable descent into middling madness before erupting in a complete and utter f**king free-for-all. It made zero sense to me, and if the movie hadn't been so well-shot, acted, and scripted (well, compared to the original, and MOST modern horror movies) up to that point I would have considered walking out of the theater. Obviously I didn't, but I would have if A.) the movie had been inferior in any way to the finished product I viewed last night, and B.) my girlfriend hadn't been with me. At the end of the second part the priest, fully aware of the Zanders' family business, shows up for a reading by the now-possessed Doris, and reveals some awesome sleuthing he was doing during that exchange. I would have loved to have seen more of that, as usually all priests do is die, or get chased out of the house, or f**k their students (or have them f**k each other...Looking at you, \"Primal Fear\").\r Point is, if you haven't seen the original, don't bother. This film is superior in every way. 7/10"
    },
    {
      "rating": "7",
      "text": "One of the best horror films from 2016 (probably second after The Conjuring 2). Charismatic actors and a pretty innovative family interaction make for a great pay-off towards the last part of the film. Good acting and very tense moments. Must see for lovers of the genre."
    },
    {
      "rating": "10",
      "text": "♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"
    },
    {
      "rating": "6",
      "text": "Far better than the first film but not great enough to stand on it's own, \"Ouija: Origin of Evil\" is nevertheless a twisty, scary ride."
    },
    {
      "rating": "2",
      "text": "This movie is phenomenal if you consider, cliché and horror stereotypes some sort of revelation. Unlike Lights Out (that had a few elements of originality)'Ouija: Origin of Evil' follows a Mother who is running a scam fortune telling business and her two daughters who lost their dad recently. The reason I bothered to mention their dad died recently is because they mention his departure a lot, in every scene in fact. Just in case the audience forgot. The beauty of this film is that you don't have to retain any information from the previous scene because they just blurt out exposition during any moment of plot development anyway. The acting is OKAY but it's pathetic character arcs and the character's non existent personalities give the actors little to work with.I'd recommend Conjuring 2 before i'd even remotely consider recommending this crock of crap. I genuinely found myself laughing of bordem during this film especially since the mother's source of the Ouija board was at a Cafe/Diner and people's reactions to some of the events in the film were over the top on some of the minor character's behalves. all and all just about every element of this film was a let down, from the screenplay to the direction and the fact that the film is even remotely being praised because of it's homage to it's cigarette burn on the film and opening title card featuring roman numerals is not enough to redeem this disappointment in film form."
    },
    {
      "rating": "6",
      "text": "So this is where it all began!It is a decent horror film, but surely better than the first. The previous part was an usual teen themed horror where everything started as a playful. But this one was a prequel and it focused on the origins. A single mother with two daughters is making money helping the people who want to contact their beloved dead ones. The things changes when her little daughter started to communicate the spirits of her own. The chaos unleashes, the house becomes haunted and the family begins to fall apart.Keeping it simple is what worked out well for the film, despite thematically borrowed from others, scenes were kind of familiar and characters intentionally developed. Particularly the priest role was the most overused in any horror film. Followed by the twist. That turning point was good, but not a new. Nice performances and well shot film. Ouija is a fine concept for a horror theme and with this film's somewhat success, I hope the next one would only get better. So it is worth a watch, if you're not anticipating a something special.6/10"
    },
    {
      "rating": "5",
      "text": "This movie is kinda in that its so bad it's good territory, like the movie isint scary at all, some of the scenes that where meant to come off as scary actually are funny this is a weird movie."
    },
    {
      "rating": "6",
      "text": "Good until a cheesy third act! This movie is well made from a technical stand. I really like how the director captures the 60s style, fashion and mood. The acting is solid, especially the little girl. She's sweet and creepy, all at the same time. The first hour presents a nice build-up, but then something happens to start the last 30 minutes and it throws the movie off track. It's not so much the event itself but how everyone around it responds to it in an unrealistic way and the movie just gets silly from there. Still, the good definitely outweighs the bad and the special effects are awesome!"
    },
    {
      "rating": "7",
      "text": "BIG ImprovementUnlike the first film, Origin Of Evil is a film that ACTUALLY TRIES!"
    },
    {
      "rating": "6",
      "text": "Its a \"Meh\" Movie. Nothing new and nothing really interesting but if you like scary films it will scratch that itch. Hereditary,Abigail Hunting and The Nun were way better. Not a bad movie just not really that great. Doctor Sleep on the other hand was amazing! This gets a solid 6 from me."
    },
    {
      "rating": "10",
      "text": "-------------------------¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "10",
      "text": "[][][][][][][][][][][][][][][][][][][][][][][][][][][][]!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,"
    },
    {
      "rating": "6",
      "text": "Mike Flanagan just gets so close yet again, yet falls disappointingly short. Oculus is still his best work, and the promise that both Hush and this prequel to a PG-13 board game prequel show, is that if given the right opportunity he might really be capable of a cold-blooded classic.This is a film that shouldn't exist, should never have gotten theatrical distribution and definitely shouldn't have attracted the likes of Flanagan (okay, he probably did this to increase his clout in the industry, but still). He musters some great work here, following familiar supernatural cliches but bringing his own touch to the proceedings.The setting is beautiful, the characters likable and not completely square. The atmosphere is given time to build, he luxuriates in teasing and messing with audience expectations (as a way of spiting this, and goosing the audience lulled into a slow burn placation, he includes an explosive scene wherein the actual demon is seen shoving his fist down the little girl's throat. It's both too much and a necessary jolt at the time, a conundrum if ever there was one and a small encapsulation of everything right and wrong within this film). It's too bad some of the nice work done in the first 2/3rds of the film is undone by a cliched, boring, exorcism-lite finale. None of it is very scary, and it all has the feel of fitting into the \"Ouija\" franchise package, whatever in God's name that could mean. Considering the stakes here, what Flanagan does is still impressive."
    },
    {
      "rating": "6",
      "text": "Pretty much, this movie is exactly what you think it will be. However, it does have a bit of heart with some well rounded and well written main characters. Also, the creepiest little girl ever (with exception to the Exorcist.) Good build up and creepy enough atmosphere to get the job done.Overall: This is a decent horror movie that doesn't really do anything new, but what it does, it does pretty well and is entertaining."
    },
    {
      "rating": "5",
      "text": "I am just gonna give this an average 5 because I am honestly not sure what to say about this movie. Yeah it has some really great horror moments like when the super cool looking demon just suddenly appears but there are also some really cheesy unnecessary parts to it as well."
    },
    {
      "rating": "5",
      "text": "I've always found Mike Flanagan's movies to be quite overrated, and this movie is for me the best example for why I think that.It's just a bland and unmemorable movie. Never really scary and only ocassionally creepy. It has some good ideas but is held back by having to expand on the lore of its awful predecessor. I like the look and the style of it, but I just wished it offered more than a well made but generic story.It starts strong but quickly descents into pure over the top horror loudness. It reminded me a lot of The Conjuring (another well-liked horror film that I'm not a big fan of for similar reasons).Most of Flanagan's movies I've seen are ok at best.I just think his work is not for me."
    },
    {
      "rating": "4",
      "text": "I was impressed with The Haunting of Hill House, with Mike Flanagan at the helm. And I thought, I love the first two Conjuring films, as I felt they were directed with heart by James Wan, and I figured, hey, what Flanagan did for his series could be similar to Wan working in a film format. Not quite.If you are getting into Flanagan's oeuvre, I would say this might be a misfire. The premise seems fun enough, psychic scam artist family ends up getting in quite deep when the supernatural actually creeps into their lives. But the other aspects of the story, namely the father who passed on and the history of the house are barely fleshed out to give the ending any substance or payoff. If this house the trio is occupying is supposedly cursed, or adds an element of horror, it might have worked with more foreshadowing and backstory. Instead, the reason we learn that horrible things are happening is because, oops, the three characters were doing ouija on a cemetery, that is, bodies are buried on the property and so... it's against the ouija board rules. Sure, it might explain things and yet it doesn't. On the plus side, all the leads are great and you are invested in their story until they become disposable for the evil to take over and then, with the ending, I shrugged feeling more cheated by the clumsy script. As the climax began to hit its stride, I'll admit, I checked out. Character arcs were fumbled. Some moments didn't feel earned or meaningful. The whole thing, again, is a misfire. They are some nice scares here but I keep returning to the Conjuring films not only for the scares and creepiness but also the well-crafted script and the characters. Here, the characters are fine, the script nose dives near the end."
    },
    {
      "rating": "10",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"
    }
  ],
  "recommendations": [
    "insidious_chapter_3",
    "annabelle_comes_home",
    "the_conjuring_the_devil_made_me_do_it",
    "the_conjuring_2",
    "lights_out",
    "sinister_2",
    "scary_stories_to_tell_in_the_dark",
    "annabelle_creation",
    "the_conjuring",
    "insidious_the_last_key",
    "the_woman_in_black",
    "it",
    "the_prodigy",
    "it_follows",
    "the_ritual",
    "insidious_chapter_2",
    "dark_skies",
    "mama",
    "the_possession",
    "the_curse_of_la_llorona",
    "you_should_have_left",
    "the_babadook",
    "us",
    "the_witch",
    "antlers"
  ]
}