{
  "id": 1585,
  "title": "Our Friend",
  "starring": [
    "Dakota Johnson",
    "Casey Affleck"
  ],
  "runtime": 124,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "After learning that his terminally ill wife has six months to live, a man welcomes the support of his best friend who moves into their home to help out.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vg9C5LttsKBqoLuqeQvOXaeBGiD.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 8.222222222222221,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The titular character is played by Jason Segel, relishing an opportunity to go heavy. He’s besties with a married couple (Casey Affleck and Dakota Johnson). When she’s diagnosed with terminal cancer, he moves in with them and their 2 young daughters to help them cope. Yes, this is as grim as you might imagine. Making it somewhat more interesting (and sometimes confusing and sometimes frustrating) is that the timeline continually jumps around to reveal more about their relationships and extend the misery. The actors all do a fine job, but the continually intense interactions take a toll. Making it harder to handle is the 2 hour running time. Ironically, it’s based on a magazine article, but the length feels more like a novel. As an examination of death and friendship, the film is earnest, but the rambling narrative and extended length dilutes the film’s emotional impact.One weird aspect: Even though the movie takes place in Alabama and New Orleans, only one person (the always wonderful Cherry Jones in a small part) has any trace of a Southern accent."
    },
    {
      "rating": "6",
      "text": "I thought this film was quite touching at points but not entirely original, although its based on a true story, so its important to point that out. Casey Affleck gives a pretty decent performance as the father and its a thoughtful film to an extent - showing how he reacts to the situation he faces with his daughters. Its not one of the most memorable films about terminal illnesses, parents with such circumstances, that I've seen but its not bad either. If it sounds of interest, I'd say its worth watching but don't expect too much perhaps..."
    },
    {
      "rating": "8",
      "text": "Great cast. Broke my heart. Jason Segel surprised me. Family and friends are what sustain us as humans. They got a LOT of things right with this story"
    },
    {
      "rating": "10",
      "text": "This film is a masterpiece. The subtlety of emotion & the chemistry between the actors was truly beautiful. Isabella Rice (Molly) shone as the eldest daughter, quietly distressed & conflicted; she was incredibly mature & elegant for such a young lady. Dakota Johnson (Nicole) offered all the light & shade the role could possibly need. Jason Segel (Dane), in a role I couldn't have imagined him playing, was stunning; from the authentic humour he brought to the darkest of moments, to the heartbreak his character battled with throughout. And Casey Affleck's (Matthew) performance will live with me for a long time; his nuanced performance was sublime. My partner & I were left heartbroken, yet somehow uplifted, by this work of art."
    },
    {
      "rating": "9",
      "text": "Literally rip my heart out. This movie will hit close to home for so many people."
    }
  ]
}