{"id": 4088, "title": "Out of Death", "starring": ["Jaime King", "Bruce Willis"], "runtime": 95, "genre": ["Action", "Thriller"], "description": "As Shannon, a woman who wants to put her father's ashes away in the woods witnesses a corrupt cop dealing drugs with a junkie, she has to try and run away after she gets rampaged by two discreditable cops after they see her taking secret photographs of their crime maneuver. They then do a cat-and-mouse game around the woods as Shannon teams up with a retired sheriff along the way for more reinforcement. It's just a diversion of survival and egalitarianism.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/zan6xYKNGKgkp2hFajU398I1iTD.jpg", "categories": {"plot": 5.0, "acting": 0.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 0.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "0", "text": "I'm worried that a zero would be deleted but MY GOD! What a terrible bunch of actors..  it feels completely fake as in actors behaving in uncharacteristic ways ... or unconvincingly ways.. I almost cannot quite put my finger on it but it is just weird and strange and somewhat not human like. The hiker (a young Elizabeth Warren doppelgänger) goes on a hike but is dressed for a day in a city park and appears to have absolutely zero gear, complete with yoga shorts. The rain in the beginning is the most fake looking rain that it almost look like crystals falling in one dimension without anything falling on the actress, her glasses nor on the notebook that she decides to pull out of her pack for no real apparent reason but to narrate why she is there in the first place .. punctuated by hugging an earn.. bizarre bizarre bizarre. I've never seen a collection of clichés and movie tropes crammed into the first 15 minutes of a film in my life. Bruce Willis should be embarrassed to be involved with this stinker. I blame the writers and whomever chose these ancillary actors that worked beside Bruce. They were all insipid, cloying and paper thin to the point of coming off alien-like. I swear if I see another child actor introduce its self by simply running to the nearest adult to hug the main actors leg one more time I'm going to scream. \"PEOPLE DON'T ACT LIKE THAT! PEOPLE dont even look like that! She watch channel zero!\" Flava-Flave from Public Enemy (before rap was co-opted by the machine)"}, {"rating": "5", "text": "Actors are okay, story per se is also okay. But the individual scenes make barely sense at any time. Same for the behavior of the characters."}], "recommendations": ["jurassic_world", "cosmic_sin", "the_shape_of_water", "sanctum", "transformers_age_of_extinction", "catwoman", "after_earth", "captain_marvel", "diablo", "those_who_wish_me_dead", "frozen", "stranger_things", "terminator_dark_fate", "men_in_black_international", "basic_instinct_2", "robocop_2", "unhinged", "wonder_woman_1984", "ghost_rider_spirit_of_vengeance", "skyline", "suicide_squad", "i_care_a_lot", "shadow_in_the_cloud", "the_counselor", "teenage_mutant_ninja_turtles"]}