{
  "id": 4548,
  "title": "Out of Time",
  "starring": [
    "Denzel Washington",
    "Eva Mendes"
  ],
  "runtime": 105,
  "genre": [
    "Thriller",
    "Crime",
    "Drama"
  ],
  "description": "Matt Lee Whitlock, respected chief of police in small Banyan Key, Florida, must solve a vicious double homicide before he himself falls under suspicion. Matt Lee has to stay a few steps ahead of his own police force and everyone he's trusted in order to find out the truth.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wdniUkm0hwXv2RqzvwWy5XtRNvB.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 3.5,
    "ending": 6.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Make sure to stay in your seats for this one, because even though that first act drags a bit, by the time you hit act two -- trust me -- all is forgiven. \"Out Of Time's\" final two-thirds is a dramatically ironic, tense, and thrilling ride that honestly kept me guessing for a good portion of it. Denzel Washington's increasingly frantic and dynamic lead performance helps keep you anchored to your chair as each new plot twist and near miss keeps you salivating for more. Director Carl Franklin and screenwriter David Collard have honestly killed with this fun little detective romp that didn't come anywhere close to overstaying its welcome. A surprisingly good time overall."
    },
    {
      "rating": "7",
      "text": "Out of Time may deliver headaches to users, but you got to admit, something's pretty suspicious is going on with this movie and only you can guess what's going on."
    },
    {
      "rating": "9",
      "text": "《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《》》》》》》》》》》》》》》》》》............................."
    },
    {
      "rating": "6",
      "text": "Out of Time is entertaining but painfully predictable. 20 minutes into the movie i knew exactly what was going on. Chief Whitlock is not your typical Denzel role, and while he played it the best that he could, I just feel like it didn't suit him very well. The location of the movie didn't make a whole lot of sense, and that wasn't the only thing. Why would a detective from Miami and his ex-wife be investigating a crime an hour away in some small town? Miami PD isn't the FBI. The movie has a lot of plot holes and everything that happens is fairly obvious. It's entertaining, but it's not going to blow anyone away."
    },
    {
      "rating": "5",
      "text": "Out of Time...wow, I guess this movie has not aged well at all. This movie could honestly be titled \"Chief Whitlock and the Quest for Blowies\" because this character that Denzel plays is such a degenerate, but the movie has a fun and light-hearted air that really makes it border on \"So-Bad-It's-Good\" territory. For example, why does every man dress like a middle-aged white suburban dad? And why is this archetype suddenly the pinnacle of sexuality and masculinity? Seriously, DENZEL as the CHIEF OF POLICE wears those white shorts, tall socks, NewBalance shoes, and a big T-Shirt with a ball cap. He looks like he is going to mow his lawn on a Sunday morning, and every girl cannot resist him! The movie does have some nice moments, but it's ultimately forgettable."
    },
    {
      "rating": "5",
      "text": "Not totally bad, but can not get over its shortcomings, and at the end feels like a generic thriller, which had some good moments, and a better cast."
    },
    {
      "rating": "5",
      "text": "Interessante história..porém, o desfecho muito fraco!!! Pela ação até que vale a pena, denzel até está bom neste filme, só que a escolha do filme que foi péssima!"
    },
    {
      "rating": "6",
      "text": "Although the movie is rather predictable, it's still enjoyable to watch. Not the best Denzel Washington movie out there but still worth it if you're not looking for anything too special. My girlfriend definitely liked it and was at the edge of her seat!"
    },
    {
      "rating": "10",
      "text": "Well I guess its a perfect movie for me, it has no flaws, I enjoyed it to the core, well done directos, actors, producers, screenwriters and all the indiviuals involved in the making of the movie."
    },
    {
      "rating": "1",
      "text": "Other than Denzel the actors really sucked. I mean they were bad, really bad. I can't believe he associated his name with this cast of misfits."
    },
    {
      "rating": "1",
      "text": "Other than Denzel the actors really sucked. I mean they were bad, really bad. I can't believe he associated his name with this cast of misfits."
    },
    {
      "rating": "8",
      "text": "$&$&$&$&$&$&$&$&$&$&$&$&$&$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》"
    },
    {
      "rating": "9",
      "text": "{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●¿"
    }
  ]
}