{"id": 3585, "title": "Outbreak", "starring": ["Dustin Hoffman", "Rene Russo"], "runtime": 127, "genre": ["Action", "Drama", "Science Fiction", "Thriller"], "description": "A deadly airborne virus finds its way into the USA and starts killing off people at an epidemic rate. Col Sam Daniels' job is to stop the virus spreading from a small town, which must be quarantined, and to prevent an over reaction by the White House.", "releaseYear": "1995", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dxr5NoaIALZThSYeeaJKlMGCZlY.jpg", "categories": {"plot": 5.555555555555555, "acting": 5.928571428571429, "ending": 9.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.333333333333333, "action": 6.5}, "reviews": [{"rating": "7", "text": "It's an actually really well made outbreak movie. Despite the clichés and the unnecessary happy ending, outbreak still managed to be quite entertaining and pretty fun to watch. The acting was great, the practical effects were great and the scenes were the virus is spreading are really well made and quite alarming. Outbreak might not be the best \"outbreak\"movie, but it's still watchable."}, {"rating": "9", "text": "A remarkable and strangely forgotten thriller about a virus outbreak in the USA. Years before the main story there is a virus outbreak in a small village in Zaire in Africa. Two US army virologist visit the village and leave after taking blood samples. Shortly after the village is eradicated by an airstrike. After a jump to current time Col. Sam Daniels played by Dustin Hoffman is investigating a virus outbreak in the same region. After he returned to the USA his superior Gen. Billy Ford played by legendary Morgan Freeman quickly delegates him to other tasks while there is an outbreak in the USA of a strange illness. This is just the beginning of an enjoyable and intense story. It is a cat and mouse game on several levels. It has got twists and something like an all-star cast. Lets start with Dustin Hoffman who is a well acclaimed actor and delivers. There is Morgan Freeman and the statement that there is no bad movie with him. I agree and he is as always excellent. Together with Rene Russo, Kiefer Sutherland, Kevin Spacy, Patrick Dempsey and Cuba Gooding jr there is one of the strongest cast you can imagine. The acting is good and there is no misstep. The acting and story improve each other and go hand in hand. The twist and especially the ending make the film memorable. It is relative scientifically accurate for a Hollywood movie but tropes and action has to be included to be more mainstream or interesting. If you want something really accurate you should watch “The Andromeda Strain from 1971 (Have not seen the newer one). It is scientifically accurate but because of this a contender for boredom for many. What questions me is why this movie is forgotten. Even in my circle of friends that watched it in cinema and thought it was one of the best movies in that year forgot that it existed. It was a financial success as far as I know and many critics praised it. Overall you have and immersive and engaging movie with great actors. Worth rewatching and should be remembered. Remark: The used bomb really exist and is a terrible weapon. It creates an aerosol that is widespread and shortly after ignited. It creates an area of depression as the oxygen is removed (and that damages lungs even outside the explosion area). It is horrible what we humans invented to kill other humans."}, {"rating": "5", "text": "While Wolfgang Petersen may not be the best director of all-time, it is likely impossible to argue that his films are anything less than entertaining. A seemingly chaotic mess of incredibly premises, briefly strong realizations of those premises, and then a descent into cliches that place it strongly in the time period in which it was released, watching a Petersen film is a unique experience. It is like going into a time capsule to see how people from that year really lived and how films were made. Enter Outbreak. A precursor to films such as Contagion, Outbreak is about the spread of a virus from Zaire to America that threatens to wipe out the country in a matter of 48 hours. With a man known for taking chances and going against orders while being rogue/insubordinate regularly, his wife who is divorcing him due to his off-the-cuff style, a goofy assistant who dies part way through, a gung ho newcomer ready to save the day but still too green to be essential, and a military general antagonist, Outbreak is such a mid-1990s film, it almost hurts to watch. Fortunately, under the guidance of Petersen, he turns this quintessentially 1990s slice of cinema into a largely thrilling and engaging enterprise in spite of its flaws.In writing about Outbreak, it is nearly impossible to gloss over the incredible cast at hand. Starring Dustin Hoffman as Doctor and Colonel Sam Daniels, Morgan Freeman as his boss, Rene Russo as his wife, Kevin Spacey as his assistant, Cuba Gooding Jr. as another assistant, Donald Sutherland as a Major General and Freeman's boss, and Patrick Dempsey as the idiot that spreads the virus, Outbreak is a film with a truly stacked cast. Across the board, the group can get a bit hammy and over-the-top at times but is largely as reliable as one would anticipate. That is a great thing for Outbreak considering how bad the dialogue can often become. Stilted, awkward, and seemingly impossible to have roll off the tongue, this group of Academy Award nominee/winning and/or veteran actors really power through this sloppy script and breathe life into every line. Somehow, watching this bunch go through a sea of cliches, plot conveniences, bloat, and terrible dialogue, remains watchable because of who is acting it all out.As with any Wolfgang Petersen film, Outbreak manages to really grab viewers by the scruff of the neck and entertain you at all turns. A thrilling experience, Outbreak's haunting and ominous presence with dire predictions around every corner makes for a truly engaging watch. Anchored by assured direction from Petersen who knows his way around a thriller and a typically solid score from James Newton Howard, Outbreak is a film that may be cliched and contrived, but never ceases to be anything less than an entertaining and exciting film. The highlight of this element largely comes in the lab as the team works to identify this virus. What is it? What does it do? What brought it here? What stops it? These are all questions the film has somewhat revealed prior to the doctors piecing it together, but watching them piece together the clues and study the virus is unexpectedly gripping. Petersen paces these scenes terrifically and sprinkles them freely throughout the film. Always ominous and filled with tension, these scenes are where the film really lives up to the potential of its premise and also where the actors are given the best material work with.Had the film focused solely on this element, it would have been a far tighter and engaging experience. Unfortunately, the film is often quite bloated. While perhaps not that lengthy, there is a shot in Zaire where the camera focuses on a witch doctor doing some sort of ritual. Later, Colonel Daniels asks to speak with the witch doctor only to learn he cannot. The film never comes back to this issue, in spite of dedicating a shot and a specific line of dialogue to him that further called attention to his presence. While perhaps not the most crucial moment, it does hint at the fact that Outbreak could have used another pass through in the editing room. There is some fat to trim here that did little else than extend its running time. A dogfight scene over the forests of suburban California is another source of love handles on the film with Sutherland's Major General McClintock going a tad bit rogue. Overlong with horrifically bad special effects, the scene is both implausible (how could this ever actually happen?) and unnecessary. It is a shot in the arm of unearned and laughably implausible tension that never justifies its presence in the film."}, {"rating": "7", "text": "the movie has a lot of logical mistakes in the story. But it does entertain well and the actors are great. Also the story has some depth with the political fights in the background."}, {"rating": "6", "text": "Wow, I cannot believe most of the cast in this movie have been cancelled.Anywhere...'Outbreak' is terrifying, especially right now. I mean, just step outside and you will think you are in a movie. I found it eerie how some scenes echo what is happening right now, such as: Lockdown and people refusing to follow health and safety measures. The performances from the main cast helped sell that sense of fear, even though the movie at times does lean back into Hollywood fluff. If only happy endings do exist."}, {"rating": "2", "text": "Ruined by Dustin Hoffman. No surprise it was his last major role, he is absolutely unbearable and his overacting, whining, obnoxious personality hasn't aged well at all."}, {"rating": "4", "text": "Un gros thriller épidémique hollywoodien sous la houlette de l'expérimenté Wolgang Petersen qui dispense ici une mise en scène très efficace. Le scénario fait parfois de grands écarts rocambolesques malgré ses tentatives pour fournir une expérience plus ou moins réaliste et la guimauve syndicale est de rigueur ici et là, mais rien d'alarmant.En fait, Dustin Hoffman que l'on voit rarement dans des triple A bien gras de ce genre, parvient à donner une énergie considérable à son personnage en dépit des clichés de l'écriture qu'il doit gérer : c'est la marque des (rares) grands acteurs de ce monde, toujours brillants, peu importent les conditions ! y compris face à  la grue Rene Russo, l'épouvantable boulet du film.Cependant, malgré Hoffman et malgré Freeman dans son rôle habituel d'homme d'honneur à l'insu de son plein gré, le film demeure une grosse machine hollywoodienne limitée et pataude, bête et maladroite : tout dans la gueule, rien dans le sac.On se lasse donc assez vite de ce film-catastrophe qui tourne carrément à la pantalonnade vers la fin et qu'on oublie aussi vite que l'on peut, afin de s'aérer le cerveau un minimum."}, {"rating": "8", "text": "Is there a movie more fitting now of being revisited. I've always loved outbreak although it's an eco thriller there are so many elements of it that feel like a genre film. In fact it sort of reminds of the blob remake in some ways. Dustin Hoffman (Tootsie), Rene Russo (Thor), Morgan Freeman (Bucket List), Donald Sutherland ( Hunger Games), Cuba Gooding Jr. (Jerry Maguire) and Patrick Dempsey (Scream 3) head a solid cast as a virus breaks in a small town because of a cute little, smuggled monkey. The army doctors and CDC race against time as the town begins to die out as the government has alternate options. The movie us thrilling, edge of your seat popcorn entertainment. It's fun but easily relatable because of the solid performances and intelligent screenplay. Unlike our current state as of now the film offers a positive solution that we are all hoping for.Budget: $50mDomestic Box Office: $68mWorldwide Box Office: $190m4.25/5"}, {"rating": "5", "text": "Peterson's empty threats fails to scare its characters revolving around it let alone put an entire world on the verge of annihilation.OutbreakPeterson's empty threats fails to scare its characters revolving around it let alone put an entire world on the verge of annihilation. Driven with similar concept, years later Soderbergh itself took charge over such a tale and he too failed on delivering this cautionary tale with any whatsoever flow. Ironically, carrying the tracks of the disease they didn't have much of a big challenge to be fluent but what sticks this wheel from spinning are the characters that it was supposed to map out. Whenever dealing with such a script that takes you over different territories, the characters that comes in to pass the torch forward, ought to have an arc or at least have the potential to leave an impression, but this seems a far fetched concept in here.Amidst all these disappointments, surprisingly its middle act is a nail biting enthralling drama, from flipping the courts to close calls and from unexpected revelations to an exhilarating chase sequences. And before you know it, that stage is overridden by spoiled dull thrills that are taken for granted along with numb emotions that clearly doesn't go as anticipated. Hoffman as the savior that cracks every pattern and codes is convincing along with Spacey as surprisingly a positive character that still is somehow difficult to digest.Freeman and Sutherland as the powerful selfish antagonist are your stereotypical one dimensional character alongwith Russo as a sort of love interest. But Cuba is the one that stands alone among all that cries, laughs, fears and rage of his in this crisis. His moving character and his impressive brotherhood equation with Hoffman is both heartwarming and charming. Outbreak, if anything, is a threat to the makers on their investment, to the actors on their talent that goes waste by, and audience that just can't spare the time for its mediocrity."}, {"rating": "3", "text": "Unrealistic, unreliable, but entertaining the audience.Made in 1995, this movie still seems very current. The issue is the ever-present danger of a global pandemic. In this case, the script brings to the womb of rural America a new African disease, through a single infected monkey. Of course, the military is called and, as often happens in crisis scenarios in American cinema (eg, \"The Siege\"), turn out to be the real villains of the film, with more than half of the plot around the attempts to prevent the military from doing more harm than good.I think I could rate this film in the field of so-called \"disaster films,\" even though this disaster was partly caused by humans. The script is good, even though it overdoes the events, paint the characters in \"good\" and \"bad\" in an absolutely artificial way and make the facts unbelievable and not very plausible. Much of the outcome of the film (which I will not disclose) is pure luck to the main character. He was so lucky that he would be able to find a tiny needle in a haystack the size of New York if need be. For those who need some realism and credibility to like a movie, this can be a problem.Dustin Hoffman is a good actor, but I think he allowed too much that his character emptied of all the personality that could have had. He is a paper, artificial and cliché hero. And that could be said of all the characters in the cast. The poverty of the script, poorly thought out and built too imaginatively, is clearly reflected in the poor construction of the characters, something that even the best and most talented actor could not remedy. Rene Russo, Morgan Freeman, Cuba Gooding Jr., Donald Sutherland (in yet another military villain character) ... good actors with little or no material to work with.Basically, this movie is a disastrous disaster film. It could be much better with a more judicious and more realistic script, with well thought out characters, with higher doses of reality. This did not happen, but it does not, however, prevent this film from being interesting, especially from the point of view of pure entertainment. It's a movie that entertains if you do not think too much and simply get carried away."}, {"rating": "7", "text": "While undoubtedly nonsense, it's kind of enjoyable in a 90s action movie sort of way. If you liked movies such as True Lies, you'll probably like this."}, {"rating": "9", "text": "Outbreak is quite simply a film about some virus or contagious disease which originally came from a monkey I think and people are looking for a cure. An airborne killer virus that's spreading faster than butter on a slice of toast with everyone turning up dead or sick. Bombs are dropped on those who are sick, infected or carrying this horrible virus in order to stop the spread of the disease which seems a bit cruel instead of curing them just blow them to bits lol... Outbreak is a disaster, drama type thriller and stars Rene Russo, Dustin Hoffman, Kevin Spacey, Morgan Freeman and Donald Sutherland and was made in 1995 which was a fairly decent era for movies since Species and Assassins were dropped in 1995 which I liked because they are good movies. The acting in Outbreak is okay and pretty much all the actors and characters are likeable especially Rene Russo and the films pretty decent and overall entertaining."}], "recommendations": ["beirut", "the_sum_of_all_fears", "morgan", "flight", "apollo_13", "fracture", "hotel_artemis", "the_gunman", "widows", "beyond_the_reach", "valkyrie", "patriots_day", "triple_9", "deep_impact", "knives_out", "a_most_wanted_man", "wall_street_money_never_sleeps", "jack_ryan_shadow_recruit", "twister", "deepwater_horizon", "sicario", "the_good_shepherd", "sully", "elysium", "closed_circuit"]}