{
  "id": 1101,
  "title": "Outcast",
  "starring": [
    "Nicolas Cage",
    "Hayden Christensen"
  ],
  "runtime": 98,
  "genre": [
    "Action"
  ],
  "description": "A mysterious warrior teams up with the daughter and son of a deposed Chinese Emperor to defeat their cruel brother, who seeks their deaths.",
  "releaseYear": "2014",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/efsgCTlofzIuysfokEp7hwQnUho.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 7.333333333333333,
    "ending": 5.0,
    "soundtrack": 0.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 1.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Another rotten Nicolas Cage movie. His accent is ridiculous and the action is laughable. Hayden Christiansen as a Crusader with an unexplained Irish accent who decided to move to China (because that's where the movie money came from) was extremely poor; he looked like, and was as wooden as, David Beckham."
    },
    {
      "rating": "0",
      "text": "After all the pain and horribleness that was some of Nicolas Cage films I still like the guy because his true comedy gold but in this it's not so much of gold...more like ****\r If you expect to see a full movie with Nicolas Cage being crazy and hilarious then you would be very disappointed when you find out that his not in the movie that much. I wish I had more Nicolas cage in this movie because every time he shows up it's funny as hell, but the real focus is on Hayden Christensen which is the worst part of this movie. My god was he terrible in this movie and his like the male version of Kristen Stewart, lifeless and dull performance he did in this movie.\r The writing was awful, the set's looked cheap, the music sucks, the directing was piss poor and seeing Hayden Christensen on screen give me flashbacks of the disappoint that was the Star Wars prequel."
    },
    {
      "rating": "4",
      "text": "the movie is hilarious and boring and feels vary generic but Nicolas cage in this movie is the only reason I would give it a Four out of Ten rating, omg this movie is so cheaply done that they couldn't afford an eye patch for Nicolas Cage lol and he still pulls it off with a few over the top moments, that are noteworthy, the editing is bad in the movie and any moment Hayden Christensen is on screen you fall asleep his acting is mostly mumbles and pouting so much so that I praise the moment when Cage flips out on Hayden Christensen lol it happens about an hour into the movie but i suppose they had to give you something for wasting viewers time lol."
    },
    {
      "rating": "1",
      "text": "Here's another turkey for Nicolas Cage to add to his collection. I kept thinking that Keanu Reeves was going to show up, like in 47 Ronin or some such."
    },
    {
      "rating": "1",
      "text": "I was hoping this would be a guilty pleasure schlock-fest. Instead I got a generic, lifeless movie with boring characters, wooden acting, terrible cinematography, poorly choreographed action, a bland script, and a forgettable plot. At least we get to see a little bit of Nicholas Cage overacting, but he's hardly in the movie. It's not worth watching even from a \"so bad it's good\" standpoint."
    },
    {
      "rating": "10",
      "text": "Clearly one of Nicolas Cage's best performances in years. He clearly shows his talent and shines as one of the best actors of all time. NOT THE BEES ARRRGHHH! ANYTHING BUT THE BEES!"
    },
    {
      "rating": "10",
      "text": "I don’t understand the horrible reviews that this movie has I think it’s a great movie with great acting from Hayden Christianson and Nicholas Cage. It also has great choreography."
    },
    {
      "rating": "10",
      "text": "Very underrated movie. Nicholas Cage and Hayden Christianson’s performances are great. Another strong point of the movie is the great choreography and the good pacing."
    }
  ],
  "recommendations": [
    "abduction",
    "killers",
    "catwoman",
    "the_legend_of_hercules",
    "ghost_rider",
    "vanquish",
    "fantastic_four",
    "anaconda",
    "aquaman",
    "bedazzled",
    "the_green_hornet",
    "the_boy_next_door",
    "suicide_squad",
    "bullet_to_the_head",
    "the_expendables_3",
    "rogue_hostage",
    "the_day_the_earth_stood_still",
    "mighty_morphin_power_rangers_the_movie",
    "sherlock_gnomes",
    "miami_vice",
    "the_italian_job",
    "the_marine",
    "mortal_kombat_annihilation",
    "dolittle",
    "dark_phoenix"
  ]
}