{
  "id": 291,
  "title": "Outside the Wire",
  "starring": [
    "Anthony Mackie",
    "Damson Idris"
  ],
  "runtime": 116,
  "genre": [
    "Thriller",
    "Action",
    "Science Fiction"
  ],
  "description": "In the near future, a drone pilot is sent into a deadly militarized zone and must work with an android officer to locate a doomsday device.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6XYLiMxHAaCsoyrVo38LBWMw2p8.jpg",
  "categories": {
    "plot": 3.0,
    "acting": 3.75,
    "ending": 5.6,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.666666666666667,
    "action": 4.333333333333333
  },
  "reviews": [
    {
      "rating": "5",
      "text": "It has moments of sci-fi entertainment, but it thinks it is smarter than it actually is, which ends up hindering it. It is too deep to be background noise, but too cheesy to be taken seriously. In other words, it's a Netflix movie."
    },
    {
      "rating": "2",
      "text": "Would've been a better movie if those nukes launched but they ended up making the ending a cliche. Good for a one-time watch."
    },
    {
      "rating": "0",
      "text": "Sorry I just found it boring, not a very good sci-fi movie, a bit of an bias opinion I'll admit, so see for yourself."
    },
    {
      "rating": "3",
      "text": "This movie was good but I believe it could have been better if the robot man was more detailed on his plans instead of that rookie or military putting it together."
    },
    {
      "rating": "1",
      "text": "An intriguing combination of a bad movie with a thick layer of very, very bad science fiction on top. It makes no sense,It has no internal consistency and it answers none of the questions it asks of itself. I'm pretty confident no one in the production has any idea what the robots of today are capable of, let alone the robots of 15 years from now. And speaking of 15 years from now, 15 years from now? Really? This is destined to be one of the most forgettable movies you will, I hope, never see."
    },
    {
      "rating": "2",
      "text": "Why do sci-fi shows insist in this stupid notion of robots looking and acting like humans. What is the benefit if a robot with a personality teaching a drone pilot about the results of their actions. Its retarded. Nothing makes sense in this straight to streaming turd.Hey Netfix, you raised the prices and promised bigger and better programming. Where is it?"
    },
    {
      "rating": "3",
      "text": "A movie that seemed like it was going somewhere and ended up going nowhere. Gave a touch of nuance to the real enemies of war, power and greed. But I suppose to get views from dumb Americans it failed to even become a decent movie. What a hunk of crap. Waste of 2 hours."
    },
    {
      "rating": "8",
      "text": "Wow. He killed two people... Because he thought he knew better from his comfy seat back in the US. And he doesn't even take responsibility for it... This man is a psychopath.Nonetheless, Harp rapidly evolves from being a remorseless psychopath into being a giant hypocrite. Leo, being a very funny and likable character, drives home some good points about the US' flaws and its mistake in creating AI. When the US kills foreigners, it's called Collateral Damage. When US soldiers or citizens are killed, it's called evil and a massacre. And by the end of the movie you'd wish that this bittersweet truth would become reality. But no, they went for the cheesy happy ending. Such a shame. Nonetheless, i was thoroughly entertained and captivated by the action, the moral dilemma's and interesting topics. I give this movie an 8/10."
    },
    {
      "rating": "10",
      "text": "So much action and I loved every bit of it. The ending could of been better but overall i liked the movie and Anthony Mackey was a badass and he deserve more starting roles like this."
    },
    {
      "rating": "10",
      "text": "For the average Netflix user this film is a must watch. Anthony Mackie and Damson Idris have the best co-lead performances I’ve ever seen in my life."
    },
    {
      "rating": "0",
      "text": "I really wanted to like the movie, but it had so much **** about feelings and emotions and felt like one long-ass guilt trip all around feel bad movie."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "3",
      "text": "Reasonable action movie, good performances by all concerned. The premise is reasonable, but not original, just another Frankenstein; man vs his creation and the moral dilemma therein, although in this case the focus is switched to the future of humanity, rather than that of the monster. Unfortunately the plot sets this scenario up with so much potential to do something different from the traditional, binary choices of monster overcomes man or man overcomes monster, with all that these cliched outcomes imply, and then drops the ball in the final minutes, simply repeating so many dated works that have gone before; Monster = bad. Disappointing."
    },
    {
      "rating": "6",
      "text": "Average near future sci-fi thriller. I never really found the relationship between the two main leads very believable. If the US had some a formidable military android why aren't they using this to win the war? Also the messaging about collateral damage is confused."
    },
    {
      "rating": "4",
      "text": "The movie is a solid 3, but I'll reward it a bonus point for proving that even B movies in 2021 can have acceptable special effects. Other than this the script was a tripe, and not much more. Very disappointed!"
    },
    {
      "rating": "0",
      "text": "Trashy sci fi action schlock. Failed to make it past the opening 10 minutes."
    },
    {
      "rating": "4",
      "text": "The year begins and Netflix returns to its known ways.I mean, it's quite evident that within the first 15 days of the year they will not release any big production, but will use their first pawns to fill the catalog and keep their subscribers happy with a new release.Outside the Wire basically offers the weekend package.It has decent stuff in both its cast and production, but viewers will hardly be able to tell you what it was like after a few days. And while it's true that this film never tries to make you believe that it is more than what it shows, it's also a bit disheartening how disposable these productions become in a world saturated with options.If you don't demand much and just want to entertain yourself for a bit, you may find it more useful than me. Otherwise you're ok looking for better alternatives."
    },
    {
      "rating": "1",
      "text": "(Mauro Lanari)Thanks to Netflix, the risks of a future warfare treated with the seriousness of \"Terminator\" and the childish outcome of \"Chappie\"."
    },
    {
      "rating": "6",
      "text": "Got a little confusing about midway through but it made its point. Mackie is a star."
    },
    {
      "rating": "5",
      "text": "Film chce ukazać brutalność wojny oraz bezsensowność współczesnych działań wojennych jednak robi to nieudolnie. Bohaterowie średni i bez wyrazu. Do zapomnienia"
    },
    {
      "rating": "5",
      "text": "بكل اختصار قصة الفلم عن طيار درون حربي تسبب في مقتل أثنين من أفراد الجيش الأمريكي ونتيجة لذلك قرروا يرسلونه لمنطقة حرب من خلالها يعيش تجربة القتال الحقيقية وبشكل مباشر كدرس له. الفلم بشكل عام جيد وفكره أن البطلين يشكون ببعض من ناحية الأفكار والتصرفات طوال الفلم يخلي المشاهد نوعا ما منجذب حق الأحداث ولكن في نفس الوقت الفلم فيه الكثير من الملاحظات. طريقة التمثيل ما كانت جيده والأكشن الي بالفلم محدود وفوق هذا الشخصيات الجانبية ما كان لها تأثير قوي/دور مهم. أساس الفلم كفره والنصوص تحسها محدودة على الرغم أن بعض الأفكار مبتكرة إلا إن أغلب الأفكار الثانية متجمعة من أفلام أخرى! بالنهاية الفلم جيد يعيشك جوه الإثارة ولكن للأسف نهايته ما قدمت خلاصة مفيدة/عبره فعلية للمشاهد.Visit My Instagram @Vanished_Critic"
    },
    {
      "rating": "10",
      "text": "Film niente male, anche se una fantascienza. A me piace che finalmente lo fanno differenza tra Ucraina, dove abbiamo la guerra,  con quel schifo di russia di m*rda. Ed complimenti a Netflix che dopo tutti gli anni finalmente ha fatto subito interpretazione ucraina. In general film da guardare assolutamente."
    },
    {
      "rating": "0",
      "text": "Very awful and boring movie. Also, it uses wrong geographical information of Ukraine."
    },
    {
      "rating": "0",
      "text": "Guys, come on) The \"Perimeter\" system does not have launch codes. This is a fully automatic system with the launch of not one missile, but all missiles on duty. At the same time, not only mine-based) Well, let's be honest - no one will allow the ubiquitous US army to fly in the airspace of Ukraine) There, for a long time, radio electronic warfare is jamming the sky. Yes, and not only the US army has air defense systems) In general, read better books on history.  And ask the question - how many times have Russians been attacked on their territory? Did anyone manage to emerge victorious from the war? :) The answer is no! So, draw your own conclusions. The film is **** Greetings from Russia.p/s: from a red star on a rocket burned out for half an hour))) Straight tattoo on a dickhead)))"
    }
  ],
  "recommendations": [
    "source_code",
    "the_purge_election_year",
    "the_tomorrow_war",
    "district_9",
    "geostorm",
    "prometheus",
    "elysium",
    "star_trek_v_the_final_frontier",
    "battle_los_angeles",
    "the_forever_purge",
    "war_of_the_worlds",
    "surrogates",
    "repo_men",
    "london_has_fallen",
    "snowpiercer",
    "the_matrix_revolutions",
    "greenland",
    "the_core",
    "stowaway",
    "noah",
    "jurassic_world_fallen_kingdom",
    "lucy",
    "the_darkest_hour",
    "captive_state",
    "the_purge_anarchy"
  ]
}