{
  "id": 767,
  "title": "Over the Moon",
  "starring": [
    "Cathy Ang",
    "Phillipa Soo"
  ],
  "runtime": 100,
  "genre": [
    "Animation",
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "description": "In this animated musical, a girl builds a rocket ship and blasts off, hoping to meet a mythical moon goddess.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lG0TF0wj1n9p9CPy5xlIUIkF56a.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.823529411764706,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 6.75,
    "familyFriendly": 6.285714285714286,
    "funny": 8.5,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "was pretty cliché and predictable, I mean the moral of the movie was was the goal the main character had to get to it... But it had some originality that wasn't necessarily good or bad, just kinda weird.I really like the songs, besides the weird ping pong rap battle, the songs feel very Disney-esq. I also really enjoyed the way Lunaria looked, it reminded me a lot of Hanazuki. Bright vibrant colors on a stary backdrop.The animation was pretty good besides the fact that I hate these character designs. I don't know how to describe it, it's as if they are given too much detail or are too wrinkly? Uncanny valley? Fei Fei looks like she hasn't taken a shower in weeks, her hair is very gross looking.The voice acting was fine nothing that really stood out to me as bad. Some of the characters though, I really find annoying like Chin. I really wish he wouldn't have gone to the moon with her or they at least made him less annoying.It's definitely not going to be a movie that I personally keep coming back to or even at all, but maybe you'll enjoy it. As I said the songs are the best part."
    },
    {
      "rating": "3",
      "text": "predictable and cliche storyline. the cultural representation of chinese elements was badly done too. the animation was really nice to look at though"
    },
    {
      "rating": "7",
      "text": "At certain times, it feels like something is missing and it doesn't have a pretty strong plot, but its greatly animated with beautiful visuals and a good message."
    },
    {
      "rating": "5",
      "text": "This is probably the best Netflix original film I've seen thus far....Unfortunately, that's not saying much, given the poor quality of most I've seen. That being said--if Disney/Pixar's Onward didn't already exist, I would have given it 1-2 more rankings, as this is essentially an Asian folklore version of that. Too bad it isn't as good. Oh well, I didn't expect that much from this anyway."
    },
    {
      "rating": "10",
      "text": "Thoroughly enjoyed this movie. The right amount of humor and emotion. Colorful and creative while teaching how to cope with loss. I enjoyed learning more about the culture and myths of others. 10/10"
    },
    {
      "rating": "4",
      "text": "it’s so bright?? i’m not sure why certain elements are designed the way it is (everything in Lunaria) but i still understand that this is a good effort in introducing asian culture to americans and it’s mainly targeted at children, hence the medium score but gosh it did Not have to be that bright and colorful and inconsistent with the theme of the movie. the color reminds me of Trolls, but pastel and Bright"
    },
    {
      "rating": "10",
      "text": "The positive detail and accuracy and of the Chinese  culture in this movie is refreshing. And how the writer was writing this movie for her family before her death made it extra special"
    },
    {
      "rating": "9",
      "text": "La película me gusto bastante, la canciones espectaculares la historia siento que le falto algo pero aun así cumple."
    },
    {
      "rating": "8",
      "text": "A young girl who misses her mother sets off for a mystical, mythical land. The story and theme offer nothing original or special, but the animation is absolutely gorgeous in the “real” world and stunningly psychedelic in Lunaria (which was inspired by Pink Floyd’s The Dark Side of the Moon and the paintings of Joan Miró). In addition, there’s a group of supporting characters that add fun personalities, especially the adorable rabbit. Toss in a few Frozen-style musical numbers and a loving family thru line for that warm sweet effect. Even if the audience is obviously kids, parents will have plenty to enjoy with the snappy pacing and dazzling visuals."
    },
    {
      "rating": "5",
      "text": "A just okay, but worth watching little animated adventure. Don't think it'll be the next great animated feature, but it's a fun viewing expirience."
    },
    {
      "rating": "7",
      "text": "Interesting visual and eye-catching storyline. A mixture of emotion and comedic moments. It is worth taking a look."
    },
    {
      "rating": "9",
      "text": "Perhaps the professional critics need to go back and watch Pixar's Ratatouille again to gain some needed \"perspective\". I almost didn't watch this movie based on their cynical, heartless reviews. This is a beautiful movie and a breath of fresh air amidst the heap of animated product placement, commercialized nostalgia and agenda that is forced upon the general public as of late (Disney, ah hem). This movie has heart, story, imagination, and beauty. Both my two girls (4 and 2 years old) were captivated. I was captivated. My wife was captivated. Are you a fan of animated movies? Watch it."
    },
    {
      "rating": "5",
      "text": "Pretty good visuals, but no real soul and no surprises. I really thought it was going to be more interesting."
    },
    {
      "rating": "6",
      "text": "Seria una película mucho mejor si no abusara de las canciones (que si bien no son malas, se sienten forzadas) y una historia que peca de simplista y esta poco explotada."
    },
    {
      "rating": "6",
      "text": "The issue with this movie is that it feels so familiar to almost every other Disney movie out there which isn’t a bad thing if it was released during the 90’s during the Disney Renaissance. Since it was released in the present day, it’s hard for the film to distinguish itself from other animated films but there is one way that it does, the animation. If there is one thing that you should take away from this film, it’s that the animation is beautiful. It looks so crisp, clean, and vibrant that it’s hard for a viewer to take their eyes off of it. Unfortunately, I think this is all this film will be remembered for. The story isn’t unique. It’s a good story about learning to let go and accept change but we’ve seen those themes and story beats so many times that they don’t hit as hard if it’s not used properly. This is a musical and most of the songs were okay. There were 2 that I enjoyed though and they worked great for the film especially the last song. In fact, the last 25 minutes of this film are great. It’s emotional beats it and the story wraps up nicely but the other hour and 20 minutes are decent. The voice acting is fine. There isn’t a great performance and there isn’t a terrible one either. However, this film resorts to the use of a sidekick and my god is he annoying. I couldn’t stand him at all. Every scene he was in, he ground the film to a halt. The worst part is is that it’s voiced by an actor that I do enjoy and is funny, Ken Jeong. I just don’t know what he was doing here though. If you enjoy animated films, then go check this out but don’t expect something incredibly original."
    },
    {
      "rating": "8",
      "text": "Sarò sincero, mi ha sorpreso.Certo, la storia non sarà nulla di originale, ma le musiche, l'animazione, il ritmo: semplicemente impressionante. Onestamente il migliore tra i candidati all'Oscar per il miglior film animato che ho visto finora (con la sola assenza di Wolfwalkers).Consigliato? Assolutamente, soprattutto per i nostalgici Disney."
    },
    {
      "rating": "10",
      "text": "Over the Moon is filled with bright and beautiful colors as vibrant as the films sweet and heartfelt story."
    },
    {
      "rating": "9",
      "text": "Much better than disney animations, it is a gorgeous movie, it is aimed for the whole family and everybody is going to have a good time seeing it, adults and kids."
    },
    {
      "rating": "8",
      "text": "While the story is fairly simple and a lot of things are not explained well or at all, this movie is imaginative, colorful, heartwarming, and a ton of fun. The songs are good for the movie, but they don't stick with you after the movie is over. But, to me, that is to this movies benefit. This movie is a musical in the truest sense of the word. Every song shapes this movies identity and if you were to take any of these songs out of the movie to have them stand on their own (with the exception of one) they wouldn't do well. This is a good movie that you can sit with the family and enjoy. This movie is the reason you should be on the lookout for Pearl studios."
    },
    {
      "rating": "10",
      "text": "I watched this with my son last night and had not seen the trailer. We both absolutely loved it! Great movie with a good life message for children and adults alike."
    },
    {
      "rating": "7",
      "text": "Very strong musical theatre vibes. No knockout earworms but I really enjoyed each song as they were happening. I like the heart of this, the characters are fun and endearing and the colours are bright!"
    },
    {
      "rating": "8",
      "text": "If Flash Gordon and the citizens of Mongo travelled the Factory of Willy Wonka, with a grown-up Boo as a hero and the most heart-wrenching opening since UP, you’d have the bones for the visual lullaby that is Over the Moon.  Over the Moon packs a dozen characters fueled by energy drinks with surreal, madcap action at times, and a surprisingly upbeat soundtrack, flowing within a gentle story, quiet as the heartbeat of a sleeping child.  Over the Moon is written by Audrey Wells (George of the Jungle), Jennifer Yee McDevitt, and Alice Wu, and directed by Glen Keane (writer, Tarzan, Pocahontas) and John Kahrs (Joe’s Apartment).  It stars the voice talents of Cathy Ang (Age of Sail) as Fei Fei, Robert G. Chiu (Albert) as Chin, and a wonderfully zany performance by Ken Jeong (The Hangover, Crazy Rich Asians) as Gobi.  Phillipa Soo (Hamilton) plays Chang’e, with John Cho (Star Trek) as Father, and Margaret Cho and Sandra Oh playing members of Fei Fei’s family.  Fei Fei is a young girl, part of a quirky, loving Asian family, suddenly faced with a loss insurmountable, and unexplainable for a child.  As the world around her moves from grief to momentum, Fei Fei leans upon an old tale told to her by her mother, about a moon goddess waiting forever for her true love, their reunion the only hope for happiness.  As only a child can logic, Fei Fei knows only by traveling to the moon and delivering proof of the moon goddess to her family can she hope to keep them stuck in their loss, as she is, where they belong.  While there are an impressive amount of visually beautiful and even rapid sequences in this movie, it rarely feels chaotic, and flows like a fairy tale of old, with a simple message of love at its core.  While the idea of a child building and flying a rocket to the moon is absurd, the writers give Fei Fei a scientific mind that uses sound engineering, yet explained in the words of children, in the creation of her space craft.  The hero of this movie is actually a rocket scientist; and it’s a girl!  The music, bookending a booty-shaker by the moon goddess, is beautifully and thoughtfully written, including a silly yet measured performance by the delirious Ken Jeong. The cast is well thought through, with beautiful vocals by Cathy Ang who also manages to deliver wonder, angst, and determination as the young Fei Fei.  Her family is wonderfully realized by a number of well recognized actors including John Cho, Margaret Cho, and Sandra Oh.  Ken Jeong reels in his ridiculously zany persona to deliver a bizarre yet profound performance as Gobi, a lost space alien, who is often the soul of the film.  In addition, Robert Chiu as the young Chin reminds us that the idea of new family, new happiness, and new love, is something to celebrate and cherish.  I give Over the Moon 4/5 Stars and recommend it to literally everyone."
    },
    {
      "rating": "2",
      "text": "worst insult ever to be nominated for an oscar this yr. had to watch it coz of the nomination and it was a waste of time. could not fwd fast enough to get thro all those propaganda cliche lyrics. what irritated me most was the quality of rendering. animation has come so so far and this nominated piece really set back the standards for decades!!!initial part was ok but the standard really dropped when she got to the moon. really disappointing. we had some conspiracy theory but too sensitive to write.Help!!! what's going on? this years nomination aldy sucks at special effects, NOW animation also......"
    },
    {
      "rating": "3",
      "text": "The movie has impressive visuals yet the plot and songs are nonsensical.The movie's message is important but it is portrayed with a stupid challenge, rubbish songs  and a overall dumb predictable plot.overall I do NOT recommend this movie. 3/10."
    },
    {
      "rating": "5",
      "text": "Maybe I'm wrong but Over The Moon is boring but it does have a great effect and a nice animation, although the script leaves a lot to be done"
    },
    {
      "rating": "7",
      "text": "A beautiful movie with a great message, but you can't join together the seriousness with the fantasy of this movie."
    },
    {
      "rating": "6",
      "text": "The animation is amazing but the story and characters aren't that engaging."
    },
    {
      "rating": "3",
      "text": "Horrible movie, my son cannot watch until end. I cannot believe master Glean Keen make this movie... Sorry for this review, I hate writing negative critics."
    }
  ]
}