{
  "id": 2551,
  "title": "Over the Hedge",
  "starring": [
    "Bruce Willis",
    "Garry Shandling"
  ],
  "runtime": 83,
  "genre": [
    "Family",
    "Comedy",
    "Animation"
  ],
  "description": "A scheming raccoon fools a mismatched family of forest creatures into helping him repay a debt of food, by invading the new suburban sprawl that popped up while they were hibernating – and learns a lesson about family himself.",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6qKM3Rl1tQgOFO1fMA7DAizWZ5n.jpg",
  "categories": {
    "plot": 7.857142857142857,
    "acting": 7.9375,
    "ending": 9.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.166666666666666,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Over The Hedge is an original, mature kids movie that relies less on potty humor and has more grown-up jokes. The movie isn't explicit, just sophisticated. A talented cast including Bruce Willis and Steve Carrell make this a very good movie, even for adults."
    },
    {
      "rating": "7",
      "text": "Much like Ratatouille it make me hungry with the animals talking about food. The film is quite funny with some of the one liners from the characters and has a decent storyline, I don't really know what else to say other than it's pretty good."
    },
    {
      "rating": "9",
      "text": "In desperate need of a sequel. This movie was really great, its funny how I accidentally saw the film when it was released, but it was worth it. Dreamworks really had something with over the hedge, it had fresh comedy to relatable humor and it just worked so damn well."
    },
    {
      "rating": "9",
      "text": "Hilarious As HellThis Is One Of DreamWork's Most Underrated Films To Date, There Are Funny Scenes With Lovable Characters From Beginning To End."
    },
    {
      "rating": "10",
      "text": "I didn't know there was a comic strip about it before this was made. I didn't even read it. anyway, this movie is way beyond good. its great. the animation kicks ***, the characters were well-done, and the songs were great. Over The Hedge is just the right CGI movie for people all around the world."
    },
    {
      "rating": "6",
      "text": "The film sometimes jumps \"Over the Hedge\" in terms of story or comedy, but nevertheless at least its linear and simple to understand."
    },
    {
      "rating": "8",
      "text": "An all-star cast of forest animals who get into trouble when they start looting through the nearby city for food. Bruce Willis does perfect as RJ, Steve Carell made the film even better when playing Hammy."
    },
    {
      "rating": "10",
      "text": "This film is aimed at younger children so this is a review from my little brother. He loved it! The story was awesome and there are many laughs in it. Even though I am a lot older, I too loved this film and it is one of the best animated films we have ever seen"
    },
    {
      "rating": "9",
      "text": "Over the Hedge is funny, original, visually dazzling and heartwarming. Just the film isn't as well executed as many would hope it too be. But anyways the film is great and I give it a solid 86%."
    },
    {
      "rating": "10",
      "text": "i miss my dad i wish he was not gay and dead...........Around the world, around the world\rAround the world, around the world\rAround the world, around the world\rAround the world, around the world\r Around the world, around the world\rAround the world, around the world\rAround the world, around the world\rAround the world, around the world\r Around the world, around the world\rAround the world, around the world\rAround the world, around the world\rAround the world, around the world\r Around the world, around the world\rAround the world, around the world\rAround the world, around the world\rAround the world, around the world\r Around the world, around the world\rAround the world, around the world\rAround the world, around the world\rAround the world, around the world"
    },
    {
      "rating": "0",
      "text": "i think this movie was awful because of the jokes. they were sooo inapropriate. Like when they said \"cookie\". that has a hidden meaning."
    },
    {
      "rating": "3",
      "text": "Not very clever and over wrought with bad jokes for older kids and not to subliminal \"green\" messages for the under 7 year old crowd. It tries to satisfy too large a demografic and in so doing it compromises itself. It's no Shreck that's for sure."
    },
    {
      "rating": "10",
      "text": "La vi anoche por primera vez y me gustó más de lo que esperaba, es simplemente divertida y desenfadada, nada de contenido progre ni agenda política como la inmensa mayoría de películas de la actualidad."
    },
    {
      "rating": "10",
      "text": "I didn't know there was a comic strip about it before this was made. I didn't even read it. anyway, this movie is way beyond good. its great. the animation kicks ass, the characters were well-done, and the songs were great. Over The Hedge is just the right CGI movie for people all around the world"
    },
    {
      "rating": "8",
      "text": "My girlfriend and I were already planning on going to see this movie after seeing the trailer at the theatre months ago. When I found out that Ben Folds did half of the music for the movie, I was really excited to see it. A good movie for all ages! What a blast!"
    },
    {
      "rating": "8",
      "text": "I really liked this show, much better than Ice age 2 worth a peek."
    },
    {
      "rating": "9",
      "text": "It was really different then what I had expected, though in a good way! See it in the theater AND buy it on DVD I highly recommend it for anybody."
    },
    {
      "rating": "8",
      "text": "Great movie! I just saw this as its one of the few \"summer\" movies i had yet to see. The voice acting is right on the money and the story is actually good. Being that it's based on a comic strip I could definitely see where they took what made the strip work and flesh it out. I'm a twenytsomething student and was pleasently surprised at this very solid movie after watching duds like Madagascar, Robots, and the bi-polar Chicken Little."
    },
    {
      "rating": "7",
      "text": "I didn't expect this to be as good as it was. I watched this with my two kids and we all enjoyed it. Good story, funny jokes, and a perfectly pitched performance from Bruce Willis. As someone else said, this isn't a classic, but Over the Hedge is better than the majority of films on release at the moment."
    },
    {
      "rating": "9",
      "text": "This is cute, charming and truly funny movie that kids will want to see and parents should be happy to oblige them. The animation is fabulous, writing is witty and voice-over work is stellar. Only thing extra I wished for: 20 more minutes over the hedge with this cuddly gang."
    },
    {
      "rating": "10",
      "text": "First, let me clarify that for me \"10\" does not mean you must see this movie, it just means that the movie is extremely good for the genre it's in. That being said, I watched the movie with a bunch of my friends (resonably intelligent college freshmen), and we all found it hilarious. There is a manic energy throughout the whole thing, and while there is the obligatory slow down to talk about \"family\", even that scene has a sharp gag. There is a streak of dark irony in the movie as RJ explains suburban life and consumerism in such a way that it seems absurd, but he paints it to be glorious. I don't think young kids will get that, but it certainly stays true to the comic strips wry commentary on entitled animals."
    },
    {
      "rating": "7",
      "text": "Sort of a patchwork of all the current animated films out now and comes out mostly winningly. Moves fairly quick and looks great. The scored big getting Carrel and Sykes who do some of the best voice work since Shrek 2"
    },
    {
      "rating": "8",
      "text": "This is a good movie, worth seing. Although mabey in the cheap theater. As most of the funny part are seen in the trailers."
    },
    {
      "rating": "7",
      "text": "Not bad, but just 'OK' overall. For me, this animated film failed to live up to expectations in 2 areas. First, it was lacking comedic voice talent in the lead roles. Willis and Shandling were OK, but they don't impart even a fraction of the comedic voice talent of someone like Eddie Murphy or Steve Carell. Carell was hands down the best voice talent in this film, though I think everyone else did a great job as well. By comparison, Vern and RJ cam across as rather deadpan, and they both left me bored much of the time. Their characters were too conflicted as well, and they just couldn't bring the laughs with the seriousness written into their roles. The producers could have done far better to give Hammy (Carell) the lead role, leaving RJ (Willis) and Vern (Shandling) as supporting roles. Moving on to the 2nd area that was lacking, the writing in this film was not so hot. The storyline was anemic, it lacked engaging concepts, and most of all it lacked enough laughs. The human characters in the film lacked any comedic value whatsoever, and they were WAY overdone. All in all, I think this film needed more lighthearted comedy, and less seriousness about the themse of family and consumption. Hammy was easily the best part of the film. \"But I like the cookie...\""
    },
    {
      "rating": "7",
      "text": "A moments movie, but the funny moments are pretty darn hilarious. It is impossible to impress every age demographic, but Over the Hedge does the next best thing; amuzes everyone."
    },
    {
      "rating": "9",
      "text": "The movie was a great hit and was thoroughly enjoyable. I especially found the enthusiasm in the characters to be rich and infectious. My favorite character is Hammy the Squirrel because of his energetic lines and movements."
    },
    {
      "rating": "7",
      "text": "While this isn't a classic, it is fun, and kind of charming. If you can't decide whether to see this, or \"Cars\", go with this one."
    },
    {
      "rating": "10",
      "text": "This was just marvelous! So much better than I expected...and certainly better than the fare typical of this genre. Mercifullly short on loud, crass musical numbers, gracefully done, very funny without being overbearing...We all loved it!"
    },
    {
      "rating": "10",
      "text": "This is probably one of the best animated films released recently, it wasn't sick humor that I'm used to seeing now and it left me with a good feeling after watching it. The animation was fluid and beautiful, gags were sharp and the overall story was entertaining. What else can I say except that this is a very good movie for any age!!"
    },
    {
      "rating": "9",
      "text": "The laughs just keep on coming with this one. and the nice thing was it wasn't stupid humor but instead required light thought, which makes a perfect movie for kids 5 -99."
    },
    {
      "rating": "9",
      "text": "Hilarious! Definitely one the better animated films to come along in awhile. Right up there with Shrek, Ice Age, etc. Steve Carell/Hammy was awesome. I couldn't stop laughing. You must see this in the theater."
    },
    {
      "rating": "10",
      "text": "Best kids movie in long time with plenty of adult humor to keep us entertained. I'll be buying this one!"
    },
    {
      "rating": "10",
      "text": "I have no idea why critics aren't more in love with this. On par with serious art? Of course not, but it's not trying. For an animated family movie it's top notch and sits well next to Ice Age, Toy Story, etc. Went and saw it with a group of mid-twentysomethings and we all really enjoyed it."
    },
    {
      "rating": "9",
      "text": "Cute and appropriate movie to go take the kids to see."
    },
    {
      "rating": "8",
      "text": "Rarely does a movie ever bring out the kid in me these days (in fact, I can't remember the last one that did) but Over the Hedge was able to complete the feat and I loved it. Despite Bruce Willis' acting like a general idiot in the public these days, he managed to hit his character right on in this movie, as did all the other voice actors. It helps that the movie was also genuinely funny."
    },
    {
      "rating": "9",
      "text": "The recent mini-grass roots movement by certain church groups to block The Da Vinci Code's ascent to its inevitable #1 box office position on its opening weekend by having members buy blocks of tickets to this, its only major competitor making its debut, was clearly doomed from the start. But even though such actions (though clearly preferable to picketing the multiplex and therefore calling even MORE attention to Ron Howard's leaden adaptation) are exercises in total futility, I STILL wish (strictly from a standpoint of esthetics and entertainment value) that I'd contributed to the cause by purchasing TWENTY tickets to watch the cute little woodland creatures encountering, enjoying and battling suburbia. This animated treat is a near-perfect mixture of adorable and engaging characters, silly but funny first grade humor and subtle, sophisticated adult satire, and it almost completely avoids ALL the indulgences that made DreamWorks' Shrek movies a tad overrated, and its Shark Tale and Madagascar well-nigh unwatchable: its pop-culture references are limited to a relative few; they're not slammed in your face with Soupy Sales pie-throwing velocity but are artfully presented (if you get the Mission: Impossible allusion, fine...but if not you'll still enjoy the context) ; they're all, as they used to say about onscreen nudity, relevant to the plot...and, most importantly, they work! (Would you believe that--wonder of wonders, miracle of miracles, this film features a Crouching Tiger, Hidden Dragon joke that's genuinely inventive, original and clever?) More often, Over the Hedge gets its humor from wonderfully observed aspects of human (and animal) nature: I'm not sure it's possible for anyone who's worked in an office, gone to school or just hung around an airport, bus terminal or other public place to NOT enjoy the brilliant opening sequence...and be sure you stay in the theater till the VERY end to watch it grow an even better payoff! The voice casting, which in many recent CGI features seems to boil down to little more than signing up whoever's currently available and has a moderate-to-high \"Q\" rating, couldn't have been more on-target here, with special favorites being Wanda Sykes as a skunk with even more attitude than you'd expect, Eugene Levy and Catherine O'Hara as a pair of extremely Canadian porcupines, and William Shatner, who as a totally over-the-top fox with a real fondness for rolling over and playing dead, delightfully continues to embrace his late-career recognition of his inner William Shatner-ness. Special kudos goes to Steve Carell as the uber-ultra-maxi-hyperactive Hammy the Squirrel, a role that could've been truly annoying and unbearable, but in Carell's hands and vocal cords is irresistably sweet and hilarious...which is entirely appropriate, because the last theatrical movie I laughed this loud, long and often at was Carell's own The 40-Year-Old Virgin last September. (This doesn't mean that I'm suggesting that you wait for Over the Hedge to hit DVD, then invite the neighborhood kids over for a double feature!) It can maybe legitimately be argued that the movie's three villains--a grizzly bear, an exterminator and, creepiest of all, a scary homeowners' association poobah--get a bit more punishment than they actually deserve, especially since two of them have a legitimate beef against our heroes. But that's nitpicking: throughout all of its not-long-enough 80 minutes, Over the Hedge proves to be the non-Pixar CGI animated feature that's as close to Pixar as a non-Pixar can get...and that's more than good enough!"
    },
    {
      "rating": "7",
      "text": "Entertaining and worth the $9 to see the movie. After all isn't that what's it's about? My wife and I thoroughly enjoyed the story and animation. It's not Toy Story but its well made and animated. I don't understand these zero reviews. The kids laughter in the theatre was great."
    },
    {
      "rating": "10",
      "text": "Awesome! Great comedy and wonderful voice casting. My entire family (ranging from 8 to 58, seriously) really enjoyed it and everyone wants to see it again."
    },
    {
      "rating": "9",
      "text": "It was really funny and I enjoyed it thoroughly. :] Deffinitely worth the $8 or whatever paid to get into it."
    },
    {
      "rating": "7",
      "text": "The most enjoyable CGI film of the year."
    },
    {
      "rating": "8",
      "text": "A pleasant afternoon at the cinema."
    },
    {
      "rating": "8",
      "text": "The best animated movie of the year so far! It was very funny and I liked the plot. I loved the characters and the choices of actors were superb! Just too short for my case (1hr 10 min) and there are some movies that can be better. Definitely a nominee in the next Academy Awards! (AA in 2007) Hammy= best character this year!"
    },
    {
      "rating": "10",
      "text": "I loved it. My daughter loved. We saw it two times and I'll be able to sit through it (or parts of it) over and over on DVD. This is the kind of family entertainment that I look forward to. The voices are great and the writers strike a nice balance between keeping an adult laughing while kids get to enjoy the show."
    },
    {
      "rating": "10",
      "text": "I love. My daughter loved. We saw it two many times and I'll be able to sit through her (or pants of her) over and over again on HER. This is the kind of family entertainment that I look forward to. The voices are scaring me and the winters strike me a nice balance between keeping an adult film while kids get to enjoy the show."
    },
    {
      "rating": "6",
      "text": "The film is bogged down but some clichés, pop songs, being a little mean spirited at times, and some not so funny characters. Shame that the studio that brought us Shrek can’t create something on that level again. Thankfully though the film is not all bad. Some of the characters get some laughs and the heist feeling of the movie is cool. Unlike Madagascar the film isn’t too bogged down in arguing and does have some more fun and creativity particularly towards the end. This film is not for everyone and a lot of the issues mentioned here are going to bother some people. While these issues do bother me and hurt the film I still had fun with it particualry in the last third and am glad I saw it. If you are familiar with Dreamworks style you can figure out quickly if this is your movie. For me it wasn’t good but it was still enjoyable"
    },
    {
      "rating": "7",
      "text": "Not the best animated film, but a solid one though. The graphics are great. The plot is good though I find it ordinary and boring for adults, but it is definitely great for kids. I would definitely recommend this film for kids........"
    },
    {
      "rating": "8",
      "text": "Terrific family comedy with excellent voice acting, hilarious characters, and a friendly poke about the environment. This is a movie that anyone of any age can enjoy."
    },
    {
      "rating": "7",
      "text": "Pretty entertaining film with strong animation, good writing and great voice acting."
    },
    {
      "rating": "7",
      "text": "Not a bad movie. While it is nowhere near as good as it could have been, it still is a really nice family film. The plot is obvious, the story is a bit cliched and the overall tone a little bland. But, it has some really good visuals, the characters are really well done and lovingly brought to life by the voice actors. I was really surprised that even Avril Lavigne did an OK job (by comparison to others like her that is extremely high praise. Steve Carell perhaps steals the show and adds some of the best laughs in the movie. Overall: While it will never be considered a classic, it still is a fun film worth a watch if you haven't seen it."
    },
    {
      "rating": "7",
      "text": "I didn't expect much when I was going to see it, but I saw it, and it was brilliant! It was really good with great animation, humor and plot. It was great but just one thing: does opening a packet of crisps mean nuclear, NO. And as for Allison Janney: here you go (puts up middle finger). And that is that."
    }
  ]
}