{"id": 833, "title": "Overcomer", "starring": ["Alex Kendrick", "Priscilla C. Shirer"], "runtime": 119, "genre": ["Drama"], "description": "After reluctantly agreeing to coach cross-country, high school basketball Coach John Harrison helps the least likely runner attempt the impossible in the biggest race of the year.", "releaseYear": "2019", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/rVR3uN1yPRqYBBtNFSrEKCpRhaK.jpg", "categories": {"plot": 8.636363636363637, "acting": 9.0, "ending": 4.333333333333333, "soundtrack": 5.0, "cinematography": 0.0, "familyFriendly": 5.142857142857143, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "3", "text": "There was nothing else out at my theater that I hadn't already seen.Let's talk about faith-based movies (Any kind of faith -- doesn't matter which). Do they have a right to exist? Absolutely. And as an avowed aesthetic relativist, I believe they're allowed to exist in whatever manner they'd like to. However, by that same token, that doesn't mean I have to like any of them. For me, the best movies that have anything to do with faith, end up either discussing it at a rather oblique angle or without a ton of specificity/esotericism (ala \"The Book Of Eli\" and \"The Green Mile,\" respectively). This is not that kind of movie.I'll say this -- there's at least a lot of passion behind \"Overcomer.\" However, none of it is intended for me or anyone like me. And it's honestly not as if I'm in any sort of cinematic minority here. It's a film crafted for a select, presumably small cluster of people; a class that I'm just not a part of. And that's fine. As long as it's fine that I say, in turn, that I feel this simply doesn't work. It's unfocused, overly earnest, sparsely well-acted, and almost chillingly out of touch. Again, if you enjoy on-the-nose entertainment like this, that's fine. I just don't. Simple as that."}, {"rating": "10", "text": "My wife and I attended this movie.  We've made it a point to catch all the Kendrick Brothers movies, and any Christian films we catch on our radar.  Overall, I found the characters in this film to be believable, struggling people who want to do well, and think they are, even when they are not doing the right thing.  That would be described accurately as realistic. The situations portrayed are well thought out, timely (I'm from Buffalo, and grew up when the steel plans all shut-down, and feel the character's pain), and accurately portray how God works through people and events to \"get our attention\" and help us deal with an imperfect world.  The forgiveness portrayed in the movie is one that would be foreign, no, impossible to believe to anyone who does not know the Forgiveness we receive when we accept Christ's atoning sacrifice for our sin, accept his gift of Salvation, and understand that we are to forgive others as we have been forgiven (Matthew 7:1-5).  The best advice I have is to go and watch the movie.  If you have friends that are truly seeking forgiveness, take them with you (if money is an issue, offer to pay their way, remembering that Tuesdays are bargain days at participating Regal Cinemas if you're a Crown member).  This movie accurately portrays the forgiveness that Christ offers, and the response that we need to have as a result of that.  The Bonus is that this is good, clean, and yes, fun entertainment for any age."}, {"rating": "10", "text": "As usual, secular critics’ heads explode whenever Christians are portrayed as anything other than narrow-minded bigots. The very things that make them angry or uncomfortable are the things that show these characters as authentic Christians - flawed, prayerful, forgiven and forgiving.  I know these characters. I grew up with these characters. And that’s why they’re believable."}, {"rating": "0", "text": "Poorly lit and abysmal, this propaganda film is just as bad as the ones that came before it, and the ones that will come after."}, {"rating": "10", "text": "Well done, inspiring movie. I shed a few tears because of poignant moments and very moving dialog. If you like cross country running, you will love this movie. If you don't like running, you will still love this movie. It's also about relationships, dealing with personal letdowns, knowing your identity, and forgiveness. The critics always downgrade Christian themed movies, so don't be discouraged. The two others who came to the movie with me also enjoyed it very much. Thank you Kendrick Brothers for a movie that is suitable and meaningful for the whole family!"}, {"rating": "10", "text": "This movie was incredible.  My 8 year old and 10 year old loves it too.  These guy produce such incredible films and the story is fantastic.   Well done Kendrick brothers!"}, {"rating": "10", "text": "Heartfelt! Best movie of 2019!  Actress who plays Hanna is perfect voice of a 15 year-old hurting soul.  Top ⭐️ stars!!"}, {"rating": "8", "text": "Loved the message of this movie. Very inspiring! I think it's one of the best by the Kendrick's."}, {"rating": "8", "text": "Really good! Love the story and message! While I can say that many will think this as \"propaganda\" it's really just a story trying to share a good message."}, {"rating": "0", "text": "Just awful! Every bad Christisn movie cliche imaginable. White savior complex. Stunningly poor acting. Amateurish writing (if I want to be preached at, I'll find a church). Even bad lighting and cinematography. This is one of those films the producers put literally no time or effort into, because they know Evangelicals will flock to it, praise it, and hand their money over for, in spite of the poor quality. Really, this was just embarrassing."}, {"rating": "0", "text": "Please stahp! Propaganda film is abysmal on all levels. Don't waste your precious time on this mumbo-jumbo."}, {"rating": "10", "text": "Fantastic film by the Kendrick Brothers their best yet. I have seen it twice and audiences were cheering, laughing,and crying as this story touches on very important topics. This movie makes you think and is suitable for the entire family, run don't walk to see this film. Don't follow the \"Critics\" reviews as this family friendly film will of course receive bad reviews from them, read what the audience says."}, {"rating": "0", "text": "Yet another film-making disaster from Alex Kendrick that yet again does not focus on the human ability to overcome situations, but rather serves as a total propaganda piece for christianity. This movie is of course perfection according to those in the cult it appeals to, but is a travesty to cinema to anyone with a brain."}, {"rating": "10", "text": "I just love the bought and paid for professional critics.  They hated this movie. On the other hand the audience of real people I saw it with LOVED IT.  And before you accuse me of being a Jesus zealot I happen to be Hebrew.  The movie was great and inspirational.  I'm not ashamed to admit that certain scenes moved me to tears.  Great family entertainment.  Go see it."}, {"rating": "10", "text": "What an absolutely beautiful film! Great acting and excellent story line. It is sad to see so much hate toward the Creator these last days. If this film was based on a lie, it would have received great reviews, but being based on Truth, it is automatically despised, even by people that clearly did not watch it. Every breath we take and every beat of our heart is a gift from the LORD Jesus and this movie clearly demonstrates His great and unfailing love toward us! There is not human ability to overcome death, Jesus the Christ alone has provided the only way!"}, {"rating": "5", "text": "With the exception of maybe Courageous, the films from the Kendrick brothers have been just as amateurish and pandering as the rest of the faith-based offerings. Receiving the same kind of repeated criticism for middling production values, stale dramatic beats, and the messages themselves. However, I've always felt that the duo have really pushed themselves with each successive release to try new things and make higher quality entertainment, which something the kind of thing these movies really need right now. I can't say the same about Overcomer though, as it feels like their first really phoned in effort to date.While it's obvious no one onscreen is really trying with their performances, the real problem with the movie is the script. There are some effectively emotional moments, but no real depth. That's because the Kendrick's never went the extra mile to flesh out any of the characters. Not even the titular \"overcomer\" herself played by Aryn Wright-Thompson, who is oddly sidelined for the first half of the movie and never actually explored even when her problems do finally take center stage despite this supposedly being her story. Instead they just pulled a bunch of the oldest tricks from the book on how to get the audience all sappy without having to put forth any real effort. It works, but is totally cheap and kind of insulting when you consider how intentionally lazy it feels.If I had to bet, I would say the Kendrick's decided to not give 100% to this one because they realized the hardcore evangelicals that have been keeping this genre afloat for years now without even a hint of constructive criticism were going to support it no matter what. Which highlights one of the biggest problems with Christian filmmaking. Why are the people behind these movies ever going to try and fix the flaws that now serve as an expected part of these experiences when they're going to be met with blind devotion no matter what? Call me crazy, but I think God deserves better from our onscreen attempts at worship so it's high time we the audience demanded improvement.Even Overcomer's religious element itself is a step from their earlier works. Where films like Courageous and War Room offered real world applications of faith to help with things in everyday life like marriage and parenting, this is a straight up Sunday school lesson on salvation. Don't really see how that's going to help those watching this as they are either already converted, or are going to be too angry with the mediocrity the Kendrick's served up here to pay attention to it.There is one thing they got right though, and that's the running. Cross country is the kind of sport that's hard to carry a movie on, and you can see that here. However, when the final race arrives it's just as big and powerful as any football or basketball match you'd see at the end of some other sports flick. As a runner myself, I can tell you that they did a wonderful job at capturing the mentality and strategy needed to compete for long distances like that. Something that alone made this a movie I genuinely enjoyed, despite what a disingenuous cash grab it is overall.5.5/10"}, {"rating": "10", "text": "This movie is inspirational, humorous, and wonderful.  I love it.  I have watched it twice and liked it even more the second time.  Unfortunately this movie has to \"overcome\" negative reviews from media critics."}, {"rating": "5", "text": "Excellent movie. Everyone should stop and asked themselves, Who are you? Story of forgiveness. Very uplifting,"}, {"rating": "5", "text": "One of the best Christian films I have seen lately. Thanks for also taking on a all to familiar family dynamic of grandparents raising children and handling it so well"}, {"rating": "10", "text": "The ratings that are below 8 are paid off miserable people.  Ignore them. This movie is absolutely fantastic and everyone needs to watch it. I'm still crying hours later. It touches you deep and unforgettable movie."}, {"rating": "10", "text": "Great story on a small budget.  The acting is solid for the production.  I recommend for any audience."}, {"rating": "10", "text": "Very uplifting.  Unsure how anyone could be against the positivity of the message."}, {"rating": "7", "text": "I love this movie. The movie is very inspiring and encouraging.I understand faith is very important. The girl learn cross-country. She made it! This sport is great! I hope many people watch this movie. Especially, if you love cross country running, please watch!"}, {"rating": "7", "text": "The movie is fun. I like the movie. The characters are realistic, they show their true values. The story is the only downside, but it isn’t a big downside at all. I think some parts were easy to guess, but overall it is a good movie."}, {"rating": "10", "text": "The best movie I've ever seen in my lifeNever cry when watching movie but this one I didvery inspiring, wonderful, & powerful"}, {"rating": "10", "text": "Very touching film, I recommend it to all of you. In this film we can get inspiration and faith in Jesus Christ"}, {"rating": "3", "text": "No. Just no. Overacted. Overall way too much praying.  Over cheesy. Over corny."}, {"rating": "10", "text": "authentic and honest story, demonstrating credible forgiveness and diversity, which makes this film a hopeful contribution to society and culture"}, {"rating": "10", "text": "Overcomer really explores the subject of being more than winner in all aspects of life by the Word of God and Faith in Him. It's one of that movies which lead us to wonder about our lives and fill us with hope and trust in God. It's about faith? Yes. Kendrick will always make movies serving as a messenger of God, despite of the \"critic\" (almost everytime coward toward christian movies) and to fullfill his mission. People are everytime blessed by the message of Christ delivered in his movies. Overcomer sure is one of the bests of all times! Rate 10!"}, {"rating": "10", "text": "Well, well!  I cannot believe the negative comments generated in this forum that I have read about this movie.  Unbelievable!  Some folks need to calm down a tad from their negativity about a Christian movie in general and this one specifically.  It was t cheesy. It wasn’t predictable.  It wasn’t the Kendrick brothers’ less than excellent work.  It was what it was to be. Compelling from start to finish.  I could go on and on about it’s excellence. However, those that know it need not be told. Those will"}], "recommendations": ["war_room", "courageous", "i_still_believe", "heaven_is_for_real", "facing_the_giants", "son_of_god", "woodlawn", "risen", "i_can_only_imagine", "the_shack", "pay_it_forward", "chappie", "the_case_for_christ", "babel", "slumdog_millionaire", "3_idiots", "let_there_be_light", "the_lobster", "collateral_beauty", "machine_gun_preacher", "crash", "v_for_vendetta", "the_butterfly_effect", "the_giver", "her"]}