{
  "id": 1581,
  "title": "P2",
  "starring": [
    "Rachel Nichols",
    "Wes Bentley"
  ],
  "runtime": 98,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A businesswoman finds herself locked with a unhinged security guard in a parking garage after getting stuck working late on Christmas Eve.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3mTtQSKoFNyvhbcqBUJl8tPRqMz.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 5.363636363636363,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "P2 actually wasn't as bad as people are giving it credit. It was very suspenseful and caused me to jump a few times. Although some parts were predictable, not all of it was. It could have been better with a more realistic dog attack and a better ending."
    },
    {
      "rating": "4",
      "text": "I'm so over torture porn. I assume when filmmakers can't create suspense, they resort to stomach-churning violence. Now that's creative! That'll scare the bejeepers out of 'em in Peoria. The really annoying thing about P2, besides Bentley's laughably bad performance, is the waste of an excellent premise. Is there anything more frightening than a deserted parking garage late at night? An intelligent, sophisticated game of cat-and-mouse (think \"Wait Until Dark\") would have been mezmerising. Instead, we have \"I know what you did last Christmas Eve at the hostel on Wolf Creek\". Unless you're the type that enjoys pulling the wings off of flies, skip it."
    },
    {
      "rating": "2",
      "text": "Way to ruin Christmas, P2."
    },
    {
      "rating": "5",
      "text": "\"P2\" is a superior genre picture, a sort of \"Red Eye\" in a parking garage(in one scene, Thomas(Wes Bentley) gets red eye, literally), that's informed by Quentin Tarantino's \"Kill Bill Vol. 1\" when Angela(Rachel Nichols) goes all Uma on Thomas' psycho ass. Because of the times, \"P2\" resorts to the requisite gore to satisfy the core audience, which prevents this sometimes effective thriller from crossing over to a non-teen, non-bloodlust lovin' demographic. At its best, \"P2\" is a poor, poor, poor man's \"Silence of the Lambs\". It also makes a salient point about hierarchies in the workplace. Angela is willing to put up with sexual harassment from her boss, but not from a mere parking attendant. The leads, especially Wes \"Anything Tobe Maguire Can Do, I Can Do Better\" Bentley, do an exceptional job with their respective thankless roles, which should lead to better acting gigs in the future."
    },
    {
      "rating": "5",
      "text": "Not much new in this film, you have seen it all before in one shape or form. The acting is okay and it does have some suspenseful moments but overall it's bland. Wes Bentley tries and does well as the psychopath."
    },
    {
      "rating": "2",
      "text": "The acting was quite bad, and although the victim was slightly above the thick headed idiots in most thrillers, thats still not saying much. Overall the movie was another generic thriller with the bad acting and flimsy plot you have come to expect from American Cinema these days."
    },
    {
      "rating": "1",
      "text": "Absolute bottom-feeding dreck that recycles everything you've seen before, over and over again, to the point of sheer boredom. However, it must be said that Rachel Nichols has an astounding set of titties."
    },
    {
      "rating": "9",
      "text": "Very effective with great direction and suspense. Everything was very well thought out. Despite being a stalker movie there were some really novel twists and a deeper psychology to this film. I would watch it again."
    },
    {
      "rating": "1",
      "text": "I have seen this stuff too many times already and much better. This thriller is just a total fiasco."
    },
    {
      "rating": "8",
      "text": "If you can't enjoy a great thriller like this, I feel sorry for you. Both this movie, and Hostel 2 have been compared to Saw movies and called inferior to them by so called professional critics! Critics suck so bad! A bit of gore and people crap themselves."
    },
    {
      "rating": "10",
      "text": "I love this movie- it's like my dream come true. All those times i've yelled at the screens of suspense movies because of victim stupidity.... repaid."
    },
    {
      "rating": "8",
      "text": "This movie was quite good. It's a real challenge to find a good horror movie anymore. There is either too much gore and/or too bad acting and/or not enough thrills and chills. This movie made me jump a few times, but the reason I didn't give it a full ten points is because of the ending. Happy endings are starting to get annoying, and plus like you wouldn't see a girl in a sleeveless blouse and not stop to ask her if something was wrong. But other than that, great movie. Good acting, good gore level (enough to keep you covering your eyes every now and then, but not enough to go to the bathroom to hurl), and good plot. I don't know about you, but I've never seen a movie where a woman is being stalked in a parking garage!"
    },
    {
      "rating": "2",
      "text": "Not terrible in the vein of The Hills Have Eyes 2, but utterly formulaic and totally unfrightening."
    },
    {
      "rating": "6",
      "text": "Salvageable thriller flick but predictable. The acting was passable, and the actions of Rachel Nichols was at least sensible mostly.  Bentley's performance was over-the-top and far too exaggerated to be frightening. With a limited cast, it was above-average.  The ending was a bit unsatisfying though."
    },
    {
      "rating": "4",
      "text": "Movies derived from naturally creepy places and situations should be the scariest movies of all-time. Unfortunately, most of the time they are way too predictable to even be entertaining and that was the case with P2. A woman gets trapped in her office parking garage, on a holiday weekend, and is being stalked. Sounds interesting, but it wasn't. This film has got to be one of the slowest moving \"thrillers\" I've ever seen. The acting was actually pretty good in this film, but everything that happens, you know it's coming sooner or later and there are no surprises what so ever. Like I said the acting was pretty good, so it's not a total piece of  but it's slow, predictable, and just a really weak story. I usually love the \"it could happen\" type of films, but if P2 really did happen, no one would be surprised or really care all that much."
    },
    {
      "rating": "10",
      "text": "All though P2 may stand to some to be formulaic or just another by-the-book slasher, it is in some small way the diamond in the rockpile.\r We are facing the dark days of horror, almost everything coming out these days are following the grandfather of all horror; Halloween.  If you take time to look back, it did in fact set the stage for all forthcoming horror films of its time.  While genre does have the capability to progress and evolve, the genre of horror seemingly is set in the past.  The last big move was Scream, it set the book for the 90's, then Texas Chainsaw set the books for remakes.  Every so often, we get a film that is not a remake, they can be crap, or they can be great, what is this you ask?\r Well, the film actually in some way shadows the plot of Misery, my favorite of all horror movies.  It's a snowy winter night, late at night, an office busibee is leaving work just at the last minute.  When she finds her car is dead, without signal, and the grid (P2) locked down, she is unwelcomely accompanied by Thomas, a man who is deeply in love with her.\r So, yes, we have seen this before, but what the film does is it takes us out of the woods, out of the haunted houses or cabins, out of the suburbs, and places us in a parking structure, and we all know how creepy these places get at night; it's all dark, only few people around and cold as all hell.  This film begs the question; what if the only man who can let you out doesn't want you to leave (a la Misery).  So that sets up a good start.\r As the film progresses, tensions begin rising and palms get clammy.  Paul Bettany's portrayal of the tormented young man is truly acceptable and an underestimated credit to his career, it might be the cherry on the sundae for some, and it sure is for me.  Rachel Nichols (his opposite) also serves the film well, in modern horror you have to wait forever for the main to put on the fighter face, but she comes prepared.  But up against Bettany, she does a fine job, but he really steals the show.\r I can't help but give the film a 10/10.  It is a well crafted film, that was in my eyes underestimated."
    },
    {
      "rating": "7",
      "text": "P2 definitely surprised me. This one takes place on Christmas Eve and is about a woman named Angela who is trapped in a parking garage and stalked by an insane security guard. I was expecting a really low-budget-looking, tension-free \"thriller\", but this was actually very intense, creepy, and sometimes even disturbing. There were a couple of scenes that definitely made me uncomfortable and a ton of places that were just plain unsettling and very memorable. Like most thrillers, the characters seem to be able to teleport and inexplicably close calls, but in this movie, they're very distracting. It also drags at points, especially in the beginning, but P2 is definitely worth a shot if you're looking for a fun thriller. It's on Netflix if you're interested."
    }
  ],
  "recommendations": [
    "vacancy",
    "the_strangers_prey_at_night",
    "the_crazies",
    "dark_skies",
    "devil",
    "disturbia",
    "terrifier",
    "the_woman_in_black",
    "mirrors",
    "the_boy",
    "the_forest",
    "malignant",
    "the_collector",
    "wrong_turn",
    "dead_silence",
    "hell_fest",
    "the_ring",
    "the_conjuring",
    "insidious_chapter_2",
    "the_possession",
    "texas_chainsaw_3d",
    "the_ritual",
    "mama",
    "house_of_wax",
    "insidious"
  ]
}