{
  "id": 614,
  "title": "Pacific Rim: Uprising",
  "starring": [
    "John Boyega",
    "Scott Eastwood"
  ],
  "runtime": 111,
  "genre": [
    "Action",
    "Fantasy",
    "Science Fiction",
    "Adventure"
  ],
  "description": "It has been ten years since The Battle of the Breach and the oceans are still, but restless. Vindicated by the victory at the Breach, the Jaeger program has evolved into the most powerful global defense force in human history. The PPDC now calls upon the best and brightest to rise up and become the next generation of heroes when the Kaiju threat returns.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/v5HlmJK9bdeHxN2QhaFP1ivjX3U.jpg",
  "categories": {
    "plot": 3.725,
    "acting": 3.260869565217391,
    "ending": 2.8333333333333335,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 4.0,
    "action": 3.1739130434782608
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Just don't know what happened between Pacific Rim 1 & 2... The previous one was such a great movie but this one... So many advertisement. So many unnecessary characters. They did not make movie with the love of Jaeger and Kaiju but made it for commercial purpose. So pathetic."
    },
    {
      "rating": "3",
      "text": "There is no way to sugarcoat it. This movie was sucked d*ck on every possible level."
    },
    {
      "rating": "3",
      "text": "I hated this movie, i don't know what to say other than it was so boring, i loved the first one but this one was absolutely pointless."
    },
    {
      "rating": "2",
      "text": "There where many things that bothered me about the first movie but overall it was watchable/somewhat enjoyable.This movie was just a headache. Dumb plot, silly fighting scenes, bad humour and a lot moreI hope it won't be the same director and the same actors 'bringing the fight to them'."
    },
    {
      "rating": "0",
      "text": "What an absolute crock of **** They made pacific rim into a children's movie. I guess once again \"marketing\" ruins entertainment."
    },
    {
      "rating": "5",
      "text": "A film that lacks the vision the first one does even when it has its moments of fun. There is definitely some fun to be had here, but the meandering script left me uninspired in the end. Overall I can't quite give it a pass a high 5. C+"
    },
    {
      "rating": "6",
      "text": "The action sequences alone are worth the price of admission, the scenes in between not so much."
    },
    {
      "rating": "3",
      "text": "how do you mess a robot fighting monsters movie up? this movie is god awful. no wonder jax Taylor didn't want to be involved in this ****  John Boyega is terrible in this movie. his British accent is just awful. totally makes you want to mute this **** they could have at least made this as good as the last one. it seems they were going for an international audience as they cast lots of bad actors across the globe. unless you are bored as **** and have nothing to do on a weekend and feel the need to watch this garbage just to let you know you have been warned. charlie day is the only good thing about this movie."
    },
    {
      "rating": "4",
      "text": "Really liked the first Pacific Rim. This one how ever is not even near as good as the first. No Del Torro directing pretty much killed this. The plot is dumb, the characters are bland and boring, and this feels like a bad episode of the power rangers. The Jager pilots look like they are all 13 to 15 years old. No Rolly in this one or Herc. The only reason I am even giving this a 4 and not a zero is the action is ok. Not near as good as the first one though. When Jager fights were not happening in this movie I was zoning out due to Bordem.Really disappointed in this one. It was one of my more anticipated movies for 2018. I would say don't waste your time on it."
    },
    {
      "rating": "0",
      "text": "This movie isn't just an insult to fans of the original, it's an insult to cinema as a whole. Uprising has a completely different aesthetic than it's predecessor and that's not a good thing. The original Pacific Rim was able to feel realistic and captivating, despite it's ridiculous concept. And a lot  of that came from director Guillermo del Toro's commitment to pseudo realism. He can take any ludicrous concept and make it feel real. That's not a common talent, and yet you would expect the director of this sequel, Steven Deknight to at least try his best to replicate that feel. But surprise surprise, he doesn't. This entire movie feels like a cartoon, all sense of scale and weight from the first movie are thrown out the window in favor of cartoonish antics which pull you out of the narrative. Most of the Jeager Pilots in this movie are literal teenagers, showing just how little the filmmakers cared about the original movie. This film was designed by focus groups, not artists, and it reflects very poorly on the final product. To make it even worse, the film feels like it was designed to ruin the universe the first movie established. One of the main characters in the first film has been reduced to a villain for no reason, but that's not nearly as bad as how this piece of trash then decides it would be a good idea to cram one of the leads in the first movie into the first act, have them show no emotion or semblance of character, and then kill them off, and act like it was nothing.Finally, the action is just useless. There is more of it in this one than the original, but there is no effort put into its' choreography. Fights are slow paced and uncreative, there are no distinctive weapons or abilities used, (none that mean anything anyway). There is no effort put into making any of the hits feel strong or impactful,the fights aren't nearly as visceral or captivating as the first one's. All around this is an abysmal movie with no redeeming qualities, anything that looks good in this garbage heap has been done better by other movies."
    },
    {
      "rating": "3",
      "text": "\"TrololololoLalalaOh-hahaha-hoHaha-hehe-hoHohoho-he-hoHahahaha-hoLolololololoLolololololoLolololololoLololo-LOL!Aaaaaaaaaaahhhhhhhhhhhhh!\"That's in the movie, by the way. I couldn't believe it. They actually played the trololo song. As if to troll film lovers for expecting quality. ( ͡° ͜ʖ ͡°)"
    },
    {
      "rating": "4",
      "text": "I'll add my review to the mixed score train. It isn't terrible but it is also far from great and worse than the first one. It seem like targeted to young audience. It has a simple plot, very young protagonists, a cute robot, basic morals, if you have some age on your shoulders you'll forsee every dialogue and situation of this flick. Battles are more flashy than the first film but are soulless, hollow, linear. It is sad to see enormous robots armed with nonsense weapons jumping all around like ninja (causing more colleateral damage than the monsters)....unlike the first one where you can feel the weights of monsters and mechs. Kaiju are veeeery scarce in this movie and have generic look and silly motivation. It is missing the love letter for vintage kaiju films or anime robot of the first installation. If you'll go to the teatre with childer they will have a good time but otherwise you can skip it"
    },
    {
      "rating": "3",
      "text": "I got the DVD for this last week. Let me just say, I am glad I didn't waste my money at the movie theater, which would have been as much as I paid for the DVD. This is a bad movie. No plot, vaguely coherent story and rehashed CGI effects that offer very little compared to the first one. Don't bother watching this, it's just not worth it even on a lazy Saturday afternoon when trying to kill a few hours."
    },
    {
      "rating": "5",
      "text": "When the director said we need to make jaegers \"faster and lighter\" I know what I can possibly get..."
    },
    {
      "rating": "5",
      "text": "Uprising was a very average movie. I did appreciate the acting in general. But the story barely involve the actual Kaaju and aliens. Yes you get some hints on the why of the first movie, but it takes way too much time establishing the new characters and too much language translations. The visuals were pretty good and easily the fun aspect of the movie. The lack of an established movie star, was maybe a bad decision. And turning a previous fun/comedic character into the main villain isn't a good move at all. So yes, the mechanics works but the essence doesn't make that thing run very far. I give it a 55% because this movie seems to setup a follow up. Will we see it is another question..."
    },
    {
      "rating": "4",
      "text": "Ohhhh my god.  Why did I waste $1.67 at Redbox on this?  I knew better.  I knew it would be bad.  And it was... you really have to watch it as comedy I guess.If you accept the hilarious premise of this franchise, namely that giant Japanese monsters from another dimension are periodically climbing up out of the seafloor to smash all buildings that they can find, then you have to also accept the fact that you are watching something designed for 8-year olds, basically, and from that uncritical point of view, it's sort of entertaining for a while.  But then all the usual giant-robot combat ensues, and it wears thin rather quickly... why is that pre-teen girl able to build giant robots all by herself?  I never understood that... or any of dozens of other examples of far-fetched silliness that's taken for granted here.Really the best part of this eye-roller is the names of the giant Jaeger robots... \"November Ajax\" etc.  Definitely good stuff for 8-year olds to get into and then buy the plastic model kits..."
    },
    {
      "rating": "4",
      "text": "It seems more a bad copy of the first than a sequel, taking everything great and overexploiting it so much that it is no longer great. 4.9 / 10"
    },
    {
      "rating": "5",
      "text": "for what its worth its not a bad movie the monster fights are awesome the humans are cardboard and nothing really interesting there just wait for it to come to dvd and skip the first hour"
    },
    {
      "rating": "5",
      "text": "Pacific Rim: Uprising goes full Hollywood with this poorly executed sequel. If you are hoping this film is better than the first, you'll be disappointed as the only real appeal to this film is the unrealistic physics of Yager Combat.The story leads a linear path and diverges into multiple complex situations that, if any of the characters were smart enough, could fix quite easily. The climax, although different in a way, gets to a point where the movie seems to keep falling from that point on and has no real return. So many plots are unrealistic and so many decisions the writers chose made this film a little bit more unbearable each minute.The only real positives are John Boyega's strong acting, Yager Design and, of course, the Kaiju, who are somehow back, and explained very briefly.If there are plans for another movie, let's hope anyone who writes it has a chance to develop a good story, with stronger acting and making the Yager combat as realistic as possible."
    },
    {
      "rating": "5",
      "text": "Equipped with an interesting setting and likable lead characters, Pacific Rim: Uprising is the epitome of wasted potential. Copping out at every turn and displaying a complete lack of trust in its audience, the script to this sequel immediately devolves into spelling out everything that its viewers need to know (either through blunt voiceovers or on-the-nose dialogue). This sets the tone for the entire movie as we’re exposed to every cliché in the book (an exhausted plot line and flat supporting characters) as well as inattentive techniques (negligent pacing, transitions and effects). There may be some thrilling fights and the cool monsters but the entire ride rings hollow all the way through.While the design and potential of Pacific Rim: Uprising may have many wanting to give it a shot, its void of substance limits the film  to only the shallowest of successes. In the vain of Transformers or the Fast & Furious franchise, this film has oodles of popcorn appeal and a major absence of craft or distinction. Pacific Rim: Uprising is fun at times but, just like its over-indulgent action sequences, the film is wholly unoriginal and bordering on insulting.Writing: 4/10Direction: 4/10Cinematography: 4/10Acting: 4/10Editing: 4/10Sound: 6/10Score/Soundtrack: 5/10Production Design: 7/10Casting: 6/10Effects: 7/10Overall Score: 5.1/10Original Articles: https://thefilmguys.blog/reviews/augusts-reviews/pacific-rim-uprising-2018/"
    },
    {
      "rating": "3",
      "text": "время можно потратить,но фильм не оставляет после себя впечатлений.... графика красива, но сюжет детский, да и детей куча в фильме, типо девочка гений, а толпа взрослых и образованных людей -дегенераты. фильм на раз. из-за уважения к первой части максимум 3 балла"
    },
    {
      "rating": "0",
      "text": "I hate that this was made on a cheaper budget than the first movie which was an actual success. This was only made to promote some toys and the cartoon series. Plus having a new director who isn't Guillermo del Toro to man the ship on a story he created is disappointing. I recommend you go and review the actual sequel that Guillermo del Toro actually wrote and had planned to kick start a whole cinematic universe. Which had also plans to link with Godzilla."
    },
    {
      "rating": "0",
      "text": "Disappointing, between little kaiju action and mostly interpersonal conflicts, the difference in quality between the original Pacific Rim and this film is appalling."
    },
    {
      "rating": "0",
      "text": "This is possibly the absolute worst film in existence every second of it angered me. This movie is AIDS and should be banned!"
    },
    {
      "rating": "4",
      "text": "What Happened!?Pacific Rim: Uprising Feels Like A Very Cheesy Power Rangers Episode Mixed With The Better Moments Of Transformers Movies (Those Movies Mostly Suck), The First Pacific Rim Had A lot Of Creative Ideas And Terrific Visual Effects. But Here It's Very Bland And Messy With That Cheesy Power Rangers Feel To it."
    },
    {
      "rating": "4",
      "text": "The start of this movie is really slow and weak. The effects, characters and story is dull at best. But after Newt gets crazier and takes over its picking up!! Suddenly the effects gets better, more battles like the first movie and it gets moe entertaining all over. The stupid misplaced humor is there through the whole movie though...."
    },
    {
      "rating": "5",
      "text": "Not a good movie. This film is not directed by Guillermo del Toro, unlike the first instalment, doesn't have his soul or his touch. A bunch of action scenes & clichés. Flat Performances. Random simplistic plot. Although it has some good scenarios."
    },
    {
      "rating": "1",
      "text": "Plot holes and bad ending. We just can't have good sequels. That's just how things are...."
    },
    {
      "rating": "4",
      "text": "This movie was disappointing. They took away everything that made Pacific Rim great and added nothing of value. This movie desperately needed a better script. Flashier and \"bigger\" isn't always better. It just had no soul."
    },
    {
      "rating": "6",
      "text": "Like a lot of other recent sequels, \"Pacific Rim: Uprising\" juggles too many new elements, world-builds to a fault, and squanders the core facets of what made the original so enticing. The characters, the action, and the stakes are all downgraded considerably in this. Plus, there's one really unfortunate narrative risk taken here that pans out so horribly, it almost breaks the movie. Almost. Thankfully, the effects, the performances, and the world that was so brilliantly staged by Guillermo Del Toro back in 2013 ultimately make the movie watchable. And I can't say I really regret the watch."
    },
    {
      "rating": "2",
      "text": "1st Pacific Rim at least respect Sir Issac Newton and law of physic. All move are 'heavy' and 'realistic' and 'believable' thus result in 'immersion'. Every punch is packed with weight with equal reaction. When the punch hit, you can see the reaction on both jaeger and kaiju.Uprising? Everything defy physic so much that it break all the immersion. This time jaeger move around like a sheet of paper blow by tornado wind. Action happen so fast that they should create sonic boom and destroy everything around it. Watching this movie is like watching physic(cally) torture movie. Another insult to the injury is the jaeger designs. In 1st movie, each machines come with its own designs that define each personality and advantage & disadvantage. Now in Uprising, all machines look like they came out of China's mass production line."
    },
    {
      "rating": "5",
      "text": "\"Pacific Rim: Uprising\" was a film that did not respect the essence of the original film, they presented us a new story  with new characters, new jaegers and new kaijus, and that was a very strong point in the film, but new and also many problematics. The story is overloaded, there are very excessive action sequences, the story became aggressive and very pretentious, and its turn is very fast. They discontrolled the whole movie and destroyed all the essence that the great Guillermo Del Toro transmitted to us in the first film, the visual effects are lighty good but the performances are so bad. And even with all those severe problems, the movie is very entertaining. But it will not be worthwhile to continue knowing more about the story as it was destroyed, by the unbridled pace of the film."
    },
    {
      "rating": "0",
      "text": "I really enjoyed the original but DAMN this film is completely awful,this is a perfect example of cash grab,the cgi looks cartoony,the acting is bland as the characters,the battle scenes are there and they are fun to watch,but beyond that i was bored out of my mind,cuz i didn't give a s*** about these new characters.Not only is this film nowhere near as good as the first film but it is also very disrespectful to  Guillermo del Toro's vision of the first"
    },
    {
      "rating": "0",
      "text": "Holy **** this movie is like a SyFy Mockbsuter, John Boyega is the best part of the film, but the Latina, Scott Eastwood, the chinesse girl, (who apparence in all Legendary Movie's) and the Little girl, are si unnecesary, i hope this movie flops in so many levels, #JUSTICE4JOHNBOYEGA"
    },
    {
      "rating": "0",
      "text": "It is so off the mark from the first movie that it might as well not be in the same franchise.  Fights were worse.  Script was worse.  Characters were worse.  I nearly walked out just before the final battle and now regret that I didn't.  Worst movie I've seen in a decade and I LOVED Pacific Rim."
    },
    {
      "rating": "1",
      "text": "This film sucked and I for one, hated every damn moment of it. I am honestly lost for words, the plot was garage, the performances of the cast aside from John Boyega were utter sh*t especially from Scott Eastwood and Cailee Spaeny, and the fight scenes were some of the worst choreographed in the history of film. There is very little that is redeemable about this film and I regret that i've wasted my time and money watching it."
    },
    {
      "rating": "6",
      "text": "Very corporate production aimed at teens and and the future sale of merchandise . John Boyega isn't really leading man material, his co stars are generic and the script is basically every cliche and trope you can think of.Negatives aside it is visually wonderful on the big screen and very entertaining. Can’t be faulted for the excellent CGI, Animatronics, Costume etc. It is full scale razamatazz in the same vein as “Transformers”."
    },
    {
      "rating": "5",
      "text": "A fun movie to watch, robots fighting and surprisingly good special effects. Lacked a proper plot and character development in places."
    },
    {
      "rating": "4",
      "text": "Not nearly as good as the first. The story spent way to much time on the ew characters and it feels like the entire movie was targeting 15 years olds. Also the storyline and the villan were just bad and lazy. Would rate this about half what the first movie was"
    },
    {
      "rating": "6",
      "text": "Be a simple! If you love and miss visual effects, of course you should crab you ass from home and straight go to the cinema. However I can tell ya one thing, The script of the movie is certainly limping. In addition, not all the actors gave their best."
    },
    {
      "rating": "2",
      "text": "Borderline unwatchable. There's some decent visual effects so I'm throwing a few points in but man, this is a BAD movie. I liked the first one well enough, but nothing about this one is engaging. The characters are bad, the plot is absent, and the action is over the top in a way that is boring as Hell. Skip this if you're on the fence, but if you thought the first movie was the best thing ever you'll probably see this no matter what any review says. I knew it wouldn't be as good as the first one, but this is an embarrassment for all involved."
    },
    {
      "rating": "4",
      "text": "3 points for CGI, after that there is nothing in the movie. no plot, no good acting, no humor. nothing."
    },
    {
      "rating": "5",
      "text": "Pacific Rim 2 is far from being as good as its predecessor. The script is very, very loose, it's a mix of Power Rangers, Transformers, Independence Day 2 and a bit of the first Pacific Rim. It is a very generic movie. None of the jokes work, none of the characters empathize, there are many plot holes and nonsense.Even so, the film entertains a lot in its last 30 minutes, these are the ones that save this movie from having a 1. The final fight is very well made and it is quite a spectacle for the spectator. The special effects are very good, although at times they can be very artificial due to the lighting and camera movements.To see it in 3D and in a movie theater."
    },
    {
      "rating": "4",
      "text": "Mal guión, ese es su principal problema; pero también se nota la diferencia del cambio de dirección. Hubo momentos en que incluso me pregunté si lo que estaba mirando era una película o un spot publicitario del ejército gringo. Lo demás pasa desapercibido y no aporta nada nuevo. Incluso algunos efectos especiales se ven muy malos, sobre todo aquellos de los monstruos."
    },
    {
      "rating": "4",
      "text": "Not terrible but not great either, pretty predictable and lack class and better story development."
    },
    {
      "rating": "5",
      "text": "the much potential for a 4 year movie was not really that great nor bad.The comedy was not that enjoyable but near the end it was FUN.the story was okay not bad,i expected a better version.Near the end they said they might announce a 3rd movie,i hope its better than this if realsed.its jUst an okay movie"
    },
    {
      "rating": "3",
      "text": "I really enjoyed the first Pacific Rim, since I am a huge fan of both giant robots and monsters all my life, but this movie was a gigantic letdown. If you are a fan of those things like me, you will be VERY disappointed. In the first 10 min into the movie, I already saw the colossal plot hole the movie would be.  You will see tons of the most common cliches in movie writing (the bad ones). In contrast with the first movie, the plot has no appeal, uninteresting characters, bad writing, bad dialogs, bad jokes. Don't expect the immersion, good action and interesting Mechas and pilots like the first movie. Being completely honest, it looks like a movie made for little kids, with characters that would only be appealing for little kids (like 8-10 years old). They lose a massive amount of time in ridiculous dialogs and cliche plot roles.Oh... and, there is an ENORMOUS plot hole between this movie and the first one that is never explained. You can see that the change of directors (del Toro does not direct this one) hurt the movie. The mecha fights were non-appealing, they completely break the laws of physics and were overall lame. The Kaijus are like completely secondary... in a Kaiju movie.So, in general... if you wanna see some mechs punch each other and with little to non-Kaiju action, and you don't care about writing and interesting characters, go see. If you want the opposite, just keed your memories of the first movie."
    },
    {
      "rating": "2",
      "text": "Guillermo del Toro (who just won Oscars for \"The Shape of Water\") created the original \"Rim,\" but abandoned this sequel…and it shows. There's none of his visual inventiveness or compelling storytelling. The first half wastes time setting up relationships with uninteresting characters (headed by John Boyega). After suffering thru that, there's an extended, noisy battle of giant robots vs. a creature from the deep and an evil machine. There's destruction is so massive and repetitive that it quickly devolves into a dull roar. I didn't love the first one and I absolutely hated this one."
    },
    {
      "rating": "2",
      "text": "Pacific Rim: Uprising is a big letdown for fans of the first movie.Whereas the original movie inspired awe in its spectacle, and even some of its characters engaged the audience, this light-hearted sequel is boring and its cast fails to engage the viewer. The absence of Charlie Hunnam, the protagonist from the first film, is a big negative.Sure there are some pretty CGI effects but nothing you haven't seen in Michael Bay's Transformers movies already. The only cool thing in Pacific Rim: Uprising is a plot twist regarding a traitor, but they spoilt it by making it obvious so early that it didn't pay off at all.The movie just brims with bad ideas and even worse execution. For starters the main mecha is named Gipsy Avenger (as in, Marvel's Avengers?). Next, 3 biological beings combine into a bigger one with the help of thousands of little machines that glued them together, as if the Constructicons appeared out of nowhere and combined into Devastator. The writers also made poor attempts at character development for all 10 Jaeger pilots when the focus should be on just 2 or 3 of them. And how about the sub-plot with the Kaiju's blood being excellent rocket fuel? There is an even dumber idea regarding the masterplan of the alien invaders, but I won't spoil it here. Lastly but not least, in the mid-credits they also tease a 3rd movie which should bring the fight to the aliens' homeworld. LOLI am very disappointed with Pacific Rim: Uprising, and this is one of the very few movies I regret watching in cinema. I'd rather watch a sequel to the newest Power Rangers movie."
    },
    {
      "rating": "4",
      "text": "Тихоокеанский Рубеж 2- безмозглое, но увлекательное кино. Сюжета простой, который нужен для драк роботов с монстрами. Графика отличная, но в некоторых моментах видна зеленка. Все стало мультяшным и пластиковым. Люди плохо прописаны, хотя видно, что создатели пытались это сделать. Главный герой получился бледным и плохо прописанным. На счет экшена проблем нет. Все таки- это не худшее, что могло произойти с фильмом."
    }
  ],
  "recommendations": [
    "independence_day_resurgence",
    "transformers_the_last_knight",
    "clash_of_the_titans",
    "bloodshot",
    "battleship",
    "project_power",
    "the_matrix_resurrections",
    "the_tomorrow_war",
    "poseidon",
    "jupiter_ascending",
    "the_darkest_hour",
    "riddick",
    "volcano",
    "valerian_and_the_city_of_a_thousand_planets",
    "infinite",
    "the_last_witch_hunter",
    "teenage_mutant_ninja_turtles",
    "jurassic_world_dominion",
    "surrogates",
    "into_the_storm",
    "rampage",
    "immortals",
    "army_of_the_dead",
    "the_cloverfield_paradox",
    "hercules"
  ]
}