{
  "id": 263,
  "title": "Pacific Rim",
  "starring": [
    "Charlie Hunnam",
    "Rinko Kikuchi"
  ],
  "runtime": 131,
  "genre": [
    "Action",
    "Science Fiction",
    "Adventure"
  ],
  "description": "Using massive piloted robots to combat the alien threat, earth's survivors take the fight to the invading alien force lurking in the depths of the Pacific Ocean. Nearly defenseless in the face of the relentless enemy, the forces of mankind have no choice but to turn to two unlikely heroes who now stand as earth's final hope against the mounting apocalypse.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8wo4eN8dWKaKlxhSvBz19uvj8gA.jpg",
  "categories": {
    "plot": 6.704918032786885,
    "acting": 7.2444444444444445,
    "ending": 5.4,
    "soundtrack": 10.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 6.75,
    "action": 7.037037037037037
  },
  "reviews": [
    {
      "rating": "9",
      "text": "A perfect popcorn summer fun movie. Those looking for in depth commentary on the human condition should look elsewhere. Just a badass movie that's lots of fun."
    },
    {
      "rating": "10",
      "text": "Disclaimer: I loved this movie. I watched it twice, back-to-back, in 3D.\r I loved the action and the spectacle. The battles, despite the one absurdity of giant robots fighting alien invaders had sense of realism that was rather unnerving. Everything but that (minor detail) was eerily plausible. I also liked the other messages found throughout. Mostly, though, I loved how it all came together as a kind of celebration of the value science and technology when coupled with human courage, ingenuity, innovation, self-sacrifice, individualism (when appropriate), and cooperation (when appropriate).\r It's the many minor messages within the movie that made it stand out from mindless summer action movie fare (which are fine, on occasion).\r First, what I like the most: I liked abiding theme of science and technology being tools for human salvation. There are literally no scenes without some object of human ingenuity in view. The giant robots are man-machine saviours that aid humanity in fighting against grotesque organic monsters.\r (As an aside: I like nature. I was raised in a rural area, and I enjoyed camping. But make no mistake, nature can be brutal, and it is only human scientific, technological, social, and other developments that can keep the monster at bay. If you doubt me, try surviving alone and without man-made equipment for a week in virtually any natural environment. You may not be dead, but you'll almost wish you were. Where I live (just outside a city of 1 million), you’d be dead in less than 5 hours without winter clothing, six months a year. Nature can be subservient to us, but it must never again be our master. Precambrian humans had an average life expectancy of 31 years. Also, like the monsters in this movie, any number larger wild animals would kill a human without a second thought. A bear will rip a child to shreds. Wolves (prior to their gradual domestication by killing the more violent ones over the centuries), were a particularly large threat in Europe. An elephant will gore a grown man. And so on. **It is solely our scientific, technological, and social advancements made possible by an appropriate mix of individual initiative and group cooperation that keep the nightmare at bay.** The movie Pacific Rim acknowledges this. Unlike the technological luddism of, for example, the Terminator movies or Avatar [which both partially denigrate technology and science], this movie celebrates human achievement and progress. And movies could use more of that.)\r I liked that movie (unlike almost all American blockbusters) takes place in several locations, none of which are large American cities. The United States comprises about 5% of the global population, and it’s nice to see that represented in an American blockbuster. And how many times do you really want to see New York destroyed, for instance?\r I appreciated the message that both cooperation and individual initiative are prudent and necessary. The fight against (for instance, there are several instances of insubordination and deviations from military procedure, but they mostly involve serving the greater good).\r I liked the love story component. The lead man was not a handsome male Brad Pitt lookalike, and the female love interest was not the typical American supermodel of action flicks. Rather, she was an English-speaking Chinese national who models the very best traits of many females from that culture. She is polite and respectful, yet stands up for her beliefs non-confrontationally, and she is obviously intelligent. She is \"equal but different\" from the main male protagonist.\r I appreciated the cursory mention of the cause for the alien invasion: global environmental degradation, the (spoiler) reason for the alien invasion.\r Although there is much \"apocalyptic porn\" (hey, I like it too), the body count is actually quite low. While we see entire skyscrapers destroyed, because civilians are evacuated in shelters, the number of civilian casualties is less than 100. (Contrast that with \"Man of Steel\", which had a casualty count of six or seven figures).\r It was nice to see scientists portrayed are heroes. The two scientist characters literally risk their lives to test a theory and gain evidence that is crucial to a positive outcome. This world needs more scientists and technologists. Even the characters' stereotypical eccentricity is endearing: they have their foibles, but they are each aware of it. Sometimes, human foibles are unavoidable, and condemning people for (relatively) harmless quirks that they cannot change serves no purpose.\r I did like that movie avoids many Hollywood clichés (for the above reasons).\r If I had one complaint, it's that the movie is too short. It's 2 hours and 10 minutes. However, there is less action than I would have liked. It's not that there is too much \"non-action\" content. It's just that another 30 minutes or so of giant robot battles would have been swell.\r In short: see it."
    },
    {
      "rating": "9",
      "text": "Exactly what you would expect from a robot vs monster movie.  So if you think you might be into that I recommend seeing this movie.  This was a treat to for the eyes if you can see it in 3D I thought it was worth the extra"
    },
    {
      "rating": "9",
      "text": "Pacific Rim is another wonderful brought to us by Guillermo del Toro, as this film is a visual masterpiece with great acting and a terrific story. But most of all, it is undeniably a fun ride at the movies"
    },
    {
      "rating": "8",
      "text": "\"Pacific Rim\" is a spectacle for the eyes and ears. I mean this movie is a visual treat from well detailed robot and monster designs to high over the top, but well choreographed action sequences and massive collateral damage. The world that Guillermo del Toro creates is imaginative and his character designs are mesmerizing and complex. The sound design and the sheer force of the films score captivates you into a ride of sight and sound that pleases all your senses. From the metal grinding noise of the robots to the fleshy and almost beast like cry the monsters make, this film has you feeling like you are right there in the middle of the action.\r While the movie is mostly is a visual treat, it doesn’t forget about its characters and there humanity. The film isn’t all bells and whistles, it really does have some really nice character moments in its script, which are about overcoming fear, moving on and trust. These moments make us care for the events that are unfolding. However, the script isn’t all serious business, it knows when to have fun. Some of these moments can be a bit too campy though and some of the emotional moments feel forced. The film sometimes even becomes contrived, mainly towards the end. However, director Guillermo del Toro balances things pretty well.\r The actors in this film do a pretty good job, but the only real standout is Idris Elba as Stacker Pentecost.This character is sort of the leader of the resistance and Elba commands attention every second on screen. Charlie Hunnam is pretty good as Raleigh Becket, a Jaeger pilot, who left the resistance after a traumatic incident. I wish they showed more of his inner battle, it would have invested us into the story more. Rinko Kikuchi as Mako Mori is really hit or miss. The scenes where she is more reserved are good, but when she tries to emote, it can be awkward at times. The rest of the cast is pretty solid and the supporting cast is pretty good, especially Charlie Day, who brings some of the lighter moments to the film.\r Overall “Pacific Rim\" as a giant robot versus giant monster movie is pretty awesome. The visuals, sound, and well directed action are all top-notch. They provide a treat for the eyes like never before. Even the 3D is spectacular, the best I’ve seen since “Avatar,\" it really absorbs you into del Toro’s imaginative world. The story, mainly the human element, is a bit weaker as it can feel contrived at times. It keeps us involved, but never takes us to the next level of emotional satisfaction. I give it 4/5, a blockbuster with some of the coolest and most imaginative action that I have seen this year."
    },
    {
      "rating": "7",
      "text": "Pacific Rim is a one of a kind movie: a 100% commitment to its genre and target audience with absolutely no apologies for its material. Exceptionally well crafted, with full saturation of neon colors, rain and goo. Director Del Toro probably takes the uber geek fan film into a territory the general audience might not want to go. The battle scenes deliver, and the performances from the actors deliver maximum dedication to the material. My bet is that the film will find a devoted audience, and especially inspire young kids. This is far closer to the Godzilla 1998 film should have been. The executive who greenlit this film was fired, so be grateful that this blank check geek epic got made."
    },
    {
      "rating": "3",
      "text": "If you enjoy human piloted robot anime you will enjoy this movie. If campy acting and generic character building is not a deal breaker for you you're also in luck with this film. The special effects are at current level dynamics and a worthy 3D experience. I'm an anime/cartoon/sci-fi etc. watching adult, however, Pacific Rim 3D, eventually made me aware that I was sitting and staring with my head in one position for over two hours. Bring the kids and a fat wallet."
    },
    {
      "rating": "4",
      "text": "It looks nice. That's about it. There's little character and no plot so none of the action sequences make one feel as if something is at stake, so the sequences themselves become dull, negating their purpose: excitement. Thanks to this, I fell asleep twice. I know that I didn't miss anything, however, because crap didn't happen. I guess my naps helped inadvertently redeem the film of its excessive running time; being unconscious was more exciting. 4.4/10, bad, two thumbs down, below average, etc."
    },
    {
      "rating": "3",
      "text": "Dull, noisy, clichéd. I'm shocked that Del Toro had anything to do with this. I know fanboys eat this adolescent stuff with a spoon, but if you're looking for anything innovative and inspired, do not see this movie. Just terrible."
    },
    {
      "rating": "0",
      "text": "The script was awful, the CGI was good, the story was stupid, and the physics of everything... just impossible.\r- Seriously, building enormous robots, out of heavy metal, only to have them fist-fight with sea monsters? Punching and throwing monsters on buildings? I have no words to describe how stupid that really feels. Why do they have plasma guns if they only use it AFTER being ass kicked  Is the plasma too expensive for them? Are they running on car batteries and they don't want to waste the power?\rAt the end, one of the robots seem to have discovered a swordlike weapon. Wow, that could have been useful earlier.\r- Another gem was the UN chairman saying they wont fund the robots anymore... like they have a choice... I cannot see the other choice though... Do not tell me the other choice was building walls. It's ridiculous.\r- Judging by the size of the robots and monsters fighting... in the sea... every time they fell, a giant wave should have started and clean the land. Instead, nothing like that happens.\r- The worst scene ever was when the ginormous robot picks up 2 buses and use them to splatter the head of a monster... Like just using it's ginormous metal hands wouldn't be enough. The buses must be built of stronger steel than the robot itself?\r - It was \"awesome\" the fact that the scientists had to physically go to the army base in order to tell them that it's not gonna work (the plan). This is happening in 2017 or 2027? Awesome... so they uninvented the phones cellphones...\r- It picks up buses in it's hand, then later it picks up a huge navy boat. Judging by their proportions, that ship was no taller than a bus, only longer. Really?\r- In the ending fight scene... underwater... those monsters roar like they are on the surface. Awesome again.\r- The idea to send an atomic bomb inside the rift came to them after 10-15 years from the beginning of the attacks, after tens of millions of civilian deaths... sounds reeeeaallly realistic :)\r- On the base, the oxygen levels from inside the robot, are still readable from inside the rift (inter-dimensional portal)\r- When the rift (bridge) collapses, it's representation in the army base shows it as it happens... in realtime... with nice effects... wow... the programmers of the future thought of everything, also installed sensors from top to bottom of the rift without even going there?\r- The fighting scenes are so dark and shot from such angles so that I could not understand what was happening most of the time.\r- And seriously... 6 helicopters move around the robots? Those giant metal machines? That is impossible, to say the least.\r- The black market guy, just stands and chats while at two feet from a giant monster that 10 seconds ago was demolishing buildings and boats, and only seemed to die from no reason at all? That is realistic in what universe?\r- Why would the head of the robot need to be detachable from the body? Why did the pilots have to enter the head... somewhere 10 feet above the 20 meters high robot, and after they entered the head... it would start descending into it's place... These stupid moments could have been used to develop some characters background stories\r- No story for the characters. Besides the surviving brother and the surviving Japanese girl no other character has any story? Let's say I liked the fighting scenes... More like the idea of the fights. But they were too long, and too silly. Fighting with their fists against sea monsters... that is just peachy.\r I expected so much more from this movie... now I have no idea why"
    },
    {
      "rating": "4",
      "text": "This is a boring movie, the only scenes that I found pleasant were the fighting ones that eventually get boring after a few minutes. It's full of scientific mistakes that make the movie ridiculously distorted and absurd, its story is poorly developed and made just to glue together the fight scenes with modern cinema clichés: I could foretell almost every single dialogue and I found it pretty annoying. I need my 9.5€ and 2 hours of my time back. Please don't watch it unless you're a lobotomized 12 years old boy in an adult's body."
    },
    {
      "rating": "3",
      "text": "Between the miserable script, the cardboard acting(Except for Edris), the mish mash action sequences. It seemed as though you could barely see what was heppening in any fight. Either the Rain, the darkness, or the ocean kept messing up the fights. I found myself looking way to hard to say \"What just happened there\" \"How\" and \"What?\" The monsters were hardly relatable as was the story itself. Great for 13 year olds. I love action movies and monster movies but at one point you could really care less who was getting crushed, stomped, or killed because you really dont care."
    },
    {
      "rating": "10",
      "text": "I felt like I was watching a modern version of a classic Toho film. It took me back, like when the food critic bites into the ratatouille in the movie Ratatouille."
    },
    {
      "rating": "3",
      "text": "NOTE: All my reviews right now are being published as 0/10 for some reason. I actually gave this movie a three, so ignore the current rating. I went into this movie expecting nothing but big dumb fun. What I got was big and dumb, but sadly lacking in \"fun\". Too much of the film is centred on one-dimensional human characters just talking while we impatiently wait for the action to start again. I know we should care about the characters and everything, but even with all this time spent with them, I couldn't care less about whether they lived or died. The main character is so bland that I can't even remember his name (or really anything he does) and his love interest is just as bland (though at least they tried to give her a backstory). Idris Elba's character was the only one who had any personality. Even the Robot-Monster fights occupy about 15 minutes of the running time and are mostly done in darkness. This is disapointing, since Guillermo Del Toro is such a great director, and this film should have been so much better. Instead, it begs unfortunate comparisons to Michael Bay's \"Transformers\" series. If you're fine with there being more uncompelling human \"drama\" (if it can even be called that) than the action they promised us, then good for you. Otherwise, I can't recommend this. 3/10."
    },
    {
      "rating": "10",
      "text": "Wow, just wow. I give a 10 rating once every 5 yrs or so and this rates that big time! This film is Transformers vs Godzillas on steroids, amped up to the max. The intensity is phenomenal, you'll wish the entire film was just mega-sized fight scenes.Yes, you can criticize this and that about the story, plot, etc but you'll be missing the entire point of the film. Enjoy this for what it is, and it's the best at what it does."
    },
    {
      "rating": "8",
      "text": "Easily the best action movie this year. Pacific Rim does something actually unexpected: Its really good, and it keeps you invested. Guillermo Del Toro take relativity unknown actors, mixed in with some more better known ones and makes this massive, visually enticing film that only leaves you wishing and/or wanting more. Will the sequel come? That'll be something for Warner Bros. to decide, but if they want another hit, green light the sequel and let Del Toro do his thing. This movie more than makes up for the disaster horror movie he released earlier in the year, in \"Mama\". Nobody was expecting this to be what it has become, so its easily a major surprise. I wouldn't go so far as to say, \"best movie of the year\" (that, personally for me, still lies with \"The Place Beyond The Pines\"). Its certainly best Action Movie of the year, and biggest surprise of the year. Worth seeing. Very fun adventure."
    },
    {
      "rating": "10",
      "text": "Incredible! Just one of the many words to describe this film overall. The emotional depth of the characters was deep and sincere, creating attachment to each unique individual as the story progressed with a captivating intensity rarely attained in movies of this epic caliber. The visual effects were beyond breathtaking with some of the most monumental battle scenes in movie history. In the end, this is without a doubt, a great achievement in cinema, and has a heart and hardcore attitude that'll please any moviegoer and have them cheering in elation."
    },
    {
      "rating": "8",
      "text": "The movie's special effects ALONE are worth the money. Then you got the great story, the mysteries about the monsters and you always feel like O.O THESE GUYS GONNA DAI! And half the time they do... Oh also there's Hellboy.\r Although the movie was great in terms of story AND special effects, the humor is just not satisfying enough, and you never really care for the characters other than the main ones.\r So for that, this GREAT movie gets an 8.1"
    },
    {
      "rating": "5",
      "text": "I love Japanese mecha anime from Macross to Orguss to Evangelion and back and I never thought I'd ever be bored senseless by a film which purports to be a love letter to giant mecha and Kaiju cinema. Everything is just so bloody dull; framing and cinematography, ESPECIALLY the Jaeger designs. The clichés though! I should have brought a checklist with me, Pacific Rim had so much cheese I'm practically lactose intolerant."
    },
    {
      "rating": "8",
      "text": "Sure, it's cheesy and predictable. Yes, it's style over substance. But heck..what you are seeing is a friggin live action Robot Anime, coming to life, done with a 'Godzilla' sized budget. It's a great thing to look at and you have to commend the studio for even green lighting this thing. The action sequences are great, and Del Toro give this film his incredible attention to detail. It's a wonderful set up, but the bad thing is that when you are just being immersed in this world, the film ends.  Other than that, a bold 'original film that deserves to succeed in weeks to come. C'mon people! A lot of folks complain that there isn't enough original material in blockbuster films these days. Give this one your support!"
    },
    {
      "rating": "9",
      "text": "As a massive Del Torro fan, and a huge Mange, Anime and Mecha fan this film was everything I wanted it to be.\r It made me feel like a child again, it made me feel the same way Jurassic Park made me feel when I was 5 years time, I was in awe. People will of course compare this brilliantly designed and thought of almost Film Noir epic to the atrocity that is is Michael Bay's orange backdrop and explosion fest that is the Transformer series, but this film is everything Bay could only dream of making and so much more. The Jeagers had a real sense of proportion, much like the classic PS2 game Shadow of the Colossus you really felt how big they were and when the [spoiler]    Kaiju unfurled its wings my jaw actually dropped.\r It wasn't a perfect film, but it was everything I hoped for and so much more!"
    },
    {
      "rating": "7",
      "text": "watching a bunch of giant robots fighting monsters is awesome. There is\rno denying that. Pacific Rim embodies this notion. Pacific Rim is The\rrobot vs monster movie. That being said, everything else about it is\rpretty damn terrible. The actors are all trying way too hard and it\rseems that everyone involved was having a hard time taking the subject\rmatter seriously. Maybe because everything in this movie has been done\rbefore. The whole plot is ripped from every aliens attack movie.\r\"Aliens attack and humans put aside their petty differences to work\rtogether to destroy the attackers\". Its so cliché its ridiculous. I was\rconstantly having flash backs to other movies. Most notably would be of\rcourse Godzilla, Transformers and also Independence day. Even the\rending reeked of Indep Day. The black market for kaiju parts was\rsomewhat interesting but it was all way too Hollywood. The scientist's\rwere also vaguely interesting but watching them interact and grow as\rcharacters made me want to puke. Jackson Teller just looks like he\rhopped out of Sons of Anarchy and into a robot suit. Again, robots\rfighting monsters will always be cool and the special effects are top\rnotch but everything else is unintentionally cheesy and cliché, its\rvery much similar to the Transformers series."
    },
    {
      "rating": "9",
      "text": "Let go of your scientific knowledge for this movie. A lot of stuff that happens juts isn't all that plausible, but you should know that before you even go in. You are about to watch giant robots suckerpunch demons from another dimension.\r The movie is pretty great. It's fresh in the movie industry, and creates a new world for your mind to explore. The characters develop in realistic ways, and while they could have been fleshes out more, Guillermo del Toro does a great job with the 131 minutes he had.\r I went into this movie as a big skeptic. Whenever I see movies like this, I think it is going to be as mindless as the Transformers series or just plain silly. Instead, there was some great tropes that made you think more about the characters and their role in this war they are fighting.\r A great new movie that creates a fun new world. I definitely recommend it."
    },
    {
      "rating": "7",
      "text": "In a world where every second movie in this genre is based on a comic book  comic book character(s) it's refreshing seeing something new, especially when these guys actually try and create a bit of story and not just mindless action  even though there is allot of that. The only negatives to this movie for me would be the fact that for some reason most fights happen in darkened environments; and on one or two sections I found the writing  script to be sub par, but nothing to take away from the enjoyment of the movie. Other than that I much prefer this movie to the latest incarnation of the Superman franchise."
    },
    {
      "rating": "10",
      "text": "Those who say this movie is boring, just have no taste in a decent mecha anime, or hate all science fiction.  I personally watched this movie and enjoyed it.  Sure, most of the acting sucked, but most people would not care for such tripe.  Most movie watchers these days would like to see a lot of action.  However, movie critics that cal this movie trash are drama-freaks who hate science fiction (or Romantic Fiction as it was called back in the early days: LOOK IT UP, baka) because it makes no sense to them."
    },
    {
      "rating": "10",
      "text": "If you like robots and monsters you can't really go wrong here. The acting isn't bad, the characters likable, the effects and *amazing*, and there's enough plot to keep things going but not enough to get in the way of what you went to see: robots beating up on monsters. I was actually really impressed with the characters and plot, initially worried there would be too much of them and I wouldn't see enough action. The science in this world mostly makes some sense and technical plot holes are few(once you accept the general setup). If you're a fan of mecha themed anime, grew up with Ultraman, or play video games that are action packed then you'll like this movie."
    },
    {
      "rating": "10",
      "text": "I was thinking about what conditional promise to make for this review on the way home from Pacific Rim tonight. \"If you love Transformers, you'll love Pacific Rim!\" or \"If you love Godzilla/Guillermo del Toro/action movies-- you'll love Pacific Rim!\" These scratch the surface, however. I can promise you: if you love *movies,* you will *love* Pacific Rim. This movie is the definition of fun, entertainment-- it reset my mind. Like us all, I've got life that I like to escape from, and I've found that movies granting me that escape have been becoming increasingly rare. This is a work of movie-art, a labour of love, and it's obvious the people behind it *threw* themselves into it. Go. See. Pacific. Rim. This gets a well-earned ten."
    },
    {
      "rating": "10",
      "text": "Pacific Rim is what action based movies should be. It delivers it's plot early on and gives you an idea of how grim the situation is, but it fortunately doesn't linger on the base exposition long enough to bore you to tears. The action scenes are exceptionally well made and really reflect the realism (what realism there can be with giant robots fighting monsters) of how a battle like this would happen. All the actors play their characters fantastically, helping to really deliver the experience, such as Raleigh Becket's washed up pilot character type. Overall the soundtrack had me shivering in my seat with excitement as the first track accompanied the pilots suiting up to pilot their Jaeger, and it kept me intensified during each Kaiju battle that came on screen. While the overall plot did have many cliches in it, they were delivered in the proper way as to improve the story. I highly recommend that anyone see this movie at least once, as I've already seen it twice in IMAX."
    },
    {
      "rating": "7",
      "text": "Very entertaining. More or less a transformers meets iron man and takes more of the good from iron man than the bad from transformers. Good action, exciting visually, funny moments, solid story line. You won't leave the theater with your mind blown, but you'll be happy you spent the money."
    },
    {
      "rating": "8",
      "text": "I wasn't expecting much from this film which I went to see in the holidays with my boy. That said we were both pleasantly surprised. It had a plot... It had a coherent thread running through the story as to where and why the kaiju came from... It was well acted... The special effects were second to none... It was thoroughly entertaining, enjoyable and satisfying. The quintessential blockbuster monster pic. Oh, and we both agreed Mako was extremely cute"
    },
    {
      "rating": "7",
      "text": "Despite the plot being extremely predictable, you can't help but feel electrified walking out of the theater after seeing giant otherworldly sea monsters duke it out with man-made robotic giants."
    },
    {
      "rating": "6",
      "text": "When Pacific Rim focuses on its generic characters and story it’s a mediocre film. However, what saves this movie and makes it worth watching are the visuals. The presentation in this movie is fantastic and has some fun action that never gets too excessive and leaves you wanting more. Had the film’s action not been as good as it was this film would’ve been a 5/10 but because the visuals were as cool as they were it’s a 6/10. I’m usually not big on dumb action movies but this is one blockbuster where I was bored when there was no action as opposed to the other way around. At the end of the day though this film is only memorable for its visuals. You won’t remember any of the characters or plot elements as they are all bland and generic but you will remember the cool visuals and fight scenes. If you are cool with a generic action film with cool visuals then definitely check this film out."
    },
    {
      "rating": "9",
      "text": "Absolutely one of my favorite movies of the summer.  Probably the best big-budget robot-vs-godzilla (c'mon..you know that's what this is) movie that will ever be made.  Every twist and device in the movie is a complete rip-off of something else, but it's so damned FUN that you can't help to like it...unless you are allergic to good times.  As someone who enjoyed a little (ok...a lot of) Voltron back in the day, the \"sword\" scene almost had me jumping out of my seat.  If you like robots and giant monsters, you love this movie.  If not, I am sure there is some Scandinavian neo-realist retrospective playing somewhere."
    },
    {
      "rating": "7",
      "text": "The script and plot are awkward, almost laughably bad at times, but if you want to watch giant robots fighting giant monsters Pacific Rim's spectacular battles are sure to entertain."
    },
    {
      "rating": "7",
      "text": "It's true that \"Pacific Rim\" is a child's film with big monsters and robots fighting each other; but acclaimed director Guillermo Del Toro manages to create a film with exciting energy and lively imagination, a movie truly for-your-eyes only."
    },
    {
      "rating": "9",
      "text": "I enjoyed this film very much. Everything from the acting to the CGI is brilliant and high quality. It's visual desert. Of course, like all these type of godzilla-esque films comes the Japanese themes. The Japanese have always enjoyed designing these types of films. Be it Godzilla, Godzilla vs Mothra, Godzilla vs Gomora, Godzilla vs Baragon and so on, but they lack resources to produce proper visually attractive films. The makers of this film took the idea of robots fighting godzilla monsters and turned it into this beautiful film.\r I have no other words to describe this. Just go and watch it."
    },
    {
      "rating": "6",
      "text": "Gonna start off with the negatives  Painfully generic and predictable story that you can call from a mile away. The acting is so-so and it does suffer from a few poor casting choices (Charlie Day anyone?).\r That being said, The battle scenes are freaking fantastic. So incredibly well done, They are simply addicting to watch. That alone makes the film worth watching and I really wish that I had seen it in theaters in 3-D because it would have been a blast.\r So overall, Thankfully the story is not a major focus but the battles are. For that alone, It's worth checking out because it can be rather enjoyable to watch."
    },
    {
      "rating": "9",
      "text": "When i first saw ads for this film, I did not expect much, but I watched it regardless, mainly because robots. But when i saw it, i was pleasantly surprised. it was actually a pretty good film, it had a good story line, amazing visuals, and good action scenes. i really only had one complaint though, there is very little character development. Ok, maybe I've been spoiled by evangelion, but there really isn't much. i mean, with some of the characters you meet them, you see their robot, their dead. you never really get to learn much about them, but besides that this was a very good film i believe is worth watching."
    },
    {
      "rating": "10",
      "text": "\"Do you want to sit here or go out there and do something really stupid\" Pacific Rim is a gigantic monster brawl.  But not like Godzilla versus Mechagodzilla.  It has awesome special effects, great acting and a amazing story.  Something that you would usually get in a movie like Argo or Lincoln.  But this movie delivers all that.  Don't be turned off by the genre and even though it's in third place in the box office it is easily better than Grown ups 2 in critical reception and it may be better than Despicable Me 2 for older kids.  So really it should be number 1.  Also if you think it may be scary for little kids that's not true.  There only gore that comes from the monster and one or two curses.  Maybe not for 4-8 years olds but anyone older will probably be alright. So anyway this films boasts amazing visuals, great acting and a great story.  I wouldn't be surprised if it won an Oscar for best visuals.  This is a definite must see."
    },
    {
      "rating": "9",
      "text": "No esperen ver un clásico, sino una película entretenida de principio a fin con muchos guiños a Macross, Personajes secundarios carismaticos y mounstros grandes... muy grandes!!"
    },
    {
      "rating": "10",
      "text": "Great fun, amazing designs. The Jaegers especially were pure joy to watch. There's no lulling dip dragging out mankind's first contact, or over the top drama, just monsters versus robots. Absolutely brilliant."
    },
    {
      "rating": "8",
      "text": "Not perfect, but still really good. It's pure nerd porn. As good as Iron Man 3 (if not better), definitely better than Star Trek:Into Darkness and Man Of Steel. And I liked all three of those other movies."
    },
    {
      "rating": "5",
      "text": "First off, great concept: giant machines fighting aliens. Then the movie started, this overly dramatic and long, nagging story-telling that is typical for American Hollywood movies was something that I certainly didn't expect from Guillermo del Toro. Even the jokes in-battle were abundant and broke the tension that actually made me want to see more of this film. The acting is stiffer than Expandables and in the end I thought Guillermo was pulling a leg at everyone, pointing out how cliche and staged action movies are these days. When I walked out the cinema I wondered whether I watched WWE or just the South Park episode..."
    },
    {
      "rating": "8",
      "text": "Pacific Rim  is a great movie.It`s kind of like Transformers without all the unnecessary BS. It`s Godzilla vs human controlled BOTS.It`s a fun movie to watch."
    },
    {
      "rating": "9",
      "text": "I didn't expect to like this movie as much as I did. Wow, was it ever a satisfying monster/giant robot movie that was visually pleasing in an anime style. It has a relatively straight forward story, but it doesn't need to be complicated. It was well acted, had substance, and I was thoroughly entertained throughout. This is what awful robot movies like Transformers or Robot Jox should have been like, and it was better than monster movies like Cloverfield."
    },
    {
      "rating": "10",
      "text": "think this is the last time i'll ever listen to bad reviews. this movie is great! and definitely a nice watch on Blu-ray. it had everything i wanted, and took me back in memory of a game with mech warriors from sega. i'll actually be buying this."
    },
    {
      "rating": "8",
      "text": "an amazing and original story it is simply excellent movie  is a bit predictable on some scenes but is so laughable  we don't need to talk about effects  it is clearly the best effects of this year!  trust me u will not get bored and lose money watching this movie."
    },
    {
      "rating": "5",
      "text": "Outstanding visuals. Really impressive. However I need something else. I know fans of these type of movies-juvenile stories will love it. But really, there´s nothing else apart from the stunning visual effects. People say this is the way Transformers should have been done. And I know the director is great. Whatever. I´ve not seen those ones. I need a story and character development for crying out loud! I was really bored, I almost fell asleep (of course I was watching it at night but I always do) and it never happens to me. A 5 out of 10 for the visuals. If not it would obviously be a 0. But it is what it is and it has its public."
    },
    {
      "rating": "10",
      "text": "I loved this movie for what it is, a magificent tribute to the Mecha and Kaiju generes. The fights are simply amazing and the visual effects are top notch. Del Toro makes this colosual Mechas come alive in a way that I've never seen before. Of course it has many cliches but it's a Robot vs Monster movie, what did you expect? The character do feel generic but IMHO they fit in a perfect way. If this movie would had been released in the 90s it would have marked my childhood.\r If you are a fan of Mecha anime or shows this is a must see."
    },
    {
      "rating": "9",
      "text": "I appreciated the fact that \"Pacific Rim\" wasn't overly hyped like a lot of films usually are.  I guess that's probably Guillermo del Toro's MO when it comes to films.\r That being said, I loved it.  The fights were epic, with each Kaiju requiring a different tactic to defeat and the introductory timeline showing the dwindling numbers of Jaegers still active set a tone of desperation for humanity.  That leads back to the film's battle sequences, where you don't know if a Jaeger (and its pilots) will survive the fight or not.  Sudden twists with the Kaiju elicited a \"what??\" response from me on more than one occasion.  An engaging story together with intense battles made the movie one of the best films I've seen this summer."
    }
  ],
  "recommendations": [
    "battle_los_angeles",
    "godzilla_king_of_the_monsters",
    "300_rise_of_an_empire",
    "kong_skull_island",
    "mad_max_fury_road",
    "rampage",
    "jurassic_world_fallen_kingdom",
    "independence_day",
    "reign_of_fire",
    "monsters",
    "transformers",
    "the_matrix_reloaded",
    "transformers_dark_of_the_moon",
    "mortal_engines",
    "the_great_wall",
    "the_day_after_tomorrow",
    "jupiter_ascending",
    "riddick",
    "bumblebee",
    "final_fantasy_the_spirits_within",
    "the_matrix_revolutions",
    "monster_hunter",
    "sunshine",
    "abraham_lincoln_vampire_hunter",
    "surrogates"
  ]
}