{"id": 2853, "title": "Paddington", "starring": ["Ben Whishaw", "Hugh Bonneville"], "runtime": 96, "genre": ["Comedy", "Adventure", "Family"], "description": "A young Peruvian bear travels to London in search of a new home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family.", "releaseYear": "2014", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/wpchRGhRhvhtU083PfX2yixXtiw.jpg", "categories": {"plot": 7.380952380952381, "acting": 8.0, "ending": 7.5, "soundtrack": 5.0, "cinematography": 7.5, "familyFriendly": 8.0, "funny": 8.205128205128204, "action": 8.0}, "reviews": [{"rating": "9", "text": "Charming, lighthearted and a whole lot of fun, Paddington's family friendly big screen treatment is an all out blast, delivering plenty of laughs along the ride."}, {"rating": "9", "text": "Loved it. Very clever and very English. Good for children too. Teaches about compassion. There are many episodes that are laugh-out-loud funny. To see Lord Grantham of Downton Abbey in one particular episode is just too much."}, {"rating": "10", "text": "Even if you've never read the books or seen the TV series (I haven't), this is still a lot of fun. Silly jokes in a highly enjoyable, nicely played film that contains many laugh out loud funny moments. A surprising treat."}, {"rating": "8", "text": "Paddington! This is a sometimes funny, and fast-pacing movie that kids will probably enjoy. Even adults are to find this movie entertaining! This movie is very similar to 101 Dalmatians and the villain is perhaps not as creepy but disgusting."}, {"rating": "8", "text": "I was surprised at how much I liked this movie.  Certainly not the greatest kids movie ever made, but not the totally predictable movie I thought it would be.  There were a few laugh out loud moments.  Nicole Kidman was perfect as the \"bad guy\" as well.  I enjoyed the English humor and there were politically incorrect moments that may not have made it into an American film that I appreciated (such as getting someone inebriated on purpose).  The interplay between the live actors and the computer generated bear was flawless which is a tribute to the actors involved, and the film looks great."}, {"rating": "8", "text": "Short version: Funny, surprisingly insightful but slightly overstretched.\r Long version:\rWhat struck me most while leaving the cinema was the audience range. The kids in the audience who'd gone for a bathroom-filling bear had clearly had an absolute blast, the elderly members who'd gone for nostalgia purposes were left with big smiles on their faces, and those in between were chattering away about their favourite bit.\r It's a really nice film with much slapstick humour (as seen in the trailer) but has the heart one would expect from a producer of the Harry Potter movies. There were moments when tears were shed (particularly on a windswept rooftop) and eruptions of laughter with Paddington's escapades and Julie Walters particularly stealing their scenes.\r There are a handful of moments that don't quite fit: Nicole Kidman's villain is a bit one note (although she's clearly having a ball playing the part) and Peter Capaldi (side note: fantastic Twelfth Doctor in Doctor Who) as a slimy neighbour doesn't fit seamlessly into the plot, but otherwise it's a joyous film and well worth seeing."}, {"rating": "7", "text": "Paddington is a very hard movie not to like. It 's joyful upbeat main character gives the movie a warm feel that separates it from many of the crude mindless films this year. Not always a fan of Nicole Kidman but she did the villain character justice."}, {"rating": "8", "text": "Do you just hate it when a trailer or a movie poster can false advertise a movie like: Edge of tomorrow, Dredd 3-D, Warm Bodies and now this movie.\r The story to Paddington is about a Peruvian bear who loves all things British, travels to London only to find himself overwhelmed at Paddington station. Lucky for him, the Brown family discovers him and offers a temporary haven. But he also catches the eye of a museum taxidermist, who is determined to add the rare bear to his collection.\r The first teaser trailer for this movie was in my opinion god-awful, you know when he's in the bathroom and he puts the two tooth brushes in his ears and gives it a little bit of a twist and turn, then he pulls it out and you can clearly see a giant peace of ear wax and then he licks it; that right they is just stupid kids humor and I wasn't looking forward to film at all.\r But when I look at some of the reviews for the film it actually got good feed back from critics. Empire give the film a five out of five star's and IGN give the film a 7.9/10, I couldn't believe it, I had to check twice to make sure that what I'm seeing is true, but I still wasn't hooked until I got a chance to see the film and to my surprise the movie isn't as bad as I thought it was and I actually found the movie to be funny.\r Ben Whishaw did the voice for the marmalade loving bear himself Paddington, and Ben Whishaw did a outstanding job of playing Paddington. He had that voice of a young, friendly and kind person (or bear if you must). Now originally Colin Firth was suppose to play this role but at the last minute he turned the role down by saying, \"The voice didn't match the character \", and to be honest I think he did the right thing, because I don't Firth's voice will match the character at all he just sound like Colin Firth.\r The movie has beautiful cinematography with some breathtaking shots of London, and the film had the Christmas feeling to it and it actually got the tone right.\r Now the visual effect's for the bear I have to be honest was the most realistic thing I've seen since this years movie Dawn Of the planet of the Apes. His fur looks like real fur that I can just go up to the screen a feel it, then I get kicked out the cinema for being a weirdo, but as I said realistic.\r If I had to pick a thing that I didn't like about the film I would say the character's and some of the jokes sometimes hit and sometimes miss. The character's in the movie are not all that interesting and they pretty dull to watch, Paddington, Nicole Kidman and Peter Capaldi are the only character's that I actually liked, and yes even the villain I enjoyed watching more then the family. Some of the jokes at times mash really well and didn't but when I think that's a small complain.\r Overall Paddinton was the biggest surprise of the year for me with it's cute bear, nice story and overall a good family film."}, {"rating": "8", "text": "I have never read the books or seen a single episode of the TV show. But I know they're aimed at small children so I wasn't initially interested in seeing this. Then I read the rave reviews and how it was supposed to be great for all ages and decided to check it out. I'm glad I did. Ben Whishaw was perfect as Paddington and the movie has the humour of \"Elf\" and the cuteness of \"The many adventures of Winnie the Pooh\". Fun for kids and adults alike!"}, {"rating": "10", "text": "Proves that great children's films don't need to be childish, you will want to cuddle 'Paddington' all the way home.\r Check out this movie here http://www.watchfree.to/watch-2a1d86-Paddington-movie-online-free-putlocker.html"}, {"rating": "8", "text": "In a word, Paddington is delightful. There is some great humor and heart a plenty in this British animated flick. There is a lot for both children and adults to enjoy. I cannot understate how well crafted Paddington is as a movie, and how much I found myself enjoying it. The ensemble cast works together incredibly well, and every character has a moment to shine in the spotlight. I laughed aloud a few times while watching Paddington, and I found myself with our bear protagonist on every step of his journey. This is a great family night movie, and I highly recommend this one."}, {"rating": "8", "text": "I think every parent in the UK should show this to their kids for two reasons;1. Its just a wholesome, fun, heartfelt adaption of a beloved character in the strong cannon of British children's literature. 2. Given the undertones of the film and the current political climate in our country, it will be likely to annoy a UKIP-er (which is what we all want, really)Watched May 7th 2018"}, {"rating": "8", "text": "Achieving the right balance of fluid animation and live action, Paddington is a complete delight to watch. Packed with slapstick humour and crowned with warmth, this is fun for all ages."}, {"rating": "8", "text": "Really fun movie. The CGI was very well done. And it was funny. Something for everyone in this movie, it's not just a kids movie. Acting was as good as can be expected and the actors did a fine job of bringing Paddington to life."}, {"rating": "10", "text": "Hilarious, charming, animal compassionate movie 10/10    ."}, {"rating": "5", "text": "Not having been exposed to Paddington in any of his previous incarnations either as a book or TV series and, based on the very effective trailer, I was eagerly anticipating the delights of the talking bear from darkest Peru. Therefore, it is with genuine sorrow that I have to acknowledge the fact that the whole does not equal the sum of its sometimes very inspired parts. The main problem is with the story itself which just doesn't cut it when compared to some amazing scenes of slapstick timed to absolute perfection.\r Paddington himself is wonderfully realised and uncannily voiced by Ben Whishaw. Let's face it, it's the bear we have come to see and he doesn't disappoint. Scene after scene ignites. The bathroom and cello tape sequences in particular are great fun. Also, there are magical moments involving a dolls house and a miniature railway carriage. In fact, there is so much to enjoy that it is rather a shame that the linking narrative and Paddington's human counterparts start to drag the film down. Ultimately, one is forced to acknowledge the film's unfortunate schizophrenia. Funny and moving it maybe, but sadly it's also rather yawny."}, {"rating": "5", "text": "Cute and charming in some ways but sickly sweet in others and the story is a bit tedious."}, {"rating": "6", "text": "Nostalgia of the original PADDINGTON BEAR series and the beloved novel by Michael Bond aside, Paul King’s PADDINGTON is a trademark Christmas offering from UK, a love letter to London and everything is tailor-made to not cross the borderline of being kids-friendly, but for adult audience who doesn’t grow up with the said bear, the film is generically predictable (the only exception belongs to the yardstick that Londoners never even raise their eyebrows to see a talking bear in front of them) and one might feel a bit disappointed that it couldn’t be more daring or ingenious considering its all-too-cute art productions which resemble lightweight Wes Anderson artworks and a wonderfully anthropomorphic CGI bear named Paddington (voiced by Whishaw).\r keep reading my review on my blog: please google \"cinema omnivore\", thanks!"}, {"rating": "10", "text": "Oh, Paddington. An amazing, funny, well-acted, film made by the same producer as Harry Potter! I was having fun watching this the whole time!"}, {"rating": "9", "text": "Just about perfect. I don't usually like this kind of family friendly fare. A re-imagining of a dated classic, from another format? Sure to be a horrible mess. But no. This film is relevant (dare I say timeless), sure to hit you in the funny bone and also tickle the ol'tear ducts. Entertainment for young and old, and those in between as well."}, {"rating": "10", "text": "Surprisingly well done movie for children and adults--anyone remembering the books will love it, anyome else will be enchanted by the Wes Anderson like tone the Director brings to the material. Well worht seeing"}, {"rating": "8", "text": "This charming film lovingly recreates the Paddington books in all their glory. Fun, beautifully animated, and surprisingly funny for both children and adults, this is a worthwhile film to see this year. For sure, it follows the cliches that one would expect from a children's movie but they are forgivable due to the excellent recreation of the marmalade-loving Paddington and the lighthearted and humorous performances from the cast. The only real downside was the weakness of the villain played by Nicole Kidman who felt forced and out-of-touch with the tone of the movie. However, overall this film is thoroughly enjoyable - definitely worth a trip to the cinema."}, {"rating": "8", "text": "This is just a charming and sweet film that should be seen by the whole family.  Surprisingly this film has a lot of humor as well.  I'm happy to say in a month of movie garbage, Paddington is a January miracle.  A-"}, {"rating": "7", "text": "Although there are some illogical incidents and story plots, still it is one of the best family movies! Totally brings up the harmony among people. Recommend it."}, {"rating": "10", "text": "When I first saw commercials for this film back in 2015, I immediately scoffed at it. I wondered how many blatant \"Alvin and the Chipmunks\" spoofs studios would keep churning out until they realized we wanted something better. Then, I read the reviews and saw that this had a 98% on Rotten Tomatoes and couldn't believe it. A live-action/CGI hybrid with a 98%? I had to see it to believe it. And I have to say, I most certainly believe it now. \"Paddington\" has a charm to it that's lacking in a lot of live-action/CGI hybrid films today: instead of focusing on the typical toilet humor and \"dumb\" jokes, this film is actually witty, clever, and wonderfully-written, and unlike a lot of similar films, it's one of those films where you actually care about the characters because they're so well-developed. The film is also beautifully shot and wonderfully inventive with its visual effects, and even if there are a few crazy moments in the plot, the film has too much irresistible charm to make up for it. If you're looking for a children's film from the heart, made with real passion, look no further than \"Paddington.\""}, {"rating": "8", "text": "This adorable adventure is slightly cliche, but really warmed my heart and made me reminisce about one of my favourite childhood stories. Incredible range of talent and glad to see Nicole Kidman in a worthwhile film."}, {"rating": "7", "text": "Based on the gullible bear children's book is now on the big screen? Hollywood has taken \"wannabe\" stories and make it into the movie well they succeed once to many times. Writer,director Paul King adds    Paddington cheerful,love able on screen and the producer David Heyman make Paddington sweet. Ben Whishaw stars as the one and only Paddington, His enthusiasm as that the bear is sweet and charming and that's why this movie is well-clever. co-star Sally Hawkins i find her well sweet and irritating it's a terrible feeling in this movie,Hugh Bonneville is great in this movie; also Nicole Kidman. If there's one i can not stand in kids movie is the humor, Sometimes it's funny  but it's just  i don't find funny. Some of the kid's humor cliche's also others  are in this one. Grade B-"}, {"rating": "7", "text": "Went to see this movie over Kingsman for my birthday. God, was it terrible. Silly performances, unfunny gags and completely obnoxious character...\r Just kidding, this is April's Fools. The movie was very pleasant, some jokes were too juvenile but most of them actually worked. Paddington himself is awesome, and the rest of the cast turned out okay. Overall, it didn't fulfill my expectations, but it was pretty good.\r 7/10."}, {"rating": "6", "text": "Prior to watching this:\rI have not read the novels or comic strip.\r Premise: A bear from South America learns to speak English, goes to London and has adapt to life there.\r Pros:\r1. A reasonably OK film for the kids.\r Cons:\r1. A bear that talks? How come no human was surprised that a bear could talk? This frustrated me as I watched the film. It's not difficult for the director to explain this and for him to omit this issue just smacks of laziness!\r2. Unconvincing storyline and acting... throughout the film.\r3. It is a film for kids.\r Score: 3/5 (no half score). Save your money and catch it on TV."}, {"rating": "7", "text": "4/5★ A charming cuddle of a film in the quirky vein of Wes Anderson and his detailed set pieces, Paddington is a fun family movie about an unhappy family rescuing a talking bear who, in turn, rescues them from themselves by teaching them to be happy while being hunted by  sadistic museum taxidermist Nicole Kidman.\rIn all honesty, while he is an excellent actor, Ben Whishaw's voice is distractingly annoying.\rVerdict: Family fun"}, {"rating": "9", "text": "Charming, fun and British. Only complaint was that it felt like some of the scenes were rushed so that the film could fit into 90 minutes, but this didn't really hamper my experience of the film nor affect the comedy (it just felt a bit unnatural). Nevertheless, you will really enjoy this film - and I would definitely recommend it to anyone."}, {"rating": "8", "text": "Highly entertaining all ages family film that's filled with beautifully rendered CGI and delightful performances from an A list British cast. It's bright, smart, sweet and funny and well worth the time invested in watching it. Now, if you'll excuse me, I'm off to make myself some delicious marmalade sandwiches."}, {"rating": "10", "text": "Dos produtores de Harry Potter, esse filme que tinha tudo para ser apenas mais um filme misto de animação com atores live-action, se mostra uma surpresa muito agradável!! Com uma direção muito boa, um ritmo legal, fotografias perfeitas, e uma animação do personagem principal muito linda, o filme com certeza foi para mim uma das grandes surpresas de 2014. O filme tem um humor leve, nada apelativo, com algumas pequenas pitadas de nonsense e com um forte apelo ao público infantil. É um filme perfeito para se assistir em família, pois conquista tanto adultos como crianças. O filme funciona muito bem na interação animação/seres humanos, lembrando os recentes Smurf e Smurf 2. E claro, é impossível assistir e não lembrar, por exemplo, de \"O Pequeno Stuart Little\". A história é um GRANDE clichê, uma fórmula usado por filmes há muito tempo, entretanto isso não atrapalha em nada a experiencia. Recomendadíssimo e pra mim é um dos melhores filmes de 2014, na sua respectiva proposta! 10/10."}, {"rating": "7", "text": "I went to see this cartoon with my girlfriend, because we thought that it was from the creators of Ted and that hence it would be hilarious. But the cartoon turned out to be just a kid story.\r The story begins in South American jungle, where a British adventurer meets a couple of talking bears. At once they become friends.\rMany years later the bears' nephew launches upon a journey to London (because his uncle dies and his aunt is going to home of elderly bears) in a quest to find the adventurer. The little bear gets lost on the Paddington station (That is why later he was given the name Paddington), but a nice-looking family picks him up and helps him in his mission. Turns out, that the adventurer had been expelled from the geographical community when he  returned from the jungle because he did not bring any trofeys from his journey (like stuffed bears) and that his daughter is now on a quest to correct her father's mistake by killing the little bear. Of course, the good prevails in the end.\r I personally enjoyed the plot though. It is thought-through and is suprisingly original for such cartoons.\r I would really recommend you to watch it with your kid, for all the kids around us were amazed. They were laughing and yelling etc. Beautifully-drawn, this cartoon is only of interest to kids of age 12 and younger."}, {"rating": "8", "text": "Some movies are easy to talk about but Paddington is not one of them. There's not much to say about this movie. As surprising as this may sound the Michael Bond books adaptation is a hard one to grasp. I want to say what my experience of the movie was like but it's hard for me to do so but I'll try.\r I am probably not the target audience for Paddington but the three foot six bear has something extremely appealing about him. Paddington is charming, respectful and funny. I couldn't help but have a smile on my face when he was on screen. The little C.G.I Bear is so lovable that he feels very much alive. Thanks to the seamless special effects, the good live acting from the cast, and the great job Ben Whishaw did voice acting that character - as if I needed another reason to admire this actor.\r The movie is endearing and warms your heart, it has this classical witty British humour that adults will responds to and children will enjoy. It's also a smart movie with a positive message, acceptance. Watching Paddington feels very much like reading book, I mean each sequences has a beginning and an end, it feels a like turning the page of a book each page a little more amazing than the next.\r Paddington will surprise you and put a smile on your face, it embodies the family film genre very well.\r @wornoutspines"}, {"rating": "9", "text": "'Paddington' was quite the unexpected adventure for me when I watched it. Watching one of the earlier cartoon incarnations of the character, I'd expected something in the lines of those interpretations, more cute and cuddly than actually serious. But the cinematic version of 'Paddington' actually had much to offer. Quite an interesting plot-line, likable characters (a very well picked cast, I must say), cute moments, funny moments, ... - in short, it had everything you'd expect from such a movie and a little more. It is quite refreshing to see a good transition of a cartoon character on the movie screen (unlike the recent fiasco of the TMNT) and 'Paddington' really offers a lot of laughs, many adorable moments, even some thrills and a fun adventure for both children and adults!"}, {"rating": "7", "text": "Enjoyable movie - good performances throughout and there was a nice warm fuzzy feeling at the end. Film is nice to sit down to with a nice bowl of popcorn or a bowl of icecream."}, {"rating": "10", "text": "Very good movie!  Lots of humour, good for the kids and just about everyone.  You are not too old for this movie.  It is the best movie I have ever watched in my life.\rPS Better than it appears in the trailer!"}, {"rating": "7", "text": "Did anyone see Paddington coming? I didn't. CGI/live-action crossovers have never struck me as a technique that could ever lead to anything other than cringing from adults and mindless amusement from the kiddies. Well, here we are. I didn't think the day would come so soon, trust me. I've been yearning for a long time to stumble across a savory family film, but the consideration of Paddington as that diamond in the rough had never even crossed my mind. I'm here to report the good news - Paddington rules. It's not just a good movie, but one that even verges on greatness in instances and I'm convinced if it had found the right audience and not been released in the garbage heap of a month that is January, Paddington could've found itself approaching instant-classic status.\r Now let's take a step back. This is still just a family film. This isn't a revelatory movie for the genre. It doesn't subvert cliches. It doesn't break new ground. Paddington, rather, succeeds because it casts aside what has become prevalently detrimental in a recent slew of family films (mean-spirited cynicism, degraded intelligence) and embraces theage-old virtues of naivety and warm-heartedness that make the genre so appealing. Paddington is not a movie that succumbs to referring to zeitgeist topics of cultural relevance. It sticks to what is true to the original content of the books and, though it is visually resplendent thanks to advances in technology, is rendered somewhat timeless.\r The modern aesthetic I mentioned earlier is a seamlessly blended interaction of the titular computer generated bear and the game cast of VERY English actors. When I say that I BEARLY noticed that Paddington was CGI (obvious, grating pun obviously intended), I mean it. The illusion never broke, everything felt authentic, a compliment I can only bestow to a few applications of the hybrid medium (Life of Pi, LOTR, the new Planet of the Apes films). And boy, is this bear a delight.\r Ben Whishaw voices Paddington with a gentle, graceful, mannerly demeanor that never breaks or betrays itself by succumbing to negativity. He is a compassionate, warm children's icon I can believe in. The ensemble of performers he is surrounded by is uniformly great as well, with Sally Hawkins exuding her typically optimistic effervescence and Hugh Bonneville's stuffy disposition deconstructing into the butt of many jokes. The child performances are devoid of irritation, another welcome pair of performances in the mix. Even Nicole Kidman, whom I would have expected to buckle to cartoonish villainy, avoids outright juvenile gags, save for an attack perpetrated by pigeons in the final act. The only performance issue I draw in Paddington is in the form of Jim Broadbent, whose antics are bumbling and infantile to the degree of mild irritation, though not embarrassment.\r Humor abounds at every turn. A silly gag here, an unexpected misdirect there, all for the sake of inconsistent absurdity. Not everything works, as they rarely do in any comedy, but Paddington's hit-to-miss ratio is high, and it's all accented with a quirk I hadn't anticipated. Some off-kilter camerawork and the spontaneous insertion of a subversively articulate vernacular make it feel like the kids film Wes Anderson never made (oh wait, Fantastic Mr. Fox anyone?). These oddball stylistic flourishes Paddington employs avoid stagnancy. While some of the jokes feel obvious, there are also those that also catch me off guard. There is actual wit on display.\r Paddington is a movie about an anthropomorphic bear from Peru with a deep appetite for marmalade and an emergency sandwich at the ready underneath his hat. It's a silly one, this flick. Amidst it's slapstick and hilarity, however, there is depth and real emotion. Paddington deserves laudatory sentiments decreeing it one of the best family films in recent memory because it is, plain and simple. Buy this one for your kids and keep it as one of the formative films of their childhood, it deserves that much."}, {"rating": "8", "text": "\"Paddington\" was a very good and funny movie. The performances and the special effects were great, and the story is endearing and captivating that surely enchanted the whole family."}, {"rating": "10", "text": "A beautiful feel good flick. I watched this on a Sunday night before facing a mucky, mundane Monday in the office, It did the trick and had me hooked, A pretty fairy tale like portrayal of London. Light hearted humor. The kids aren't annoying which is always a bonus. Very colorful and charismatic, I even managed a few guffaws whilst clutching my can of Zubr.  Quite a few  cheeky British cameo roles which  give it that  lovely, warm sort of Love Actually vibe, If its raining outside, you're under the weather or just hungover, grab a pot noodle, a cup of tea &  bang this on,  Guaranteed sweet dreams."}, {"rating": "8", "text": "Adorable, nice, heartwarming and great cgi's. Wonderful family movie!\r Watch it here for free: https://www.primewire.ag/watch-2760070-Paddington-online-free"}, {"rating": "8", "text": "I haven´t seen this one on cinema becuse the trailer looked like a generic family film adaptation made for money, but watching it (Becuse the sequel was more critical aclaimed) is actually more smart and funny that what i though. Paddington is a wonderful film to look at. From direction, writing, acting, effects, humor and charming scenes, this is a movie that all the familly and Paddington fans can enjoy. Paul King did an amazing work whit this one, I will see what´s whit the sequel if is better what everyone´s saying"}, {"rating": "8", "text": "You read Paddington Bear books & watch the cartoon.\r You will like see Paddington movie.\r Funny & cute, warm bear who try fit in with the Browns family.\r Good story.\r Rent this movie."}, {"rating": "8", "text": "I truly appreciate a family film that can raise a genuine smile through my sometimes cynical side and is good for a few solid chuckles, to boot. Well conceived and brought to life from a technical standpoint and very well written and directed. Almost unbearably adorable."}, {"rating": "10", "text": "Paddinton brings a family-friendly message to the audience and it also shows funny stunts form the best bear ever in literature and cinematographic history. Paddington has inventive story-telling, full of great entertainment and unforgettable characters, despite de some kind of unremarkable plot."}, {"rating": "8", "text": "Fun to watch film primarily aimed at kids but enjoyable to watch for adults as well. The CGI is quite well done and the humour while mainly slapstick is pretty decent too. The film also surprisingly deals with some high level concepts such as family, acceptance, urban isolation. Recommended watch for anyone."}, {"rating": "7", "text": "Paddington is good    ."}, {"rating": "7", "text": "It's not the books, it's not the TV series, but it is funny in places, exciting in places, sweet in places and heart-warming overall. Fun for all the family."}, {"rating": "9", "text": "I really enjoyed this movie. Nowadays, it's a little hard to find a charming family movie, (even though I'm writing 2 years after it's release) and this would be a perfect example. Even the youngest of viewers would surely find joy out of this movie. Great movie. 9/10."}], "recommendations": ["over_the_hedge", "ice_age", "peter_rabbit", "storks", "the_peanuts_movie", "puss_in_boots_the_last_wish", "hotel_transylvania_2", "shaun_the_sheep_movie", "despicable_me_2", "paddington_2", "captain_underpants_the_first_epic_movie", "bolt", "nanny_mcphee", "despicable_me", "the_croods", "shazam", "hotel_transylvania", "the_spongebob_squarepants_movie", "ice_age_the_meltdown", "the_lego_movie", "dora_and_the_lost_city_of_gold", "christopher_robin", "meet_the_robinsons", "flushed_away", "cloudy_with_a_chance_of_meatballs"]}