{"id": 1348, "title": "Palmer", "starring": ["Justin Timberlake", "Ryder Allen"], "runtime": 110, "genre": ["Drama"], "description": "After 12 years in prison, former high school football star Eddie Palmer returns home to put his life back together—and forms an unlikely bond with Sam, an outcast boy from a troubled home. But Eddie's past threatens to ruin his new life and family.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/xSDdRAjxKAGi8fUBLOqSrBhJmF0.jpg", "categories": {"plot": 6.777777777777778, "acting": 7.0, "ending": 6.0, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "Una conmovedora y esperanzadora historia de amistad y superación protagonizada por el muy talentoso Justin Timberlake cuya actuación se posiciona a ciegas entre los momentos más gloriosos de su carrera en general interpretando a un ex convicto tratando de volver a empezar, por otro lado un peculiar, solitario pero muy tierno niño se cruza en su camino dándole más de una razón a Palmer para seguir adelante y ser una mejor persona y brindarle el concepto de familia, protección y amistad a su adorable vecino.Los personajes principales están desarrollados a la perfección, en especial el de Palmer que de entrada no llama mucho la atención pero que se va enriqueciendo emocionalmente a medida que los hechos transcurren y los momentos cargados de emotividad nunca faltan, película 100% recomendable."}, {"rating": "0", "text": "This movie was tepid at best. A shallow and mediocre construction of performative allyship, featuring a career worst performance by Justin Timberlake. This film spun a vapid and illogical of a cisgender hero looking to force a sense of patriarchal acceptance. You are encouraged to feel a sense of wholesomeness upon witnessing the spoon-fed character “evolution” at hand. I, however, couldn’t reach for my waste basket fast enough."}, {"rating": "8", "text": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good."}, {"rating": "5", "text": "Perfectly innocent. It’s familiar, but not manipulative or pandering like a Hillbilly Elegy. Timberlake is solid. Worth your time if you have Apple TV+, but otherwise you’ll never know you missed it."}, {"rating": "10", "text": "A great movie that sparks a light into a very relevant subject in our society. JT's acting performance is impressive as well!"}, {"rating": "6", "text": "Interesting drama premise with issues. I loved the story, setting and characters. The casting was excellent (apart from the lead imo). Firstly JT feels like a mis cast - great performance but for me just too recognizable a face to get truly immersed. Background music playing constantly really detracts from any of the character building scenes to form a connection with me. Also the editing is so quick to cut from scene to scene without ever spending time allowing the audience to experience some of the heavier moments with the characters. Overall what should have been exceptional came across as quite average. Worth a watch."}, {"rating": "6", "text": "Watched \"Palmer\" on Apple TV (they extended my free trial until July!).  \"Palmer\" stars Justin Timberlake as a recently paroled convict who returns home and ends up taking care of a child from a broken home.    As most of the critics have said, this movie covers familiar territory. That is, a troubled man gets a new look on life when taking care of someone weaker than himself. The story and script are pedestrian but I am still rating this as \"6\" (somewhat above average) on the strength of Justin Timberlake's performance which is very good as well as the 2 main supporting players (Ryder Allen as Sam and Alisha Wainwright as Maggie).  The movie is watchable if you have Apple TV already but I wouldn't sign up for Apple TV just for this movie."}, {"rating": "5", "text": "Justin Timberlake was decent enough but if you're like me, you've seen this story countless times before. Yesterday I was talking about HBO Max doing its share of forgettable fillers. Well now it was the turn for Apple."}, {"rating": "10", "text": "Um filme lindo, e com uma mensagem forte e necessária. Simplesmente incrível!"}, {"rating": "10", "text": "I am a PS5 owner. With the 6 month free AppleTV+ trial, this movie stood out the most. Justin Timberlake is awesome, and proves he can be an outstanding actor. I loved the personality of the main character and the father-son like relationship between him and Sam. Love the movie. Definitely recommend it."}, {"rating": "5", "text": "(Mauro Lanari)Wanting to tackle too many topics at once, it loses depth, is confused and leaves you confused, moves you while you already forget it. An exemplary case of why the motto \"less is more\" is valid."}, {"rating": "10", "text": "A heartwarming and unique story, very well acted and authentic. Very interesting plot with some ups and downs."}, {"rating": "8", "text": "First wow what a heart-warming movie. I got to take my hat off to Justin on this one. And also the rest of the cast too. This is a hard subject but it's a story needed to be told."}, {"rating": "10", "text": "A melhor atuação de Justin Timberlake, e enredo impecável, filme com várias questões importantes e para se emocionar."}, {"rating": "10", "text": "Cried like a baby! I thought Justin Timberlake’s performance was moving. Definitely recommend"}, {"rating": "10", "text": "Some of the best acting I’ve ever seen. Justin Timberlake is absolutely phenomenal in this movie. It made me cry like a little girl and it has such a good message."}, {"rating": "9", "text": "While cliche at some moments, this movie was really enjoyable and emotional. Simple but really intriguing."}, {"rating": "10", "text": "This movie was adorably refreshing. It hit home in many ways so I couldn’t hold back some tears.  How the relationship developed between the Palmer and Sam was beautiful!!"}, {"rating": "10", "text": "Me encanto el filme, no veía un género drama en años y este me hizo sacar una lágrima, apesar de que la trama sea un poco cliché, sinceramente algunos temas me gustaron mucho y la inclusión más que nada para las nuevas generaciones y una enseñanza para los padres del futuro para que puedan tratar en modo adecuado este tema."}], "recommendations": ["joy", "scent_of_a_woman", "as_good_as_it_gets", "crazy_heart", "gifted", "american_hustle", "the_place_beyond_the_pines", "marriage_story", "silver_linings_playbook", "lovelace", "blue_valentine", "leaving_las_vegas", "still_alice", "fatherhood", "black_mass", "the_terminal", "hustlers", "the_judge", "burnt", "the_fighter", "the_king_of_staten_island", "the_glass_castle", "trouble_with_the_curve", "the_spectacular_now", "rain_man"]}