{
  "id": 4267,
  "title": "Palm Springs",
  "starring": [
    "Andy Samberg",
    "Cristin Milioti"
  ],
  "runtime": 90,
  "genre": [
    "Comedy",
    "Romance",
    "Science Fiction"
  ],
  "description": "When carefree Nyles and reluctant maid of honor Sarah have a chance encounter at a Palm Springs wedding, things get complicated when they find themselves unable to escape the venue, themselves, or each other.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yf5IuMW6GHghu39kxA0oFx7Bxmj.jpg",
  "categories": {
    "plot": 5.090909090909091,
    "acting": 6.5588235294117645,
    "ending": 6.2,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.088888888888889,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "First of all, some reviews called this film a refreshing concept. Let me say that again: A refreshing original concept.Now I ask: ''Are you **** kidding me?'' There's tons of films about time loops!!!Also there's an obvious and clear comparison looming over this movie. I'm talking about Groundhog Day.When we start, we don't really have any idea of what we're seeing. Although we soon get a certain direction, but about 20 minutes pass and suddenly we understand that we're in a time loop. And that's where all the fun and my interest in this repetitive comedy ended.And it's that what comes next is nothing more than an empty effort to try to show that this story is more than it really is and more than anything it's irritating with its annoying edgy humor that's telling you that this is story is for ''adults'' but all their adults behave like people unable to leave behind their adolescence.At least it does that well.Much of the humor falls on Samberg and unfortunately I have only found him funny in Brooklyn Nine-Nine and it's difficult for him to be funny when his character is a cliche of cynicism.Also the film uses much of what was seen in Murray's classic, only that the focus is more interested in trying to convince the audience that it's an obviously more up-to-date story, but that doesn't necessarily make it more adult or proactive for that matter.The only thing that appears as a change is that another character joins Samberg's in his loop and obviously with that plot device you know where we're going with itPalm Springs it's an absurd and the film sells it like that, but absurdities must also be funny if it's supposed to be a comedy."
    },
    {
      "rating": "10",
      "text": "I haven't had so much fun watching a movie in a long time. That was something. I was in a bad mood before I started watching this, but after a while I was laughing out loud and then experienced all the emotions the film intended me to. If you haven't watched it yet, please do."
    },
    {
      "rating": "10",
      "text": "Great performances from Sandberg and Milioti. Hope to see more of these two in future."
    },
    {
      "rating": "8",
      "text": "Very well done. It was super enjoyable. Will watch it again soon. Sandberg!"
    },
    {
      "rating": "10",
      "text": "Ok. Este é certamente um Must-See para fans do gênero - ou até mesmo para quem quer se aventurar no mesmo.First of all, Andy Samberg e Cristin Milioti estão excelentes e carregam o filme numa facilidade enorme. Todo elenco está muito bem, mas o carisma de ambos é contagiante e sem igual. Eles se dão bem em cenas cômicas, dramáticas e até mesmo profundas, porque o filme tem dessas e a abordagem da mesma traz um gosto agridoce muito bem balanceado.Os diálogos já são ótimos o suficiente pra te prender em tela. Todo o comportamento do protagonista já era peculiar, mas depois do plot, tudo vira de cabeça pra baixo. Lembro de me sentir surpreso, pois eu não sabia se o que está vendo era real - não ler a sinopse nunca foi tão bom. A dinâmica do longa muda, o que abre portas para um ritmo gostoso e ao mesmo tempo preocupante. O espaço dado as emoções de ambos foi o suficiente, inclusive, a cena de raiva da Cristin Milioti após ser presa é FENOMENAL. Eu amo vê-la atuar, e toda saudade desde HIMYM foi bem restaurada. E é claro que não posso deixar de citar a LEGENDARIA referencia a serie [no momento do primeiro tremor]. É um presente e tanto aos fans.O humor é bem versátil. Por vezes sutil, ou exagerado, em alguns momentos quase **** Por fim, eu amei e cai na gargalhada em vários momentos. Gostei muito da Meredith Hagner como uma patricinha antipática. Mesmo que seja um estereotipo, não significa que seja fácil de lidar. Não do modo como ela fez. J. K. Simmons é um ator marcante, e é sempre bom vê-lo em tela . Aqui o mesmo não decepciona.O trabalho referente ao enredo, quanto a parte de ficção cientifica, é bem adaptada. para evitar furos, o filme exige uma suspensão da descrença e algumas perguntas sem respostas. Comigo deu certo, além do mais, o filme nunca me prometeu isso."
    },
    {
      "rating": "9",
      "text": "A creative use of a familiar theme. The cast is great and Samberg & Milioti have great chemistry on screen, well done!"
    },
    {
      "rating": "10",
      "text": "This should funny from start to finish. I will give it a try. The trailer had laughing so hard. I would like to watch the movie now."
    },
    {
      "rating": "8",
      "text": "great comedy movie always love Andy Sandberg and really just brings this nostalgic feeling similar to watching groundhogs day for the first time"
    },
    {
      "rating": "10",
      "text": "I watched expecting a cookie cutter time travel movie, but I was wrong. The characters, story, and ending were all satisfying"
    },
    {
      "rating": "8",
      "text": "Takes a fresh and unique look on an overused plot and makes it surprisingly fun and enjoyable"
    },
    {
      "rating": "5",
      "text": "Holy Groundhog Day Batman!  I think the critics and us users are hard up for movies.  This ain't no 84/8.3.  This is a 50/5.0 at best.  Modestly funny, but I guess there's not much out there these days."
    },
    {
      "rating": "10",
      "text": "Hilarious movie! Funny from start to end. Definitely recommend it, has an amazing cast and great  chemistry between the actors."
    },
    {
      "rating": "10",
      "text": "It was really funny and really romantic or whatever. Honestly it may be one of my favorite movies ever lol"
    },
    {
      "rating": "10",
      "text": "Made me smile for 90 minutes straight. It's just the perfect romantic comedy."
    },
    {
      "rating": "8",
      "text": "A great script and a phenomenal acting chemistry makes Palms Springs work in all levels. Siara’s script makes use of the concept of time loop to explore the banalities of life. Nyles lived his looped life by just passing time, indulging into pleasure just to do it again the next day. In spite of having a life with no responsibilities at all, he felt lonely and tired thinking of what to do on his life in the present loop. Then, Sarah, having a problematic life of her own, got into the looped life and used this as an escape from her complicated life. The adventures of Sarah and Nyles in the looped life is definitely a dream for everyone. We all wanted to live a life with zero responsibilities but our characters would realize this is actually not how they can live life (or how we can live life). Nyles needs an emotional companion while Sarah has an urge to correct her wrongs (as she is always reminded by this whenever she wakes up from the bed of her sister’s soon-to-be-husband). While all of these are happening, we are presented to the side character of Roy. I think Roy’s take on the looped life is an opportunity to appreciate the things he never did before. He went from saying marriage is a bottomless pit of sorrow into realizing his kid watering **** as beautiful. He took a step back from whatever he is going through and just accepted life as it was and started appreciating every single detail his wife and kids are doing. But when he was informed of the possibility of getting out of the loop, he was ecstatic about it and for sure he would love to get out of the looped life because he knows how tolive his life. While for our main characters, they are unsure yet on how they will live once they get out of the loop but they have found each other in the loop and for them that is enough to live (which sounds really cheesy).The chemistry of Samberg and Millioti is phenomenal. I won’t get tired watching these two drinking booze, shooting guns, and dancing in the bar full of thugs. Of course, J.K. Simmons will always be brilliant in what he does (the getting high scene with Samberg is one of the memorable scenes in the film, that laugh in the tub is the best). This is definitely a great quarantine film. We are all like in a loop at this moment. We just have to spend it as fruitful as we can. Let this be a time where we appreciate our family and our blessings. Learn something new. Teach someone something they do not know. I think this is the meaning of life, being there for the people around us. It was never meant for isolation."
    },
    {
      "rating": "5",
      "text": "Brought very little new to a very well worn trope. Started well, but by half way through I was really bored."
    },
    {
      "rating": "9",
      "text": "combines two familiar premises in a refreshing and entertaining way. extremely relatable topics and characters. covers a lot of emotional ground without being preachy. watchable by the whole family and keeps you engaged throughout. highly recommend !"
    },
    {
      "rating": "9",
      "text": "This is a hit for me. Very funny and fun. Sandberg and Milloti have great chemistry. Bonus JK Simmons. Not a lot of fat on this, but plenty of heart. Tiny resemblance to Groundhog Day, but that's it.  Neat take on the loop trope."
    },
    {
      "rating": "9",
      "text": "The premise and entire aspect of this film can be summarized by one Question. 'What would Groundhog Day be like if you weren't alone?' What follows as the answer to that question is a heartfelt, deeply funny, and cathartic movie that acts as a deep drink of cool water in the barren hell of 2020. Now you've probably looked up this film by this point and there's one thing that probably sticks out like a present wrapped groin. When you think romantic comedy. Andy Samberg is not your first thought. Tom Hanks? Sure. Hugh Grant? of course. Matthew McConaughey? Not as of late but I'll give it to you.  But here we are...And he crushes it. He owns his part as a man aching to be free of this day, but nihilisticly embracing the lack of tomorrow. Now to be fair, the reason he does so well is that Kristin Millioti is an actual force of acting power. She displays emotion in such profound ways you can't help but emphasize with her character. Needing for her own personal hell of a day to come to some resolution. The script and cast work well together. Milotti and Samberg have such real chemistry it's almost more than just fiction, it's them. There are some parts that are foreseeable twists, and sometimes the directing reminds me of a student film, but if anything this adds to the charm of it. it never pretends to be anything more than it's not. It owns itself. it relishes in its moments of absurdity and basks in its moment of warm catharsis. Throw into that some classic J.K. Simmons with a wonderful ancillary plotline and you get a story that demands a repeat viewing. Just to hope if somehow you can relive watching this movie over...and over... and over... and over."
    },
    {
      "rating": "10",
      "text": "One of the BEST comedies I have ever watched. If you are a fan of the \"Groundhog Day\" film, you will LOVE this movie. Cast is great, the chemistry is well developed, and the comedy had me rolling start to finish"
    },
    {
      "rating": "6",
      "text": "Solid above average comedy that does elicit several good laughs, not just smirks of acquiescence. A rare commodity these days! It's impossible not to love Andy Samberg (who basically plays himself) unless there's something wrong with your soul. The production and all technical aspects are very professional and make this entertainment very enjoyable.It can't quite get into the elite \"green zone\" of quality because the script and side characters are typically Hollywood-simplistic, borderline dumb.It's just a nice little escapist distraction. Nothing more, nothing less."
    },
    {
      "rating": "9",
      "text": "This one is imaginative ,creative,fun, romantic and craziest entertainment. Brilliant screenplay from andysiara and assured direction from maxbarbakow.what a making ,tiny budget movie ,alots of fun and excitimentSparkling hilarious chemistry between andysamberg &Cristinmilioti ,they ruled,special mention to merdithhagner and JK Simmons is perfect.Overall palmsprings is amusement to enjoy at home"
    },
    {
      "rating": "9",
      "text": "A delightful, smart, heartwarming romp. Andy Samberg is phenomenal, Cristin Milioti is hilarious, J.K. Simmons is seriously silly. I smiled, laughed, and felt feelings for 90 minutes."
    },
    {
      "rating": "2",
      "text": "Fine enough as these things go, but a complete rip off of Groundhog Day.  Where Groundhog Day was purposeful - the Bill Murray character couldn't escape his endless cycle until he learned to stop being selfish and think of others, what exactly is the point of this story?  If the girl you love wants to blow herself up in a science experiment you should join her?  Sure it's fun to watch the characters drink, do drugs and find creative ways to kill themselves, but by the time you've seen it for the 60th time it stops being entertaining."
    },
    {
      "rating": "10",
      "text": "I f*ckin' loved it. , : & ... . , : & ... . , : & ... . , : & ... . , : & ... ."
    },
    {
      "rating": "6",
      "text": "Not sure where all these great reviews are coming from. Aside from a few good jokes and some above-average lead performances, nothing in this movie was really too special."
    },
    {
      "rating": "5",
      "text": "I can't understand the \"universal acclaim.\"  So disappointing.  It's not funny; I think I chuckled two or three times.  Nothing original here, with a concept that has been done so, so much better.  The writing in particular was mediocre, and the decent performances of both leads could not rescue it."
    },
    {
      "rating": "0",
      "text": "Great beginning, woefully bad for the entire second half. Such a waste of potential. How can you justify putting so much work and creativity into the excellent first half of this movie only to finish it with some bland romcom/\"qUaNtUm PhYsIcS\" deus ex machina garbage??? Not to mention that while the jokes in the first half have an 80-85% hit rate, somehow that number drops to about 10% for the entire second half."
    },
    {
      "rating": "2",
      "text": "(Mauro Lanari)The time loop itself has become a thematic loop (\"is it better to risk with the prospect of failure or settle forever in a comfort zone with no prospects?\"), and this variation on the subject is not particularly significant."
    },
    {
      "rating": "4",
      "text": "This is a fairly lazy sort of Groundhog Day type film about two people who find themselves living the same day over and over again. The main characters aren't very likeable and while there was the ocassional nice scene, most of it didn't really interest me. Its not really original (it definitely doesn't have the heart of Groundhog Day, which has always been one of my favourite films) and its certainly not memorable. There's not much I can say about it really...its supposed to be a comedy but it didn't make me laugh. There are people like JK Simmons in the cast but otherwise its not worth noting really - its mildly watchable I suppose but nothing else really. It could have been better but just wasn't. Maybe it says something about me that perhaps my favourite part was when the lady studied quantum physics in the diner, in an attempt to learn her way out of the time loop. I wouldn't recommend this, no."
    },
    {
      "rating": "9",
      "text": "Adam Samberg ( reminding me of a young Chevy Chase ) and Cristin Milioti charmed the complete pants off me in this welcome Groundhog Day inspired romcom. If you're looking for a funny date movie with a tight script and an 80s-90s vibe you just don't get anymore then this will definitely be a movie you'll enjoy living through over and over again - 9stars."
    },
    {
      "rating": "4",
      "text": "Considering it's Andy samberg not very funny, nor is the story or characters interesting or likeable enough to be fully invested. The only good thing about this movie is the directing."
    },
    {
      "rating": "6",
      "text": "clever romantic comedy with a 'flavour of the month' time loop conumdrum. time loop is this piece was quite relevant because it ties in well with the script. don't we all in long term relationship sometimes feel like we are in a time loop. everyday feels the same but why we still stuck together and maybe sometimes still love each other.catch it for the superb script and comedic chemistry. could not give it a 7 due to the superfluous vulgarity"
    },
    {
      "rating": "8",
      "text": "As raunchy and irreverent as Palm Springs is, the movie gets very serious when the questions about existence, solitude, and happiness arise. Samberg and Milioti are great together. Groundhog Day for the 21st century."
    },
    {
      "rating": "5",
      "text": "It's just a rip off of Groundhog Day, turned into a rather generically themed Rom Com. Someone thought, 'what if you were stuck in Groundhog day, but with someone you loved? Let's make a movie.' The writers went to the effort of doing their science homework, which is cute, but it's still predictable and dull. You know they're gonna fall out at some point and then make up. You know there's gonna be a big scene at the end with the guy making a lofty speech about his love. Funny thing is, the female actress doesn't really seem that into him. Kind of realistic at least, seeing as he's acting so needy."
    },
    {
      "rating": "8",
      "text": "Really good movie for a comedy, nice script, good acting, good pacing, good music. Wow, never thought I'd like it this much. Nothing earthshattering or anything but really fun to watch. Recommended."
    },
    {
      "rating": "6",
      "text": "“Palm Springs” is cute for sure, but I can't see myself wanting to sit through repeat viewings.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out."
    },
    {
      "rating": "7",
      "text": "This fun and offbeat comedy stars Andy Samberg as a laid-back guy attending a Palm Springs wedding who meets and hits it off with the maid of honor (Cristin Milioti). However, it's revealed that he's somehow been stuck in a time loop for quite some time, and has inadvertently trapped her in it with him. At first, I was a bit skeptical of this one, as I feel as though the whole time loop premise has been slightly overused in film and TV at this point. However, rave reviews, along with recommendations from friends and family finally swayed me into giving it a go, and thankfully I found it to be worth my while for the most part. It's not exactly a fresh take on the premise. Anybody who's seen films such as 'Groundhog Day', 'Happy Death Day', etc. are likely familiar with the tropes associated with the time loop subgenre, and they're all on display here (attempting suicide to try and escape the loop, living recklessly since the day will just start over tomorrow anyway, etc.) However, the film does carry a lot of heart with it, and the always reliable Andy Samberg and his comedic skills and timing pair great with Milioti's equally humorous performance. Their chemistry and onscreen antics are what really carry the film when all's said and done. Overall, it may be a bit run-of-the-mill as far as the time loop genre is concerned, but the charming performances from Samberg and Milioti made it just fun enough to keep me pretty entertained, and they offer plenty of laughs and fun moments throughout."
    },
    {
      "rating": "7",
      "text": "With a bait and switch start as what seems like a dramedy soon turns into a film that is basically a 'ground hog day' esque mystery/sci-fi with a day repeat loop. Fun to watch and some lol moments in here too. Watched it with my 18 yr old son and had a fun time. Nothing spectacular but we'll produced with an excellent cast and pacing/editing/soundtrack."
    },
    {
      "rating": "0",
      "text": "Never have I been as anxious to await a movie's ending as I was while watching this waste of good celluloid. This truly awful \"Groundhog Day\" knock-off, mixed with elements of silly sex comedies, kitchen table metaphysics, lame self-help suggestions and stabs at the kind of obligatory insipid dramatic sequences typically found in cheesy rom-coms, lost my interest about 10 minutes in and never got it back during its torturously overlong 90-minute runtime. It's truly astounding how this inane project ever got greenlighted and managed to attract performers like J.K. Simmons, June Squibb and Peter Gallagher (let alone capture multiple unearned awards season nominations), but I can honestly say that I never laughed once -- not once -- during this stupendously inept alleged comedy. The cloying, over-the-top performances of Andy Samberg and Cristin Milioti are headache-inducing and unenduringly annoying, making me wonder what anyone could possibly see in this cinematic monstrosity. I implore you to avoid this mess at all costs."
    },
    {
      "rating": "5",
      "text": "Fabulous soundtrack on this 'inventive' time loop comedy drama that is funny in parts and philosophical in other areas. It did get dull for me in the middle but the performances by charming Samberg and Milioti made up for it and I eventually finished it with a smile on my face. Still, not great. TN."
    },
    {
      "rating": "8",
      "text": "If you like Andy Samberg acting and jokes then for sure you will like this one too. I enjoyed it a lot, it maybe wasn't legendary comedy or something like Hangover or other movies like that in the past and I might give +1 higher mark because I like Samberg movies, but still, it was much better comedy than most in last years."
    },
    {
      "rating": "8",
      "text": "Pros: Great cast, good chemistry by the leads, engaging script, charming, twistyCons: viewers may be sick of time-loop movies by now, it could have explored the concept just a tad more"
    },
    {
      "rating": "8",
      "text": "Takes a well-worn concept and adds it's own creative spin to it. With surprising and gleeful wit and some brilliantly acted sensitive moments, Milioti and Samberg ace every scene. More than this, the great chemistry between the two leads is only matched by they're great solo performances. They're able to draw you into their personal philosophies in an engaging way which goes hand in hand with the brilliant structuring of the film. The writers time each new reveal to perfection and play off the tropes established by the granddaddy of time-loop movies - Groundhog Day. We understand the individual and conflicting perspectives but it also helps to create quick tonal shifts without undermining itself.This film really know how to have it's cake and eat it (in a time loopy kind of way).78/100."
    },
    {
      "rating": "8",
      "text": "Good movie for a lazy weekend afternoon. Like the cast had good chemisty together."
    },
    {
      "rating": "7",
      "text": "I have always been a sucker for \"infinite time loop\" movies such as \"Groundhog Day\" and \"Edge of Tomorrow\". So I was already thrilled to see this movie and it was getting a lot of praise from all the critics. There was just one problem I've had when thinking of watching this movie. I am not a big fan of romcoms... Let’s start with some of the praises I have with this movie. Firstly, one of the important aspects of a romcom is the chemistry between the two leads. In this case, Nyles (Andy Samberg) and Sarah Wilder (Cristin Millioti) have great chemistry that is charming and effective. There are so many great moments between the two and seeing both of them perform silly antics such as a well-choreographed dance number is funny yet heartwarming. There are also strong performances from the supporting cast who play annoying over the top people to the point you can sort of see where the main leads point come from. Roy (JK Simmons) is the most relevant supporting cast as he is the third time looper and it is great to see him give a more wacky performance but I do feel he is sort of underutilised. Although, the main focus is on the main leads and in that case the lack of focus on supporting characters works in the movie's favour. Another praise is that they found a unique way to tackle the time loop genre that differentiates itself from the other time loop comedy \"Groundhog Day\". Right from the get-go, it is obvious to us the audience that Nyles (Andy Samberg) has been in a long time loop and we are not learning about the loop with him but from him. Additionally, having multiple individuals in the time loop together allows for it to go in a unique direction. The director and writers utilising the time loop to show the relationship between the main leads developing and growing as individuals is fun to watch and sincere. They also use the time loop to as a plot device for surprise twist and revelations and the film certainly has a lot of great twists.Now onto flaws of the movie and the first comes straight away in the first 10 minutes and it is how raunchy it is. The trailer for the movie made it seem like a sincere and heartwarming time loop romcom, which it is to be fair it is, but this movie is extremely R Rated with it's over the top sex scenes that made me question if I was even watching the movie that was advertised. It gives a wrong first impression of the movie and I honestly wouldn't be surprised if someone stopped watching after the first 5 minutes because of how stupid and unnecessary these scenes are. I finished the movie and I still didn't get what these added to the movie. The answer is that it didn't and I question why they thought it was a great idea.The second flaw I have got to say is that this movie is defined as a \"romantic comedy\" and there are a lot of great romantic moments but honestly no moments that made me laugh out loud. They do a fair amount of \"The Lonely Island\" raunchy sex jokes but even then I still didn't find it funny. I got a couple of chuckles in some moments but none stuck out as memorable in the comedy department.  Overall, it is a surprisingly very good movie and I thoroughly enjoyed it but not to the extent of how everyone in the media felt about the movie. The most important aspect in a romance movie is to get the audience to root for the main couple and this movie succeeds in this case.  The movie is a great time if you ignore the first 10 minutes and you will no doubt come out enjoying it."
    },
    {
      "rating": "8",
      "text": "a very funny and also emotional movie with a very interesting story and good character."
    },
    {
      "rating": "8",
      "text": "A very refreshing take on the romantic comedy. The leads here are excellent. Andy Samberg and Cristin Milioti do an excellent job portraying these characters with imperfections who learn to love each other through a weird situation. They both have excellent chemistry as well which really contributes to romances in general. The other performances are all right except J.K. Simmons who I also felt was excellent here. The film has some issues in pacing and some of the effects but it’s so investing and entertaining. Most time loop movies take themselves seriously sometimes with the exception of this and Groundhogs Day. Palm Springs understands how dumb these movies can be and goes out of its way to be funny and most of the time, the humor works. For a first feature, Max Barbakow knocks it out of the park with his direction. It’s well written and well shot with plenty of interesting ideas about how we live our life and love. Check this out on Hulu when you get the chance."
    },
    {
      "rating": "8",
      "text": "A movie with a simple plot, maybe cliché, but it is a clever comedy with great actors."
    },
    {
      "rating": "9",
      "text": "Palm Springs review:Max Barbakow’s new Groundhog Day inspired Rom-com is a fresh new take on the pre established formula. Cristin Milioti’s Sarah falls victim to an infinite time loop on the day of her sister’s wedding. The unique twist to the genre is that in this case she is also trapped with Andy Samberg’s Nyles, who has been stuck in there so long that he doesn’t remember much of his life beforehand, and together they try to find meaning in a reality where their actions are meaningless. The movie definitely has some quality moments of comedy, but underneath all the laughs it is a poignant reflection on life and depression. Whilst a huge part of this movie is obviously derivative of Groundhog Day, like other movies of the genre (for example Edge of tomorrow), it does enough it terms of originality and sheer enjoyment to stand on its own. If I delved into all the individual aspects that made this feel unique I’d have to spoil the entire movie. Both Samberg and Milioti are phenomenal, and paired with some really sharp dialogue they are a both convincing and hilarious duo. Of course there are also moments of sincerity, and both actors pull them off perfectly. In Samberg’s performance especially he shows many hints of sadness and misery, whether it be subtle or at other points straight up breaking up into tears. I’d say my one issue with the film is that at times the there is a bit too much exposition, and some of the supporting cast feels a little bit lifeless, but as the focus is almost exclusive to the two protagonists it doesn’t really matter all that much. Ultimately Palm Springs is an enjoyable ride from start to finish with some excellent humor and a unique take on Groundhog Day’s ideas, and although it borrows greatly from the 1993 classic, It does enough to separate itself from the other movies of the genre."
    }
  ]
}