{"id": 3375, "title": "Pan", "starring": ["Levi Miller", "Garrett Hedlund"], "runtime": 111, "genre": ["Fantasy", "Adventure", "Family", "Action"], "description": "Living a bleak existence at a London orphanage, 12-year-old Peter finds himself whisked away to the fantastical world of Neverland. Adventure awaits as he meets new friend James Hook and the warrior Tiger Lily. They must band together to save Neverland from the ruthless pirate Blackbeard. Along the way, the rebellious and mischievous boy discovers his true destiny, becoming the hero forever known as Peter Pan.", "releaseYear": "2015", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/cjcrkPeQkrkEVYrd3lHWJbfBdrv.jpg", "categories": {"plot": 4.39622641509434, "acting": 4.7073170731707314, "ending": 7.571428571428571, "soundtrack": 5.666666666666667, "cinematography": 3.6666666666666665, "familyFriendly": 6.2, "funny": 7.0, "action": 5.833333333333333}, "reviews": [{"rating": "5", "text": "Pan is an oddly boring take on the Peter Pan story. The only fun things about the movie were Hugh Jackman, some fun vocal versions of famous songs (though I suspect Kurt Kobain is writhing in his grave) and Smee. Otherwise, Pan is pretty generic from start to finish."}, {"rating": "6", "text": "While this is not one of the best films in the Peter Pan series it is however not a disaster.  I admit that when I first heard the use of Nirvana and The Ramones, I had very little in the way of happy thoughts.  In the end I accepted those things as minor in an overall middle of the road film.  I've seen worse.  B-"}, {"rating": "7", "text": "Much better than the review scores reflect. This movie is ridiculous in every way and it was done on purpose. Every part is overacted; every scene overwritten; there is fan service everywhere and it worked because the movie does not try to take itself seriously and it is meant to be a modern light hearted fun time.\r Yes, they use cliches and yes the ending is sappy and silly but then again look at the subject... we are talking about Peter Pan. This is not the Hunger Games which became just as ridiculous while trying to be serious. This movie worked just like Hook worked in the past and like Hook it is a coming of age story albeit Hook was sort of a regression of age story. I like how this movie portrays the origins of Peter Pan, it was something I had not read or seen before so it was a pleasant surprise. I also like the fan service, I dont know when Nirvana became uncool, but it was so out of place (ridiculous) that it made the scene memorable. I really like the actor for James Hook and I like how they interwove these two classic characters in a way that makes their later stories have more intrigue. Before this movie no one really knew what the relationship was between these two character and if you apply this movie to the originals, it gives it some meaning.\r Overall, this was a fun movie. I am going to go against the trend and give it a solid 7. 2 points higher than average. There were some problems with the movie. I actually did not like Peter Pan very much and I am unsure if it was the script or the actor that made him seem too \"emo\" for lack of better term. It was almost like he was bipolar, one minute he is an emotional wreck and the next he has a wide smile. One second he is crying and the next he is is ready to lead an army. Everyone else did a better job."}, {"rating": "6", "text": "To be honest, Pan surprised me greatly.\r Going into the movie, I wasn't expecting much... in fact, I was expecting it to be crap! I only went in because of curiosity. However, although it had many irritating problems and not the most original storyline, it was an enjoyable film all in all. Not a movie I'd see over and over again, but would recommend to anyone who's into this kind of flick."}, {"rating": "8", "text": "In its first quarter I saw what most people had been saying it was dull and bad-ish,but during it second quarter it completely transformed.I went from loathing it to loving it.Its no where near perfect but the climax is nowhere close to being bad.the British since of humor is killing it in the States but all I can compere it too is to a doctor who Christmas special that starts of sloppy but ends up pulling your hearts strings and taking you on an adrenaline filled fun ride.Levi Miller is Peter Pan.Hook starts annoying but ends up having a Lando Calrissian sensibility.Rooney Mara really holds the movie together.Hugh Jackman's Blackbeard is the mesh between a 1990s cartoon villain and a Shakespearen tyrant.The movie does have flaws but the fun of this world dwarfs them.coming out of the movie I realized something,this film will do better over seas and the reasons why Americans will hate is because they don't understand British sense of humor and this film is very British;if someone in the film had a cape or if tiger lily had a catsuit but every thing else being the same the film would do triple in the box office but American audiences don't like magic If it isn't explained by a wide cracking Robert Downey jr using fake science. The film will suffer from critic bullying like Man of Steel,like Tomorrowland it's sad that film criticism came to that where they even wish a film tanks,without realizing that many people will rely on it making money to keep working.I hope everyone gives Pan a chance. BTW time doesn't exist in \"Never\"land so yes Blackbeard does like the Romeos because he says it himself,he can travel to any area.Please go Watch Pan."}, {"rating": "8", "text": "My family loved \"Pan\". Even my 3 year  completely fixated and sat still the whole time. The movie is a steady stream of non stop action, the film doesn't rest as it unrolls the adventure .  True to the canon, this prequel supports the other stories in the Peter Pan genre and shows one of the major characters in a different light, yet still sets them up for a major transformation in the future. I have to admit that the two pop songs were odd and it think they were making the miners sing to show their enslavement. Mainly, I feel the film holds up, is theater-worthy, and follows a logical flow, OTH, I think the poor reviews come from people outside of the \"Family\" target audience.\rOur favorites were Princess Tiger Lily and the Crocodiles. Everyone in my family felt that Levi Miller was a fitting and captivating cast as Peter."}, {"rating": "3", "text": "Nirvana - Smells Like Teen Spirit in a Peter Pan movie? What the f**k!.\r The story is about a young orphan boy finds himself taken to the magical world known as Neverland. Trouble and adventure await the boy - a boy who will one day become the one and only Peter Pan.\r So I've just seen Pan a few days ago and I was quite shocked of how bad this film was. This might be the most disappointing movie of the year for me, because Pan was my most anticipated movie of 2015... and it fails to live up to my exceptions.\r Levi Miller did a decent job playing Peter Pan in the movie, I mean he's really trying here and I can see that from him. This is he's first big motion picture film and it really dose show. He didn't do a terrible performance like most kid actors, he did alright for what he had to work with.\r Now Rooney Mara is a great actress and she has shown us that she has talent, but here I felt like she was really miscast. I never brought her as this character and I found it kinda strange that she cast as this character in the first place.\r Garrett Hedlund as Captain Hook dose what I call a \"teeth talking performance\", and what I mean is that he shows his teeth a lot to deliver dialogue. Oh and he also sounds like Jack Nicholson mix with Daniel Day-Lewis in There Will Be Blood, it get's freaking annoying after awhile.\r Hugh Jackman as the villain was really over the top and really cartoonist. Jackman is so much better than this.\r The movie lacks on character development, the story isn't interesting, the movie felt rushed at times and the cgi in this movie looks unfinished. Seriously, the effect's in the movie look so fake and very noticeable that it's Fant4stic level bad when it comes to visual effect's.\r Overall Pan was a giant mess of a film. Hook (1991 film) was way better than this movie. I wanted to like this movie but I couldn't bring myself to say that this is a \"good movie\", because it's not. As a person who grew up on Peter Pan I couldn't stand this movie."}, {"rating": "10", "text": "A lot of imagination went into making Pan's origin story. It can be a dazzling experience. One that's a heck of a lot of fun if you let yourself get lost in it's world. There are a lot of exciting things to behold.\r With bright colors, bonkers moments, and great CGI it's all a sight to behold. The writing itself holds up well. Peter's lack of faith in himself is perhaps familiar, but I was still invested in it every step of the way. The movie also manages a great sense of humor and some emotional moments regarding Peter's mother. The only thing missing is watching Hook becoming the villain we know him to be.\r The cast is fantastic. Levi Miller is a talented young actor. While odd at first, the Indiana Jones vibe Garrett Hedlund brings to Captain Hook is an interesting take on the character. One that is ultimately likable. The real star of the show though is Hugh Jackman as Blackbeard. His eccentric performance is a blast. He is clearly having fun in the role and the movie is all the better for it. He plays a great villain.\r The movie serves as a great way to bring Pan's magical world to life. With hilarity, heart, and crazy moments it's a spectacular and thrilling movie. One that's perfect for families and does the classic story justice. A movie that's just all around wonderful."}, {"rating": "4", "text": "This Peter Pan prequel starts with the boy as an orphan who's whisked away by pirates in a flying ship to Neverland, where he encounters the major characters that make up the myth: Tiger Lily (Rooney Mara), James Hook (Garrett Hedlund) and Blackbeard (Hugh Jackman). We've become so enamored of dazzling special effects that the visuals here, even though beautifully designed, never capture the imagination. The continuous action is energetic, but not really exciting and the performances vary from weird (Jackman) to downright hammy (Hedlund). Dramatic director Joe Wright is literally out of his element with this big adventure. The most compelling moments are the early orphanage scenes. Otherwise, it's launches like big-budget, but never realizes the flight of fantasy."}, {"rating": "8", "text": "This new adventure of Peter Pan is something you've never seen before. As a prequel, it's a charming, exciting and superb adventure that introduces us to the story created by Barrie a long time ago. Interesting and funny characters, an amazing cast to play them and a wonderful world to captivate us. Neverland is a fantastic place, full of fairies, flying ships and a villain who sings Nirvana and Ramones with his kids. Visual effects are incredible and the 3D makes us feel like we were there. For families and fans of the genre, Pan is a great adventure, which was actually a great surprise to me. I was never a huge fan of it and this film made me fall in love with this story."}, {"rating": "6", "text": "Cruising through gorgeous visual and beautiful shanties, but unfortunately also on shallow narrative.\r Pan bears a lot of similarities to other adventure films, family animation and even role-playing games. It packs myriad of visual antics across the journey of self-discovery. However, it's also painfully one dimensional and predictable, using the “chosen one” plot to a fault. While it's admittedly aesthetically pleasing, this is not the innovative origin story it's advertised to be.\r In a world tormented by pirates, one child must discover his destiny. You’ve seen this before. Some angles have been changed, but this is typical Peter's adventure to Neverland. It's so overused, one might find half the script in Final Fantasy games. Not to mention it's riddled with fantasy genre cliché and uninspiring romance subplot.\r To their credit, the actors do a fine job. Hugh Jackman as Blackbeard is a good antagonist, he looks the part by carrying the character with ominous charisma, either it's by his flamboyant dialogues or even timely singing. He can appear funny yet still threatening. Well, as threatening as a villain in family flick can be.\r While Blackbeard looks fit for Hook's replacement, Hook himself is played by Garrett Hedlund, who ironically tries too hard to be young Hugh Jackman. His delivery is forced to create a suave persona, but most of the times he just looks out of place. Levi Miller as Peter handles himself pretty well. The story focuses heavily on this boy's fate, and although he can seem rough at some scenes, he brings a commendable performance as the lead.\r Graphical prowess plays important role, almost too much, and on its better parts Pan definitely has the stylish charm of fantasy vista. Setting is filled with colorful designs and details, although CGI takes the helm on most cases. Its soundtracks are splendid, it simply doesn’t let go. From subtle chimes, loud symphony and even shanty version of popular songs, the audio is brilliant.\r Pan would've been great if it didn't copy so many elements from other movies. In nearly every scene, there's a hint of Pirates of Caribbean, Mad Max and multitude of classic Disney flicks. The straightforward plot doesn't help either, it's tedious to see the predictable developments ahead. Ancient prophecies, letter from the past and hidden power manifestation are tired gimmicks. Please, you know he's gonna fly at some point.\r For a movie that looks so appealing, Pan never really takes flight. One might find happy thoughts on the visual and songs, but the CGI charm and adventure gimmicks will not last through its boring plot."}, {"rating": "0", "text": "I absolutely hated the movie, the characters were recycled trash, the storyline was bad and I honestly just wanted to kill myself through the whole thing. Not even bargain bin worthy. Pathetic excuse for a movie."}, {"rating": "3", "text": "Pan isn’t the worst film I have seen this year, but that doesn’t change the fact that it’s not very good at all.  The characters don’t feel recognisable or endearing.  The plot is really too over complicated for what it is supposed to be and never really feels like a Peter Pan film until the last 10 or 15 minutes and it’s plagued by some horrible miscasts!  It really feels like a giant missed opportunity because I think this generation is ready for a good Peter Pan story, but this really doesn’t work and will likely sink the character for quite some time.  Warner Bros are clearly intending for this to be a franchise starter, but this is such a lazily put together family film that I don’t think it will endure any sequels, this really felt like a get them in, get them out movie and the only thing it had going for it was the fact that the film had a well designed version of Neverland.  That is it!  The rest of the film is a drag and it feels incredibly boring to sit through and that’s saying a lot considering this film has a fight scene between a Spitfire and a Flying Pirate ship.  How do you make that boring??  Oh, and whoever suggested putting Nirvana and The Ramones into this movie in the way they did, really needs to rethink their line of work!"}, {"rating": "3", "text": "This movie has some great music, but that's about it. Pan has some of the worst special effects of the year, along with a cliché plot, an inconsistent tone, and a poorly written script. It also manages to contain one of the most over-the-top annoying performances of the year from Garrett Hedlund, as well as the worst use of Smells Like Teen Spirit and Blitzkrieg Bop in any film ever. Yeah, this movie sucks."}, {"rating": "4", "text": "\" Pan \" it was not entirely wonderful film for two reasons :\rOne: The Distributor assumes that the characters of Peter Pan and Disney were not of Warner.\rTwo : The film at first said that history ofa child who would not grow , a country where there are crocodiles , mermaids and fairies are counted , but worse part where Hook friend turned enemy is there , but throughout the film only were friends , maybe we demand a sequel."}, {"rating": "7", "text": "A couple of problems but it's much better than the critics say. The biggest problem is that it gets a bit CGI-heavy towards the end. But still, it was certainly enjoyable. The cast were great. I especially liked Garret Hedlund's performance as Hook-he had a kind of Han Solo feel to him. Another thing I liked was that they finally offer an explanation for why Hook and his crew are adults if Peter and the lost boys never grow up (that was something that had always confused me about the Peter Pan story. Overall, an enjoyable film for fantasy fans, and a very underrated movie."}, {"rating": "2", "text": "Hollywood needs to stop trying to make origin stories, Pan is proof of this. I haven't seen a film this messy in a while.\r To start with, there's the acting. Hugh Jackman's Blackbeard must have been pulled straight out of a pantomime, it's the only way to explain his hammy performance. Levi Miller does try his hardest as Peter, but thanks to the script I was rarely convinced he was Peter Pan. This movie's Hook, played by Garrett Hedlund, seems more interested in trying to be a discount Han Solo/Indiana Jones type than anything else. Finally, there's Tigerlily. Considering the weak material she had to work with, it ultimately wouldn't have made a difference who they casted as Tigerlily, but they casted Rooney Mara nonetheless. As well as being as much of a Native American as Columbus was, Mara is utterly bland and forgettable.\r Now, for Pan's humble origins. Or rather, not so humble. See, Peter couldn't just be an ordinary child, whose vivid imagination makes him able to fly, and whose daring, cocky attitude prompts him to oppose Blackbeard. That would make him a more relatable character, so instead he's the son of a fairy prince - which is why he can fly-, and as a consequence is the chosen one, destined to kill Blackbeard. Thank you, Hollywood, for once again giving us the type of tripe that messed up characters such as Darth Vader. For once, wouldn't be nice if the protagonist was simply your average joe that grew into greatness, rather than being born into it?\r Aside from that, the rest of the adventure is rushed. Not enough time is granted to consider what's going on as they hurry through each scene. Perhaps they're too busy trying to escape the mismatched soundtrack, particularly after a bunch of pirates chant \"Smells Like Teen Spirit\" roughly 50 years before that song was released (while led on by a pirate who died over 200 years before rock music was a thing). There are a couple of thrills here and there, but you never get the feeling that the heroes are ever in danger. It's hard to tell whether this is down to them being stock threats employed in a number of better films, or the extensive use of obvious CGI.\r At the end, Peter claims to Hook that nothing will ever go wrong, hinting at a sequel. But it already has, especially if the box office is anything to go by. A poor retelling of a classic story."}, {"rating": "0", "text": "Pan It's Wrost Film Of 2015 Ever Everyone Hate This Movie Butt Actor Is Good But This Film Sucks. See This Film On Trailer Going See Minions With My Dad But This Filn Is Awful!!!!!!!!!!!!!!!"}, {"rating": "2", "text": "\"Pan is atrociously acted and damaging on the eyes. There are some occasions where the visuals are impressive, but most of the time they were hideous and ugly. The writing and directing are awful and destroy the movie immediately. It is a structural trainwreck and makes no sense. The random inserts of \"Smells Like Team Spirit\" and \"Blitzkreig Bop\" are extremely off putting and illogical. \"Pan\" is the most disappointing and one of the worst movies of the year. Stay away at all costs."}, {"rating": "0", "text": "The narrative is super annoying and spoils the mood. I thought at first it was a glitch in the audio or I accidentally turned on some sort of audio subtitles or something but it turns out it's part of the movie. Seriously it is annoying and spoils the entire movie. I didn't watch it full cause the monotonous narrative is enough to piss me off & ruin the show. Seriously if they want to include a narrator for the entire length of the movie, considering hiring someone who has a better voice like Morgan Freeman."}, {"rating": "2", "text": "Pan lacks all of the whimsy and joy that makes the classic story so great.  Instead, we get a dark, unenjoyable, barren of comedy storyline with horrid dialogue and crap performances from everyone with the exception of Jackman.  The CGI is annoying, the whiny, mopey rendition of Peter Pan by Levi Miller is even worse, and the absolute mess of a plot is even worse than that.  Pan is the origin story that no one asked for, and is thoroughly unenjoyable from start to finish."}, {"rating": "3", "text": "Yeah, Pan is such a huge disaster. For a brief moment, I had high hopes for this movie to be the best adapted Peter Pan movie ever. But then, they chose a great director at the wrong time. The casting is awful. Hugh Jackman as \"Blackbeard\" should've been the idea choice since Geoffrey Rush's performance in the Pirates of the Caribbean movies. Rooney Mara as \"Tiger Lily\" is just terrible. I was so offended and confused on why she chose this role as a \"female Indian/Native American princess\" in the first place. I didn't see this movie very often. An origin story that (ironically) wasted too many lines, CGI-action sequences just happens to be a poor man's \"Avatar,\" and zero character development. It gets even worse. In the movie, Blackbeard sings to Nirvana's \"Smell Like Teen Spirit\" and turn it into a 45-second rendition of the Macarena. Really? Are we really f***ing stupid, Warners? Kids wanted to see a fairy tale adaptation of a beloved film that Disney is now on a role right now. I'd rather watch Peter Pan Live! once again. But stay away from Pan."}, {"rating": "1", "text": "Of course we must make it dark and gritty. How else its going to sell? Well guess what. It didn't. You know why? For starters Altering the story to what it was. why in hell Peter become friends with Hook at the end? Why Peter has a prophecy behind him? I guess he was supposed to bring balance to the force, if you catch my drift. Then we have the rest. Its devoid of action or any sort of humor. It was boooooring! I guess you could say that this movie was critically PANned"}, {"rating": "1", "text": "I went to see Pan with the small hope that It would be better than expected...I was completely wrong...The film is stuffed with unfinished CGI and poor acting, Hugh Jackman looks like some back up dancer for lady gaga! and the rest of the cast truly fails to live up to the legacy of Hook and Peter Pan....I went home and watched hook after that and was truly amazed of how bad CGI really is compared to Animatronics or puppets....In short...who the **** wants to see a prequel to Peter Pan??? I am glad to know that pretty much no-one dose..."}, {"rating": "5", "text": "Pan,\rHad its major issues yes, I don't think its a good children's film, although the violence is not gore it is still pretty jarring. Not slap stick jackie chan or even johhny dep pirates but sorta dark and disturbing.People being dispatched and rather than gore they turn into puffs of smoke is still dead sorta obfuscating genocide, probably not great that you cast tiger lilly as a white actress.\rIf they would have just committed to being a musical and going into a wild pop up book story , with song and dance and wacky violence were people get punched and battered but no one dies, but no they wanted to be a grimms meets classic modern musical meets john wayne meets a pirate movie.\rOther wise a chance to turn off the old brain and watch a show."}, {"rating": "7", "text": "I could not believe that Hugh Jackman was in this film. At the end I saw his name and was utterly incredulous, so I think his performance in this must have been very good! After finding out that he was Blackbeard I understood. I really liked that character, he had a lot of gravitas and his introduction was very cool.\rThat is pretty much the highlight of the movie for me.\rAll through the film, all I could think was \"stop playing that 'Lord Of All Hopefulness' song, please!!\" . It seems like that tune is played continuously throughout the entire movie. At times when they aren't playing that tune, the music is so rowdy and noisy that I found it difficult to really go with the flow. Simply put, the score ruined this movie for me. I think if they had better sound in the film, I might have enjoyed it a lot more.\rStill, I did enjoy it.\r Best part about this was my mum really enjoyed it and she couldn't have gone if I hadn't gone with her so that made it worthwhile!"}, {"rating": "7", "text": "I personally liked this movie quite a lot, though the errors every single critic and viewer have been bombarding on are very notable. I thought it was going to flaw the entertainment of the film, but I thought wrong: the film kept me on for quite its run time. Its cliché story, its momentary unusual dialogue (Yeah We're Sailing Now! [5 seconds ago, the dude didn't know how to steer the ship wheel]) and quite awkward characters are compensated with great music (the \"Smells like Teen Spirit\" scene made me feel uneasy because of its incoherence with the plot at first but the energy that bristled from its performers made up an amazing scene to watch and later made me feel energetic), great special effects (yes, I did like them) and beautiful visuals, sets and costumes. Hugh Jackman seemed to be having a blast doing Blackbeard, Hook (dude has the weirdest accent ever guys) and Tiger Lily were alright, Peter was cool. I don't have all the problems everyone's having with this movie, yet the flaws, I repeat, are very noticeable. But overall, it's a pleasant watch."}, {"rating": "4", "text": "Fun at first until you understand that it's not true to the books, but borrows from Hook. There is a scene where the cast sings a Nirvana song, yet the movie is set in WWII, while the play and book were written in 1904 and 1911 respectively. Basically none of it makes any sense. There was also a white girl cast as a native. The whole thing was a big mess, but looked cool."}, {"rating": "2", "text": "I dont understand how can they can make such a bad, cheesy movie. Its one of the worst movies of the 2010's, I dont get it, how, how can you waste so much money on such a bad movie?"}, {"rating": "3", "text": "An interesting Peter Pan adventure just got turned into a pointless prequel nobody even wanted in the first place. It should've been better than what they've done with the movie."}, {"rating": "6", "text": "Its when Peter stepped into the Neverland for the first time.\r Usually everyone loved growing up watching the various film adaptations of original work by JM Barrie's a century old creation, 'Peter Pan'. There are plenty of unofficial prequels and sequels were also made and met success. Yet this prequel with high budget and modern technology, but not a Disney film, generated some expectations with stars like Hugh Jackman and Rooney Mara in it.\r The box office was not as expected, and the movie was also just above average, but I liked the performances and visuals. The story is about an orphan Peter who becomes a Pan, a leader to 'the lost boys'. The opening line goes like this: 'Sometimes friends begin as enemies and enemies as friends' and that's what the rest of the movie evolves.\r I don't think I liked this story. In all the prequels, I loved the Nick Willing's 'Neverland' who is a master of prequels to all the greatest fairytales. I disappointed with this only because of lack of the depth in narration, short storyline and quick scenes, other than that it was not a bad flick to me. The main relief was, it was not like the recent 'Alice in Wonderland' style movie with the weird costumes, makeups and the character physiques.\r Despite all the negative feedback for this flick, I feel it won't hurt for a one time watch. My eye is now on its sequel, because before the Wendy's introduction there's another story is to be told and that is between Peter and Hook. But now it's on doubt over the result of this movie. Anyway, I'm on for it and hope it only gets better than the original.\r 6/10"}, {"rating": "2", "text": "Holy Sh*t, This one was a stinker. This is easily the worst film of 2015 for me. The only redeemable qualities are Hugh Jackman's performance and the so bad it's good performance of hook. Aside from from that, the visuals are garbage, the story is complete trash, it hurts to look at, and Rooney Mara as tiger lily? probably the worst casting choice since George Clooney as Batman all the way back from 1997! Where the filmmakers smoking the devil's lettuce? Don't watch this, don't show your kids, your pets, your coworkers, your boss, or even your worst enemy this abomination."}, {"rating": "5", "text": "Not the best movie, but I think for kids it might be quite interesting and also I loved the soundtrack and how it was put into the movie. Overall though, quite simplistic movie."}, {"rating": "6", "text": "This movie was enjoyable.  I would like to first say that I enjoy the story of Peter Pan in all aspects.  The movie starts out with Peter getting taken to Neverland.  It explores his relationship with Captain Hook and how he met Tiger Lilly.  While taking on Blackbeard.\r The special effects are tremendous as you would expect and Neverland appeared fresh, colorful and imaginative as it should be. The acting was good but I did find it hard to get emotionally attached to the characters.  While I enjoyed myself watching the movie it did in parts drag a bit.  They left open an opportunity to make a second Pan movie and I hope that they do."}, {"rating": "8", "text": "I don't know why people don't like this movie,it is very very good and it has some incredible scenes.There isn't much to say about this movie but it was decent."}, {"rating": "9", "text": "I don't know why this movie is getting such bad reviews.  My wife and I both loved it - from the sets, costumes, special effects etc. to the music, most of the acting, the plot and story were fun.  It reminded me of big, exciting movies from when I was a kid.  A really good time to be had watching this one!"}, {"rating": "7", "text": "I had very low expectations about this movie but I was wrong....not bad at all.\rIt has great costume design, gorgeus visual style, it has a little bit of Baz Luhrmannesque music and colors in it, good action scene.\rIt is a little too long but i reccomend it expecially if you find it in some special cinema promotion."}, {"rating": "6", "text": "This Story An Young Orphan Find His Selves In Never land The Costume Designs Was Great The Acting Was A Bit Good The Writing Was Good The director Joe Wright Did An Good Job I Only Gave it 6/10"}, {"rating": "5", "text": "Pan shows a thin beginning for an inventive legend that everyone loved. It is also magic and hypnotic stunts for put the audience in shock, but it fails talking about magic, with illogical story-telling and down-beat results. Viewers may also be bored."}, {"rating": "3", "text": "Lo único bueno de esta película es su cortina musical, la verdad que es muy mala e innecesaria."}, {"rating": "5", "text": "This rendition is decent, there has just been so many Pan movies that I am kind of over it. I found that I wasn't paying all that much attention when the kids were watching it. I liked it enough though."}, {"rating": "9", "text": "I love this movie. I love the concept of a darker Peter Pan story, I love the casting (Garret Hedlund was amazing), I love the tone, and I love the way the humor can be toned down enough so it's darker, but not too much so it's not joyless. The end leaves something to be desired, but that's the only bad thing I can say. I love this movie! 9/10"}, {"rating": "8", "text": "But it is not enough to say Pan is not the hack job it could have been. There are moments are sheer brilliance in Pan. Hugh Jackman's entrance into the massive pixie dust mine, where he is greeted with a haunting rendition of Nirvanna's Smells Like Teen Spirit, or a later scene between Peter and Blackbeard in a shroud of orange sheets are, dare I say, visionary."}, {"rating": "3", "text": "The first 30 minutes are promising but then it turns into a movie that anybody over the age of 12 cannot enjoy it anymore. Hugh Jackman as blackbeard does not work."}, {"rating": "7", "text": "I quite enjoyed this film from the story to the visual effects to the fight scenes, both when I saw this in the theatres a week or two after it came out and a few minutes ago when I just saw it for the second time. Although the first 30 or 45 minutes were way better than the rest of the film I still enjoyed this film as a whole."}, {"rating": "4", "text": "Pan is a well-made film, but that does not mean it's good, because although the direction is not bad, the film never feels like a complete and complex entity, there are failures and they are several so it's unlikely to ignore them.Perhaps the most significant thing is that the film feels like a collage of intentions rather than a molded and delivered film.I do not recommend it."}, {"rating": "2", "text": "to entertain the audience..Pan Pan is a plot driven adventurous drama about a twelve year old orphan entering a magical world and claiming his legacy. The feature is a disaster from the first frame to the last one where its existence itself is questionable. Wright behind the whole extravaganza doesn't seem himself at all. The whole set of the feature looks like a big old prank to the viewers, makers, actors and all the others involved in it. The set pieces looks clearly fake, the production design poorly created, the costume design is juvenile and so is its art designing. The background is daft, the cinematography is almost a cruel joke with poorly handled camera work and amateur editing. The entire feature is an embarrassment from head to toe on terms of art and craft and any other claims that it might suggest. Being mutilated on technical aspects it doesn't suggest in any way, that the heart of the feature is at the right place. The cast too attempts to dive in with all their chips in but there isn't much range offered to the characters for them to factor in effectively. Jackman delivers at times, but for the rest of the part, he too fumbles. Mara clearly doesn't belong in such a theme and tone of the feature, she still somehow manages to deliver in such a dull environment. The narration is benign and unnecessarily loud with commercial aspects that reeks to the core and shucks away not only the originality of the concept and the somewhat creativity installed in it, as it spends most of the time on offering the material on a grand scale as much as possible but unfortunately the content like such wouldn't have worked in any way especially when it's crafted out like such. Pan is a huge slap on the face even commercial cinema as it even fails to entertain the audience."}, {"rating": "5", "text": "This is an easy to watch entertaining family film. Its mostly a family film, although I would warn that there are some scenes featuring the villain, as well as some potentially mildly frightening environments, which may scare especially young viewers, hence the parental guidance rating it received in the UK. I'd reckon its ok for kids maybe 9 or so years old or older, at a guess. As a piece of imaginative fantasy its ok. It is certainly pretty imaginative, however I wasn't entirely impressed with the CGI - the quality wasn't quite up to the same par as what I've seen possible via other modern films. I dont know whether this was made on a much lower budget or not - its not awful but I just felt it wasn't quite as realistic as other films have seemed, such as Avatar for example. Of course Neverland is a made up place and as such isn't meant to be realistic, thats not what I mean though. Some of the backdrops look pretty good, while other aspects seemed distinctly artificial, such as moments when the real life people are interacting with CGI.I felt some of the acting was a bit over the top too, for example Blackbeard when he's shouting out, making speeches to the masses below and that sort of thing. Blackbeard is played by Hugh Jackman, who is certainly a good actor but perhaps the script wasn't ideal for this. I suppose some young viewers may quite like the over exaggerated (over the top) booming voice attribute, so you could argue either way with that aspect of it.There was one piece of dialogue that made me smirk and I thought I'd share between I think Hook and Peter - 'those savages? I certainly never plan to stop and TALK to them!' to which Peter says 'how do you know their so bad then?' me *doh* (I'd guess the clue is in the name but there again, maybe thats a moral message about not judging people by their preverbial book cover?).In any case its a reasonable family film - its entertaining alright but its not amazing or especially memorable. Some scenes are more immervise than others but certainly overall its ok - not bad for a family film really I suppose."}, {"rating": "0", "text": "Pans intriguing ideas are overshadowed by its disgraceful decision to whitewash Indians. Some of its plot points were also kinda predictable."}], "recommendations": ["oz_the_great_and_powerful", "dolittle", "bumblebee", "aquaman", "alice_through_the_looking_glass", "cruella", "poseidon", "seventh_son", "tomorrowland", "the_three_musketeers", "king_arthur_legend_of_the_sword", "the_last_witch_hunter", "jumper", "jungle_cruise", "the_call_of_the_wild", "guardians_of_the_galaxy", "super_8", "tron_legacy", "hercules", "avengers_age_of_ultron", "now_you_see_me_2", "hanna", "valerian_and_the_city_of_a_thousand_planets", "thor_love_and_thunder", "shazam_fury_of_the_gods"]}