{
  "id": 3351,
  "title": "Pandorum",
  "starring": [
    "Ben Foster",
    "Dennis Quaid"
  ],
  "runtime": 108,
  "genre": [
    "Action",
    "Horror",
    "Mystery",
    "Science Fiction",
    "Thriller"
  ],
  "description": "Two crew members wake up on an abandoned spacecraft with no idea who they are, how long they've been asleep, or what their mission is. The two soon discover they're actually not alone – and the reality of their situation is more horrifying than they could have imagined.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/w4YTrV9yGGwiPe0orF7TTUv4VzF.jpg",
  "categories": {
    "plot": 8.142857142857142,
    "acting": 7.75,
    "ending": 7.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 4.666666666666667,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 9.2
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I liked it, kept me interested, unfairly reviewed so I won't go by reviews so much anymore and judge movies myself!"
    },
    {
      "rating": "7",
      "text": "It has a good cast and plenty of outer space claustrophobia and dementia. It did seem a bit derivative at times but it was always entertaining."
    },
    {
      "rating": "8",
      "text": "It surely did not deserve to get so hated by the critics. Not perfect, nothing really new but a very good blend of what is good in other Sci-Fi moies made it a great entertaining evening watching it on BD. Just wished it made more cash in thearters to have a sequel... Hopefully, if they already had the idea, a straight to DVD or book will come out."
    },
    {
      "rating": "8",
      "text": "Critics really are gutless sometimes. It's possible not to like this movie, but it's crazy to dismiss it as a movie nobody will like. It has its flaws and is a bit confusing to follow at times, but it's not unusually derivative, any more than every romantic comedy is derivative or every biopic is derivative. This is an end of the world scenario that mixes in both hard and soft sci-fi and explores worst-case scenarios and mental illness that might exist on a 100-year-plus voyage to another world. If that sounds like subject matter that interests you, you'll appreciate this movie, though you may find stretches a bit dark and dialogue a bit murky at times."
    },
    {
      "rating": "10",
      "text": "Great sci-fi movie. Very suspenseful and engaging throughout. I don't know why it got such low reviews from critics."
    },
    {
      "rating": "10",
      "text": "Dark, some little terror, suspense, really good movie, good acting of Ben Foster and Antje Traue... forget it about bad reviews =S Hope its coming the second part of the movie :D"
    },
    {
      "rating": "10",
      "text": "To hell with the critics. Awesome movie!"
    },
    {
      "rating": "10",
      "text": "Critics can go  themselves. Most of them have no idea how a movie should be and the fact that they are making a living out of this is just sickening. Just finished watching the film and came here to write a few words and got completely enraged by the  people calling themselves \"critics\" to write some sensible words. Tenuous? GO  YOURSELF."
    },
    {
      "rating": "7",
      "text": "Seeing the \"critic reviews\" for this movie were pretty bad I decided to voice my opinion about it in a more positive light, to make a long story short movies like this are not for everyone and doesn't hold your hand through it all the way. I don't think there's anything wrong in that as a matter of fact if you're doing a movie \"for everyone\" you're doing it wrong."
    },
    {
      "rating": "7",
      "text": "Feels like an independent movie. Although it got some visual effects, the film relies on storytelling to get things going. Very dark (literally) and visually interesting. I don't quite get why this movie wasn't better overall evaluated. Maybe you should go watch this with your expectations way lowered down?"
    },
    {
      "rating": "10",
      "text": "I thought this movie wasn't going to be good at all, but I was way wrong! This movie is awesome. It kind of reminded me of Dead Space. Great story(always kept you trying to figure things out) a must see."
    },
    {
      "rating": "8",
      "text": "I'm somewhat surprised to see a really, really bad review for this movie by the Critics. Maybe 50%, but not as low as 28%. It's like Equilibrium; there's great potential. Don't take this movie as a professional, high-budgeted movie. I will say that this movie would be enjoyable to certain types of people, and based on User Reviews, majority say it's pretty good. If you like survival horror, then this movie might just be for you! Also might be enjoyed by sci-fi fans. And for those Xbox360/PS3 gamers who have Dead Space, this movie is like that (I've noticed that someone else in the User Review mentioned the game too!), but with less shooting and more running away, trying to survive, from man-eating humans. Yes, the main characters are being chased by....humans, or more like humans who evolved to survive inside the ship. I would like to mention for those who can withstand watching horror movies and games, it is not very scary, but more suspenseful, more \"on-the-edge-of-your-seat\" type of movie. So I hope if you do watch it, you love survival and not looking for hardcore horror. I guess it's just how I am, but I like the feeling when the characters have no clue where they are, what they are supposed to do, and they're stuck, trying to figure what is going on, like the game Myst. Yes, it does take patience to finally know the whole scenario. But I liked the plot. Here's a small summary about the movie (I'll try not to spoil) : The main character, Bower, and his Lt., Payton, are awakened in their space ship. After awakening from hypersleep (a long hibernation), they realized the Flight Crew # 5 was not there to greet them (Bower and Payton are Flight Crew # 6, I believe). Flight Crews rotate command of the ship. All non-active flight crew members go back to hypersleep. Bower and Payton became suspicious after realizing that the ship seems to be having problems, especially with the power supply. There was no response from the bridge (command center/navigations/cockpit) and from Flight Crew # 5 (who were supposed to greet Bower and Payton), and thus must investigate what is going on. On Bower's way to the source of the ship's power supply, he discovers these weird humanoids, and they are definitely hostile creatures. From there, he must try to stay alive, while figuring out what happened. He meets a few other survivors, and will sometimes recall some memories that he forgotten (due to temporary amnesia from hypersleep) which will reveal why he was part of the flight crew, why the ship was built, and where the ship was heading (it's main objective of voyage). Though survival horror movies have had a very common storyline (Main character must figure where he/she is, main character must survive, main character kills some enemies, main character is the only survivor, The End.), it is unique compared to others that I watched. I don't know, just give it a try and watch it!"
    },
    {
      "rating": "10",
      "text": "This was and is, a great movie. Living up to it's genre, it really sets you in the darkest corner of the ship it's placed in. Well scripted, awesome acting and surprising twists leave this movie with you catched into it. A must watch for Sci-fi thriller fans!"
    },
    {
      "rating": "4",
      "text": "Was a bit interesting at the beginning but was too reminiscent of Aliens and Sunshine. I am a huge Dennis Quaid fan and that was part of the reason I rented the movie. I was extremely upset when I found out all that Quaid does during 99 percent of the movie is sit in a chair in a locked room. Not a total waste of time, but pretty close."
    },
    {
      "rating": "8",
      "text": "Unreal. I've never disagreed more with critic's ratings for any movie. The monsters were nasty and fear evoking. The characters were unique and convincing. The acting was good. The plot was unexpectedly twisting and somewhat epic and there is much more to this movie than what the trailers reveal. The directing was great; the close up shaking shots might not be the best for aesthetic purposes, but they are perfect for emulating what a person would see and feel in each situation they were in. Locked in hypersleep for years with memory loss when waking and finding your ship is deserted with ravenous monsters trying to eat you in pitch black corridors.. What do you think you would see while running in fear for your life with your adrenaline pumping at max?? A nice slow and steady camera pan? Sometimes critics are complete morons."
    },
    {
      "rating": "10",
      "text": "Vastly underrated movie. One of the best space films of recent years. Great story, with plenty of twists and a great ending, cool mutant design as well. Just another great example of how wrong the critics can be."
    },
    {
      "rating": "8",
      "text": "Pandorum is one of those movies which will split the audience right down the middle. There are enough things wrong with the film to get you distracted if you want it to, but there is a pleasant mix of great things,  that will make this film a classic. The movie is very reflective of the last 20 years of sci-fi, drawing inspiration from classic films but also with a strong computer gaming influence. It is far more subtle than your Hollywood film and is much more raw and independent in feel, and that's what makes classics. Like all great sci-fi, this film does not overwhelm you with technology and science, but draws you to a story about people and their circumstance. I will not be surprised if this film stands the test of time and each year grows a wider appreciative audience."
    },
    {
      "rating": "6",
      "text": "\"Pandorum\" is just a SF-horror flick where survivors run away from alien-like creatures. The question is, did they make it? Yes, they barely made it."
    },
    {
      "rating": "10",
      "text": "Amazing movie!!!!!!!!!!!! Came in under the radar....But its great. Intense, scary, great actors and a space ship full of monsters.Great set design and the movie has it's own feel. Original storyline -(not another reboot), A bit like aliens/event horizon/and a zombie movie- so perfect for meI LOVED IT!!!!!"
    },
    {
      "rating": "10",
      "text": "I found it pretty good, reminds me Dead Space videogame.\rIts a survival horror movie wich has its thrilling moments, good story and creppy creatures.\rI enjoyed much more than the last 4  Resident evil movies"
    },
    {
      "rating": "8",
      "text": "I really don't know what movie the critics where watching when they wrote a review for this film, it is great, actors do a fantastic job, story was ok but the atmosphere while watching keeps you on edge and is great when you are home alone and have all the light off or down low"
    },
    {
      "rating": "10",
      "text": "Excellent film ! Real gem in SF from European director following Verhoeven, Kubrick, Tarkovsky - of course American mediocre viewer needs Spielberg or Cameron to give positive grade for SF film."
    },
    {
      "rating": "5",
      "text": "Not as bad as some suggest, my early 20's sci-fi loving son enjoyed it, and I stayed awake. Film relies too much on darkness and camera jittering."
    },
    {
      "rating": "10",
      "text": "I don't know what some of the critics are talking about. This was a great movie. Most fun I've had at a flick in ages. You have to pay attention.... I think that's where alot of folks went wrong. Great Movie!!!"
    },
    {
      "rating": "10",
      "text": "Don't trust the critics on this. Some of them can't even get the plot right. This is definitely a thinking geek's movie. The comparison to Alien is sheer laziness on the critics' part. This is like saying 500 days of summer is a rip-off of When Sally Meet Harry because it is about a boy-girl relationship. I hope the director make more movies like this."
    },
    {
      "rating": "8",
      "text": "The movie kinda starts off with a cliché: spaceship, memory loss, monster in dark corridors. But it's well worth to keep watching since the ending is very entertaining. Great movie if you're in the mood to be entertained."
    },
    {
      "rating": "5",
      "text": "The first 20 minutes were great! There were a lot of really good ideas here, unfortunately they were undone by an abundance of really cheesy D movie elements. I still kind of liked it for the movie it could have been, rather than the movie it actually was, which was actually a pretty bad movie."
    },
    {
      "rating": "10",
      "text": "I am deliberately against the critics on this one.\r Pandorum  isnt suppose to be an action sci fi flick, its not a generic starwars clone\rand it is defiantly not a AvP ripp off. It isnt suppose to be, This movie is more of a mystery suspense with a mint of tragedy. Tragedy why? The story telling of the characters gives you an impression that the whole universe is dead, the stars are gone and all life  along.All that is left are these mutant like beast theat have evolved from corrupted humans that have suffered from the disease \"pandorum\"\rThe ship had failled to reach its destination and is now in an empty void in space. But as it turned out, they hacve been in the planet all along underwater.\r amazing ending!!!!"
    },
    {
      "rating": "10",
      "text": "LOVED this movie!  I couldn't disagree more with the critics.  It had strong acting, great action sequences, good special effects, creepy monsters, interesting plot twists, and a satisfying ending.  After it was over, I was left wanting to know what happened next."
    },
    {
      "rating": "10",
      "text": "This movie had more suspense than most movies with 10x the budget, and kept me on the edge of my seat the entire time. What's more, it wasn't predictable at all. Most movies these days, I can literally see Every Single Thing coming a mile away. I usually predict every twist before it happens, because movies these days don't think outside the box. This movie was intuitive and had a story that hadn't ever been done before quite this way, and because of the way the characters acted throughout the movie, you couldn't tell what was going to happen next. Usually you see very obvious cues that lead you to think \"oh this is about to happen\" or \"oh he's definitely the bad guy because X, Y, and Z\", but this didn't do that at all, yet everything still made sense when you saw it happen. Critics that gave this any less than a 7 either expect 100m worth of special effects and give a movie bad reviews if they don't have that these days, or they're just paid off, because there's no way the homogenized crap that is a modern marvel movie gets above a 65 while this gets a #$%^ing 28."
    },
    {
      "rating": "8",
      "text": "I'm not generally a big fan of horror but there is no scarier setting than space and I think this movie was excellent, the twists and turns were unexpected and I was genuinely surprised by some of them which doesn't seem to happen very often anymore. Worth seeing for sure, and as with many of the other user reviews I must say I have never disagreed with critics more, their comparisons to previous Sci-Fi films are lazy and poorly considered. Really I think it boils down to the fact that very few critics like sci-fi and they tend to look down on it. I would say if you are a sci-fi fan this is worth checking out."
    },
    {
      "rating": "8",
      "text": "The story of Pandorum focuses on the crew of a sleeper ship called the Elysium and it's inevitable journey through space to their destination, the planet Tanis, which is supposed to be another Earth-like planet. From the beginning of the movie it had me interested, as it tends to keep things very vague, dropping tiny bits of clues as to what is going on. It starts with Corporal Bower (Ben Foster) who wakes from suspended animation and finds that he cannot remember much, if anything, about what is going or where they are. The story takes him on a journey through the ship as he attempts to uncover what is going on aboard the Elysium. Although I do see many strong resemblances or homage's to a slew of other movies, I don't feel the criticism aimed at it is deserved. The flavor of Alien/s and Event Horizon come to mind, but from what I gather the similarities are more superficial than anything else. The cast is pretty decent, with Foster giving a solid and realistic performance in his role. Denis Quaid manages to convey his character of Lieutenant Payton effectively, giving a good performance as well, but really starts to shine towards the end of the movie. The token girl/love interest Nadia, played by Antje Traue, is sometimes shaky in regards to her delivery, but does manage to convincingly play her role as the toughened scientist. She manages to fight well, while not looking like a wafer-thin model like in some movies (cough, cough Resident Evil), and I find that a very good thing. I'm pretty tired of that stereotype and its actually more attractive in my view. Plus shes nice to look at. Anyway the only real character I tended to wince at was Norman Reeduss's Shepard. I dont know if they wanted him to play it that way, but he seemed a bit overdone, but hey, maybe thats what was asked of him or how he wanted to do it. Either way it seemed the least genuine for me. Overall I loved the ambiance of the movie and the pretty realistic actions and reactions of the lead cast to the events that transpire aboard the Elysium. The movie held my interest well, aside from a few hiccups here and there. One of those was some of the B-movie like techniques they used for the action scenes, which to me kind of detracted from the horror of it all. Some scenes seem a little too sped up, while others may have relied on a bit too much slow motion, but all in all the movie has a certain style that appealed to me. It aint Shakespeare, but then again, its not trying to be. Definitely worth a look.â"
    },
    {
      "rating": "9",
      "text": "My opinion has never differed so noticeably from critics' ones than now. Definitely one of the best sci-fi releases of the decade. The plot and the twists, at least the major one, is unpredictable even to me - I consider myself a critical and skeptic person. Summa summarum, a refreshing movie in an era of boredom. I am pleased."
    },
    {
      "rating": "9",
      "text": "Listen this movie was on a pretty short budget give them some credit it used like 1/10th of the budget of transformers so I mean they can't help for some parts to be a lil cheesy.Lets get down to it...Story is great very very good twists and turns every corner.Actors are good some parts are cheesy but you cant help it.. and it does not ruin the movie.Visuals are also good not amazing but it works.9/10 One of the best sifi movies i have seen. I have seen allot."
    },
    {
      "rating": "7",
      "text": "http://devilmayhem666.blogspot.com/2011/09/movie-reviewanalysis-pandorum.htmlMy review of this film. Pretty underrated flick. Screw the critics, don't know a good movie when they see it."
    },
    {
      "rating": "10",
      "text": "For me maybe the best sci-fi in the last decade, the only one which I enjoyed from beginning to the end\rwithout being bored for just one minute! Strongly underrated piece by my opinion."
    },
    {
      "rating": "0",
      "text": "This Movie was crap. Dark, poor acting and I watched it with no idea what was going on. Waste of time and money, don't bother. Crappy cheap syntho music, crappy cheap out of work or just starting out actors. 1"
    },
    {
      "rating": "2",
      "text": "Utter dreck. Preposterous, incoherent, and hysterical."
    },
    {
      "rating": "10",
      "text": "One of the best Sci-Fi movies I have ever seen. Great cast, involving story, crazy action, scary moments, adventurous. A good movie to watch at night in the dark. Worth buying, entertaining enough to watch more than once."
    },
    {
      "rating": "1",
      "text": "This movie was absolute trash. It's supposed to be a super serious, sci-fi thriller, but instead it's laughably bad.\r The story is not very engaging and very incoherent. The effects of the movie are absolute trash and the acting is mediocre. It creates a very awkward atmosphere, leaving you grossed out or creeped out most of the movie instead of taking it serious.\r Would not recommend."
    },
    {
      "rating": "1",
      "text": "I endured the whole thing because I wanted to see Dennis Quaid take his shirt off. The rest of the film was just shaky camerawork in the dark with vague green strobe lights flickering occasionally to make us think people are moving from place to place. Was this movie about the disease \"Pandorum\" or about inexplicable humanoid mutants (no satisfactory explanation was offered for their presence) or about nihilism? And who the heck was that tribal guy with the spear who spoke no English? Take your shirt off next time, Dennis... show us some nipple, okay?"
    },
    {
      "rating": "0",
      "text": "Utter crap. starts promising, ends in mindless cacophany . terrible screenplay, tedious, annoying, etc."
    },
    {
      "rating": "1",
      "text": "I was lured towards 'Pandorum' with the expectation of a good value sci-fi-horror. But nay, was this piss-poor-triteâ"
    },
    {
      "rating": "1",
      "text": "The Worst Movie I've seen in many day."
    },
    {
      "rating": "1",
      "text": "Luckily a martial arts hottie has survived in the sewers of a space ship alone surrounded by zombie aliens. I usually like this stuff but plot too dumb to watch."
    },
    {
      "rating": "10",
      "text": "Actually I would give this an 8; but to counter the nitwits who give things a zero.. Grow up! As is so depressingly usual, the pro crits hated this. Yawn. It's a well-made sci-fi scarer with a pretty sensible plot and believable characters. Amen! For this to get slammed while a half-baked POS like \"District 9\" gets major strokes because it's seen as \"political satire\" (albeit of the most sophomoric type) is just funny. I hope it does well on DVD, it deserves to. Give it a dark room and a big tv and you'll have fun."
    },
    {
      "rating": "8",
      "text": "Reviewers tend to band together for fear of looking stupid to go against some of the bigger reviewers it seems. This is not a bad film, well paced and entertaining. Maybe it does borrow from other films out there, but does retain enough to be distinctive, and what films these days haven't been done before in some other such way"
    },
    {
      "rating": "4",
      "text": "Offers nothing new, gloomy and dreary which is a shame because there is an interesting idea here but it's sadly squandered with a same old, same old plot."
    },
    {
      "rating": "10",
      "text": "Flat out, the critics can go fuck themselves on this film. Yet again, critics get another great film wrong. Pandorum is a stunning film that was simply amazing and superb in every way. Hopefully this will go down as a sci-fi/horror classic and it serves as another reminder for why not to trust critics. You must see this film if you loved the Alien series or The Thing."
    },
    {
      "rating": "3",
      "text": "Painfully dumb. If you are into that sort of thing (which I kind of am), give it a try, but be forewarned: the monster design is cheap and campy, and the plotting is incredibly stupid. stereotypical pap. i absolutely love both event horizon and the decent, and i was as uninvolved as i was bewildered that this would be made. Uwe-Boll incoherent stupidity."
    }
  ]
}