{
  "id": 2819,
  "title": "Paper Towns",
  "starring": [
    "Nat Wolff",
    "Cara Delevingne"
  ],
  "runtime": 109,
  "genre": [
    "Mystery",
    "Drama",
    "Romance"
  ],
  "description": "Quentin Jacobsen has spent a lifetime loving the magnificently adventurous Margo Roth Spiegelman from afar. So when she cracks open a window and climbs back into his life-dressed like a ninja and summoning him for an ingenious campaign of revenge-he follows. After their all-nighter ends and a new day breaks, Q arrives at school to discover that Margo, always an enigma, has now become a mystery. But Q soon learns that there are clues-and they're for him. Urged down a disconnected path, the closer he gets, the less Q sees of the girl he thought he knew.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eoF6wYVj1vbrCWjL0rBkdZpgrxS.jpg",
  "categories": {
    "plot": 5.816666666666666,
    "acting": 5.767441860465116,
    "ending": 5.5,
    "soundtrack": 6.0,
    "cinematography": 4.0,
    "familyFriendly": 5.4,
    "funny": 7.636363636363637,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Almost in spite of itself, succeeds in saying something interesting about its teen audience before ultimately revealing itself to be entirely vacuous after all.\r Watch it here for free http://www.watchfree.to/watch-2a3fbe-Paper-Towns-movie-online-free-putlocker.html"
    },
    {
      "rating": "4",
      "text": "Through the painfully normal high school nerd friendships and self destructive, hypocritical main heroin, this movie gives some heart and chuckles. It's better spent with your actual friends though as you could probably have a better time watching Netflix with them"
    },
    {
      "rating": "8",
      "text": "I was pleasantly surprised by Paper Towns. It is a very strong coming of age film that I think was a bit overlooked this year. This film may not have the huge depth that some other classic teen films have but I think it is going to get some attention sooner or later. There are several really great performances in this film. Natt Wolff looks like he may be destined for a long film career after this film and the whole ensemble cast has such great chemistry and this movie has a lot of unexpectedly good laughs. I didn't find the film too clichéd. There are a few minor aspects that are a little predictable but I found myself surprised and satisfied in the end. One of the downsides to this film is the absence of Cara Delevingne for essentially the entire second act. Her role in this movie was great but there was just not enough of her in this movie and I hope she was get some attention for this performance."
    },
    {
      "rating": "4",
      "text": "Teen romance is done rarely well, most of the time, they feel cliched, uninteresting, and at times, really pretentious. 'Paper Towns', unfortunately, falls for every one of these cliches, and it doesn't use them ironically.\r Based on the novel written by John Green (who also wrote 'The Fault in Our Stars'), the movie focuses on a young boy named Quentin Jacobsen (Natt Wolff, who was also in 'The Fault in Our Stars') going through his last year of high school, and has found himself infatuated with a girl named Margo (Cara Delevingne), a girl he's known since childhood. She is a mystery as she is fascinated with strange things that he has trouble understanding, and as they're growing up, she, for some reason, disappears and is nowhere to be seen.\r Quentin does everything he can to find her, since they spend one amazing and somewhat risky night together playing pranks on all her former friends as her boyfriend cheats on her. After that night, that's when she strangely disappears for reasons unknown.\r Quentin tries to piece everything together to help him look for her and find out where she is. He tells his idiotic and stereotypical best friends, Ben (Austin Abrams) and Marcus (Justice Smith), two young boys so splashed with low-life stereotypes, I often wonder what's a bland, heartbroken teenage boy like Quentin, doing being friends with those two. Then again, why does Quentin fuss so much about Margo? We don't get to know a lot about her, other than the fact that she is a mystery...but there is nothing else to her character.\r And that is the biggest mistake that this movie makes, Quentin is just your typical, girl-obsessed teenage boy and Margo is just... a girl. His friends are just walking talking stereotypes as one is plain dumb, and the other is of a different race, but in case his skin color doesn't make that obvious, he falls under typical stereotypes that we see, and they're not funny at all.\r The movie just ponders on and on with Quentin piecing together the puzzle to try and find Margo, but I must admit, these characters are so one-dimensional, I stopped caring too early. They may as well have called this movie \"Paper Thin\".\r All the build up also leads to an ending so unsatisfying in its resolution, that I couldn't help but wonder, why is this all worth it? The movie should have had a different ending, that way, at least this wouldn't feel like a waste of an almost two hour movie."
    },
    {
      "rating": "5",
      "text": "Quite different from the book in a bad way. The characters seems like a lighter version of the original ones. The perfect soundtrack saves the movie a little"
    },
    {
      "rating": "8",
      "text": "Paper Towns.......What can I say? Like all John Green movies or book, it has a lesson. The lesson in this movie is to take a chance, an adventure, but when it's all said and done, don't forget the people who got you there. Like Quentin says, \"Everybody gets a miracle.\" Whether it's true or not I encourage you all to watch Paper Towns and enjoy Quentin's journey through what it's like to take a risk for the first time, and when it's over look for the miracles in your life."
    },
    {
      "rating": "9",
      "text": "Paper Towns tells a heartfelt and personal story with really great casting, performances, writing, and music. I was surprised by the ending but after thinking about it I feel it works very well for the premise of the film. I'm not sure how it compares with the book, but as a stand alone film it is really good."
    },
    {
      "rating": "6",
      "text": "Nothing close to what The Fault In Our Stars was. We have a good cast but the story is just too simple. The book manages to go deeper in characters and their struggles but the script doesn't. Development on them is poor, the story itself is already silly and the end is rushed a lot (and this was essential to understand Margo). As a result, a teen movie about a nerd who falls for a popular girl who doesn't know who she is and who doesn't love him either. It's funny and touching but it's just another teenage movie in Hollywood."
    },
    {
      "rating": "1",
      "text": "The acting was below average with promising performances from Smith and Wolff. However, the catastrophic performance from Delevinge was completely detrimental to the already plainly-average final product.\r This film adaptation from the book of the same name revolves around the charming yet mysterious Margo (portrayed by Cara Delevinge) which told from the narrative of the typical invisible high school boy, Quentin (Natt Wolff).\r However, the adaptation changes the form of Margo, with the efforts of Delevinge, which would have been a filmmakers' dream and transforms her into a plain-Jane, hideously acted and overall boring character.\r If the role was based on eyebrows, it would be understandable as to why Delevinge was considered. However, its not and a promising career from the former model will not be anticipated."
    },
    {
      "rating": "10",
      "text": "Paper Towns is a very good movie with a simple but interesting story line.\rThe acting is really good here.Nat Wolff does an incredible job as the lead and so does Cara Delevingne who I think gave a near perfect performance.They are supported by a very strong cast who include Justice Smith as Radar,Austin Abrams as Ben Starling,Halston Sage as Lacey Pemberton and Jaz Sinclair as Angela.They are all incredible to watch and hopefully very soon they will all be involved on many great things on the movie industry because they deserve to.\rI was really interested on the story all the way through,with all the mysteries and some laugh out loud moments throughout mostly delivered by Ben.\rI think John Green has a very bright future on the teen movie genre as he really understands the way that they think and what they go through.Though personally I still prefer The Fault In Our Stars more than this one,I believe that both of them are very well made and very interesting to watch.\rThe soundtrack is also very good and it keeps up the emotion,the feels and overall it truly fits with the movie itself.\rI was laughing all the way through,I was emotional at some of the tones that the movie was going for,which really did work,like friendship and high school and just teenagers stuff overall.I was intrigued by the movie and the mystery in it.I loved the performances so much and the actors in it and honestly I can't think of any flaws or problems that I had with this movie.It is a fun,simple and interesting movie and I truly enjoyed it."
    },
    {
      "rating": "2",
      "text": "This movie was painfully boring, pretentious and totally cringe worthy. For several scenes I'd find my self squirming at smarminess of the poorly cast unrealistic two leads. It has the emotional worth of a trodden on turnip; the script feels like it written by a 17 year old girl with delusions of having an interesting story more notably is the agonisingly predictable directing from Jake Schreier. A real shame considering his last picture was Robot & Frank. Cliche after cliche helped violate this picture along side its aimless direction, much like a mentally handicapped child lost in a super market. Do not watch this movie if you want to enjoy at least a decent bit of cinema."
    },
    {
      "rating": "7",
      "text": "Pros:\rThe main love interest is not a traditionally attractive girl.\rIt has distinct sections to its story.\rThe main character and love interest end up separated at the end. This helps with making it seem more realistic.\r Cons:\rThe section where they were on the road trip seemed a little long.\rSeems kind of unrealistic that they did not seem to get in trouble at all for going on the road trip.\rThe main character and the love interest did not get into trouble for what they did on their night together."
    },
    {
      "rating": "8",
      "text": "\"A girl is just a girl, no more\". In a crude sense of reality that's completely true, but we are humans: we always seek for something different. Life is a constant challenge, and the movie demonstrates that in order to face it you have to know yourself first before its too late; but, how late? Friendship is just one of those parts where you get to know yourself by knowing who you have around, and Quentin and his friends reflect that perfectly.\r Margo is the true sense of reality: sometimes you need a punch in the face in order to realize it, but it is always there in front of you. We all seek for miracles: maybe for Quentin, Margo was one, but in life sometimes you need to be cheated in order to see the truth. \"Every one gets a miracle; you just have to learn to look at it\"."
    },
    {
      "rating": "7",
      "text": "Paper Towns is a GOOD movie, but its has its flaws. Let me go over the positives first. The characters are likable and have much charm to them. The story is intriguing and has a very puzzle and mystery tone to it. There were some pretty funny scenes and scenes that made me actually smile, its a mostly uplifting movie. Now lets go over the flaws. The first and biggest one is how hard it tries to be deep and inspirational, its not, its just a fun adventure/mystery movie, nothing deep found here. The second thing is the ending, its not terrible or even bad, its just very anti-climatic. The third and final this is small, but noticeable is that it has the typical nerds end up getting hooked up with pretty popular girls, its so overused and is not needed here either. Overall, its a good movie especially for teens/young adults, but not anything that you will remember a few months from now."
    },
    {
      "rating": "6",
      "text": "Paper Towns is a film that promises much but really fails to deliver with a rather tired plot and characters who are a mixed bag to deal with particularly the female lead. the film has a slow beginning and a questionable ending (which from what i heard is much better in the book) but it's 3rd act that saves the film providing the best portion of the film that the trailer promised. would only recommend it to 12-17 year olds as they will get the most out of it anyone older is well aware of where this story is going"
    },
    {
      "rating": "6",
      "text": "It's simple, If you didn't read the book then you will enjoy this movie. I did read the book and i found that the revisions irritated me a lot and really took me out of the film. It is disappointing to see how much they altered in comparison to The Fault In Our Stars which for the most part kept true to the novel. Performances were strong and the film still is a fun and entertaining watch. I've been following Natt Wolf's performances for a while now and my only fear is that he will get type casted as a Micheal Cera kind of actor. My only recommendation would actually be to watch the movie first then read the book after. Overall not a bad movie, but readers may be irritated in the amount of alterations... clearly i was."
    },
    {
      "rating": "5",
      "text": "Paper Towns is the stereotypical \"white people problems\" and I think that could have been expected even before paying actual money to watch it. I'm not saying it was a terrible movie, because that's not the case, but honestly I think the story in itself was not great. I'm pretty sure I've read this book – years ago – but I can't imagine that the story was more involving or emotional than what was shown on-screen.\r I think my biggest problem with the story itself lies within the fact that Margo Roth Spiegelman is portrayed not like a person, but a fascination. A fascination – almost a toy – that Quentin feels the need to take ownership of. He thinks she needs to be saved and she is his to save, when the reality is that he shows up unannounced thousands of miles away. That's more creepy stalker than anything. This movie isn't even romantic. It's weird.\r Paper Towns is a journey. A literal journey. Hypothetically that should be ok, let a movie's plot do what it wants, but the physical movement of their minivan moved it along more than the characters. I would rather watch a movie about nothing with characters I would take a bullet for than a movie with a journey across the country with characters that are, ultimately, words on a piece of paper."
    },
    {
      "rating": "6",
      "text": "Get lost to get found. Paper towns is ok the only really good scene is at the last 30 so minutes of the film I thought this would be like the fault in our stars but it's 100% different."
    },
    {
      "rating": "2",
      "text": "So I thought this movie would be alright going into it, since John Green's previous stuff, despite not really being \"my thing\" was somewhat well done, but this wasn't the case for Paper Towns. The film didn't do anything to make you care for the characters so throughout the movie the characters all seemed one dimensional and unlikeable, and then there's the lackluster ending. This is where the movie really disappointed me and caused me to drop a few points off it's original score, there's a big buildup throughout the movie to the ending and then it happens and you're left thinking \"Why did I just waste my time watching this?\" because, without ruining anything, nothing really happened in the end. The ending felt rushed and was extremely disappointing. If you're a fan of **** movies, you might like this."
    },
    {
      "rating": "9",
      "text": "With a simple (but not boring) plot, Paper Towns is one of those movies in which the journey is more important than the arrival. The way it speaks to young audiences (such as myself) about friendship, courage to get out of your comfort zone and platonic love makes it a beautiful, interesting film. Well, at least for me."
    },
    {
      "rating": "3",
      "text": "This would probably be enjoyable for people still in high school, but it's just not going to engage anyone much beyond that point. The story is trite, and the only draw is the possibility of relating to the characters, which is unlikely if you're older in this case."
    },
    {
      "rating": "9",
      "text": "\"Paper Towns\" is an unique romantic comedy, that isn't weepy like Green's other film \"The Fault in Our Stars\" but it's satisfying to the fans and gives them a look at unrequited love and bromance. After watching John Green's first adaptation \"The Fault in Our Stars\"  I was surprised that it goes around the cliche's, overall the film moves you and takes you on a powerful journey while it does give you great humor and some astonishing star-making performances and Paper Towns gives us that. The film is yet again written by Scott Neustadter & Michael H. Weber ('500 Days of Summer' and 'The Fault in Our Stars')\rthey know not to mess up the romance formula, but this film does sort of makes mistakes but their good at this genre and they should gives us more John Green adaptations. A teenage nerd Quentin (Nat Wolff) is about to have the night of his life with his childhood crush Margo (Cara Delevingne) the most popular girl in high school it's been a while they talked to or hung out since they were kids. Wants him to help her play mischievous pranks on her friends who had betrayed her. The next day, the mysterious Margo is no where to be found. His buddies Ben (Austin Abrams) Radar (Justice Smith) and brings along Lacey (Halston Sage) and Radar's girlfriend Angela (Jaz Sinclair) are helping Q find Margo. With the help of Margo's cryptic clues she had left behind, Quentin embarks on an obsessive mission to find the girl who he love and has made him feel truly alive. The film is like a John Hughes romantic comedy, like able characters funny humor and a great love story. Director Jake Schreier (Robot and Frank) adds the charm and puts a riveting story on screen with charm and like ability in to it. Nat Wolff does a great job and so does Cara Delevingne, those actors we can do good in the future. The film's problem is that is does get cliche'd at times and the film knows what it wants to be and that is a coming of age drama, it isn't moving but it's earnest and well acted. Grade A-"
    },
    {
      "rating": "9",
      "text": "A wonderful teen drama, coming of age story. Paper towns is one of those typical high school movies and road trip movies combined together into a delightful treat. Filled with, funny humor, great acting and friendship, heart warming moments, and a little lesson or two to take away from. Only a little problem is that Cara Delevingne hardly has any screen time in this movie, but they were memorable. A great film to watch with friends and family!"
    },
    {
      "rating": "5",
      "text": "I haven't read the book, but in the IMDb forums someone said that the ending, and through it ultimately the meaning, of the book was quite different. According to that individual the book ends with Quentin realising that Margo is not the deep and interesting girl that he created in his own head.\r I don't know if such an ending would have been better but it at least would have been more interesting than the bland ending we got. There would have been some drama with Quentin seeing his illusions smashed. Instead he just realises she doesn't like him. And then it ends.\r Margo was my biggest problem of this film. Besides that, the film was very enjoyable and funny. You really wanted to spend time with Quentin and his friends because they felt real. Unlike Margo who just felt like a character from a children's adventure book.\r Which brings me back to my original point. Margo starts out as the Manic Pixie Dream Girl. By the end she could have become human. But she doesn't. So when you compare her to all the other characters in this film it's like they come from completely different worlds.\r Paper Towns is, overall, a good film but the ending completely ruins the entire story and the themes that it was building."
    },
    {
      "rating": "3",
      "text": "I dare anyone who read the book to tell me they loved the movie as much as they loved the book. The beginning was fine but then they changed THE ENTIRE STORY. They changed how Margo acted when she saw Quentin came looking for her. They changed when they leave for the road trip to go find her. They don't give any information on the things that mattered so much in the book. It was really obvious they just wanted the 15 year old girls to be swoon by the actors and their love story so they could bring in the cash. This book means so much to me and I love every page of it. The movie just wasn't what I expected at all. I expected the fact that they would leave stuff out but they just completely changed how things went. Jake Schreier, the Director, really did this story an injustice. I was hoping they would make a movie of Looking for Alaska and An abundance of Katherines but having seen Paper towns, I actually hope they never do. They would just ruin it and make it so that the pubescents love it. I recommend reading the book and staying away from the movie. The actors were perfect, the movie not so much."
    },
    {
      "rating": "3",
      "text": "I found this movie to be deeply disappointing, mostly because of the acting range of Nat Wolff. I found it difficult to watch his facial expressions and body language to the point where I was more annoyed than uncomfortable. This movie offers a rough 15 minutes of excitement, 20 minutes of emotional scenes and a whole lot of anticipation building up to an ending that leaves you feeling cheated. The first half of the movie had great potential to deliver greatness, but everything after it is just painfully unexciting and boring. As a European person, I find myself being unable to relate to the drama of high-school ending and prom, however most other teen movies did a much better job at getting close. It completely missed what I think was the general target of the movie. Overall,  would recommend reading the book, but not wasting time with the movie. Going with Nat Wolff was a poor choice, wasted great potential of the first half of the movie, overall boring atmosphere that makes you want to fall asleep, and an ending that makes you wish you had fallen asleep."
    },
    {
      "rating": "3",
      "text": "This movie was based off an amazing book by John Green but left out many key elements that made the book special. Not only did leaving out essential elements that made the book heartwarming, but it made this movie look as if it were just another \"Hey, I hate my life, come find me\" type of movie, where the boy falls in love with the girl and that's it.\r If you have not read the book yet, I suggest that you do. It's a heartfelt book that makes this movie look like dirt. I guarantee you that this movie may seem great when you watch it without reading the book, but looking back at it afterward, you will realize how much the directors left out, and how little the story connects with anything."
    },
    {
      "rating": "6",
      "text": "I'm not really a fan of the romance genre but this one wasn't as bad as I thought it would be. Well I see people complaining about this film not being to similar to the book by John Green which it interest me into watching it, so I did. I will say that I didn't find anything wrong or boring in 'Paper Towns' although it goes downhill in some occasions on scenes that I found uninteresting or pointless. It's an original story with a so-so plot twist that I wasn't expecting. Since I'm not really a fan of the kissy kissy genre, I will give this movie an honest 'SIX' for not bore me to death and it wan't really that bad."
    },
    {
      "rating": "4",
      "text": "Paper Towns is kind of a funny little flick. It screams teenaged philosopher and is a film that thinks it knows more than it really does. Yet, it does offer some interesting insights on relationships (both romantic and friends) and has a compelling plot that is fun to follow along with. However, it is aggressively average all the same. The film is decently cast and has the occasional moment of brilliance from a filmmaking standpoint, but is like an agglomeration of every other teenage film ever. Paper Towns tries to get its viewer to leaves their comfort zone. To avoid the ordinary and become extraordinary. Tragically, the film ignores its own advice as it shamelessly borrows from prior coming of age dramedies aimed at teenagers. Even more, the story is largely quite ludicrous and far-fetched (how did these kids have access to this much cash), which also serves to hold the film back. Now, it is quite charming and a good time even it is quite typical. For a film that is largely derivative of past works, it needs to offer something new or just have enough pizzazz and power to overcome its generic nature, but Paper Towns does not do this. For fans of the genre, Paper Towns should satisfy. For everyone else, Paper Towns will likely just be a mildly fun way to spend almost two hours."
    },
    {
      "rating": "8",
      "text": "You can't hold back forever your crush on someone.\r I don't know why it is underrated, probably that's a mistake. Because this is not your usual teen movie, but a different perspective tale and told in a quite exciting way. It was from the director of 'Robot & Frank', it is only his second film and he's now in my watch-out filmmakers list. Both the films were different genre and topic, and I totally loved them. This film was adapted from the book of the same name who wrote 'The Fault in Our Stars'. The film talks about a childhood crush and how long does it takes one to get courage to open his heart.\r Q short for Quentin, when he first time saw the girl named Margo, he has instantly fallen in love with her. But having differences over how to enjoy the life, they had drifted away. Until when the actual story begins in the final year of their high school. So Q finds some clues when Margo disappeared like usual, but this time he considers it seriously and goes after her to reveal his love. What follows is a road adventure and a mini twist in the tale.\r Great cast, but I think it is the Nat Wolff's best performance as the lead. The supporting roles were not here to just support, but participated beyond the usual. Cara Delevingne was not bad either, but her part was like in and out frequently. So overall it had best set of characters with uniqueness from one another. Which means don't expect a silly teen comedy, it was awesomely designed to impact all generations. So the entertainment is guaranteed.\r It is not just a romance between two, that is what I was surprised. The narration points out a one love story, but in the end you would end up watching a multiple romances. Something very refreshing and all the lines were very matured, which kind of feels like the real world stuff. I really liked the conclusion, proves why one should watch it. Whatever the others say, I definitely recommend it. A sweeter and a heartwarming teen film.\r 8/10"
    },
    {
      "rating": "7",
      "text": "While this film lacks what many others in its genre have it doesn't mean I didn't have a good time.  In comedy and heart it seemed to be just a little less than movies like The Fault in our Stars and this years Me and Earl and the Dying Girl.  Overall though a solid effort.  B"
    },
    {
      "rating": "4",
      "text": "Despite staying mostly true to its source material, director’s adaptation of John Green’s “Paper Towns” tears itself apart with a plodding pace and paper thin characters."
    },
    {
      "rating": "10",
      "text": "Paper Towns is a phenomenon before it's premiere. John Green's material is amazing and the beautiful and heart-breaking final scene shows us that things can be real, but sometimes, only in our minds"
    },
    {
      "rating": "7",
      "text": "Paper towns isn't what I quite I expected it to be and that's a good thing cause it was surprising at times. I thought it would be like a mystery where the girl did something bad or something but it ended up being your typical teen romance movie. It was a bit slow at times and the last 20 minutes really dragged, but the film was still entertaining and the characters were all likable, probably except for Margo and her sister."
    },
    {
      "rating": "4",
      "text": "It was just a big cliche character development wise. Its not a must watch either. I mean its ending is disappointing and well it juts makes the film forgettable, but hell this is from a person that's not much into this genre to begun with.  I'd just wait till it hits a streaming service."
    },
    {
      "rating": "6",
      "text": "Paper Towns is not that amazing, not even a 3/4, but it wasn't awful. I didn't find myself asking when the movie would end for a good amount of it, but the other amount was kind of a bore."
    },
    {
      "rating": "7",
      "text": "Another teenage angst movie but a little more interesting because the plot twist is, one of them goes missing.  The friends band together to search for her creating a mystery sub plot which helps move the story along."
    },
    {
      "rating": "6",
      "text": "I'm not really a fan of the romance genre but this one wasn't as bad as I thought it would be. Well I see people complaining about this film not being to similar to the book by John Green which it interest me into watching it, so I did. I will say that I didn't find anything wrong or boring in 'Paper Towns' although it goes downhill in some occasions on scenes that I found uninteresting or pointless. It's an original story with a so-so plot twist that I wasn't expecting. Since I'm not really a fan of the kissy kissy genre, I will give this movie an honest 'SIX' for not bore me to death and it wan't really that bad."
    },
    {
      "rating": "7",
      "text": "I just finished reading the book by John Green of the same name and for the first time for me I actually liked the movie way more then the book. the book takes too long trying to figure out the clues and the timing of the road trip and Radar's girlfriend Angela wasn't on the trip which I liked a lot more in the movie when she was. there were a lot of other details that I am glad that I know the difference about but really the type of story it is works out to be a way better movie. I only gave the book 2 stars so my rating for the movie is adequate with my comparison. I like how the guy at the gas station and Q are both from Fault In Our Stars. I like that little John Green tie in :)"
    },
    {
      "rating": "10",
      "text": "Some of my friends do not like it and I **** do not know why or how?! I love the movie and every scene is unforgettable to me. Paper towns is a movie about love, teenage life, adventure and friendship. The love story part is realistic compare to other Romantic movies. This makes the movie unique and beautiful. It is simple love story not so dramatic or too emotional. JUST enough and JUST OKAY. But this Just enough and just okay make it lovely and great love story. Teenage life, I've been there, We've been there. You will be there. This movie tells about teenager who are both curious about things and insecure. But this brought the adventure part of the movie.  Adventure about real life - school, love, doubts. The friendship part of the movie will make you wish that somehow you will meet the best persons who could be your BEST friends. I'm sure you'll like it. Just feel the movie and try to see it in different angle to rate it 100% . =)"
    },
    {
      "rating": "6",
      "text": "Paper Towns is a decent movie to watch. Everything about it is fine the acting is fine the writing is fine. But the ending is amazing one of my favorite endings to this type of movie did not see that coming."
    },
    {
      "rating": "3",
      "text": "Un film d'ados bourré de poésie à deux balles et de de bons sentiments naïfs dans une banlieue chicos d'Orlando en Floride. Les ados aisés vont à leur bahut, conduits par leur maman, font des projets pour l'avenir (toi, tu seras médecin, mon fils) et celui-ci repense à sa copine d'enfance de la maison d'en face lorsqu'une nuit l'énigmatique copine, Margo, vient toquer à sa fenêtre pour aller faire les 400 coups et se venger d'indélicats camarades...Puis Margo disparaît et une enquête commence pour le blaireau et ses amis comme pour une chasse impromptue au trésor, car la fille a laissé des indices comme le petit poucet. Le film a le mérite d'aiguiser la curiosité et d'intriguer un certain temps tandis que les branques remontent la piste mais cale hélas rapidement par la suite, faute d'idées et surtout... de scénario !La fin est décevante, aussi décevante et banale que leur vie de **** bourgeois bien propres sur eux qui ne pensent qu'à tirer leur première crampe au \"bal de fin d'année\", la spécialité américano-américaine qui nous fait toujours bien rigoler... ou lever les yeux au ciel plutôt.Entretemps, le principal intérêt du film, à savoir cette étonnante actrice aux gros sourcils et au nom imprononçable que l'on avait vue dans le gros nanar intersidéral de Luc Besson, Cara donc, a disparu. Nous voilà bien déçu, car elle a un visage intéressant cette petite.Peut-être que je m'étais imaginé quelque chose à la Donnie Darko mais ça n'a rien à voir en fait : on a juste ici un film pour ados très bateau et nunuche qui se traîne comme le vieux monospace familial."
    },
    {
      "rating": "3",
      "text": "I only enjoyed around 20 minutes. The story was boring, awkward, and to long. They had bad actors, that are awkward and too serious. The ending was also terrible. It is very bad."
    },
    {
      "rating": "5",
      "text": "This movie is for teenagers, with the anxieties of that age, so if one has already lived and matured over the years, you may find it corny or irrelevant.The film honestly does not offer anything new, but being honest is not a bad work, it has its mistakes like everything else, but it works and keeps one interested to the end.I clarify that it is not my type of cinema, not from afar, but I can recommend it and although its true protagonist is masculine, there will be a resonance more striking for the feminine public."
    },
    {
      "rating": "10",
      "text": "A No Heavy Tearjerker, But Still Searingly Relatable and Sentimental !Coming on the heels of its commercially-successful predecessor, 'The Fault in Our Stars', PAPER TOWNS is no heavy tearjerker, but it echoes more affectionate and piercing sentiments, with its lighter, minimalist take of its recognizable subjects.The film follows Quentin (Nat Wolff) , or \"Q\" as he is more popularly called, a highschool boy who has been nursing an unrequited love for the girl living next door, Margo (Cara Delevigne) since childhood. Even after when they turn 12, when Margo suddenly becomes distant, \"Q\" never loses the affection, and it only becomes even stronger when one day she climbs again to his window, the way she did when they were still kids. The next events follow an eager \"Q\" savoring the moment as he escorts Margo in her series of \"small revenge\" against those she thinks have betrayed her, including her ex-boyfriend. But the levitating moment would only last overnight, because the next day, the ever mystifying Margo, disappears.Mining on the same overly familiar material that dwells on both coming-of-age and teenage romance territories, PAPER TOWNS pulls off two easily-recognizable efforts: maintaining 'The Fault's charm, while toning down its tragic notions. The latter of which, yields a more tangible and heartwarming result, capable of conjuring a lasting tug at the heartstrings. The credit for this goes to its equally-charming yet capable actors, both of whom teeming with fresh and enigmatic likability. It will also sound unforgivable to never pay regard to the film's brilliant screenwriters who manage to cleverly highlight this extremely familiar highschool tale's stronger and more relatable sentiments, genuinely and sincerely enough, to bend fragile emotions with crippling capacity.\"Q\"'s road trip in finding Margo represents a bigger journey with far wider scope and meaning, and it comes across as a process of personal exploration that unknowingly liberates one self, toward finding the deeper sense of their existence. Hardly that the questions thrown get resolved, but the charming and sincere take of its proceedings, will ultimately make the narrative arrive to a satisfying conclusion. This doesn't mean it's able to satisfy its own queries, but the resolution delivered are nonetheless, reliable and honest.PAPER TOWNS will come across as a witty, yet touching case of a 'lost and found'. Much of it is spent in searching for the 'lost', a liberating process that frees its seekers from every question that unfolds in the wake of a previous other, but the 'found', though never really answers any of the previous questions, will deliver a surprisingly satisfying, and never less of a rewarding, answer."
    },
    {
      "rating": "8",
      "text": "\"Paper Towns\" é um maravilhoso drama adolescente e uma história de amadurecimento. É uma mistura deliciosa de um filme para adolescentes do ensino secundário e de um filme de viagens. Só gostaria de ter visto um pouco mais de Cara Delevingne no ecrã. Um ótimo filme para ver com amigos e/o com a família!"
    },
    {
      "rating": "8",
      "text": "\"Paper Towns\" é um maravilhoso drama adolescente e uma história de amadurecimento. É uma mistura deliciosa de um filme para adolescentes do ensino secundário e de um filme de viagens. 8/10"
    },
    {
      "rating": "6",
      "text": "It is a typical teenage movie that failed to show what actual teenagers are really like .some of the charecters are also very irritating like ben . But nonetheless movie is quite charming natt Wolff and cara Delevingne did an amazing job as the lead their chemistry really work together but the ending of the movie is quite stupid . I thought that it could have gone any way other than where it went but it was quite enjoyable at times and the runtime of the movie is also quite perfect"
    },
    {
      "rating": "8",
      "text": "Majority of my Top 10 worst favorite movies are in the genre of relatable teen comedies that tries to tell a lesson. For this movie, it was unexpected and better than I thought it would be."
    },
    {
      "rating": "3",
      "text": "It's not a terrible movie, but if you've read the book before, it's gonna be extremely disappointing. See, the characters are pictured quite accurately in the book, especially Margo's, but it seems like the creators were trying to make a lame, high school movie that could be favored by most of the teenagers. So they changed everything they could, even the ending (to some extent)! And it gets even worse when the focus is not on Margo being lost and the relationship between Margo and Q, but on Q's friends instead. Overall, the story is too much altered in comparison with the book; it's changed from a mystery romance with a tiny but beautiful touch of life philosophy into this like-every-other-teenage-movie thing.The only thing I really enjoyed was the soundtrack which I downloaded and listened to while I was reading the book, before watching the movie. If you haven't read the book, you might end up being fine with Paper Towns, but if you've read the book, god, do not go with the movie, just stick to the images inside your brain!"
    }
  ]
}