{
  "id": 3106,
  "title": "Papillon",
  "starring": [
    "Charlie Hunnam",
    "Rami Malek"
  ],
  "runtime": 134,
  "genre": [
    "Drama"
  ],
  "description": "Henri “Papillon” Charrière, a safecracker from the Parisian underworld, is wrongfully convicted and sentenced to life imprisonment in the penal colony of French Guiana, where he forges a strong friendship with Louis Dega, a counterfeiter who needs his protection.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ahF5c6vyP8HWMqIwlhecbRALkjq.jpg",
  "categories": {
    "plot": 6.266666666666667,
    "acting": 5.181818181818182,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "After appreciating the 1973 original, I honestly didn't think I'd enjoy viewing the remake; but I did. Not a great movie, but enjoyable. It's primary purpose, I think, was to show how terribly cruel men can become when they're given too much power over other men. It's definitely worth seeing, but it's not for young children."
    },
    {
      "rating": "7",
      "text": "La película empieza demasiado rápido no nos explican mucho y todo parece pasar por que si, eso me hizo mucho ruido y es mi principal punto negativo pero mientras avanza la película me di cuenta que lo que realmente importa es él desarrollo del personaje en la prisión. Muy buenas actuaciones de charlie hunnam y rami malek, excelentes maquillajes y una fotografía casi impecable todo bien manejado por él director michael noer. Muy recomendable"
    },
    {
      "rating": "2",
      "text": "As I was watching “Papillon” a few thoughts went through my mind such as:1) Why did I come to see this movie?2) When will I learn it is okay to walk out of a boring movie?3) Charlie Hunnam could walk into Daniel Craig’s shoes as James Bond and I don’t many would know the difference.4) Hopefully Rami Malek’s next movie as Freddie Mercury in “Bohemian Rhapsody” will be a big hit because as he tries to make the move from television star, with his series “Robot” going into its last season, “Papillon” isn’t helping him.5) Why does Hollywood continue to spend millions on making remakes when very few are as good, and even few better, than the originals? Especially those that are thought of as classics or have had unforgettable leads?6) Does adding more violence and/or more nude males in prison make a movie better?7) Though I am not familiar with previous works of Charlie Hunnam he does express a lot with just his face and emotions he is feeling but, right now, he is not quite the Steve McQueen of the 1973 original “Papillon”.Obviously, my thoughts strayed as I was watching the movie or turning my head away with some of the gratuitous violence but the bottom line is the story screenplay and none of the actors drew me into the movie to knock those thoughts out of my head.The next remake coming up is “A Star Is Born” starring Bradley Cooper, who also directed, and Lady Gaga. I have seen and am a fan of the original and the two remakes, each for different reasons, and am hoping this new version will be the exception to the rule about remakes and be their equivalent.The bottom line is I found “Papillon” a bore and would suggest you watch the original as that is a film that Hollywood doesn’t make, a two-star action prison film epic that you really believed happened."
    },
    {
      "rating": "5",
      "text": "Everybody always says the book is way better than the movie. This book is way way way way better than the movie. That would be 4 times better but its exponential. So the book is 64 times better.Don't see this movie. Buy the book, settle in for a day, a be prepared for total amazement, inspiration, entertainment, and awe. THEN buy the next book Banco which tells about Papillons life after escape. Follow my advice be bored and waste a precious day of your life. Your choice!"
    },
    {
      "rating": "6",
      "text": "This remake of the remarkable true story sentences Charlie Hunnam and Rami Malek to the brutal penal colony in French Guiana for misery, struggle and 2 escape attempts. Thru it all, their friendship prevails. This relentlessly cruel and desperate situation is effectively portrayed, but Hunnam brings only steely determination to his portrayal…not much depth. The character weakness in Malek's character makes it easier for him to be more sympathetic. Still, this is more about the wretched conditions than about human resolve, leaving it bleak and less powerful that the story deserves."
    },
    {
      "rating": "3",
      "text": "Malek and Hunnam's performances can't save this film from the overly long run time and slow pace. So much of this film could have been edited down, Especially that near 20 minutes long solitary confinement scene, but wasn't and that's what really kills it for me. It's not exciting, It's not interesting. It's boring and it fails to keep your interest."
    },
    {
      "rating": "6",
      "text": "This is a remake of the 1973 movie that starred Steve McQueen and Dustin Hoffman.  I thought i remembered liking that movie, but I am not so sure now.  In this new version, Charlie Hunnam plays the title character and Rami Malek plays Degas.  They both do a great job of portraying their characters, and you will find that you really care about them.  But, the movie is so dark, humorless and relentlessly depressing, that it is difficult to sit through.  I kept wishing I was watching it on DVD so I could fast forward through some of it.   Because it is so dark, I would not recommend it.  But, if you really want to see it, wait until it comes out on DVD so you have the option of fast forwarding or walking away from it.   Plus it is way too long.  There were at least a few places that the movie could have been edited much better to save time."
    },
    {
      "rating": "8",
      "text": "I found this movie really interesting. Based on real events and great acting from both leads. Might be a bit slowed paced for some but I liked it anyway"
    },
    {
      "rating": "6",
      "text": "Both Charlie Hunnam and Rami Malek give good performances but lack chemistry and considering the story is entirely based on their characters that becomes a problem.It's entertaining enough but its narrative rhythm doesn't do any favors to it, especially considering the slowness with which the first half hour unfolds but the film gets recovered and although it will not leave any memorable impression or I doubt you talk about it after finish it I think it deserves the opportunity to be seen."
    },
    {
      "rating": "6",
      "text": "This movie missed a real chance to be something special. All the ingredients are there, two very strong leading roles, a story with real potential, but somehow it all just doesn't exactly fall in to place. I enjoyed myself for large parts of the movie, but also found myself desperately wishing for the end of some scenes that got dragged on for far to long. That being said, Charlie Hunnam has come a long was since Green Street Hooligans, and will hopefully make an appearance in another movie that better suits his talents. He and Rami Malek both play excellent roles, it's the writers that fail to bring emphasize the chemistry between the two characters that is obviously there (hence the coconut scene). Conclusion, this movie could had the potential to be a lot better, but thanks to it's leading actors, was still acceptable to watch."
    },
    {
      "rating": "8",
      "text": "A story about a man that was too arrogant, and got himself into jail. From that point on, his story transforms into one about heroism and strength as he never gives up on his hope to escape the hellish prison in French Genua in 1931. .What strikes me the most from watching this movie, is the sheer strength in Papillon to survive 7 years of solitary prison, and yet not give up. By the time he does escape, and probably settles in Venezuela, the world is at the tipping point of going into World War II. For this man however, that must have weight much less considering what he has been through.Despite what some critics are saying with 'this movie offers little', i judge every story for what it is. And the story in this movie was very interesting and entertaining to watch. It's an excellent movie, and i give it an 8/10."
    },
    {
      "rating": "8",
      "text": "The movie is a bit long but never boring. Its a repetitive mix between hope and letdown. What will gain the upper hand?"
    },
    {
      "rating": "8",
      "text": "I hadn't  watched the 1973 Papillon.I liked this powerful story. It made me feel Googling about it.The French Guiana is beautiful.But I didn't know there was very brutal atrocities here.I learned a lot of things!"
    },
    {
      "rating": "0",
      "text": "On dirait déjà un téléfilm… rien qu’au bout d’un quart d’heure ! et la suite des évènements ne fait que confirmer ce triste état de fait. Tout y est en effet sans relief et sans génie, tout baigne dans la médiocrité d’un remake poussif du film original de 1973, un classique à la mise en scène brillante de Schaffner et servi évidemment par deux acteurs exceptionnels…Or, ici le charismatique McQueen est remplacé par un bellâtre (pour ne pas dire une andouille) qui joue comme un pied et quant au rôle d’Hoffman, si Malek n’est pas un mauvais acteur en soi, il ne peut certainement pas rivaliser avec le monstre sacré !A tenter de visionner ce truc, on ne cesse de le comparer à son aîné, lequel malgré son âge vénérable ne s’en laisse pas compter par le petit nouveau, loin de là ! un vrai bleu-bite, ce Papillon moderne qui sonne creux et faux à l’instar de sa réalisation de téléfilm ; on s’irrite de ses maladresses, c’en devient un supplice à suivre : on arrête donc les frais rapidement et on tire la chasse, point merde."
    },
    {
      "rating": "7",
      "text": "There was no way that this remake could surpass the original Movie from 1973. After watching this version my thoughts got confirmed. But i still very enjoyed this Movie. I think its primary purpose is to show how heartless and cruel Humans can be when there are given way to much power. The two Main Actors have some chemistry together but sadly it never reaches the same Level of believable Friendship like in the Original Movie. But still if you don't expect to much you have an solid Adaptation of the Book. Overall nothing Special but an enjoyable Movie with interesting themes, so its worth watching."
    }
  ]
}