{
  "id": 4589,
  "title": "Paprika",
  "starring": [
    "Debora Caprioglio",
    "Stéphane Bonnet"
  ],
  "runtime": 99,
  "genre": [
    "Drama"
  ],
  "description": "A young country girl comes to town and works in a brothel in order to help her fiance get the money to start his own business. \"Paprika\" is the name given to her by the madam.",
  "releaseYear": "1991",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/jwlo74haG1XNmp5IdSJ5Gy3KuIm.jpg",
  "categories": {
    "plot": 7.521739130434782,
    "acting": 7.666666666666667,
    "ending": 6.666666666666667,
    "soundtrack": 7.333333333333333,
    "cinematography": 7.5,
    "familyFriendly": 6.333333333333333,
    "funny": 7.0,
    "action": 8.6
  },
  "reviews": [
    {
      "rating": "9",
      "text": "A remarkable achievement in animation. Wildly imaginative and thought provoking."
    },
    {
      "rating": "10",
      "text": "Absolutely amazing. best film on dreams I have ever seen, and one of the best films of the decade. need to see it again to delve further into the dream."
    },
    {
      "rating": "9",
      "text": "Not only does it contain the unbelievable visual beauty that is Japanese anime, it also features a taut, exciting thriller that keeps you ensnared throughout. If only Hollywood could figure out the magic that is within Paprika."
    },
    {
      "rating": "9",
      "text": "Absolutely amazing. After watching it twice on opening night, I'm still not quite sure I understand the events of the climax, but I sat through this movie with a huge grin on my face and still can't help smiling when I think about it. I sincerely hope that this film becomes popular enough to upend the \"animation is for children\" meme. I've certainly never seen animation so utterly and convincingly realistic while also showing scenery and action that's so radically imaginative. I can already tell that I'm going to have to see it in the theater a third time, and I haven't seen a movie more than once in the theater since Return of the Jedi."
    },
    {
      "rating": "8",
      "text": "I couldn't make heads or tails of this movie, but the quality of the animation and the sheer, unbridled weirdness is appealing. I'd love to talk to Kon to find out what the HELL he is trying to convey."
    },
    {
      "rating": "10",
      "text": "The truth of this film, although a nightmare to some and a dream to others, is a reality which we can no longer ignore."
    },
    {
      "rating": "7",
      "text": "Truly in a class of his own. Great flick!"
    },
    {
      "rating": "9",
      "text": "The first film I've seen that captures the shape-shifting and ineffable subtlety of dream symbolism. Jung would smile to see it."
    },
    {
      "rating": "10",
      "text": "Inspiring, memorable and downright hilarious. It's a pretty polarizing film - some like it, some don't - but it's worth your money any way you look at it."
    },
    {
      "rating": "10",
      "text": "Did I dream up this entire hour and a half mind warp? Like a dream, it jumps from one idea to the next, with a loose thread tying everything together. It has a surreal and stream of conscience technique that is sure to make your head spin more than enough. Paprika masterfully draws you in and never lets go. It's a movie like this that makes me fully realize the extent to which animation can go. The best parts of Paprika however are the subtleties that are not so obvious such as many puns and its plays on visuals. I can't seriously find a flaw in this movie. This is simply a masterpiece that deserves to be experienced. The point of Paprika is to be confused and brought to the point that you no longer pay attention to the plot but rather revel in the beauty of the animation and let the movie itself take over you. Don't be surprised if you end up having a dream about Paprika and dancing appliances after viewing this brilliant piece of animation."
    },
    {
      "rating": "10",
      "text": "Absolutely incredible. I will have to see it many more times to fully appreciate all the levels of visual and philosophical interaction that was going on throughout the entire movie. Seeing the parade of inanimate objects on its own is worth the cost of admittance."
    },
    {
      "rating": "9",
      "text": "The animation was beautiful, the story was genius, and the creativity of Paprika was beyond any anime I've ever seen. One thing irked me, though; its dull character dialogue."
    },
    {
      "rating": "6",
      "text": "The animation was suberb as in any of Kon's movies, but the story and the characters are kind of dull after all. Not to mention the soundtrack got onto my nerves. Very fascinating and imaginative dreamscapes with lots of color and weird figures is what kept this movie above average for me. I really liked \"Tokyo Godfathers\" with its heart-warming story and lovely protagonists. In the end \"Paprika\" is just a weird dream. Not a bad one, not a such a good one either. But a better one!"
    },
    {
      "rating": "7",
      "text": "I don't normally like anime, and I didn't really think Tokyo Godfathers was all that great, but I really loved this film. I love anything that has to do with dreams, and this had plenty of surreal dream imagery to keep me interested. Little has been said in the reviews about the characters themselves. Paprika herself is adorable and her scientist counterpart, Atsuko, is interesting in that she refuses to let her playful side out of her when she is herself. The odd interaction between Atsuko and Paprika makes it hard to know where one begins and the other ends. The old man that she works for is good for a laugh (sorry I can't remember names...been a week or two). The cop character is interesting and a good hero figure that we believe in. The fat scientist who creates the device used to enter people's dreams is funny and endearing, but if there were any flaw with the movie, I'd have to say that it was in not establishing enough of a connection between him and Atsuko in the beginning. It would make more sense for what comes at the end. The villains in the film are wonderfully evil. The mastermind is a megalomaniac and his accomplice is demented in just the right, creepy ways. There were shades of Silence of the Lambs in the scene where he has Atsuko pinned down on the table (or maybe it was just the butterfly imagery that made me think of it). The dreams are so brilliantly insane as well as creepy. I wouldn't even say that it's that difficult to understand as almost everyone else is saying. There were only one or two moments where I was unsure what was going on, and I was willing to forgive that because it added to the surreal nature of the film. This was a great movie. Don't discount it because it's anime, if you're the type, like me, who often does that. One of the best films this year!"
    },
    {
      "rating": "7",
      "text": "If you liked Inception, you should have a look at Paprika. Indeed, Paprika has been cited as an influence on the making of Inception. The two movies share the same theme of losing the ability to distinguish between dream and reality. Due to being an animated movie, Paprika might not suck you into the action as the real human scenery does in Inception. However, regarding surreal dream content and plot complexity, Paprika is far ahead of its American successor. One of the film's major topics is the debate about moral restrictions for science. Some critics are of the opinion that certain technologies are bad. Others claim it is not the technology that is to be judged, but what someone uses it for (f.i. the knife is one of mankind's most helpful tools, but it also can be misused to take someone's life)."
    },
    {
      "rating": "10",
      "text": "Astonishing film, just truly amazing, the film looks, feels and captures the amazing raw energy of **** if that made No sense go watch the **** film, its inception before inception.\r 10/10"
    },
    {
      "rating": "10",
      "text": "Satoshi Kon has been one of the most visionary plot and character designers in the history of animation: his premature death in 2010 meant much less chances to see another masterpiece with the same charm and thrill as Paprika, which is undoubtedly a modern classic. Ignoring its deep plot would mean ignoring the true roots of blockbuster bestsellers like Inception, and losing the film that will continue to inspire tons of science fiction plots in the future."
    },
    {
      "rating": "8",
      "text": "Last film of great anime films director, Satoshi Kon. \"Paprika\" is visual beauty and exotic. It's a ironic regard about Japanese society. Excessive obsession with technology, desire of power, problem of suicide, sexual misconduct with little girls. \"Paprika\" is a kabuki thriller. Kon has great masterpiece. \"Perfect Blue\" is an inception, \"Millennium Actress\" is an intermezzo, \"Tokyo Godfathers\" is a rest and finally \"Paprika\" is most finale. As if it were a grand opera. \"Paprika\" is beautiful farewell."
    },
    {
      "rating": "6",
      "text": "There is enjoyment to be had in PAPRIKA, I'm not going to deny that fact, though I still wish it's story and characters had been a little more inspired."
    },
    {
      "rating": "8",
      "text": "\"The Internet and dreams are similar. They're areas where the repressed conscious mind escapes.\"Not for children or the faint of heart. 'Paprika' doesn't hesitate when descending into a trippy nightmare with it's untamed imagination. It's like an anime comic book coming to life in a Salvador Dali style of surreal. Even the square frame can't contain the madness of the dreamworld. Once the song 'Susumu Hirasawa - Parade' started playing, I knew that things were gonna get weird, real fast.However, not to say the movie doesn't hold any beauty in it's dreamlike setup. All colors and animation aside, the beauty itself comes from the imagination and the amount of detail Satoshi put into the movie, which was mesmerizing.The soundtrack's great as well. It's so full of energy and joy that it doesn't matter if I didn't know what the lyrics are actually saying.I think director Satoshi Kon said it better himself:\"If you look at a dream overall, it's very difficult to discern the meaning. However, as time goes on, there might be certain meanings in the background. Movies that you can watch once and understand entirely -- that is the type of movie that I don't really like. However, if you are able to understand 70 to 80 percent of what's being relayed, and there's still some percentage left that would allow for your own interpretation . . . that's the type of movie that I do like. There might be a certain part that you don't quite understand, but there is a portion that rests in your heart.\" R.I.P"
    },
    {
      "rating": "9",
      "text": "Paprika is a kaleidoscopic and phantasmagoric animated thriller, a bewildering ride through dreams mixed with more dreams mixed with waking life. Now for some films, if you do not get what its makers are trying to say, it is lost on you. This is not so with Paprika. This is the kind of film one can watch and find highly entertaining without having much of a clue what it is about. The \"Parade of Everything\" is quite a sight for lovers of whimsy and fantasy, symbols and the surreal. While there are various weak points to the film, but there is not much point to mentioning them. Why? Well, when something goes for it on a grand scale, as Paprika does, it is better to watch and appreciate what it does right. Beyond the vibrant images, the direction does something special with the choreography, the movement on-screen. You get this wonderful feeling of animation, everything brought to life by imagination and the mind. So if you enjoy crazy dreams or the carnivale, definitely give Paprika a view."
    },
    {
      "rating": "7",
      "text": "\"Paprika\" is a good film, and I liked it, but I wouldn't really say that it's a great film. Even though the animation is beautiful and the story is pleasantly mind-blowing, \"Paprika\" lacks lasting appeal which is a big deal for me. Overall, like I already said, it's still good stuff."
    },
    {
      "rating": "9",
      "text": "A clear example that animation should not necessarily be family entertainment. With an amazing story, and dizzying as well as amazing conceptual art, it is one of the best proposals in the anime genre. It's a shame she was snubbed at the award ceremonies."
    },
    {
      "rating": "9",
      "text": "An incredible movie with outstanding animation and sound effects. I watched this movie while I was high and oh boy, sure it was something remarkable. This movie makes me feel as if animated movies aren't appreciated the way they should."
    },
    {
      "rating": "9",
      "text": "Brilliant story, original and beautiful animation. I've already seen it a couple of times and think i'm gonna re-watch it later today :)I'm a huge anime fan and this one is definitely in my favorites list. Highly recommended (in original Japanese audio like anime is meant to be watched)."
    },
    {
      "rating": "8",
      "text": "A great idea very good visuals amazing music and of course a really good story that some say inspired inception.Definitely a must watch for anime and  animation fans"
    },
    {
      "rating": "8",
      "text": "This is a slightly eery and mildly sinister anime film - it made me think of the film Inception, in terms of discussions about being able to enter other peoples dreams and the like, plus the fact that its somewhat multi-layered . The animation is pretty decent, 2D but certainly engrossing never the less. Its not really action packed as such, not at first certainly but the plot and the characters are intriguing enough to keep the viewer watching, as I say. I liked the music played in the background at times - quite atmospheric pieces that help you to feel the relevant emotion as felt by the character on screen - unsure, worried, excited/energetic etc.I liked the way lighting was used within the animation at times, with some scenes being almost, if anything, too bright - with bold, vivid colours depicting the many items on the move, having been made real by the power of the dream (you'll have to watch it to see what I mean) and in other scenes, the dull, or dark, urban settings are clearly shown as just that, dark and dim. There is a certain metaphor element to this, I suppose.I thought it was interesting how the scientist/doctor explained the scenarios, the talk about dreams and films interested me and there are some quite gripping moments, when things came to a head. There is some undoubtedly disturbing imagery present at around about an hour in to the film, which clearly justifies the 15 rating/certificate the film carries here in the UK. There is somewhat sexual imagery present, or what at first appears to be so, so be aware of that. Its certainly a quirky watch - a relatively immersive one at that.I would recommend this film to other fans of Satoshi Kon's work - this isn't your average anime film length show, thats for sure."
    },
    {
      "rating": "4",
      "text": "\"Paprika\" is not for the average joe and it never will be. Unfortunately, it is not really for the abstract artsy crowd either due to its surprisingly boring plot and resolution after one thinks about it for a while. There are not enough stimulating/creative visuals to warrant repeated viewings to fully understand what it wants to say regarding reality vs. dreams. It is a concept that has already been explored to death in films and done much better. You know there's trouble when the visuals are mostly repeated and that they are only repeated just because the plot demands for them to be interwoven. When the visuals are both boring to look at and repetitious, it becomes taxing on the brain to want to decipher the film's mystery....and that ladies and gentlemen is not a fun time at the movies."
    }
  ],
  "recommendations": [
    "your_name",
    "kubo_and_the_two_strings",
    "soul",
    "the_book_of_life",
    "beowulf",
    "the_neon_demon",
    "sucker_punch",
    "the_fountain",
    "9",
    "inception",
    "under_the_skin",
    "luca",
    "how_to_train_your_dragon_2",
    "ratatouille",
    "the_bfg",
    "the_green_knight",
    "blade_runner_2049",
    "okja",
    "the_incredibles",
    "spirit_stallion_of_the_cimarron",
    "up",
    "isle_of_dogs",
    "cloud_atlas",
    "the_iron_giant",
    "wolfwalkers"
  ]
}