{"id": 3806, "title": "Paradise Hills", "starring": ["Emma Roberts", "Eiza González"], "runtime": 95, "genre": ["Fantasy", "Science Fiction", "Thriller"], "description": "A young woman is sent to Paradise Hills to be reformed, only to learn that the high-class facility's beautiful facade hides a sinister secret.", "releaseYear": "2019", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/6DX7aKXh6ZT7W7dBZCn1c4tOBFp.jpg", "categories": {"plot": 3.2857142857142856, "acting": 4.0, "ending": 10.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 3.0}, "reviews": [{"rating": "3", "text": "The movie Paradise Hills pretends to be a presentation of woman’s predicament in this world but given its story line it is more about behavior modification by the prince of his bride to be into a docile willing mate despite the fact that his action resulted in the death of her father.  While there are a lot of extra frills in the form of attractions of this world to distract from the central theme of revenge, revenge remains the central driving force.While most reviewers thought the movie a commentary on women’s place in today’s society and the pressures they deal with, any subtext that embodies this stance must struggle against the main plot line of revenge for the death of a father.  Yet most if not all reviews see this as a scifi portrayal of the pressures that modern young women are placed under by modern society.  This interpretation seems to ignore the specifics of the plot for some of the extraneous features surrounding it.This movie was highly unsatisfying specifically because of the double track of its plot line and the imagery and devices within which the plot is set both running at odds with each other until one wonders what the author and director are trying to convey."}, {"rating": "5", "text": "I enjoyed the beautiful actress and costume. Especially, I liked Ema Roberts. The running time of 95 minutes was okay. However, the story was boring. there were a lot of holes in the story. If you like Ema, you can watch this movie."}, {"rating": "10", "text": "This movie blended the world of science fiction and fantasy effortlessly and beautifully; along with the idea of the pressure women face in today’s society it was an utterly well done movie. The casting was perfect from Emma Roberts to Awkwafina everyone fit their roles perfectly. The set design was extremely beautiful and foreboding with the thousands of flowers that hint to the unexpected end of the movie and the ornate design of the bedrooms and offices everything fit extremely well."}], "recommendations": ["the_lovers", "colette", "the_33", "anna", "high_life", "swallow", "incendies", "the_witches_of_eastwick", "allied", "alpha", "the_white_tiger", "beirut", "ex_machina", "the_way_back", "20th_century_women", "the_other_lamb", "agora", "the_last_duel", "the_road", "the_aftermath", "mary_queen_of_scots", "centurion", "the_eagle", "the_secret_scripture", "personal_shopper"]}