{
  "id": 1362,
  "title": "ParaNorman",
  "starring": [
    "Kodi Smit-McPhee",
    "Tucker Albrizzi"
  ],
  "runtime": 90,
  "genre": [
    "Family",
    "Animation",
    "Adventure",
    "Comedy"
  ],
  "description": "In the town of Blithe Hollow, Norman Babcock can speak to the dead, but no one other than his eccentric new friend believes his ability is real. One day, Norman's eccentric uncle tells him of a ritual he must perform to protect the town from a curse cast by a witch centuries ago.",
  "releaseYear": "2012",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9DZPtuYTKYxt6vzHvZ5FLThG4fl.jpg",
  "categories": {
    "plot": 7.743589743589744,
    "acting": 8.19047619047619,
    "ending": 7.916666666666667,
    "soundtrack": 7.5,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 7.318181818181818,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "ParaNorman is a very different and amazing stop-motion film, although it was impossible to expect less because is from Laika productions, the same studio that brings Coraline. To begin with the story and main character are not very original. It has a misunderstood boy who can speak with dead people, a curse of a 300 year witch and zombies. The interesting thing is the way in which the plot develops; because with little jokes and making fun of stereotypes, treat topics like discrimination, perseverance and fear. The attractive thing about fear is that this movie takes it to the next level, since this is a feeling with the power of changing who you are; so if you do not let it control you, is possible to have a beautiful life with no regrets. Another captivating thing is the sort of expressionism with which was constructed the animated characters. Apart from that there are characters that need to be highlighted like Norman and the drama teacher, apparently the only two intellectuals in a sea of unenlightened people. This teacher is especially extraordinary because in one moment she quotes Julius Caesar from Shakespeare: Cry Havoc and let slip the Dogs of War."
    },
    {
      "rating": "9",
      "text": "something i've seen in paranorman that i haven't seen in a long time: a plot twist that i didn't see coming. that upped my respect for the movie a lot. also the fact that the movie has some very interesting things to say about bullying. i liked it so much that i'm willing to forgive it for some of the more cliché moments."
    },
    {
      "rating": "7",
      "text": "The most visually dazzling stop-motion animation film I have ever seen and, while it doesn't really meet the standard of 'Coraline' or tread any new waters as far as plot goes, ParaNorman is heart-warming, funny, and all around very likable. Kodi Smit-McPhee is great as the voice of the troubled lead character, capturing all of the innocent flourishes and vulnerability of Norman. The finale is very good, raising the film to a standard higher than the hour that preceded it. Near the end, it boasts the best display of a clay-mation visual feast as I have ever had the pleasure of chowing down on and the characters flourish and get wiggling room outside of their stereotypes. It certainly looks gorgeous and is an overall warm experience, if a little scary one as well."
    },
    {
      "rating": "9",
      "text": "Every once in a while, I"
    },
    {
      "rating": "8",
      "text": "I brought my kids to this movie expecting to grit my teeth through another low intellect kids show.  What I found was one of those rare children's films that works on multiple levels....earning laughs and groans from all the adults around me in the theatre.  It funny.  Its gross.  Its witty.  And just the right amount of scary.  If not for the fact that the beginning drags a little, I would have rated it a point higher."
    },
    {
      "rating": "9",
      "text": "The fact that these so called \"parents\" are agitated over the extremely small moment where a character says hes gay goes to show your a crappy parent. The whole message of the movie is that you should be happy with who you are and don't judge someone just because they're different from yourself. If you weren't so homophobic and stupid you'd realize that this is a great message sent to your kids. So shutup and open your mind and enjoy the film. Clearly you're the type of parent that will hate their kid if they end up gay. There isn't anything wrong with this movie people, some scenes may be too intense for really small children but overall this is a great film, with a BEAUTIFUL MESSAGE! Don't listen to the homophobes, they're just dumb and don't know a good movie when they see one. 9/10"
    },
    {
      "rating": "10",
      "text": "An absolute masterpiece.  EVERY child in America needs to see this movie.  Aside from being a funny, smart, creative work of art, this film teaches some very important lessons about acceptance, individuality, friendship, diversity, and understanding that are needed now more than ever."
    },
    {
      "rating": "10",
      "text": "This stop motion animated 3-D movie is the best that I have seen.  The characters seem to jump off the screen right at you while you watch the movie.  I would recommend this movie to adults as well as children.  The subject matter is not difficult to understand.  It was joy  to watch.  I enjoyed the movie immensely"
    },
    {
      "rating": "10",
      "text": "This was a great film. I loved the story and the stop motion was done fantastic. The detail that was put into the environments is amazing. Knowing that each part of the set was hand made and not on a computer adds to the enjoyment of the film. I highly recommend the making of the film that can be found on the web. It will give you a great appreciation for what these talented folks have put together. The only  thing is I think with film could be scare some little ones. But parants should keep in mind that this is a PG and not a G film."
    },
    {
      "rating": "9",
      "text": "Focus Features and Laika made a stop-motion fairy tale in 2009 called Coraline, and it was the greatest movie ever made in history. Their second stop-motion, ParaNorman, a comedy adventure, is almost as great. Basically, it's really funny and has an amazing climax, but it's also got a clumsier pace and it's rather heavy with its themes on bullying. Then again, maybe some things need to be delivered heavily. Because people as a whole have a rather remarkable proficiency for not seeing below the surface. But really, what makes this such an excellent movie for children is the questions that parents will be discussing with their kids after viewing. While the lack of subtlety may be a little off-putting to older viewers, the moral issues it tackles are (in my opinion) extremely important for our generation's kids to be thinking about. One poignant thing I overheard after the credits were rolling was the little kids in the theatre talking about the movie and saying that their favorite character was the witch. I think that's what I admire most about the movie - it's darkly comic and fun to watch, but it's also sincere and affecting. Also, it was good of them to include a gay character in a children's film."
    },
    {
      "rating": "9",
      "text": "ParaNorman es Chicken Little con zombies, tiene la misma trama que la otra, pero es mucho, mucho mejor que la de Chicken Little, teniendo una trama interesante, buen humor, animación espectacular y personajes memorable, es impresionante que un estudio como Laika haga grandiosas películas animadas que sean innovadoras y que estén casi en el mismo nivel que las de Pixar, si la quieren ver, véanla ahora mismo por que esto es otro ganador de Laika.\rNota final: A-"
    },
    {
      "rating": "9",
      "text": "ParaNorman is definitely the most beautiful stop-motion film I've ever seen and it's made even better by its message of tolerance. It has a few scary moments and a rather morbid tone so I wouldn't suggest this movie for sensitive children under 10. It's adequately rated PG for \"Parental Guidance\" which means that concerned parents should investigate the film before taking their kids. After listening to some conservative parents on here, it's clear that they're in dire need of this lesson! I wish the story had been a little tighter, but the visuals more than compensate for the few stagnant patches. I hope to see more films like this from Laika."
    },
    {
      "rating": "10",
      "text": "Simply an amazing movie. It's like a Tim Burton movie, but it isn't. The art style is just fantastic and innocent, and the message of the movie is even better! This is probably my favorite film now, no joke. ParaNorman focuses a lot on tolerance and the movie never bored me: the visual effects were so great and so was the voice acting! It was definitely entertaining start to finish -- although it did start off weird, it quickly got to the point and surprised me!! I loved the characters and just the movie itself! DEFINITELY a must see, whatever age!!!\r Seriously people? You're giving an amazing movie a ZERO because of a gay reference? Calm down, and stop being immature. It's not that big of a deal."
    },
    {
      "rating": "8",
      "text": "This was a really good movie. A lot better than Coraline and Corpse Bride, in my opinion. It was enjoyable, and I was honestly scared a couple of times."
    },
    {
      "rating": "10",
      "text": "I saw ParaNorman with my friend for her birthday and honestly, I didnt think it would be THAT good! I loved Coraline and wasn't sure if it would be any better.. IT WAS! Seriously, it took me by surprise. Lets start from the beginning. Years ago, people were accused of being \"witches\" and \"performing witch-craft\" which includes talking to ghosts. Well, a little girl (around 10 or 11) who had the ability to see and speak to the dead was tried for being a witch, was found guilty, and was hanged. A curse was put on the town and the people who accused her. Present day, a misunderstood boy named Norman also has the ability to talk to ghosts. He gets teased and picked on in school and even his family doesn't believe him. He finds out about the witch's curse and learns that hes the only one who can talk to the little girl and lift the curse for good. I really enjoyed this movie and was really surprised with some of the language I heard. Definetely not something a 4 or 5 year old should be watching. But overall, I loved it! Can't wait till it comes out on DVD so I can see it again! 10/10!!"
    },
    {
      "rating": "10",
      "text": "The film is worth seeing for the jaw dropping stop motion animation alone and its gorgeous visual style, but combine that with a solid story and endearing characters and you've got a dynamite movie, one of the best animated films I've ever seen. I definitely appreciate the filmmakers having guts and making the world feel real: Norman has actual, realistic problems, he and the others talk like real kids, the dangers feel authentic, and in the end, the movie has a phenomenal message about overcoming adversity and intolerance. All kids should see this film, and parents should talk to them about it. And to those who were put off by the \"twist\" at the end, then I'm afraid you missed the whole point of the movie. But regardless, to anyone who loves animation, horror, fantasy... hell, just movies in general, you're doing yourself a disservice if you haven't seen ParaNorman."
    },
    {
      "rating": "8",
      "text": "I absolutely loved the movie! Actually, I liked it better than Coraline because I didn't feel like I got lost in the plot. The movie reminded of a 60's style balcony and white horror in the sense that it was a little outrageous, somewhat of a b-thriller, and slight bits comedy splattered throughout. Loved the animation too! My boyfriend didn't care for it as much as Coraline because he felt like the story went on and on and was a little too dragged out."
    },
    {
      "rating": "4",
      "text": "The trailers made this movie look funny and worth seeing. In reality it was neither. Minimal humor which may be because it was obviously not written for adults. Most animated movies contain material for both children and adults, this one didn't. We were so bored we considered leaving or switching to another movie. The look was fine, nothing special. The content was slow, obvious and far too many butt shots. Based on the other ratings here, my date and I am in the minority. This was such a waste of time and money that I'm considering asking the theater for my money back. As it isn't their fault maybe I'll ask Laika. I do leave in the area."
    },
    {
      "rating": "1",
      "text": "This movie just didn't work. The story line sucked, the characters weren't likable, and the concept wasn't good. It's hard for me to believe this actually succeeded."
    },
    {
      "rating": "1",
      "text": "Over hyped beyond belief wow this was a waste of money"
    },
    {
      "rating": "9",
      "text": "ParaNorman is the best animated film of the year that I have seen. It gives out good messages, it is funny, sweet, and emotionally depth. I never was once bored with it. I give this film 90%."
    },
    {
      "rating": "8",
      "text": "If there is one thing that Laika does incredibly well, it's creating amazing sets and characters!  Story is not as dark as Coraline, so I think that opens it up to a younger audience a bit.  Beautiful animation and art.  Can't say enough about that aspect of it.  Worth my ticket price for the visuals alone. Story is good, with interesting characters, but I felt like we didn't get to know them quite well enough, or perhaps the setup in general felt like it moved too quickly or was unevenly paced.  Skipped some opportunities, and maybe dwelled on others. Enough being a critic. Enjoyed watching this, and was floored by the amount of amazing art and animation."
    },
    {
      "rating": "0",
      "text": "The number one reason why this movie is bad is lack of a good story movie, it doesn't exist. The scary atmosphere isnt there either. The movie is very boring at times. Animations are very well done, but thats not enough"
    },
    {
      "rating": "5",
      "text": "I wanted to like this film.  I'm a big fan of animation so I go to most new releases.  Animated films with the message of tolerance are always welcome, but this film was too slow paced and unfunny for my taste.  Most of the jokes were cliche and fell flat, and it was predictable.  The realistic jokes about watching \"sex and violence\" on TV and the admission of the teenage boy being gay did not bother me at all unlike some other reviewers, but overall the movie needed more humor.  The look of the movie was great.  I don't understand people's negative reviews about the teenage girl being rebellious.  Most teenage girls ARE rebellious (many animated flicks have shown this including Pixar's \" The Incredibles\").  I thought \"Coraline\" was a better film for adults, and this one did not hold my interest as well."
    },
    {
      "rating": "8",
      "text": "A brilliant film.  It really nails the horror scenes well. They're genuinely scary and imaginative. I wouldn't let a young kid watch this lol. It has some classic, retro type music play when the zombies appear too, giving it a kind of grindhouse feel. The animation is really unique and quirky, the dialogue is funny too. A family film on a didn't level, an old school level."
    },
    {
      "rating": "5",
      "text": "Ugh, Paraboring zzzz... The most entertaining part of this movie was the end credit song, thassa-not-good. If you like watching spectacle without plot or interesting stuff going down, then you'll love this, and Sucker-Punch and Prometheus."
    },
    {
      "rating": "10",
      "text": "When I first saw the trailer, I wasn't sure if I would like this film and when I saw it, I didn't like it. I LOVED it. I love stopmotion, but that's not why I love this film (well, it's one of the reasons). All the characters are very likable. Even characters like the sister, the best friend's brother, and the school bully were lots of fun. They started out as stereotypical jerks but there's a little more to them then that.\r I also like how there's actually atmosphere in this movie. A lot of kids movies are afraid of being too scary because it's \"dark,\" but ParaNorman, for the most part, is not scary. The scene that freaked me out was the climax (same thing with Coraline, but I think Coraline's climax was scary as %$@*). I won't say what happens but even if you don't think it's scary, it's still a great scene, especially if you love animation since it combines stopmotion, computer, and hand-drawn animation.\r While it's not scary, there are a lot of elements of horror. If you like watching old grindhouse movies, you might find this interesting since the writers have incorporated their love of the genre into this film.\r I realize this movie won't be everyone's cup of tea and that's okay. I went with a friend who thought it was going to be a cute, Tim Burton-y type of movie and she ended up not liking it. I love Tim Burton's stopmotion films, but I don't know how his fans will feel about this movie. ParaNorman is more for Coraline fans. Since I am a Coraline fan, I recommend this. But I also recommend it because it was creative, funny, and touching."
    },
    {
      "rating": "7",
      "text": "This movie was funny, clever, moving, exciting, and wonderful in ways that most kids flicks can only hope to be. If your or any kids you have didn't see it yet, you're missing out on a real treat ,Will this win the oscar for best animated film? Because the only competition might be brave and this was far better than brave in my opinion."
    },
    {
      "rating": "10",
      "text": "Paranorman es uña de las Otra de las buenas Películas Hechas de la forma en stop-motion, Que Contiene Una historia tradicional Pero estafa Otros toques Que le dan Más Vida al cine. Los Personajes y los Paisajes Que aparecen en el largometraje estan muy bien realizada Hechos, y la forma En que Desarrolla La Historia De Una Manera es Versátil y tradicionalista. En conclusión, Paranorman OFRECE Una historia tradicionalista e interesante, Que esta muy bien realizada y lograda."
    },
    {
      "rating": "7",
      "text": "Very well done animation, with a great story of acceptance of the different in oneself and others. A more sophisticated animated film in that it doesn't rely on screaming parrots and potty humor to pander to children or immature adults. Highly recommended."
    },
    {
      "rating": "8",
      "text": "The greatest achievement of this film is its honest premise in favor of tolerance, which unsurprisingly includes an openly gay supporting character. Fun when should be fun, scary whet it want to scare and deep and reflexive without treating the audience as a fifth-grader."
    },
    {
      "rating": "7",
      "text": "ParaNorman never quite finds the right balance between goofy comedy, creepfest and parable, but it's still a visual treat with a good heart and one of the more genuinely moving finales of any film released in 2012.  That alone puts it a cut above the increasingly homogenized crop of family friendly animated fare being churned out at an alarming rate."
    },
    {
      "rating": "7",
      "text": "Paranorman is a mixed bag. One end the story was some great themes, deals with a\r serious topic in American history, has some adult moments, and great horror scenes. On the other\r hand the comedy feels out of place, the characters are cliché, and there seems to be a lack of\r danger. I feel like one more rewrite and removal of comedic tones could have given us a\r spectacular film. But as it is Paranorman has its flaws but there is enough good stuff in here to\r make it worth a watch."
    },
    {
      "rating": "7",
      "text": "While \"ParaNorman\" is that animation film we've all seen before at some point with a plot having resemblance to \"Frankenweenie\" in some parts, the movie still is a great family film to watch over."
    },
    {
      "rating": "9",
      "text": "ParaNorman was honestly one of the greatest movies of 2012 I think. It features a very interesting, but well written story, voice acting that fits each character perfectly, amazing plot twists, jokes that teens & adults will get & love, and one of the best movie endings I've ever seen. I know, you probably haven't ever heard of this movie or you think it looks too childish, but believe me, this is will probably end up being hugely underrated."
    },
    {
      "rating": "7",
      "text": "Technically impressive, stop motion effort which should get this film a nice, nomination at the Oscars.  A bit scary for kids in spots, but has a great message in the end about tolerance and understanding.  Basically a horror flick for the little ones.  Give this one a go."
    },
    {
      "rating": "8",
      "text": "I thought it was a pretty enjoyable movie. Solid voice acting and it looks rather unique as well. Although I am not a fan of the touchy feely movies, I thought the movie got rather sweet (in a good way) near the end and for it to touch me in such a way is very suprising considering it's hard for me to find something like that touching in the first place. I would definently recommend watching it."
    },
    {
      "rating": "4",
      "text": "It's hard to knock the premise of ParaNorman. A touch of history with a unique Halloween touch, it's likable and fun. Unfortunately, the film is surprisingly disappointing throughout."
    },
    {
      "rating": "9",
      "text": "The movie is about finding yourself and being more tolerant towards people that are different in opinion or appearance than you. Great messages that have been done a dozen time before, but there is nothing wrong with that. The film is also an homage and parody to classic horror movies. From making fun of their structure to embracing it for laughs, the movie does a great job of being original while not forgetting its roots."
    },
    {
      "rating": "5",
      "text": "This will be short and sweet. I'm a fan of animation. The trailer was enough to get me in the seat, but the movie... not so much. I really wanted this to be good. But, when it's not there, well... it wasn't.\rStill, this doesn't mean you shouldn't play it for your five year old. They seem to respond well to moving objects of various colors. So, this movie will do just fine. For the accompanying adult, though, a shot of whisky pre-film will probably be a good move. Trust me.\rOne thing did leave a positive impression. The marketing campaign for the film. The posters. The figures in display at the theaters. And, specially, the imagery that accompanies the closing credits of the film. Phenomenal stuff. Thumbs up to the art and marketing team."
    },
    {
      "rating": "7",
      "text": "The 3rd stop-motion film from Laika studios who brought us Coraline and Corpse Bride is technically state-of-the-art but the story is probably the least interesting of the three. It's maybe a bit dark for a kids movie but not rich enough a story to keep adults engaged. If you're a fan of stop motion flicks it's recommended viewing but for everyone else there are more interesting films out there I guess."
    },
    {
      "rating": "7",
      "text": "ParaNorman is a kind of film that you can love, from which you can learn those little things that happen in our everyday life but nobody bothers to fix it or do something about it. It gives a great message of \"being different from others\" and in this society, this happens a lot. Visual effects, the entire stop-motion animation is brilliant, I loved every frame of it. The voice acting is fantastic, sounds very natural and genuine that sometimes it makes you forget that you're watching an animated film. The background score in the climax when Norman is convincing Agatha is so freaking awesome and so is the animation in those frames. A couple of days ago, I was reading a review about Mitch being \"gay\" and they had given it a really low score because of that factor. But honestly, I don't care about it. It's not a big deal. And definitely not an important factor to consider when reviewing a movie especially when you're reviewing an animated feature film."
    },
    {
      "rating": "7",
      "text": "This movie needs quite a bit more plot.The whole movie revolves around the witch's curse,but what's the point?At the end,the way Norman speaks to the witch is a trifle weak."
    },
    {
      "rating": "7",
      "text": "Wow has this movie caused a lot of drama from critics. Personally i am torn on this movie. I found it to be a movie with an average plot, great art design and a very good message. Being 19, the controversial gay statement really did surprise me and give me a good laugh at the end of the movie, but seeing as this is a PG, i can see the issue parents have with it. Overall, its a cute movie with a little bit of adult humor to spice it up a bit, don't take your kids to this movie if you feel they aren't mature enough to handle a bit of crude humor, but do give this movie a shot."
    },
    {
      "rating": "8",
      "text": "Chissà quanti Norman hanno dovuto sopportare i giochi di parole sul loro nome collegato al paranormale. Rende giustizia a tutti il protagonista di questa pellicola, un ragazzo che deve tirare avanti tra i lazzi dei suoi compagni di scuola e i borbottii di compatimento (quando va bene) in famiglia perché sostiene di vedere i morti e di poterci parlare. Non è però un caso di fantasia troppo accesa: il piccolo Norman riesce davvero a mettersi in contatto con i defunti, a partire dalla nonna che continua a sferruzzare sul divano facendogli compagnia davanti a vecchi film dell"
    },
    {
      "rating": "9",
      "text": "Everything about this film is a delight. The comedic timing in the jokes is excellent, and the humour itself is often very clever, amusing misdirection. The main character is sympathetic for anyone who ever had a moment of self-awareness, or felt like some quirk makes them strange instead of unique. The visuals are wonderfully stylized, and make me think back to other visually unique media, such as Psychonauts, though with a bit more symmetry. The plot, even, takes some fairly unexpected and smart directions. Those who like to know about the technical aspects of films will also revel in ParaNorman. The production of the film is nothing short of fascinating, especially regarding the climax.\r I wasn't expecting much, and was pleasantly surprised. Highly recommended film."
    },
    {
      "rating": "7",
      "text": "ParaNorman confirms that Laika is an animation studio worth watching out for. As with Coraline, they've crafted a film that truly respects its young audience ,A savvy, intelligent, well-crafted animated horror comedy for kids should also appeal to adult horror fans as well."
    },
    {
      "rating": "6",
      "text": "The movie was enjoyable and had beautiful cinematography- however, I feel that the plot was not well paced and the writing was not particularly good. There were some funny parts, some flat parts, but the overall experience is positive. I wouldn't pay full ticket price and won't own for my home collection, but it's worth renting or borrowing once."
    },
    {
      "rating": "8",
      "text": "It's not a great animated film by any means- but there's magic in it, and all the details feel fresh and original. The whole vibe is just- to put it in a word- cool."
    },
    {
      "rating": "7",
      "text": "I got to say: This movie almost lived up to it's hype for me. The animation is brilliant. The music is fantastic. Voice acting very good. But I also felt that this is a movie I have seen many times before, at least from the point of view of the moral of the story. For an animated movie it does have some rather intense visuals that I would not recommend for little children, but still a bit tame for an adult audience. While the stop motion is very well done, it also feels a little tired. However, I highly doubt this movie could have worked if done any other way. Overall: A pretty decent movie that is fun to watch, but feels a little flat at times. Still allot of fun, and perfect for any Halloween."
    }
  ]
}