{
  "id": 1128,
  "title": "Paranormal Activity: The Marked Ones",
  "starring": [
    "Andrew Jacobs",
    "Jorge Diaz"
  ],
  "runtime": 84,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Seventeen-year-old Jesse has been hearing terrifying sounds coming from his neighbor’s apartment, but when he turns on his camera and sets out to uncover their source, he encounters an ancient evil that won’t rest until it’s claimed his very soul.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2o4vBAnORr9UnLMvWHhULGDHfzH.jpg",
  "categories": {
    "plot": 5.54054054054054,
    "acting": 5.038461538461538,
    "ending": 4.761904761904762,
    "soundtrack": 2.0,
    "cinematography": 4.571428571428571,
    "familyFriendly": 3.0,
    "funny": 5.769230769230769,
    "action": 3.857142857142857
  },
  "reviews": [
    {
      "rating": "5",
      "text": "\"Paranormal Activity: The Marked Ones\" does not deliver the scares that a Paranormal Activity movie should present, and it does not follow the last movie, this is one of the proofs that it is not a direct sequel, therefore it connects the last four or at least the first and the third, it is absurd how it is all connected, with a scientific twist that might shock you and please you or it might upset you."
    },
    {
      "rating": "1",
      "text": "Remember when the first Paranormal Activity movie came out?, remember when the developers placed cameras on the cinemas so they could record people reactions?, those days are over.\rThis movie looked way more like a comedy at the begining of it more that an horror movie, is good to make you laugh 2-4 times during the movie but not 8 times and straight from the early start of the movie, and also it looks like the O'u ija is outdated now since what it looks to be a Brain warp or some sort of kid games, I could keep **** about how not well made this movie is but i am just going to say that the only thing that actully enjoy of the movie was the effect of the Jesse, Actually this Class of movies are going deeper every single time."
    },
    {
      "rating": "0",
      "text": "Completamente innecesaria y absolutamente ridícula y aburrida. The marked ones cambia completamente el estilo de la franquicia (aquí no existen las noches) parece una mezcla entre la película Chronicle con sustos baratos y decepcionantes. No aporta nada a la historia y es absolutamente aburrida."
    },
    {
      "rating": "4",
      "text": "This is the first horror movie of 2014 and man was I disappointed. The movie awkwardly transitioned from humor to cheesy jump scares at an alarming rate. I am a horror movie fanatic and this movie only scares little kids. I'm not joking. I found myself laughing more at the actual movie than the parts that were funny. If you're looking for a horror film that will scare you making you have nightmares look elsewhere. But if your're looking for a movie that is more comical than frighting this is the movie for you. Rating: 4/10. Not a movie worth watching in the theater, it's a rental at best."
    },
    {
      "rating": "2",
      "text": "This movie is garbage. Repeated choreographed jump scares serve to punctuate the dreadfully dull 'downtime' segments that make up the bulk of the movie. The motivations of the characters make zero sense and i cannot justify half of the decisions they make in this movie. Also this movie is funnier than it is scary (which is not at all), if unintentionally so."
    },
    {
      "rating": "0",
      "text": "Wow...so what do u call a movie that's a sequel, reboot and a  disaster, well you call it \"Paranormal Activity: The Marked Ones\", I remember having nightmares weeks after the first paranormal film came out, but with this a actually laughed in this film after the Simon says part. oh and actually i want to ask, when did super powers come into all this...oh dear.\r When a studio pumps out a paranormal film in January its basically the studio telling us \"we no longer have any hope or faith in this franchise\" god knows this franchise is going the same way a; saw, final destination and all those other 'horror' franchises out their. and I'm not saying this to be a dick, i loved paranormal at the beginning but in my honest opinion it has declined the crappy, dumb, long winded action movie....\r this is no longer paranormal activity its more like \"Chronicle:the return of the tween\", this franchise needs to be exorcised, like for good -ConnorBaker"
    },
    {
      "rating": "0",
      "text": "If you look at my past reviews, some of my comments say worst movie I have ever seen. Well this movie is the worst movie I ever saw in my whole life. I'm sorry if I offend anyone but if anybody gave this movie more then a 0, you must have been totally intoxicated. The budget could not have cost more than 1,000.00 dollars and that includes paying the actors, if you want to call them that. I went with my 2 daughters, 15 and 18. My 18 year old almost threw up because of the 3 year old filming the scenes as well as me being nauseated. The camera keeps jerking around and can hardly make sence of any of the movie. My 15 year old is such a wuss that a fart will scare her if you do not tell her first that you're going to fart and she disliked the movie also. I would not leave the movie theatre till I got 3 free movie passes. And that was only because I would not leave and the manager wanted to go home. Almost got arrested because I would not leave till I got free movie passes. There is not even an ending. It just looked like the 3 year old filming pressed stop to go get his diaper changed and take a nap and forgot to film the ending. Do not go and see this low budget piece of sh*t movie. They should stop making these movies all together as none of them are worth a pile of dung. If you did or are going to watch this movie and you like it, It might be time to see a shrink, that is if you know how to use a phone."
    },
    {
      "rating": "3",
      "text": "This franchise went downhill after the first movie! The Marked Ones failed in every way, no creative scary moments, terrible plot, uninteresting characters! It adds nothing to the franchise, waste of time"
    },
    {
      "rating": "7",
      "text": "After watching the 3rd installment to the series,and seeing all the people chasing the guy in the house, without knowing who they are and where they come from, made me utterly clueless. Luckily 2 films later, i now understand. This is a prime example of what this film does for the series, it answers questions, while developing new ones. Such as what happens next.\rThe film is typical paranormal activity with the build up, camera use of course, story. If you've watched all of the paranormal activities so far, don't give up on this one. For me at least, it helped me understand what happened in the previous ones more and gave me a different perspective on the series. For good of course.\rThis is definitely a film to be missed if you haven't watched the series, as it will seem a silly stupid movie"
    },
    {
      "rating": "3",
      "text": "This movie is a complete failure. Even the parody A Haunted House has some more scary scenes, and i don't think there's actually a \"frightening\" scene. This series's just like Adolf Hitler, it doesn't know when to stop and ends up an utter failure. DO NOT ENCOURAGE THESE DUMMIES TO MAKE A SEQUEL. DO NOT WATCH THIS MOVIE."
    },
    {
      "rating": "2",
      "text": "This is probably one of the worst horror movies I have ever seen in my life. There is absolutely no redeeming qualities to this monstrosity, unless you like pointless cool effects and a POV shot movie that any YouTuber can make. I laughed more than I was afraid- which was never- and the story was so uninteresting, with a set of characters that I had no reason to care for, so much so that I actually laughed when he killed his granny or whoever she is LOL. I can't believe I wasted 8 pounds on this abomination of mankind.  off with these  movies Hollywood please."
    },
    {
      "rating": "3",
      "text": "I felt this movie held a lot of basis on the Idolatry that most spanish people believe in. This is quite a twist in the Paranormal Activity franchise and I give it some credit for changing it up. However compared to PA 3 I found this movie to be less frightening and creepy due to its lack of setting up a dynamic environment. The movie's plot held less an importance and the movie was more about an 18 year old graduate who ends up possessed by some pathetic spirit which they are able to communicate with by a light up simon says toy that lights up green and red lights to answer their questions. What a joke. I felt like this was one of those squeegee board sessions that girls have in their rooms to find out about their future and it felt highly childish and fake.\r A lot of the action scenes lacked emphasis in being scary and you will be left in suspense for literally 40 minutes until you realize when in the hell is this movie going to scare you. I swear they choose the worst moments to scare you, and the \"scare\" scenes were pretty pathetic. Im going to spoil every \"Scary\" part and let you decide: A fat lady painting on the stomach of a pregnant chick; a firecracker that explodes after a man jumps out of the apartment after he killed that same lady; the main character wakes up to find blood on his arm after some creature, the possessor, bit him; after 20 minutes of partying, he finds a girl who he takes to his residence which is currently where his grandmother lives so he decides to enter the neighbors abandoned apartment and they fail to make a sex tape when his \"chick\" is confronted with the previous man who they encountered with the fireworks; they realize that there is a ghost and the scene moves to all of them gathered at the table with the simon-led toy that only has the green and red buttons working. They only light up by \"the spirit\" and after a series of questions, the protagonist asks \"Are you supposed to be good?\" and it doesn't answer; the next scene is when they investigate the basement of the lady and find that she had some weird mojo-jojo idolatry  going down there. They confront a gangster who is brothers with the \"previously possessed one\" who gives them the phone number of a lady who knows about this  She tells them that the spirit/possessor is trying to unite a group of the \"possessed\" in a house where they will perform some unknown ritual and that the protagonist (who is now the antagonist) will be there tomorrow night. In the next scene the protagonist kills his grandma by pushing her off the stairs and then attempts to kill his friend in their car. The girlfriend hits him with a bat but they get hit by a truck that takes the protagonist to the ritual house. The main characters friend turns into the protagonist and gathers up some thugs who have weapons and they drive to the ritual house.\r After minutes of pathetic computer animated FX, the friend is trapped in a room by the possessed antagonist. He decides to open up a wardrobe in hopes of escaping but the camera is cut-off and the scene is lost in transmission (not a black cut transition) He then ends up alone in the garage of the house from the previous movie (Paranormal Activity 3). He later enters the living room where he finds a lady walking down the stairs very menacingly and slowly. She goes to the kitchen and the idiotic protagonist thinks she will help him. When he touches her, she screams and then the husband dashes to attack the protagonist but then the wife stabs/decimates him but the main character/friend escapes into a hallway where he is hit from a side door by a \"demon spawn/possessed\" person knocks him out and the camera is left facing the ceiling. The possessed lady from before is seen reaching out to turn off the camera. Fin'"
    },
    {
      "rating": "0",
      "text": "This movie is very bad. The plot is too predictable. If you have seen the other Paranormal Activity movies you know what's going to happen, and you already know how it's going to end for the main character(s). A horror movie fan won't be scared by this movie, as it only contains a few cheap jump scares.\rI recommend you not to pay to see this movie, as it's a waste of your money."
    },
    {
      "rating": "5",
      "text": "I've seen every Paranormal Activity film, and this is by far the least scary.  There are even a few laughs (when the gang members enter the witch ranch house in the end with a scatter gun and Mac 10).  I like the shift to Oxnard and the Mexican community, and I appreciate the new story (women are marked by witches and then killed after giving birth so that their first-born sons can form some sort of future army...) but when the guy walks into the wardrobe at the ranch and winds up on the first floor of the house owned by the couple from the first films, it loses a lot of credibility with me. Sure, the ranch house looks a lot like the house the babysitter runs to at the end of part IV, but how the hell does this dude get teleported to that San Diego house?  Bizarre and a bit of a cheat in my book."
    },
    {
      "rating": "1",
      "text": "I think it pointless to extend, this is not a horror movie. Each year to be even worse and spend less money. the film now ruin and very very bad. I don't understand P.A team.."
    },
    {
      "rating": "2",
      "text": "I was really bored in this i am normally never bored in a horror film even if its a bad one but this was quite boring and i didnt find it scary just a few jump scares thats all. people might like it but it wasnt for me i found it boring and not scary 3/10"
    },
    {
      "rating": "5",
      "text": "Going in I expected the normal first of January garbage horror movie instead I got an average but nonetheless harmless one.  While the film adds very little to the mythology it does have some decent suspense.  C"
    },
    {
      "rating": "2",
      "text": "Esto es una verdadera bazofia, con momentos que dan más risa que sustos, las primeras partes te hacen creer que estas viendo una comedia de terror de esas tipo Scary Movie o A Haunted House, es como si el creador hubiera dicho: \"OK, pongamos el argumento más rápido y parco que tengamos, que los personajes sea un poco imbéciles para que el público se ría un poco y se encubra nuestra porquería, llenemos la película de screamers que ni dan miedo y listo terminamos la película\". Además los screamers son muy predecibles, ni siquiera los screamers hicieron bien. Por lo tanto si eres de asustarse muy fácilmente, viste las otras películas, y te traes mucha comida a la sala de cine como para que te dure toda la película y llevas a unos cuantos amigos como tú al cine, puede que te entretengas. De otra manera, para gente como yo, es una película para ir a comprobar que es mala y ver al público totalmente susceptible que se asusta con cualquier screamer que aparece en la pantalla. En cuanto a mí no se si estoy \"marcado\" por ir a ver un filme tan malo."
    },
    {
      "rating": "9",
      "text": "this movie was not scary at all, but hilarious, which is why my friends and myself go every year after the second one the movies are funny becuase of their failure to make it any where near scary if you are wanting to see a movie to laugh at watch this one."
    },
    {
      "rating": "9",
      "text": "why did you deceive me by providing a link misleading? my computer a virus because you\rclick on the link!!! after i searched on google I finally found the correct link is>>>>>>>>>\r hxxp://free.moviess.biz/play.php?movie=2473682\r I can watch it there safely, I do not need to download it so I am not afraid of my computer virus\rI hope this helps invormasi"
    },
    {
      "rating": "7",
      "text": "Paranormal Activity: The Marked Ones is the fifth film in the franchise  sixth if you count that Japanese-made Paranormal Activity film a few years back  and at this point, audience members have had many chances to decide if they enjoy this series or not. While The Marked Ones does have a few differences from the rest of the series, it’s still ultimately following the same path, so it’s unlikely to suddenly turn someone around who has disliked the entire thing. But if, like me, you’ve enjoyed the ongoing story about a bunch of really camera-obsessed people and the spooky things that haunt them, The Marked Ones is another enjoyable chapter."
    },
    {
      "rating": "0",
      "text": "Bad movie to start in 2014,can't wait for 5th.The other one's are better then this crap,not really scary at all.If you're Paranormal Activity fan,you will be dissappointed in this."
    },
    {
      "rating": "8",
      "text": "OK just to be fair I am a fan or the franchise and of \"found-footage\" style films. Now as of The Marked Ones it's really not that different from the first 4 films. If you've seen them then you know the routine...weird stuff and some jump scares. As for me I really enjoyed this one for a couple of reasons and here's why:\r 1) The Ending  Now I won't give any spoilers but they do something pretty cool for the ending and if you've followed the first 3 films and actually payed attention to the story of The Marked Ones then you'll get it and maybe love it like I did.\r 2) More Lore Explanations  Yes the Paranormal Activity films do have a very deep lore behind them, however most people ignore what the characters do and say in the film and just expect to see scary stuff to happen which is really why the movies get such a bad rep. All of those boring scenes are actually explaining what's going on and most people don't get that. The Marked Ones actually goes really in depth as to what is going on this time around and very much so as to why it's happening. More witchcraft :)\r 3) It's Not Meant To Be For Everyone  Now let me emphasize how much I feel about this last one. These movies since the 3rd haven't been trying to gather new fans they are made for fans of these films and PA films. I love it how most people who are saying this movie is terrible even went to see it. Most people who didn't like this one didn't like 1-4 and I have a question: Why would you even see this one if you didn't like the first four in a franchise?\r Now time for a conclusion:\r Are these films great? No.\r Are they cheesy? Hell yeah and great at it.\r The franchise is meant to be a see it once and make a fun time out of it franchise. This is a fun to watch others be scared film. If that makes any sense  The movie has great effects, goes deeper into the lore, and has a great ending. It's for the fans and has been since 3. The films acting was actually okay, I've seen a lot worse so this one was actually good, it actually wasn't too scary not anymore than the first 4. The story is great IMO, I think if the first half of the movie and the first 4 did crazy things like the ending of The Marked Ones does then they would be a lot better. Don't hype yourself too much for this movie it's not the best but is it good? Hell yes! (Most likely if you're a fan of the first 4) All in all if you pay attention and think about what's going on and being said you'll understand why the movie is worth 8/10 even if just for the ending. Most people love to mainstream the hate for this series also so...decide for yourself and enjoy what you enjoy"
    },
    {
      "rating": "8",
      "text": "It was a fun movie, lots of laughs in the beginning, but it grows very dark as it progresses. If you are a fan of the franchise you will not be disappointed."
    },
    {
      "rating": "4",
      "text": "Amusing flick, but really a horse crap ending.  These found footage flicks really need to up the ante on the scares. Paranormal 2 had me pooping my pants."
    },
    {
      "rating": "8",
      "text": "Saw it.  Seriously liked and admired the direction of the movie. Explaining that Kristi and her family's story,  while pivotal, is not isolated,  but in fact part of a bigger plot effecting many people. One of the more interesting points of the marked ones was with the peripheral character Oscar. He,  in a daze of clinging to the last of his humanity, tells the main character that they have both been marked,  that \"she put it in me...  Like she put it in you.\"  and most unsettlingly goes on to explain that \"the only way to stop it is to kill yourself... Kill yourself before you hurt somebody you care about.\"  which is what he proceeds to do himself. The way that Oscar's story was attached to the root plot of the marked ones I don't doubt seeing the rest of his story told in another movie from the beginning, upto his showdown with Anna, and most disturbing, what horrible things he must have done between killing her and killing himself,  to make him give Jesse such a horrifyingly accurate warning of where their common possessions would lead if unchecked. I have always said that the paranormal activity movies offer much more individually as contributions to a very unique,  original, and ambitious saga than they do as stand alone projects.  Be that as it may, This film was loads of fun."
    },
    {
      "rating": "10",
      "text": "I'll give you a link good movie, I was tired with all the wrong link,\rif you want to download this film, follow this link\r http://goo.gl/zxYuf0\r I just want to help you to provide the correct instructions to download this movie"
    },
    {
      "rating": "10",
      "text": "best paranormal activity yet  a fantastic ride and i hope paranormal activity 5 will be good as this one but really the marked ones is much better than PA1"
    },
    {
      "rating": "7",
      "text": "If you are a fan of the franchise you will not be disappointed. Definitely a good time. Has its creepy moments, and even some comedic moments. More enjoyable with a group of friends."
    },
    {
      "rating": "9",
      "text": "DEFINITELY GIVE IT A TRY  ENDING IS GREAT !\rIt may not be the scariest movie from the entire saga but it helps to understand more about the whole \"Coven Witches\" mythology, plus it brings new details about the way in which the \"demons\" from the entire saga work. If you want to get deeper into the whole Paranormal Activity universe, you must definitely watch this movie.\rActually it is way better than PA4, and even when it has been called a \"spin off\" it has way more to do with the entire plot than you would expect. The ending may be confusing for those whe haven´t seen the first movies but if you had, you will find it quite interesting and enlightening. It is fulled with easter eggs from the other movies, which personally I founded very interesting and fun."
    },
    {
      "rating": "0",
      "text": "This flick was the worst piece of crap I've seen in ages. It's astonishing how people in hollywood KEEP working. If there were the real world, whoever was responsible for this garbage would be fired. The \"script\" was cookie cutter to begin with, then took a turn for utter absurdity.  Suggestion: if you were involved with the making of this movie in anyway, don't admit it. Instead, move on, get a job at a movie theater instead. Selling tickets or popcorn might be a better area of the biz for you to be working  in."
    },
    {
      "rating": "10",
      "text": "Great movie! Lots of laughs and scares. I enjoyed the new take on the film franchise. This film doesn't contain much filming of people sleeping which was really refreshing. Cant wait for the next film!"
    },
    {
      "rating": "10",
      "text": "I'm a huge fan of the Paranormal Activity movies and I got to say that this was actually the second best in the series. It showed that these movies had to do with something even bigger than just one family getting harrassed by a demon. Another reason why I think this is a great spinoff is by keeping the original story the same but adding elements that we didn't see before and using them as advantages. I can't wait for the next PA movie to come out and I hope they make more afterwards."
    },
    {
      "rating": "7",
      "text": "HUGE improvement over the previous third and fourth installments!!! This film ditches the highly cliche night after night camera setup in the living room and bedrooms- style, and instead focuses on the characters themselves and the actions they take in response to the paranormal events that occur around them. The cast primarily consists of Latino actors and actresses, and they manage to pull off pretty decent (and often times humorous) performances. While the scares aren't original by any means, more tension than I could 've ever imagined is built up in the final twenty minutes or so! As with the fourth film's ending, this film's ending not only scared the living hell out of me, but also surprised the living hell out of me and completely caught me off guard!!! Those who had questions left unanswered in any of the previous installments (yes, even the first film) will hopefully be satisfied with this film's ending, as it certainly solved several questions, but also left several new ones unanswered that will hopefully be answered in the upcoming official fifth film (this is a spinoff, mind you.) So overall, definitely a very fresh entry into a slowly dying franchise. Loyal fans who enjoyed the previous installments and the franchise in general will almost certainly have a scary good time with this one!"
    },
    {
      "rating": "9",
      "text": "Paranormal activity: The Marked Ones is one of if not the best in the horror series. The excellent characters, script and story is something to note in which everything is put to place, credit goes to the director for making such an enjoyable franchise. If your wanting to watch a exciting and fun movie here is your choice, your in for a blast and plenty of jump scares."
    },
    {
      "rating": "3",
      "text": "Neither fun nor scary, and packed with jump scares (surprise surprise), \"Paranormal Activity: The Marked Ones\" is further proof that the found footage genre just needs to die."
    },
    {
      "rating": "5",
      "text": "i wouldent say it was a bad movie, i just didnt like it as much as the other paranormal activity movies. I found that i couldent take the movie seriously at most parts due to it just being more cheesy and silly than scary, it actually made me laugh at some points. i did think it had good acting and effects tho, just a silly movie overall, and when going to see a horror movie you dont wanna leave calling it silly."
    },
    {
      "rating": "7",
      "text": "Sin duda es mejor que AP2 y 4, pese a que The Marked Ones tiene más humor que sustos, es mas divertida y rápida que las secuelas anteriores, pero el final me dejó algo confundido."
    },
    {
      "rating": "6",
      "text": "I liked the paranormal activity Franchise but the Problem is they keep doing the same movie every single time.The characters in this are stupid and dump.But this movie was fun watching with my mates."
    },
    {
      "rating": "4",
      "text": "I’ve never cared for any of the “Paranormal Activity” films.  Aside from being bored by them, I’ve always found them to be impossible to scare me, filled with unlikeable characters played by terrible actors and to be, all around, cheaply made.  For the most part, this latest installation isn’t much different.  The story is still simple and doesn’t have much meat to it and I wasn’t scared at all.  However, this film finally brought some decent acting to the franchise and characters that really seemed to have some depth and culture to them and was not the usual privileged rich white people who all have faces that look like a demon haunting them is only slightly worse than having a poor signal for your Wi-Fi."
    },
    {
      "rating": "2",
      "text": "Here is the scare less, pointless, and boring spin-off to the decaying Paranormal Activity franchise, the main problem is that it is not scary it just uses the same lame scares from the previous movies, the acting is somehow more subpar than the previous movies, even hardcore fans might not find much to enjoy here, so you should avoid it."
    },
    {
      "rating": "0",
      "text": "Jesus, one of the worst horror movies ever made, it sucks in almost every aspect, the script is boring and predictable as always, the sums up all the movie, and the ending, WHO THE HELL WROTE THE ENDING? IT SUCKS, IT MAKES NO **** SENSE *SPOILER* HE GOES BACK IN TIME IN THE FINAL SCENE OF THE FIRST MOVIE, SHOWS HOW THE GUY GET STABBED AND THEN JESSE KILLS HIM *SPOILER END*  THROW **** IN WHOEVER WROTE THIS, AGAIN THE HORROR TYPE MOVIE WHERE THE ENTITY CAN DO EVERYTHING"
    },
    {
      "rating": "6",
      "text": "Genuinely, my hopes were not high. Having watched and reviewed all of the Paranormal Activity franchise thus far, I have looked on as what was once an admirable and innovative idea slowly descended into nothing more than a numbers game, generating more and more revenue for less and less quality. When the first PA was made, it was for next to nothing, but for the love of film-making, regardless of its potential profit. As time has gone on, the film-making appeared to be less important, the story more confusing and convoluted and with the best will in the world, it seemed like the audience was the last consideration of a juggernaut that relied on them, yet didn't really care enough about them to offer what they thought they'd paid for.\r Therefore, it was not altogether beyond belief to maybe give this an airing with something of a cynical back foot. Not for the first time since this series began did I sit down to view the offering, all the while wondering if my life would be better spent doing something else. On occasions such as this, I always end up considering my position on my death bed, as a draw my last breath. How much would I pay to have the time again that I wasted on some of the **** I have sat through in the name of entertainment?\r Thankfully this 'cousin' of the franchise decides to change the perspective a little, focusing its attention on Jesse, who has recently graduated from high school. It is on the night of this celebration at the end of his education that we are introduced to him and his friends and family. Continuing to shoot the project from largely a first-person perspective, much like its predecessors, you are immediately familiar with the PA universe and writer/director Christopher Landon improves upon his previous writing gigs on earlier PA movies by bringing a much needed lighthearted sense of mischief to proceedings in the early scenes. Like all PA movies, of course, things start slow, even pedestrian, and you can be sure that if you're just there for the scares, you probably don't even need to take your seat for the first twenty to thirty minutes, as this time has traditionally been reserved for character development and plot setups.\r This time does enable the audience to engage with the characters, as Jesse and his friends waste time in the days after school has finished, getting into trouble with local gangs, playing with the dog and poking around in places they shouldn't. All of this, of course, is recorded on Jesse's new camera, bought from the local pawn shop with money given to him as a graduation gift. The portrayals of these characters are very good and the actors involved inhabit them completely, making the script appear natural or even improvised.\r Things only really start to get 'interesting' upon the event of Jesse's neighbours death. Anna, who lived directly underneath him had already been classified as a little odd by Jesse, given that she covered her windows in newspapers so no-one could see what she was doing inside. Furthermore, events taking place shortly before her mysterious death only confrm to Jesse and his friends that she was indeed at least a little bit unhinged.\r If you're familiar with the franchise (and you need to be, or the latter stages of the film will make no sense whatsoever) then you will know the drill. The format is pretty much unchanged, really, but with a good degree less navel-gazing. Previously, as audience members, we have been left to our own devices somewhat, sitting for long periods throughout each film at an aparently static screen, waiting for something to happen. Not so here, as the fixed point perspective of the camera in question has gone, now being carried around throughout. In this respect, and in the respect of Jesse's new abilities in the first act, you could rightly be reminded of Chronicle, for example, where the spare character is the camera itself. Not so much a prop, but more an intergrated tool lodged firmly into the narrative.\r Without giving too much away, you can guess that things go from playful, to awkward, to uncomfortable, painful and then ending somewhere around terrifying. This is not new territory for makers or viewers alike and to suggest that you get pretty much what you expect from this will come as no great surprise. It is not particularly original, but based purely on performance and a pleasant upskill in terms of scripting and direction, this episode may well have saved what was becoming a predictable money-making bore."
    },
    {
      "rating": "3",
      "text": "I hate horror movies I just find them so stupid and pointless, and this is another one of those. I have seen the first Paranormal activity movie and it really scared me. This one did not, the first half of the movie nothing scary even happens. And the second half there are some jump scares but most of them are expected and don't even scare you. Just a bland boring movie that didn't even do what it was supposed to do and that is scare."
    },
    {
      "rating": "5",
      "text": "Paranormal Activity: The Marked Ones is a 2014 American supernatural horror film written and directed by Christopher B. Landon. Released on January 3, 2014 in the United States, it is the first spin-off of the Paranormal Activity film series and the fifth installment of the franchise."
    },
    {
      "rating": "5",
      "text": "I guess it's just not my taste, but The Marked Ones sorta let me down. This is a spin-off from the main series, so it doesn't have much to do with Katie, Hunter, or the other characters other than expanding the more vague aspects of the mythology. The Marked Ones does have a decently interesting story with an ending that kinda aggravated me, and there is a bit more action in this film than the other four installments, but I felt like it was missing something. The movie was filled with a lot more jump scares than the rest of the series, most failed and only some warranted a slight jump, and there was no suspense or real fear throughout this movie. This focused more on the action and humor rather than any scares, which wouldn't be a problem for most horror movies, but when I see a Paranormal Activity movie, I don't expect to see some guy draw a dick on another guy's face. It has some mildly scary scenes, and the change of setting does give a bit more variety to the series, but The Marked Ones mostly fails to live up to the impossibly high standards set by the franchise by being a by-the-numbers found footage flick."
    },
    {
      "rating": "2",
      "text": "Watched the trailer for Ghost Dimension and remembered this horrible mess. Who came up with the idea for this movie, it's generic plot and its non scary moments, actually one jump scare got me at the end but other than that it doesn't even feel like a paranormal activity movie or horror movie in general. The one thing that at least kinda saved the movie was when he goes to this house and teleports him to one certain place that was in 1 and 3 but it also sinks the franchise PA-GD better be good or this franchise needs to end"
    },
    {
      "rating": "4",
      "text": "You know how it is with modern horror movies. They fail at passing and pass at failing as horror movies, as well as being movies period. This isn't as bad as others (Ouija, Annabelle, The Quiet Ones) but it is pretty bad."
    },
    {
      "rating": "3",
      "text": "An almost okay film in that exhausted PA franchise. The same old formula, shaky camera, loud sounds, cheap jumpscares and an overall laziness. If you're a devoted PA fan you might enjoy it a little bit, but as a an average quality horror films looking person, you might just pass on it."
    },
    {
      "rating": "2",
      "text": "Now I personally found this film a bit boring. For nearly half of the film very little supernatural happens. It was like watching candid vid clips of ordinary peoples through daily humdrum affairs. Your basic dares, shenanigans, and trivial banter permeate the screen. I had to keep reminding myself to be patient and that this is a paranormal “horror” film. The paranormal finally kicks in on the film, at first having more similarities to “Chronicles” than evil spirits, utilizing the standard special effects tricks, however it soon gets into the normal groove of paranormal. The story is a strong concept that just seems to get cluttered with half hearted direction. One cool thing about the film was the cast’s ability to make the drama, banter and interaction on screen seem genuine. The dialog maintain a constant fluidity from start to finish. There is a mild sense of inability to sell the paranormal fright from a couple of the actors when the crap hits the fan but it is minimal and soon the cast is back in sync.\r The effects and music score are standard, expectable tricks of the trade which keep “The Marked Ones” in pace with the original “Paranormal Activity” series. The atmosphere does get a little creepy but I never really felt any chills or thrills. The film really falls flat in the horror department. I can’t remember any scene where I jumped, or cringed from the fright intended pieces to this film. Again the story is a nice, fresh spin that highlights a normalized slice of life in an area of society most people don’t see. Plus I love me some bruja heritage highlighted in horror or film in general. “Paranormal Activity: The Marked Ones” is a fail in my opinion but the audience that loved the original franchise will probably like this film as well. I do need to add that the concept of personalized, in-hand, video documentary style for this film does more to help the whole found footage subgenre than hurt it."
    }
  ],
  "recommendations": [
    "unfriended",
    "paranormal_activity_4",
    "paranormal_activity_2",
    "paranormal_activity_3",
    "paranormal_activity_the_ghost_dimension",
    "unfriended_dark_web",
    "chernobyl_diaries",
    "the_strangers_prey_at_night",
    "the_devil_inside",
    "countdown",
    "texas_chainsaw_3d",
    "the_haunting_in_connecticut",
    "the_curse_of_la_llorona",
    "jigsaw",
    "escape_room",
    "happy_death_day",
    "dark_skies",
    "bird_box",
    "28_weeks_later",
    "frozen",
    "stay_alive",
    "would_you_rather",
    "the_strangers",
    "insidious_chapter_2",
    "the_purge"
  ]
}