{
  "id": 898,
  "title": "Paranormal Activity",
  "starring": [
    "Katie Featherston",
    "Micah Sloat"
  ],
  "runtime": 85,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "After a young, middle-class couple moves into what seems like a typical suburban house, they become increasingly disturbed by a presence that may or may not be demonic but is certainly the most active in the middle of the night.  Followed by five terrifying installments in the franchise, this is the original found-footage shocker that started it all.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tmclkEpjeo4Zu564gf3KrwIOuKw.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 7.5,
    "ending": 8.166666666666666,
    "soundtrack": 5.0,
    "cinematography": 7.75,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Admittedly the first parts of the movie were kinda boring. But I can't help but feel it was purposely boring to lower expectations to increase the shock value. Brilliantly made movie, the ending is one that still haunts me even days later and is probably the most terrifying scene in a horror movie I've ever seen. Honestly I can't stand when people act tough and say this movie didn't scare them. Stop kidding yourself. It was probably the best horror movie I've ever seen. And Mike R.....you paid $20 for a ticket????"
    },
    {
      "rating": "1",
      "text": "An absolute failure of a horror film. Not even remotely scary or interesting. The premise of using the camera to film everything is stupid, and the annoying acting by the main \"actors\" just make this a terrible movie on all levels."
    },
    {
      "rating": "10",
      "text": "If you think Saw is the greatest horror series of our decade, this movie isn't for you. If you think a horror movie has to have blood, gore, and in your face action then this movie isn't for you. If you think Inglorious Bastards was nothing but boring dialog, then this movie is not for you. If you enjoy movies that are based on building suspense then you will love this movie. If you're tired of all the crappy remakes that are plaguing the horror genre (Friday the 13th, The Stepfather, Halloween, etc.) then you will find this movie refreshing."
    },
    {
      "rating": "8",
      "text": "Anyone calling themselves a horror fan that doesn't recognize the genius of this has no clue. This is a landmark film in the genre, and genres need a huge kick in the pants every now and then to keep them fresh. Deserves to be mentioned with the likes of Night of the Living Dead, Halloween, Ringu, and Blair Witch."
    },
    {
      "rating": "3",
      "text": "The reason this came up so unbelievably short for me is because there was sooo much hype right before it hit theaters. The hype obviously did the job because I went to see it in theaters, there goes ten dollars I could've used to buy two old good dvds at wal-mart. But anyway literally nothing in this movie was scary at all until the very last minute and even then its not like I jumped or was freaked out, it was just the only time anything exciting happened. When the credits hit and the crowd full of stupid people were gasping and scared, I was left with a blank expression on my face and ten dollars poorer."
    },
    {
      "rating": "1",
      "text": "Take bad actors, a low cost camera, an audience who \"was among the first to experience\" this new horror phenomenon and then... well, nothing happened."
    },
    {
      "rating": "9",
      "text": "I was skeptical at first. But this movie is not that bad if you let yourself get into it. Its not a perfect movie but it is fun. Thats what i really enjoyed about it. This movie had lots of atmosphere, and i had been missing that from most \"horror\" movies these days. i really enjoyed this and it scared my fiance so now she reacts to any noise at all at night time. When a movie can get into someones head, i consider it very well done. Congratulations to the people who put this together, and I congratulate the actors for doing an excellent job."
    },
    {
      "rating": "9",
      "text": "A fine line separates good horror movies from the ones that merely manipulate our visceral reactions to things that go bump in the night. Things go bump in the night in this movie, alright, but the movie builds slowly and spends a lot of time lingering on the couple's believable shifting emotions as they try to figure out what to do by day, only to return to bed at night. Some of the night scenes are truly unnerving precisely because they do not deliver the jolts that we have been trained to expect from other superficially similar films. Ultimately, the movie does sort of revert to type, and I could have done without the final shot. But the audience I saw this movie with suffered deliciously, and I was still shaking from it hours later. Peli will have more than $15000 to work with next time he shoots a film. Let's hope the creativity that his low budget elicited from him this time around is not shot to hell by more money, and by the formulaic expectations that come with it."
    },
    {
      "rating": "10",
      "text": "This movie was really scary, The people who say otherwise are whining because either they were mad because it wasn't filled with special effects or the camera point of view. It had a sense of realistic perspective to it which made it even scarier, everyone in the theater yelled/screamed at one point or another during the movie and Kevin F. Cloverfield was a amazing movie by the way one of the best movies ever. If you do not like the camera view or are expecting a lot of S. Effects than do not bother seeing the movie but if you want to be genuinely scared than this movie is for you. It is way way way better than the Blair witch for everyone who is comparing it to that. Anyways, I will never regret buying a ticket to this movie. It had me scared of my own house."
    },
    {
      "rating": "7",
      "text": "I kept hearing it was a very scary movie from my friends and others who had seen it, so hype wasn't a factor. I have to say this isn't a scary movie. If you get chills from watching Ghost Hunters or Scariest Places on Earth, then you might enjoy this movie more than others. I do enjoy watching shows about paranormal activity, so this movie was fun to watch, but it was not in any way scary. I'm not going to give it a low score because it was overhyped, I'm going to give it an average score because that is what it was, an average movie."
    },
    {
      "rating": "7",
      "text": "This movie depends on your mindset going in. I realized I was heading into a extremely low-budget mocumentary that has benifitted from a lot of hype recently. If you walk into this movie expecting to see a multi-million dollar blockbuster horror flick then you are going to leave disappointed. For the amount of money and the talent they had available I enjoyed what I saw. Yes, it was not a two-hour special effects extravaganza, but if you walked in there expecting one then you should have saved your money. To all the bad reviewers -- I'll give you $15000 and seven days to film a movie in your house and then we can see what you come up with. If you see this movie for what it was.. I for one think they did an excellent job."
    },
    {
      "rating": "8",
      "text": "I can see why this movie would divide opinion. It's not a typical in your face Hollywood horror. No, less is more is what this is about. It's subtle and it plays on your childhood fears of the dark, noises in the night ect. It's a slow burner too so those without any patience or imagination will obviously wonder what all the fuss is about for the first 3/4 hour or so. But those who get it will see the pacing and subtly as the films greatest strengths. So give Paranormal Activity a chance. Yes, you might hate it and it almost certainly won't get to you straight away. It didn't scare me at first but it was a film that i thought about long after i left the cinema, especially when i was in bed alone!"
    },
    {
      "rating": "10",
      "text": "Agree with Andrew B. One of the scariest movies I've seen in a long time. Better than anything Blair Witch related."
    },
    {
      "rating": "10",
      "text": "I'm a male in my 30's and i've no doubt seen hundreds of horror movies in my life. When I was little I was scared of every type of horror movie (Halloween, Friday 13th etc) but being older I don't find anything scary..at all. Nowadays have a different experience watching horrors, I find them enjoyable and just entertaining. When the movies over I move on but...Cheers in a huge way to the makers of this movie to actually get under my skin for the first time in over 10 years! I WAS actually scared and creeped out by this movie! I thought it had some excellent acting and good building in suspence and I loved the look of the camera work! The makers of this movie should be really proud of themselves and this great achievement, and they should read all these negative reviews on here because it seems like they are all written by the same person...one-noted people with little or no imagination...and rating this a 0 and 1..I mean, grow up people don't be stupid."
    },
    {
      "rating": "7",
      "text": "My daughter could not watch the ending."
    },
    {
      "rating": "9",
      "text": "Loved it. Super scary. To respond to Justin M, I am also an Atheist and found it extremely scary. The film does not include anything that would be considered \"religious\". When they attempt to describe Demons, the only thing they really say is that they are \"not human\". Being religious or not really has no impact on your like or dislike for the film."
    },
    {
      "rating": "9",
      "text": "The movie is predictable but you still are waiting at the edge of your seat for the next thing to happen. Let's just say the entire theatre was silent when the movie ended scared to move."
    },
    {
      "rating": "10",
      "text": "This is possibly the SCARIEST movie I have ever seen. I don't scare easy, in fact the original Halloween was the last time."
    },
    {
      "rating": "8",
      "text": "Not scary at all, but I enjoyed it."
    },
    {
      "rating": "10",
      "text": "The low budget only adds to the frighteningly realistic feel this movie has. A genuinely scary movie which does a great job of slowly building the tension, and plays well on the fears of anyone who has even the slightest thought that there may be a spirit-world."
    },
    {
      "rating": "9",
      "text": "a very well made movie that delivers. I felt it lived up to the buzz and hype."
    },
    {
      "rating": "10",
      "text": "Omg! Creepiest scary movie I've seen in a looong time! Didn't need to use cheap scares either. I can't remember the last time I came home from a horror movie and was freaked out in my own home."
    },
    {
      "rating": "8",
      "text": "Slow, creeping dread interspersed with jump-out-of-your-seat shocks. A top-notch horror flick without the gore. Paranormal Activity deserves all the hype. Don't miss it!"
    },
    {
      "rating": "7",
      "text": "This movie did a good job of building suspense in you, it had it's comical moments. Overall, it was alright - nothing that stuck with me for longer than 4 to 5 days."
    },
    {
      "rating": "10",
      "text": "Creative, cleaver, scary, entertaining."
    },
    {
      "rating": "6",
      "text": "I'll admit that the climax was the most disappointing segment in the entire film for me, falling back on the common cliches that seem to plague the recent lacklusters of it's genre. The film did do a good job of avoiding the ladder up until that very point. Plus, the performances were fine only when the \"paranormal activity\" wasn't occurring. When the lights went out (...& on again.) & the door(s) starting slamming, I felt the characters were \"ready for their close-ups.\" But all & all, the building suspense & the relentless tension provided the qualities that seem to be such rare gems these days in the latest installments of the unsatisfying chip chills/thrills horror."
    },
    {
      "rating": "6",
      "text": "Was decently made despite the obvious low budget. Definantly has a real fear affect because of the this is really happening approach. Was a little slow to begin, took over an hour to get the haunting type things but maybe that was for the better. Decent movie, good idea, maybe not executed at a 100%"
    },
    {
      "rating": "9",
      "text": "Slow but realistic and sets the tone of believability. This could be your friend or neighbor and you'd believe it too. The end was worth the wait through the sluggish dialogue. The last 30 minutes are terrifying, goosebumps for another hour."
    },
    {
      "rating": "10",
      "text": "The budget is the only reason i gave this a ten. The scariest and just plain good movie i have seen in forever. Can't wait for the DVD release. Go in and treat it as a movie and you will see the genius."
    },
    {
      "rating": "10",
      "text": "I'm giving this movie a 10 because it is just flat out scary."
    },
    {
      "rating": "10",
      "text": "So, you remake 'poltergeist' with a 15000 dollar budget and you have 'paranormal activity'. it has a simple set up; a man and a woman start taping their evenings at home and asleep to capture some supposed bizarre phenomena. at first these nocturnal happenings are small, subtle and amusing but with each evening passing they grow into something wholly unsettling and then finally, horrific. a lot of what works here is the use of anticipation on its audience. i enjoyed how some practical effects worked on a very subtle level to generate some genuinely spooky moments. the actors were great and wholly believable as an ordinary couple trying to figure out how to deal with the situation. i had a good time given the nature of this beast."
    },
    {
      "rating": "9",
      "text": "Like others have said, a slow build up but well worth it. I have not truely been scared after seeing a movie in quite some time, and this movie was just the fix I needed."
    },
    {
      "rating": "8",
      "text": "I was amazed at how tense this movie got as the minutes went by. like other people have said, don't go into it expecting a typical hollywood flick, because this is exactly the opposite. the less is more gimmick is revived in full force. the beginning is slow but necessary for the setup, but the last 30 minutes of the film are just amazing. as low budget as it is, it more than makes up for it in the ingenuity the director shows with what he had to work with. the point is, go see this movie!"
    },
    {
      "rating": "7",
      "text": "Hype scares me more than any movie. It has the innate ability to either totally corrupt or empower a film. In this case, I wouldn't say the hype totally destroyed this film however it didn't measure up to what some of the critics were hailing it to be. There were definitely some scary moments and at one point I let out an empowered \"what the fuck?!\" but 'Paranormal' won't hold up on any all time list. Peli does put forth an amazing effort at utilizing minimum production for maximum effect, I'll give him that and the acting was incredibly organic and therefore believable. However, aside from the barrage of jump out scares this movie is a clever and plodding build-up to a somewhat obvious result. Definitely worth seeing, but by no means will this be locking arms with 'Exorcist' and 'The shining' at any point in the foreseeable future."
    },
    {
      "rating": "10",
      "text": "Amazing work and truly frightening. I just got home from seeing it not too long ago and I hope I am able to sleep at some point. Definite classic"
    },
    {
      "rating": "10",
      "text": "Scary, scary, scary!!"
    },
    {
      "rating": "9",
      "text": "I have not been this creeped out by a movie since The Sixth Sense. I really enjoy horror movies, but usually just because of how absurd they are and how comical that makes them. I got shivers down my body several times during this film and memories of scenes haunted me for the next few nights. A very good movie that hopefully will be getting wide release soon (maybe in time for Halloween?).."
    },
    {
      "rating": "10",
      "text": "One of the scariest movies I have ever seen. And like many have said before me, I could not sleep at all last night after seeing it."
    },
    {
      "rating": "8",
      "text": "I actually would like to give this a higher score, but I am inclined to keep it at a 8 because to me it is not as scary as most of the marketing material touts it to be. I say to me because since the film does deal with demonic possession, I feel half of the fear generated by the film is one of an individual's beliefs and faiths, and since I am myself an Athiest, I do not find myself terrified by it like others, possibly for that reason. The film is terrific to watch, even though I was not scared, I was constantly entertained, and due to that it at least deserves a 7. The visual effects, though subtle, are extremely well pulled off, especially for be shot by a personal camcorder, and the acting is believable since the leads have a great chemistry and most of the script is improved. But as a reviewer has stated above, a great deal of the tension and that the viewer feels and takes away with them is all generated by their own personal phobias, and that is exactly why this film works differently for some rather than others."
    },
    {
      "rating": "10",
      "text": "It took me 13 years to find a movie that didn't just illicit cheap \"jump scare\" tactics like so many horror flick today--I've been searching all these years for a movie that would build suspense to a boiling point and then unleash hell that would leave me secretly terrified for weeks. This is that movie. Thank goodness someone still has talent to make movies like this."
    },
    {
      "rating": "9",
      "text": "Everybody who didn't find this movie scary and believed it was funny are all a bunch of idiots. Yeah you know who you are...morons."
    },
    {
      "rating": "6",
      "text": "It certainly does have a believable creepiness about it, but there is way too much where nothing happens, the bickering and so forth. So much happens at night when it"
    },
    {
      "rating": "9",
      "text": "The fact that not much happens during most of the film yet was able to make my heart beat really fast every time they went to bed, is a testament to the fact that the filmmaker actually has some talent. While i liked Blair witch i feel that this completely understood how real people that may or may not believe in ghosts would react. I see this director actually doing something substantial with his success."
    },
    {
      "rating": "6",
      "text": "Not bad. Had it's creepy moments, but certainly not worth all the hype. The movie borrows from several different movies (Blair Witch, The Ring, Japanese Horror movies) making it completely unoriginal. Nifty special affects, and use of sound are pretty impressive considering the \"hand-held\" documentary styled filming."
    },
    {
      "rating": "7",
      "text": "I thought this film was well done. I would say that it is far from being the \"scariest film ever\" but it does a great job of building tension for certain parts. Unfortunately that building of tension sometimes veers the film off into some boring moments that drag the film down. I found the buildup to be tremendously slow at the beginning, and couldn't believe that this movie was carrying so much \"hype\" with it. Once you wade through a lot of that boredom, though, you are paid off with a pretty good final act. I actually think the hype did this film an injustice. Proclaiming it to be the \"scariest\" film ever may have put people in seats, but when the movie doesn't deliver on that promise, a lot of people will be left disappointed. All in all, though it is worth the price of admission for some good Halloween season thrills."
    },
    {
      "rating": "10",
      "text": "Horror movie that delivers!"
    },
    {
      "rating": "8",
      "text": "Definitely builds a good sense of dread with several hair-raising scenes that will stay with you. Considering the budget, very effective."
    },
    {
      "rating": "9",
      "text": "Very good movie to what it proposes. It doesn't promise much, but it's a good movie to get you scared. You probably will be able to sleep just well at night. But that's ok."
    },
    {
      "rating": "9",
      "text": "In true \"Blair Witch\" style, Paranormal Activity makes you believe that what you are watching is actually happening. The gradual buildup throughout the film keeps viewers on the edge of their seat as things begin to intesify as the film progresses. Think of it as the Blair Witch project except things actually happen."
    },
    {
      "rating": "9",
      "text": "Anyone who said this was boring or needed special effects clearly knows nothing about film. The minimalism of \"paranormal\" was pure genius, and the writing and acting were so natural and incredibly believable. So what if it looked like a YouTube video? It was SUPPOSED to. That's what made it so believable, and therefore, very scary. The build-up was well-paced and built up to a terrifying climax. The end though, was admittedly, sort of a cop out. \"Katie was never seen again\" ? (or whatever) Lame. But everything else was great."
    }
  ]
}