{
  "id": 2863,
  "title": "Paranormal Activity: The Ghost Dimension",
  "starring": [
    "Cara Pifko",
    "Olivia Taylor Dudley"
  ],
  "runtime": 88,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Using a special camera that can see spirits, a family must protect their daughter from an evil entity with a sinister plan.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4R4DWo10V6CGq9wCRYoOubL1w2q.jpg",
  "categories": {
    "plot": 3.8260869565217392,
    "acting": 4.7,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 0.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "A laughably un-scary, joyless mess. The 3D is useless, the story is predictable, and the dialogue is horrendous. We can only hope that this is the final \"Paranormal Activity\" film in this lazy, obnoxious series."
    },
    {
      "rating": "3",
      "text": "The Ghost Dimension is largely devoid of any genuine scares it is all loud noises accompanied for by **** cgi imagery, the characters are also  some of the dumbest ever conceived."
    },
    {
      "rating": "0",
      "text": "All I ask is that you don't waste a single penny on this movie. You'll find yourself bored in this film that delivers hardly any scares, and overall makes you laugh more than scream."
    },
    {
      "rating": "3",
      "text": "\" In September 2009, A screening was held in Hollywood, California\" - \"This audience was among the first to experience the movie \"Activity Paranormal\" - \"This is what they saw...(scares, tremors , sufferings , cries , paralysis , total shocks and traumas for all life)\" - \"Experience it for yourself \"    were the mottoes that they terrified to the entire world, with the shocking \"Paranormal Activity. This movie was an ultra- cheap spook show that managed to attract huge audiences that were lured in by its low-fi aesthetic, and the central gimmick of being presented as a collection of home videos made by an ordinary couple hoping to capture evidence of a supernatural entity. They had two chances, present in each film different and innovative ways to link the stories or just give us the same it , generating small changes and scaring ridiculously.\r Obviously , they chose the second path increasingly discrediting their sagas.The formula that have so far included a straightforward (sort-of) sequel, a retro-themed prequel set in the '80s, a version centering on hip teenagers with their smartphones and their complicated pants and a spin-off aimed at Hispanic audiences. Now \"Activity Paranormal The Ghost Dimension\" the sixth time this changes nothing , the same cheap scares and supposedly the 3D would be the boom of this movie (That was not the case ).\r \"Activity Paranormal\" is a decaying saga that began sadly with a truly terrifying film. Nowadays, \"Ghost Dimension\" introduces us to Fleeges—dad Ryan ( Chris J. Murray ), mom Emily ( Brit Shaw ), their adorable moppet Leila ( Ivy George ) which like the other tapes gradually strange events happening around Ivy , cameras, night shots , possessions , called, the priest , Toby, witches , Kate and Kristi , etc.\r Why a ghost that appears in the middle-night  in form of ectoplasmic entrails? That will never scare, It's awful. Supposedly for be  the completion of the saga the paranormal center was the worst choice\r The surprise factor was 3D format, really it was like seeing the movie 2D format, small ectoplasm in front of you and cheap jump-scares for and spontaneous appearances of the ghost is the movie's 3D. Format 3D, typical introduction to end a saga (Friday 13).\r It really is the worst movie of the saga, frankly for be the alleged termination of the hit (low budget- big profits) it was not the best way.The most interesting part of this release was the revelation of the secrets to finally solve the riddle that existed between Kate and Toby.The strange thing is that Kate began this story\rWhere is she in this film? Is it fair? Why Toby? It is totally incoherent.\r \"Activity Paranormal The Ghost Dimension: The sole function of this film is to solve most of the questions and complete the saga.\"\r \"Ghost Dimension: Ultra-predictable, boring, simple. And at last Toby did its job. You accept it, Paranormal Activity (The first) will never be the same. It is unique.\""
    },
    {
      "rating": "2",
      "text": "Muy mala película. Llena de sustos baratos y predecibles, acompañados de un feo efecto 3d que, para ser sincero, solamente pudo empeorar la experiencia"
    },
    {
      "rating": "0",
      "text": "Horrible Horrible Horrible Horrible Horrible  Horrible Horrible Horrible Horrible Horrible  Horrible Horrible Horrible Horrible Horrible Horrible Horrible Horrible Horrible Horrible Horrible Horrible. Dumbest movie ever!"
    },
    {
      "rating": "1",
      "text": "My very first experience with a Paranormal movie, a film so terrible it relies completely on endless jump scares, a story that makes no damn sense cause when your house is haunted and your child being tormented by a black cloud of smoke (or a ghost apparently) then the only thing to do is run around the place carrying a massive camera, bumping into walls and screaming every five minutes. Worst of all this sorry excuse for a horror movie just went full Blair Witch Project. Not recommended."
    },
    {
      "rating": "1",
      "text": "Maybe they'll permanently terminate this franchise or keep on using it to make a whole load of money. It's up to the distributor to come up with discussions."
    },
    {
      "rating": "3",
      "text": "This is supposedly the last film in the \"Paranormal Activity\" series. I sure hope it is. This brainless sixth instalment is filled with lazy jump scares and stupid sudden loud noises."
    },
    {
      "rating": "5",
      "text": "This is a amazing horror movie, i just loved the 3D effect and the scary scenes at all, this is not the best Paranormal Activity movie but is good to watch at midnight"
    },
    {
      "rating": "10",
      "text": "I really do not understand why so much criticism of the horror movies, it was a movie with homey feel with a history drama, would not be the same negativity, terror is often not taken seriously, let's take a chance, I enjoyed the film"
    },
    {
      "rating": "10",
      "text": "Excelente final para a grande saga de terror, obviamente merecia mais produção por ser o último da franquia mas está agradável porém não superou o 3"
    },
    {
      "rating": "8",
      "text": "PA: The Ghost Dimension, is an excellent addition to the horror series. Defiantly one of the scariest, especially with the new technology of 3D and brilliant effects. However The Ghost Dimension's barely progresses the story line and answer very little questions. I'm excited for bigger and better things in PA."
    },
    {
      "rating": "0",
      "text": "I have been a loyal, die-hard fan of these films ever since the first one became a hit back in 2009. The terror of the unseen and unknown intrigued and frightened me from the very start. And even as the sequels began to diminish in quality, I held my head up high and stuck with them and kept coming back for more every year, because there was always something good or at least a decent scare or two to be found in each one (at least for me.) But with this sixth and final installment that I've been waiting for for the longest time now,... I'm simply at a loss for words as to how to describe this film or sum it up. But I'll put it like this: This is EVERYTHING a Paranormal Activity film shouldn't have been!!! Not scary! Rushed! Absolutely no payoff! Lots of scenes from the trailers missing! No appearance of adult Katie, who was in every past film and was crucial to this franchise! Pitiful 3D and effects! Questions the filmmakers promised would be answered but weren't! However, I would've been willing to be more generous and forgive all of that if it weren't for one thing and one thing only: The ending! The ending not only did absolutely nothing to wrap up the franchise or tie up any loose ends, but also felt like the biggest middle finger I've gotten from a film in a looong time! So overall, as a film-goer I feel disappointed, but as a huge and loyal fan of these films, I feel insulted and like I've been slapped in the face!"
    },
    {
      "rating": "7",
      "text": "Un final abierto para variar en donde todos acaban muertos, considerando que hasta hace poco esta era la última de la saga, no significa nada bueno, porque si bien a mi parecer es más entretenida que PA2 no la supera en historia, la cual cobra más fuerza gracias a esta película, pero si supera a PA4 en todos los aspectos, el gran error es que aquí quisieron profundizar y desarrollar la historia central de la saga pero al final dejan todo a mitad de camino.Como dije antes, la encontré entretenida, los efectos especiales estuvieron bastante bien considerando el bajo presupuesto, pero el propósito de la tecnología 3D aplicada en esta película es obsoleta, así como varias películas de terror de los años 80 cuyo único propósito era arrojar cosas al espectador en vez de crear sensación de inmersión como es debido.Buena entrega de Actividad Paranormal pero para ser el cierre de la saga deja bastante que desear, espero que con la siguiente película en producción equilibren bien la historia con los sustos, ya que esta se basa casi por completo en jumpscares, que si bien funcionan, sólo sirven para tapar un mal guión."
    },
    {
      "rating": "4",
      "text": "This movie just isn't very good. There's a few seconds of ingenuity with the 3D effects of the Ghost Dimension but then everything just goes bland and stays that way. I guess technically the \"mythology\" is solved, mostly, but maybe it would have been better if it hadn't been. This franchise is clearly dead, I'm not sure what the point of this even was. It would have been better served leaving us \"wanting\" and just dropping off the face of the Earth."
    },
    {
      "rating": "0",
      "text": "Good riddance this franchise is over with. I used to be a big fan of Paranormal Activity, but since #4 in 2012 I was less impressed and started to get my money back. I was trying to see The Ghost Dimension in my Edwards Theater and it wasn't even in the schedule. I don't know maybe it's the dimwits at Paramount started to choose this movie in theaters and added on salted wounds, video-on-demand (VOD). Why VOD? This didn't even came out yet on DVD/Blu-Ray until the next 5 or 6 weeks until their run is over at the theater. I don't wanna say anything new to this alleged \"final\" movie in the series that was once scared the hell out of me until the moment of truth arrived. Same characters, weak story, and a tired blend of paranormal ghosts led to this film being unwatchable. It's just that I was initially throwned down by the gauntlet and all I get was: another \"Paranormal Activity\" movie. I've had enough and decided to watch the \"Saw\" movies instead. Ghost Dimensions is a total wreck, indeed. I wished they should reboot the series at some point."
    },
    {
      "rating": "3",
      "text": "Overused ancient stuffs, now with glitches and cheap 3D as gimmicks.\r The overwhelming flaws date back years ago from the last three or four movies. Its narrative is a poorly told jumbled mess, and with this other dimensional gibberish, it's not getting better. The new activity it tries to sell is nothing more than superficial effect heavily borrowed from recent Poltergeist movie. For all the weak elements, the worst issue is it's simply not scary.\r Another movie another family. As expected the focus is with the child, we've seen this plot so many times in this year alone. The daughter is speaking with some sort of entity while the family spends half the movie arguing about how impossible it is, despite finding literally stash of evidences of strange occurrences.\r It has a few nifty twists with more usages to the tapes, but even this gets old fast. The rest of videos  are rehearsed falling objects, out of focus camera shots and conveniently placed glitches. There's barely any sense of investment even as the movie tries so hard to set the child as sympathy bait.\r It all comes down to typical lines, \"Who are you talking to, dear?\" for almost the entire movie. Not to mention, just as the plot looks like it's moving the conversations are edited out to push another tired living room shots as whatever entity residing there fools around with the family.\r Also, for some reason, it uses nauseating filter and bad contrast as supposed supernatural effect. It's not a good idea to fiddle with perspective, especially for a found footage movie. Without spoiling anything, the entity apparition is nothing to be excited about. The apparition is as bad, if not worse, than the tedious wait.\r This is one of rare instances where I was drowsy when watching a movie, a feat that even its predecessors or other found footage films failed to do. There's no thrill in this or whatever dimension the movie spawns from."
    },
    {
      "rating": "0",
      "text": "Yet again, I ask why anyone thinks this is a genuinely good movie. I not only question your tastes and it scares me more than this film is what you think a good movie is. What ruins this movie is that the plot of it makes zero sense. Time travel, Hauntings, call-backs to the previous films (which were sequel prequels). It's an utter mess of a movie."
    },
    {
      "rating": "6",
      "text": "Paranormal Activity has never been a really good saga but it was still at least a little bit entertaining.This movie had a great premise but it unfortunately fell into the clichés and the CGI effects were horribly bad.The acting was not that bad and the movie was entertaining (mostly due to the last half hour) so it was not a complete waste of time."
    },
    {
      "rating": "3",
      "text": "If this is supposed to be the end of the franchise, what a whimper to go out on. After the dismal fourth film and the interesting fifth film that breathed some new life into the franchise, Ghost Dimension offers little more than a few effective jump scares and a wholly unconvincing plot."
    },
    {
      "rating": "6",
      "text": "After two years of its release date being pushed back further and further, Paranormal Activity fans can finally see the alleged ending to one of the longest running ghost franchises of this generation. If this will truly end the series is definitely up for debate, but I think it did answer the big questions pretty well. The sixth Paranormal Activity takes place a few years after Paranormal Activity 4 and, like the previous two sequels, involves a new cast of characters, the Fleeges: Ryan, his wife Emily, their daughter Leila, Ryan's brother Mike, and their friend Skylar. You can guess what happens next: rich white family moves into a house, weird stuff happens, then demons. But every PA movie has their own gimmick, and that's where the \"spirit camera\" comes in (or whatever it's called). This camera can actually see ghosts and demons, so we can actually see Toby. It's an interesting idea, and it's generally used pretty well throughout the film. It's probably one of the better gimmicks in the series, although I don't think anything could rival the rotating fan cam from part 3. Because we can actually see the activity through this camera, The Ghost Dimension is probably the flashiest and definitely the most effects-driven Paranormal Activity flick. The special effects look pretty good for a low budget movie like this, even though there are a couple of cheesy CGI shots towards the end. Unfortunately, the scares are obviously the result of being the sixth movie in a franchise, as most of them miss rather than hit. The static shots are still rather effective, but those can only go so far in terms of scare factor. Something else that somewhat disappointed me was how short this movie felt. I didn't think this movie was rushed at all; it just felt incredibly short. Maybe because it was more fast paced than the other movies, or maybe because this Paranormal Activity only took place over 8 nights instead of the nearly 20 the other films chronicled. That didn't make the movie bad so much that it just bothered me. The Ghost Dimension ended the series on a reasonably satisfying note, but it's time for the activity the come to an end."
    },
    {
      "rating": "1",
      "text": "Multiple sequels have a tendency to lose their edge and this series is no exception. If you haven't seen the first movie check it out - it's entertaining, unlike this boring \"final\" entry\" - if this makes any money they'll doubtless find a way to spin it out one more time."
    },
    {
      "rating": "6",
      "text": "This film was is the \"last installment\" of the Paranormal Activity franchise, and it doesn't exactly go out with a bang. The film is decent at best and ends just as open ended as the previous films. This film attempts to relate itself to the third installment (my favorite) and does a mediocre job at doing so. The film needed tie the majority of its loose ends and leave the invested viewers with a sense of contentment, but it doesn't. The effects in this film vary from pretty good to absolutely brutal and the 3D is not utilized properly. 3D in my mind at least is there to put the viewers in the film not to sling **** at them, and this film flings more **** at you than a pissed of monkey on miralax. With that being said, the repetitive jump scares continue to be 90% of generates fear and a lot of them are just people walking into frame. Now what did Paranormal do right this time around? Well, that acting is not brutal, and for the most part feels pretty natural and real. When i heard that we would actually see Tobey in this film i was skeptimistic, due to the fact that what you can't see is always scarier that what you can. Although for the most part (when the VFX weren't crap) they made him a very intimidating character, and did a good job of revealing his form and size. At the end of the day you know that the film isn't going to be perfect, and if you keep your expectations low then you will enjoy this film."
    },
    {
      "rating": "8",
      "text": "If this is the last in the series, then the franchise has succeeded in going out with a bang - a bunch of them, actually, and at least a couple should have you involuntarily twitching in your seat.\r Watch it here http://www.watchfree.to/watch-2a4499-Paranormal-Activity-The-Ghost-Dimension-movie-online-free-putlocker.html"
    },
    {
      "rating": "2",
      "text": "Sad to see one of my favorite horror franchises become a shell of its former self, but that is what happens with The Ghost Dimension.  No Katie, no continuity, and no answers to franchise fans' biggest questions make this one a whimper of a \"finale\".  And worst of all - no scares."
    },
    {
      "rating": "3",
      "text": "Let me assure you that you really don’t need to see this final installment, as even a desire for some kind of firm conclusion to the series' overarching story won't be satiated.\r There’s a part of me that feels the need to applaud the Paranormal Activity series. There are a number of terrible horror franchises out there, but few have been as financially successful while managing to trot out the exact same set up and execution year after year. But while credit is due, that doesn’t mean that entertainment has been had – and keeping in tradition with its predecessors, the sixth and final installment, Paranormal Activity: The Ghost Dimension, does nothing to break away from formula and is yet another boring, creativity-lacking sequel.\r Even bothering to explain the plot of the film feels repetitive, because surely anyone who has ever seen one of these movies knows exactly how it’s going to work. A couple of young parents (Chris J. Murray, Brit Shaw) find that their young daughter (Ivy George) is acting all kinds of weird and talking to an invisible friend named Toby. As a means of uselessly combating what’s perceived to be evil forces, cameras are set up around the house to document any paranormal activity… and night after night of spooky stuff passes, all eventually leading up to a violent conclusion.\r There is one gimmick that makes Paranormal Activity: Ghost Dimension stand out compared to its predecessors, but it would be tremendously hard to argue that it’s actually a beneficial extra. Towards the beginning of the film, the husband/father, Ryan, discovers an old custom camera that seems to have the ability to view spirits and energy from the spiritual dimension. More than just taking away the suspense that comes from the movie’s antagonist being invisible, thus heightening the scare factor, the big addition that it unfortunately supplies is big black globs of bad CGI that float around in any scene meant to feature Toby’s presence. Of course, this also leads to more than a handful of moments where said big black globs of bad CGI fly at the screen in jump-scare fashion, but it’s less pulse-pounding and more exhausting and tired.\r Weirdly, 3D has an interesting role to play in the movie, as only scenes featuring the titular “Ghost Dimension” mess with the audience’s perspective, but stylistically the film is a total snore. One of the best ideas that this franchise ever came up with was strapping a camera to an oscillating fan in Paranormal Activity 3, but director Gregory Plotkin offers none of that ingenuity. All of the scenes at night – where the big ghostly action happens – are shot from three different angles (one looking at the hall and two positioned in the little girl’s bedroom), and there is no effort made on any front to actually make the found footage style more visually interesting.\r If you’ve stuck with the Paranormal Activity franchise to this point, loving each chapter leading up to this, there is a very good chance that you’ll enjoy Paranormal Activity: The Ghost Dimension. Long, boring still shots, easy jump scares, and repetitive morning after freak-out sessions seem to be right up your alley, and if you find it entertaining, then I say more power to you. If you’re like me and got sick of these movies five years ago, however, let me assure you that you really don’t need to see this final installment, as even a desire for some kind of firm conclusion to the series' overarching story won't be satiated."
    },
    {
      "rating": "10",
      "text": "This was the best out of all of them! It was scary, well acted, Toby was awesome, and I'm sad that's it the last of the PA films. Blumhouse has done it again! Don't listen to the critics, watch it!"
    },
    {
      "rating": "0",
      "text": "Im a keep this quick bc this movie is a waist of time. Atrocious  acting, stupid jumpscares, this movie has no positives what so ever. And im sorry if someone thought this was going to be good. Stop making paranormal activity's!!!. STOP IT!!!!"
    },
    {
      "rating": "0",
      "text": "We know the things that make Paranormal activity a great horror movie, right? well, let's watch a new Paranormal activity that have 0% what the first movie have.\r Ghost Dimension is by far one of the worst horror(not even scary) movies ever made, so poorly made and so poorly executed. Why do we go to the theaters and watch a horrible CGI demon haunting a family doing some stupid things and CGI and CGI EVERYWHERE!!!!!???\r Finally Paranormal activity gets his end, because we all wish that this franchise go to a limbo."
    },
    {
      "rating": "4",
      "text": "Pretty decent.This is another film from the Paranormal Activity franchise, but I confess I didn't find anything big. The story of the film is very imaginative and creates a forced connection between an apparently normal family and the family of Katie and Kristi, the two main characters in the initial films, and the thread of the whole story. And I say forced because the connection created never seems credible or natural.It all starts with the discovery of a strange video camera and a collection of tapes. The family quickly realizes that it is a different camera, that it sees things that cannot be seen with the naked eye, and that they can be entities from the other world. At the same time, his daughter's behavior is changing and everything seems to undergo a sudden escalation, in which the supernatural becomes too obvious to be invisible.The cast does what they can to do well, and the result of all that effort is collectively positive. I would especially highlight the good work of Ivy George, despite her young age, and Brit Shaw. The scares are predictable, barely endemic in all the films of the franchise, but there are far fewer moments than what happened. It is the first film to make a serious bet on CGI, and it bears good fruit but it also steals, a little, the natural and genuine appearance of the film. The post production work has, in my view, some assembly flaws, with scenes that don't connect very well with each other and seem out of place.In short, it is a decent film that does not disappoint most fans, but it does not seem to me to contribute to attracting new audiences."
    },
    {
      "rating": "6",
      "text": "The first Paranormal Activity film to leave a sour taste in my mouth when the credits smashed on screen, THE GHOST DIMENSION is interested in telling a good story but sadly loses focus in the end. There are definitely some scary set pieces but overall the writers here (4 of them, for a freaking PA movie? come on) take the mythology all over the place, losing that fun sense of dread the other five capture. Hopefully the sequel Next of Kin will make me feel better."
    },
    {
      "rating": "5",
      "text": "They at least made thus movie to connect with the previous ones. A new family moves into the house where the girls lived 20 years ago."
    },
    {
      "rating": "5",
      "text": "This time, you can see black stuff on the cameras and a family moves into the sisters' childhood home and their daughter starts getting visited by Toby."
    },
    {
      "rating": "5",
      "text": "I was actually impressed. Paranormal activity is probably my least favorite franchise ever. Why did I keep watching? Because they're usually so bad that they help me fall asleep. I'm being serious about this.However, this one and 4 managed to keep me up for the whole run time. The plot is somewhat interesting  and I enjoy seeing the main characters figure out what's going on. It also helps that there are tangible things happening for once. This in contrast to the first three where nothing happens the entire run time outside of the ending. I've waited so long for this and FINALLY I got to see something and get some sort of closure on the plot that seemed completely scrambled until this point.So why did I give it a 5 if I supposedly liked it? Because it's only good in relation to the other movies. In reality, it's still a really bad movie to where a giving a 5 is being generous. The acting is...well...a paranormal activity movie. Outside of the concepts introduced, it's still extremely predictable. The main characters also sick as usual and really hard to root for. The parents are terrible at their job as my mother/aunt/father would have whipped the skin off me if I behaved like Leila. Also they're cowards. I get they are afraid of ghost, but 10 junpscares in, you have to get over yourself and need to get down to business.Also the script itself is its usual Paranormal Activity stupid. As every scene past the 30 minute mark becomes fustrating as the characters make so many stupid choices. It makes you want to scream at the TV. This is especially a problem in this movie because the characters (at least the camera guy) are pretty smart when it comes to plot things. So their smartness in digesting plotpoints clashes with their awful decision making.The effects were fine. Overall, should you watch it? Yes if you want to watch a paranormal activity movie and actually see things happen other than cabinet number 7 open by itself. No if you want to watch an actual good movie. As for me. I'm just thankful I could stay up and watch the movie for once."
    }
  ],
  "recommendations": [
    "paranormal_activity_the_marked_ones",
    "paranormal_activity_2",
    "paranormal_activity_4",
    "chernobyl_diaries",
    "blair_witch",
    "the_curse_of_la_llorona",
    "oculus",
    "unfriended_dark_web",
    "28_weeks_later",
    "unfriended",
    "the_strangers_prey_at_night",
    "insidious_the_last_key",
    "escape_room",
    "the_haunting_in_connecticut",
    "dark_skies",
    "the_pyramid",
    "the_woman_in_black_2_angel_of_death",
    "annabelle_comes_home",
    "brahms_the_boy_ii",
    "annabelle_creation",
    "the_purge",
    "countdown",
    "the_forest",
    "mirrors",
    "exorcist_the_beginning"
  ]
}