{
  "id": 1060,
  "title": "Parker",
  "starring": [
    "Jason Statham",
    "Jennifer Lopez"
  ],
  "runtime": 118,
  "genre": [
    "Action",
    "Crime"
  ],
  "description": "A thief with a unique code of professional ethics is double-crossed by his crew and left for dead. Assuming a new disguise and forming an unlikely alliance with a woman on the inside, he looks to hijack the score of the crew's latest heist.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/u1cl4RsdqMjolVVsHwiLRPN1CT2.jpg",
  "categories": {
    "plot": 5.621621621621622,
    "acting": 4.580645161290323,
    "ending": 6.6,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 4.4,
    "action": 5.90625
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Jason Statham is THE action hero of generation X, and may be one of the best action heroes of all time. The man seems to channel elements of Willis, Stallone, & Schwarzenegger into every film he does, not to mention he is one of the hardest working actors in Hollywood. At first his films got a reputation for moving too fast and being a bit confusing, but with every film, he has gotten better and better, and to date his crowning achievement is Parker. Parker is a thief for hire, one of the best money can buy. When an old friend hooks him up with an ambitious crew, Parker is eager to get started on a job, that promises seven figures. The job goes off without a hitch, but on the way back the crew lets Parker know that this was just seed money for a much larger and almost impossible job. When Parker refuses to partake, he winds up left for dead on the side of the road, with only one thing on his mind, revenge. This film puts a new twist on a classic story and it is done to near perfection by a top star and veteran Director, Taylor Hackford (Ray, The Devil's Advocate). Statham makes the story with his best performance to date and has plenty of help to ensure this movie is his crown jewel. The list of Emmy and Academy Award winners is this film is staggering. I won't list them all, as you can see the full cast on IMDB, but when you put that many stars together, the result is almost always going to be magic. In the end the film does turn out to be somewhat predictable, but it's one of those times where you really just don't care. Parker is two hours of excitement with all the comedy, explosions, twists, and turns you could hope for. I can't possibly recommend it enough for fans of the Action genre. In an Action film it's hard to get a good cast and even harder to get a decent story to go with the mayhem, but Parker has that an more. It is a textbook example of what an Action film should be and I really liked it."
    },
    {
      "rating": "7",
      "text": "Even if you go into this movie waiting to hate it for its simplistic and slavish obedience to the action-thriller genre, Jason Statham will win you over. He has the \"it\" factor that makes the movie work, just like his Transporter series and Crank. When you sprinkle the bodacious curves of Lopez on top, the result is pure goodness! Sometimes the formula used by the simpletons in Hollywood works, and sometimes it doesn't. That is the danger with using a formula. This time it worked."
    },
    {
      "rating": "8",
      "text": "Lopez adds a refreshing twist to this play by the numbers Statham movie. I think she should of been the next Bond girl but I will accept her in this almost straight to dvd action flick. Also it is nice to see an action movie with fight scenes that do NOT involve to much shaky cam. There is a reason why they keep making movies of this type. It just works and people buy it."
    },
    {
      "rating": "10",
      "text": "This is actually a great film! I went in expecting a disaster but i was pleasantly surprised! Statham was great as usual with a nice twist at his basic action hero character, Lopez was very good and in a role very fresh and different for her (i mean come, JLo sad and desperate getting the cold shoulder by Jason?! LOL) and Hackford is also great! Fun and cool for its genre! :)"
    },
    {
      "rating": "2",
      "text": "Horrible. I never go to see these type of mediocre films but I was forced by a friend. The good thing about this brainless action films is they are usually short. I was shocked when I knew I had to endure 2 hours in the theatre. First time seeing a film with this actor called Statham... well, he´s not an actor, he just shows his face and that´s it. Horrible. The plot is so ridiculous and tired. Most of the time you don´t care what the characters are doing. About Jennifer Lopez: she just can´t appear in a good film even if her life depended on it. She adds a little bit of spark to the horrendous film but we all know she is a decent actress at best, so nothing good can be said about this."
    },
    {
      "rating": "3",
      "text": "Just your regular Statham movie. Nothing new, just all the same as before, no point lots of violence."
    },
    {
      "rating": "8",
      "text": "This was a standard Jason Statham movie, in a good way. The action was decent, the trailer did not ruin the movie and the pacing of Parker was really good."
    },
    {
      "rating": "3",
      "text": "My expectations weren't high going in and they were met. Sometimes I too enjoy a mindless action flick like most guys, but this one bored me. What's more the makers obviously wanted the audience to sympathize with a psychopathic murderous thief. It doesn't work on any level."
    },
    {
      "rating": "10",
      "text": "The opening shot of \"Parker\" is a ride at The Ohio State Fair; huge and scary;  that you've just bought a ticket for. Just hang on. .\rBased on a Donald Westlake novel (Point Blank,The Hot Rock), With elements of \"Drive\" and \"Skyfall\" there's nothing not to like about this film. Back at The fair, you quickly realize there's something very wrong going on here amongst the rides and cotton candy. Jason Statham  a close relation of Wolverine according to the very inventive fight scenes and rapid recovery time, is someone you just don't cross. Jennifer Lopez as a  not a kid anymore\" Real Estate Agent living with Mom,( Patty Lupone), on a losing streak and slightly crazy, willing to take a big risk  adds a needed character to the story. In addition to phenomena camera work and editing, characters are given a back story with just a few well placed lines.  Clowns, crooked firemen, wild \"Bourne\"-type fight scenes and SCUBA Diving; It's nice to see a film this good actually got made.\rRated \"R\" for Language,  Violence  GHAAAA!!!!  Brief Nudity and Jennifer Lopez taking off her dress.\rVery, very good."
    },
    {
      "rating": "3",
      "text": "The Latest Jason Statham film to come along feels just like the last one except for one key detail, it actually starts with a thoroughly enjoyable heist set piece before settling into its tale of mediocrity. When career criminal Parker (Staham) is double crossed by his team and left for dead he vows revenge and head out to track them down. However he needs the help of down on her luck Realtor Leslie (Jennifer Lopez) to find them. Unlike Safe which found a nice way of incorporating Statham's patented violent but ever so nice hero into a story with him protecting a young girl but in Parker there is no rhyme or reason for anything he does. A simple revenge thriller is unfortunately complicated by the addition of the terrible Lopez who is far from her Karen Sisko days in Out of Sight. Staham who is no Daniel Day Lewis himself is forced to sit through dull scene after dull scene of Lopez chewing the furniture ad irritating the viewer. It's a thoroughly stupid, poorly thought out thriller that grips you with its opening but leaves you bored almost 10 minutes later."
    },
    {
      "rating": "4",
      "text": "\"Parker\" is a very poorly written movie with an uninteresting plot whose only saving grace are the action sequences. The first half was alright, but as soon as the subplot involving Jennifer Lopez, whose character is meant to provide comedic relief, begins about 1 hour in it takes a huge turn for the worse. Statham is a decent actor who has done much better movies and without him this would be a total flop. Lopez on the other hand was simply terrible, though not all of it was her fault because even the concept of her character was ridiculously stupid. Overall it is far too long for the script potential, Lopez's character was an awful addition, and the fact that the movie tries to be funny and serious at the same time all combine to make for a pretty bad experience. So in the end, a low brow flick that I would not recommend at all."
    },
    {
      "rating": "4",
      "text": "Good old Jason Statham. He's made quite a few movies as the though but moral hardman who lives by a strict guideline. And yet when I think of his best roles I think of Snatch, Lock Stock & Mean Machine  all films where he shows more comic timing than you might expect. And its something that Parker could have done with.\r This is an action thriller that really should have been made in the 80's. It needs its tongue to stick a little more out of its check. The action scenes are done very well (one scene with a knife and a balcony is great) but thats to be expected from JS. He has a likeable charisma and just about carries the character of parker. They also have Michael Chiklis as chief villain  he's a good fit for the role but doesn't get used enough for me. Instead of getting some fun, silly grandstanding from both guys, we get a more serious take on things  which takes away from the mood rather than adds. The problem is the overall plot is rather silly. Thats not a bad thing as such but the film seems to want to play things very straight where a lighter touch would have helped things along much better in my mind.\r I haven't mentioned J-lo yet and there's a reason. She adds nothing. At all. She lacks the charm for the role and (no offence obviously) but she seems too pretty and confident for a character who is, essential down on their look and desperate for a break from life. Really not sure what her character is meant to bring to the film  she's not a love interest, she's doesn't bring fun or laughs and she fails at bringing sympathy. She's not even really a damsel in distress. The film would work pretty much ok without her.\r Parker could have been better but as it is, it's not really worth bothering with. It's also quite long for a film of it's type and I reckon you may just be too bored by the end."
    },
    {
      "rating": "3",
      "text": "Jason Statham doesn't hold much of a screen presence, no matter how hard he tries, and unfortunately, Parker is just another dumb action flick that should've been on basic cable."
    },
    {
      "rating": "3",
      "text": "Ruim mal feito e sem história, Parker  daqueles filmes que tratam seu espctador com um idiota na verdade essa péssima película não deveria ter nenhuma expectador."
    },
    {
      "rating": "5",
      "text": "Selected scenes balance this film’s less than balanced pacing and lackluster. All character motivations and plot points are clear; however, jumps are made throughout this story to push it, quickly, to its end  causing the personal connection to be weaker than it was initially hoped to be."
    },
    {
      "rating": "0",
      "text": "This movie never really stood a chance what with Jennifer Lopez in it to start with, her wooden acting asks the question Why  When there are so many talented actors out there and of course that leaves Statham who grunts his way through yet another badly cast film, had these two not been cast the film might have done well but poor old Jason appears unable to act differently, regardless of the script, he is the same in every film, hardly an acting challenge, and far from a good or fair film."
    },
    {
      "rating": "8",
      "text": "I liked the movie. It is not the classic but is fun and entertaining. It also is less obvious than most in its genre. I never really like J. Lopez, but in this movie she was really good."
    },
    {
      "rating": "6",
      "text": "Jason Statham plays himself: This time as a pro thief who gets double-crossed by his gang, causing him to seek revenge. It's a pretty standard story with steady beats of action: lots of hand-to-hand, but not much that shows off his skills. Jennifer Lopez shows up to add some feminine charms, but the role is useless. Even though this is starting to sound negative, the movie is solid and never lags. For Statham fans, it's not one of his best, but it's still enjoyable."
    },
    {
      "rating": "7",
      "text": "Being a Statham fan I had to see the latest entry.  I would rank it slightly better than average.  The plot is the standard where the protagonist is left for dead, then seeks revenge on all his betrayers.  We've seen this in other Statham movies, Clint Eastwood movies, and countless other \"revenge\" action pictures.  It's a formula that works when done well.  The Jennifer Lopez character is really strange.  At first she is brave, willing to throw herself in a dangerous situation, then other times in the movie she is the stereotypical, overreacting hysterical female.  She seemed to have a split personality.  Recommended if your a fan of this genre."
    },
    {
      "rating": "2",
      "text": "I really like Jason Statham as an action movie actor, but he is playing in worse and worse movies. Parker has one, two good action scenes and that was it. Jennifer Lopez role is a dumb divorced woman, who seems to have get rid of any logic."
    },
    {
      "rating": "5",
      "text": "If Jason Statham has been stuck in one-dimensional roles, he's not going to make any breakthrough at Parker, despite having southern accent and hair at the first scene. A bit of action, more of heist thriller, Parker is overly long and awkwardly paced. Fight scenes are sparse, for those who hope for high octane skull mashing, this probably won't meet such expectation. Addition of Jennifer Lopez adds some light humorous touches, warranting her appearance more than just an eye candy.\r Parker (Jason Statham) is a man betrayed by his teammate after completing an almost botched heist, he was shot and left to death. Unsurprisingly, he doesn't die and vows revenge instead. Most of the movie is cat-and-mouse plots as he chases them across countries in not so exciting pace. There are a couple of fights in between, although the amount feels lacking for a movie led by Jason. For these few scenes, they are done quite well though. Unbarred bone breaking punches, kicks and other assortments of nearby potential weapon swinging are viscerally entertaining.\r The rest is a bare heist plot, which really won't hold a candle compare to more cerebral crime action movies. Pacing is undeniably slow, most of the things happen on-screen, even some with both leads appearing, are somewhat lackluster. The movie has about two hours in length and frankly with this long dragging set-up, one might expect some clever scheme building up towards the end, but it is not so. Without spoiling anything, the pace is equally stale from start to finish.\r Jason Statham bring his usual screen presence, he's a rugged, honor bound thief who keeps his principles religiously. When he threatens or hurts someone, he does so very earnestly, at that regard, he fulfills his role. Jennifer Lopez as Leslie is actually quite good. For someone who has superstar fame, she acts as poor people convincingly. There are modesty and honesty when she appears as well, making her likeable to the audience, aside for her popularly known hind allure.\r The two leading actors do their parts well, however the script and direction are mediocre. Parker is a bland movie, which has brief excitements across its lengthy run, albeit not nearly enough for the whole."
    },
    {
      "rating": "5",
      "text": "Parker wasn't as good of a movie as I was hoping it would be. It was much slower than most Jason Statham films and there wasn't much action. Even the few fighting scenes were less than we've come to expect. The acting was decent enough across the board and the concept of the movie, while cliche, was well executed. The ending was a bit anti-climactic and felt a little rushed. Overall, this was just a decent movie that Statham fans will probably like but it's definitely not one of the better crime thrillers out there."
    },
    {
      "rating": "7",
      "text": "Parker is a very entertaining heist and revenge drama. Jason Statham is in his element here and this is his only other good film after 'The Bank Job'. Muscularly directed by Taylor Hackford and tightly edited the film is a guilty pleasure. Jennifer Lopez doesn't disgrace herself, although she is saddled with some of the worst of the dialogue, and events move at a cracking pace. The opening heist scene is good value and there is a corker of a scene involving a shower curtain, a knife and lashings of blood which is edge of seat stuff. The West Palm Beach locations are also breathtakingly unfamiliar."
    },
    {
      "rating": "6",
      "text": "Statham and Jlo in the same film??? was the question I asked myself when the casting of this film was announced. And the final rendering on the screen makes me understand why I was doubtful. I mean, Parker is simply Statham's stereotyp type of film...an invincible hero who never cares to woman, even if the woman is Jennifer Lopez. The plot, is not very interesting, even if Jlo try to provide some comic situation."
    },
    {
      "rating": "7",
      "text": "Storyline: This is a remake of 'Payback' basically but with Jason Statham as Parker, a thief with principals. Remembering that this is really a well made Jason Statham movie you know what to expect and on this it delivers. Michael Chiklis is the main bad guy and Jennifer Lopez is the lead female. The story is quite good and will satisfy any action movie/Statham fans.\r Acting: What can you say about Statham? Up to now he is getting away with being himself and I'm certainly not bored watching his films but this 'one trick pony' could end up being a box office pariah. I would like to see him (eventually) trying something different. I like Michael Chiklis but he wasn't used a great deal in this but was good at being bad. Jennifer Lopez is not a bad actress (no she isn't) and did OK, she even got her kit off which for us males wasn't a bad thing, not a bad thing at all.\r Direction: Taylor Hackford is without doubt a good director and I've seen a lot of his movies but I couldn't see a film a say, oh, that looks like Taylor Hackford directed that. He doesn't have a unique style which this film could have done with to give it something extra, know what I mean? Maybe not.\r Production: I enjoyed everything about this film and thought it was well put together with a really strong cast (for an action flik) and a decent story so $30 million seems well spent. I can see them turning a decent profit especially when it's out on BluRay.\r Conclusion: I love a good action movie every now and then and this fits the bill. Statham, Chiklis and Jay Lo, what more do you need? Recommended.\r Score: 7.5/10"
    },
    {
      "rating": "0",
      "text": "Am I the only one to think it was just a waste of money and time? I have always wondered how a movie like that, can possibly be produced and distributed. But even worse, there's someone who liked it.."
    },
    {
      "rating": "10",
      "text": "Parker starts with a state fair robbery, like your average Jason Statham thriller- but it's also huge, scary and effective. The story tables apart into a betrayal plot with revenge free with a bloody purchase. Parker played by Jason is a professional thief who helps his father in law's friends with a robbery and twisted into a plot of betray for money. When he wakes up in a hospital- Parker questions his enemy's families and finds out that they are planning a heist for millions of diamonds and jewels. When Parker reaches Palm Beach, Florida he takes help of a simple but loaned real estate agent Leslie Rodgers Jennifer Lopez who is willing to help Parker for money. When Parker's cover blows he is not unknown anymore. Find out if Parker survives this bloody war of heists, money, drug lords, and his own life full of secrets that untangle in front of Leslie. The movie is very old school and very violent also. Parker is rated R\" for bloody violence, language, sexuality/nudity"
    },
    {
      "rating": "3",
      "text": "Nothing exciting here just a plain boring action movie.  There is no reason for this movie to be seen, the acting is decent, but the script is poor.  Why is Jennifer Lopez in this movie her character is meaningless."
    },
    {
      "rating": "6",
      "text": "This movie is pretty good.The story is okay,the villans are okay and it has good fighting.The only disappointing part was the end fight,It could have been way better."
    },
    {
      "rating": "6",
      "text": "Its good, not the best movie I've seen but worth a watch. After a successful heist Parker's gang crosses him  and lefts him for dead. After he gets saved he goes on to take revenge. Good acting, decent story."
    },
    {
      "rating": "5",
      "text": "Parker is your typical Statham movie. Watch only if you are a die hard fan of Jason Statham. Else, this movie has nothing new or even interesting to offer."
    },
    {
      "rating": "4",
      "text": "Statham returns as a one man show out for revenge, I can't help but think I've seen this before. If his character was called 'Frank' it would have been Deja Vu. Parker has a weak premise and the story and characters are no different. No original elements, no interesting characters, no need to watch really."
    },
    {
      "rating": "7",
      "text": "This was a good move and not to forget you get Lopez in it I bet she rocked a few viewers mind lol......Its better then I though it would be.One of his best."
    },
    {
      "rating": "5",
      "text": "Jennifer Lopez's hammy acting, for once, is necessary for this too slow placed thriller. Jason Statham provides us with the necessary entertainment from gun fights and knockouts, but the film itself, is stale and comes into the line of the repetitious action thrillers with mild thrills."
    },
    {
      "rating": "10",
      "text": "The Movie was actually great, The actors seem like they where not trying too hard. Jennifer Lopez Is such a great actress, Jason S. Was also amazing. I would love to see them work again."
    },
    {
      "rating": "8",
      "text": "I enjoyed this movie a lot - it's a satisfying thriller with nonstop action, and JLo's acting is on point.\rI would like to say that I'm surprised by all the negative reviews; after all this is an action movie and it is supposed to be like this."
    },
    {
      "rating": "5",
      "text": "Parker is a mediocre movie. It doesn't have enough action to compete with other Jason Statham movies, its far too long and most of the performances are lame. Jennifer Lopez really doesn't need to be there because she's not much of a partner, she has no knowledge of the situation she's in and she isn't Parker's love interest either. I was happy to see Michael Chiklis as the villain but he really doesn't get any screen time, anyone could have been the villain in this movie. There are so many better Jason Statham movies than Parker."
    },
    {
      "rating": "7",
      "text": "I found this decent movie. Maybe not of Statham's best but still if you like his movies youll like this one too."
    },
    {
      "rating": "3",
      "text": "I like J. Statham: He's really \"simpatico\" to me but here he's too much \"stathamish\" ! And JLo has nothing to do with her character Leslie (that is not a \"latino\" name too). Nolte: Better to retire. The bad guys are ludicrous. A casting disaster and the direction too. Furthermore both plot and its end are more than predictable. But it's D. W.'s fault: I'm sorry about that because I've always loved his novels. It passed my time, anyway."
    },
    {
      "rating": "10",
      "text": "Jason Statham y Jennifer Lopez hacen una combinación perfecta, la historia es muy buena y las actuaciones no se quedan atrás."
    },
    {
      "rating": "3",
      "text": "I like Jason Statham and his acting, however Jennifer Lopez not so much, less and less the more I watch her movies. Nothing against her, but all of her movies are boring and stale, the ole same ole. Her acting is so overdone and phoney. She facially looks so for her kind of looks, incl her age but she is old and has always had this matronly woman who bore kids look. Not everyone thinks that is attractive, she was never all that. Ever. She has a wide load matronly older woman, who bore kids look, and still trying to act/play key roles/parts in movies that don't suit her, her look, and esp her AGE. Is all so phoney and gotten soo old. Same ole same ole, like all guys want that. Pffffssst. Not. Talk about overmilking tht dead cow. Is waste of time and money watching movies with Jennifer Lopez in them. Moo-ve on already."
    }
  ],
  "recommendations": [
    "contraband",
    "homefront",
    "16_blocks",
    "collide",
    "mechanic_resurrection",
    "the_italian_job",
    "run_all_night",
    "alex_cross",
    "safe_house",
    "the_mechanic",
    "jack_reacher",
    "honest_thief",
    "killer_elite",
    "jolt",
    "2_guns",
    "wild_card",
    "killers",
    "peppermint",
    "a_walk_among_the_tombstones",
    "extraction",
    "knight_and_day",
    "cellular",
    "bullet_to_the_head",
    "sabotage",
    "the_commuter"
  ]
}