{
  "id": 2130,
  "title": "Passengers",
  "starring": [
    "Chris Pratt",
    "Jennifer Lawrence"
  ],
  "runtime": 116,
  "genre": [
    "Drama",
    "Romance",
    "Science Fiction"
  ],
  "description": "A spacecraft traveling to a distant colony planet and transporting thousands of people has a malfunction in its sleep chambers. As a result, two passengers are awakened 90 years early.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jK9S6HANSf2no64v1x1HxfcpmcA.jpg",
  "categories": {
    "plot": 4.5,
    "acting": 6.571428571428571,
    "ending": 4.75,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I found this film endearing, tender, and a beautiful love story. Magnificent actors and sensitive  direction. Watch it.If you only like action films with violence, sex and special effects, forget it. First you will have to wake up."
    },
    {
      "rating": "10",
      "text": "great movie, touch to the heart. Unthinkable end.  I cried  in 2008 when i saw it the first time, i cried again in 2013. There is nothing morereal in  life more  than death  I Apreciated the movie secuence  and the great end.,  I do not know why people rated low this movie, for me this movie was phenomenal. I imagine people are getting less sensitive in this century or people are forgetting to life free of materialism, violence and hatret.  This movie is the oposite; true  and pure love, respect to those gone and a good reason to clearly understand life."
    },
    {
      "rating": "10",
      "text": "Watched this on Netflix. Surprise ending.....very enthralled all the way through.  I really enjoyed this movie which I didn't realize was made years ago. Its a film you can enjoy without having to really think too hard. I loved it!"
    },
    {
      "rating": "4",
      "text": "If you are looking for an intense-shocking thriller with a great twist in the end this movie is not your thing. Not that it's an awful film but it's not as good as you expect. The main story is really good and original and it seems really interesting, Anne Hathaway was good too but that's all in that movie. Everything else is just one hour and a half of stupidity and boredom. It has no atmosphere and even the music reminded me of a romantic comedy. Too bad.. It could have been much much better."
    },
    {
      "rating": "5",
      "text": "I am a huge Anne Hathaway fan but I have to say that this is probably one of her worse movies.  It's not bad through any fault of her own, the acting by everybody in the movie is solid.  This is just horrible writing.   It's incredibly predictable. My wife actually guessed this within the first ten minutes.  I enjoyed watching the ending but the journey to get there was just not worth it.  Also, Anne Hathaway's character is supposed to by a therapist which makes 90% of this movie frustrating in how un-professional she is.  Overall I was very disappointed and wont be watching it again.  If you catch it on TV you might enjoy it otherwise it's not really worth watching."
    },
    {
      "rating": "10",
      "text": "I loved this movie! I was unsure when I saw it on Netflix because I had never heard of it...but it far exceeded my expectations. I think it was really well done and I think the Critics are being WAY too critical! Lighten up!"
    },
    {
      "rating": "0",
      "text": "Un film qui ne sait pas sur quel pied danser, celui de la comédie qui ne vaut pas un rond ou celui du... psychodrame à deux centimes de dollar ? par contre, il met les deux pieds en plein dans le plat de l'ennui très plat, raplaplat et ramolli, l'ennui particulièrement abrutissant, bête et soporifique...Car le film est finalement plus bête qu'autre chose, c'est tout ce qu'on en retiendra avec Anne Hathaway l'actrice aux yeux de poisson qui a l'air d'un thon et qui joue comme un cageot de fin de marché. Même l'estimé Patrick Wilson a l'air paumé ici de toute façon, dans cet ersatz de film... 100¨% pourri, tout à jeter... pas recyclable !"
    },
    {
      "rating": "5",
      "text": "Tired and familiar, disappointing considering some of the talent involved. Too slow moving and it only scratches the surface of the story, sloppily put together."
    },
    {
      "rating": "9",
      "text": "This movie was like a tapestry woven love story, that was both surreal and haunting...loved the score as well. I don't get how it got such bad reviews....I thoroughly enjoyed. it..guess nowadays all anyone looks for in the movies are gor and nudity. This had none of those, but I had to watch it again, to realize ...well, I won't give that away...seriously watch it!"
    },
    {
      "rating": "4",
      "text": "Unoriginal, pointless, and slow, this movie is merely the spawn of other movies. If you've been a movie-watcher for, oh, the last fifteen years, this movie will be nothing new to you!"
    },
    {
      "rating": "2",
      "text": "First hour was really boring and last 20 minutes didn't really help."
    },
    {
      "rating": "6",
      "text": "With fine performances by two of our best young actors and three always reliable veterans, \"Passengers\" is worth a look."
    },
    {
      "rating": "6",
      "text": "Despite an interesting premise, an impressive cast and solid acting performances, the movie still managed to be boring at times. The ending was also a little bit too far fetched for it's own good. While it's not a bad drama, you can still easily find something better."
    },
    {
      "rating": "9",
      "text": "I was genuinely surprised by this movie. Emotional, deep and full of authenticity. Its a wonderful movie with excellent and sensitive acting and its well directed. Just great."
    }
  ]
}