{
  "id": 47,
  "title": "Paths of Glory",
  "starring": [
    "Kirk Douglas",
    "Ralph Meeker"
  ],
  "runtime": 88,
  "genre": [
    "Drama",
    "War"
  ],
  "description": "A commanding officer defends three scapegoats on trial for a failed offensive that occurred within the French Army in 1916.",
  "releaseYear": "1957",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/l2IY0gOHHmCWM90LjteFssxIV1G.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I saw this movie for the first time on television today, after being persuaded by the reviews I read beforehand praising it. Also I like Kirk Douglas. Although I am not directly familiar with Kubrick's work, a shameful admission I know. Out of what I have seen so far I loved Dr Strangelove and despite only seeing it once while flicking through channels liked The Shining too. Anyway back on target, Paths of Glory was brilliant in my opinion!Winston Churchill famously claimed that it was this movie that was closest to evoking the atmosphere of WW1 and the military mind. And you know what, he is right. For one thing, Paths of Glory is gorgeously filmed, with relentlessly beautiful cinematography and nice costumes and scenery. The screenplay is sometimes humorous, sometimes moving and sometimes even haunting, either way it was some fine writing. The efficiency of Kubrick's direction is proof of a great man at work.The performances were superb. As the general who orders the hopeless attack on the German position, Adolphe Menjou's character is perceived as a villain not because of being an officer adhering to the letter, but that he is seen as \"the arrogant aristocrat\" because of his fear of the working classes than his hatred of the enemy. Among the cast, Timothy Carey and Kirk Douglas especially were outstanding. And the music? That is one rousing score I can tell you. Great movie. 10/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Uma perspectiva da guerra pouco explorada. Enquanto muitos tem uma visão voltada a conceitos como gloria, bem maior, patriotismo etc; Kubrick aborda o que há de mais ignorado no tema.Esse talvez seja o filme mais anti-climático no que se diz respeito a atmosfera bem conhecida e utilizada de guerra. Aqui o diretor direciona todo aquele cenário a uma critica a guerra de forma geral, mas focando na falta de humanidade que a politica do exercito tem em pratica.O diretor nos guia apresentando um contraste entre Col. Dax e Gen. Paul Mireau. É claro que Mireau é apenas uma reflexão de todo politica militar baseada na hierarquia criada pelos mesmos.A atmosfera de medo criada aqui, principalmente nos momentos antecedentes ao ataque, é quase palpável de tão presente. Sentimos medo por eles mesmo sem conhecê-los. O ataque é cruel e mostra uma pintura quase real do que de fato é a guerra, longe de todos aquele retratos de heroísmo/patriotismo criados por puro marketing e vaidade própria. Os diálogos são excelentes, fazendo-nos refletir sobre diversas visões cujo não tive contato antes. Aquele relacionado ao medo de morrer ou de ser ferido remete muito a mim, pra ser sincero. O discuso do Col. Dax no julgamento emociona, mas não de uma forma satisfatória, pois o que estamos a ver é um retrato injusto e contraditório por parte de toda instituição do exercito. Toda a cena, de forma geral, é magistralmente bem dirigida. Senti uma raiva descomunal pelo fato de que dialogar naquele período era uma baralha perdida, afinal, não há o que fazer quando se está cercado de alienados - parece que a coisa não mudou muito no seculo seguinte...No aspecto técnico, o filme é igualmente impecável. Os efeitos práticos tornam toda cena demasiadamente realista, junto ao efeitos sonoros. A fotografia trabalha muito bem com a luz, e tem um controle muito grande da cena em planos abertos. A cenografia também está afiadíssima, assim como o figurino.Por fim, a visão de Kubrick sobre a guerra é deprimente, anti-esperançosa, cruel e depressiva. O pior é que ele não aprece ter se esforçado muito pra chegar nesse ponto a final, nós, seres humanos, nos superamos em dar mais e mais conteúdo pra ele."
    },
    {
      "rating": "9",
      "text": "A powerful and surprisingly human film from kubrick.Acting is superb and convincing.The irony is so thick you can taste it."
    },
    {
      "rating": "9",
      "text": "Uma perspectiva da guerra pouco explorada. Enquanto muitos tem uma visão voltada a conceitos como gloria, bem maior, patriotismo etc; Kubrick aborda o que há de mais ignorado no tema.Esse talvez seja o filme mais anti-climático no que"
    },
    {
      "rating": "8",
      "text": "Clever, bitter and greatly performed. Kubrick was always ahead of its time."
    }
  ]
}