{"id": 2366, "title": "Patriots Day", "starring": ["Mark Wahlberg", "John Goodman"], "runtime": 133, "genre": ["Action", "Crime", "Drama", "History", "Thriller"], "description": "In the aftermath of an unspeakable act of terror, Police Sergeant Tommy Saunders joins courageous survivors, first responders and investigators in a race against the clock to hunt down the Boston Marathon bombers before they strike again.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mIDxsJTrOC7NhgOo3GziiHyKfsQ.jpg", "categories": {"plot": 6.674418604651163, "acting": 7.232142857142857, "ending": 8.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 8.0, "action": 7.0}, "reviews": [{"rating": "7", "text": "Saw it at the Loews Boston Common multiplex, which is probably about a leisurely 15-minute walk from the Marathon finish line. I'm happy to give it a 7 rating as a skillful, albeit conventional big-budget tribute to the heroism of the city. (Everybody loves self-compliments, after all.) In my opinion it really could have worked much more compellingly if the composite character had been dialed back. One quality of a good semi-documentary is to subordinate the actors to the story. THE LONGEST DAY did that, as did THE BATTLE OF ALGIERS, to name two that immediately come to mind. No one individual dominates those narratives. In them, only God sees everything, and is everywhere. It was counterproductive for Wahlberg's character to be omnipresent; that initial creative decision unintentionally evoked a tone of Hollywood artificiality which was the last thing the movie needed. Certainly not a fatal flaw, but a recurring annoyance."}, {"rating": "6", "text": "Not bad.this is a neat ,full of exciting movie with true characters , the camera cine have plot , strong ,..but for the babys ...."}, {"rating": "5", "text": "Don't know if this is actually a spoiler but just in case : When a film is 'Based On True Events' and it is almost as a matter of fact entirely and truly based on the true events, it is extremely disappointing and shocking when Tamerlan Tsarnaev's wife is being questioned and said that she is born in Iran (and pausing after the sentence) - when, in fact his American wife - Katherine Russell - was born in Texas, USA. It is exactly because of people like Peter Berg, Paul Tamasy, Dave Wedge, Eric Johnson and whoever else wrote the \"story\" of this movie that Americans - and Americans only - become hateful and fearful of countries like Iran.Why would you do that? Why when almost all events in the movie are true, would you change this very important fact that she was American and born in the United States to being born in Iran ?Shame on you. Shame."}, {"rating": "9", "text": "This movie got me speechless. The film is based around the Boston Marathon bombings in 2013. The build up to the moment was very intens. You knew what was going to happen. Every character that is introduced has a purpose to furfill. The film centers around the victims and police that day and the toll it took on their lives. Mark Wahlberg gave his best performance yet in one of the most touching movie of 2016."}, {"rating": "9", "text": "Peter Berg's Patriot's Day is an intense and heartbreaking, yet delicate docudrama that recreates events of the Boston Marathon bombing while realising the sensitive nature of the tragedy as to not exploit it. It's solidly crafted by diversifying its main characters to include heads of police, the police and the people to deliver the moral that love trumps hate."}, {"rating": "6", "text": "Despite a number of truly compelling sequences, several fine performances (especially that of Alex Wolff) and a lot of good intentions, this re-creation of the events surrounding the 2013 Boston Marathon bombing unfortunately comes up somewhat uneven. The film definitely gets better as it goes along, but its first 45 minutes drag needlessly at times with production values that are about on par with an average made-for-TV movie. Overall a nice try that, with some shoring up, could have made it a much better picture."}, {"rating": "7", "text": "\"Patriots Day\" was an intense, dramatic, and very detailed film of the Boston marathon bombing, Mark Wahlberg and Peter Berg stood out again, after \"Deepwater Horizon\", although it was more vulgar than Deadpool, it is possible to emphasize the history, The cast was very good, and the story great."}, {"rating": "7", "text": "2013's the Boston Marathon Bombing the Hollywood version. First responders and investigators are racing against the clock to hunt down the sneaky muslim bombers before they strike again. It can't be watchable to anyone but American patriots, right?Wrong. \"Patriots Day\" is actually a solid action thriller which seems realistic enough, even handling some more trivial details like how the bombers look like exactly. it avoids the excessive corniness and epic-ness till the last minutes and plays it like a catastrophe movie followed by exciting manhunt. The cameras are out there with us, in the middle of it all, and it still looks good. Another good example of how to handle the shaky in-your-face style of action that is often strongly disliked or even hated in movies.The stories of the main characters are rather vague and shallow, so good that they are relegated to sidelines. Mark Wahlberg has one of the biggest roles and does his usual thing which seems really pretty interesting only for the maybe first three times you see him in movies.You know, that humble and tender joe everyman that has a big heart but also gets **** done where it really matters. Like a action version of Adam Sandler or something.There are some big boyz of Hollywood involved, to make the movie more solid and prestigious, including John Goodman, Kevin Bacon and underused J. K. Simmons. It's amazing how effective this kind of playaz can be to bring almost any story to life. They make serious faces, talk their serious talk and make the world a better place. Works every time. \"Patriots Day\" is a tight enough package already... and they make it even more watch-worthy. Seriously.Boston Marathon bombing is good basis for a Hollywood movie. It's recent and true-life, so it can turn populist without getting too much criticism for it, and there's also creative freedom to add pretty much anything you want to a story.So no wonder there are more movies on the horizon. \"Stronger\" with Jake Gyllenhaal in the lead is coming already, and there's also some project called „Boston Stronger“...All in all, this is certainly by far the most fun I've had watching a movie directed by Peter Berg. He's always good with action and usually boring handling everything else ( The Kingdom, Hancock Movie, \"Battleship\", Lone Survivor and Deepwater Horizon, among others)."}, {"rating": "8", "text": "Patriots Day was brilliantly by Peter Berg who is becoming one of our best true event film makers out there.  My only negative was some comedic tonal shifts that didn't always work, but those are small moments.  In the end this film will have your heart racing even though you may already know the story. A-"}, {"rating": "8", "text": "Very nicely done, with a good script, good production values, and excellent performances all around, particularly from Mark Wahlberg, John Goodman, Kevin Bacon, and J. K. Simmons. Much better than I thought it would be. Recommended."}, {"rating": "8", "text": "Terrorism has a religion and we all know which one!One of the best films recently I have seen. It was based on the real. About the 2013 Boston marathon bombing. This film was an eye opener for me. I mean all I knew was the marathon bombing, but I came to know that was only half, the other half was even more serious events that stretched for like a week after the original event.The best part of the film was, there were no solo heroes in this story. Everybody contributed in some way to fight against the evil. The screenplay was shared by all the great actors, even small role ones equally. I loved how it all went on, as a team from different forces, but tackled the situation by joining the hands. I don't know it was only the film, but very impressive. That's patriotism!In the opening, you could see different people from different places of Boston preparing for the big event. And then they all end up in the same place where a series of explosion goes up. Quickly the security agencies come together and investigate it. With a small clue, kicks starts the manhunt. This is the part I loved it. Hunting pisslam pigs are always so pleasure to watch.Suspense, thriller, the story was well paced and took forward with a wonderful ending. Awesome direction. Another hit in a single year alongside 'Deepwater Horizon'. Interesting, Wahlberg involved in both these films. I've also heard that the two screenplays was merged to make a single film. One was a drama and the other one was an action packed story. That's why it was well balanced between everything. From individual's story to together in the events. A must see film.8.5/10"}, {"rating": "0", "text": "A totally needless film that exploits a national tragedy that happened less than 4 years ago and I am glad that no one bothered with it during the original theatrical release. I'm sure the director and the cast meant well but I think not only is it far too soon but it lacked the actual drama and turmoil that happened during these events. Instead they turned it into a corny action flick with sub plots that felt half baked."}, {"rating": "8", "text": "I'm a sucker for this kind of movie - loved Deep Water Horizon and Lone Survivor, so the Berg/Wahlberg true story formula obviously works.  But this film treated a politically charged story with care and with class.  I watched the news coverage of this week or so with attention, and I still found the movie revealed a ton of great perspectives.  What a heroic story - even more relevant with the Berlin terrorist attack happening just this week. These dead-enders are eventually going to realize that killing won't get them anywhere but dead.  And the people of Boston clearly won out with their love."}, {"rating": "9", "text": "Going into this film, I simply expected yet another well-done Peter Berg/Mark Wahlberg true story pic following Deepwater Horizon from only a few months prior and 2013's Lone Survivor. What I got instead was not only Berg and Wahlberg's best film together yet, but also one of the most harrowing, powerful, hard to watch, yet timely and essential films of 2016! I couldn't believe how intense the film got at times and the acting from Wahlberg and everyone else involved was solid and committed. Overall, this is a must-see for those looking for inspiration and hope as the end result of one intense yet solid and memorable film!"}, {"rating": "4", "text": "Serious incredibly harrowing recent true story blown by horribly shot handheld crap techniques and is also piss poorly cut for the most part.  The filmmakers will try to claim this awful style is more realistic and puts you into the story which could not be more of a ridiculous fallacy.  Why simulate a poorly shot documentary in a narrative feature, especially a substantially budgeted Hollywood motion picture?  It has the exact opposite effect on an audience who is much better off watching Dateline, 48 Hours, or YouTube than sitting through this.  The hack director is to blame of course.  He has no visual sense, lousy aesthetic taste, no understanding of cinema beyond the surface, and no true care or insight into audience psychology.  Dopey approving youths who don't care or know any better make for an unsophisticated audience.  He may be just swell to work with and run a set on schedule and budget, which certainly not everyone can do, but plenty in Hollywood can just fine and with way better results!  Also the stars who stupidly, blindly go along in their blanket trust instead of saying \"hold on, I'm not okay appearing in that cheap gimmicky style\" are also every bit to blame and prove themselves typically oblivious.  As it is, some of the dialogue and how it's delivered is laughably phony.This movie has so many time/setting sub-titles it nearly becomes spoof.  And no disrespect to the actual victims and responders to the terrorist evil, but the epilogue of them actually talking on camera is so out of place and goes on so long it completely negates the attempted spell that just transpired.  It's yet another dumb trend in movies based on true stories, but rarely has it been so botched and misconceived as here by the hacks behind the scenes.  Even so, the subject and certain scenes are so compelling the rating here is an accurate overall impression.The jackass sheep critics may follow the flock and go for this because they routinely fall for subject matter when they should be criticizing the artifice itself."}, {"rating": "9", "text": "Patriots Day based on the 2013 boston marathon boming one of the best movies of 2016 and a greatly crafted thriller handled with so much respect towards the real life events this is based on with great perfomances from everybody nobady feels out of place when you watch this you quickly forget that youre whatching a movie and peter berg perfectly combinded real life footage with movie footage that you almost can't tell the diffrence if it is movie footage and it won't  take you  out of the movie but it might be though to watch  for some people because of the amount of horrors you see like blood and the amount of suspenseful moments it has if you are that person you most likely only wanne watch it once and also you some of the little jokes might take you out of the movie a little bit and i wouldn't be surprised if it gets some oscar nominations but i don't think it won't happen because there isn't big buzz for this movie like alot of other movies had this year but i think it should get some award consideration at the oscars and maybe wins for atleast directing editing and maybe lead actor i thought that every supporting actor whas great also but they all didn't had alot of screen time so you should definitely see it if you haven't already"}, {"rating": "0", "text": "I honestly believed that Berg was sincere when he said he wanted to make an honest and respectful film about the the bombings at the Boston Marathon. As a born and raised Bostonian, I was very suspicious of this New Yorker who had a penchant for over the top action films, taking on this highly sensitive topic.But with Walberg on board, I thought that the native influence would would reel in any ambition to turn this into a Transformers sequel. Unfortunately, Mark Walberg, just like his director, are more interested in generating big revenue through big explosions and falsely generated drama than telling the poignant, restrained and honest version of what really happened to our city during that week.If you are not from Boston, you will probably find this film entertaining, which is exactly what the producers wanted. But to the citizens of Boston, the real life bystanders and witnesses of all the incidents, and to all the victims, this a not a respectful film. It exploits our connected trauma to generate big box office receipts.Berg and Walberg have turned this painful event into a Jason Bourne movie. By the way Mark, don't bother coming back to Boston. You are all the way \"Hollywood\"."}, {"rating": "9", "text": "With the exception of a few scenes it wasn't as non-stop stressful and gripping as I had read. For that, I'm glad. It was excellent story telling. I had no idea all the bad that these two criminals perpetrated - more than just the marathon bombing. I didn't enjoy hearing the f-bomb 150 times, but I get that those with a rough job talk rough. Impressive to see how the FBI puts a team and onsite research lab together. Even more impressive was how brave and selfless police officers are. Thankful to them and all involved for being diligent in tracking down these two pathetic pieces of trash."}, {"rating": "10", "text": "Patriots day is a fantastic dramatization of the events involved in an excellent and emotive manner as a lot of the movie is dedicated to the depth of emotion"}, {"rating": "10", "text": "Mark Wahlberg plays a police officer involved in the search to find the terrorists behind the Boston Marathon bombing. This is one of several POVs in this gripping drama: It also explores stories of several survivors, the law enforcement procedures behind the pursuit and even the activities of the criminals. Director Peter Berg depicts the horrific event with electrifying skill and maintains the tension throughout the search, which includes several potent action sequences. The continual drone in the soundtrack by Trent Reznor & Atticus Ross helps keep the pressure up. The cast is uniformly outstanding with Wahlberg exploring new emotional depths in his best screen performance yet. Not only is this a riveting, suspenseful police procedural, it takes an empowering patriotic stance that ultimately yields a moving final message."}, {"rating": "9", "text": "\"Patriots Day\" draws the viewer into the lives of the key characters in the story of the 2013 Boston Marathon bombing, and it pulls no punches in depicting the sheer brutality and horror of the event.  It occasionally incorporates actual surveillance video and news report footage, and the actors bear a remarkable resemblance to the individuals whose roles they depict.  The passage of time often sanitizes memories of just how fearful Boston and Watertown residents felt when the suspects were on the loose and they were asked by authorities to shelter in place.  The movie brilliantly reminds viewers that a virtual all-out war occurred between the suspects and the police in a quiet, densely-housed, narrow-streeted residential neighborhood in the middle of the night.  It avoids getting overtly preachy, although there is some understandable rah-rah Boston depicted toward the end.  The theater audience occasionally responded audibly to some scenes, and many sat in stunned silence briefly at the end.  I found the movie deeply moving, and I suspect word-of-mouth will quickly cause it to draw a large audience."}, {"rating": "8", "text": "Patriots Day” is a docudrama depicting the events that occurred in Boston at the running of its world famous marathon on April 15, 2013. The film was directed by Peter Berg who co-wrote the screenplay with Matt Cook and Joshua Zimmer. Splendidly acted by Mark Wahlberg, Kevin Bacon, John Goodman and J.K. Simmons, the film tells in detail the efforts of law enforcement to track down and ultimately either capture or kill the two terrorist brothers responsible for the attack. One might wonder how a film can engender suspense and interest when its outcome is already known to most if not all of its viewers.  “Sully” is a perfect example that such a feat can be accomplshed when there is enough material and good writing to make it happen. Also, like “Sully” the coda at the end of the film introduces us to the real life people who were portrayed in the film which gives glaring reality to the events depicted in it.  I truly enjoyed the film, not only for the good writing and acting , but for the information imparted to the audience as law enforcement worked tirelessy and with speed to end the nightmare that befell the City of Boston. I give the film an 8 rating because, amidst the suffering and tragedy associated with the event, there is also an acknowledgment of the ability of the human spirit to survive and move forward proving once again that “’Boston Strong” was not just a phrase but a fact.."}, {"rating": "10", "text": "It's been nearly a quarter century since director Steven Spielberg released both \"Jurassic Park\" and \"Schindler's List\" within the same year. Since then, only a few other directors have attempted the same feat (James Wan with \"The Conjuring\" and \"Insidious: Chapter 2\" back in 2013, David Ayer with \"Sabotage\" and \"Fury\" in 2014, Jeff Nichols with \"Midnight Special\" and \"Loving\" in 2016, etc.) and fewer have found even an inkling of similar success in their efforts. Until now, that is. For, both \"Deepwater Horizon\" and - now - \"Patriots' Day\" remain staggeringly masterful docudramas with enough heart, respect, and intrigue to turn even the biggest skeptics (like myself) into Berg-worshippers. With this film in particular, you get an absolutely fantastic sense of just how brave Berg can be in handling certain subjects - especially ones that are more than just fresh in everyone's heads. \"Patriots' Day\" stares directly into the abyss that is the 2013 Boston Marathon attack and doesn't flinch at all. It depicts the event in all its unrelenting ugliness and brutality, whilst still staying far enough away from the realms of exploitation and bombast to convince you that this movie simply needed to happen. It weaves universally-appealing themes of community, love, and perseverance into a superbly structured narrative that is as all-encompassing in terms of perspective as it is in scale and time. This is, all at once, a pulse-pounding thriller that showcases the valiant efforts of the authorities involved, an inspiring tear-jerker about how a community can learn to heal in the face of such tremendous adversity, and a chilling cautionary tale about the dangers of extremist thinking and indoctrination of any form. It's one of the best of its kind and I cannot recommend it enough. Peter Berg. Thank you kindly, sir."}, {"rating": "3", "text": "I was hoping Wahlberg might clean up his mouth for this one, especially because of the subject matter, but it seems as if he and Hollywood are trying their best to make the F...word acceptable in American society.  What's wrong with these people? They know there are children watching these movies. Wahlberg's 'Ted' was one of the most disgusting films I've ever seen. When you go to see a film about a relationship between a guy and a teddy bear, you assume it's safe to take the kids, but all you got in Ted was sexual perversion, drug abuse, and vulgar language. Everyone is this movie had gutter mouths. Do the Boston police men and women really talk like that? What a shame! I'm glad I rented it. I don't think the money I spend on a rental finds it's way to Wahlberg and company. I'll never pay to see another movie with Wahlberg in it. Conservatives in America need to take a stand against this kind of garbage. This could have been an excellent movie, but to me, it wasn't even mediocre."}, {"rating": "8", "text": "This movie really brought me back to the marathon bombing and the search for the terrorist.  Its focus is centered on the search and less on the victims and you feel as though you are right there with the police and FBI as they search for clues. The movie made me fall in love with the people of Boston, their strength and determination made the terrorist evil and small."}, {"rating": "6", "text": "Solid Wahlberg film with decent story and writing. Did seem a bit too familiar though."}, {"rating": "10", "text": "A powerful, well-directed and well-acted movie that has nary a flaw. I found it gripping."}, {"rating": "7", "text": "The First 20 minutes are throwaway material. The Film has some weird scenes but it's also an engaging chase and they did a great job mixing the original footage in"}, {"rating": "4", "text": "I only watched this because I'm from Boston. First of all, its extremely exaggerated. Secondly, how the hell is Mark Whalberg involved in every aspect of the Boston Bombing? He just happens to be involved in EVERY major event across the timeline as a Boston Police Officer. Give me a break."}, {"rating": "5", "text": "Another tragedy type film by Peter Berg which you start to see often now, but Mark Wahlberg was phenomenal in this movie, especially towards the end."}, {"rating": "8", "text": "Great film that could be nominated for best picture. This movie shows that you don't need to wait 10-20 years to make a movie out of a tragedy. Even though the film is an extremely touchy subject it does a very good job by doing everything in an effective way. The movie was extremely intense and your eyes are glued to the screen the entire time. With Peter Berg's Deepwater Horizon's huge success I was excited to see this one. Peter has crafted a very good film by paying respect and never overstepping it's boundaries. Mark Wahlberg does a tremendous performance and is perfect for the role being he was born around Boston."}, {"rating": "7", "text": "Given the tenor of American politics presently, I was dubious about this jaw-tighteningly named film starring Marky Mark. Thankfully, this meant that I was able to be proved too much of a cynic for what is a surprisingly subtle and sensitive film, given the subject matter. The performances are good, the pacing is tight and the storyline strikes a careful balance between inflating drama and remaining realistic. This film is careful not to revel in violence and respectfully covers the events of the tragedy without wallowing in patriotic sentiment or righteous anger. A solid film that is an honest and well considered portrayal of a tragic event. 7.68/10"}, {"rating": "5", "text": "\"Patriots Day\" Honors the Heroes of Its TitleSo the feature film that concludes, apparently, that directional volition about dramatizing the confrontation between a daring and patriotic paladin against a painful misfortune is \"Patriots Day\", a work with ambiguous messages and diverted pretensions taking back in time the unity and tenacity feeling that arose on April 15, 2013 by a thriller docudrama with a rather slow pace, which doesn't use all its options due to a arrhythmic editing work, an un- strategic directional style and an unglued narrative thread, at least, with regard to the babel of supporting characters and formulaic flaws, taking into account the previous works of this patriotic and concise filmmaker.Boston has managed to recompose from a pair of blows which collapsed a stable community. The terrorist attack, perpetrated by a Kyrgyz and a Soviet, which shook the annual and traditional Boston Marathon, near the finish line. Is there any bait more customary—crowded by the fervent patriotic sense—than an American athletic competition to congregate an immense deluge of pale faces around two explosions inspired by the animadversion-blasts? In this episode that left traces on the skin of the people from Boston is placed the story of Berg and Wahlberg, however, the leading actor in the story is the only apocryphal character in all that sea of realities. Tommy Saunders is a dipsomaniac sergeant, who to be active again in the assignment of true significance cases, he must be responsible for guarding the most important athletic event for his people, with not only a bruised knee, also his ego.Despite the diminished expertise, the director understands in advance what he wants and what utensils are essential to carry out his task: pay homage the brave men with an impressive wisdom, which helped them to not lose their sanity in the midst of such a maelstrom of madness. Appreciable is the dedicated approach to the supporting characters, showing a **** and coarse caution with respect to the exposition and corresponding ephemeris of those affected people by the terrorist attack, affected people with an introduction and conclusion as constrained as unsatisfactory. On the other side of the coin are the saviors, the main heroes of the odyssey led by Wahlberg, actor who has woven a consistent work camaraderie with Berg because of the services provided and whose best executed performance in the film triplet is achieved here, considering the overacting anti-terrorism message unsuitable basic and tacky that manifests the aberrant skills of the screenwriters for incorporating a required hopeful and educational lesson, an actor who continues his acting journey towards Ithaca, that symbolizes the property that only experience can confer: the apprehension that less is more, sometimes. Together with him are veracious titans in the field ranging from Simmons to Bacon, from Monaghan to Goodman, some actors impersonating researchers, others in roles of interviewer, keeping as a common factor the need to pay tribute to the true heroes. The script, which is riddled with possibilities, only manages to bring out a couple of them, leaving up in the air the potential of other conceptions that, with a different polishing, would have made the pleasures of the fussiest moviegoers. It's made up of a mosaic of ideas from three screenwriters that, most of the time, doesn't conclude on anything really optimized. The film expels core proposals that end up on the scrap heap due to they don't have a sense of direction.As for the recreation of the events, which was one of the most attractive and magnetic points for the audience, they decently built the calamity witnessed a few years ago. Opting for gunfights and chases executed with a hand-held camera, these result in an untidiness becoming disappointing, the fluctuation of the cameraman can be palpable, softening the meager beauty in the midst of so much human monstrosity. But there are fantastic scenes as the moment after the explosion from a high-angle shot.Berg fulfills his concern: to pay homage, full stop. It won't become a pressing classic about either American tragedies nor about the battle of a man for saving his people, but what matters here is the goal of the director: to honor those who were genuinely in the claws of smoke, fire, and turmoil. FBI agent, spectator, runner, Yankee, Latin American, of the yellow race, child, adult, needy, wealthy, clumsy, intellectual: human, everything is condensed in that, we're all human and we have to support ourselves in the time of cholera, in order to preserve our species. Ultimately, that's the moral message of the movie, and although this aura failed to encompass the event in its entirety, at least managed to communicate what generated the tragedy, which, by the misfortune of the attackers, had counterproductive sequels due to the bombs didn't divide us, these ones unified us."}, {"rating": "9", "text": "It does have a few issues but Patriots Day is a well crafted and extremely emotional movie. I loved it. 90/100"}, {"rating": "6", "text": "Loucademia de Polícia 8 - Divisão WatertownLoucademia de Polícia 8 - Divisão Watertown"}, {"rating": "6", "text": "i have rights..Patriots DayThe emotions depicted in here communicates easily and effectively with the audience but the feature seems scattered into bits and pieces; that are engaging and nail biting, but in terms of a whole package, it isn't concrete as it appears. Peter Berg's execution skills helps sail it smoothly off to the shore, but the real culprit is the adapted screenplay that could have done better with some strict editing. There isn't a protagonist to follow in, hence it relies a lot upon different supporting cast like Mark Wahlberg, J.K. Simmons, Kevin Bacon, Michelle Monaghan, Rachel Brosnan and John Goodman. Patriot's Day is an open love letter to all those real heroes and works like a charm on terms of factual information and accuracy but as far as drama is concerned, it required some more of it."}, {"rating": "7", "text": "Pretty good movie.  I think another actor may have done a better job than Mark W with this one.  Regarding the content, having been standing where the first bomb went off 7 minutes before hand (walking, 1.5 blocks away when it went off), the movie didn't touch on any of the chaos near the finish line, downtown, family meeting area.  Nobody knew where to go and sirens/vehicles were going off in all directions.  I would like to say the locals and small shop owners in the downtown of Boston were so kind/wonderful to the exhausted runners and their family/support who where there and didn't know where to go (no transportation available, cell/data networks down)."}, {"rating": "8", "text": "Wahlberg gives a very heartfelt performance that really lets you see how these officers were effected by this event and how much they had to go through while this manhunt was going on.  The conflict in the story comes into play when the FBI comes to Boston and there seems to be a battle over jurisdiction.  The Boston police are conducting their own investigation but since it was thought to be terrorism the FBI feels it is now under their jurisdiction.  Throughout the movie you see the two sides working their own ways.  The Boston police are out on the streets trying to find leads in order to find the terrorists.  All the actors who are playing roles on both sides do an amazing portraying how important it was to everybody that these terrorists be caught.  J.K. Simmons is also in this movie and he does a great supporting role in being a small comic relief because this movie does have a lot of emotional weight to it.  J.K. Simmons character gives you a few seconds to breathe and that really benefits the movie.  The way the movie benefits is that the movie could’ve been too caught up in the emotion that the movie would be very hard to get through. Next, the two actors who played the terrorists did a very good job, particularly the one playing the younger brother.  He showed the other side of the two that really wasn’t sure if what they were doing was right.  Lastly, the acting in this movie is very good and every actor gives a emotional and deep performance.  This is one of, if not the best, performance Mark Wahlberg has given since The Fighter.  Wahlberg does an amazing job of really showing the human side of the all the officers who were there to respond to the bombings.  I’m hoping to see Oscar talks for his performance because he deserves it.All in all Patriots Day is one of the best Mark Wahlberg performances I have ever seen and deserves Oscar consideration for this role.  But truly what this movie is about is people coming together ad working towards a goal.  Because when they finally catch the terrorists it is because the FBI and Boston Police are finally working together and as a result they catch the men responsible.  Also, be ready to shed a tear during this movie because the emotion from the actors just resonates so much that you can’t help but feel emotional with them because you feel the weight of the events during the movie."}, {"rating": "7", "text": "Even though the hero in this is a made up character and it does takes away from telling of a real life event, it's decent enough in portraying a city in grief."}], "recommendations": ["snowden", "13_hours_the_secret_soldiers_of_benghazi", "valkyrie", "deepwater_horizon", "zero_dark_thirty", "dark_waters", "argo", "spotlight", "the_mauritanian", "just_mercy", "the_monuments_men", "closed_circuit", "beirut", "darkest_hour", "hostiles", "allied", "hotel_rwanda", "nightcrawler", "the_last_duel", "the_good_shepherd", "only_the_brave", "richard_jewell", "flight", "the_imitation_game", "the_33"]}