{"id": 4122, "title": "Patriot Games", "starring": ["Harrison Ford", "Anne Archer"], "runtime": 117, "genre": ["Drama", "Action", "Thriller", "Crime"], "description": "When CIA Analyst Jack Ryan interferes with an IRA assassination, a renegade faction targets Jack and his family as revenge.", "releaseYear": "1992", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/yToAJg67r3hk3Ux3sfXOdpiqxU.jpg", "categories": {"plot": 4.9, "acting": 4.2727272727272725, "ending": 4.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.0, "funny": 6.0, "action": 4.636363636363637}, "reviews": [{"rating": "2", "text": "It all starts with a vacation in London. A quiet US citizen, who happens to be a former CIA agent, is in the right place at the right time, successfully preventing the assassination of a British Queen's cousin by agents of an ultra-radical faction of the IRA. Wonderful, isn't it? But one of the terrorists who died in the failed attack is the brother of another one, who has been arrested but is released by his fellows, embarking on a revengeful journey against the American he holds responsible for the death of his little brother. To defend himself, and to defend his own family, the former CIA agent decides to leave his retirement, knocking on his former organization's door and asking to return to work.Well, if this script summary sounds weird, that's because it is. And that is the biggest problem of this movie that even satisfies those who look for some action scenes. The film is not entirely bad but, in fact, screenwriters were not careful when writing and the details, when they're analyzed in detail, get to the point of absurdity. Since when can you, after ceasing to be a spy, simply ask to return and be immediately readmitted to service? Things are not that simple! And how could an US agent receive a decoration reserved for British citizens in an informal ceremony, in his own living room, from the hands of a sovereign's cousin? Absurd, a total protocol break! Then, there was a deliberate attempt to excuse the IRA and give a neutral, even sympathetic, picture of this organization that, in the past, was responsible for so many dead in real life.Harrison Ford is the man in the movie. He is there at the right time, brilliantly foresees the dangers, avoids death by a close call and still gives the bad guys a hard punch. Nothing special. It's always been the kind of character Ford has done well and there are dozens of movies where this actor is essentially doing this. The same goes for Sean Bean, who is the antagonist, the crazy terrorist who becomes a loose cannon on the deck of the IRA. Even so, this actor is good and deserved to have received better material to work with. Anne Archer is the permanent damsel in distress and Thora Birch tried to make her character a woman-at-arms, but could not shine with such a poorly developed character and almost no visibility in the plot. James Fox does not seem to know exactly what he is doing in this movie, Samuel L. Jackson remained almost invisible and James Earl Jones almost merely played himself.Technically, the movie is regular, with nothing to be said for the visual, sound or special effects used. It's within what we might expect in 1992. The soundtrack doesn't shine or stand out either. The focus was, entirely, on the action and fight scenes, shootings and the final sequence. The problem is that it's all so similar to other action movies that this movie, while entertaining and not disappointing who wants action, turns out to be totally forgettable, having virtually nothing to make it stand out in the amorphous immensity of action movies."}, {"rating": "8", "text": "Though not as good as Hunt for Red October, I thought the transition to Harrison Ford from Alec Baldwin was clearly a net positive.  The bad Irish dudes were a welcome force - especially Ned Stark Sean Bean.  I agree with the critics that the on-screen wife Anne Archer is a casting gaffe.  Otherwise, good solid summer popcorn fare."}, {"rating": "7", "text": "Pretty good Harry Ford thriller with good plot and acting. Quite enjoyable."}, {"rating": "7", "text": "Director Phillip Noyce's second entry in the \"Jack Ryan\" franchise is definitely not as narratively deft as 1990's \"Red October,\" but a slog of a film this definitely is not. In fact, \"Patriot Games\" marks a solid effort in not only the Tom Clancy cinematic catalog, but the spy thriller sub-genre in general, offering up a charismatic lead performance from Harrison Ford, a number of satisfying set pieces (including a truly impactful finale), a healthy dose of espionage intrigue, and a tantalizing series of cat-and-mouse-esque revenge elements that end up tying the whole movie together overall. Definitely a little more by-the-numbers than I would prefer at times, but still mostly watchable, entertaining, and even thrilling most other times."}, {"rating": "8", "text": "A solid clancy inspired political action thriller brought to the big screen. Great cast, excellent screenplay and soundtrack with good photography. This film has aged well for the most part! They don't make em like this any more! Highly recommend checking this one out."}, {"rating": "6", "text": "easy, safe, fair..Patriot Games3 Out Of 5Patriot Games is a plot driven action feature about a retired soldier whose family is in danger due to its own deeds. The premise guides the audience to expect a lot of guilt and emotional family drama which it does but in appropriate amount, where the rest of the act is filled with thrilling ride. The little tactics and physical humor or notion are built in with such ease that it cannot not impress the viewers. And the content can easily be relied upon from the source Clancy whose work gets juicier everytime if not better on his self-created fictional character Jack Ryan. It is short on technical aspects like background score, cinematography, sound effects but is decently edited. There isn't any out-of-the-box or metaphorical or even poetic tone in the feature that would help it give a gravitas for the character to evolve within the allotted time. But if not development, their certainly is three dimensional aspect to these characters that never changes to surprise the viewers in this plethora of explosions and bullets. But the antagonist in here is somewhat weak and isn't depicted with essential lethal-ness that remains hollow throughout the course of the feature which is quite long in here; almost two hours. Ford is confident as always and owns it with nothing but merit and is also supported nicely by Bean, Archer and Jackson. Noyce; the director, has kept its world within four walls of singular track in order to not get questioned which frankly works for the most part of its time. A smarter action and chase sequences with gripping screenplay are the only high points of this feature. Patriot Games is an easy, safe, fair and thoroughly entertaining game whose cat and mouse theme is a pro and not a con."}, {"rating": "8", "text": "Entertaining 2nd entry in to the Jack Ryan franchise and well made.Less geo-politics, more big action than Red October."}], "recommendations": ["spy_game", "triple_9", "the_sum_of_all_fears", "mission_impossible", "survivor", "tomorrow_never_dies", "outbreak", "jack_ryan_shadow_recruit", "enemy_of_the_state", "the_score", "captain_america_the_winter_soldier", "mission_impossible_rogue_nation", "body_of_lies", "heat", "spectre", "the_hunt_for_red_october", "shooter", "the_gunman", "lethal_weapon_2", "beirut", "the_equalizer", "the_league_of_extraordinary_gentlemen", "mission_impossible_ghost_protocol", "the_fugitive", "the_equalizer_2"]}