{"id": 1106, "title": "Paul Blart: Mall Cop", "starring": ["Kevin James", "Keir O'Donnell"], "runtime": 91, "genre": ["Action", "Adventure", "Comedy", "Family"], "description": "Mild-mannered Paul Blart has always had huge dreams of becoming a State Trooper. Until then, he patrols the local mall as a security guard. With his closely cropped moustache, personal transporter and gung-ho attitude, only Blart seems to take his job seriously. All that changes when a team of thugs raids the mall and takes hostages. Untrained, unarmed and a super-size target, Blart has to become a real cop to save the day.", "releaseYear": "2009", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/A4zZv0Q1VKURFZFEl2vwjaE2q0g.jpg", "categories": {"plot": 5.777777777777778, "acting": 5.333333333333333, "ending": 6.5, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 7.166666666666667, "funny": 4.363636363636363, "action": 5.0}, "reviews": [{"rating": "4", "text": "Mall Cop arrests you with poor jokes.\rThe premise of the film is okay at best, and the comedy isn't there as Happy Madison once again struggles to piece a movie together. The plot is fine until a ridiculous ending, and the overall product is something poor that could have been alright."}, {"rating": "8", "text": "I never understood the negative reviews for this movie. Mall Cop is just a great family movie. It has lots of good laughs it not inappropriate for young kids its just a great movie to watch with a group. Anytime this movie is on cable I can watch it. I must have seen it at least 5 times and that doesn't bother me in the least. Kevin James just seems to put out movies that are clean and funny. I hear that there is a sequel in the works and I bet it'll be funny too."}, {"rating": "3", "text": "In some crazy way Mall Cop is  charming, probably because of the actor, playing the main role, he is sweet. But the comedy is nothing special. I will not even touch the plot. I though it would be at least funny, but dullness and boredom made this 'comedy' unwatchable. Like I said in the beginning Mall Cop have some sweetness maybe in the main idea - a man who does his work conscientiously with pleasure, finally become a chance to prove himself. Yeah, but it wasn't developed interesting. Not well made. I give it 3 because of the sweet main actor, as well as the sweet idea and message behind the movie and also some funny moments. But I think I wouldn't recommend it, not sure actually."}, {"rating": "7", "text": "Personally, I kind of actually liked the movie. At some parts of the movie, it was really funny, although, at others, it was kind of corny.  I like the sense of humor but I feel like it should have ended much better."}, {"rating": "8", "text": "This action comedy is awesome, entertaining, and funny throughout. An unexpected story and a great performance by Kevin James make this an enjoyable comedy."}, {"rating": "10", "text": "Surprisingly funny!"}, {"rating": "4", "text": "Ugh, the funny parts in here are very boring,tho, is not mature at all, maybe kids will like this. To bad,, almost everything failed to make me laugh at loud."}, {"rating": "4", "text": "This is the epitome of lazy comedy. We have one joke, Paul is fat. Let's try to stretch that for a full movie. It didn't work. Believe me, it didn't work."}, {"rating": "2", "text": "Kevin James has potential somewhat (see Grown ups, Hitch, I Now Pronounce You Chuck And Larry) but Paul Blart: Mall Cop squanders his ability to make audiences laugh and proves he cannot carry this unfunny script as an awkward, terrified mall cop. This movie is quite simply boring, dumbed down and leaves little to the imagination. James should stick to pairing alongside Sandler in movies, he ultimately fails on his own."}, {"rating": "3", "text": "Kinda funny. Mostly terrible. Mind you, Jayma Mays is ridiculously beautiful. It's just that, I don't want that to be the ONLY thing I remember leaving the movie. It was really really bad. James is funny and a great comedian. However, it's not okay to just be ridiculous and plain. It has to have a style. Don't make me mention the fact that nearly all the actors (save James, Mays, and maybe a couple more here and there) were absolutely awful."}, {"rating": "3", "text": "It's another one of those could be funny movies but it takes no risks and the majority of the jokes were in the trailer."}, {"rating": "0", "text": "I don't mind a dumb comedy with occasional yuk yuk laughs, but this one had none. It appears that Kevin James and Co were trying to make a slapstick version of DieHard. Didn't work. Avoid at all costs."}, {"rating": "1", "text": "My stupid friends thought this was hilairous. i beg to differ, it is the most bland, crummy comedy i have ever seen. Kevin James is so unfunny, and i wished i had not seen it. It's so not funny if your acting, because all and all... it's just stupid."}, {"rating": "2", "text": "All the big, bad tells for this stinker are in the marketing. Promoted ceaselessly throughout the holidays instead of being released during the holidays. Calling itself \"the #1 movie in America\" immediately after release but with not even sold junket quotes saying the sort of generic crap that larger budget films can at least sell and use for the opening release weekend. Uncreative TV spots that use the same clips for two full months, despite more than five versions. I feel bad for the lead actor since this prevents him from ever being lead material -- not that he did anything but drag down Hitch -- but bad movies need to bomb for a reason. So that they don't get made as often, or as poorly. The ONE REASON this film exists is because the paper-thin mall cop concept could be sold at the executive level as a quick cash-in on teenagers who identify with teenage stuff and hang out at malls, \"and stuff.\""}, {"rating": "5", "text": "I thought this was funny the first time i saw it. The second time it couldn't make me laugh. Most comedies can do that (ex- The Hangover, Zombieland, Ghostbusters). Overall it was a decent movie."}, {"rating": "1", "text": "It would have been easy to laugh at Paul Blart, Mall Cop if the whole movie didn't go to such painstaking lengths to make him so pitiful. I have to wonder why the writers wasted effort on either end."}, {"rating": "1", "text": "Terribly, terribly unfunny. It isn't offensive in the sense that the humor is lewd, rather the fact that the humor is so derivative, juvenile, and safe. Kevin James is above this. His stand-up is very funny, and \"The King of Queens\" had its moments, despite going on for what seems like an eternity. In fact, James is above every film I've seen him in."}, {"rating": "0", "text": "Pretty boring if you ask me. Paul Blart is another crappy comedy from Happy Madison and it shows how unoriginal they are when they released this film. No real funny parts, Acting is poor, and the entire film is boring."}, {"rating": "5", "text": "I was kinda let down with this one. I was really expecting more from an Adam Sandler film starring Kevin James. I may've laughed a time or two but thought it could've been much better."}, {"rating": "8", "text": "This film, after some 2 and a half years of non-stop determining, was my sleeper hit of 2009. I watched it with a few friends expecting a cheap laugh or two from the film and a great time with my bros. Instead I got a few laughs and an overall clumsy yet charming kids movie."}, {"rating": "2", "text": "Its a real s**t film. Paul Blart: Mall Cop 2.0/10"}, {"rating": "0", "text": "Based on the 1 minute I saw of this garbage, avoid at all costs. The most annoying thing is they give the lead a segway to drive around on for his depressing mall job, when a walk would do the fat **** some good. A movie set in a mall, all plastic and depressing as hell"}, {"rating": "0", "text": "this movie is the proof that even if it's 2015 you can still make money out of a falling joke based movie.\rwith an unoriginal plot and retarded writing, the movie is as bad as it can possibly be."}, {"rating": "9", "text": "Humorous movie filled with heavy themes and teaches our nations children the values of persistence, friendship, and honesty. Paul is loyal and will do anything to help his friends. The triple plot twist involving the 5 main antagonists is enticing. We can all relate to Paul's journey in realizing he doesnt need to help people if he could theoretical help people if a similar unrealistic set of circumstances happens to his friends whom most of which dont like him."}, {"rating": "8", "text": "i think its a very funy movie, mind you its not oscar worthy or anything but still very entertaining and the movie gets you rooting for Paul"}, {"rating": "8", "text": "Has a few surprises in store. The biggest is James, an unexpectedly nimble master of the face-plant, the failed jump, and the lopsided tumble."}, {"rating": "8", "text": "Good dumb fun. You know what the movie is about, you have seen it in 100's of comedy movies. However it does it well. Should have a long life on cable."}, {"rating": "6", "text": "A lot better than you'd think. I laughed out loud at least 10 times. Kevin James is pretty freaking awesome on that Segway."}, {"rating": "5", "text": "The first half of the film is so boring and uninteresting that it is not worth watching to get to the decent second half."}, {"rating": "7", "text": "A very funny, this can appeal to both adults and kids. It has a lot of plot twists and has good acting. For those of you that liked the Die Hard film, this should appeal to you. I think if you see this film you will recieve a great laugh. I would rate this film a 7 and a half, but if only goes 0,1,2,3,4,etc. See this movie. Just like National Treasure, I say screw what the critics think. Respectfully."}, {"rating": "6", "text": "Yes it is goofy and very typical for Kevin James. I Like James enough that I still enjoyed going and I was able to take my teenage daughter. Not extremely memorable, but somewhat refreshing to see something that isn't full of shock-value crudeness."}, {"rating": "6", "text": "Has there been an unusually large amount of full moons lately? Believe it or not, 3 (count 'em, 3) comedies released by Adam Sandler's Happy Madison Productions in the past year have turned out to be, well, not totally terrible! Last summer's You Don't Mess With the Zohan wasn't hugely amusing or accomplished, but at least by Sandler standards it lacked most of the mean-spiritedness and cruel edge that most of his starring vehicles (The Longest Yard, Click) possess in abundance, while the Labor Day hit The House Bunny, though typically dumb and lowbrow, showcased a sparkling, endearing comic performance by Anna Faris. Paul Blart: Mall Cop is the best of the bunch, which, mind you, doesn't make it all THAT good. The idea of spoofing Die Hard has genuine potential, and there are some nice ideas sprinkled throughout (particularly the inclusion of a Paul Gleason-ish law enforcement dumbass) but the writing and direction feature more holes than Dunkin Donut's entire 2008 output. If a group of master criminals wants to rob a mall, why do so on Black Friday rather than a somewhat less busy but still profitable sales day, the better to cut down on possible glitches and x-factors? And wouldn't a mall that large employs some REAL cops as well as mall cops on the biggest projected sales day of the year? And how truly easy is it to clear a 200-store-plus shopping center of patrons in such a short time without causing massive mob hysteria, panic, accidents and injuries? (For that matter, how likely is it that a mall that huge wouldn't include a multiplex cinema--the emptying of which would cause a whole different set of logistical problems...and comic possibilities?) Paul Blart: Mall Cop nevertheless works to the degree that it does partially because of...Paul Blart himself, played by KIng of Queens' Kevin James, who was tremendously likable in Will Smith's Hitch and ably carried the grieving-widower heavy baggage in Sandler's I Now Pronounce You Chuck and Larry; here he's an underdog overachiever who generates notable rooting interest as he pursues both the bad guys and his dream girl Amy, the curator of a hair-extension kiosk in the mall. Speaking of which, Jayma Mays as the object of Paul's affections is even better: an actress who's just as skilled at playing truly nice people as Amy Adams is--no small compliment!--Mays stole Wes Craven's Red Eye a few years ago as a sweetly beleaguered hotel clerk, and here generates tremendous kindness, warmth and concern for Blart; when he gets sloppy drunk and makes a fool of himself, Mays exudes just as much embarrassment for him as she does discomfort at being in his presence. Director Steve Carr's smartest decision is to cut to as many Amy reaction shots as humanly possible; kudos also to the wonderfully straightfaced music score, which is in the fine tradition of Elmer Bernstein's work on Animal House, Trading Places and Airplane! All in all, the relative nonsuckitude of Happy Madison's latest effort is as pleasingly unlikely as...say, an African-American being elected President, a plane making a safe landing in the Hudson River or the Arizona Cardinals making it to the Super Bowl, so isn't it reassuring to know that ANYTHING is possible?"}, {"rating": "8", "text": "Sheesh reviewers are harsh. The beginning might seem like it might lead to a meiocre movie, but it iis really fun as it goes on. the downside is that you really won't care about it 2 hours after you see it, but it still is a movie i would recommend."}, {"rating": "0", "text": "The real question is how any self-respecting critic could give this movie a \"green\" rating. Each of them should lose their job immediately."}, {"rating": "8", "text": "Movie is a throwback to 90's comedies. Not to serious, and just funny."}, {"rating": "7", "text": "Come on people. This movie is exactly what it says it will be. It's a spoof. It's a really good Die Hard spoof. Kevin James is the lovable loser that we look for in these movies. I smell another Paul Blart flick coming. It's made 100 mil. Good stuff."}, {"rating": "9", "text": "I just saw this with my 6 yo grandson we both had a blast. A little slow at first but a real fun time towards the end, little violence and swearing made it even better."}, {"rating": "7", "text": "Not the best comedy ever, but has its moments, didn't go on - got to the point and was entertaining. The best scene is James screaming 'I believe in magic' and falling through a window. If that doesn't suit your comedy tastes, this isn't for you. However if you want to switch off for 90 minutes, give this a go."}, {"rating": "1", "text": "Ugh. Even my 8 year old twins wanted to walk out after 15 minutes of one offensive fat joke after another and the first fight scene where bystanders gag at the sight of *gasp* the stomach of a woman over size 10. Also, the plot that focuses entirely on fat people as gullible, unlovable, stupid, lazy, rude, smelly, disgusting, untouchable.... My slender son insisted on walking out because \"This movie is too mean to fat people!\" In addition, a forty-something man pursuing a teenager romantically was just creepy. Not because he was fat (though by no means ugly) and she was underweight, but because of the fact that she was four or five years older than his daughter!! All around nasty."}, {"rating": "6", "text": "Took a little while to get my attention, but the last half of the movie was pretty funny."}, {"rating": "1", "text": "Cheeziest movie ever. Not funny at all."}, {"rating": "7", "text": "Most goofy movies are horrible. Kevin James turns this movie into a fun, laugh \"out loud\" flick. I appreciated the story line; i.e., the romantic touch, the seriousness of the bad guys (criminals are dumb), humor, goofiness and intelligent quick-wit character of Kevin J. Most thinkers will enjoy this movie. If you are offended by this you need to get a life. The name Paul Blart says it all."}, {"rating": "4", "text": "Blart is a decent attempt at a comedy starring James, however, while the movie does offer you a couple of cheap laughs, the end product ultimately falls flat."}, {"rating": "0", "text": "The fat man from King of Queens is just not funny. He proved it in King of Queens and, lo and behold, he proved it again with this crap."}, {"rating": "8", "text": "A good film that has you rooting for the unlucky \"hero\" from the start and is very funny when the Die Hard style part of the film kicks in."}, {"rating": "7", "text": "My expectations for this movie were extremely low. My friend recommended it to me, and when we rented it, I actually started crying. But I was pleasantly surprised when i watched this movie. So for anybody who likes comedy's, I recommend this to you."}, {"rating": "6", "text": "This is a classic \"unlikely hero\" tale, fitting into that tiny niche of the underdog archetype of storytelling. If you enjoy such stories, this movie is definitely worth a few bucks."}, {"rating": "6", "text": "From \"The Remains of the Day\", novelist Kazuo Ishiguro writes, \"The great butlers are great by virtue of their ability to inhabit their professional role and inhabit it to the utmost...\" Before \"Paul Blart: Mall Cop\" settles for being a \"Die Hard\" spoof, this \"Mystery Men\"-like take on action films has a tragi-comic approach to menial labor that bears some commonality with the 1989 Man Booker Prize-winning novel. Unlike Stevens, Paul Blart(Kevin James) certainly has more ambition than the butler(Paul wants to be a cop), but when his hypoglycemia puts a crimp in his plans, he retreats into a world of his own making. Whereas Stevens elevated the commonplace act of polishing silver and other quotidian chores into an art form, the security guard takes undue pride in helping shoppers with their bags and giving them directions. Veck(Keir O'Donnell), a trainee subjected to Paul's tutelage, a stand-in for the audience, sees what we see as he receives the security guard's \"pearls of wisdom\", that this unskilled laborer has an overblown idea of his own importance. To Amy(Jayma Mays), the love interest, Paul talks about the controversy brewing among people in his line of work, as if such occupational minutia was a universal concern. Such an insular worldview is strikingly similar to the butler who believes that everybody shares his appreciation of Mursden, home of Giffen and Co., makers of the best silver polish on the market. But alas, before \"Paul Blart: Mall Cop\" turns into a downer(shades of James Mangold's \"Heavy\"), the \"officer\"(the politically correct term for security guard) gets to save the day, in banal fashion."}, {"rating": "8", "text": "Pretty good. A mix of funny comedy, and a twinge of romance and a dash of action."}, {"rating": "1", "text": "This is the first movie in years that I have walked out of. After 40 minutes of hoping it would turn the corner and get better the pain just continued."}], "recommendations": ["thunder_force", "dirty_grandpa", "a_million_ways_to_die_in_the_west", "night_at_the_museum", "get_hard", "dodgeball_a_true_underdog_story", "the_ridiculous_6", "baywatch", "zoolander", "little_fockers", "masterminds", "hall_pass", "the_change_up", "tower_heist", "30_minutes_or_less", "the_other_guys", "identity_thief", "tammy", "trainwreck", "this_is_the_end", "zack_and_miri_make_a_porno", "what_happens_in_vegas", "wanderlust", "cop_out", "ted"]}