{
  "id": 560,
  "title": "Paul",
  "starring": [
    "Seth Rogen",
    "Simon Pegg"
  ],
  "runtime": 104,
  "genre": [
    "Adventure",
    "Comedy",
    "Science Fiction"
  ],
  "description": "For the past 60 years, a space-traveling smart-ass named Paul has been locked up in a top-secret military base, advising world leaders about his kind. But when he worries he’s outlived his usefulness and the dissection table is drawing uncomfortably close, Paul escapes on the first RV that passes by his compound in Area 51. Fortunately, it contains the two earthlings who are most likely to rescue and harbor an alien on the run.",
  "releaseYear": "2011",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bX8TP2qRWh2OcmeUHGn1ENDkCu6.jpg",
  "categories": {
    "plot": 7.08,
    "acting": 7.409090909090909,
    "ending": 6.2,
    "soundtrack": 9.666666666666666,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.531914893617022,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Paul is a very good film. Im a big fan of Simon Pegg and Nick Frost acting in films and this is another great film with the two actors in it. There are alot of funny scenes in the film and the story is enjoyable to watch. My only problem with the film is some scenes in my opinion are just stupid overall. I would give this a high matinee!"
    },
    {
      "rating": "8",
      "text": "I can't really add anything that hasn't already been said.  Other than to say it's a pretty damn good film.  Plenty of great jokes outside those of the trailer.  Without the director of Shaun and Hot Fuzz on board, the only loss I could see was lack of a definite visual style but honestly, it didn't stop the laughs coming.  Biggest complaint I had was Simon Pegg's Moustache!  It hid his top lip and hence a lot of subtle looks he was giving."
    },
    {
      "rating": "9",
      "text": "Pegg and Frost have done it again, they've created a hilarious movie which is worth your money. Paul is the story of two friends, Graeme (Simon Pegg) and Clive (Nick Frost) who are going on a tour across america, from Comic-Con to all over america's alien hotspots. Along the way, they come across an alien named Paul (voiced by Seth Rogen) Let me get this out of the way: Just because the two main characters are \"nerds\" doesn't mean anyone who isn't one will be alienated. The jokes are crude, often come flying fast and there's enough within this movie so everyone will be entertained, including car chases, romance subplots, star wars (amongst other films) references and explosions. The jokes can often be crude, yes, but there's no doubt about how many laughs inhabit each joke: they're full of them. From probing gags to tri-titted aliens, this film is certainly a barrel full of laughs (there are better jokes, but its hard to speak of them without spoiling parts of the movie). There are a few jokes where you just have to give yourself a second to process what the character just said, and when you have processed what they just said, trust me, you'll be laughing. This film proudly bears its inspirations, by homaging some films which, trust me, once you hear them, you'll get the homage. The best homage? Listen to the background music when the characters enter the redneck bar, you'll see. Also, once Sigourney Weaver makes her on screen appearance, wait for a certain line to be referenced. I can't talk about this movie without mentioning the films title character: Paul. Seth Rogens voice doesn't bother me in any way, in fact, his voice seems perfectly suited for the CGI character, who does not stick out like a sorethumb like certain cgi-characters *cough*ScoobyDoo*cough* In fact, all of the characters are quite well done characters, none feeling like merely one dimensional characters, whether its Jane Lynch's alien enthusiast waitress, or David Koenchers redneck who severly dislikes the title characters, they also manage to pull of some brilliant laughs. A great deal of the laughs have to come from the Goverment agents, played by Bill Hader and Lo Trugillo. The duo give us some big laughs, whether its about 'Spacemans balls', searching the main characters RV or within a comic book store, you can expect big laughs from these two. Paul manages to go in a direction that i'm glad it touched upon, the creationism VS evolution debate. With Paul suddenly here, it fuels the debate (not through the whole movie though) and ponders the idea of what to do when you're beliefs have been shattered. So basically, Paul is a film filled with non-stop laughs, a brilliant cast who could act their way out of a prison and homages that are guarranteed to leave a smile on your face. Definately a contender for funniest film of the year"
    },
    {
      "rating": "10",
      "text": "The British duo have given us some of the best comedy in recent years.  The Seth Rogen reached his zenith with his performances in the TV comedy of some years ago \"Freaks and Geeks\"  which matched him and many of the better comedy actors populating films today.  Unfortunately Apto and his young charges have steadily faulted in downward trends.  Rogen has played the exact same character just stoned more or less in preceding roles.  Stop smoking the props stop smoking your own stash and start learning your craft these past several performances have been terrible \"The Green Hornet\" OUCH!"
    },
    {
      "rating": "8",
      "text": "Awesome movie.  My only complaint is the hair pieces Simon Pegg keeps wearing in his movies. He would have been just as believable as the trekkie/alien enthusiast without the bad hair. It just takes you out of the movie when you have props that remind you that they are props.  Loved the alien though and Seth Rogan did an excellent job. I can't wait to see it again.!"
    },
    {
      "rating": "8",
      "text": "I found it to be a very chuckle worthy movie. You might not be rolling in the aisles in every scene but overall it is rather enjoyable. It might be a little geeky for some, extreme bible thumpers will despise it, stoners will laugh the most from it. But overall I have to say not too shabby it's at least worth giving a once over, but may want to wait for it to come to DVD don't think it's worth flooring it to the theater for a $11 gouge price."
    },
    {
      "rating": "9",
      "text": "I saw this film twice in theaters and cracked up both times. The comedy is so clever and the action is pretty decent for a comedy film. Seth Rogen nailed it as Paul and was the funniest character in the film"
    },
    {
      "rating": "10",
      "text": "This was a movie made for me. It is hilarious and fun and it reminds you of why you enjoy sci fi films with all of its little references from star wars to star trek. The only thing it was missing was edgar wright."
    },
    {
      "rating": "8",
      "text": "Two British nerds decide that after going to ComicCon in San Diego they are going to go touring Americaâ"
    },
    {
      "rating": "8",
      "text": "I don't often want to see movies twice, plus I'm known for enjoying the vulgar comedy, but wrap it around a pleasant story and I'm hooked!  I will be seeing this one again.  Throw in the genius of Simon Pegg and Nick Frost, and it's a no-brainer.  No, Paul won't win any Oscars, nor does it teach us anything new.  However, it takes us on a fun journey in a race to get Paul home, all the while throwing nostalgia at the viewer, especially if the viewer grew up in the 80s.  Some blatant references to Star Wars, ET, Close Encounters of the Third Kind, etc., but then some subtle ones, like the country jamboree band playing the Star Wars Cantina theme ala Western style.  Jason Bateman was perfect as Agent Zoil.  Lorenzo Zoil.  So stupid, yet hysterical.  Wonderful writing, acting and full of surprises.  Paul is a MUST SEE!"
    },
    {
      "rating": "10",
      "text": "i absolutly loved this movie and seth rogun (not sure if thats right) is perfect as paul and the movie is very good over all. i could not stop laughing the entire time and i have not laughed this hard since the hangover. the story is very well done allbeit a rip off of ET but they turned it into a comedy and did a wonderful job and all the references towards the sci-fi movies almost made me feel ashamed that i actually knew what movies they came from but it was sort of a guilty pleasure. this movie is defenatly a must see and cannot be missed so when you have some time off go and buy a ticket and watch it asap. one last thing before i finish \"Whoa three **** Awsome!\""
    },
    {
      "rating": "7",
      "text": "This was B+ movie. These 2 guys are good, but given the brilliant set up - british dudes & alien road movie in america's west - the story could have been much more gritty, unusual, eccentric, weird & inventive. you kinda get the feeling that director Greg Mottola's great instincts as director got dulled & dumbed down to pulp by the universal's tsunami of dreary. Feels like a kid's movie with a lot of been-there-100,000-times cliche Seth Rogen riffs... like insert curse, blah blah blah, insert curse... rinse, repeat. Should have used someone unexpected like George Clooney, who could've pulled this off with a lot more quirky intelligence & wittiness (like in Mr. Fox). Movie is weighed down by Seth Rogen, who's a good actor but has way way way way way way overplayed this schtick. You kinda get the feeling that Mottola got highjacked & maybe got stuffed in the trunk while this movie went down the highway. Don't think he wrote this but if he did, it got shredded -- could have been a lot funnier and more insightful, with a lot fewer unbelievably obvious cliches that make a big deal of being obvious so that it's like kitchy obvious as \"cool\" obvious... but totally fails in that sense, like the evangelical thing. Aside from all that, I had like 7-10 out loud laughs, and that was well worth it. Final: funny, but nowhere near as good as the story idea makes you believe."
    },
    {
      "rating": "10",
      "text": "Feel great, laugh hard, smile big! Good fun with a lively audience, everyone bursts out laughing all at once. Must have been at least 30 times the audience seemed to laugh in cue, and very much agreed.  If your feeling sad, see this now!  >>>>  It's smart humor but still sadly manages to include some of the \"homophile humor crap\" we're all sick of and continually barraged with from the seemingly Pro-Homosexual Agenda Movie, Film and Television Industry."
    },
    {
      "rating": "10",
      "text": "This movie is one of those lighthearted British comedy's that I love, it does not take it selves to serious but still manages to be moving in some parts.  The movie speaks to the nerd in all of us and pokes fun at America in an loving way. Seth Rogan as the voice of Paul is a perfect match, while it's not the movie of the year it is absolutely worth watching and better than most new comedy's out there."
    },
    {
      "rating": "10",
      "text": ";====+++http://tinyurl.com/4m99k48+++===;;====+++http://tinyurl.com/4m99k48+++===;;====+++http://tinyurl.com/4m99k48+++===;;====+++http://tinyurl.com/4m99k48+++===;;====+++http://tinyurl.com/4m99k48+++===;;====+++http://tinyurl.com/4m99k48+++===;"
    },
    {
      "rating": "6",
      "text": "Although \"Paul\" isn't strong in script & story as much as \"Shaun of the Dead\" or \"Hot fuzz\", the tone is humorous thanks to the friendly Pegg+Frost combo."
    },
    {
      "rating": "7",
      "text": "Paul is funny, clever and very, very cheeky. Pegg and Frost have definitely delivered a great sci-fi comedy."
    },
    {
      "rating": "10",
      "text": "If you are a sci-fi nerd like me you MUST see this movie.   It's truly an homage to people like you and me.   The Star Wars cantina music playing in the bar scene slayed me.   The movie is full of clever little inuendos like that connecting to famous sci-fi from the past.   Seth Rogen is perfect as the alien's voice.  This Pegg/Frost creation compares very favorably to the hilarious Shawn of the Dead !!!!"
    },
    {
      "rating": "10",
      "text": "Absolutley brilliant, I have already watched it twice. Simon Pegg has created his funniest movie since Shawn of the Dead. Look out for references to famous Sci Fi films all through this movie. The music they play in the club and the radio comments from the FBI guys are clear tips towards the original Star Wars whilst the obvious pun at the end is hilarious.The sub plot where the Alien opens peoples mind about religion is really well done too. If you love Sci fi and have a sense of humour  then you will love this film."
    },
    {
      "rating": "10",
      "text": "I was psyched for this movie, and I was not dissapointed!!! I absolutely love this movie!! The cast is awesome, the writing is so freaking funny, and the characters are likeable and easy to root for. So overall, if you're a big sci fi geek, you'll go crazy over it."
    },
    {
      "rating": "10",
      "text": "Simon Pegg & Nick Frost did it again! Paul is brilliant yet funny. There should be more movies like this. Even Seth Rogen did great. Pegg and Frost should do more films like this one."
    },
    {
      "rating": "4",
      "text": "\"Seth Rogen is 'perfect' as Paul,\" primarily because you don't spend the movie watching the real Seth Rogen attempt acting. That alone garnered an extra point from me. The movie itself was ET meets Star Wars references written by people who smoked a lot of weed during the writing process."
    },
    {
      "rating": "10",
      "text": "If you like Simon Pegg and science fiction this is a very good movie.  If you have friends who have been to any comic or sf conventions, and if you liked Galaxy Quest, then this is a GREAT Movie."
    },
    {
      "rating": "5",
      "text": "Pegg and Frost lost the physical comedy that made there films so enjoyable and replaced it with foul language laughs that are better left to Will Farrell and Company. Those that love a cheesy comedy will still enjoy this overall piece of pure silliness."
    },
    {
      "rating": "10",
      "text": "Funniest moveie ever  \"3 tits\"....\"awesome.\" haha."
    },
    {
      "rating": "3",
      "text": "The idea of the movie was really very good and I expected a lot of fun because I love Sci Fi.But I was very disappointed because the final product is not good at all.The movie is full  of rude humor and looks like it is made for teenagers with very immature teen jokes.I give this movie 3 only for very smart references to famous Sci Fi movies. At least the writer has seen some quality Sci Fi earlier in his life. Pity he could not create a masterpiece himself."
    },
    {
      "rating": "5",
      "text": "It's a forgettable movie with a few memorable moments. Odds are, if you've seen the trailer, you've seen said everything the movie has to offer. Not bad, just not good either."
    },
    {
      "rating": "5",
      "text": "There are a few chuckles, but I would have enjoyed the movie more if I was 13 years old.  This is the second movie in just a couple of weeks of release of each other that pays homages to other movies throughout (the other being Rango).  The visual effects overall are well done, I just wish the humor would have been a little more sophisticated, and the movie not so predictable.  For some reason, the movie reminded me a little of \"Short Circuit\", but the robot in that movie (Johnnie 5) was funnier and the overall writing better.  I was also VERY disappointed that the trailer gave away SO many of the scenes.  Nobody laughed when he ate the bird because everyone had already seen it.  This is not a horrible movie by any stretch, I just wish it was funnier."
    },
    {
      "rating": "7",
      "text": "This is not Pegg and Frosts best work but I did enjoy the film and I liked watching for the Sci-Fi Movie references. Their love of the genre really came across in a similar way to Shaun but it wasn't quite as funny."
    },
    {
      "rating": "9",
      "text": "Hilarious. Just a fun, sci-fi comedy. The casting has to be spot on. Simon Pegg and Nick Frost at their funniest since Hot Fuzz. I was skeptical at first about Seth Rogen, but he held up great."
    },
    {
      "rating": "8",
      "text": "Really funny!  Great references to nearly every Alien movie in the past 40 years!  A really nice getaway from all the world's current problems.  Great Cast!"
    },
    {
      "rating": "9",
      "text": "Frost and Pegg have done it again. (spoiler alert)\rThese two are cinematic geekdom's equivalent of mythic gods!\rBest part in the whole film was Sigorney Weaver gets crushed by the UFO's door, then later they are spraying it off with a garden hose, love it. I have not sprayed soda out of my nose like that since Galaxy Quest."
    },
    {
      "rating": "7",
      "text": "An intergalactic, pop-culture RV road trip through sci-fi, geekdom that, while not earth shattering, remains an energetic, clever and sweet little ode to all things not of this planet.  www.brianthemovieguy.blogspot.com"
    },
    {
      "rating": "10",
      "text": "I loved this movie. It was both funny and entertaining. It had a great cast, and even though it was a comedy, it had good special effects. Paul looked real. As if he was really there. This movie shouldn't be frowned upon because of the similarities to other movies because it's creating a whole new fun-filled comical action ride."
    },
    {
      "rating": "10",
      "text": "This movie is really good. Most people somehow though it was supposed to be a kids movie, but this was defiantly not the case. I think a lot of the negativity came from the references to religion, but you should be able to laugh at yourself."
    },
    {
      "rating": "10",
      "text": "Absolutely Hilarious! I don't understand why this movie did so bad on this site I thought it was a refreshing dirty comedy. this is Seth Rogan's best movie!"
    },
    {
      "rating": "2",
      "text": "AWFUL. It was like a family film... but with cussing? I don't get who the target viewers of this movie was suppose to be, it was just boring and reminded me of something an 11 year old kid would like. I LOVE Pineapple Express and what's his face's other movies but this was just plan boring. I semi-laughed like 3 times? Maybe?Avoid this or wait for DVD, who likes this movie? Why are people giving good marks? Really???"
    },
    {
      "rating": "6",
      "text": "Deep in the recesses of an Area 51 warehouse, a CIA-employed \"little green man\" has none other than Steven Spielberg on the line, discussing with the filmmaker, hot on the heels of his first Indiana Jones movie, what he should film next. Seated at his regulation government desk, Paul(Seth Rogen), the driving force behind all the important scientific and sociological achievements of the past fifty years, gives Spielberg the idea for \"E.T.: The Extra-Terrestrial\", the 1982 classic that turns out to be, not a work of fiction, but a biopic about Paul's first contact with earthlings upon his arrival from the skies beyond. Clive Gollings(Nick Frost), a British sci-fi writer on nerd holiday with his fellow Comic-Con conventioneer Graeme(Simon Pegg), had no doubt seen \"E.T.\" as a tiny lad in some rundown London bijou, but it's the Spielberg knockoff \"Mac & Me\", the 1988 Stewart Raffill \"commercial\" that took the marketing practice of product placement to a whole other level, which inspired him down the road to write speculative fiction and sci-fi based comic books. Considering that Paul has such a prodigious grasp of the American popular culture(he takes credit for creating Fox Mulder), the savvy moviegoer would expect the hyper-urban alien to be outraged when Clive speaks of him in the same light as the \"Mysterious Alien Creature\", Mac for short, whose caretakers keep alive by supplying the co-opted alien with Coke after Coke after Coke. With his mouth fixed in a perpetual \"O\", Mac has the unintended look of a stroke victim. Hillariously, since Mac can't move his mouth, the furnished soda cans are always equipped with a straw for easy sipping, as a means to help offset the considerable limitations of the completely manual puppet. Unlike Mac who can't talk(you need facial gestures to do that), and most conspicuously, eat(ditto), Paul, on the other hand, yet another triumph of CGI technology, acts and sounds like your typical American male beset with arrested development, and in a wicked send-up of the titular character in John Carpenter's \"Starman\", eats what he regenerates. Paul may be a little on the crude side, but he never forgot his first love, Tara, whom the alien tried to make amends with over the intervening years through the cinematic arts. (In a bit of fun, fictive movie revisionism, Elliott was supposedly based on Tara.) Although Paul couldn't save the dog his ship landed on during that long ago crash landing, the alien brings the hound's memory back alive, so to speak, through the redemptive powers of film. In the final moments of \"E.T.: The Extra Terrestrial\", Elliott's dog trots up the ramp to the departing spacecraft, then thinks better of it and turns around. When Tara(Blythe Danner), the little girl who nursed Paul back to health, traverses the same sort of steps(toward Paul's ship) as that celluloidal dog, the seemingly accidental movements of a restless animal in the Spielberg film now takes on a less spontaneous appearance. Turns out the whole damn thing was scripted, a personal aside, from Paul to Tara, as an apology for taking her cherished pet away with his reckless piloting, by foregrounding the dog for a brief moment amidst the tearful goodbyes between E.T. and his humans. \"E.T.\" is a very personal movie for Paul, thus Clive's childhood fascination with \"Mac and Me\"(co-starring Ronald McDonald as himself) must stick in his crawl, but he remains respectfully quiet, perhaps even, suspiciously so. That's because \"Mac & Me\" was his idea too. It's the only explanation. He's just too embarrassed to own up to it. At the end of the Christine Ebersole vehicle, the family of mysterious alien creatures gets sworn in as American citizens, therefore choosing Earth over returning back to their desert-like planet. Paul, who probably could have quit his bureaucratic job anytime he wanted to, decides that he prefers his adopted home, as well. These two movies: \"E.T.: The Extra-Terrestrial\" and \"Mac & Me\", reflect the breadth of Paul's earthly experiences; starting off as a stranger in a strange land and ending with a successful transition into fruitful assimilation."
    },
    {
      "rating": "7",
      "text": "Simon Pegg and Nick Frost play British scifi nerds who travel to our UFO landmarks and happen upon a real-life alien (voiced by Seth Rogen). Their innocent adventure turns into a desperate chase, which includes men in black, a few insider cameos and lots of classic genre references. While the spirit is good-natured and the pacing never lags, the genuine laughs are too spread out. The movie is fun, just not that funny."
    },
    {
      "rating": "7",
      "text": "It's not one of those stupid, dumb comedies with no plot. In this movie, the storyline made sense, even the character Paul had a background story. I'm pointing this out because most of today's comedies are shallow. '' Paul '' was entertaining, fun, rude and offensive movie. After '' Hot fuzz '' , Simon Pegg and Nick Frost had finally delivered another cool comedy."
    },
    {
      "rating": "9",
      "text": "this movie was funny.I GUARANTE  that you will laugh while watching this movie. If you watched Hot Fuzz or Shaun of the Dead or another Pegg and Frost movie you will notice that this movie has a different feeling to it but,it was still an great movie."
    },
    {
      "rating": "5",
      "text": "If you are a fan of the duo of Frost and Pegg's other movies (such as \"Shaun of the Dead\") and a fan of the sci-fi genre, I would highly recommend checking out this film.  While the humor does leave a bit to be desired, the film itself is put together very well and employs a cast of actors that play their parts convincingly.  The subtle references to other films in the scii-fi genre are more than enough to make this film watchable.  That being said, this film is definitely aimed at a specific group of viewer and, if you belong to the group, you will find it to be a rewarding experience.  If you do not, you will likely walk away from the film less than pleased."
    },
    {
      "rating": "4",
      "text": "It seemed like this was the guideline when Pegg/Frost penned PAUL - When in dire need of a laugh, do one of the following:1)  Have a character drop the F-bomb or equivalent.2)  Have a character faint. 3)  Make a homophobic comment or dwell on the subject. Overall, a lazily written comedy.Maybe the problem was we needed more action, more *surprising* action: SHAUN OF THE DEAD and HOT FUZZ had plenty of that. Not enough crazy action and, more importantly, not enough Surprises =  lame comedy."
    },
    {
      "rating": "4",
      "text": "I found the acting, for a start, to be acceptable, with some cases being quite memorable (Jason Bateman,  Kirsten Wigg) If you enjoy good acting, a film worth a watch. However, it falls very very flat on the script, with poor, recycled and lack luster jokes. This film just has none of the strength of Hot Fuzz or the creativity of Shaun Of The Dead."
    },
    {
      "rating": "0",
      "text": "Virtually plot-less, Paul plods along, constantly introducing character after lifeless character. Each scene is punctuated by a poorly-constructed gay joke, and the disembodiment of Seth Rogen's voice is truly unsettling.The film, after the opening scene of Paul's ship landing on a dog, begins with an upbeat musical montage of the main characters, forcing a familiarity of them upon the audience. They then *somehow* acquire an RV, (which they drive as if it were a Honda Civic) in a pursuit of spotting UFOs via a cross-country road trip. Now, add Paul, a gray alien who has escaped the government's clutches,. He makes a rather predictable and unintelligent introduction to our main characters. If Paul is not propaganda to make us believe that the extraterrestrial lifeforms of our universe have the personality and intelligence of any beer-bonging college human \"brah\", then I don't know what it is.From there, the characters' overly-apparent awkward social graces make enemies with everyone they meet. Before long, they have a transcontinental train of gun-toting antagonists following behind them, from homophobic hillbilly redneck hunters, to the FBI. It is unclear what anyone's goal is in this movie - antagonists, protagonists, script writers, producers... what is going on?When the investigators set up a road bock, the scene cuts directly from the officers waving traffic to the side of the road, to their RV immediately being searched, encouraging us to allow our rights to be illegally violated. I digress.Paul finally leaves Earth by signaling his alien brethren to pick him up with... fireworks. This works not only immediately, but also very well, because fireworks haven't been fired anywhere on Earth, at any time in the past 70 years. Plot hole after plot hole, the writers abandon a potential script of substance for a cinematic faux-pas, intentionally created to condition humans to the existence of aliens, which Paul, actually points out at one part in the movie.As for the supposedly spectacular sci-fi references, they were too few to quantify. A pathetic excuse for a sci-fi friendly film; a pathetic excuse for a film, period. 104 minutes of my life I will never get back. Imagine what else could have been done with their $40,000,000 budget..."
    },
    {
      "rating": "1",
      "text": "Boring and predictable. I can't believe that Pegg and Frost went from \"Shaun\" and \"Hot Fuzz\" to create this dreck. The attempts at humor were pathetic. There were some passable references to sci-fi classics, but overall this movie is not worth your time or money."
    },
    {
      "rating": "2",
      "text": "THank god I pirated this movie. Because otherwise I would have walked out and lost $10 at the theater and someone might have seen me watching this crap. The jokes are lame, the characters are unbelievably stupid and not in a funny way but in a you feel bad for the writer who is trying to appear smart and failing like watching bones or the ghost whisperer. I thought this would be funny but if you saw the preview you've already seen the best jokes. harvesting farts not eating a dead bird would have been better as a short rather then an hour and a half of filler and a recycled 3 boobs joke from total recall over and over again. the Christian trailer trash, the English nerd, the stupid alien couldn't be less funny. Seriously this is worse then sucker punch."
    },
    {
      "rating": "1",
      "text": "An unbelievably bad movie. There was nothing good about this moronic tripe. I'm giving it one for the 1 laugh i had. I doubt even teenagers would like this piece of crap."
    },
    {
      "rating": "6",
      "text": "I like watching Paul and it's a decent comedy. Although, it's not as good as Shaun of Dead and Hot Fuzz like everyone else said. But, Simon Pegg and Nick Frost are so cool and they actually pretty good job on their role and that CG alien is a wise crack-in hilarious. Cool movie and it's pretty fun alien road trip flick."
    },
    {
      "rating": "6",
      "text": "\"Funny , tho not what i was expecting. Paul has its laugh out loud moments. But i felt like i needed more , when its funny its funny. But this intergalactic comedy needed more flare and R - Rated humor. Paul is spaced about between funny and stupid\" .. B-"
    }
  ]
}