{
  "id": 21,
  "title": "PAW Patrol: The Movie",
  "starring": [
    "Iain Armitage",
    "Lilly Bartlam"
  ],
  "runtime": 86,
  "genre": [
    "Animation",
    "Family",
    "Adventure",
    "Comedy"
  ],
  "description": "Ryder and the pups are called to Adventure City to stop Mayor Humdinger from turning the bustling metropolis into a state of chaos.",
  "releaseYear": "2021",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ic0intvXZSfBlYPIvWXpU1ivUCO.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 9.4,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 2.3333333333333335,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Disturbingly Cringe. It's all bad jokes and cringe. An hour and a half of my life wasted"
    },
    {
      "rating": "0",
      "text": "Very Cringe. It’s all bad jokes and cringe. An hour and a half of my life wasted."
    },
    {
      "rating": "10",
      "text": "My 5 year old son likes the show so I knew what I was getting into. Better than expected and it was only 1hr 15 min-ish. Entertaining and kids love it. Imo, Much better than Raya or Space Jam. Saw both with my son and I was ready for them to be over long before the credits rolled. Paw Patrol held my attention and the animation was better than the TV show. Good, if you have kids and they like Paw Patrol."
    },
    {
      "rating": "0",
      "text": "the critique of “PAW Patrol” is useful as an amalgamation of certain favorite Hollywood themes that ought to be retired"
    },
    {
      "rating": "10",
      "text": "I'M NOT GOING 2 LIE BUT THE TURE IS THE PAW PATROL MOVIE IS 4 KIDS BECAUSE THROUGH 2020 AND ALL THESE ALL THE YEAR 2015 2016 2017 2018 2019 2020 2021 OF ALL KIDS IN THE WORLD WATCH PAW PATROL TILL NICKELODEON REVEAL A PAW PATROL MOVIE IN 2020 TILL 2021 IT IS NOW PLAYING IN MOVIE theater ALL THE KIDS EVEN MY SISTER KIDS LOVE PAW PATROL ! GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD"
    },
    {
      "rating": "10",
      "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD"
    },
    {
      "rating": "7",
      "text": "It's OK.  It is an hour and 15 minute episode of the regular show with crazy detailed animation and blink and you miss them \"celebrity\" voices. There are no fart jokes so it has that going for it. Chase is dealing with PTSD for some reason and gets over it for some other reason.  There is a new dog that serves no purpose.  No singing.  It is over quickly and it is not too annoying for an adult."
    },
    {
      "rating": "10",
      "text": "Let the kids watch the PAW Patrol directly, comparable to Speed, Forrest Gump, Avengers: Age of Ultron, Fast & Furious, The Bravest, 9-1-1, The Day After Tomorrow, Geostorm, The Rescue, Rampage, and Shanghai Fortress, and it is about to confirm the introduction of mainland China!"
    },
    {
      "rating": "10",
      "text": "The movie has delighted me a lot, regardless of whether I am 18 years old. I saw it together with my nephew who is a fan of the series. In itself, I really liked the realism of the characters and a new plot. Besides that here in Mexico, the voice actors of the series returned and give voice to the characters in the film. It is enjoyable and very entertaining. I hope a sequel to this one where they put the other characters in the series and be more interesting."
    },
    {
      "rating": "10",
      "text": "this is the best movie for kids and old fans, the story is the best in 1 pups have to face his past in adventure city and i like the song too \"good mood\", the Graphics are HD i love skye ears omg...."
    },
    {
      "rating": "7",
      "text": "Un bel film per bambini.Senza dubbio, si consiglia di vederlo con i propri figli e molto meglio se sono fan della serie animata."
    },
    {
      "rating": "7",
      "text": "The movie is a one time thing. I don’t wanna watch it again and honestly if I could I would go back and unwatch it. But since I can’t and I now have to live with this, I will say the kids loved it, so that’s good I guess. I’d say just stick with the show though. It’s so much better, the voice actors are way better in the show than in the movie. I have it a seven bc it’s a kids movie and the kids liked it so that’s all that matters."
    },
    {
      "rating": "8",
      "text": "Kodomo no tame no hijō ni yoi eiga.Kono furanchaizu no fan ni osusumedesu."
    },
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "0",
      "text": "Just a cringefull movie. This cannot be compared to SpongeBob. THAT is better than this garbage."
    },
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "0",
      "text": "Cringe, Just Cringe. Please don't waste your kids childhood with this dumpsterfire of a movie."
    }
  ],
  "recommendations": [
    "the_spongebob_movie_sponge_on_the_run",
    "hotel_transylvania_transformania",
    "kidnap",
    "bad_boys_for_life",
    "hocus_pocus",
    "lost_in_space",
    "garfield_a_tail_of_two_kitties",
    "my_spy",
    "the_pacifier",
    "hannah_montana_the_movie",
    "barnyard",
    "marmaduke",
    "alvin_and_the_chipmunks_the_squeakquel",
    "the_game_plan",
    "herbie_fully_loaded",
    "diary_of_a_wimpy_kid_dog_days",
    "the_karate_kid",
    "yogi_bear",
    "sonic_the_hedgehog",
    "ghostbusters_ii",
    "alvin_and_the_chipmunks",
    "ice_age_the_meltdown",
    "17_again",
    "the_santa_clause_3_the_escape_clause",
    "spy_kids"
  ]
}