{
  "id": 4285,
  "title": "Pay It Forward",
  "starring": [
    "Kevin Spacey",
    "Helen Hunt"
  ],
  "runtime": 122,
  "genre": [
    "Drama"
  ],
  "description": "Like some other kids, 12-year-old Trevor McKinney believed in the goodness of human nature. Like many other kids, he was determined to change the world for the better. Unlike most other kids, he succeeded.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/62OIokwaxFwBFWM147ijLJsaVJD.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 7.25,
    "ending": 7.8,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The world can't change by itself, we must bring it.\r After watching this film I just remembered the quote from 'Sullivan's Travels' which says 'film's the greatest educational medium the world has ever known'. Indeed, cinema's for entertainment as well acts as a message deliverer. This was an inspirational movie, and everybody must see it. I know I'm a bit late to see it, better late than never, right? I'm really glad for having it at the right time because 15 years ago I did not have this blog to write about it.\r Ok, the name of the movie represents the theme of the story. No matter its a developed or developing country, society needs something like the idea this movie talks about. Carrying a good social message, the movie slightly lags behind the too much on the emotions, especially the end part. There won't be a problem if you like melodrama. Other than that, I feel the conclusion was smart and strong, a better solution which would appeal for certain group rather alternate finale.\r The film was based on the novel of the same name, crafted by a fine director with the wonderful cast. Haley Joel Osment had a great career as a child-star, you should check some of his films if you love children's movies including this title on the top of that list. As a middle aged actor, Helen Hunt's one of the last best performances before turning into a senior artist. It's not a usual role for Kevin Spacey, but he nailed it with the good dialogues. Especially his talk about the topic 'child abuse' was a great thing from the movie. Overall, the actors get more credit for the first-class acts as the script demanded for their respective roles.\r What did you ever do to change the world.\r A movie about a man who achieved in science gets the Oscar, not that real man. A movie about a man escapes from the war prison camp and slavery gets the award, and again none of those real persons. But a movie with the original, intelligent, inspiring, specially designed for a movie was not even a contender of the Oscars. Of course, it was transformed from a book, though there are/were no real people behind these great characters, all are imagined/created for the book and the movie. I never understood the American Academy Awards.\r By now you would know that I hate critics badly if you are a regular reader of my blog. Once again they failed to recognise how great the morality of the story is, rather they have concentrated to criticise the writing and the technical aspect of the film. Although, it was not a box office flop or earned beyond, but got a lot of praise from the families. It's a wonderful family drama, but still too far from being a masterpiece. Intelligent enough one to get motivated towards the social issues. Being practical in the real world is a concern as it is risky, depending on the situation and the person, just like this movie's ending. Rare to find a movie like this, you must check it out.\r 8/10"
    },
    {
      "rating": "4",
      "text": "After seeing this movie, all I had to say was \"Meh\". This movie's biggest fault is its repetitive nature. The plot just loops over itself constantly, and when lots of moments are sad, they can feel a bit unnecessary. For an example, the teacher, Eugene, will randomly get upset with the mother, Arlene, over and over again, but by the time a couple scenes have gone by, it's all okay again! Also, when Arlene slaps Trevor, at first it seems really well done (even though the kid can be really annoying) but then, they throw it all out the window by making them make-up in what seems to be less than three minutes. And do you know what happens next? They never mention it again! It's never brought up again once in the remaining running time of this movie! Maybe it's referenced, and I just missed it, but I didn't see any callbacks to it. The over-all plot can be nice, but I feel they repeat certain aspects that don't need to be repeated, and things that should be repeated, or even brought up again, simply don't see the light of day again. The acting is great for the most part, but those supposed \"Grade Sevens\" DON'T ACT OR LOOK ANYTHING LIKE GRADE SEVENS! They sound more like grade threes, and no, that's no exaggeration. The way the movie jumps forward and backward in time can also feel a bit messy. The music in this movie isn't necessarily bad, but it's overused...so...much! That piano piece, let me tell you just how annoying it got after hearing it about twenty times. A good element though is that the movie's jokes can be funny. Lastly, the ending is so sad, but so rushed. Trevor gets stabbed by some bullies that he'd run away from earlier in the movie. This death is so underwhelming! They should've made it something bigger, like if he'd sacrificed himself for his mother, or his teacher. The way it is just seems anti-climactic. I don't know, maybe I'm just wrong, but I really don't like it. I feel like the plot repeats, the grade sevens DO NOT look like grade sevens, the music gets annoying, and the characters aren't very memorable. In fact, when I was watching it for the first time, no one could remember the names: \"Arlene\", \"Eugene\", and \"Trevor\". Instead, they said: \"the Teacher\", \"the Mother\", and \"the Kid\". Keep in mind, this is just my opinion, but I think Pay it Forward should either have been changed, or not have been payed to go forward."
    },
    {
      "rating": "10",
      "text": "Sorry for the translation With the permission of the director, Mimi Leder, enter Class Trevor, as auditors of course. The lesson has already begun.\râ"
    },
    {
      "rating": "10",
      "text": "I can't believe that this movie is so underrated! Such a great story, brilliant acting and superb message make this movie a must watch for every single human being! Masterpiece!"
    },
    {
      "rating": "10",
      "text": "Beautiful film, top 10 of all time movies. It's humanistic, captivating and inspiring virtue. It's not cramping and could be a great ending of a busy day."
    },
    {
      "rating": "7",
      "text": "unfortunately this movie is underrated for many reasons, it might look like that the concept of the movie is silly,\rbut it's not, it's actually beautiful but the execution wasn't that good.\ri mean there are roughly 4 characters in this movie, and all the scenes with Jay Mohr were stupid and unmemorable at all.\rand that buried the movie, but the performances was spectacular by Kevin Spacey, Helen Hunt and Haley Joel Osment\ralso the plot was good and the ending was beautiful.\ri mean it's a simple beautiful story if you just think about it for a sec."
    },
    {
      "rating": "10",
      "text": "An incredible film which brings an original characteristic to the table, giving the audience a point of view that had not yet been recognized. Though leaving you in tears at the end, it shows the importance of how much one step in society can make a difference and even though we think we don't make a difference with the choices we make and we may not ever know the impact of those choices, the effect of them can still make a huge impact."
    },
    {
      "rating": "10",
      "text": "I thought that this was a really well done movie. The characters of both Trevor and Eugene were performed particularly well, I felt quite sorry for Eugene in parts and the fascination of wondering what lay in his past and to find out how or if the whole concept of paying it forward could work really kept me interested in watching this right through to the end. I can't say that the movie entirely answers everything, in that once its finished your left wondering, if this wasn't a fictional movie, could such a concept really work? is it worth a shot? in theory, its a pretty neat idea and sounds feasible. Of course, cynics would laugh this off, many people wouldn't believe that others would pay it forward, they'd find it hard to believe that some people wouldn't just take the free car or whatever it is and not bother to help anyone else out in return but I'm fairly sure there are at least some people who would try to re-pay the favour in that way. It makes you wonder, if we were all open and willing to give it a try, what would happen and could the world be made a better place. So in that sense, it is kind of touchy feel-y. I like that the movie is quite realistic in that it shows Trevor coming from troubled parents and shows his side of things, its believeable that he would do what he does to try and help his family and you do feel sorry for the poor guy, trying to get a father figure and to help out both his teacher and his mum at the same time.I must warn you, though, the ending has a twist, one that you probably won't see coming. I don't want to give it away but it is quite shocking. Thats another thing that I suppose did impress me about it too; it wasn't as predictable as such a movie probably could have been."
    },
    {
      "rating": "9",
      "text": "A poignant story that close to evеryone about the boy, who wanted to change the world, but thought that don't have enough power to accomplish such a big goal. In fact he has become inspiration for people, because he had courage to do something instead complaining on futility of attempts, like candle in the dark he has lighted many souls around."
    },
    {
      "rating": "8",
      "text": "A good movie that gives us the idea of ​​how to change the world... If only, it had the best idea to make the world a better place... Perfect performances, very good script, very good plot and editing and photography were excellent... It is one of the movies that everyone needs to see."
    }
  ],
  "recommendations": [
    "the_butterfly_effect",
    "slumdog_millionaire",
    "hereafter",
    "tomorrowland",
    "the_adjustment_bureau",
    "code_8",
    "bridge_to_terabithia",
    "heaven_is_for_real",
    "boyhood",
    "seven_pounds",
    "her",
    "there_will_be_blood",
    "the_giver",
    "v_for_vendetta",
    "chappie",
    "3_idiots",
    "fight_club",
    "soul_surfer",
    "babel",
    "revolutionary_road",
    "the_bucket_list",
    "children_of_men",
    "the_darkest_minds",
    "the_curious_case_of_benjamin_button",
    "contagion"
  ]
}