{
  "id": 4837,
  "title": "Payback",
  "starring": [
    "Mel Gibson",
    "Gregg Henry"
  ],
  "runtime": 100,
  "genre": [
    "Crime",
    "Action",
    "Drama"
  ],
  "description": "With friends like these, who needs enemies? That's the question bad guy Porter is left asking after his wife and partner steal his heist money and leave him for dead -- or so they think. Five months and an endless reservoir of bitterness later, Porter's partners and the crooked cops on his tail learn how bad payback can be.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gl295sH8213lY8aQ8hS2tTbuzYD.jpg",
  "categories": {
    "plot": 6.818181818181818,
    "acting": 6.6,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.833333333333333,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 6.4
  },
  "reviews": [
    {
      "rating": "9",
      "text": "For the release in Australia, the U.S. tagline \"Get ready to root for the bad guy\" was changed to \"Get ready to cheer for the bad guy\" because as Mel Gibson himself pointed out, in Australia \"to root\" is slang for \"sexual congress\"."
    },
    {
      "rating": "9",
      "text": "SVal Resnick: Did you get a name?Stegman: [finishing his drink] He said his name is Porter.Val Resnick: Whoa, whoa, whoa, he said he was there for Porter?Stegman: No he said he WAS Porter.[Val sighs]Stegman: I'm telling you I wouldn't want that guy after me neither.Val Resnick: Who am I? A nobody?Stegman: No.Val Resnick: I got friends. I'll I have to do is point! I pick up the phone and he's a dead man. And this time HE STAYS DEAD"
    },
    {
      "rating": "10",
      "text": "This is the story about manhood. Yes, Porter is mean, tough and uterly bad motherf...er. Not in a grotesque steroid Vin Diesel or Dwayne \"Rock\" Johnson style. You know and they know he would kick both of their buts. Its a shame, that nowadays we have this awfull global metrosexual trend.\rOh well, back to the movie - story is nice, if not a little bit too predictable, performances are excellent, there is some dark comedy. Great noir movie, instant classic in my book."
    },
    {
      "rating": "9",
      "text": "niggyugguugfgfhhftdguhffhhdsrydufighoufufufydfyighdtsdtdtgjgjgknknopbkcyfuewrufsghhiouuu"
    },
    {
      "rating": "5",
      "text": "Payback is a 1999 action, drama, thriller showcasing actors and actresses such as Lucy Liu, Mel Gibson and Maria Bello... Some of the action is good, Mel Gibson is average at best and the rest of the film though in colour feels a bit old fashioned and at times uninteresting. Can't be bothered going into the story or anything and for me the only real reason to watch this movie is for the funny and beautiful Lucy Liu who calls somebody fat boy in the movie. Watchable at least but nothing fantastic."
    },
    {
      "rating": "6",
      "text": "After a clumsily uneventful first act, \"Payback\" manages to redeem itself with some nostalgically noir-ish tonality and a healthy dose of subverted expectation."
    },
    {
      "rating": "7",
      "text": "Never a classic, Payback is just a nice mix of black comedy and action which does it's job well. It includes certain noir elements, such as a grey layering to the visuals and horn layden soundtrack, that help make it different and refreshing enough to stand out, and you also never know quite what to expect throughout the film either. Not one to have at the top of the viewing list, but one that's worthy of your time."
    },
    {
      "rating": "2",
      "text": "This movie is awful. It might have been good if Mel Gibson was still the lovable character from Lethal Weapon. Now that he has become another Hollywood freak, this movie loses all of it's 'charm'."
    },
    {
      "rating": "0",
      "text": "This movie is terrible. I turned it off half way through. It is confused about whether or not it is a comedy or a drama, and fails miserably at being both."
    },
    {
      "rating": "8",
      "text": "This film reminded me a lot that ancient \"noir\" films, for their style and the way the characters behave. It takes place in an environment where innocence simply does not exist: everyone has a secret, a dirty business, an illegal activity, they are criminals or prostitutes. Overall, it's a pretty good movie, that delivers on its promises, but that has fallen by the wayside over the years.The script takes a while to develop, but it becomes more interesting over time: we have a professional thief, Porter, who is tricked by his fellows (his wife and a friend) after stealing some Chinese mobsters, and is left for dead while they run away with his share of the money. When he manages to recover, he decides to go all the way to get revenge and to get his money back.Directed by Brian Helgeland, the film feels like one of those old thrillers with a likeable anti-hero who, despite being a bad guy, knows how to act with integrity and have honor. Suffice it to say that the main character only wants the money from the stolen portion and not the whole cake, or more than that, and this is offered to him on more than one occasion. The film has a very good story, somewhat slow at first but pleasant overall, and full of action and moments of ironic and intelligent humor. The pace is good, the film has energy and had a good editing.Mel Gibson is the man of the movie. In addition to being an agreeable protagonist and having made the film at an excellent time in his acting career (still enjoying the popularity achieved with the \"Lethal Weapon\" films), he imbues the character with enormous charisma and charm. Next to him, we have a ruthless, tough Gregg Henry. I also liked the work of William Devane, in the role of an elegant and sophisticated mobster, and Lucy Liu, who gave life to a sarcastic dominatrix prostitute and who, quite obviously, was fun to play for this renowned actress. Unfortunately, the film's two main girls - Rosie de Bello and Deborah Unger - cannot go beyond the clichéd register of the \"femme fatale\" of traditional \"noir\" movies.On a technical level, it's an elegant and enjoyable film. The cinematography features washed-out colors and a soft light that, personally, reminded me of the black-and-white look that is the hallmark of the \"noir\" genre. The atmosphere is grim, as the film moves through garages, narrow streets and marginal environments, where crime happens, to ascend to the lavish office of the mob godfather or the well-furnished mansion of a crime boss with expensive tastes. The film skillfully recreates all this through excellent sets and well-crafted costumes. There are some good quality visuals, specials and sound effects, but the film is very sparing in its use. The soundtrack, full of jazz themes, helps a lot in building the environment."
    },
    {
      "rating": "9",
      "text": "●●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "6",
      "text": "Let me start off by saying that this movie wasn't half bad, It could have been better but not half bad. Payback is about tough guy Porter who wants just one thing and one thing only, Payback! As the title so justly puts and he wants his money that was taken from him and he'll do anything and everything to get it back. What I found interesting about this film was the malicious way it was played out it was like an evil little wind up monkey that kept clattering and making noise and irritating yo until you got fed up and just step on the darn thing. Well that's the main plot for the movie, it's meant to zip along at only an 1hr. 34 mins. and it expects you to be entertained by this mess, but a good mess it was. Mel Gibson plays a character he's played a thousand times the macho tough guy with no fear. He played this type in all four Lethal Weapon movies, he played this again in Mad Max 1,2 and 3. So why did he try and see if he could pull it off again? Well becuase he can! And he did! Gibson puts some humanity and somewhat of a soul in an almost soulless character and he does it with such style and grace that it almost makes you want to slap Porter instead of punching him. And that's something, not by much, but something. Brian Helgeland( co-write for L.A. Confidential) tries to play on that moody, devil may care, I'll shoot you if you look at me cross eyed type of Anti-hero and that's all in good but the anti-hero he's created Porter is not somebody you can relate to, or even like for that matter, there were some scenes like I said that you wanted to hit Porter and then there were some scenes that you sympathized with him very well. And there is where this films greatness lies it gives you two sides of the coin to see, on one side the nasty Porter on the other side the kind and loving Porter. It gives you two sides to a very complicated and very world weary man and in my opinion that makes this a good movie. Payback is not action thriller greatness like Lethal Weapon or Die Hard but it does come very close, oh so very close, But the thing is with this movie is that it borders on almost a Noirish type style of cinematography and that up's it appeal to me and who know who else, but in the under lying layers of the film it does have greatness in it it just hasn't been able to tap into it fully but as time goes by this film will become a Mel Gibson classic and a cult classic for that matter. But is Payback a terrible movie? no way! Is movie making magic? Sorry to tell you no, nothing magical about this one but it is great fun to watch play out and follow along. All in all Payback is an almost can't miss action drama, it flows along nice and it delivers it's punches nicely, it doesn't waste your time and it is great, irresistible fun. Payback is a revenge plot you want to be apart of."
    },
    {
      "rating": "9",
      "text": "Gugugjbbbjjbjbjhyffyigihhononigugugugihhiihihihihihihihi,,,,,,,,,,,,,.....................☆☆☆☆☆☆☆☆●●●●●●"
    },
    {
      "rating": "9",
      "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆"
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "1",
      "text": "This movie looked bad. The lighting and color were crummy. The gentleman criminal tropes and cheap neo noir look are so bland. This was dull even by 90's standards."
    },
    {
      "rating": "5",
      "text": "Mel Gibson is amazing in it but its also pretty boring maybe i am just not into mafia movies that much"
    }
  ]
}