{"id": 616, "title": "Penguins of Madagascar", "starring": ["Tom McGrath", "Chris Miller"], "runtime": 92, "genre": ["Family", "Animation", "Adventure", "Comedy"], "description": "Skipper, Kowalski, Rico and Private join forces with undercover organization The North Wind to stop the villainous Dr. Octavius Brine from destroying the world as we know it.", "releaseYear": "2014", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/dXbpNrPDZDMEbujFoOxmMNQVMHa.jpg", "categories": {"plot": 6.266666666666667, "acting": 6.28, "ending": 6.428571428571429, "soundtrack": 2.0, "cinematography": 2.5, "familyFriendly": 6.1, "funny": 7.0, "action": 6.555555555555555}, "reviews": [{"rating": "10", "text": "One of the best movies of 2014. My kids liked it so much that they watched 4 more time. Everybody should watch it, because it one the best movies out there."}, {"rating": "10", "text": "I had a wonderful time with this animated spin-off of the Madagascar films. Extremely funny throughout, I mean Laugh Out Loud Humor. It kept me entertained throughout. Love the penguins but my favorite is Private. LOVE PRIVATE!!!!!! just in my opinion a great and funny animated film for everyone in the family to enjoy."}, {"rating": "9", "text": "All adults who care not for the simpler humor in life, kindly avert your eyes from this one--it's cute and fun and playful through-and-through. At 15 years old myself (and still a huge and unabashed sucker for animated movies) I watched this with my younger sister and we thought it was hilarious; we watched it about 3 times through just to fully enjoy the octopi's names, which (no spoilers) are puns. It's a family flick and we you shouldn't expect any groundbreaking twists or riveting storylines, fans of fluff and fooling around can get behind this fun Madagscar spinoff."}, {"rating": "7", "text": "I'm here so early with a change of this movie right here. So yes, as we expected... it's staying to be a score of 7. It's just decent that it actually works as a Madagascar spin-off."}, {"rating": "8", "text": "This movie is completely underrated, I know the story  is weak along with the plot but the jokes make up for it and some good characters so it deserves at least an 8."}, {"rating": "7", "text": "The penguins of Madagascar are the best characters in the franchise. We've been waiting for them to finally get a movie for a long time and now we finally have one. I enjoyed the movie. I thought it was really funny but there are a few flaws:\rThe spy animals are a bit one-dimensional. Plus they never get a backstory. They're a bit random as characters. Then again, so are the penguins.\rAlso,I think there should have been more scenes that were just the penguins having a bit of banter. When those scenes do come, they're hilarious but there should have been more.\rBut flawed as it is, it's a fun movie with great comedy. They should just do a sequel to this instead of Madagascar 4. (Seriously, how can you do a Madagascar 4?!)"}, {"rating": "10", "text": "The plot is great, it is hilarious, the back story is makes sense and it helps me get to know the penguins bette. Nicholas, cage anyone who dose not like this movie."}, {"rating": "7", "text": "I'm gonna be honest. I really enjoy the Madagascar franchise. The first was okay, the second was great even if it DID feel like it took elements from The Lion King, and the third was highly enjoyable. But you know who my favorite characters in the movie are? The penguins. So having them get their own film was expected considering the success of their TV series. And it was really fun. Sure, it has it's flaws (which I will get to later), but it makes up for it with some enjoyable action scenes, the fun and lovely animation, and funnier moments with the Penguins. Oh, sorry, I mean the \"Peng-wings\". It also helps us know them better, like how Skipper treats his team mates, and how Private feels about his position. However, the film isn't exactly perfect, and the problems can be found in the writing. The story seems kind of predictable and WAY too silly, even for a Penguins of Madagascar movie. Also, the jokes mostly fall flat, like the octopuses' names have to be given a joke, like \"Nicholas, cage them\" or \"Kevin, bake on\". But luckily, the action and lively animation make it really enjoyable."}, {"rating": "10", "text": "Who cares if people hate this movie, or that it's weird? It's pretty funny. I grew up with the lovable Madagascar penguins and the animation in their own movie was breathtaking."}, {"rating": "8", "text": "Getting their own episodes on Nickelodeon once, the penguins have gotten enough popularity to have their own movie. In terms of the plot, it's nothing to brag about. A silly villain with an even sillier plan to take over the world. It's entertaining as ever, however it's seems that they've forced it with a morale that's never been present until the end of the film. In terms of jokes, you just can't help but laugh. It's definetly a movie for your whole family."}, {"rating": "2", "text": "This film is the perfect example of a problem that has consumed animation films: when a film becomes popular, it is immediately consumed by the industry and turned into a dollar-making machine with a colossal dose of merchandising, TV series, sequels and prequels appearing every moment. After the success of Madagascar, Dreamworks hastened to do so. When the fountain dried up, noting the popularity of the penguins, who were more than secondary characters initially, but to whom it was being given relevance, they decided to make a film where the protagonists are them. Of course it was a mistake. It was the same with Timon and Pumba from \"Lion King\", with the Minions from \"Despicable Me\" etc.Okay, I agree Penguins were funny in that context in which they were born. But I do not think they have what it takes to be protagonists. After three \"Madagascar\", where their participation was growing, they were worn out and had nothing more to offer. When we look at the script of this movie, this is evident. There's nothing new, it's just a means to profit at the expense of the popularity of the four characters.In addition to this problem, the film has the most idiotic script I've seen in many years. Simply poorly done, it has more holes than a fishing net. You see, penguins enter Fort Knox, the most sheltered place in the United States after the White House, to devour snacks they'd find in an ordinary convenience store, but the snack machine has a crazy octopus that wants revenge because people like penguins ... then the whole movie is centered on the quest for outlawed octopus, the struggle to curb his plans and an idiotic rivalry between the penguins and a kind of millionaire organization that protects animals (but the octopus is not an animal?) at risk and helpless ... Now you ask: how did the octopus know that the penguins would enter Fort Knox? How did he get in there in the first place? What is the origin of the mysterious substance that transforms penguins into monsters? Where does the \"North Wind\" money come from? I do not know what you think, but I kept thinking the writers should be drunk or drugged when they wrote this.Technically, the film does not bring anything interesting either. I have seen CGI better and more realistic, the animations are not beautiful nor bring the brightness of other films, the colors seem a little faded and the soundtrack is quite weak."}, {"rating": "9", "text": "This is an hilarious movie with those wacky penguins. When they are around, you know you're gonna be watching a great movie, also having a ton of action and a funny cast of characters."}, {"rating": "8", "text": "Three generations of our family went to see this together, my wife was wiping tears out of her eyes at one point, my son giggling away and my in-laws both laughed out loud on multiple occasions. I great family film that I would rate over any and all the Madagascar movies. Take the kids to see it and you may laugh more than they do. 'Kevin, Bake On'."}, {"rating": "2", "text": "Sporadically amusing but otherwise hollow and over the top, the silly Penguins of Madagascar offers a derivative take on humour and thus, falls flat on its clichés."}, {"rating": "7", "text": "Ever since the Madagascar movies, I have been obsessed with the Penguins. I was so happy when their show came out and now we have a movie?! The movies was definitely no disappointment."}, {"rating": "4", "text": "Like 'Minions', this is an unnecessary spin-off about starring the comic relief characters from the original movies. It's sad that good characters like the penguins were tossed into this messed up movie, with 1-dimentional animals that are somehow spies and that have started their own secret alliance. The villain is strange, and the plot is ridiculous. Oh, well... at least it's better than 'Madagascar 3'."}, {"rating": "9", "text": "This movie is funny start to end. A movie that kids will enjoy. The pace is crazy funny, the jokes are humorous. Sound Mixing was OK. this movie will make your eyes cry. And Don,t forget this movie. Replay Value: High."}, {"rating": "10", "text": "i thought the movie was funnier then heck. everybody in the theater laugh a lot out loud. those penguins are just funny..  saw the preview of square pants sorry that is one i will pass on.  lots of cartoon type coming out here shortly most i will pass on"}, {"rating": "7", "text": "It's seems like now days their are a lot of supporting character in Animation movie that just so popular by themselves that they just manage to have their own merchandise and now even having their own movie like Minions ( 2015 ) that will come to cinema this year from Despicable Me ( 2010 ) and now the Penguins from Madagascar ( 2005 ) and they already have their own TV-Series so that's quite amazing already.\r To be honest this movie is all about the gangs of Penguins the main characters with Skipper , Private , Rico and Kowalski , if you love them or even like them then you will probably have a good time with these characters just so funny , so lovely and their unique characters brought some unique relationship story that just so interesting.\r BUT if you don't like them or just like don't care about them that much , then this movie will be pretty boring , with other things outside of the main characters the penguins themselves is just so \"Mediocre\".\r For example the story , it's just so repetitive and predictable we have seen these type of story like ten times already which makes the movie kind of uninteresting.\r the other thing that this movie doing quite bad is other supporting character they're so mediocre , uninteresting and boring doesn't matter if it Agent Classified that voice over by Benedict Cumberbatch or the main villain voice by John Malkovich because the written for these characters is just so mediocre , so repetitive that in the end you just don't care about them at all.\r For me personally though i like this movie and i'm having a great time but honestly a lot of that come with my like and love for the penguins since first Madagascar ( 2005 ) and i just can't deny the repetitive of the story and supporting characters , so i can't give it any much more score , in the end this is a good movie for penguins gang fans but mediocre movie with others."}, {"rating": "3", "text": "The new Dreamworks animated movie is a spin-off of the popular but not so good Madagascar film series and it’s their 3rd feature of this year following Mr. Peabody & Sherman and the sequel to How To Train Your Dragon.\r The plot involves the 4 well-known cute and cuddly penguins Skipper, Kowalski, Rico, and Private going against our villain, a purple octopus named Dr. Octavius Brine who’s trying to collect all the penguins around the world and transform them from cute and cuddly to monstrous and disgusting. On their way they encounter an elite undercover inter-species task force called North Wind that the penguins will also have to deal with.\r Now, this is a spy thriller and like all spy thrillers this one features a lot of gadgets and super-secret agents trying to stop a villain from conquering the world. Classic formula. Thus, when going into a movie like this you have to suspend your disbelief because you know that some of the gadgets or gizmos are capable of the implausible. However, this is not the case because the most inconceivable comes from the things that go down in the action scenes. It’s not ridiculous in a fun way. It’s ridiculous in a head-scratching and unpleasing way. You could dispute about the fact that is an animation and things like this shouldn’t be taken seriously but even for an animated movie it is unendurable. I was in with my 12 year old cousin and I thought she would like the film but I noticed that she facepalmed herself lots of times during its running. That’s how you know they went over the top.\r The movie begins with our 4 fellas breaking into Fort Knox as a present for Private’s birthday. They arrive on a makeshift glider, they take down a few guards and put in an unlikely voice password (but hey, you never know) and boom they’re in like that but wait because the movie isn’t only taking our suspension of disbelief and is beating it over with a mace but it also makes us drop our jaw on the floor from how stupid it can be. So, after they break in arguably the most guarded place in the world with just a few moves,they’re not looking for the gold but for the chips vending machine that’s in the back of the gold room. I am not even kidding. That happened. Later they escape from an airplane that flies at an altitude of 8 km (if I don’t mistake) by opening the cargo door and breathing without worries as if they were on the ground. Below them another airplane is on the route and they jump and just smash through the steel fuselage and get inside, again like it’s something normal, and get to the cabin and take out the pilots and change course while the passengers in the back are just a bit scared because of some penguins breaching in. Just that. Something is wrong, isn’t it??? Yes, it is. After Skipper and his comrades smashed in there were no alarms going off, nothing signaling an uncontrolled decompression that would probably,most likely make the plane crash. Only a lot of screaming.\r But this movie is not only characterized by ludicrous events but also by a clichéd and predictable plot and one-dimensional characters. The screenplay is written by John Aboud, Brandon Sawyer, Tom McGrath and Eric Darnell. There’s nothing interesting about these penguins and since the screenwriters didn’t have any new ideas for an original or at least working story they just put in some spy movie clichés that we all moviegoers know about and added in a dash of gags. Adding some smiles didn’t save its reputation because not even the smiles are good. They either last for too long or just aren’t funny. There was only one pun relating to the fiscal issue in France that actually made me laugh.\r Though the screenplay wasn’t good I can’t say the same about the camerawork. Sometimes the camera follows graciously and smoothly the protagonists giving the movie a better flow and making the nonsensed and fast action easy to follow. The editing is top notch and the animation is beautiful presenting vivid and powerful colors.\r These were the only positive aspects of this picture. Luckily, I had the opportunity it in 2D and not in 3D. I heard from different critics that the 3D was good and that’s proving once more that Dreamworks has a certain respect for the 3D but I wish they respected us moviegoers and kids as well by delivering movies that are good on a story level.\r Honestly, this year was a pretty good year for movies and I thought this one was going to stump my bad feelings regarding it but it’s just another piece of gain from the studios and it’s more an exhausting ride than exhilarating one. Kids will have fun and I guess this film is going to make a crap load of money and it will spawn a few (5) sequels that I hope not, of course, but I fear will all be this bad. Adults will be able to enjoy it only whilst being drunk. Yep, get ready."}, {"rating": "0", "text": "This movie has totally unoriginal jokes and silly humor. You actually feel like the script has been forced out of writers at gunpoint. I usually don't write reviews for movies, but this one was bad enough to compel me towards writing it."}, {"rating": "6", "text": "The original 2008 film had the same name, but this time they're crossing the globe to prevent Dr. Octavius Brine from carrying out his evil plans. This is a fun foursome with lots of quick-witted banter. The energy never lags and the snappy one-liners are almost constant. For the grownups there are plenty of pop in jokes. My fave was the villain's orders that included movie star names, like: \"Drew! Barry! More power!\" (say it out loud). And it's true, Benedict Cumberbatch can't properly pronounce penguin. Stay thru the early credits for one final bit."}, {"rating": "6", "text": "Kids might be the only one enjoying the hilarious and adventurous penguins journey far across few beautiful countries in which the visual of the cultural backgrounds are presented extremely stunning as usual by Dreamworks. The spin-off of the Madagascar characters further continues the ridiculousness of the franchise but unexpectedly, the over-ridiculous screenplay has already been seen elsewhere, and it looks a little bit more silly for the elders. Although lighthearted, the paper thin plot that does not allow much of characters development and utilise the ideas from other animations by changing a small part here and there are unable to make the adorable yet naughty penguins to match the quality of the old times of studio's production, even any recent Disney's production, or to match Puss in Boots (spin-off of Shrek series). However, it is indeed a straightforward entertaining stress-free flick even if it falls short of generating powerful inspiration, love and emotion."}, {"rating": "5", "text": "What a disappointment considering the other great dream-works products...cliches and used up gags were unable to save a storyline that frankly was pathetic.  What makes it especially painful were a magnificent cast who's efforts could not save this disaster....now just maybe a 5 year old or younger might miss what us adults experienced..."}, {"rating": "4", "text": "I love the Madagascar movies but this is just kind of boring and pointless. Sure it has its moments but the movie fails to entertain me. Like even the fight scenes were boring. I didn't really find it enjoyable but i'm sure the kids will like it. It's pretty much on my top 10 worst animated. Even though it had is moments this movie just doesn't deliver."}, {"rating": "7", "text": "The Hunger Games - Mockingjay Part 1 had a more rich drama and romance, due to Katniss' preocupation of Peeta (that didn't appeared in both prequels, due that she was faking). Buy it had way less action. That sense of mistery, suspense, action that had especially the first one, and the second one, didn't appeared in this episode of The Hunger Games chronology. I give a 7/10\r - Rich Do."}, {"rating": "6", "text": "The Penguins of Madagascar is the Penguin scenes from the previous films and the Christmas short but extended into an 1 hour and a half. Surprisingly it never gets dull with the film constant moving from one scene to another with lots of energy and at no point is the original Madgascar crew missed as the penguins have always been the stars and prove they can carry the show on their own. Unfortunately, they are joined by a crew of not that interesting characters who weigh down the film following its first ten minutes. Even with this the film is still fun from the Dreamworks style humor involving an overlord of pop culture references and tons of other jokes that surprising don’t get on ones nerves. The film doesn’t do anything deep with the Penguins and at times the film could’ve used some heart but there is a lot of fun and energy among the core characters that keep the film from falling apart. Penguins fans will enjoy the film as they are finally getting the Madagascar film they wanted. Those who aren’t a fan of Dreamworks’ style of humor will probably want to skip this one. Its nowhere near quality of Dreamworks’ How to Train Your Dragon 2 but it’s a fun hour and a half that even with low quality writing and humor that somehow shouldn’t work still manages to be a step above most Dreamworks films."}, {"rating": "6", "text": "Some animated movies tell deep stories meant to teach kids something, while others simply want to make them laugh. \"Penguins of Madagascar\" is the latter. The jokes come at an almost non-stop rate. The plot is a cliché spy story.\r The humor itself is very childish. Kids are sure to keep laughing throughout, but unlike the best animated family movies there isn't much here for older audiences. Outside of a reoccurring joke regarding celebrity names most of the jokes parents and teens would laugh at were spoiled in the trailers.\r \"Penguins of Madagascar\" is a ridiculous film perfect for children. It might not rank among their favorite animated films, but it will still entertain them. Parents can appreciate the crazy fun it will provide their young ones."}, {"rating": "5", "text": "While there are a few funny one-liners, especially the celeb names (Drew, Barry, more power! Hugh, Jack, man the battle stations! Nicolas, cage them! etc.) most of the movie just feels like it was written by a 5 year old, with 3 year old's being the target audience. It is just so dumb, and it neeeeeeeever gives you a chance to breathe. There's constantly something going on. Try to watch it with your kids (although I'd recommend just letting them watch it on their own)."}, {"rating": "6", "text": "A fun and exiting movie, that’s fails to deliver over long term. But I love the classic spy-action theme, and the movie is overall better than what I expected. The choice of voices are great, especially Benedict Cumberbatch. The story is acceptable but I can’t really relate to the characters and the movie doesn’t fit very well for me.\r Penguins of Madagascar gets a 6/10."}, {"rating": "6", "text": "A fun but definitely flawed film. The new characters are a bore and just feel like placeholders just so that the Penguins can do things. The Penguins are still charming, but given the fact that it has a \"been there, done that\" plot, it feels tiring and predictable as well (Not to mention that it also borrows elements from Despicable Me 2). It's also, in my opinion, too fast paced and doesn't really care about anything else other than the Penguins. Small children will be able more enjoyment of this one."}, {"rating": "6", "text": "Penguins of Madagascar is just another children's movie. It has some funny parts, some nice jokes, but it is mostly boring and very cliched. Any kid less than 10 years old will like it, but I can't say for anyone else."}, {"rating": "6", "text": "A recycled idea, with simple interpretations, unpredictable story-telling, not-human characters and normal animation is the miepxed result of this unremarkable film. But, at least, is a great film for these good protagonists of a good thrillogy."}, {"rating": "6", "text": "“Penguins of Madagascar” promises a reasonable share of wit the minute it opens with a voice-over by Werner Herzog, in a sendup of his documentary on Antarctica, “Encounters at the End of the World.” That film posed the question of whether penguins could exhibit insanity. In the case of this spirited animated movie, the answer is assuredly yes.\r The heroes are a feathered task force of secret-agent-like penguins, led with military discipline by Skipper (the voice of Tom McGrath). Literalists who complain that penguins do not live in Madagascar should note that the title refers to the “Madagascar” movie franchise.\r Although “Penguins of Madagascar” might look like a down-market spinoff — the original vocal stars, including Ben Stiller, Chris Rock, Jada Pinkett Smith and Sacha Baron Cohen, don’t participate — the decision to focus on the series’s comic relief has resulted in the loosest and perhaps funniest film of the brand.\r After a narrative setup that provides the wisp of a tether to the earlier movies, the four penguin main characters infiltrate Fort Knox — to visit a vending machine filled with discontinued cheese-puff snacks. They are soon whisked away by the genetic researcher Dr. Octavius Brine, actually a disguised, disgruntled octopus named Dave, with whom the penguins resided during a stint at the Central Park Zoo.\r Dave (a sporting John Malkovich), who sometimes barks orders in the form of actors’ names (“Nicolas, cage them”; “Robin, write this down”), plans to kidnap penguins from zoos and aquariums and transform them, ridding them of their cuteness. There will be no more cheering crowds and, as the movie acknowledges in a separate gag, no more documentaries.\r In their quest to thwart Dave’s plot, the penguins have competition: a squad of Arctic animals commanded by a wolf known only as Classified. That Classified’s voice belongs to the ubiquitous Benedict Cumberbatch is almost as amusing as any of the jokes.\r Visually, the movie, which can be watched in pointless 3-D, has little to set it apart, although a few of the mutant-penguin designs are worthy of the “Gremlins” director, Joe Dante. Still, the lack of originality is offset by sheer silliness, including Classified and Skipper’s Abbott and Costello-style argument over whether there’s a long I in “diversion.” The word fits the movie."}, {"rating": "5", "text": "Should be much funnier with these characters. Animation isn't great and writing is very lazy. Disappointing."}, {"rating": "8", "text": "The Penguins of Madagascar es una película que, digamos, hace un buen uso de sus características para dar un buen entretenimiento tanto a niños como adultos.\r Esta película resulta ser un film atractivo que nos cuenta su historia de una manera bastante excéntrica y que, al fin y al cabo, ese excentrismo acaba siendo una buen elemento que la hace ser poco peculiar. Además, encaja muy bien los aspectos de su trama en el género familiar logrando ser atractiva., siendo así un film que se puede tomar a considerar en las noches de cine de familia."}, {"rating": "7", "text": "The Penguins of  Madagascar is a funny and lovable film . All the actors did well. Those who are familiar with the TV series will hate certain things like penguins turning into monsters. The villain character was not great and the some portions could have been better. The final act was great."}, {"rating": "10", "text": "Penguins of Madagascar is a faithful and delightful film adaptation the Nickelodeon TV show of the same name. Actually, this film was quite interesting, adventurous and fun! The movie contains the same Thea of suspense, action, adventure and laughable comedy from the previous Madagascar films as well as the TV series of the same name. Stop hating these four adorable little guys and be positive! To me, I was really waiting for a movie solemnly focusing on the four penguins and this film does a successful job bringing their charm and wit to the big screen in 92-4 minutes rather than 25-30 minutes. This is also a very good animation effort! Well done Tom, Chris, Conrad and Christopher! I also wanted to know more about the history of these lovable four spy birds and exactly how they came to New York City and had been living in Central Park Zoo, forming the Nickelodeon TV series ever since. This film is a story of friendship, finding family, teamwork, action and adventure, betrayal and all coated with cartoon comedy! Well done Eric and Simon!! Also there are some charming and heart touching moments. It's fun for the whole family! This movie is funny start to end. A movie that kids will enjoy. The pace is crazy funny, the jokes are humorous. Sound Mixing was OK. this movie will make your eyes cry. And Don't forget this movie. Replay Value: High."}, {"rating": "10", "text": "God I love this movie about the pengwings xd so cute movie. I don't know if somebody hate the cartoons why watch it and write rewiew nonsense -.-\"\" It is good movie."}, {"rating": "5", "text": "Cuando supe que habria una pelicula sobre los pinguinos me emocione bastante, siendo que en la trilogia original ellos eran super geniales y con situaciones bastante memorables y creativas. Pues, desgraciadamente esta película basada puramente en ellos no aprovecha nada de esas situaciones, y en su lugar nos da mucho humor y situaciones cliche que ya estoy harto de ver una y otra vez. Ademas los motivos del antagonista principal son demasiado tontos solo para dar una excusa al conflicto de la pelicula, que bien podria ni haber ocurrido nada de lo que paso. También otra queja que tengo es que los nuevos personajes de esta película que forman parte del grupo **** Polar\" al final a pesar de todas las cosas que hacen para impresionar a Skipper, al final no hacen nada en la pelicula, siendo atrapados muy facilmente. Que presumidos...Si contáramos a Los Pinguinos De Madagascar como parte de la trilogía de Madagascar, fácilmente, en mi opinión, esta es la peor."}, {"rating": "9", "text": "A great film for kids and parents.  I actually can't stand the Madagascar films/shorts but this one is pretty good and is in my car for short road trips.  Too bad it didn't get good press and will likely be the last one."}, {"rating": "6", "text": "I very much liked the series on Nickelodeon in the 2000s and this movie catches that feeling unexpectedly well. You have a thrown together crew of penguins, who are more stereotyped and less competent than they seemingly used to be, mentally insane villains and nothing less is at stake than the entire world. Well, not really, but it certainly seems like that is the case.An entertaining movie, but I guess I've just grown out of it, there's just nothing much to be offered for older teenagers or even adults."}, {"rating": "10", "text": "по моему скромному мнению я щитаю що пингвини из магадаскара один из самих лутших мультфильмив пиксара провда одноимьоний мультик не очень сами смишни сцени це ти где люди толкають пингвинив до тюленив и тогда когда осьминог типа огромний а на самом деле он стал маленьким"}, {"rating": "8", "text": "this movie is great! one of the best movies from 2014 along with night at the museum 3, guardians of the galaxy, captain america 2, transformers 4, planes 2, and big hero 6!"}, {"rating": "8", "text": "This is just like minions. Except,With penguins. Penguins vs minions. who wins? Penguins."}, {"rating": "9", "text": "By far the best madagascar movie, it is just so fast, so entertaining, so delightful, the movie is animated beatifully, the action is fast paced and aweaome, it's funny, it's epic, it's emotional, everything most animated movies can't do. It is pretty difficult to dislike this movie."}], "recommendations": ["despicable_me_3", "minions", "hotel_transylvania_3_summer_vacation", "incredibles_2", "despicable_me_2", "spies_in_disguise", "hotel_transylvania_2", "turbo", "despicable_me", "madagascar_escape_2_africa", "the_angry_birds_movie", "the_lego_ninjago_movie", "the_lego_movie_2_the_second_part", "the_lego_movie", "cloudy_with_a_chance_of_meatballs_2", "ice_age_the_meltdown", "storks", "the_secret_life_of_pets_2", "the_secret_life_of_pets", "madagascar", "megamind", "the_angry_birds_movie_2", "the_lego_batman_movie", "flushed_away", "captain_underpants_the_first_epic_movie"]}