{
  "id": 1874,
  "title": "Peppermint",
  "starring": [
    "Jennifer Garner",
    "John Gallagher Jr."
  ],
  "runtime": 102,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "A grieving mother transforms herself into a vigilante following the murders of her husband and daughter, eluding the authorities to deliver her own personal brand of justice.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jrzxS0vcbzIIay1sdYm0rgI2QfJ.jpg",
  "categories": {
    "plot": 4.916666666666667,
    "acting": 3.0526315789473686,
    "ending": 6.666666666666667,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 1.0,
    "action": 5.884615384615385
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Peppermint is an action thriller which tells the story of young mother Riley North (Jennifer Garner) who awakens from a coma after her husband and daughter are killed in a brutal attack on the family. When the system frustratingly shields the murderers from justice, Riley sets out to transform herself from citizen to urban guerilla. Channeling her frustration into personal motivation, she spends years in hiding honing her mind, body and spirit to become an unstoppable force - eluding the underworld, the LAPD and the FBI - as she methodically delivers her personal brand of justice"
    },
    {
      "rating": "6",
      "text": "Better than average action movie.  Garner is compelling as lead.  A little slow getting started then moved along the last 2/3 of movie.  Good choice for a matinee or eventually a rental."
    },
    {
      "rating": "7",
      "text": "Jennifer Garner is an Avenging Angel of Death Serving Justice with a M-16.Jennifer Garner goes from a suburban “Girl Scout mom” to bad ass gun toting assassin, Riley North, on a mission to kill anyone involved the murder of her family. You probably know Jennifer Garner from her Capital One commercials or her overly publicized three-year divorce proceedings from rehabbed Ben Affleck.  Yet, not too long ago she was Sidney Bristow, a sexy undercover spy, in J.J. Abrams’ Alias. Or you might remember her as the beautiful sword swinging ninja assassin-for-hire in Marvel’s Elecktra? In Peppermint, Jennifer Garner returns with a vengeance. Riley’s super cute 9-year-old daughter (Cailey Fleming – Star Wars: The Force Awakens) and handsome husband (Jeff Hephner – Interstellar) are in the movie just long enough to for you to fall in love with them and becomes outraged when they are machine gunned down by the L.A. Mexican drug cartel while innocently eating peppermint ice cream cones at the Carnival.   Despite Riley identification of the face tattooed killers in a line up, the corrupt judge lets them go. Enraged, Riley goes off the grid for five years hiding in L.A.’s Skid Row, training and preparing to exact her revenge. Director Pierre Morel (Taken) knows action movies, and like Taken this one is no exception.  Sometimes when a movie is firing on all cylinders it is criticized for being too formulaic.  Sure, it won’t win any Oscars, and this was no John Wick, but this was a fun ride of non-stop violent revenge.  While not for everybody, if you liked Death Wish, Punisher or The Equalizer, you will love Peppermint."
    },
    {
      "rating": "0",
      "text": "A Mary Sue Death Wish wanna be. It actually had the ingredients for a decent movie. With a semi-competent director and scriptwriter, it could have been good. But it didn't and it wasn't. Fails on every level. Even the title is a loser."
    },
    {
      "rating": "9",
      "text": "Critics blundered a movie review again. I thought this movie was fantastic, Jennifer Garner really had you feeling for this woman. No she couldn't fly, add no super powers but she kicks butt."
    },
    {
      "rating": "9",
      "text": "This movie was even better than I expected... & I was more than pleasantly surprised by Jennifer Garner, Action Star."
    },
    {
      "rating": "6",
      "text": "It's a ok movie. It isn't a good movie nor a bad movie. The movie is slow at the beginning and sad at the beginning. There are a lot of action scenes in this movie. Also the plot is ok and another revenge movie."
    },
    {
      "rating": "10",
      "text": "Im very annoyed that these critics rated this movie the way that they did. Just saw it today and I think it's a great comeback film for Jennifer Garner.  She did something in this film that most NEVER do. I won't ruin it for those you haven't seen the film. Great film! Worth seeing. I hope she decides to do more films in the future."
    },
    {
      "rating": "10",
      "text": "This movie was excellent. I am not familiar with Alias but I am now a Jennifer Garner fan! She kicked butt and took names. I actually want to see it again today. Great ending which sets it up for a sequel."
    },
    {
      "rating": "7",
      "text": "Garner really makes this movie - she knows she's in a relatively low-rent revenge flick, but she doesn't act like it.  Reminds me of her stellar performances in Alias about 13 years ago. The woman is ageless.  The supporting cast, the writing, and the directing are all very average, but the star is gold."
    },
    {
      "rating": "3",
      "text": "Jennifer Garner put effort and desire into her first action role in 11 years since she starred in ''The Kingdom'' but apparently she was the only interested in doing so because ''Peppermint'' is a action thriller very simplistic and conventional and also too similar to all the ones that Bruce Willis has delivered in recent years."
    },
    {
      "rating": "8",
      "text": "No idea why critics hated this film so much. I found it to be a very enjoyable but dark revenge-action film that makes you root for a killer in the best Death Wish style. Jennifer Garner is a believable vigilante, though I would've liked for the film not to have skipped over her transformation from mom to trained mercenary."
    },
    {
      "rating": "2",
      "text": "Despite Jennifer Garner acting efforts, but her hard work is put to waste in this boring revenge movie. It's laughable how the title 'Peppermint' is named after an ice cream, and it wants to be taken serious.Why dose Pierre Morel keep making these type of movies?"
    },
    {
      "rating": "8",
      "text": "Another example of how critics are disconnected from what audience likes to watch. Movie is good, fun and relaxing. It's time for distributors to stop listening to critics if they want to sell tickets."
    },
    {
      "rating": "8",
      "text": "I really liked this movie. The action and fight scenes were spectacular. Jennifer Garner's performance was stupendous. The soundtrack and musical score were fantastic."
    },
    {
      "rating": "7",
      "text": "Easy on the Stomach (Peppermint Review)Peppermint is not really a complex film. It's a straight forward action film that feels like a showcase for Jennifer Garner. Are there  underlying messages? Yes, and I think the film tries to be more hardcore than clever e.g. don't enable or let substance abusing take precedence over child rearing or suffer consequences. Is this film social commentary? It definitely leaves the viewer to discern then decide which is always an interesting dilemma for an audience.Vigilanteism (eh-hrm…) in Peppermint is holy water against hell fire except in the confines of the legal system - illegal. Who is going to stand against systemic corruption and how? Riley and \"a very particular set of skills.\" The film is  decent and feels like a warm-up for the lot of films releasing with female protagonists embarking on their quests of justice, righting the wrongs of evil men.Overall Grade: C+-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "8",
      "text": "Jennifer Garner is trying her best. She succeeds in being a loving mother who after getting her world torn apart becomes a symbol of justice. Not like good justice but like a violent gun totting batman justice. It sounds weird, but I believe this works well with what they are going for. After being broken and destroyed by the system she trains for years to become a killer. I love they added this. Sometimes it`s just explained by, oh golly I forgot she was military trained back in her service years. It makes sense it takes time for her to be this way. A scared person pees themselves. THAT’S REALISM. Villains when scared resort to out lash and typical things cowards do. I love all the realism like this, even how Jennifer or Riley holds all her guns make sense. There are some small details that continue. Jennifer gets stabbed and for the rest of the film that side, or leg hurts, and she shows it with every step. I love continuity. There is fluid action. It is in between the long shots of John Wick style action and quick edits like Taken 3. It is a healthy mix that is easy to follow.  Film name is weird, could have picked something else. All movement is military."
    },
    {
      "rating": "4",
      "text": "I thought the idea was good, but the execution of this movie was poor. Personally didn’t think that Jennifer Garner was the right fit for this movie."
    },
    {
      "rating": "8",
      "text": "No clue what the critics saw, but this is a fun action movie!  I've always loved Jennifer Garner's ass-kicking ways (she's been wasted in sentimental dramas for the last decade or so). It's MUCH better than something like the new Willis Death Wish.  Check it out...."
    },
    {
      "rating": "8",
      "text": "Looks good to me. Bit of same old same old, but seems a good robust, vengeance film.  Like to see the whole thing."
    },
    {
      "rating": "5",
      "text": "Stereotypical revenge movie. Garner played her role well though. This is a perfect movie to watch at home via Redbox when you got abasolutely..Nothing. And I do mean Nothing..else to do.I've seen this theme in a thousand movies in my life..drowned out by gunfire. I've forgotten it already."
    },
    {
      "rating": "4",
      "text": "This was just not good. The first 5 minutes of the movie give you the idea that you are about to watch a groundbreaking (seriously, they kill the girl?), emotionally strong movie with a strong foundation and background story. However, nothing is further from the truth when Garner suddenly emerges from a five year absence as a fully combat-ready-super-assassin, with no more then a 3 second Youtube video as explanation of how she got there. The movie than goes on to bore you for another +/- 90 minutes with pretty much standard one-of action movie writing and “unexpected” plot twists. After having seen the trailer I was under the impression that this would finally be a one-of action movie worth watching, couldn’t have been more disappointed."
    },
    {
      "rating": "0",
      "text": "\"Can I have a peppermint?\" \"You can have a peppermint.\" \"That's too hot for me.\" \"Bleh!\" \"Hey!\" \"AH!\" \"I don't like the peppermint.\" \"You don't like the peppermint?\" \"No! It's too spicy.\""
    },
    {
      "rating": "5",
      "text": "Pretty simple premise. Had a hard time buying into the main character's transformation. All in all a so-so popcorn eating action film with a ridiculous title choice."
    },
    {
      "rating": "3",
      "text": "All though it was a good movie overall i thought that the main character could have been played much better by the acting ledgion tim allan famous for his works in tim allans zoom"
    },
    {
      "rating": "0",
      "text": "I'm a latina immigrant. In this climate of hate this is the very worst and irresponsible movie to make. It just feels like making a victim out of Jennifer Gardner's character is a cheap excuse for some people in America to root for a person like them to shoot people like me."
    },
    {
      "rating": "2",
      "text": "A dreadful, cartoonishly over-the-top redux of Death Wish or The Punisher.  Garner has moments of impressiveness as an action star, but the gore and awful acting will put off most viewers with any sense of taste."
    },
    {
      "rating": "10",
      "text": "Once again, the critics got it wrong! Did they see what I just watched? I've been waiting for Peppermint to come out after seeing the trailer, bought it tonight and couldn't wait to watch it with my husband. As a 40-something soccer mom, I couldn't help but root for Riley. It was easy to empathize with her and cheer her on. This is now one of my new favorite movies.  How this has a low rating is beyond me..... I have over 1200 movies on my VUDU account (we are a bit of a movie fanatic family) and this is on my top 5 of all time favorite action movies. I've always loved Jennifer Garner, but now, I have a serious girl crush on her. She's bad ass. I signed up to Metacritic tonight, just so I could leave a review because I was so disappointed with pretentious critics who think they know what makes a good film. Don't trust the critics, this is a must see!"
    },
    {
      "rating": "4",
      "text": "Very cliché and unbelievable revenge action movie. It starts out pretty good, but gets totally unbelievable in a hurry. In the end you'll be glad it's over, that's something I guess."
    },
    {
      "rating": "5",
      "text": "Garner is great. The action is solid but the story lacks depth and focus. In what could have been a female \"Punisher,\" instead wastes a great performance by Jennifer Garner"
    },
    {
      "rating": "6",
      "text": "Peppermint is about as generic as they come when compared to others in the revenge action movie genre. There is little in the way of plot to explain the lead characters inexplicable transformation into a killing machine after the short intro- not even a montage But if you're willing to accept that there are some decent action scenes to carry you to the predictable ending. Sadly i never felt truly invested in Riley's need for revenge - i could never get behind  the emotional impact of the death of her family and the subsequent kill spree. It just felt like jennifer garner doing what she does best a la electra and alias. Despite its average all roundness this was an enjoyable watch and certainly well paced."
    },
    {
      "rating": "6",
      "text": "By the numbers revenge flick. Totally implausable and at times down-right silly. But at the end of the day it was a bit of fun and perfect if you need to switch your brain off"
    },
    {
      "rating": "0",
      "text": "Encore un film de vengeance féminine… je ne suis pas contre, bien au contraire quand c’est bien fait ou pas trop mal foutu… mais là Jennifer Garner, ça va pas le faire, ni Pierre Morel réalisateur français de daubes hollymerdiennes à la petite semaine : on dirait d’ailleurs l’une de ces bessonneries typiques basses du front et de plafond de chez Europacorp !Et ce Peppermint ne fait pas exception à la règle : un scénar de crevard et bâclé qui ne ferait même pas bonne figure pour un téléfilm de seconde zone. Et encore. Et en plus, ça se traîne et on s’y fait chier directum. Quant à Jennifer, eh bien, elle est gentille mais elle assure pas une cacahuète sur ce (mauvais) coup-là : elle est au moins au diapason du film, c’est-à-dire tout en bas…Bref, ça ne vaut pas un pet, même pas un pet de travers, ni une flatulence furtive : c’est gros comme une maison et ça pue du fion !"
    },
    {
      "rating": "1",
      "text": "I love Jennifer Garner, she is one of my favorite actresses ever, but this movie was pretty much nothing more than a feminine rip-off of The Punisher (2004). Jennifer Garner’s acting was amazing in this revenge flick, but it’s just not enough to save a crappy, predictable, unoriginal, generic, cliched violent by-the-numbers revenge flick. Her character is basically a feminist Punisher/Frank Castle rip-off. The only reason this movie gets a 1 is because of Jennifer Garner’s amazing performance. She is a great and very talented actress, but if she wants to be an action star again, she needs to choose a much better role in an action film with a solid script. It’s a damn travesty she was nominated for a Razzie for Worst Actress for her role in this movie. Her acting wasn’t even bad at all! The Razzies, like the Oscars, are a BIG JOKE!!! Sometimes they nominate actors who did good acting in bad movies just because they think it’s funny (even though it’s never funny). They sometimes nominate an actor for being in a bad movie even if their acting wasn’t bad in it. The same **** happened to Ben Affleck (who coincidentally is Jennifer Garner’s ex-husband) in 2016 when he was Razzie-nominated for Worst Supporting Actor for his role in Batman v Superman: Dawn of Justice."
    },
    {
      "rating": "8",
      "text": "I have to admit, this is a complete guilty pleasure. The script is predictable, the action is well directed but offers nothing new, Jennifer Gardner is improving and de villains are cartoon versions of the real deal. In other words, it is kinda bad. But I loved it! A character taking justice in her own hands will always be appealing to me. So if you like watching bad guys getting blown away, you will like it too."
    },
    {
      "rating": "10",
      "text": "Do not pay any heed to poor analysis of the film from imbeciles such as michael **** Lungold. Its a top action film and will keep you entertained throughout!"
    },
    {
      "rating": "6",
      "text": "This felt very much like an average action/revenge thriller film - there is the woman with nothing to lose, fast paced scenes and some family scenes. The story isn't exactly fully built on, there are unanswered questions but its pretty clear its mainly meant to be a basic action film and nothing much else. Jennifer Garner doesn't do badly as the main character, Riley North but I can't say its not cliched. There is a fair amount of bloody violence, hence the rating (15 in the UK), so I wouldn't recommend it for young teens but otherwise its ok I suppose, though nothing nothing more than that. I don't think its a memorable film, so I wouldn't particularly recommend it generally either."
    },
    {
      "rating": "10",
      "text": "Way low score  kick ass movie. It's on showtime extreme, check it out yourself."
    },
    {
      "rating": "8",
      "text": "I really don’t get the negative reviews. I have it as a 7.5 but I’m going to round up because of my dislike of the negative reviews. Sure it’s has a lot of cliches and isn’t really a nuanced movie, but rarely is any other action/revenge flick. For what it is, it’s pretty cool (basically a female Punisher). In fact, this movie is better than the punisher movies (probably not the tv series). The action scenes although extreme are believable and tactical and Garner pulls it off, she’s pretty bad ass!"
    }
  ],
  "recommendations": [
    "taken",
    "the_mechanic",
    "nobody",
    "the_tax_collector",
    "mechanic_resurrection",
    "i_am_number_four",
    "four_brothers",
    "the_guardian",
    "salt",
    "parker",
    "jumper",
    "the_equalizer",
    "angel_has_fallen",
    "jolt",
    "mission_impossible_iii",
    "honest_thief",
    "death_wish",
    "escape_plan",
    "taken_2",
    "shooter",
    "contraband",
    "sabotage",
    "terminator_genisys",
    "hancock",
    "live_free_or_die_hard"
  ]
}