{
  "id": 1390,
  "title": "Percy Jackson: Sea of Monsters",
  "starring": [
    "Logan Lerman",
    "Brandon T. Jackson"
  ],
  "runtime": 106,
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "description": "In their quest to confront the ultimate evil, Percy and his friends battle swarms of mythical creatures to find the mythical Golden Fleece and to stop an ancient evil from rising.",
  "releaseYear": "2013",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tAu90qEpLqwqiZLsMqpaMVr55oN.jpg",
  "categories": {
    "plot": 6.042553191489362,
    "acting": 5.15625,
    "ending": 4.333333333333333,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 7.1875,
    "funny": 4.6,
    "action": 6.625
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Por lo que vi en los avances de cine, esta pelicula prometia mucho mas, la verdad se quedo muy corta en cuanto a historia parece un refrito mal hecho de los clasicos mitologicos como perseo y la medusa....espero que no sigan saliendo mas de estas peliculas de Percy Jackson"
    },
    {
      "rating": "0",
      "text": "Wow! It took only 20 minutes to get bored of this movie!\rWhat can I say, acting isn't well how should I put this.. Top of the line?\rAnd the action scenes just makes me laugh, they've been done so poorly. Well that applies to all the scenes, not just the action part."
    },
    {
      "rating": "3",
      "text": "This film feels extremely rushed. It feels like a bunch of terrible scenes put together. Also, the dialogue is terrible. It's really cheesy. I don't recommend this unless you are a huge Percy Jackson fan."
    },
    {
      "rating": "3",
      "text": "Es orrible oir a este estupido hablando de sus aventuras, sin embargo los mounstros, escenarios y efectos, rescatan el mal sentido del humor y malas y predecibles actuaciones"
    },
    {
      "rating": "1",
      "text": "This movie is about as terrible as the previous one. Awkward dialogue, hollow monologue, bad acting in general and it is simply dropping dookie on the books it is ''based off of''. The humor is not funny, I felt no compassion for the characters whatsoever and every problem's solving felt as scripted as humanly possible. DO NOT WATCH THIS MOVIE EVEN IF YOU WANT TO HUMOUR YOURSELF IN HOW BAD IT IS."
    },
    {
      "rating": "2",
      "text": "I didn't really have a major problem with its predecessor, it was just a fun, forgettable fantasy that is desperately trying to be the next Harry Potter but absolutely failed. As for \"Sea of Monsters\" it is completely bland, awfully dull with bad CGI and an unattractive plot and fantasy sequences, it is just trying to be the next Harry Potter and fails for sure."
    },
    {
      "rating": "2",
      "text": "Watch in amazement as the main characters hold swords but never actually use them against their foes. Be astonished by the surprisingly terrible story and get ready to be angry at possibly the worst ending to a movie I have ever seen!"
    },
    {
      "rating": "2",
      "text": "As an avid reader of the Percy Jackson books, my ten year old son had been looking forward to this installment in the film series for months. After finally getting to see it, he was unimpressed: \"It wasn't that good. Too many things from the books weren't the same and a lot of it wasn't even there  I was bored through half of it. Hopefully the next one is better.\""
    },
    {
      "rating": "0",
      "text": "why the hell did they want to make this movie,it is absolutely terrible with terrible things with terribles actuations,i hated it(and it was made by Chris Columbus wich made harry potter 1 and 2."
    },
    {
      "rating": "5",
      "text": "Sea of Monsters is both a step forward and a step backward for the franchise. For the film is well acted, well cast, and well directed. The first half of the film tries to be faithful to the book making the story flow, getting in necessary information, and making up for a lot of the errors made in the last film. All of these smart moves make it frustrating when we get to the second half. Luke is reduced to a pathetic and easily beaten villain, the prophecy is poorly explained and handled, the Sea of Monsters is overwhelming despite the build up and title, and the way the climax would be handled it makes you wonder if the filmmakers remember they still have three more books. Nonetheless, this is an improvement over The Lightning Theif giving us something that is more true to the spirit of the book than the predecessor. Don’t know if they’ll get a third film given the poor performance of this film critically and financially but if the franchise keeps improving we may soon get the Percy Jackson film fans want."
    },
    {
      "rating": "5",
      "text": "If you're a fan of the book series (like me) I would easily recommend it. If you haven't read the book, you might want to think twice before renting this. Otherwise it would just confuse you."
    },
    {
      "rating": "6",
      "text": "I never liked either movie from 'Percy Jackson' duology. If it was released 20 years ago it would be considered a good movie but now it is children movie like 'Narnia' series. I am not denying anything about graphics, it was good though but the movie has not pleased me hence I decided to put into an average or below list.\r There's noting much special about the movie to praise. As usual the young team of demigods who are select begin quest to save their kind from rise of an evil force. So the path they choose to accomplish the mission will get affected by the obstacles which they must face. With all these troubles, takes them to the grand ending where the final exciting visual fx feast comes in a quite nice show.\r Like the first one, I already forgot once I finished watching it. So won't remember much to tell about it, decided to conclude my review of it here itself, right now...! That's it then!!!"
    },
    {
      "rating": "6",
      "text": "This sequel felt like it was missing some of the magic (and star power) of the first film.  The adventure in the film’s story felt pretty sloppy and a lot of the special effects were either decent or just terrible.  Logan Lerman gave an extremely flat and lifeless performance and, while the film has some great and fun action sequences, “Sea of Monsters” ultimately felt like a Direct-to-DVD sequel rather than a film that made it to the theaters.  However, Nathan Fillion’s very short role really stole the film."
    },
    {
      "rating": "4",
      "text": "The only good thing about this film for me as a reader is i can't predict what will happen next, but the worst part as a reader is I expected that this film will more like the novel, because honestly the novel is so much better. At least just give a little bit effort to make it more like novel."
    },
    {
      "rating": "4",
      "text": "Huge step down from the first movie in the franchise. Some parts were funny but the movie doesn't make sense. Why would Poseidon ignore Percy but not Tyson, Percys brother who also happens to be a cyclops. Bringing in Tyson was a bad move as his role was just pointless really. This sequel is not good but also not bad. The fact that it's called \"Sea of Monsters\" and there's just one \"monster\" in the sea just shows how much this movie lacks."
    },
    {
      "rating": "0",
      "text": "i'm not waiting until the last Olympian to get it right i'm done with these movies i know book based movies are never as faithful to the source material because there movies you got to make changes but by god this is a new level of bad THE LAST AIRBENDER IS A MORE FAITHFUL ADAPTATION THEN THIS THAT\"S HOW BAD IT IS and as a stand alone movie it doesn't fair any better the whole \"you make your own path\" is a theme of the book but it's not shoved in your face like it is here the character acting is corny the plot is  it's better then the first movie but that is not saying much if there is a another movie i'm running to the theaters to see it i'm going to wait until i can see it for free online i'm not giving another dollar for this  the percy jackson series deserves better then this an i give a big middle finger to the end fight, want to know why? well read the book sea of monsters and then watch the movie and see why  YOU MOVIE!!"
    },
    {
      "rating": "5",
      "text": "i really enjoyed the first movie but what the hell happened? Annabeth was not herself(she was kick-ass in the first movie) and the whole air of the set has changed the first made it seen like you had gone back in time and i think this one mixed the two and i did not work they should have kept it like the first, my only enjoyment in this film was the new characters mainly Tyson and how he acts like a child and throws Percy and Annabeth and that gave both more depth as characters, if they had not changed Annabeth and the air of the movie then it would have turned out to be as good as the first."
    },
    {
      "rating": "3",
      "text": "I thought the book was alright. It wasn't amazing, but it was better than others. What could've gone wrong?\rHence, this list:\r-Story is changed so dramatically that you can't call it an adaptation\r-Many of my favourite characters and scenes are removed. I wanted to see Tantalus so bad.\r-The Polyphemus subplot is shortened from lasting the majority of the book to a 3 minute scene.\r-They screwed up the concept of the mist ENTIRELY and possibly messing up half the series as a result\r-The 'Golden Fleece' looks more like an old tea towel\r-The acting is slightly off\r-Annabeth is STILL a brunette for some reason\r-The Oracle changing '16' to '20' is a prime example as to why you don't cast adults as young teens\r-The ending:\rWhy did we really need a fight with Kronos? And why is he a giant figure rather than a spirit possessing Luke's body? And even then why is he such a pushover? He's the villain of the whole series for gods sake, he's a sodding TITAN. I really wish Percy and Tyson had waited another five seconds for their overly long reunion hug to remove the fleece so we wouldn't even have to endure the hacksaw being taken to the story.\r Then again, they probably weren't that confident they'd get Titan's Curse, so decided to wrap up the story but at the same time keep it going just in case. Which is slightly ironic because this massive change may be what pissed off fans, getting the film negative reviews such as this, and getting the third film cancelled.\r I can say this for most sequels: 'First one's better.'"
    },
    {
      "rating": "10",
      "text": "Recommed this movie, special effects are so good for me and actors are successful. Its really funny. I think it should be move on but Demigods didin't want this."
    },
    {
      "rating": "8",
      "text": "This sequel is just as good as the first one. The characters are great, story might feel familiar but new. And while I have never read the book, this remains one of my favourite book to film adaptation. I dont get why the series is cancelled. It left me with a cliffhanger."
    },
    {
      "rating": "1",
      "text": "this is by far the worst movie ever!!!!  they so messed up. they tried to squeeze the whole freaking series in one movie. the first one they somewhat kept to the book this one they didnt. it ruined it for me to see the next one thanks for ruining percy jackson"
    },
    {
      "rating": "6",
      "text": "Let's just say that watching this movie was fun. I mean, it's not bad either. It has some good effects here and there, but I have to admit that the plot isn't that good."
    },
    {
      "rating": "1",
      "text": "This movie was so dang bad.  Completely different from the books.  Easily in my top ten worst movies of I time.  I can't believe that 79 people gave it a positive review."
    },
    {
      "rating": "1",
      "text": "I personally don’t think it’s good. It’s a bad and inaccurate adaptation of the books, it doesn’t do them justice. It was changed so much that the plot didn’t even make sense anymore..."
    },
    {
      "rating": "3",
      "text": "Very much one for kids and hardly any sea monsters as lead to believe. If you have children then its ok, if your really looking for excitement for an adult pick another film."
    },
    {
      "rating": "1",
      "text": "Freudenthal’s Sea of Monsters is a step down for the Percy Jackson franchise in nearly every single way imaginable. The scale is smaller, the characters are less interesting, and the film makes poor use of its rich book and Greek mythology source materials. Young movie (and book series) fans will likely find enjoyment in watching their favorite heroes and actors back on the big screen for another Percy Jackson adventure but the movie provides next to nothing for anyone outside of that core demographic. As mentioned, the film spends a significant amount of time planting seeds for the next entry in the series, but it’s hard to imagine that many moviegoers will be as anxious for part three, The Titan’s Curse, after sitting through this Sea of Monsters."
    },
    {
      "rating": "8",
      "text": "Percy Jackson is unfairly compared to Harry Potter in both books and film.  Frankly, PJ is the better written of the two franchises.  Fewer plotholes and failures of story logic and more consistent characterization.\r That said, it DOES somehow feel a little \"short\".  It doesn't quite have the \"oomph\" to make it to the \"blockbuster\" category."
    },
    {
      "rating": "8",
      "text": "I really enjoy the Percy Jackson movies. It definitely makes me want to start reading the books. It may not have the most intricate story lines or best movie effects, but it is fun to see the different gods and creatures from Greek mythology living in our modern world. It is a really interesting and good adventure movie."
    },
    {
      "rating": "0",
      "text": "I fell asleep halfway through. The mix of modern and ancient settings just don't cut it. Its ridiculous to see high-tech machinery in an ancient setting. The boss is too weak! No excitement at all. First Persey Jackson was way better."
    },
    {
      "rating": "4",
      "text": "The thing with this one is that it missed a lot key points. Tyson doesn't appear like that. Why isn't Clarrise fat. Where the golden fleece is at, there in not part of the book was there an amusement park on the island. Where are the man eating goats. Where is the hamster woman. Chiron looks old while it only takes place one year later. Percy in the book is 13 while in the movie he is 16. I am very disappointed in the movie. I somewhat enjoyed  it though."
    },
    {
      "rating": "10",
      "text": "Haters gonna hate and the demigods (the percy jackson fans) and the normal people will like. I don't care about the critics because, the normal people will like so badly."
    },
    {
      "rating": "10",
      "text": "Sea of Monsters shows what potential the franchise should have should it continue. It clearly demonstrates how a book adaptation should be: making it its own thing, while staying loyal to the overall plot of the original story, and maintaining continuity with the original film. Although some direction was better in the first film, overall this film feels more satisfying as an adaptation and feels better as a solid movie overall.\r You do not have to see the first film in order to understand this one. Right from the opening scene, through a very clever back story prologue, and voice over from Percy, we get a sense of what is going on in this world and are fully immersed. Percy, played by Logan Lerman, delivers the narration as if he’s telling us a legend, and one cannot help but feel immersed in the goings on. The opening story is intense, but is not too dark compared to how other films such as The Chronicles of Narnia: Prince Caspian would have handled it. On that note, the whole film is very family friendly and plays as a light fantasy adventure, that nevertheless has its deep morals integrated in. Using the Prince Caspian example, this film does not go as dark or as intense as that film went, yet it also does not go the opposite way in making it campy. With that being said, there are some weaknesses in the direction of the film. While it does not go down the Batman & Robin campy road, the action of the film feels a little too tame at some parts. It’s still enjoyable, but unfortunately, it just doesn’t feel completely executed to the point that it should be. Its nowhere near bad, but it still could have been better. The action is still fun to watch, but it never gets bloody or as intense as it even was in the first film. It plays out as a fun, clean fantasy, that despite the lack of brutalness, it still feels like one could immerse into doing those things should they be real.\r With regards to continuity from the first film, you will see a much more expanded Camp Half Blood in the film, the home of the main characters, however unlike the Harry Potter films, it doesn’t feel or look as noticeably different. The film feels like a sequel and does make the references to the first film, but still feels like it can stand on its own. While fixing up some cut characters and elements from the first film, the film also introduces the goings on at a natural pace without trying to lamely cover things up and consider earlier introduced things as retcon, which is more than can be said about Harry Potter, which merely puts things in its films without (for the most part) making any sort of real continuity or grounded connection with the other films, choosing instead to make each film stand on its own. Sea of Monsters has both a sequel and stand alone feel to it, which is how films should be. Why should sequels ignore what was previously established in the earlier films? The Harry Potters changed pretty much everything to fit the needs of the story without for the most part thinking of new ways to handle the story elements, in trying to maintain the books justice. While on the note of Harry Potter, one simply cannot compare it to any of the Harry Potters. Yes, there are similarities, but, being the huge Potter fan that I am, I barely thought of Harry while watching this movie. There will always be similarities and comparisons, but is not every movie comparable to another? Even some that people would not even think were similar such as the Pirates of the Caribbean trilogy being comparable to the original Star Wars trilogy. And let us not forget the Avatar/Pocahontas/Dances with Wolves or the Iron Man/Dark Knight trilogies similarities. They will always exist, but there will always be one person who has NEVER seen the first film to have the idea, and even some who have seen both ideas and may like the newer one that has the old ideas better because of how it is executed. Its NOT what it is, but HOW it is.\r HOW the movie “fixes” the first film is in the following ways:\r -\tA much more grounded and more better polished script. The first film felt that the script was rushed in and was hopeful to be more than its script. The structure and plot was thin and weak, and didn’t feel as immersed as this film does. This film feels like they really revised and mapped out what they wanted from the script instead of just seemingly writing the script over night without revisions. You get the sense that the film makers are passionate to get the writing right and make it make sense and enjoyable for those that haven’t even seen the first film.\r-\tPercy’s friend Grover (played by Brandon T. Jackson), is not annoying in this film like he was in the first film. This time he is more mature, yet still retains his comic characteristics.\r-\tThe world is populated with many characters. Unlike the first, where there were merely just cameoized characters, and small things hidden in the real this one feels more like there actually is a hidden universe."
    },
    {
      "rating": "10",
      "text": "I have admit that the plot was great for a kid with greek mythology movie. Doesn't have hard explications, doesn't have anything that makes me sad or makes me hate the movie. I think that was made in the right point."
    },
    {
      "rating": "7",
      "text": "Seen in 2D. I actually enjoyed this a lot more than the reviews give it credit for. I thought that it was better than the first. Yeah, it wasn't nearly as good as the book was, that rarely ever happens, but I still had a great time with it. I must say that they shortened the part in the Sea of Monsters too much, taking out two great scenes from the book and adding a scene that wasn't as fun to replace them. Still, this was a good time, and was worth the money for me."
    },
    {
      "rating": "10",
      "text": "I can say that was a good job. I like the way that history was showed, i liked everything about, even with the Fall Out Boy's song that starts playing in the movie showing that the soundtrack was gorgeous. About the critics, I DON'T CARE, I LOVE IT."
    },
    {
      "rating": "7",
      "text": "This review was originally posted on www.Pixcelation.com by Andrew Korkmas.\r …Don’t give me that look. Let me begin by telling you a story: my cousin once came to visit me and his brother, back when we were in college for a weekend. Being freshman, we were risk takers and didn’t always have the best of judgment. So one night, while some of us were out partying, the rest of us decided to go to the local cinema. Several apparently wanted to see a movie called “Percy Jackson & the Olympians: The Lightning Thief.” Many of us had never heard of said movie but we didn’t really have any other plans so off to the theaters it was in the world’s most uncomfortable car ride ever (only one of us had a car. It was a small sports car. There were six of us.) While the movie was nothing exceptional in the slightest, the majority of us did enjoy it. Well, said cousin came to visit me this weekend and when the two of us decided to see a movie, we noticed that the premiere of “Percy Jackson: Sea of Monsters” was tonight and decided to give it a shot. Now, let the record show, I went in with zero hopes and expectations for the movie, and in that way, the new Percy Jackson didn’t disappoint.\r The story follows the events of Percy Jackson, son of Poseidon. This time around, he and his team of half-bloods (sons and daughters of the different Gods of Greek mythology) must uncover the Golden Fleece in order to thwart the sinister attempt of Luke, the half-blood son of Hermes, from reviving the titan Kronos which would lead to the death of the Gods and the rest of world. The plot itself is nothing spectacular. My cousin and I joked that for the first one, we both had the entire plot predicted within the first forty-five minutes. That being said, if you are a fan of Greek mythology (which means you’re part of the target audience) then it’s easy to predict because you know the mythos. What’s more, you shouldn’t really care because you’ll be enjoying catching all the references.\r The acting….well, it’s also exactly what you’d expect. Most of the actors try but none seem to give a memorable performance in the slightest. Logan Lerman (Percy Jackson) and Jake Abel (Luke) in particular seem to give a rather exhausted effort. It’s as if they’re both chronic insomniacs who don’t seem to have much energy to give in their scenes.\r The special effects are pretty good. Most of the creatures look nice and while I didn’t see it in 3D, I could see it being the kind of movie that works well in the extra dimension.\r The directing is a surprise in that it’s actually fairly good. Not award-winning material mind you but it’s still nice and at times clever. Oddly enough, it might be one of the movie’s better qualities. Thus, this aids the action set-pieces which are also not half-bad either, which in turn is aided by the good CG.\r One thing that was of minor annoyance was the ending. I won’t spoil it but I will say that it leaves something major unanswered in an obvious attempt at another sequel.\r “Percy Jackson: Sea of Monsters” is by no means a terrific flick, but I wouldn’t’ say it’s a bad one either. It’s one of those movies where most everything is good enough to the point where they all work together to make for an entertaining experience, even if it’s nothing substantial under further analysis. Sure more time could been spent developing the characters, yeah the plot could been expounded upon, but the movie never set out to be like that, and not every movie deserves to be the next Oscar nominee or cult classic. Some movies are just meant to be enjoyed and ultimately, that’s the kind of feeling I got from it. If you liked the first one then you’ll probably like this one, and if it doesn’t sound like your thing, then don’t bother.\r “Percy Jackson: Sea of Monsters” gets a 7/10"
    },
    {
      "rating": "10",
      "text": "un peliculón para disfrutar.. los actores representan bien todo,, a pesar de algunos cambios con respecto al libro,, se puede apreciar toda la atmósfera que se tiene que tener... yo la vería mas de una vez mas si te gustan las pelis de fantasía acción."
    },
    {
      "rating": "8",
      "text": "Still feeling very much like a greek-mythology Harry Potter, \"Sea of Monsters\" is a very fun movie. It doesn't pack the intelligence or maturity of the series it so closely resembles, and the special effects here are disappointing and dated, but overall it is a lot of fun. The plot is nice, the characters likable, and the action and humor entertaining. Overall if you enjoyed the first movie or the book series then I see no reason why you should not like this movie. For those of you who have never experienced \"Percy Jackson,\" just think of it as a not as well written, but still very fun, Harry Potter inspired series."
    },
    {
      "rating": "3",
      "text": "Not only was not a big fan of \"The Lightening Thief\", but I definitely hated this movie. It has cheesy effects, it's too childish, the acting is only good for the crappy material it's been given and it just shows that the books are way better than these past two flops. Overall, go watch Elysium or something else! Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "7",
      "text": "\"Percy Jackson: Sea of Monsters\" may feel awfully deprived at times, but despite this, the action and characters are definitely enjoyable to watch. Being a avid reader and interested in the books, the film was definitely suited for me (as were the Harry Potter film franchise). Despite finding numerous tweaks from the books, I really enjoyed the characters and the action packed sequences. With the CG sequences being very well done, and characters being being put into some depth (especially towards Percy and Annabeth's characters), \"Percy Jackson: Sea of Monsters\" is an entertaining flick."
    },
    {
      "rating": "6",
      "text": "It's a ok movie, but it feels like it is missing some things. The plot was predictable, and the villain was boring and gets on your nerves. Percy also looks like he's 12. But at least it was interesting?!"
    },
    {
      "rating": "9",
      "text": "This movie isn't so faithful to book because of the 1st movie  The Lightning Thief. I guess it would be good  But OK, by itself the movie is good and i think the director made the POSSIBLE to make us proud  There are defects as at lot of movies"
    },
    {
      "rating": "5",
      "text": "Percy Jackson and the Sea of Monsters is the sequel to the original movie \"Lightning Thief,\" and just as lame. With a different director than the previous film, Sea of Monsters follows the series written by Rick Riordan. By comparison, I read the first book and the matching movie satisfied me, answering questions I had about the novel, on screen. As for this film, I felt that the combination of bad acting, and false drama, really just ruined my experience watching Sea of Monsters.\r As Percy (Logan Lerman) learns he has a Cyclops brother (Douglas Smith), he is forced to put up with him as they travel to Florida to find his friend Grover (Brandon Jackson). Captured by the half-blood Luke (Jake Abel), who has plans to betray his father and bring back Kronos using the Golden Fleece. It is up to Percy and the gang to save their friend, and the whole Camp Half-Blood.\r I went in to Sea of Monsters not really sure what to expect. The trailers couldn't seem to interest me and I did not hear much in the media about it. I wasn't sure whether I was more interested in the movie, or the guy smoking an e-cigarette in the row in front of me. Between the phoned-in, bad acting, and false sense of urgency in the film, I was definitely not a fan. I could tell the story line was meant to be scary and keeping you on the edge of your seat, but it really did not have that effect on the crowd.\r The movie was overly predictable and overall I was just very unimpressed. Also, I could tell that Sea of Monsters was really trying to make an action fantasy (much like Harry Potter) for kids, and just flat out failed. I noticed that Percy never actually used his Riptide sword on humans in the movie. When he would fight, he would hit the person with the butt of the sword so they could keep the film “PG”. I never knew that slashing a human was way too inappropriate for a child! The false sense of danger never worked for me as no one was ever really in danger.\r Overall I was just as bored with Sea of Monsters as the actors, and felt like it wasn't worth my 110 minutes. Wait for it to air on ABC or HBO and watch it then. As the first movie aired like every other week when it was released, you will have no problem catching it. Following the series, when the next movie is made, I really hope they again change directors, and produce a film worth seeing. Read the books and see the movie in your head as imagined by the writer, and you will have a much better experience."
    },
    {
      "rating": "7",
      "text": "Percy Jackson: Sea of Monsters surpassed my expectations. Quite often in a film series the film creators will test the boundaries in the second film and I think because the movie didn't seem to test the boundaries it kept true to the book and as a result was just as good as the first movie.\r This film is truer to the book series than the first film was, this is perhaps why many critics are giving it such a hard time having little to no knowledge of the source material and once again judging this as they would judge any random movie. I think perhaps adaptions should get a few bonus points or something when they stick closer to the source, the movie is aimed at fans and kids mainly I'm sure that if they were aiming at a wide audience they would have added a few random explosion scene which would have pleased the more ignorant critics.\r Although the movie was truer to the books it did cut out a few of the more interesting pieces out, I was dismayed to find that they cut Tantalus and the chariot races from the movie as well as the sirens scene which I believe would have both added a lot to the movie.\r Although the movie sticks closer to the books I felt that the transition from the first movie which was less true to the books caused some of the character development to be flawed. In the first film there was a stronger relationship between Percy Jackson and Annabeth Chase however in this film it was explored to a lesser extent as a result of sticking closer to the books.\r The acting just like the first movie was fantastic, the actors do a righteous portrayal of the characters especially that of the main characters. Surprisingly the minor characters are portrayed very well, far better than in the first movie and it makes the movie more engaging as a result. There was a nice addition in one particular scene with Nathan Fillion the renowned star of the cancelled television show Firefly who makes a reference to said show which really resonated with me a fan of that show.\r Just like the first movie the fusion of ancient and modern elements added a sense of fun and adventure which was exacerbated by the journey to the sea of monsters fueling the excitement especially in younger audiences and those like myself who are young at heart. The addition of the Percy Jackson style of humour throughout the movie was alluring especially to fans of the books who were worried that the adaption would get rid of it completely.\r Some have said that the CGI was poor, however I didn't once see any kind of slip up in the quality and there were no fatal missing pieces of scenery as I have sometimes seen in movies with higher budgets than this had. Much of the movie relies on CGI, the final battle scene especially and it is done flawlessly.\r All in all Percy Jackson: Sea of Monsters was just as good as the first movie and is especially aimed at the fans of the previous movie and book series. If you are a fan you must watch it, if you are of a younger audience or young at heart it certainly should be on your to do list. Quite a lot of the movie is setting the stage for the next movie which seems may be even better"
    },
    {
      "rating": "10",
      "text": "I really like the percy Jackson series so far. I do have to say it could use more thrill and on edge factors. It is easy to predict what is going to happen next. I would really like to see what the next one will bring."
    },
    {
      "rating": "7",
      "text": "This sequel actually improved on the first one in basically every way. The acting was better, the special effects were better, the story was a little more interesting and the movie was more entertaining than the first. The only thing that I felt was worst than in the first, was the characters.The new characters were pretty annoying and unnecessary. Overall, it felt like a more professional movie than the first opus."
    },
    {
      "rating": "8",
      "text": "Come on guys, this corrects almost ALL the mistakes made by the first one. It's closer to the story of the book, Kronos was awesome and the story was pretty good. Probably my second favourite movie of 2013 after Monsters University. If you like the books, watch this one."
    },
    {
      "rating": "10",
      "text": "I can easily give a 10 beacuse it's BETTER than the first in so many ways that i can't explain in 5000 characters. It's very nice, fun. It's a good movie for the summer."
    },
    {
      "rating": "7",
      "text": "Good cinematography. Action is alright. The fights are good but not great. Plot is meh. Pretty predictable. The acting is bleh. Mainly whether or not you'll like it will depend on your thoughts on the first one. I liked the first but I didn't think it was spectacular, and my feelings are similar for this one, so I'd suspect if you did like it you too would like this one. Granted, if you didn't like the first I see no reason why this one would be your pick."
    },
    {
      "rating": "8",
      "text": "Still A Harry Potter Ripoff in Many Ways It's Still A Decent Film For Kids, Teens, Adults And More, The Effects Were Amazing, The Characters Are OK, The Story Is Pretty Good"
    }
  ],
  "recommendations": [
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "the_chronicles_of_narnia_prince_caspian",
    "the_hobbit_the_desolation_of_smaug",
    "maze_runner_the_scorch_trials",
    "the_mortal_instruments_city_of_bones",
    "batman_v_superman_dawn_of_justice",
    "the_maze_runner",
    "the_twilight_saga_breaking_dawn_part_2",
    "terminator_genisys",
    "dreamcatcher",
    "vampire_academy",
    "inferno",
    "the_golden_compass",
    "the_last_witch_hunter",
    "the_twilight_saga_eclipse",
    "the_twilight_saga_new_moon",
    "artemis_fowl",
    "green_lantern",
    "it_chapter_two",
    "pirates_of_the_caribbean_on_stranger_tides",
    "city_of_ember",
    "i_am_number_four",
    "i_am_legend",
    "the_hobbit_an_unexpected_journey",
    "eragon"
  ]
}