{
  "id": 4331,
  "title": "Perfect Sisters",
  "starring": [
    "Abigail Breslin",
    "Georgie Henley"
  ],
  "runtime": 100,
  "genre": [
    "Thriller",
    "Drama",
    "Crime"
  ],
  "description": "Tired of their mother's alcoholism and a string of her abusive boyfriends, two sisters plot to kill her.",
  "releaseYear": "2014",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/c7JoUa6DDoHkR5ubRdCgnpwGUE5.jpg",
  "categories": {
    "plot": 6.555555555555555,
    "acting": 6.333333333333333,
    "ending": 5.0,
    "soundtrack": 6.0,
    "cinematography": 4.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I think the movie was a good mixture from Andersen sisters' thinking point-of-view.....the real, although the acting cast mishap was casting of Abigail Breslin, but still Georgie Henley carried the film quite neatly considering the fact that its her first movie after Narnia triology....."
    },
    {
      "rating": "10",
      "text": "The best movie I have even seen in my entire life! I got really into it and the story line and plot was really good, I would personally pay again and again to watch this movie and it deserves 1,000,000 oscars!"
    },
    {
      "rating": "2",
      "text": "So something possessed me to watch the movie, \"Perfect Sisters\", a \"teen crime drama\" about two teenage sisters who kill their drunkard of a mom in some half-assed teen angst story...\r Oh how do I describe this **** fest...\r For starters, this movie may as well be called \"Look At My **** as Abigail Breslin apparently feels utterly compelled to fall out of her shirt in EVERY SCENE. The camera work and directing are seemingly entirely focused on Breslin's boobs for the entire film... It's almost as if there was a special clause in her contract requiring her to point her breasts straight into the lens at all times.\r Aside from the ridiculous amount of teenage juggs in this movie, it is riddled with poor acting, even poorer plot developments, and some of the most illogical nonsense I have ever seen. Worst of all is the fact that this is based on a true story!\r And to top off this preposterous \"teen comedy, drama, thriller\", the detective WEARS A F***ING EYE PATCH!!! No explanation just an eye patch!!\r In all I feel as though the film's producers owe me the 100 minutes they stole from me..."
    },
    {
      "rating": "7",
      "text": "Perfect sisters' perfect evildoing.\r The Canadian version of 'Heavenly Creatures'. The director admits he inspired by the Peter Jackson's movie. But you must know that this film was also based on the real sisters who were fed up with their irresponsible and alcoholic mother and her abusive boyfriend. So they plot to set free themselves from the messed up life as they think they deserve better.\r It was supposed to be a television movie, but later it saw a limited theatrical release and a mixed response from all quarters. I liked the film, for its strong content, but the weakness lies in the first half. The beginning was a very poor quality of presentation, the next half was the reason I favoured it where it erupts while the narration nearing the conclusion.\r Since no one knows the details about the real sisters, the characters were altered in the movie as the cast desired to attack few things to complete it. Both, Abigail Breslin and Georgie Henley were not bad, but it's hard to believe these child actors are all grown up. In a few years, they will be in the lead! Anyway, this film is worth a watch, especially true stories like this fascinates me. We could learn about our world and its society, what other people went through in their lives and the reason behind those stuffs.\r 7/10"
    },
    {
      "rating": "5",
      "text": "Georgie Henley and Abigail Breslin are terrific in this film, let's start there. Henley catches the unsettling schizophrenic attributes of her character, smiling and laughing bizarrely, utterly out of sync with the awful crime they're planning, and then commit. Breslin is just as compelling, her character stricken into near catatonia by what they've done, suddenly thrown into a wrenching and terrible grief. The supporting roles are credible and well-acted, but the film founders on an element that I'm not sure has ever been, or can ever be, captured on film. That is the effect that alcoholism and incorrigible drunkenness can cause on the victims of the alcoholic - the indescribable outrage, made a hundred times worse by the impossibility of fighting it. While Mira Sorvino's character seems 'out of it' and depraved, that doesn't begin to convey the destructiveness of alcoholism, or the dreadful toll it takes.\rThe film itself is borderline dogme, perhaps intentionally, but it's not consistent through the film. Some scenes are beautiful and lyric, others look like a high-school production by students without the faintest idea how to shoot a scene.  A flawed effort, but again, I can't say enough about Henley and Breslin - they make the film."
    },
    {
      "rating": "6",
      "text": "While the real story is very interesting, the movie wasn't. The acting was below average, even for a low budget movie, the direction and cinematography was very amateurish and the soundtrack felt very forced. Although the movie was entertaining, you'd be better off reading about the real story, rather than watching this movie."
    }
  ],
  "recommendations": [
    "fifty_shades_darker",
    "the_curious_case_of_benjamin_button",
    "eastern_promises",
    "gone_girl",
    "brimstone",
    "what_happened_to_monday",
    "the_counselor",
    "boyhood",
    "a_wrinkle_in_time",
    "there_will_be_blood",
    "a_history_of_violence",
    "the_mountain_between_us",
    "the_girl_next_door",
    "red_sparrow",
    "code_8",
    "the_fault_in_our_stars",
    "the_departed",
    "the_gambler",
    "the_loft",
    "the_power_of_the_dog",
    "the_snowman",
    "pompeii",
    "contagion",
    "alice_through_the_looking_glass",
    "the_twilight_saga_breaking_dawn_part_1"
  ]
}