{
  "id": 1353,
  "title": "Perfume: The Story of a Murderer",
  "starring": [
    "Ben Whishaw",
    "Alan Rickman"
  ],
  "runtime": 147,
  "genre": [
    "Crime",
    "Fantasy",
    "Drama"
  ],
  "description": "Jean-Baptiste Grenouille, born in the stench of 18th century Paris, develops a superior olfactory sense, which he uses to create the world's finest perfumes. However, his work takes a dark turn as he tries to preserve scents in the search for the ultimate perfume.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2wrFrUej8ri5EpjgIkjKTAnr686.jpg",
  "categories": {
    "plot": 5.363636363636363,
    "acting": 5.631578947368421,
    "ending": 6.882352941176471,
    "soundtrack": 8.25,
    "cinematography": 8.75,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "One of the best films ever made. Great direction and cinemathography, magnificent decors, great performances, great music, ... Tom Tykwer did what Stanley Kubrick found impossible: he adapted Suskind's wonderful novel to a fantastic movie. An outstanding masterpiece."
    },
    {
      "rating": "9",
      "text": "this movie makes me feel that life is an art! any smell, color  sound is perfect  a visual beauty highlighting the most beautiful colors and places. on the other hand shows a macabre and brutal reality of this times! Perfume is a Great an powerful Masterpiece full of love  passion  art  music  colors and murder."
    },
    {
      "rating": "8",
      "text": "First I'd like to say that Nanifaye P. is an idiot and only an idiot would rationalize this movie by comparing it to Iraq and insulting the hard work and sacrifices of our soldiers and our country. It's unfortunate that my review will likely be edited before posting (if posted at all) since it's not PC at the moment to insult other reviewers, but sadly on the other hand, it is quite fashionable to trash anything and everyone that has anything to do with Iraq without a shred of logic to one's insane accusations. On a separate note, the movie was great with a very original storyline coupled with excellent acting and directing. Oh and to answer your question Nanifaye P., what's horrific is that you seem to believe every last bit of nonsense you hear and have the gusto to regurgitate it in something as apolitical as a movie review about perfume. Quite frankly, I'm not quite sure who's sicker, the main character of the movie, or you."
    },
    {
      "rating": "10",
      "text": "I have read the book, of course, years before I watched the movie. Patrick Suskind's masterpiece can't compete with this movie. Yet, the movie is a masterpiece itself, it is not the faithful image of the book, it is different, it has its own value. The performances were excellent, Great direction too! And the visuals....WOW!....the photography left me speechless! It is one of my favourite movies ever!...my favourite part? THE ENDING! IT IS JUST SPECTACULARLY FLAWLESS Do not miss it! WATCH this film for it is a hidden diamond!"
    },
    {
      "rating": "10",
      "text": "Perfume is a seriously awesome experience. The characters, the story, the acting, the music, everything is nearly perfect. The surprise ending was really mind-blowing."
    },
    {
      "rating": "10",
      "text": "Suskind's masterpiece cannot compete with the movie, but the film itself is a beautiful piece of art. The photography is absolutely flawless, the music left me breathless and I was absolutely captivated by the story of the monstrous Parisian murderer. I absolutely recommend reading Suskind's book first and then watching the movie witch will give you an absolute exquisite aftertaste."
    },
    {
      "rating": "0",
      "text": "I apologize if I seem blunt, but am I missing something here? This is one of those movies that gives the viewer an impression that: A) it was made specifically for a good trailer, and B) it was made under the supposition that the viewers are stupid. Dustin Hoffman (who is otherwise brilliant) gives the worst performance of his career. The movie is set in France, but everyone has British accents, aside from the main character (who speaks some strange brew of Cockney) and Hoffman (who speaks some strange brew of Yiddish/Brooklyn). I'm wondering if they should have just cut to the chase and given us 147 minutes of extreme closeups of the main character--because there is nothing more to this film. The people in the audience were yelling out loud at the stupidity of this film, and as I exited, I overheard someone say, \"walk of shame. . .\"."
    },
    {
      "rating": "5",
      "text": "The movie, of course, is a romanticized version, and even a little imaginative from the book, which is gross, greedy, nasty and wonderful. The most demanding, observing every detail of the adjustments, you might not like this. I loved it. Even after the book that blew me away, I could watch this movie and find extremely beautiful. With a gripping story, takes you on a visual journey to there and gives us a rich history of this man, Grenouille. Ben Whishaw **** perfect on paper. The scene of the \"execution\" it is one of the craziest I've ever seen. Hard to take your eyes off the television."
    },
    {
      "rating": "4",
      "text": "I didnt like this movie at all. It's really sadist and incredibly annoying to watch. I watched it a month ago and I still can't believe what I've seen. The actors are amazing and the pressure that makes me feel its weird but I dont know, I just dont feel good about it."
    },
    {
      "rating": "3",
      "text": "One of the more disturbing, creepy movies I've ever seen, and I don't mean that in a good way. The plot point on which everything turns is so repulsive, offensive to women and humanity in general, as to be without redemption. The San Francisco newspaper sums it up nicely--this film is nothing it aspires to be, and utterly revolting in its attempts."
    },
    {
      "rating": "3",
      "text": "Roger Ebert is plain senile. The movie is so bad."
    },
    {
      "rating": "1",
      "text": "Perfume is so awful I'm actually compelled to write about how terrible this movie is 2 weeks after seeing it. First off, whereas Tom Tykwer had a few strong strokes of originality in Run Lola Run, he proves in this film that he is without a doubt a masterful hack. The entire adpatation is sophmoric, employing an idiotic narrator voiceover that redefines the definition of cliche. In fact there are so many problems in this movie such as hystrionic acting, horrible dialects, and a narrative structure so misguided, you sit in the audience and after an hour wonder if this is all a big joke. And whereas you typically don't isolate one person as having the responsibilty for a movie going sour - in this particualr film, there is no other individual responsible for this movie tanking than Tom Tykwer. With material that requires clever dramatic and visual structure, and a unique sense of style, all we get is cliche, bread-and-butter drab, Tom, I gotta hand it to you, your directing is so awful in this, so stuffy, self-serious, and suffering from delusional egomania, that you've made \"American Pie\" look like \"The Godfather\" in comparison. I know this sounds harsh, but at least \"American Pie\" knew its place as a movie. In keeping with your tradition of cliches, all I have to say is \"Your film stinks.\""
    },
    {
      "rating": "8",
      "text": "The person behind the direction of this film was clearly exaggerating from start to finish and savored every last annoying sniff. The story was actually quite engaging, and while it may have been a vacuous experience it was quite hard to look away indeed. No one can deny that the film was well shot."
    },
    {
      "rating": "8",
      "text": "The absurd ending stops the film from being a classic. The rest of the film is excellent; a very good script, excellent acting, and brilliant direction. Now if they only changed the final 15 minutes..."
    },
    {
      "rating": "0",
      "text": "One of the dumbest movies I have ever seen that tries to be so much more. I must admit that the first hour or so is good, at best, but the ending was so completely absurd and ridiculous I had a hard time just trying to get through it. Its disappointing, as I was told this was a relatively good movie... but it was garbage. Absolute garbage."
    },
    {
      "rating": "4",
      "text": "For not the last fifteen or so minutes, this would have been a film to remember for the right reasons. But I cannot recall another film that was trotting along so well only to commit inexplicable narrative suicide with an ending that defies reason and sanity. So ridiculous is the conclusion that it can't even serve as object lesson for young directors and writers on how not to end a story. Such a shame for there is a lot here to admire."
    },
    {
      "rating": "7",
      "text": "really really good. i liked it alot but was totally thrown off by the ending. i think if the ending was done a little better, i would have given it a 9 or 10, but it was too laughable. still worth it, one of the best horror/thriller movies of recent years."
    },
    {
      "rating": "9",
      "text": "I"
    },
    {
      "rating": "10",
      "text": "Stunning. Ignore the ignorant criticisms....a faithful adaptation of the masterpiece book. It's very much a satire about greed and desire, rather than the mysoginism that some have incorrectly suggested."
    },
    {
      "rating": "8",
      "text": "Great, creative and tasty movie. I recommend to be watched clearly with deep imaginary."
    },
    {
      "rating": "7",
      "text": "Very well made. If one's read the book it is hard to imagine a good film rendition of the wonderful details on smells and smelling that Suskind conveys. Nevertheless, filmmaker and actors have done a good job at portraying the essence of the story."
    },
    {
      "rating": "10",
      "text": "Great movie ! Visually brilliant with good actors and a well done job by Tom Tykwer ! One of the best movies in this year ! Enjoy it !"
    },
    {
      "rating": "8",
      "text": "I thought it was visually mesmorizing, and transported the viewer into the world of a seemy and \"smelly\" world of a long ago France. I felt the main character was portrayed adeptly as this sadly inept and tortured soul, without any real sense of the world or what it was to be alive. He survived through scent and it ironically lead to his demise. [**SPOILER**] The only out of place and seemingly ridiculous scene was the orgy that made a 10 an 8."
    },
    {
      "rating": "7",
      "text": "Near-brilliant. A much finer adaptation of the book than I had ever expected. If the investigation sequence toward the end had been trimmed down (I think that part is ten pages in the book) and had Dustin Hoffman picked an accent and stuck with it, it might have been my favorite movie of the year. Not that there aren't other problems, but the film carries a sense of LIFE about it that no other film this year quite has. It's a fantasy that's real. I suspect that he and the other stars were cast because Tykwer liked their noses, but Whishaw is perfect as Grenouille -- he's supposed to be totally empty, a non-entity, someone who would never be noticed on the street, and he does all these things while still managing to hold the attention of the viewer. I suspect that in order to really get this film, one must have felt as though he or she was invisible at some point: Grenouille is an invisible man who manages to force himself to be noticed. And the conclusion is great; very appropriate. It may take some thinking to come to this conclusion, but at the end Grenouille, for a few shining minutes, Grenouille is a power for (almost) good."
    },
    {
      "rating": "2",
      "text": "A really bad movie with awful plot and terrible acting! The only reason I give 2 is the young actress who played not bad at all!"
    },
    {
      "rating": "5",
      "text": "I want to just mention one thing some here don't understand: they couldn't change the ending because it's part of the book! So that would have been a crime. I like the book much better though. They had nice pictures and kept close to the storyline. I like most of Tykwer's work (Heaven, Run Lola Run, The Warrior and The Empress) so I thought everything would be fine. But it turned out to be an enjoyable (a bit long) evening. But nothing more. So it disappointed me. And therefore my low points. It was a big thing here in Germany, so they should at least put some more German or at least French actors in it."
    },
    {
      "rating": "8",
      "text": "I think Roger Ebert has the right idea about this film. It is haunting. Grenouille is seeking to immortalize the essence of a woman through their scent. As such, his quest is almost more important than the females he must snuff to reach his goal. We almost admire the final scene in which he may now die because he has driven everyone into a sense of euphoria. I suppose this is where the tale bridges from somewhat real into the stuff of urban legends. However weird the ending, his quest is both evil and purely idealistic. His victims are captured forever in his tiny bottle."
    },
    {
      "rating": "9",
      "text": "First \"different\" film I've seen in years. Refreshingly off beat, Beautifully filmed."
    },
    {
      "rating": "10",
      "text": "Fascinating movie both on the dramatic and technical levels."
    },
    {
      "rating": "2",
      "text": "I have nothing positive to say about this movie. The acting is terrible, the plot is nonsensical, and the subject matter is creepy."
    },
    {
      "rating": "1",
      "text": "This movie, to put it mildly, and I apologize if anyone else has made this joke because I can't be bothered to read all the posts, STINKS!"
    },
    {
      "rating": "9",
      "text": "Truly disturbing in a dark way--like road kill, can't take your eyes off the movie. Beautifully shot, and the story has you screaming in parts. What is most frightening is that the main character is devoid of any feeling--he looks at humans as experiments to feed his obsession. It's one of those movies that has you thinking about it for a few days."
    },
    {
      "rating": "3",
      "text": "It is clear that the director of this movie had a fair-sized budget to work with. It is too bad that it is one of the dumbest stories I have ever wasted two hours on. Save your money; do not rent this movie!"
    },
    {
      "rating": "9",
      "text": "I just saw this movie on DVD and It was excellent. I get bored of movies easily because so many are formulaic and predictable. This movie was not. It does demand from the viewer an open mind and a capacious imagination in order to understand and appreciate the movies' trajectory. The ending was brilliant. It required a particularly imaginative understanding of what the power of scent is capable of doing, but it is this that made the bacchanalian love fest credible and the quest transcendent. A unique film that you will either love or hate."
    },
    {
      "rating": "10",
      "text": "First read the book, then watch the movie. You'll realize how difficult is to make a movie out of this ineffable story. I highly recommend both the book and the movie."
    },
    {
      "rating": "10",
      "text": "Easily in the top five best movies I've seen, and probably my new favorite movie. Extremely dark, creative, and captivating."
    },
    {
      "rating": "10",
      "text": "Visually gorgeous, brilliant direction."
    },
    {
      "rating": "5",
      "text": "There is continual note of the difficulty of turning Suskind's book into a film; however this was the task undertaken, and as such the film has to be considered as a singular work, lest we should never review anything negatively because we sympathise with the toils and troubles of production/finance/plot etc. The film, simply, looked pretty good and was acted fairly well. However these achievements are routinely reached with a little bit of cash. Aside from that it failed to suspend disbelief, failed to build an attachment with the audience to any one of its characters, and three quarts of the way through descended into utter ridiculousness and never looked back. The pitiful ending was to be expected; nothing could save it after it had fallen so spectacularly. There are a thousand films which manage to combine excellent cinematography, acting and production with an engaging and interesting plot, and those films should be seen before bothering with this one."
    },
    {
      "rating": "8",
      "text": "Unique. Great style. Would have liked to see the character's remorse with each killing, but unable to stop himself because of his \"artistic\" vision (or scent). Too much of an idiot savant, and not enough of a complicated human being."
    },
    {
      "rating": "8",
      "text": "Ben Whishaw plays the main character Jean-Baptiste with such amazing realism that I was truly captivated with his story. The story was an amusing one from start to finish. It did fail to provide me the ending I felt it deserved. I did feel good enough about it to recommend it to my friends. I do feel that Ben Whishaw could one day be nominated for an Oscar if he keeps aligning himself in the right rolls."
    },
    {
      "rating": "8",
      "text": "First really original plot I have seen in a long time. The trailers made it look like a horror/thriller movie, but I thought it was neither. It was a beautiful portrait of a lost human. He was trying to bottle love, because he had none in himself. Sometimes hated like a devil, sometimes worshiped as a god, but empty inside. It was not offensive to my eyes or my tastes, because the murders were done in such a way that the imagery was beautiful, not horrific. There was nothing frightening or scary about his actions, because they were done for what he saw as a higher cause. I mean, come on, we kill innocent people in Iraq so we can have their oil - tell me if that's not horrific."
    },
    {
      "rating": "8",
      "text": "I thought the movie was really good! I can't believe some people are giving this 2s or 3s. It got a little boring in a couple parts, but as a whole, the film was very interesting and kept you watching. Yes, the subject matter is a little disturbing, and the ending a little crazy, but just look at it like a fictional story, and not something thats supposed to be perfectly realistic."
    },
    {
      "rating": "0",
      "text": "Absolutely delighted to see this panned by so many reputable publications like the NY Times; a review I agree with 100%. This film is absolutely ABHORRENT. It is a completely vacuous, yet insidious story which sees a man GLORIFIED for his destruction of women. It is misogynistic in the extreme. I was actually so revolted I can scarcely express it to you. It may be well shot, but that just emphasises how pretentious and self-satisfied it is. Avoid this filth."
    },
    {
      "rating": "3",
      "text": "This misogynistic, repulsive film is Euro-trash masquerading as art with a little \"magic realism\" thrown in to impress the pseudo-intellectuals. Yes, I'm talking about you, Mr. Ebert."
    },
    {
      "rating": "9",
      "text": "Perfume is a visually lavish dark fairy tale about an obsessive man seeking beauty and recognition in a morally void society.  The protagonist is born with a super-human sense of smell, a will to live, and nothing more.  Born and bred in a world where life is treated as a distant and vulgar second to money, we see the development of a man who relates to beauty only as possession, one more smell to be collected and preserved.  Finding the women who possess these scents to be obstacles to his obsession, he murders them, destroying them in the process of creating the most powerfully exquisite scent the world has ever known.  It is not until the end of the film when he finally glimpses the dimension of beauty that issues from contact, from sharing--in a word, love--that he is able to feel any form of remorse.  Until then his quest to objectify and possess beauty and to force upon the world the value of his existence is mirrored by the society around him, from the brutal exploitation of the Parisian slums to the trophies and conceits of the nobility.  Perfume is a sensual marvel of a movie that explores morality and the profane in a lyrical way."
    },
    {
      "rating": "6",
      "text": "It is a disturbing movie! The book is a page turning and the adapatation is appropriate. The main actor '' grenouille '' came from nowhere and gave us a great performance."
    },
    {
      "rating": "8",
      "text": "Really good movie, good acting, cinematography and an interesting story. I haven't read the book so can't compare, but the movie itself was really good."
    },
    {
      "rating": "8",
      "text": "Just mind-blowing! Although there are some professional points to be made here and there (as one can read on the critic reviews), the movie shines because it makes unexpectedly deep (mind-blowing) connections. It talks about ideals (the man's search for absolute in his art, and the inevitable sacrifices). For that alone it stands as a great movie! (even more of an achievement when you think about the endless amount of mainstream mediocre holywood junk that's being produced out there)."
    },
    {
      "rating": "10",
      "text": "I am not one to write reviews of anything, but reading the negative reviews on this site has prompted be to write something. This film is beautiful, I think the people leaving these absurd reviews have completely missed the entire point of the film. The film so perfectly encapsulates the desires of young men, in an intriguing and absolutely surreal way. The ending is not absurd at all, it is a metaphor to make one question their own desires. My favorite aspect of this film by far is the music, the music during the most poignant scenes is simply art."
    },
    {
      "rating": "4",
      "text": "This film portrays the life of Jean-Baptiste Grenouille, a French perfumer whose genius turns into madness. Directed by Tom Tykwer, who also collaborated on the screenplay alongside Andrew Birkin and Bernd Eichinger, it has Ben Whishaw in the main role and features also interpretations of Alan Rickman and Dustin Hoffman.What's the boundary between genius and madness? It's hard to define it, and this movie makes me meditate about that. It's a positively challenging film, which is difficult to be indifferent. Or you like it, or you hate it. Based on Patrick Süskind's novel, the film knew how to be faithful to it without become predictable for those who haven't read it. The script is good but it's too warm and, despite the suspense, isn't able to create real tension moments before reaching the end, which is explosive and shocking to most impressionable audiences. Perhaps it's because of this that so many professional film critics have been so hard on this film. Okay, it has several flaws, the soundtrack doesn't stand out particularly, the costumes are ordinary despite fulfilling it's role, most of the cast was reasonable but didn't shine... but on the other hand these flaws are compensated by good photograph, the visually attractive scenarios, the correct narrator's diction and, above all, the superb interpretation of Ben Whishaw, who managed to give his character an extraordinary dichotomy of personalities and feelings, which reminded me \"Dr Jekyll and Mr Hyde\".For all this, and despite being far from perfection, this film is quite acceptable and has some quality moments. After seeing it, I conclude that I will not remember it as one of the best I've seen, but I didn't feel cheated in my expectations."
    }
  ],
  "recommendations": [
    "cloud_atlas",
    "the_green_knight",
    "the_lovely_bones",
    "v_for_vendetta",
    "joker",
    "hugo",
    "inception",
    "the_giver",
    "tinker_tailor_soldier_spy",
    "roma",
    "the_prestige",
    "her",
    "the_good_shepherd",
    "hereafter",
    "shutter_island",
    "the_machinist",
    "the_butterfly_effect",
    "the_master",
    "magnolia",
    "enemy",
    "dogville",
    "revolutionary_road",
    "the_social_network",
    "tenet",
    "eternals"
  ]
}