{
  "id": 2605,
  "title": "Perfect Stranger",
  "starring": [
    "Halle Berry",
    "Bruce Willis"
  ],
  "runtime": 109,
  "genre": [
    "Thriller",
    "Crime",
    "Mystery"
  ],
  "description": "A journalist goes undercover to ferret out businessman Harrison Hill as her best friend's killer. Posing as one of his temps, she enters into a game of online cat-and-mouse.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/i7D5QqQ0q5EXU1UuZVY9KwIxoYR.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 3.6666666666666665,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "This movie initially did not seem to me as bad as many say it is. Seriously, it's nice when we see it, but it gets worse when we think about it seriously. The story revolves around a journalist trying to find out the killer of a childhood friend who had told her she was having an affair with a powerful executive at an advertising firm. Of course, the journalist immediately suspects him and decides to infiltrate the company and seduce him to discover the truth.The film has a good initial premise and provides the public with good entertainment and even some pleasant suspense. The problem comes when we think of what we are seeing. Right from the beginning, the journalist tries to expose a politician who, despite being a homosexual, positions himself as an opponent of LGBT rights. At least that's what I understood! I understand that being gay and being gay is a gigantic contradiction, but it still does not seem to me a reason for a journalistic bore, even when holding public office. The personal life of each one only concerns each one, and it is only each one who should see the possible contradictions that may exist and be honest with himself. And as if that were not enough, the journalist then decides to seduce a married man, who she knows to be a womanizer and a contumacious adulterer, to know if he killed her friend. The CEO of the film is portrayed as an adulterer who sexually assaults the female employees ... but if sexual harassment is a crime what we see in the film no: I only saw the female employees almost throw themselves into the employer's lap, which did not is made of iron ... All this ends up making us forget the initial homicide, which should be the focus of the film and which loses its importance as the games of seduction between the boss and the false employee become more intense. Another thing that does not have any kind of relevance but that the film highlights as far as can be the torrid sexual encounters of the main character. Okay, sex sells, but even sex must have been right in a movie.Honestly, the problem with this film is the poor construction of the script, which gives ancillary value and forgets the fundamental. Another problem I noticed is the poor build of the characters, who are unable to empathize with the audience, even though I liked the idea that they all had their own \"dark side\", their skeleton in the closet. But the bad construction of the characters is a consequence of the bad script. Hale Berry tried to show talent and still achieves a satisfactory performance, but did not receive material to shine. Bruce Willis, despite being in a character that allows him to take full advantage of the charm and magnetism that usually attributed to him, also did not seem at his best. The two actors built good chemistry, but that's it. Giovanni Ribisi is simply stupid and Nicki Aycox had a character with no credibility whatsoever.The movie entertains, but it is better to see without thinking about it. It turns out to be perfectly forgettable."
    },
    {
      "rating": "7",
      "text": "I was pleasantly amazed with this movie! From reading every negative review on the planet, I expected a dreadful show of Halle Berry and Bruce Willis. BUT...the end twisted the whole story and I actually had to watch it twice to tie it all together. I don't really get why everyone is hatin' on this film. It was twisted in all the right ways! I actually liked it!"
    },
    {
      "rating": "8",
      "text": "I was against seeing this movie after reading all the reviews. I'm sorry, the critics are wrong. The plot was excellent, I was on th edge my seat. Halle Berry, Bruce Willis and Giovanni were excellent in this film. Go rent this movie, you will not be disappointed."
    },
    {
      "rating": "3",
      "text": "People who think this is a good movie need to see more movies. Rent or buy Strangers On A Train. It's $9.99 at my local supermarket. You have no idea what you are missing. Watching this movie makes me dumber. The only reason I give it a 3 is Halle Berry. I'd give a 3 if the movie involved nothing but Halle Barry standing in front of a blank background. The plot and writing are pitiful."
    },
    {
      "rating": "1",
      "text": "Wow. This is awful, and one of the most asinine \"twist\" endings in a long while. You won't guess it, because they don't give you any hint of what's coming - it's that out of left field. There was no one who was remotely likeable - I wanted them all to get killed, first and foremost Halle Berry's character. I really was hoping Balki from the TV show \"Perfect Strangers\" would show up. It would have been an improvement. That's how bad it was."
    },
    {
      "rating": "1",
      "text": "Terrible...one of the worst films of it's genre I've seen in a long time. Totally unbelieveable with an insipid script that's full of cliches. Bruce Willis is reliably awful. Halle Berry has made another poor choice in vehicles for her talent."
    },
    {
      "rating": "7",
      "text": "One of the best thrillers where the director has cleverly disguised the audience to focus on characters who are not amongst the killer. nerve tickling and yes a a real suspence movie experience.Hats off"
    },
    {
      "rating": "3",
      "text": "This is one of the worst movies I've seen in a long time. It had such a weak storyline which didn't really seem to go anywhere. A total waste of time!"
    },
    {
      "rating": "4",
      "text": "I don't think this movie was as bad as the reviews made it out to be except for getting a little weird near the end."
    },
    {
      "rating": "0",
      "text": "A perfect mess. What a silly and badly thought out plot. Halle Berry is just awful in this ultra-dreary and dull film."
    },
    {
      "rating": "8",
      "text": "Pleasantly surprised by this movie - surpise ending that had me totally baffled - I don't understand the negative reviews of this flim???"
    },
    {
      "rating": "3",
      "text": "The beginning of the movie seemed ok. Halle Berry looked great and had interesting banter with Ribisi. But about halfway through the movie lost its way and by the end it was like Chinese water torture to watch."
    },
    {
      "rating": "2",
      "text": "Sitting through this film, was torture, nothing less then torture. Unless you are absolutely forced to see this, don't!"
    },
    {
      "rating": "6",
      "text": "\"Perfect Stranger\" could be described as a stealthy feminist-revenge thriller if not for an early scene in which Rowena(Halle Berry), an investigative reporter, seems prouder about her own personal success than the professional capacity she upholds as a facillitator for the public's right to know. When Rowena's story is killed, her diatribe about powerful men feels like an afterthought. As Rowena toasts drinks with Miles(Giovanni Ribisi), before the bomb is dropped by her boss, you get the unmistakable impression that she's a narcissist. Rowena, now a freelance writer, will probably go on to write a magazine article about her experiences with businessman Harrison Hill(Bruce Willis). Maybe, just maybe, \"Perfect Stranger\" was striving to make a roundabout allusion to former New York Times reporter Jayson Blair, or ex-New Yorker staff writer Stephen Glass. Speculating about how Rowena would write up this story is more interesting than the official narrative, which has the zaniest twist ending since \"High Tension\"."
    },
    {
      "rating": "0",
      "text": "This was slow, dumb and weak. Charactures were unlikable. Holes everywhere. Don't waste your time or money on this film."
    },
    {
      "rating": "5",
      "text": "Boring, unoriginal, and ultimately stupid. The less-than-clever twist near the end of the movie didn't help very much, either."
    },
    {
      "rating": "7",
      "text": "Perfect Stranger is better than about 2/3 of current Hollywood movies. The plot is fairly complex, the characters are interesting and sufficiently believable, mood is sustained, and the film is fun to watch and even discuss afterward. With so much product out there which insults the viewer, why have critics savaged Perfect Stranger?"
    },
    {
      "rating": "5",
      "text": "I didn't think it was terrible, it was okay. Bruce Willis was good, but Halle Berry definetly could have been better. The ending could have been better too."
    },
    {
      "rating": "8",
      "text": "This movie is a good horror movie with a very good story line."
    },
    {
      "rating": "1",
      "text": "Uma história interessante. Porém desperdiça o talento de Bruce Willis e da própria Halle Berry com um final estúpido digno de vai.Um filme com potencial estragado por um final extremamente lixo!!!!"
    },
    {
      "rating": "5",
      "text": "Perfect Stranger by trailer looks like a great thriller. Here is a good cast, an interesting idea. But the plot closer to the middle begins to sag a lot, too delayed. Well, the only plus of the film is its end and open ending. So Perfect Stranger would be a gray thriller in general."
    }
  ],
  "recommendations": [
    "the_loft",
    "man_on_a_ledge",
    "21",
    "a_perfect_getaway",
    "gone_girl",
    "limitless",
    "lucky_number_slevin",
    "the_number_23",
    "contagion",
    "knives_out",
    "awake",
    "men_in_black_international",
    "law_abiding_citizen",
    "next",
    "the_little_things",
    "the_counselor",
    "flightplan",
    "now_you_see_me",
    "reasonable_doubt",
    "tusk",
    "the_good_liar",
    "the_call",
    "the_old_guard",
    "the_gambler",
    "fifty_shades_darker"
  ]
}