{
  "id": 1623,
  "title": "Personal Shopper",
  "starring": [
    "Kristen Stewart",
    "Lars Eidinger"
  ],
  "runtime": 106,
  "genre": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "description": "Maureen, mid-20s, is a personal shopper for a media celebrity. The job pays for her stay in Paris, a city she refuses to leave until she makes contact with her twin brother who previously died there. Her life becomes more complicated when a mysterious person contacts her via text message.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uygGdDR0OEa3ZB3nwANtzOzU9Fa.jpg",
  "categories": {
    "plot": 7.090909090909091,
    "acting": 5.333333333333333,
    "ending": 7.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "I went to see “Personal Shopper” for one reason only and that was to catch up with the critics who have been raving about Kristen Stewart’s performances in her independent films. I believe I saw her in one of the “Twilight” movies and I was impressed with her performance in “Still Alice” but I had to go to Wikipedia to see what other movies she had been in and they listed 2 movies I had seen, “Panic” and “Café Society” only vaguely remembering her in the latter.The title of the film is Maureen’s (Stewart) job description for a celebrity Kyra (Nora von Waldstatten) who can’t go out without being mobbed. Maureen believes she has paranormal powers as a medium as did her twin brother Lewis who died from a condition that could also affect her eventually. The twins made a deal that whoever died first would send a ‘sign’ from ‘the otherside’.We meet others along the way from Kyra’s lover of 2 years, Lewis’s widow, Maureen’s boyfriend and others but none have almost as much screen time as her iPhone except, possibly, the various laptop computers which are all around.Kristen Stewart dominates the movie whether texting, traveling on trains between Paris and London or motoring around Paris on her Peugeot scooter, being topless for one reason or another and trying to communicate with her brother or being pursued by a mysterious stranger, possibly from ‘beyond’ in that iPhone.Stewart’s face implies more than her words and she easily makes her character believable but I am on the fence regarding her appeal as an actress which in this case may be due, partially, to her director Olivier Assayas. In their first picture together, “Clouds of Sils Maria”, he and the cast received rave reviews and Stewart was the first American to win the French’s Cesar Award for Best Supporting Actress but I don’t see his touch here. In fact, a few scenes that should have had the audience jumping out of their seats, gets very little reaction. Neither does he, or the sound editor, do their job when it comes to the French subtitles or level of some English lines important to the film.“Personal Shopper” did get me interested in Kristen Stewart but at this point not enough to make me go see her future films if there are other films in theatres at the same time that I would like to see for one reason or another."
    },
    {
      "rating": "4",
      "text": "Kristen Stewart lives in Paris, where she works a famous woman picking up her designer clothes, but it's not an especially glamorous gig. Meanwhile, she's a medium waiting for a sign from her recently deceased twin brother. Since this was made by French director Olivier Assayas, (who cast Stewart to play the personal assistant to Juliette Binoche in \"Clouds of Sils Maria\") you can expect a slow, observational style that lets scenes play out without much emotion. Stewart rides thru the role with little expression, while the supernatural element only serves to complicate matters in this fragmented screenplay. Some mysterious events added a bit of apprehension and hope for some spooks. Unfortunately, after it was over, I had no idea what had happened or why we were supposed to care."
    },
    {
      "rating": "8",
      "text": "After unequivocally loving Olivier Assayas' 2014 effort, Clouds of Sils Maria, his follow-up is a lot tougher of a nut to crack. Part-thriller, part-horror, part-mood piece, Personal Shopper truly evades definition. It operates at a safe distance from the viewer and refuses to be defined. By the end of the film, what is real and what is not real is really next to impossible to pin down. Personally, I have a variety of working theories, but whether or not any of them are actually accurate is another matter in and of itself. What is clear, however, is that this is a film about grief, identity, and mortality. Above all, it is a thriller that sets out to unsettle its audiences and make them think. To do so, Assayas' film is purposefully complex, dense, and tonally off. Even the editing, with many scenes ending abruptly and fading to black, is used to throw off the audience and make us squirm. Of course, this has the by-product of making the film appear to be lacking satisfaction. In many ways, however, this merely mirrors the issues of Maureen (Kristen Stewart) after losing her twin brother Lewis. Complicated, distant, and forever denying viewer access to its idiosyncrasies, it is no wonder that Personal Shopper has divided audiences.One of the most obvious themes that Assayas introduces into the film is grief. Working as a personal shopper for model Kyra (Nora von Waldstätten) to support herself while also operating as a medium for the couple set to move into Lewis' old home, Maureen is constantly looking for a sign. Before he died, the two had promised to leave the other a sign. Whoever died first had to let the other know they were in the afterlife. Waiting around in Paris for Lewis to come give her that sign, she encounters a ghost that is most definitely not Lewis and also begins to receive mysterious text messages from an unknown number. While she is shaken, she approaches every situation where a ghost may be present with the same question: Are you Lewis? She cannot get him off of her mind and is constantly seeking to find out if he is alright and at peace. Assayas' film shows how grief can control one's way of life to the point that she refuses to meet up with boyfriend Gary (Ty Olwin) in Oman for a vacation. Instead, she does a job she hates for a woman she hates just to justify staying in Paris. In essence, she is a prisoner of her grief, which is not an original theme by any means (The Babadook being a recent example), but is well-executed in the film. Assayas injects incredible tension and fear as we wait to find out if the ghosts and noises she encounters are truly Lewis or some other being.However, I have my doubts that Maureen is actually a medium. Whether Lewis was or not is unclear, but towards the end of the film, Maureen remarks how Lewis was always more in tune with that and she usually just copied him. It is entirely plausible that Maureen is not a medium at all. Rather, she is merely a girl suffering from a lost identity due to the shared one she had with Lewis. As he was her twin, it is possible she is trying a route he had taken in order to reach him. However, it does not work and either she meets unfriendly forces or she imagines them all. The latter, however, seems most likely with how awful she is at detecting presences. She notices obvious things in the walls or glasses breaking, but never seems to aware a ghost is with her until it is literally right on top of her. If she were a medium, it would stand to reason that she would be better at identifying when they are near. Furthermore, the ghostly text messages she receives where the sender claims to always be around her and sees what she is doing and wearing, certainly hint that there is a ghost around her. Possibly Lewis, the sender does seem to be a bit odd, but largely harmless for Maureen. However, what is clear is that either Maureen is not a medium or she is an entirely dreadful one, making it unlikely she ever actually encounters ghosts. Rather, it is merely a machination of her mind used to cope with the loss of Lewis in the only way he knew how.One of the most important things that this ghost texter allows her to confront, however, is her sense of identity. Now, this is where this interpretation may lose some people, but I warn you that this is a film that demands multiple views. Coming off of one viewing, it is entirely possible I am off base here. Yet, there are three possible routes to take in regards to Maureen's sense of identity. One is the most logical one based on the film. Through encouraging her to try on Kyra's clothing, the sender allows her to try on a new personality. After expressing that she does not want to be herself, but is unsure who she wants to be, the sender allows her to try out new personalities to find one that fits her."
    },
    {
      "rating": "10",
      "text": "This is quite possibly the smartest meditation on the narrative unreliability of cinema since Stanley Kubrick's \"The Shining\". As a mystery, it's absorbing and with some genuinely hair-rising moments, spectacular directing from Olivier Assayas, and one of the best ending lines in recent memory."
    },
    {
      "rating": "0",
      "text": "Terrible BORING NOTHING HAPPENS BUT..............ARTYS FARTSY CRAP....AVOID!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "7",
      "text": "Near the end of this film, the Personal Shopper is communicating with the other-world through a series of questions that are answered with either a single or double thud for yes or no. It’s a haunting scene, but your interpretation of the “message” depends on how you arbitrarily interpret the thuds (one for yes and two for no or vice versa – your choice). If you love traditional horror films, this will frustrate you and make you crazy. If you are a bit more willing to “go with” an “art film,” you may find this interesting, but also a bit too pat and annoying. I loved Assayas’ last film, The Clouds of Sils Maria, which had a kind of ghostly presence in it (the old playwright who dies at the beginning of the film just before the revival of his biggest early success), but this film, which seems inspired by the enigmatic Personal Assistant (played by Kristen Stewart) in the earlier film, has morphed into an interesting experiment but not a completely satisfying film of any kind."
    },
    {
      "rating": "4",
      "text": "Texting, shopping and Ghosting!This film was different. My bad, I did not quite get the title at first. I misunderstood it. I thought it was like a Shopaholic theme, a person with a shopping addiction. Then what I saw was different, and somewhere in the narration it explains what the title meant.The real challenge watching it is the slow moving storyline. Dull and silent on most of the parts. But the mix of fantasy, like supernatural and regular drama brings interesting fact us to stay with it. Though the most of the film was about texting and shopping. I even thought does it any way connected to Stewart's previous film 'Clouds of Sils Maria'. Because there's something where both the films syncs with.Despite being a bit boring film, Kristen Stewart is the reason it is watchable. Her performance was good, but again the mystery about the unexplainable things holds us as well. Definitely a watchable film, but not an entertaining film that you are looking for on a weekend. I'm not sure who is the target audience, but surely less people will think it is a fine film. So I hope you choose it carefully.4/10"
    },
    {
      "rating": "7",
      "text": "Personal Shopper has its moments of intrigue and wonder however falls short due to its melancholy tone and joyless acting. The mixture of the supernatural and thriller was quite good, I just really wanted more."
    },
    {
      "rating": "6",
      "text": "Grief may be hard to deal with, we all get that far, and even though Kristen Stewart´s character believes in ghosts, you know Assayas doesn´t, and he´s honest enough not to hide any clues. So all you are left with is the charmed humdrum of wealth and the sophistication of upper middle-class bohemian life, that and a few elipses and moments that make you wish there were more to this than there actually is. Oh yes, Kristen Stewart is very fine, but she´s not Ingrid Bergman, not yet, is she?"
    },
    {
      "rating": "7",
      "text": "Great movie. Kristen Stewart continues to shine after her Twilight Days. The movie is extremely original and very captivating and intriguing. Also the whole ghost story was pretty darn cool as well."
    },
    {
      "rating": "5",
      "text": "I hate to jump on the bandwagon of hate for this movie (or any film in general), but Personal Shopper just plainly felt like a hack job by Oliver Assayas. It's described that the script for the film came from a failed American production, which makes sense, because it felt like the director was trying to salvage the remnants of an original idea expanding it with additional material. The result is a cobbled together mess that's not really about anything. Other than it feeling phony, the production, acting and directing is solid, though I hated the editing, the constant fade-outs really got on my nerves. Personal Shopper is far from terrible, it's mildly engaging and I did not hate it, my biggest issue is that it is a sham that for some reason made it on to the Criterion collection."
    },
    {
      "rating": "8",
      "text": "A ghost story which is not a ghost story, more a meditation on what we have that is personal. The film is entirely about Maureen (Stewart), all other characters are peripheral and inform her story. And the film succeeds because Kristen Stewart is so watchable, so real. All her slightly uncomfortable mannerisms, her vulnerability and strength are very approachable. A film that never tries to do more than it intends."
    },
    {
      "rating": "7",
      "text": "definitely worth shopping..Personal ShopperA smarter intake on capturing the mourning process that follows a mythical path which not only is intriguing but thought-provoking and layered concept. The writing is gripping and poetic and doesn't grow cheesy or corny (which it could have been easily considering the wider concept it possess) instead grows mature and stays true to its tone throughout the course of it. Even though the concept is deep and finely detailed, the makers narrow down the priorities and keeps it simple rather than overcooking it. Olivier Assayas; the writer-director, has done a marvellous work on executing this character driven feature (such features can easily be exhausting if not taken care of) with the help of amazing cinematography and rich costume design. The background score and the editing could have been a lot better. Kirsten Stewart is a revolution and the game changer in this feature (she carries it all on her shoulder) as it is one of her finest performance up till now. The sound effects aren't scary to that extent but then contradict to its genre, the feature doesn't spend its time on projecting the high pitched tense sequences that are usually all hoax in such features. Personal Shopper is brutally dark and inedible on terms of the trajectory it follows but if up for it, is definitely worth shopping."
    },
    {
      "rating": "7",
      "text": "65/100I think it's not for my taste but... the acting (Kristen Stewart) and the idea are good."
    },
    {
      "rating": "5",
      "text": "Dull. A movie that had so much potential but in the end is an empty, boring suspense/mystery."
    }
  ],
  "recommendations": [
    "searching",
    "donnie_darko",
    "20th_century_women",
    "the_good_shepherd",
    "the_guilty",
    "the_card_counter",
    "first_man",
    "snowden",
    "the_secret_scripture",
    "tulip_fever",
    "the_book_thief",
    "the_killing_of_a_sacred_deer",
    "thoroughbreds",
    "the_beguiled",
    "you_were_never_really_here",
    "nocturnal_animals",
    "elle",
    "hereafter",
    "the_master",
    "the_king",
    "melancholia",
    "predestination",
    "the_last_duel",
    "ex_machina",
    "the_machinist"
  ]
}