{"id": 1627, "title": "Pet Sematary", "starring": ["Dale Midkiff", "Fred Gwynne"], "runtime": 103, "genre": ["Horror", "Drama"], "description": "Dr. Louis Creed's family moves into the country house of their dreams and discover a pet cemetery at the back of their property. The cursed burial ground deep in the woods brings the dead back to life -- with \"minor\" problems. At first, only the family's cat makes the return trip, but an accident forces a heartbroken father to contemplate the unthinkable.", "releaseYear": "1989", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/8ZtH1V4rhrtP53ezlEWrCaMALXF.jpg", "categories": {"plot": 5.368421052631579, "acting": 5.4, "ending": 6.25, "soundtrack": 5.5, "cinematography": 5.5, "familyFriendly": 3.0, "funny": 6.25, "action": 5.0}, "reviews": [{"rating": "9", "text": "A lot of people hate Stephen King movies and I can see why sometimes but Pet Sematary is great! It is creepy for example Zelda. Omg she is creepy. Well anyways this one is good but the second one I can't say the same."}, {"rating": "9", "text": "A disturbing film with scary that are more fresh than we give credit for one of Kings best Adapted novel adaptions"}, {"rating": "7", "text": "A very faithful adaptation of the novel. It's an almost scene-for-scene recreation of the book's story. I enjoyed seeing my favorite moments from it being brought to life before my very eyes. There are a few minor differences in dialog here and there, and the character Victor Pascow is given a larger role, but the only big change comes from the removal of Jud Crandall's wife. Her role in the story has been given instead to the maid, Missy Dandridge. With the screenplay having been written by Stephen King himself, you can tell this decision was made just so there would be a difference between the book and movie that's a little more distinguishable than the rest. Something more significant to possibly encourage people to check out both versions of the fiction. It ultimately effects very little. The fidelity to the source material guarantees that this movie is sure to be a hit with fans of the novel. The level of success it will find among those who have not read the Stephen King story is more up to question.When I watched the movie I tried to do so from two perspectives; one as a fan of the book, and one as an outsider who never picked up a copy. While the fan in me was mostly pleased, the part of me that had to view it with out any knowledge of what happened in the book was a little more critical of the flaws. It's not hard to notice how flatly acted the whole thing is. Not hard at all. Our lead Dale Midkiff is the worst offender. He's far too wooden and lifeless. Former sitcom star Fred Gwynne feels a bit too suited for comedy to play a truly great Jud Crandall. In the final act though he really shapes up and shows some true emotion. There are also some poor decisions made with some scenes that rob them of their potential creepiness. For example a few scenes include interactions between a grown man and an obviously lifeless mannequin/doll. These issues could have been in part the fault of either time or budget constraints. Maybe both. Then there's the fact that the movie sort of rushes through the plot of the book. It jumps from major event to major event at occasionally jarring speeds. Never sticking around long enough to really sell the horror or capture the emotions that were on display in the novel. All of these were things that could have handled better if the movie had been in the hands of a better director. I get that there was a lot of material to cover, but some of these mistakes feel amateurish in nature.Still, the movie has it's creepy moments in it's final act and some of the more potent themes from the book manage to still find their way in here as well. It's even got some pretty great gore effects. So there's still a chance it may appeal to the less literary-inclined out there. And as I've said before, those who have read the book this movie is based on are practically guaranteed to find at least a small level of enjoyment here for the faithfulness alone. Even if they too find it to be unintentionally funny at times or not quite so well-executed in some areas. As it stands, this is definitely among the best adaptations of a Stephen King novel in the exactness department. It just doesn't quite make it alongside the best movies to be born out of one of his works because of it's shortcomings.7.3/10"}, {"rating": "6", "text": "Too often settles for the lowest common denominator (meningitis-sploitation is such an apt descriptor of this movie as a whole). But it succeeds more often than not. It has purpose and rhythm and creeps. It works."}, {"rating": "5", "text": "Everyone in this movie makes terrible choices, probably the most dumb characters of cinema story, but at least film i funny and I enjoy watching this one entirely, just because I wait nothing about it."}, {"rating": "4", "text": "+Great concept+Decent adult cast-Over use of 'scary visual effects' removes all tension-Straight to TV dialogue/direction1989's pet semetary holds a fascinating story concept that suffers greatly from being unnaturally wedged into being an 1980's practical effects focused 'scary horror film'. Sadly in 2019 the effects don't hold up well enough to improve story and so we are left with a cast of characters who are seemingly introduced only the on-screen culling pleasures at a production level of what feels like a 'straight to TV'. As I watched I found myself wishing it not to lean on effects so often... SO much tension can be created by not showing but implying danger and use of pacing and exposition can do soooooo much for the genre. Feels like more could have been done here with the on screen talent also."}, {"rating": "3", "text": "/    /"}, {"rating": "6", "text": "Definitely not one of Stephen King's best adaptations, but worth watching just to see the cute kid from Kindergarten Cop murdering his family in an adorable way. George Romero was originally supposed to direct this, which would've helped, but it's still good for a couple of laughs and a few genuine frights. One particular scene with a woman suffering from spinal meningitis gave me serious nightmares as a kid."}, {"rating": "7", "text": "It’s FineNot the perfect King adaptation (That goes to both 1990 and 2017’s IT’s), But it’ll do on a rainy day."}, {"rating": "5", "text": "Although his writing is generally brilliant, not all of Stephen King's short stories are in fact appealing and interesting. As with all authors, there are smaller works in the middle of their writing and \"Pet Sematary\" is probably one of them. Even so, this did not prevent three adaptations to be made for the cinema. This film, from the late-eighties, is the first of these adaptations and, in my view, the most faithful to the original tale. It is an average film, which does not disappoint us but which is far from being really good.The script follows King's story with some care: the Creed family has just moved into a country house in order to abandon the stressful routine of urban life, but the house is next to a road with a lot of heavy truck movement, which circulate at high speed and without great care. They immediately become friends with the neighbor across the road, an elderly widower named Jud. It is he who, when asked about a path around the house, introduces them to the Pet Cemetery, where children from the area bury their pets, many of them victims of being run over on the road. Weeks later, when Louis Creed tries to save the life of a young man who dies in his hands after an accident, he is warned by the young man's spirit that he, as well as his family, are in danger. In fact, behind the house, close to the Pet Cemetery, there is an ancient sacred place where the Indians buried their dead, but which was abandoned when it became a cursed place. A place where you shouldn't go, and where the stony soil hides a cruel force.In general, I liked the film and the story, even though it is considerably weaker than much material I have seen, and which is also based on the tales of this author. The idea of the animal graveyard seems to me more tender than threatening, it is a way to keep alive the memory of the animals we love in life. Furthermore, as the film itself reveals over time, all the horror does not come from this cemetery, but from another, older and more isolated one. The film still has some problems of rhythm since it spends the first 45 minutes in dialogues, back and forth, without actually building solid characters with this effort. In fact, if we exclude Louis Creed, Jud and - surprisingly - the cat, the rest of the characters are limited to the basic and do not allow us to make major psychological analyzes. And that feeling of guilt that Rachel Creed carries because of the death of her sister is something that does not do much for the story told, and it also does not help us to like the character.The cast is not brilliant, but does a generally satisfactory job. Dale Midkiff was very good in the role of Louis and Denise Crosby is tender as the mother of the family, but Fred Gwynne goes further and really succeeds, with this film, one of the most notable works of the career that, in fact, would end with a few years later. Brad Greenquist gave life to the ghost but if the character was not particularly interesting the same can be said of his work.Directed by Mary Lambert, it is a lukewarm, irregular film, with a somewhat lazy cast and that suffers from faded, low-contrast and generally ugly cinematography that was taken from the stake in the films of the 1980s. The visual and sound effects are not brilliant, and the sets and costumes are also not particularly surprising, being more or less within what we could expect. Things get much better when the cat comes back, and from now on everything becomes more palatable, bolder and more visually violent. The soundtrack is not in the ear but has good incidental music."}, {"rating": "6", "text": "65/100  Okay ... that was weird.  First of all, I didn't liked the acting (Gage and Jud were the best and Pascow was an annoying character).  Secondly ,the makeup, soundtrack and cinematography are ok. The cemeteries look pretty good and Church and Zelda are very creepy.  It's meh ... let's see how good the remake will be (I'm not going to watch the second movie)"}, {"rating": "6", "text": "After multiple viewings this film grew on me quite a bit. It's atmospheric, doesn't have annoying jump scares, cool practical effects, and a bangers end credit song by the Ramones! Good stuff"}, {"rating": "4", "text": "An amazing performance from Fred Gwynne can't save this film. The screenplay may have been written by the master himself but this film misses the entire point of King's novel by turning it into nothing more than a generic zombie film."}, {"rating": "7", "text": "Está muy infravalorada, pero es terrorífica y muy tensa, la recomiendo mucho."}, {"rating": "4", "text": "’d say that after watching this and the 2019 remake, I just don’t think I like the Pet Sematary Story. I mean maybe the book is good but these movies have really strayed me away from ever ready it, the only 1-up this film has on the remake is the excessive amounts of 80s cheese. I wouldn’t recommend anyone give this a watch, die hard Stephan King fans maybe.4/10 Jay x"}, {"rating": "6", "text": "I wanted to watch Pet Sematary after listening about it's remake and knowing that it's based on Stephen King's novel. The concept of the movie was good but the execution was not good.The story had a lot of potential but it was made just as a simple creepy movie. The acting was normal, the horror element was zero and creepiness was too much. The reasoning for some scenes were not given, which arose a lot of questions. What this movie was just a story which was trying to be a horror movie but failed miserably to become a horror movie.Overall, you can watch this movie for a different experience but don't expect too much from it."}], "recommendations": ["doctor_sleep", "the_lovely_bones", "odd_thomas", "ouija_origin_of_evil", "alice_through_the_looking_glass", "the_conjuring_the_devil_made_me_do_it", "it", "harry_potter_and_the_goblet_of_fire", "color_out_of_space", "the_spiderwick_chronicles", "the_bfg", "it_chapter_two", "children_of_the_corn", "inkheart", "let_me_in", "mowgli_legend_of_the_jungle", "scary_stories_to_tell_in_the_dark", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "the_dark_tower", "the_house_with_a_clock_in_its_walls", "alice_in_wonderland", "the_golden_compass", "a_christmas_carol", "the_nutcracker_and_the_four_realms", "insidious_chapter_3"]}