{"id": 1355, "title": "Peter Rabbit", "starring": ["James Corden", "Rose Byrne"], "runtime": 93, "genre": ["Animation", "Adventure", "Family"], "description": "Peter Rabbit's feud with Mr. McGregor escalates to greater heights than ever before as they rival for the affections of the warm-hearted animal lover who lives next door.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/cBWtdp8mgce4QQkH697LpaL0Iik.jpg", "categories": {"plot": 6.222222222222222, "acting": 6.428571428571429, "ending": 7.0, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 6.461538461538462, "funny": 6.458333333333333, "action": 10.0}, "reviews": [{"rating": "5", "text": "When I saw this film in theaters, I thought it was gonna be absolute garbage, like a certain animated film that Sony released a while ago, but, since I did see it in theaters, what was my reaction? Well, I thought it was... another boring and clichéd kids film.... Before I get to the bad, let’s start off with the things I did like about itPROS:The acting is pretty good, especially with James Corden as Peter himself,even if I’m not much of a big fan of him...The animation on the animals are pretty decent to look at, even when they move in a bit of a cartoonish way.There are a few scenes that did make me chuckle.Okay, so with the positives out of the way, let’s get to the cons...CONS:This kind of story/plot has been used plenty (or even several) times in other kids films.We’ve seen these old cookie cutter characters before...And last, but not least! The overall humor of the film... I mean, seriously, it’s just Alvin and the Chipmunks and The Smurfs all over again, but at least this one did it slightly better.FINAL SCORE/GRADE:Overall, this film is just, again, another mediocre kids' film that has nothing interesting or unique about it, my best recommendation is to just stick with the original book by Beatrix Potter herself, or just show to your kids if you have nothing else to do to entertain them.... if you have any. (probably not)Since it’s just another uninteresting and bland kids' film....I’m gonna give Peter Rabbit a C-..."}, {"rating": "6", "text": "I was honestly pleasantly surprised by Peter Rabbit! While there are a few problems with the plot and some tired children's film elements, I honestly really enjoyed the film and had a lot of fun watching it. Rose Byrne and Domhnall Gleeson are both really charming and have great chemistry. Even James Corden does quite well in the titular role. All of the voice actors playing the rabbits were spectacular. While I wanted to give this movie I 7, I feel it's honestly a 6.9. There are a few problems holding it back from that score. Some of the score choices in the soundtrack are bizarre, as are some of the sight gags, and the prologue of the film is a real chore to watch, although the hand drawn animation sequence was quite lovely. All in all, Peter Rabbit is a solid choice of a film to take your kids to see!"}, {"rating": "7", "text": "Surprisingly DecentI'm Surprised, Usually Films With Live Action And Animation Based On Children's Materiel Suck, This Film, While Not Perfect Is Fun."}, {"rating": "7", "text": "It's not Paddington but It's a great family movie and I had so much fun while watching it"}, {"rating": "7", "text": "A surprisingly hilarious, heart-warming, and charming time at the movies. While it's predictable, has been seen and done before, and there's a few points where it get's a bit too dark for a family movie, I had a really pleasant time and if you just want to laugh and have fun this is a great option."}, {"rating": "8", "text": "I really enjoyed this. I went in expecting a rather poor childrens movie. And got a really good childrens movie that adults can enjoy as well.I agree that Paddington 2 is the better movie, But this is a good second thats not too far behind. They also clearly put a lot of time and effort into script details, and some of the Human/CGI coreographed scenes.Its very cute, with a lot of content that even parents will find enjoyable."}, {"rating": "3", "text": "This isn't as infuriating as the trailers made it out to be, however there honestly is nothing all that redemptive nor refreshing about this movie. It's a bland kids film with elements that you have seen done a ba-jillion times before, including an overdone story line, obnoxious jokes that are not clever no matter how many times the movie is self-aware (and also repetitive as well with how often the film eschews the rules of three), and all the pop songs that are thrown in there for no real reason (although I do give them props for using Rancid's Time Bomb in there because CLEARLY a song about gang violence definitely needs to be in a kids film). And to top it off the main lead is incredibly unlikable. I will give James Cordon this, he is trying with his role. I mean it's not much, it's basically James Cordon playing James Cordon, but I will take him over Jimmy Fallon trying way to hard to be funny and laughing at his bad material and Jimmy Kimmel's personality of a cardboard box and hollow political beliefs any day of the week. But the problem is that Peter is extremely unlikable in this movie. Yes the scene where Peter (well really one of his sisters but still) poisons Mr. McGregor with his allergy, which is overblown sure, but there is a truth to that scene. Throughout the entire movie, Peter acts smug and arrogant and he faces practically no reproductions nor does he change throughout the movie. It's not endearing, it's aggravating! There are some things that are decent about this movie. Domhnall Gleeson has a decent sense of comedic timing and if he wasn't overacting constantly and given better material then I could see him going well in a comedy. Him and Rose Byrne do have good chemistry, even though Rose Byrne is too good for this movie. The design for the animal characters are pretty good and they do animate well. But the CGI integration is so bad and fake, it often didn't feel like they tried to make it match with the real world as they always look phony, especially when a human is interacting with one of the animal characters.But honestly the biggest crime with this movie is indifference. I wasn't hate watching this like I would with the Alvin and the Chipmunks films or the Smurfs films or any number of live-action adapted children films, I was just left there with passive loathing. It's not annoying, it's just tiring at this point because there's nothing new this film offers other than a shallow adaption of a classic children's tale. I'm not going to give this film higher than the rating I am giving it, because that would imply that there is more quality than there is. There really isn't. Don't waste your time please.Also for some reason Ezra Koenig of Vampire Weekend helped with the soundtrack?!"}, {"rating": "9", "text": "Rose Byrne plays the bunnies' buddy and Domnall Gleeson is neighboring Mr. McGregor, who hates them. The rabbits are realistically, but cutely animated and feature James Corden in the title role. Along with his animal friends, their love of the plentiful vegetable garden leads to their rivalry with the angry gardener. This movie starts with funny musical birds and maintains a lively pace and spunky attitude throughout. The characters are amusing, there are plenty of winks for the adults and an energetic soundtrack to keep it bouncing along. This delightful adventure is lively, amusing and all-around plucky fun."}, {"rating": "6", "text": "\"Peter Rabbit\" was a fun and good movie, where we thought it would be another disaster of the real-life family movies combined with CGI, where Paddington is a huge exception, and now it's Peter Rabbit, nobody knew this nice rabbit until today, the animations were good, the interpretations were fun, the story is also fun although was slow and with a rhythm regular, but it has been worth the effort to have a very good adaptation."}, {"rating": "10", "text": "dis movie is the f****** worst s*** i have ever set my eyes  upon, DELETE THIS GARBAGE"}, {"rating": "10", "text": "We found this movie to be your topical slapstick comedy. Yes this film was designed for little kids but we found it so funny. It was more on the lines of pranks from animals who are fighting to survive in this world. In other words a very funny film that keeps you smiling. Like patch adams would say that laughter is the best medicine."}, {"rating": "8", "text": "despite the bad scores. This movie is very good, you get a feeling of emotion in this heartwarming film. With things everybody can relate to, and I'm shocked that the CGI was good, the plot was good, and the story was funny, one of the best movies in a bad movie era."}, {"rating": "7", "text": "Fares much better than Sony Pictures Animation's previous two live-action/3D animation hybrids, the critically maligned \"Smurfs\" movies. That's mostly due to how rambunctiously energetic it is. Our furry, troublemaking protagonist regularly gets himself mixed up in over-the-top situations. Luckily for him and us Peter Rabbit always has more than a few quips and tricks up his sleeve. Any other rabbit who ticked off humans this much would surely end up dead.There are some surprisingly dark elements to this family movie. Peter and his fluffy family have a tragic backstory of lost parents and the film makes no attempts to hide the fact that one of them was eaten from the children watching. We even witness someone straight-up die onscreen. Almost the entire plot centers around the new neighbor trying to kill the title character and his cohorts.The rest is as light-hearted as you would expect. Peter's conflict with Domhnall Gleeson is brimming with comic mischief and a level of cartoon slapstick violence I haven't seen since an episode of Tom and Jerry. Characters find themselves in all sorts of dangerous situations and showdowns, but are never really at any risk. The morals of the film kind of fall short for me as I never really saw Peter to be as much at fault as Gleeson's character, despite the movie telling he was. I enjoyed that the side-characters got their time to make us laugh instead of being overshadowed by the stars. Overall, I found it be a very enjoyable children's flick. One with the potential to entertain older audiences as well.7.9/10"}, {"rating": "8", "text": "A very nice family movie with lots of songs, great animation and good but not brilliant acting. I was having a great time because it is a cinema that does not need to be touched, does not bother and, most importantly, it does not bore me."}, {"rating": "5", "text": "I'd never heard about Peter Rabbit and and I’ve gotta say I didn't think it was bad but the film never felt genuine or actually funny."}, {"rating": "7", "text": "Very cute. The animation was fantastic. The cast performances were funny and great especially James Cordon, Rose Byrne, and Domhnall Gleeson. The voice over performances were also great. It was an enjoyable and fun movie to watch."}, {"rating": "5", "text": "My shortest review yet. Meh. I thought it would be horrible, it was alright, but meh. Nothing bold or interesting. Just.. average. Watch it.. to kill time? Watch some GKIDS movie instead."}, {"rating": "7", "text": "This movie felt like it was intended for kids but the message that the movie had and delivered was to complex for kids. Anyhow this was a decent movie with really amazing visuals with and interesting plot and some great acting. The music was really great and made the movie more enjoyable overall and entertaining along the way creating immersion that was missing in the first half of the movie. It did non struggle with pacing issues, and the characters where introduced with accuracy and care. The plot ended up being overly cliche and predictable, but the message of it was nice and genuine. In short the movie overall it's a good one, with all it's faults but it is certainly was executed to it's fullest potential. This being said it's good to realize that a 7 (good) it was the best it could achieve with it's cliche plot and weird humor. But the rest of the elements and the fun of watching it is easily makes this a good movie."}, {"rating": "7", "text": "The majority of the family’s enjoyment while viewing Peter Rabbit is sourced from the film’s unique, self aware and (to some degree) satirical style of comedy; and that creates about the majority of the enjoyment because when the time is at hand to judge the work’s story, this movie doesn't earn high marks. But luckily, the movie supplies big bursts of clever and genuinely hilarious writing all the way through the run time; and the jokes surprisingly fit into a diverse array of humorous elements that when blended together, doesn't get stale at all. (You simply cannot predict what the movie is gonna do next) One minute, the humor is simple, decently done slapstick; the next it’s a grand shattering of the fourth wall itself. (There’s actually a moment in the movie where the characters are discussing their own character flaws) It’s like nothing I’ve ever before seen in a family film. It’s like the movie knows that it’s prime demographic is the general family audience; so instead of simply trying to keep your five year old’s mind busy, it puts its best foot forward to try and downright disrupt the status quo."}, {"rating": "7", "text": "Yes the second half of the movie is full of clichés and most of its jokes are silly and repeated, but the movie is a sweet adventure that has surprisingly smart slapstick humor, gorgeous 3D animation and good voice acting specially from James Corden who voiced the titular character.(7/10)"}, {"rating": "3", "text": "This film had gags that (mostly) were not funny. The story was lacking and the messages the movie conveyed were uninspiring. Peter Rabbit was just a bad movie. Period."}, {"rating": "5", "text": "This isn’t as bad as I thought it was going to be, but it’s not good. The jokes are very weak for the most part, and the only thing that saves it is a decent story."}, {"rating": "10", "text": "This is a BRILLIANT film, very sweet and heartfelt. Not sure why there has been so many bad reviews and a lot of self-righteous comments--but they need to check their politics at the door, and for goodness sake--just have fun, people. Can't we just enjoy it? Why does it have to be so complicated? I can think of a million other things that are much worse--than this Peter Rabbit film, which by the way, there is nothing wrong with Peter Rabbit 3.0. Go see it. You're going to love it, as much as I would've felt the original author would have too, as this is based on her tale for kids, but it is technically a sequel--as you will understand when you see it. First off, they are rabbits, and rabbits are mischievous by nature, when they are bored or there is food at stake. They are also a bit affectionately demanding and territorial as they felt with Bea. Within the context of the film, rabbits don't understand what the implications of allergic reactions could be for humans--they are, yes, rabbits. The humor is just hilarious, and it works well coming from farm animals. This is CGI/A vs. real live humans. It kept me engaged throughout. I saw this one with my daughter and we both laughed so much and so hard -- isn't this what it is all about? a positive experience? One that brings you closer with those you are with? I cried, I laughed, I cried so hard I laughed, and laughed so hard I cried -- and this is how I rate/gauge film I watch -- by how it moves me and the positivity it inspires in me; it felt good to be reminded that I was still human. I just loved, loved, loved this film. I recommend it. This one will definitely make it into my collection once it is released in media format -- and not many make it in. The soundtrack is super amazing too--I can't stress that enough. They hit it on the head with this one. A TRUE STORY OF HUMBLENESS AND REDEMPTION. Your heart will melt into a big puddle--hands down. No one is paying me to write this--I give it 10 Gold stars. I want to see Peter win next year at the Oscars. A TOTAL GEM."}, {"rating": "9", "text": "Very funny and entertaining movie. I watched it on my 4K UHD Blu-ray and picture and audio quality were fine."}, {"rating": "5", "text": "I wasn't expecting to see anything funny or boring movies like this. I think they could do better to make this movie"}, {"rating": "5", "text": "This is a fairly entertaining and watchable film. Its of course a family friendly film, with cute rabbits - not quite the dark Watership Down film of the 1970s but that's to be expected. I'd heard there are some jokes aimed perhaps more at adults - I picked up on themes of the negativity of greed but not too much otherwise. Its a bit of a laugh but to me it seemed pretty forgettable fare. The performances were a bit hammy too but I wouldn't say its a really bad film. Its distinctly ok, in my book. I wouldn't go out of your way to see it but there are worse films around and I know about the whole controversy over the mention of an eating intolerance/allergy and I can understand why making light of it may seem very insensitive - I'm not sure, dialogue wise, it was perhaps thought about enough, the impact of that but I doubt (hopefully) that particularly young kids would necessarily pick up on it. I could be wrong though. That aside, its a cheesy but fun film with some fairly decent effects, of course including CGI, although I wouldn't go out of your way to see it. Oh and for anyone watching, we're into December and I had heard good things about this film, so I felt I suppose I better start to watch a family film or two in this festive season, som there you go! we'll see how many I get through."}, {"rating": "3", "text": "This film was alright but way to much violence. They made Benjamin way to fat."}, {"rating": "10", "text": ""}, {"rating": "7", "text": "This movie was surprisingly funny with multiple laugh out loud moments. It's fun, light hearted and uplifting."}], "recommendations": ["megamind", "despicable_me_2", "storks", "hotel_transylvania_2", "hotel_transylvania", "the_lego_movie", "minions", "monsters_vs_aliens", "puss_in_boots_the_last_wish", "captain_underpants_the_first_epic_movie", "over_the_hedge", "the_croods", "deadpool", "shazam", "the_spongebob_movie_sponge_out_of_water", "alvin_and_the_chipmunks", "goosebumps", "ice_age_the_meltdown", "hotel_transylvania_3_summer_vacation", "barnyard", "the_spongebob_squarepants_movie", "deadpool_2", "zombieland_double_tap", "minions_the_rise_of_gru", "pitch_perfect_2"]}