{
  "id": 82,
  "title": "Peter Rabbit 2: The Runaway",
  "starring": [
    "James Corden",
    "Rose Byrne"
  ],
  "runtime": 93,
  "genre": [
    "Family",
    "Comedy",
    "Adventure",
    "Animation",
    "Fantasy"
  ],
  "description": "Peter Rabbit runs away from his human family when he learns they are going to portray him in a bad light in their book. Soon, he crosses paths with an older rabbit who ropes him into a heist.",
  "releaseYear": "2021",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cycDz68DtTjJrDJ1fV8EBq2Xdpb.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The first was not to my liking, but it was enough to pass the time.This sequel isn't a disaster, but basically the entire time I was questioning the reasons for its existence.Surprisingly, the production work is very good, but the script is not fun, and what's left of the overall experience does not accumulate enough points to be considered fruitful."
    },
    {
      "rating": "4",
      "text": "Not even close to being as good as the first. It’s a very mediocre kids movie."
    },
    {
      "rating": "9",
      "text": "A lovely, clever family film to entertain children and adults alike.  It was a joy from beginning to end."
    },
    {
      "rating": "2",
      "text": "As an adorer of bunnies the first movie was OK, but the second one is so boring that the wife and I had to stop it after about 45 minutes. A waste of time."
    },
    {
      "rating": "10",
      "text": "Whimsical Animated Comedy-Adventure Film With Loads Of LaughsPeter Rabbit 2: The Runaway is a family-friendly comedy-adventure film. I loved watching whimsical animated film. It had me laughing from beginning to end. The crazy adventures of Peter and the animals are highly entertaining.In this film, the characters you loved from the first movie are back. A beautiful wedding, a new business, and a perfect life on the farm appeared to be all Peter Rabbit and his family need, but things change when a book Bea wrote about the rabbits gets an opportunity to be published.Director Will Gluck and screenwriter Patrick Burleigh bring back Peter Rabbit with a new adventure while maintaining what we love about the characters from the first movie. The talented voice-overs of Peter Rabbit (James Corben), Mopsy (Elizabeth Debicki), Flopsy (Margot Robbie), Cottontail (Aimee Horne), and Barnabas (Lennie James) bring life to the characters and laughter. Of course, a comedy-adventure is nothing without a proper soundtrack. The music by Dominic Lewis keeps up with the high-energy animal mischief and helps build emotion. Art directors Nicholas Dare and Sophie Nash create realistic computer-generated animals that could easily play the lead actors in any movie, including humans. Their personalities will have movie viewers falling in love with them and cheering their victory.Through Peter Rabbit's adventures on the farm and in the city, we learn that the importance of \"family\" is a continuous theme throughout the film. Unfortunately, Peter makes the mistake of letting the judgment of others question his character. However, the unconditional love from his siblings, cousin Bea, Thomas and the other animals helps him realize he doesn't have to be perfect to be loved. Bea and Thomas finally understand that \"family\" comes in all shapes and sizes.I rate Peter Rabbit 2: The Runaway 5 out of 5 stars and recommend it for ages 3 to 18. Adults will also enjoy sharing laughs with their families. Peter Rabbit 2: The Runaway premieres in theaters June 11, 2021 and on Amazon Prime."
    },
    {
      "rating": "10",
      "text": ""
    }
  ]
}