{
  "id": 2839,
  "title": "Peter Pan",
  "starring": [
    "Jason Isaacs",
    "Jeremy Sumpter"
  ],
  "runtime": 113,
  "genre": [
    "Adventure",
    "Fantasy",
    "Family"
  ],
  "description": "In stifling Edwardian London, Wendy Darling mesmerizes her brothers every night with bedtime tales of swordplay, swashbuckling and the fearsome Captain Hook. But the children become the heroes of an even greater story, when Peter Pan flies into their nursery one night and leads them over moonlit rooftops through a galaxy of stars and to the lush jungles of Neverland.",
  "releaseYear": "2003",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/22nWrBPvM2p4mmpLxK4Oil1Spou.jpg",
  "categories": {
    "plot": 7.75,
    "acting": 6.285714285714286,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.8,
    "funny": 5.0,
    "action": 7.333333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This film is a visual and creative triumph, sticking very closely to the original story with its beautiful music, sensational acting, assured direction, visual effects and set design. It also has lots of heart and is full of emotion.  It is a classic, that is for sure.  The best Peter Pan adaption that I have ever seen."
    },
    {
      "rating": "10",
      "text": "people should like this one. it has epic storytelling, great character development, rad visuals, and awesome music. this movie is beast!"
    },
    {
      "rating": "7",
      "text": "It has great scenes and is faithful to the original story, but there are scenes with dull    acting."
    },
    {
      "rating": "8",
      "text": "Universal Pictures, Columbia Pictures, and Revolution Studios present one of possibly the best Peter Pan movies of this generation. We don't count animated Peter Pan movies here."
    },
    {
      "rating": "6",
      "text": "Pretty good Peter Pan film with good visuals and music, okay acting and decent writing."
    },
    {
      "rating": "7",
      "text": "An incredibly wholesome and unapologetically faithful take on the original story, the 2003 live action Peter Pan was a delight to watch. It's incredibly charming, and it really made me feel like a little kid again. The whimsical special effects do take a little getting used to, but once my disbelief was suspended, I was in for the long haul. There are some scenes that drag on a little too long, and there are a few spots of sub-par acting, but the story, soundtrack, and visual feast for the eyes truly elevate this movie. This is a really good family film, and I am sure it will entertain and enlighten for years to come."
    },
    {
      "rating": "4",
      "text": "A bore, that is devoid of the charm of Disney's animated classic. The acting is unrealistic and for some reason smug. The script has incredibly stupid dialogue, and the special effects are laughable. The whole film was a waste of time in my opinion. I was young when it first came out, so I didn't think much in terms of quality. But at my current age, I wouldn't recommend it to any movie buff."
    },
    {
      "rating": "6",
      "text": "The live action version of Peter Pan isn't so bad. The actor playing Peter Pan does a nice job with the role, and the movie is somewhat magical. That being said, it didn't match the magic of the original. But then again, can anything?"
    },
    {
      "rating": "3",
      "text": "I loved the old animated movie made by Disney, and when I heard about this movie, I couldn't wait to see it, but this turned out to be awful, I absolutely hated this movie, bad acting, unlikeable characters, and boring moments, this is one you could pass on watching."
    },
    {
      "rating": "7",
      "text": "I took my 6 year old nephew to see this. He really enjoyed it. I thought it was alright. Nothing spectacular really, and nothing I will remember in 2 years time. But kids will like it. The acting wasn't too bad, but it didn't always stay true to the originals."
    },
    {
      "rating": "9",
      "text": "I loved the movie it wsa so captivating, but iI just think that it had a little more romance than I thought it would be. Its sposed to be a kids movie isn't !"
    },
    {
      "rating": "10",
      "text": "The best movie ever."
    },
    {
      "rating": "10",
      "text": "I think you should give it a 10 ,it was one of the best kids movies ever and Jeremy Sumpter is one of the sexyest people i have ever seen heshould be in heaps of movies, i think people would like to see more of him like i would."
    },
    {
      "rating": "2",
      "text": "With its god-awful acting, effects, and characters (other than Hook and Schmee), this is one awful piece of cinema. I am so sorry."
    },
    {
      "rating": "10",
      "text": "For kids it might have a little too much romance - but I'm not a child and I absolutely loved it!!!"
    },
    {
      "rating": "0",
      "text": "Even when I was a 5 year old, I thought Peter Pan was an off-focused geek and an embarassment to Disney's vast empire, this movie definently proved it. Don't watch, you'll have a better childhood."
    },
    {
      "rating": "10",
      "text": "I think this movie is amazing. I watch it about every nite. I think Jeremy sumpter is dreamy. I think he has done a wonderful job. I hope the come out with a second 1. The only think that made me rip my hair out{Hypitheticly} Was seeing wendy kiss him because i love him soo much. That made me extreamly mad and jealous."
    },
    {
      "rating": "10",
      "text": "Peter pan was a great film. I would love to try for an audition. It's a dream of mine to be in a major film for the experience being with the people, but that will never never happen. I love to act because it helps me be me. Sometimes I do skits with my friends. I hate how everyone has to blirt out that Jeremy is cute and stuff like that. Can't the just keep it to themselves like I have."
    },
    {
      "rating": "10",
      "text": "Peter Pan I think was awesome Jeremy Sumpter is so cute!!"
    },
    {
      "rating": "9",
      "text": "A perfectly thrilling incarnation of the timeless story, \"Peter Pan\". Jeremy Sumpter's portrayl of the delightfully iconic character that we know and love was mezmerizing. Howard's brillant score made us believe Neverland is truly out there and makes us want to take that magical trip beyond. This film manages to take you back to a nostolgic time when life was all about fun and taking chances. It also takes a more serious approach and allows you to take a glimpse into the psycological state of the boy who never grew up. Peter's devastating inner struggle touches you deep to the core. It reminds you that no way of life is perfect. Everybody experiences hardships and feelings of uncertainity. At the end of the day, you have to remember you matter and are tresured dearly."
    },
    {
      "rating": "0",
      "text": "Oops! Didn't mean to leave that rating! I haven't seen this movie so I'm going to give it a 0 for now, which I do not consider to be a real rating."
    },
    {
      "rating": "8",
      "text": "The greatest kids film you will ever get. Visually appealing, magnificently joyful, and drenched in heart and humor. Without enforcement, Peter Pan will make you believe in fairies."
    },
    {
      "rating": "7",
      "text": "An ok movie. Not as good as Hook. He basically has to save Wendy. Who's been abducted by Captain Hook."
    },
    {
      "rating": "7",
      "text": "----------------------------------7.4/10-----------------------------------"
    }
  ]
}