{
  "id": 3062,
  "title": "Phantom Thread",
  "starring": [
    "Daniel Day-Lewis",
    "Vicky Krieps"
  ],
  "runtime": 130,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "In 1950s London, renowned British dressmaker Reynolds Woodcock comes across Alma, a young, strong-willed woman, who soon becomes ever present in his life as his muse and lover.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hgoWjp9Sh0MI97eAMZCnIoVfgvq.jpg",
  "categories": {
    "plot": 5.17948717948718,
    "acting": 5.938775510204081,
    "ending": 4.818181818181818,
    "soundtrack": 2.6666666666666665,
    "cinematography": 7.666666666666667,
    "familyFriendly": 3.0,
    "funny": 8.2,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The film is beautifully done and is unique. It sticks in your mind long after you leave. It's funny, dark, romantic and haunting. Paul Thomas Anderson directs, writes and for the first time in a long time, handles the cinematography which he deserves a nomination for, for the sake of recognition at least. A couple of years ago, I remember watching a Q&A of PTA and cast for Inherent Vice and a woman from the audience made a comment that PTA is \"obsessed with masculinity\" which he seemed shocked by. It seems that observation has somehow challenged him to do something more feminine. So he creates a film filled with women and only 3 main characters, two being women and one being an effeminate man who works on fashion and loves his mum. Now it is safe to say the film, like Daniel Day Lewis' character, is \"obsessed with femininity\" being romantic, filled with food and surrounded by attire. Obsession is even mentioned in Q&A and interviews for this film. Not sure if the comment was merely coincidence but I still feel even though this film can be grouped with the other ones he's made about irritated and intense men (The Master, TWBB, PDL), at least it explores and surrounds itself in a cocoon of gentleness which I believe has made PTA grow as a storyteller. It's also a bit strange even though not as much as Altman's 3 Women, it still has this appealing, indelible weirdness stuck to it. Surely will be looked back on as a masterpiece. I was lucky to see the film in 70mm and it was a great watch with a great audience. I hope you have a similar experience. Thanks for reading."
    },
    {
      "rating": "10",
      "text": "A meticulously unfussy movie about some very fussy people. Wildly entertaining, deliriously unexpected, and profoundly funny. The upper crust formality, assisted by another sublime performance from Daniel Day Lewis, is subterfuge for a slowly revealed joke about the contradiction of gender, the power of love and the cost/benefits of marriage, all leading to one hell of a punchline. This movie is like a perfectly executed standup routine delivered by the world's most unassuming comedian. I'll be laughing about this one for years to come. (Special shoutout to the already classic score by Jonny Greenwood. Like the rest of the film, it smartly highlights the wily humor by never acknowledging the film is a comedy. Everything is played straight, which only makes the central joke that much more hysterical and heartfelt.)"
    },
    {
      "rating": "10",
      "text": "Anybody still remember the frog rain in Magnolia? Critics wrote at the time that audience members either “go with it” and love it or don’t and hate it. It seems to me that Phantom Thread is a more accessible film than Magnolia, but you can still have the same problem with it as with the frog rain or perhaps any Paul Thomas Anderson film. I found Phantom Thread fascinating, and the acting splendid. It’s a film about greatness (in a minor art called fashion) and obsession, which may be what you need to be great in anything. It’s also about how people choose to live their lives – or maybe it’s not really a choice. It’s a fascinating film, and I enjoyed it."
    },
    {
      "rating": "9",
      "text": "Paul Thomas Anderson adds another masterpiece to his already stellar filmography. I had the privilege of getting to see Phantom Thread in 70mm, and if you can find a 70mm screening near you, I highly recommend that you go see it in 70mm. In a year of amazing movies, Phantom Thread raises the bar. From a direction standpoint, everything is flawless. The acting is incredible, and Daniel Day Lewis and Vicky Krieps both completely disappear into their characters. The tension between the two leads is palpable, and I was on the edge of my seat the whole film. The costume design is stunning, and definitely one for the record books. Paul Thomas Anderson's script takes some huge risks that I really appreciated, and I never knew what was going to happen next. Every aspect of Phantom Thread is complex and deeply layered, and Paul Thomas Anderson truly went full Auteur for this film. This is not a film to be missed, and you'll probably have to watch it multiple times to catch all of the complexity and clues."
    },
    {
      "rating": "5",
      "text": "The second most mediocre movie nominated to this year's Oscars, right behind Call Me By Your Name."
    },
    {
      "rating": "5",
      "text": "Overrated Oscar bait. Some solid lines and all around solid performances can't save this style over substance film. I am very sad if this is the last movie that Daniel Day-Lewis does in his career. He is usually so talented at picking his projects, but the script for this film confuses and drags for far too long."
    },
    {
      "rating": "7",
      "text": "Good news and bad news. Let me get the bad out of the way first and say that I found this to be director Paul Thomas Anderson's (whom I very much admire) weakest film to date. The good news is that Daniel Day-Lewis graces us with one more elegant and wonderful performance before he retires. Lesley Manville was also quite brilliant in her supporting turn alongside him. As for the rest of the film, the score and overall design of the film is quite a treat, but the story felt a bit uneven and really started to feel more and more aimless, especially towards the end. Overall, the film itself is good, but let's face it: If there's any reason to watch this film, it's for Day-Lewis' final bow onscreen, and he certainly doesn't disappoint."
    },
    {
      "rating": "7",
      "text": "Daniel Day Lewis is so good an actor that I find him to be totally believable in almost any role he immerses himself in.  His portrayal of London dressmaker Reynolds Woodcock proves no exception. On the other hand, I found the whack ending to this movie to be far from believable, and consequently insufficient to salvage a film that is most easily labeled as a long-winded character study.The film is set is 1950’s London.  It’s time in which social rank and class snobberies are still quite in vogue.   Kudos to director Paul Thomas Anderson for his subtlety in this regard, and avoidance of a lot of overt explanations about the time, place and social class structure of the time, and leaving it to the viewer to figure out.  Woodcock is portrayed as a man who is totally self-absorbed.  His work is his life.  He demands perfection out of everyone around him.  He has zero capacity for indulging the needs or desires of others.  His clients are European high-society and royalty, but he does not socialize with them.  He has no friends; only the memory of his deceased mother to sustain him.  It’s a life that appears to be full on the surface but, in fact, is mostly empty.   It’s been reduced to a repeating cycle in which Woodcock works all hours of the day and night until he reaches the point of exhaustion.  Once he recovers, he starts the cycle over again.  The only time anyone can tell if he’s happy is when he is ordering a big breakfast.Woodcock is not homosexual, but neither is he deeply physically or emotionally attracted to women.  Instead, he is attracted to women who have a certain body type that meet his ideal standard for fitting into the dresses that he creates.   When they later fail to meet up with his social and cultural standards (such as when they make too much noise while eating), he judges them inferior and becomes bored with them.Alma is a waitress in a restaurant.  Her accent gives her away as an immigrant.  Here again, director Paul Thomas Anderson wisely avoids overtly calling attention to their different social statuses.  Woodcock is attracted to her because shape.  She’s flattered by his attention but thinks she can engage him on her terms, which succeeds only in annoying him.   Woodcock begins to lose interest and mocks her but, for reasons that are unclear, doesn’t dismiss her.   It is at this point that the movie begins to lose credibility.  What she does to him next in retaliation is beyond forgivable but, bizarrely, Woodcock interprets her actions as true love.  Beyond that, I cannot tell you more without spoiling the movie.  Suffice it to say that the ending feels entirely out of character with the rest of the movie.  To my mind, it’s vaguely reminiscent of Kathy Bates in Misery, and Isabella Rossellini in Blue Velvet."
    },
    {
      "rating": "7",
      "text": "For any cinephile, going to the theater to see the latest Daniel Day-Lewis movie is considered mandatory viewing.  The same goes for director Paul Thomas Anderson, who, like Day-Lewis, opts for quality over quantity by selectively releasing a piece of work once every 3 to 5 years.  When combined, as they've done with 'Phantom Thread' (and the second such instance following 2007's 'There Will Be Blood'), the necessity in seeing the film is given an order of magnitude greater importance.At best, 'Phantom Thread' stands to receive a polarizing reaction from viewers.  It's a fine (I'd say perhaps even exemplary) film within the drilled-down genre of \"English-set period-piece romantic dramas.\"  However, when judged from a broader perspective, the film is simply far less captivating than either Day-Lewis' or Anderson's prior work, and the rather esoteric ending leaves audience members wishing the two had dedicated their respective time and effort to another pursuit."
    },
    {
      "rating": "4",
      "text": "As I watched this weird, lumbering tale about eccentric, unlikeable characters inflicting on each other their psychological pathologies, I fell asleep twice and had to rewind for quite a while to find the last scene that looked as though I had watched it before.  I dutifully endured the seemingly interminable story of a sick romance between an insufferable twit who dresses up overprivileged but undistinguished women for a living and a ruthlessly manipulative former waitress who manages the herculean task of manifesting even more character flaws than the dressmaker whose life and career she threatens to destroy.  All the while, I was thinking, \"The critics are going to swoon over this self-consciously artsy-fartsy filmmaking bilge.\"  The story features fictional people almost as personally dysfunctional as many film critics are in real life, and the movie has all of the pretentious high-art characteristics that fascinate filmmaking students in art colleges but are lost on normal moviegoers who are simply seeking an evening of pleasant entertainment.  \"Phantom Thread\" evokes from viewers the same obligatory reaction a premiere performance of a commissioned work draws from a classical music audience on which it is inflicted: sufficient applause to avoid accusations of cretinism for failing to appreciate the finer things of life, accompanied by internal thanksgiving that it's over and that the long suffering audience will never have to experience it again."
    },
    {
      "rating": "3",
      "text": "Paul Thomas Anderson films are the kind that you either love or passionately dislike.I fall into the latter category (with the exception of The Master, which was a tightly made drama). While some of the cinematography is beautiful, the dialogue is painfully unrelatable and not written in a way that I have ever heard people speak in my lifetime. The performances hit the mark in that they achieve what PTA is going for, however  the characters are not compelling enough for you to invest your time and/or emotion in to. There is no character arc to speak of; tired old themes of mother issues are forced down your throat with no actual pay off. The story never really progresses until the final two minutes, and by that time you're left wondering why you have invested two hours of your time watching these horrible, uninteresting people."
    },
    {
      "rating": "10",
      "text": "A fairytale of a movie from the Snow White dress to the prince in his kingdom to the witch who saves him.  A fairy godmother, spells, forest, and a curse. If you love fairy tales you will love this movie!"
    },
    {
      "rating": "8",
      "text": "PTA is a fine filmmaker, but this isn't his most compelling work. The pacing and plot will get The Crown lovers frothing but I found it tedious at times. High marks, however, for usage of Greenwood's score, photography, performances and costume design."
    },
    {
      "rating": "6",
      "text": "I enjoyed the individual characters' performances in this movie (and that's what saved it for me). However, the love story itself was very slow and actually quite strange."
    },
    {
      "rating": "1",
      "text": "I expected this movie to focus more on the glamour but there was no depth to the characters, only the appearance of depth. We never learned anything significant about them, but by the end I didn't care because their actions were pointless and empty, meant to impress the inexperienced. There is nothing interesting about selfish, ignoble, infantile characters no matter how beautiful the setting or strong the acting. At least there could have been a lesson, a point made, anything. Where are the dramas we used to love? Where is the soul? This was postmodernist garbage. Lazy, unimpressive writing. The glamorization of weak and ugly personalities with no redemption or lesson and no further point but to appeal to the vanity of the audience is becoming such a turn off this will probably be the last movie I watch for a long time."
    },
    {
      "rating": "6",
      "text": "A story of a high fashion dress designer and a model he was looking for.The latest film by Paul Thomas Anderson (aka PTA), film director famous for \"Magnolia\", \"There Will Be Blood\", and many others.There is beautiful scenery here (not much of it though), gorgeous dresses, outstanding performance from leads, great casting, meticulous details.On the other hand, dragging, slow, boring plot. It is not unusual for Anderson to dive into psychics of obsessive, troubled psychopaths but this movie left me cold as stone. Too many threads are left untied.The film pretends to be artsy but rather weird. A weird film about weird people. If it is a love story, that love has to be taken into quotes.I would give this film many technical Oscar nominations but definitely not the best feature."
    },
    {
      "rating": "8",
      "text": "A gloriously staged and brilliantly acted period drama which can feel languid, overdrawn and positively painful. I did not particularly enjoy the movie, but I can appreciate its sick beauty."
    },
    {
      "rating": "9",
      "text": "I had the pleasure of experiencing this film in a empty theater with no sound to be heard I was able to just sit back and enjoy Daniel Day-Lewis just immerse himself in the theater. Credit also goes to Vicky Krieps and Leslie Manville for magnificent performances in their own right. Paul Thomas Anderson never seems to fail as he has developed a brilliant story with great scenes of dialogue that you can't take your eyes off of. Finally Jonny Greenwood's score is mesmerizing and one of the best of the year. A"
    },
    {
      "rating": "3",
      "text": "I was initially engaged and hopeful that this was going to be a good film, especially because Daniel Day Lewis was featured and the sets, landscapes and costumes were magnificent. But the film just loses tempo and breaks down due to its uninspired meandering and an utterly bizarre left turn 3/4 of the way in, which essentially yanked the film out of the genre it was in and placed it, unbelievably, in another...as if the writers just ran out of ideas as to how to conclude and just grasped at something as the clock was ticking towards a deadline."
    },
    {
      "rating": "8",
      "text": "Suffers from some awkward setup moments early on, with some strange character interactions that fall flat. Nonetheless Phantom Thread more than makes up for these defects by being a beautifully shot film with some fantastically subtle performances. Well worth a watch for having a rich aesthetic that harkens back to old Hollywood and of course, for Daniel Day Lewis's final performance."
    },
    {
      "rating": "7",
      "text": "The movie shows true love. True love beyond cliche view, strange to perception, invisible and complicated. Movie with a stunning acting. I must admit, it was boring on moments, but there is a big beautiful idea behind it."
    },
    {
      "rating": "8",
      "text": "This time PTA examines an unhealthy relationship between an artist and his muse. The whole movie is like a psychological dance between two main characters where they are exploring the boundaries and hidden desires of each other. While it is meticulously directed, beautifully shot and well acted, sometimes actions and motivations of characters left me absolutely confused."
    },
    {
      "rating": "10",
      "text": "Masterclass in directing by Paul Thomas Anderson. Best Picture of 2017 by the the best Director of the 21st century."
    },
    {
      "rating": "3",
      "text": "It is amazing to read the reviews & the difference of opinion!  We were VERY disappointed, thought the film was slow, boring, stupid and couldn't wait for it to be over.  Someone clapped in the theater at the end & I heard another say, \"they are clapping because it is finally over!\"  Woodcock & his love Elma were a very dysfunctional mismatched couple (age & temperament) & Woodcock was pretentious, self-indulgent, spoiled - actually a little crazy. Daniel Day Lewis was indeed super in his performance, along with the sets & costuming, (though we really were not impressed with HIS dress designs as a whole) all sets & scenery were well done for the time period presented.  Woodcock's sister, Cyril, was his stability & caretaker - we liked her.  I can understand the Oscar nomination for Lewis but no way, no how is this film worthy of a best picture award!"
    },
    {
      "rating": "7",
      "text": "Phantom Thread\" stars Daniel Day-Lewis and Vicky Krieps in this mysery/romance set in London in the 1950's as it delves deeply into the art of dressmaking and those who master the craft. Written and directed by Paul Thomas Anderson, the film, although shown in the super medium of 70mm and color, was, in my memory, an average black and white film. The plot is rather thin and the movie is much too long. When something is dull, even 10 minutes can seem like a lifetime so 2 hours and 20 minutes really accentuates the discomfort. Notwithstanding absolutely rave reviews from the professionals, I found this film to be an effort to watch and endure even with outstanding performances by Mr. Day-Held and Ms. Krieps. I give the film 7.0 with the \"phantom\" in the title representing the mysterious movie that was apparently seen by the critics but not by me."
    },
    {
      "rating": "2",
      "text": "I'll give it a couple of points on the look of the film.  But...  I found it boring and not at all engaging.  What a bunch of upper-crusty jerks.  Skipped from scene to scene and don't think I missed a thing.  Not worth the time and I got it for free."
    },
    {
      "rating": "1",
      "text": "Overrated and passionless, Phantom Thread is boring Oscar bait. Greenwood's soundtrack is fantastic. But the story is trite, and the characters uninteresting. Anderson's worst film to date."
    },
    {
      "rating": "4",
      "text": "Great acting.  Completely boring story.  Simply did not care about any of the characters.  I obviously didn't get it."
    },
    {
      "rating": "10",
      "text": "If Phantom Thread's only purpose was to serve as Daniel Day-Lewis's swan song, that'd be more than enough to justify its existence. Luckily, Phantom Thread manages to be much more than that. Shot with spherical lenses, Paul Thomas Anderson's film hearkens back to an era of film-making of decades past. The muted color scheme manages to draw attention to itself, though not in a gratuitous manner. It goes without saying that the film's set design and costuming is breathtakingly beautiful. That is not to say however, that Phantom Thread serves as a mere technical spectacle alone. The composition of each frame is so meticulously designed, that is starts to burrow into one's mind far after the credits roll. Day-Lewis delivers a performance for the ages, in a role that would be a lifetime achievement in acting excellence for any other actor. The role is Reynolds Woodcock, an enigmatic fashion designer whose intense attention to detail is matched only by his austere nature. Having a Freudian obsession with his deceased mother, the perennial bachelor meets Alma (Vicky Krieps), a waitress at a hotel he dines at early in the film, whom he takes  in as a model to pose for his dresses (The dresses themselves have an odd sort of aesthetic functionality to them. They elevate the wearer in a mental sense, giving them a regal authority in the way they carry themselves). Alma's presence is both welcome to the distant designer, and an intrusion of his work process. However, to simply summarize the film's plot points would do it a great disservice. Johnny Greenwood's continuing collaboration with Anderson has yet again proven fruitful. With its haunting strings, and melodic piano tones, the score is deeply immersive, and enriching. Day-Lewis doesn't take on characters, he hurtles himself at them, inhabiting their every idiosyncrasy to ludicrous detail. Anderson lets the camera roll, and Day-Lewis takes over. One imagines that Day-Lewis will be hoisting up that golden trophy come March, but it'd be an all too paltry of a recognition, given the work he's done here."
    },
    {
      "rating": "1",
      "text": "The showing I saw had a preview for the latest 50 Shades of Grey. Phantom Threads is like 50 Shades for the NPR crowd. Distasteful characters find twisted love through rudeness and brutality amidst opulent surroundings. At least 50 Shades seems to have a handsome man in it.  I rewatched the misleading preview, which contained the few romantic scenes but none of the misery. If film makers want to create such depressing pieces, at least they should warn us."
    },
    {
      "rating": "9",
      "text": "I walked into this movie having NO idea what to expect.  I was fired up when the theater person told us it was in 70MM, and boy, is it beautiful in that format. This truly is one of the best movies of the year, and that's coming from a guy who was terribly bored and disappointed by The Master. Lewis and his female lead, along with the actress who plays his sister, are incredibly good in this film. The story takes some turns that you'd never expect and that I won't spoil. Kudos to Anderson and his creative team - impeccably shot and executed."
    },
    {
      "rating": "9",
      "text": "What a beautiful film.  While this will not be everybody's cup of tea, I loved it.  Daniel Day-Lewis serves up another great performance:  a fully realized, and exceptionally bizarre, artistic dress designer.  There were so many quirky moments that cracked me up.  But I also noticed some people in the theater that did not get it.  This movie also looks so perfect.  It feels like England in the 1950s.  My wife and mother (both of whom I took to see this) were in love with the dresses.  This movie is a lock to win the Academy Award for best costumes.  The narrative goes in a direction that I did not anticipate.  But that made it fun too.  The acting is superb, as is the direction by Paul Thomas Anderson.  I am truly sorry for those who don't get it, you missed something special.  But I expect there are a number of things those folks don't get."
    },
    {
      "rating": "8",
      "text": "Daniel Day-Lewis (in reportedly his last film) plays a celebrated dressmaker in 50s London who runs his design house and his personal home with a meticulous, measured style. However, this isn't about fashion. Although that's the rarified world this film inhabits, it quickly becomes an strained and strange love story. A young woman from a different background (Vicky Krieps) becomes his muse, but their relationship turns twisted. There is a peek into the creative process and some lovely clothes, but this is much more a look at a fastidious man and the passion that disrupts his routine. Filmmaker Paul Thomas Anderson has beautifully created an elegant world and allowed the actors to underplay their best. This unique experience is quietly elegant, essentially subdued and ultimately strange."
    },
    {
      "rating": "5",
      "text": "Maybe my expectations were way too high but I was really disappointed with this movie. Not much really happened plot-wise and with a run time of over 2 hours, It's pretty difficult to sit through. I honestly busted out my phone and was web-browsing for a good 20 minutes or so of this film. There was another guy in the audience who actually fell asleep and his snores held my attention more than this film.It's such a massive waste of talent. Daniel Day-Lewis is my favourite actor of all time and to give him this kind of send-off is such a disappointment to me. Especially when he thrives off such unique, story-driven character role."
    },
    {
      "rating": "0",
      "text": "Poorly written characters, weak story-line. Boring, pretentious and a waste of 2 hours."
    },
    {
      "rating": "4",
      "text": "Despite exquisite costume design, some occasionally humorous moments, and fine performances by Daniel Day-Lewis and Lesley Manville, this exercise in pretentious self-indulgence passing itself off as audacious art is cold, unengaging and implausible virtually from the outset. This bizarre fusion of \"Fifty Shades of Grey,\" \"The Devil Wears Prada\" and \"The Beguiled\" never gels and leaves viewers wholly unsatisfied by the end of its overlong runtime. It's unfortunate that Day-Lewis chose this vehicle as the performance to cap off his otherwise-brilliant career."
    },
    {
      "rating": "6",
      "text": "Daniel Day-Lewis does an excellent acting job, as usual, and the sets and costumes are gorgeous.  That said, the movie is a study on the relationship between the fashion designer, Reynolds Woodcock, and the two women in his life.  It is generally slow moving, and all three main characters are very unpleasant - not the kind of people one would ever want to encounter.  The relationship between Cyril and Woodcock initially remains ambiguous, to the detriment of understanding the movie.  I would also agree that there is a strong and unpleasant thread of sadomasochism in the relationship between Alma and Woodcock, although there is no physical violence."
    },
    {
      "rating": "0",
      "text": "Poorly written characters, weak story-line. Boring, pretentious and a waste of 2 hours"
    },
    {
      "rating": "8",
      "text": "i love the movie from my heart its wonderful it number 5555555555555555555555555555555555555"
    },
    {
      "rating": "3",
      "text": "This film could easily be misconstrued as a comedy. The lines were so stiff and unnatural that they became humorous. There is also way too much staring. I'm pretty sure about an hour and 5 minutes of the movie could have been shaved off if the characters just stopped staring at each other and pausing before they spoke. Don't get me wrong, that can be sometimes powerful, but it was not at all utilized correctly in this film. It doesn't work when literally every character does it.The whole film is a demonstration of insanely toxic masculinity. For some reason, Vicky Krieps' character, Alma, finds this insanely attractive. It isn't until she meets Daniel Day-Lewis' character that she starts to feel good about herself. It's insanely offensive, and she is definitely no one's feminist role model. The fact that people are calling this a \"love story\" is disgusting.None of the characters were likable so I found the whole thing quite boring. It is difficult to pinpoint what parts I hated exactly, because they were all equally forgettable. Paul Thomas Anderson's characters had no personalities whatsoever. They were \"quirky\" and \"strange,\" but that's not a personality.I understand that this is supposed to be a haunting, semi-psychopathic film, but the way to really make that work is to make it as close to real-life as possible. Making it seem like it could happen in real life makes it truly scary. However, this did not seem like real life to me, because everything was just so flat. The dialogue was unnatural and disappointing.The two reasons that I'm giving this even a 3 is because the cinematography and the costume design was beautiful. I really wish that more was done with the clothing aspect. The story had so much potential, and I kept thinking of ways that the movie could have been so much better, but alas, PTA did not take that route.Overall, incredibly disappointing. Because of the poor quality of this film, I hope this isn't actually Daniel Day-Lewis' final film, for his sake."
    },
    {
      "rating": "0",
      "text": "I love Anderson, I love Day Lewis but zzzzz oh god what a snooze fest. Maybe it’s cause I find fashion so intrinsically uninteresting that when it’s on a pedestal as an art form I want to sleep..."
    },
    {
      "rating": "3",
      "text": "I'd been looking forward to this film but for me it was the prototypical critical darling that sucks. Very strange, quite boring plot. DD Lewis is great as always, but I wish he wasn't attracted to this director (I didn't like There Will Be Blood either). The plot resolution is not believable, nor did I care for the fate of the extremely unlikable characters. My wife was even disappointed with the fashion / creativity element she had anticipated enjoying. There is no background to the characters, so it is hard to know or sympathize with them. Even the soundtrack is irritating. I have seen 8 of 9 2017 best pic nominees (all but CMBYN) and this movie did not deserve to be in that class, imo."
    },
    {
      "rating": "9",
      "text": "Beautiful to watch, beautiful to listen to and the acting is superb. Phantom Thread did not go the way I expected and although it took me a while to like it, the story eventually reeled me in and I became immersed in this captivating film. Not my usual kind of movie but it's Oscar season and apparently the last you'll see Daniel Day-Lewis in a movie. He's retired again so don't all gasp at once.Daniel Day-Lewis is the renowned dress-maker Reynolds Woodcock. Living in 1950s London, his routine life takes a change when he meets his new muse, a young woman named Alma (Vicky Krieps) yet his highly organised bachelor life is soon disrupted by Alma. We've had a couple of films this year that decide to take a weird turn in the third act and Phantom Thread certainly went off in an unexpected direction. Not your typical love story. Day-Lewis does it again, giving another brilliant performance. Perfect casting, the chemistry between Day-Lewis and Vicky Krieps was exceptional. This one is definitely a slow burner so let yourselves become engrossed in the elegance of Phantom Thread. The level of care in every single shot is mesmerizing, from the cinematography, the lavish dresses and the spectacular score by Jonny Greenwood. There's no denying Day-Lewis' performance is perfect and I expect nothing less to be honest. Yet what stood out the most for me was the haunting soundtrack. Absolutely stunning, one of the best film scores in recent years and well deserving of an Oscar. Highly recommended for all you Daniel Day-Lewis/Paul Thomas Anderson fans out there."
    },
    {
      "rating": "8",
      "text": "A beautifully made, masterfully scored, gorgeously shot, and outstandingly performed new effort from one of the greats, Paul Thomas Anderson. Daniel Dey Lewis gives an excellent performance, one that would be a great last if what's been said is true."
    },
    {
      "rating": "10",
      "text": "Sent from SarahCCThe beauty resides in every intimate detail shown with restraint and generosity, fine china and cookware....as well as displays of naturally arranged flowers, black/white marble, gorgeous wallpapers, elegant silk floor length curtains, pleated flowery bedroom ones: sensual and industrial, grooming and stitching like time and fabric unfolding, the posturing and impulsivity, models holding up the back and shoulders like ballerinas, blushing cheeks, assertive tea serving and slicing of butter..the mannerly and voyeuristic way he observes and seizes.beauty. One can see how the minutes of the day tick away the same focus to detail and precision as his design and dressing, and the relief and reprieve from it requiring a collapse and relapse...I loved his dark hair, the sister’s blue eyed turning steel-like looks, the staircase with its ascensions/descensions, just enough music, just enough wallpaperthe lavender colors, the country house with simple beds and pots and pans.... Even the asparagus is beautiful!"
    },
    {
      "rating": "3",
      "text": "Phantom Thread is an extremely slow film. I couldn't wait until it finished. The movie is as confusing as Daniel Day-Lewis character in the film. There is no question that Lewis performed beautifully but the movie had too many unaswered questions so you left the theater in a limbo state. I wouldn't recommend this film. Wait till it comes to Netflick."
    },
    {
      "rating": "0",
      "text": "one of the worst film i have ever seen....simply waste of my time........................................................................................"
    },
    {
      "rating": "5",
      "text": "Overrated Oscar bait. Some solid lines and all around solid performances can't save this style over substance film."
    },
    {
      "rating": "10",
      "text": "Another masterpiece from P.T. Anderson, marred only by its slightly crazy ending, which works in its own way, but departs from the tone and texture of what preceded it. Daniel Day-Lewis delivers perhaps his most subtle (and effective) performance to date, 90 percent of which is driven by his mysterious, magnetic eyes."
    },
    {
      "rating": "3",
      "text": "I have seen all of the movies up for the Oscar best picture and they were all great....except for this one.  It's the type of movie that takes 4 years of brainwashing at film school to make you think you enjoy it.  First 30 minutes were not bad but it has about 45 minutes of good material and a lot of boring filler.  I have seen a lot of artsy movies that I have really enjoyed and wanted to like this one but I just can't."
    }
  ],
  "recommendations": [
    "youth",
    "black_swan",
    "nocturnal_animals",
    "the_favourite",
    "the_master",
    "magnolia",
    "20th_century_women",
    "carol",
    "thoroughbreds",
    "the_grand_budapest_hotel",
    "belfast",
    "spencer",
    "21_grams",
    "melancholia",
    "blue_valentine",
    "annette",
    "ammonite",
    "the_place_beyond_the_pines",
    "marriage_story",
    "roma",
    "whiplash",
    "the_light_between_oceans",
    "anna_karenina",
    "marie_antoinette",
    "the_walk"
  ]
}