{"id": 642, "title": "Phineas and Ferb: The Movie: Candace Against the Universe", "starring": ["Ashley Tisdale", "Vincent Martella"], "runtime": 84, "genre": ["Family", "Animation", "Science Fiction", "Comedy", "TV Movie"], "description": "Phineas and Ferb travel across the galaxy to rescue their older sister Candace, who has been abducted by aliens and taken to a utopia in a far-off planet, free of her pesky little brothers.", "releaseYear": "2020", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/n6hptKS7Y0ZjkYwbqKOK3jz9XAC.jpg", "categories": {"plot": 9.0, "acting": 9.0, "ending": 9.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 9.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "Perfect movie! Welcome back, Phineas and Ferb!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "9", "text": "Just an absolute beauty of a film, legitimately would've paid 30 bucks to get this early over Mulan which isn't even close to worth it. The only slight issue is some scenes looking a little choppy, but that's over once the second act begins. All the witty writing is back from the series, and so are the songs. OMG THEY ARE SO GOOD! The finale number is one of the best songs to ever come out of the show. This movie is a must see if you have a Disney plus subscription."}, {"rating": "9", "text": "felt like phineas and ferb and thats all it had to do.... however some alien flosses so it's only a 9/10 and some jokes overstayed their welcome"}, {"rating": "9", "text": "This movie is a great representation of the show. It has a good plot and interesting new characters to go with it. I highly recommend this movie to fans of the original show."}, {"rating": "10", "text": "I love this movie and it has all Phineas and Ferb elements while also not relying solely on its source material"}, {"rating": "8", "text": "I think it is a good movie for fans of phineas and ferb there are some awesome moments in the movie I watched it with my friends and they all liked it"}, {"rating": "8", "text": "First to review B) Pretty good movie, yeah.Also:If you're from 2022 please tell me this covid-19 thing is over ;-;"}, {"rating": "8", "text": "This was worth the wait, it was a very fun movie. Every Phineas and Ferb fan should watch it!"}, {"rating": "8", "text": "Phineas and Ferb the Movie: Candace Against the Universe being the second feature film in the series, is an epic comic adventure that will fill fans of the animated series with nostalgia."}], "recommendations": ["sonic_the_hedgehog_2", "ghostbusters_afterlife", "the_spongebob_squarepants_movie", "entourage", "teen_titans_go_to_the_movies", "sonic_the_hedgehog", "the_spongebob_movie_sponge_out_of_water", "tmnt", "my_little_pony_the_movie", "minions_the_rise_of_gru", "john_carter", "zombieland_double_tap", "the_mummy", "superman_ii", "sing_2", "national_treasure", "the_lego_movie", "sinbad_legend_of_the_seven_seas", "puss_in_boots_the_last_wish", "atlantis_the_lost_empire", "the_big_lebowski", "alvin_and_the_chipmunks", "venom_let_there_be_carnage", "peter_rabbit", "scoob"]}