{"id": 3618, "title": "Pineapple Express", "starring": ["Seth Rogen", "James Franco"], "runtime": 111, "genre": ["Action", "Comedy", "Crime"], "description": "A stoner and his dealer are forced to go on the run from the police after the pothead witnesses a cop commit a murder.", "releaseYear": "2008", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/6E50WjeOYjDZg9HXgPjYdGtY2jG.jpg", "categories": {"plot": 6.8, "acting": 6.111111111111111, "ending": 7.857142857142857, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.378378378378378, "action": 6.857142857142857}, "reviews": [{"rating": "10", "text": "Funniest movie I've seen in weeks, since Tropic Thunder. both equally funny movies for different reasons. Red is the sh*t!"}, {"rating": "5", "text": "There is nothing too special about this, and it isn't one of the best stoner comedies. The jokes are hit-and-miss and sometimes a bit forced, but the great cast makes it watchable."}, {"rating": "5", "text": "Besides a few funny moments, \"Pineapple Express\" is a pretty weak movie. Seth Rogen and James Franco,have done better comedies together, but when there is nothing better to watch or do, I guess you could give \"Pineapple Express\" a try..."}, {"rating": "5", "text": "The first half of this movie is hilarious. Unfortunately, it completely runs out of gas and the second half is unbelievably dull and drawn out. If it had been half its length, this could have been a very good movie."}, {"rating": "10", "text": "Good characters, easy following plot and just absolutely hilarious jokes. You just HAVE to love Seth Rogen and James Franco! I recommend this to people who enjoy stoner films."}, {"rating": "2", "text": "seriously, even high, i can't imagine that the forced interaction and humor will be more entertaining than this pathetic playoff as a substitute movie. it's kinda like the appetizer to a supper that replaces a grand meal - which, in itself, questions it's merit as a piece of cinema..... so why do people like watching this???? There are so many better stoner movies out there!"}, {"rating": "2", "text": "The movie wasn't funny... I laughed 2 times that I can recall so I gave the movie a point for every time I laughed."}, {"rating": "4", "text": "Quite a dumb movie. Acting not up to the mark and the plot seemingly boring."}, {"rating": "3", "text": "They should have called this movie \"Super Bad!\""}, {"rating": "2", "text": "Incredibly stupid and moronic, with only a few laughs--very disappointing"}, {"rating": "3", "text": "I saw this together with Step Brothers, and I am incredibly disappointed. I find it mind boggling that this is supposed to represent the best, hippest thing that Hollywood has to offer. While Pineapple Express is not as bad as Stepbrothers, it's also not good. At all. These movies are self-indulgent- they offer goofiness in place of wit and substance, and even the goofiness is uninspired. They feel like they were written in a weekend, and the non-comedy is supposed to suffice because it's this specific group of people- wow, did Seth Rogen just make a cameo in Step Brothers???!! It's all my favorite comedy stars at the same time!! Too bad none of them have anything funny to say. It's disrespectful to the audience. James Franco, the one legitimate actor in this movie, also illustrates what real actors do that some comedians- especially the comedians who have mysteriously found themselves in the Apatow pack- cannot: he imbues his character with actual feelings, and becomes the only person on screen worth caring about. I go in wanting to laugh- I root for these movies to be good, and they never, never are."}, {"rating": "0", "text": "This is the worst piece of crap ever made. The action is hard to mixed with judd apatow style comedy inspired like woody allen comedies these day."}, {"rating": "1", "text": "I left halfway through. And I have a very open mind about humor and movies in general. It was just tired and lacked anything to keep me there. How it got as good of ratings as it did is amazing."}, {"rating": "3", "text": "Silliness is to be expected of a 'stoner comedy', but this is just sloppy. While the concept has much potential, Pineapple Express never reaches it, drowning itself in a plot that's random just for the sake of being random. It's clear that this movie tries to make fun of other films in its genre. Whether it succeeds is a different question."}, {"rating": "1", "text": "This is the worst movie I have seen in several years. The occasional laughs in this movie couldn't make up for the stereotypical, thinly-sketched characters, or the ludicrous plot. I know Seth Rogen has to be laughing all the way to the bank, because this movie was complete garbage. By the way, I'm a fan of Judd Apatow and Seth Rogen."}, {"rating": "3", "text": "There were 5 very funny jokes but the rest is disconnected, unintelligent, bad slapstick. A bad rental."}, {"rating": "2", "text": "NO laughs. NO thrills or chills. Limp story. Give me Cheech & Chong any day."}, {"rating": "4", "text": "Mildly entertaining stoner movie. Full of cliches and boring. Was waiting for the laugh out moment. Never came..."}, {"rating": "0", "text": "This movie was awful. Seth Rogen can't carry a movie to save his life. He plays the same character in every movie (with the exception of The 40 Year-Old Virgin). I left work early this afternoon to see this with a buddy and I felt myself fighting off boredom & sleep as this train wreck rolled on...and on...and on. And just as a point of reference, I loved (and own) Knocked Up and Superbad. Not off the Apatow bandwagon just yet, but I'm teetering. Not sure I was ever on the Rogen bandwagon. He should be behind the camera, not in front of one."}, {"rating": "7", "text": "It started good for about the first half of the movie then it gets really stupid and generic and it loses all the things that made it good rather quickly. It was ok but still no where near as good as it could have been."}, {"rating": "10", "text": "The David Gordon Green directed \"Pineapple Express\" tells the story of Dale Denton (Rogen) and Saul Silver (Franco), two pot-smoking friends who end up becoming deeply involved with a gang ruthless drug dealers. Now, I had always heard \"Pineapple Express\" was a brilliant blend of genres, and that's what it is - a great stoner comedy that successfully blends buddy-action elements into it's story. The script was hilarious, as it's written by Seth Rogen himself and fellow successful screenwriter Evan Goldberg. The comedic elements written into said script ,although low-brow and often dark, came off as very breezy and ended up being one of the key factors of appeal for the film. Though the best part about the film, for me, was the really believable chemistry between James Franco and Seth Rogen. The two have worked together before on the cult television series \"Freaks And Geeks\", and their real-life friendship transfers very beautifully on film. Surprisingly enough, the movie also featured a sufficient amount of thrills and action - especially towards the end. Overall, I found \"Pineapple Express\" to be a delightfully funny buddy-stoner-action-comedy that brought the laughs and surprises in shovelfuls."}, {"rating": "10", "text": "THIS IS MY FAVOURITE MOVIE OF ALL TIME.\rSaul is my favourite character of all time and the final battle sequence is my sequence of all time. 10/10 would recommend."}, {"rating": "9", "text": "Just an all around, very physical, and insane movie. I am not a big fan of Seth Rogen, but I loved this movie!"}, {"rating": "9", "text": "This movie is hilarious! I really reccomend it to anyone, but anyone who likes stoner comedies in particular! Seth Rogen is a comic GOD!!!"}, {"rating": "8", "text": "From a post-modern analytical perspective, the film manages to frame the exploits of the proletariat in terms of comradeship and unbridled desire. Pineapple Express effortlessly manages to combine the mundane existence of its protagonists with a over-reaching moral message derived from the Old Testaments. A thrilling ride into the abyss of reality."}, {"rating": "8", "text": "I don't know what was up some of the critics asses rating this movie a 40 for. Of course the few critics who did give it 40's nobody either reads their magazine/newspaper or nobody knows that they exist. A full on action comedy that kept me laughing from start to finish. If you liked Superbad then you will love Pineapple express. Thug Life."}, {"rating": "10", "text": "Funniest Movie of The Year!!!!!!!!!! 10+!!!!! Awesome Character's, Awesome Writing, Awesome Comedy!!!!!!! Loved it!!!!"}, {"rating": "9", "text": "Most of the negative reviews here are from straight-edge critics who don't appreciate the looseness of the film or closet homosexuals who feel uncomfortable with the movie's hilarious homo-erotic innuendo. If you're not a stiff you'll like this film. if you're cool you'll love it."}, {"rating": "9", "text": "Non stop laughs from beggining to end, whent to the movie and got what i expected. Smoking weed and explosions."}, {"rating": "4", "text": "Very irritating to watch them include sensless violence when making a film about getting high on weed. It's as though they think weed is a dangerous gang related drug. They made is seem like cocaine with all of it's associated violence. I just watched that \"someone and mary make a porno movie\"....WHAT A PIECE OF TRASH. Can Seth Rogan act??? who's his father??? Spielberg? Grandson of Mayer??? He is a perfect example of what's wrong with the investment money in Hollywood."}, {"rating": "9", "text": "This is the funniest movie I've seen this year. Definitely a stoner movie. Watch this and I guarantee it will make you laugh the whole time!"}, {"rating": "10", "text": "This movie is in my top 5. The first time i saw this movie, I watched it 3 times in a row and laughed non-stop every time. The jokes are side splitting, the action is exciting and funny, and as a casual weed smoker; incredibly realistic script."}, {"rating": "9", "text": "Unbelievably funny! This is what would happen if Half-Baked and Diehard were cut together."}, {"rating": "6", "text": "Many will be offended, but I found this movie damn funny. Don't see it with your grandmother."}, {"rating": "5", "text": "Pineapple express doesn't know whether it wanted to be an action film or a stoner comedy. Where Cheech and Chong succeeds in its pure dedication to being ridiculous and funny, Express fails in trying to be a stoner comedy, an action flick, a buddy flick, a relationship flick and ultimately... a movie with a plot. Granted there are some funny moments but the violence that skews the tone of the film, the wandering plot, the unsympathetic characters, the scenes that don't make sense all work against anything this film has going for it. Bottom line, Rogen and Co. as writers are great with dialogue but their lack of concern (or lack of skill) with everything else movie-related is glaring. Next time they should write to their strengths and not try to pull off something their not capable of."}, {"rating": "5", "text": "Having seen and liked lots of Seth Rogan's previous work (Freaks and Geeks, Undeclared, The 40 Year Old Virgin, Knocked Up), I expected this one to more than the disconnected, rambling, goofy montage it is. It's certainly not a *bad* movie; there are several good yuks and memorable lines. But, as a whole, it was pretty disappointing. Was their test marketing group was a bunch of stoners? Even if it was, some highly enlighted viewer must have wondered what the whole girlfiend/girlfriend's family thread was about. As a buddy movie, Seth, James Franco and Danny McBride (Red) make a funny team. The final scene is one of the film's best. Had this not been a Seth Rogan/Judd Apatow collaboration, \"Pineapple Express\" would have much less than what it is. They both bring unique creative talents to this film and I hope their partnership keeps going. Despite this average effort, even a less-than-superb Apatow/Rogan project is better than 95% of the other crap in theraters these days!"}, {"rating": "8", "text": "Pretty good. Loved how they brought in Rosie Perez, and Gary Cole was overqualified for this part. James Franco steals the movie once again, and was phenomenally brilliant. Seth Rogen was good as usual, fo sho'. Danny McBride was great in his first Apatow movie."}, {"rating": "7", "text": "The crowd at the premier was just the sort to insinuate a great experience with this movie. Wild and outrageous, Pineapple Express delivers an excitable tale filled with laughs and giggles. You feel for the characters, and the development takes this movie from absurdity to laugh-out-loud comedy. It's not perfect, but the flaws are so minute that you quickly forget about them as you watch Denton and Saul move from one hilarious mishap to another."}, {"rating": "7", "text": "Needed to be about 15 minutes shorter, but otherwise very entertaining."}, {"rating": "9", "text": "Words to Frannie(Meg Ryan) in Jane Campion's unfairly maligned \"In the Cut\" is what smoking weed means to Dale Denton(Seth Rogen); these disparate labors of love are their passions. Late in the Campion film, the Virginia Woolf scholar literally goes to the lighthouse, a decontextualized lighthouse which is then appropriated for the site of the movie's climax. Relevance to this stoner flick, you ask, from the guy who graced the indie world in 2000 with his Terrence Malick-like \"George Washington\"(a meditative and lyrical film about Atlantan youth that couldn't be any more different than this Cheech-and-Chong-have-feelings-too farce)? Well, in \"Pineapple Express\", Dale ends up at a massive greenhouse of cannabis plants and wonders aloud if he's in El Dorado(which is alluded to in \"Heart of Darkness\", both \"To the Lighthouse\" and the Joseph Conrad novel are modernist texts). Like the lighthouse in the Campion film, the isolated farmhouse that harbors the drugs have a hallucinatory texture to the narrative. Both \"In the Cut\" and \"Pineapple Express\" are thrillers, and if genres have genders, a film that's steeped in action could be characterized as being male in the narrative sense. Unbeknownst to the people who green-lighted the \"Meg Ryan's Gone Wild\" vehicle that stalled both women's careers, Campion feminized the masculine storyline by rupturing the text with static talk(the dialogue-heavy scenes between Ryan and Jennifer Jason-Leigh), instead of action. \"Pineapple Express\" subverts the male narrative, too; most pointedly, in the woods, where Dale and Saul(as in the late-Saul Bellow, perhaps?) are incapacitated by their drug-induced state to do anything to advance the plot. Just like Campion(the feminist auteur from Australia who's best known for \"The Piano\"), this filmmaker isn't afraid of making narrative detours that rebels heartily against story convention, by foregrounding scenes which would be more at home in a \"chick-flick\"(Rogen, James Franco, and Danny R. McBride aren't afraid to express their feelings like women) than a violent action-thriller, mostly played for laughs. Not only is the film transgressive, but the filmmaker's inclinations, as well. Films such as the aforementioned \"George Washington\", and \"All the Real Girls\", were a breath of fresh air because they came out during a time when the bastard children of Quentin Tarantino were at their loudest and brattiest. In \"Pineapple Express\", the poetry of \"Badlands\" has been replaced by the poetry slam of the post-modernist \"Pulp Fiction\". And wouldn't you know it, Red(Danny R. McBride) has a CUT on his lip(\"In the Cut\" is slang for vagina; Dale describes the strain of pot called Pineapple Express, as God's vagina)."}, {"rating": "9", "text": "Red is possibly the greatest character since Michael Corleone and Danny McBride deserves the best supporting actor oscar more than Ledger. Would have given this a 10 if not for Bill Hader showing up at the beginning and almost ruining the movie."}, {"rating": "7", "text": "If you know nothing about this film upon entering the theater, you very likely could never imagine based on the first act how the film would go out in its final one. This is a very funny film with jokes and gags coming from every angle and all sides of the screen. The graphic violence that revs up midway through and comes to full tilt in the final portion of the film will not be enthusiastically hailed by everyone especially because this is a comedy, but stick through to the end and it all comes around. Great fun!"}, {"rating": "7", "text": "Not as good as Superbad, but still very funny, even for me and Iam not a stoner. I will definatly buy this movie when it comes out on Blu-ray."}, {"rating": "4", "text": "Disappointing. I guess i was expecting more than the movie was aver designed to be, but a drawn out very vague verging on non existent plot is its main downfall. Pair Rogan with an annoying hippie and it brings it down even further. The movie is spared further drawbacks through a few visual gags and some cheap crude humor. It has its moments but it smacks of a cheap plot and i was left wondering if had Seth Rogan not have been the face of this movie, would it have not been completely panned. I believe so."}, {"rating": "7", "text": "Some funny parts, and again, glad I rented it for $1 through RedBox. It would have gotten a lower score if James Franco wasn't so darn hot! Did you see his pecs bulging?"}, {"rating": "10", "text": "A cheerful comedy with fantastic acting."}, {"rating": "8", "text": "Anyone that doesnt find this movie funny...I feel bad for you. You should probably start smoking better weed."}, {"rating": "10", "text": "One of my favorite movies of 2008....over the top in every area: comedy, action, violence...expect a wild ride...and if you go in expecting a typical comedy you're really in for a ride."}, {"rating": "9", "text": "This, Iron Man, and The Dark Knight complete the trifecta of \"must see\" films this summer with The Pineapple Express being the easy going yet action fueled comedy extravaganza of the three (even though Iron Man had its humorous charming side). Seth Rogen once again hits the screen as the goofy lovable lead character but this time he's joined by James Franco who turns in his most entertaining performance to date as the constantly high easy-going Saul. The whole movie is chock full of gags and whether you're a stoner or not chances are (if you have a sense of humor) you'll enjoy watching these misfits make some of the silliest, most cliched decisions on earth that simply DO NOT WORK in the land of reality and being blazed simply encourages them to commit these idiotic acts. Something that DID really surprise me was the level of violence in the film, which at times is a bit excessive but usually a gag follows shortly after to eliminate the weirdness of gratuitous violence overshadowing comedy. Overall, this is a VERY enjoyable movie with an endearing quality about it, watching the two leads (both goofballs) converse and slowly become pals is poetry in motion. Highly recommended......and a warning, you may get the munchies."}, {"rating": "6", "text": "It was a pretty funny movie but it lost it's edge over time. They could have shortened it about 30 minutes and it would have been awesome."}], "recommendations": ["this_is_the_end", "deadpool_2", "deadpool", "ted_2", "identity_thief", "the_wedding_ringer", "hot_fuzz", "neighbors", "forgetting_sarah_marshall", "mortdecai", "thor_love_and_thunder", "keeping_up_with_the_joneses", "baywatch", "dinner_for_schmucks", "a_million_ways_to_die_in_the_west", "anchorman_2_the_legend_continues", "pitch_perfect_2", "the_happytime_murders", "step_brothers", "the_five_year_engagement", "spy", "rough_night", "jackass_presents_bad_grandpa", "johnny_english_reborn", "seven_psychopaths"]}