{
  "id": 2009,
  "title": "Pinocchio",
  "starring": [
    "Benjamin Evan Ainsworth",
    "Tom Hanks"
  ],
  "runtime": 105,
  "genre": [
    "Fantasy",
    "Adventure",
    "Family"
  ],
  "description": "A wooden puppet embarks on a thrilling adventure to become a real boy.",
  "releaseYear": "2022",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/g8sclIV4gj1TZqUpnL82hKOTK3B.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 1.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 1.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "As a fluent Italian I find it bewildering that some have suggested that hearing the Italian version makes a significant difference ... Benigni's constant yelling was incredibly irritating, the pacing was tortuous, and the neverending parade of pointless set-pieces made me wonder if anyone ever asked anyone else \"why?\" during any stage in the planning and editing of this film. This film is a complete and utter failure in so many ways that I was embarrassed for its set designer and cinematographer ... that their incredible work went to such a narcissistic waste of time and money."
    },
    {
      "rating": "0",
      "text": "Horrível até demais, acho que as crianças bobinhas adoraram essa peça rídicula mal feita e sem a mínima noção de carácter simplesmente um estrago para as telas."
    },
    {
      "rating": "10",
      "text": "This movie contains my favorite movie scene of all times. When the Blue fairy (Nicoletta Braschi) says : \"E vero, Medoro, il tempo non esiste\".  If I have to pick ONE movie from all movie history, I will pick this one. A great take on the Collodi original. From that point of view the Disney cartoon sucked. It was even anti-Italian. The only negative thing about Benigni's Pinocchio was the English dubbed version. Atrocious. The Italian original was simply glorious."
    },
    {
      "rating": "10",
      "text": "What is this? You gotta be kidding me!"
    },
    {
      "rating": "1",
      "text": "This is a MASSIVE SPOILER, but they did not have the money to hire a child actor to look like Pinocchio or they rushed production, but Pinocchio does not, I repeat... does not turn into a real boy!This is a crime, this is a fable, and fables cannot be altered un such way that they are destroyed, Disney had one job, and it was to grant Pinocchio's wish to become a real boy. Instead of a half-assed explanation of \"he was always real.\""
    },
    {
      "rating": "0",
      "text": "Wretchedly dubbed, wretchedly acted, featuring a little Italian nutjob."
    },
    {
      "rating": "0",
      "text": "Roberto Benigni must be stopped."
    },
    {
      "rating": "1",
      "text": "Too stupid, large and silly."
    },
    {
      "rating": "0",
      "text": "One word review: SUCKS."
    }
  ]
}