{
  "id": 187,
  "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
  "starring": [
    "Johnny Depp",
    "Orlando Bloom"
  ],
  "runtime": 143,
  "genre": [
    "Adventure",
    "Fantasy",
    "Action"
  ],
  "description": "Jack Sparrow, a freewheeling 18th-century pirate, quarrels with a rival pirate bent on pillaging Port Royal. When the governor's daughter is kidnapped, Sparrow decides to help the girl's love save her.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z8onk7LV9Mmw6zKz4hT6pzzvmvl.jpg",
  "categories": {
    "plot": 8.857142857142858,
    "acting": 8.162162162162161,
    "ending": 9.166666666666666,
    "soundtrack": 10.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 9.083333333333334,
    "action": 9.375
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I think it is a very great movie. The atmosphere with the characters, especially Sparrow, the music and the settings are great. I can watch this movie over and over again and I can recommend this movie to anyone who likes this adventure-type of action movies."
    },
    {
      "rating": "10",
      "text": "64? Why do the critics dislike this movie so much? Every single person I know who has seen this movie loves it! I mean LOVES it! All the girls say it's their favorite movie! It has everything you good want: good acting, humor, spectacular action scenes, romance, and one of the best soundtracks ever created. Not to mention Geoffrey Rush and Johnny Depp acting together! This movie is awesome. If it doesn't make you want to grab a sword and go off to sail the seas, then you're probably dead."
    },
    {
      "rating": "9",
      "text": "Wonderfully entertaining. The entire concept was portrayed just as you think it would be. Jack Sparrow is one of if not the most amusing character to grace the screen. Excellent!"
    },
    {
      "rating": "9",
      "text": "I'm writing this review after watching The Lone Ranger. I think the amount of time and dip in quality in between the first Pirates movie and The Lone Ranger really solidifies my opinion on the general decay of Hollywood. I have a limited amount of hope for Pirates 5."
    },
    {
      "rating": "9",
      "text": "The film brings and opens an eclectic version of the well known swashbuckler genre; a light-hearted, and amusing version with a hilarious Depp as the sardonic and metaphorical Jack Sparrow, and everyone else seems to be weaved into the plot. Bloom and Knightley make a poignant melodramatic piece to the film. It's authentic as it is ludicrous."
    },
    {
      "rating": "10",
      "text": "The movie itself is very good, but it is the score that brings it to life and steps it up to the next level. Everyone knows the Pirates of the Caribbean theme, and Hans Zimmer is a master at movie scores. With exciting action to witness and a great score to hum along to, you can't go wrong with this movie."
    },
    {
      "rating": "9",
      "text": "I loved it. It had dark moments, especially for a Disney movie. Plus it had extremely great humor from Johnny Depp, which added to the excitingly fun movie."
    },
    {
      "rating": "10",
      "text": "A remarkable movie that created a successful franchise while the genre of pirate movies in general was thought to be dead. Also it became the signature role for Johnny Depp (Maybe both a curse and blessing for him). It has a great cast of characters that work well together and won me over easily as I was invested in them. Then there is the engaging story which takes the best from pirate movie themes and adds the titular Curse of the Black Pearl. Finally there is the humor that works so well. The introduction scene for Johnny Depp as Captain Jack Sparrow alone is hilariously funny. Lets start at the beginning. Pirates of the Caribbean was just an attraction in Disney theme parks before and I find it impressive that the project got green-lighted as the last true pirate films Pirates and Cutthroat Island failed while there were just a few attempts in the years before. There are many individual stories or motives of the characters combined into the story. Often these collide or align. Captain Jack Sparrow wants his ship the Black Pearl back and revenge on those who mutinied. Will Turner wants to win the heart of his sweetheart and more out of live. Elisabeth Swan wants more than being what society expects from females and Captain Barbossa and his crew want something I cant spoil. I like how the story unfolds and the twist are great. All characters have relatable and believable motivations and backstories that work well too. I like how the story and characters improve each other as it is interwoven well. It gets also the sweet spot with being serious and having great humor without weakening each other. The curse spices up this movie too. Then there are the actors. I already mentioned Jack Sparrow became Johnny Depps signature role. He impressed critics and fans alike. There is nearly no one who does not have heard of Captain Jack Sparrow. Then we have Orlando Bloom as William Turner who also become a character that easily won me over. So relatable with human flaws but also good hero material. With Keira Knightly as Elizabeth Swan we got actual a strong independent woman who does not want to be chained by expectations and society. She is strong willed, capable and can fend for her own in most situations. With Captain Hector Barbossa by the great Geoffrey Rush we got a great antagonist. He is an interesting character and strong adversary. Great main cast but it ends not there as I want to praise Kevin R Mc Nally, Jack Davenport and Jonathan Pryce as much as the two comic relive pirates that appear in all 3 movies of the trilogy (Forgot their names so shame on me). It has overall an excellent cast that fully delivers. It ends not there as the special effects were amazing. It looked so good back then and holds up and I am nearly ashamed that I cant go into details because of spoilers. The sets are the same. Everything looks natural and believable form ports, ships and towns to weapons and costumes. They took great care to deliver an atmosphere that captures the audience. Of cause I must mention the soundtrack by Hans Zimmer and Klaus Badelt. Hans Zimmer is a legend and Klaus Badeld is underappreciated in the business and together they delivered a great performance that is praised and cherished by many. Overall this became a surprise hit, started a franchise that still continues and is worth watching without doubt."
    },
    {
      "rating": "10",
      "text": "it's a simple yet amazing movie. it had simple plot of ghost story based around pirate mythology with great actors, soundtrack, and cinematography. it has great charm to it that i think is missing from a lot of films like this and i think that comes from it's characters. it's my favourite disney movie and i hope future movies with replicate what made it great"
    },
    {
      "rating": "10",
      "text": "The Curse of the Black Pearl is pretty much the perfect pirate movie. Soulful performances (especially Johnny Depp) and epic action, and while it sheds epicness on every scene, it's never over bloated that it would feel confusing."
    },
    {
      "rating": "10",
      "text": "Best pirates of the Caribbean movie of all time. Loved the supernatural element they added to this movie. Captain Barbarossa was a very good villain and one of the best villain performances of this century. Also this was johnny Depp's best performance he has ever given. He was so funny random and just pure jot to watch. I swear there is nothing wrong with this movie. It's prefect in every single way. The locations are great the action scenes are fantastic and this movie is definitively one of my top ten favorite movies of all time."
    },
    {
      "rating": "10",
      "text": "Pirates of the Caribbean: The Curse of the Black Pearl is a masterpiece. Every single main cast character is played very well and is likable. Tiny Easter Eggs are used to connect it to the movie's origin, a Disney Park ride. The script is written very well, and scenes are directed almost perfectly. Character development is \"low-key\" and doesn't feel forced and the movie makes you think. I really enjoy this movie."
    },
    {
      "rating": "10",
      "text": "We are talking about an epic pirate of modern comedy. Excellent music always listened to in 2019 for the energy it provides. This movie theme is magical he did not wake up! Great effects for a bygone era. A black idea that makes you smile. Characters who rock childhood! Welcome to Caribbean Pirate!On parle d'une épopée pirate de la comédie moderne. Des musiques excellentes toujours écoutées en 2019 pour l'énergie qu'elle procure. Ce thème de film est magique il ne veilli pas ! Des effets géniaux pour une époque passé. Une idée noire qui fait sourire. Des personnages qui bercent l'enfance ! Bienvenue dans Pirate des Caraïbes !"
    },
    {
      "rating": "10",
      "text": "This may be my favorite movie of all time. The characters are funny, interesting, and acted amazingly. The story is very great also, with a new twist on classic pirate stories. The setting they created alone is worth a award, for making it feel real. I couldn't find anything wrong with it if I tried. You need to watch this if you haven't already, you won't be disappointed."
    },
    {
      "rating": "10",
      "text": "A Classic Of The 2000’sCurse Of The Black Pearl is shockingly awesome with an absolutely amazing performance from Depp, a unique story, and beautiful visual effects."
    },
    {
      "rating": "10",
      "text": "Обожаю Джони Деппа! А вы скотины, убрали из новой 6 части его! ставлю 10 из уважения к нему...и сюжету! I love Johnny Depp! And you brutes, removed from the new 6 part of it! I'll bet you 10 out of respect for him...and the plot!"
    },
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "10",
      "text": "Great movie. Hats off to gore verblinski for creating such a stunning film. Everything from the score to the set pieces and the actors are all what makes this a great movie. Not to mention the dedication the directors had when making it. Truly wort your time, a must watch."
    },
    {
      "rating": "10",
      "text": "----------------------------------9.8/10-----------------------------------"
    },
    {
      "rating": "10",
      "text": "They say the first is always the best and it certainly applies here. Pirates of the Carribean: The Curse of the Black Pearl is the start to arguably one of the best film franchises to date. If you like comedy, action, drama, romance- actually, if you like watching movies in general, you have got to see this one. I don't usually give films a solid ten (I think this is the first) but I can find no flaws here. It has a great plot, great performance by the cast, great visual effects and very memorable music. Just watch it already."
    },
    {
      "rating": "8",
      "text": "Johnny Depp brings life to this breathtaking, exhausting, amazing and action packed film with a completely funny, unpredictable performance and the supporting cast does well too. I give this film 83%."
    },
    {
      "rating": "8",
      "text": "This pirate adventure tells the story about Jack Sparrow, who meets a young woman named Elizabeth Swann after saving her life. One night, with the gold medallion she carries around her neck, she gets captured by the pirates aboard the Black Pearl by the evil Barbossa who is using her to get the cave to find the treasure. However, the whole pirate crew is immortal due to the medallion and can turn into skeletons. With the help of a young man named Will Turner, Jack and his other crew members plan to save Elizabeth and put an end to Barbossa's reign once and for all.\r Wow. I was thrilled when I caught the screening of this in July of 2003 that I have one word to say about it and the word is: FANTASTIC!!! Johnny Depp was very hilarious as Jack Sparrow and he was a very good actor. Orlando Bloom (for some reason, was in the third LOTR movie, which came out at the exact same year this movie did) did very well as Will Turner, Kiera Knightley (from King Arthur) was so cool as Elizabeth Swann and she was so freaking hot! Geoffrey Rush was very frightening, yet entertaining as Captain Barbossa and the rest of the actors did very well at their performances.\r The CGI was pretty cool and even the action scenes were so cool. The storyline was well-paced and the cinematography was great.\r There is nothing negative to say about this film, so I am in good hands.\r Pirates of the Caribbean: The Curse of the Black Pearl is an excellent Disney pirate adventure based on the popular ride from DisneyWorld and one of the best movies ever made from the early 2000s.\r 8/10"
    },
    {
      "rating": "10",
      "text": "The first real Pirates movie in history! Easily fun, exciting, and intriguing! It brings out the action in you and swordplay. Johnny Depp is truly a great actor, and Will and elizibeth make great couples."
    },
    {
      "rating": "8",
      "text": "The best Pirates movie so far. Johnny Depp is brilliant, Orlando Bloom is brilliant, Kira Knightly is brilliant.. basically all the actors and actresses are brilliant in their roles, and the story is great. You'd have to be pretty grumpy not to like this thriller of a ride!"
    },
    {
      "rating": "9",
      "text": "The first and only the best movie in the series. While enjoying some of the great performances including the plot, characters and action scenes, Johnny Depp was at his most humorous state."
    },
    {
      "rating": "10",
      "text": "Who knew turning a theme park attraction into a movie would create an awesome movie and an incredible trilogy! Thank you Disney! And thank you Johnny Depp for making Captain Jack Sparrow such an iconic character!"
    },
    {
      "rating": "9",
      "text": "A smart and dark film at the same time. Yes it is a Disney film but is very scary. i enjoyed every minute of it. Jonny Depp's  peformance is one for the ages."
    },
    {
      "rating": "9",
      "text": "The best film that could ever be made about pirates. Despite some cliches, the film has striking and brilliant action sequences, witty dialogue, and many other great characteristics that make it all its own."
    },
    {
      "rating": "8",
      "text": "I can't believe i forgot to review this saga!! I remember the first time i watched \"Pirates of the carribean\" with my dad. This is without any doubt, the best pirate movie saga yet! I personally like the other part a bit more, but overall i don't think you should miss any of the series!"
    },
    {
      "rating": "10",
      "text": "This film is a film that caught everyone off guard- no one expected a Pirate film to be this epic and amazing!  The film has a surprisingly well written and witty script, a fantastic and perfect performance by Johnny Depp, awesome action sequences, classic and awesome music (Klaus Badelt and Hans Zimmer do spectacular) and the visuals are epic.  This film has classic written all over it and is one of the best adventure films ever made, Disney rarely disappoints lads and lasses."
    },
    {
      "rating": "6",
      "text": "\"The Curse of the Black Pearl\" is a movie that focuses too much on preposterous humor. It kills the movie, but Johnny Depp's performance is the sole thing that saves the messy film."
    },
    {
      "rating": "10",
      "text": "Arg this is a pirates life for me! With unforgettable characters, a clever script, incredible action sequences, and an excellent mood, Pirates of the Caribbean is the perfect blockbuster and an incredible ride! :D"
    },
    {
      "rating": "9",
      "text": "An instant classic."
    },
    {
      "rating": "9",
      "text": "I absolutely loved this movie. Anything and everything I ever wanted in a pirate movie, all in one place.\r Excellent visuals, fantastic performances and gripping story.\r Overall:\rI can not fault this movie for anything. I have watched it countless times and will continue to watch it many times more."
    },
    {
      "rating": "10",
      "text": "Simply one of the best movies ever made!! Very suspenseful!!! Very very very very good!!! A huge well done to Gore Verbinski, his crew and all the actors of that picture."
    },
    {
      "rating": "8",
      "text": "A swashbuckling pirate adventure that's fun for all ages. While the franchise has tapered off some in recent years, Pirates is still a fine film and a great start to the franchise"
    },
    {
      "rating": "9",
      "text": "One of the most entertaining movies I've ever seen. Johnny Depp delivers his most memorable performance. It combined comedy, horror, adventure and action flawlessly. This is the only movie where I liked Keira Knightley. Orlando Bloom seemed somewhat off, though. His acting is the only thing that improved over the next two movies. Sadly, the series on a whole turned out to be a one hit wonder."
    },
    {
      "rating": "8",
      "text": "A fun tale based off a ride. Johnny Depp owns this role and is debatebly  his most known roleof all time. He is so funny and brings such a joy to the film."
    },
    {
      "rating": "9",
      "text": "I like very much how john depp plays the play of the very claver and sometimes stupid pirat who likes very much girls, action and the most of all he loves alchohol an at all he is very funny and he makes movie very funny and it i great comedy. I like very much and of this action,comedy and most at all adveanture movie becose i like very muc how the pirates in the end determined thet this girl elizabeth (keira knightley) is not a girl of a pirat and then comes a jack sparrow and will turner (orlando bloom) and jack sparrow fight with barbossa and at same time when jack sparrow shot barbossa in the hart will turner whes father was a pirat give bood to the coins and barbossa dies."
    },
    {
      "rating": "8",
      "text": "Excelente trabajo mostrando talento, originalidad y una forma de demostrar que disney puede dar accion buena y no de princesas por un man si no puede sacar y sacarle el jugo a la accion"
    },
    {
      "rating": "0",
      "text": "I'm a teenage girl, and I know most girls LOVE Pirates Of The Caribbean. Yet, I did not like this movie at all. I thought it was boring, dumb, horrible acting and WAY to long. Yes, that's what I think and I'm a teenage girl. Now, let the gasping begin."
    },
    {
      "rating": "1",
      "text": "Its stupid, its noisy, its messy, its full of terrible acting (except Depp) and silly jokes, its overrated, its catchy, its corny, and its dull; not dull enough to make it the most overhyped movie of all times, but surely dull enough to make it to at least top 10."
    },
    {
      "rating": "0",
      "text": "Awful. Johnny Depp is decent but the story's incredibly boring."
    },
    {
      "rating": "0",
      "text": "The story sucked. Not nearly as good as the first one. The characters didn't even display the same personality as in the first. Seems as if the writers rushed through writing this one. Hugely disappointing."
    },
    {
      "rating": "1",
      "text": "Cool sweet."
    },
    {
      "rating": "4",
      "text": "Poor film in many aspects, but an amazing performance by Depp, one of the best actors in the modern game."
    },
    {
      "rating": "9",
      "text": "A blockbuster in every way, The Curse of the Black Pearl is a perfect start to a massively grossing franchise that is still going, flawed but definitely enjoyable, much more than a film based on a theme park ride should have been.\rJohnny Depp creates a character that will undoubtedly be one of if not the most iconic of all his roles, Captain Jack Sparrow, don't forget the 'Captain' part, he won't like that. A man famous for us often personal and more bizarre roles has created one of the most memorable and comic characters we have seen, and to top it all off, he's a pirate.\rSet in the midst of the age of the cutlass-wielding treasure hunters, Jack lands in Port Royal where inadvertently saves the Governors daughter, Elizabeth Swan (Kiera Knightley). He somewhat befriends blacksmith Will Turner (Orlando Bloom) who sets out with him to capture the infamous Black Pearl, a ship run by the dead who have been cursed after stealing the wrong sort of treasure.\rThe set-pieces are explosive and the dialogue is a homage to the age the film is set in. There is quite a reliance on humour, which pays off in many aspects throughout the film but at other points can fall short of its target, the two high points of this being Jack Sparrow himself played uniquely by Depp, bringing his very own take and charisma to the character, and Geoffrey Rush who plays the Captain of the Black Pearl, Barbosa, whose confident and grumbled Irish accent and command of the screen, along the unfortunately limited screen time himself and Depp share together, make up very dark and witty humour throughout.\rThe heart of the film is lead by Knightley and Bloom who have a blossoming romance on the cards, their scenes can be a little dramatic for the theme of the film, and more time should have been spent getting to know these pirates more, but take the good with the bad I suppose.\rOf course the true brand of the film is that of Jack Sparrow, his mumbling and comedic quips with those surrounding him are electrifying through the talent of Depp, and while the supporting cast are on sound form, he truly steals the show, along with quite the satisfying finale that of course opened all sorts of doors. The film is quite remarkable in the sense of its emergence from nothing, but I suppose if Ron Howard takes inspiration from paintings, a theme park ride is bound to be a creative playground."
    },
    {
      "rating": "9",
      "text": "The first film in the series is unquestionably the best. Jack Sparrow is an excellent character, and really carries the movie. It reminds me of the old Marx Brothers films: if not for Groucho, Chico, and Harpo, they would be bland and nobody would care, but thanks to Jack Sparrow  who seems to incorporate the best elements of all three  the movie ends up fantastically entertaining. Will Turner may be the protagonist by any helpful analysis of story structure, but Jack is the reason you're watching, and he's well worth it.\r The Curse of the Black Pearl has a solid, familiar-yet-surprising story at its heart, that never loses sight of where it's going next. This is part of what makes it good: you can guess roughly where it's going next, and have your expectations confirmed, but there's always some surprise complication waiting for you when you get there, so you're never bored. One of the best Disney movies of the 2000s, and well worth seeing by anyone."
    },
    {
      "rating": "6",
      "text": "Pirates sets sail with a witty plot.\rPirates of the Caribbean succeeds with great acting from the likes of Johnny Depp who brings his character an irreplaceable flare. The movie never falls flat but never becomes great with an average plot."
    },
    {
      "rating": "8",
      "text": "I'm not a fan of pirate movies, but I got to admit it... this one did 'pirate' enough to say \"Arr!\" and basically the best in the Pirates of the Caribbean franchise."
    }
  ]
}