{
  "id": 610,
  "title": "Pirates of the Caribbean: Dead Men Tell No Tales",
  "starring": [
    "Johnny Depp",
    "Javier Bardem"
  ],
  "runtime": 128,
  "genre": [
    "Adventure",
    "Action",
    "Fantasy"
  ],
  "description": "Thrust into an all-new adventure, a down-on-his-luck Capt. Jack Sparrow feels the winds of ill-fortune blowing even more strongly when deadly ghost sailors led by his old nemesis, the evil Capt. Salazar, escape from the Devil's Triangle. Jack's only hope of survival lies in seeking out the legendary Trident of Poseidon, but to find it, he must forge an uneasy alliance with a brilliant and beautiful astronomer and a headstrong young man in the British navy.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qwoGfcg6YUS55nUweKGujHE54Wy.jpg",
  "categories": {
    "plot": 3.65625,
    "acting": 3.7222222222222223,
    "ending": 3.5625,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 4.230769230769231,
    "funny": 3.793103448275862,
    "action": 3.888888888888889
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Dead Men Tell No Tales is easily the best \"Pirates\" sequel yet. It might be the fifth film in the franchise but it just feels so fresh. It brings back everything we love about the series and also some new faces and characters that I would love to see more of, if they decide to make a sixth film."
    },
    {
      "rating": "0",
      "text": "So I just watched this movie and boy I m so disappointed with this part *the first problem here is the past of the compass as how jack got it is totally different from part 2 of the series which shows writer doesn't know anything about this movie and he just writes any **** he comes up with to keep milking money from peoples in the name of pirates of Caribbeans franchise *the 2nd problem is jack sparrow himself, oh my my he is the most useless person after monkey in this part he is just running around getting captured and after that someone helps him and cycle repeats not even a single fight scene where I can say yeah that's why I love this series *the 3rd problem is Plotholes:- man I dont have any words on just how far this franshise falls, and 4th problem is I just can't connect with plots here, Haha and the most useless, selfish crew I ever saw in this series and this part contains more problems but I cant state them without spoiling you, Also I just don't understand how this part got 6.2 user score well I guess some fans are brainless as well as blind, just dont support this kind of **** movies just because it got your beloved series name, thx."
    },
    {
      "rating": "2",
      "text": "Dead Men Tell no Tales - Dead franchises tell tales no one is interested in. The last Pirates movie actually benefited from adapting to a well-known story, this one is a messy affair which is further hindered by dreadful performances, most troubling of all being that of Johnny Depp. There comes a time when a beloved character needs to be put out to pasture but because this series is such a money-spinner, the over-saturation may well continue for decades to come."
    },
    {
      "rating": "4",
      "text": "This movie is a disappointment.  The final act is an improvement over the first two acts so I think that's influencing the ratings.  However, taken as a whole, IMHO, this movie is bad.  The first act is actually pretty terrible.  The plot is dumb and the humor is over-the-top slapstick type humor.  No one in our movie theater even laughed and it was a packed theater.  Not good.  The plot gets better as the movie goes on.  However, you have to sit through a lot of nonsense to get to that portion of the movie.  The movie feels very long.  This one's a dud; don't waste your money."
    },
    {
      "rating": "6",
      "text": "Not the franchise's best, best definitely not the worst. Even at it's worst, it was better than At World's End, and it was miles above On Stranger Tides. But still, not as good as Curse of the Black Pearl or Dead Man's Chest."
    },
    {
      "rating": "9",
      "text": "Good as Stranger's Tides. It was funny when Paul McCartney made a cameo. Very entertaining, fun and mindless. Looking forward to see another one."
    },
    {
      "rating": "7",
      "text": "The fifth in the franchise is actually one of the better ones. While it is a little overstuffed, you find yourself at least caring about the story. An enjoyable time. B"
    },
    {
      "rating": "5",
      "text": "High expectations = high disappointment. I am sorry but Barbosa's death was not emotional to me! That \"tatoo\" on his hand is USELESS and pathetic since it appears SECONDS before his death. Also - where the f was Will? He could've helped. And its pity that they never met with Jack. However i liked \"Salazar\" as a villian but still - if they could escape from the triangle whenever Jack betrays his compass, he did it many times before so... and by the way Paul's scene was such a marketing move. At least, he deserved a better joke than that. The \"witch girl\" should've been Davy Jones' daughter... makes more sense. Whatever. A decent movie. Such a shame."
    },
    {
      "rating": "3",
      "text": "Note: I really like the first four movies.This movie is missing what made the previous ones great: somewhat complex plots where different characters interact, each with a different motivation. Jack usually interweaves between these motivations with cleverness, negotiation, and some planning. However, In this movie there was no complex plot, the plot didn't make much sense (and contradicted some of the things implied or stated in previous movies), and everyone except the evil antagonist ended up wanting the same object (and to use that object in exactly the same way, making them all allies against the antagonist). Jack has always had scenes where he cleverly plans an escape or series of actions (often surprising bystanders with his ingenuity), but there were no such scenes in this one. Jack sometimes did things that were inexplicable, but these actions were never proven to be particularly intelligent. (Possibly it was meant to be humourous?) Jack spent almost the entire movie imprisoned, tied up, or being chased - unlike other movies, Jack spent almost no time leading anyone anywhere (whether directly as Captain or indirectly as adviser/selective informer).I found the antagonist to be distasteful. He seemed to be on a murderous rampage, not caring who got in his way. The story suggests he got a really powerful ship (before being cursed), but it didn't make sense to me. Several ships attacking his all at once should have left a dent, but didn't. The antagonist and his ship, crew, and animals that just happened to be in the area are all cursed for entering an area - but whenever anyone else enters that same area, no curse is applied. After the curse, his ship had strange abilities that make you wonder why these \"curses\" are always such blessings if you want to be the perfect murdering machines (their abilities were more powerful and varied even than Davy Jones's!) Whereas Blackbeard valued little life other than his own, this captain seems to be thrilled at the idea of killing anyone he deems his enemy (with what I perceive to be inconsistent morals).There were no significant twists in the plot - it told you almost everything that was going to happen near the beginning; the rest just followed through. The plot revisited William Turner, and showed a number of things about his condition that don't add up with what the previous movies implied. What happened to Will's father? Didn't William have a job to do, that - if he fulfilled it - he wouldn't have any fish-corrosion on him (as Davy Jones did)? In the beginning, isn't William in command of the Dutchman - so why did he act like the crew was going to do some evil thing to William's son (who was visiting)?Minor notes:-I saw it in 3D, but found that the 3D didn't add anything to it.-The music was fine; they managed to keep the same type of music while varying it enough from previous movies to be pleasant to listen to.-A lot of the characters from the previous movies didn't show up in this one (and Angelica was implied to be involved in future movies based on the ending of the 4th, but wasn't).-I didn't care for most of the ending (too much death for my liking).Overall, the scenes didn't make much sense and very little of it was enjoyable. The beginning few scenes were fun, but they failed to introduce the elements needed to make it a good movie. As one who very much enjoyed the previous four films, I do not recommend watching this one."
    },
    {
      "rating": "4",
      "text": "You can do better than this, f*cktards.This film does a couple needed things and f*cks them up immediately. For example Jack Sparrow is more of a supporting character this time like in the first movie which is a good call. The problem is that he's a dumbass in this film. Not only is Johnny Depp's portrayal of him pretty much a parody of a parody in this movie, but the character is just a drunken retard. He's no more interesting or charismatic, he's just a random comedic relief for the most part with terrible forced comedy. Although he still looks cool. The makeup, the clothes and the hair are always going to look good on him.Most of the characters here are pretty bland. The main actors Kaya Scodelario and Brenton Thwaites give alright performances, but unfortunately they don't have that much chemistry together and their motivations aren't that interesting. I never really felt invested in their characters or the story. The only truly interesting character in the film is the antagonist Armando Salazar, portrayed by Javier Bardem. He was excellent except when the film forced some stupid humor on his dialogue.Speaking of the humor, it's dogsh*t. The humor ruins everything. It's just randomly forced in to the scenes for no reason. In the other films, especially the first one, the humor blended well in to the events of the scene and a lot of times the actors were able to make a scene funny even without it being the main point. But in this film all these lame unfunny things are just forced in to the scene in the most awkward way possible where they're literally rubbing it to your goddamn face and screaming \"LAUGH YOU F*CKING C*NT\". It's so bad that it just ruins any investment that you might've had for the scene earlier.It's a shame really. There's definitely potential for this to be good. The antagonist is good, the main characters Henry Turner and Carina Smyth are decent and the movie looks really nice and has some alright action. But it's all absolutely ruined by the lack of an interesting story that's worth to tell and the tosh cum humor that's forced in so obviously that I was just angry with it instead of, you know, f*cking laughing like humor is supposed to have you do."
    },
    {
      "rating": "2",
      "text": "i dislike attractive women getting hired for big new movies all the time..ifeel like the inequality that emma watson talks about in her industry is really just because she cant see that the problem is that women are so readily associated w/ sex and there are so many attractive women (who arnt hired or something and that bothers her..."
    },
    {
      "rating": "4",
      "text": "\"Dead Men Tell No Tales\" is the fifth installment in this exhausted franchise that should have sunk 10 years ago.Remember how grand and epic these movies were, but with the unfinished effects, predicable scenes, and over rushed storyline, it looses the magic. You just wish that Javier Bardem character would just impale Captain Jar Jar Binks with his sword and be down with it. I was rooting for the villain through the whole thing.**** Jack Sparrow!"
    },
    {
      "rating": "7",
      "text": "It was a fun movie, but that's it, other than that it felt just like a remake of the old ones - it brought nothing new to it and it was worse than previous ones, so yeah, not what I hoped for, but what can you do"
    },
    {
      "rating": "6",
      "text": "The fifth instalment of the swashbuckling franchise has its moments, but nothing more. Dead Men Tell No Tales, in a good way on many occasions, is more of a conglomeration of nostalgia infused scenes than a fully fledged movie. Whilst it is great to have the original characters back and on form, the new additions drag the film back from start to finish. The magic of the series has truly faded."
    },
    {
      "rating": "2",
      "text": "One of the worst movies of the year. The performances from the actors are so poor they all just come across as really dislikable, even the iconic characters. The plot is so cliche and boring that I could have easily fell asleep during this movie, and don't even get me started on the villain. The villain is so cliche and predictable that it feel when as if he's just an animatronic on the actual Pirates of the Carribbean ride. Why does this franchise even exist- it's one of the worst ones of this decade."
    },
    {
      "rating": "3",
      "text": "While cast is still giving them best to live up classic characters and a new direction is arriving to the saga, (offering a new and fast-paced storytelling), Pirates of the Caribbean: Dead Men Tell no Tales is just another conformist and cliched sequel."
    },
    {
      "rating": "3",
      "text": "Crap movie, doesn't add much to the series sadly. Everything is soo over exacturated in hopes that it would woo the crowd. just made me cold and the film relied too much on special effects which fell a little short for me. you dont need to see this."
    },
    {
      "rating": "1",
      "text": "After viewing of Dead Men Tell No Tales I have understood that On Stranger Tides were also not it and bad continuation of original history. In a new part there is no nothing left good from the orinigalny trilogy except the excellent game Johnny Depp. And one actor can't save the movie even if it is the blockbuster. New actors don't cope with the roles, and creators as understood it and have returned also old. The main antagonist - the most boring villain in movies for the last few years. He has neither charisma, nor motives. Why he in general is necessary in the movie? What purposes at him? And the ending is so banal that it seems that the movie obviously for audience of children up to 7-8 years. If Dead Men Tell No Tales restart of a franchise from Disney, then Pirates of the Caribbean have died."
    },
    {
      "rating": "2",
      "text": "Ever since the Pirates of the Caribbean Ride opened in Disneyland, the producers pitched the idea of adapting the ride into a fantastic action-packed movie entitled Pirates of the Caribbean: The Curse of the Black Pearl, and four sequels following the significant characters. The characters include the witty pirate Captain Jack Sparrow (Johnny Depp), his friends, and crew members on The Black Pearl; the ship based on the original film. The franchise was lucky at the box office, with Dead Men Tell No Tales garnering over $794 million worldwide. Unfortunately, the reviews of their movies started to drown, and this film is no exception.Whether people enjoy viewing movies about action, pirates, or comedy, the fifth installment in the Pirates of the Caribbean franchise will disappoint audience members at the movie theater. Not only does the film define what the franchise should not be, but also gives the viewers a clear perspective on every flaw in the sequels. Although the sequel was a summer blockbuster, the majority of audience members left the theater seasick.During the evolution of the franchise, the various writers transform Captain Jack Sparrow from an intelligent, witty pirate captain to a drunken, comedic caricature of himself. Throughout several scenes in the movie, Sparrow turns to rum as a source of happiness. Unfortunately, the writer depicts Sparrow's addiction in a lousy way. For example, after the poignant scene of Sparrow’s crew abandoning him on the Dying Gull; an old ship that the team of the Black Pearl now possess, Sparrow scavenges for rum in the village. When Sparrow finally finds rum, he gives up his most valuable possession, a compass that points to someone’s desire. After these few moments, Sparrow is tipsy throughout the entire duration of the movie, especially in the beginning acts.In addition to Captain Jack Sparrow’s character alter, Johnny Depp will not satisfy the audience with his performance of Sparrow. Since the 2003 original film, Depp has gained worldwide attention of acting as Sparrow. In the case of Dead Men Tell No Tales, though, the entire world seemed to lose interest because of Depp’s final performance as Sparrow. Depp’s performance leads to fans and viewers commenting online about his retirement saving the franchise. After four consecutive blockbuster sequels, Depp’s performance in Dead Men Tell No Tales foreshadows an empty stretch of water ahead for the franchise to cover.Though it had a massive production budget, the film proves that nothing will save this movie from drowning. The movie will not fulfill anyone’s expectation of a great movie because it entirely changes Captain Jack Sparrow’s character. Besides, the plotlines are similar to the other sequels of the franchise. Either way, Dead Men Tell No Tales, is a merchandising film and will neither entertain fans nor everyday moviegoers."
    },
    {
      "rating": "3",
      "text": "It felt like an attempt at just wringing out more money out of the franchise by throwing together a cast of proven together characters but not really trying anything new. The Storyline wasn't any good at all."
    },
    {
      "rating": "4",
      "text": "While kinda funny, the new Pirates of the Caribbean movie just rehashes every plot point from the original films. It has enough silly humor and action to make it enjoyable but story wise - it's kinda bland. The new villain was fun and Johnny Depp was the same stupid funny guy, but it was a rehashing of a not so great formula. In the end, Pirates of the Caribbean: Dead Men Tell No Tales is a fun and stupid movie but bland and cliched story make it less than an average film."
    },
    {
      "rating": "3",
      "text": "A very disappointing film. The excitement was there from the announcement of Pirates 5: Dead Mean Tell No Tales. That was until I saw the trailers released for the movie. Something was wrong with Jack Sparrow? This wasn't the same great pirate captain that's graced our screens for the first 4 movies. It's as if he'd had a stroke after stranger tides, he's lost some of his accent, has turned into more of an alcoholic than ever(we know he loves rum but come on!) It's like he's a different pirate all together. It's as if Disney have tried to reboot the franchise by starting over but have ruined it completely. Similar love story to Will and Elizabeth in Curse of The Black Pearl but different-ish origins for Henry and Carina. Henry has a father, like Elizabeth did whereas Carina doesn't, like Will but it turns out her father is a pirate like will found out about his father. Salazar is a nice touch to the film but a desperately thought up ''villain'' as you will to continue a story arc with so much potential. So for Salazar to be free, Jack had to give the compass away for the Devils Triangle to crumble. Where as in previous films he had given it away and nothing happened. The Trident of Poseidon was never mentioned at the end of Stranger Tides but the fountain of youth was mentioned at the end of Worlds End. The only real thing that stayed true to the 4 original films was the crew of the Black Pearl, as they've not changed. They're funny, and really go together well with the scenes they're put in. Originally Pirates of The Caribbean was meant to be about Jack Sparrow. But with the first 3 movies he got lost in the real main story that was Elizabeth and Will. Stranger Tides was a nice touch to actually see a Jack Sparrow solo film with Barbosa and familiar pirate company. There is no follow up to Stranger Tides and It's been about 20 years in the film timeline. Jack hasn't aged a day. He didn't even get to use the fountain of youth so they need to explain that one. The story arc they gave Barbosa wasn't too bad but again so many plot holes, especially from the moment he eyes the journal and says he's seen it before. You immediately get alarm bells that Carina is his daughter..... I'm being generous giving it a 3. Disney why have you ruined this franchise!!! Don't go and watch it, you'll waste your money. Might be something for the 'new' generation of kids. But if you're a true fan of the franchise, you'll know that this film is awful. It sucks and it's a massive insult to the previous 4 films. I don't know whether Johnny Depp has lost the ability to play Jack Sparrow, but that's definitely not the Pirate we remember."
    },
    {
      "rating": "4",
      "text": "I feel like this movie could have been great, but the directors just slapped something together. It has its moments, but there is an uneven plot throughout. Jack is drunk for half of it, which has never been his character type before, worst of all it wasnt even funny, it was just annoying. The lead up to the big finale is rushed, its almost as if the film makers were rushing it towards the end. Javier Bardems performance is the films saving grace, he brings a fresh face to the film, and a eerily creepy character. Overall this film is disappointing, but with some high points. If you're a fan of the franchise by all means go and see it, but go with an open mind, and the knowledge that you will almost certainly be disappointed."
    },
    {
      "rating": "3",
      "text": "No 'Pirates of the Caribbean'-feeling at all.Too many vanilla jokes, especially in the early movie, instead of the usual beloved 'outsmarted' dialogues from Jack and dumb situations/moves.The story is superficial, the majority feels pretty irrelevant, the climax super artificially dramatic and the ending boringly(/awkward->even my gf said this) soppy. The structure remembers me of typical Disney-Princess-movies.If this movie wasn't Pirates of the Caribbean, and you'd expect an okayish pirate movie with alternating comedy and adventure sequences, you'll be satisfied.But for a Pirates of the Caribbean-movie, it's disappointing"
    },
    {
      "rating": "1",
      "text": "A total shipwreck. Towards the end, I lost track of what was happening and man, I never want to see this again. Javier Bardem is the saving grace of the film; everything else is total crap."
    },
    {
      "rating": "4",
      "text": "Loved all the other pirates of the caribbean movies, I rate them all a lot higher. This one had an extremely jumbled story. It felt like Johnny Depp forgot how to play the character. There was a lot of bad acting, forced lines, and long exposition. Really wish I would have rented this instead of seen in the theater."
    },
    {
      "rating": "4",
      "text": "This movie put all of it's funny jokes into the trailer, and the CGI could be from the the 1998 Godzilla movie. The younger version of Jack Sparrow looks nothing like Johnny Depp, and the movie is possibly the worst of all the Pirates movies. They snuck in very sensual references, and spent what felt like an hour referring to Carina Smyth as a horologist, with another pirate calling his mother a horologist. This movie tried to be funny, using humor that 12 year olds tell each other on the school bus. The only good thing about this movie was johnny depp's performance."
    },
    {
      "rating": "3",
      "text": "The new characters were so bad (carina's character is so stereotyped) and introduced in such a bad way (salazar just comes outta nowhere) that I would have much preferred if they actually turned over a new leaf with this episode rather than keep on grinding the old ones. The quest itself is just so disproportionate, looking for such an overpowered item that makes the quests of the previous films look so ridiculous and useless."
    },
    {
      "rating": "2",
      "text": "боже это худший и нелепейший фильм из серии пиратов, не в коем случае не тратьте на этот ужас деньги, от сюжета фильма, его бреда и клишейных шутачек у вас взорвется бошка и вы прост не досмотрите."
    },
    {
      "rating": "5",
      "text": "\"Пираты Карибского моря: Мертвецы не рассказывают сказки\" - очень слабый фильм. Куча несостыковок с прошлыми фильмами, переигрывающий Джонни Депп, бредовый сюжет, неинтересные персонажи и злодей.... я промолчу. Зато это веселый и лёгкий фильм (не как 4 часть)."
    },
    {
      "rating": "4",
      "text": "Here we go again, Disney can't stop making them. I understand that the previous one made a lot of money - but that doesn't mean that you should stop giving a **** about the **** characters and original films! **** THIS MOVIE HAS SO MANY PLOT HOLES!! Why does Jack receive his compass from a captain of a ship IF IT'S CLEARLY STATED IN THE SECOND ONE THAT TIA DALMA GAVE IT TO HIM? If the Poseidon's trident breaks all curses, how is Will Turner alive WITHOUT HIS GOD DAMNED HEART?? IT'S LOCKED IN A CHEST!!! There are many more, I can complain all day. The characters of Will Turner and Elizabeth Swann are replaced with their really bad proteges and Depp seems to have lost the spark that made him so likable in the older movies. I am very disappointed and hopeful that this franchise would die with a poor box office performance."
    },
    {
      "rating": "4",
      "text": "This movie is so meh that I forgot to post a review.I will come forward and say I am still a fan of the series. I will still probably go see the next movie, if they have one. Also, while this is a very middle of the road type movie, it is still way better than the last couple of installments have been. The writing is better, the direction seems better, and the story is not so random, well there is some randomness but its a Pirates of the Caribbean movie so that is expected.There really isn't a lot of negative about the movie per se. The only thing really cringeworthy was the CGI younger characters. Just didn't quite work for me, but I don't know if that is because the CGI sucks, or if I am just seeing things differently then others due to colorblindness (sometimes that throws things off). The story itself wasn't bad in most parts, a bit predictable but nothing to be shocked about.However, I am really tired of zombie or other forms of undead pirates. Seriously, couldn't they have come up with a villain that wasn't undead? Even on the top of my head you could pick up some sort of fairy/elven type thing. Call them Atlantean and maybe Jack screwed them over in the past. Hell, I would take werewolf pirates just to make it different. I did appreciate the Cthulhu nature of Davy Jones, but that wasn't enough for me.They could also avoid the whole paranormal creature hunting him and why not a human wizard, or the Catholic church with some mysticism (full disclosure I was raised Catholic so no I don't think they are Satanists and thats why they should be villains). There is plenty of options that don't involve the same undead CGI.However, like I said I would go see the next installment. Oh, and there is a stinger in mid and end credits so you won't waste your time too much if you wait for it.The good: Wrapped up some earlier plotlines... sort of.The bad: Nothing was bad really, just sort of blah."
    },
    {
      "rating": "4",
      "text": "Although some of the action is spectacularly exciting, this fifth instalment feels tired, disjointed and messy, and even Johnny Depp's campy performance is losing its wit and humour."
    },
    {
      "rating": "5",
      "text": "Overall pirates of the caribbean dead men tell no tales has some good elements how ever it feels very tired and the new cast members feel forced together."
    },
    {
      "rating": "5",
      "text": "Pirates of the Caribbean: Dead man tells no tales is an extremely corny movie that is clearly meant for a very young audience. If you can move past that, the movie itself does keep you mildly entertained with a weak plot that keeps moving the story forward with no real dead spots. Your typical \"find the special item that solves all the problems\" with some minor emotional stuff thrown in at the end."
    },
    {
      "rating": "0",
      "text": "I didn't like it.  It wasn't funny, it wasn't exciting.  It was cliched so much more than anything I've ever seen.  I don't think they actually had a writer, rather I think they just filmed random garbage and slung it together.  Unless you're obsessed with Depp (is anyone these days?) then I'd avoid this like the plague."
    },
    {
      "rating": "7",
      "text": "I love pirate films, so seeing yet another Pirates of the Caribbean was a no-brainer. Dead Men marks the fifth entry in the series, already past the point at which any series that's lasted that long often begins to come apart at the seams, though that isn't the case here. The franchise zombie was Stranger Tides- Dead Men is a better movie overall, injecting fresh blood in the form of new leading characters. Javier Bardem delights with his talent for portraying genuinely creepy villains, and the visual effects and orchestral score once again impress in a series known for such. The series trademark mixture of swashbuckling and the supernatural is in full force here, though I think they could have done a lot more with Salazar and his ghost crew, especially when you compare them to Davy Jones and his sea-draugr. The artifact of the day also gets very little screen time and, considering who it belongs to, a token appearance by its owner would have been pretty amazing. Geoffrey Rush once again portrays the conflicted and extra sea-salty Hector Barbossa, who finally gets his moment in the sun. The weakest link in this film is actually Johnny Depp- I don't know if it's him or how they wrote Jack, but he might as well not have been in the film at all. He spends most of it in a drunken stupor and were it not for Salazar's single-minded vengeance against him, many of the characters might well have avoided hassle of the undead variety."
    },
    {
      "rating": "7",
      "text": "No, it's not the 4/10. It's honest 7/10.It's not even near the first movie. And even not on the par of the second one.But it's fun enjoyable and lighthearted, it perfectly watchable if you don't expect much from it.My biggest issue with this movie is Jack Sparrow. He always was goofy and strange but still witty and smart and wins in the end _by design_.Here he's just goofy and wins by pure luck. His wit is gone with the huge part of the charm."
    },
    {
      "rating": "8",
      "text": "This is easily the best sequel of Pirates and now that they're on the right track i hope for another movie which i would not have said after watching the second, third or fourth movie."
    },
    {
      "rating": "10",
      "text": "Is this the real life?How can anyone really vote this movie with 0/100 as a \"professional\" Reviewer?This movie is far away from being bad.Yes, it is not perfect, but still great a great Popcorn Movie, great scenes and even if you dont like Depp, thise role just fits him perfectley."
    },
    {
      "rating": "2",
      "text": "A truly terrible film from beginning to end with so many plot-holes and contradictions to the franchise's history that it'll make you wonder if the writer's had seen any of the previous film beforehand. Johnny Depp has finally lost the character of Jack Sparrow, overdoing him at every turn and lending nothing to the story except poorly done comedic relief. Never has Jack Sparrow been so useless, so overly drunk and devoid of any cleverness. The humor picks at all the extremely low-hanging fruit. Even the atmosphere throughout is off, the inability to create tension as obvious as Carina's contrite lineage.At one point, a shark literally jumps over a boat (an inversion of \"jumping the shark\" geddit? har har) as if the filmmakers were winking at the moviegoers. They were saying \"we know how bad of a movie we've made, but we've still got your money.\"Unfortunately, this is true. And I paid full price."
    },
    {
      "rating": "2",
      "text": "With the \"final chapter\" marketing and absolute mediocrity of this film, the Pirates of the Caribbean franchise seemingly has come to an end, although not a very fitting one. Fanboys of the Pirates franchise will find some enjoyment out of this film, but for the rest of us, it's almost a complete mess. First off, the plot is wildly redundant to the predecessors in a lame attempt to recapture the glory of the earlier films. It features Jack alongside a young girl and guy (not to be confused with Will Turner and Elizabeth Swann) on a mission while being hunted by the undead (again). While the acting by the recurring actors and new ones is solid, the characters are not. It was quite sad seeing Jack Sparrow devolve into a drunken idiot from a cunning funny pirate in the first three films, while the new characters were forgettable. The producers and directors seemed to have lost touch with what makes Jack great. Secondly, the action is not nearly as engaging, with a lot of the set pieces seemingly pulled from other non-pirates movies. Lastly, the film is far too long and not fun enough. Although it has a few nice moments, Dead Men Tell No Tales is a tale that should not have been told."
    },
    {
      "rating": "3",
      "text": "Pirates 5 overstays its welcome with boring, vapid new characters, removes charm from the old ones, a spoonfeeding screenplay and annoyingly repetitive music. Everything still looks pretty cool, though."
    },
    {
      "rating": "0",
      "text": "It's more of the same, it's not funny anymore, and very boring in some scenes, I just was waiting to finish the movie and get out the from the cinema."
    },
    {
      "rating": "5",
      "text": "These LIVE filmmakers didn't tell a very good tale either (see the title). The plot involves the son of Orlando Bloom's character as he searches for the Trident of Poseidon, which will reverse all nautical curses. Toss in a villain with an underwater special effects visage (Javier Bardem) and the star (Johnny Depp) reviving the eccentric role that's simply gone stale. There's way too much plot discussion, while most of the fights and chases are uninspired. Despite some cool visuals, there's none of the inventiveness of the original. As for comedy, it's completely drowned out by noisy nothing. Lots of activity and bluster, that seldom excites or even entertains. NOTE: Stay thru the credits for a sequel teaser."
    },
    {
      "rating": "4",
      "text": "It starts off rather interesting, but sadly falls apart only after a few minutes. Items appear without explanation when \"the plot requires it\", the villain constantly keeps killing random extras to make him look even more \"evil\" ... now add boring characters and lots of \"getting rescued at the last second\" moments: That's the whole movie for you."
    },
    {
      "rating": "5",
      "text": "Всё это мы уже видели.Для человека, который смотрел не одну сотню фильмов, тут найдётся очень много предсказуемых моментов, настолько предсказуемых, что за 40 минут до конца понятно, что этого персонажа убьют, именно это событие произойдёт и т.п. Я бы прощал эту предсказуемость, если бы видел что-нибудь новое, стоящее, но нет, всё уже обыгрывалось в прошлых частях. Тут и Джек, у которого всё те же манеры, речь, движения, сам образ уже изжил себя. Тут опять злодей, который, о боги, (спойлер) проиграет, слава хэппи эндам. Тут заменили харизматичных и интересных персонажей из прошлых частей какими-то не имеющими толковой истории куклами. Тут и размах прошлых частей куда-то пропал,а ведь в них творилось настолько масштабное действо, что картина до сих пор перед глазами стоит, но в этой части всё как-то камерно. Мне представляется всё это так: эта часть - это маленький склад на окраине города, в котором вроде и происходит какая-то движуха, аля бешеные псы, но что меняется в самом городе, если разнесут этот склад? Любая прошлая часть из трилогии (4-ую не включаем) - это огромная высотка в центре города, в которой происходит множество операций, которые так или иначе влияют на город. Короче говоря, Мертвецы не рассказывают сказки - капля в море, а любая иная часть, кроме 4-ой - и есть море.Посредственный фильм, смотрите трилогию, получайте удовольствие, а мимо этого фильма можете проходить."
    },
    {
      "rating": "5",
      "text": "Well the movie wasn't a huge disappointment, but not a good one.  Honestly it was a bit boring until the hour mark. But then it did pick up. It seems like Johnny is now just playing a character of a character. The best part of the film character wise was Javier's character Captain Salazar who wasn't a utter travesty like Blackbeard in the last one. The action was fine except for that opening bank robbery scene which was so ridiculous and dialogue was okay but the whole witch thing did get annoying after a while.It does tie up some loose ends and answer some questions which I was happy with. But the final 25 minutes ultimately saves the movie from being a snooze fest. This us suppose to be the ending of the whole series, but I can definitely see them continuing this to milk more money. If you seen the others I guess watch it, but if you haven't don't bother. Watch the first one and be done with it."
    },
    {
      "rating": "5",
      "text": "Ok. I have been a pirates fan as I think these movies are great fun and one of the better examples of good popcorn entertainment. that being said pirates of the Caribbean dead man tell no tales does a great job trying to capture the spirit of the original and does a good job in some places and falls in others. I liked how this was more of a fun straigtforward pirate romp that did not put captain jack as one of the leads but as a side character to our two main heroes. Geffory rush as barbosa was a joy to watch and much of the action while played for laughs was intense and exciting to watch. much of the cinematography was beautifully done. Jack was funnier than he was in 4 and 3. As for our two new comes i thought they did an alright job. I never felt that they reached the heights in terms of acting to kira knightly and orlando bloom but ever there romance got cringy as the movies went on. That being said many things fall flat. While javier bardem was good as the villain i did not find him particularly menacing or interesting unlike davy jones. His introduction was great but his character soon fell flat. As for the rest of the cast the acting was either really good from the likes of johnny depp and geffory rush or very serviceable.  In conclusion it was a lot better than I was expecting but the director tried his best to capture the magic of the original and succeeded in some ways but failed in others. I will not be doing a review for the other films so here is how i rank them 1,2,5,3,4"
    },
    {
      "rating": "9",
      "text": "Its not the best movie from the series, but only the fact that he is far better than the fourth movie ill give 9 out of 10.And because of the short but satisfying scene with Elizabeth Turner."
    }
  ],
  "recommendations": [
    "pirates_of_the_caribbean_on_stranger_tides",
    "max_steel",
    "incredibles_2",
    "x_men_apocalypse",
    "the_new_mutants",
    "bumblebee",
    "kingsman_the_golden_circle",
    "x_men_origins_wolverine",
    "terminator_genisys",
    "riddick",
    "ghostbusters_ii",
    "ant_man_and_the_wasp_quantumania",
    "shazam_fury_of_the_gods",
    "spider_man_3",
    "despicable_me_3",
    "teenage_mutant_ninja_turtles",
    "maze_runner_the_scorch_trials",
    "night_at_the_museum_secret_of_the_tomb",
    "night_at_the_museum_battle_of_the_smithsonian",
    "the_twilight_saga_breaking_dawn_part_2",
    "terminator_dark_fate",
    "the_many_saints_of_newark",
    "the_old_guard",
    "suicide_squad",
    "i_am_number_four"
  ]
}