{
  "id": 4760,
  "title": "Pitch Black",
  "starring": [
    "Vin Diesel",
    "Radha Mitchell"
  ],
  "runtime": 108,
  "genre": [
    "Thriller",
    "Science Fiction",
    "Action"
  ],
  "description": "When their ship crash-lands on a remote planet, the marooned passengers soon learn that escaped convict Riddick isn't the only thing they have to fear. Deadly creatures lurk in the shadows, waiting to attack in the dark, and the planet is rapidly plunging into the utter blackness of a total eclipse. With the body count rising, the doomed survivors are forced to turn to Riddick with his eerie eyes to guide them through the darkness to safety. With time running out, there's only one rule: Stay in the light.",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3AnlxZ5CZnhKKzjgFyY6EHxmOyl.jpg",
  "categories": {
    "plot": 8.65625,
    "acting": 8.714285714285714,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 6.857142857142857,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.25
  },
  "reviews": [
    {
      "rating": "9",
      "text": "In my opinion Vin Diesel's best movie. The dialogue is spot on, with so many great lines. Riddick is super badass and just an awesome character. The supporting characters are interesting, Radha Mitchell plays her role brilliantly. The ending doesn't disappoint and just leaves you hungry for more. Just an all around brilliant sci fi movie."
    },
    {
      "rating": "9",
      "text": "A- *************************************************************************"
    },
    {
      "rating": "9",
      "text": "The movie that put Vin Diesel on the map as Riddick, the crooked anti-hero wanted by bounty hunters. This is another movie that benefits from knowing very little before watching the film."
    },
    {
      "rating": "10",
      "text": "wait what? The critics don't like this movie too? Oh my God! Since the first time I saw this movie  i never forgot it, I always loved it.. when I found out that it was Riddick, I saw the two movies that existed and I became completely addicted! It's such a good storyline, amazing characters. I've always loved sci-fi but this? Is another level. I love it. it's amazing. Very creative. Too good, seriously."
    },
    {
      "rating": "10",
      "text": "The film takes place in 2578. It matches with the core samples read by Fry, \"76875/87/656\", where 76875 is the number sample, 87 the days of the expedition since the arrival to the planet and 656 the date (June 2556)."
    },
    {
      "rating": "10",
      "text": "The contacts that Vin Diesel wore to play Riddick were a prototype. After the first day of filming, when they tried to remove the contact lenses, they couldn't. Due to where they were filming, they had to have an optometrist flown in from the nearest town, three hours away. Diesel called the contacts hubcaps."
    },
    {
      "rating": "10",
      "text": "The film was originally titled Nightfall and about a female outlaw named Tara Krieg with tribal tattoos and enhancements from her interstellar tribe of barbarians. Imam was named Noah Toth a member of a technology-based version of Christianity and he had no pilgrims, there was no eclipse, only a two-month day and two-month night, there was no geologist's outpost, only ancient ruins and instead of aliens the villains were the ghosts of the creatures who built the ruins trying to defend their homeworld. There was no escape ship, but a distress beacon, and Tara, Carolyn Fry, Jack, Noah Toth (Imam) and Paris were all supposed to make it off the alien world, called \"Hades\" instead of M6-117. Johns' morphine addiction, the cannon-fodder teens, the solar orrery and the geologist's camp were added by David Twohy."
    },
    {
      "rating": "10",
      "text": "Vin Diesel said that while shooting the scenes where his character was in a suspended animation chamber, he had a claustrophobia attack and had to be taken out of the chamber."
    },
    {
      "rating": "9",
      "text": "Moderate exposition to begin with, and a rather basic plot. However, the characters feel rich and developed by the third act and are true to their natures. Impressive for a 2000s Sci-Fi/Thriller and worth watching if interested in the Riddick saga in general."
    },
    {
      "rating": "10",
      "text": "To determine the rotation time of the planets of the solar system where Fry and the rest crashed, they look at a movable model in a room at the settlement. The device is called an \"orrery,\" and is used by astronomers when modelling our own solar system."
    },
    {
      "rating": "10",
      "text": "The contact lenses Vin Diesel wore in the movie, while a prototype during production, were briefly available to the public from Lens Quest following the release of the film. They were called Shine Job, like in the movie."
    },
    {
      "rating": "10",
      "text": "In Riddick's backstory: Riddick was a Company Ranger in the military, where he learned to pilot ships, worked in tunnels as a Sweeper and was promoted to the prestigious Strikeforce Academy on Sigma 3's moon. Riddick spoke out against enforcing security on Sigma 3 and publicly stated that life on Sigma 3 was akin to slavery and the enforcing security personnel were murdering and torturing workers. The company disposed of evidence and arrested Riddick, who was subsequently sent to prison."
    },
    {
      "rating": "10",
      "text": "When Carolyn sees Johns injecting drugs into his eye she refers to him as a \"hype.\" This was also a historical slang term for drug users (mainly heroin users) in the 1940s to early 1960s."
    },
    {
      "rating": "10",
      "text": "The film was shot in Australia over the course of 65 days.The weapon Johns uses is an Armscor M30R6 shotgun, modified to look futuristic."
    },
    {
      "rating": "9",
      "text": "David Twohy did such a surprisingly fantastic job of this sleeper hit you just have to accept it as a great thrill-ride of a Sci-Fi monster thriller for it's clever and intelligent writing. Though derivative, it has a perfect setting and it intelligently conflicts with the tension from the flying creatures that frighteningly entertains. Also, what if I said it's better than Alien 3 and Alien: Resurrection? Because I think it is despite the underrated visual effects. Rated R for sequences of strong sci-fi creature violence and gore, language, and frightening images"
    },
    {
      "rating": "9",
      "text": "Pitch Black is a thrilling science fiction movie with terrific acting and visual effects. This movie is very underrated and it is one of the few movies to take place in space. Every aspect of the movie was\rwell made and it is a work of art and skill."
    },
    {
      "rating": "10",
      "text": "Possibly the best Science Fiction movie of the 21st century, Pitch Black delivers an astounding sci-fi horror story that chronicles the events surrounding survivors of a space transport crash on a different planet. Each character flourishes in their well-defined personality, their movements, and behavior. The way they clash and the manner in which the story is told is brilliant. This is easily one of the greatest movies in the last fifty years."
    },
    {
      "rating": "9",
      "text": "Possibly one of the best low budget movies Ive ever seen. The story is simple and very by the book, not to mention basic and the characters are great with each standing out in their own way. This movie is very deserving of its \"cult classic\" status"
    },
    {
      "rating": "10",
      "text": "Though the Riddick films are so under appreciated (it's a crime) I speak for real si-fi fans when I say that the Riddick series (video games included) is one of the greatest series of its genre."
    },
    {
      "rating": "10",
      "text": "It was Cole Hauser's idea for Johns to shoot up the drugs into his eye.When Riddick pulled the tarp off one of the buildings, revealing Jack, a tied rope was on the other side, causing Vin Diesel to pull a muscle."
    },
    {
      "rating": "10",
      "text": "According to Pitch Black's official web, the main characters have different ages due to the hibernation during the space travel:-Fry (paper age, 41; actual age after cryo-deduction, 25).-Johns (paper age, 37; actual age after cryo-deduction, 29).-Owens (paper age, 50; actual age after cryo-deduction, 33).-Zeke (paper age, 39; actual age after cryo-deduction, 39).-Shazza (paper age, 37; actual age after cryo-deduction, 28).-Paris (paper age, 72; actual age after cryo-deduction, 47).-Imam (paper age, 47; actual age after cryo-deduction, 45).-Jack (estimated age, 13; actual age after cryo-deduction, unknown).-Riddick (uncertain age due to no birth certificate on file)."
    },
    {
      "rating": "10",
      "text": "While waiting between takes, the lighting team would set up several 5k lights to allow the rest of the crew to warm up, before they had to go back to work in the sub-fifty degree Fahrenheit (ten degrees Celsius) weather."
    },
    {
      "rating": "10",
      "text": "Vin Diesel said of filming in the South Australian outback mining town of Coober Pedy in South Australia that the location \"is an amazing place in the middle of the desert; not a tree, not a thing in sight, other than dirt. A few houses make up the 'town' of about two thousand people. I'm from New York - I grew up in a building of a thousand people."
    },
    {
      "rating": "10",
      "text": "It turns \"pitch black \" exactly 59 minutes into the movie. ,,,,,,,,,,,,,,,,,,,,,"
    },
    {
      "rating": "10",
      "text": "The next Alien...From the first 10 seconds of Pitch Black I was hooked. I had walked into this movie thinking that it would be just another cheesy sci-fi movie. Instead I found a highly entertaining, on the edge of your seat, thought provoking action film. The movie goes beyond your basic special effects flick. The actors are amazing, Radah Mitchell (High Art, Love and other..) as Fry is truly a joy to watch on screen, while Vin Diesel as Riddeck is so captivating that you are dying just to hear him speak again.The look of the movie is breath taking, the contrast of blues, yellows and oranges due to the three different suns is amazing. Followed by the complete darkness of nightfall. I would truly recommend any lover of the ALIEN movies or Radha Mitchell (which is why I went to see it) to check out this film. I'm sure by the end you'll look at the dark in a whole new way."
    },
    {
      "rating": "10",
      "text": "¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¿¡¿¡¿¡¿¿¿¿¡¡¡¡¿¿¿¡¡¿¿¿¡¡¡¿¿¿¡¡¿¿¿¡¡¿¿¡¡¿¿¡¡¿¿¡¡¡¿¿¡¡¿¿¡¡¡¿¿```````````````````````````"
    },
    {
      "rating": "10",
      "text": "The cutting torch Fry looks for is an oxygen-acetylene torch. However, when they have to cut their way into the next compartment, Riddick is using a plasma cutting torch. An oxy-acetylene cutting torch would leave the edges of whatever it cut glowing red. When Riddick comes through the hole he just made, the edges aren't glowing. Furthermore you can see from over Riddick's shoulder that the plasma cutter's tip is cylindrical and a larger diameter with no taper and the oxy-acetylene tip is smaller and tapers to the end."
    },
    {
      "rating": "10",
      "text": "++++++++++++++××××××××××××÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷=======///////€£*),.,((*&*&;&!:^:%#-'dd...........□■●○▪`~|{♡}[]《》》¿¡☆°°¤¤°⊙⊙♧○●□■☆☆☆☆☆"
    },
    {
      "rating": "10",
      "text": "Carolyn Fry: How much do you weigh, Johns?William J. Johns: What's it matter, Carolyn?Carolyn Fry: How much?William J. Johns: Around 79 kilos, to be exact.Carolyn Fry: 'Cause you're 79 kilos of gutless white meat, and that's why you can't think of a better plan."
    },
    {
      "rating": "10",
      "text": "Miscellaneous When Riddick is put in \"chains\" again after Zeke dies, you can clearly see that the \"chain\" is a telephone cord going above his head. This can be seen very clearly in the conversation between Johns and Riddick just before Riddick is freed."
    },
    {
      "rating": "10",
      "text": "Character ErrorWhen Johns says how long could the eclipse last. A few hours or a day tops. Imam says that will be a lasting darkness 2 planets are moving as one. He should have said 3 planets moving as one. Same thing goes for the eclipse itself. Should have been 2 planets blocking the 3 suns."
    },
    {
      "rating": "10",
      "text": "To get the other-worldly colour effect from the planet's sun, the filmmakers decided not to use bleach on the film negatives. Adding bleach to the negatives is done to remove silver nitrate from them. According to director David Twohy, this could have been done in post production, but would have had to be applied to a whole reel instead of shot by shot so they used this process to the original negatives."
    },
    {
      "rating": "10",
      "text": "An Excellent use of Sci-Fi as a story telling mediumWhile most movies that pit humans against horrendous extra terrestrials end up being cheap imitations of the 'Aliens' series, Pitch Black stands as a fine piece of Sci-Fi, and an excellent movie all around. Perhaps my favorite aspect of the film is the lighting. This movie beautifully employs many different colors, shades and intensities of light which set the mood and lend a unique feeling to the film itself, something different than the 'normal' movie lighting we are generally subjected to. Vin Diesel brings his character to life in an excellent manner, skillfully avoiding the routine portrayal of the hardened criminal. After all, the film is about Riddick's (Diesel's character) personal journey, so thankfully Vin doesn't drop the ball. The remainder of the cast (with the exception of the talented and gorgeous Claudia Black) were unknown to me but all turned in marvelous performances, animating the diverse characters with unique quirks and mannerisms. Pitch Black is a perfect example of making a great film with out the resources of an excessive budget. The special effects are more than adequate, but at the same time they are by no means the sole focus, as in many high budget 'blockbusters'. It's a great movie because it uses Science Fiction as a medium to tell an engaging, provoking story, rather then telling a mediocre story to use the flash of Science Fiction"
    },
    {
      "rating": "10",
      "text": "10/10Diesel's Best, a totally brilliant movie !This is a wonderful blend of sci-fi, horror and action as Vin Diesel teaches everyone not to mess with him!Diesel brings the appropriate amount of menace to the character and the story that winds around is he a good guy or a bad guy or both. You never really know how he is going to act, right up to the end. This doubt really serves the movie well. Who is the actual enemy is it the aliens or is it Riddick?The style of the movie draws the viewer in and makes you feel like you are on the ground with them, feeling their fears."
    },
    {
      "rating": "10",
      "text": "ContinuityIn the scene just before Johns is killed he loads the shotgun and uses it as a prop to stand up. The barrel is plugged with dirt when he gets up, in the next scene it is not plugged as he attempts to shoot the monster attacking him."
    },
    {
      "rating": "10",
      "text": "&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "10",
      "text": "Absolutely groundbreaking sc-fi action/thriller. One of the greatest movie characters the genre has produced. Simply incredible"
    },
    {
      "rating": "10",
      "text": "Great movie, had a very dark gritty feel to it and, oh yeah Riddick's a Badass."
    },
    {
      "rating": "8",
      "text": "Pitch Black space thriller laid the foundation for a whole Riddick franchise. Vin Diesel has not yet found a family and starred in good films. The thriller is good, of course the small budget is striking - the scenery is deserted, CGI is even nondescript for the late 90s. But the story is interesting."
    },
    {
      "rating": "8",
      "text": "I must say that I think that the character that Vin Diesel plays is the all-time best fictional character ever. Who's cool? The movie in general is good, better then it's follow up film. But it still has it's dull spots."
    },
    {
      "rating": "8",
      "text": "Pitch Black isn't the greatest sci-fi movie of all time, and it isn't trying to be. It is, though, a helluva lot of fun."
    },
    {
      "rating": "8",
      "text": "Dunno why the low score, this is a great, different, if slightly cheesy movie. Diesel has a style all his own."
    },
    {
      "rating": "8",
      "text": "An incredibly fun and intense sci-fi thriller that shows Vin Diesel has real character that fits him outside of The Fast and the Furious.  The first ten minutes are so full of white-knuckle insanity that, with a good crowd sitting in front of a sweet entertainment center/home theater, you'll likely be clutching the sides of the sofa to find any mental stability.  When all is said and done, Pitch Black is an gem that's unpolished in all the right places to give it plenty of character and isn't any longer than it needs to be with its near two hour run-time."
    },
    {
      "rating": "8",
      "text": "Pitch Black meshes the sci-fi/fantasy genre with the horror genre better than any other movie, including Alien. Vin Diesel's character is amazing. His highly questionable moral compass combined with a strange sense of principles creates a very interesting character dynamic. The supporting cast is solid too, with Radha Mitchell possibly seeing even more screen time than Diesel's Riddick. The cinematic effects, however, are what make this movie stand out. The camera effects are sometimes a little overdone but the color palette used throughout most of the film is done to great effect. The plot suffers from a couple of cliched episodes of stupidity that plague almost all movies (most notably Paris' ridiculous act towards the end). It also wraps up a bit too suddenly. It feels like the movie is building towards a climax and it ends rather abruptly. Nonetheless, this is an instant cult classic that has held up well over the years and I highly suggest checking it out."
    },
    {
      "rating": "8",
      "text": "Great start to the Riddick trilogy! I takes time to really get going and I wish there had been a little more action but still its a good sci fi thriller none the less!"
    },
    {
      "rating": "8",
      "text": "Although this movie had a low budget it looks not bad, especially the creatures are nice and the planet looks well also. The story is nothing special and you will recognise it surely. Some of the characters have also not much depth, but Vin Diesel is a surprise."
    },
    {
      "rating": "8",
      "text": "Movie is good for what it is. Some plot holes here and then but the writing was good with some surprises. Obviously its about vin diesel killing things."
    },
    {
      "rating": "7",
      "text": "Yes it is a \"B-Movie\" with limited budget! It is not deeply philosophical, or ground breaking, but IT NEVER TRIED TO BE!!! Critics who gave it low scores should understand this! As a B-movie, it rather good, and not without character!"
    },
    {
      "rating": "1",
      "text": "I'm watching this movie right now and I'm not sure I can take much more of it. There just aren't that many... redeeming qualities! The cinematography is unique and thought-out, but the amount of color filters, muddying up EVERY SINGLE FRAME with blue or brown, just pisses me off. Realism absolutely aside ('cause there is almost none), I feel no reason to care for any of the characters. Vin's character I do not pity nor root for, nor do I take any interest in the others. The sets are laughable, making visuals as annoying as the coloring. I like sci-fi, I really do, but this just feels like a bad episode of \"Lost\" mixed with \"The Hills Have Eyes\" without the grittiness or the intrigue. Oh, and produced with a budget of about 50 bucks. Really, don't waste as much time as I have on this thing."
    },
    {
      "rating": "6",
      "text": "Vin Diesel when he was actually good (I liked Fast Five also), Pitch Black may not be the sci-fi plot everybody's looking for, but the action is suitable and thrilling enough and so are the performances, so Pitch Black doesn't fail."
    }
  ]
}