{"id": 1556, "title": "Pitch Perfect 2", "starring": ["Anna Kendrick", "Brittany Snow"], "runtime": 115, "genre": ["Comedy", "Music"], "description": "The Bellas are back, and they are better than ever. After being humiliated in front of none other than the President of the United States of America, the Bellas are taken out of the Aca-Circuit. In order to clear their name, and regain their status, the Bellas take on a seemingly impossible task: winning an international competition no American team has ever won. In order to accomplish this monumental task, they need to strengthen the bonds of friendship and sisterhood and blow away the competition with their amazing aca-magic! With all new friends and old rivals tagging along for the trip, the Bellas can hopefully accomplish their dreams.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/fQaEGzFmvTYu3G641WV0Tg9auAt.jpg", "categories": {"plot": 5.944444444444445, "acting": 5.9411764705882355, "ending": 5.25, "soundtrack": 5.666666666666667, "cinematography": 5.0, "familyFriendly": 5.6, "funny": 5.82258064516129, "action": 4.0}, "reviews": [{"rating": "4", "text": "Anna Kendrick is lovely and charming however,\rWatching this movie in the cinema was a bit of an awkward experience. Quite often, the movie appears to be trying hard to get the audience to laugh, but the jokes falls so flat that there is hardly any response.\r What stands out most is that people in the (Dutch) audience were kind of offended. The frequent \"latina\" jokes had people looking at their friends and partners like \"what the hell\" in quiet discomfort. When the main characters, which are supposed to be educated women, did not know where Copenhagen was I already felt that the movie celebrated ignorance. But when one of the characters during the trip to Denmark asked something like \"It is so dirty and smelly, why do Americans ever leave America\", the European audience was laughing AT the movie.\r Fat amy's self-deprecating fat-jokes were the funniest thing in the movie... and they were not that funny."}, {"rating": "5", "text": "Pitch Perfect has become one of my all time favorite movies, so anyone can imagine how hyped I was to witness the greatness of the Barden Bella's as they endured a new year of capella competition in the sequel. However, the film did not exceed or even meet the hype for that matter. The opening scene was absolutely hilarious, but unfortunately it did not set the tone for the rest of the movie. The humor felt forced and the film overall was not engaging. That being said though, the sentimental ending was a nice touch."}, {"rating": "6", "text": "\"Pitch Perfect 2\" é um filme OK. Não houve nada de inesperado. Alguns momentos chegaram até a ser chatos... Estou decepcionado.6/10"}, {"rating": "5", "text": "The first Pitch Perfect was an unexpected surprise: Funny with appealing performances and great acapella numbers. This sequel tries too hard to match the highs of the first movie, and ends up falling flat. There are plenty of jokes, the majority of them unfunny. Some of the comedic sequences are excruciating. Anna Kendrick, Rebel Wilson, and the other actresses who appeared in the first PP seem wasted here. There are some good acapella numbers, \"We Belong\" being a highlight. But the plot device that serves as the impetus for the movie does not make any sense, and is borderline offensive. Rebel Wilson, in an accident while performing, exposes her vagina to a live audience. The audience is horrified, and the Bellas are left in disgrace. This doesn't make any sense. It was an accident, and she showed her vagina, for pete's sake. She didn't murder an infant on stage. To have such a reaction, and to expect the film audience to have the same reaction, to female genitalia is offensive."}, {"rating": "4", "text": "The Movie is generally a cash grab after the first film's success.The movie is boring and not great the only thing i enjoyed are the a capella performance and absolulely nothing else."}, {"rating": "5", "text": "The first film was entertaining for me and my wife. Men and women could enjoy certain aspects of the movie. It was a family movie. Pitch perfect 2 is a chick flick through and through. Watched the first movie many times, second thought is a 1 time watch for me."}, {"rating": "5", "text": "The Original Pitch Perfect is surprisingly good but not great,the sequel is kind a the same thing but it is not anymore surprising.The movie is average and more of the same.Nothing really special in this movie but it is really just for teenage girl's movie."}, {"rating": "5", "text": "So this movie beat the action movie of decade Mad Max: Fury Road at the box office, this is why we can't have nice things.\r The story is about a capella group, the Barden Bellas are boldly going where no American team has gone before: setting out to win a grueling international competition where all their talents will be put to the test.\r Now I wasn't such a big fan of the first movie, it wasn't terrible or even good, it was pretty mediocre at best but I still found some parts in the movie to enjoy and maybe laugh at, but these a lot of people out there who liked the movie and that's fine with me because at least the first film was pretty harmless and had funny scenes in it, but Pitch Perfect 2 has to be the most cliche movie so far this year and I'm going to explain in a minute or two.\r Elizabeth Banks as the director was a piss poor choice, because I thought she didn't bring anything new to the table when it comes to the sing off or even the character's. This is the same director who directed porn and...Movie 43. I don't hate Elizabeth Banks and I don't like to talk crap about her but if I have to be honest she wasn't all that good at directing because when you're a director you got the biggest job and you have to make it work and it doesn't happen here as the jokes fell flat and most of you may say it's the writing but let's not forget that she's looking the screenplay going \"Yeah that's good let's start rolling\". But Elizabeth Banks also stars in this movie and she was funny in the movie, so yeah that's it for Elizabeth Banks...I still don't forgive you for Movie 43.\r The whole cast all do good in the movie because they are all great actress, but the one thing that I thought lacked in the first movie and this is some of the characters and I'm not saying that they horrible, it's just that some of them come off cliche and a bit stereotypes with the humor that did not help at all. You got that fat one who's self ware of herself and always makes jokes about her weight and doesn't know anything, you also got the weird Asian women who dose strange and odd things because well the script says so. I don't blame the actress for this as I think it's the directing and writings fault that this came out flat, but aside for that the whole cast did a fine job and did what they could with what they got.\r Now I going to sound like a old nick picking grumpy man for saying this but I don't like modern music from today, yeah these some good modern music out there but the kind of music that I like is the ones that focus on it's lyrics and doesn't repeat the same line over and over again and doesn't feel lazy, well in this movie they do they Capella to modern songs and the songs that they pick are the songs that I personally don't like as I exampled before about how music should be done right by it's lyrics and the sense of passion and heart put into them.\r The writing as I brought up early in the review wasn't very good. At least in the first movie it had funny elements with the character's and how the movie was self aware of how over the top it was, but in this movie it's more of jokes and less of the funny impact on the character's, the movie did a lot of South American stereotype jokes and I'm here thinking \"Wow this who ever wrote this movie really hates South American, and every time it came out of they mouths I literally rolled my eyes with shame and pain.\r Now I don't hate this movie but judging on this review and I how I brought up a lot of negative things about the movie, but I didn't walk out of the movie feeling a shamed of being human, no I just walked a bit disappointing because I thought the squeal was maybe going to be better just by the little hype I heard from the movie. If you like the movie that's fine, but for me I'm still not a fan."}, {"rating": "5", "text": "It's hard to hate this movie because it does capture at least some of the elements that made the predecessor fantastic. But all the jokes seem kind rehashed from the first movie and you feel kind of a been there and done that feeling. Some jokes are a little forced and the movie seems to rely greatly on jokes and other plots, but the best part about it is the a capella performance. Most of the movie is a bunch of jokes and not all of them are funny because they are rehashed and forced. This makes the movie pretty boring even though the guy from key and peele is pretty funny in this movie. Honestly, the movie wasn't awful, but it seems like this movie was made purely for money. It doesn't serve as a great sequel. It's more like a parody of the original. But this movie had its moments to keep it from being terrible. This saved Pitch Perfect 2 from being one of the worst movies of the year."}, {"rating": "5", "text": "A typical average sequel. They push too hard on what they did well in the first movie, resulting in fat amy,  fun minorities, and freshman-that-saves-the-world all taking up too much space that none of the main characters can be fully developed. I don't see the point of introducing a new protagonist and a new minority character. And I especially hate Adam DeVine who returns for no good reason. I know that a Hispanic character and Adam Devine and Hailee Steinfield and a rap battle scene will benefit the box office, but please! You are making a movie and music, not just making money! If you need money, seriously, just go make another comic franchise."}, {"rating": "8", "text": "Unlike the previous film, the sequel puts it's emphasis on 'Fat Amy' which works for most of the film, however there are parts in which Pitch Perfect 2 simply tries to hard. The a capella performances where spot-on and never failed to impress( in my opinion a slight improvement over the first film). You won't find anything out of the ordinary in its story, however the film constantly finds a way of keeping your attention up during its 115 minutes runtime.\r No, it isn't as good as the first film and no, not every joke delivers. But let's be honest, it's still utterly entertaining and hilarious."}, {"rating": "0", "text": "The Movie is anything but average.Everything is just the same as the first film.The jokes are forced out and everything is just not good enough.I enjoyed the first film but the sequel I Didn't actually enjoyed sure my little sister love it but for me it is just a very generic sequel that only works for specific kind of audience."}, {"rating": "7", "text": "An entertaining and fun experience which was better than the original. The cast are solid, with Rebel Wilson carrying the humour and heart of the storyline. The dialogue is hilarious, with some delightfully subtle humour woven throughout, though the plot remains predictable and occasionally twee. As a musical, the soundtrack is fantastic, which is to be expected, and this somewhat makes up for the lack of real tension in the general story arc. Many laughable moments made for a solid sequel which is worth your time. 7.88/10"}, {"rating": "9", "text": "I'm probably in the minority here but I liked Pitch Perfect 2 more than its predecessor. It really doesn't seem like a cash grab to me. I found the story to be better and once again, the stereotypical characters really shined: particularly the acapella announcers and Fat Amy. But parents be warned! There is a bit more inappropriate content than last time."}, {"rating": "5", "text": "I loved PP #1, #2 however was an OK film for me. It was funny and entertaining, I liked the new romances EXCEPT, I hated the fact that jesse and beca romance was not shown as much in this film. I also felt like ana Kendrick didn't put much effort into the character, that's just me. Overall I love the music, the new characters and the dance parts. Good film, just not better than the first one!"}, {"rating": "3", "text": "This movie falls flat after the first film.  It had a total lack of character development, tried hard to be \"edgy\" and frequently came across as offensive, and while the story line had potential it just didn't hold up.  I really wanted to like this film, but they lost something after the first film.  Maybe the producers just didn't understand what made the first film amazing? It seems like they thought Rebel Wilson was vital to the success of the film, but she was actually the only part of the first film that irked me at all.   The good: DJ Flula as Pieter, the amazingly choreographed dance routines, and most of the musical numbers."}, {"rating": "6", "text": "This movie has some funny moments, some great acapella, and one of my favorite movie characters of the year so far (the music producer). However, the film has too many jokes that miss the mark and beat you over the head to be warrant of a full price viewing. It simply tries too hard to be as funny as the first, resulting in a product that doesn't work as well as the original."}, {"rating": "6", "text": "It strains to be bigger and more badass than the first.  Ultimately, it doesn't hit those highs, but there's still a lot to like, a lot of fun to be had."}, {"rating": "8", "text": "This movie was exactly what I expected it to be. It was rapid-fire stupid humor with a few small surprises and decent quality music. It's plot was a bit schizophrenic and not as Amy-centric as a lot of the reviewers made it seem, which I was glad to see. It wasn't very Becca-centric either. If anything, it split its time evenly between them and the new girl, Emily and did an okay job with it.\r The only things I would have liked to see were some non-pop songs and perhaps a bit more time spent on them. Otherwise, I can't say I was disappointed. A solid effort and worth watching once, much like the first film."}, {"rating": "8", "text": "I would have liked to see more of Jesse and Becca together in the film, and it would have been amazing if the Bellas teamed up with the Trebel Makers for the final performance against SDM."}, {"rating": "8", "text": "Pitch Perfect 2 May not reach the highs of the previous film, not as good songs or performances. However it never fails to be enjoyable and hilarious, Fat Amy takes the cake here easily."}, {"rating": "10", "text": "Ritmo perfecto una comedia inolvidable igual que sus personajes esta es una de las películas más graciosas que e visto felicidades una gran películas."}, {"rating": "8", "text": "Hilarity and heart are what keeps this comedy sequel afloat in a time when most sink harder than the Titanic. It's an absolute joy to watch these talented actresses come together once again with some new faces to give incredible musical performances and deliver a seemingly endless stream of jokes.\r The plot of the previous movie didn't deviate too far from the standard coming of age story found in most movies aimed at teenagers outside of being set in college and a focus on A cappella. That isn't so much the case here. Elements are familiar, but touch on some more emotional themes.\r Moments of sisterhood and vulnerability with and between these characters are the backbone of the whole thing. Their fears about moving on, failing, and being away from the family they created all resonate because of how in love we fell with them in the previous film. That love is only strengthened here.\r It's also a very funny movie. Downright hilarious most of the time. Awesome cameos and a wide range of jokes keep the laughs coming, even if it does suffer from the typical comedy sequel flaw of trying to go too big at times. That need to one up itself does lend that all too familiar feeling of trying too hard that sometimes causes it to stumble. However it also leads to some of the film's best and brilliant moments of comedy and heart-warming sweetness. Thanks to talented direction, sharp writing, and a stellar cast this movie succeeds more often than not.\r While the planned third movie might be a bit much, the Bellas' second performance is one worth watching. Time will only tell is the magic can be captured three times in a row, but I'm thankful to say that it was captured at least twice."}, {"rating": "7", "text": "I only saw the original on television so cannot fully compare Pitch Perfect 2. I love a capella so that is going to sway me some. The story is okay, the singing performances great. The premise for their probation is silly but not much worse than projectile vomiting from the first film. I doubt there will be a Pitch Perfect 3 given how this one wraps up. Highlight of this movie has to be the banter between the two announcers. They steal the movie."}, {"rating": "10", "text": "well our lady's the Bella's are back and just as much fun to hang with as before you gotta love this movie funniest comedy so far this year mostly family appropriate full of laughs and good heart  very proud of the creators for not screwing it up loved fat  Amy and the Chinese chicks will definitely watch again soon will bring the family next time"}, {"rating": "8", "text": "Funnier and even more amusing than Pitch Perfect (2012). Now we have also a focus on Fat Amy and Emily, a new Bella, and they're both quite interesting people for the audience to connect to, besides Beca. Other characters have a poor exploration but their scenes are mostly enjoyable and entertaining, such as Flo, Lilly, the journalists and Das Sound Machine. Soundtrack maintains the high quality, with other cool mashups and an original song in the end credits. After seeing this, I can fully understand why PP2 was even more successful than the first one. It's much better indeed!"}, {"rating": "6", "text": "Despite the film existing in a ridiculous world of a cappella groups competing for national championships, I found myself constantly relating to Anna Kendrick’s character, Beca, who struggles to find her own voice in the music industry, and the Bellas who stumbles their way to acknowledge the end to college life and the beginning of the real world. Yet the film never fully manages to strike a balance between its silliness and its warmer side. Pitch Perfect 2 is still inconsistently funny and inconsistently original, and Elizabeth Banks’ effort to deliver thematic undertones is so poorly contrived that it blends awkwardly with the film’s absurdity. Fortunately, the film remains largely enjoyable topped with a handful of stunning moments, but the painful wait was not worth it."}, {"rating": "3", "text": "Wow they screwed it up! It had potential but it just got too cheesy. I was bored until the beginning of the riff off, which started off TIGHT but then it too got cheesy and  I was let down again.They had some really good cast members who were capable and had the talent to really make this movie Go but they really didnt get enough airtime and preference was givin to girly silliness without a strong plot to carry the movie. The Director screwed this one up, the movie could have been awesome but nothing really ever got better and I couldn't buy into the last performances which  made the bellas the winner."}, {"rating": "1", "text": "You wanna see a good movie? NOPE not with this horrible movie they screwed up big time.\rNot 1 joke was funny pretty boring I fell asleep twice come on Halloween 3 was better then this.\rThis is a good movie if you want a 2 hour nap bring pillows and blankets everybody!!\rEven Pompeii was this boring that movie kept your attention at least unlike this horrible movie don't watch it EVER!!!!!!!!!!!"}, {"rating": "2", "text": "the movie was awful.just awful.specially the story and screenplay.i was browsing the net while watching the film but i didnt miss anything in the story.paul blurt was better.and paul blurt is really bad."}, {"rating": "0", "text": "Gather around kids, your uncle KJ is going to tell you a story. Once upon a time, a movie called Pitch Perfect was released in theaters in the year 2012. It failed so miserably cause of it's poorly written script, unfunny humor, **** acting and very annoying characters. It was one of those comedy movies where you just want to puke. 3 years later, a sequel came out and guess what? IT WAS EVEN WORSE THAN THE FIRST! It has the same problems as the first except now, there's MORE annoying characters, there's MORE unfunny humor and there are MORE **** acting. During the entire movie, i just wanted to burn my eyes with acid, that's how bad it really was. The only good thing i liked about the movie was Snoop Dogg but sadly, it was just a cameo. I would rather watch the Fantastic Four reboot than this big pile of **** If i was Universal, i would cancel Pitch Perfect 3 and end this awful franchise."}, {"rating": "7", "text": "Pitch Perfect 2 is basically more of the same from Pitch Perfect.  If you loved the first then you have only good things to glean from this predecessor.  I found some of the writing actually more clever than expected, delivered by the show's comedic presence in Rebel Wilson (Fat Amy), Keegan-Michael Key (Key & Peele), Elizabeth Banks and John Michael Higgins.  The one liners in this movie are stellar and function on surprise and a bit of wit (John Higgins' pre-women's rights movement comments are outrageous and hilarious).  I rather enjoyed it.  If you're not expecting a perfect comedy and have appreciation for acapella performances, you're going to really dig what Pitch Perfect 2 has to offer."}, {"rating": "7", "text": "After an opening number setback, the Bellas re-group to win an international competition. Every character gets a few quick story beats with Anna Kendrick as the leader and Hailee Steinfeld as the new member. Rebel Wilson enjoyably carries the comic load with help from the hilarious commentators John Michael Higgins & Elizabeth Banks (who also directed). There's lots of music with pleasing arrangements, but the staging was better on \"Glee.\" It moves at a lively pace with youthful energy and spunky fun all around. NOTE: Stay thru the early credits for \"The Voice\" gag."}, {"rating": "6", "text": "More of the same from the Belles in this follow up to the surprise hit that was Pitch Perfect. It suffers from being overlong, and from a lot of the jokes falling flat, but fans of the original should find enough to like to keep them amused. The novelty has worn off since the first film, and the choice of songs seems somewhat odd, but expect to see a third instalment in a couple of years"}, {"rating": "6", "text": "We don't get the extreme popularity of this movie, although it was enjoyable. We really liked the couple who follow them around and insult them, that was particularly funny. Fat Amy actress always stands out in every movie she's in. So it had its moments for us."}, {"rating": "7", "text": "Good sequel to the smash hit kept all the good stuffs, including the accapella set pieces and great chemistry between the casts, but lack the freshness of the original. Still loads of fun and further proof that making films to ward the female market is infinitely more profitable than other types of blockbusters"}, {"rating": "4", "text": "At times the movie is horrible but for the most part it didn't get on my nerves as much as the first. Songs are more recognizable even though the auto-tuning is godawful. The host Elizabeth Banks and John Michael Higgins are really the only good thing about this film."}, {"rating": "8", "text": "It is so much better than I expected. I really loved the first movie and i was a bit skeptical for the second one because you know how sequel can be so much worse lately. I think why this movie works is because they're playing it safe by using the same formula as the first move and that's okay. It is really an ensemble movie since everyone has their own moment and It is very refreshing to see a teen movie that's not full of cheesy love story. Acting-wise, every one did a really great job. No one really stands out more than the other. The humor is fine. There are a lot of LOL moments involving Rebel Wilson, Adam DeVine, Keegan Michael Key, Anna Kendrick and the rest of one liner bellas."}, {"rating": "7", "text": "Though this has a lot of the same beats as the first one, there are still some new fresh moments that made me laugh.  There are a few story elements that I wish they would have made more interesting but overall it was entertaining.  B"}, {"rating": "4", "text": "Not a good movie. The jokes were flat, the songs mostly mediocre, the drama forced. Maybe I was missing something because I didn't watch the first one, but as a stand alone movie, it  wasn't good. For reference, I have heard several of the songs from the first movie, and they were mostly considerably better. That is why I was interested in the first place. (That and Anna Kendrick is very pretty, with a good singing voice.)\r I found myself only enjoying the movie at all when Emily (Hailee Steinfeld) was on screen. She is a very talented actress,  and a competent, though not the greatest, singer. I loved her. I was just about done with the movie when she first showed up, and that didn't even take very long to arrive. Once she did show up, I couldn't leave.\r Still there were moments (even ones Steinfeld wasn't in) that worked.  I sat there until the end, and didn't totally hate those two hours. I would not recommend this movie to anyone, but I'm not shocked there are a large number of people who like it. I might rate this a couple points higher if the first few minutes weren't terrible, because it was hard to shake that initial impression."}, {"rating": "6", "text": "This movie is definitely a good laugh, but just simply isn't as great of a movie as advertised. Yes, there are some funny, cheesy moments, but it almost seems like the writers were trying a bit too hard.\r Secondly, this does NOT fit the normal movie plot-line. It focuses around a girl who joins the group and the journey to the finals, not including rehearsals.\r Finally, it was just too damn predictable. From the beginning, when Becca, (Anna Kendrick) asked, \"What if we win the finals?\", It was obvious that the Bellas were to win.\r Overall, this movie is okay, but not worth seeing in theaters."}, {"rating": "6", "text": "Director Elizabeth Banks unfortunately brings us a reboot of Sister Act 2 with somehow an even more predictable plot. The Bardon Bellas must battle acapella group DSM in a World Championship to regain their glory, however the evil German team sounds waaaaaay better than they do, like, for real. Banks also manages to give herself the funniest role in this film, leaving not much in the way for the rest of the cast. So-so rental."}, {"rating": "5", "text": "Even though the musical numbers are great and the film is mostly entertaining, \"Pitch Perfect 2\" fails in upping the stake, and some of the jokes and storylines are awkward."}, {"rating": "8", "text": "Pitch Perfect 2 is much better than it's predecessor, the first Pitch Perfect film was funny but it didn't aim for the high laughs and had unfunny gross slapstick humor. This isn't the first time that Elizabeth Banks had direct she directed a segment from \"Movie 43\" (wrap your mind around that one), but Banks does a pretty god job with the comedic timing and let her actors shine and elevate Kay Cannon's screenplay. This sequel is definitely better than the original, it delivers sharp humor and has some heartwarming moments also a few stereotypical humor which is kind of funny. When the Bellas perform at Lincoln Center in front of the president, fat Amy (Rebel Wilson) accidentally shows her you know what, now the whole world knows and the Bellas are humiliated. In order to clear their names, they have to win an international  competition, which no american team has ever won before. Know they need to strengthen their relationship and their sisterhood. Pitch Perfect 2 isn't perfect but it gets the big laughs also has some enjoyable performances. Grade B+"}, {"rating": "7", "text": "This is an entertaining but at times unfocussed movie directed with great enthusiasm by Elizabeth Banks. The musical portions are far more entertaining than the dramatic sections. It's a bit of rollercoaster ride with plenty of highs and lows but I can't say that I hated it. For me the best part is Rebel Wilson, and Adam DeVine is always fun."}, {"rating": "7", "text": "Pitch Perfect 2 is one of those sequels that isn't quite as good as it's predecessor, but uses the formula to remain entertaining. Much like the first film the cornerstones are the musical pieces and the humor, despite some racism/sexism. A good area of growth was the character development, as many characters are questioning their place on the team, and their futures which is interesting to watch. One problem I did have was with some of the jokes in the film, as they were a little repetitive, and at times too crude. In essence Pitch Perfect 2 is a fun, Glee Inspired, Musical with a few too many crude jokes, and cliches, but remains an entertaining sequel, that will please fans of the original."}, {"rating": "5", "text": "This isn't a bad movie but it is an average sequel. To Be honest I love the first movie,I enjoyed it with my friends .Pitch Perfect 2 however is still enjoyable, The characters have a great chemistry and the A Capella performances are great just like the original.Some jokes are funny and some are forced out.Pitch Perfect 2 is basically like it's original cause they use some elements from the original.The Music is what I love in this film it is wonderfully done and so catchy. Pitch Perfect isn't great as the original but if you love the original this movie won't disappoint you or may disappoint you but it is all up to you.mostly Teenage girls will love this.Anyway do you I recommend it? The answer is well up to you cause I don't know there is ups and downs in the movie and I think some may get bored of this except the A capella performances."}, {"rating": "10", "text": "o filme é otimo, nao sei por que as pessoas estao reclamando tanto, é engraçado/emocionante/musical, nesse 2 filme tem muito mais musica o que é bem mais legal."}, {"rating": "5", "text": "Pitch Perfect 2 was actually more entertaining than I expected it to be. There were some genuinely funny moments and the pacing was nice. That being said, this movie felt a lot like a 2 hour recreation of Glee, but with the cheesiness amplified by 10 (if you can even imagine that being possible). I get that that's sort of their schtick, but there were parts that were cringeworthy, and I wished they had focused more on character development rather than the cookie cutter plot. Also, Fat Amy was the clear highlight."}, {"rating": "5", "text": "Same recipe, a big mess is made at the beginning and then it's the road to redemption. Pitch Perfect 2 is not as subtle as the first one, I mean pretty much everything was heightened, Rebel Wilson had more jokes, the weird characters are even weirder. The film was so so weird, at one point I was asking myself if I outgrew Pitch Perfect. Seriously I couldn't believe what I was seeing because it was quite a step down from the first one, which I still like.\r I find a few things to like in the movie, Anna Kendrick's storyline was quite interesting, it was actually one of the few that showed some sort of evolution of her character. The others were basically a spoof version of themselves -  that's saying a lot because Pitch Perfect 2 is a comedy after all. The music was catchy, really OK for the most part, and the battle scene was arguably the best one in the movie, more so than the finale performance. The finale was kinda sweet but that's all it was.\r Anyway the movie was a bit of a mess, funny at times but a disappointment for me, it barely gets a passing grade. @wornoutspines"}], "recommendations": ["pitch_perfect_3", "pitch_perfect", "deadpool_2", "zombieland_double_tap", "thor_love_and_thunder", "friends_with_benefits", "the_cobbler", "the_break_up", "logan_lucky", "tag", "jumanji_the_next_level", "the_wedding_ringer", "baywatch", "a_bad_moms_christmas", "mortdecai", "the_five_year_engagement", "coming_2_america", "forgetting_sarah_marshall", "the_green_hornet", "this_is_the_end", "couples_retreat", "identity_thief", "peter_rabbit", "rough_night", "ted_2"]}