{
  "id": 1849,
  "title": "Pitch Perfect",
  "starring": [
    "Anna Kendrick",
    "Brittany Snow"
  ],
  "runtime": 112,
  "genre": [
    "Comedy",
    "Music",
    "Romance"
  ],
  "description": "College student Beca knows she does not want to be part of a clique, but that's exactly where she finds herself after arriving at her new school. Thrust in among mean gals, nice gals and just plain weird gals, Beca finds that the only thing they have in common is how well they sing together. She takes the women of the group out of their comfort zone of traditional arrangements and into a world of amazing harmonic combinations in a fight to the top of college music competitions.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ntRIoh8Qf1BI1AYGx0STfq0wUmb.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.242424242424242,
    "ending": 7.333333333333333,
    "soundtrack": 7.8,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.3125,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "First of all, I was really reluctant to watch this movie because I am not a fan of musical films and especially films which seem like they're the sisters to 'Glee' but anyway, I thought I should give it a try. Pitch Perfect is a really great pastime, to be honest. It's funny, surprising and a little adorbale at the same time but this is definitely not one of the best films of 2012. I loved the performance of Anna Kendrick. Her character is funny, confident and, without a doubt, good at being spontaneous. I read it yesterday that possible sequel might happen next year. Well, here is my advice to the crew. Don't make a sequel, it is going to suck. Learn something frorm Step-Up franchise. Anyway, the best thing about this film is that it ends after 1 hour and 45 minutes, it would have gotten bad otherwise."
    },
    {
      "rating": "5",
      "text": "Funny movie, but about 85% of the laughs come from Rebel Wilson who portrayed Fat Amy. The music is great. And even thought Wilson is hilarious it feels like they rely on her one liners."
    },
    {
      "rating": "6",
      "text": "The verdict: Okay. Unfortunately, at it's core the film is a very well-worn path: bunch of semi-losers manage to win. Anna Kendrick is the only one who manages to infuse a character with any sort of personality, but she's too hot to be a genuine outsider, and her lines are way too scripted. She also listens to pure pop music, despite sporting various body piercings and being supposedly \"alternative\". Like, who at that age doesn't know who David Guetta is? Her character wants to create music, but all she does is cut up pop songs and remix them (which you never actually hear anyway). At college age if she isn't either DJing up a storm or at least writing her own material, then it makes her look like a naive kid. The rest of the cast are cardboard. Rebel Wilson is funny-ish, but not in any way that another actor couldn't have done. Some funny lines, some snappy dialogue, and overall very staged scenes. Almost every scene actually feels scripted, rather than organic. The \"awkward\" scenes are highly unbelievable. This caused me to get taken out of the film's narrative. The Glee-style music is also way too good, especially for people who are mixing in high-energy dance moves. In the space of about 10 minutes the Barden Bellas go from getting kicked out of a fraternity show because they suck to managing \"pitch perfect\" impro songs in a disused swimming pool. It's like no one ever thought of singing anything other than 80s songs. That kind of simple naivety unfortunately makes the film feel a bit immature, like a Glee version of Step Up. Overall it's a pretty good attempt at a lite chick-flick, but I wish it had been directed and handled better. It's let down by the cookie-cutter nature of the plot, heavily scripted moment, and no heart."
    },
    {
      "rating": "8",
      "text": "Pitch Perfect is a very enjoyable film with a great premise, good acting and great acapella remakes of songs we know and love. However the film is stopped from reaching the greatness it deserves due to some pretty bad and damn near unforgivable mistakes that near enough every film addresses but Pitch Perfect does not.\rPitch Perfect follows the story of Beca, a wannabe DJ freshman at Barden University. When her singing talent is spotted by one of the girls from a singing group on campus she is invited to join them to attempt to win the National Finals at the end of the current year. Now Pitch Perfect has a good story, though it has been done many times before it hasn't been done as well as this in a while but it falls flat in major areas. Biggest area of problem is the character development or lack thereof. Hell I even had to look up the Wikipedia page to remember Beca's name because characterisation became a back-seat, plus the directors knew they hadn't characterised by suddenly introducing everyone properly 10 minutes before the end of the film! The film also had a bad sense of time, it would jump months at a time with no indication that time had passed, the only time it tells you is when it reaches a significant competition date.\rMy biggest complaint with the movie though was the utterly pointless idea of \"the best part of a film is the ending\" that was introduced by the love interest when watching The Breakfast Club. This whole theme that is very well fleshed out and referenced a lot leads you on to believe that the ending will surprise you and be different to anything...ever. However what it boils down to is the same 'everything is OK in the end' scenario where the guy gets the girl, the protagonists win the battle and that life will go on. Now yes its a feel good film but if you make such a big deal out of good and different endings that are unpredictable why make your ending so predictable that you could guess what happens without watching the film???\rRegardless of the bad points Pitch Perfect is well acted, funny and a great film for a night in with friends that are both boys and girls (there is more than enough to satisfy the dudes in this one as well as the women) one worth a watch even with its stupid decisions."
    },
    {
      "rating": "7",
      "text": "It's a pretty standard formula film but the performances of Kendrick, Snow and Camp are exellent and Elizabeth Banks and John Michael Higgins provide some great sarcastic humor in cameo parts. Not oscar material or nothing you would put on your all-time favorite movie list, but nice porpcorn entertainment."
    },
    {
      "rating": "9",
      "text": "It's a rocking musical entertainer with a heartwarming display of music which won't fail the audience. It was funny as well as romantic musically. I just loved it."
    },
    {
      "rating": "7",
      "text": "As the sequel is already out  .Now it is the time I review the original Pitch Perfect.\rThe first time I heard Pitch Perfect is going to be released and the plot is all about an A Capella,I was skeptic about it and curious if the movie would work. Surprisingly the movie is good.The characters are funny and has a great chemistry.I was amazed it is good.The sequel is kind a bit the same and disappointing,the first film  is the best."
    },
    {
      "rating": "10",
      "text": "Very funny movie is entertaining. The music is great, the acting is awesome, and fat Amy is just hilarious. Most of the jokes actually make sense are funny. I look forward to see Pitch Perfect 2"
    },
    {
      "rating": "7",
      "text": "\"Pitch Perfect\" apresenta-nos uma boa história e espetáculos agradáveis ao olhar, porém, no que toca ao canto... poderia ter sido muito melhor.7/10"
    },
    {
      "rating": "10",
      "text": "So funny.  Rebel Wilson will become famous because of this film.  Highly recommended.  My wife dragged me to this one, but I am glad that I went. 10/10"
    },
    {
      "rating": "6",
      "text": "Perfect Pitch is not a great movie .. but it is entertaining."
    },
    {
      "rating": "5",
      "text": "Pitch Perfect is about a young girl named Beca (Anna Kendrick) who is attending college for the first time. Her dad, who is a teacher at the University, is up her ass the whole time about making new friends, and trying new things"
    },
    {
      "rating": "10",
      "text": "You know whats crazy? This PG-13 comedy is funnier than both \"The Dictator\" and \"21 Jump Street\", which are both R rated. Thats how funny this film is. Combine that with some extremely high energy and you have a pitch perfect movie."
    },
    {
      "rating": "9",
      "text": "It's charming and fun.  What's not to like?  Anna Kendricks is wonderful in this movie.  Sit back, relax, listen to some great young voices, eat popcorn and chocolate covered raisins and smile."
    },
    {
      "rating": "9",
      "text": "A hilarious movie with lots of laugh out loud moments! Gets a little cliche at times, but Rebel Wilson always comes back to save the movie with punchy one-liners!"
    },
    {
      "rating": "10",
      "text": "Pitch Perfect, a perfect movie :D really, is funny have somethings that look like the TV Show \"Glee\", but this movie have other things that look like \"Bridesmaids\". Funny movie, great performances, awesome development. Pitch Perfect is great!!"
    },
    {
      "rating": "8",
      "text": "Pitch Perfect is an extremely joyful and funny film full of wit and great dialogue. The jokes spew forth (quite literally on two occasions) at the rate of knots and all performances rise to the occasion wonderfully. Comparisons with Glee are inevitable, but singularly favourable to this achievement (No sequel please). Glee became joyless for me quite quickly (aside from some wonderfully staged musical numbers) and it was also very po faced about issues and story lines (I use this term very loosely as I don't think it really had any ongoing story. It just kept telling us how socially (Ir)relevant it was). Pitch Perfect has no such heavy issues on its mind. It's fun all the way to the closing credits. The choice of music is great and these numbers are energetically staged. Another delight is the banter between Capella hosts John and Gail played with acerbic relish by John Michael Higgins and Elizabeth Banks, respectively. In summation, echoing a sentiment vocalised by actress Rebel Wilson to a couple of skinnier cast members, this film, like them, has a fat heart."
    },
    {
      "rating": "8",
      "text": "I'm a 19 year old guy and i loved this movie, enough said. Anybody can enjoy this movie. It's flat-out hilarious! Great cast, great music, great story, and a great time, 4 things you'll experience when watching Pitch Perfect. This is a must see! 8/10"
    },
    {
      "rating": "10",
      "text": "I'm like , additction to this movie. Anna Kendrick and Rebel Wilson get together. F*cking Awsome ! I think this is one of best movie so far. It makes me smile and in love with characters . Love this !"
    },
    {
      "rating": "8",
      "text": "A capella breathes some fresh life into some standard teen movie plotting (only this time set in college as opposed to high school) and allows the group competition element to come to life in a new way. The musical numbers are well done and exciting. All backed by talented performers and excellent choreography.\r While that definitely adds the needed spice to keep the familiar plot from getting stale moving forward, what really sets the movie apart from the pack is the humor. These are some very funny ladies. Match that with the sharp writing and you've got some really funny moments to be found throughout.\r Likable characters, excellent musical numbers, and hilarious moments make for an enjoyable film even if it doesn't stray too far away form the established mold in the plot department. It's a great comedy and musical, one that is very likely to entertain.\r My total score for the movie is an 8.6/10."
    },
    {
      "rating": "2",
      "text": "Despite the movie having funny moments, the plot leaves much to be desired. The love story the film is built around felt really thrown together and I was constantly feeling like I was supposed to care but because it was so poorly written, I didn't. The film is one of the most predictable cheese fests of all time, and the last act is really bad.\rI am generally a fan of musicals, but this one is worth missing despite the high praise it gets from critics and viewers alike. The funny moments aren't worth the IQ lowering remainder of the film. If you're critical about plot, avoid this movie like the plague. It's full of plot holes and lazy writing."
    },
    {
      "rating": "8",
      "text": "Debo confesar que si hubiera llegado al cine no la hubiera visto, pero sin duda es uno de esos casos donde agradeces tener cable y no tener nada que ver, la formula es sencilla pero funcional, y mejor aún te dan ganas de que la vida fuera un musical."
    },
    {
      "rating": "6",
      "text": "i saw this film  too many times . the comedy is well and some of it was just gross and replusive .  Grade B- ................................................................"
    },
    {
      "rating": "1",
      "text": "WHAT I LIKED: Rebel Wilson is hilarious - every amusing comment and remark she makes causes laughs and giggles. It almost feels as if she's taking the mickey out of the film itself! Plus some of the musical arrangements are fairly good.\rWHAT I DIDN'T LIKE: Everything else... This has to be one of the most cringey and cliched, plot-less and dull films out there. Even a lack of any serious sub-message or convincing characterisation... really?\rVERDICT: With nothing to enjoy unless you're five, 'Pitch Perfect' misses the mark. If it wasn't for the hilarious fat amy - it wouldn't even be funny."
    },
    {
      "rating": "8",
      "text": "Pitch Perfect was funny, awesome, and a film that really made people interested in movies about music. It is really heartwarming and exciting."
    },
    {
      "rating": "6",
      "text": "It's light fun - the target audience for the film, who were sitting all around us, were having a GREAT time with it.  The singing is terrific, but the finale song/dance sequence just didn't deliver for me like it could have because they had to shoehorn the Breakfast Club aspect into it.  Anna Kendrick, Snow, and Camp are all getting a bit long in the tooth to be believable in these roles, btw. Skylar Astin seems like a candidate for the unlikely anti-hero in future films. Rebel Wilson is perfect in the film because she doesn't over-act at all.  She has terrific control of her craft."
    },
    {
      "rating": "6",
      "text": "Generic characters and story but the film has some good humor and amusing side characters (the girls in the Acapella Group), which makes this film worth checking out."
    },
    {
      "rating": "6",
      "text": "It was not pitched perfectly for me, but I guess I was never the intended target audience.  My young daughter found it delightful though and I guess I can't argue that the acapella parts were somewhat enjoyable..."
    },
    {
      "rating": "6",
      "text": "Pitch Perfect was a decent comedy that finds a heavy amount of parity with the TV show Glee.  I enjoyed the film but left feeling like I never really needed to watch it again (though I may, given that a second movie is releasing soon from the time of me writing this review).  Rebel Wilson carries most of the comedy as Fat Amy, but I felt like the writers relied on her character too much for the film to find anything close to greatness with me.  Be that as it may, I can still suggest the film for anyone finding interest in the premise of the movie because I've heard several of my friends have greatly enjoyed the movie.  Perhaps Pitch Perfect 2 will improve in trouble spots, because there is a really good movie waiting in the wings once the criticisms can be addressed with this first Pitch Perfect movie."
    },
    {
      "rating": "5",
      "text": "I was all pumped up to watch this movie. And it was such a let down for me, it wasn't as  funny  as i thought is was going to be.  it could have been a hell of a  lot funnier than what it came out to be. Rebel and the Asian girl were the highlights of this movie"
    },
    {
      "rating": "7",
      "text": "Ok. Obviously a \"woman's film\" but not too bad. Not as predictable as you'd imagine and plenty of gags, with a likeable cast and decent glee-style moments."
    },
    {
      "rating": "5",
      "text": "It is always entertaining to see a lot of young people on a stage singing and dancing their hearts out, especially when they are always in synchronization and in perfect harmony—as long as one ignores the odd circumstance where the group leader vomits on stage because of nerves. This is a film about a cappella singing, which is group or solo singing without any accompaniment. To compensate, the performers can mimic percussion and other instruments with their voices. In other words, they “make music with their mouths.” It is depicted as a subculture on college campuses, with a series of national competitions that result in a grand prize for the ultimate winners.\r All actors can sing, dance, and fence, as well as act, and this movie is a good excuse to let them do all those things (minus the fencing). The film is almost a showcase for Anna Kendrick, who plays Beca, a disgruntled undergraduate who would rather be DJ'ing in LA, but who has promised her professorial dad to at least give higher education a chance. She arrives on campus and the very same day is approached by The Bellas, an all-female a cappella group that desperately needs to beef up their membership and to repair their damaged reputation. Although Beca has expressed no interest in singing and performance art, she joins the group and becomes the star performer almost immediately. A petite brunette, she is physically slender and beautiful, as is the red-headed Chloe (Brittany Snow) and blond Aubrey (Anna Camp). Beca's soulful eyes are always professionally made up with black eyeliner that must be waterproof, because her make-up is perfect even when she's in the shower and when she's crying.\r In case this kind of blond, brunette, and red-headed perfection is sending the wrong message to anorexic undergraduates, the group (in desperation) accepts Fat Amy (Rebel Wilson) as a new addition.  They also welcome an African-American (Ester Dean) to their ensemble. However, these less conventional characters are presented as parodies. Even the one Asian in the group (Hana Mae Lee) has some kind of exaggerated speech defect that renders her almost inaudible when she is speaking; it is not clear how she is able to project her voice as a singer in the group.\r It all comes together when the group starts their sassy, sashaying stage numbers, which are all excellent. The producers have forged ahead with Pitch Perfect II, which is opening in another week as of this writing. At this point, the actors who are playing undergraduates are in their late 20's; Kendrick and Snow are 29, and Camp is 32, which is only going to strain credulity even more."
    },
    {
      "rating": "7",
      "text": "I shouldn't like this film, but I did!!! Great soundtrack first of all, and the cast took what is a typical 'go for the top, competition' type of movie and ran away with it.  Funny, filled with lots of gags and charming characters, one of the better comedies of this year."
    },
    {
      "rating": "7",
      "text": "Pitch Perfect was genuinely funny and didn't take itself too seriously. The musical arrangements were actually pretty decent though and the comedic elements were not traditional at all making them even more humorous. The only things that hold hack the film, in my opinion, are the generic plot and Anna Kendrick's lack of any charisma whatsoever. The plot is the exact same as almost every single other music, dance, etc. movie made in the last decade: Protagonist joins team/club/group that is struggling, they go through bumps along the way, protagonist either quits or comes close to quitting, protagonist gives it one last go and helps the team/club/group achieve their ultimate goal all while experiencing relationship issues throughout. As for Anna Kendrick, I think this movie showed that, while she's talented, she's not capable of being the focus of any movie. Characters like Fat Amy distract the audience from Kendrick's utter lack of charisma or charm. Honestly, her character is one of the least interesting characters in the entire film. Regardless, this movie is still worth watching because of the humor alone and the musical arrangements are a nice bonus."
    },
    {
      "rating": "10",
      "text": "This film is hilarious I have to agree with  EFYevan,  Rebel Wilson  is great and stills the show and we will be seeing a lot more of her in the future also some great tunes,but most of all very funny  the whole cinema was laughing all the way through the film well worth a watch."
    },
    {
      "rating": "6",
      "text": "Despite a few dozen cheesy moments, it sure was good fun! Another strong performance by Rebel Wilson as well as Anna Kendrick. The musical moments will make you smile!"
    },
    {
      "rating": "8",
      "text": "While “Pitch Perfect” isn’t perfect, its pitch is just right. All bad puns aside, this is a enjoyable film. It starts off a bit disjointed and weird for the sack of being weird. However, when the film gets rolling, it becomes a ride of non stop laughter. The direction is solid, but the choreography is extravagant and well done. Songs are well integrated into the story, but I just wish they had used less tired songs. The writing is solid, but if not for the characters the jokes wouldn’t be as funny as they are.\r Speaking of characters, this film has a cast of some colorful characters. Some of the characters aren’t very likable at first, but 5-10mins with them you’ll fall in love. They’re funny and warming especially Fat Amy and a few of the side characters. The physical comedy they provide is top notch and they’re always doing something in the background. One character I wasn’t particularly fond of was Beca, Anna Kendrick. She was the typical too cool for school kid and a very unlikable one at that. However, through my struggle to liking her, I found a mutual ground towards the end.\r Overall, “Pitch Perfect” is a good movie and very entertaining. The jokes are solid, but the delivery is what truly makes it worth while and hilarious. The music and soundtrack is great and I’m a sucker for any movie that uses  “Party in the U.S.A.” There is a lot of fun to be had with this film, from its characters to its physical humor. Definitely the best musical I’ve seen all year and in a while. I give it a solid 4/5, doesn’t quit hit those high notes, but still manages to be fully entertaining and a fun watch.    “Muy Caliente”"
    },
    {
      "rating": "9",
      "text": "It's one of the most entertaining movies you will see in 2012. Anna Kendrick and Rebel Wilson are absolutely wonderful in this. The songs are great, the musical numbers are a joy to watch; it's heartfelt, hilarious, full of memorable characters and works as a great college film. To simply put, Pitch Perfect is why we go to the movies"
    },
    {
      "rating": "8",
      "text": "Although this film at its core is just another teen flick (ala Bring It On in particular), it does offer some freshness especially with its soundtrack. I do have a bit of a bias in that I have a great love for all things A Cappella. It just is so nice to have a film filled with so many A Cappella tracks, not only that, A Cappella tracks that don't sound like they've been heavily edited. I've seen Skylar Austin live before when he was in Spring Awakening on Broadway and I was so happy that they had him as the lead in this film considering his background and such. Anna Kendrick also was a nice casting choice. Her role in Twilight was probably the best part about the film as her comedic timing is impeccable. I guess the only critique that I have is that at times the movie seems a tad shallow but overall it's a nice blend. It's not a masterpiece by any means, but it's a least a great film to just pass the time."
    },
    {
      "rating": "10",
      "text": "One word: Hilarious. Even though I'm not really a fan of musicals, through out the whole movie laughing was my best friend. It had a fun and funny story plot. From the jokes, to the singing performances, it was all pretty well done. Great actors to portray those awesome characters. A very fun film!"
    },
    {
      "rating": "8",
      "text": "Pitch Perfect is a killer comedy film. It's filled to the brim with funny moments and these are supported by it's all around great cast. It's funny and has great music the only flaw of this film is the fact that it does fall into some of the romantic type comedy stereotypes, but that aside Pitch Perfect is an excellent film."
    },
    {
      "rating": "7",
      "text": "Quite funny with good music and then, on top of that, I absolutely love Anna Kendrick, so it'd make sense that I like this movie. It's not fantastic by any stretch of the imagination, but overall, it's pretty good."
    },
    {
      "rating": "1",
      "text": "it hurts so bad that a film called pitch perfect has to have so much fake autotune in it. give me sister act any day.  or here's an idea... for a film about singing, maybe they can actually showcase their actual singing? I heard a practice session for the movie and it is so much better. these people can actually sing, it's an insult to go over it with unnatural computer algorithms."
    },
    {
      "rating": "8",
      "text": "\"Nothing makes a girl feel more like a woman than a man who sings like a boy.\" I was really excited about this movie.  I figure it would be a lame comedy that I would love, just another one of those bad movies that you watch and really enjoy but know are bad.  I was really wrong: this ended up being a really amazing movie that I absolutely loved, and despite the fact that it was a cheesy comedy it was also legitimately good.  I laughed so hard during Pitch Perfect, despite the film's inclusion of period moments of bodily fluid humour.  I'm not sure if I've said it before, but I'll say it now: I hate humour that involves some sort of human waste or bodily fluid.\r Pitch Perfect follows Beca (Kendrick), an anti-social music lover who dreams of being a music producer but is being forced by her father to attend Barden College, where he works.  While at first she fulfils the anti-social requirements eventually she is pushed into joining the Barden Bellas, one of the campus' four acapella singing groups - other groups include the Bellas' primary rival, the all male Treble Makers, lead by Bumper (DeVine).  The Bellas are lead by seniors Aubrey (Camp), who believes that the group can win it all using traditional methods, and Chloe (Snow), who's more inclined to make some changes.  Rounding out things is Treble Maker and fellow freshman Jesse (Astin), who very quickly takes an interest in Beca.\r The thing I liked most about Pitch Perfect was that this movie knew exactly what it was and just went with it.  It was a lame comedy and never once tried to be anything other than that.  There were a few more dramatic moments - notably when it came to Beca's relationship with her father - but for the most part it was one liner after one liner. Rebel Wilson and Elizabeth Banks in particular were awesome, with just about everything that the two of them said being a joke.  What I really liked about the humour, though, was that there were a lot of moments where the joke completely took me by surprise and left me thinking \"wait, what'd they just say?\" then laughing once it sunk in - and I wasn't the only person in the theatre reacting like that.  The other thing that worked about it was the fact that even in the more dramatic moments, or even just the singing, they did a lot of cutaways to other jokes.  Elizabeth Banks' character, very minor role, is one of the commentators of the competitions and one of my favourite moments is a cutaway to her and the other commentator rocking out to the song.  It was just perfect.\r One thing that has the potential to take away from the overall film is the fact that a lot of the characters fill a stereotype of some sort.  I found that it worked and I didn't personally need more development on any of the characters, but I'm sure that others might have a problem with this. Jason Moore took some stereotypical people and had fun with them, and I applaud it.\r http://ishreviews.blogspot.ca/2012/10/pitch-perfect-2012.html"
    },
    {
      "rating": "7",
      "text": "Aside from some hit or miss plotting, this musical comedy does just as the subgenre should - it delivers some solid laughs and many fine sequences of sheer musical talent."
    },
    {
      "rating": "6",
      "text": "A huge hit! Pitch Perfect is so much fun. It's not the most hilarious comedy I've ever seen recently, but there are some funny moments throughout. Add to that some great musical mash-ups and some solid performances, you get a good movie. Check it out! There's a lot to love here."
    },
    {
      "rating": "8",
      "text": "While I started to go off shows like Glee, this film was nothing but some outstanding performances from the leads and some great songs to get your toes tapping. Not only that but theres a decent storyline in there too so I quite enjoyed it. Anna Kendrick is good but clearly Rebel Wilson stole the show as Fat Amy  Fans of the Glee craze will obviously be at home but I think it has the appeal for others also, and as a whole it's a thoroughly entertaining film I would recommend"
    },
    {
      "rating": "10",
      "text": "This movie is about an cappella group of women coming together for a common goal. Cappella singing is seen as a men's thing because they are able to hit lower notes. I can not even count how many times I have seen this movie. This movie is extremely funny and relates to not only females but also males. The music is popular music from the 80s, 90s and 2000s. This is a must see movie!"
    },
    {
      "rating": "8",
      "text": "Something about Pitch Perfect just makes you want to keep coming back to watch it multiple times. Many people seem hesitant to watch a movie based strictly on a cappella groups, myself included. I was pleasantly surprised with the story line and characters that were cast. Rebel Wilson makes the film with her witty one-liners and sarcastic personality."
    },
    {
      "rating": "5",
      "text": "Corny and bland characterization, but it does do what it does best, and that is to entertain. It is pretty sad though when most of the laughs only comes from one character, Fat Amy."
    }
  ],
  "recommendations": [
    "pitch_perfect_2",
    "pitch_perfect_3",
    "tag",
    "friends_with_benefits",
    "forgetting_sarah_marshall",
    "the_nice_guys",
    "yesterday",
    "mamma_mia_here_we_go_again",
    "logan_lucky",
    "palm_springs",
    "neighbors",
    "blockers",
    "the_five_year_engagement",
    "17_again",
    "clueless",
    "the_break_up",
    "grease",
    "a_bad_moms_christmas",
    "ghostbusters",
    "sisters",
    "deadpool_2",
    "central_intelligence",
    "easy_a",
    "the_king_of_staten_island",
    "mortdecai"
  ]
}