{
  "id": 868,
  "title": "Pixels",
  "starring": [
    "Adam Sandler",
    "Kevin James"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Comedy",
    "Science Fiction"
  ],
  "description": "Video game experts are recruited by the military to fight 1980s-era video game characters who've attacked New York.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rV5DzghQv6z6Yagak6ysKE77nuf.jpg",
  "categories": {
    "plot": 3.5806451612903225,
    "acting": 4.206896551724138,
    "ending": 2.0,
    "soundtrack": 4.0,
    "cinematography": 0.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 3.875
  },
  "reviews": [
    {
      "rating": "2",
      "text": "The impressive special effects and the videogame nostalgia can't save Pixels from being a boring, unfunny, predictable, plot hole filled mess from start to finish. And Kevin James is president? Seriously?"
    },
    {
      "rating": "0",
      "text": "Not going to even bother giving my pros or cons with this film because everything sucks in it. Adam Sandler continues to ruin everything he touches. He's lazy, boring, and needs to leave hollywood now. Horrible casting choices (Kevin James has no place as the President in any universe), terrible plot considering the concept, and an overall disgrace to video games. Worst film I've seen in 2015 without any doubt in my mind."
    },
    {
      "rating": "1",
      "text": "Suffice to say, Pixels isn't worth the price of a 3D ticket, despite its handful of colorful action sequences. (The conversion is actually decent, though it is flat in spots.) While the basic premise of the movie is a good one, Sony and Happy Madison's take on the material is laughless and insufferably dull. In the end, you'd be better off spending your quarters at an actual retro arcade."
    },
    {
      "rating": "10",
      "text": "In all honesty this movie is probably more like an 8 but I felt it should get a bump for all the hate that it is receiving.  I took my 3 children, 13, 5, and 3 and they were all extremely entertained.  I too thought the movie was pretty damned funny.  There were very few moments when I was not laughing.  It was an original and entertaining story with plenty of laughs and action.  Adam Sadler, Kevin James, and Josh Gad were all funny, and I usually do not find Kevin James tolerable, and Peter Dinklage is absolutely hilarious.  In closing I thought it was an all around enjoyable movie and, to be honest, the best of the summer blockbusters so far."
    },
    {
      "rating": "10",
      "text": "Pixels can merge comic scenes and action of a very simple but great and by far one of the best movie of Adam Sandler , special effects are to be congratulated , performances could be better but they are good ... fun for the whole family and a certain sense of nostalgia ."
    },
    {
      "rating": "5",
      "text": "I expected it to be terrible and surprisingly, It wasn't. Sure it wasn't the best plot wise but the good amount of comedic moments through out sort of made up for it."
    },
    {
      "rating": "8",
      "text": "For me, this had a lot going for it; being a child of the '70's / 80's I fondly remember arcades and the amount of money and time I wasted on them.  This brought all that back to me.  I know that the concept of the film is ludicrous but it is a comedy film and it made me laugh a lot and out loud.  So in my eyes, that's good."
    },
    {
      "rating": "2",
      "text": "Oh god where do I even begin. your either going to love this movie or hate it.  Ok now let's start off with the positives. There were a couple times I laughed, The whole video games attacking earth was entertaining and the video game battle sequences were well done and for once Hollywood produced an original movie. OK that's it for the positives. Even though I laughed at a couple parts it was a pretty big mess from start to finish. The actin was mediocre, the script was bland and the whole idea of using women as trophies when they saved the world. BELCH. I watched this movie because I love old school aracde games and even though Adam sandler does not make good movies nowadays he has had a couple of good ones such as 50 first dates, bedtime stories, billy Madison blended and a few others. However his acting felt very flat and so did the rest of the cast. Predictable with a few entertaining movies does not save this movie from the mess it really is. Now I just need to ease the memory of seeing pixels from my head."
    },
    {
      "rating": "2",
      "text": "WOW...is there even a point to coming up with different names for any of these Happy Madison productions anymore? Seriously...every movie is the same movie as its predecessor... this could have been called Grownups 3 for all the difference it would have entailed ...same characters, actors, plots....\rDoes Adam Sandler even flinch at glorifying himself as a man-child in these movies anymore? Apparently not since he does it in every single damn movie he makes now....\rI mean seriously... Kevin James as president? Does Sandler even bother making any of these premises even remotely conceivable anymore? You need to stop playing nepotism with your friends and start making real movies with a real cast... Either that or just do us all a favor and stop making movies...\rPLEASE! Show us some mercy...."
    },
    {
      "rating": "7",
      "text": "Não é tão ruim assim. Tudo bem que não é o melhor filme do gênero, não tem um ótimo ótimo roteiro ou as melhores atuações, mas o humor e efeitos especiais fazem o filme funcionar. O humor do filme é em bom tom e não tem apelação, fazendo dele um filme chato para os amantes de \"comédias sujas\". Talvez por isso o filme não tenha agrado o público, por ser um filme mais pra família do que pra assistir com os amigos."
    },
    {
      "rating": "0",
      "text": "This movie felt like it was filmed with a camera on the shoulder of someone. The picture is horrible! The cinematography and special effects look like they were made with a free to download 3D maker software from a high school team class project! The acting is so poor that even Buzz Lightyear and Woody from Pixar's Toy Story have more EMOTION than Adam Sadler and the rest of the casting crew. The movie makes a decent try to reference the 80's through old time songs and even having a character dressed with jeans, spiky hair and ear rings similarly to the 80's fashion but the results end making him a parody (and no he was not meant to be a parody he was meant to be a cultural reference and they failed miserably on that).\rThe game fails to deliver any nostalgia regarding videogames of the 80's era. They even put cheating a videogame as a turning point to twist the plot!! No serious videogamer takes cheating or jokes about hacking a videogame lightly and it is definitely not appreciated!\rSave yourselves and do not watch that movie.\rTo whom it may be like-able? To people with absolutely zero judgement or low self estime!\rThe plot is very bad, the dialogues are pathetic, the graphics are pathetic and the movie sucks!\rDO NOT WATCH IT!!!!"
    },
    {
      "rating": "7",
      "text": "I enjoyed this, it was funny and entertaining. I don't understand the hate, I laughed a lot! The movie had a good story, but they could have made it longer, but it was good anyways. This doesn't deserve the hate it got, go watch it!"
    },
    {
      "rating": "1",
      "text": "Someone somewhere has noticed that retro style games on your phone or computer are popular and that Ready Player One sold bucketloads and 'nostalgia' is cool. Only problem, that person is an idiot who made a brainless kids movie aimed at 10 year old retards when actually the real audience is 30 and 40 somethings who actually played pacman."
    },
    {
      "rating": "2",
      "text": "So I just saw Pixels and it was pretty terrible and are you seriously surprised about that.\r -The acting was dank.\r- Adam Sandler not trying anymore.\r- The effect's were alright.\r- Josh Gad was so annoying in this movie, I mean he wouldn't stop shouting.\r- Peter Dinklage was the only saving grace in the movie.\r- Kevin James is an idiot.\r I know some are expecting a long detail review of this but to be honest I want to save my strength and energy for another movie I'm going to review and that's The Third Man. I'm really taking my time with that and make the best out of it so before I review a masterpiece like The Third Man, here's something really ****"
    },
    {
      "rating": "3",
      "text": "Pixels may have great special effects but the characters are unlikable and annoying, the jokes are wildly unfunny, the film has one of the worst written scripts i have ever seen and is just a very dumb film."
    },
    {
      "rating": "2",
      "text": "Just keep your finger on the fast-forward button until a videogame sequence, watch it, then fast- forward again until next videogame sequence and wach it.\rYou will enjoy the movie in 10 minutes. The rest isn't worth watching"
    },
    {
      "rating": "3",
      "text": "Video games really don't have a good reputation when it comes to having film adaptations. Sure we have a few good one's like Wreck it Wralph or Scott Pilgrim, but for the most part they seem to go down the same route as the Super Mario Bros movie where the film loses all the charm that made the game enjoyable to begin with. Part of the reason for this is they always seem to be put into dreadful hands. This time those dreadful hands are Happy Madison Productions, Sandler's film studio that have been producing his cinematic turds for 15 years now. And once again they have produced another insulting comedy, lacking any real charm and being light on laughs.\r The plot unfolds because back in the 80's NASA sent several video games in to space to communicate to extraterrestrials. But their message of peace was misinterpreted as a declaration of war and the aliens send several video game characters to attack the earth. Thus President Cooper (Kevin James) recruits his childhood friend and gaming champion Brenner (Adam Sandler) to fight off the alien invasion.\r Right away we've really got to suspend disbelief to accept the plot. Not just because of having to accept the poorly explained justification of why the aliens are attacking as video games, but also buying Kevin James as president of the USA. It's never explained how he became President, but unless Donald Trump was the only other candidate there's no way he could've gotten voted into the position. Especially considering he plays the same annoying character he always does of the dumb guy who does nothing but hang out with Adam Sandlers character.\r None of the other characters are much better. Sandler has as much charisma as a plank of wood. Josh Gad's performance as the nerdy friend is annoying from the start. The only one who gets even a chuckle is Dinklage as the over the top douchey rival, but even that gets worn out quickly. Also just like all Sandler productions we get a lot of offensive stereotypes. This time the focus is on geek stereotypes, like gamers are antisocial weirdo's who have no lives and live in their mothers basement. Albeit this isn't the most offensive stereotype, but it's still insulting one of the film's biggest audiences.\r Besides this there are other typical offensive representations we see in all Sandler movies, like women being nothing more than eye candy. In fact there are only two female characters in lead roles. The first is Michelle Monaghan who's in the film only to give Sandlers character somebody to flirt with. The other is Ashley Benson who plays one of the video game characters who comes to life, who not only doesn't get a single line of dialogue in the film but also ends up being a literal trophy for one of the characters.\r Having some of gaming's most recognisable icons, you'd really think the film would actually do something good with them. But it doesn't. The gaming characters will just attack Sandler and co. only for the humans to fight back and that's it. It never tries to actually make any jokes with these characters, but instead does the same thing as a film like Disaster Movie where it will try to get a laugh by just naming something popular. The only video game icon they do anything else with is Q*bert, who is one of their trophies to help them. But all they have him do is typical annoying Sandler humour like watching Q*bert wet himself with pixels and some weak slapstick.\r Although at least the gaming icons they use actually look good. It's not like the Mario Bro's Movie where Goomba's looked like a pear on the body of Frankenstein and instead the 3d CGI models maintain the charm of the original designs. But to me this makes the film even worse than typical Sandler comedies because it ends up feeling like such wasted potential. Had a better production been given the chance to use these characters, we might have got a charming homage to video games. But instead we got a typical Sandler comedy, just as unfunny as always but with a bigger effects budget."
    },
    {
      "rating": "6",
      "text": "Well... There is so much lost potencial in this movie, A MEAN LOTS OF LOST POTENCIAL. I freking love with all my heart vídeo games but just putting pacman in a movie doesnt make it good, in my opinion, If you really love videogames, like me, you will find some enjoyment in this movie. (Its way better than smosh the movie at least)."
    },
    {
      "rating": "3",
      "text": "i think  Sandler should give up his career pixels was awful, the story was very  rubbish and it has many other problems Adam Sandler acted very bad in this slumber movie"
    },
    {
      "rating": "0",
      "text": "To be serious this movie sucks. The Tom and Jerry Movie is better than Pixels. Foodfight is better than Pixels. THE ROOM, often regarded as the worst film of all time,is better than Pixels. Heck even Chris-Chan's effortless Sonichu comics are better written than Pixels. To sum it all up, ANYTHING is better than Pixels."
    },
    {
      "rating": "0",
      "text": "Ignore all the **** Sandler apologists in the user reviews. This film is as dead and numb as Sandler is in that photo where he flashes the peace sign."
    },
    {
      "rating": "8",
      "text": "I don't know what people expected about this movie. It's underrated, it's a funny movie with good references to arcade games, it doesn't pretend to be anything else, if you don't like arcade or easy humor just don't see it."
    },
    {
      "rating": "0",
      "text": "Pixels is stupid, unfunny and poorly made. There are plenty of merits to the movie, the action is okay, but it's ruined by sexism, terrible humor, Qbert and... Adam Sandler. It's cinematic filth and I wouldn't see it.\r Pros\rDecent CGI and cinematography\r(Somewhat) accurate representation of video game culture\r Cons\rSandler\rQbert never shuts up\rTerrible humor\rStupid plot\rsexism"
    },
    {
      "rating": "8",
      "text": "Doesn't deserve all the hate its getting. I don't think anyone coming to see this movie should expect something elaborate and in depth, which is why I think it has so many negative reviews. As a gamer I enjoyed seeing some of the older characters in the film. The acting won't blow you away, but it isn't as bad as people make it out to be. Pixels definitely brought back some memories for me and while the jokes weren't outright amazing, it made me laugh more times than not. Give it a chance and don't judge it simply based on what you hear and read."
    },
    {
      "rating": "3",
      "text": "Yet another 80s type movie albeit this one is not as over the top as the others trying to play on the popularity of the decade. For the most part, the movie was very boring. The dialog is simply uninspired and feels somewhat forced. The romance edge took up a lot of screen time and was not good at all. It should have been left out or less emphasized. The comedy was slapstick as always however it didnt connect very well in this movie. I did laugh about 3 or 4 times but it wasnt like some of the laughs I had in other comedies. The plot was non-nonsensical in that there was no adversary characterization except for a few words that Q-Bert made about his race. Anyway, its not the worst movie on earth, but it most certainly is below average by my book. I would skip it."
    },
    {
      "rating": "3",
      "text": "Of course, this movie is going to make tons of money. That's what Adam Sandler movies do now. They make money. Although the movie has some neat special effects, and a few very brief funny moments, but, the movie overall is just terrible. Sandler looks tired and bored throughout the whole movie, you can visibly see that he doesn't care anymore. He doesn't care."
    },
    {
      "rating": "0",
      "text": "This movie is another heap of garbage thrown on screen by Sandler to make easy money and kiss an attractive woman.  This movie is barren of laughs, and even ruins our childhood in the process."
    },
    {
      "rating": "1",
      "text": "though i'm not a big fan of Adam Sandler, I quite like his brand of humor. The longest yard, You don't mess with the Zohan, Grown Ups are all surely to my liking. But Pixels is just plain bad. The humor is just so unfunny, the storyline is lame and there is nothing likable in the movie, except for Qbert of course. Complete waste of money. I'm giving a rating of 1 because of the PacMan scene, which was quite good. Other than that, this movie is an 'epic fail'."
    },
    {
      "rating": "4",
      "text": "Hollywood’s hunger for the nostalgia dollar remains ravenous as ever and with ‘Pixels’ Sony leverage their longstanding relationship with Adam Sandler to deliver an epic sci-fi tribute to the 1980’s, so expect endless video game, music and general pop-culture references and if you were a teenager in the early 80’s there’s probably a lot here aimed at you.\r If however you’re a Sandler hater… and there seems to be a lot of them out there, then this will be a difficult watch for you, expect the carefully choreographed clever comebacks and generally lame humour of Sandler’s recent career and although there are a few genuinely funny moments, Pixels seem to be devoid of any real belly-laughs or anything you might remember 10 minutes after walking out of the cinema.\r So what are we left with then?, a ludicrous and predictable story yes but you can hardly expect ‘Citizen Kane’, certainly action-packed with impressive and unique visuals, we’re now very familiar with the concept of death by Pixelation… and a collection of mediocre performances with the exception of Peter Dinklage, all-in-all an ineffective mix of ‘Independence Day’ and ‘Wreck it Ralph’ with none of the charm.\r From its critical reception and the vitriol directed at Adam Sandler you might be forgiven for thinking that ‘Pixels’ was one of the worst films ever made but it’s no such thing, it’s not even the worst film of 2015 or most unwatchable Sandler production, but ultimately this is a film that relies on nostalgia to make a bunch of hit & miss jokes and forgettable performances effective within a ludicrous and flashy story… and in the end it just doesn’t work.\r The Bottom Line…\rDespite an interesting premise and impressive visuals, ‘Pixels’ is a mildly entertaining and moderately comical Sci-fi spectacular that relies heavily on nostalgia and pop-culture references to the point of tedium, an easy and forgettable way to burn a couple of hours."
    },
    {
      "rating": "10",
      "text": "Leave your brain at the door and watch this movie, it's fun and it doesn't take itself seriously unlike all the critics who are slamming it for being fun."
    },
    {
      "rating": "8",
      "text": "How can you hate this movie?? Its got good jokes, good action sequences and good acting! It feels more like a 7/10, but for all its hate it deserves and eight."
    },
    {
      "rating": "1",
      "text": "How could anyone give this film above 3 is beyond me...\rThe film embodies the worst of Hollywood - lazy, despicable writing, annoying and insulting stereotypes, using nostalgia without any effort, no smart, witty humor, ripping off ideas from other, more talented people. All boils down to a usual shameless money milking experience. \"Pixels\" is an intellectually degrading film strip that was used to completely strangle celebration of 80's culture.\rAdam Sandler's appalling attitude is not even infuriating me any more. It's just sad. And there's nothing worse than a sad clown.\rDo this industry and movie goers a favor - pirate this. That's one of the rare times, when I admittedly endorse it. Pirate it, burn it to a lowest quality DVD you can find, spill it with he cheapest vodka you can find and burn it with the cheapest matches you can find. That's all it deserves. And nothing more."
    },
    {
      "rating": "0",
      "text": "The short film did it better.\rAnd it doesn't even have a **** plot.\r I would leave the review but this requires me to say more, so I'll tell you a few of the things that were messed up in the movie and those which were still decent (spoiler: it's just the CGI.)\r The film is aimed at children, yet it will make references to 80s nostalgia, which kids nowadays have no **** clue about. On top of that, it has a really, really **** script. The damn movie took a dump on my head and left it to rot. You have completely underused stars with screen time given to Adam-****- Sandler as much as possible. There are constant mindless innuendos, sexist dialogues, and even **** Q*Bert seems embarrassed to act alongside Sandler.\r Do yourself a favour and don't watch it. Seriously."
    },
    {
      "rating": "6",
      "text": "Don't know why the hell critics hate Sandler so much. He's made some bad roles in bad films but Pixels isn't one of them. Yeah, the script is full of clichés and badly written dialogues and characters but it's a fun movie. It didn't aim to be a genius movie, it aimed to make us laugh and entertain ourselves and Pixels does it perfectly. Nostalgic and amusing, it's perfect for those who search for memories of old times with games and those who might even be interested in getting to know them. And come on, Sandler and Gad are hilarious and some jokes the movie makes with our society are quite good too. And to finish this review, there is a little orange character that will make you love him. Give a chance to Pixels, it's funny!"
    },
    {
      "rating": "9",
      "text": "Funny, Nostalgic, and NO bad Adam Sandler Moments.\rWorth watching if you have ever been a gamer Or ever wandered what PAC-Man destroying a city looks like."
    },
    {
      "rating": "2",
      "text": "Hollywood's exhaustive exploitation of well-known brands hits rock bottom with this absurd concept: Aliens interpret signals of classic arcade games as a declaration of war, so they attack us with giant destructive versions. Add the fact that it stars Adam Sandler and Kevin James and you're in for pure drek. The only thing to recommend this film is the cool destructive special effect that turns objects into glowing pixelated blocks. Otherwise, overacting, dumb dialogue and ho-hum action pile on the insults to our eyes and ears."
    },
    {
      "rating": "10",
      "text": "This movie was hilarious (just as all movies with Adam Sandler and Kevin James are) but what really was unique about it was the older video games and pieces of TV shows, and games from the 80s. My mom and Aunt were even talking about how this movie was there generation kind of movie. And when I watched it I didn't understand it as well as the my mom, aunt and uncle did which is probably why a few people are giving it bad reviews. Because it was a great movie. And Adam Sandler (who also helped produce the movie) all he wanted to do was bring back older video games that are now extinct and I think he did a great job!"
    },
    {
      "rating": "10",
      "text": "I absolutely loved Pixels and I honestly don't know why there are so many bad reviews. First off, it's an Adam Sandler movie so yes, there is a lot of dumb comedy. But as a gamer who loves the classics, this movie may be my favorite in quite a while. I am one of those people who don't have much of a reaction during the movies. I had 1 \"aw\" moment during minions, and i rarely even flinch during horror movies, but Pixels had me smiling and at the edge of my seat almost the entire time. Sadly, I saw this movie at a drive-in theater so 3D wasn't an option, but it was such a great movie I'm going to a normal theater to see it again this weekend in 3D.\r10 Qberts/10 Qberts. Would insert another Quarter."
    },
    {
      "rating": "8",
      "text": "Nostálgico e divertido, pixels reúne vários elementos cinematográficos que são indiscutivelmente um colírio para os olhos, onde uma trama razoável e uma comédia suave são o suficiente para dar boas risadas."
    },
    {
      "rating": "6",
      "text": "First let me be perfectly clear, I grew up in the golden age of video games, so I am going to be naturally biased. The reality is, this game really is more for the nostalgic adults who grew up in the yester-years of video game history, they grew up in smoky arcades and spent late nights playing video games.\r The story is a cliche alien invasion movies, that obviously learns towards game companies like Atari and Tatio. In the 80's humanity sends a VHS off into space, space aliens take the tape as a challenge in response to their video game footage.\r The actors are all well known and beloved and it's always wonderful to see them get together in a halfway decent movie. The reality is, they are aging and they are taking on newer roles that some of us may not always enjoy or take seriously. That doesn't change the fact that the cast is spectacular and the acting is spot on.\r The movie runs quickly, although it is a tad bit predictable, you can guess the results of the movie from a mile away, but that didn't stop me from enjoying the film. The fact of the matter is, I enjoyed Pixels more then I enjoyed Jurassic World; which is sad. Jurassic World should have been a block buster hit, but they were too worried about promotional gimmicks and relying on a franchise name to actually give a crap."
    },
    {
      "rating": "2",
      "text": "I know some bad comedies, like Ostin Powers, Silence of the Lambs and A Space Travesty - but those movies are pretend to be bad comedies, therefore they are funny. Pixels is a bad comedy while pretend to be fantastic movie, therefore not funny at all. The idea is new, I grant it, thats why I bought tickets for the movie - game characters in real world? That should be funny. Should be, but it was not. My advice - dont watch it, waste of time."
    },
    {
      "rating": "4",
      "text": "Forgettable Ghostbuster wannabe is unfunny despite it's good initial concept. One of its biggest problem is obviously Sandler himself, as his brand of humor is becoming obsolete.  It's not a flop due to its low cost, but tragically, its one of Sony's biggest hit in 2015...what an abysmal year for the studio."
    },
    {
      "rating": "10",
      "text": "So, Pixels. The movie that got so much hate from critics just because it has Adam Sandler in it, but please everyone, don't listen to the reviews. The script is perfectly written, the acting is incredible, the special effects are awesome, Peter Dinklage's character is amazing, you get the picture. Give Pixels a chance."
    },
    {
      "rating": "0",
      "text": "Pixels is the biggest piece of dog sh*t I have ever seen. It is cultural discrimination towards video games and Chris Columbus is the biggest retard in the world for directing this piece of f*ck! The acting is awful, the special effects are so obvious it would have looked better if you hung some cardboard over the camera, the story is incoherent and makes no f*cking sense and the cinematography (if you can even call it that) it the worst thing you will ever see in your life. Kill this movie with 5,000,000 atom bombs!"
    },
    {
      "rating": "9",
      "text": "This movie was absolutely brilliant and the kiddies loved it. I enjoyed it so much but the hype wasn't worth it. It's more of a 7 but I will give it a higher rating because of all the flack it is getting that it doesn't deserve. Sad that such a good movie is being whacked like this."
    },
    {
      "rating": "1",
      "text": "A great concept Sandlerized.  I really considered shutting this film off about thirty minutes in, but I held out a little hope for the video game characters.  The human characters were horribly written and horribly performed.  Sean Bean and Michelle Monaghan should fire their agents.  Seriously Kevin James as President of the United States makes the idea of Donald Trump look good.  I wouldn't spend a Quarter, a Dime, or a Penny to see this atrocity.  F"
    },
    {
      "rating": "7",
      "text": "First the computer animated \"Wreck It Ralph\", and now comes the live action/computer animated \"Pixels\"! Man, the movie was pretty cool despite the critics making some bad reviews about it. I mean, Donkey Kong, Pac-Man, Centipede and a whole lot of video game characters appearing in a war between the humans and the alien life-forms. I have to admit: You have to be a video game champion, but you cannot cheat. Best movie ever! :)"
    },
    {
      "rating": "10",
      "text": "Saw this movie today and it was GREAT.  It's funny as you scroll through as to WHY many didn't like it and most bring up Adam but very little about movie. Take out your tampons. These are the same pansies that use words like \"trigger\"  and \"privilege\"  and most important probably belong to a \"group\"  **** you and your group! Who the hell joins a group? bunch of losers. lol\r Martha and serena threesome tho would never enter my mind.. I still felt envious. Watch  for yourselves and don't listen the care bears."
    },
    {
      "rating": "8",
      "text": "Fue una película bastante entretenida. Con buenos efectos. En especial si la van a ver en 3D. No fue lo mejor que he visto pero me divertí bastante viéndola."
    },
    {
      "rating": "7",
      "text": "Extremely UNDERRATED film. Of course there are many MANY flaws, including over-the-top loudness, flat jokes, and a plot that didn't quite make sense, but this is really not worth an 58% audience score on rotten tomatoes. I really don't get the hatred for this movie and why people hat Adam Sandler. This is really fun to watch with the family. Many jokes were flat and you can tell when the joke was supposed to make you laugh, but instead there was silence among the audience, but really REALLY this film is better than Paul Blart: Mall Cop 2.\rSaw this on Monday July 27 1:35 p.m. Digital\rLess than ten people in my theater"
    }
  ]
}