{
  "id": 2624,
  "title": "Planet 51",
  "starring": [
    "Dwayne Johnson",
    "Seann William Scott"
  ],
  "runtime": 91,
  "genre": [
    "Animation",
    "Family",
    "Comedy",
    "Science Fiction",
    "Adventure"
  ],
  "description": "When Earth astronaut Capt. Chuck Baker arrives on Planet 51 -- a world reminiscent of American suburbia circa 1950 -- he tries to avoid capture, recover his spaceship and make it home safely, all with the help of an empathetic little green being.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/x7Itcg3ZdExKwdKguy73WPEqosW.jpg",
  "categories": {
    "plot": 3.6666666666666665,
    "acting": 3.142857142857143,
    "ending": 6.0,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 6.2,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Its not the best animation movie of the year, but its really funny to see, with high quality 3D, simple argument (But simple isn't bad) with some memorable jokes. Ill be really proud if my first animation movie would be like that!! I recommend it."
    },
    {
      "rating": "2",
      "text": "The worse animated film I've seen in quite a while. SO predictable! NOT funny. The movie could not hold the attention of most of the kids in the theater as they were noisy and fidgety. By comparison, when I saw Wall-e in the theater you could hear a pin drop. I'm giving it a 2 because the animation is descent and there is one funny line when the aliens see the human naked. Otherwise it's a ZERO. AVOID this bore-fest!"
    },
    {
      "rating": "2",
      "text": "Just terrible film, lack of originality and in some parts even insulting. not for kids, sure. Brrrr"
    },
    {
      "rating": "1",
      "text": "I wish there had been someone to tell me not to take my ENTIRE family for Thanksgiving to this movie. The kids looked forward to this show since we saw the previews months ago. From ages 4-11, this movie was terrible. They wanted to leave the theater, I was falling asleep due to lack of dialogue, and the kids were miserable. They hated sitting there with a movie that didn't have ANY direction. The main character who is a self absorbed fool is so degrading to the title \"astronaut\". It was so bland and unfulfilled, I wanted to apologize to the family for the awful price we paid to sit there and watch this."
    },
    {
      "rating": "8",
      "text": "Once more, I don´t understand critics. This is not the best movie in the world, but it's a good and funny one."
    },
    {
      "rating": "10",
      "text": "Great movie, excellent animation."
    },
    {
      "rating": "10",
      "text": "This movie is the SMARTEST animation that I've ever seen (along with"
    },
    {
      "rating": "10",
      "text": "It was pretty amazing, a felling good movie for the kids"
    },
    {
      "rating": "8",
      "text": "Better than cloudy with a chance of meatballs. the movie makes the viewer think a little bit."
    },
    {
      "rating": "9",
      "text": "Very funny, indeed, just a simple and a very nice story."
    },
    {
      "rating": "9",
      "text": "Wonderful animation movie. There may be people out there that does not understand it."
    },
    {
      "rating": "8",
      "text": "Visually clever and pretty, not great art but definitely great fun."
    },
    {
      "rating": "10",
      "text": "Don't take this bad people but it seems that creeps you out that anybody come to play to your playground. I don't dare to say that this is better than a Pixar's movie, although is far better than Dreamworks \"Monsters vs Aliens\" By the way the movie is pretty well done to be the first serious Spanish animation movie project."
    },
    {
      "rating": "10",
      "text": "A very, very good film!!! Don't trust bad reviews made by stupid people who rate Titanic as a 5/5 stars film. TRUST ME!!! You must see this film if you have a good sense of humor, LOVED IT!!!"
    },
    {
      "rating": "9",
      "text": "Saw Planet 51 yesterday with my kids (5,7,9 yr) and I really enjoyed it. Very hilarious and well done. Congratulations!"
    },
    {
      "rating": "9",
      "text": "It´s the perfect movie to see with kids and have a family fun."
    },
    {
      "rating": "8",
      "text": "This movie is simply perfect for family entertaining. Both kids and adults will love it. Fun and very touching."
    },
    {
      "rating": "10",
      "text": "Planet51 was an awesome movie. Highly Recommend."
    },
    {
      "rating": "10",
      "text": "A must see movie."
    },
    {
      "rating": "4",
      "text": "It's the hubris of man, or rather, the hubris of an American man, who would have the gall to ask Lem(Justin Long) if he's considered \"good-looking\" among his kind. The astronaut can't tell. The inference being, none too subtly, that Captain Baker(Dwayne Johnson) deems the young \"alien\" ugly. Prior to his landing, mankind was rendered in cheesy sci-fi films as a single giant eye, an appropriate metaphor for the narcissism of the homonymic \"I\"(the astronaut). Dissimilar from \"The Eye of the Beholder\"(a 1960 \"Twilight Zone\" episode written by Rod Serling himself), in which a beautiful woman, whose cosmetic surgery goes awry, is considered hideous by the standards of an otherworldly culture, the human species remain the standard bearer of beauty(the astronaut calls them \"sea monkeys\") in \"Planet 51\", despite the context where being tall and Caucasian might be hideous to the short and green. Captain Baker lands not only on another planet, but in another era, as the film documents the moment on our own planet when the hangover of the fifties, still felt, arguably, as late as 1964, finally dissipated, due to the rumblings of an oncoming conflict in Vietnam. There's no war in \"Planet 51\", but there are peace activists(and a protest singer), who insist that the visitor is friendly. The presence of these proto-hippies suggest \"The War of the Worlds\" in reverse could happen, an odd fit for a film that doggedly rehashes \"E.T.\". Well, maybe it might. After all, these planetary denizens wanted to dissect the astronaut's brain. Without any back-up, what choice does Captain Baker have, but to hug Lem like Henry Thomas, as in the finale of the 1982 Steven Spielberg classic. He'll be back and give those misplaced protestors something to protest about."
    },
    {
      "rating": "2",
      "text": "This picture takes an alien planet and imports a 50s motif and therein lies the basic background of the storyline. The problem is it isn"
    },
    {
      "rating": "1",
      "text": "Utterly absurd and unfunny and predictable and dull and insulting. And who the F cares if there really are aliens in the attic !"
    },
    {
      "rating": "0",
      "text": "What a disaster and what a shame! My son and I had to leave the theater before its ending. It is boring and disgusting!"
    },
    {
      "rating": "8",
      "text": "Nice. Light. Funny. Finally, a kids movie which is actually for kids. Nothing scary. (Kids Age 3 + 5)."
    },
    {
      "rating": "9",
      "text": "This is a very intelligent (and fun) movie, in the line of Shrek-1 (no surprise as Joe Stillman is the writer in both). I went to see it with my 5 years old daughter and she liked it a lot...but I liked it more because I could understand most of the intelligent jokes which the film is literally filled with. From the title (clear reference to Area 51 where the aliens are supposed to be kept secretly by the U.S.), to references to films like Alien, E.T., B series movies (50 feet woman,...), like details in the background (Comics starring a green giant called \"Bulked\" (Hulk)... Despite not being as round as Shrek-1, it clearly has much more attention to detail to make jokes even on the background as the main action is taking place. As said, a good film for kids but even better film for adults with other movies background. Very intelligent."
    },
    {
      "rating": "9",
      "text": "Funny!"
    },
    {
      "rating": "8",
      "text": "Planet 51 has good animation, an funny plot and easy-to-please moments, but has an very predictable end - and even children knows that, but stays a question in all heads, before the end: he stays there or he goes?"
    },
    {
      "rating": "2",
      "text": "Planet 51’s recycled story, unlikeable/flat characters, and poor animation given advancements by Pixar and Dreamworks make this seem like it is a Direct-to-DVD or made for TV film it isn’t. The film’s script lacks any originality borrowing the loser becomes a hero story that tons of kids movies seem to use saddled with a generic love interest, generic villain, and tons of cardboard cut out characters. Outside of a charming Rover who despite some callbacks to Wall-e is the only charming character in the film with his lack of words and puppy like attitude. Unfortunately, the rest of the film isn’t so charming as it constantly relies on pop culture references, mainly of other sci-fi movies, ranking in at one per minute. The young children who see this movie will probably find it ok although I pity the parents who will be wanting to get inside their car rocket and leave the planet."
    },
    {
      "rating": "8",
      "text": "If you are the sort enjoy watching movies for children, with your children, or simply movies with vivid, beautiful, and creative art direction, you'll enjoy this movie. Otherwise it simply isn't for you. It's humor is by no means racy, but some jokes may offend you if you are the easily offended type. While it does what it sets out to do, I wouldn't recommend this movie to most people, but if you do fit the profile of a person I specified earlier, I would recommend it."
    },
    {
      "rating": "3",
      "text": "Its a shame that this movie didn't use it's smart plot to a benefit or I would have given this movie a higher rating if it had a better cast and if it was funnier, but like I said it falls too short."
    },
    {
      "rating": "4",
      "text": "This family animated film was okay not great. The concept of the alien civilization being in the 1950s was dumb. Even some of the music from the 1950s by dumb pop singers was retarded. The acting was okay too. This movie is for kids only, not adults."
    },
    {
      "rating": "4",
      "text": "This Is A VERY Uncreative Movie... The Voices Are Nah-Nah... But This Is Cute For Kids..."
    },
    {
      "rating": "7",
      "text": "While the 1950s/1960s references and setting are likely to fall flat with most kids, I thought the film was fun and brilliantly animated. My little nephew had no idea about the cultural era defined for the aliens, but he remained mostly interested from start to finish (which, for him, is quite a feat). This is by no means the cream of the animated film crop, but it's a far better experience than many reviews to date would suggest, and it's worth watching. It's a shame I never heard about it until nearly four years after release."
    },
    {
      "rating": "3",
      "text": "Planet 51 does have a unique concept of an alien race in a 1950's flair environment, but the whole execution of the movie was a complete disaster. The story was quickly forgettable with humour so dull that Dwayne Johnson (voice of Charles T. Baker aka the Astronaut) couldn't save this animated feature to be highly entertaining. With a poor execution and only two scenes that will make you laugh, Planet 51 is at best to be a direct to video film than a theatrical feature."
    },
    {
      "rating": "3",
      "text": "Planet 51 may have great animation, but the thin plotted story and uninteresting characters make it very boring. It lacks fun in a lot of ways. The premise was interesting, but was poorly executed."
    },
    {
      "rating": "5",
      "text": "Has some pretty good humour but is otherwise amongst the uninspired masses."
    },
    {
      "rating": "2",
      "text": "It has a very intriguing premise but the whole film is a wreck. With boring voice acting and bad animation along with it not being funny, Save your money and don't see it. i give this movie 19%."
    },
    {
      "rating": "4",
      "text": "Planet 51 is a poor animation movie. It haves a really stupid story, but sometimes it gets kinda interesting, sometimes, because this move is a let down. Even the animation is amateur and poor."
    },
    {
      "rating": "4",
      "text": "\"Planet 51\" is a letdown that isn't worth to watch. Yes, it haves a good 3d animation, but the story is weird and dumb, and It isn't kids film. This movie is more for teens, because it haves some sexual moments, that aren't graphically absurd, but really not for kids."
    },
    {
      "rating": "1",
      "text": "Bobo até demais"
    },
    {
      "rating": "2",
      "text": "It's a shame, because when this film's commercials and trailers were released, I had some faith in it. It looked kinda funny and, if nothing else, I expected it to be a decent children's film. \"Planet 51,\" however, is not decent, it's pretty bad. If not for the fact that it had a decent premise and that the trailers showed SOME PROMISE, this would've gotten a lower score, but as it is, the film is poorly animated, extremely unfunny, and as a whole, completely unmemorable and painfully dull. I'm telling you now, unless you just watched the film RIGHT NOW or looked it up on Wikipedia, there's no way you'll walk out of this movie knowing any one character's name. There's no way. This isn't even a fun watch on \"Bad Movie Night,\" just avoid it altogether. Even if your kid is begging you to let them watch it, don't."
    },
    {
      "rating": "2",
      "text": "Planet 51 is spaced out.\rNo laughs, no good characters, no real message, and an unoriginal story. The only redeeming quality I can see is that it will hold kids interest; but there are many choices far better than this one regarding a family film."
    },
    {
      "rating": "7",
      "text": "Planet 51 pays homage to the classic alien movies in which it references much from movies such as Aliens and 2001: A Space Odyssey, in which they are really fun and they keep an adult's attention. Personally, my list of favorite animated movies includes peculiar titles and not the usual classics, Planet 51 fits there perfectly."
    },
    {
      "rating": "1",
      "text": "It's odd that before this review, the average user rating was 51. How ironic. Especially because it deserves a much lower score. I mean, it's pretty obvious what will happen."
    },
    {
      "rating": "5",
      "text": "Planet 51 is Silly and ridiculous but its fun with some funny and sometimes stupid humours and reference.\rThe Movie has potential,It has interesting plot but execution is where the movie falls flat,The Movie is really for kids but some of them are for adults but the only I will say that don't buy or go theaters to watch this\rjust go and find pirated copies of the movie cause it's not wort h the money."
    },
    {
      "rating": "4",
      "text": "How am I keep on forgetting to make a review on this movie? Another piece of animation I am keep on forgetting... except this time, it isn't a piece of animation, it's a poorly-made animation trying to rip-off E.T only in reverse."
    },
    {
      "rating": "4",
      "text": "Planet 51is not something to search for. The script lacks interest or wit or good jokes. Characters are boring and lack memorbillity. While the animation is alright, but the movie still could have been better."
    },
    {
      "rating": "4",
      "text": "the movie is cute, but it's so pasable it's a entertaining, but that means it's not the best animation movie of the year, it's funny and cute but predictable"
    },
    {
      "rating": "5",
      "text": "Nothing special about this movie. The characters and story are forgettable. The animation amd voice acting were good though, which surprised me. It isn't a must watch at all."
    },
    {
      "rating": "7",
      "text": "I like the idea of a alien planet that is set in the 50s and a human from our time comes"
    }
  ],
  "recommendations": [
    "escape_from_planet_earth",
    "free_birds",
    "cloudy_with_a_chance_of_meatballs_2",
    "the_smurfs",
    "monsters_vs_aliens",
    "the_lego_movie",
    "hotel_transylvania",
    "yogi_bear",
    "wonder_park",
    "uglydolls",
    "ice_age_dawn_of_the_dinosaurs",
    "chicken_little",
    "alvin_and_the_chipmunks_chipwrecked",
    "ice_age_the_meltdown",
    "ice_age_collision_course",
    "smurfs_the_lost_village",
    "minions",
    "the_angry_birds_movie",
    "tmnt",
    "the_nut_job",
    "turbo",
    "transformers_revenge_of_the_fallen",
    "the_wild",
    "the_tale_of_despereaux",
    "teen_titans_go_to_the_movies"
  ]
}