{"id": 2259, "title": "Platoon", "starring": ["Tom Berenger", "Willem Dafoe"], "runtime": 120, "genre": ["Drama", "War", "Action"], "description": "As a young and naive recruit in Vietnam, Chris Taylor faces a moral crisis when confronted with the horrors of war and the duality of man.", "releaseYear": "1986", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/8hDlxJZYCJJLRHbSk7hsRQ9SNp7.jpg", "categories": {"plot": 7.157894736842105, "acting": 7.352941176470588, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.0, "action": 7.75}, "reviews": [{"rating": "6", "text": "Decent war film, fairly well-directed but feels contrived in parts. Sheen is fine."}, {"rating": "8", "text": "Maybe not the best Vietnam film, but it's definitely up there. Berenger is almost a one man show, just incredible."}, {"rating": "10", "text": "Platoon is a powerful war film starring Charlie Sheen and Willem DeFoe. A film that depicts the best and worst of humanity Platoon is also an excellent action film. 10/10 from me."}, {"rating": "9", "text": "Filmes de guerra artificiais são fáceis de se fazer, mas o que Platoon fez é pra poucos.Claramente inspirado na obra de arte \"Apocalypse Now\", Charlie Sheen protagoniza uma historia na qual acompanhamos tudo pelos olhos do mesmo. Isso é muito importante para a narrativa, pois, junto com ele, vamos descobrindo como as coisas funcionam, e uma subversão de valores quanto aos EUA naquela guerra fica bem clara no segundo ato.Os personagens são ótimos, e o tempo de tela dado a cada um os desenvolve muito bem. Os diálogos são ótimos, e as interpretações estão no mesmo nível. Willem Dafoe é o meu favorito aqui. Charlie Sheen faz um ótimo trabalho e Tom Berenger entrega o que peso que o antagonista precisa.A fotografia é muito boa, principalmente nas cenas de ação, passando a confusão e o terror da zona de guerra. A ost está bem presente no filme e inclui muito nos arco dramático.Audio: English, with original subtitles - Q60T 50' TV Speakers [DTS 5.1]Quality: 1080p SDR [Remastered Bluray]"}, {"rating": "5", "text": "Sheen felt very out of place with his character and despite a pretty stacked cast, There was definitely a disconnect to where you didn't truly feel for their plight as it unfolded around them. In typical Oliver Stone fashion, It didn't feel like you were watching one complete movie but more like watching an hour of two different ones. The story didn't blend well with the action scenes."}, {"rating": "10", "text": "Classic movie and yes everyone should see it. There is not only action, but the focus is on the characters and how they are changed because of the terror of war. Great acting by all of them."}, {"rating": "9", "text": "Amazing movie, I should've watched it a long time ago,but somehow did not and only watched it recently. It basically shows you what war really is and what it can do with people involved in it. Not only that, it also shows how the worst of the characters come out in those situations and you see people for what they really are."}, {"rating": "10", "text": "Of all the movies inspired by the Vietnam War this is one of the most compelling. From the point of view of a young recruit, he revealed that the worst enemy was not only in the trench, but also in the mirror. The movie that it put director Oliver Stone in the spotlight."}, {"rating": "8", "text": "Barbers Adagio for Strings feat. Charlie Sheen.A film that has now become synonymous with Barbers haunting score that forms the bedrock for the character study of these group of men we are thrown into awful conditions with fighting an enemy they cannot see or understand. What follows is a 2 hour experience of being dragged from one harsh set piece to the next being seen through the eyes of new recruit Chris played by a very young Charlie Sheen. The journey is shepherded by his 2 surrogate father figures played here excellently by Berenger and Defoe as they attempt to guide these young men from two very much opposing viewpoints.I first saw this when I was exploring war movies at a young age and consider this seminal viewing. This is a piece of work from Oliver Stone that would form the mould for many wartime movies to follow. Often mentioned in the same vein as Apocalypse Now, although two very different movies, both study its characters and look at how war and the atrocities seen can fundamentally change an individual. There are many big players here before they got famous, John C McGinley (from Scrubs fame) steals every scene he is in and Forrest Whitaker and Johnny Depp are also part of the supporting cast. The narrative thread is sometimes a little lacking and the main focus is to study one mans tour in 'Nam largely influenced by the directors own experiences of warfare during his time of service.Platoon is excellent. Its narrative by todays standards is slightly lacking with no real thread carrying things throughout apart from Defoe and Berenger fighting metaphorically for Charlie Sheens soul. As a study of the horrors of war during Vietnam it has rarely been done better and even now rewatching this many years later it is hard not to get choked up any time Barbers classic theme swells throughout the horrific images being displayed. If you are a war film connoisseur who hasn't seen this, you should probably rectify this immediately."}, {"rating": "6", "text": "everybody got one..PlatoonEmbracing and projecting the vulnerability, jealous and empathy Platoon is a fast paced character driven feature that has merely an idea on which it walks for 2 hours but gets in deep with the characters and explores more than expected. Writer-Director Oliver Stone captures some raw brutal scenes and attempts in empowering the characters through it, creating a perfect arc for the plot line but fails to ask for attention and offer gripping screenplay to the audience. Charlie Sheen seems a bit unsuitable for his protagonist role and doesn't quite justify its character whilst Willem Dafoe breathes life into the character and is outstanding as a supporting cast. Platoon takes big leaps on its first act and slows down on its second one until which the track becomes predictable on its climatic sequence."}, {"rating": "8", "text": "전투의 액션에만 치중하지 않으면서 전쟁이라는 상황속의 다양한 인간성들을 생생하게 묘사해 낸 영화이다. 캐릭터 각자의 개성과 행동에 대해서도 합리적인 근거로 납득할 수 있게 해주는 완성도 있는 작품."}, {"rating": "7", "text": "Vietnam war film directed by Oliver Stone and stars Charlie Sheen, Forrest Whitaker, Tom Berenger, Willem Dafoe... Pretty violent and bad language is present. Fairly decent story with some dumb characters, some likeable and the unlikeable Tom Berenger but what Platoon does throughout the dead bodies, bloodshed and violence is portray a fairly decent story and a reasonably powerful film. Charlie Sheen's acting is the best in the movie for me and this film displays an excellent level of betrayal but also courage."}, {"rating": "7", "text": "Sauron's forces have laid siege to Minas Tirith, the capital of Gondor, in their efforts to eliminate the race of men. The once-great kingdom, watched over by a fading steward, has never been in more desperate need of its king. But can Aragorn (Viggo Mortensen) answer the call of his heritage and become what he was born to be? In no small"}, {"rating": "10", "text": "Oliver Stone's best movie and one of the best movies of 1987.In fact one of,if not already the best movie based on the Vietnam war.Powerful & a must see."}, {"rating": "8", "text": "It's hard to watch at times; which I understand is intentional. It really does a great job of portraying the horrors and inhumanity of the Vietnam War. It's more of a hangout film, rather than story-driven. It invests a lot of time in the characters and atmosphere and invites the audience to immerse themselves in."}, {"rating": "6", "text": "\"Platoon\" delivers its share of brutality and morality during the non-sensical war in Vietnam. However, despite the good performances and sincere direction by Stone, by the end of the film, nothing has remotely left an impact in my mind about it. In a sea of war pictures that all vary in explaining and showing the understanding of such awful violence and yes, sometimes decisions, \"Platoon\" came across as just another war movie. For movie-goers and war historians, take it for what its worth as I've personally seen more inspiring works which deal with the consequences of war."}, {"rating": "9", "text": "Fantastic movie, other than the beginning this movie was overall better than full metal jacket, but not nearly in the same arena as the king of war movies, saving private Ryan. It really shows you what it was like to serve in Vietnam back then and i am very happy i was not included in that war! Full of plot twists, this is a true masterpiece and is in my top 5 all time favorite war movies. This movie is up alongside Full Metal Jacket, 1917, and Hacksaw Ridge. Saving Private Ryan and American Sniper take the edge over this move in my opinion."}, {"rating": "6", "text": "Another brutal and hellish war depiction, I really enjoyed all the characters, honestly Sheen's was probably the worst or least interesting of the bunch. The voice over work and dialogue was so bad, and was completely unnecessary."}, {"rating": "9", "text": "Platoon captures the life in war and great performance's from among it's actors and it's always great seeing this movie."}, {"rating": "4", "text": "I found the movie extremely negative about the Vietnam War (the country I currently live in) the movie that misrepresents the American soldiers describing what they did, but it was very cruel to the people of Vietnam and to the soldiers. again. Although the US is now a friend of Vietnam, this movie has haunted me"}], "recommendations": ["black_hawk_down", "hacksaw_ridge", "we_were_soldiers", "the_deer_hunter", "full_metal_jacket", "the_patriot", "enemy_at_the_gates", "saving_private_ryan", "the_thin_red_line", "apocalypse_now", "captain_america_civil_war", "cold_mountain", "12_strong", "fury", "darkest_hour", "hostiles", "the_imitation_game", "the_last_duel", "captain_america_the_winter_soldier", "the_eagle", "free_state_of_jones", "the_last_samurai", "rogue_one_a_star_wars_story", "empire_of_the_sun", "13_hours_the_secret_soldiers_of_benghazi"]}