{
  "id": 4775,
  "title": "Playmobil: The Movie",
  "starring": [
    "Anya Taylor-Joy",
    "Gabriel Bateman"
  ],
  "runtime": 99,
  "genre": [
    "Family",
    "Animation",
    "Comedy",
    "Adventure"
  ],
  "description": "Marla is forced to abandon her carefully structured life to embark on an epic journey to find her younger brother Charlie who has disappeared into the vast and wondrous animated world of Playmobil toys.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zPQzLZnfVw9fbXyxxglyOsmQBlu.jpg",
  "categories": {
    "plot": 1.5,
    "acting": 1.5,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "WHAT’S THE POINT!?Literally, The only reason this movie exists is to cash in on the success of The LEGO Movie and fails miserably."
    },
    {
      "rating": "0",
      "text": "This is just a awful lego movie ripoff, it’s bad, just don’t see it, and don’t give it money!"
    },
    {
      "rating": "0",
      "text": "This is nothing more than junk wanting to copy The Lego Movie, one of the worst movies of the year."
    },
    {
      "rating": "3",
      "text": "I couldn't do it. I couldn't make through this and I've made arguably worse B-Movie. I rented Playmobil: The Movie thinking it would be bad. I figured it would be the fun or weird type of bad (or a guilty pleasure), but no this movie is boring which in my opinion is a lot worse.This also made me realize just how boring Playmobil was. (I didn't really grow up playing with Playmobil besides a few figures.) Playmobil even as toys lacks a personality besides be the lesser of Lego. Playmobil also cannot use copyrighted characters as they simply do not have any.It is also a bit annoying with the songs. Clearly this movie was made for a very young audience (toddlers) instead of all ages as The Lego Movie was. So, I mean the targeted audience would probably like it or at least be distracted by it.I can't wait until The Mega Bloks Movie."
    },
    {
      "rating": "0",
      "text": "The worst movie of the year after Brightburn and maybe the worst animated movie of the decade next to Emoji."
    },
    {
      "rating": "5",
      "text": "Little kids in the family liked it a lot, and I thought it was fun.  By the way, read that Playmobil Movie was in the works conceptually way before the Lego Movie, but there were some issues that caused major delays. So although it was not as strong as the Lego Movie, it was not trying to copy it."
    },
    {
      "rating": "7",
      "text": "Of cource its a pretty childish and really stupid cartoon or movie or whatever. But what do u want wrom it? Aranoffsky's wisy horror? Or feministic dressup like in Little women? Nice attraction for kids allitle younger than lego audience, but equivalently peppy and entertaining."
    },
    {
      "rating": "0",
      "text": "charlie touch toy and go into toy world with imaginary girlfriend and they go into bedroom and before i tell you what happens sister is also transported into it and then lego man is like you riped of and then sister ignores and then goes with rich man and gets rich and then she goes to the doctor and then doctor goes brrr and then she a man but she didnt like the change so she go back and then you go on a road trip with brother and then brother and then brother ok we back to the bedroom lady jumps out the window after seeing charlies micro penis and then sister goes on american sing green and then  she wants blue and then she reads this review ad then you poop on this also 696 characters"
    },
    {
      "rating": "5",
      "text": "Biedniejszy The Lego Movie. Wszystko jest tutaj zrobione gorzej, bez pomysłu i polotu"
    },
    {
      "rating": "4",
      "text": "Playmobil: The Movie has an applaudable animation but that does not save it from being too boring compared to its great competition: LEGO"
    }
  ]
}