{"id": 1598, "title": "Pocahontas", "starring": ["Irene Bedard", "Mel Gibson"], "runtime": 81, "genre": ["Adventure", "Animation", "Family", "Romance"], "description": "Pocahontas, daughter of a Native American tribe chief, falls in love with an English soldier as colonists invade 17th century Virginia.", "releaseYear": "1995", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/kZ1ft0QZ4e3zDUPMBftEkwI9ftd.jpg", "categories": {"plot": 7.897435897435898, "acting": 8.481481481481481, "ending": 8.076923076923077, "soundtrack": 8.2, "cinematography": 8.0, "familyFriendly": 7.714285714285714, "funny": 8.2, "action": 7.285714285714286}, "reviews": [{"rating": "10", "text": "Seriously? Critics hate this? I was a kid when I first watched this and even to this day I still find it good. The entire film was interesting and well worth watching."}, {"rating": "10", "text": "I have to contradict with all the reviewers who gave it a low score. Reviews should be based on what the film \"is\" rather than what it \"should have\" been. The fact of the matter is, it is a departure for Disney from the traditional animated movies they've done in the early 90's, and is targeted more towards an adult audience. Its a serious movie, about romance, and actual historical events. See it as one, and you'll see that its no less a masterpiece than Disney's previous offerings; The story is touching, the art/animation is outstanding, the characters are 'alive' (forever remembered) .. and do I have to say anything about its music? 2 Oscars weren't presented for no reason. Its truly a gem, and is worth a place in your all-time Disney's 'favorites' collection."}, {"rating": "10", "text": "Wow. This movie is spectacular. The animation is just simply beautiful; the use of color is extraordinary. I have to comment on the amazing score and music- which won two Oscars."}, {"rating": "8", "text": "Pocahontas is the 33 rd movie in the disney animated canon. It had the burden of being the successor of the highly successful the lion king. Because of that, this movie is vastly under appreciated, I have the feeling that people wanted more talking animals with wacky sidekicks, instead Pocahontas has a definit shift in tone. Humans are main characters, there are no talking animals, no magic ( sort of). White men sail to the new world looking for gold, destroying the environment. Indians of course try to defend their land. Here the chief's daughter Pocahontas is looking to find her way in order to be a wise leader, her path brings her to meet the english John Smith. It's the story of how different worlds can come together in peace. Disney was accued of being racist and historically inaccurate, but I think that's not the point, the point is the message: respect the environment and don't getting scared by different cultures are good moral values. The musical score is a masterpiece, every song is catchy and meaningful, lyrics are powerful. If you were a kid in the 90's you knew every word of colours of the wind! The music fails, sort of, because people expected happyness and cuteness, instead they got a more mature setting, in fact the comic relief characters feel forced and out of place, ruining the pace of the movie. In the end I think this is a must-watch, don't expect the second coming of Lion King but a movie that stands on its own."}, {"rating": "8", "text": "Disney's take on Jamestown and the early explorations of North America. Pocahontas is noteworthy for its wonderful storytelling and brilliant vocal performances."}, {"rating": "7", "text": "A very inspiring and dramatic movie, Pocahontas is great dark entertainment. The film is prolific in family friendly storytelling, yet manages to be mature at the same time."}, {"rating": "9", "text": "Hand drawn animation had been around for a half century before Pocahontas, and stage musicals a hundred years before that. It's a wonder then, that somehow Pocahontas still manages to be a jaw-dropping example of both."}, {"rating": "7", "text": "This is certainly one of the most notable animation films that Disney did in the 1990s. It has an undeniable quality, with exquisitely done animations, great songs and fun suitable for children and adults. However, its impossible to get around an undeniable fact: all that the film portrays is fiction, imagined around names of historical characters who actually existed. The connection between this film and historical facts ends in these names. Everything, absolutely everything else, was created in the minds of Disney's writers and creators. So pay attention, history teachers and parents: don't think that this movie has any connection with history. Another problem of the film is to approach in a very stereotyped and slight way the two confronting cultures (the colonizers and the Native Americans, its understood). But since its a children's film, this kind of lightness is forgivable.One of the highlights of the movie is music. Several of his songs were remarkable, especially for my generation, who was a child when the film was released. \"Colors of the Wind\" is perhaps one of the most poetic songs used in a Disney movie, it stays in the ear with great ease and the animation used during the music is excellent. In fact, the synchronicity of visual animation and music is something very well made. This movie is great if it's seen as an entertainment fiction, like an animated children's movie that does not show anything true."}, {"rating": "10", "text": "Great animation film based on HistoryI loved Pocahontas and I thought it was a great animated film based on history of the real Indian Pocahontas! In the movie Captain John Smith (Mel Gibson) sails to the New World of Jamestown Virginia with a group of settlers and falls in love with Pocahontas (Irene Bedard) but the settlers led by Govenor Ratcliffe (David Ogden Stiers) and the Native Americans led by Pocahontas' father Chief Powatahn (Russell Means) wish to fight each other to protect eachothers' land so it's up to Pocahontas and her forest friends Meeko, Grandmother Willow, and Flit and John Smith and his dog Percy to bring peace between their people! The music is very wonderful written by Alan Menken and Steven Schwartz. Colors of the WInd always blows me away every time I hear Pocahontas sing it! My favorite scenes in the movie were when Meeko jumps into Percy's bath and eats all his cherries and Percy chases him and I also liked it when settlers Ben and Lon (Billy Connolly and Joe Baker) come into the forest looking for Smith and get scared away by Grandmother Willow. I just died laughing at those scenes! Disney did a fantastic job telling the story of Pocahontas through animation! If they ever decide to do another animated film based on history they should do one on Christopher Columbus. Pocahontas is a true Disney film that any Disney fan can enjoy! I know I've really enjoyed it! 10 out of 10!"}, {"rating": "9", "text": "The Romantic touch provides Pocahontas with Lush animation to go with its well crafted conflict."}, {"rating": "9", "text": "every Disney movie kicks a**. the animation in this movie is simply wonderful, the characters were amazing, and the songs were enjoyable. Pocahontas is a beautiful movie for kids and adults.\r Rating: 9/10"}, {"rating": "5", "text": "Uma das mais fracas animações da disney"}, {"rating": "5", "text": "Overall Pocahantas is an ok. It barely passes. The characters for the most part are not that interesting. The film lacks originality. The story has flaws. What saves the movie though is decent animation, the fact that the characters are not bad but not spectacular, a couple good songs.  If you see this film do not go in with great expectations it’s a weak forgettable film and I can see why it ruined Disney’s victory streak."}, {"rating": "6", "text": "Another highly recommended Disney family movie! Pocahontas was amazing till the end. I mean, in Lion King 2 (Simba's pride) the battle between the two clans has stopped after a while. In Pocahontas it didn't even start! I was expecting some action at the end! So the only thing i didn't like was, that it ended too easy. But my final score is 6/10"}, {"rating": "7", "text": "While \"Disney's Pocahontas\" once again uses Disney's musical formula, it does succeed  on its breathtaking animation, songs, and music, but it lacks the clever storytelling that its predecessors did. With some of its plots are bland and could have been worked on, its sheer joy of beauty and love holds the film together."}, {"rating": "4", "text": "Pocahontas does not feel like a Disney movie. The animation is some of the worst I've seen in a Disney movie and the story is bland and follows very stupid source material and themes that I can't stand. The message was also not very good, it felt cliche and unoriginal. The only thing I liked about this film was probably the music. I am pretty baffled that this film was considered \"Disney's Main Project\" at the time while The Lion King was considered like a \"B project\" or a \"side project\" that was just not as important. I would probably not recommend watching this film."}, {"rating": "10", "text": "Ondolemar the Banana Elf\r>I was only 9 years old >I loved Mr. Krabs so much, I had all the merchandise and seasons >I pray to Mr. Krabs every night before bed, thanking him for the life I've been given >\"Oh yeah, Mr. Krabs.\" I say; \"AAAAAAAAA\" >My dad hears me and calls me a barnaclehead >I know he was just jealous of my devotion for Mr. Krabs >I called him fish paste >He slaps me and sends me to go to sleep >I'm crying now, and my face hurts >I lay in bed and it's really cold >Suddenly, a warmth is moving towards me >It's Mr. Krabs >I am so happy >He screams into my ear \"AAAAAAAAAAAAAAAAAAAAAAAAAAA\" >He grabs me with his big meaty claws and puts me down onto my hands and knees >I'm ready >I spread my ass-cheeks for Mr. Krabs >He penetrates my butt-hole >It hurts so much but I do it for Eugene >I can feel my butt tearing as my eyes start to water >I push against his force >I want to please Mr. Krabs >He roars in a mighty roar as he fills my butt with his love >My dad walks in >Mr. Krabs looks him straight in the eyes and yells \"AAAAAAAAAAA\" >Mr. Krabs leaves through my window >Oh yeah, Mr. Krabs. >AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"}, {"rating": "7", "text": "Possibly the weakest installment made during the Disney Renaissance. It works out as a standard Disney movie, but it doesn't completely work as part for the Disney Renaissance."}, {"rating": "2", "text": "this movie is very inapropiate at times but the music isnt half bad it aged very well but this is the worst movie from 1995 if you wanna watch a good disney movie from 1995 watch toy story after puking from pocahontas this film has so much bad things i cant list them all"}, {"rating": "10", "text": "After the huge successes which Disney has made like The Little Mermaid, Beauty and the Beast, Aladdin and the massive box office smash hit The Lion King Disney went downhill of his spiral animated movies but it means well and it has some moments. it was mixed by critics and audiences alike but that doesn't mean this movie's bad, no way. Me and my friends liked it especially for girls. Just like in the previous films, me, Jacob and Liam have been quoting the lines and singing songs from it. Years ago me, Jacob and Liam have been teasing our taxi escort Pat by saying ''Oh, a dream! Let's hear all about it!'' ''Quiet!'' ''Quiet!'' ''Now, child, you were saying?'' That really made us laugh! So let me get to the story. Now it's kind of complicated to say this but it's based on an actual fact so I'm not going to give away any spoilers so I'm going to give you descriptions about the story. So people think the story is so boring and so predictable and the ending almost bored me but I got over it but the opening had me thrilled where the people on the ship went into the storm and then Thomas fell off and John saves him. That's an awesome opening! That was when I was a kid. The animation is fantastic even with the colours. The animators had some talent with the animation as always like in the previous Disney films. But didn't I mention about the character animation? No. So with the character animation is so stylish again just like in the previous films, some are cartoony and stylish. Boy, the animators really do have some style in animation and character animation and they really do put in lot of effort in the previous Disney films. There's the main character Pocahontas who is adventurous but for me I don't find her interesting but I didn't realize that she was the Disney princess but the girls might so that's basically good. There's John Smith voiced by who I swear voiced by Mel Gibson from the Lethal Weapon franchise. Believing an actor who would get in with the character is who you really believe that people will recognise the voice who you heard and what he looks like. Here's the greedy Governor Ratcliffe who is ruthless who made the Virginia Company digging for ''Gold! Gold! Gold!'' He was voiced by David Ogden Stiers who also voiced Cogsworth from Beauty and the Beast. Now is it me or does he do two different voices? He also voices Wiggins, Ratcliffe's manservant. Those men named Thomas voiced by Christian Bale and Ben voiced by Billy Connolly. he gets some funny lines but really? He said ''It could look like Ratcliffe's knickers for all I care, so long as we get off the stinking boat!'' That's f**king silly! There are some side characters though like Meeko and Flit, Pocahontas's pets. Nakoma who's Pocahontas's best friend. Grandmother Willow, Pocahontas's guide. Percy who is Ratcliffe's pet and Pocahontas's father, Chief Powhatan, chief of the Powhatan. Man, these characters are so likeable I could even think about it for as long as I live. The songs, you know who written the songs. It's Alan Menken. You know the music because it's composed by Alan Menken who brought you music from The Little Mermaid, Beauty and the Beast and Aladdin. There's a song which me and my friend Liam have been singing. The song is called Mine Mine Mine which is a good song. Liam joined in because I was quoting lines and he joined. Here's what I said ''Now, gentlemen, to work! You men, get the ship unloaded. You men, build the fort. The rest of you, break up the shovels. It's time to start digging.'' ''Digging?'' ''Why, of course. Let's not forget what the spanish found when they came to the New World. Gold! Mountains of it. Why, for years they've been ravaging the New World of its most precious resources. But now..... it's our turn.'' And then me and Liam started singing. We've been singing the opening song called The Virginia Company and we've been singing one of my favourite song Savages. Hell, one of my friends have heard me singing it like Sam Hudson and my parents. I've been singing that song everytime I'm in the mood. There's a song called Colors of the Wind. First there's Pocahontas singing it even Liam Fleming have been singing it as well. I could even remember the lyrics. And then there's the theme song and I gotta say, it is beautiful. Sung by Vanessa Williams. There's another theme song called If I Never Knew You and I liked it. I like this movie as a kid and a teenager and my friends Jacob and Liam. It's a memorable movie filled with beautiful animation, characters that are memorable but people think they're bland and forgettable but by god. The songs and music that will make you hum and sing along everytime you in the mood to sing. I know I did. Now for the people who watches this they'll know what to expect. Some people liked, some people don't, it's just a film which is one of Disney's weakest. It's a memorable Disney animated movie for people to enjoy if they're in the mood."}, {"rating": "8", "text": "Slightly Disappointing, But SolidConsidering Disney had 4 masterpieces the past 6 years, Pocahontas feels slightly underwhelming, But it’s still a great film."}, {"rating": "7", "text": "The major plot of this movie, it's from when the europeans was sailing around the world, of course, in a romanticized way looking for treasures, lust, adventures. We accompany when england sailors travelled to Virginia looking for gold and one of the main characters is introduced, John Smith, a indian slayer, by the way, the natives from where they would invade was called of savages and they though that was helping them with the invasion, showing them there culture and how they could grow like the englands, that was the englands point of view. The natives are all indians and live 100% with what the earth gives to them, they face wars between tribes and have problems with some situations, but they were living well and nice before the englands arrived. One of the indians is Pocahontas, the name character here, daughter of one of the leaders of their tribe, she is sweet, love the atmosphere there, and the movie did it really nice there, you can really felel the place, she is promised to marry with a great warrior from their tribe, but she don't think that he will be able to live the life with her the way she wants, searching for adventure. When the english people arrive their, John Smith go have a walk at the forest, and discover Pocahontas, they fall in love and from their the plot keep going.One of the best things about this type of disney movie, are the songs, and in Pocahontas there are some nice songs, but most of them aren't so outstanding, i don't remebered much of those after it was over, the songs are ok, they use it to tell the story in some moments, in others i don't felt that it was very necessary. But there is one song that is really outstanding and i definiely keeped remembering of it after it was over, wich was \"Colors of the Wind\", the song not just develops the most important relationship of the movie, making the 2 most possible different humans in that universe meet and expose the differences between those two very different people that have a very different customs and a very different way to see things, it shows very well the shock between these two cultures. The movie was very happy into showing the vision of each one about the other before this song, because here it was revealed somethings. The song also is great because it does have some nice critics that it is still very recent, and the people from nowadays world can still learn a lot from it, one example of how nice the song is and one of his best lines is: \"You think the only people who are people, are the people who look and think like you. But if you walk the footsteps of a stranger...you'll learn things you never knew you never knew.\" this is so powerfull, like there are so many people with certain ideology that doesn't just respect the others with different thoughts, but also that doesn't even want to hear what the other have to say, doesn't want to know the other peoples culture, and just hates for the sake of it, this movie teach this kind of good thing for life, even in todays world. All of this without mentioning the great singing by Judy Kuhn could pass the perfect emotion, she was so great singing this one, the voice of explaining and trying to make things better, was just so great.One of the bad things of the movie is the villain, he isn't very remarkable and didn't had much to do, he is just the big bad that hate everybody with prejudices and needed to be stopped, he is a lot stereotyped, and about that, a lot of the characters are, there is one specific that should marriy with Pocahontas and she doesn't want because apparentely he doesn't want adventure and stuff and he also is a big strong guy, but the movie never shows why she thinks that he isn't a perfect guy, seems that it is just because he is a big strong one. The solution that they find at the end, i didn't bought that completely, it wasn't bad, but wasn't very good neither. I believe that it could have been a little longer movie.The support characters are ok, the animals are great, so as the tree, wich is nice, that shows how is her relation with the nature, how she consider everything as her family and one of her own, wich was another great point of the movie, at some moments you can completely feel the ambience, the animals, during some songs, when she is talking about animals or some aspects nature, it is great how we can feel all about that world and how great the forest really is and why, the humans support characters aren't that good, some of them have some meaning but were kind of wasted.The movie is funny, have a lot of meaning and powerfull things that everybody should learn, but also have some problems with character and conclusion and characters, but is definely a must watch."}, {"rating": "4", "text": "A Traveller But Not A Tourist.PocahontasDisney's short list of mediocre films has this titled in bold and capitals. Raising the issues of diversity and equality, the concept of the film is morally on mark but the narration is far from target. Along with such political and social messages, it also explores the innocence of the nature which is weaved out smoothly with the script. But this is where the wheel of this plethora of various genre gets stuck. The tale never outgrows beyond its concept, from the first frame, the anticipated trajectory is mapped out, which is exactly where the track directs towards. There is no surprise, no fresh perspective nor any new layer of screenplay disclosed for the gravitas.As usual, the film is visually stunning along with catchy songs like \"Colors Of The Wind\" and \"Mine, Mine, Mine\". And as much as beautiful the songs are, the musical act or choreography is arguably dull. Another trademark Disney tactic, is to blend in pets as a sidekick that offers a light yet smart tricks and humor to the plot. The voice cast lives up to their role with Gibson and Bedard as the lead couple marks their signature. Bale gets few stand alone moments but that too is overshadowed by Gibson's character.Aforementioned, one of the best bits of the feature is the makers narrating the actual intentions through sidekicks, like the pets and the wise old tree, the conversations among them is the highlight of it. Consistently, where the film keeps failing, is how the writers are building up the sequence, not only is it done with old cheesy methods but it also makes you uncomfortable to encounter it. Pocahontas may attempt to raise the bar for the mature audience, but all it has to settle for is be the dream among its younger audience."}, {"rating": "10", "text": "I think is pretty good movie, it's probably not a one of Disney's best, but pretty legit. This is very gorgeous movie to watch and the writing and the voice acting are solid."}, {"rating": "8", "text": "Why on earth is this movie rated so low? It's even rated lower than some of the DTV sequels. That shouldn't happen. It is historically inaccurate, but why should that be an issue? All I want is a visually stunning film with great music, and that's what I got. The animation is splendid. America looked so rich in colour, and the colours were so bright. The songs are sometimes the weakest element of an animation. Here it is the main reason why this movie is so memorable. \"Colours of the Wind\" is one of the most beautiful songs I've heard, and I've sung it before. Pocahontas's singing voice is none other than the Broadway singer, Judy Kuhn, who was absolutely terrific. When I was 12, I tried to sound like her. The incidental music is also definitely the most lyrical of the Alan Menken scores. The weakest element of the film, is actually the character development. The protagonist, voiced by Irene Bedard, is very well done, but most of the other characters are not as effective. Mel Gibson has a singing voice, but his speaking voice is too monotonous to my liking, and Ratcliffe isn't a very likable or memorable villain at all(one of Disney's blandest villains actually), despite enthusiastic voice work from David Ogden Stiers. But Meeko and Flit are great fun, and Grandmother Willow was good too. Don't say this film is racist. Some of the imagery is fantastic in the songs of war and animosity, and the film has a great love story and message. The ending was actually quite effective and poignant. In conclusion, one of the least memorable of the Disney movies, is so worth watching. 8.5/10. Bethany Cox"}, {"rating": "6", "text": "Like the famous song \"Colors of The Wind\", its color design is amazing, and enjoyed till the end. However, I can say that it wasn't perfect when it comes to ending, other characters, and plot."}, {"rating": "6", "text": "This movie was fine and my low score compared to other Disney works has nothing to do with its politics. I just felt it wasn't as iconic as other cel-shaded works from the period and never felt myself drawn to it as a teenager. This made it difficult to get me in the mood to appreciate it."}, {"rating": "6", "text": "Pocahontas si bien no la considero un clásico de Disney entiendo a la gente que le encanta. Es muy bella y con una trama decente dentro de todo. Siento que forzaron bastante el romance entre Pocahontas y John sintiéndose mas un amor a primera vista sin muchos conflictos, ademas de que muchas escenas de la película se justifican en base a las \"creencias de la tribu\", sin embargo, esto termina siendo usado de manera sobreexplotada para justificar sucesos sin meterles mucho empeño en los mismos, como al final de la película cuando detienen la pelea solo porque sopla un viento en la cara de todos. Tiene escenas forzadas o que podrían haber sido mas explotadas, pero al final de cuentas es una buena pelicula."}, {"rating": "8", "text": "In 1607, the Susan Constant sails from London to the New World, carrying English settlers from the Virginia Company. Onboard are Captain John Smith and the voyage's greedy leader Governor Ratcliffe, who seeks gold as part of his plan to bring him wealth and status. Along the way, the Susan Constant is caught in a North Atlantic storm and John saves young, inexperienced crewmate Thomas from drowning. As they approach the New World, the settlers, including John, talk of adventure, finding gold, fighting \"Injuns\" and potentially settling in the new land.In the Powhatan tribe in Tsenacommacah, North America, Pocahontas, the daughter of Chief Powhatan, fears being possibly wed to Kocoum, a brave warrior whom she sees as too serious for her own free-spirited personality. Powhatan gives Pocahontas her mother's necklace as a present. Pocahontas, along with her friends, the raccoon Meeko and hummingbird Flit, visit Grandmother Willow, a spiritual talking willow tree and speaks of a dream involving a spinning arrow and her confusion regarding what her path in life should be. Grandmother Willow then alerts Pocahontas to the arriving English.Ratcliffe has Jamestown built in a wooded clearing and immediately has the crewmen dig for gold. John departs to explore the wilderness and encounters Pocahontas. They quickly bond, fascinated by each other's worlds and end up falling in love, despite Powhatan's orders to stay away from the Englishmen after Kocoum and the other warriors engage them in a fight. Meanwhile, Meeko meets Percy, Ratcliffe's pet pug and becomes the bane of his existence. When John tells Pocahontas that he and his men are here to find gold, she tells him that there is no gold. Pocahontas introduces John to Grandmother Willow and avoids two other crewmen, but Pocahontas's best friend Nakoma discovers her relationship with John and warns Kocoum. Ratcliffe also learns of John's encounters with Pocahontas and angrily warns John against sparing any natives he comes across on pain of death.Later, John and Pocahontas meet with Grandmother Willow and plan to bring peace between the colonists and the tribe. John and Pocahontas share a kiss, while Kocoum and Thomas, sent by Ratcliffe to spy on John, witness from afar. Furious, Kocoum, screaming a battle cry, attacks and attempts to kill John, but Thomas intervenes with his musket and kills Kocoum, who destroys Pocahontas's necklace in the process. John orders Thomas to leave just before the tribesmen arrive, capture John and retrieve Kocoum's body. Enraged at Kocoum's death, Powhatan declares war on the English, beginning with John's execution at sunrise.Thomas reaches Jamestown safely at night and warns the English settlers of John's capture. Ratcliffe then rallies his men to battle using this as an excuse to annihilate the tribe and find their non-existent gold. That same night, Powhatan also orders his men to prepare for battle. A desperate Pocahontas visits Grandmother Willow, where Meeko hands her John's compass. Pocahontas realizes John's compass was the spinning arrow from her real life encounter, which leads to her destiny. Morning comes, and Powhatan and his tribe drag John to a cliff overlooking a clearing for execution. Meanwhile, Ratcliffe leads the armed colonists to the cliff to fight Powhatan's warriors. Just as Powhatan is about to execute John, Pocahontas intervenes and finally convinces him to end the fighting between the two groups and to spare John's life. Everyone accepts gratefully and John is released; when the unmoved Ratcliffe orders his men to attack, they refuse to. Enraged, Ratcliffe fires a musket at Powhatan, but John shields him and is hit instead. The settlers, livid at Ratcliffe, turn on him and arrest him for hurting their comrade.John is nursed back to health by the tribe, but must return to England for further treatment if he is to survive. Ratcliffe is also sent back to England to face punishment for his crimes against the settlement. John asks Pocahontas to come with him, but she chooses to stay with her tribe. Meeko and Percy, now friends, give Pocahontas her mother's necklace completely fixed. John leaves without Pocahontas but with Powhatan's blessing to return anytime he likes. The film ends with Pocahontas standing atop a cliff, watching the ship carrying John depart."}, {"rating": "6", "text": "Never really got into this movie. It's ok but I don't think it's as good as everyone gives it credit for."}, {"rating": "10", "text": "One of the best Disney movies ever created. Beautifuly animated, with the best soundtrack I've ever heard and some of the most iconic characters created by Disney. A female hero that saves the day for on of the first times ever in a Disney film, anti-war, ecologist, anti-racist and anti-colonialism messages that are all what our generation needs. A modern fairytale in the shape of a realistic fantasy based on real history and people, but with a necessary twist of hope and understanding. The bittersweet ending makes it the most risky movie of the Rennaissance era and also the most adult and mature. The extended edition including a deleted song is much recommended as it gives great depth and delightful emotion to the main characters's relationship and makes the ending even more dramatic."}], "recommendations": ["moana", "the_road_to_el_dorado", "aladdin", "the_prince_of_egypt", "sing", "the_lion_king", "vivo", "the_hunchback_of_notre_dame", "brother_bear", "the_jungle_book", "the_princess_and_the_frog", "mulan", "trolls", "finding_nemo", "brave", "my_little_pony_a_new_generation", "over_the_moon", "song_of_the_sea", "bambi", "luca", "rio_2", "strange_magic", "rock_dog_2_rock_around_the_park", "the_little_mermaid", "spirit_stallion_of_the_cimarron"]}