{
  "id": 1813,
  "title": "Polar",
  "starring": [
    "Macarena Gómez",
    "Pedro Casablanc"
  ],
  "runtime": 76,
  "genre": [
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "MG, a policewoman who has been expelled from the Corps due to the problems with alcohol and drugs that she has had since the loss of her son, receives a call from a man asking her to look for Macarena Gómez, a popular TV actress.",
  "releaseYear": "2022",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/efuKHH9LqBZB67AS87kprLgaYO8.jpg",
  "categories": {
    "plot": 4.318181818181818,
    "acting": 4.529411764705882,
    "ending": 2.25,
    "soundtrack": 3.6666666666666665,
    "cinematography": 7.333333333333333,
    "familyFriendly": 8.75,
    "funny": 5.166666666666667,
    "action": 5.764705882352941
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The usual, movie critics being out of touch with the audience of the film. Its a great movie, strong plot progression and smart ideas all around with quite a stylish execution."
    },
    {
      "rating": "6",
      "text": "If u want to have just mindless fun, and completely switch off, look no further. but storywise, it is not a great movie, Mads Mikkelsen and Katheryn Winnick are the only ones making this movie better. I think the director couldn't decide how to handle this movie, some parts are way over the top comic book movie, but some parts are trying to be darker and more serious. Sadly, because of this the movie is all over the place. With a better director, this movie could have been so much better"
    },
    {
      "rating": "0",
      "text": "Polar is a movie that involves a lot of torture. However, the real torture is endured by you the audience, when you watch this piece of trash movie. It's a movie that does everything it can to emulate the success of John Wick, and fails in every possible category."
    },
    {
      "rating": "5",
      "text": "it was ok, but to cheesy in my opinion. Would be a 3 or 2 if Mads Mikkelsen wasn't in this movie"
    },
    {
      "rating": "3",
      "text": "Polar wants to look like John Wick. Except Polar is a Polish shooter in the world of AAA projects. In it seems everything is not submitted seriously, characters cartoon. The script was written by a 5 of the first class, and the characters are completely not specified characters. In general, it turns out that the film is one big parody. And even you watch it to the end not because the actors play perfectly, or the script is so fascinating, but because it is just interesting how this circus will develop further. By the result in the film there is only one element that succeeded - acting Mads Mikkelsen."
    },
    {
      "rating": "3",
      "text": "An extremely hollow violent fantasy that goes absolutely nowhere.Mads Mikkelsen deserves so much better."
    },
    {
      "rating": "1",
      "text": "Who the hell gave money to make this trash. This is most disgusting film ever."
    },
    {
      "rating": "1",
      "text": "A movie that started out with some promise but then shot itself repeatedly over and over again, showering us with unlikable characters as well as needless explicit content and gore."
    },
    {
      "rating": "3",
      "text": "Just terrible in every way. Unnecessary over the top violence. Very disappointed."
    },
    {
      "rating": "0",
      "text": "Madds is the only good thing in the movie. I literally made an account to review this trash movie.Literally a John wick / Tarantino rip off. From the start there is over the top sexualization, so bad it makes the game of thrones nudity/sex look like a kids movie. Couldn't even make it to the end, it's absolute trash."
    },
    {
      "rating": "0",
      "text": "I hated this movie so much I had to create an account here.Horrible waste of time.The movie looked like it had some promise, with an interesting story line, but it turns awful, and the ending is infuriating.  I guarantee you say, \"That's it?\" at the ending.The character in the red/yellow coat is ridiculous, and a lot of the assassins and assassinations are ridiculous, too.  So mad I wasted time on this."
    },
    {
      "rating": "7",
      "text": "Once again, critics don't get it (and I've been one for 35 years). This is pure popcorn fun. Sure, the plot is hackneyed, but the direction is wildly fun and there's plenty of violent action. After all, that's what it's all about. Just sit back and enjoy it."
    },
    {
      "rating": "8",
      "text": "I created an account just to say that the reviewers are so lost on this one. This is a fun, stylistic, action flick with some unique things going on. If you dig the genre, it's definitely worth a watch."
    },
    {
      "rating": "1",
      "text": "A mess of a story. A waste of immense talent (Mads Mikkelsen). A movie that tries to be cool and violent and hip and deep at the same time and ends up being nothing but a boring 118-minute cluster inside the most famous streaming service in the world. Mr. Mikkelsen is a powerhouse. Enjoy him in \"The Hunt\", \"Casino Royale\" or \"Hannibal\", or anything he has done before, but not this."
    },
    {
      "rating": "0",
      "text": "Couldn't finish it. Go ahead and call me a prude all you want but all I see is a potentially good plot ruined by absolutely boring, dragged on scenes that I'm 99% sure were put in just for shock value. Once the shock wears off, there's nothing left. I've got no problem with violence in film or television if there's a purpose, but critics are right on this one. There is an audience, in people who don't like to think, I guess. I haven't read the graphic novel but if it's anything alike, it genuinely might've worked better there, since you wouldn't be forced to wait twenty minutes mindlessly watching the blood splatter before getting to turn to the next page."
    },
    {
      "rating": "8",
      "text": "Relax, tighten your restraints and have sedatives at hand. If you can avoid taking it too seriously the film will make you happy your real life is not as Fu**ed up as Duncan's and provide a crazy ride with some gore soaked finesse."
    },
    {
      "rating": "10",
      "text": "Hands down one of the best movies on Netflix!If you want to have a fun time with your friends this is a must watch."
    },
    {
      "rating": "8",
      "text": "Whatever critics write it's a nice movie. Stylish, entertaining and i liked Hudgens/Lucas at their roles. Mikkelsen was a bit emotionless buy, hey, he's the world's most deadly hitman - he should not have lots of emotions."
    },
    {
      "rating": "0",
      "text": "Full disclosure, I got 48 minutes into this film and stopped watching because I could not bear another moment. In that time, the film manages to have zero tension, tedious action scenes, jokes that fall flat, and an attitude to women that comes across as perhaps the most unsexy attempt at sexualisation I've ever seen. Even the music is boring.Does a fat man shot in the testicles with a nail gun sound funny to you? Does an obese man being called \"meatloaf\" while he is strangled? Do you like the idea of someone with just enough charisma to be a sidekick being cast as a flamboyant villain? How about a boring action scene in which someone is shot, and then some other people meander towards them and shoot him a couple more times, does that sound enjoyable?Watch John Wick, or Kingsman: Secret Service, or Kick-ass. Don't waste your time on this."
    },
    {
      "rating": "8",
      "text": "Just a warning, this is a very dark and violent film, but if you're into this sort of action drama, it's very good. Mads Mikkelsen is excellent in this role, and it's worth watching for him, alone.The first act is too cartoonish, as all of the main characters are introduced with their own title sequence. Honestly, no one cares about that. Most of those names are of no importance to the storyline. The only name you need to know is the main character (Duncan).But this movie gets progressively better, and finishes with a strong third act.The critics are really trashing this film, but honestly, I don't see it as all that different from similar films made from ultra-violent graphic novels. Again, this is a genre that either appeals to you or it doesn't."
    },
    {
      "rating": "1",
      "text": "Mads Mikkelsen, poor Mads what have you done....When I saw the trailer I can honestly say I was looking forward to this film.  I was ticking off the calendar in anticipation for the 25th January to arrive.  What a disappointment.  The director better known for music videos and it shows.  Little Britains Lucas as the camp bad guy, lazy writing, poor acting and way too long.  After the first 10 minutes, I felt like giving up but held on to the end. I don't feel like going into a lengthy review when a lot of the negatives have already been made by other critics and reviewers.  Suffice it to say, what a pile of poop. Please, Netflix don't make a sequel."
    },
    {
      "rating": "2",
      "text": "Oh Mads... what happened here. The sole reason I watched the movie was for him and nothing else (Okay maybe the trailer looked cool... especially the lobby escape)But the Movie was just plain bad. From acting, to editing, to sound design, to basically all about the final product. Mads gave it is all but it was sadly not enough to salvage the filmDo yourself a favour and skip this one."
    },
    {
      "rating": "2",
      "text": "\"Polar\" is trashy, but not in a pleasant way. I understand it's based on a graphic novel, but that doesn't give the film a pass for being misogynistic or grating on the eyes with its wildly oversaturated color grading. The fact that this stars someone like Mads Mikkelsen is even more maddening."
    },
    {
      "rating": "9",
      "text": "Polar is a fun, stylish movie. Is it a masterpiece? No. Does it want to be a masterpiece? Probably not. I don't see why people can't judge it for what it is, an action-packed, violent, light movie. Do you want to spend a few hours entertained by ludicrous action, over the top assassins and weapons? Watch it! Are you appalled by violence and are looking for an absolute masterpiece with incredible depth and enlightening dialogues? Move on, this is not the movie for you. (nor does it want to be)"
    },
    {
      "rating": "9",
      "text": "Yet another baffling set of scores from the 'professional' critics. They really are out of touch with normal TV and movie viewers. I really enjoyed this movie. Always been a fan of Mads Mikkelsen and he pulls off the role of a very cool and charismatic hitman brilliantly in this. The story was surprisingly straight forward without any nonsense. Matt Lucas was great as the very punch-able main villain too. Give it a watch. You'll enjoy it."
    },
    {
      "rating": "3",
      "text": "I watched because of Mads but was sorely disappointed. First off, the summary of the film is misleading. He is not settling into retirement because he has not yet retired. They don't want to silence him, they want to kill him so they don't have to pay him his pension. You could tell that this film was done by Jonas Akerlund because of all the satanic/masonic/illuminati production scenes. It even seemed as though many of the costumes Katheryn Winnick wore came from Bea Akerlund's closet. They even had Richard Dreyfuss *grand master mason* and *32nd degree Scottish Rite mason* to round out the mason symbology. Lots of gore. Some nakedness and sex. A lame script and a few good scenes with Mads. Oh, every time I saw Matt Lucas all I could think of was Vicky Pollard from Little Britain trading her baby for a Westlife cd.I found this movie to be derivative, predictable, and way over the top. The ending leads us to believe there will be a sequel but I won't be back for it. It's a solid 3 out of 10 stars."
    },
    {
      "rating": "7",
      "text": "This feels like a mix of Sin City and John Wick. The movie plays a lot like a comic book. Action sequences with extreme violence are a lot of fun. However the movie has slow scenes in between the action, and this hurts the pace badly. Some of the sex scenes are borderline porn and awkwardly long. It would help to cut twenty minutes or so from it. Vanessa Hudgens is very underutilized, but the rest of the cast works well."
    },
    {
      "rating": "0",
      "text": "this movie is absolute junk. very ignorant and dumb dialogues. waste of time to watch this movie"
    },
    {
      "rating": "8",
      "text": "Loved it,  honestly absolutely baffled with the \"critic\" reviews, there giving the film very negative reviews citing things in it such as violence, gore, sex etc to which the same reviewers praised in John Wick, happily saying it's more violent than ever it will leave you in awe."
    },
    {
      "rating": "9",
      "text": "What exactly do you want from a good movie?Only those 4 fools are bad.Mads Michaels is a good casual killer"
    },
    {
      "rating": "10",
      "text": "Just watch it! What a movie, big fan of Mads and thus I can be based, but it was a hell of an adaptation!"
    },
    {
      "rating": "10",
      "text": "Polar is amazing movie, please dont listen to those crazy reviewers.I dont know, but they must have seen another movie or they totaly didnt get the movie.Mads is amazing, action scenes are great, some funny scenes and ofc totally amazing soundtrack by Deadmau5. If you liked John Wick and similiar movies, you will like this too."
    },
    {
      "rating": "10",
      "text": "Veeeery good movie. It's action packed, has a very simple plot. Retired hitman tries to live a simple life but gets his peace interrupted. Very stylish and fun action direction, tons of visual metaphors and good foreshadowing. Very nice color distinction between the villain's wild life and the\"boring\" and \"monotone\" life the protagonist tries to get. I enjoyed it, 10/10."
    },
    {
      "rating": "3",
      "text": "I liked John Wick, The Punisher, Sin City, The Night Comes for Us. I did not like Polar. It is a bad movie.Mads Mikkelsen is indisputably a cool guy, the Danish Idris Elba, as it were, and his more contemplative half of the movie with Vanessa Hudgens in the snowy town is pretty ok. Even some of the humor there works. The action scenes, of which there aren't really that many, are also ok. If the movie had remained on that level, it'd be about a 6.Unfortunately the other half is embarrassing cheesy trash trying so hard and failing so abysmally at creating scenes similar to ones from cool movies made by people with talent. At no point does it even come close. It's seriously Uwe Boll level. Just revolting, absolute hack garbage. The people responsible should feel ashamed and owe Mads an apology. May God have mercy on their souls."
    },
    {
      "rating": "8",
      "text": "Another example of the movie critics having no **** idea what they're talking about.The movie was pretty bloody great. I put it on expecting some over-the-top corny action that was completely forgettable.What I got was Schlong Wick.The movie doesn't take itself too seriously while telling a pretty decent story. The fact that the 'professional' movie reviewers panned it should be another reason you should watch this gem of a movie. They clearly have no concept of what makes a movie good to watch."
    },
    {
      "rating": "7",
      "text": "This is not a great movie, but I still had a lot of fun. Mads Mikkelsen is perfect, whole picture should be judged with a pinch of salt. Slow at first, then fast, brutal and twisted at the end."
    },
    {
      "rating": "10",
      "text": "I am not sure why people do not like this movie. I think it's a really good action packed movie. And Mads M gives a great performance as always. Sex scene is hot with younger chic. I wouldn't have wanted him shot if I had been her, JUST SAYING....LOL I would have tried to save him more. He is a BAMF (Bad Azz MF), he just has the look. Movie was packed with all kinds of different craziness. The plump villain bad man plays a good/mean villain in a quirky sorta way. Vanessa does a good job playing the scared neighbor. The chic from Vikings is excellent. Superb acting  by all in this film. A lot of blood and shooting, not for the sensitive peeps. And this movie is very clear and bright for some reason. Yes, I have big Sony HDTV, but for some reason more Clear and Crisp than most films that I have seen lately. Maybe my eye sight is improving or this film was done in some really awesome video camera work, Idk. Should have higher reviews. I am house bound and watch movies everyday for many years. This one is worth the watch. Kinda like some Quentin Tarantino movies without all the EXTRA talking....and with more of a plot and story. Only one part I did not care for Rusty, that shouldn't have happened. The rest is really good."
    },
    {
      "rating": "6",
      "text": "OMG, who cares about the movie, lol? Mads Mikkelsen's perfect stubble & mustache, not to mention his glorious chest hair. Grrrr....Mr. Blut resembles a cross between Gary Busey & Elton John...I can see parts of John Wick, Sicario, RED; still entertaining, tho campy & implausible in parts."
    },
    {
      "rating": "3",
      "text": "A mindless clone of John Wick with a much higher degree of implausibility, mindless violence, comic book writing, and not much else.  Netflix is carrying on with quantity over quality in 2019."
    },
    {
      "rating": "2",
      "text": "This movie is so nauseatingly bad that here is no point even giving it constructive criticism as it is so beyond repair. The only thing cnstructive that can come out of this movie is to show film makers and actors not what to do. It is appauling and offensive."
    },
    {
      "rating": "7",
      "text": "\"Polar\" is the shortened name from the source graphic novel, and boy, is the violence graphic! If you want to desensitize your kid or a friend to human violence, then this ranks in the top 3. The plot is unremarkable, you've seen it dozens of times before, but the violent antics of Duncan (Mads M) and the Suicide Squad-like kill team are just shocking. Vanessa Hudgens attempts to ditch her cute-ness with a gritty drama role but it works about as well as dressing a kitten in a cowboy hat, still cute, sorry, so that's a casting miss and if you dwell on it too much can ruin the otherwise dark, violent vibe throughout. Kadee Strickland or Dawn Olivieri would've been a FAR better choice. Camille (Vanessa) doesn't have the commitment in the end to do what should be done, so we have the germ of the sequel which would include even more of Vanessa, so no thanks."
    },
    {
      "rating": "1",
      "text": "I've been an avid user of metacritic for years now but that is the first time I feel the need to create an account to write a review.This movie. Oh my god.Let's get this straight, I actually give it 1 because of Mads Mikkelsen whom is an amazing actor. That's it.First of all, I totally despise Rotten Tomatoes and this Actor Studio driven movement that believes movies must always lead to something incredible that will change your life. Now with that said:Most of us are probably aware that some people actually set the level of the worst director ever to a pretty high standard. So before seeing this movie, I didn't believe you could get any worse that Paul W.S. Anderson at making action movies. Let's face it, this Resident Evil (movie) franchise is dreadful. But now I'm reconsidering. I mean, this is taking bad directing to a whole new level. Jonas Åkerlund actually succeeded at making a movie starring Mads Mikkelsen, produced by Netflix with a O.S.T. made by deadmau5 one of the worst thing ever. This takes some serious investment at being bad.The story is totally dull but we can totally live with it in an action movie so that's perfectly fine. Except for the final plot twist that is just unacceptable and hasn't been properly built during the movie. Plus the plot is so convoluted and the character unremarkable that you won't even remember if you saw a character before when noticing him/her in a scene.Now the action scene could all be terrific. Like really terrific. But the movie takes it too far. Like the scene in the hallway when Duncan escapes. This actually started great, but after a few dozen guards this was just entirely moronic. The director actually spent a lot of time in fighting scenes with unknown guards and soldiers and NONE with the actual villain of the movie. Even if this guy would have been killed instantly we should haven seen that on screen instead of a CGI head thrown out of a window. That was a comic relief attempt at a moment that just did not fit comic relief and which was supposed to be the pinnacle of action.Now I'm not a big fan of abstract sex scenes with a romantic flavor to it in movies. I think they bring nothing to movies and they are pretty pointless. I can accept those in movies however since they always have been mainstream so why not. I actually prefer sex scenes like Game of Thrones which are more graphic but serves a purpose to the story or plot. This film has neither. This is just borderline pornography. I could have accepted the first scenes but the one between Mads Mikkelsen and Ruby O Fee is just moronic. You don't even understand if Duncan is aware of what's going or not. Was he lucky? When did he notice? That's plain bad.Apparently the villain has better guards than his \"A-Team\". Guards can actually resist Duncan longer than this bunch of idiots. They can't even hurt him while random dudes put 2 bullets in Duncan. What is this \"A-Team\" even here for? You don't have time to care about them since they all die so fast without any real build up between them except so scenes depicting them as brain dead teenagers.In fact, nothing is properly built up during this movie, the first part is just Duncan doing random stuff that will never ever matter in the movie. At first I even thought he was in love with the girl from the cabin. I can't remember her name since she is so dull! Then you get the \"A-Team\" killing a bunch of people we never heard about nor care about. Then stuff happens that is so random you won't even remember it after seeing this movie. And then the bad guy dies.There is actually something that made a lot of sense: The guards just get the hell out of the building when Duncan arrives after killing like 100 of them in the prison. That was actually a good idea. I would honestly get the hell out as well because Mr. Blut is nowhere charismatic enough to be protected with one's life.How can you cancel a show like Hannibal and then get this **** out on screen? Please ask Jonas Åkerlund to refund all the budget from this movie and use it for another season of Hannibal."
    },
    {
      "rating": "8",
      "text": "Watched this because of deadmau5 and I can say those reviewers shredded this movie unfairly. Side characters are not memorable and that Blut character was very bad and didn't fit the movie at all. But it was overall fun to watch.  7.5/10  (movie's OST's are top class also)﻿"
    },
    {
      "rating": "7",
      "text": "It's a fun, solid action flick. As others have said, the critics continue to be out of touch and haven't the slightest clue what sorts of films they're watching."
    },
    {
      "rating": "6",
      "text": "When did movie critics become such prudes? This isn't a great movie and it's a bit too long but it's certainly worth watching. (especially since it just comes with Netflix account). Parts of the movie look fantastic - especially the winter scenes."
    },
    {
      "rating": "7",
      "text": "Enjoyed the film. Original concept and execution. no reason for the poor marks received."
    },
    {
      "rating": "10",
      "text": "if you liked The Punisher, first Kingsman and brilliant netflix movie The night comes for you , you will love this movie,Actor Mads is perfect. Great Netflix thinking outside the box movie.Movie critics suffering from Netflix snobbery.Great graphic pulp movie and looking forward to the next movie which this one hints at."
    },
    {
      "rating": "10",
      "text": "Critics are, in my opinion, completely misunderstanding this movie. It's a graphic novel adaption, yes, perhaps it's not the deepest movie out there, but it's not meant to be. It's a well made action movie, it's done in a very unique style where a calm world of Duncan's retirement comes to clash with the over-the-top antics of his past. It entertains and packs a few good plot-twists. It might pack a bit too much gore for some, but if you're good with that, it's fun and very well made. John Wick meets Tarantino on steroids."
    },
    {
      "rating": "5",
      "text": "After seeing Mads Mikkelsen (who was fantastic in Hannibal) and Katheryn Winnick (who is also fantastic as Lagertha in Vikings) in the trailer I wanted to watch this. After watching it I'm left with a \"meh\" opinion. Mads was alright as Duncan but I thought Katheryn's Vivian was totally wasted. She was just there and didn't really do much. The villain Blut was more of a clown than a menace. And Vanessa's Camille was simply the product of bad writing. And lastly I found the banter between the group of younger assassins irritating at times. I guess the movie makers decided to throw in gratuitous violence to cover up poor writing. This movie had some potential. Sadly it was wasted. 5/10"
    },
    {
      "rating": "10",
      "text": "I'm a simple man and loved this movie. Everything is so exaggerated that it becomes funny and interesting in a way."
    }
  ],
  "recommendations": [
    "gamer",
    "crank_high_voltage",
    "underworld_evolution",
    "the_tax_collector",
    "shadow_in_the_cloud",
    "army_of_the_dead",
    "i_am_number_four",
    "transformers_revenge_of_the_fallen",
    "gods_of_egypt",
    "the_marine",
    "jumper",
    "the_twilight_saga_breaking_dawn_part_1",
    "the_twilight_saga_eclipse",
    "teenage_mutant_ninja_turtles",
    "crank",
    "underworld_blood_wars",
    "ghost_rider_spirit_of_vengeance",
    "eagle_eye",
    "next",
    "wanted",
    "doctor_strange_in_the_multiverse_of_madness",
    "the_bye_bye_man",
    "national_treasure_book_of_secrets",
    "bloodshot",
    "poseidon"
  ]
}