{"id": 4343, "title": "Police Academy 2: Their First Assignment", "starring": ["Steve Guttenberg", "Bubba Smith"], "runtime": 87, "genre": ["Comedy", "Crime"], "description": "Officer Carey Mahoney and his cohorts have finally graduated from the Police Academy and are about to hit the streets on their first assignment. Question is, are they ready to do battle with a band of graffiti-tagging terrorists? Time will tell, but don't sell short this cheerful band of doltish boys in blue.", "releaseYear": "1985", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/xyljfyGSJOdghPsycreHMsnhpU9.jpg", "categories": {"plot": 7.333333333333333, "acting": 7.0, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 6.5, "action": 5.0}, "reviews": [{"rating": "8", "text": "A typical good sequel. It has all the strengths of the first movie but is a bit weaker. It is again a good comedy and continues the story of the prequel. The 16th precinct has the highest crime rate in the city and is viewed as eyesore. Especially a gang named “The Scullions” is a torn in the flesh of the officials. The local police captain Pete Lassard is given an ultimatum by his superiors but has the problem that his staff is out manned. Luckily he can hire 6 new officers and asked his brother Eric Lassard for his best men. This gets him 6 members of the awesome cast of the first movie with Carey Mahoney, Larvell Jones, Moses Hightower, Larverne Hooks, Eugene Tackleberry and Douglas Fackler. Unluckily the second in command Ernie Mauser sees this as great career opportunity and does his best to sabotage the efforts together with his right hand Carl Proctor. With this the story starts. Again the charming cast of character and humor makes this an enjoyable experience. It has slapstick, word puns, pranks, parodies (of stereotypes) and character quirks. I think I also should give a nostalgia warning as I have fond childhood memories and it was a must see franchise in my youth / age group. The story itself is a solid vehicle for the humors and character and fully delivers in this regard. The established characters are the bread and butter. Steve Guttenberg returns as Carey Mahoney. He is the face of the franchise and again a scoundrel with a hearth of gold in uniform. Michael Winslow is back as Larvell Jones who still can mimic nearly all noises and uses this to the best of his abilities (and to great humor). Bubba Smith is Moses Hightower again. He is a noble giant and possibly the one with the greatest heart of them all. David Graf as gun nerd Eugene Tackleberry never fails to deliver. Marion Ramsey as Laverne Hooks is still a bit quite and shy but I would always miss her if she was not in the movies. Bruce Mahler is often overlooked as Douglas Fackler but still is a good addition. For the new characters we get Art Metrano as Ernie Mauser. He is in the love to hate category for villains. This means you enjoy his schemes and when he gets his punishment in from of pranks and mocking ;-). Lance Kinsey as Proctor is such an integral character that I was surprised that he was in the first movie. Should never be missing I any sequel. The Kirkland family has their own dynamics and will continue to appear. Bobcat Goldthwaith as Zed is so enjoyable that they will reuse him. Tim Kazurinsky as Carl Sweetchuck seems often like a sheep among wolves (I always thought his name was Sweetshark in my youth;-). A great cast of characters. The combination with the humor makes this so enjoyable. Overall this is a good sequel worth watching. It is not as refreshing as the first movie and a bit weaker but still pretty good. I have a sweet spot for the franchise and recommend at least the first 3 movies."}, {"rating": "4", "text": "There are some parts here and there that are funny and ends on a high note, but it only makes an attempt to make the plot more interesting. ★★☆☆☆1.2 / 4"}, {"rating": "6", "text": "In fact, I surprised myself by enjoying this film. Because it certainly compiles a plethora of flaws : it is often childish (less than the first movie though), a bit less than the half of jokes are mindnumbing and overwhelming, the scenario doesn't offer much more than the one of the first movie, the pace is jerky, most of the characters are totally empty shells, the acting is very average, some characters are just useless, punks are depicted in a disappointing way, etc.But some features made me have a good time. I found Mahoney (Steve Guttenberg) attractive and convenient. His presence and acting made me remember the amazing Matthew Broderick's performance on 'Ferris Bueller's Day Off (1986)'. Speaking of acting performances, I found Bobcat Goldthwait (playing as Zed) also incredible. They both bring to the movie a particular energy. Where the first movie was full of prejudices and ease of writing, this one goes just a bit deeper. Soundtrack is great. In contrast to the first film I found some jokes of situation comedy hit the spot. Watch it with your brain off and you will not regret it. But don't expect to laugh from beginning to the end."}, {"rating": "6", "text": "stara ale jara komedia.... bawi,śmieszy, rozluznia... generalnie o to chodziło także polecam."}], "recommendations": ["police_academy", "grudge_match", "central_intelligence", "role_models", "johnny_english_strikes_again", "spenser_confidential", "seven_psychopaths", "the_nice_guys", "daredevil", "logan_lucky", "spy", "jumanji_the_next_level", "red_2", "the_dilemma", "jerry_maguire", "blockers", "trouble_with_the_curve", "spider_man_homecoming", "the_boss", "the_next_karate_kid", "as_good_as_it_gets", "lawless", "the_royal_tenenbaums", "hot_shots", "the_king_of_staten_island"]}