{"id": 4627, "title": "Police Academy 4: Citizens on Patrol", "starring": ["Steve Guttenberg", "Bubba Smith"], "runtime": 88, "genre": ["Comedy", "Crime"], "description": "A new batch of recruits arrives at Police Academy, this time a group of civilian volunteers who have joined Commandant Lassard's new Citizens on Patrol program. Although the community relations project has strong governmental support, a disgusted Captain Harris is determined to see it fail.", "releaseYear": "1987", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/vvk5aWBJE3EqDX2ln6M4J4UiUXr.jpg", "categories": {"plot": 6.0, "acting": 6.0, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 6.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "This one is the first movie in the franchise that could not win me over completely. It is however not garbage or truly weak. Also it is the end of an era as many characters never returned to their roles after this like Steve Guttenberg (Carey Mahoney), Bobcat Goldthwait (Zed McGlunk), Tim Kazurinsky (Carl Sweetchuck) and Brian Tochio (Tomoko Nogata). On top on this Art Metrano (Captain Mauser) had an injury that prevented him from participating in this movie and he never returned to the franchise too. He was replaced by G. W. Bailey who returned to his classic role as Thaddeus Harris. The movie centers around an idea of Commandant Eric Lassard. Because the police force is always at their limits by budgetary issue (underpaid, overworked and not enough staff) he wants to recruit civilians to work together with his officers. This program was named creatively “Citizens on Patrol” to give the cool acronym “COP”. It would also benefit by getting better connections to the public, respect for the work of the police and a mutual understanding. He got the support of the Governor of the state for this. Captain Thaddeus Harris is against this project as he sees it as dangerous for the police and potentially a job killer for even more officers. He is however not successful in stopping the program outright and even worse is put in charge of the project. As expected this is catching the interest of a lot of interesting characters who want to join the program. This is the set up for the movie. Strangely I would side with Captain Harris now as adult. In my youth I only saw him as evil antagonist who uses every opportunity to climb up the ranks like backstabbing Eric Lassard (and it is not false). But here he has a valid argument. If this works it will definitely undermine the police and kill a lot of jobs as the people in charge use every opportunity to cut the budget. Another problem is that these give rise to something like a militia which by itself ends worsening the problem (despotism, discrimination, corruption etc.) There are countless real life examples for militia that failed. Also this makes so many legal problems. I see lawyers taking full advantage for this. Citizens doing thinks like this will destroy evidence or lets say makes evidence unusable in court or violate laws (It will take years to adapt the laws and even then it will end only by Supreme Court ruling even more years later). Back to the movie. Again it is a comedy that use the established formula. We got slapstick, pranks, parody, stereotypes, quirks and word puns. Sadly this is the first time I say it does not work that well I think the good to bad ration is somewhere around 60% to 40%. There are however some memorable scenes that I cherish. While the charming cast is still remarkable it is not that refreshing, original or good anymore compared to the prequels. Some of the characters have not that many rememberable scenes. I want to repeat that I like the actors and characters. Steve Guttenberg, Michael Winslow,  Bubba Smith, Marion Ramsey, David Graf, Art Metrano, Lance Kinsey, G. W. Bailey, George Gaynes and Bobcat Goldthwait to name a few are iconic in their roles for me. They all do a good job but it does not work that well as before in this movie. Overall this is still watchable but did not reach the levels of the prequel. It has its moments but could not win me over completely. It is a decline but not a total failure. Must also say I still prefer this any day over the more modern spoof movies."}, {"rating": "6", "text": "stara ale jara komedia.... bawi,śmieszy, rozluznia... generalnie o to chodziło także polecam."}], "recommendations": ["police_academy_3_back_in_training", "the_founder", "diamonds_are_forever", "richard_jewell", "outbreak", "dallas_buyers_club", "the_post", "the_jackal", "patriots_day", "the_man_with_the_golden_gun", "the_running_man", "hotel_artemis", "brian_banks", "valkyrie", "the_lincoln_lawyer", "nightcrawler", "captain_america_the_winter_soldier", "the_mauritanian", "live_by_night", "blackkklansman", "fracture", "gold", "the_marksman", "enemy_of_the_state", "crimson_tide"]}