{
  "id": 2348,
  "title": "Poltergeist",
  "starring": [
    "Sam Rockwell",
    "Rosemarie DeWitt"
  ],
  "runtime": 93,
  "genre": [
    "Horror"
  ],
  "description": "A family's suburban home is invaded by angry spirits. When the terrifying apparitions escalate their attacks and take the youngest daughter, the family must come together to rescue her.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/A1ymtbzatZp94Z49ZOBb8JGXOBB.jpg",
  "categories": {
    "plot": 4.769230769230769,
    "acting": 4.476190476190476,
    "ending": 5.285714285714286,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 4.923076923076923,
    "funny": 5.0,
    "action": 4.875
  },
  "reviews": [
    {
      "rating": "6",
      "text": "If you're stingy about remakes, stop reading now and stay far away from this movie.\r Okay now that the basics are gone, this was actually a good movie. Good. Not great. It's obviously more inspired by the likes of Insidious than the original Poltergeist, which does make this significantly different than the original. It's certainly not a shot-for-shot remake. The first act is really busy with a lot of scares popping out at you like a haunted house at a carnival, but some of them are very well constructed. After calling the paranormal investigators, it does become significantly more tame. It's never boring, but the scares die down after the 30 minute mark. The scares also get a little more intelligent. There's one scene in particular involving a drill that could rival anything from the original movie. It's a very scary and clever scene that is certainly the most memorable part of the movie. The performances from a majority of the cast are very good, especially Sam Rockwell. What surprised me most was the last 15 minutes. It went a direction I certainly didn't expect, and it ended the movie very well. The biggest problem with this movie is that it is underwhelming for the most part, and the short running time doesn't allow the viewer to really connect to the family. Poltergeist is still a satisfying and worthy remake of the classic; just don't expect to lose any sleep over it."
    },
    {
      "rating": "2",
      "text": "The whole Modernizing of the movie makes it worse. The Teenage girl is very annoying complaining all the time. The CGI was horrible. As-well I'm not sure if this even a horror  movie. The 2 scariest things where this one jump scare and the CGI squirrel. This movie had no rime or reason to be made. Much prefer the original. It gets 1 point for Sam Rockwell, and 1 point for the fact that it looked like the tried."
    },
    {
      "rating": "6",
      "text": "What makes a Poltergeist remake unnecessary is that recently movies like the Conjuring and Insidious gave me some Poltergeist deja vu. In those films a psychic showed up to help a family with supernatural problems and brought a team along to record their findings. Despite both being good films I already felt like I was watching two Poltergeist remakes.\rThe remake is better than they say due to a good cast and decent enough acting. Besides the Conjuring and Insidious it seems like movies about ghosts targeting a family come out 2-3 times a year these days. So there's just nothing fresh this remake could give us that wasn't done in recent movies or especially the classic original.\rThe best thing about the movie is that Sam Rockwell (The Green Mile, Iron Man 2) for some reason is in this as the father. He is believable and makes a good replacement for the original father who was played by Craig T. Nelson. What's missing though is the smart humor of the original. The mom putting a football helmet on the daughter and then putting her on a spot of the kitchen floor that magically pushes objects across the room. Was funny in the original and yes bad parenting. This movie tries too hard to be scary and lacks the originals sense of humor.\rI watched the original last week; the film still works and I can't say updated effects made this remake superior in anyway. Which goes for pretty much every remake these days. While it's hardly Poltergeist without Zelda Rubinstein who was great as the psychic in the original."
    },
    {
      "rating": "4",
      "text": "\"Poltergeist\" 10 Scale Rating: 4.5 (Mediocre) ...\r The Good: At times, the film is a nice ode to the original, repeating some of the scenes from the horror classic without copying them directly.  I thought that Sam Rockwell would be somewhat out of place, but he did a solid job. Jared Harris, as usual, turns in a good performance as television occultist Carrigan Burke, who is brought in to try and save the family's daughter. When they show what the \"other side\" looks like, it is very well done. While there are only a few of these scenes (mostly towards the end), they are hands down the best parts of the movie.\r The Bad: Sadly, for a horror and suspense film, it's not even remotely scary or suspenseful. Films like this are usually chock full of \"jumpy\" scenes, but this one was devoid of even that. It also goes from a somewhat slow build up to full throttle out of the blue which was a little jarring. Unfortunately, this movie is no better than the rest of the lazy horror films that have been released in the last 5-10 years."
    },
    {
      "rating": "0",
      "text": "My review does not contain spoilers, I clicked that by accident. Here it is ---  I have too many problems with this movie. First of all, it was just like the original. I mean, I understand it's a remake, but changing 3 things about it is not enough. You need to change a lot about it, and not make viewers think that they're watching the original. Secondly, the actors just give up on acting. Sam Rockwell tries so hard, but his acting just doesn't work for the film. The wife can't even act, and the kids sound like they're reading the script for the first time. The directing is less than average, and I'm surprised a studio like 20th Century Fox would even supervise this film. Making the same film that came out 20 years ago, just with flat-screens, is not OK. Third, the film just isn't scary. I am always scared during horror films, but the only part I was scared at was the clown scene. Finally, you shouldn't waste your money on this film. You will be as disappointed as me and the other reviewers are. It is a waste of time, and you'll be sleeping more than watching the film."
    },
    {
      "rating": "7",
      "text": "I didn't expect to like this but I really enjoyed it! Great special effects and solid scared. Sam Rockwell was really excellent and the rest of the cast were all good. Apart from the cool CGI the visuals looked really great all round with some nice shot framing and colour grading. The script had a level of self-awareness that was fun and quite amusing but the horror was well done and more intense than your average family friendly film. I don't understand all the negative reviews, I thought this was very well done and really enjoyable."
    },
    {
      "rating": "4",
      "text": "The only problem with this mediocre remake is that it fails to live up to its genre. I found only two good scares throughout the entire film, and both were cheap jump scares.\r Poltergeist refused to waste time. It jumps into the action as soon as reasonably possible. While the scares themselves were okay, very many of them had barely any build-up preceding them and seemed to end before the viewer could get a proper grasp on 'em.\r But besides that, the action was quite good, especially the last sequence. Acting was okay, even for the children. Poltergeist isn't a film that will give me nightmares anytime soon, but it was a decent way to spend a Saturday night. Bottom line: if you've got nothing else to do, Poltergeist 2015 is worth a shot, but if you've got other plans, you may want to pass."
    },
    {
      "rating": "4",
      "text": "Is Poltergeist bad?  Not incredibly, which means it’s not as bad as I thought it was going to be, but I would hardly call it good and it’s fairly obvious when you are watching it that you could save your money and just stay at home and watch the original.  I would refrain from calling it a disastrous re-make, but I would hardly call it a good one!  Everything just feels a lot like you are watching the first film, but with a lot less!  What this film really needed was a better screenplay writer and a better director, because I think there was every possibility that this film could have been better.  As it stands, just see the original, there is really no need to see this one.  The effects are less good, the actors are less good, the plot’s less good, everything is just less good!!   That just shows the futility of this film and fans of the original need not apply."
    },
    {
      "rating": "8",
      "text": "Poltergeist, the remake of the 1982 horror movie by the same name, ingeniously re-invents one of the horror genre's most iconic films in history, and the film does it justice. All of the original feature's elements can be found in the new adaptation, with modern twists and new ways to convey the same scenes in order to still give the audience a fresh, unique experience. The film makes for a great date-night thrill, or a hangout with the friends. My own 'plus one' was wrapped around me like a classic long-arm velcro monkey toy."
    },
    {
      "rating": "10",
      "text": "Good Remake that is close enough to the Original and less close to give some new story details.\rGood actors and a dense Atmosphere. The Original is still a classic but for todays Young People ithe original is too much 80s to enjoy"
    },
    {
      "rating": "6",
      "text": "Well the movie was maybe not scary but one thing is sure.It is a really fun and entertaining movie.Great acting by the main characters and great visuals are what makes the movie this good.Even the kids were not that bad."
    },
    {
      "rating": "5",
      "text": "Sticking almost religiously to the original, this version of ‘Poltergeist’ cuts down the lead-in and updates the visual effects to give you the most bang-for-your buck in terms of frights and therein lies the first problem, there’s just not enough build-up and time spent on the family dynamic before the weirdness starts, one of the strengths of the original, the result of which is that you’re not that emotionally invested in what eventually happens to them.\r Problem number 2 is more serious and goes to the heart of the film, ‘Poltergeist’ is not the worst remake of a classic horror film, in fact it may be the best, but like all the others it’s underwhelming and completely redundant.\r So what’s the purpose?, to get butts in cinema seats of course and we can’t blame 20th Century Fox for that, but we can’t forgive the premium charged for perhaps the most pointless 3D ever which further entrenches our position that, for the most part, 3D remains a gimmick that doesn’t enhance the cinematic experience.\r So what we’re left with is a film that in isolation is a decent suspenseful horror that’s somewhat family friendly and well crafted, but nothing exists in isolation so ‘Poltergeist’ is just another example of how horror remakes don’t work, whether you stay faithful to the original or re-invent the scary wheel.\r The Bottom Line…\rSlick, suspenseful and scary, ‘Poltergeist’ might be worth a cinema trip for those who haven’t seen the original, for those who have there’s really nothing here for you and for everyone, we strongly suggest watching the 1982 original."
    },
    {
      "rating": "6",
      "text": "Most horror movie remakes are downright awful. They usually fail to capture any of the magic of the original or bring any worthwhile new ideas to the table. That isn't so much the case here. It's got a few cool new ideas. but ultimately it's definitely not as good as the original. However rather than being awful what we have is more of a boring affair.\r It's most exciting moments are when it is recreating scenes from the original with it's own twists. These scenes bring back fond memories of the original, but don't really make much of an impression on their own, with the exception of the clown scene.\r Part of what made the original Poltergeist so fantastic was the characters. They were likable, real, and made us care about them. There are some talented actors playing these new interpretations of them, and they do have some real world problems and interactions. The problem is that they feel just like the average modern horror movie protagonists. By that I mean they feel like faceless character types with no depth created for the sole purpose of screaming at scary stuff.\r Considering this is a horror movie, one of the most important aspects I need to touch on when reviewing it is whether or not it is scary. It's not. Creepy specters show their ugly faces and people get grabbed, but there's never a sense of fear or urgency from the film. This might be partly due to the fact that many of us have seen the original. This remake doesn't deviate too far from it so those of us who have seen it already know what's going to happen.\r That being said, I doubt those experiencing Poltergeist for the first time this way are likely to be frightened. It's pretty tame and by the numbers. At least it doesn't rely on jump scares, so there's that.\r Honestly I just recommend watching the original. This remake isn't bad and has a talented cast. Some of the original's humor finds it's way here as well. None of that changes the fact that this is still a pretty boring horror movie that's devoid of any frights. It's not as bad as most horror movie remakes, and honestly it isn't really that bad at all. However none of that changes the fact that there are plenty of more entertaining options out there, as well as the infinitely superior original. If you've already exhausted your other options though, this isn't that bad."
    },
    {
      "rating": "8",
      "text": "It does a good job at remaking the original that scared everyone back in the day, and still 2015...Poltergeist has impressed me. Fleshed out characters, better visuals, storytelling and genuine scares even if your seen the original. Pointless 3D and some disjointed scenes will be the major let downs. Poltergeist is back \"there coming\"."
    },
    {
      "rating": "6",
      "text": "Poltergeist is well - shot but not well - realized as a remake. It is not particularly bad, it is entertaining. However, one of the most enGROSSing sequences is cutout . . . you only had ONE JOB HOLLYWOOD!"
    },
    {
      "rating": "5",
      "text": "ok so i had my doubt's about even seeing this movie from the start but on a slow boring day decided what the hell i will see it and it was definetiley the worst choice in movies i have made so far this year not that scary plane boring in some parts yea the little kid was a doll baby but that's not what i payed 12 bucks for should have went with my first gut choice  and skipped it all together not the worst i have ever seen but definetiley the worst this year' yes i saw mall cop 2 its a oscar winner compaired to this **** ' so i say skip it"
    },
    {
      "rating": "1",
      "text": "After a string of lackluster \"reboots\" of beloved favorite films (Robocop, Nightmare on Elm Street, Carrie, and the rest), I was dubious about this one from the beginning. The original is a contemporary classic that was groundbreaking for its time, and as long as you can ignore Beatrice Straight's gargantuan early '80s eyeglasses, it holds up well even today and never feels overly dated.\r So I had little hope or much anticipation for this prospect. The trailer increased my curiosity level, though, and I allowed myself some excitement at the modernization possibilities, at the very least. Poltergeist with smart-phones, 24-hour TV and (hopefully) well-utilized CGI might possibly have potential, I thought. I was intrigued enough to postpone passing judgment prematurely. As Mickey and Mallory said, \"Well, let's give that key lime pie a day in court.\"\r That said, I was unprepared for just how bad this movie is, on so many levels. Poltergeist (2015) is dull, listless, unimaginative, devoid of style, charmless, pedestrian, slapdash and everything that's truly terrible about run-of-the-mill. From a creative standpoint, decisions were made which inexplicably ignored and/or subverted precise factors which made Poltergeist (1982) such a success. Detailed, authentic characters from the first movie -- a family that inspired audiences to root for and care about them -- are replaced here by a bland bunch of nondescript losers who barely merit attention.\r Similarly, the spirit and sensibility of the original film has no echo here; tonally, this narrative is by-the-numbers, managing to somehow feel both too rushed and yawn-inducing simultaneously. Moreover, the evocative richness of the '82 version -- the house, the neighborhood, the entire milieu -- is now just a standard fare. The house is flat and featureless; the suburb itself feels neither sinister nor supernatural. In fact, nothing much in this movie feels like anything at all.\r It's hard to fathom why such crucial elements have been handled so clumsily and, more to the point, why this \"reboot\" was realized with complete disregard for the very elements which made 1982's Poltergeist so enduringly iconic."
    },
    {
      "rating": "8",
      "text": "This actually impressed me quite a bit. Going in, I thought that I was getting an almost shot-for-shot remake with a few modern touches (like a flat screen TV), but what I got was a modern re-imagining of a classic that only kept the basic plot. There were some really cool effects, like the world of the undead. Watching the movie,  I didn't find any technical errors, but there were probably plenty looking back. The issue to me was that what I thought would be the scariest sequences actually made me laugh, but they were still a good time. So if you are a fan of the original or the horror genre, this is a must."
    },
    {
      "rating": "7",
      "text": "I recommend this film not for Horror fans simply because it's not particularly frightening but follows the tried and true jump scare formula which works well and thankfully they don't overuse it.\r What I enjoyed most about this flick was the dialogue. There was a very natural flow between the parents and the children. It all felt very genuine not at all cliche in the sense of \"What was that, you're crazy, save my family! we have to defeat the demon!\" The only time the film gets weird in the delivery was once the focus shifted outside of the family but not to worry it only lasts a few minutes and doesn't kill the experience.\r Adorable children, appalling teenager and parents reacting accordingly with a supernatural offender(s) bringing them all together.\r As far as comparing the original to this version I won't even bother. It's a modern take on an old story with a tweak here and there."
    },
    {
      "rating": "5",
      "text": "It's one of the better recent horror remakes but that isn't saying much. However, as a standalone B-horror midnight popcorn creepfest, Poltergeist can provide more than a modicum of entertainment."
    },
    {
      "rating": "5",
      "text": "I went into this movie not having seen the original, so I'm not sure how this movie compares to it. But here's my opinion:\r The entire cast is pretty bland. The actors did a decent job (especially the kids) but because of the lack of character development, which was desperately needed, I had no emotional attachment to the any of the characters. The plot was also a bit lacking; very little was explained and the ending was SOOOO lame that the movie left a bitter taste in my mouth.\r So if the character development and plot are lacking then the movie should certainly make up for it through its special effects and scariness right? Well the former is actually the highlight of the movie but the latter is actually my least favorite thing about the movie. I'll go ahead and say it. This movie is not scary in any sense. Their are a handful of jump-scares, but they barely even made me flinch. I was practically BEGGING the movie to scare me around half way through, and I ended up being disappointed. The trailer is scarier than the movie. The poster that you've probably seen in movie theaters with the clown doll on it is scarier than the movie. The dark parking lot that I had to walk through to get back to my car after watching the movie was - you guessed it - scarier than the movie.\r Is this movie bad? No. It kept my interest through its entirety because of its special effects and cool set pieces. But I expect a horror movie to keep me on the edge of my seat for the whole movie. I was never on the edge of my seat in this movie.\r Bottom line:\rIf you want to go to this movie for the scares (like I did)  - STAY AWAY.\rIf a haunted house movie with cool special effects sounds appealing to you - See it.\rIf you're on the fence, I would definitely say pass.\r If you're considering watching this in 3D, DON'T. I have tried for years to convince myself that 3D could actually add depth to movies (no pun intended), but this movie reinforces my belief that 3D is just a gimmick to milk more money out of movie-goers like myself."
    },
    {
      "rating": "0",
      "text": "Honestly would have been better as a comedy and it was so meh that it was more scary when the ads started blablablablabla I'm filling space. Yoloyoloyolo hipsters bad child actors I like Pepsi yum yum budget 99cents I'm going to vomit now"
    },
    {
      "rating": "3",
      "text": "The 2015 Reboot of Poltergeist is a great example of why some movies are better to be left alone. Especially when it’s a great one, such as the 1982 original horror classic, Poltergeist directed by Tobe Hooper (Texas Chainsaw Massacre) and produced by the iconic Steven Spielberg (Jurassic Park, Jaws, Indian Jones).\r The original film had great characters, great filmmaking, and most importantly great scares. Pretty much all the things the things that this reboot did not have.\r Now, the first part of this film is the introduction of the Bowen family.  Once they set the stage for the family, we quickly learned how the father, played by actor Sam Rockwell (The Way Way Back, Moon, Iron Man 2) was laid off from his old job, forcing the family to move to a new house. As the film develops we learned how both parents are unemployed and struggling financially. We have the mom played by actress Rosemarie Dewitt (Your Sister’s Sister, Promised Land) who is a frustrated writer and then we have her three kids. The oldest is Kendra Bowen played by Saxon Sharbino (Touch, Julia X) who plays the cliché rebellious daughter, the second character Griffin Bowen, is played by Kyle Catlett (The Following) who is the middle child that no one believes, and is always scared, and then we have the youngest, Madison Bowen played by Kennedi Clements (Jingle all the Way 2) who talks to her imaginary friend and eventually gets abducted by the evil ghosts.  The acting in this film was one of the worst things of the entire film. I would even go as far as to say that Saxon Sharbino was one of the most annoying characters of the entire year. Every line that came out of her mouth, made me want to leave the theater. Then, we have Kennedi Clements who plays the little girl who gets abducted. She came across as annoying and unpleasant. This was definitely one character that was better in the original. Heather O’Rourke played the original character and she was also one of the best parts of the original film that gave the audience a charming performance.\r Aside from the characters, let’s talk about the movie as a whole. This is a film that should’ve never gotten a reboot and what they did here just did not work. Director Gil Kenan (City of Ember, Monster House) tried to make the same film that Steven Spielberg and Tobe Hooper made in 1982, but instead he made a movie that was unable to scare or connect with the audience.  The script for this film had countless problems and moments of me rolling my eyes due to how stupid it made everyone sound.  Then, we have multiple iconic scenes that were so well done and that scared audiences in the original that this time around, simply lacked emotion, horror, and consisted of too much CGI.\r In conclusion this brand new take on Poltergeist simply did not do anything for me. This was a movie that had me checking my watch over and over and wanting the film to be over. In my eyes the original Poltergeist is the only Poltergeist. This is simply a forgettable flick and with that said, this is one of the worst movies so far, of the year.\r Final Score: 3.1/10"
    },
    {
      "rating": "3",
      "text": "The remake to the classic horror film continues recent trends of remakes in that is hard to match or even come close to the originals. With poor performances and scenes the \"the horror film\" is a disastrous attempt to replicate the raw of the classic film."
    },
    {
      "rating": "2",
      "text": "Poltergeist (2015)Remake del clásico de horror homónimo de 1982.No me gustó, entretenida a medias, uno que otro momento interesante, pero se siente muy poco entusiasta, sin alma, sin sentido del humor y personajes que dan pereza de solo verlos, sin duda es el segundo peor remake que he visto siendo superado por el de La Profecía del año 2006, fatal y lo que le sigue.1.5 ⭐ de 5 ⭐"
    },
    {
      "rating": "1",
      "text": "This is the remake of the 1982 horror classic directed by Tobe Hooper. However this family aren't the Freeling family in the original or even share the same names which is amusing since it's based on the original and don't give me some crap story saying it isn't because we all know that's nonsense otherwise why name it Poltergeist? This remake made in 2015 stars Sam Rockwell, hold on one moment, Sam Rockwell is a terrible actor infact one of the worst I've seen as an actor, that's like having Daniel Craig in Poltergeist but he's a bit better but still not great.  Stupid actors and actresses and a family called the Bowens instead of the Freelings lol. What kind of remake is this plus the girl who's meant to be Carol Ann is actually some girl named Madison with brown hair instead of blonde lol. There's this stupid scene in Poltergeist involving some drill or something and this remake was awful. Watch the original instead."
    },
    {
      "rating": "5",
      "text": "This is not a bad film, it is just totally superfluous. The Hole (2009) did the exact same story but much better. Far less memorable than the original albeit better visual effects. The last half-hour is good although not enough to drag this above mediocracy. The only thing I didn’t like apart from the drab atheistic for the real world is the casting of the father in the family. The action and occasional horror was pretty cool."
    },
    {
      "rating": "6",
      "text": "The basics are the same as the original: a happy family moves into a new house where the youngest is held captive by angry spirits. This time, the uncanny occurrences are ramped up, aided by computer generated effects and heavy-handed music. The family's plight is compelling (thanks to warm performances from Sam Rockwell, Rosemarie DeWitt and the kids) and there are lots of creepy surprises. There are even a few minor scares, even though the ending is more a noisy spectacle than a fright. It's not genuinely scary, but sometimes slightly suspenseful and mildly entertaining."
    },
    {
      "rating": "4",
      "text": "The most pressing question that you ask yourself while watching Poltergeist is simply \"why?\". It seems redundant to remake a film in such a pedestrian manner when the original was just so...well, original! The cast do their best but they are fighting a losing battle, and the effects seem decidedly low rent"
    },
    {
      "rating": "4",
      "text": "The original is one of my favorite film of all time, and I was looking forward to this reboot for quite a while...can they bring something new to the table? The answer is no. It's a remake that makes Poltergeist a pedestrian film. Every changes that they made were for the worst, and sure there were jump scares, but there aren't any in the scale of the original. It's hard to eclipse film makers at the height of their powers, namely Spielberg and Hooper, even more than 3 decades ago...a pointless remake in the end."
    },
    {
      "rating": "2",
      "text": "What is going on?!!! Sam Raimi & Rob Tapert knows everyone loves Evil Dead, the classics with Bruce Campbell not the ultra-crud remake, so why do they produce dross like this knowing full well it is not what we want. Don't bother with this movie, that is the only way to send the message...and remember, YOU are making history!\r All poltergeists are belong to us!"
    },
    {
      "rating": "5",
      "text": "Poltergeist is not a very scary film and yet at times it is filmed well in making a scene tense. But when you have cheap thrills, mediocre effects and  below average acting, the result isn't very good."
    },
    {
      "rating": "4",
      "text": "Weak, predictable and emotionless and moreover not even scare, this 1982 remake of the classic was far below what I really expected, poor Spielberg tried to repeat the formula of success and failed miserably."
    },
    {
      "rating": "6",
      "text": "I honestly don't get all the gripe this movie got. Don't get me wrong, I still think the original was better (for its time) but I also feel the modern take was almost as good and that its only real problem is that it is a remake. If the original didn't exist, this movie would have been received better.\r Not saying its perfect either. For a horror movie, it isn't really scary. A few jump scares here and there, but that'sit.\r Overall:\rPoltergeist is entertaining and fun to watch, but does have bit of a slow build up. Great characters though."
    },
    {
      "rating": "5",
      "text": "Would have been a better film if it was an original.\r Unnecessary to compare this with the original and I tried, but impossible to avoid it since it's an official remake. Everything, from the house to frame by frame, all the scenes looked the same, except the cast and it's set in the present world with the daily life's modern gadgets. If you had not seen the 80s film, then there's a little chance you might like it. Though it was not a serious horror movie, or a scary movie to consider, still quite enjoyable like a dark comedy in parts. But I recommend the old one.\r Really? Sam Rockwell? He did not fit in the role, just okay though. And the kids, did not impress me as like the original movie. The only upgrade in this new version was the technology, CRT monitors to LED kind of stuffs. I expected a major, at least a bit alteration in the story or the screenplay that sets in a different circumstances and the location. That could have been a lot better. Disappoints for those who loved the first version. However, that movie deserved to be remade, and I did not think it would end like this. Hoping for a better sequel, but I'm already feeling that would end in the hands of the second string cast and crew which could be a cheap horror-thrill.\r 5/10"
    },
    {
      "rating": "5",
      "text": "I'm not against remakes, but when you make the exact same movie again without anything new then why waste the time and money.  I give you Poltergeist. C"
    },
    {
      "rating": "4",
      "text": "Oh what a difference 30 years makes. The Poltergeist remake is almost 25 minutes shorter than the original, as though todays audiences didn't have the attention spans to get some character development before the jump scares and special effects kick in. Sam Rockwell and Rosemarie DeWitt are excellent actors, but they're given slivers of character to work with in sacrifice of the next plot point that has to be rushed to. LIke the recent remakes of Carrie or Robocop, they're not bad movies, just absolutely unnecessary."
    },
    {
      "rating": "5",
      "text": "Some interesting effects but other than that it really fails to live up to the original. Fans of the first one should watch this as well though, for the amusement alone."
    },
    {
      "rating": "9",
      "text": "This new poltergeist is effective... decent remake of the 80's version, is not as good as the original but still is frightening, creepy and certainly atmospheric. Better than i expected... very good performances specially Sam Rockwell as Erick and Jared Harris as Carrigan. The film have some bugs like the Terrible effects \"VFX\" , but still very well .. very entertaining. Out of the aspects we already knew in the 80's version shows us a new vision of one new state .. what is here what is not here. Very creepy and especially the clown attack scene..... really enjoy it."
    },
    {
      "rating": "6",
      "text": "I a being very generous with a rating of six out of ten for several good reasons, my review is broken into good aspects and bad aspects.\r Good:\r1. This remake is pretty darn close to the original film from 1982. Many modern remakes these days significantly deviate from the original. Poltergeist is different. they kept the story the same, the family the same, the names the characters the same, and even some references from the original film. I give them credit for not changing it too much.\r2. practical effects: although there defiantly some CGI effects throughout the movie, a lot of the effects were performed old school, by means of practical effects (effects not created through the use of computers or software of any kind).\r Bad:\r1. Acting: Usually acting does not bother me as much if the story is captivating. But in this case I believe they tried too hard to stump the original. The acting was subpar, with the only good acting performed by the father who is played by Sam Rockwell. The rest are pretty mediocre.\r 2. Remaking a classic: I know I said earlier that I give them credit for trying to remake this movie, but I would have given them even more credit if they came up with a new original idea. I would have rather them have made a new sequel.\r 3. Modernization: I maybe would have given these title a 7/10 if they did not modernize everything. If they kept in in the same time period as the original one from 1982. that would have made the film a bit more interesting at least.\r Overall this remake of the 1982 horror classic is subpar, 6/10 being a very very generous rating on my part. In general if you like these kind of movies go ahead and watch it, I have no guarantee you will like it though."
    },
    {
      "rating": "8",
      "text": "Man, people are picky.While not quite as, erm, \"special\" as the original film - and while I'm tempted to agree with people accusing this remake of being somewhat \"unnecessary\" (like most remakes, let's face it!) - it's a quality horror film in its own right, and especially notable for some exceptional performances and intelligently-written dialogue. Sure, it all degenerates into a flashy lightshow by its final fifth, but the journey is one that's well worth it for fans of spooky movies.Oh, and whatever you do, try to see the Extended Cut over the Theatrical one, as the former fills in some much-needed context that was apparently too long-winded for today's ADHD-riddled audiences."
    },
    {
      "rating": "4",
      "text": "Poltergeist settles to be a by-the-numbers horror flick when it could have been so much more; the above average first two acts are followed by blown out action in the end which isn't scary or the slightest bit creepy."
    },
    {
      "rating": "7",
      "text": "Although the film does not scare at all and is rather funny and not so dark like the original movie from 1982 it is still quite a good movie. Good visual effects, great cast and looking good photos."
    },
    {
      "rating": "3",
      "text": "The cast is good, the girl is a cute, the boy is ok, daddy and mom are perfect and everybody is wasted on this movie. This movie is a big lesson for all movie makers: don't remake classics again!"
    },
    {
      "rating": "7",
      "text": "If there's one thing this film remade is the story, we do not have a background of the characters like why did they move there or why they lost their jobs the script has zero explanation. This remake uses way to much cgi, it did empress me and it's unique but what made the original fun is it's cheesy old-fashioned 80's special effects I think if this remake could make it similar. Director Gil Kenan's direction is just slick if his visuals were close to Hooper's vision could made it work. Since Sam Raimi produced the film, I thought this movie was going to be gruesome but the movie is bland and if this was \"bloodier\" then it might of been fun to watch.The acting was good, the cgi was impressive but watch the original series. Positives: the film is scary and it's entertaining, the film was watch able it tries to be a cheesy B+ movie like in the original, but if you have good screenwriters and a proper director this might have been good. Let's talk about the closet what makes that scene good is it is mysterious and does show that under world in this modern remake it does show the world in a good way. The actress Kennedi Clements was good, but she was not good like Heather O'rourke. The characters names are changed? Really. The film was scary it made me laugh it made me entertained through out it was exciting. Grade C+"
    },
    {
      "rating": "3",
      "text": "Just a bunch of predictable jump-scares i wasnt expecting much but even so i still was disappointed\rThe only way for this movie to get a 510 is in a scale where 1010 is salting your wounds"
    },
    {
      "rating": "3",
      "text": "I'm scared. Just a bit. Then, I realized watching marathon of walkthrough video games on Youtube is scarier than this one single remake movie. I adore the creepiness of this movie but it's not scary. I think the screenplay was trying to be like Insidious, that makes me feel common thing this day. Well, I appreciate they're not doing any sanatic. I enjoyed the movie to the end."
    },
    {
      "rating": "3",
      "text": "Poltergeist is a remake of the 1982 film of the same name. I didn't have high hopes for this film from the beginning because Steven Spielberg is not involved after having a significant impact on the first film. I don't think anyone was asking for this movie because even the original film has grown old and doesn't seem as relevant as other horror films that are considered \"classic\". The 2015 version relies too much on the original and does not try to create its own legacy. Many scenes in the film are almost exactly the same. There are several cheap jump scares but none that make the film memorable. Sam Rockwell's performance was way to good for the film and this remake is not doing the original any favors."
    },
    {
      "rating": "4",
      "text": "Dont see this movie, watch the original. Its farcical, the effects are laughable, unless of course you like cheap looking 3D zombie effects and children being rag dolled all over the place. Filled with jump scares, this move was as far from the horror Genre you can get without getting into Rod Stewards dressing room. One particular scene with the shadows was creepy, and may have saved the film from a negative review from me, but overall, it was a major disappointment, dont waste your money."
    },
    {
      "rating": "5",
      "text": "I'm not sure why they found it necessary to remake this classic award winning horror film. I mean, I will admit this remake has its spooky, creepy and scary moments and the kids are quite good (I especially liked Kyle Catlett in the role of Griffin). Unfortunately, about two thirds of the way through, this film just veers off into the world of modern horror films and becomes nothing more than a mimic of the \"Insidious\" franchise, just to name a few."
    }
  ],
  "recommendations": [
    "the_amityville_horror",
    "sinister_2",
    "insidious_chapter_2",
    "the_omen",
    "the_thing",
    "the_grudge_2",
    "the_texas_chainsaw_massacre",
    "annabelle",
    "the_wolfman",
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "the_curse_of_la_llorona",
    "halloween_iii_season_of_the_witch",
    "insidious_chapter_3",
    "the_last_house_on_the_left",
    "the_possession",
    "the_grudge",
    "book_of_shadows_blair_witch_2",
    "insidious_the_last_key",
    "blair_witch",
    "the_eye",
    "scream_4",
    "the_conjuring_the_devil_made_me_do_it",
    "insidious",
    "ouija_origin_of_evil",
    "malignant"
  ]
}