{
  "id": 4089,
  "title": "Pompeii",
  "starring": [
    "Kit Harington",
    "Emily Browning"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Adventure",
    "History",
    "Romance",
    "Drama"
  ],
  "description": "In 79 A.D., Milo, a slave turned gladiator, finds himself in a race against time to save his true love Cassia, the beautiful daughter of a wealthy merchant who has been unwillingly betrothed to a corrupt Roman Senator. As Mount Vesuvius erupts in a torrent of blazing lava, Milo must fight his way out of the arena in order to save his beloved as the once magnificent Pompeii crumbles around him.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dxxM3lLDjGRC50i5rhvfQziskAN.jpg",
  "categories": {
    "plot": 3.935064935064935,
    "acting": 3.3333333333333335,
    "ending": 4.090909090909091,
    "soundtrack": 5.0,
    "cinematography": 6.2,
    "familyFriendly": 4.857142857142857,
    "funny": 3.75,
    "action": 3.5
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Pompeii may contain infamous love clichés amidst the ongoing destruction from Vesuvius, yet it still houses numerous thrilling scenes. Aside from the rushed “Titanic” romance plot to accompany the bland and “purely historical” event, the movie is able to to demonstrate enough of the qualities needed to fit into the “disaster” genre. From enticing gladiator battle scenes to the detailed factual layout of the ancient city, it's hard to view the film from a purely negative standpoint. “Oh, Pompeii? The blasts of the ominous volcano disrupt the action of the movie and drown out the dialogue.” What?! You payed to see an action movie, an I can't even recall a conversation during one of the few mini-quakes. I'm pretty sure that a volcanic eruption revolves around explosions of pyroclastic material and ensuing tsunamis. Nonetheless, the anticipated eruption met my expectations after waiting for the first hour through terse lines, droll humor, and one-dimensional characters. Bringing back the aforementioned, at least Anderson made an an attempt to bring in some sort of script to accompany the hundreds of deaths from fiery meteors in a short thirty minute animated film. In the end, what historically resulted, intertwined with an average storyline, was achieved and that is all that matters. If you want a mere documentary, then this movie is not for you."
    },
    {
      "rating": "9",
      "text": "I just returned from the cinema and I have to say that this movie is just amazing. The effects and the storyline are also really good. I don't really understand why people gave it such a bad score. LOL"
    },
    {
      "rating": "7",
      "text": "This film was way better than I expected it to be. Obviously it isn't going to win any Oscars but it was an entertaining disaster movie with some great effects."
    },
    {
      "rating": "1",
      "text": "A movie that cast B-class actors, that revolves around a C-class story, has D-class cgi. Overall an E-class movie. There's no air about the main character, he doesn't look prominent (I get it he's a slave).. you know when you look at him he's no star as he look kinda generic. Sorry Kit. Sasha Roiz plays Proculus, a high ranking officer but I can't take him seriously cos he looks so much like comedian Ryan Stiles =/\r Next, that token Black character (Atticus) is so unnecessary and it's very cheesy to watch how the director wants to force screen time on how Atticus is righteous and brave, saving the citizens, being strong blablabla, the brotherhood (or gayness whatever) between Black and White characters omg... WE GET IT, OK?\r And the final 'epic' scenes where the city around them collapses.. The cgi.... what the f is this? The chambermaid falling into the void...The chariot chase in the burning ruins, they're sooo FAKE!!!! lol. It's laughable! It really is.\r Guys, this is a terrible movie, A terrible terrible movie!! +1 for the effort. -9 because of the epic fail."
    },
    {
      "rating": "7",
      "text": "It was an all right movie for me, presumably because I had no expectations towards it at all. I've used to be a reenactor of Celts living in the Carpathians, so my eyebrows run up a few times during the movie ( Celtic horse tribe? Seriously? Not even chariots, just plain cavalry? Sound VERY unlikely), but about just as many times I was pleased with the historical details, I didn't pay for a documentary, did I?\r Acting was all right, not very complex, but the story wasn't overcomplicated ether. It was refreshing to see some new, or not so widely known actors.\r I'm no fan of 3D, planned to watch it without, but ended up with it and actually this time I liked it. It wasn't as disturbing as usual, in some cases, I even liked it. (mind the eruption of a volcano)\r Not a must seen movie, but a safe way to spend your free time with something that you will enjoy"
    },
    {
      "rating": "6",
      "text": "Pompeii has moments were I see greatness in how the movie was filmed and times were it becomes a little embarrassing. As a whole the director seem to try and make a movie that was action packed, suspenseful and incorporate a love story that would all come together but in the end came up a little short."
    },
    {
      "rating": "2",
      "text": "The movie is dreadful. The story is about as interesting as a rock. The destruction is the only thing to look forward to and even that was terrible. The effects were annoyingly all digital."
    },
    {
      "rating": "6",
      "text": "Pompeii is the type of epic disaster movie with a story-line centered on the brief and wholly unrealistic love story of a couple who just barely meets, a type of movie that is typically expected of directer Roland Emmerich (Independence Day, 2012, The Day After Tomorrow, Godzilla). Instead, surprisingly, Pompeii is directed by Resident Evil chief Paul W.S Anderson who visits the ancient Roman town-city with all the expected cliches of the disaster movie format that have become all too predictable. Thankfully, Emmerich hasn’t been able to deliver in a genre that he practically moulded as of recently, and Anderson gives audiences a fine, entertaining specimen of blockbuster proportions, with no shortage of historical inaccuracy.\r The beauty about the legacy of the ancient Roman city, for Anderson at least, is that there has yet to be any sort of blockbuster feature film centered on it. Pompeii, a small port city which is located not too far from the base of Mount Vesuvius, experienced an eruption in or around 79 AD. The catastrophic eruption destroyed the city of Pompeii, as well as the surrounding cities including Herculaneum. However, unlike it’s cinematic interpretation, most of the people who died from the eruption did not suffer from flying lava bullets, tidal waves due to shifts in the Earth’s crust, or large holes in the street; rather, they died from extreme heat and suffocation as a result of the ash clouds. But we all know no one wants to see a movie where people just drop to the street and die. That’s what happened in The Happening, and no one wants to see that again, even if it is set against the amazing city of Pompeii.\r The truth remains, Pompeii is a large scale, slave-centered, disaster epic with hints of Gladiator and 300 all rolled into an ‘end of the world’ narrative. For the most part, the film is a satisfying display of Hollywood’s fascination with artificially sweetening historical events, making them grandiose and affecting. Like any good looming disaster, there is always hope for love, redemption and justice, which is exactly what Pompeii sets out to achieve.\r Thanks to the success of 300 and audiences’ obsession with **** male bodies, no film set anytime in the ancient period, can have an actor show up on screen without a picture perfect set of washboard abs–an ingenious way to bring young and old female fare to the theatres. You gotta love multi-million dollar Hollywood marketing strategies. This time, the lucky stud to completely transform his body (if only temporarily) is Game of Thrones actor Kit Harington.\r The film follows the constantly oiled up and über muscular gladiator Milo (Harington). Milo is happily born and raised in a small village belonging to the Celtic Horsemen Creed until one cold night when Corvus (Kiefer Sutherland), a senator under Titus and his Roman regime, comes and rips away everything Milo had come to know including his family, simply for the lust of land and rule. Lost and left for dead, Milo is thrust into slavery and raised among gladiators. Along with a vow to take revenge on Corvus, he grows up to be a lean, mean, gladiator-ific fighting machine. Almost two decades later, Milo’s amazing skills are noticed by a Pompeii aristocrat and gladiator recruit Graecus (Joe Pingue) and Milo is sent to Pompeii, where he meets and falls in love with the princess of the land, Cassia (Emily Browning). Unbeknownst to the inhabitants of Pompeii, something disastrous is brewing high inside the mountain leering down on them, ready to deliver a fate that quickly becomes a highly spectacle yet doomed story of honour, family, and love.\r I am sure that there were many reasons why Anderson took on this project, especially since he is infamous for forcefully introducing 3D into his productions. His constant need for including the over-used movie gimmick is more than enough reason to revive pretty much anything, like Spider-Man for example. But, for the first time in a film made just for 3D, Pompeii surprisingly uses the fancy tool to it’s advantage and at times becomes almost unnoticeable, which is something that I haven’t really experienced during a film, especially one I wasn’t anticipating much from.\r Although the film’s exterior focuses on Mt. Vesuvius and the destruction it is patiently planning, the heart and soul of the film seems to be centered on Harington and co-star Adewale Akinnuoye-Agbaje. Never have I seen a film where the two leads bond so much over the discussion of how they plan to kill one another. Sworn to be enemies and destined to fight to the death, the two men also happen to share the same cell, which kind of takes away from the imminent threat of death. But just like anything mass produced and destined for redemption, the two begin a friendship that sees them saving each other’s lives countless time; defying Rome and Corvus as well as giving one another a chance at retribution. The scenes between Harington and Agbaje are easily the best."
    },
    {
      "rating": "4",
      "text": "Anderson's film does a decent job in making ancient Pompeii come to life. You get a sense of what differentiates Romans from the citizens of Pompeii, the geography and culture of the place, and the production values seem solid enough for what was probably a mid-to-lower end of high-budget film. However, the visual effects, which only become more important as the film progresses, vary in quality. Director Paul W.S. Anderson and his writers borrow heavily from Best Picture winners Titanic and Gladiator for their decidedly not-Oscar-worthy disaster epic Pompeii. But if you just want to see mother nature lose her s**t then Pompeii has enough to satiate your craving for molten mayhem."
    },
    {
      "rating": "5",
      "text": "The film is not that bad, but it isn't good either. Kiefer Sutherland’s  fake accent made me laugh every single time. Solid acting, but unfortunately I expected more from this movie. There are a few scenes that were so good and so cool, but again, not the best movie. Certainly could have been done better."
    },
    {
      "rating": "0",
      "text": "It is not a disaster movie, this movie is a disaster. The plot is as bad as any soap opera, it is full of anachronism and impossibilities. The bad guy is simplistically bad and the good guys almost saints. To make such a boring movie with a theme so good requires a mediocrity talent of epic level. One good note tough for the the special effects which are very nice, there is no other good things to say about this pathetic film. At least I didn't have to pay to watch it a friend of mine rented it and we laughed from beginning to end... it is a good comedy."
    },
    {
      "rating": "3",
      "text": "A pure American blockbuster. If you are going to see this to live again the history of Pompeii I disadvice it to you. If you want to release yourself, while thinking of nothing, well you might enjoy it.There is all that it is necessary to do a crap. An overduse of the decorations made on computer and the special effects, so much that one wonders whether it is not a cartoon. A mushy moral : there are stereotyped characters who are goods and the others which are the malicious ones. Plus, an insipid little love story. (The feelings from nowadays in a antique movie). Dialogues of a masterly poverty and far too much violence, probably to compencer the lack of scenario."
    },
    {
      "rating": "5",
      "text": "The love story is cheesy, the dialogue is predictable, the middle is boring, the politics are uninteresting and there is action overkill but overall, Pompeii is still very entertaining and all that amounts to one guilty pleasure."
    },
    {
      "rating": "7",
      "text": "I don't really get all the harsh reviews on this movie. Okay, so Keifer Sutherland's English accent is laughable (he clearly only studied Jeremy Irons) and our beloved Jon Snow seemed to be just playing Jon Snow but in Pompeii... and the death scenes were terrible... and the dialogue was... okay okay okay - yes it's bad in places, but in a way it's not bad either.\r The effects are pretty awesome (despite what anyone says) and this is ultimately what I wanted to see from Pompeii. I wanted to see epic visuals on what it was like and that's what I got. Yeah, there's a crappy story running in the background, but I can live with that.\r Glad I saw it - probably won't watch it again, but still enjoyed it."
    },
    {
      "rating": "3",
      "text": "It wants to be Gladiator + Titanic, but ends up being an empty ripoff of both. The protagonist is a horseman who gets enslaved after his tribe is massacred...and that's it. This being a disaster, people die one by one in exactly the order you expect, with trite, meaningless last lines. The effects look computer generated even in 3D. Historical accuracy is optional.\r The film's high points are eye candy (Kit Harrington or Emily Browning, whichever floats your boat) and the occasional moment where you do get a glimpse of the city itself.\r The low points are a meaningless romance, ludicrously contrived plotting, and dreadful casting. There are a lot of well-known character actors who have no business playing ancient Romans. The film's ending brought unintended laughter to my screening. Just stick to watching Game of Thrones."
    },
    {
      "rating": "3",
      "text": "It squanders the potential of its cast and relatively fresh visual for cheap imitation of Titanic's plot. The story of Pompeii is about the titular doomed city which was erased by a disastrous volcanic eruption, somehow this translated into a pauper boy and noble lady forbidden love plot with average gladiatorial bouts. Trying to utilize many popular elements and mix it with thin script, the movie only succeeds in making the inevitable destruction more enjoyable because its story is so shallow, mindless fiery doom is counted as a release.\r Pompeii actually has good assembly, such as Kit Harington (Jon Snow), Emily Browning (Elder sister from A Series of Unfortunate Events), Carrie Anne Moss and Keifer Sutherland. In a poor choice of decision, the movie gives them a vanilla script instead of more profound content. The main offender is how blatantly mediocre its love story is, anyone who ever laid eyes on any soap opera would immediately realize the two main characters would fall in love within two awkward eye contacts, might as well make them bump each other while carrying stacks of paper.\r The two lovebirds act in tedious manner, the actors are capable of so much more, but here they almost seem as if they’re phoning their lines. It goes on to incredibly familiar territory of a longing, passionate romance barred by social prejudice and angry tyrant, which is played by Kiefer Sutherland, who oddly delivers his painful fake accent. He sounds very uncomfortable, not to mention doesn't exude any menacing threats. If any, his character in 24 was more intense as a angry protagonist than this half-hearted excuse of a villain. His Roman battalion could've been random extras from Spartacus.\r Gladiator subplot is also present, but don't expected weighty aspect of slavery or social difference. Pompeii has very simplistic ideas about sword-swinging slave versus vilified Romans. It almost creates some decent backstory in Atticus character, but the love triangle plot proves to be more important. Action is rather lackluster, another wasted opportunity considering its big budget. Fights tend to be similar to others periodic movies or TV shows. It doesn't offer tricky choreography or smooth transition, the combat is merely there, unimpressively.\r Lazy story aside, the movie redemption lies in its CGI destruction. While throwing a bunch of money in this department bears fruit, the effects are not different much from what disaster movies have done in recent decade. This unfortunately doesn't overcome its uninspiring script, the lack of vigor as actors try their hardest to look interested and any cliché convenient screenplay, so old they may have been written before the actual event of the movie. Pompeii is a disaster by any means."
    },
    {
      "rating": "9",
      "text": "It seems to me that both critics and audiences have got their knives out for the sword and sandal pictures of 2014, and unfairly in my opinion. I get that it's not deep and meaningful and that the characters are taken from stock. I also comprehend that the script is serviceable rather than inspired. However, this is a film about spectacle (and i'm not talking about the tacky disaster films  thrown up every so often) and in this department it delivers in spades.\rIt has pace in abundance and is imaginatively directed employing a variety of camera shots, along with adequate 3D, to impressive effect. The back story is fine and it builds quite nicely to the main event, the eruption of Vesuvius, which is really what we have come to see. The destruction of Pompeii is spectacularly realised with some absolutely stunning CGI which are possibly the best of the year so far (give or take the odd wobble). In fact before all this drama begins there is also much nail biting tension to be had in the coliseum as the gladiators fight it out for survival. This may all seem very familiar but this second half just never lets the pace slip. Fast and furious editing ratchets up the tension and the film, aided by a beautiful and rousing score, holds you in a vice like grip. No excess padding or accusations of over length can be made here. The film is just nail bitingly edge of seat stuff.\rMy only minor quibble is that visually it lacks colour (as did Legend of Hercules) in its costumes, sets and photography, even though in all these departments excellence is otherwise demonstrated. The city is credibly reconstructed and the lighting is often extremely effective. Also much fun is to be had watching Kiefer Sutherland enjoying himself hamming it up outrageously whilst talking in a most bizarre manner. This definitely has to be a candidate for the most under rated film of the year."
    },
    {
      "rating": "0",
      "text": "Wow, this is just as bad as Legend of Hercules, I mean wow is this bad, the dialogue is laughably bad, the CGI is horrible, the acting is terrible, just don't watch it, it is not worth it."
    },
    {
      "rating": "10",
      "text": "i am giving this movie a 10 because i feel it deserves a higher score. after reading a few reviews i felt like i shouldn't bother watching this but it was fairly good with amazing cgi and good acting. I may have been forced to like it because of kit harrington but even non game of thrones fans should admit he didnt do a bad job. i would recommend this to people who are interested by history and to people who enjoy watching mass destruction. id defnitley say the story wasnt the best but not terrible."
    },
    {
      "rating": "3",
      "text": "This is basically a hackneyed gladiator movie with a volcano at the end. Kit Harington plays a slave who fights his way into Pompeii's big arena, but not before he falls for the daughter of a prominent local merchant. Meanwhile, Kiefer Sutherland makes an embarrassingly out-of-place villainous Roman senator. The writing and plot are as preposterous as they sound, so it's up to the big blowout to save the day (or ruin it for the citizens). While it's always fun to watch destruction on a grand scale, this eruption is a yawn. Surprisingly, Paul W.S. Anderson, who has given us the beautifully designed and elegantly violent Resident Evil series, has fallen flat this time. Interesting note: Julian Fellowes (creator of \"Downton Abbey\") is credited as one of 4 screenwriters."
    },
    {
      "rating": "9",
      "text": "With entertaining arena battles, likable characters, despicable villains, and the ever looming threat of the destruction on Pompeii, the film remains an absolute blast even before the apocalypse-like destruction starts. The only thing that falls short here is the romance, which feels forced. The leads lack chemistry and the whole romance is just unbelievable. I get that the story of this movie had to make concessions with the amount of time it would take to build up a believable romance, but the love at first sight thing doesn't work here and it could have been done a lot better. So it's no Titanic even though it had the potential to be, but it gives the audience a couple to root for, and overall everything else turned out fantastic. I also wasn't here for the love story, so I wasn't that disappointed. I for one found it to be one heck of a ride, and my overall score is a 9.9/10=Near-Perfect."
    },
    {
      "rating": "0",
      "text": "I spit in the face of every movie of the Roman empire that shown sub-saharan africans as something \"normal\", in this movie there are more such actors than in the whole of Italy in the present. -_-"
    },
    {
      "rating": "9",
      "text": "I really liked this movie. It's watchable history, like Troy, which we need a lot more of. I never knew much about Pompeii or cared to until these actors brought it to life. It made me want to learn the history and that says a lot for a movie that can do that."
    },
    {
      "rating": "3",
      "text": "\"Pompeii\" 10 Scale Rating: 3.5 (Bad) ...\r The Good: The best part of the film is easily the eruption of Mt. Vesuvius. As the storyline lets you down, you look forward to that moment and it does not disappoint. The filmmakers did a lot of research and it shows. The eruption is very realistic and the aftermath reflects everything you've read about the Pompeii disaster. While the cast mostly under-performed, Adewale Akinnuoye-gbaji was actually pretty good as Atticus, a barbarian fighting in the gladiator pits for his freedom.\r The Bad: Kit Harrington tried hard enough, but falls flat in the lead role. Emily Browning was forgettable, which is a shame because she is usually decent. Kiefer Sutherland was completely out of place and while he had a few solid moments of decent BWAH HA HA villainy, he was mostly corny and absurd. Making matters worse, Harrington and Browning had zero chemistry, certainly not to the level where they'd risk life and limb for each other during a disaster. The entire storyline is cliche and predictable."
    },
    {
      "rating": "0",
      "text": "Not as bad as Legend of Hercules but still bad. Poorly directed, Terrible plot with laughable dialogue that absolutely ruins the talented actors on the cast, The visuals are so-so but quickly becomes dull and uninteresting. It's a trash movie so why bother watching it."
    },
    {
      "rating": "0",
      "text": "Wow. This was a BAAAAD movie. I was actually rooting for the volcano.\r Everything about this movie was bad. I've seen better acting and dialogue at an elementary school play. Most of the movie exploited the fact that half the cast had boobs, and the other half had muscles.\r The character development was actually WORSE than everything else. The main character's sort-of friend, Atticus, had basically this as his character: \"I'm a gladiator, I have muscles, and if I kill you, I'll be freed from being a gladiator.\" Done. Then it changes to the first two and \"Oh, now I want to help you. Because friends.\" The main character was worse. I actually knew less about him than I did about Atticus.\r True, I expected nothing less, but even the science of this movie failed. The cloud of superheated ash from a volcano travels at over 400 miles an hour. They should have all been dead, like, as soon as it exploded.\r All in all, the worst movie I've ever seen."
    },
    {
      "rating": "6",
      "text": "Some of Paul WS Anderson movies were awesome and some were not, mixed bag to me. It is always a tricky to choose his movies to watch. Anyway, I went for it which was based on the historic disaster subject. Something like the movie 'Titanic', only theme was based on the real, but the story was a fictional. I was curious about the merge of newly written story than what I heard about Pompeii in history books.\r Todays graphics on the fingertip is the reason to recreating the historic movies. The second century after the motion picture was invented is on course to right direction. Many filmmakers utilised it very well and some are overly whelmed with too much graphics like the movie '300'. But still those were awesome to revisit ancient time just like we assumed it to be while reading history books. So my expectations were usual to see men with beautiful costumes and to know more about our extinct cultures.\r This was the romance tale with lots of actions and adventures. This movie badly missed the star powers. Since it was a German-Canadian collaboration the cast was recruited from everywhere to make it an international product. Well, I thought the lead actor was a little short though his performance was good. The others like Emily Browning, Kiefer Southerland and Adewale were better, but the pace of the movie did not give them more opportunity to exhibit and develop their respective characters.\r Yes, it was the story which rushed too fast towards the ending. Another 20 minutes of drama in the initial parts would have been the perfect setup for the story like this. Especially the character Cassia needed it and also a bit Atticus before all these three meet at one point. So it seems the movie maker's plan was commercial purpose than quality of art and presentation. Anyway the entertainment was there, but not the value and standards. A slight disappointment movie, though it can be watchable at once."
    },
    {
      "rating": "2",
      "text": "Seriously this was a bad movie. Everything that could go wrong did. Acting, voices, CGI, etc was all terrible. Instead of wasting money watching this, just go give you money to a homeless person because it would be better use of it."
    },
    {
      "rating": "1",
      "text": "This movie represents the worst excesses of an industry that has just forgotten who it is supposed to be. It distorts a historical event, and seems to think that \"cool\" special effects trump all content whatsoever. The plot is stupid, the characters are inane, the dialogue is the worst. And even the big deal special effects bear little resemblance to what the actual eruption would have been like. How could Kiefer Sutherland ever allow himself to be ensnared in such a dog? Not to mention Kit Harington, no doubt typecast into the sword and sandals cliche for the rest of his acting life. A waste of a lot of human and other resources to put this pooch on the market."
    },
    {
      "rating": "1",
      "text": "The pacing is all over the place. From slow and boring to fast and exciting, and then back again in a moments notice without any build up or suspense. It reminds me of the Starz hit show \"Spartacus\" but it fails to deliver in every way. The only redeeming quality about this movie is that there is an epic Volcanic Eruption, followed by a Tsunami, followed by some type of Nuclear explosion. I'd highly advise skipping to that part, and ignoring the horrid story, characters, and corny dialogue...oh and yes a man does say \"Why so serious?\" and \"This is madness!\" in this movie..."
    },
    {
      "rating": "0",
      "text": "This movie is a total waste of time. No character development no nothing. I mean there is this small child in Britain, seeing how his parents are slaughtered and killed by romans, getting caught by sort of mercenaries or whatever the **** they were, becoming a gladiator, killing everyone who is in his way over 17 years in London. After being recognized by a fat roman who wants him for his shows, getting him to italy where he gets to know a rich pompeiian girl on the way to pompeii, who falls in love with him, because he killed a horse with his bare hands. Being stuck in a cell with a black gladiator who just has the opportunity to get free after his last fight against the main character, realizing that the black guy Atticus is a formidable man having the same thoughts about romans... recognizing that the romans who killed his family 17 years ago are also in pompei, while the parents of the girl want to make business with the roman guy who killed the mom or the main character \"Milo\". Afterwards typical, i cannot reach the \"bad\" guy I have to kill countless statists in a fight in the collosseum, being rescued by the gutts of the girl who gets locked away.... Having to fight against the bad bad romans... Blubb* Ahh yeah there was a volcano... Piuu piuuu bad CGI, bad VFX bad everything... First there is an earthquake destroying the collosseum... Then a fight as usual in the ruins... Running away from the volcano.... Ahhh there was this girl.... Locked away just 2 Minutes before the volcano broke out... 15 km away from the collosseum... *WTF??? - Milo escapes with Atticus.. Atticus wants to run to the habour... Panicing people, booom tsss. typical cliché effects alla Dantes Peak, Volcano, or Armageddon - I have seen everything before in other movies... Total predictable development. Then Milo runs in 30 seconds 15 km to the place where the girl is locked... rescues her, brings her back to the city... Then the habour is flooded by a tsunami, which is stopped by the Citywall....... .*omfg.... Atticus, Girl and Milo try to find a way out... They meet the romans again... Girl gets kidnapped. Milo and atticus have to fight a bunch of romans.... Atticus fights against the ultrastrong roman... Atticus gets lethally injured but killes the roman.... Milo tries to follow the kidnapped girl on a horse which definetly has gps, because it can avoid any sort of impact, rock, fire, dust etc.... Car of the bad guy crushes.... girl gets sort of rescued... Stupid fight between milo and Kiefer Sutherland ( Bad Guy) **** result - Girl locks arm of bad guy with handcuffs... Milo is not getting his revenge .... \" My gods are coming after you\" - BOOOOORING .... Big Lava wave comes, which is at least 600 mph fast. Bad Guy Burns.... Atticus Burns as a free man .... The couple burns .... END .....\r I recommend anybody who wants to see a movie with a plot to not watch this film. It is an absolute waste of time... I felt like i wasted 106 minutes of my life after finishing this movie, cause it is giving you absolutely nothing. The characters are totally flat, the story is already clear ( Pompeii falls) and the Main Story of Milo is absolutely pointless... He gets no revenge, he gets no friends, he gets no girl, he gets no life as a free man... I asked myself at the end... If I am able to run about 15 km in 30 seconds, I would at least have had the time to escape to Vienna with my \"girl\" to suisse germany or even denmark... Nooo .... I choose to die in the flames.... By telling the \"girl\" just look at me... while i burn to death.... This movie is absolute crap... Sorry.... If you want to see an entertaining movie, where you don't feel like you wasted valuable lifetime... Don't even think about watching this waste of money movie with a story which could've been more interesting if apes wrote it."
    },
    {
      "rating": "2",
      "text": "I confess I had some curiosity about this movie. Disaster films with volcanoes are no longer new (\"Volcano\" and \"Dante's Peak\" are good examples) but a film about a real historical fact as dramatic as the destruction of Pompeii (and the nearby city of Herculaneum) in 79 AD, is somewhat unusual. Unfortunately its much weaker than I thought it would be.The plot is simple: a Celt, captured and enslaved after Romans massacred his family, becomes a successful gladiator and gets the attention of a wealthy Roman girl, disappointed in her culture's cruelty. When Vesuvius erupts, he will have the chance to flee with her and avenge his family, as the girl's forced bridegroom is, precisely, the one responsible for the massacre that has killed them. The influence of films and series such as \"Gladiator\", \"Rome\" and \"Spartacus\" is evident, but the fact is that the script is frankly underdeveloped, with characters so basic that we can summarize each one in a single word. Another problem I felt was the partiality of the plot, demonizing Roman civilization. The end of the film tries to be unpredictable but isn't properly capable of that, besides that makes everything too melodramatic. About historical accuracy... forget it. Who wrote the script totally ignored historical facts. That bombs or that tsunami are obscenities that attempt to the intelligence of those who know the basic about what actually happened in Pompeii.Paul W.S. Anderson has a bad name as a director but this was his first movie that I actually watched. In this case, I recognize reason in the criticisms: he's a weak director, dazzled with the CGI but incompetent in the direction of the cast and the script. Regarding the cast, there are some heavy names like Kit Harington, Emily Browning and Kiefer Sutherland, but the performances were generally mediocre and uncompromising. It is true that the characters are too basic and underdeveloped but the actors also did not feel like sweating the shirt by their characters. Browning, for example, was unable to build a chemistry with his romantic pair. That intense love that should have existed is never there and everything sounds unlikely and artificial. Sutherland, who was the villain, is simply ham and histrionic. The best actor here was Akinnuoye-Agbaje, with a performance capable of harmonizing strength and action with some psychological depth and drama.Visually, the film is a CGI feast and visual and sound effects of good quality and a lot of impact, mainly from half the film to the end. Cinematography helps, emphasizing the colors and with the camera moving quickly in the action scenes. The problem is that these were the only aspects where the film was really good, and this is not enough to make the movie good. It just makes it bearable."
    },
    {
      "rating": "5",
      "text": "Can't say that is great nor bad. It's like ''meh''.\rYour review must be at least 150 characters long. Your review must be at least 150 characters long."
    },
    {
      "rating": "3",
      "text": "The visuals are reasonably good but the dialogue, characters and story are embarrassingly bad."
    },
    {
      "rating": "6",
      "text": "What do you do when you put Titanic, Gladiator, all sort of disaster movies into a blender...Well, you'll get Pompeii, a film that is so utterly derivative of all films that have gone before it, but somehow made with such enthusiasm by Paul W.S. Anderson, the king of 'schlock' cinema that you'll find it somewhat enjoyable. Kudos for Kiefer Sutherland, hamming it up as the main villain. If you got nothing else to watch..."
    },
    {
      "rating": "4",
      "text": "Not a good film but better than I expected.  I was expecting Legend of Hercules bad, but at least got some decent gladiator scenes and an ok ending.  In the end the film suffers from campy acting and no character development.  C-"
    },
    {
      "rating": "6",
      "text": "Oh man, where to start with this movie?\r The 6 is out of respect for the quality acting and above average directing and choreography-- the screenplay and cgi just ruin it. This movie would have been far better as a standalone action-tragedy in a different Roman territory. The volcano cgi all through the movie was cheesy and fake looking, and did not follow known patterns of volcanic activity. There are inconsistencies when at one point the protagonist is able to quickly defeat 5 opponents, while at another time he almost dies to one Roman officer, but later defeats a higher ranking officer in single combat. The Romans would not have been so unusually cruel for no reason to otherwise peaceful territories. They fought to expand their empire, not to kill the people they wanted to tax. Also, no roman or noble of any nationality would have allowed their daughter to court a slave.\r The last 35 minutes you can't help but scream at the characters who are lolligagging around when they should be running the Boston marathon. The story is so far beyond predictable that you have to come up with a new word for \"really ******* predictable\". Whoever wrote the screenplay did not attempt originality in the slightest-- there were times I could have sworn I was watching Gladiator or Rome. The love story is excellent, and once again would have been better served in a different setting. The whole movie seemed to be built around the final scene were we see the famous 2 lovers kissing frozen in time. It would have been much better to start with this and build from there with more of a focus on the natural disaster if they really wanted to make a movie about Pompeii."
    },
    {
      "rating": "5",
      "text": "Serviceable storyline between two average characters around good recreation of a natural disaster during an ancient time that could be better represented and fleshed out."
    },
    {
      "rating": "10",
      "text": "I thought this would be some crappy Greek/Roman themed movie like Clash of the Titans but I was pleasantly surprised. The actors aren't the best, but it's amazing how the movie ties in the erupting volcano making the trivial human quarrels seem petty. And the ending is beautiful, couldn't have been better."
    },
    {
      "rating": "6",
      "text": "Poorly acted and thinly scripted, Pompeii has nothing more to offer than brilliantly choreographed fight sequences and the spectacle of lava and other objects being flung around in 3D."
    },
    {
      "rating": "5",
      "text": "The love story is cheesy, the dialogue is predictable, the middle is boring, the politics are uninteresting and there is action overkill but overall, Pompeii is still very entertaining and all that amounts to one guilty pleasure."
    },
    {
      "rating": "3",
      "text": "The first half of this film is really just tolerating the useless characters and cheering for the guy from Game of Thrones until the first major volcanic explosion. The second half is good for CGI explosions and using the last scenes with dialogue for sending a text message or doing anything other than looking at the screen. This movie wasn't terrible but it was pretty close. Adewale Akinnuoye-Agbaje is a decent actor who was giving bad lines. I'm a big Kiefer Sutherland fan and I was surprised he even took this role. But for what it's worth, he played the over-the-top villain....very over-the-top."
    },
    {
      "rating": "7",
      "text": "Pompeii es una película que contiene unos respetables efectos visuales y una buena dirección artística, además de varias escenas llenas de acción y drama, por lo tanto, lo que se puede decir, es que no es una mala película."
    },
    {
      "rating": "2",
      "text": "Pompeii was such an incredible rip-off of Gladiator, starting with the black acquaintance who battles on the same side as the main character. I thought the rest was original, which was crap, but then I see critics writing \"Gladiator meets Titanic,\" which does make sense for the other half. The poor boy saving the wealthy girl near the disaster."
    },
    {
      "rating": "4",
      "text": "A very boring movie up until near the end when the movie actually starts. Up until the disaster scenes the movie is so boring, but it is not that it is a love story because it is really not it is kind of just a story where nothing happens. There are a couple battle scenes during the first bit of the movie that suck and a couple that are good so those kind of cancel out. Like I said it isn't good until the volcano erupts. During those scenes the effects are really cool, but there are still so farfetched scenes that still don't allow you to enjoy the movie that much."
    },
    {
      "rating": "4",
      "text": "Pompeii is a story about Milo, a slave who hopes to buy his freedom and be able to marry his master's daughter. But the powerful master has already promised his girl's hand in marriage to a wealthy senator from Rome. The story takes place in the year 79, just at the time when the Vesuvius entered in eruption. The character of Milo is being played by Kit Harrington who has been recently revealed to the world thanks to his role in the tv-show \"Game of Throne\". I found the movie quite annoying. Kit didn't convince me in this role. The movie bets more on impressive special effects than on a scenario well tied together. It is too bad because the storyline had some real potential."
    },
    {
      "rating": "3",
      "text": "2/5★ Only when the 3D SFX laden action is on screen does the movie hold interest. The story and writing are plodding and uninteresting and even Jon Snows muscles don’t distract from the Gladiator-lite story set during history’s most infamous volcano eruption.\rVerdict: Skip the talking parts and enjoy!"
    },
    {
      "rating": "4",
      "text": "Gladiator was pretty good. I mean, it wasn't as good as Braveheart...oh, wait. This is Pompeii. Pompeii was crap, it literally copied every small detail of Gladiator, including the black accomplice in the arena detail. Otherwise, it copied Titanic, with the rich girl being saved by the poor boy while disaster strikes."
    },
    {
      "rating": "2",
      "text": "I can't believe I honestly sat down and watched this entire movie. This is a Titanic/Gladiator wannabe and is one of the worst movies of the year, holy **** I hated this movie. The visuals suck, the characters suck, and in the end they try to take a deeply tragic event like Pompeii and make it into cheap entertainment."
    },
    {
      "rating": "8",
      "text": "I like historical movies. And so I like this one. Aesthetically its a beautiful movie. Especially when it comes to CGI lava balls flying out of Mt. Vesuvius crashing down upon the citizens of Pompeii. I recommended this movie to a friend. He liked it. He thanked me. That's all there is to it. A nice movie."
    }
  ],
  "recommendations": [
    "immortals",
    "pearl_harbor",
    "elysium",
    "infinite",
    "after_earth",
    "x_men_apocalypse",
    "the_old_guard",
    "chaos_walking",
    "transformers_the_last_knight",
    "san_andreas",
    "the_mountain_between_us",
    "x_men_origins_wolverine",
    "pacific_rim_uprising",
    "sanctum",
    "independence_day_resurgence",
    "what_happened_to_monday",
    "code_8",
    "battleship",
    "the_ice_road",
    "mortal_engines",
    "terminator_salvation",
    "skyscraper",
    "project_power",
    "poseidon",
    "300_rise_of_an_empire"
  ]
}