{
  "id": 4830,
  "title": "Porno",
  "starring": [
    "David Cardoso",
    "Patrícia Scalvi"
  ],
  "runtime": 83,
  "genre": [
    "Drama"
  ],
  "description": "Three tales of the erotic: Two young ladies experiment with lesbianism, a handsome and wealthy socialite makes a beautiful woman patiently wait to make love to him, and a gorgeous, but controlling and dominating blind woman makes a hunky stud her sexual hostage in her swanky mansion home.",
  "releaseYear": "1981",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/bhbPSpYjsRJAK7rXqL8APK9EwBl.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 4.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Considering its theme, and considering the nudes, in the end this movie turned out to be kinda prudish.I think its weakness is that it never seems to be sure where to go for full horror and where to go for full comedy.The mixture lent itself to being more acid, more perverted, but as I said, it seems that the director did not want to dare more.The acting is bad, but it was to be expected, however the script should have been stronger and more degenerate.If you're encouraging yourself to make a movie like this one, dare to go all the way."
    },
    {
      "rating": "6",
      "text": "Fangoria presents this cheesy genrefest set in 1992. The staff of a small theater find themselves targeted by a succubus they accidentally release by watching a mysterious film after hours. It takes them one by one exposing their secrets, seducing and than destroying them. I wish I could say that I loved it. With the kick ass poster and inspired trailer i expected more. It just never quite gets crazy enough and the awkward pacing is a bit distracting. That being said after a slightly drawn out set up it finally gets to some goods in the final third and it's kinda fun. I just wish they had the \"balls\" to go all the way.6/10"
    }
  ]
}