{"id": 3316, "title": "Poseidon", "starring": ["Kurt Russell", "Richard Dreyfuss"], "runtime": 98, "genre": ["Adventure", "Action", "Drama", "Thriller"], "description": "A packed cruise ship traveling the Atlantic is hit and overturned by a massive wave, compelling the passengers to begin a dramatic fight for their lives.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/cCx2Ead8KoZhHofsAAr7tyrjfDo.jpg", "categories": {"plot": 4.7407407407407405, "acting": 4.34375, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.333333333333333, "funny": 5.5, "action": 7.1875}, "reviews": [{"rating": "10", "text": "This movie was soo intense! some parts made me cry. but i couldn't find anything wrong with it. and plus josh lucas is sexy which is good enough for me !"}, {"rating": "6", "text": "The visuals are impressive and the actors do their best to work through the script. I've seen worse disaster films, Poseidon was entertaining for being a loose remake."}, {"rating": "6", "text": "A remake is not always an automatic negative. The visuals are quite impressive, and if you look beyond some mediocre acting, you actually may be entertained."}, {"rating": "3", "text": "What script? What character development? Action wasn't even handled that well, because it all blurs together."}, {"rating": "5", "text": "The beginning of the movie was great, but the rest of it was predictably boring at best. I actually left the room a few times without pausing it. I was expecting a better story line. You knew exactly what was going to happen."}, {"rating": "8", "text": "Every bit as dramatic and action packed as the original. All it's lacking is the character development the original had, which is more than made up for by the special effects. Very entertaining edge of your seat movie, every bit as good as the original."}, {"rating": "8", "text": "The acting wasn't bad, the movie was action packed and intense and it was entertaining all the way through. The special effects may not hold up very well with today standards but it's still a good movie."}, {"rating": "10", "text": "This is literally the best film I've ever seen. So much excitement. The actors were good, the storyline was good. I enjoyed the film from the beginning till the end. I would 100% recommend this film!"}, {"rating": "1", "text": ">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> Naja. 1/10 *"}, {"rating": "10", "text": "superb movie!!!!!!!!!! i loooove the movie so much... full of adventure, suspense, n thrilled wid the special effects... wow rely mind blowing.. for those who lik adv superb effects n nail biting scenes i recommend tis movie."}, {"rating": "9", "text": "I really don't know why this film is getting such bad reviews. Both my wife and i thought it was ace. The effects and edge of the seat moments were worth the entry money alone. A great movie and i think it is even better than the (great) original."}, {"rating": "10", "text": "I loved the movie, even started looking online to see if this was made from an actual event and I ended up here instead. [***SPOILERS***] I cried when the dad died. So I'm glad I rented it to see at home instead of the movies. I give the singer a 0 cause she is just nasty."}, {"rating": "0", "text": "Painful...makes four hours of \"Titanic\" feel like a 30-minute sitcom."}, {"rating": "8", "text": "This movie is what it is, a disaster flick. It is exciting and will be entertaining to anyone who simply enjoys a good adventure movie for being just that. That said, I did, however, wish for a longer intro and more character development. The trailer was barely over before disaster struck."}, {"rating": "3", "text": "\"Poseidon\" is typical of Wolfgang Petersen's films; either they suck or they sink."}, {"rating": "10", "text": "Excellent! suspenseful with good human interest moments. cant see why some people are so bitter over it. This is not like the original. to want to releive that is foolish. It kept my attention the whole way and I cared for what happened to the characters. also its funny that the negative reviewers \"hate\" this movie. how unfortunate that a movie that shows people helping each other in order to get through a terrible disaster should produce \"hate\" in a movie reviewer. there is nothing to \"hate\" about this movie. thats a big fat misrepresentation of this movie's experience and message. See it without any bias and maybe, in the middle of all the action and suspense, the movie's intertwined and heartfelt human interest message will be experienced and enjoyed."}, {"rating": "6", "text": "For those expecting acting that rivals Schindler's List, shame on you. This was a big-budget adventure that fell short of being at all memorable. You go in, enjoy the action, leave, and then make like a goldfish with a 7 second memory. Dreyfus' acting is a shining point, and Russel and Rossum handle themselves well along with him. Otherwise, the acting is as expected, where the main discretionary command at the casting call was, \"OK, now pretend like you're drowning, and look hot doing it!\""}, {"rating": "1", "text": "terrible movie it was a wasted of time this movie should have been called Titanic 2 but it is just a poor imitation (I know it is based on a 1972 movie) but it has no any plot so you are not worried about the moment when the people die because yo have not been involved with the characters."}, {"rating": "6", "text": "Slightly above average popcorn flick. The special effects are top notch and the suspense is at full throttle, but there should have been more character development. I had no invested interest in whether these people lived or died, apart from Jimmy Bennett's character. His role was an annoying plot device identical to what he played in Firewall. Cliche, anyone?"}, {"rating": "1", "text": "I saw this late night in an empty cinema with three friends. It was so bad we were laughing and booing, sometimes in hysterics. It is an anti-drama, animatronic robofilm made by and for automatons. The script and acting are so banal that the interplay between actors becomes unfollowably dull, as characters enter the frame, babble cheese-drivel and then leave. On top of this; the action, the very raison d'etre of this scuppered piece of fishy junk, is utterly underwhelming. With such resource at his command, why did the director shoot in such a cluttered fashion, with most action taking place in shaky mid-shot, and most wides tainted by a CGI sheen? Only one scene had effective claustrophobia, in a situation that should have been saturated with it. This film lacked charisma, especially in the casting, featuring bland non-entities shifting about the frame like so much forgettable fish fodder. I tell ya, I was rooting for the water! Drown 'em! Drown 'em all!"}, {"rating": "2", "text": "I prefered the 1972 movie that they extracted it from. This was just nonsense."}, {"rating": "6", "text": "Movie sets = 8; realistic looking sets CG FXs = 5 (day FX) 8 (night FX) 6.5 (combination score) Script = 3; a bit choppy at times Acting = 8; considering a weak script Action = 9; the action kept me interested This wasn't a bad action movie to watch, and I have no regrets seeing it on DVD, but they may have tried to cram too much of everything into the movie. There wasn't much time for the viewer to get to know and bond to the characters. The viewer was lead from one danger after another danger, after another danger. It felt like 'Fear Factor: The movie'. Everything felt hurried."}, {"rating": "10", "text": "I loved this movie so much! I thought that the \"edge of your seat moments\" were awesome, especially when Richard Nelson was almost crushed by the elevator or Dylan Johns was almost sucked into the propeller tube trying to shove the tank of gas into it. I know everyone has their own opinion but I can't see how you could possibly not like the movie! I never have seen the original but I heard that the special affects are a lot more advanced and realistic. I really enjoyed the movie and I hope my comment was helpful."}, {"rating": "10", "text": "This film is great it has nail biting moments and great actors like Josh Lucas. I don't know how any one could not like this film people have worked really hard on this film putting a lot of effort in and they sure pulled it off. One of the best moments in the film is when they are climbing through the vent it is so realistic. Characters Dylan, Eleana and Nelson make that a great scene. I could watch it again and again and never get tired of it."}, {"rating": "9", "text": "Great movie... a little short on plot, but the action is phenomenal. Josh Lucas is great also."}, {"rating": "1", "text": "I was shocked and disgusted by the treatment of ethnic minorities in this movie. It was offensive and insulting. Just kill off all the minorites. What a pitiful execuse of a movie. Get me my ten dollars back."}, {"rating": "3", "text": "Vivid visuals...but that's about it. Overall, a big, hot, steaming pile. And could someone please give Richard Dreyfuss, an Oscar winning actor mind you, a few lines? They substitute actual meaningful dialogue with a huge diamond earring to remind audiences that he is gay? A completely pointless character. Sad! I suppose watching Kurt Russell choke on gallons of water is fun, but it was not worth the nearly $10 I spent to see the film."}, {"rating": "1", "text": "The worst character development in history. I loved the orignal movie with the great cast and developement. Sure the special effects were lame compared today but at least it was fun with real excitement. This one had no excitement and completely ridiculous. Why did not Kurt Russell as a retired fireman Captain try to save more people? Where was the X mas tree? Where was the cool New's yeare party? It was just a prop to show off all the special affects that the original lacked. Watch the first 20 minues and leave to see another movie. WORTHLESS."}, {"rating": "2", "text": "I didn't go expecting much. I got even less. Missing is any depth of character, no undercurrent themes that were prevelant in the 1972 version, no story,and no point. A terrible movie that made about 20 million too much in its first weekend."}, {"rating": "1", "text": "This remake (although its stars claim it isn't one) is definitely not your father's Poseidon Adventure, which proves that sometimes father really does know best. Purists, of course, will find plenty to cavil about (Where's my Shelley Winters yakking about what a championship swimmer she was right before she drowns? Where's my Reverend Gene arguing with God just prior to meeting Him? Where's my Ernest Borgnine nagging my Stella Stevens to put on some clothes for a change? Where's my schlocky-but-catchy Maureen McGovern song that turned out to be so catchy, she virtually duplicated it two years later in The Towering Inferno?) but let's be honest: even if you're not a devotee of the original, there's STILL plenty to hate here. Irwin Allen's 1972 version of Paul Gallico's novel was a relatively respectable early example of one of the most unlikable of major film genres, the disaster movie; the personal drames and cornball characters navigating their way through the wreckage of an ocean liner destroyed by a tidal wave are precisely as campy as some viewers think they are, but there's an equally plausible reason why some of the original's fans (past and present) take it all perfectly seriously: because the filmmakers did, too. While \"Master of Disaster\" Allen no doubt handled most of the heavy lifting on the special effects, the actors were helmed by Ronald Neame, a dignified British director whose previous efforts (Tunes of Glory, The Prime of Miss Jean Brodie) were character studies first and foremost; even though the 1972 Poseidon was dramatically several leagues inferior, there's no doubt that Neame brought a considerable level of utter conviction to his material. The remake's director, Wolfgang Peterson, under the assumption that a summer movie audience is by definition unanimously stricken with A.D.D. and thus in a desperate hurry to get to the fires and explosions, gives us characters that are so half-dimensional (they don't even have enough depth to qualify as ONE-dimensional) that he makes the original's script look like a Eugene O'Neill play by comparison. All the women (including Ladder 49's lovely Jacinda Barrett) look alike even BEFORE being covered in smoke and bilge, and all the men yell their way through the entire movie with the exception of Richard Dreyfuss, who as a heartbroken, suicidal architect strikes an inadvertent blow for gay equality by proving that homosexuals can be every bit as boring as straights. What in the name of Neptune has happened to the once-great Peterson, anyway? Much of his previous work had what Poseidon stubbornly and willfully lacks: The Perfect Storm respected and honored its ill-fated real-life fishing crew while detailing the logistical mistakes they made that led to their tragedy, and in Air Force One Peterson took special care to tour us through the Presidential plane so that the action that subsequently took place in every compartment and chamber would really hit home. Judging from this and Troy, Peterson (who also, of course, made the definitive underwater movie, Das Boot, with very few special effects) needs to have his shiny new CGI toys taken away from him: some of the effects and exteriors here look as phony and unconvincing here as the rear-projection shots of ANY movie made in 1945. But what truly transports this Poseidon from being merely forgettably and disposably bad to being genuinely offensive is its graphic depictions of human pain, injury and agony and the utter callousness that both the film and its major characters display to the suffering of everyone else on the ship. Remember that in the original, the walk-ons and extras who perished did so because they were offered the choice of following the principal players and declined it; they essentially sealed their own doom. Here, the main characters don't even TRY to help anyone else, so perhaps it shouldn't be too surprising later on when someone responds to the life-or-death peril of a FAMILY MEMBER with all the emotion you'd expect from someone who temporarily misplaced a shopping list. Although the original Poseidon Adventure was a fairly benign example of the form, I've always found disaster movies to be as reprehensible as the current spate of horror films in which a character spends 90 minutes or so torturing all the OTHER characters: both genres invite their audiences to stare and drool at human pain and tragedy, only in this case Mother Nature herself does the slicing and dicing. Perhaps this Poseidon's already legendarily, uh, disastrous box office showing, coupled with the real-life United 93 making fictional accounts like this even more obscene by comparison will send any future incipient efforts to recycle Earthquake, The Towering Inferno and the Airports to a well-deserved watery grave."}, {"rating": "5", "text": "Quick and painless summer fare, plain old fashion disaster filck. If you are looking for anything else with say depth. Go elsewhere. Visuals are fantastic, characters are merely there to get thrown around by water nothing else."}, {"rating": "8", "text": "I was pleasantly surprised at this movie, especially with the lower rating. Yes, there was some predictibility, but this was pretty decent for an action flick."}, {"rating": "8", "text": "Petersen turns up the action and turns down the melodrama on the 1972 incarnation of Gallico's novel. Gone are the sermons, the soul-searching and the theme song; the characters don't have time to ponder whether there's going to be a morning after (or whether they"}, {"rating": "2", "text": "i almost fall alsleep and the movies doesnt even have a story line. it was bored and it failed to make me feel touching. and actors were acting not really good at this movie either. it was aweful."}, {"rating": "10", "text": "I loved it! I cant understand why people found it terrible, their stupid! It was Fantastic."}, {"rating": "0", "text": "one of the worst films of all time...terrible in every aspect possible...bad acting...unrealistic and dull plot...bad writing....annoying direction...its so bad it even goes down to bad lighting, special effects and hot women."}, {"rating": "0", "text": "A horrible movie in every way."}, {"rating": "9", "text": "Very good movie."}, {"rating": "7", "text": "Petersen gets a lot out of his actors, atleast it felt like they all could be close to death at any time. For some reason, and maybe because of the disaster film label that started with the first one in'72, I think the movie got a bit of a bad rap. I noticed that Dreyfus had nothing to do with the special feature interviews. Better than the original, and without the campy dialogue."}, {"rating": "10", "text": "Ok. I understand everyone has different opinions, thats fine. Personally, I thought the movie was one of the best I've ever seen and am now completely obsessed with it. Plus, Fergie was great. But, to those of you saying, \"It was nothing like the original Poseidon,\" let me ay this. If this movie were like the original, it would be boring. It's so much more modern and the ship is more beautiful. I thought the effects were great, Woldgang spent so much money on the effects and if anyone watched the special features, his intentions were to make this Poseidon completely different from the original. He wanted the main idea of a ship sinking from a rogue wave with a few people trying to survive. I found the movie very interesting and I just wanted to let all of you negative reviewers know of his intentions. :)"}, {"rating": "0", "text": "Absolutely terrible. A degrading role for Richard Dreyfus.... I'd rather sit through a New Years morning hangover listening to someone drag their fingernails across a chalkboard than sit through this abortion of a film again."}, {"rating": "7", "text": "I liked the movie very much. It was so thrilling that i was shaking for most of it. But I noticed that the actors were like swimming in water the whole time which was kind of weird because, if you think about, the boat had lots of electricity. When you were a child, didn't you ever hear the saying \"Water and Electricity don't mix.\" In other words, nobody should had been alive at the end of the movie. The instant they dived in the water they should have died. John B. was right. This actually did look like a Fear Factor show. Especially when they were in the tanks when they were flooding."}, {"rating": "8", "text": "Poseidon was a good movie, i recommend it to others out there. The movie is very interesting and keeps you on your toes and wondering what's going to happen next."}, {"rating": "8", "text": "Unbelievably intense."}, {"rating": "10", "text": "A great film , Then and now. And a great new story for todays viewers. A short intro leads to non-stop action and suspense. Irwin Allen would be proud and gratious to all involved. Keith M. Donkersley Alb. N. M"}, {"rating": "7", "text": "Yes, the movie is short on plot and the characters are pretty thin, but I found the film to be a well acted, terse, exciting, and visually visceral film. The extended scene in which the ship actually overturns is extraordinarily well done and quite awe inspiring. Also, who couldn't resist Josh Lucas and those ol' baby blues!"}, {"rating": "9", "text": "I went in not expecting much and came out really happy! I thought this was an excellent film and would highly recommend it to anyone. Lots of action and adventure!!"}, {"rating": "10", "text": "This was one of the best movies i have ever seen truly well done."}, {"rating": "0", "text": "People may have liked this junk 35 years ago, but then again, Bread was a popular band once. The original wasn't any good, why did I think a bloated remake would be better? Don't waste your money - boycott this or else Hollywood's going to make more (and we don't need a remake of \"Earthquake.\")"}, {"rating": "8", "text": "It was an entertaining movie! Those who didn't get entertained (looking for character depth, blah blah) were watching the wrong MOVIE! You don't watch \"American Beauty\" and expect action and suspense, so don't watch \"Poiseidon\" looking for character depth and the blah blah. It was fun to WATCH, it was ENTERTAINING and I liked it!"}], "recommendations": ["into_the_storm", "independence_day_resurgence", "jumper", "bloodshot", "san_andreas", "hercules", "avengers_age_of_ultron", "seventh_son", "edge_of_tomorrow", "riddick", "clash_of_the_titans", "terminator_genisys", "kingsman_the_golden_circle", "teenage_mutant_ninja_turtles", "the_last_witch_hunter", "guardians_of_the_galaxy", "transformers_dark_of_the_moon", "the_a_team", "skyscraper", "gods_of_egypt", "the_meg", "gemini_man", "transformers_the_last_knight", "black_panther_wakanda_forever", "pacific_rim_uprising"]}