{
  "id": 2814,
  "title": "Pound of Flesh",
  "starring": [
    "Jean-Claude Van Damme",
    "John Ralston"
  ],
  "runtime": 104,
  "genre": [
    "Action"
  ],
  "description": "In China to donate his kidney to his dying niece, former black-ops agent Deacon awakes the day before the operation to find he is the latest victim of organ theft. Stitched up and pissed-off, Deacon descends from his opulent hotel in search of his stolen kidney and carves a blood-soaked path through the darkest corners of the city. The clock is ticking for his niece and with each step he loses blood.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lLxgyIuENnjPLeNIoqwIg3XBwJ1.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Hangover: The Taken Kidney. Action movie collaboration between west and east has produced mixed results in recent year, even the ones with high production. Pound of Flesh with its modest budget is actually a welcomed change of pace as Van Damme delivers a different kind of action flick. It makes do with the quirky antic, decent plot and the tendency for humor on its own expense. Unfortunately, there are also few jarring basic errors which might decrease the entertainment value and the moral message isn’t appealing enough.\r Deacon (Van Damme) wakes up as though he's in Nat Geo documentary of stupid tourist getting molested. He has only one functioning kidney left and with his set of particular skills, he will find it and take it back. The plot adds more depth in introducing his estranged brother who is religious in the ordeal and his niece who happens to need kidney transplant. While this might seem ludicrous, the movie gives effort on creating a human drama.\r Van Damme is presentable in both acting and fight, he might seem off beat at times, but he does his best. It's not the usual one man army action as he is shown repeatedly in fragile form. The film tries to create a philosophical and moral commentary, though only a couple of these actually work and frankly it drags the movie in midway point. Fortunately, it has a balanced ratio of irony expected from mild action film.\r The action is fluid enough, choreography for the fight is pretty well done and it takes what advantage it can from its exotic setting. However, occasionally the movie will suffer from poorly made effects. One of them is a reminiscence of 90s sitcom where the characters would drive a car and scenery would be plastered around them. The setting might look awkward as though green screen doesn't match, shooting effect is plastic as best or the scenes feel choppily pasted on random location. These things shouldn't have happened with current filmmaking.\r It has several technical flaws and the narrative might stumble, although its friendly locals, quirky B-movie antics and a touch of needed irony make Pound of Flesh an interesting light watch. If it had better presentation and less heavy-handed morality issue, it would’ve been a more compelling trip."
    }
  ],
  "recommendations": [
    "upgrade",
    "centurion",
    "alien_outpost",
    "robocop",
    "hunter_killer",
    "survivor",
    "spectral",
    "the_great_wall",
    "dragged_across_concrete",
    "cliffhanger",
    "sicario_day_of_the_soldado",
    "the_first_purge",
    "extinction",
    "no_sudden_move",
    "anthropoid",
    "mission_to_mars",
    "universal_soldier_day_of_reckoning",
    "mission_impossible",
    "atomic_blonde",
    "300_rise_of_an_empire",
    "mission_impossible_ii",
    "twister",
    "wrath_of_man",
    "safe",
    "revenge"
  ]
}