{"id": 3380, "title": "Precious Cargo", "starring": ["Bruce Willis", "Claire Forlani"], "runtime": 99, "genre": ["Action", "Crime", "Thriller"], "description": "After a botched heist, Eddie  a murderous crime boss, hunts down the seductive thief Karen who failed him. In order to win back Eddie’s trust, Karen recruits her ex-lover and premier thief Jack to steal a cargo of rare precious gems. But when the job goes down, allegiances are betrayed and lines are crossed as Jack, Karen, and Eddie face off in a fateful showdown.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dOQv2PDBu9bBCZRLeRp6QQYJDr3.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "0", "text": "The film is not interesting. Even the chase on boats was boring. I'm tired of watching already in the thirtieth minute. I feel sorry for Bruce Willis. The film discredits his name."}, {"rating": "5", "text": "One of biggest examples of stunt casting you'll ever see. Aside from that, 'Precious Cargo' is poor in almost every area.Mark-Paul Gosselaar is very much the lead actor, Bruce Willis barely features at all; and when he does, it seems he didn't give a toss about this production - I'm not usually one to say an actor is supposedly phoning it in, but Willis in this... oof. Gosselaar, for his part, is average. As are the rest of the cast, yet I kinda liked Jenna B. Kelly's Logan.This attempts action, comedy and romance - none of which pay off unfortunately. The action is OK, though the comedy is extremely forced but not helped by lame dialogue. As for the love story, there is far too much - to quote the film itself - \"sappy **** in this. 100% action was needed.I will say I appreciate that there is at least a male and a female character, both appear a large amount, that don't end up getting together, instead remaining friends. That's unusual with this sorta film. The score is actually alright, too. It also, unexpectedly, includes a blooper reel in the end credits.Improved writing and acting could've made this work, if only on a minorly serviceable level."}], "recommendations": ["collide", "extraction", "survivor", "spenser_confidential", "triple_frontier", "16_blocks", "2_guns", "the_gunman", "parker", "triple_9", "haywire", "chips", "red_notice", "wrath_of_man", "jack_ryan_shadow_recruit", "the_italian_job", "lawless", "jiu_jitsu", "baby_driver", "contraband", "keeping_up_with_the_joneses", "sabotage", "gunpowder_milkshake", "kate", "the_expendables_3"]}