{
  "id": 1054,
  "title": "Predator",
  "starring": [
    "Arnold Schwarzenegger",
    "Carl Weathers"
  ],
  "runtime": 107,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "A team of elite commandos on a secret mission in a Central American jungle come to find themselves hunted by an extraterrestrial warrior.",
  "releaseYear": "1987",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/k3mW4qfJo6SKqe6laRyNGnbB9n5.jpg",
  "categories": {
    "plot": 9.222222222222221,
    "acting": 9.4,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 9.2,
    "action": 9.2
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Are the critics smoking something over there? It may not have the best script in the world but this was an entertaining movie, and great effects on the predator."
    },
    {
      "rating": "8",
      "text": "\"Predator\" is a good action blockbuster movie; it succeeds to consistently maintain its tension and coolly blows it off in the end with Arnold Schwarzenegger."
    },
    {
      "rating": "10",
      "text": "The best alien movie of all time.  With classic arnold moments, and stan winston's creature effects, this movie was brilliant ever since I saw it when I was about 4. Classic."
    },
    {
      "rating": "10",
      "text": "Usually when I look at a movie, like example horror or action or comedy or whatever. Then it depends on how scary it is or how destructive it is. This movie is a action horror. But with Arnold Swachenegger in it was more action than horror. Doesn't matter, it all tied up when Arnold was being hunted by the PREDATOR. The universes best hunter ever, until it met Arnold. They both gave each other hell. Arnold gave the predator hell because he was sent in the middle of the jungle to help a team distress call. But instead he and his team find nothing but skinned soldiers and of course the predator. The PREDATOR gave him hell because its his right of passage to become a \"man\". All together the movie was awesome. Not the best graphics you ever saw but still what a movie. Thumbs up."
    },
    {
      "rating": "10",
      "text": "doesnt matter what 4 critics say, the has spoken and is one of thebest clasics ever, supense action good efects, is one of the best movies and schwarzenegger rocks, awesome movie everybody must have"
    },
    {
      "rating": "9",
      "text": "I thought this film was great. Loved some of the taglines such as, \" Get to da choppa!! \" and \" I aint got time to bleed \". I love to watch this film again and again.  9.15/10"
    },
    {
      "rating": "9",
      "text": "god what movie did the critics see? this is a movie i know alot of people like. granted its 80s cheesey over the top action with even cheesier lines but it holds up. some movies just have that ability to do that while other as they age get old smelly and moldy and unwachable this one how ever aged well. its a great idea for a film having a elite group of special forces go into the jungle to do a mission and run into a alien predator who hunts them down one by one . it has great action and is a fun roller coaster ride from start to finish . wish we could have learned more about the predator race is about my only gripe but other then that its a fun solid sci fi action film."
    },
    {
      "rating": "9",
      "text": "i must say that i really enjoyed this movie. firstly the movie was well performed by its cast and also the alien predator was played well as a hunter stalking its prey. the film delivers in suspense and action for its audience and i definitely would recommend it"
    },
    {
      "rating": "10",
      "text": "Not the greatest film ever, but certainly arnie's best, and a contender for my all time top ten list. A classic that gets better with every view."
    },
    {
      "rating": "10",
      "text": "memorable film, and easily the most terrifying and unstoppable extraterrestrial ever conceived. the metacritic score makes less sense than this: 8d'@~j843.'#[ewiuo389."
    },
    {
      "rating": "10",
      "text": "Wow I just can't believe the critic score on this one! This is one of the best sci-fi movies I've ever saw, and to this day this movie aged very well - almost 30 years passed (!!) and we rarely see so well made scifi movies. We have 2016 now and in december I havent seen anything released this year that would come near this one! After all these years its obvious - this is and will always be remembered as brilliant cult classic! 10 out of 10."
    },
    {
      "rating": "10",
      "text": "Behold!!! what the original expendables should have been. when you think about it, The Expendables was basically the same thing when you get down to the basic skeleton. a bunch of musclebound action stars led by Arnie fighting a threat none of them could be prepared for. the only difference is after all the fighting and ass kicking the team realizes there is a bigger threat out there and one by one they get picked off by an alien hunter with camouflage capabilities and weapons nobody could believe. Arnold ends up defeating it but by surprise he didn't kill it in the end, the predator kills itself when it saw no other way to win. this movie is so awesome that it makes me wish they left it alone and didn't make many sequels, having said that I am looking forward to The Predator this year which i will review after i see it."
    },
    {
      "rating": "8",
      "text": "It surprises me that this amazing action film has such a low metascore. Is it too unintelligent, \"dumb\" or stupid for you snooty movie critics. It's an amazing witty one-liner filled romp from start to finish"
    },
    {
      "rating": "10",
      "text": "You can't go wrong with an action classic that gave us an amazing sci-fi character in the Predator. It's everything you want in an action blockbuster."
    },
    {
      "rating": "8",
      "text": "Why the low score? Although this isn't a cinema masterpiece, it's a classic movie, and one of the few Schwarzenegger movies that isn't terrible. This is a cool film to watch, and I recommend it to any fans of action movies, Schwarzenegger or AVP."
    },
    {
      "rating": "10",
      "text": "It's amazing some of the best atomsphere ever pure testorone fueled action shows whats bad about modern action movies    Arnold delivers the role and there is a great sense of humour"
    },
    {
      "rating": "10",
      "text": "The poor critic reviews for this film are ridiculous. They say the movie is derivative, derivative of what? This, arguably the best Schwarzenegger action film, is what endless sequels and imitations have come from. One of the best films ever made."
    },
    {
      "rating": "10",
      "text": "Predator, one of the best action movie of all time, this movie has great special effects and great environment, and the story is very nice with some intense moments, some characters quotes are also pretty fun, really enjoy with my family and friends, can't still believe that got 36 of score, some people doesn't appreciate gold."
    },
    {
      "rating": "9",
      "text": "C mon professional critcs! It kicks! The movie is awesome, even for this days! Its a good quality production, and its all about action and surviving.. Sometimes that is all!"
    },
    {
      "rating": "9",
      "text": "A highly enjoyable movie, with action and a great plot, I had a blast watching this, and it's one I could watch over and over again, if your into this kind of thing it's one you should see."
    },
    {
      "rating": "9",
      "text": "The critic's score for this movie is frankly absurd! Predator is one of the best monster movies ever made, with only the first two Alien movies outperforming it. The setting is perfect, Arnie's squad of soldiers are well defined and memorable (elevating them far beyond monster-fodder) and the creature itself is a bonafide legend. My youth would not have been complete without Predator and the movie has stood the test of time with ease. An outright classic!"
    },
    {
      "rating": "9",
      "text": "No matter how many times you watch it, this is the only film you'll never ever get bored. Best action/thriller film so far. You wont feel like you are watching a 80's film. Trust me;)"
    },
    {
      "rating": "8",
      "text": "Expertly crafted film with just as many jaw-drop moments as there are seat-jumper moments."
    },
    {
      "rating": "9",
      "text": "This movie is definitely underrated by \"professional critics\" as this movie is awesome it has very different and unique characters that bounce off of each other so well creating some great dialogue sequences. The action in this movie is also great because it's not too \"over the top\" but it's also not extremely realistic."
    },
    {
      "rating": "9",
      "text": "Obviously something is seriously wrong with critics' mind as i don't know why they gave Predator such a low Metascore. This action-packed sci-fi movie is original and also very scary to some points. Tension remains constant throughout the entire film while simultaneously boasting solid performance from Arnold Schwarzenegger as a leader of a mercenary group fighting for a way out of the jungle in order to escape the invisible, deadly hunter they don't stand a chance of defeating"
    },
    {
      "rating": "10",
      "text": "Honestly. You want a film. You get a **** film. This is a brilliant, fast paced, action packed movie, full of twists, surprises, and as you'd expect from an Arnie film: a **** load of violence. Fantastic movie. You want to watch a movie, the critics are ****ed up in the head. I mean, Rambo First Blood got a **** 62% METASCORE! **** the critics. Watch this film."
    },
    {
      "rating": "8",
      "text": "Wait... the score is negative???  Oh yeah, this was before it got its cult following.  Either way, this is one of Arnold's action classics, and, even though the effects have aged pretty badly, it still remains a gripping, suspenseful action movie, with one of the coolest alien monsters ever put on film.  Arnold couldn't have said it better:  \"One... ugly mother f*cker...\"\r 8/10"
    },
    {
      "rating": "8",
      "text": "A Metascore of 36? I can't believe I'm the first to say this: Bunch of slack-jawed ****\rAt least the late Roger Ebert knew \"an effective action movie\" when he saw one."
    },
    {
      "rating": "9",
      "text": "Ticks all the boxes for the classic action movie.    ."
    },
    {
      "rating": "9",
      "text": "Whats't wrong with matacritc giving bad rating in here? 42? are you negatie reviewers kiding me? this movie is near to a classic masterpiece, people always seems to not appreciate the work they put into this film, Stan Winston, John Mctiernan and Kevin Peter Hall did a great job in bringing to life to one of the most iconic aliens on the big screen, not only that but they also had one of the most manliest badass team ever with some of the most memorable quotes of all time, and also the jokes worked really good on this film than the sequels or even modern action films that tries hard to have some comedy on it, and the score is well done by Alan Silvestri, the ending could've been better in my opinion but everything else was amazing. Without debut this is one of my fav films of all time. 9.2/10"
    },
    {
      "rating": "9",
      "text": "Excellent movie. Alien and Star Wars surpass it, but if no movies surpassed it, it would probably be a 10. I give it a 9.5/10, but metacritic won't let me score it that."
    },
    {
      "rating": "9",
      "text": "Brillant action movie. Great effects and weapons - the Predator itself is just awesome! Watched this so many times cos it is superb."
    },
    {
      "rating": "8",
      "text": "A simple movie in every way, but a superb cinema classic."
    },
    {
      "rating": "8",
      "text": "A magnificent exercise in sci-fi horror, only disliked by those who do not understand it. The cinematography is beautiful, and Schwarzenegger delivers a Schwarzenegger-ish performance, which is good for an action movie. It's not meant to be deep, or thought provoking, it's meant to be a good, scary action sci-fi endeavor. And it succeeds on all counts."
    },
    {
      "rating": "8",
      "text": "This movie is friggin' awesome! This is an Arnold Swartznegger action movie at its best. The Predator is also pretty freakin' sweet too."
    },
    {
      "rating": "9",
      "text": "Awesome movie, the story and characters are great. Predator rules!"
    },
    {
      "rating": "10",
      "text": "Its pretty sweet throughout."
    },
    {
      "rating": "10",
      "text": "An amazing movie that beats the hell out of alien and aliens. it is the best movie ever made."
    },
    {
      "rating": "10",
      "text": "A documentary on being badass."
    },
    {
      "rating": "9",
      "text": "They go in all balls and bravado, and leave in body bags. Classic action film."
    },
    {
      "rating": "10",
      "text": "Pure perfection even to this day."
    },
    {
      "rating": "10",
      "text": "This is how the phone call from my friend went before I went over to his to watch Predator, when I was 8 years old...Friend: Dude, you have to come over, my bro rented me this awesome film with Arnie in, and he has to fight an alien!Me: Really? I think I know it, my parents wouldn't let me watch it. Does the alien have a laser or something?Friend. Yeah, he has a big friggin laser on his shoulder. Me: Arnie, Aliens and lasers!? Dude I'll be right over!"
    },
    {
      "rating": "10",
      "text": "This was by far my favorite movie of all time. It is just something about a unstoppable alien going against the guy who has won Mr.Universe three times."
    },
    {
      "rating": "10",
      "text": "The best movie ever made - Action, soundtrack, story, characters, effects and pace. I've yet to see a better action film. Many have tried to copy but few have come close."
    },
    {
      "rating": "10",
      "text": "Predator is a thrilling, science-fiction action film, that stars the incomparable action star Arnold Schwarzenegger. Released in 1987, Predator has gone one to be one of the most widely-recognised sci-fi's of all-time. A team of highly-professional soldiers get dropped off by helicopters in which seems to be an easy mission dealing with guerillas. They're there to take them out but little do the realise the'll be getting picked out, one by-one by an Alien Warrior that's ship had crash-landed in the central-american jungle. Alan \"Dutch\" Schaefer played by Arnold Schwarzenegger leads the team of soldiers.\r This film's unmatchable in every way and still remains the greatest of all three solo Predator films and is far better than both Alien vs Predator films too. Schwarzenegger is the greatest and also, for the add, BIGGEST action star of all-time, so he really makes this film what it is. I love it in every way. The incredible shoot-locations, pretty awesome dialogue, Science-Fiction, violence, plot and more. It's all great. I rate Predator a 10/10 as it's my all-time favourite film. I love so many films, but Predator is definitely my favourite (alongside a few other, non-related films).\r A+, 10/10."
    },
    {
      "rating": "8",
      "text": "More than just another dumb '80s Schwarzenegger actioner, Predator has gradually become a sci-fi and action classic. It's not difficult to see why. John McTiernan's direction is claustrophobic, fluid and assured, staging the action with aplomb but concentrating just as much on tension and atmosphere.\r It's cheesy as hell, of course, but enormously entertaining and deeply cool, with a ton of quotable lines - 'I ainít got time to bleed' - while The Predator itself is an utterly unforgettable villain. But most bad guys are only as good as their heroes and, long before he became a shambling self-parody, Arnie delivers - and not just in the walking and talking without falling over sense. He's an awesomely indestructible figure here, at the height of his physical powers. He's the archetypal immovable force meeting an irresistible object. Only Arnie at his most iconic could convincingly defeat the Predator (as those who've seen Danny Glover in 'Predator 2' know).\r There's also something ironic in the climax, where immigrant Arnie - now fully embraced by the U.S. - kicks the tar out of a real illegal alien. We could go into the sexual subtext, but maybe we're just reading too much into it.\r A thumping piece of powerhouse cinema."
    },
    {
      "rating": "8",
      "text": "Wait, Metascore is 36/100?  WTF?  People are seriously not from this planet if 'critic reviewers' miss the whole point about Arnie movies... Its pure schtick, tongue in cheek machismo.  Pred is one of Arnies better flicks, certainly in the top 5.  Its not a Terminator, its not Conan the Barbarian, but it is heyday Arnie in his prime."
    },
    {
      "rating": "9",
      "text": "Really great effects, acting, action, just the ending could be better, but it really doesn't matter, I really enjoy this film, i'm big fan of this alien."
    },
    {
      "rating": "9",
      "text": "A great action/horror/scifi flick, intense and good action throughout shot well by the director of die hard. Arnie is great and there are some great one liners!"
    },
    {
      "rating": "10",
      "text": "La perfeccion hecha película, la mejor de la saga y una de las mejores peliculas de todos los tiempos"
    }
  ],
  "recommendations": [
    "rambo_last_blood",
    "the_terminator",
    "terminator_2_judgment_day",
    "the_expendables_2",
    "rambo_first_blood_part_ii",
    "godzilla_king_of_the_monsters",
    "the_scorpion_king",
    "predators",
    "edge_of_tomorrow",
    "transformers",
    "battle_los_angeles",
    "transformers_dark_of_the_moon",
    "mad_max_fury_road",
    "the_expendables",
    "hercules",
    "jaws",
    "predator_2",
    "underworld_awakening",
    "robocop",
    "the_mummy",
    "the_expendables_3",
    "riddick",
    "underworld",
    "kong_skull_island",
    "guardians_of_the_galaxy"
  ]
}