{"id": 1794, "title": "Predestination", "starring": ["Ethan Hawke", "Sarah Snook"], "runtime": 97, "genre": ["Science Fiction", "Thriller"], "description": "Predestination chronicles the life of a Temporal Agent sent on an intricate series of time-travel journeys designed to prevent future killers from committing their crimes. Now, on his final assignment, the Agent must stop the one criminal that has eluded him throughout time and prevent a devastating attack in which thousands of lives will be lost.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/yrrCDIuWYMA1AWyTd92pU3zvpoS.jpg", "categories": {"plot": 7.1125, "acting": 7.794871794871795, "ending": 7.25, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.0, "action": 6.444444444444445}, "reviews": [{"rating": "7", "text": "Predestination is an interesting story. Although it plays with your head with some confusing scenes. Like it's a surprise after a surprise. The movie is good but a little too confusing. It's worth a watch but just one time. Definitely worth a wait at Redbox or Netflix."}, {"rating": "8", "text": "Defying genre tropes, the character driven Predestination is an intellectually resolute sci-fi thriller that delivers a fun yet complex adventure even the twists are far too many and predictable."}, {"rating": "10", "text": "Fantastic! Despite lots of scenes of long dialogue, you want to hear everything they're saying, to understand what's going on. This was excellent maze writing taking you here, then taking you there, then back again. Ethan Hawke sure knows how to pick well-written stories that make a good movie. Of course, he's got the advantage of being a writer himself. My companion and I were glad we picked this movie over one from last night's Golden Globe winners, which was our original intention."}, {"rating": "7", "text": "Another success in the recent surge of critically acclaimed Australian genre films (The Babadook, Tracks, to name a few), Predestination combines the narrative ball-of-yarn complexity of Looper and The Terminator with the race/gender transgressing themes of Cloud Atlas to make for a fairly distinctive, if a bit slight and thematically-absent time-travel film. In execution, Predestination has many of the qualities of the films of Christopher Nolan, both good and bad. On one hand, it is stylishly presented and sets its sights, at least somewhat, on the human element behind sci-fi genre-films. On the other hand, it can also feel needlessly complex, silly, and self important (at times). If you are like me, someone who takes time-travel films as an intricate puzzle meant to be dissected from the first frame that hits the screen, Predestination will unravel, sadly, much sooner than you may hope, considering all the good will and attention to detail paid to making sure the paradoxes don't collide. Spoilers for this next section. Where Predestination engages you most is in the portion of the story devoted to John/Jane making sure that John/Jane 'exists', simultaneously becoming his own mother, father, daughter, and son, as well as teacher, guardian, and saboteur. The concept checks out upon retrospection in a 'The Terminator\" style paradox and is decently surprising, though I saw all of this coming fairly early on. One of the errs that ails Predestination from the very start is how the expositional dialogue and often blunt explanation of events doesn't make us work hard enough to make completing 'the puzzle' much more than satisfyingly engaging, when it could have been head-scratchingly abstract and required more retrospection, or even repeated viewings, which I don't feel the desire to make. Predestination's use of transgender dysphoria melodrama as the pivotal driving narrative involves a plotline that is fairly cliched and contians no new insight into what it means to be someone of intersex orientation, though it does provide the quality that currently sets it apart from other time-travel yarns. Where I take up issue with Predestination is how little the mind-boggling story really touches on any important undercurrent of emotion that other sci-fi head-strainers like Looper manage to without losing narrative propulsion. John's mission is to stop disasters from occurring through the use of time travel. However, the primary job at hand (preventing a massive detonation in New York, killing 10,000+ civilians) is the only one that Predestination sets its sights on. We have no background as to his past accomplishments as a temporal agent, making his character's importance unnecessarily limited in scope, even though we are convinced that he is this savior of mankind. Plus, in a final minute (supposed) mindfuq, John is forced to play the role of both hero and villain, an ambition intended to fry the brain and maybe distort the audience's sense of sympathy, but instead leaves a feeling of indifference, as it comes across solely as a final act of needless complication, an aspect the filmmakers may feel obligatory for time-travel films at this point in the genre. The more complex, the better right? Yes, but only when it coheres on, not only a plot-driven, but also a character-motivation, level. John's final justification for the bombing could be explained due to the debilitating effects of time-travel on the brain, but is executed in a way that feels cursory at best (and frustratingly brief at worst). Until that unsatisfying denouement, however, the character's motivations feel realistic enough and the narrative is, though a bit obvious at times, quite engaging. Also, something I haven't touched on at all up until this point (but demands to be lauded) is Sarah Snook's fantastic gender-transgressing performance as the young Jane/John. Her display of both male and female characteristics is in equal measure quite remarkable. Though her voice doesn't quite register as completely masculine, there is a scene where she acknowledges that she never quite learned how to speak like a man, an element of self-awareness that recognizes that the only aspects limiting her from portraying a man more realistically are simply because she is, well, a woman. On the whole, I have gone more in depth for this review than I intended and, without overwhelming with any further text, Predestination is a solid time travel film and makes an even more enticing case for the continued production of movies in Australia."}, {"rating": "8", "text": "Predestination is unique, compelling, and truly captivating science fiction that throws you for a loop from beginning to end. Ethan Hawke and Sarah Snook are magnetizing in this odd science fiction/fantasy film that is a time travel movie, but uses it in incredibly unique fashions that constantly leave you guessing. While the final reveal is obvious to anyone putting the pieces together, it only clarifies within the last half hour so it is not like the entire film is predictable. That said, the entire film is a bit of a trip and likely contradicts itself (as most time travel movies do), but is a truly enthralling flick that wraps you up in its world and does not let go until the very end. All together, Predestination is an incredibly thought provoking film that keeps you guessing and trying to put together its crazy puzzle."}, {"rating": "8", "text": "This is a very unique thought provoking film that you won't soon forget.  After just watching this film I still can't explain everything, but that's okay because the look and feel of this film works from start to finish.  A-"}, {"rating": "9", "text": "Simply one of the best time-travel movies ever.  Some people I know thought the movie dragged on in the beginning, but I found it interesting for most parts and then halfway through, it becomes an unforgettable exhilarating experience.  The pure genius in how this plot was expanded from the original script is amazing and all the acting involved is spectacular.  There's really nothing wrong with this movie unless you want a more anthem-style soundtrack and a faster introduction.  Normally I hate movies but this is an example of what movies can do."}, {"rating": "8", "text": "Predestination is an intense, interesting and complex movie about time traveling, handled professionally and strong. Sarah Snook shines against Ethan Hawke."}, {"rating": "7", "text": "Intriguing and complicated film with an interesting take on time travel and gender roles, it's full of complex twist and turns and also plays out as a great mystery. It's very well acted and smoothly directed and a serious mind **** Overall very entertaining."}, {"rating": "8", "text": "Superb! A weaving plot combined with a sound performance by Ethan Hawke made for a suspense filled experience. While the action sequences were ok, the sublte dialogue as well as the intense characterisation elevates this sci fi flick to something of true note.\rSlightly repetitive in patches and it occasionally dragged on a bit. Overall, the score, dialogue and plot carries this through. No doubt one of the smarter movies of the decade."}, {"rating": "7", "text": "¡This movie is awesome! It's based on the short story \"All you, zombies\" by Robert A. Heinlein. I had the luck to read that before I even know this movie existed, and I really enjoyed it, and now that I saw the movie, I also liked very much. The movie is about time travel, and the whole story is based in a paradox, solved with expertise.\rThe acting is great (mainly by Sarah Snook), the directing is just excellent, and most important, it makes you think. The movie is not so easy to understand by someone who hasn't read the short story. It'll make you keep thinking about it, attaching strings, way after you're done watching it.\rSome may say that this film is boring and slow, but I don't, I liked it very much, it's an excellent sci-fi movie."}, {"rating": "9", "text": "Predestination just blew my mind. I didn't really know what to expect when I watched the film, since I wasn't familiar with the Robert A. Heinlein's source material. The trailers were good but a little weak and now that I've seen the movie I understand why.\r Predestination is smart. Every piece of the puzzle is perfectly laid out so that the story pulls you in slowly, keeping your mind in sort of lazer sharp focus because it's a time-travel movie and usually that's what you need to understand these movies. But in this case that is exactly what will get you fooled.\rFrom start to finish, I was so into the story that the craziest of possibilities escaped me. I ate everything they fed me and was left dumbfounded once the story unfolded. I am doing my best not to spoil because the movie is an experience that I would encourage anyone to have. Predestination surpasses expectations and carefully untangles a knotted storyline that will slowly start to take all of its tragic, dramatic sense.\rEverything makes sense, it all ties together and the same thing goes for the cast, Ethan Hawke, Sarah Snook, and Noah Taylor are amazing. Each of them bring something specific to the table, creating this tight knit story that left me reevaluating everything I saw once an untangled knot in the storyline took its meaning. Sarah Snook & Ethan Hawke's performances brought real emotional weight to the characters they're playing. Particularly, Sarah Snook whose character could have drag this movie down the drain if she wasn't utterly convincing.\r The sci-fi aspects aside Predestination also touches so many current subjects and could be interpreted and/or seen in so many ways. The story becomes about Jane's emotional journey and her transition into a man and throughout life. There is also something to be said about loving and accepting yourself in the movie but I can't go too deep into that without spoilers.\r Peter and Michael Spierig delivered a methodical, almost anal retentive film. It's intense, a bit contrite but it's a good film. Predestination is a great take on time travel and fate. A thought-provoking film with an entertaining and complex storyline lead by a great cast.\r @wornoutspines"}, {"rating": "10", "text": "A sci-fi mind-screw that is rarely short on surprises and innovative ways.Ethan Hawke, Noah Taylor and Sarah Snook all give terrific performances .predestenation is an and less loop with break through perfomance from sarah snook"}, {"rating": "9", "text": "It took me a while well actually it took me forever to get around and watch this movie and I'm a bit disappointing...that I didn't watch this sooner.\r The story to Predestination is about a order to ensure his law enforcement career for all time, a temporal agent must navigate an intricate set of time-travel journeys. But his final assignment pits him against the one man who has eluded him in all times - but to protect his future, he will finally have to stop him.\r The reason why I didn't get around to seeing this is because I didn't know nothing about it and I have seen different reviews by critics and YouTube Reviewers that didn't make sound anything that interesting so I didn't bother with it. When I was on the plane to New Zealand for a holiday you get those little TV's in front of you that can play TV shows and movies and guest what was playing, yep this movie so I just thought \"F**k it\" and checked it out since it was a long flight and never again will I put a movie to the side, because Predestination is not just good it's freaking great.\r The directors of the movie Michael Spierig and Peter Spierig who did the 2010 film Day Breakers which by the way I thought was okay and in this movie the two directors did a great job telling a story with it's twist and turns and keeping my interest till the end.\r Ethan Hawke once again brings a great performance in this movie just like in every movie that he's in and in this one there's no difference.\r Sarah Snook to me is a unknown star, I haven't seen her in any other movies just this one and let me tell you that this actress needs to be in more stuff because Sarah Snook did an outstanding performance in this movie that most of the movie she carried it.\r Some people may have predicted the ending to the film but I didn't and I thought it was a really good twist, to those who disagree that's fine but remember it could have been a stupid twist like in some movies today that try to have edge to it's twist or it could have have been way to predictable. Just be grateful.\r Now for problems and these not a lot but if I have to be nick pick I would say that the movie should have started with Ethan Hawke and Sarah Snook character at the bar talking to each other, because if you have seen the movie you know how the movie starts with the big action but as I said before I would have liked it if it started with Ethan Hawke and Sarah Snook character at the bar.\r Besides that the movie overall is worth checking out. The writing was smart, the acting was all good and it may not get the attention that it deserves but it will one day."}, {"rating": "7", "text": "This movie tries really hard to be smart and brainy, but near half of it you realize: hey, I know this guy is everyone, it's a time travel movie, and he's the ultimate paradox, like every time travel movie since terminator.  The small cast gives the movie an intimate tone, keeps you interested, but since you know what's going on, the movie doesn't matter anymore. The girl, Freya, Is a perfect 10. I don't know how she is not in bigger movies and roles."}, {"rating": "9", "text": "A not-so-action film that make the fun with the complex logic behind time travel and the interacting with the past. A \"must watch twice\" type of film. My personal tip for the film is: don't get bored the first half, but pay attention and you'll enjoy the second half way more."}, {"rating": "7", "text": "packs a powerful emotional punch thanks to its sensitive treatment of emotive themes and an incredible, multi-layered performance from Sarah Snook.\r Check out this movie here http://www.watchfree.to/watch-2a08ee-Predestination-movie-online-free-putlocker.html"}, {"rating": "8", "text": "Predestination is sold as a science fiction work and it is, but its background is much deeper and realized, although it has its faults, I honestly enjoyed, especially if you pay attention."}, {"rating": "9", "text": "Predestination is a good title because this movie is quite the trip. It's retrospective for the first half and then changes gears into a great sci-fi flick. Ethan Hawke is good and Sarah Snook is brilliant. This is the Spierig brothers most realized film. If they start churning out movies of this quality, I will be one happy film goer."}, {"rating": "8", "text": "Anyone who goes to see Predestination on the strength of the trailer alone will find their patience tested by a large portion of the movie which will leave you wondering what's going on. Your patience will be more than rewarded though.\r This is the first movie I think I've ever watched that I wanted to immediately watch again {to see if I had actually made sense of it all!}. Highly recommended."}, {"rating": "8", "text": "This is a fine example of an underrated and surprisingly great sci-fi movie.\r I thought this would be a boring and a less impressive time travel movie. But holy **** were I wrong. This is in fact a classic among all time-travel movies, even though it’s not 100 % original. The structure of Predestination is in fact a bit similar with Christopher Nolan and his creations, which gives your brain something to work with. That gives the audience more interest for the movie and it totally got mine. The science fiction is superb, and the movie even got some metaphorical and deep messages. The actors and their characters are all great, especially Ethan Hawke. I have never liked him more than I in Predestination. The characters are very well presented, and you can feel yourself in their positions. You can therefor feel very close to them. The first act is more of a backstory and I think it’s great. But it wasn’t until the second act it really got tempo. The ending however is wonderful. It got a great plot twist, and the movie overall is never boring. The biggest flaw in this movie is that after the first act could I predict some of the following events, and I had mostly right.\r Predestination totally surpassed my expectations, and it truly is one of the best movies of 2014.\r Predestination gets an 8/10."}, {"rating": "9", "text": "If you are a fan of a good Sci Fi yarn, you will not be disappointed with this movie. It was well worth the price of the rental and Hawke does an admirable job driving the story forward."}, {"rating": "10", "text": "One of the very best sci-fi movies I have ever seen, and I mean real sci-fi, not cowboys in space ships. A rare well-written well acted story. The blurb makes it sound like Minority Report but, despite the same general premise, it could not be more different. Captivating from start to finish. I cannot recommend it highly enough. Check my other reviews to see how many 10s I've given. I'll tell you. I've rated 44 movies on Metacritic and given 3 of them a rating of 10 including this movie. For the record, the other two are Blue Jasmine and Cinderella Man. In any event Predestination is a great flick. Worth purchasing rather than just renting.\r P.S. The same creative forces were behind 'Daybreak's' but that film does not hold a candle to Predestination. Daybreakers, though novel, just the same felt familiar, even old hat, been there done that, and was full of stock characters and special effects that tried way too hard to overcome the story's shortcomings. Daybreaks only wasted my time, but Predestination was a gift."}, {"rating": "8", "text": "Predestination just blew my mind. I didn't really know what to expect when I watched the film, since I wasn't familiar with the Robert A. Heinlein's source material. The trailers were good but a little weak and now that I've seen the movie I understand why.\r Predestination is smart. Every piece of the puzzle is perfectly laid out so that the story pulls you in slowly, keeping your mind in sort of lazer sharp focus because it's a time-travel movie and usually that's what you need to understand these movies. But in this case that is exactly what will get you fooled.\rFrom start to finish, I was so into the story that the craziest of possibilities escaped me. I ate everything they fed me and was left dumbfounded once the story unfolded. I am doing my best not to spoil because the movie is an experience that I would encourage anyone to have. Predestination surpasses expectations and carefully untangles a knotted storyline that will slowly start to take all of its tragic, dramatic sense.\rEverything makes sense, it all ties together and the same thing goes for the cast, Ethan Hawke, Sarah Snook, and Noah Taylor are amazing. Each of them bring something specific to the table, creating this tight knit story that left me reevaluating everything I saw once an untangled knot in the storyline took its meaning. Sarah Snook & Ethan Hawke's performances brought real emotional weight to the characters they're playing. Particularly, Sarah Snook whose character could have drag this movie down the drain if she wasn't utterly convincing.\r The sci-fi aspects aside Predestination also touches so many current subjects and could be interpreted and/or seen in so many ways. The story becomes about Jane's emotional journey and her transition into a man and throughout life. There is also something to be said about loving and accepting yourself in the movie but I can't go too deep into that without spoilers.\r Peter and Michael Spierig delivered a methodical, almost anal retentive film. It's intense, a bit contrite but it's a good film. Predestination is a great take on time travel and fate. A thought-provoking film with an entertaining and complex storyline lead by a great cast."}, {"rating": "10", "text": "Predestination is an excellent, well written, masterfully acted and a well paced flick. Ethan Hawke gives an awesome performance. Its a major mind bending trip that is very underrated. A must watch."}, {"rating": "9", "text": "this was actually a pretty good movie. maybe the best this year. it had a really good story and although the cat were not so famous but they played really good.\rif you like to get mind fu..ed this is the one for you!"}, {"rating": "6", "text": "This film seeks to explore, reductio ad absurdum, the difficulties imposed on the time-travel genre by a phenomenon generally known as “the grandfather paradox.” This is the problem that arises if one goes back into time and commits an action that prevents one’s own birth, such as killing one’s own grandfather, but it can also be more liberally applied to any action committed after traveling back into time that may affect the initial action that was taken to go back into time. So, if I travel back before my birth and kill my grandfather before my mother is conceived, I won’t be born; therefore I was not present to make the decision to go back into time to kill my grandfather. Not being there to commit that crime means my mother was born, after all, which means I was born and the loop starts all over again.\r Many scientists, novelists, and filmmakers have sought to work around and somehow resolve the grandfather paradox. The only explanations that make sense are the ones that claim we can only back into time to a parallel universe, where we change history in the parallel universe, but the universe we live in stays the same. However, the Spierig Brothers, who wrote and directed the film, have decided to go to Hades in a handbasket and to fly in the face of everyone whoever had a logical thought about cause and effect. Their hero, the bartender played by Ethan Hawke, works for a company that sends him into the past at regular intervals to prevent heinous crimes. They can only make short time jumps, because long jumps damage the mind and cause insanity. Hawke’s character has already made one jump too many, and has taken an unauthorized jump outside the allotted zone, so his mind is warped by time, so to speak, and he is trying to find out the identity of a man called the Fizzle Bomber, who in 1975 kills 10,000 people in New York City with one bomb.\r I would yell spoiler alert, but the spoiler is so bizarre, that as one critic put it, you’re left at the end yelling, WTF??? So here’s the spoiler—the bartender/time agent is awaiting the entrance of someone he knows is coming in for a drink, because it’s John, his younger self. John is a transsexual, who was once a girl named Jane who was a baby left on the doorstep of an orphanage. She was born with weird internal wiring, both male and female, but was only aware of her female parts. Then Jane met a stranger one night, who was John traveling in time, lost her virginity, and had the baby alone because John suddenly left her sitting forever on a park bench. After a C-section, complications demanded that the female parts be taken out and the male parts extended. Jane became John. And John comes in the bar telling Ethan Hawke (who is John’s older self looking much different because of facial reconstruction after almost being burned to death) about how the mysterious male left him to have a baby that was later stolen from the hospital. That same baby was delivered to the orphanage, and was named Jane. Yes, that’s right, John, Jane, the baby and the bartender are all the same person, traveling through time, meeting up with each other, and having unorthodox relationships with themselves.\r I know you’re asking why didn’t Jane recognize herself after she became John as her own lover who deserted her? There she was, clearly looking at John in the mirror after her sex conversion, but he/she is sitting in the bar telling Ethan Hawke she never saw John again after he left her on the park bench. Her transsexual conversion turned her into John, and she didn’t notice? She apparently had no recollection of what time-traveling John, her future self and past lover, looked like. Maybe memory loss occurs after gender conversion. Anyway, Ethan Hawke’s bartender keeps reliving this scenario because he’s continually going back into time to find the Fizzle Bomber. Finally, he retires from the firm to the year 1975 in NYC, just before the Fizzle Bomber pulls off his major coup, and he finds the Fizzle Bomber, looking very aged and very crazy, sitting in a laundry mat. And guess who it is?\r I think the Spierig Brothers are poking fun at the grandfather paradox. At one point, Ethan Hawke’s character bounds down the stairs to the bar’s basement, and he sings a line from a rather tuneless song: “I’m my own grandfather...” That was a clue. Instead of being his own grandfather, he’s actually his own mother, father, and grandfather. Who spawned the first version of Ethan Hawke’s character? No one knows. They’re stuck in an endless loop like “a snake eating its own tail.”\r Ethan Hawke does a remarkable job at making this senseless scenario interesting, and Sarah Snook is equally brilliant at playing both Jane and John. And all those physicists out there who are working hard to resolve the grandfather paradox can clearly stick it in their ear, courtesy of the Spierig Brothers."}, {"rating": "9", "text": "This movie encapsulates narcissism perfectly.   In the form of a mystery sci-fi thriller drama, it brilliantly masks its true intentions.  Great suspense, not-so-easy-to-predict plot twists, good (if not great) acting, and well filmed action sequences make this movie both fun to watch and intellectually stimulating.  That is a rare combination indeed.  I recommend it 100%  {Question for others: Is the main guy actually shim too?}"}, {"rating": "0", "text": "I made it 8 minutes into this movie before Ethan Hawke's blandness made me want to bash my head against the desk just to stay awake. One of the early scenes involves a woman confessing that she is indeed a woman, like we're supposed to be wowed by this revelation just because she's dressed as a man and is incredibly butch. Seeing as that's the kind of condescending nonsense I felt I was in for, I jumped ship."}, {"rating": "8", "text": "What a ride! This is the story of a temporal agent who's playing a ridiculously complex game across space and time in order to stop a terrorist attack, all the while raising questions about predetermined fate and inescapable realities. Certain twists and reveals are incredibly obvious, but even when you can clearly tell where things are going next where they'll ultimately end up and what the point of it all will have been when it gets there are another matter entirely. That's what will keep you watching.In fact, the meaning of this has completely eluded me. Is it simply a way of showing off a cool paradox someone came up with? A parable on the ultimate narcissism trip? Maybe it's just about how time travel makes no freaking sense. Whatever the case it gets you thinking in ways I can't elaborate on without spoiling things that need to be seen for yourself. Like how the movie starts off as one thing before turning into something wholly different.There are people who will find this too outlandish, weird, and complex in a convoluted feeling way (largely because of their own lack of understanding). Yet, those who really enjoy when movies push the science aspect of science-fiction and use them to deliver experiences with genuine depth are sure to find this to be a worthwhile viewing. For me, it stands alongside the likes of Ex Machina and Under the Skin as a particularly rich, compelling, and unique entry in the genre that has stuck and will continue to stick with me for quite some time. The only difference being that it comes from a pair of directors nowhere near as respected as Jonathan Glazer or Alex Garland. Showing that even names typically associated with schlock are more than capable of dropping a gem despite their reputation.8.3/10"}, {"rating": "5", "text": "Really disappointed with this film, in fact I haven't felt so cheated since I saw \"Prometheus\". There were so many WTF moments and suspensions of disbelief that it all became ridiculous way before the \"twist\" at the end. First off, Sarah Snook has to be the least convincing \"man\" I have seen in a movie. Putting on a jacket and trousers and applying a bit of stubble then saying \"Hey! I'm a guy!\" just doesn't cut it, I'm afraid. Remember Robin Williams in Mrs Doubtfire? Dustin Hoffman in Tootsie? Both far more convincing as women than Sarah Snook is as a guy. The film started off in a really boring way with \"John\" telling his random life story to a bartender (as you would). Of course the bartender was able to sit and listen for what seemed like 45 minutes (obviously a very slow day at work). Then all of a sudden it's \"Hey, you know what? As it happens I can travel through time, here's a gun to murder someone in the past! Come with me!\". So then the story actually begins and we find that \"John\" is actually \"Jane\" in the future and instead of killing the person who broke \"Janes\" heart (as of course it someone lets you down in live it's acceptable to murder them) we find that John falls in love with himself as Jane (as you would). Of course you would do that, wouldn't you? All in the space on an hour as well. Of and John makes love to Jane (calling Dr Freud!) and they have a baby who is actually baby Jane who is taken to the past by Ethan Hawke (who, you guessed it, is John and Jane as well) for the circle to be complete. The smoking man who runs everything also pops up quite a lot as well, but mainly to explain the difficult bits for the audience. The whole thing about Jane/John having two sets of internal organs (and not knowing) and sitting up in bed, fresh faced, after the birth having been completely rewired was ridiculous. She kept saying she couldn't look at herself for a long time was also stupid, as people look at themselves dozens of times every day. You just can't avoid it.\r What was a shame about this film was that there seemed to be a couple of much better films trying to get out. The whole \"training Jane\" sequence at Space Corps was intriguing and visually striking, reminding me of Gattaca. Out of interest, why did she go from being top of her class, incredibly physically tough, chosen for an elite government agency, top 1%, etc, to doing menial work such flipping burgers and becoming a live in nanny afterwards? Another part of the film that just didn't make any sense. I was intrigued by the fizzle bomber but this was never explored. Out of interest, how can someone who makes their own bombs in 1975 make something with enough explosive power to obliterate 10 city blocks and kill 10,000 people?\r The idea of going back in time to prevent crimes before they happen and eliminate criminals has been done much better than this (Looper). Overall there was far too much suspension of disbelief and unplausible coincidences to make this film work for me. And please, if you have a character who is a guy have a guy actor play actually them."}, {"rating": "4", "text": "This is based on a short story and there just wasn't enough to justify a full-length film. To get to 90 minutes the script filled up the first 45 minutes with an awful lot of back story that got really boring. And then it just got nonsensical. Production values were OK. Weird story."}, {"rating": "5", "text": "A mixture of every sci-fi time travel film you've seen before. You've been there, seen it, done it already. That's the audience's predestination. Well-acted, but empty. Easy viewing."}, {"rating": "10", "text": "Itsbest movie that i have seen  after inception, i think that only can be make for a genius... awesome...\rThis is the first movie I think I've ever watched that I wanted to immediately watch again {to see if I had actually made sense of it all!}. Highly recommended."}, {"rating": "0", "text": "When I bought my movie ticket I though I was seeing a Sci-Fi about time travel.  The first scene before the credits showed some action in which something resembling a time machine was present.  What followed for the next half of the film was a story told to Hawkes at his job as a bartender, going into the life story of one gender confused woman to apparently set up the story.  Unfortunately, I did not see that time travel story due to walking out.  With so much time devoted to the set up, this movie (or what I saw of it) more closely resembled one of those night time soaps that my ex wife used to enjoy.  Thumbs down for the first half, can't comment on the second."}, {"rating": "5", "text": "That's yet another stylish new age time travel movie based on Robert Heinlein's 1958 short story \"All you zombies\". The movie is awarded with several Australian awards but tries to be too clever for it's own good.\rFirst of all, while the title of the short story actually makes sense in a clever way, the title of the movie is plain and stupid, as it reveals the plot of the film, which is largely based on the predestination time travel paradox. The big twist of the ending is easily foreseen and is moronic and disturbing (I'm keeping myself from revealing it right now so that you don't have to watch the film at all). I'm rating this film with C- only because it's (too) ambitious and well directed, easily watchable and cause I like Ethan Hawke's tendency to participate in B movies. It's fun to watch but disappointing in the end, so if you are picky with your films avoid it."}, {"rating": "0", "text": "An awfully directed and thought-out film full of contradictions and plot holes, which the director clearly expects to pass off as a \"mindf*ck\". This, however, only works on extremely skilled suspenders of disbelief or generally not very thoughtful people. A great candidate for the worst movie I have ever seen."}, {"rating": "1", "text": "If there was ever a movie that went out to a public park and removed its trousers then took a long deep sh*t on an idea (such as time travel) that people love and believe in, then is the movie is the one.I've never felt disgusted after watching a film than i felt with this one, if i was there in the premier i would have puked!. Unbelieveable!"}, {"rating": "8", "text": "donnydark:  Anybody who reviews a movie without actually seeing the movie is an idiot.  I'm sorry to be so negative, but I've seen this so often and it really irks me.  Reviewing anything which a person has no or very little knowledge of takes a special kind of stupid.  How about listening to the story?  Instead of going into a movie with the idea of what you want it to be, try to get into what it is.  It starred Ethan Hawke.  Were you expecting fluffy?  He doesn't do fluffy.  His are usually thinkers.  Which is why his movies are so good.donnydark, and anybody else:  If you've not seen the movie in its entirety, or not read a book, or not eaten at a certain restaurant - don't review it.By the way - I've given the movie an 8.  I found it intriguing from the start.  Even the \"setup.\""}, {"rating": "6", "text": "Putting things simple, this movie is an adaptation of Robert Heinlein's (pretty amazing) short story \"All you zombies\". I mean literally, the 1,5-hour long movie's plot dedicates around an hour to meticulous depiction of the events of the short story and then proceeds with around half an hour of original script with a VERY predictable plot twist. Now I have to admit, the scriptwriters did a fairly good job adapting a story that's only 10 or so pages long into a full length feature film, but the original story's impact solely depends on the final twist, and the movie merely copies it, so reading the original prior to watching the adaptation eliminates a great deal of positive impression.\rIn other words: if you have not read \"All you zombies\", you will probably enjoy this movie and it will bend your mind quite a bit. (Although you can save yourself an hour of time and possibly some money by reading the original story. It's really short, but is as impressive.) If you have, however, you will find almost nothing new here, and you might as well start watching this film from around an hour in. Since I did read the story, I give it only a 6. If I hadn't done this, my score would've been higher, around 8 I suppose."}, {"rating": "8", "text": "Maybe I'm just a sucker for time travel flicks, but this movie will pull your brain out, f*** it raw, and shove it back in your skull. As long as you can deal with the dialogue-heavy presentation."}, {"rating": "8", "text": "OK, it's about time-travel.  It does time-travel in a way like I've never seen before.  Can't really say anything about the how or the what without giving things away.  Overall, the film's pretty focused on character and not so much on action, so if seeing the weird and how people deal is your thing then this is a film you should catch.The film also asks if the ends justify the means.  But I guess that's for each one of us to work out for ourselves."}, {"rating": "6", "text": "Another success in the recent surge of critically acclaimed Australian genre films (The Babadook, Tracks, to name a few), Predestination combines the narrative ball-of-yarn complexity of Looper and The Terminator with the race/gender transgressing themes of Cloud Atlas to make for a fairly distinctive, if a bit slight and thematically-absent time-travel film.\r In execution, Predestination has many of the qualities of the films of Christopher Nolan, both good and bad. On one hand, it is stylishly presented and sets its sights, at least somewhat, on the human element behind sci-fi genre-films. On the other hand, it can also feel needlessly complex, silly, and self important (at times).\r If you are like me, someone who takes time-travel films as an intricate puzzle meant to be dissected from the first frame that hits the screen, Predestination will unravel, sadly, much sooner than you may hope, considering all the good will and attention to detail paid to making sure the paradoxes don't collide.\r Spoilers for this next section. Where Predestination engages you most is in the portion of the story devoted to John/Jane making sure that John/Jane 'exists', simultaneously becoming his own mother, father, daughter, and son, as well as teacher, guardian, and saboteur. The concept checks out upon retrospection in a 'The Terminator\" style paradox and is decently surprising, though I saw all of this coming fairly early on.\r One of the errs that ails Predestination from the very start is how the expositional dialogue and often blunt explanation of events doesn't make us work hard enough to make completing 'the puzzle' much more than satisfyingly engaging, when it could have been head-scratchingly abstract and required more retrospection, or even repeated viewings, which I don't feel the desire to make.\r Predestination's use of transgender dysphoria melodrama as the pivotal driving narrative involves a plotline that is fairly cliched and contians no new insight into what it means to be someone of intersex orientation, though it does provide the quality that currently sets it apart from other time-travel yarns. Where I take up issue with Predestination is how little the mind-boggling story really touches on any important undercurrent of emotion that other sci-fi head-strainers like Looper manage to without losing narrative propulsion.\r John's mission is to stop disasters from occurring through the use of time travel. However, the primary job at hand (preventing a massive detonation in New York, killing 10,000+ civilians) is the only one that Predestination sets its sights on. We have no background as to his past accomplishments as a temporal agent, making his character's importance unnecessarily limited in scope, even though we are convinced that he is this savior of mankind.\r In a final minute (supposed) mindfuq, John is forced to play the role of both hero and villain, an ambition intended to fry the brain and maybe distort the audience's sense of sympathy, but instead leaves a feeling of indifference, as it comes across solely as a final act of needless complication, an aspect the filmmakers may feel obligatory for time-travel films at this point in the genre. The more complex, the better right? Yes, but only when it coheres on, not only a plot-driven, but also a character-motivation, level. John's final justification for the bombing could be explained due to the debilitating effects of time-travel on the brain, but is executed in a way that feels cursory at best (and frustratingly brief at worst).\r Until that unsatisfying denouement, however, the character's motivations feel realistic enough and the narrative is, though a bit obvious at times, quite engaging. Also, something I haven't touched on at all up until this point (but demands to be lauded) is Sarah Snook's fantastic gender-transgressing performance as the young Jane/John. Her display of both male and female characteristics is in equal measure quite remarkable. Though her voice doesn't quite register as completely masculine, there is a scene where she acknowledges that she never quite learned how to speak like a man, an element of self-awareness that recognizes that the only aspects limiting her from portraying a man more realistically are simply because she is, well, a woman.\r On the whole, I have gone more in depth for this review than I intended and, without overwhelming with any further text, Predestination is a solid time travel film and makes an even more enticing case for the continued production of genre movies in Australia."}, {"rating": "9", "text": "Quizás no es la mejor película, pero es una obligación si te encantan las historias basadas en viajes en el tiempo y paradojas temporales."}, {"rating": "9", "text": "Predestination is one of the best time loop films. Predestination harmonizes well between showmanship and the scientific component. It is moderately difficult for an ordinary viewer, storylines can be understood by the viewer with a single viewing. A normal cast and a perfectly built plot that leaves no white spots in the plot. This should be the modern Sci-Fi. The viewer should at the beginning feel stupid, not understanding how everything works, but get all the answers for himself at the end. Predestination can definitely be recommended for everyone to watch, such films do not often come out to ignore them."}, {"rating": "7", "text": "Daha önce başka bir yerde konusunu gördüğüm fakat izlerken yine \"ne oluyor\" dediğim bir film. Kafanızı karıştırıyor ve büyük bir paradoks'un içine sokuyor sizi. Başta ki bar sahnesinden sıkılabilirsiniz fakat sonrası gerçekten akıcı bir şekilde geçiyor ve hayret içerisinde izliyorsunuz."}, {"rating": "6", "text": "m gemächlichen Zeitreise-Krimi Predestination springt ein Zeitagent (Ethan Hawke) zur Terror-Prophylaxe durch die Dekaden. Auf der Spur des Sprengstoff-Attentäters “Fizzle Bomber” trifft er 1975 in Barmann-Tarnung auf John (Sarah Snook), der ihm über sein Leben als Frau, Geheimagent sowie seine verschwundene Liebe erzählt. Doch was hat das alles mit dem Barkeeper zu tun? Predestination kommt nur langsam in die Gänge und schreckt mit einer wirren, etwas hanebüchenen Geschichte ab. Die fasziniert jedoch im Filmverlauf und mündet in einem Finale, das Fans von 12 Monkeys und unglaublichen Twists mit der Zunge schnalzen lässt. Obendrein untermalt eine stilvolle Film-noir-Optik das Geschehen passend – im Gegensatz zum übertrieben dramatischen Score."}, {"rating": "8", "text": "فیلم روایت یک دور است به قول شخصیت اصلی ماجرا ماری که دارد دم خودش را میخورد این دور اما با روایتی نا منظم از زمان تلفیق شده است تا بیننده را با هیجان بر صندلی میخکوب کند"}, {"rating": "6", "text": "A Guy Walks Into A Bar.PredestinationSpierig Brothers are creating havoc on screen as far as they are teasing us with the romance. And there is a whole lot of electric charge between Ethan Hawke and Sarah Snook. So innocently sinister is their love, that it describes the entire film within that one conversation. To be fair that one conversation takes most of the time, in fact the first half, but this has always been Hawke's forte. There is no one that can talk like him on screen. He looks at her with an attractive fire in his eyes and you sink deep in the film. The Spierig Brother, screenwriters and directors, are playing a safe game by doing so, since the rest of the film is a basic time jump from one place to another, the first half is soothingly calm and harrowing equally.Sarah Snook that goes through a physical transformation is exceptionally good in her portrayal to a degree that she challenges Hawke blatantly when they go head to head in a bar. There aren't any big themes explored in here, just so that if you are expecting, which works surprisingly in its favor. As we have experienced before too, in order to do so, it can come off as a big misconstrued hotchpotch that dulls our palette.It promises an engaging time travelling adventure and that's what this thrilling ride offers, strong in its believable mythology, it hits hard and fast. This loopity-loop screenplay obviously comes handy with a hindrance in the structure that is ironically its most valuable asset in order to reboot one's mindset, a refreshing take on the whole time travelling religioso. Predestination is destined to stay within its barred sharp vision that may fail to cut across the genre, but the room has enough energy to feed on textbook thrills."}, {"rating": "10", "text": "Talvez a melhor ficção relacionada a viagem no tempo já produzida!Seu roteiro é perfeito. Aqui se aborda um paradoxo sobre viagem no tempo que quebra mentes. O filme gera uma discussão riquíssima quanto a isso, sendo muito recomendado assistir com amigos por conta disso. O Storytelling  funciona magnificamente bem, te prendendo do inicio ao fim e causando uma intriga sobre como os pontos vão se unir. Quando se assiste pela segunda vez, percebe-se todos os elementos que o diretor põe para deixar a experiencia do plot tão marcante quanto é. Ele também direciona muito bem as informações, fazendo com que cheguemos a uma conclusão que ele quer que pensemos.O fato do filme todo se basear em um personagem é insano. Os diálogos são um tanto quanto misteriosos, principalmente se é a primeira vez que assiste. Apesar da historia ser bem direta, também há espaço para interpretações. Todo o universo construindo em torno da agencia e da identidade audiovisual da viagem no tempo é bem interessante. O elenco está muito bem escalado, ninguém está fraco. Algumas cenas que exigem um apelo dramático são muito bem encaradas por Sarah Snook, que é meu destaque aqui.Predestinado vai muito além de um super PlotTwist, sendo uma adaptação belíssima que tem uma construção invejável e que merecia mais atenção."}], "recommendations": ["donnie_darko", "searching", "interstellar", "memento", "chaos_walking", "annihilation", "colossal", "tenet", "hereafter", "what_happened_to_monday", "the_prestige", "the_good_shepherd", "a_cure_for_wellness", "the_butterfly_effect", "nerve", "the_machinist", "no_country_for_old_men", "coherence", "the_accountant", "contagion", "downsizing", "split", "midnight_special", "source_code", "shutter_island"]}