{"id": 1780, "title": "Predator 2", "starring": ["Danny Glover", "Gary Busey"], "runtime": 108, "genre": ["Science Fiction", "Action", "Thriller"], "description": "A police chief in the war-torn streets of Los Angeles discovers that an extraterrestrial creature is hunting down residents - and that he is the next target.", "releaseYear": "1990", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mSta5O31rPUcZH98psx0cxLbPXd.jpg", "categories": {"plot": 7.470588235294118, "acting": 6.636363636363637, "ending": 5.0, "soundtrack": 7.5, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.25, "action": 8.03448275862069}, "reviews": [{"rating": "7", "text": "This movie used to get a lot of flack, but after watching The Predator 2018 this seems like a multiple oscar winner. Good action and adds to the predator lore in a non stupid manner."}, {"rating": "10", "text": "Самый саааааааааааааааааааааааааааааааааааааааааааааааааааамый недооценённый критиками фильм."}, {"rating": "8", "text": "Predator 2 is a very fun movie to watch. the movie is predator 1 but its taken in a city. the movie is just fun to watch like the first one."}, {"rating": "9", "text": "Gotta say with time, this movie got a lot better. Gore, goofy, simple, No woke garbage. an enjoyable Predator Movie."}, {"rating": "1", "text": "Predator 2 is the sequel to 1987's Predator.. The original Predator movie from 1987 starring Arnold Schwarzenegger was great but the ending was daft but still a great film and sci fi classic. Predator 2 is set in Los Angeles and is set in a warzone between cops and criminals and Jamaican gangs. Very violent, some nudity and complete rubbish basically. Even Danny Glover being a great actor couldn't save Predator 2 from being a crap movie so Predator 2 is a stinker!! Avoid it."}, {"rating": "5", "text": "Is kinda entertaining but mostly extremely mediocre. Glover is good but the predators should keep their masks on."}, {"rating": "4", "text": "Watchable? Sure but it's a deeply flawed movie that is nowhere near as fun as the original. Glover was a great lead but the rest of the cast looks incredibly weak in comparison to the cast of the original. Having an almost dystopian setting in LA felt really out of place, even for a sci-fi film. I would have toned down that setting, focused on a more modern LA with Glover investigating a series of gruesome murders and then realizing that it is this creature (the predator) behind it all. That would have been far more than the actual story we got."}, {"rating": "5", "text": "The urban landscape of LA was a poor setting.  It could have worked, but the execution was terrible.  There were too many things going on here with a secret government organization, gang war, a Predator from outer Space, and a gung-ho cop all in a 10 year future setting with out of control crime, and a heatwave from global warming.  It was like Aliens meets Robocop.  Danny Glover did a good enough job, but essentially played a mash up of his character and Mel Gibson's from Lethal Weapon with the Maverick attitude, his defiance of his superiors and the feds and somehow was the hero coming out on top as everyone else was incompetent and dying.  The camera work was shoddy during the action sequences so you struggled to see what was going on at times, and the effects were lacking for its era.  The plot didn't make much sense, and the dialogue was frequently cringey.  Bill Paxton whom played Glover's new partner was especially annoying with unconvincing acting that frequently was over the top, and would have even been irritating in b-rated horror movies.The Predator was cool, with some new gadgets, and the non-stop action was still fun at times with a pretty cheesy tone.  The first movie was much better with the pacing, and Arnold was much more convincing than Glover as a match for the Predator."}, {"rating": "8", "text": "I think it is better than its reputation and should be appreciated for what it is. It was not enough like the first movie for a lot of people which harmed the ratings. They tried something different than just a safe sequel while also trying to keep what made the prequel one of the best action movies of all time. It was a great action movie and also a deconstruction of action movies as the fitting description is that Predator hijacked the movie and made a team of action heroes look weak and pathetic. It was intense, unique and had a great cast. The sequel transfers the setting to the urban jungle of Los Angeles. It is nearly an all out war there as gangs are fighting against each other and the police tries to stop them. After an even for gang warfare unusual brutal murdering of gang members LAPD officer Mike Harrigan investigates the circumstances. He will find himself up against a foe who is far more menacing, challenging and dangerous that he can imagine. I stop here and say they transferred the set up well. It is a fresh take but different and did not please everyone back then. The story is engaging and delivers the feeling of dread by being forced against a seemingly unstoppable enemy. It is intense, menacing and hits all the right buttons of an action movie in this franchise. However it could not reach the same levels as the prequel but I think it is competent enough to be really enjoyable. It also helps that it had a good cast. Lets start with Danny Glover as Mike Harrigan who does an awesome performance and carries the movie. Kevin Peter Hall as menacing antagonist delivers the dread into the hearts of his enemies. Gary Busey as special agent Peter Keyes role was supposed to be Arnold Schwarzenegger aka (Alan) Dutch Schaefer. He is good but cant fit the shoes entirely. The rest of the cast delivers a good performance for its genre. Again it lacks in comparison to the prequel but also again this means not that it is garbage as the prequel had so much iconic characters. Visually the movie looks awesome. They nailed the ascetics and visuals you expect from the setting of LA, gangwarfare and culture of the gangs from Colombia and Jamaica (Would this be viewed as racist stereotype today?). I must warn here as some scenes are quite brutal (O.K. for me but a warning should be fair for other people). Special effects were nice for its time and worked well. It got the Predator feeling right. Overall I say it is underappreciated. Over the years many have changed their opinions about it. It was back then not as good as the original which lead to lower ratings than it actually deserved. I think it is a good action movie and worth watching. For the franchise I think this is the second best movie and can be considered as success."}, {"rating": "10", "text": "**** Badass, Nuff Said. This movie has it all, on par with the first Predator. Absolutely Fantastic!"}, {"rating": "8", "text": "The first Predator is a classic, and I wasn't actually expecting much from this film. But I was surprised, as this film is quite good and much better than the AVP films and the recent film. It mayn't be as efficiently paced, the film could have been shorter and it may lack the sweaty and claustrophobic tension of the original. But there is an atmosphere that does make it a compelling watch, it is quite dark and suspenseful when it needs to be, and while the story isn't quite as interesting it is well-constructed with a broodiness and sensual style that doesn't make the film dull. The dialogue is serviceable, as is the direction, Danny Glover is suitably hard-edged and Gary Busey is interesting as the sinister government official. But it is the spectacular effects and excellent action that drive Predator 2 to a greater level. Overall, a good sequel. 8/10 Bethany Cox"}, {"rating": "6", "text": "So I went from the bunch of sequels to just as s£!t and now I went from the bunch of sequels to just as s£!t again. This is the first time that I think that the sequel will not be as good as the original. As far as sequels go they're isn't really that terrible about them. I just can't find anything really spectacular about them or even that good. I was actually looking forward to see Predator 2 and I gotta say, it's not as good as the first film. The visual effects look very different much like the first Predator and kinda declining for the most part. While Arnold Schwarzenegger not returning, Danny Glover is here to star in this sequel along with Gary Busey, Ruben Blades, Maria Conchita Alonso, and yes, Bill Paxton. It's so nice to see him in this Predator sequel after he stared in Aliens but aside from that it's not even close to be a good film Predator 2 actually is. Course he could get a laugh but there's not much. The music by Alan Silvestri is similar to the original but for the most part it is similar. Danny Glover and Gary Busey met together in the film called Lethal Weapon as the cop and Gary as the baddie. Recently I've saw the list of NC-17 rated films and I saw Predator 2 in it and I don't know what that is. For some reason it says \"Originally rated NC-17 for strong graphic violence and gore; edited version rated R for strong violence and language, and for sexuality and drug content.\" so yeah, it's originally rated R because it's not that bad, I don't see any gore in it so I guess that is it. So this is pretty much all I can say about the Alien films and the Predator films which I think Alien Resurrection and Predator 2 actually killed the franchise even though the second one ended here. So overall I'm not a huge fan of this one. I'm sure a lot of those fans out there who are not a fan of the Alien sequels apart from Aliens and people who aren't a huge fan of this. So unlike Alien 3 however, this film is just an all right experience for it's own time but not for everybody who are the fans of the original Predator and Aliens."}, {"rating": "8", "text": "Predator 2 is a great sequel from the 90s. It is much better than the original. Here is a simple plot, but the action scenes reached a new level. It is also worth canceling Danny Glover's good acting."}, {"rating": "6", "text": "Okay, This Is Just WeirdA Predator in a city!?, That is kinda ridiculous and funny at the same time."}, {"rating": "6", "text": "It's okay. Not as good than the first one, but it's enjoyable, with good deaths, special effects and a convincing Danny Glover."}, {"rating": "5", "text": "The Predator 2 is a missed opportunity to follow the myth of the Yautja in such a good way that the first installment did.- Action well shot- Danny Glover notable with his main role- Cliffhanger unexpected end- Contradictory with the previous movie- They try to add an interesting plot, but it just does not work- Special effects do not stand out in the same way as in the previous movie- The subway scene handles the effects of light horribly"}, {"rating": "9", "text": "Unpopular opinion but it was slightly better than 1st one,the town setting with crime/thriller driven plot for predator was engaging right from the start,the story was good,the music was amazing,the action scenes were less compare to 1st but it was awesome,the connection of prequel was amazingly done,the starting fight right after the opening credits it was adrenaline rush,watching Danny Glover i got the feeling this was lethal weapon at start,the gun fight of cops and Mafia's was awesome and the glimpse of Predator and then the kills of Drug mafia's by him was brutal and bloody awesome,the feud between Cops and FBI right from the start was engaging,the Drug dealers story and there deaths were awesome apart from starting fight the another fight at apartment was literally brutal and awesome after that the Cops investigation at that scene hiding from FBI and the hunt of cop Danny by predator was surprising then the personal issue for Harrigan and cops team and there operations against FBI secret was on,it was engaging then the Whole train fight sequence was literally awesome the gun fights and killing were brutally disturbing after that fight the Cop member death scene in presence of Harrigan The breaking skull moment by predator was another level brutally awesome,the last act was intense AF the FBI secret reveal about predator's techniques and the tactical fight afterwards at meat center was amazing,the exciting ups and down's in fight was awesome after that the solo fight between predator and Harrigan was amazing,the bathroom scene the predator healing and all it was little funny although creepy then the whole chasing sequence ended with literally jaw-dropping reveal about predators was mind-blowing the whole ending was great,Overall its amazing sequel and it was entertainingly awesome movie!"}, {"rating": "9", "text": "Aunque inferior a la primera, sigue siendo una gran película digna de la saga"}, {"rating": "10", "text": "I can't understand why this film got so many flacks and I watched the first movie. I found the main character charismatic and the Predator terrifying, I was captivated by the story and action. I think that the main reason why this movie put off many fans of the original is because its tone was set differently, more toward police drama but then the direction was new and not a simple knock off. I liked dialogues, entourage, it has its share of suspenseful moments. Edgy jokes, character interactions felt very natural not forced which is a common thing in many movies of this genre (trying hard to look \"badass\") nowadays and didn't distract which was one of issues with the newest Predator movie. I bet if it was made nowadays it would become an instant hit. To a reviewer below who complained that the Predators wear helmets, another of their species had already its helmet removed in the first installment so we know how they look anyway. The movie also contained some revelations that I won't spoil here."}, {"rating": "8", "text": "Predator in the city. Rogue Cop Mike Harrigan faces a criminal that cannot be arrested. Not as good as its predecessor, Predator 2 is an good movie, fill with action and intrigue. The over reliance in comedy feels out of place, it doesn't fit with the predator creature and it makes some of the scenes less tense."}, {"rating": "3", "text": "Predator 2 was an awful sequel which was not even needed. It's a very disappointing sequel. It had poorly written storyline and bad cast. For first one hour, this film didn't seem like a horro movie but a gang action movie. There is no thrills, even when the predator is on screen I didn't felt any bit of terror. The performance of Danny Glover as the lead character is also not good (almost bad). This movie should not hav existed. It spoilled all the fun of the original. I am glad they came with Predators (2010) and improved their mistakes.Overall, this is possibly one of the worst sequels I have ever watched and would not recommend it to anyone."}, {"rating": "6", "text": "I consider the first Predator to be a great film, and unfortunately the rule that the second part will not surpass the quality of the first one has been applied here. Some movies have managed to do that, but Predator 2 unfortunately did not. The jungle has been replaced with Los Angeles. That's a nice change though and again a slightly different take on the Predator, this time in an urban setting. On the one hand, it's lost a bit of its charm. At least in my opinion. The jungle suited me much better. What was great, though, was the ending. I won't spoil it, but in short the wait was worth it and I devoured the last few minutes. Overall, for me, this is an above average film that I recommend only to fans of the franchise."}, {"rating": "10", "text": "My favourite in the franchise!!! Such an underrated movie! Don’t sleep on this one! You will have a good time with this movie!!!!!!!!!!!!!!!!"}, {"rating": "10", "text": "This movie is very underrated, it may not be as good as the first movie since it doesnt give the jungle vibes and people may not be used to yautjas hunting in the cities. The main character may lack fear, unlike Schwarzenegger's role where they are actually afraid of the Predator, in this movie its like he's trying to fight the Predator 1 on 1, but overall its still a good movie"}, {"rating": "10", "text": ""}, {"rating": "6", "text": "A tacky crap sequel. It really was that bad. Sometimes painful to watch other times mildly exciting. There are some cool bits but only cool because of memories of the first film. On the plus - the story keeps moving and rarely pauses with some cool action pieces. One the minus - this is a silly film with many painful moments; this is mainly because of the script I think. A blemish on the memory of the original. On second thoughts, this can be a fun movie even if it is unbelievable."}, {"rating": "4", "text": "Better than the first one. Konrad Cruze is basically the villain in this one so that’s funny. Watch The Nest from Gumball instead"}], "recommendations": ["predators", "underworld", "blade_trinity", "underworld_awakening", "terminator_3_rise_of_the_machines", "resident_evil_apocalypse", "bloodshot", "rambo_first_blood_part_ii", "the_meg", "riddick", "blade", "the_transporter_refueled", "aliens", "transformers", "the_last_witch_hunter", "escape_plan", "the_predator", "iron_man_2", "kong_skull_island", "hunter_killer", "mad_max", "transformers_dark_of_the_moon", "underworld_blood_wars", "the_expendables_3", "xxx_return_of_xander_cage"]}