{"id": 278, "title": "Predators", "starring": ["Adrien Brody", "Topher Grace"], "runtime": 107, "genre": ["Science Fiction", "Action", "Thriller"], "description": "A group of cold-blooded killers find themselves trapped on an alien planet to be hunted by extraterrestrial Predators.", "releaseYear": "2010", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/sx5EuckP7SBQrlMlxg0PLt282WS.jpg", "categories": {"plot": 5.942857142857143, "acting": 5.416666666666667, "ending": 7.6, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.5, "action": 6.3428571428571425}, "reviews": [{"rating": "6", "text": "\"Predators\" has a extremely linear plot. The characters also tend to show off rather than to improve themselves. However, the film's a entertaining movie thanks to its fast-paced tension it provides."}, {"rating": "9", "text": "Exactly what I was expecting it to be, an action packed, intense movie with a couple of humorous moments thrown in - just like the original."}, {"rating": "8", "text": "It was a very good action-adventure/horror film.  It was gritty, edgy and a well-produced B-Movie that resembled the feel of an 1980's film, most particularly, the original 1987 Predator.  Predators supports a very similar premise to its predecessor and it shares its feel and look. It also boasts good performances and some very bloody action.  I loved it.  A 8.25/10"}, {"rating": "6", "text": "i had higher hopes for this film but it was ok . i am a big predator fan so it helps my enjoyment of the film . it tries to take the original film and kick it up a notch and does so in some ways but fails in others. it seems like every lead charicter gets compared to arnold who fought the predator in the original film . well theres only one arnold and will probubly never be another who could fit in thoose shoes as a predator kicking bad ass. adrian brody does a fair job as the merc who is kinda shady and mysterous . what he lacks for in the giant build he has in brains . there is alot of action that is enjoyable to see and the plot all be it bare bones and copying alot of its original film keeps your attention for the 90 min its running . the beefs i had with this film are the lie it told in the previews . i know what really got my attention was the part it shows brody's charicter with a predator lazor beam locked on him then you see a dozen more light up 1 after the other . well in the actaul film iots only one lazor beam . which pissed me off . the trailors try to make it seem like they are fighting a dozen predators when actaully iys just 3. false advertising like that pisses me off. deduct 3 points just for that alone . also lawarnce fishburn's charictor just didnt seem believable as a guy who survived as long as he did . it just seemed like they scewed up with that charicter and coulda made him this bad ass but instead made him a loon . all in all its a decent film im not sure id recomend any one go out to the theater and see it . its more along the lines of a rental. it is better then AVP 1 and 2 though"}, {"rating": "6", "text": "This was the true sequel to the 1987 original. This is what predator fans were waiting for. This beats out those god awful Alien vs. Predator movies it promises fast action and it succeeds, It goes off of the successful formula the first movie created and ran with it. The only problems I found with it was the cast Adrian Brody was no where near as good as Arnold in the original and the whole movie was so obvious that it was mind numbing."}, {"rating": "10", "text": "i really enjoyed this movie i admit there were small flaws with it but there were not any major problems that made it completely pointless. this is what i expected from a predator movie as a predator fan and i am looking forward to the sequel"}, {"rating": "6", "text": "Not a bad movie but could have been so much more, Brody was a waste of talent as his character didn't need any acting skills. Don't know what was going on with the introduction of a character halfway through that made no impact on the movie and the rest of the cast were the usual mish mash of stereotypes. In all watch it once to see a decent action movie but don't expect too much"}, {"rating": "10", "text": "Good movie,not as thrilling as its older brothers (predator 1 and 2) but action won here. If you hope some spoilers in this review then stop hopeing and watch the movie!!!"}, {"rating": "10", "text": "This is the best sequel/prequel in the whole predator/alien franchise. Better than covenant which I watched a month ago and am hard pressed to remember anything about and way better than prometheus. I know they're not the same series but have a lot of crossover plot details. Anyway, the characters are one dimensional yes but these are people you should expect to die they're just making up the numbers. It's really fast paced and tense with great action scenes. Highly recommended for fans of the original predator."}, {"rating": "7", "text": "It may not be as original or as fresh as the original was in 1987, but this movie for the most part delivers what it promises. The smartest move it makes is that it ignores the fact that the weak AvP movies even exist (and possibly the mediocre Predator 2). The acting is decent and some of the set peices are great. A good sequel to a very good original."}, {"rating": "3", "text": "Spolier Alert: This movie just very went so deep into the tank after a very promising first half. Fishburne inconceivably takes all the survivors into his secretive lair, and smokes them out for no apparent pupose (he doesn't even steal a weapon nor does he get the hell out in time). He didn't survive 9 seasons by being an idiot! Brody somehow arranges to get an alien spaceship to take off and fly completely unmanned!!!! At the end, Brody and Braga are surrounded by a parachuting 'Season2\" castmates and we see them casual and non-affected and with no desire to 'get the hell out fast'. We also got to see two predators fight each other with our a clue of who's who... and don't get me started on Topher Grace initiating his serial killer routine before the bad guys are all killed off while he would have been left with nothing but a hypodermic needle and a jackknife available to defend himself. A truly pathetic 2nd half."}, {"rating": "2", "text": "It was a really pointless movie...im thinking im goin to see great fights and what not. jus mostly running and stupidity. was really irritated with the movie all around. And the whole big predators hunting the smaller ones...wat is that about. Dude which one was coming to earth then cause im confused. completely made no sense!!!"}, {"rating": "4", "text": "\"The horror, the horror\" had Arnold Schwartzenegger attempted to deliver a literary quote in John McTiernan's \"Predator\", the 1987 film which spawned three sequels \"Predators\" would probably have you forget, especially the shameless marketing-oriented ones that matched the nameless predator with the nameless alien. \"AVP: Alien vs. Predator\" and \"AVPR: Alien vs. Predator- Requiem\" were more like spinoffs for gamers who loved MTV's \"Celebrity Death Match\" than an organic organic continuation of the Reagan/Bush-era franchise. They were live-action video games. \"Predators\" fairs only slightly better. Appropriately enough, the film opens with a man hurtling to the ground(the screenwriter must've had a Sprite) as the achromatic atmosphere, symbolic of the white light from a computer, is the preamble to the game: the planet where Royce(Adrien Brody) must play \"The Most Dangerous [Video] Game\" with his multi-cultural survivalists. (The predators are like CBS executives.) To lend \"Predators\" some much-needed gravitas, Adrien Brody quotes Ernest Hemingway, and acts like a Hemingway character(perhaps Wilson in \"The Short Happy Life of Francis MacComber\"), as Brody's Royce deduces that they're being hunted on a game preserve after he and his colleagues are attacked by spiky-looking quadrupeds. In order to escape from the \"Lost\" planet, the spirit of Schwartzenegger finds itself abounded in the \"classic\" predator, who like the android in James Cameron's \"Terminator 2: Judgement Day\", protects his former prey from an updated model: in this case, a higher evolved predator(the \"black\" predator) who keeps his ancestor in shackles. So Royce makes an alliance: Royce has guts, or as Hemingway put it, his course of action exemplifies \"grace under pressure\", when he perceives that the \"classic\" predator(who as it turns out, was probably only following orders in the South American jungle) isn't his real enemy, and frees the predator so he can fight his oppressor. Not only is Royce a man of action(he comes back for GRACE), but a man of great intellectual powers, as well: a man who reads. \"Predators\" can be read as a liberal film."}, {"rating": "4", "text": "The original film was no masterpiece, but it led an example of style and suspense. Predators is not quite that, but it is interesting and entertaining in a weird kind of way."}, {"rating": "10", "text": "I haven't actually seen Predators yet however I have watched enough Dateline that Chris Hansen has me convinced that predators are horrifying. Add the fact that these monster now roam on alien planets as well only confirms that Hawkins was right - we should not be sending out space probes that are the equivalent to a google map for our front doors. Gripping story that is all too real."}, {"rating": "7", "text": "\"Predators\" full of 2D characters and CG monsters, entertains well among the summer blockbusters."}, {"rating": "1", "text": "This movie flat out sucked. The actors suck, the story sucks, and the action sucks. DONT SEE THIS MOVIE."}, {"rating": "2", "text": "What a lame movie!"}, {"rating": "2", "text": "One of the worst action films I have ever seen. The only enjoyment I got out of it was laughing at the ridiculousness of some of action sequences. The supporting characters are all based on racial stereotypes, and I just hope that Brody is trying to be a gravelly-voice satire of an action hero. I couldn't believe this movie was only 106 minutes long- it felt like 3 hours to me."}, {"rating": "7", "text": "An elite commando unit led Major Alan \"Dutch\" Schaeffer and C.I.A. Liaison Major George Dillon were dropped into the deep jungle with orders to rescue a presidential cabinet minister kidnapped by guerrilla forces in Val Verde. As the progress through the jungle Major Schaeffer and his team stumble upon a downed American helicopter and the skinned remains of several bodies later revealed an American Special Forces team afterwards, they make there way to a heavily guarded rebel encampment quickly dispensing of the troops in the base and taking a young girl hostage. Major Schaeffer soon finds out that the entire rescue mission was nothing but a hoax cooked up by his superiors to get his team to kill the guerrillas in the encampment, after Dillon confesses that the men they found earlier disappeared in a failed rescue mission of two CIA agents. As they make there back to the extraction point the commandos, an unknown creature using thermal imaging is watching them. After two members of the team are mysteriously slain, the survivors become aware that something in the jungle is stalking them, something not of this world.   Year: 2010??? Location: unknown  A lone mercenary named Royce wakes up in free fall over a dense jungle after deploying his parachute and maker a rough landing on the planet he assumes is Earth possibly the Amazon. Royce meets up one by one with a colorful group of killers much like himself: Isabelle: An Israeli Defense Force black ops sniper, Cuchillo a Mexican Los Zetas drug cartel enforcer, Mombassa  a Sierra Leone RUF death squad officer, Nikolai a Russian Spetsnaz commando, Stans  a notorious and deadly death-row inmate from San Quentin state prison. Edwin a seemingly innocent doctor (who does not seem to fit in with the rest) and Hanzo a Yakuza assassin they have been brought together for one reason and one reason only on our planet they are the greatest killers we have to offer. Something has brought them to a jungle planet to hunt them for sport but the real question is what brought them there? How do they get home?   Robert Rodriguez and Nimrod Antal's  \"Predators\" is  not a continuation of the horrendous AVP franchise directed by the abysmal Paul W.S. Anderson there film goes all the way back to the  look and feel of John McTiernan's 1987 cult classic  that became one of the 80's  deifying action/adventure films and also a deifying film in Science fiction horror. I know that is hard to believe but when you look back at \"Predator\"  and look at the official sequel \"Predators\" you can see what made the character and the film so popular. All throughout this movie, you feel a complete and utter sense of nostalgia as you watch the characters march around the jungle and out run, there-impeding doom; this is a well-made movie with a fine group of actors that know what they have gotten themselves into They enjoy every minute of it. It does not appear that way onscreen seeing as they have to be serious you know they must have had a ball shooting it out with the predators I know I would. Antal and Rodriguez avoid what made the AVP movies so bad and focus more on what made the Predator franchise so good  they take there main queues from Predator the quiet subtle nature and a little from Predator 2 mainly the gritty pulpy feel  of the trashy sequel  put them together and what do you get? \"Predatorsâ"}, {"rating": "2", "text": "Predators is a waste of time without interesting characters and without no story. It's dumb boring movie! The only better is the original and please enjoy watching this original movie and forget about the new Predator. It's just waste of time watching this stupid movie and GOD that is the most stupidest reboot ever!"}, {"rating": "0", "text": "I have little to say that wont have been said before apart from - really, how difficult is it to make a Predator film? Surely the simple ingredients are a few bad a*s characters that you are rooting for, some bad a*s predators that stalk and scare the s**t out of the characters and a few good death scenes and fights. None of this is in Predators."}, {"rating": "6", "text": "not if the script said that the characters should be a miserable first class because they really were, I did not like Brody's character was known throughout the movie, I mean as it did all those deductions (let's say it was the Einstein of the film), the action scenes were good and well some things that were loose, the movie generally entertained =)"}, {"rating": "0", "text": "Is this movie a joke ? I have never in my entire life seen such bad acting, such a bad script, such a bad story, and such a ridiculous and shameless theft of scenes from other movies. I really do not see why anyone can give this a positive review. It is simply nauseating."}, {"rating": "5", "text": "PREDATORS\rPREDATOR (1987) has been one of Arnold Schwarzenegger memorable movies. Now, they try to extend the narrative into a new chapter from thiz franchise, in PREDATORS, with letter S which is expected to be multiplying (I guess). But what I see from thiz newest alternative is just a movie with a repetitive formula and setting. The formula is still a typical mysterious introduction to the creatures what we called Predators and how a group of soldiers die one by one, until the last one. The setting is still tropical jungle, exactly what we saw on Schwarzenegger version. Thiz one is officially the third Predator movies since the first one in 1987 and PREDATOR 2 in 1990, plus two spin-off when Predators clash with the Aliens (another iconic Hollywood creatures) in AVP (2004) and AVP 2: REQUIEM (2007). Unfortunately, I almost can say thiz one could easily fall into B-Class movie with B-Class Actors attached, such as: Alice Braga, Topher Grace, and others. The only exception (of course) is on Adrien Brody performance, his attempt to be action hero must put as a great credit itself. Brody seems to be successful to build his body and delivers some brawny hero attitude, with his voice and tone characteristic. The other brief but convincing appearance made by Laurence Fishburne. I simply watched thiz movie bcoz I wanted to see what could Nimrod Antal (Director) did for his next project, since his latest VACANCY (2008) created an intriguing and effective thriller. In thiz Predator movie, Antal did not make a new innovation. In fact, he took many rip-off elements from the first original one. If they are keep doing thiz without any modernity has been made, I think they might had been killing Predators itself.\r Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com"}, {"rating": "7", "text": "Actually a pretty good Predator movie, especially compared to the ones that came after it.Yeah, it has plot holes, like the Fishbourne character acting without any logic (but I guess maybe hes gone crazy), and the ending could have been better, but overall the movie is very entertaining, at least a few characters are likable and you actually feel sad when they die (rare in modern woke movies) and the setting brings you back to the best movie of them all."}, {"rating": "6", "text": "I liked the short story 'The Most Dangerous Game' approach. Unfortunately I didn't care for the characters too much and it's kind of predictable."}, {"rating": "5", "text": "Worth a watch but fails to become it's own film. Predators swipes all of the recognisable motifs and themes from the 1987 feature, throws in a few Predators, some two-dimensional, unlikeable characters and has them run about a jungle for a while. To say it's unimaginative is an understatement."}, {"rating": "5", "text": "Repeat after me, \"this film will not transform into one of those stereotypical chase movies\". What's that, you don't understand? Well damn, that's a shame. It's a shame because despite this flick being the third in its respective series it has so much potential that was unfortunately left dormant. Instead there was a large chunk of nothingness at the halfway point which was somewhat pointless, as much so as the uninteresting character played by Laurence Fishburne. Luckily for the viewer he is soon killed off. *sigh* At least the musical score is nice. And remember - If it bleeds, I can kill it! :-D"}, {"rating": "1", "text": "Predators is a 2010 sci-fi action and adventure film which I was looking forward to seeing. It doesn't have many well known or great actors but Walton Goggins, Adrien Brody, Topher Grace and Laurence Fishburne star in it along with more terrible actors I'd say Fishburne is the only good actor in the whole movie but Predators is basically a rip off of the original with Arnold Schwarzenegger because it copies some stuff from the original movie but most of if not all the characters are crap, laughable, some maybe unlikeable and the acting isn't great. Bad film and the action isn't that good either."}, {"rating": "10", "text": "If this movie was any more action packed then your mind might explode."}, {"rating": "9", "text": "This is how i know this site is bullshit, a 49 metascore give me a fing break, rottentomatoes ( a real review) website gave it a 71, the score it deserves. Predators is by far the best action movie of the summer if not the year. ACTUALLY lives up to the original."}, {"rating": "6", "text": "Very fun movie, it gets stupid towards the end but its very entertaining."}, {"rating": "9", "text": "This was a good, but flawed movie. The plot was excellent, and i was amazed how they associated the endeavors of Arnold Achwarzenegger during the first film, Predator. The cast of characters seemed to fit in, except for the deceptively innocent doctor. My one major problem with the movie is that i expected to discover some information about the origin of the predator species. along with that, the ending seemed somewhat anti-climactic, but the epic fight between one predator and the yakuza member, along with the old versus new predator fight, saved the ending. The fact that we discovered why the doctor was thrown into the fray also made for a good ending. My other problem, which is a minor one, was the soundtrack. It was excellent, but at points it seemed to somewhat take away from the suspenseful effects of the atmosphere. All criticisms aside, this is an excellent movie i woul reccommend to any scifi fan anywhere."}, {"rating": "8", "text": "If you liked the original, you'll get some heavy enjoyment outta this. Rodriguez does well - 8 because I wish it was a little wider in scope (I want moar!!)."}, {"rating": "8", "text": "Predators was an enjoyable film. The characters in the movie did what they actually should do in the situations presented to them. Adrian Brody succeeded, in my opinion, at becoming a baddass. Topher Grace's character was predictable, and it was a role that suited him. There was sword fighting involved in this movie. Awesome. And the predators were well done, and they didn't go cg heavy. Thankfully. There really wasn't anything that I hated about it. Some of it was predictable, but not many movies aren't predictable anymore. If you enjoyed Predator or Predator 2, then I don't see any reason not to like this movie. It even has the same music from the original and same font style for the title and credits. Looking forward to the next movie in the series."}, {"rating": "8", "text": "Nimrod Antal made the best out of this B-Movie. It's thrilling, action packed and sometimes funny. The actors did a good job, beneath the fact that most of them are rather drama actors(Adrien Brody, Alice Braga). After the terrible AVP and AVP 2, Predators is a bright Star in the Predator franchise and maybe Robert Rodriguez will realize the Sequel of it. That would be awesome!"}, {"rating": "6", "text": "Could have been better. Predators almost nailed it. Almost but didn't hit the bar. Still it delivers as an entertaining movie with a B-grade feel though. And was much better than the AvP movies. Predators was averagely executed and had so much potential."}, {"rating": "8", "text": "The press response has been underwhelming, but this film in no way deserves as low a Metascore as it currently has. It's fantastic. It's not ridiculous or cheesy, it's just right. For some reason it was marketed as a horror film, which was a bad idea considering it creates the wrong expectations for the film (which has few to no 'scary moments', only a tense atmosphere), when in reality it's an action film like the original Predator - just a hell of a lot more intense and modern. I recommend you see it. And, at the risk of ruining a certain IT Crowd character's enjoyment of the film: there's a twist near the end."}, {"rating": "9", "text": "This movie is not without its flaws however i really enjoyed the movie its exactly what you expect a predator movie to be like."}, {"rating": "10", "text": "I'm giving this a 10 to offset people and critics who were not a fan of the original 2 Predator movies, who certainly take their jobs or opinions far too seriously. This is a franchise with a set of rules, and boy oh boy did this one deliver on cue. Great fun, great nods to the original concepts that even Predator 2 missed. This is the sequel the first deserved."}, {"rating": "10", "text": "I cant believe this. This movie is the best action movie 2010 so far. Guns, explosions, Predators, traps, Macho action."}, {"rating": "9", "text": "Saw this on friday and really enjoyed it,not a patch on original admittedly but a damn fine action film,fans of the original will love it!"}, {"rating": "9", "text": "Excellent summer monster movie flick! Much better than the AVP films, looks like predators are more fun in their own movies."}, {"rating": "10", "text": "I went in expecting a half-assed action movie sequel, but fortunately, I was wrong. Very wrong. Predators focuses more on the inhabitants of the alien planet instead of the soldiers. We learn more about their classes, their hunting styles, etc. Adrian Brody was actually a very convincing bad-ass, Alice Braga was pretty good as the leading lady, and Topher Grace provided some dark comic relief to the film. Overall, the cast and the acting was very strong throughout the film. The special effects and costumes were very convincing, especially the dogs in the beginning. When Nikolai was dragging one of the deceased hounds for observation, it looked as if it were a real animal. I would strongly recommend this movie. It is suspenseful, exciting, fun to watch and overall a fantastic film. My real rating is a 9.5, but I put a 10 just to balance out the score. I think a 7.8 is incredibly low."}, {"rating": "8", "text": "Very entertaining. Stays true to the Predator franchise while taking it in a new (and totally awesome) direction."}, {"rating": "8", "text": "A more than decent movie, pays tribute to the original, and has in my opinionsome very good action scenes. too bad it ends so abruptly."}, {"rating": "9", "text": "Just got back from seeing this movie. I was a huge fan of the first film and Predators is by far the best Predator sequel. Very fun movie."}, {"rating": "6", "text": "Predators has a thin plot but you don't see summer action movies for the plot. On action it delivers."}, {"rating": "8", "text": "A true spiritual successor to the 1st predator movie. The characters weren't tropes...which is fairly rare these days and even more so in an action film."}], "recommendations": ["predator_2", "the_predator", "riddick", "resident_evil_apocalypse", "aliens", "kong_skull_island", "alien_resurrection", "the_last_days_on_mars", "underworld_blood_wars", "battle_los_angeles", "underworld", "monster_hunter", "surrogates", "underworld_awakening", "the_darkest_hour", "priest", "jurassic_world_fallen_kingdom", "world_war_z", "terminator_salvation", "max_steel", "the_meg", "rampage", "the_last_witch_hunter", "red_dawn", "independence_day_resurgence"]}