{
  "id": 4368,
  "title": "Premium Rush",
  "starring": [
    "Joseph Gordon-Levitt",
    "Michael Shannon"
  ],
  "runtime": 91,
  "genre": [
    "Crime",
    "Action",
    "Thriller"
  ],
  "description": "In Manhattan, a bike messenger picks up an envelope that attracts the interest of a dirty cop, who pursues the cyclist throughout the city.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/haP8R490QeEzAJgRHuutIuG8KOG.jpg",
  "categories": {
    "plot": 6.617021276595745,
    "acting": 6.903225806451613,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.9,
    "action": 7.516129032258065
  },
  "reviews": [
    {
      "rating": "6",
      "text": "As I commuter cyclist (I ride my bike to work every day, 5-6 days per week) I was really looking forward to this movie.  It wouldn't take much to impress me either - just a good dose of realism, and the occaisional thing I can relate to.  Unfortunately, Premium Rush is mostly a standard Hollywood affair, with several obvious \"bloopers\" such as bikes that are completely trashed one minute and requiring only minor adjustments the next.  The cycling aspect of this movie is so totally false - everything from how the actors ride their bikes to how the movie portrays what happens in collisions with vehicles.  Also, it gets basic physics wrong too - during a bike race scene between two bike couriers, the cyclist with the steel bike gains on the carbon fibre framed bicycle going UPHILL and falls behind while going DOWNHILL.  This is, of course, the opposite of what happens in reality as anyone who rides a bicycle in a group knows well.  So should you watch this movie?  Well, it depends.  If you aren't a cyclist and you are simply looking for 90 minutes of good clean fun, then sure, go see it.  But if you are a cyclist, particularyl a passionate one like I am, then steer clear of this one.  There are better cycling films out there and better films period.  6/10"
    },
    {
      "rating": "7",
      "text": "Fast and fun, Premium Rush gave me a reason to perhaps try to navigate the streets of New York on a brakeless, fixed-gear bicycle. The best scenes by far were the incredible high-speed bike-races through the city, zipping by taxis, pedestrians, and even New York"
    },
    {
      "rating": "7",
      "text": "Very well made with a nice pacey start that really grabs your attention. Sadly, it cannot maintain that rate, but it soon settles down as we get to know the various characters. I did find all the to-and-fro with flashbacks a little confusing at times, but it soon sorted itself out. On the performance front, everyone did an excellent job but the stand-out by some margin (for me) was Michael Shannon. He really does play the slightly psychotic cop so very well. I felt the final pay-off didn’t quite live up to its initial promise, but I found it entertaining enough. Well worth a look; but don’t put a stopwatch on it.\r SteelMonster’s verdict: RECOMMENDED\r My score: 7.2/10."
    },
    {
      "rating": "7",
      "text": "You will have a good time watching the film IF you can ignore all the implausibilities and over the top situations.  Example:  near the start of the film the bad guy is chasing a bicycle in New York gridlock traffic.  A bicycle would leave a car behind in it's dust in this situation as it can weave in and out between the cars, but somehow this car keeps remaining on his tail no matter what he does.  This is one small example of many other ludicrous situations.  You have to let it go and enjoy the high energy and exuberance of the film.  Although Joseph Gordon-Levitt is fine in the lead role, the movie is stolen by Michael Shannon playing the bad cop.  He makes a good creepy bad guy.  If you like to see bicycles wipe out at full speed, you will really enjoy this movie."
    },
    {
      "rating": "6",
      "text": "Premium Rush's non-linear storyline end up confusing, but thanks keep pushing my adrenaline. Terrific chasing bike scene itself is worth the ticket price."
    },
    {
      "rating": "6",
      "text": "I liked this movie. I went in expecting very little. In fact, I watched the movie because the projector went down on another screening room. Turned out for the better.\rAll the elements were there. The story was entertaining enough, the visuals were cool, and all actors pulled it off, except for Michael Shannon, his rendition of a detective was too comedic to buy it. Still it was very watchable.\rWe won't understand the Dalai Lama better or figure a way to solve world hunger, but if you have a big bucket of popcorn and a, preferably, attractive companion with you, this is definitely the ticket."
    },
    {
      "rating": "6",
      "text": "Ever since 2009 hit (500) days of summer, Joseph Gordan-Levitt has been on one huge ride to the top, (G.I. Joe: Rise of Cobra), which wasn"
    },
    {
      "rating": "7",
      "text": "Quite the original story here; its quite thrilling, without the explosions or as many as the guns as the Transformers franchise. It doesn't include a very heavy plot, so you don't exactly need to concentrate very hard (HOWEVER, there are jumps back and forth in time), but it was a very entertaining, fun, late summer chase movie. Walking out of the film, it will have persuaded you to jump back on your bike and see if you can do some tricks. If you're bored, and you just want to relax and watch a flick, see Premium Rush!"
    },
    {
      "rating": "7",
      "text": "Fast, fresh and adrenaline rush all over. Good entertainment all over. This is a movie you watch when you want time to fly and it keeps you on your pedals but not on your seat for those action scenes"
    },
    {
      "rating": "10",
      "text": "Cool, funny, fresh and original. Premium Rush is a great movie."
    },
    {
      "rating": "8",
      "text": "Premium Rush delivers on the promise of its title. Joseph Gordon-Levitt stars as a daring NYC bike messenger. Apparently there is no end to the risks bike messengers take. Some of the film's best sequences elaborate on various possibilities that could end in disaster. Michael Shannon plays a hapless cop whose gambling habits have gotten him into trouble with the wrong people. His performance is another of the movie's numerous highlights. Gordon-Levitt receives an envelope, the contents of which could help Shannon. Premium Rush moves back and forward in time and all across NYC, following different characters and providing the audience with the central scenario before fleshing out the details. This approach works decidedly better than more straightforward storytelling. Writer/director David Koepp capably maintains tension, while his and John Kamps's script successfully injects humor into various situations. The characters are well defined and have plausible motivations. Ultimately Premium Rush is fairly simple, but it offers enough innovation and personality to rise above standard genre fare. Those looking for a good time would do well to see it."
    },
    {
      "rating": "9",
      "text": "I found this to be a funny, entertaining, and all round enjoyable movie, well worth the time and money spent. People who think that movies are always supposed to tell some heartbreaking story need not waste their time. The plot is simple. The richness of this movie comes from an interesting style, funny moments and good low-violence action scenes."
    },
    {
      "rating": "8",
      "text": "Exhilaratingly fast and incredibly well paced, Premium Rush gives adrenaline rush at the same dose of blissful flesh-to-steel wreckage. There's just something viscerally appealing about the way human body reacts on impact that can't be duplicate with any pile of vehicular mayhem. The movie captures its speed fantastically, swirling between pedestrians and traffic just enough to create a sense of familiarity compared to the unreal car chases. Plot is actually thick enough to justify the possibility of these riders turning into smudges on a slab of concrete, Joseph Gordon-Levitt and Michael Shannon make up for intriguing homicidal cat and mouse chase.\r The plot uses multi-perspective view from the characters as it moves back and forth to introduce them in their own entwined timelines, it creates a singular event but viewed from different perspectives. Action and narrative go along smoothly this way, as even if the movie doesn't showcase any chase scene, it's still thrilling due to the acting. Wilee (Joseph Gordon-Levitt) plays a man rebelling against the social norm, preferring constant flirt with bumpers rather than sitting behind a desk. It's an effective way of luring the younglings because he personifies the freedom one might fantasies at some point.\r Bobby Monday (Michael Shannon) is very genuine in his disturbed look, he's creepy in a photogenic way. I've not seen many throw adult tantrum like him in a while. Vanessa (Dania Ramirez), Wilee's girlfriend, and Manny (Wolé Parks), his rival, make a tidbit about triangle love that goes along the way with juvenile rivalry to impress the girl. It's quite distracting and only displays trivial bravado to buff the movie. Manny is a very irritating character, which ironically meant to be, as he hounds Vanessa, who has a sort of rough allure. There's also hint human trafficking that only touch briefly as motivation, but it's too superficial to be thoughtful.\r The movie is graphically pleasant, very sharp and colorful. The action moves in an organic urban spectacle and slightly exaggerated speed captured from crisp close angles. Bits of HUD or slow motion are nice touches too. However the script sometimes overreaches to the border of some remarks a fifth grader or internet troll might say. It has some padding as well, especially at the end, which rather disrupts the original pace a little. If offers artificial road rage, fast pace and stunts that shouldn't be taken too seriously. Allow yourself to enjoy the ride and sooth the primal need of seeing someone crashes, badly.\r Rate 8/10"
    },
    {
      "rating": "9",
      "text": "This was a very well rounded film with lots of chase scenes on bicycles which is awesome for an avid biker like myself. The writing and direction of this film was really good and Joseph Gordon-Levitt is becoming one of my new favorite actors. Very good film to see for a date night or just hanging out with your friends. Go and see this film."
    },
    {
      "rating": "9",
      "text": "Joseph Gordon-Levitt plays a gonzo bike messenger in NYC, who's given a crucial delivery. Sounds easy, but a crooked cop (Michael Shannon) complicates everything. This movie moves! Besides the crazy street riding, exceptional accidents and narrative flashbacks, the graphics add another element of visual impact. Even with a few breather moments, the pacing never lags and there's enough variety to avoid repetitive peddling scenes. If you're wondering how a simple trip downtown can take up 90 minutes, you'll be surprised to see how strong editing and creative storytelling can propel it forward. This is not a major motion picture event, but it sure is action packed and fun!"
    },
    {
      "rating": "8",
      "text": "This movie came as a huge surprise to me. Usually when a movie is moved from one dumping ground to another, that usually means the studio has no fate and the movie is most likely crap. About 97% of the time this is true so it's nice to see a movie like Premium Rush to just completely surprise you. Crap this certainly isn't. Sure the story isn't anything new but when it's this well done it doesn't matter The only real thing that bothered me was Jamie Chang's fake accent. It was laughably bad and kind of took away from the film a bit. Sometimes the film had a little trouble finding a consistent tone, but it didn't bother me much, it might bother some people though. Other than those things, everything else worked. As I just stated above, the story is nothing new but it doesn't matter when it's this well done. I'm surprised that no one has ever thought of making a movie about bike messengers before. If they're made as well as this I'll gladly take more of these than movies like Fast and Furious(to be fair I actually liked the fifth one and I'm excited for the sixth one). I never thought a movie about bike messengers could be just as exciting. By using bikes instead of cars, it makes this movie seem so fresh as your not subjected to the same routine car chases that you see in every action movie. The story is told through mostly flashbacks over the course of four or five hours. It's not entirely original storytelling but who cares? It also does not ruin the nice brisk pace. There's never a few minutes between each action scene, I guess the best way to describe it would be like Joseph Gordon-Levitt's bike, it has no breaks so once you get on it and go you can't stop, that's what this movie is like. Once the movie starts you are on a non stop adrenaline fuled ride. Sure the movie might pause for a little bit for character developing moments but it never detracts from.the pace. The style of this film is what also elevates this movie above most action films. There are these cool sequences where Levitt's characters about to get into an accident so we see through multiple Windows what's the best possible route for him to take that will avoid him getting into the accident. I've never seen something like this before. The movie is also well shot, there's no shaky cam, it's a nice smooth ride. We're treated to point of view shots, overhead shots, rear shots, and side shots which makes it all the more entertaining. I personally like the point of view shots the best. The performances are solid across the board but the two who stick out are of course, Levitt and Michael Shannon. Levitt has the screen presence and Charisma which makes his performance all the more enjoyable. Shannon has fun chewing up his lines, he is a badass and he knows it. Overall, the story exactly original and Jamie Chung's fake Asian accent is pretty. bad which kind of takes away from the movie a bit. The strong direction, breezy pace, the style, and the performances definitely make up for those things. In today's world when a movie takes the same story that's been done before but manages to put it's own fresh twists on it, that's sufficient enough to set it apart from most movies today It's also certainly sufficient enough to warrant a recommendation. I would also like to mention that this movie succeeded where a handful of movies failed, it actually delivered on it's promise."
    },
    {
      "rating": "9",
      "text": "This film is awesome. Despite having what may be called a convoluted plot, it is given strength by the intense action, superb acting and a brilliant choice of characters, not to mention the crystalline graphics of a GPS and the lively streets of New York. Joseph Gordon-Levitt is just so carefree and alive in this film."
    },
    {
      "rating": "10",
      "text": "Its probably the most original film of the year. With nonstop suspense and chase scenes, it really is a RUSH."
    },
    {
      "rating": "10",
      "text": "Premium Rush is honestly one of the best movies I've ever seen and other than The Dark Knight Rises and The Avengers, it's probably the best movie I've seen in 2012. It was incredibly unique, very action packed and quick paced, it has a thriller element that is just right, there's a minor emotional element that allows you to connect to the characters without taking away from the feel of the film, the acting is outstanding, and it is absolutely hilarious. Koepp threw down with an absolutely flawless script, that's for sure. This movie makes you wanna jump on a bike and go crazy, lol. Overall, I loved the movie and suggest everyone to go see it."
    },
    {
      "rating": "8",
      "text": "Seems like majority of people didn't like this movie that much. Written and directed by David Koepp, Premium Rush is a fast-paced and a thrilling movie which incorporates the busy streets of New York City as the bicycle messengers ride around all day to make the deliveries on time. What's good about this movie is that it is made out of a simple concept and a typical storyline but it still feels so different and a bit fresh. I don't remember watching a bicycle movie and liking it as much as I like Premium Rush. Maybe because the techniques employed in this movie are way better and they work the exactly way they should be working.\rJoseph Gordon-Levitt (Wilee, a bicycle messenger) seems to shine in his role and is supported by other cast members such as Michael Shannon (Bobby Monday, a corrupt cop), Dania Ramirez (Vanessa, Wilee's ex-girlfriend), Wolé Parks (Manny, Wilee's rival). Michael Shannon's character, Bobby Monday is a corrupt and a negative person but his performance is funny, keeps making you laugh because he keeps getting pissed at everything around him and he acts hilariously. This film may not offer much depth into the characterization but you got to look even deeper to get to the bottom like Wilee (Gordon-Levitt) doesn't want to do the office jobs wearing suits and sitting in one place but instead he rides around all day and feel free and independent. Crazy cinematography, more than a dozen stuntmen, efficient CGIs and the slight humor make a huge contribution towards this film. I must say that Koepp is a intelligent guy, he knows how to make a good movie out of a typical plot and a simple concept that revolves around the movie just like the movie begins with an accident and the narration explains everything gradually and it becomes clear that  the main plot is more like a mission to make things happen. The execution and direction are superb, which can be justified by the fact that I didn't get bored, not even for a bit, mainly because of the fast pace and the thrilling bicycle action whcih works perfectly with much imagination, complications and energy. This movie totally worked for me just like I was hoping for."
    },
    {
      "rating": "9",
      "text": "I didn't even know about Premium Rush until a few hours before seeing it, and sometimes going in without knowing what to expect makes the experience so much more enjoyable. I found it to be very engrossing, without a dull moment throughout the 90 minutes. Good action with a decent storyline that developed in a very interesting manner. There were funny moments to add further to the experience, one which was great overall. I definitely recommend it for anyone seeking a quick, entertaining flick that won't leave you thinking too hard or being confused, but saying, \"Oh, that was cool\""
    },
    {
      "rating": "8",
      "text": "Original setting on top of an average cliche chase movie. That original setting held me over though and enjoyed it very much. It is just refreshing to see some kind of experimentation done on modern movies. I would of liked a little less of the bad guy and the movie itself could of been trimmed down 10 minutes or so and been a bit better. Overall very good a nice interesting adventure."
    },
    {
      "rating": "7",
      "text": "It may feature some pretty silly plot elements, but overall \"Premium Rush\" is a fairly entertaining and brisk action film with some pretty amusing performances."
    },
    {
      "rating": "4",
      "text": "This movie is a big disappointment.  My biggest problem with this film is the script stinks and Jamie Chung's accent is cringe worthy.  The bike scenes are kind of cool and JGL is good, but it's not enough to save this film."
    },
    {
      "rating": "9",
      "text": "Good! The best movie this year. I've been disappointed in most movies this year with VFX substituting for story. This a great ride both action and narrative wise. It isn't going to solve the worlds problems but if you want a movie you can enjoy. The marketing has been terrible but this is going to the next ShawkShank movie on TNT in a few years, where they show it every month and you can watch over and over again for the ride."
    },
    {
      "rating": "4",
      "text": "About the best thing that can be said about this movie is that Gordon-Levitt and Shannon do what they are asked to do with the characters they are given. The movie has very little plot, and what plot there is we don't have any investment in. The bike riding seems cool, but only for a minute, better to search for bike messengers on you tube if that's what your coming to the film for. Overall a highly forgettable thriller."
    },
    {
      "rating": "5",
      "text": "About half way through this film, I thought to myself, \"Wow, that 66 Metascore is pretty generous for this very average B-Movie!\"  I mean, sure, it's an adrenaline rush, but the acting is horrid.  Jamie Chung is easily the weakest link - her Mandarin accent is ridiculous. Michael Shannon is an excellent actor, but he's so far over-the-top in this role, it becomes a cartoon.  And it seems like the movie wanted to be a videogame when it began. If I wanted to play a game, I would have stayed home and launched one on my PC."
    },
    {
      "rating": "3",
      "text": "Whenever Michael Shannon is on screen, this movie is an absolute blast to watch.  Unfortunately, when he's not, it's borderline unwatchable.  If this movie had been filmed in the '90s, you can be certain the main character would be using the word \"radical\" every other sentence.  It's THAT kind of film."
    },
    {
      "rating": "0",
      "text": "As a mountain biker and a person who loves physics! this movie stinks! Also the story is way over the top, not believable.  Its one of the those movies, that shouldnt have been made!"
    },
    {
      "rating": "1",
      "text": "I wasn't expecting heavy dramatic turns but this thing was far worse than I expected. The dialogue was simply awful. And I found myself laughing at things that weren't supposed to be funny which is obviously never a good sign."
    },
    {
      "rating": "4",
      "text": "If you really like to watch chase scenes, on bicycles, then this movie is for you.  I enjoyed the flashback-back and forth  timeline presentation and some of the stunts where cool but it got old quick.  I think it got lost between trying to be clever and action backed.  In the end I was disappointed."
    },
    {
      "rating": "4",
      "text": "The film was overall decent. While it did have a very big cool factor, the plot was a bit non-existent, the writing was not very memorable, but the structure was at least interesting.  While some people loved Michael Shannon's acting in this film, I could not help but be pulled from the film with every word he uttered. His voice grated on me like the asphalt in a bad bike crash. The film had good sequences, but I hardly remember what happened and I only saw it about three hours ago. I didn't expect much from this film, and I got what I expected."
    },
    {
      "rating": "1",
      "text": "No plot. Completely flat characters. Villain is not redeeming in any way. Damsel in distress also not very likable. Incredibly serious things happen with no consequences. Really dumb decisions made by characters for the purpose of making the movie have anything happen at all. Majority of humor involves a Chinese phonebook and a very muscular black man. Absolutely terrible conclusion. Only thing to watch in this movie is the bike chase sequences and they're not great."
    },
    {
      "rating": "10",
      "text": "Premium Rush is the break-neck action chase film of the summer. The film will be released on Blu-ray and DVD tomorrow. Joseph Gordon-Levitt presents the audience with his continuous charm no matter what role he portrays. The film is fun to be a part of from start to finish. One of the best films of the year!"
    },
    {
      "rating": "8",
      "text": "Lots of fun with JGL charming as always and Michael Shannon chewing the scenery to hysterical effect. It is fast and energetic with some laughs and some genuine thrills. Yeah, the plot is slight, but the movie knows that. It just wants us to have a good time."
    },
    {
      "rating": "2",
      "text": "Awful movie. Very silly. It has the feel of a low-budget, one hour teen drama. It's such a piece of garbage that it should be crumpled up and covered in the old food you threw in the trash. I paid six bucks to rent this turd and I'm not even gonna finish it. I should have flushed that six bucks down the toilet. It would have been far more entertaining. I feel great after dumping on this movie. Premium Crap."
    },
    {
      "rating": "5",
      "text": "Really boring script and storyline- only thing that keeps this moving going is Joseph Gordon-Levitt and the solid production value. The overall tone seems to be a bit confused."
    },
    {
      "rating": "4",
      "text": "Brief, self-congratulatory, feels padded out. At times the narrative will maddeningly drop what it's doing to show off some stunts, then pick itself up again. Characters are cardboard cut-outs, all are EXTREME or HARDCORE, in all-caps. Reminds of those 90s films centred on BMX/Surfing/Rollerblading(?)"
    },
    {
      "rating": "7",
      "text": "Joseph Gordon-Levitt's New York bike movie \"Premium Rush\" might at times be corny, but overall its a great film bursting with liveliness, vigor, and energy."
    },
    {
      "rating": "9",
      "text": "'Premium Rush' boasts its own sort of edgy content and intense sequences while maintaining a realistic approach, it involves the bikers who risk their lives everyday on the bustling streets of New York City to deliver mail big and small as they traverse the maze that they have mapped out in their heads, taking the quickest route possible which may involve breaking a few rules of the road including running the odd red light or figuring out ways on the spot to avoid a bad collision, these messengers don't get paid enough, but perhaps the thrill of the ride keeps them going, they tick off most of the city and are constant hassle for the busy traffic of the city, but everyone has to do their job. This is primarily a chase film full of adrenaline and not very much slowing down, the title borrows its name from the concept of the extra charge for a fast delivery, but it could definitely refer to the quick paced and non-stop motion of the film, it has plenty of characters who don't particularly have much depth, but then again this seems intentional due to the pace of the film, which sets itself around one particular messenger, Wilee (Joseph Gordon-Levitt) as he picks up a ticket on one of his runs that actually acts as a receipt to a hefty sum of money which a corrupt cop (Michael Shannon) is after to pay off some serious gambling debts, he is primarily behind the daredevil Wilee for much of the film, always chasing him and trying to find new ways to take him down. But these bikers don't seem to risk their lives for the mediocre pay, but more for the thrill and to get there on time. But pretty soon, many others get involved in this game of cat and mouse including Wilee's on/off girlfriend Vanessa (Dania Ramirez) who is also under the watchful eye of the physically impressive Manny (Wolé Parks) who competes time and time again with Wilee, but as mentioned, they all have their part to play when the stage is set for thee faster paced finale. This is a chase movie first and foremost, with some excellent effects as Wilee judges his route, one can only applaud the stunt doubles used throughout the film, the chase sequences are intense and full of life, but this is isn't an insightful or a film with profound meaning, it's all for the entertainment and for this reason, it succeeds in every way."
    },
    {
      "rating": "4",
      "text": "By now, it's no secret that I'll watch anything with Joseph Gordon-Levitt in it. When I saw he was going to be in an action thriller, about bike messengers in Manhattan, I couldn't wait to see it, but sadly I was very disappointed. It's a normal day for bike messenger Riley (Joseph Gordon-Levitt), as he picks up a package and goes on his way. Everything is fine until a strange man tries to run him down and steal the package. From there its a race through NYC to see who gets the mysterious package first. Premium Rush is Gone In 60 Seconds on bicycles. The plot is weak, the story is predictable, and the whole film is basically one big chase through Manhattan. Yes, Premium Rush is exciting at first, but after a half hour, it gets very tiresome, very quickly. JGL tries his hardest to turn this film into something, but even a star of his caliber can't save this film, because there really isn't anything to save. It's as if the producers said, lets have a car chasing a bike in New York City and develop some kind of story around that. It doesn't work, because seldom I have been this bored and frustrated by an action movie. It stars one of my top 10 favorite actors, but there really isn't much of a role for him to play. I really hate to say it, but this film is a complete loser, don't waste your time on it."
    },
    {
      "rating": "3",
      "text": "It starts off extremely slowly. However, once they get into the envelope and what is in it and the chase with the cop gets going, it picks up quickly. However, since the beginning almost put me to sleep, the movie wound up being around mediocre to average. If the film was just the second half, it would've been a fantastic movie."
    },
    {
      "rating": "5",
      "text": "Script-4/10\rIt was decent but predictable.\rActing-5/10\rLevitt is the new superstar of the industry now & he did good,others were just OK.\rVisual-6/10\rDirection & camera work was good.\rEntertainment-5/10"
    },
    {
      "rating": "8",
      "text": "I watched it and enjoyed it very much, but from the get go it was clear to me what kind of movie this was, and a big part of my enjoyment came from not expecting something else. Premium Rush does not try to be a serious movie, nor does it try to create a complex plot, nor does it try to be realistic. Rather, it is a very fast-paced original action movie with great, fun characters mashed together on a simple and mostly irrelevant plot. This movie is great fun, go watch it!"
    },
    {
      "rating": "7",
      "text": "It`s fun and \"unique\", I give it points for showing how he thinks of his next move. I like that I`t didn`t have unnecessary scenes likes so many movies. One of the best things about this movie is most things he does with the Bike are believable. I also like how they changed time lines to tell the story. I wouldn`t go as far as to say one of the best movies of 2012. A good movie but people going that far need breaks on their bikes."
    },
    {
      "rating": "7",
      "text": "This briskly-paced and deftly-woven popcorn bag of entertainment follows a Manhattan bike messenger (played wonderfully by Joseph Gordon-Levitt) as he finds himself suddenly embroiled in an alarming chase  centered around a mysterious package he is set to deliver by 7 p.m. The plot is very cleverly-written, the film is well-executed, and overall it's just a real bit of fun."
    },
    {
      "rating": "7",
      "text": "I know what you're thinking. An action movie about a bike messenger? Yeah, that's what I thought too going into it, but don't be so quick to rush to judgement. \"Premium Rush\" is a chase movie about the daredevils who work as Manhattan bicycle messengers--with a map of the city imprinted in their brains. They hurtle down sidewalks, run red lights, go against traffic. \"Premium Rush\", as suggested by the title, is heavier on action scenes-- and thiner on the story line. Call the movie what you want--you can't call it lifeless or fun.\r Joseph Gordon-Levitt stars as Wilee, the movie's daredevil protagonist. His girlfriend Vanessa (Dania Ramirez), has broken up with him without explanation--and to make matters worse, she's palling around with his co-worker arch-enemy Manny (Wole Parks). Not that this is his only source of frustration. A law school dropout--Wilee loves the freedom and adrenaline rush of pedaling nonstop across the city. Wilee's backstory includes a stint at Columbia Law where he refused to take the Bar when he realized hurdling it meant a lifetime of offices and gray suits. His Houdini-esque escapes from the cops and car crashes are a major part of the \"Premium Rush\" allure. \"Premium Rush\" has cast Michael Shannon as the film's heavy, unhinged and volatile detective, Bobby Monday. The secret of what Wilee is carrying in his messenger bag is stretched out--but it nevertheless seems unlikely that a courier would risk life and limb to protect its contents. The riding is fun to watch for a while, but it becomes repetitive to all but the most serious bicycle gear heads.\r The film rides the fine line of PG-13 and R-rated in different parts of the story--and think it would have benefited greatly by taking the path of a more gritty adult-oriented tone. It has its moments, but it tends to flutter back and forth between goofiness and tough street story too often. The ending isn't satisfactory, and feels feels like a cop out. Despite it's shortcomings and thin story line--the overall results is a fun watch with plenty of street-level action."
    },
    {
      "rating": "3",
      "text": "Plot is nowhere near as interesting or entertaining as it should be."
    },
    {
      "rating": "8",
      "text": "Premium Rush wont let you down. I find chase movies to be cliché and stereotypical sometimes but this one has redefined the genre into a hell ride of thrilling bike cycling scenes, a captivating plot, and very brave performances from Joseph Gordon-Levitt and Michael Shannon. It has a fascinating way to tie up the whole story. Also, I have to praise David Koepp for his outstanding writing and directing. Everything in the film worked out and there are no flaws for its quality. I just thought that there were some wasted opportunities. When I first saw the trailer, I was expecting it to have more crazy bike stunts ala Torque meets Fast & The Furious. But still, this did not changed the way I look at this movie.\r Overall: Premium Rush proves that you don't need that much violence to pull off an action-thriller film. The characters are diverse and the direction is excellent just like Koepp's last movies."
    },
    {
      "rating": "4",
      "text": "Be careful on the streets of New York. You'll find mayhem, close-calls, accidents, rude behavior, violence, and danger; and that's just from the bicycle messengers.\r Premium Rush is the story of one of those messengers (played by Joseph Gordon-Levitt) who must make an important and urgent delivery through Manhattan rush-hour traffic. Gordon-Levitt's character, Wilee, is such a maniac that he rides a bike without brakes, derailleur gears or de rigueur rails.\r Joining Wilee on this thrill ride are Manny (Wolé Parks) and Vanessa (Dania Ramirez). I don't know if this film is supposed to make us feel some sympathy for the plight of the downtrodden bicycle messenger, but I personally was rooting for the bad cop (Michael Shannon) to haul their hazardous hineys to the hoosegow for being the dangerous road jerks that they are.\r The acting is uneven at best. Ramirez must have gone to the Scowling-Is-Acting School for Young Thespians. Not that she can't make a career out of a scowl. Bruce Willis has been a show-biz success for nearly 30 years with no discernible asset other than a smirk. Shannon's acting isn't much better. I've enjoyed his previous work in Boardwalk Empire and the excellent Before the Devil Knows You're Dead. Here, however, he vacillates between a tough-as-nails Cagney-like bad guy to an exasperated high-pitched whining comic-relief character reminiscent of Curly Howard.\r Most of the film's 90 minutes, is spent wheeling on bicycles through traffic. I found it rather tiresome (ha ha! get it? tiresome... tire... you know... bicycle... forget it).\r If it's bicycles and a thrilling chase that you have a craving for, watch two movies  Breaking Away and Bullitt. You'll get the fix you need and see two infinitely better films in the process."
    }
  ]
}