{
  "id": 1584,
  "title": "Pretty Woman",
  "starring": [
    "Richard Gere",
    "Julia Roberts"
  ],
  "runtime": 119,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "When a millionaire wheeler-dealer enters a business contract with a Hollywood hooker Vivian Ward, he loses his heart in the bargain.",
  "releaseYear": "1990",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hVHUfT801LQATGd26VPzhorIYza.jpg",
  "categories": {
    "plot": 8.818181818181818,
    "acting": 8.6,
    "ending": 6.333333333333333,
    "soundtrack": 9.5,
    "cinematography": 9.333333333333334,
    "familyFriendly": 3.0,
    "funny": 7.111111111111111,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "This is a pretty greaaaat movie to watch.  Don't expect too much depth, but it's just a load of laughs and fun.  The ending is cliche and there are parts that are just bad.  But it's great to check out Julia Roberts earlier in her career."
    },
    {
      "rating": "10",
      "text": "This movie is a classic. I will never understand how can somebody hate it. Sure there are some things that we not like in this modern era but these short comings can be easily overcome by the stunning cast, the authentic comedy and great music"
    },
    {
      "rating": "10",
      "text": "Julia Roberts and Richard Gere star in the 1990 film entitled Pretty Woman... Just purely romance or a romantic comedy is irrelevant because it's certainly the greatest romantic film ever made. Julia Roberts is a hooker on Hollywood Boulevard who makes an arrangement or something with businessman Edward Lewis (Richard Gere) and she soon falls in love with him expecting the Cinderella ending. Full of beautiful cinematography and acting and the chemistry between them both work. Lovely soundtrack and perfect film with no faults in it. May contain scenes of sex or bad language."
    },
    {
      "rating": "0",
      "text": "the original capt-save-a-ho. who in their right mind is going to wife up a street walker whos been plowed by only GOd knows how many guys? the only people this movie appeals are the naive and not very bright. Typical trashy romcom. Its FlashDance without the dancing."
    },
    {
      "rating": "10",
      "text": "Um verdadeiro conto de fadas moderno. Bela história. Os protagonistas interpretaram muito bem os papeis, principalmente a bela Julia Roberts. Fora a trilha sonora que é muito nostálgica."
    },
    {
      "rating": "8",
      "text": "Classic love story. Boy loves hooker, hooker needs money, hooker loves boy. A classically classic film. Soon to spawn a sequel Pretty Woman 2: Even Prettier Woman."
    },
    {
      "rating": "6",
      "text": "\"Pretty Woman\" wasn't a great movie but I am truly shocked that I even liked it at all. By all merits this is a film that you give your \"3\" and \"2\" ratings, but somehow, something in this film makes me not dislike it. Maybe it's the sincerity?"
    },
    {
      "rating": "10",
      "text": "Não tem nenhum defeito, me emocionei e criei expectativas praticamente inalcançáveis!"
    },
    {
      "rating": "8",
      "text": "The premise may be simple and commonplace within the industry. Nevertheless, the writer takes chances that truly pay off. All other romantic comedies since have surely been influenced from it."
    },
    {
      "rating": "7",
      "text": "It was surprisingly a quite charming movie. Julia Roberts was funny, witty, and intelligent in this role. This is most certainly not the type of film I would enjoy but the overall light romantic feel about the movie made it pleasurable to watch."
    },
    {
      "rating": "8",
      "text": "A romantic comedy that actually makes good use of both of its genre components, \"Pretty Woman\" is a hilarious piece of film with a sharp script, solid performances, and a hefty plateful of sentimentality."
    },
    {
      "rating": "2",
      "text": "I'm surprised this movie has any traction at all. I agree Julia Roberts was the best thing in it. But the plot was totally ridiculous and Richard Gere mailed it in.  I never got a sense of their chemistry at all."
    },
    {
      "rating": "10",
      "text": "This is an excellent picture which shows how two complete strangers with totally different occupations can form a close bond. It does a good job of depicts how life was like on the streets of Beverly Hills back in those days. The emotions that fill this story are a combination of love, sadness and brittle humor. This has to be one of the all-time greatest Julia Roberts films ever produced and the on-camera chemistry between her and Richard Gere shines through."
    },
    {
      "rating": "7",
      "text": "Vivan is a street prostitute. We know almost nothing of her life, nor the reasons why she has taken the path of prostitution, but she is notoriously beautiful and stands out among the other girls who, along with her, wait for anyone who wants them. By chance, his path intersects with that of Edward Lewis, a millionaire who made a fortune buying and dismantling failed companies. We are not sure why he decides to hire her, it seems like a decision made at the moment ... but the fact is that he changes her life in a way that reminds me of \"Breakfast at Tiffany's\" ...This romantic comedy departs from rather unrealistic assumptions. Even millionaires who hire prostitutes do not usually go to the streets to look for or relate to them. On the other hand, a street prostitute would never look as clean and immaculate as Julia Roberts in this movie. Here are some flaws in realism that can compromise history, depending on how important each one gives them. But ultimately, it's a dream movie. \"What's your dream? Everyone in Los Angeles has a dream.\" That's what a man on the streets says during the movie, and that can almost be the moral of the story: there are dreams that, with a touch of luck, can come true.I loved Julia Roberts's performance ... this movie helped the actress jump to stardom, which was pretty fair. She has talent and presence, as we will see in later films (Notting Hill, Erin Brockovich, etc.). Richard Gere makes a good romantic match with her and is credible in the role of a millionaire who has failed in love and seems in need of female attention. Both dominate the movie and bring the best moments to life, ranging from romantic and moving scenes to the hilarious ones we can see. Next to them, a capable but discreet secondary cast, where Hector Elizondo stands in the role of a rigid and professional hotel manager.I think this movie has always been a risky gamble, if only because of the strong prejudice society still holds towards prostitution. And I believe some have written harsh criticism of this movie just for involving a prostitute in the story. But prostitutes are not vile, polluted and sick creatures who must live on the fringes of society. Often it is women (and men) who have had no luck in life, or made the wrong choices, or immigrants who have been deceived and are trying to make money without harming anyone, often under the cruel dictatorship of pimps who only think about profits. Glamorizing prostitution is a mistake, but diabolizing is even worse. It is a sign of a small mind and lack of Christian values and empathy for those who have been less fortunate than us. Worse than living off making money with one's own body is killing or stealing, and there is no shortage of films that glamorize theft and murder without anyone caring about it."
    },
    {
      "rating": "5",
      "text": "Really overrated romantic comedy. Pretty Woman is a mediocre film. Basically the adult version of Cinderella. It's cliche, unrealistic, predictable, and even kind of pretentious. I love Richard Gere (Julia Roberts less so), but this is not one of his best films, though it's not one of his worst either. Not really a fan of Julia Roberts to be honest as I find her quite overrated. The songs are not even that good, they're just meh. This movie has not aged well. I prefer Unfaithful."
    },
    {
      "rating": "8",
      "text": "Pretty Woman is a great love film, one that could easily be one of my favourites. I'm ignoring all the controversy here, apparently people hate this film because it hasn't aged well?Edward Lewis is a wealthy businessman and there is nothing more important to him than screwing over companies and making money in the process. Vivian Ward is a Hollywood prostitute making $100 an hour, trying to live off this for a living. They're two completely different people but they couldn't be more perfect for each other, they do the same job but in different contexts. This one similarity is enough to make both of them better people, no matter how much money is in-front of them.Overall the technicalities of the film were good. The cinematography didn't do anything special to remember but wasn't bad. I wish music was used a bit more, for example the use of \"It Must Have Been Love\" was perfect and I think there were some missed opportunities earlier in the film. Editing was clean, scenes being held for a correct amount of time for emotion. I think emotion is the most important aspect in this genre."
    },
    {
      "rating": "7",
      "text": "This was a good movie. Light and romantic."
    },
    {
      "rating": "10",
      "text": "This movie is great to watch with your girlfriend. It is romantic and looks great."
    },
    {
      "rating": "9",
      "text": "Perhaps only hopeless romantics like me can appreciate and give this movie a 10. I'm giving it a 9 though. The story is perfect. Funny, light and romantic. They could've changed the ending though, make it more dramatic."
    },
    {
      "rating": "10",
      "text": "This movie is full of romance and happiness and saddness. It is heart ripping and heart warming. It is a movie i recommend to anyone."
    },
    {
      "rating": "4",
      "text": "A very slick, polished, rom-com go deeper and you'll find its pretty shallow. All its talk of fairytale ending, equality and dreams coming true sits side by side in a materialistic, greedy and class orientated Hollywood. Cold and calculated."
    },
    {
      "rating": "5",
      "text": "Intellectually and emotionally dishonest in that because it wants to be \"Cinderella,\" it never depicts what this \"pretty woman\" really does to earn a living."
    },
    {
      "rating": "0",
      "text": "It's perfect it stars Richard Gere as he is so smug that you can really believe the only person who likes him is someone he buys. I cannot believe anyone thinks this movie is romantic. She's his latest purchase. There should be a sequel where he gets a trade in for her."
    },
    {
      "rating": "10",
      "text": "A cult classic that I would describe as love story that feels like a modern fairy tale. The charming story and great lead actors made this a remarkable experience. Also it is one of the few love stories man like to watch as much as women (but only a few will admit this ;-). The story follows the highly successful investor aka corporate raider Edward Lewis. He has a crisis when his girlfriend breaks up with him as he asked her to accompany him on a business trip. Irritated he drives alone to the trip but because he is accustomed to a chauffeur he lost his way and ends on the Hollywood Boulevard in the red light district. He asked the sex worker Vivian for help while she is thinking he is a costumer. Charmed by her free and nice spirit he hires her to play his girlfriend for the business trip. Here I stop to avoid spoilers. Like I said it is a beautiful love story that feels sometimes like a modern fairy tale. It is so charming that it won me over immediately and I am not someone who likes love stories that much. A lot of the appeal comes from the main actors. Richard Gere as Edward and Julia Roberts as Vivian are truly excellent and have a near perfect chemistry. The other actors are a fine addition and I praise especially Laura San Giacomo as Vivans room mate / friend, Hector Elizondo as hotel manager and James Bellamy as company owner that Edward wants to profit of. A really great cast. I must also praise the cast behind the camera with director Garry Marshall, writer Jonathan F. Lawton and all the others. Another strength was the soundtrack and “(Oh) Pretty Woman “ by Roy Orbison is a timeless classic. “It must have been love”, Show me your Soul” and the other tracks round up the movie. Overall this became a cult classic and box office hit with making over 400 million while only costing around 14 million dollar. I truly enjoyed the movie and recommend it."
    },
    {
      "rating": "8",
      "text": "Pretty Woman is a very entertaining film indeed. However, for me, it isn't completely perfect, there were times when the script could have been developed a LITTLE more, and the film itself is a bit on the long side. But overall, you have a charming and entertaining movie. Richard Gere is a charming lead, and I do find him charming in everything he's in. Julia Roberts is wonderful also as Vivienne Ward, a beautiful but down on her luck sort of woman. I will confess I am not a Julia Roberts fan, but she put a lot into this film, and it showed. I was also really impressed with the supporting performances from Jason Alexander, Ralph Bellamy and Hector Elizondo. The film also has some excellent camera-work and well-intentioned direction, with a very lovely scene in the opera house, showing La Traviata, one of the world's saddest operas. The script, while a little frothy and contrived at times, still had a lot of humour and heart. Overall, I really liked this film, it made me feel good, like it promised. 8/10 Bethany Cox"
    },
    {
      "rating": "6",
      "text": "It is fairly typical stuff one would find out of a romantic comedy and it loves all things materialistic. Nonetheless, \"Pretty Woman\" works as a pleasant breeze of a film thanks to the character developments that happen between Gere and Roberts."
    },
    {
      "rating": "10",
      "text": "J'en ai longtemps entendu parler comme \"Le plus grand film d'amour de tout les temps\"... Je n'ai jamais réellement apprécié ce genre de film, car je trouve souvent les personnages sans personnalité, pour que le spectateur moyen s'identifie à ce personnage et c'est là toute la magie de pretty woman, c'est qu'au lieu de s'identifier au personnage, on en tombe amoureux. C'est un beau film à voir absolument. \"Le plus grand film d'amour de tout les temps\""
    },
    {
      "rating": "10",
      "text": "I've been familiar with the film since I was a child. I watched it many times. I always wanted to lead a life similar to that of Richard Gere's character. But recently I came across a new perspective on the content of the film, which opened new horizons for reflection and allowed me to reassess my views on the fate of the characters and mine too. This video can be found by typing in the address bar .a little known but foolproof technique of Influencing people."
    }
  ]
}