{
  "id": 331,
  "title": "Pretty in Pink",
  "starring": [
    "Molly Ringwald",
    "Harry Dean Stanton"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Romance",
    "Drama"
  ],
  "description": "Andie is an outcast, hanging out either with her older boss, who owns the record store where she works, or her quirky high school classmate Duckie, who has a crush on her. When one of the rich and popular kids at school, Blane, asks Andie out, it seems too good to be true. As Andie starts falling for Blane, she begins to realize that dating someone from a different social sphere is not easy.",
  "releaseYear": "1986",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jeFJyzJBufJexpOuywuPp8q2tCJ.jpg",
  "categories": {
    "plot": 8.090909090909092,
    "acting": 8.0,
    "ending": 7.5,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.8,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Good story, cool pre-fame actors and awesome music."
    },
    {
      "rating": "10",
      "text": "Pretty in pink is a great comedy drama with Molly Ringwald from The Breakfast Club. The movie has\ra great screenplay and all of the characters are fascinating. This is one of the best movies of the 80's."
    },
    {
      "rating": "7",
      "text": "I like John Hughes's movies, but Pretty in Pink is not a favourite. It is too short, and the story structure is occasionally too hackneyed complete with an ending that didn't quite convince me. But it was strikingly filmed, with an agreeable soundtrack, snappy script, bouncy pacing and good direction. When it comes to the acting, it is quite good, and the characters are at least likable. Molly Ringwald holds this movie together, and she is very good. Andrew McCarthy and James Spader are also appealing, while Harry Dean Stanton and Annie Potts are sterling. Overall, Pretty in Pink is not a John Hughes classic, but it is worth the watch at least once. 7/10 Bethany Cox"
    },
    {
      "rating": "6",
      "text": "Howard Deutch and John Hughes' \"Pretty In Pink\" is a serviceable 1980s teenybopper dramedy that delivers enough chuckles and smiles to surmount its lackluster ending."
    },
    {
      "rating": "8",
      "text": "I don't know about this but I gotta say that Pretty in Pink is quite a good film for an 80's film as you all may know that I'm a huge fan of 80's films and 80's songs. I've heard that it's famous, well, for the most part for being a cult classic because of they're have some good tunes like Pretty in Pink by The Psychedelic Furs and If You Leave by OMD aka. Orchestral Manoeuvres in the Dark. The script is written by \"Brat Pack\" director, John Hughes and it's kind of a Cinderella story about a High school girl named Andie Walsh played by a really young, Molly Ringwald who lives with her father played by Harry Dean Stanton. Then Duckie played by \"you know him from Two and a Half Men\", Jon Cryer is in love with her, but is afraid to tell her how he truly feels. Steff played by James Spader who is secretly in love with Andie and Blane played by Andrew McCarthy who is Steff's best friend and eventually asks Andie out for the prom. So the whole thing is about that she must choose between the affections of dating her childhood sweetheart or a rich but sensitive playboy. I don't know what I like about this movie but all I can say that the ending is disappointing. I was expecting more from it but after I watched it the day after, I decided to watch it again and I kind of got over it but I still think that the end is disappointing. Aside from that, the film itself is cool and I liked it. One thing I like is that Jon Cryer's character \"Duckie\" is dancing while lipsyncing to \"Try a Little Tenderness\" by Otis Redding. That scene is amazing! Now for a Cinderella story, it's quite simple. I mean, Molly Ringwald plays this Cinderella kind of character, Jon Cryer's character is kinda like a sidekick kind of character, Jaq. Andrew McCarthy's character, Blane is Prince Charming for the most part because of his charming personality. James Spader is like this evil stepmother but an evil stepfather kind of character who is cruel to Andie. Well, that's is a perfect way to describe this coming-of-age tale of Cinderella's version of Pretty in Pink, in the teenage way. I would definitely recommend this movie for those who are a fans of 80's comedies especially dramas and all the genres. The film is a good coming-of-age comedy drama film for it's good 80's tunes and a bittersweet story to come by."
    },
    {
      "rating": "7",
      "text": "Pretty In Pink(1986)\rStarring:Molly Ringwald,Harry Dean,Jon Cryer,Andrew Mccarthy,Annie Potts,James Spader,Jim Hayne,Alexia Kein,and Kate Venon\rDirected By:Howard Deutch\rMy Review\rBLANE'S A PRETTY COOL GUY. ANDIE'S PRETTY IN PINK. AND DUCKY'S PRETTY CRAZY.\rI was expecting a little bit too much from this 80's film. Whenever I think of an 80's movie and one of the main stars is Molly Ringwald who was supposedly very famous during the 80's I think that the movie is going to blow me away from start to finish, although this one just didn't. I believe it has to do with the fact that these characters aren't doing anything that the audience might consider memorable. I'll probably forget most of what happened in this movie sooner or later, cause nothing here is memorable.\rNot to say the film is bad or anything,cause this movie isn't bad it just didn't meet my expectations.\rThe film is about Andie Walsh (Molly Ringwald) is a teenager who lives in the dingy part of town with her terminally underemployed dad (Harry Dean Stanton). She works at a record store with eccentric Ionia (Annie Potts) and is considered a misfit at her uppity high school, but somehow she rises above them all. Her oddball best friend, Duckie (Jon Cryer), is hopelessly in love with her, so he causes trouble for her romantic pursuits. When local rich kid Blaine (Andrew McCarthy) develops a fascination with her, they go out on a date together. Visiting the home bases of each social clique, they are basically ridiculed for their audacity to date one another. When Blaine eventually asks the delighted Andie to the prom, he is threatened by his rich friend Steff (James Spader). The romance versus high school social politics finally culminates at the big night of the prom.\rThe acting is still very good from all the actors in the film, I just didn't feel anything in this movie's run time or say hey that looks like fun. It came good for a laugh though. It was still very enjoyable. When the end credit's rolled and I saw James Spader's name i was like o my goodness cause my mother watches his show The Blacklist. It may have been funny but it didn't have any memorable funny one-liners or actions done by the cat.\rThe movie is very good but not very memorable I give Pretty in Pink a 3 out of 5."
    },
    {
      "rating": "7",
      "text": "This is a fun watch - very much an 80s teenager film, with a coming of age angle to it I suppose. Its amusing enough seeing Jon Cryer (of Two and a Half Men fame) lip sync to 80s music. Some of the dialogue is witty and/or amusing. It does have a cringe factor but that's mainly due to the fact its a 1980s film, which is hardly surprising considering the film dates from the 80s! it features a great soundtrack and some good acting. I thought its a good, fun film, not too complicated or unnecessarily crude, this is worth a watch if you get the chance."
    }
  ]
}