{
  "id": 570,
  "title": "Prey",
  "starring": [
    "Amber Midthunder",
    "Dakota Beavers"
  ],
  "runtime": 100,
  "genre": [
    "Thriller",
    "Action",
    "Science Fiction"
  ],
  "description": "When danger threatens her camp, the fierce and highly skilled Comanche warrior Naru sets out to protect her people. But the prey she stalks turns out to be a highly evolved alien predator with a technically advanced arsenal.",
  "releaseYear": "2022",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ujr5pztc1oitbe7ViMUOilFaJ7s.jpg",
  "categories": {
    "plot": 4.857142857142857,
    "acting": 5.0,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "This is B movie material that doesn’t go anywhere. The setting is the only thing going for this movie that never really comes together. Even that falls flat as it is just left as a backdrop from the really strange setup to why the main character ends up there in the first place. The small cast does fine in their roles, but the choices made for exposition and who/how it’s delivered is almost hilarious. I can’t say that this falls into the “so bad it’s good” category either. There’s really not much mystery left of what’s happening on the island, yet much is let to the viewers imagination. Once the initial intrigue wears off and the plot is spoon feed to you your left with the decision of weather or not a nap might have been a better choice then to continue to watch this movie. I did both."
    },
    {
      "rating": "6",
      "text": "Blumhouse produced this nifty teen version of Predator. It centers around a young man who goes on a sort of survival retreat after his father is murdered. After arriving solo he soon discovers hes not alone. He gathers up his strength to try and survive until the boat comes back. It's a suspenseful little horror flick even though it's a bit underdeveloped. More character and story work would have really hit the concept home. All in all not a bad watch.6/10"
    },
    {
      "rating": "5",
      "text": "Unfortunately, the film somehow didn't appeal to me the whole time. I liked the setting, but otherwise the film left me cold without much emotion. The characters didn't engage me. Not much of a story either. The action sequences were also not much. For me, this is an average film. I don't know who I would recommend this to. I would rather advise you to skip this film."
    },
    {
      "rating": "2",
      "text": "Spoilt brat gets dumped on a Malay island as part of some self-help rubbish but the girl he meets on the island is actually possessed and starts hunting him down."
    }
  ],
  "recommendations": [
    "the_rental",
    "the_forest",
    "the_autopsy_of_jane_doe",
    "the_beach_house",
    "flightplan",
    "the_woman_in_black_2_angel_of_death",
    "identity",
    "the_rhythm_section",
    "hotel_artemis",
    "the_skeleton_key",
    "i_see_you",
    "a_cure_for_wellness",
    "how_it_ends",
    "the_purge",
    "escape_room",
    "the_uninvited",
    "evil_eye",
    "all_i_see_is_you",
    "the_voyeurs",
    "stowaway",
    "the_purge_anarchy",
    "the_manor",
    "no_escape",
    "escape_room_tournament_of_champions",
    "contagion"
  ]
}