{"id": 2270, "title": "Pride and Prejudice and Zombies", "starring": ["Lily James", "Sam Riley"], "runtime": 108, "genre": ["Romance", "Horror", "Comedy", "Thriller"], "description": "A zombie outbreak has fallen upon the land in this reimagining of Jane Austen's classic tale of the tangled relationships between lovers from different social classes in 19th century England. Feisty heroine Elizabeth Bennet is a master of martial arts and weaponry and the handsome Mr. Darcy is a fierce zombie killer, yet the epitome of upper class prejudice. As the zombie outbreak intensifies, they must swallow their pride and join forces on the blood-soaked battlefield in order to conquer the undead once and for all.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jsJlOhVHiz1xXr36616EI8tJ4b2.jpg", "categories": {"plot": 6.40625, "acting": 6.275862068965517, "ending": 6.0, "soundtrack": 6.0, "cinematography": 5.5, "familyFriendly": 6.0, "funny": 5.222222222222222, "action": 5.25}, "reviews": [{"rating": "6", "text": "Every once in a while, no matter how high your standards are when it comes to movies, no matter how many good or bad movies you've seen...and no matter how much knowledge you have when it comes to film production and how to critically analyze a film...you will always have that one movie you will call a \"guilty pleasure\", even though you are fully aware that the movie is not that good in terms of writing.\r 'Pride and Prejudice and Zombies' is the definition of a \"guilty pleasure\", or a \"cult movie\" simply because...well...read the title, this is also the definition of a \"what you see is what you get\" kind of movie. Plus, a movie where young, attractive girls go around decapitating fast zombies is hardly going to score certified fresh on 'Rotten Tomatoes'. I know 'Deadpool' (2016) did, but that's because that movie is fully aware that it was a movie...there are times where this seems to take itself more seriously than it should, there are no fourth wall breaks, nor are there any references to anything else...it pretty much is what the title promises it to be.\r The movie stars the wonderful Lily James as Elizabeth Bennet, you will also have no trouble remembering her as Lady Rose in the hit ITV period drama 'Downton Abbey', or her breakout movie role as the innocent Disney Princess 'Cinderella' (2015). It is exciting to see Lily James go from an innocent and vulnerable princess into playing a full, fleshed out zombie killer who can wield a knife and can also punch and kick about as good as Mulan.\r There is almost nothing else I can say about this movie...I had fun watching Lily James along with her co-stars that include; Sam Riley, Douglas Booth and Matt Smith blowing up zombies heads all over. Although, if you've recently seen the R-Rated superhero flick 'Deadpool' (2016) (which I really liked), you will be underwhelmed by the PG-13 level violence, and that there is a lack of some raunchy sex scenes, and the only thing we get is a glimpse of Lily James revealing cleavage when part of her dress is torn. Is there anybody else out there that wants to see her exposing herself? Just me? Only asking...\r Some of the comedy in this movie, mainly from Matt Smith, does feel awkwardly shoehorned from time to time, and you do feel that this movie is trying to be like 'Shaun of The Dead' (2004), but the level of comedy and violence is not as extreme here. But if all you want to see is a group of girls from the 19th century killing zombies with >some< bloody results...this movie will satisfy you if that's what you look for when it comes to going to the movies.\r Overall, I did have some fun with this movie, I acknowledged that this is not a great and fun movie like 'Deadpool' (2016), but at least it isn't unbearable to watch. Lily James definitely will get some of the young lads watching, and maybe Douglas Booth could prove to eye candy for the ladies...the acting is actually pretty good considering that this movie is almost on par with some of those B-Movies like \"Strippers vs Wearwolves\"...or something ridiculous like \"Girls in Bikinis fight Vampires\"...that movie doesn't exist...yet, you know someone out there will make it soon.\r Overall, not as violent or sexually charged as 'Deadpool' (2016) (I know I keep mentioning that movie), but it's always best to use your imagination...I know I'm going to be seeing this again...but there are better movies out there..."}, {"rating": "7", "text": "-Pride and Prejudice and Zombies (stylized as Pride + Prejudice + Zombies) is a 2016 British-American comedy horror film based on the 2009 novel, Pride and Prejudice and Zombies by Seth Grahame-Smith that parodies the 1813 novel Pride and Prejudice by Jane Austen. The film is directed by Burr Steers, who wrote the adapted screenplay, and stars Lily James, Sam Riley, Jack Huston, Bella Heathcote, Douglas Booth, Matt Smith, Charles Dance and Lena Headey.\r -The film was released by Screen Gems on February 5, 2016 in the United States, and by Lionsgate on February 11 in the United Kingdom and Ireland. The film grossed just $16 million worldwide against a budget of $28 million, making it a box office bomb.\r --Critical response:\r -The film received mixed reviews from critics. On Rotten Tomatoes, the film has a rating of 43%, based on 141 reviews, with an average rating of 5.4/10. The site's critical consensus reads: \"Pride and Prejudice and Zombies manages to wring a few fun moments out of its premise, but never delivers the thoroughly kooky mashup its title suggests.\" On Metacritic, the film has a score of 45 out of 100, based on 34 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B–\" on an A+ to F scale.\r -Rafer Guzmán of Newsday wrote positively about the film, giving the film three out of four stars, calling it \"an unexpected and off-kilter treat, thanks to a BBC-quality cast and (un)deadpan humor.\"\r -Jesse Hassenger of The A.V. Club gave the film a C, commenting \"That this particular retelling of the Jane Austen novel feels like a Cliffs Notes version is understandable; that its zombie bits are equally rudimentary, though, is more disappointing.\"\r -Literary scholar and Austen professor Devoney Looser stated in Entertainment Weekly magazine her opinion of the literary quality of the film in the horror genre indicating that: \"I enjoy genre movies that attempt something different -- and this does -- but I didn't find it all that scary. I'd give it a 'B'\"…\r……………………………………………………"}, {"rating": "7", "text": "I enjoyed them taking Jane Austin's original writing and bringing a modern twist.  It is funny how Jane's language becomes comical in today's way of thinking.  If you like this storyline, enjoy the movie for what it is."}, {"rating": "6", "text": "As you can tell from the title, this Jane Austen classic has added the undead to the story of social class and romance. Sounds like it could be campy fun, but the filmmakers have taken it very seriously. Sure, the Bennett sisters dispatch zombies with kickass efficiency (and overdone editing), but too much of this film is taken up with the amorous interactions. The only variation from the serious approach is the prissy parson (played hilariously by Dr Who’s Matt Smith). Surprisingly, the traditional tale is pretty effectively told, but better versions have already been made. We want more zombies!"}, {"rating": "1", "text": "Pride and Prejudice and Zombies tries hard to thrill and scare, but the film just doesn't pick up. It's boring, uneventful, and at most parts, painful to watch. Lily James is the best part of the movie."}, {"rating": "6", "text": "this movie is legitimately entertaining at points and surprisingly well acted plus it has some really well shot action scenes. it however suffers from the same problem that Abraham Lincoln Vampire Hunter suffers from it takes itself way too seriously. the middle especially has several comments that wouldn't look out of place in a tradition Pride and Prejudice adaptation and that doesn't completely mesh with the silly premise. i will say however it doesn't suck and it's worth at least one watch."}, {"rating": "7", "text": "The clash of tone is admittedly peculiar, yet the cast manages to sneak in healthy chunks of humor and drama amidst the impending zombie apocalypse.\r Zombie infestation is spreading uncontrollably fast, they are literally everywhere, even in spin-off of Pride and Prejudice. It may sound bizarre at first, and it really is, but there's no lack of production value here. The presentation is top notch and the cast, mixed of actors from Maleficent, Cinderella, Doctor Who and Game of Thrones, deliver an air of seriousness beyond that expected from a zombie movie, also with unexpected degree of humor as well.\r This is still the story of British aristocrats and their so troubled lives in 19th century, though some aspects have been altered to accommodate zombies, even as far as to present backstory with heavy monologue and narration. It doesn't deter the movie from going full drama as the cast essentially creates a drama while acting like zombie killing is as the norm as sipping afternoon tea. These fine men and ladies look astoundingly fitting in the outlandishly bleak universe.\r Lily James, if born into different time, might be a legitimate princess. She looks comfortably convincing as Elizabeth Bennet, the zombie hunter version of the female lead at least. Sam Riley as Darcy is proper as well, he encompasses the awkward nobility with a fervent passion. These two have strange chemistry, especially when zombies are involved, yet it's weirdly adorably amicable. Matt Smith from Doctor Who fame, can singlehandedly delivers the humor, he’s simply too versatile and endearing not to have in old style England.\r The humor works splendidly, there are times when sarcasm is produced just right against the backdrop of the somber tone. Its playful romance, bantering and even cringe worthy moments are pleasantly delightful. However, the jarring tone can be too distracting at times. The movie screams too hard to set grim horror, a staple flaw in horror genre and on the other side of spectrum, it’s occasionally overly zealous in the drama that it becomes wallowing or slow.\r An odd bite of contrasting drama and comedy, yet surprisingly enjoyable, this seemingly crazy version of Pride and Prejudice can serendipitously attract audience of many different tastes."}, {"rating": "0", "text": "Take a classic novel, add zombies and it will go big at theatres. luckily people have better brain than some producers and rightly deserted this garbage...."}, {"rating": "8", "text": "The name alone should tell you exactly what you are getting into. It's the type of movie you are meant to just have fun with. It's knowingly silly and it's carefree nature allows the movie to have a great sense of humor about itself. There's even a surprising sense of genuine sweetness and solid action to give it a slightly more serious tone at times.\r As someone who has never experienced the Jane Austen novel, I cannot tell you just how well this holds up as a parody. I can say that the dialog is marvelously captures the writing one would find in a book of Jane Austen's era. The romance itself is solid and actually sweet, even if predictable in these modern times. The cast is just fantastic.\r Some elements of the plot though aren't up to snuff. Things move at such a brisk pace I found myself confused as to why certain characters were in certain places at specific times. It all holds together well, but there are some missing bits of context as is normally expected with movies based on novels.\r Despite being limited to a PG-13 rating, the zombie violence is still enjoyable. No it doesn't reach the gory heights everyone wants to see in zombie movies, but it's still has it's bloody fun moments. It's straight faced silliness keeps it from sinking into the cheesy depths of other B-rated horror comedies.\r The name really does tell you all you need to know. It lets you in on exactly what to expect and just how much fun you'll have with it. No, this is not a movie for everyone. Those looking for more serious zombie affairs should check elsewhere. However those knowing what we are getting into are sure to have a blast. It does exactly what it says it will do and it does it well. It's definitely only out there for a specific audience, but perhaps that's  all it's trying to be anyway. I, for one, found it to be thoroughly entertaining."}, {"rating": "3", "text": "Pride and Prejudice and Zombies isn't funny or scary. It tried to be both, but failed badly. When the characters aren't slaying zombies in a comedic fashion, the film is nothing more than an English bore set in the 1700's."}, {"rating": "5", "text": "Pride and Prejudice...or and there's Zombies in it as well.\r The story is about a zombie outbreak has fallen upon the land in Jane Austen's classic tale of the tangled relationships between lovers from different social classes in 19th century England.\r Pride and Prejudice and Zombies is just as ridiculous as it sounds. Just the thought of taking a classic novel and adding whatever monsters you can put in. It's been done before in movies, TV shows and novels. Now we've got this movie and you would expect a film like this to be a fun, gory and just a good time, but sadly that's not the case here, because Pride and Prejudice and Zombies isn't that good or fun.\r The problem that I had with this movie is that I had no fun at all watching it and the film takes itself way too seriously. A couple of times it dose lose focus on what it's doing and at one point completely forgetting that it's a zombie movie. I know the \"Pride and Prejudice\" thing is in the title so it would be like that, but zombies are in the title as well.\r The movie has a lot of interesting ideas (mostly with the zombies), unfortunately those ideas gets brush aside and what we get is less of a zombie movie as it adverse. Yes the movie dose deliver on Pride and Prejudice, but not that much on zombies. Another thing that I was really disappointed with is the lackluster fight scenes, I mean it wasn't anything that special or exciting. Lena Headey and Charles Dance are in this movie and both of them don't do anything. It was a complete waste of their talents and time.\r There are good things in this movie such as: the make-up was pretty solid, the performances for the most part were good and it was well shot at times.\r Overall Pride and Prejudice and Zombies was a massive disappointment for me, because it had a chance of being great and enjoyable. As I said before, it had a lot of things going for it with the cast, the director and the fresh ideas for the zombies. This is another movie that couldn't live up to it's title."}, {"rating": "4", "text": "I told you people I won't be the first reviewer for this movie. I will be the first reviewer for Deadpool and Zoolander 2 though. The finalized scores for them will be confirmed just by the day before the movies get released to theaters. Pride and Prejudice and Zombies does what several other movies have done... insert zombies in it and call it a day."}, {"rating": "3", "text": "Barely tolerable, it lacks of substance, you will be entertained but the film is sloppy and unsatisfying.Regardless of Jane Austen's novel from which it takes its narrative base, this is a production for people who loves the zombie genre.From then on it's a forgettable product."}, {"rating": "0", "text": "\"She is tolerable, but not handsome enough to tempt me, and I am in no humor at present to give consequence to young ladies who are slighted by other men.\"Elizabeth ran outside and burst into big, girly sobs.Yeah, if this isn't sounding familiar, if you're saying to yourself WHAT ARE YOU TALKING ABOUT SHE LAUGHED IN HIS EGOTISTICAL FACE, you're gonna haaaaaaaaaaate this movie, because that's literally what happens. She goes outside, and she CRIES ABOUT IT.  They took an indomitable woman from the ORIGINAL novel and portrayed her as an indomitable woman with a sword ON THE PROMOTIONAL MATERIAL, and then they just COMPLETELY desiccate ALL of that right from the start.   What. a. waste. There was other terrible stuff too mind you, the movie just kept being awful, but that was the first point at which my head burst into flames, so while I've managed to erase the rest from my memory, that one's kinda burned in there.Yes I'm still mad I actually paid money to see this in the theater, why do you ask?"}, {"rating": "9", "text": "An interesting twist on a classic novel, the writing was good if not a little predictable and the acting was decent. Well except for Lily James who was delightful."}, {"rating": "4", "text": "A   whole   lot   of   Pride   and   a   whole   lot   of   Prejudice   and   a   little   bit   of   Zombies.\r I   wasn't   a   fan.  Not   for   me."}, {"rating": "6", "text": "At first instance one is dismissive of such an unlikely premise of mixing the high literature of Jane Austen with the Z grade antics of zombie land. However, whist not a total success there is definitely much here to commend a film that is at least lively and entertaining. True, the film is happiest when pursuing Austen and ignoring Seth Grahame Smith’s liberty taking best seller, but the film succeeds a lot better than one could imagine. The attractive cast are easy on the eye and the film has a surprisingly up market feel to it, aided no end by some lovely music, costumes and production Design. On the negative side the fight scenes are less engaging than they should be and on occasion down right daft. The Zombies seem to be like puppets on a string attacking the ‘normal’ cast on cue, but ignoring them when the scene so requires. The denouement to the fight scene between Darcy and Wickham is signposted a mile off. Another between Darcy and Elizabeth that comically promises sexual suggestion, a la 1963’s food scene in ‘Tom Jones’, is sadly never realised to its full delicious potential. The visual effects and Zombie make ups are variable in quality. Whilst shots of London and St Paul’s burning are very impressive, the demolition of the bridge fares less well. In a supporting turn Matt Smith scores heavily in the laughs department as the less than tactful Pastor Collins. Overall for mild divertissement it all fits the bill very nicely."}, {"rating": "7", "text": "From loathing to romance and zombie hunting!I did not know there was a parody novel of Jane Austen's 200 years old classic. This was based on that, a multi-starrer film, but the lack of star value let down the film. This is the film with a familiar plot, in addition to that zombies were there, but that was not enough. The big names from the cast would have pulled the film out of the box office disaster if it had one or two. But still I think this film was okay, an acceptable with awesome production and performances.It ended like there will be a sequel, but now I don't think there's going to be one. The story was kind of predictable. Well, I did predict, particularly the character Wickham. Though I was more curious about the Zombies, like how it was going to be used in the narration. I must say, they were excellent. I mean they were not given any big preference, but theirs part indeed helped to build a nice plot. Pretty well composed stunts. I mean carefully, without strong blood and gore, so they got PG13 and warning for the violences.I think the film critics overreacted like usual. They're like the sheep herds, they follow one another and given verdict for this as a bad flick. But as a film fanatic, I don't think it is worth neglecting, especially if you are a fan of the original story. In the todays world, the critics are a bunch of circus clowns. So I hope you make a right choice on this, not because of me or the critics, if you haven't seen it yet.6.5/10"}, {"rating": "5", "text": "I personally couldn't get on board with this film as it was dull to me.  I will give credit to the performers who really put their best foot forward.  The film tries to straddle the line between serious and absurd and does as well as it can, but I just couldn't care less.  C"}, {"rating": "4", "text": "Couple of fun parts. I thought the acting was fair, but good enough. Lily James stands out. Falls flat on a couple parts though.The action had some entertainment but ultimately becomes a cliched movie."}, {"rating": "6", "text": "\"Pride and Prejudice and Zombies\" is a very crazy adaptation of Jane Austen's historical-romantic book \"Pride and Prejudice\", but now, mixed with the zombie wave, if the story was regular, but the performances were good, enjoy a good time with the characters, and the make-up, and the wardrobe was well achieved."}, {"rating": "3", "text": "I don't get it.I didn't read the book so i can't compare, but the movie is simply...slow and boring.I can appreciate a satirical, unconventional movie (I'm a fan of B movie productions like Troma )...but this lacks the humor of a \"real\" b movie and seems always fake"}, {"rating": "6", "text": "The acting and drama in PPZ is surprisingly good, and the costumes and sets are beautiful. The action is also really fun. It's above-average, especially considering the silly premise. Very well-executed."}, {"rating": "10", "text": "I have several copies now and can't stop watching it. I LOVE IT! I think it is so much better than the book and I love how Burr Steers wrote the script with Jane Austenish scenes. The 1st proposal scene is fantastic and the 2nd proposal I can't stop re-watching. I love movies with strong women characters and the Bennet girls all are kick-ass great. Love how the story line was changed form the book. Lt. Wickham is evil anyway you read him, so I was thrilled to see him as the AntiChrist for the Zombies and a great adversary for Mr. Darcy. I so hope Burr Steers and everyone join up again for the sequel. I think the movie would have made more money if they had stuck to their original release date of February 19th instead of Super Bowl weekend. There were also too many Valentine's Days Movies the following weekend. GO Lily James and Sam Riley they are my favorite Elizabeth Bennet and Fitzwilliam Darcy ever. I will never see anyone else i those parts, they were a perfect match for the film and the Love/Hate tension was great all the way through the movie. Love the kissing scene after the proposal. They both had waited so long."}, {"rating": "5", "text": "First of all, the acting in this film could have been better by some of the actors. Lily James, who plays Elizabeth Bennet, probably was the only one out of the entire cast that was actually good. She wasn’t just a robot, in all of her scenes at least, but showed emotion. The rest of the cast I wish I could say the same but I can’t. They all barely show any emotion in any scenes. Now I have nothing against Sam Riley, who plays Mr. Darcy, but I think he was a terrible choice for Mr. Darcy. I have recently watched the 2005 film Pride and Prejudice so I do understand that Mr. Darcy is supposed to come across as emotionless and miserable to the public but when he’s with Elizabeth he lightens up a bit. In this film, he’s just straight up emotionless and miserable throughout the entire film. At first, I thought they used makeup for the zombies but upon further inspection they actually used CGI and it wasn’t good. The reason why zombies are terrifying in this modern day and age is that movies and TV use makeup effects for their zombies. One thing I did like though was the costumes. Just by looking at the characters outfits you can easily figure out their personality. For example, with Darcy, his outfits throughout the entire film are black showing how he is miserable compared to his friend Bingley, played by Douglas Booth, who has more brighter colours showing how he is more outgoing. Finally, the musical score, composed by Fernando Velazquez, is fantastic and you can easily listen to it an understand what’s going on at that point and time in the film. In the end, this film isn’t great but if you turn your brain off then you’ll have a good time."}, {"rating": "6", "text": "Einen Film wie Pride and Prejudice and Zombies hat wohl niemand kommen sehen: Die Fusion Jane-Austen-und-die-Untoten ist absurd, die Zielgruppe nicht existent. Dennoch ist der Historienhorror Wirklichkeit – und gar nicht mal so übel! Regisseur Burr Steers nämlich rückt die zweitbekannteste Romanze überhaupt in den narrativen Fokus, adaptiert den Plot von Stolz und Vorurteil treffend und findet mit Lily James und Sam Riley adäquaten Lizzy-Darcy-Ersatz. Und genau da liegt das Problem: Der Actionhorrorpart kommt nämlich trotz guter Zombiemasken und gelegentlichem Splatter viel zu kurz und überzeugt nur im völlig absurden Clash mit den romantischen Schlüsselszenen des Romans. Eine fatale Entscheidung – denn die Austen-Gemeinde wird Pride and Prejudice and Zombies wohl kaum sehen wollen. Und so sieht ihn letztlich niemand."}, {"rating": "3", "text": "Pride, Prejudice and Zombies is an adaptation of the Jane Austen's classic 'Pride and Prejudice' with an added modern twist that has almost tried to created a comedy value to this movie. This movie is not likely to make sense if you are not familiar with the original text, but I personally believe this movie still holds too much seriousness and doesn't allow the comedic value to shine view as much as they could have with this adaptation. Trying way too hard to scare and thrill an audience."}, {"rating": "6", "text": "This is an action horror film, with themes covered including aristocracy, chases, danger and eavesdropping. I found it quite amusing from early on, with the genteel 'frightfully polite' style English spoken word seeming to clash with the main plot aspect, of course. There are some relatively disturbing images from quite early on as well (certainly within the first 15 minutes or so) and I did jump at times but I didn't find myself feeling really sick, thankfully. I imagine thats mainly due to the fact that its so unfeasible (or so I'd like to think in any case), so you know it isn't real. The main protagonist, Elizabeth Bennet, is very regal and upper class in appearance and speech and has some witty dialogue. I like that she is a seemingly independent and self assured person, reminding me a little of the the titular character in the 90s US drama show Buffy The Vampire Slayer, although that was set in the modern day.I liked the music featured, mostly quite light and airy classical tunes, very reminiscent of traditional period dramas. Its a bit like someone with two personalities and it can take you by surprise when it swaps from one to the other, although I should point out that, if anything, there are more period drama scenes.Cast wise, Lily James plays Elizabeth Bennet and looks very much the respected Victorian lady , wearing respectable dresses and so on. She reminded me a bit of Keira Knightley. Her sisters include Ellie Bamber, who plays Lydia, Millie Brady, who plays Mary and Suki Waterhouse, who plays Kitty. Douglas Booth plays Mr. Bingley,while Matt Smith (who played Doctor Who in the past) plays Parson Collins and Charles Dance plays Mr. Bennet. Of course, Pride and Prejudice wouldn't be Pride and Prejudice without a Mr. Darcy and in this version of the tale, he is played by Sam Riley. Sally Phillips, known for her roles in Channel 4's Smack The Pony etc., plays Mrs. Bennet. The acting certainly seemed pretty competent to me, for the most part.Of course its undeniably camp, in as much as any film with a serious side and a quite preposterous/wacky side would likely be. I did feel at times that it was possibly trying a little hard to be serious, which is a bit of a shame - it would have probably worked a bit better if the main characters were to have spoke to the viewer via the camera as if their in on the joke. All the same, I still found it pretty amusing and reasonably entertaining during the zombie related scenes. If anything, I was slightly disappointed that there was no spoof of the famous Thriller music video, which I imagined could have been fun!. I was frustrated that there wasn't more of an emphasis put on the zombie aspect and less on the 19th century England background/setting.Content wise, the film contains moderate violence and an element of gore, due to the themes of course. There are characters depicted as bloodied, skeletal types, with decomposing flesh visible, which could disturb some, especially younger, viewers. It should be noted that this violence is really quite sporadic but when it is present, it may frighten some, although I wouldn't have thought it'd greatly scare anyone especially familiar with zombie films and the like. The main themes of the film aren't especially frightening as such, given its so unfeasible and thus is more comedy based overall. The film has been given a 15 rating in the UK, to reflect this.Yes I'd recommend this film, as I thought it was quite amusing and something a bit different - it won't appeal to everyone but if it sounds a good laugh then its probably worth a watch. However, as a word of warning, there are some scenes which are primarily period drama based and that don't focus on said zombies, so if your really disinterested in period dramas then this may put you off but overall I enjoyed the zany mix of zombie film and period drama. Whether you will, ill leave to yourself to decide."}, {"rating": "3", "text": "This shameful reboot known as Pride and Prejudice and Zombies is an immorally disgraceful extravaganza filled with nonsensical ridiculousness that is muddled in its hideous concept containing unethical themes which suffocates Jane Austen's beloved novel into a coffin."}], "recommendations": ["blade_of_the_47_ronin", "from_dusk_till_dawn", "dredd", "king_arthur_legend_of_the_sword", "the_witches", "the_invasion", "the_last_witch_hunter", "victor_frankenstein", "it_chapter_two", "the_conjuring_the_devil_made_me_do_it", "samson", "dark_shadows", "color_out_of_space", "fifty_shades_darker", "ben_hur", "the_mist", "indiana_jones_and_the_temple_of_doom", "carrie", "alice_through_the_looking_glass", "tomorrowland", "sin_city_a_dame_to_kill_for", "the_legend_of_tarzan", "ready_or_not", "pan", "hercules"]}