{
  "id": 404,
  "title": "Prince of Persia: The Sands of Time",
  "starring": [
    "Jake Gyllenhaal",
    "Gemma Arterton"
  ],
  "runtime": 116,
  "genre": [
    "Adventure",
    "Fantasy",
    "Action"
  ],
  "description": "A rogue prince reluctantly joins forces with a mysterious princess and together, they race against dark forces to safeguard an ancient dagger capable of releasing the Sands of Time – gift from the gods that can reverse time and allow its possessor to rule the world.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lkp1GFmWyf7k2WKvKIQuuGyichI.jpg",
  "categories": {
    "plot": 7.321428571428571,
    "acting": 7.0,
    "ending": 6.75,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 6.6,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "\"Its Like Alladin meets The Mummy . this movie has its flaws . at times it take a min to process all that is happening at once .. but this movie was genuine , fun , and humorous. Jake Gyllenhaal was decent as the Prince the action scenes were authentic,\" ... B"
    },
    {
      "rating": "5",
      "text": "For the first time, I thought Jerry Bruckheimer created something marvelous in \"Prince of Persia: The Sands of Time\". After watching a barrage of cliches with terrible characters, I thought wrong."
    },
    {
      "rating": "7",
      "text": "I was very pleasantly surprised by this film. I've never seen a good film that was originally a game, so this was rather shocking to be honest. Visually it was rather well done, especially the production design and the visual effects were rather good. The overall story was not ingenious, but it was rather entertaining and there were no dull moments in the film. Being a Disney film, it did have the typical happy-ending, and some rather cliched cinematography (was too many slow motion scenes), but overall the film definitely was worth the watch. It's been a while since epic fantasies like this have hit the cinemas and were actually good. The last one, actually, could be the Lord of the Rings... which is sad. So, \"Prince of Persia\" most certainly is a well-needed and welcomed addition to the genre! Fun and entertaining - everything it ever really yearned to be."
    },
    {
      "rating": "8",
      "text": "Prince of Persia is a game-to-film movie. Usually this strikes fear into filmgoers and gamers alike, and every film that's come under this moniker has failed miserably, with the arguable exception of Tomb Raider and even more arguable exception of Silent Hill. Surprisingly PoP turns out to be a thoroughly entertaining and a genuinely good movie. The acting, special effects and story are all good, with minor instances where each falls flat. The ending isn't as good as that of the game's (I would have likely raised the score if they had just copied that ending exactly) but as a game-films go, Prince of Persia is without doubt the most successful entry since Ms. Croft graced our screens all those years ago."
    },
    {
      "rating": "8",
      "text": "I was pleasantly surprised. Good, fable flavored story, good values (family, courage, etc). The direction and action scenes are not the best, but they were good enough to carry the story and I did not feel like they got in the way. Overall an enjoyable movie."
    },
    {
      "rating": "7",
      "text": "Good old fashioned fun. The historical inaccuracies were many but frankly I didn't care about them. I am a fan of the games and am glad they adapted the series for film. It achieved its goal to entertain without being pretentious. I'm guessing they didn't set out to make a critically acclaimed film, so I took it for what it was and enjoyed it."
    },
    {
      "rating": "9",
      "text": "I must of saw this movie over 100 times and each time I can pick out something new.  This movie reminds me of my second marriage which I'm still living.  I am separated from my wife, however I still feel like I'm fighting a battle to get back to her.  Similarly, just like in the movie when the prince falls in love with the princess.\r It's clear that they fall in love early in the movie when the prince captures the dagger.  Throughout the entire movie the prince and princess get to know each other better and better.  The turning point is finally when the princess becomes totally honest with the prince.\r A true heart filling love story at its best, a man fighting to expose the truth to save the Holy City.  The deep message is trust no one, except what your heart tells you.  Basically, in life, don't listen to others that have no clue about all the facts.  The fact of this movie is that true love will prevail over any adverse situation.\r Gemma played the most beautiful princess that I've seen.  Her sexiness and strong will to survive really hit a home run with me.  Jake was superb in protecting all of his true loved ones even though he was an orphan boy and had no real family.\r A sequel to this movie should be made, I would love nothing more than to see the prince and princess be married and raise their own family."
    },
    {
      "rating": "10",
      "text": "Critics, PFFT. If they know nothing of a video game, they shouldn't post an article in the first place. The movie is great and reminiscent to the Prince of Persia Lore."
    },
    {
      "rating": "10",
      "text": "Great movie great story line great performances.Perfect for me. Recommended."
    },
    {
      "rating": "8",
      "text": "Could be better, but it was sure a good adventure."
    },
    {
      "rating": "8",
      "text": "This was an entertaining throwback fun, action, romance and comedy movie. The critics are jaded. Vote with your feet, go see the movie!"
    },
    {
      "rating": "7",
      "text": "This was an all round enjoyable film with plenty of potential in the characters for the future sequels, I hope they all stay, especially the hardworking \"entrepreneur\" tax exile with the ostriches. The script was lively and tight if a little shallow and juvenile, although with a rumoured seven film series, im sure the development and depth will come. Go see this film at the cinema for the vertigo inducing visuals!"
    },
    {
      "rating": "8",
      "text": "Surprisingly good. Except one thing I think they messed up on which they really shouldn't had is the clothes that the prince wears. He's wearing Warrior Within clothing, not sands of time. But whatever.\r Now obviously when it goes from video game to film 99% of the time it goes horribly wrong. But despite the film not being 100% based on the video game it did do a pretty good job. I wish they portrayed it more like in the video game but at the same time you have to make it entertaining for those who haven't watched it.\r Besides those few things that bored me this isn't actually a bad film at all..."
    },
    {
      "rating": "10",
      "text": "Easily my favourite game-to-movie adaptation, and probably one of the best, The Sands of Time is a fun action flick, that while slightly Pirates of the Caribbean-esque, TSOT is an extremely enjoyable film and Jake Gyllenhaal plays the role of the previously unnamed Prince, Dastan. As for the rest of the acting, it is quite reasonable and is a very enjoyable film.If you haven't seen it, go out and buy it.Now."
    },
    {
      "rating": "8",
      "text": "a rousing and great adaptation of the video game.\r Rating: 86%"
    },
    {
      "rating": "7",
      "text": "This movie was very interesting even though the main idea came from a video game (a very successful VG.) I thought that Disney did a good job on graphics and music but still seemed a little cartoonish. Some parts more than few hooked you into the movie. It made you wonder and believe the movie was happening like your there."
    },
    {
      "rating": "7",
      "text": "While I wasn't expecting much with this it movie as most movie video game adaptions turn out crap (and the fact that it was made by Disney), I was shocked with how good this turned out to be, while it's not as good as the video game it's loosely based on, it's still a good experience, fans of the game may be disappointed it's still a good movie from beginning to end."
    },
    {
      "rating": "9",
      "text": "This is one of my favorite movies of 2010. I don't understand the negative reviews by critics. Loved the two lead characters and Jake Gyllenhaal once again demonstrated his versatility as an actor."
    },
    {
      "rating": "9",
      "text": "This was a movie i think that a lot of people were skeptic about and so they failed to keep an open mind. The result was bad ratings. This movie is a feel good movie with plenty of action along the way. although a little cheesy if your a james bond fan give it a whirl because a good friend of mind who is a james bond fanatic and a movie connoiseur watched out of my recomondation and loved. a movie with LOTS of parcour and action as well as enough twists and turns to keep you on the edge of your seat once this movie starts rolling. Just dont assume the bad guy ;)."
    },
    {
      "rating": "10",
      "text": "I simply like this film. Nice story and very nice FX. I like this ancient historical stuffs. And I was stunning over acting of the Jake Gyllenhaal. I simply put the 10 on this film."
    },
    {
      "rating": "7",
      "text": "I too was a little worried when I first started watching but it ended up being one of the best video game films, if not the best, imo. Gyllenhaal was a great pick for the lead, Kingsley is solid as well but doesn't get enough on screen time imo, The rest of the cast is solid as well. Did not care for the director though, I felt he ruined what could have been some good shots and should they make a sequel, I'd like to see him replaced. Overall, Its a pretty solid movie and worth watching."
    },
    {
      "rating": "8",
      "text": "I watched the movie and I was surprised but how good it was. Usually \"the movie of the game\" tends to be... well, bad. This, on the other hand was very funny to watch, the story was intruguing even though the villain could not be more blatant. Main character is engaging, seriously, who doesn't like Jake Gyllenhaal  (hope it is spelled that way). I really don't understand why this movie gets so much hate."
    },
    {
      "rating": "8",
      "text": "The game is cheesy, but to be honest I was expecting far far worse.  The main actor for this did actually do a decent job with the prince because in the actual game the prince is kind of a wise guy.  The game doesn't follow the game perfectly but since it's a Disney movie I can understand why, I guess undead sand demons don't fly in Disney world (yet they had undead pirates in the first Pirates of the Carribean movie....).  Cheesy but surprisingly entertaining."
    },
    {
      "rating": "7",
      "text": "i don't understand why everyone is being obnoxious about this it's a great movie  great story line  great performances  i mean yeah it's not an epic movie like troy but who cares it's a movie based on a video game it was a surprise that it came that way  Jake Gyllenhaal did a spectacular performance and the movie is fun fast and memorable  a solid 7 out of 10 is perfect for this movie."
    },
    {
      "rating": "8",
      "text": "Great acting and actions, entertaining twists throughout the movie. Near the end, the details were a bit fuzzy, but that is my only concern, Jake Gyllenhaal and Gemma Arterton have great chemistry."
    },
    {
      "rating": "8",
      "text": "I really enjoy these types of movies. At their heart movies such as Prince of Persia: The Sands of Time are supposed to be fun and adventure filled escapist entertainment. This is where the movie succeeds. First of all the movie is a visual palette of wondrous colors, scenery, architecture, costumes and characters that transports the viewer to another place and time. Secondly the story has all the right elements from heroism, bravery, treachery, betrayal, familial love and loyalty along with romance and laughter. Thirdly the story is epic in scope but intimate in its execution.\r Based on a video game, which I have never seen, the story follows the adventure of Dastan a Prince of Persia, splendidly portrayed by Jake Gyllenhaal, who had been adopted by the king as a peasant living in poverty on the streets. Raised along with his adopted brothers Dastan leads his brothers and their armies to capture the city of Alamut where he meets the city's beautiful princess Tamina, portrayed by the enchanting and stunning, Gemma Arterton, and he comes in possession of a mysterious dagger with time traveling abilities. That is the gist of the story and I will not go into great detail on the finer points of the story.\r The movie is a fantasy and it is fun and enjoyable. If you enjoy fun, adventure filled fantasy epics the Prince of Persia: The Sands of Time is a great popcorn munching movie to escape into for a while. It will be time well spent."
    },
    {
      "rating": "8",
      "text": "My favorites movies in general are based on games. Every things was nice in the movie. Very complete.\rI find the story original and interesting. The special effect was very well done. Very surprised it didn't get more sucess."
    },
    {
      "rating": "7",
      "text": "The only game of this I've played is the first few hours of the 2008 Prince of Persia, and I didn't care for it. However, this movie is based on a different game (although probably rather loosely). I enjoyed it as an action movie, with well-made fight scenes. The mediocre metacritic score is probably due to them judging the plot too harshly, which I'll admit could be improved on but is still pretty decent. I think the user score is much more accurate of the quality of this movie, though. It's worth watching once (if not twice) for its action scenes and its story and characters are pretty decent, too. Don't avoid it just because it's a \"game movie\"."
    },
    {
      "rating": "10",
      "text": "فیلم خیلی قشنگیه و ارزش دیدن رو 100 درصد داره....حتما این فیلم رو تماشا کنید...من که نمره کامل رو به این فیلم میدم......ولی نمیدونم که چرا وقتی اسم فیلم شاهزاده ایرانیه و داستان ایرانیه به زبان انگلیسی صحبت میکنن...خخخخخ"
    },
    {
      "rating": "10",
      "text": "Esta es sin duda la mejor pelicula basada en algun videojuego. No es exactamente el juego original pero es como una reimaginacion del juego original de PS2 q tiene todo lo q hace a la saga de videojuegos grande. El parkourt, la accion, la historia, la musica, todo, exactamente todo esta perfecto. Amo esta pelicula"
    },
    {
      "rating": "10",
      "text": "I loved that but can be betterMust pay more attention to this seriesI hop"
    },
    {
      "rating": "10",
      "text": "I was skeptical at first because some times when my favorite games go to film, they end letting me down. However, this skepticism turned out wrong. I really enjoyed this movie, I love it! I was amazed by the story line, the graphics, the intro and outro, and how it all played out. It was not too jazzed out by movie graphics and it brings a sense of realism. It was inspiring and gave a story line that gave good morals and values under the circumstances. It is deep in the sense that true family value and moral is stronger than deceit of foul blood that has been corrupted by evil. Way to go to all those who made this possible, especially to the founder and creator of Prince of Persia!! I look forward to more movies on Prince of Persia!!"
    },
    {
      "rating": "8",
      "text": "This movie had great costume and scenery. I really enjoyed watching the movie and it reminded me of Aladdin with the kid in the beginning stealing and then running. Later it reminded me of Sinbad with the sword. I liked how they portrayed the dervishes and their ritualism as something dark and magical being a fan of Sufism."
    },
    {
      "rating": "10",
      "text": "I could not care less about the game franchise, and I'm becoming decrepit with age and increasingly impatient with computer-effect-filled movies. But this I found quite engaging. It's a fun story, told reasonably effectively."
    },
    {
      "rating": "7",
      "text": "I think the trailer for this film made it look a lot sicker than it really was. Thought it could've been better and I was expecting a bit more but overall I'd say it was still a pretty decent flick."
    },
    {
      "rating": "7",
      "text": "The first thing you have to understand about this film is that it is based on a game. Once you realize that, the experience becomes a lot more enjoyable."
    },
    {
      "rating": "9",
      "text": "A very good adventure movie set in the middle east. There are good mixtures of action and comedy scenes in the movie. The main actor/character was pretty good although didn't see him do those cool wall running, etc like in the video games. And not many boss fights...disappointing. And no going through traps and pitfalls like it should be. But the movie is interesting and entertaining to keep me watching. The main badguy was actually pretty good with a nice storyline. the girl was also pretty good, although I wanted to see her in action as well. In the end, its a good guy movie with them always coming out on top. No problem with that, but it just happend too easy?"
    },
    {
      "rating": "1",
      "text": "The only good thing about this movie is the special effects!  This movie is boring, tedious, and the ending has gotta be one of the worst cop out endings I have seen in a movie!"
    },
    {
      "rating": "9",
      "text": "This was a great movie from start to end. Great acting, great story with great action scenes. I don't get all the hate."
    },
    {
      "rating": "2",
      "text": "That anyone could describe this movie as having \"great acting\" is just ridiculous. The prince couldn't decide whether he was British or American. Parts of the story didn't make any sense at all. Acting and script was terrible all round. Bad editing. Basically, just a stinking pile of crap."
    },
    {
      "rating": "2",
      "text": "A disastrous movie, without a shadow of a doubt. Appalling acting, boring direction, washed out and run-of-the-mill action sequences. Really, really bland movie, regardless of whether you liked the videogames or not."
    },
    {
      "rating": "2",
      "text": "I guess the script looks something like this;BOOM! (Something explodes),\"Aaaaaaaaaaaagh!\"BAM, BAM, BAM (Something fires),\"Whaaaaaaaaaaagh!!!!\"CREAK ... CREAK ... CRACK!!! (Something breaks),\"Yaaaaaaaaaaaa\"Continue in this vein for the duration of the movie. If you enjoy noisy, pointless movies, look no further."
    },
    {
      "rating": "5",
      "text": "I didn't expect anything more than a simple \"popcorn\" movie to begin with, but as it went on i realized that even low expectations were to much. The movie doesn't bring anything new to table, it's just the common \"hero type\" movie with tuns of action. The characters are poorly developed and the lines are simple, childish. Probably if you're under 12 you'll love this movie, otherwise, i doubt you'll enjoy it."
    },
    {
      "rating": "5",
      "text": "I feel like saying 'this movie was adequately entertaining' is like beating a dead Persian horse, but I don't really have much else to say. I guess that's enough for a popcorn flick to merit 3/5 stars, but I only give it 2 1/2 stars because it so obviously channels \"Pirates of the Caribbean,\" right down to Alfred Molina's best impersonation of Jack Sparrow (likely to be one of the weirder things I see in theaters this summer), but never achieves the light-hearted wit that made Pirates so much fun."
    },
    {
      "rating": "0",
      "text": "Truly appalling. This movie cost 150 million dollars. What was that money spent on ? The actors sounded like they were rehearsing a play. The entire script had no coherence whatsoever.\rAfter watching this flick for only five minutes, I knew this would be bad. I had no idea how bad. It sucks the energy right out of you, and makes you cringe."
    },
    {
      "rating": "6",
      "text": "Our hero named Prince Dastan (also means â"
    },
    {
      "rating": "3",
      "text": "Gemma Arterton gives a basically annoying and cliche performance, but Jake Gyllenhaal gives a charming and funny performance. The movie is based on a video game so its storyline basically doomed the movie. But Prince of Persia is one of the most entertaining films of the year. I give this movie 31%."
    },
    {
      "rating": "3",
      "text": "A movie that fales to even capture my interest with the running shots and then we go to a love story that doesn't have any development and leads to just a load of crap."
    },
    {
      "rating": "3",
      "text": "A terrible video game movie that stands on top of a heap of bad video game movies, vying for Prince of the Mountain.\r The only things about this movie that are decent, are the visuals and the action. Past that, it's nothing but a hurricane of the worst Hollywood cliches, forced romance between two irritating characters, and a story that is a shadow of what was presented in the video game series.\r Play any of the Prince of Persia games for a better experience, even the original 2D side scrollers."
    },
    {
      "rating": "5",
      "text": "MediocreThis adaptation of Ubisoft’s successful Prince Of Persia franchise tries too hard to be the next Pirates Of The Caribbean."
    }
  ]
}