{
  "id": 268,
  "title": "Project X",
  "starring": [
    "Thomas Mann",
    "Oliver Cooper"
  ],
  "runtime": 88,
  "genre": [
    "Comedy"
  ],
  "description": "Three high school seniors throw a party to make a name for themselves. As the night progresses, things spiral out of control as word of the party spreads.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lUPDGT3lyRrq8SvWuNWG2DP64bR.jpg",
  "categories": {
    "plot": 4.090909090909091,
    "acting": 3.739130434782609,
    "ending": 2.1,
    "soundtrack": 2.25,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 1.6
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Without any kind of doubt, this is the worst movie ever made. Is remarkably sad to see that nowadays society believes that their happiness depends on their popularity. The three main characters of this movie end up ruining their lives despite that  the movie implies that popularity and status is more important. If they keep on making this kind of films we´ll live on this pile of lies, disregarding what really is important on life"
    },
    {
      "rating": "1",
      "text": "This isn't a movie, it's a youtube video. And it's not a good youtube video. Every character in this movie are the most annoying characters i've seen in a long time and the movie seemed like it was writing itself as it went along. \"How do we get drugs to the party?\" \"I don't know! Hey, lets break that gnome!\". There were drugs in the gnome. Pathetic."
    },
    {
      "rating": "1",
      "text": "The  shenanigans of the teens at times made me smile, and even that was rare, but let's face it, Project X is more of a failed reality show pilot than a film."
    },
    {
      "rating": "1",
      "text": "This film is simply abysmal. I don't see how anyone could find it funny; firstly, it is fille with losers who curse every 2 seconds - boring. Furthermore, the camerawork is appalling. I know it's done for effect but it really is terrible. What a waste of time, do not see this tripe."
    },
    {
      "rating": "2",
      "text": "Project X is a ridiculous, pointless movie. A lot happens in this movie, but no laughs come from it. The likeliness of any of the events to take place is very low, that's kind of important for a found footage film that doesn't include and paranormal beings. It also has a very questionable message of it being okay the main character lost his entire college fund because he got **** for one night. To sum up Project X: This is a poor man's Superbad. A very poor man's Superbad."
    },
    {
      "rating": "5",
      "text": "An original comedy which results to be bad. I liked the end because it is realistic  despite all the comedies nowadays. I expected more and i was kind of dissapointed"
    },
    {
      "rating": "5",
      "text": "I don't know what to say about Project X. Did it have a plot? No, but it didn't need one. Did it have any type of character development? No, but it didn't need it. This film feels like a documentary and an actual movie all at one time. It truly is an experience. The lighting is well done, the editing is snappy, the soundtrack is nothing short of epic, and the pure amount of extra participation is unprecedented. However, this movie is an absolute nightmare for anyone that is host to parties. I had anxiety from the start of the party to the moment the credits rolled. The only major problem with the film is the almost complete disregard for consequences. Putting text at the end will not discourage an over zealous viewer from throwing their own Project X. Even the father completely disregards his sons blatant disregard for authority. With all that being said I rate this right in the middle of the sliding scale. It is good, don't get me wrong, but it's not really a movie. It's an experience."
    },
    {
      "rating": "1",
      "text": "Many argue that the movie isn't about it's story or characters but about a supposedly \"Epic\" Party. Now first let me say: I was young once too and surely did some stuff I am not exactly proud of. And that is the point ! They may be funny stories but you are sure as heck not proud of them aside from a few exceptions maybe! This movie glorifies partying to such ridicoulous proportions that all of the people in the movie seem like complete morons and frankly just loathsome people. The entire thing is based around tree highschoolers no less, of which one \"Costa\" might just be one of the most annoying douchebags you've ever seen on film. This film is not how any \"Epic\" Party would be but how 14 year old kiddies imagine it: No limits, no consequences, no realism.\rUsually there is a point though where reality comes crashing in but not in this movie. I mean stuff happens but the film just ends and the three kiddos get \"popular\" without any repercussions.\rWhy is that such an important deal in the first place? High School is over in a blink and then what are they going to do with their popularity? Work at Burger King? It's quite embarassing to watch really. Like when you overhear some kiddies arguing who drank the most beer last night fighting about it like it's actually a title worth having. Or when some teenager calls his friend a **** because he won't drink or stops drinking.\rAside from that the movie objectifies women of course where the only purpose they have is to show their boobs and be sex-slaves to the men they all so much desire !\rOne unintentionally frightening scene is when the police arrives and people start throwing bottles and it's like they are becoming a mob, a collective mind of douchebags not thinking about their actions! The movie makes it look like it's actually a cool thing.  Right to Party my ass. You have every right to Party as long as you are not a selfish prick who puts his juvenile desires above any one elses. I almost burned your house down? Oh well, right to party I guess. Pretty Epic... right..."
    },
    {
      "rating": "5",
      "text": "By the way, I'd like to give this movie a 6. However, Metacritic defines that score in movies as positive. I wanted to keep my opinion as mixed, so it had to be a 5. It's annoying. Let's get to the review, though. I honestly don't even know what to call Project X (PX). Is it a movie? A hidden message? An encourager? Regardless of what is defined as, it's not a very good movie. I went in my recordings to watch it expecting a comedy. While the film starts off like that, it's takes a different, disappointing turn later on, but we'll talk about that later. PX is actually a fairly good comedy starting off, even though the plot and dialogue were simple. The characters in this movie are mediocre, though. You most likely won't care about them. Then again, PX doesn't really try to be a real movie. It's not deep, and there's no way in hell it's getting any type of awards. It's just made for you to have fun. Judging it as a movie though, it's slightly good at best, and pitiful at worst. I went in expecting a real movie, too, which I probably shouldn't have done. Like I said, as a movie, it starts off fairly funny. Then it gets to the party. I can see it being entertaining with some of my friends over, but by myself, it got boring as it went on. Sure, you have some good laughs during the party, but all I was really seeing was just a bunch of old teens dancing, drinking, fighting, and all the other stuff you'd expect out of a party like this. I did like the third act when destruction hits and the whole neighborhood and party gets totally f*cked up. If you're going in PX expecting a stupid, fun flick, you're most likely going to be entertained. However, I regret the decision expecting I was gonna get an actual movie because the results weren't what I wanted."
    },
    {
      "rating": "1",
      "text": "the only thing i thought while watching this was why the hell am i watching this and how the hell is the guy that wrote legitimately funny films like scott pillgrim vs the world and 21 jump street allowed himself to be lowered to this. this film is genuinely uncomfortable and besides being a really bad superbad rip off i absolutely hated every single vain stupid character with a vengeance and wanted the police to break up this crap party for the love of god if you think you need to do what this film did to have a good party i can assure you from experience you don't"
    },
    {
      "rating": "10",
      "text": "One of my favorite teen comedies ever. Everybody should see this, it's frickin' hilarious as all hell!"
    },
    {
      "rating": "0",
      "text": "Can a movie get more dumb and stupid as this? I don't think... The hangover was a good comedy movie, but this one is plain s**t to say the least. And if the torture wasn't enough for an hour and a half, the most sickening part comes right at the end ; The party teen guy burned down houses, nearly killed several people, a dog and a dwarf, destroyed his dad's car... but in the end daddy says it's Ok, he's proud of his son, because he became popular. Great. Great great ending."
    },
    {
      "rating": "1",
      "text": "This movie does something that NO genre of movie should ever forget, it forgets to bring the audience along with it.  What I mean by that is that while you are watching this, due to the badly fleshed out characters, lacking story development, and the overall style of the movie... you feel like your a third wheel watching it, it feels as if you are watching a bunch of OTHER people have fun and your just sadly stuck in your theatre seat.  What else does it do wrong?  It's just not funny, aside from two parts, the jokes are just for shock value with no build up OR punch line, so it feels like a very bad episode of Tosh.0 without the clever commentary.  Also, the characters are both unbelievable and unlikable, especially the main character's best friend in the movie.  Some may say though that at least its entertaining.. but how?  At first in the movie, it does sort of lift the mood by its loud pump music and outrageous party footage, but the movie followed this formula too much to the tee.  The movie was 10 minutes of party montage with loud music and 4minutes of irrelevant dialogue; repeat.  The Good:  There is None.  The Bad:  The movie fails at connecting to the audience, lacks funny jokes, and unbelievable and unlikable characters.  So why get the 1?  Despite all the \"hating\" upon this movie, it does serve a good purpose.  This would be a perfect movie to play in the background of a drinking party, just make sure your party goers are hammered, cause thats the only audience this movie should attract."
    },
    {
      "rating": "5",
      "text": "If you go into this movie with the intent to be educated then you should not have paid to see this movie.  Go rent something or watch the Artist.  This movie was made to take the concept of Superbad and give it some steroids with a 2 hour energy drink chaser.  I do not think it is the greatest movie by any means nor is it anything special in the way other comedies have been of this ilk.  I was entertained though.  Of course I am a guy, and the breasts did add to the overall likeability of Project X.  I will admit that much, but I found the ride fun and the knowledge of what was to come enticing to see.  I wanted to see the craziness to keep going.  I needed to see the total chaos that I saw in the sneak previews.  The spoiler was in my head and that made me want to go through it and not think about how bad the acting was or how the director didn't care to really care fill the screen with thought provoking dialogue.  The movie was meant to take our inner child that tells us to let go and have fun, and take it for a ride.  My party days are long gone, and I do not think about it at all nor do I really miss it. Yet, it was nice to see what it would be like if I could turn back the clock and just totally immerse myself in that moment.  This movie is not to be taken seriously, it is meant to be enjoyed for the party we all wish we could experience just once in our lives, and live to talk about."
    },
    {
      "rating": "8",
      "text": "Great movie to just have a pure (sorta)  honest laugh with out having to think to hard or feel like you have been sitting in a movie too long. AKA the prefect movie short sweet (sorta) and to the point all while being a hysterical comedy."
    },
    {
      "rating": "10",
      "text": "oh come on, you have to like this movie and see this movie, out of hand is putting it small, this party movie was epic , it reminds me of the kind of parties i used to have. real party movie and well as you can see i liked it. watch it and well see it for what it really is a couple of teens having fun and doing what all teens want to do."
    },
    {
      "rating": "7",
      "text": "This is a great movie to see with a group of friends, it's completely off the wall, in your face funny and so over the top it's in the stratosphere. That being said, I can't see anyone over 25 finding this funny, it's cruel and it's pretty frightening how ethically and morally irresponsible the main characters, (and by proxy the filmmakers), are. It's a rollicking, hilarious and insane thrill ride. It's also disturbing, cruel, violent and pro-drug use. A lot of people have been saying it's like \"Superbad on crack,\" it literally is. But where that film was profane and hilarious, it had a heart and a moral center, with characters you could identify with. While \"Project X\" is hilarious, it's also just profane."
    },
    {
      "rating": "9",
      "text": "You can't expect to go into this movie expecting a plot and a touching story. If you do that, you're just plain stupid. It's made for teenagers to enjoy watching an outrageous party that they wish they were at. Most adults won't find this entertaining at all. But if your a teenager, go watch this!"
    },
    {
      "rating": "8",
      "text": "Although the movie does not have a great plot or storyline, it is still a very funny and entertaining movie to see with some friends. After seeing the movie you will get an overwhelming urge to go to a massive raging party of this sort, just because it was so awesome. Project X really is not that bad, and I encourage you all see this movie."
    },
    {
      "rating": "1",
      "text": "What was all the hype about ? This movie was awful. It's stupid, idiotic, unfunny, no point, has no hearth and the characters were so unlikeable. Avoid it !"
    },
    {
      "rating": "9",
      "text": "Project X is a groundbreaking comedy that takes the cliche \"Don't burn the house down\" to a whole new level. This documentary style party film is completely in a genre of its own."
    },
    {
      "rating": "10",
      "text": "For those who wants a \"Film\" with a plot and everything that goes with... you don't want to see this.One the other hand, if you want to have some fun, It finally happened. A movie where you don't care about anything and simply ENJOY. Now my turn. Handy cam + Party = Awesome Awesomeness. Like a mix of all the best party i ever had minus the flamethrower part. I am going to see it again and again then buy it to watch it again. If you don't like it, don't watch it and stop hatting, I recommande it to all Partyrocker!"
    },
    {
      "rating": "0",
      "text": "I really regret wasting my money to pay for this movie. It was stupid and pointless! They just used some naked teen girls to attract audience and make money..."
    },
    {
      "rating": "7",
      "text": "This was a fun movie experience. It's not a movie for adults. It's a movie for teens. I'm damn sure every teen who has wanted to experience an insane party...this will be the closest you can get to it."
    },
    {
      "rating": "0",
      "text": "If you're thinking about seeking this, just watch Superbad instead.  They are pretty similar, except for the fact that Superbad is funny."
    },
    {
      "rating": "0",
      "text": "This film is possibly the most boring piece of screenplay I've ever set eyes on. There is no plot at all and the camera choice (as seen in chronicle) resembling the documentary style does not work, it just means your point of view is very limited. There is no fun in watching other people party when you aren't part of the action. Don't bother watching this film."
    },
    {
      "rating": "0",
      "text": "Dazed and Confused for stupid people.\r One of the worst films ever made, this movie is not only unfunny, uncreative, and boring, it's a downright offensive film that offers up the following 'moral' at the end: It doesn't matter if you ruin your own life and the lives of your parents, as long as you're popular in high school, because that's what is REALLY important."
    },
    {
      "rating": "0",
      "text": "How is this considered a comedy? Did anyone actually take the time to write any jokes? Nope, just got attractive women, told them to take their shirts off and pretend to be at the most unrealistic party ever. Anyone out there saying it reminds them of their party days are just lying. This stuff doesn't happen."
    },
    {
      "rating": "6",
      "text": "Crazy , Sick , ******* insane  ....the whole movie ! Never imagine Project X (2012 )would be like this . Normally speaking is just a lot \"a lot\" of american teenagers  making fool of themselves. On the other hand that party was definitely Epic . the movie would be better if it wasn't footage type but still its damn crazy. No comment on directing , Script or Acting coz its all about the party . And that sure was hell of a party . What can I say , Yeah everything in the film was Negative and there's no good in the film . Its just different kinda movie(Party) gone BAD ."
    },
    {
      "rating": "0",
      "text": "O.k. So three complete morons through a \"party\", which apparently in some suburban neighborhoods is roughly equivalent to a barbarian raiding. In the process of \"partying\" they destroy one their parent's houses, part of their neighborhood, started several dozen fires, destroyed their car, and likely killed one or more people. In the end, one ends up riding the \"short bus\" to school after being declared \"mentally deficient\" to avoid prosecution, one had nothing happen to him but has several paternity suits filed against him, and one got a few months. The one with several paternity suits brags about \"his next 'party'\" on national television. So the moral of the story: destroy, rape, pillage, murder, no one else's lives matter, so long as you have fun and in the end everything will be okay. Ultimately, the only way this vaunt through sociopathy could have been construed as a comedy would have been if it ended in a Tarantino-style battle royal which left everyone of the psychotic main characters laying dead in a pool of their own blood. That didn't happen, this wasn't funny."
    },
    {
      "rating": "8",
      "text": "Great movie, I got what I expected how can a party end like a total chaos. This film is not made for people with child or people that have not lived around parties. Why there are people that watch systematically ALL the films? I would never ever see films made with Sandra Bullock, because I know what it is inside for example. So I wont be rating that films a 0, just because I don't like that type of films. Even though this is not a 10 film, but at least those 10 ratings, compensate the illogic behind the 0 ratings."
    },
    {
      "rating": "9",
      "text": "Let me start by saying this is one of the funniest films i have seen in a long time, it brings in a real aspect of life because these kind of crazy parties happen all the time... The fact that these are nerdy kids make it ironic that they pull off such a crazy part. In a way i think of it as a feel good film and it makes you think that nothing is impossible and that don't waste your life being boring have fun.\rGood humor\rGood-ish acting Brilliant Characters Hot chicks (always a bonus) One of the top comedies of the year!!"
    },
    {
      "rating": "10",
      "text": "Let me first say that the only reason I saw this movie was because of the New York Times review. I watched this movie from start to finish and realized it was barley a movie at all. It was literally the filming of the most epic party ever. You cannot watch this film expecting character development, deep plots or script. It is literally the filming of a night as it unravels. The cinematography and use of flip cams was awesome and really well done. The only reason why i wont dismiss this film as bad, is how true it is and accurately it portrays a big portion of high school teens. I myself am a senior in high school and can say, the script accurately shows how we talk and the party shows the way we act. the only part i was iffy on was the instant consumption of about 70 ecstasy pills, that i feel would have been met with more hesitation. But long story short, This is simply the filming of an epic night that Millions wish they could have."
    },
    {
      "rating": "2",
      "text": "An unfunny, stupid movie. Not much else I can say."
    },
    {
      "rating": "0",
      "text": "The most upsetting movie I've ever seen.  It takes \"you had to be there\" to a whole new level.  There is nothing fun about watching people you don't know have fun, and this movie is simply 88 minutes of that.  This movie also contains the most un-likable protagonists in recent memory.  Thomas is a complete coward who is pushed around by his disgusting, obnoxious, loser \"friend\" Costa.  They both hang out with J.B. who is only there so Costa can constantly insult him about his weight and are followed around by Dax,, who records the party on his camera.  The entire dialogue consists mostly of Costa talking about how \"epic\" the party is and how popular it will make them.  Every \"joke\" is signaled by Costa yelling \"What the **** is that!?!\" or \"What the **** are you doing?!\"  It's almost as if they asked a 14 year old to write what they think a party is like.  A little person punching kids in the groin is about as sophisticated as the humor in this movie gets.  To me, the most insulting part was how they completely villainize anyone who wants to shut down their party. Absolute garbage."
    },
    {
      "rating": "0",
      "text": "My goodness! Never before have I seen such an affront to common decency and traditional values as in Project X. This so called \"film\" has no plot, and just shows kids as young as seventeen using foul language, drinking, and smoking pot. At one point, they use some kind of designer drug called \"ecstasy.\" Several teenage girls bare their breasts, and premarital sexual relations are strongly implied. Actually no. My entire reaction to Project X was, \"This is lame, man. Really lame.\" If only this film were an affront to decency. I wish it were offensive. If only it were the slightest bit funny. There's no real story. Once you've seen five minutes of it, you've seen all it has to offer. It isn't half as wild and crazy as it pretends to be. In a movie where racy content is the attraction, there's more implied than shown. The characters are one dimensional at best, and frankly, the actors are uniformly amateurish. Full review on my blog."
    },
    {
      "rating": "6",
      "text": "It's not in the same league with Todd Phillips classics like \"The Hangover\" or \"Old School\", but it's fun.  It's nothing like a John Hughes movie as a couple of critics asserted; instead, it shoots for the most extreme high school party ever, and it achieves it for the most part.  No, there's not any great depth or characterization to the thing, but it works.  It's probably a parent's nightmare. For someone who revels in the destruction of someone ELSE's property in the name of collective fun, however, it's a blast."
    },
    {
      "rating": "0",
      "text": "terrible movie, no plot. its just teens having a wild party. if i wanted to see a wild party i can go down the street from my house and watch one there every weekend for FREE."
    },
    {
      "rating": "10",
      "text": "This is without a doubt one of the most ridiculously entertaining movies I have ever seen.  People who complain about the story or morality of the movie are completely missing the point.  For one night we get to witness the party that we all wish we had the balls to throw.  We get to lose ourselves in the insanity.  Anyone who can't appreciate the beautiful chaos of it all has clearly lost touch with their inner youth."
    },
    {
      "rating": "3",
      "text": "ALOT of people are talking about how hilarious and totally awesome this movie was. I think i was watching a different film because the \"Project X\" that i saw was stupid, ridiculous, and flat-out over the top. People even wonder why teenage drinking is such an epidemic and this movie definitely does not help the issue. I pretty much saw this movie just to see it and voice my own opinion. \"People are saying its like Superbad on crack\".....most ridiculous comment i've ever seen in my life. Superbad was funny, this was not. I laughed maybe twice in this film. I debated on walking out of the theater and watching the lorax again, but i'm not one for starting a movie and not finishing. This movie was just plain ridiculous, no realism whatsoever and its supposed to be a \"found footage\" style of film. I did not enjoy myself. Save your money and your valuable time from this mess of a so-called film. 3/10"
    },
    {
      "rating": "0",
      "text": "Very poorly crafted party movie lacks humor, fun and humanity. The actors do a terrible job. The found footage format goes out the window for Girls Gone Wild montages matched with the heavy thumping soundtrack. All the guys are sloppy and vulgar; all the girls look like a Playboy College issue. None of the jokes work. The imagery of the partied up women is more Larry Clark than Bob C. Clark, if you know what I mean."
    },
    {
      "rating": "2",
      "text": "Horrible. I'm not even going to waste time going into all the details. The characters were arrogant, boring and pathetic. The plot was even worse. Save your braincells, watch something else."
    },
    {
      "rating": "10",
      "text": "I walked out of the movie in shock at how awesome the party was. This is definitely a better Superbad.  The critics were wrong. The point of this movie is not a deep plot, its just video of the best night of the teens life. Go see it."
    },
    {
      "rating": "2",
      "text": "A trio of high schools losers (the nerd, the loudmouth, the fatty) throws a big party to get laid. It was done well with \"Superbad,\" but this new attempt takes the partying to outrageous ends without any of the humor or heart. It's yet another \"found footage\" approach, which means no narrative style. There are even extended music video sequences with lots of dancing, drugs and boobies. Obviously, I'm not the audience for it, so some under 30s goers might get off on the lame idiocy."
    },
    {
      "rating": "2",
      "text": "I agree with some of the other posters. There is no plot really. The moral of the story is that if you have a giant ass party that you will win the girl and have a happy ending(this doesn't require a spoiler alert) Even the jokes were pretty lame. I like funny movies but this isn't one of them."
    },
    {
      "rating": "0",
      "text": "A terrible film, I think that the situation can be like a wow, is very funny, but the film is terrible, is like a watch a party, and... Is all, Project X is a big deception."
    },
    {
      "rating": "0",
      "text": "I'd rather recommend this movie for people who never had/went to a decent party in their whole lives. And besides it's stupid to pay for an aftermovie of some party you didn't even attend.I always went to the movies to see some kick-ass special effect pumped Action Movie and this was a huuuuuuuuge letdown (shouldn't have listened to friends and gone to John Carter)"
    },
    {
      "rating": "0",
      "text": "I can not believe I paid money to see this movie. It was the biggest pile of crap I have ever seen. The P.O.V. films are getting dumber and dumber. Please what ever you do don't see this film!!!!! You will leave the movies pissed off like i was. But if you don't have a brain you may like this movie. It's a rip off of Superbad. Don't give them your money!!!!"
    },
    {
      "rating": "10",
      "text": "This movie is hella hilarious... in my opinion its right up there with the 1st American Pie and The Hangover movie. It's fun and very funny to watch. Yes there are three main characters in the movie (Thomas, JB and Costa) but the real superstar of the movie is the Epic Party. When you watch this movie you will finally know what it means to party like a Rock Star. The Soundtrack is also awesome. WARNING!!! don't try what you see in the movie at home, you've been warn and you will be brought up on charges... LOL!"
    },
    {
      "rating": "9",
      "text": "Laughing at the people getting mad how there's no character development and typical how they're expecting the movie to have this and that. I dont care about that. All I care about if its an enjoyable or entertaining film. Thats it. Anyway, I found the film quite lulzy and typical teens trying to get popular and wanting a successful party. Its great when it all becomes chaotic and the entire place is getting wrecked. If you're looking for people partying hard and lots of alcohol and some chaos. Spend a small amount on this film."
    }
  ],
  "recommendations": [
    "unfriended",
    "superbad",
    "rim_of_the_world",
    "spy_kids_all_the_time_in_the_world",
    "sausage_party",
    "the_croods_a_new_age",
    "sex_and_the_city_2",
    "the_hangover_part_ii",
    "the_babysitter_killer_queen",
    "the_game_plan",
    "21_jump_street",
    "fifty_shades_of_black",
    "alvin_and_the_chipmunks_the_road_chip",
    "alvin_and_the_chipmunks_chipwrecked",
    "the_smurfs",
    "i_care_a_lot",
    "the_boss_baby_family_business",
    "cloudy_with_a_chance_of_meatballs",
    "the_kissing_booth_2",
    "the_twilight_saga_breaking_dawn_part_1",
    "free_birds",
    "crank_high_voltage",
    "neighbors_2_sorority_rising",
    "the_bye_bye_man",
    "diary_of_a_wimpy_kid_the_long_haul"
  ]
}