{"id": 2564, "title": "Project Power", "starring": ["Jamie Foxx", "Joseph Gordon-Levitt"], "runtime": 113, "genre": ["Action", "Crime", "Science Fiction"], "description": "An ex-soldier, a teen and a cop collide in New Orleans as they hunt for the source behind a dangerous new pill that grants users temporary superpowers.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/TnOeov4w0sTtV2gqICqIxVi74V.jpg", "categories": {"plot": 4.854166666666667, "acting": 4.8125, "ending": 5.666666666666667, "soundtrack": 8.5, "cinematography": 6.666666666666667, "familyFriendly": 3.0, "funny": 4.0, "action": 6.076923076923077}, "reviews": [{"rating": "0", "text": "I didn’t know this was a comedy. Remember when super hero’s had to be trained and go through hell to get where they were? Not anymore. Now all you need is a boring pill and a boring movie to tell you about it. The trailer was better than the movie. Just a rip off a lot a of movies you’ve seen with a worse soundtrack. Michael Bay wanna be director. Boring characters with no real family structure. All the characters were the same person. No background behind the characters hidden behind bad dialogue. Wait till you get to the part where she starts rapping in class."}, {"rating": "1", "text": "What can you say about something that's so completely linear, predictable and nonsensical... boring. Its like the characters been told to act out their former roles... Gordon-Levitt please play a mix Looper and Robin and you Fox play a mix of Django Unchained and Little John... then switch up. Yup, you can't possibly go wrong there.  Oh, yea throw in some unlikable annoying kids in the mix... wamo!"}, {"rating": "3", "text": "it wasn't bad until the movie try to push agenda and politics in it,i think it's a trend nowadays....!"}, {"rating": "1", "text": "Wow, this was shockingly bad and I have no idea why the lead actors chose it. The script was derivative but this could perhaps have been made to work if there was some intelligence and imagination put into the action scenes. Unfortunately, the opposite occurs, with the worst flaw of the movie being the atrocious direction. The pacing was terrible, camera work unfocused and poorly framed, and the entire thing felt slapdash. It's like the director had never seen or read a superhero story and thought that just including the subject in his movie would be 'cool' enough for people to overlook all the gaping flaws. No."}, {"rating": "4", "text": "GOOD: There's some good stuff going on in this film. There's a lot of creativity in the film making. The audio and visual aspects of the film feel fresh, clean and are highly entertaining. The acting and casting make a solid backbone, you get the feeling that these people enjoyed working with each other and it shows in their chemistry. Essentially, everything that came after the pen and paper aspects of this film is well done.BAD: Sadly, the paper that this film is based upon, the most important stuff like script and story are uninspired at best. The story is derivative and lacks scope and imagination. There isn't much story once the premise is setup. They invoke deus ex machina to create their happy ending. Some of the most important human connections in the film are paper thin, causing it to feel emotionally emaciated. Without hyperbole I can say that the vast majority of people watching this film could have come up with a more imaginative story. They would have been better off going with some epub fan fiction. I can go on and on, but it comes down to a severe deprivation of imagination, and going into a highly saturated genre, without imagination, new ideas, or story depth, well, that's just stupid."}, {"rating": "0", "text": "Movie was pretty boring. Interesting premesis, poor execution, poor visual effects. Good actors but they can't backpack a movie on their own."}, {"rating": "0", "text": "The poor and cheap movie I ever watched. JF tried to bring his dump BLM slogan to the movie and made it become a campaign for his ego. No, it made the movie so cheap."}, {"rating": "2", "text": "Couldn't care less about anything that was going on. Found myself zoning out. Generic, uninspired. A shame because it had an interesting premise. But once again suffers from lazy and predictable writing."}, {"rating": "3", "text": "This isn't just lazy writing... it's a whole new level of mediocre script merged with HUGE plot holes. Since backgroud stories and motivations are so shallow its hard to even consider this a film, it feels more like a long episode of recycled netflix series"}, {"rating": "3", "text": "Poorly made. Story plot had a lot of potential.Produced by the two clowns that made paranormal activity 3 and 4."}, {"rating": "4", "text": "The film's full potential is thrown away with a boring cliche story with poorly developed characters."}, {"rating": "5", "text": "It's the classic Netflix original movie. There is a big star, big explosions, ok story and ok characters. It's not bad, but not good either."}, {"rating": "0", "text": "An absolute mess. Halfway through i had to go look up Jamie Foxx's most recent films to see how he could of possibly been talked into making this dumpster fire. This film is jarringly bad. From the nonsensical sub plot of the streetwise hoodrat poet to having hardly any screen time whatsoever with the two main leads interacting... it's a tired, tropey, disjointed fluster cuck."}, {"rating": "4", "text": "As usual for netflix original films, this is complete garbage.Unlike Bright, Jamie Foxx is unable to carry the film on his back all alone.  He certainly tried, though.  I hope he got paid enough to forget he ever participated in this trash."}, {"rating": "5", "text": "Kinda fun, kinda topical, just never at the same time. Watch the director’s film “Nerve” instead"}, {"rating": "9", "text": "Fresher, smarter, more coherent in the superhero genre than most wanna-be films.  Remarkable for how it improves on the Marvel superhero formula with a fraction of the budget.  Remarkable for the star power both Jamie Foxx and Gordon-Levitt bring to the screen even if the characters give them little to work with.  Nothing breakthru thematically.  Simply very solid, well made action-super-hero shenanigans done with joy."}, {"rating": "7", "text": "Project Power has some good points going for it. The story is different and more interesting. However there is some blurry things about the involvement of the army or the government. It's not very well explained. The FX are really good especially with displaying the powers. The acting is solid from the main actors. The secondary are average. The music is decent. I give it 70%. Mainly because I like the performance of the actors, and visually, the movie is different."}, {"rating": "6", "text": "Its a good movie but it can be better, story telling is more or less and the CGI is good"}, {"rating": "10", "text": "If you are looking for an action-packed movie with interesting camera angles and a great soundtrack, then this is the movie for you. The first thing I noticed when I started watching this movie was the cool camera angles/shots. The way they specifically decided to shot and zoom in at different points of the film added to the overall vibe.  Additionally, the overall aesthetic built off of this. The bright background and interesting filming choices were the 1st things that made me want to be in this world. The fact that this movie gives a new twist of the storyline of mutant type people who have cracked the secrets of evolution, ......you would expect them to show us powers. Well, they delivered. For a Netflix original, this had GREAT CGI. I really enjoyed the way they showed how the \"Power\" (pill) affected its users on a molecular level. Alongside that, the sequences of people using their powers and fighting were full of action. Now, I also enjoyed the main cast. Both Art (Jamie Foxx) and Frank (Joseph Gordon-Levitt) had a great dynamic with Robin( Dominique Fishback). They both seemed to be very protective over her even though they've both only known her for a little bit. And, each character had a good background story especially Art. Overall, this movie for me is 9.5/10. I want more of this movie.....of this concept. P.S. Guys the soundtrack was hitting and Robin can rap."}, {"rating": "10", "text": "I really thought this movie was very entertaining. They CGI looked awesome! Great job :)"}, {"rating": "10", "text": "Roller coaster of a ride with incredible performances from all the main and supporting cast. Tasteful and brief, as they should be, a few honorable cameos can be spotted throughout the film with lots of room to extend the universe with some reappearances and world building in a sequel. Taking a step away from the borderline campy vibes from your average superhero movie, Project Power deliveries on action packed variety of powers and sets a realistic take on how the world around them might react. Clever storytelling gives a believable reasoning to the origin of the plot alongside real world issues such as political corruption and societal influences of a broken system bearing down on your average citizen, giving well rounded character development and fluid relationship building between the characters. Every bit of dialogue builds to the next scene without cliche expectations of the characters winking into the camera as so many movies do and keep the audience compelled throughout its entirety - as a smoker, it shocked me to realize two hours had come and gone by the finale. Hands down, a 10 out of 10, and I can’t wait for more. Netflix, please pick up Project Power 2!"}, {"rating": "7", "text": "The movie was great. It has a unique story and an interesting plot twist. The only problem here is there are lots of boring scenes and talking. It's like most of the scenes have dead air. Anyways, the film is great, the choice of actors we're also good. It is worthy to watch on Netflix!"}, {"rating": "8", "text": "I was hesitant to watch this movie because of the old superhero trope. Also the critic and user reviews did not seem very kind. I am really glad that I watched it and I think it deserved a way better score than what people are giving it. The cinematography was pretty good especially for a sNetflix film. The storyline was unique and interesting."}, {"rating": "10", "text": "Fantastic movie. Didn’t expect anything and LOVED it! Great acting, I hope we see her again."}, {"rating": "9", "text": "Entertaining movie throughout action packed. And i really enjoyed the ending. I'm from Louisiana so it was cool to see some places i recognized in the movie. If there is a part 2 of this film i would watch it."}, {"rating": "5", "text": "\"Power\" is a new pill that gives superpowers to everyone who takes it …hitch is…you can't control which power. Joseph Gordon-Levitt plays the cop trying to stop its spread, when Jamie Foxx shows up with his own motives. They team up with a teenage dealer (Dominique Fishback) to rout out the culprits. While the plot and script is essentially trite, the most compelling element is seeing what powers will emerge. They're OK, but never especially cool and more often they serve to muddle up matters. Meanwhile, the fight scenes are confusingly staged, which sometimes makes the action hard to follow. While it's moderately entertaining, this film lacks enough originality or filmmaking skill to make this project powerful. On a side note, even though the location is regularly announced as New Orleans, there's little flavor of the city and nobody sports an accent."}, {"rating": "5", "text": "Good idea, terrible execution. You can tell in the first 20 mins this never goes anywhere interesting. There is no introduction to the characters or world, it just starts in the middle. It's like you had to watch the trailer as a prologue for the actual movie. Any sense of a plot is non existent, it's just a sequence of unconnected action scenes with random super power people doing random crimes, and supercop running after them."}, {"rating": "3", "text": "Not very entertaining. Make sure you have something to do on the side, as this is at best acceptable background media."}, {"rating": "6", "text": "Project Power boasts great acting and a cool premise but at times the film comes across quite amateurish and has a mediocre script. Enjoyable for if your into mindless action."}, {"rating": "7", "text": "Has some good points to it. Good performances and overall good movie, main issue is the script and the film not taking full advantage of it's premise."}, {"rating": "5", "text": "While interesting enough to not be unwatchable, in such an over saturated genre, Project powers plot attempts a lot and fails often... the same can be said for the numerous action sequences and the film in general. Overall I came away from this movie wanting something more grounded... more condensed. The watered down tv quality direction and editing rush along at such a pace, it feels like we cant stay in one shot for too long lest we see through the cracks.... (sadly I think seeing through the cracks would be a more interesting journey!)The over saturated visual effects scenes just go to show that sometimes too much cheddar really is too much with a lack of subtlety and nuance to the powers and character pieces that could have made for far more interesting visual storytelling. File this under 'missed opportunity'."}, {"rating": "6", "text": "The movie has a plot with great potential, which gives us great expectations too, but as it goes, it gets desapointing."}, {"rating": "1", "text": "I think Gordon-Levitt's character could have been portrayed by a stuffed animal with a dubbed voice.  And Jamie Foxx's expression hardly changed the entire movie. The plot was thin and elements were ripped off from other movies.  The cinematics were so dark that you wanted to pick up the phone and hire them a lighting crew.  It made me want to turn on another light in my living room.  Why did they have to shoot 90% of this movie at night?  The movie is predictable but many will lose track of what is going on because the scene progression is so bad.  Indicating bad direction.  People will wonder \"how did we get to this scene?  How is it relevant?\" Those that are still awake, that is.  It's the kind of movie that people will lose attention and wander off to the refrigerator or look at their phones."}, {"rating": "8", "text": "Don't believe all the negative reviews, some of them almost seem like they're talking about a different movie.Over all, it's  well-acted, fast paced, and has a nice mixture of fun along with some more sober moments.Anyone who likes super hero movies or acti9n should get some enjoyment out of this one."}, {"rating": "7", "text": "It's not as bad as The Old Guard, but not necessarily better. The idea of a drug that grants superpowers remains on the surface, as well as the characters, since one as a spectator cannot connect with them. Only when it's a rainy afternoon and you've seen all the good movies."}, {"rating": "5", "text": "tl;dr: If you liked Netflix's Bright, you'll like this. 90% style, 10% substance (and sub-par in both categories). If you want an interesting narrative with fleshed out characters who elicit emotional responses, look elsewhere.With Foxx (Art) and Levitt (Frank) involved, this film had me expecting much more -- can't help but think they signed up strictly for the money because the script is banal. I was hopeful at the start because it seemed as if Foxx really might play \"the bad guy\", but you quickly learn that's not the case. That said, Foxx does what he can with the hackneyed script. Levitt seems miscast -- felt like he phoned it in. The actress who plays Robin (Dominique Fishback) was just painfully amateurish.The biggest problem was that we were supposed to feel something for Robin and her ill mother, and we *should* have felt something for Art and his daughter, but the film fails miserably at getting the viewer invested in their lives and emotions.This felt like a B(minus)-movie with a couple of A-list leads. It gets an extra point or two for (self-conscious) style -- the scene with the frozen woman was fun -- but serves as little more than distraction."}, {"rating": "5", "text": "Besides one cool scene halfway through, this movie is just dumb and mediocre. 51/100"}, {"rating": "4", "text": "I would bet a big pile of cash money on a scenario where this was a script sitting in a drawer.  The plot revolved around a new designer drug upsetting the seamy underworld of New Orleans, but it was so cliche and overdone that it was left in that drawer.  AND THEN, one day, someone saw \"Limitless\".  Then they looked at the money the big superhero movies are making.  They sent forth the command \"Make that designer drug into a superpower pill\".And that's why \"Project Power\" is a lone wolf cop and a distraught father taking on drug cartel movie you've seen a hundred times before.  The filmmakers had a mediocre budget and, worse, a low watt imagination in offering the superpowers.  The superpower angle is nothing but, to use the old saying, putting \"lipstick on a pig\".  I won't say it is a bad movie.  It's just a dull movie that is only recommended because of the pandemic and pickings are getting slim."}, {"rating": "5", "text": "I think this is the first big Netflix film that doesn't feel like an attempt to satisfy the most ''serious'' viewers but it also doesn't feel like a film discarded by a large studio that Netflix knows will satisfy its less capricious viewers.Project Power is entertaining, yes, even though its non-innovative plot felt muddled, but manages to do enough to function with what it has.I say this because it works on a level that doesn't seek to try something more interesting.This could've been more ambitious in terms of scale but the obvious lack of imagination entombed it on a very basic level.I mean the final battle occurs on a freighter. People with superpowers and that final act felt like Die Hard 6.It certainly relies on having Jamie Foxx and Joseph Gordon-Levitt as protagonists to attract more attention but Project Power stays halfway through.It's not a failure, I don't see it that way, but it's a common film. Although as a Netflix-exclusive, this is an above-average offering."}, {"rating": "3", "text": "The only good thing in this movie is JGV's acting. Dude was cool in this movie. Everything else was cringe."}, {"rating": "5", "text": "When I read the movie description I got intrigued since the premise is not a typical 'action superhero gonna save the world from otherworldly beings' but something else. Instead, the plot asks an important question - what would happen if we all got our hands on a chemical that can transform our capabilities beyond recognition? Does it mean we doom ourselves to extinction? Does it mean chaos will multiply to an unimaginable degree or we could evolve towards a united, caring and contributing whole - as humanity.This got me thinking and I was hoping very much that the movie would address it in a fine blend between dynamic sci-fi action spiced with philosophical attributes, however I came to realize that beyond the fine visual effects and actors' play, the movie felt more than half empty. I found that the character development is flawed. Throughout the entire movie I never really grew to caring for any of the characters. By the end I felt bored of it yet I watched it all the way out of respect for the overall work and production.At the end of the day I wouldn't recommend it."}, {"rating": "3", "text": "I don't know if the movie got better or not but I HAD to turn it off about half an hour in because the main character started battle rapping her high school teacher... I cringed so hard I couldn't stop myself. I really couldn't. I'm sorry I can't give a fair review because I couldn't force myself beyond this point..."}, {"rating": "4", "text": "It wastes a great premise in a generic thriller plot.The first act's really good (mostly 'cause the powers actually play a role), but gets dull in the second act (because you could remove the super powers and not much would change). The third act's also dull, but at least the powers play a role again.I don't believe the relationship between any of the characters. I don't hate it, I just don't buy it. The three main actors give solid performances and are fun to watch (I particularly enjoyed Joseph Gordon-Levitt in a towel as an angry husband. Jamie Foxx kinda phones it in). The villains suck though.I thought Machine Gun Kelly was going to be the most distracting thing about this movie, but then Casey Neistat showed up. At least his appearance in Nerve made sense since it all about vlogging or something, I don't know I never saw it.Enjoyable at times, but pretty mediocre overall."}, {"rating": "6", "text": "Not a terrible movie and the cast was great. It’s really more of a 6.5 for me but I can round up in this case."}, {"rating": "5", "text": "It is just a drug addicted version of x men....Illogical story with perfect presentation.. character development is zero...Nice CGI effects."}, {"rating": "4", "text": "Nice production with quality and good cast, but a flat story that in some points make no sense, No memorable villians, and no protagonist chemestry"}, {"rating": "5", "text": "This movie is **** from the first minute! Just as the old guard it's cringe, netflix can't make a good action movie"}, {"rating": "4", "text": "The whole movie is cringe. Terrible character development. Terrible plot. Terrible acting (besides JGL and Fishback). Terrible waste of $85 mill budget. Lots of unanswered questions. The only thing that saved this movie was the CGI."}, {"rating": "4", "text": "Fine for an action movie. Powers were never really explained properly, just that their based on animals, and the story was hardly there to be honest.Action scenes were alright, and acting was pretty good. But the twist with the dudes daughter  being able to heal people for whatever reason doesn't make sense, and was just a lame excuse for a sacrifice that makes you sad and then nope, undone! Not that you'd feel sad for guy dying because he's a dick who murders for fun, but just kidding good guy. Can't really recommend this movie."}, {"rating": "6", "text": "A plot that has great potential but ultimately falls short. Foxx's performance is the best thing about this movie."}], "recommendations": ["triple_frontier", "pacific_rim_uprising", "bloodshot", "jumper", "tenet", "valerian_and_the_city_of_a_thousand_planets", "poseidon", "infinite", "grudge", "gemini_man", "cube", "now_you_see_me", "the_old_guard", "the_equalizer_2", "now_you_see_me_2", "independence_day_resurgence", "the_last_witch_hunter", "what_happened_to_monday", "the_tomorrow_war", "code_8", "elysium", "surrogates", "jupiter_ascending", "broken_city", "rocknrolla"]}