{
  "id": 2141,
  "title": "Promising Young Woman",
  "starring": [
    "Carey Mulligan",
    "Bo Burnham"
  ],
  "runtime": 114,
  "genre": [
    "Thriller",
    "Crime",
    "Drama"
  ],
  "description": "A young woman, traumatized by a tragic event in her past, seeks out vengeance against those who crossed her path.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/73QoFJFmUrJfDG2EynFjNc5gJxk.jpg",
  "categories": {
    "plot": 6.866666666666666,
    "acting": 7.666666666666667,
    "ending": 6.3,
    "soundtrack": 10.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 7.25,
    "action": 8.8
  },
  "reviews": [
    {
      "rating": "8",
      "text": "\"Promising Young Woman\" finds first-time writer/director Emerald Fennell pulling no shortage of punches in terms of subject matter, thematics and tone, and leading actor Carey Mulligan at her most vivid and calculating to date. I can't think of a movie I've seen in recent memory where the first 2/3 -- nay -- 7/8 really belie just how satisfyingly well-executed the ending's going to be. This isn't to say that the first two acts or so are bad or even ineffective in any way. It's just that the ending of this movie is so deft in its messaging and potency, that you're really left feeling as though the filmmaker was hustling you for about 90 minutes, whilst surreptitiously setting up one of the most daring endings you'll probably see in a theater all year. Not a bad feeling to be reacquainted with after God knows how long. In any event, I'd say it's more than worth the watch, with an absolute wallop of an ending that's going to have  thinking for days, I'm sure."
    },
    {
      "rating": "8",
      "text": "Promising Young Woman is an important film that has an interest take on revenge scenarios. Rather than hurting others, it's the threat of hurt to make the victim realize why their action was wrong. My only critique, that prevents full marks, is the tone is a bit off as it reads more as a black-comedy as opposed to an important film about the results of abuse and those who refuse to be accountable for their actions."
    },
    {
      "rating": "9",
      "text": "I love the cinematography of this film, the musical score used throughout the film is also very clever it has a punch. I appreciate how the film provoked my thoughts and feelings toward Carrie's journey to revenge, I like how the film was structured to provide back stories and deep dive look why Carey Mulligan's character is plotting revenge to each of her tormentors in the past. The ending is not what I expected but it works very well and Carey Mulligan's acting in this film is superb complemented very well with the ensemble. A must film to watch."
    },
    {
      "rating": "10",
      "text": "Wow. Just wow. Incredible film that keeps you guessing. Just when you think you have it figured out, Emerald Fennell takes a hard right and completely takes the audience on a new course. This will be a favorite of mine for years to come."
    },
    {
      "rating": "10",
      "text": "Promising Young Woman is a well acted revenge story with thriller elements. The film works off of expect the unexpected. I would think the film would go one way, then it goes an entire different way. I loved this movie. I have never been more entertained by a film since Freaky 2020. I highly recommend you see this movie and support it. It doesn't shove it's message down your throat and it doesn't tell you all men are bad, even if all the men in the film are bad. SEE IT!"
    },
    {
      "rating": "7",
      "text": "its an original screenplay. I like ending scene but I dont understand how she knows ending? she did not plan this, there is no connection btw ending."
    },
    {
      "rating": "10",
      "text": "Revolutionary and uncompromising. Promising Young Woman is one of 2020's best films."
    },
    {
      "rating": "9",
      "text": "Amazing film with a tragedy end....I think that CAREY MULLIGAN must take this year the OSCAR...."
    },
    {
      "rating": "10",
      "text": "Charli xcx boys Men dancing 1st victim we see appears at first to be less harmless than his Neanderthal counter parts. Can driver clearly sees she is \"intoxocated\" he takes cassie back to give cassie more alcohol. Takes cassie to the bed room proceeds to kiss cassie and remove her panties. She repeatedly and clearly asks \"what are you doing?\" He shushes her. Cut scene to where either she killed or beat him up. Eating and getting cat called on the way home she stares down the construction workers as they become uncomfortable insult her and walk away. At her parents home everything is bright even her attire. Great music and fashion choices throughout the entire show. Her work at the coffee shop. Second victim does not receive a red or blue mark but green. Maybe indicating that he didn't take it far so he lived. A guy from med school recognizes her and wants to date her. The date is fun but from her trauma she doesn't allow it to go far physically which frustrates her. We learn more from her actions and details about nina and medical school. Chapter 1 Meeting with 3rd victim. At lunch cassie brilliantly never actually intoxicates herself. But based on the old friends choices puts her in a dangerous situation. Supposedly but as im not done watching I believe cassie had it staged to look like she had been raped. Karma indeed. Chapter 2 Victim 4 the now Dean surrounded by white men portraits was the person nina reported her rape to. The dean remembers Al the rapist but not nina. Because Al is back this causes her to execute a dangerous course of actions in defense of nina who must be dead. Suicide? Constant theme of victim blame. When the deans daughter was in danger supposedly she gets fearful but can't remember what room nina was in. Confession from the dean. Her daughter was never in danger. She also stated people come to her with accusations 1 to 2 times a day which she ignores. Victim 5 insults her and she beats up his car with a tire iron. She seems to be possessed by her pain and suffering. Forgets she has a date and lies to Ryan. I hope he remains good. Cassie gets caught by Ryan with a possible victim. Victim 6 realizes she wasn't drunk and knows his friend took Cassie home so she threatens and scares him. Chapter 3 former lawyer he remembers nina. Happened when they were 23. 7 years ago he was the lawyer who made nina drop the charges. The lawyer knows what he did was wrong. He is on sabbatical because he had a psychotic break. Cassie didn't think he would be this honest or even remember. She is scared or confused. He is apologetic. Cassie begins to cry and forgives him at least one person has suffered like she has. Cassie had a guy waiting outside to hurt him but called it off. Cassie went to ninas moms house. Cassie hasn't visited or talked to her in a long time. Everyone lives in such beautiful homes. Cassie bed frame always looks like angel wings behind her. Everyone wants her to move on but she blames herself. She throws out her notebook and goes to see Ryan. I feel like something is going to make her use the notebook again. Ryan doesn't take her back. Cassie goes into a depressive state. The desserts are delicious looking. Ryan comes to see her and asks her out. They kiss for the first time. Romantic dating montages let's see how long it lasts. Ryan meets her parents. Cassie always wears her half of the necklace. Cassie nails are always a different color on each finger. Ryan and cassie confess their love for each other. Madison victim 3 has shown up to her house. This is the stressor for cassie. There was a tape of ninas assault. This changes everything for cassie. Ryan was there in the video 7 years ago. Cassie knows what she must do. She threatens to get him fired. She needs the rapist als bachelor party location.  Chapter 4 Toxic instrumental finally plays and its sickening. Cassie uses Nina's name to spoke al. Verification that nina is dead. They are passed out. Cassie wants a confession. Kids doesn't equal 23 and rape at any age is bad. Cassie dropped out to take care of nina. Al tries to suffocate cassie when she went to carve ninas name all over his body. Cassie is \"dead\". Joe comes in and makes a plan to dispose of cassie and cover up the \"murder\". They burn cassies body. Cassies parents report her missing. Detectives go interview ryan.Ryan doesn't tell the batch. Chapter 5 Cassandra aka cassie knew she would possibly die. Because she is a smart **** Everyone gets some. I qma super fan of the director enjoyed her in call the midwife. I hope she directs more masterpieces like this."
    },
    {
      "rating": "10",
      "text": "I watched this movie four months ago, and I still think about it.This is a look into rape culture, mysogeny, internalized mysogeny, and how trauma can have us seeking revenge. I initially was left feeling empty at the ending, but it truly was the perfect most realistic ending. Life is hard and perpetrators get away and are not held accountable the majority of the time. I bumped up my score from a 9 to a 10 because I truly believe everything was thought out and interesting: the pastel color palette, the angling of the camera for halo and wing motifs, the wide shots throughout making her feel small and insignificant, the casting knowing that the audience has preconceived opinions about the men cast, the outfits and all of the settings,etc."
    },
    {
      "rating": "10",
      "text": "It is the kind of movie that you expect to go into dark places, however, through the journey you hope for the best while expecting the worst. Carey Mulligan deserves the Oscar for her impecable performance."
    },
    {
      "rating": "10",
      "text": "Incredible movie. This is the fatal attraction of men who (try to) take advantage of women when under the influence. Great performances and powerful ending."
    },
    {
      "rating": "10",
      "text": "Funny, thrilling and a good effective drama. Not like many other movies out there."
    },
    {
      "rating": "9",
      "text": "A bold, provocative exploration of rape culture, misogyny, and the possibility of obtaining vengeance"
    },
    {
      "rating": "10",
      "text": "This film demonstrates the impeccable writing ability of the writer who is also the director, it simply blew me away."
    },
    {
      "rating": "10",
      "text": "I never laughed while crying inside and never come close to crying while laughing out loud at watching a Film. Never before watchingEmerald Fennell's Masterpiece, Promising Young Woman (2020). I mean it.This is the film that Cinema needs. Absolutely memorable, entertaining as **** deep, believable... God, I'm out of words.Carey Hannah Mulligan is MESMERIZING. The best actress of the year and if you're asking me, The best actor of the year as well.Please find Martin Scorsese. Show him this film and say: Don't worry man, This is Cinema."
    },
    {
      "rating": "7",
      "text": "“Can you guess what every woman's worst nightmare is?” You know, I find it genuinely concerning that some people are angry and upset over this movie. I mean, just look on IMDB. Film is subjective and it’s OK not to like this movie, but the thing I don’t understand is why certain people are upset with the themes this movie appropriately presents. Even through deep inside I know why. If it scares them, good, because they deserve to be scared. ‘Promising Young Woman’ is a rare revenge movie that crosses several genres with one sharp sweep. Some parts are funny, other times it’s romantic, but it can get DARK really quick. I thought the way it was executed was creative and interesting. It shocked me at times with its twist and turns, even though it shouldn’t be surprising. The world can be so dark and treacherous that being surprised by its twisted ways is a bit foolish. Certain elements felt realistic, while other elements of the movie felt...well, like a movie.It’s nice to see that Carey Mulligan’s career is getting better and better. In this movie Mulligan delivers an amazing performance that was captivating to watch. It’s difficult to imagine an actor playing a character who is dealing with so much emotional baggage and vulnerability from past events in her life, but tries her best to conceal it, but Mulligan manages to find the right balance. She can be extremely funny, emotional, and really intimidating. Her drunk acting deserves some praise as well, because within the movie her character pretends to be drunk in bars or nightclubs, to trick “nice guys” who want take advantage on her intoxicated vulnerability, before she drops the act to scare them enough to teach them a lesson. The transformation from drunk to sober was nothing short of impressive. I was surprised to see Bo Burnham here and it’s great seeing him getting acting roles. He is a man of many talents; comedy is one of them and in this movie he never fails to make me smile. Alison Brie and Alfred Molina are also in this movie and both did a great job in their small roles. I give this movie major credit for being unpredictable. I would sometimes try to guess where the story might be heading, to only have the rug pulled right under me. It was an interesting choice to cast likeable actors in the roles of predators and despicable people. The movie smartly suggests that people like these can easily hide their sinister side through a fake smile and popularity. Now I’m being vague about certain things because I’m hoping what I’ve said so far might boost your interest in checking this one. I’m starting to do that now, going in blind and leaving impressed (hopefully). Director and writer Emerald Fennell did a solid job on delivering a fresh and unique take on a brutal topic with extreme care on the subject matter. This is also her direct debut and everything I’ve seen on screen shows great potential for her as a filmmaker in the future. The look of the movie has that candy-like colour to it, which made the movie look visually appealing to the eye. Revenge has never looked so colourful. Without spoiling the ending for the movie, but the way it concludes is very strange and rare. I was both sad and happy at the same time. However, it can also make or break the movie for some, while I was kind of mixed on it. Some parts of the ending were realistic, as it was a cold reminder for us that sometimes justice isn’t always severed. Unfortunately, this is where my issues start to come in. When I said some parts of the ending was dark and realistic, well to me it didn’t quite commit to that with the last few minutes of the movie. I just wished they took more of a real approach to conclude the conflict that could be plausible. I also thought the movie was a little on the nose with its social message at times.And that’s really it for issues. What, you expected more? Surprise!Overall rating: Revenge is best severed in confetti and rainbow colours."
    },
    {
      "rating": "9",
      "text": "This was an excellent film that I didn’t expect to be this good. It’s insane that this is a directoral debut for Emerald Fennell because her direction is fantastic. Every shot and character is so incredibly well planned and thought it. I’m very excited to see what this director is capable of in the future. Carey Mulligan is incredible as the main character. It’s easily one of my favorite performances of the entire year. Her reactions and how she delivers her lines is fantastic and I’m excited to see what she does with her career after this. Every performance here is great to be honest. I always feel skeptical when they cast comedians in films that are supposed to be dramatic but Bo Burnham killed it here. It goes to show that anyone can do an amazing job given the right material. This has some of the best framing and cinematography of the year. Each shot is visually pleasing in how it’s framed and each shot knows what needs to be in it. Every shot felt to me like it was intentional in what it wanted to show. In other words, there was a certain aesthetic to the film that worked very well for the tone. The story of the film is powerful, emotional, well thought out, and relevant. The film has a lot to say about rape and sexual assault and How authority figures act on it without being overbearing or too on the nose but it can feel like that at points. The last 45 minutes of this film is just gut punch after gut punch and it’s great. The film does a great job at making you feel for Mulligan’s character. While some may find the ending a little over the top and dumb, I didn’t. I thought the ending made logical sense and it was a huge pump in the fist for the main character as I was starting to root for her. I would highly recommend checking this out if you are okay with the dark subject matter."
    },
    {
      "rating": "9",
      "text": "Corajoso! Acredito que essa palavra define completamente o filme, tanto para o assunto em que ele aborda quanto para as decisões tomadas em seu roteiro. Carey Mulligan consegue fazer o melhor trabalho da carreira, deixando para trás o que ela fez no memorável \"An Education\". A trilha sonora é sensacional (o que fizeram com \"Toxic\"???) e já valeria a pena assistir apenas para ouvi-la. Eu simplesmente não posso tirar os olhos de Emerald Fennell em sua direção agora."
    },
    {
      "rating": "9",
      "text": "It felt so good to see something in theaters again. Outside of the obvious that Carey mulligan is so magnetic onscreen this entire film all the actors really bring so much to their roles even in small amounts. The direction is so stylized and so many scenes just hit you right in the face this is a film you will remember and think about for days to come. Highly recommend"
    },
    {
      "rating": "10",
      "text": "The best thing I watched last year. Everything makes the film just perfect, the actors, script, songs. I was always in shock with all that was happening, they really went for an Oscar."
    },
    {
      "rating": "10",
      "text": "Possibly the most thought provoking, clever, gorgeous movie I’ve ever seen. Emerald Fennell is a force to be reckoned with what an absolute genius!"
    },
    {
      "rating": "10",
      "text": "PYW is simply the most confident film of this season. It never shies away from the ruling principle of its protagonist. An electrifying soundtrack combines with a  razor sharp screenplay, and not to mention an oscar worthy performance from Carey Mulligan -  everything mixes in a perfect cathartic harmony to make Promising Young Woman an instant favourite."
    },
    {
      "rating": "10",
      "text": "Wonderful. Although Cassie didn’t deserve the ending. The power she holds among all of the those a holes."
    },
    {
      "rating": "10",
      "text": "Promising Young Woman was beautifully done, a heartbreaking look at the hard truth that so many do not want to hear or believe of how women are looked at and treated. Carey Mulligan gave one of the best performances I have ever seen, she was exceptional such a beautifully powerful and deep performance while also being hilarious. Laverne Cox, Bo Burnham, Jennifer Coolidge, Clancy Brown, and Alison Brie gave great supporting performances. The writing especially the screenplay was phenomenal. The direction Emerald Fennell took the movie was excellent, the ending was an amazing and shocking twist. The makeup and hairstyling especially on Carey Mulligan, Laverne Cox, and Jennifer Coolidge was outstanding. The costume designs were spectacular especially the ones wore by Carey Mulligan. The music choices were superb. An A+ movie."
    },
    {
      "rating": "9",
      "text": "I would say 90% of this movie is amazing. I greatly admire the writing and the aesthetic of this film. Carey Mulligan gives a riveting performance as the wounded and vengeful woman. I was not 100% convinced by the ending, but when a friend compared it to \"Killing Eve\" it made more sense. (Fennel worked on Killing Eve.)My one complaint is that Laverne Cox was underused as the friend/co-worker. More could have been mined from that relationship.However, the casting was so spot on and the story was, unfortunately, all too familiar. I urge everyone to see this movie then discuss it widely.I look forward to seeing what Fennel does next."
    },
    {
      "rating": "8",
      "text": "Since I saw the first trailer for Promising Young Woman at the beginning of last year, I have been looking forward to seeing what this intriguing movie would be. Of course, due to the pandemic, the original release date of April 2020 was scrapped and I had to wait until after Christmas to finally see it. AND, I risked it all to see this movie in a theater; but, as of today, you can now catch Carey Mulligan’s stellar performance from the comfort of your own home. Promising Young Woman is best if you go into it cold, but as a brief synopsis, Emerald Fennell wrote and directed this story about a young woman, whose life has stalled since a tragic event in her past, and follows the extreme measures she takes to cope until a new opportunity presents itself. I can’t keep a secret – this movie blew me away.Carey Mulligan plays Cassie, the young woman with the aforementioned promise, whose world was rocked when she was in medical school, and now she’s taking matters into her own hands. Cassie is bold and cunning and smart as a whip. She’s disarming, reckless and determined. Mulligan hits every note just right and plays Cassie with that delicate balance in tone that this film strives for. It is something special when the right role and the perfect actress come together. Don’t be surprised to see Carey Mulligan popping up in this year’s Best Actress races.This is Emerald Fennell’s first feature film as a director, and she has previously written episodes of “Killing Eve.” She clearly has a firm handle on mixing thrilling elements and humor. The social commentary throughout the film is so thought-provoking while also being incredibly entertaining. There is not a boring moment throughout. Fennell has written not only an interesting plot, but the dialogue throughout is sly and calculated to keep you off guard.There is some discussion about whether Promising Young Woman is a comedy or a drama. That categorization probably doesn’t matter. It certainly is dramatic, and there is definitely comedy here, but it is as dark as they come. With a cast populated by Bo Burnham, Alison Brie, Jennifer Coolidge, Max Greenfield, among others, there is a clear intent to infuse humor into what can be a dark and triggering subject matter. No matter how you classify it, ultimately, it is just really good.Really, everything comes together just right in Promising Young Woman. It is refreshing to see a new film that has something new to say. This one is it. Do not miss it. If you want to brave the theaters or rent this one at home, it is worth the time and money and the big box of popcorn."
    },
    {
      "rating": "9",
      "text": "Before #metoo, its will always hard to defend yourself as a young woman, maybe one day one night, you were drunk, and somebody did something sexual to you, and do you think there is somebody will believe you, and that somebody was just a fifty, rich, white boy? But you were also young girl living in a suburb family, could this possible lead to justify what he did could that trauma lead to you to the end?Cassie, undergoing grieve for 7 years of her BFF, because she was not go with her to the party that day, blaming herself forever that her friend suicide over the raping in the party, and no justice happened for the white boy, yet everybody knew, but no one tells, no one believe her but that boy, and no matter what, boys will always protect each other, also the women.Carey Mulligan is FANTASTIC, she process the emptiness, the grieve, happily in love, madness and determination for revenge. Emerald Fennell wrote such script, have such meaning of the society for their preference or truth, the rich will always protect each other. Everyone has it shinning moment but MULLIGAN is EVERYTHING.The story is so impactful, tasteful, surely a lot of men will not believe anything what a person could go through, no one said all the men are evil, this story is hard to get over, it will stay in your head for a while because of it, the story reflex of real life, not just harassing, even today some critic trying to gang up for Mulligan, because Mulligan criticized one critic that she is not Hot enough or not Maggot Robbie who has been doing similar characters, blindly protecting or defending each other no matter it's wrong or not. a lot of today's situation is similar to this particular pastern, its stall in it system of this society, will people ever think about it, is it right or wrong?Even with #metoo, its doesn't change anyone how they believe in, will people know about it will tell it? Will they only believe it only a lot of people who experienced it and telling it? there surely a lot of issues around it society, but Promising Young Woman perfectly tell a story, and give its story perfect ending."
    },
    {
      "rating": "7",
      "text": "Great acting but the movie never feels like it really gets going. One leaves the movie with conflicting emotions"
    },
    {
      "rating": "10",
      "text": "Just realized what feels off with the ending, a certain absence. Carey Mulligan indeed steals every moment when she is onscreen. Her exceptionally strong performance, the grotesque, chilling but at the same time very funny script, and the shrewd, genre-mixing direction makes this title one of the best movies of 2020."
    },
    {
      "rating": "10",
      "text": "MUST WATCH! Film went beyond all expectations. Great performance by Carey Mulligan and come Oscar time a nomination and maybe winner as Best Actress. Other Oscar nominations to Emerald Fennell in Director and Screenplay categories..pitch perfect black comedy, drama and commentary on society."
    },
    {
      "rating": "10",
      "text": "I loved it, and then i hated it... and then I liked it again... then I was mad... then angry.... then sad... 10/10."
    },
    {
      "rating": "1",
      "text": "More misanthropic drivel coming out of Hollywood, victimized women award show fodder. \"Men are all inherently evil, no matter how nice they act\" - what a great message to send out to the world. Should really help human relationships. It's a crutch of mediocre talents to make these dark and despicable movies/TV shows where everyone is awful and the audience feels awful. It's even seeping into superhero movies -- every man in Wonder Woman 2 not named Chris Pine was a disgusting creep, catcalling and raping every woman with his eyes. And it seems only female critics feel free to criticize this stuff in movies; men all feel pressured to pretend to like this garbage, because they are afraid of being called sexist. At some point, we may have to consider that women are also capable of being sexist."
    },
    {
      "rating": "0",
      "text": "Watched this with my wife. The cinematography is good, the writing is tight. But the overall story and concepts are weak. I understand what they are trying to cover in this movie: the predatory nature of some men. But they are doing it in a very ham-fisted, pretentious, unrealistic way, very typical of these third-wave feminist movies that hate men and absolve women of all responsibility of their actions. The men in this movie are all portrayed as dishonest, weak cowards, and the protagonist gets away with mad behaviors that she would never get away with in real life. There is a scene where she toys with a person’s daughter, and any parent will tell you that if someone did that to their child, they would beat that person within an inch of their life. In this movie, the parent just says “you’re right, I understand your point of view now”. Ridiculous. My wife hated the movie as well. She said this is a movie that a 14-year old would enjoy."
    },
    {
      "rating": "1",
      "text": "One of the worst movies I have ever seen. The only thing good about it is Carey Mulligan's performance. Everything else about it sucks especially the directing."
    },
    {
      "rating": "10",
      "text": "This film is genius; heartbreaking, uncomfortable viewing. Carey Mulligan's performance is the standout for the last 12 months. The movie inverts the trope of 'a wronged man' who becomes a hero by avenging his friends killed or wronged by generic evildoers. Everything from Batman to Marvel soars to this generic idea of the transformation of a person from the everyday type to a hero through revenge and vengeance. But here the payoff is painful, the lead character Cassie portrayed as mentally imbalanced, wildly inappropriate, suffering PTSD, sexy, funny, hopeful, and the proverbial loose cannon. As a first film, it's incredible. You love Cassie then you loathe Casie, then you understand her. Don't miss it!"
    },
    {
      "rating": "8",
      "text": "This has the makings of a cult-classic. I have seen few dark-comedies as good as this one in recent years, and I was pleasantly surprised by some of the bold choices. Carey Mulligan is incredible, and the supporting cast is great. Without spoiling anything, I loved the ending but came away feeling it still could have been even better. Even so, this is an exciting first film from Emerald Fennell as a writer/director, and I can't wait to see what she does next. This is a must-watch for \"nice guys\" everywhere."
    },
    {
      "rating": "7",
      "text": "The story was good if a little implausible in places. How is it a tall, attractive young doctor is still unattached? I liked the performances but the direction was heavy-handed."
    },
    {
      "rating": "4",
      "text": "It's safe to say I'm out of line with my opinion on this one. But I do think, however, this really had potential that's as luminous as its fantastic glossy pastel colour palette. It's such a shame, though, the movie's handling of its subject matter is extremely heavy-handed. It seems to assume that by merely touching on the social issue in hand would be enough to solve it, something that's misguiding in itself. Moreover, instead of directing its energy at conveying its message, it unapologetically celebratory basks in its perfunctory manifesto without offering any real insights. Still, I believe it really could've been better, given the promising \"Dean Walker\" subplot in which we could see only a glimpse of the depth this movie, sadly, has forsaken for reveling in its underdeveloped premise with great panache. Props for the superb cinematography and the fact it's an enjoyable watch are due, nonetheless. (4.5/10)"
    },
    {
      "rating": "10",
      "text": "Brilliant depiction of painfully familiar situations in an insanely entertaining, gripping and rattling way. It just hits a nerve with this fresh yet harrowing take on this topic. Definitely mind-blowing in all the best ways."
    },
    {
      "rating": "0",
      "text": "let me summarize the movie for you, All the guys in the world are evil except one, Oh! no wait! he is evil too, this movie was just dumb as ****!!!I watched it and thought OMG this is so stupid and shallow let me see if everyone else is laughing at this. but apparently people think it's a master piece :D.I'm just DONE with western movies and critics, make a dumb movie about blacks, gays, women or Jews you don't need a story or at least some connection to the reality and critics will praise it and if you want an Oscar just combine 3 out of 4 that's a guarantied Academy Award."
    },
    {
      "rating": "6",
      "text": "While it aspires to make a profound statement about the mistreatment of women, this dark comedy/revenge thriller unfortunately misses the mark in several key areas and, sadly, ends up sending a message that makes its victims look no better than those who victimize them. Insufficiently explained story elements and an awful, overlong ending detract even further, scraping some of the glossy polish off this otherwise-stylized offering. To its credit, the superb, award-worthy performance of Carey Mulligan and the film's occasionally inspired writing help to elevate this picture to a level above where it might have otherwise landed, but, regrettably, that's not enough to save this attempt at cinematic nobility. Don't buy into the hype; it's not worthy of the excessive praise."
    },
    {
      "rating": "7",
      "text": "Another feminist revenge tale that sticks it to the man, but it's made with chutzpah and Carey Mulligan has never been better - 7 stars"
    },
    {
      "rating": "1",
      "text": "This revenge thriller sees Carey Mulligan as the titular young woman of this film, a vigilante who goes around feigning drunkenness at nightclubs in order to trick men into trying to sexually assault and have their way with her as retribution for a past crime committed against her and a friend. Oh boy... Where to even begin with this one. I had very conflicting feelings going into this one. Part of me thought it did look in fact very promising and clever, while the other part of me thought that it looked like a far-fetched and preachy statement on behalf of the 'Me Too' movement. And unfortunately, this film without a doubt turned out to be the latter for me, but it didn't even prepare me for how much worse this film turned out to be in the final quarter or so. Not only did it squander and seemingly only scrape the surface of its premise and potential, it simply missed the opportunity to make a clever statement on the 'Me Too' movement as a whole, with the exception of only a couple of clever scenes and dialogue in my opinion. And then we come to the final quarter or so of the film, which starts to forget about the whole point of the film (justice for wronged women) and instead begins to dive into sadism before attempting to deliver quite possibly one of the most far-fetched and absurd punchlines I've ever seen in a film, so much so that by the time it arrives, it was far too late for the film to be redeemed in any way for me. I just could not suspend my disbelief for the life of me. Literally the only redeeming quality of this film is Carey Mulligan's career-best performance on display here. She doesn't hold back at all and is as fierce and as memorable as she'll probably ever be. Otherwise, this film was overall not only a major misfire and missed opportunity to make a much more focused, clever and on-point statement on sexual misconduct and the 'Me Too' movement, but it's quite simply the worst film of 2020 for me. There's just no other way around it."
    },
    {
      "rating": "2",
      "text": "I went to see this with my girlfriend, talking about how everyone was giving it positive reviews. Within the first 5 minutes she turned to me and said \"oh no it is going to be one of these movies\", and I said give it a chance. It will get good.Well it didn't get good. This movie was boring, pretentious,  you barely see any murder in it, Nd above all else is a man hating movie.It goes out of it's way to make sure you know men are bad and deserve to be punished, hell even the men who did nothing wrong at all deserve to be punished.  With a twist ending that will make you leave with a sour taste in your mouth, this film is a big letdown  and just another movie that panders to man hating feminism.  And at 2 1/2 hours, oh boy was this a slog."
    },
    {
      "rating": "0",
      "text": "Mulligan/Fennell are electric; Felt sick during credits. Ignores people fundamentally opposed to revenge. Tries so hard to justify character's questionable actions, which it knows are questionable. Ends don't justify means."
    },
    {
      "rating": "2",
      "text": "If you've seen the trailer to this movie, you've been cheated even before you see a second of the actual film (i.e., the trailer  implies one plot, while the movie has another ...). With this stated, let's discuss \"the flick\". About the only thing good about it is Carey Mulligan's magnificent, Oscar nominated performance (spoiler alert, she's not gonna win this time, but she will eventually). Most of the other performances are so poor that you aren't sure if this is supposed to be thriller or a parody (and that's the DIRECTOR'S FAULT).  The subject matter of this film is no joke, yet the script treats it in a less than compelling way.  For the first 30 minutes, I found myself repeatedly saying, \"this is shyte\".  Then, for the briefest of moments, the plot finally begins to build into something that \"might\" prove engaging and thus worth watching.  But, alas,  it doesn't last and I was back to saying the \"shyte\" word again.  I will only further state that the climax and denouement are incredibly \"disappointing\".  So, from preview to closing credits, this film is a stinker (may have something to do with the \"shyte\" in between)."
    },
    {
      "rating": "3",
      "text": "The trailer was more captivating to watch than the actual movie.  I thought there would be more gore and thriller entertainment. The main character build was confusing and never made sense in the end.... I will never watch this again, I can not understand how this got a 91% rating on rotten?"
    },
    {
      "rating": "1",
      "text": "A ridiculous fantasy revenge story exploiting the seriously real heinous crimes some girls are victims of.  If you can get past its tedious tone and several absurdities, it's not a bad way to spend nearly 2 hours."
    },
    {
      "rating": "6",
      "text": "From the trailer, this looks like a devious woman (Carey Mulligan) lures predatory men by pretending to be very drunk, then exacts violent revenge. The reality is quite different. Granted, she does pursue men who prey, but only to shame them. This woman, who’s deeply disturbed after losing her best friend, sets out for retribution from everyone who was involved in the original act. While her schemes are a bit diabolical, the sullen drama and slow pace tamp it down. Mulligan does an effective job, but Bo Burnham, as her new beau, offers a few moments of charm and respite from the endless sullen sulking. Yes, there are messages about the issues around rape and consent, but the whole thing aims for more emotional connection than it produces."
    }
  ],
  "recommendations": [
    "the_hunt",
    "elle",
    "the_machinist",
    "collateral_beauty",
    "prisoners",
    "no_country_for_old_men",
    "hereafter",
    "gone_baby_gone",
    "up_in_the_air",
    "split",
    "revolutionary_road",
    "slumdog_millionaire",
    "blue_valentine",
    "unforgettable",
    "a_history_of_violence",
    "falling_down",
    "savages",
    "manchester_by_the_sea",
    "me_before_you",
    "to_the_bone",
    "the_unforgivable",
    "the_intern",
    "the_descendants",
    "black_swan",
    "swiss_army_man"
  ]
}