{
  "id": 316,
  "title": "Prometheus",
  "starring": [
    "Noomi Rapace",
    "Michael Fassbender"
  ],
  "runtime": 124,
  "genre": [
    "Science Fiction",
    "Adventure",
    "Mystery"
  ],
  "description": "A team of explorers discover a clue to the origins of mankind on Earth, leading them on a journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qsYQflQhOuhDpQ0W2aOcwqgDAeI.jpg",
  "categories": {
    "plot": 3.8448275862068964,
    "acting": 4.348837209302325,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.2,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 6.642857142857143
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The dumbing down of science fiction films is prevalent throughout the entire genre.  With Prometheus I was hoping to find salvation.  What I did find however was shockingly poor.\r A character list that I couldn't care less about launch themselves headfirst into a half baked search for the creators of humanity.   Supposedly intelligent crew members of the Prometheus take every opportunity to stick fingers in alien goop and open doors to suspected infected shipmates without a second thought.\r Questions that I am not really sure I had are now bugging me as the film does more to promote itself a sequel than pay dues to the Alien franchise that it basis itself on.\r Praise is due for the geek squad who, like the 'photos of the fairies' believers at the turn of the century, go to great lengths to cover the tracks of Mr Scott and attempt to second guess the conveluted script and explain away some of the more gaping holes.\r The only saving grace I can think of may well lie with the obvious sequel.  If this second film delivers something truly original and sews together the Prometheus/Alien/Space Jockey stories so incredibly well as to produce something of an epiphany, then, and only then will these words be eaten.  I think that I may well go hungry."
    },
    {
      "rating": "3",
      "text": "I wanted to like this movie so much.  I am a huge fan of the Alien films (the first 2 at least) but I tried not to let that influence my take on this movie.  Visually, this movie is great.  The CGI with the ship is amazing and the rest of the effects make you feel like you are really on an alien planet.  I will say  that I was not particularly impressed with the creatures though; Aliens felt more real than this.  The most glaring problem with this movie is its lack of development of the characters; Charlize Theron's the most.  There was a lot of potential to explore so many interesting facets of the characters but most of them are ignored.  You get nibbles of some great side-stories to some of the characters, but then it is never mentioned again.  A lot of the scenes seem rushed and many times you are asking yourself what the motivation for some of the character's actions are only to be met with the end of the movie and no answer.  Michael Fassbender does play the android character perfectly.  For me, it all starts with the story.  If the story is flawed then no amount of effects, great acting or other frills is going to make the movie great.  I feel bad for Ridley Scott, as he has obviously fell into the same \"modern film\" hole as many of the other great directors (George Lucas, Steven Spielberg).  If you want a decent sci-fi film with good visuals, rent this movie on DVD.  If you are looking for a masterpiece, look elsewhere."
    },
    {
      "rating": "3",
      "text": "It looks great, but it's a typical noisy 2012 filmunderneath that. The characters, script and plot are poorly set out. There is little tension, partly because the characters are continually stupid and unlikeable, and partly because the inappropriate soundtrack never shuts up. It needs more room to breathe, more silence, and some honest examination next time. And fire the writers, please."
    },
    {
      "rating": "0",
      "text": "Prometheus is the story of a trillion-dollar mission to discover the origins of human life on a distant planet. Basically, this is supposed to be the greatest exploration undertaken in the history of mankind.So who do they send? A gaggle of fractious goons whose collective scientific nous is rivalled only by that of the Three Stooges. Within minutes of touching down (conveniently beside the only 'man-made' structures on the planet, a'la 1960s Star Trek) the 'scientists' are yanking off their helmets, on the basis of 'it seems fine to me', dipping their fingers into strange organic ooze, and lugging a severed alien head back to an unquarantined spaceship in a sandwich bag.Once there, they speedily discover the meaning of life. Then, while one of them gets a bit drunk, his two female companions decide it would be useful to stimulate the head electrically to reanimate it. They don't say why. They give it a bit too much juice, then too little,then dither over too much or too little like a couple of schoolgirls fiddling with a dicky bunsen burner, while the most important scientific discovery in human history waggles its ears and rolls its eyes â"
    },
    {
      "rating": "5",
      "text": "I LOVE the premise of the movie. But the writing is lacking. Afterwards, my friend kept saying, \"That movie could've been awesome.\" I don't blame it on the fact that we were all looking forward to it. The main problem was that the characters were written poorly. I won't go into the other problems (editing, other story telling elements)."
    },
    {
      "rating": "7",
      "text": "Ever since I saw the first teaser trailer for this film, I have been very excited. Sadly, I think that my expectations were too high going into this film. The movie ended up not being bad, but it wasn't as amazing as I had hoped it to be. The movie had strong acting, but weak characters. It is a tense movie, but it fails to recapture the quiet tension of Alien, although it doesn't really try to. Overall, the movie was hampered by a poor script that needed more time to develop the characters and to strengthen the plot. I hope that if they do make a sequel, they are able to learn from mistakes because if they do, it could be a truly great film. I enjoyed the film, but was let down by it nonetheless. I had hoped that the movie would better expand upon the mythos of the Alien Universe but instead, it only muddled it more. Still, there were some fun treats for fans of the original and I would still recommend seeing it, just go into it with lower expectations than I did."
    },
    {
      "rating": "2",
      "text": "I have a few questions to add to the list that everyone here seems to have covered already...why did the pasty giant alien guy drink oily ooze in the beginning anyway? What was the motivation there? Why did the captain leave the bridge with guys trapped ina storm on the planet to have sex with Charlize Theron? Why was she even in this movie?!?!? All she did was bark out husky commands that belied everything that was happening. Why did people who were infected with alien embryos turn into raging zombie creatures? Why did Charlize and the other chick keep running forward when the ship was rolling at them instead of to the side where they easily could have avoided it? Why does the big pasty guy \"birth\" the alien in the escape pod. According to the first Alien movie, he's in the pilot chair on his ship where it crashed. Nice job everybody. And my biggest question of all: where can I have surgery that opens up my entire abdomen, removes a substantial lifeform, staple me back up and then I can run, jump, hang from cliffs, barrel roll and only have to stop once in a while for a quick stabbing pain that seems more like explosive diarrhea than major surgery after effects. Wow. This movie sucked. Nice to see Ebert and company taking studio bribe money so they don't trash this pig **** of a film. They'd never recover the advertising loot if they did. Don't waste your time. Collapse"
    },
    {
      "rating": "0",
      "text": "This movie is so incredibly atrocious that it's hard to put into words just how bad it is!The story is laughable, the character development is non-existent, the pseudo-science claptrap is intolerable. It is a hateful pastiche of the Alien films with other elements stolen from any recent sci fi you can think of. The dialogue is cringe-worthy in the extreme - just embarrassing. There is exposition delivered at every possible opportunity.Going against evolution and having humans made by a creator means you're starting with by wiping out our knowledge of science, which strangely won't appeal to many sci-fi fans! Yet if you're going down this route, don't use DNA matching with the engineers as evidence, as it quickly begs the question, what about the DNA similarities with our evolutionary cousins? The man who wrote this tosh is clearly an ignoramus - best start with a basic understanding of science if you plan to write sci-fi!I left the cinema feeling extremely disappointed and just plain angry that I wasted hours of my life watching such drivel. It makes me sick to see the great talents of the visual effects artists wasted - not to mention the gargantuan sums of money that it must have cost. I have lost all respect for Ridley Scott, and I hope this pile of offal fades quickly into the obscurity of failure and doesn't besmirch the incredible legacy of Alien and Aliens.Read the Forbes review for a pretty spot-on summary of its failings:http://www.forbes.com/sites/daviddisalvo/2012/06/11/review-prometheus-is-a-visually-stunning-epic-failure/"
    },
    {
      "rating": "0",
      "text": "Prometheus has a good premise, good ideas, good intentions, but it executes all of them wrong. In fact there are so many inconsistencies you could write an entire review just listing them, don't believe me? Well there you go:-the scientists go from paintings on walls to \"it's an invitation from our makers to go meet them on a remote planet\", just like that, HUGE stretch there don't you think huh-the old man that organized the whole expedition pretends to be dead, for no reason, only to show up at the end with no one giving a crap that he's actually alive; what was the point of pretending to be dead to begin with then???-they hire completely incompetent and crazy people to conduct an expedition that cost billions and billions; those guys lost themselves in a cave when they have a 3D MAPS OF THE ENTIRE CAVE with gps, good god-the android poisons a crew member for no reason whatsoever, the main character even finds out about it and still doesn't give a crap when it was her fiance he poisoned-when the main character is impregnated with an alien they tell her they have no other option but to put her in hibernation when they have the best surgical machine available, which she then uses herself to get the thing out with no problem at all-talking about the surgical machine, why was it programmed for a \"male patient\" when it was owned by Charlize Theron, does that mean that her character was a actually a man?-why was the bald dude in hibernation for god knows how long when it was clearly stated he wanted to destroy mankind, or something, why was he just sleeping there if he had such an important mission to accomplish?-why did he just attack the characters like a rabid bull if he's supposed to be so smart and superior to us, couldn't he outsmart the crew and try to manipulate them instead of just going Rambo on them and failing miserably?-why the hell did such a terrible script get approved?"
    },
    {
      "rating": "2",
      "text": "A monumental disappointment. Up there with the Star Wars prequels, the X-Files movie and, of course, Lost. It's not a spoiler to say that none of the fundamental questions posed by the trailer or marketing materials for Prometheus are answered. Worse, as an insult to the viewers, these questions are re-asked at the end of the film to entice them to spend their money on the next installment of a potential franchise. In the way that Lost became merely a commercial for itself (all tease, all promise, no pay-off), Prometheus shows reveals Lindelof's involvement by simply being a 2-hour commercial for a sequel. Lindelof is fundamentally an advertising genius posing as a storyteller. But it's not the lack of answers that hurt most. Early reviews prepared me to leave without resolution. What really hurt was its tone-deaf script, logical incoherence, lack of suspense, and sluggish feel. I thought, at the very least, I could get off on this movie aesthetically but it breaks no new ground there and feels oddly devoid of passion visually. There are a million choices that go into a movie to make it feel real, which will then make it interesting. But nothing that happens in Prometheus feels real (even by sci-fi standards). There aren't any real people in this film. The characters never come to life. The action barely arrives. Everything feels television-thin. There's no depth to soak in. Just hack work and expensive-looking cinematography.There's something dangerous about artists who once had a traumatic experience in the industry in their earlier, art-film periods and lived to fight another day. George Lucas and both Scott brothers seem to almost resent their fans and the early, experimental years of their own legacies. All three now make bloodless work on a grand scale that seems to have forgotten the cadences of good, human storytelling.And I wish Lindeloff would stop hurting my feelings.In the end, Prometheus is a metaphor for itself. My friend and I who went both wished we had never gone and felt an urgent need to warn others not to make the same mistake. Rapace says it best: \"WE WERE SO WRONG!\""
    },
    {
      "rating": "3",
      "text": "There isn't a frame of Prometheus which is suspenseful, mysterious or fresh. The narrative and logic get jumbled unnecessarily after the first 20 minutes or so, and then everything gets clunky and uninspiring. Who is the protagonist? Who is carrying this picture(Fassbender, Rapace or even Theron)? The film does answer this question only in the final 10 minutes, with an almost laughable ending. The movie has a great sequence and detail in the beginning where a character watches and emulates TE Lawrence(Peter O'Toole) from Lawrence of Arabia...it's a very cool piece to see David Lean's epic in 3-D. The rest is TV Material at best."
    },
    {
      "rating": "2",
      "text": "Dreadful. Ridley Scott has harvested all the best bits from the previous Alien films and jumbled them all up together to make a clumsy hotchpotch of a film that tarnishes his record.  Some of the dialogue is embarrassing.  The action is tedious, I was bored after about 30 minutes.  The story is infact quite dull.  Wait til it's on TV one Christmas, see something else unless you enjoy disappointment."
    },
    {
      "rating": "0",
      "text": "Who wrote this dribble?Scientists who remove their helmets on an alien world because the air seems fine.Scientists who try to take shelter from a storm by leaving cover to race it... to different cover.Scientists who refuse to investigate life signs,then attempt to pet the alien worm cobra emerging from the black ooze a few minutes later.The sissybot who,for no discernible reason,poisons a crew member,who then has sex,immediately  impregnating his girl,to which she then performs her own abortion with the only side effects being some pain while running.Scientists who transport an alien head in a sandwich bag,only to destroy the head in the most unscientific way possible,lessmorelessmore Boom!.Let's include a razorhail storm that inflicts zero damage,the odd mutated human attacking humans for some reason(Braaaaains maybe?),waking a giant alien,who then proceeds to kill all humans(I call him Bender),some tentacles,a sissybot head that can fly an alien ship,some running and avoiding an alien ship crashing by rolling 3 feet to the right,more tentacles,a glimpse of a true ALIEN,and then finally the credits.It also had Biff from Back to the Future in it trying to find the secret of eternal life,but he is killed in 5 min flat so who cares.I'd talk about the story but The Cat in the Hat is far more coherent and entertaining.30 odd years waiting for this S..T!"
    },
    {
      "rating": "1",
      "text": "What a spectacular disappointment. The pictures are pretty, but that's it. The characters are paper thin. Their motivations are never explored. Everyone does really stupid counter-intuitive things that leave the audience groaning in disbelief. It assaults any sense of disbelief by continually ejecting you from the movie with an incongruous plot device. Science fiction should be smart about science, there should be internal logic. This movie isn't scientifically fact checked at all (the half a billion miles from earth that Theron says they have travelled, puts them near Jupiter, not another solar system - which would have been an incredibly easy thing to check... but it isn't). And that's just the beginning of the disgrace (flamethrowers work without oxygen, a woman runs around after having her stomach muscles cut, medical machinery is gender specific, video camera's cannot record, there is no gps to find missing team members although they are wonderfully display in HD mapped holograms... and on and on... it seems to go out of its way to be stupid). Science is treated as magic and smart scientists as people with \"faith - not facts\" in science with wonderful responses like \"I choose to believe\" when asked for scientific evidence that begins a journey costing a trillion dollars. These are scientists... you know people who spend their whole life looking for facts. But in our story, the main scientist doesn't present facts, we the audience (and the Peter Weyland the financier) must just accept her word that she might be right because she has faith. Peter Weyland pays for everything, secretly wakes up on the ship, goes to meet his maker and is summarily killed. Wow... Guy Pearce has about as much screen time as the aliens do. Groan.The musical score is turgid, just doesn't fit and repeats far too often. All in all, it's the worst Scott movie I have seen by far and is most certainly the most expensive flop I've ever seen. Stick to the viral movies on youtube... they are far more interesting."
    },
    {
      "rating": "2",
      "text": "Though I dearly wanted to like Prometheus (I love Alien/Aliens, Blade Runner, and all the other classic scifis), I thought the film was just awful, driven by an absolutely terrible script. It's as though it's written by twelve-year olds for seven-year olds - full to bursting with cringeworthy dialogue, unresolved plot strands, and laughably bad characters. That this film was even  allowed to be released in this form is a testament to so many of the things wrong with Hollywood today.On the plus side, it's visually gorgeous - but that just ain't good enough."
    },
    {
      "rating": "3",
      "text": "What a disappointment. This flick has a generic, nonsense and plot hole driven hollywood-esque script and some of the worst acting i've seen this year (even from fassbender, who does a laughable gaybot impression; not that he had much to work with, since the dialog is atrocious). there were some genuinely beautiful shots (the nature vistas spring to mind), but some really, really terrible ones as well. the alien design is cringeworthy, with avataresque, muscle bound and retarded looking space jockeys, penis shaped water snakes and octopi topping the cake. do yourself a favor and don't waste good money to see this flop."
    },
    {
      "rating": "10",
      "text": "After seeing the Previews I had mixed feelings about Prometheus. Yes it looked like it would be visually pleasing, and I love the original Alien, liked Predators and Alien 3, but all of the other films set in the fictional Alien/Predator universe are pretty terrible, especially AVP2 which was one of the worst films I have ever seen. After AVP2 I vowed I was done with both of the franchises for good. But after some coaxing by a couple of friends, I reluctantly went to see the Prometheus opening in IMAX. Couldn't be happier. Amazing visuals. Intriguing plot lines. Excellent character portrayals by most of the cast. Intense edge-of-your-seat thrill ride, but not only was it thrilling, it was gripping. The cinematography was excellent. The character development of David was spectacular. The story line exceeds all of the other movies of the Alien/Predator franchises, except for the original Alien, combined. I'm glad I spent the money to see the IMAX version, and I am planning to see this at least two to three more times in IMAX before its run is over. Last movie I saw in a theater more than once? The first Matrix film. Saw it twice. This movie is right on par with it as far as an overall experience. Surpassed even Avatar, far surpassed in my opinion, in overall 3D movie experience/entertainment. This is a must see. Anyone saying it was boring, or hard to follow, doesn't know what a great movie is. There is no hand-holding through the movie. You must think for yourself and form theories as you as you go along, and this film kept me guessing through the end, but not to a point that I ever felt I was \"lost.\" Wonderful Experience. 9.7/10"
    },
    {
      "rating": "3",
      "text": "There are so many plot holes in this film it's ridiculous.  I have no problem with the mysterious relationship between aliens and humans, but it is littered with leaps in story that defy logical progression.  Characters disappear and reappear whenever it is convenient for the writers.  And for a seminal moment in the history of humanity, the voyageurs treat the trip with the nonchalance of a visit to the Grand Canyon.  Please Mr. Scott, stay away from Blade Runner before you tarnish that film also."
    },
    {
      "rating": "10",
      "text": "Let me start this up by saying I haven't enjoyed a movie this much in a long time. The machinery of the Hollywood distribution business has fallen into the repetitive practice of hipping up product that sinks itself within five minutes of opening, unable to support the almost god-like audience expectations. And Prometheus is no foreigner to the fabricated Hollywood momentum. To say there has been a lot of anticipation built up around Ridley Scott's latest cinematic dream is an understatement.It seems Hollywood finally got it right. We no longer have to drone ourselves to the theater and laugh off what the ads were claiming would be fantastic and is actually born to mediocrity. We can expect a movie to be as good as it's expected, and in fact, even better. Much much better.I attended the midnight screening late Thursday night and the energy in that place was amazing. This is what story telling is about. The human need for the discovery of an incredible story is well alive. It bonds us all. Gives us a reason to dream and fight for what we want. The illusion is the flame.The screenplay felt flawless. It would have been so easy to make this another fare in Alien combat. Us running around helpless with useless weapons. Them chasing us effortlessly. The pretty girl screaming on the side. I think other filmmakers did that once or twice.Not John Spaihts and Damon Lindelof. These two delved deep into humanity's unanswerable questions. Who are our Gods? Why? Where? And what is to say of the father-sibling complex? Are our parents like Gods to us? Gods of flesh that have guided us to where we are? Or are they simple humans we must be rid of in order to proclaim ourselves as masters of our own insignificant universe? This and much more is all tucked away behind the perfectly stylized curtains of Ridley Scott's science fiction world.The movie feels right down fascinating. Reminiscent of that first Alien film. Those early shots way before the egg was revealed. Even the opening shots inside a dormant Nostromo. Remember those? How haunting? How intriguing? Ridley's hand is still very much present here. At its best shape. I simply couldn't get my eyes off that screen. Fascinating. Even the 3D element played well into it. I thought this might turn into another \"let's poke the audience in the eye\" kind of trip, but instead it felt like an immersive experience. I almost forgot I was in a movie theatre at times.Dramatically. The acting was phenomenal. Nothing that required exaggerated exuberance. Acting is mostly an art that goes unnoticed because of its sincerity. So real that we don't question it. A simple matter of fact. This film required that kind of delivery. The kind of dramatic honesty that allows the screenplay to unfold itself effortlessly.I will close this by pointing out that I wasn't particularly scared this time around. I recall being horrified the first time the Alien burst out of Kane's chest back in the day. Although, Prometheus doesn't seem to be a product of the horror genre. Suspenseful and though provoking are more along the line of the goals this motion picture attempts to deliver, and does masterfully."
    },
    {
      "rating": "3",
      "text": "you know in horror movies where some teens are out in the woods and they see a house with severed heads outside, and they say 'hey let's go in there and ask for help' and the whole audience groans and also rubs its hands and waits for the monster to come and chop the idiots to pieces? well sadly transfer that level of idiocy to space, and substitute scientists for teenagers, and you've got Prometheus. There are SO MANY holes and 'WTF???' moments. From people pointing at a totally vague cave painting and deciding it's an accurate star map and an invite from aliens zillions of miles away, to approaching an obviously mad space snake, and petting it, (guess what happens next)... to opening the spaceship door to totally bonkers monster men just for the hell of it... oh you get the idea. Enjoy it, but for lords sake, don't take it seriously."
    },
    {
      "rating": "9",
      "text": "I loved it. You are left with no answers, but that is definitely the whole point. Visually the movie is a masterpiece from start to finish. Once the action and thrills start roughly 45 minutes into the movie, they never let up. Michael Fassbender as the devious, soulless 'David' was easily my favorite character in the movie. It's a thrill ride that does its job, to entertain. At the very end you see the connection between 'Prometheus' and 'Alien' and it is one of the most rewarding things I've seen on the silver screen in quite some time. I've read some rather mixed reviews but as years pass I fully believe this will be regarded as a classic."
    },
    {
      "rating": "10",
      "text": "Spectacular......we finally have a return to the glory of Sci-Fi! It poses many questions....it answers some but leaves many unanswered. It opens the window to the unknown and challenges it's audience to think. That's what makes it great. The performances are all strong, the effects are top-rate, the creatures were unique and horrifying, and the duration was just right. Ridley Scott's Prometheus is another ground breaker and will be remembered for a long time."
    },
    {
      "rating": "5",
      "text": "Whilst some of the film was left open for people to work out, like why David infects Charlie, or why the Engineers were going back to destroy Humanity... it felt a little bit... vague. Too much felt left open. It also ticks some unfortunate horror cliches, in the way the two scientists petrified of a potential life sign... then decide touching a random alien creature would be a good idea... or why Elizabeth doesn't make sure her Squid (Congratulations, You've had a ....squid)... is lasered in half. Unfortunately most of the problems with the film were due to the plot, which is average at best. Maybe it will age well but at the moment it feels underwhelming."
    },
    {
      "rating": "2",
      "text": "Roger Ebert has lost it long ago. My favorite movie of all time is Aliens and I want to say that I saw it at a midnight showing with a great crowd that was very quiet (You go Alamo Drafthouse!). Yes, this movie is very pretty with outstanding cinematography. But it's all about story and this one is just terrible. The story is disjointed, leaves too many unanswered questions in an attempt to be cerebral, and finally, is just downright boring. The atmosphere was not tense at all, their were no frights just unbelievable scenes. I don't want to give away any spoilers but just think about this review when you see Noomi's need for medical attention. It's one of the worst scenes I can think of in my last 20 years of watching movies."
    },
    {
      "rating": "3",
      "text": "This movie had such great potential, good actors, good special effects and cinematography and plenty of budget to work with. However the script let it down miserably, with a horrible predictable and unengaging story. From a sci fi fan perspective it was dull but with great cinematography and from a horror fan point of view the predictability combined with lack of suspense or anything at all to get you on the edge of your seat just made the whole thing fall flat. without a doubt the most disappointing movie of the year."
    },
    {
      "rating": "3",
      "text": "Not good. A hotch-potch of ideas that seemed chucked together with no real story or theme. Heavy-handed direction, paper thin characters and fan fiction style dialogue. Visually ok, but again it seemed caught up in its own sense of self importance. If you like Alien, don't watch this because like all prequels it ruins the mystery and of the original."
    },
    {
      "rating": "2",
      "text": "Prometheus should be renamed to Prometheus a ship full of idiots. The simple truth about this movie is that the characters make incredibly idiotic decisions that lead directly to there death.  Many scenes were like looking down the barrel of a gun then pulling the trigger to see if it's loaded, as if that's the way you do it. The choices that the characters made ranged from slightly odd to WTF did they do that for? This was more then a bad movie it was almost like no one read the entire script all the way through. I truly believe that someone like me.. Someone who has never made a movie, someone who doesn't know the intricacies of movie making would have said at some point during the making of the movie, \" Hey man.. that doesn't make any sense and only an idiot with a death wish would do that\""
    },
    {
      "rating": "9",
      "text": "Don't believe the naysayers and the whiners who had such lofty expectations they would never be fulfilled. As a huge fan of Blade Runner and Alien, I have to say Scott delivered exactly as I expected him to. He raises just enough questions to get your mind running wild and let's your imagination take over. I was absolutely rabid to know more once it was over! The movie was technically beautiful, with 3D not done this good since Avatar. I mean you don't even notice it's 3D and that's the mark of a director who knows how to use it. The sets were incredible, the pace near perfect. Fassbender was acting out of his mind, he deserves a Best Supporting Actor nod, it was that good. And through it  all, despite my confidence I could predict every move, at least two scenes caught me off guard, and at least one of them I know I said, Oh My God, out loud. Shock value as only Ridley Scott can deliver, and I will be thinking about this one long after I've seen it three times. So brush aside the haters, and go see some of the most intelligent, gorgeous sci fi we've seen in a long time. Welcome back Ridley! What took you so long?"
    },
    {
      "rating": "9",
      "text": "Though it expects you to bring some knowledge of the sciences and ALIEN canon, Prometheus is a fantastic film. At the same time, it is able to stand on its own as well as connect seamlessly to the Alien franchise, so no matter what you're hoping to get out of it,  you'll likely get it. The setting is gorgeous, the atmosphere tense, the acting believable and professional, Giger's designs are in top form, and Scott delivers three or four of the deeply disquieting scenes Alien is renowned for (though one more in the third quarter would have fit in nicely; the disturbing factor fades into regular tension/drama by that point and it honestly felt like just one more \"WTF\" was missing). The additional depth added to the story arc by keeping your Alien pop culture and biology/evolution knowledge on call is a great bonus. I went into this as a long-time sci-fi/horror fan with high hopes, and for the most part Scott delivered wonderfully."
    },
    {
      "rating": "0",
      "text": "I went to the midnite showing, expecting to finally see a good alien movie like the original  Alien. I was so wrong. It will always be a mystery how we got here or who made this place we live on. We all have are beliefs. This movie is rated in my book as one of the worst movies I have ever seen. That's 10.00 I will never get back and feel like a fool for going to see it. Over acting, under acting, it was a mess. There was about 65 people in the theater and I did not hear a peep from any of them and when the movie was over, I heard nothing but negative comments of disappointment. I had no compassion for any of the actors. Please take my word for it, it is not worth the gas to go to the theater. The best part of the movie was it ended and I could go home. No horror in this movie, just si-fi done wrong, action was weak and limited at best. I'm so pi**ed off I want my money back and will call the theater tomorrow and ask if I can have it back or a free movie pass. I feel sorry for the people who are going to waste there money Friday nite to see this B rated movie. I dont understand how anyone could give this movie  more then a 1 rating. at least my slushy and nachos were good. I could go on but I wasted more then enough time warning people not to waste there money. But go for it. You WILL be sorry and say I should have listened to that bigfoot guy. I am a movie freak, and this movie suc**d big time. Maybe it got some good reviews cause they took something that altered there minds and dont even remember the movie, just the buzz they had."
    },
    {
      "rating": "10",
      "text": "A superb spectacle of action, an intriguing story of speculative science, and a supremely chilling horror film, Prometheus is one hell of a movie. Acting, dialogue, cinematography, and editing all come together seamlessly in what is perhaps 2012's most thrilling film. Devoted Alien fans and newcomers alike will be delighted by Ridley Scott's beautiful new melding of technology and good old fashioned storytelling. Keep an eye out for Fassbender- he has a damn good chance of snatching up a trophy or two come award season; never has there been a more convincing human portrayal of an android. Highly recommended."
    },
    {
      "rating": "0",
      "text": "Ridley Scott is an arrogant fool who doesn't know how to make movies.This movie is carried by incredible cast and visuals."
    },
    {
      "rating": "0",
      "text": "Easily one of the most boring movies ever made. this is easily the worst alien movie. this movie has good visuals but no aliens throught most of the movie. the characters all suck and are nothing but idiots just watch any other sci fi movie even the last jedi and you are better off"
    },
    {
      "rating": "3",
      "text": "This is what happens when number of neurons in your brain is so low its alien. Alcohol + finding Jesus in old age = big albino space Jesus cant create xenomorphs because then you cant go to heaven. RIP Gigers artistic vision and world building. Three points are only for visuals, cudos to visual department, everything else is beyond repair."
    },
    {
      "rating": "6",
      "text": "A return to form for franchise, return of visual strength and attempt at tension. Not totally successful though."
    },
    {
      "rating": "1",
      "text": "I strongly dislike this movie. It is illogical, plot-hole-filled, pointlessly gruesome, and the plot was pretty slow too. The characters do not make sense. I rate it 1 because it looks good."
    },
    {
      "rating": "7",
      "text": "Better than literalists give it, worse than the devouts give it credit for, Prometheus is not without it flaws in plot and not without it's triumphs in cinematography and strong acting from Noomi Rapace and Michael Fassbender, and due to the ending, lends promise to an adequate follow-up."
    },
    {
      "rating": "9",
      "text": "It's strange... I came away from the cinema unable to contain my upset at the way prometheus teased its plotline through scenes of horror action topped by the aliens fan in me nagging on the fact scott didn't just cast lance henrikson to reprise his role as weyland and make it all canon to the other films.\rYet on a later viewing I found myself looking past such filmic foibles able instead to enjoy the wonder of artwork going on and appreciating its pace, timing and its finer details like the wonderful creature effects (mainly the translucent engineer skin wow). Still complete sequel bait asking and answering very little about its universe (apart from the engineers revealed as malevolent weapons manufacturers rather than space zoo keepers as i'd originally hoped).\rFact is I still find myself imagining this universe all over again and that gives me naive hope for the next movie. 9/10"
    },
    {
      "rating": "3",
      "text": "An insulting sci-fi movie, that delivers an anti-science message, and insults the intelligence of its audience. A huge budget and a few star names cannot disguise what is really just a badly written pretentious movie rife with plot holes that are not minor, and which leans on a whole lot of religious symbolism and pseudo psychology, based in part on the ramblings of well known fraud, Erich Von Däniken. This movie cannot stand in the shadow of Alien. Right from the start any intelligent viewer will be pulling his hairs out due to the illogical actions of the characters, and their dumb dialogue. The irony here is that every single death in the movie could have been entirely prevented, had any of the scientists behaved like actual scientists. And this is exactly what makes the movie so insulting. It delivers a message that science and skepticism are bad things (such as being skeptical that the air on an alien planet is breathable). It portrays a lead scientist who doesn't use science, but \"chooses to believe something is true\". Can we get a different lead scientist for this mission please?! This movie could easily be renamed to \"Please don't stick your fingers in that, -the movie\". When characters behave so suicidally stupid, it becomes impossible to be invested in the characters as a viewer. There's some really cheap sequel baiting at the end too."
    },
    {
      "rating": "1",
      "text": "an awful movie. Makes no sense and boring to death. The only great thing of this terrible mess is the visual effects. I wanted to get out of the theatre but i spend my money on this so i have to finish it."
    },
    {
      "rating": "1",
      "text": "If I recall, the original Alien was good because it was, in the first place, a bloody well made movie (acting, dialogues, tension).With or without the burden of the franchise one cannot ignore the fact that the script is a disaster. It's full of outright stupid situations. Among others, the long awaited contact between humans and space jockey race turns into a less awaited bar fight. Seriously.In the end, this is no school movie, to let it pass because it 'merely' failed at one of it's crucial parts.I will not even dive into the squiddish designs (who is scared of a calamari?)... So to conclude, with the script fixed and certain scenes remade the movie would perhaps be decent. Also the overall artistic impression is good. However, still far from it's ancestor.+ 7 for the work done- 5 for the script+ 1 for design except..- 2 for the squid"
    },
    {
      "rating": "5",
      "text": "Underwhelming and extremely polarizing, Prometheus is a movie that will be remembered more for its ideas than its execution of them. Its special effects and acting performances are great. It's a solid movie that introduces a lot of problematic elements into the Alien franchise. It is not a terrible movie. For me, its a popcorn movie that you can turn your brain off to and enjoy without thinking too hard."
    },
    {
      "rating": "3",
      "text": "Truly the stupidist script ever to be filmed by A list creators. At every turn there is something that induces eye rolling.And because it's so stupid it's also very enjoyable. Favourite bit: scientists electrocuting the ancient and precious Engineer head moments after discovering it - GOOD SCIENCE!"
    },
    {
      "rating": "3",
      "text": "\"Prometheus\" has a lot going for it. An interesting cast with real presence. A director with five decades of cutting-edge film-making under his belt. A premise that pursues classic philosophical questions about the origin of life within a straight-up genre movie framework. And some of the finest, moodiest cinematography any studio picture has managed to deliver yet in the 3D format - make no mistake, the picture looks a (hundred) million bucks. But for all that it feels fundamentally hollow and redundant. The cast are largely squandered on roles that either fail to convince or outright irritate. Scott's grasp of technical pizzazz seems, in this picture at least, to exceed his ability for solid dramatization. There's always plenty of stuff going on but little of it is ever truly compelling or stimulating. And, MILD SPOILER, the film's one effective horror scene even introduces a convenient narrative cheat which would essentially neuter the entire \"Alien\" mythology which \"Prometheus\" supposedly backs into. Prequelizing established classics has many pitfalls and \"Prometheus\" falls headfirst into the biggest one: it wants to be \"Alien\" and not be \"Alien\" at the same time. This built-in identity crises scuttles all the effort involved from the off."
    },
    {
      "rating": "7",
      "text": "I really liked this film but there were many missteps in how the crew were assembled. In real life, you would never spend so much money on a “mission” of any kind without preemptively getting EVERYONE to buy-in to said mission. To travel a hundred million miles & then try to pitch that **** crew into believing is simply retarded. Also, my biggest complaint is the dude who played the part of the love interest of female Dr whatever who was the anthropologist. He would make a good casting decision if he was playing some uneducated, city drug gang member but not a PhD! NO WAY. For me, I want the characters to be believable and not incongruent with whom they are supposed to be playing. One more: I think it would have been so much more interesting to have developed the story with the big muscle aliens who had our DNA and created humans. Instead it was the typical monster alien cliche.there were so many possibilities that I feel were ignored so they could create the typical storyline. But I have to say I still loved the film and the music couldn’t have possibly been any better. I’ve watched it five times. Ridley Scott you are an amazing director. Look forward to your next film!"
    },
    {
      "rating": "6",
      "text": "Whilst visually excellent, Ridley Scott fails to do the Alien franchise justice by being seemingly diverted with an obsession about Michael Fassbender"
    },
    {
      "rating": "7",
      "text": "This film is filled with seamless visuals and great performances that will leave audiences pondering about the thought-provoking questions that it raises."
    },
    {
      "rating": "6",
      "text": "This film is not very good at least because there is no logic in it. To go out on another planet based only on the fact that the atmosphere is the same as on earth is the most stupid act as for me. Also in some places the actions of the actors are not clear."
    },
    {
      "rating": "6",
      "text": "Aliens prequels and sequels have so much promise and it’s not that this is a terrible movie. In fact some actors and parts of the story are quite good, but some are pretty bad."
    },
    {
      "rating": "2",
      "text": "One of the worst movie I have ever seen!!! It is Science-fiction without the science part!\rThe cons: 1. PLOT HOLES (As big as the distance between Earth and the planet they have visited!)\r2. No character development (Noomi Rapace's boyfriend is \"murdered\" by the android David, but at the end of the movie they become buddies...OK...)\r3. The \"scientists\" are nothing like real life scientists (They act childish and not like a group of professionals sent to a billion dollar mission)\r4. WASTED TALENT (The movie stars actors as Noomi Rapace, Michael Fassbender, Charlize Theron  but even they can't save the movie)\r5. The ending (Ridley Scott made the movie unfinished just to make a sequel in the future...He needs to pay the bills too!)\r6. The science (They land on a plant without mapping it first, Noomi Rapace's self-surgery and how she walks around after that ETC.) 7. No suspense (There are several action scenes but they feel very dull and stupid)\rAnd many more problems the critics seem to forget about when they give the movie 100/100 scores!!!\rMaybe they were watching a different movie....GOOD FOR THEM!"
    }
  ],
  "recommendations": [
    "sunshine",
    "stowaway",
    "alien_covenant",
    "the_cloverfield_paradox",
    "jurassic_world_dominion",
    "annihilation",
    "the_tomorrow_war",
    "snowpiercer",
    "jurassic_world_fallen_kingdom",
    "war_of_the_worlds",
    "monsters",
    "star_trek_v_the_final_frontier",
    "the_midnight_sky",
    "geostorm",
    "the_core",
    "captive_state",
    "district_9",
    "transformers_the_last_knight",
    "interstellar",
    "chaos_walking",
    "lucy",
    "independence_day_resurgence",
    "gravity",
    "source_code",
    "eo"
  ]
}