{"id": 1834, "title": "Psycho", "starring": ["Anthony Perkins", "Vera Miles"], "runtime": 109, "genre": ["Horror", "Drama", "Thriller"], "description": "When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother.", "releaseYear": "1960", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/yz4QVqPx3h1hD1DfqqQkCq3rmxW.jpg", "categories": {"plot": 4.0, "acting": 2.6, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "I have not  seen  Alfred Hitchock's Psycho but i need see the remake . the  new film describes every detail\rof the original that is good the new generation of the film is the darkness of Vince Vaughn and the shower scene which was the best part . The remake was Absolutely the best one i scene and the psycho series was fun too ."}, {"rating": "8", "text": "♤♡♤♡♤♡♡♡♡♡♡♡♡♡♡♡♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》"}, {"rating": "8", "text": "You know I just don't get all the hate this film gets. I mean I know the shot for shot thing feels a little redundant. But this is really a very different film. Gus Van Sant's disturbing, psycho sexual execution is very stylish and unique. Vince Vaughn's goofy, insecure but oddly seductive Norman Bates is a underrated treat. Anne Heche, Viggo Mortensen and especially Julianne Moore's feisty take on their characters are all solid. Although the original film is undoubtedly superior. This unique reimagining pays the ultimate tribute to the material while retaining a dark magic of its own."}, {"rating": "10", "text": "niihhiihihihihinininhiihihhiihingyfugyftdrseatfihojojohihigugugugyfyfygugugihidewrthjmkjjyiugugighiihihhiihihuuu"}, {"rating": "0", "text": "Boy, even the late Alfred Hitchcock should've laughed this mess of a remake that hard. Psycho is one of my favorite horror movies of all time and what did they get, a nobody director and a wasted script. Hitchcock was right on one thing. He shouldn't need any color. Insult to injury, this shot-by-shot remake is definitely one of the worst remakes Hollywood needs to stay away. It's pretty stupid when you add Anne Heche, Vince Vaughn (as Young Norman Bates), and Gus Van Sant as a director who just doesn't know what the original version is all about. The original version features not only has one of the scariest theme songs of all time, but the shower scene where Bates slashed his wife is very memorable. At least, we desperately need a proper remake. But stick to the Hitchcock classic."}, {"rating": "0", "text": "OH MY GOD!!! WHAT HAVE YOU DONE GUS VAN SANT?!!! It's just a shot for shot remake! That's all it is! The directing is bad, some of the acting is horrible, and I think it's one of the worst horror remakes ever!"}, {"rating": "0", "text": "Frankly, this experimented shot-for-shot remake is just an insult to the timeless, classic 1960 original version of \"Psycho\"."}, {"rating": "1", "text": "Roger Ebert said it perfectly.  When your shot-for-shot remake turns out to have zero of the intensity of the original, it serves as excellent proof that **** sense of timing and atmosphere simply cannot be duplicated.  Totally pointless and completely forgettable.  Watch the original."}, {"rating": "1", "text": "First of all this remake was unnecessary, but besides that it was: flat, without suspense, without atmosphere and the good cast was also missing (basically it lacked everything what made the original a great movie, which stood the trial of time). Gus Van Sant is not a bad director but he missed with this one! Not recommended!"}, {"rating": "0", "text": "A pointless, flat remake that is downright offensive to fans of the original masterpiece."}, {"rating": "0", "text": "Neither the original nor this remake are scary at all you would have to be younger then 10 to find this scary. If my 12 year old cousin and 6 year old cousin didnt jump once then the film isn't scary."}, {"rating": "0", "text": "Horror fans really should thank Gus Van Sant for his experimental \"copy exactly\" approach to re-making the horror classic Psycho. Just modernizing the original with a bigger budget takes no creativity and falls into the tedium and redundancy which most horror fan's hate.\r Gus Van Sant's Psycho remake, where nearly every scene is \"copied exactly,\" is a perfect example of this. It was simply BORING. Even for those that never saw this first, the pacing is just too slow for the high-octane generations of the 90's and beyond.\r For a re-make to resonate with an audience that knows the original by heart, it has to deliver a new and different version while staying within the bounds of the original framework. We should be thankful because no director will try this again. For the secret formula to successful horror re-makes, watch 2012's The Evil Dead, 2004's Dawn of the Dead or David Cronenberg's The Fly (1986)."}, {"rating": "3", "text": "A pointless remake of a movie that should have been left alone in the first place. I'd say It's biggest problem is Mr. Vince Vaughn, who I just can't see acting in a film like this."}, {"rating": "4", "text": "Vince Vaughn is so laughable it's his best comedy since \"Swingers\". This is a pointless remake that is below all other remakes, not only is it guilty of being a shot for shot copy of the Hitchcock classic taking no artistic chances with the material to steer in another direction whether or not it's good but i'd rather see that than the exact same movie the came out in the 60's and the directors reasoning for it just irritates me."}, {"rating": "2", "text": "A shot for shot remake with awful performances and just has no reason to exist at all\rverdict:The exact same film as the original except this version sucks"}, {"rating": "1", "text": "This film is a shot for shot remake and it's lazy, stupid, and dull.I mean, I guess it's different. It's in color, it's not well acted, there's a bunch of overexposed shots, the very few new additions (like the sexual part of Norman) are awful, the film looks cheap."}, {"rating": "10", "text": "$.$.$.$.$.$.$.$.#.#.$.$.$.$.#.#.#.$.#.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"}, {"rating": "6", "text": "Psycho is not the most successful remake of the original. If Hitchcock's original film is still one of the best thrillers, its remake is second-rate. Not an excellent cast saves, not the transfer of the scene to modern times (at the time of the release of the film). The biggest mistake of the viewer can be watching Psycho 1998 before the original, this can create an erroneous opinion about the original and its influence on the thriller genre as a whole"}, {"rating": "8", "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@\"@\"@\"@\"@\"@\"@\"@\"@\"@\"@\"@@\"@\"@\"@@;@;@;@;@;;@@;@;@;@;@;@;@;"}, {"rating": "0", "text": "This movie sucks! Why would anyone want a shot-for-shot remake of a film that is perfect as it is? Not only was that a dumb decision, but the casting is awful, the acting is bad, they changed the look of the iconic house for some unknown reason. This movie is just bad all around."}], "recommendations": ["the_omen", "the_texas_chainsaw_massacre", "halloween_the_curse_of_michael_myers", "poltergeist", "the_wolfman", "the_thing", "the_amityville_horror", "scream_3", "halloween_h20_20_years_later", "halloween_ii", "book_of_shadows_blair_witch_2", "halloween_iii_season_of_the_witch", "halloween_4_the_return_of_michael_myers", "evil_dead_ii", "martyrs", "scream_4", "the_grudge_2", "the_last_house_on_the_left", "wrong_turn", "exorcist_ii_the_heretic", "from_dusk_till_dawn", "scream_2", "the_texas_chainsaw_massacre_the_beginning", "the_texas_chainsaw_massacre_2", "blair_witch"]}