{
  "id": 100,
  "title": "Public Enemies",
  "starring": [
    "Johnny Depp",
    "Christian Bale"
  ],
  "runtime": 140,
  "genre": [
    "Action",
    "Crime"
  ],
  "description": "Depression-era bank robber John Dillinger's charm and audacity endear him to much of America's downtrodden public, but he's also a thorn in the side of J. Edgar Hoover and the fledgling FBI. Desperate to capture the elusive outlaw, Hoover makes Dillinger his first Public Enemy Number One and assigns his top agent, Melvin Purvis, the task of bringing him in dead or alive.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ezFQaPf4cOEfsl39Me0gSV29d7V.jpg",
  "categories": {
    "plot": 6.739130434782608,
    "acting": 5.911764705882353,
    "ending": 4.5,
    "soundtrack": 1.6666666666666667,
    "cinematography": 4.142857142857143,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.3
  },
  "reviews": [
    {
      "rating": "3",
      "text": "All style, no substance. Paper thin characters. A long music video passing itself off as a movie."
    },
    {
      "rating": "10",
      "text": "I rob banks,\" John Dillinger would sometimes say by way of introduction. It was the simple truth. That was what he did. For the 13 months between the day he escaped from prison and the night he lay dying in an alley, he robbed banks. It was his lifetime. Michael Mann's \"Public Enemies\" accepts that stark fact and refuses any temptation to soften it. Dillinger was not a nice man.\rHere is a film that shrugs off the way we depend on myth to sentimentalize our outlaws. There is no interest here about John Dillinger's childhood, his psychology, his sexuality, his famous charm, his Robin Hood legend. He liked sex, but not as much as robbing banks. \"He robbed the bankers but let the customers keep their own money.\" But whose money was in the banks? He kids around with reporters and lawmen, but that was business. He doesn't kid around with the members of his gang. He might have made a very good military leader.\rJohnny Depp and Michael Mann show us that we didn't know all about Dillinger. We only thought we did. Here is an efficient, disciplined, bold, violent man, driven by compulsions the film wisely declines to explain. His gang members loved the money they were making. Dillinger loved planning the next job. He had no exit strategy or retirement plans.\rDillinger saw a woman he liked, Billie Frechette, played by Marion Cotillard, and courted her, after his fashion. That is, he took her out at night and bought her a fur coat, as he had seen done in the movies; he had no real adult experience before prison. They had sex, but the movie is not much interested. It is all about his vow to show up for her, to protect her. Against what? Against the danger of being his girl. He allows himself a tiny smile when he gives her the coat, and it is the only vulnerability he shows in the movie.\rThis is very disciplined film. You might not think it was possible to make a film about the most famous outlaw of the 1930s without clichés and \"star chemistry\" and a film class screenplay structure, but Mann does it. He is particular about the way he presents Dillinger and Billie. He sees him and her. Not them. They are never a couple. They are their needs. She needs to be protected, because she is so vulnerable. He needs someone to protect, in order to affirm his invincibility.\rDillinger hates the system, by which he means prisons, that hold people; banks, that hold money, and cops, who stand in his way. He probably hates the government too, but he doesn't think that big. It is him against them, and the bastards will not, can not, win. There's an extraordinary sequence, apparently based on fact, where Dillinger walks into the \"Dillinger Bureau\" of the Chicago Police Department and strolls around. Invincible. This is not ego. It is a spell he casts on himself.\rThe movie is well-researched, based on the book by Bryan Burrough. It even bothers to try to discover Dillinger's speaking style. Depp looks a lot like him. Mann shot on location in the Crown Point jail, scene of the famous jailbreak with the fake gun. He shot in the Little Bohemia Lodge in the same room Dillinger used, and Depp is costumed in clothes to match those the bank robber left behind. Mann redressed Lincoln Avenue on either side of the Biograph Theater, and laid streetcar tracks; I live a few blocks away, and walked over to marvel at the detail. I saw more than you will; unlike some directors, he doesn't indulge in beauty shots to show off the art direction. It's just there.\rThis Johnny Depp performance is something else. For once an actor playing a gangster does not seem to base his performance on movies he has seen. He starts cold. He plays Dillinger as a Fact. My friend Jay Robert Nash says 1930s gangsters copied their styles from the way Hollywood depicted them; screenwriters like Ben Hecht taught them how they spoke. Dillinger was a big movie fan; on the last night of his life, he went to see Clark Gable playing a man a lot like him, but he didn't learn much. No wisecracks, no lingo. Just military precision and an edge of steel.\rChristian Bale plays Melvin Purvis in a similar key. He lives to fight criminals. He is a cold realist. He admires his boss, J. Edgar Hoover, but Hoover is a romantic, dreaming of an FBI of clean-cut young accountants in suits and ties who would be a credit to their mothers. After the catastrophe at Little Bohemia (the FBI let Dillinger escape but killed three civilians), Purvis said to hell with it and made J. Edgar import some lawmen from Arizona who had actually been in gunfights.\rMann is fearless with his research. If I mention the Lady in Red, Anna Sage (Branka Katic), who betrayed Dillinger outside the Biograph when the movie was over, how do you picture her? I do too. We are wrong. In real life she was wearing a white blouse and an orange skirt, and she does in the movie. John Ford once said, When the legend becomes fact, print the legend. This may be a case where he was right."
    },
    {
      "rating": "6",
      "text": "With the actors and storyline they had, they could have made this movie great...but there were too many pointless scenes, they could have made this much shorter and more interesting. they left out many interesting aspects of dilingers robberies (like the fact that he used to go into the banks pretending that they were shooting a movie so when they went in to rob it the people outside thought it was a movie shoot...but this was not shown in the movie). overall, not a horrible movie, but i expected more..i say wait for the dvd."
    },
    {
      "rating": "7",
      "text": "I am not sure why this one is not more critically acclaimed honestly. Johnny Depp is fantastic here, as are Christian Bale, Marion Cotillard, and Jason Clarke. The direction from Michael Mann is great as usual and he does a great job creating great thrills and excitement here. At times, things can get drowned out in a hail of bullets, but for the most part, things are very tense and exciting. The cinematography is good, the costume design is very good, and the production design is very good. The script is also solid and gets the job done. Now, this is not the best gangster film I have seen, but it is a darn good one and a very entertaining and well done look at the last days of John Dillinger that is bolstered by great direction and acting. Overall, this one is not a great film, but is certainly a good one that did not deserve the mixed reception it received."
    },
    {
      "rating": "8",
      "text": "This is definitely one of Micheal Mann's most underrated movies, and here's why:\r- This movie was very well directed.\r- The acting, for the most part, was excellent.\r- And the story was more than interesting.\r Even if I love the crime sub-genre of movies in general, it's actually my favorite, but if I had to pick a flaw that most of them have in common, it would be the lack of humanity (I don't mean being nice) in the main character. For example, most gangster movies would describe their main character as a heartless criminal, and nothing else.\rIn \"Public Enemies\"  though, this wasn't a problem. They give enough complexity to John Dillinger (Johnny Depp) to make the audience understand and even feel bad for him when he's going through a problem or something like that.\rChristian Bale is always a good actor, and this is no exception, even if it seemed that he tried a bit to hard to pull off the \"redneck\" accent (when I say redneck, I mean a really NOT subtle American accent).\r Finally, I found the story very intriguing. I wish I could talk about my favorite scene in the movie, but it would really great if you watched the movie (preferably by yourself).\r And you you read this entire review, thanks, I really appreciate it!"
    },
    {
      "rating": "5",
      "text": "Public Enemies is really just another forgettable Gangster movie, with the exception of Johnny Depp there really isn't very much to like about this film."
    },
    {
      "rating": "3",
      "text": "This movie was pretty horrible. Drawn-out, dull, poor transitioning between scenes, and truly terrible camera work. I was not emotionally invested in any of the characters, and Christian Bale in particular was very miscast. This may have all been redeemed had the movie actually been entertaining, but at no point did I think it was. I'd strongly recommend avoiding it, despite positive reviews from the professional media."
    },
    {
      "rating": "7",
      "text": "The story wasn't the best, the action was great. Costume and accents where something new as I'm not a fan of the western style movies, but this was not that - it was a gangster style movie. Christian Bale did a great job for his character..."
    },
    {
      "rating": "8",
      "text": "Just a solid picture. Great cast. Cinematography was great. Micheal Mann has a very distinctive style and it really shows in the film."
    },
    {
      "rating": "10",
      "text": "Honesty is a rare and often sought after trait in any individual, and when we see Johnny Depp portray one of the most notorious criminals in American history, we see exactly what Depression era bank robber John Dillinger was all about, upfront and straight to the point...honest.\rWhether he was a bad person or a man simply following what he was good at is anyones guess, but Michael Mann brilliantly focuses on exactly what Dillinger was known for, holding up banks. We don't need a backstory or a setup for how he took on such a job, we just see what we expect to see, but with Dillinger we see someone who isn't someone we would expect.\rAfter a daring escape from a penitentiary, Dillinger and his friends, including Red (Jason Clarke) and Harry Pierpont (David Wenham), Dillinger is already setting up his next heist, during a great crime wave in the midst of the Depression.\rDillinger uses his charm to woo Billie Frechette (Marion Cotillard) who he is entirely honest with in his robbery prowess. She accepts his life and his determination to be with her, while Dillinger and his friends continue to evade the Bureau of Investigation, leading the hunt is Melvin Purvis (Christian Bale) who took down Pretty Boy Floyd and is now on the hunt for Dillinger.\rAfter several near misses and even a capture, Dillinger brims with confidence at how everyone seems to be at his feet, which Depp perfectly encapsulates. He brings the slick, handsome and straight cut personality to the role that we know from the history of John Dillinger, but with so much more, a scene where he walks freely through the department searching for him is tense, wonderful and also a perfect rendition of how Dillinger liked to live his life. But to quote the film, bank robberies are not getting any easier to pull, and when the Bureau lands down hard, tragedy and blood follow Dillinger wherever he goes. But his only wish is to be with Billie.\rShot in digital high def, Public Enemies looks truly dazzling, the cinematography added with the intense close-ups create a documentary type feel that is reminiscent of the story that is on show. The big cast includes Channing Tatum, a very underrated yet brilliant turn of J. Edgar Hoover by Billy Crudup, Stephen Dorff, Giovanni Ribisi and Stephen Lang.\rWe can only go by what we are told by the history books, but Dillinger was indeed a colourful character nonetheless and Michael Mann has told an excellent story and created a moving and focused film."
    },
    {
      "rating": "1",
      "text": "One of the worst cinematography I've ever seen. They cranked up the sharpen and contrast filters to 11. It is downright un-watchable on a smaller screen with the constantly moving camera and the messed up contrast. I had really hard time distinguishing between a the characters at the beginning, because you only see them for 1 or 2 seconds in dimly lit environments and the camera moves like a madman."
    },
    {
      "rating": "9",
      "text": "Interesting that the lowest review score here is 50. Even the highest rated movies here have some scathing reviews. I think this movie was a bold move on Mann's part - it's being packaged and presented as a summer fun movie, but it's something much deeper. Mann didn't compromise at all on this, he brought his unique vision to the screen - those who understand it, think it's brilliant; the rest of them can't say any worse than 2 of 4 stars. If you have any expectations whatsoever of a lush, Hollywood period piece like Road to Perdition, leave those at the door. This is like a 40's gangster movie remade by Paul Greengrass. We're simply spectators watching events unfold in the last months of Dillinger's life. This is not about backstory or the typical screenwriting devices. Just watch this beautiful, documentary-like vision unfold. The final segment (even the naysayers agree) is profoundly well done and worth the ticket price alone. The shootout at Little Bohemia comes close. Depp, Cotillard and Bale are excellent. Bale's character was a boring guy in real life - read the book - so Bale's restraint is appropriate here."
    },
    {
      "rating": "10",
      "text": "It's a great movie!Johny Depp was really good and the plot really interesting.Good scenes with lot of actions.i believe it would be one of the best movie of 2009!"
    },
    {
      "rating": "0",
      "text": "This movie is not what I expected. I expected a good movie. I guess I'll just watch Juno again. The acting is extremely mechanical especially from Christian bale, he was the worst. There was nothing left at the end if the movie, I felt empty. Since the oscar has changed the best picture nominees to ten movies I thought for sure this is gonna be one of them. If there's humanity in awards thus movie will be left alone, as it it should be. Wasn't worth my time. Just gave me a negative opinion. If this movie was Santa he'd be very hated."
    },
    {
      "rating": "10",
      "text": "Johnny Depp is on my Oscar-watch."
    },
    {
      "rating": "10",
      "text": "Expect some Oscar awards coming from this film."
    },
    {
      "rating": "5",
      "text": "For me, the film failed to deliver so much that was promised by the reputable cast. A meaningless concession of gunfights does not constitute a storyline."
    },
    {
      "rating": "5",
      "text": "when i went to see this movie there was just something about it which made it not an enjoyable experience. the story was fine and well in sequence with the events that occurred in real life with a few changes. however there wasn't enough suspense provided especially since most people will have known what would happen. however the acting does save the movie in most points"
    },
    {
      "rating": "6",
      "text": "The producers of this film would like you to think it is a modern version of the Untouchables, but anyone who has seen this film will tell you it's far from it. It's not that Public Enemies was a bad movies, but a lot of people panned it because they expected a lot more from a 100 million dollar movie, starting Johnny Depp and Christian Bale, and they have a point. The story was flawed right from the beginning because the true story behind it really wasn't that interesting. The filmmakers tried to get people to watch it, by saying that Dillinger and Purvis were comparable to Capone and Ness, but that's not true. In reality, they had almost no interaction with each other and in the movie, whenever they were together, all they did was shoot at each other. There wasn't any chemistry between them, because their supposed rivalry was a fictions element added to an otherwise true story. The film should have focused on infamous bank robber, John Dillinger, but instead it focuses on the FBI hunt for him and his life on the run, long after the bulk of his crimes had been committed. Johnny Depp portrays Dillinger in an attempt to go back to being a legitimate actor instead of a Disney puppet, and he fails miserably. This guy can be one hell of actor, when the role fits his personality, but John Dillinger does not. Depp is an emotionless mess of mumbled lines that almost completely destroy the film. Thankfully, Christian Bale was much better and far more interesting. Public Enemies had big expectations, an all-star cast, and a huge budget, but it turned out to be an average film. That's what had people so upset, because had this been an independent film, they would have been okay with it. The fact that Public Enemies was billed as the next Untouchables, but fails to deliver even a single memorable scene just destroys any credibility the film had going for it."
    },
    {
      "rating": "0",
      "text": "Some movies just seem bad right from the start and Public Enemies is one of them. The screenplay, acting, editing, music and the way the entire film was produced is idiotic. A typical gangster film with violence, horse racing and lots of death."
    },
    {
      "rating": "0",
      "text": "This movie isn't worthy of any score. Horrible directing. It went from weirdly quiet to loud obnoxious gun shooting. I hate it. I could have watched a decent syfy movie for 2 hours. Instead I suffered through this disaster."
    },
    {
      "rating": "8",
      "text": "In \"Public Enemies,\" stale characters are ultimately washed over by spectacular set pieces and brilliant digital aesthetics from the one and only Michael Mann."
    },
    {
      "rating": "5",
      "text": "Now, I'm a sucker for anything set in the 30-50's. I just think that time period makes for great film. But this let me down a bit. There was nothing really memorable in the film that I can go back to and say \"I remember that one scene in Public Enemies where.....\". The film sort of goes from one action scene to the next with little time in-between to make you invest in, and really care about any of the characters. At the end I didn't really care who lived and who died. The final few minutes of the movie didn't have the emotional weight they should have. Nothing in the film really did. On the bright side the action and shoot-outs were pretty good though. If you're going to watch this expecting a cool action movie set during the great depression, then you'll probably like it. Just don't expect much else."
    },
    {
      "rating": "5",
      "text": "Public Enemies is really just a biography.\rSome were disappointed with the execution of this gangster movie, but it wasn't just a \"gangster movie\" it was the factual biography of John Dillinger. The movie succeeds with accomplishing that aspect, but fails to be very interesting or exciting. The characters aren't very likeable although the performances are great. Just an okay movie that is a factual representation of a notorious gangster."
    },
    {
      "rating": "7",
      "text": "The best way to describe it is that it's interesting. Johnny Depp has an air of mystery about him. You feel like you never really got to know him."
    },
    {
      "rating": "6",
      "text": "[***SELF-POLICING SPOILER ALERT*** With \"Goodfellas\", filmmaker Martin Scorsese had fire and ice on his hands too, in which the gangsters played by Ray Liotta(Henry Hill) and Joe Pesci(Tommy DeVito) were studies in contrast, as are John Dillinger(Johnny Depp) and Baby Face Nelson(Stephen Graham) in \"Public Enemies\". Unlike the hot-headed Tommy, an honest-to-goodness sociopath, Henry was a pretty cool customer, reticient even, much to Tommy's mother's irritation, who complains to her scumbag son that his friend doesn't say much, in the scene where the mafiosos sit down(along with Robert DeNiro) for an after hours meal. In \"Public Enemies\", Dillinger, the way Depp plays him, is so in control of his emotions, it's easy to forget that he robs banks for a living. The gangster needs to go beserk, just once, to prove he has a pulse, like Henry, who pistol-whips a guy when the neighbor gets fresh with his girlfriend Karen(Lorraine Bracco). Does Dillinger love Billie Frechette(Marion Cotillard) enough to bash in a guy's head with his gun? It's hard to tell because Depp's performance is way, way, way too modulated. This ain't a Jim Jarmusch film, right? Dillinger is no James Cagney, and that's the filmmaker's point(case and point, the gangster watches a gangster film: in the bijou, W.S. Van Dyke's \"Manhattan Melodrama\" is playing); he was just a man. But these are the movies, so although the reluctance to mythologize Dillinger was a mature decision(\"Public Enemies\" docu-dramatizes him), the potential for an engrossing anti-hero was sacrificed in the process. Baby Face Nelson, on the other hand, now that's our Cagney(he does an imitation of him to some bar patrons in one scene), that's our spark plug, but alas, Graham's rendering of Dillinger's right-hand man is sadly underused. It's the \"Dead Man\" who gets to quote the Hollywood legend, in a scene where Dillinger tries to put Billy's mind at ease about his dangerous occupation, boasting that he's on \"top of the world\", just like Cagney did in Samuel Fuller's \"White Heat\". Too bad he sounds so unconvincing."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie. It"
    },
    {
      "rating": "10",
      "text": "A unique masterpiece. Depp impersonates dillinger in a unique way and gives an academy award worthy performance."
    },
    {
      "rating": "4",
      "text": "Ridiculously violent.. dialogue too muddled to hear. What a waste of 140 minutes."
    },
    {
      "rating": "6",
      "text": "Public Enemies is a strange film, a hodgepodge of melodrama, crime, action and romance. In trying to juggle all these elements, the audience ends up seeing the film"
    },
    {
      "rating": "6",
      "text": "I have always enjoyed Johnny Depps Films, this was in my opinion in the middle of 6 and seven... Depp was Dillinger in my eye's, but, Dillinger was somtimes not what I was hoping, yes he was a bank robber that knew what he was doing, but the movie started to get slow in the middle, to about 3/4's in... It did start back up and in overal i though it was a good film..."
    },
    {
      "rating": "10",
      "text": "The best summer film so far. One of those films were you can't help but root for the bad guy."
    },
    {
      "rating": "2",
      "text": "Rubbish, should've walked out."
    },
    {
      "rating": "4",
      "text": "On the way to nowhere in a boring slow car. Unfocussed. Great scenery, but poor writing, directing and just average acting. A big snooze!"
    },
    {
      "rating": "7",
      "text": "Wow. Really mixed feelings on this film. I'm a huge fan of Michael Mann and his movies are kind of events for me but that can also be frustrating because his work is all over the place. He's been in a period of extremely strong visual stylization that is almost its own art form - Miami Vice and Collateral would almost work better with the sound off. I prefer when he is just being a really good storyteller, though, i.e. Heat, Ali and The Insider. The biggest problem with Public Enemies for me was that it is shot in a really ugly digital format. I know that Mann probably thought it would lend immediacy and reality to the story - which it does in some ways - but it's also distracting. The association in our minds of hi-def to reality is a modern, technological connection that we get from watching documentaries shot on a budget. That effect can be simulated in a modern setting more smoothly for this reason, for instance in 28 Days Later. Here, used on a 1930s historical drama, it stands out like a sore thumb. I was never really able to get lost in the film. There are other problems, particularly the muffled audio that makes Mann's already pithy scrip even harder to follow and the script itself, which is somewhat vanilla. Depp is sweet. Bale is Bale - one note, complete intensity at all times. The smaller parts are played by great actors who sometimes come to life more than the leads. But there is a blunt energy to the movie that is affecting and kind of addicting. I've been thinking about the movie all day since seeing it last night. I think it has soul. I would like to see it again. I really hope that Mann goes back to film, or to another format that is equally beautiful. But I'm also glad he's working as much as he has in the past 10 years."
    },
    {
      "rating": "9",
      "text": "Another classic to add to your collection of gangster flicks. I'm not sure about the actual story of Dillinger--some parts i know were inaccurate--but the film is front-to-back remarkable."
    },
    {
      "rating": "4",
      "text": "Oh, how the mighty Michael Mann has fallen. Outside the theater, I ran into the great writer/director Robert Towne who, when I asked if he liked the film, said: \"No. And I have to take some time to think about what's happened to movies.\" I volunteered that I thought it had something to do with the making of a virtue out of dispassion. In any case, this movie is dull. Johhny Depp is not at all suited to play this kind of part, and I found myself during his scenes much more fascinated that the filmmakers would think, shot as it is in High Def video, that it would be acceptable for us to plainly see he's wearing make up. Christian Bale is dreadful. I'd love if he could perform in anything with a pinky's worth of the intensity of feeling he shows when going after a crew member or his mother and sister. The action had very few touches, just lots of Tommy guns blasting without much effect, and, all around, was pretty much pointless: nothing about how hard economics evokes a certain personality trait, or that some men take badly to authority or they love thrills or that even if we want to see those old days as quaint, they were in fact brutal. Just blah, blah, bang."
    },
    {
      "rating": "6",
      "text": "Horribly shaky camera work. Half the time couldn't recognize the characters because of shakiness. No characters got my sympathy or emotional connection. Nice representation of '30s styles and environs."
    },
    {
      "rating": "6",
      "text": "Boring but the acting is well done. Rent it. see if it's your taste."
    },
    {
      "rating": "4",
      "text": "Sound on or sound off, it is the same movie. Visually exciting, but that is about it. Dull uninteresting characters. Are we really to believe that John Dillinger never laughed or had a good time! Although it gives an accurate historical timeline, it fails to connect on any emotional level. All style, no substance; on balance a mostly forgettable film."
    },
    {
      "rating": "5",
      "text": "The production and acting were amazing; it's just too bad that the whole thing is portrayed as a series of events, and not so much as a plot. It also manages to get repetitive."
    },
    {
      "rating": "9",
      "text": "it was a good movie on the boarder line with great but not quite"
    },
    {
      "rating": "5",
      "text": "S L O W, tedious, boring, no character depth, very little story, could have been a 20 minute selected short."
    },
    {
      "rating": "10",
      "text": "This is a perfect gangster-movie !! Mann is a great director and Depp will win a Oscar for his performance !! Exelent !!!"
    },
    {
      "rating": "9",
      "text": "Intriguing, well acted, and great visuals"
    },
    {
      "rating": "2",
      "text": "I was really looking forward to this movie, but the incredibly distracting camera-work, and the fact that it was shot at 30fps in digital makes it almost unwatchable and feels like it was shot on a home camera. I didn't feel any connection to the characters, and there was absolutely no feeling of suspense, excitement, or sadness during any part of the movie. It really felt like everyone involved - from writers, to director, to actors - just phoned it in. And don't even get me started on the horrendous sound and film editing. Even the music felt amateurish. All in all, a movie that should have been great ends up being painfully unwatchable due to some ridiculous production choices (which will probably be defended as \"artistic choices\")."
    },
    {
      "rating": "4",
      "text": "Michael Manns frantic technique is no substitute for solid storytelling. Style undermines substance and results in a messy and lifeless movie with no real center, and few surprises."
    },
    {
      "rating": "4",
      "text": "I should have loved this movie. I like and appreciate many of the actors and I love crime dramas and heist movies. This wasn't either of those things. This movie was boring, plain and simple. Performances were wooden, facts were implied rather than explained, and I wasn't rooting for either side. Depp never felt like the anti-hero he was supposed to; I didn't care whether or not he was caught. And Bale didn't inspire me as the hand of righteousness he was supposed to represent; I didn't care whether or not he captured Dillanger. And story and acting aside, the film itself looked like it was shot on a handheld digital camera, which often took me out of the movie theater and made me feel like I was watching the homework assignment of a film student. Plus, the movie was more than two hours long. Had I not been with a group of friends, I would have walked out and saved myself an extra hour of my life. All in all, it wasn't the worst movie I've seen, but I expected more that what was delivered and as an avid movie-goer, I was pretty disappointed. I would have much rather spent my $10 seeing Star Trek again."
    },
    {
      "rating": "10",
      "text": "Can't think of a single Mann, Depp, or Bale film that rises above this. The viewer's intelligence is respected; his expectations as a film goer are indulged . . . everything I could have hoped for and more. Depp nailed Dillinger - what a performance - what a cast - what a truly entertaining film!"
    },
    {
      "rating": "1",
      "text": "Lets just kiss Michael Mann's ass, even though the man has indeed made one decent film in years because its Michael Mann so it obviously must be great. Formula, then get 2 big name stars, the flamboyant but good actor Christian Bale and the increasingly eccentric oddball Johnny Depp. The film is average at best and the cheap grainy look of the film looks like it was filmed in somebody backyard like a cheap home video. There is nothing revolutionary or groundbreaking in this film and it is overlong, pretentious and feels like it has something to say that we have already seen in countless gangster films that have preceded it. Overall it is an exercise of style over substance, glossy production values taking center stage over coherent storytelling and background of character motivations."
    }
  ]
}