{"id": 1114, "title": "Pulp Fiction", "starring": ["John Travolta", "Samuel L. Jackson"], "runtime": 154, "genre": ["Thriller", "Crime"], "description": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.", "releaseYear": "1994", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/d5iIlFn5s0ImszYzBPb8JPIfbXD.jpg", "categories": {"plot": 7.75, "acting": 7.466666666666667, "ending": 8.0, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.9, "action": 10.0}, "reviews": [{"rating": "10", "text": "One of the zaniest, funniest, smartest and most entertaining movies I have ever seen. One of my all time favorites as well. John Travolta and Samuel L. Jackson give terrific performances."}, {"rating": "9", "text": "Quentin Tarantino's \"Pulp Fiction\" is not your average gangster movie where people shoot each other and do drugs. This film is about the highest level of perfection you can achieve in the category of gangster films. Led by smart, controversial directions, \"Pulp Fiction\" spills in racism, mistakes, faults, God, and redemption into the game of crime. It's simply astonishing to do such thing, which makes the film a long living masterpiece in film history."}, {"rating": "6", "text": "I'm surprised about how this overrated piece was critically acclaimed by countless viewers. They compare it to Scarface, Kill Bill etc and it isn't even at the caliber of any of the above.The movie is perfect in every way, except the plot. Despite the movie's issue only covering one field, PF just lost four points out of 10 because of filler that lasted for an hour. That filler constitutes of a scenario and a hangout. The scenario being Butch's part and the hangout, where the chick has zero involvement with the plot (if it has any). My father once asked me what Pulp Fiction is about and even I can't answer. Simply told it was an action/thriller starring Travolta and Willis.In short, the plot is not present, despite the unique \"chronologic\" system, which is a really good move. If this movie has a proper plot, I would've given it a 10."}, {"rating": "10", "text": "Best movie ever..hands down!"}, {"rating": "0", "text": "No meaning, no scenario, not funny at all. This movie is just an overrated waste of time."}, {"rating": "10", "text": "Best movie of all time."}, {"rating": "9", "text": "Incredible acting (especially Travolta and Jackson), incredible stories and incredible piece of art for Pop culture! Though the end is a bit frustrating, the plot is great, really I mean it."}, {"rating": "10", "text": "This is one of the greatest movies ever made, absolutely brilliant."}, {"rating": "10", "text": "One of the best movie i've ever seen."}, {"rating": "10", "text": "Great movie. One of the best movies of all time. The thing that makes this movie so great is that it doesnt take itself too seriously. Yes the jokes help this movie out a lot, but who cares the jokes are classic \"Royal with cheese\", \"Big Kahuna Burger\" \"La Big Mac\" that opening scene of the movie is classic and probably one of the best parts of movies of all time. So many classic lines from this movie and its also well acted and directed. Its a crazy movie, that doesnt make sense, but it doesnt try too, and for those of you who say its too long, go watch a Disney movie or one the horror movies out there today, maybe their more your type of movie, you dont have to think as long."}, {"rating": "10", "text": "Funny and entertaining from beginning to end. Amazing script and great acting."}, {"rating": "10", "text": "The finest thing to come out of America period. the only let down is that i will never be able to watch it again for the first time and have that feeling i had when the credits rolled and i was sat there mouth agape unable to take in the awesomeness of what i had just seen. i think its safe to say its without any doubt the best film ever made by some considerable margin."}, {"rating": "10", "text": "I finally saw this movie after seemingly thousands of years. I actually saw Kill Bill before this movie so I was having high hopes that Quinten would pull of another masterpeice, and my hopes were met. The movie characters were witty and realistic. Some scenes(the gun accidently going off) were the most hilarious things I have ever seen. Sharp dialogue, clever editing. There just isn't alot this movie has going against it, besides the fact that there is no real strong storyline going for it. But that is where the beauty of the film lies, it just feels like we are actually following these guys around on one of their, most likely, not so better days. Does life itselfs have a grand storyline that we all need to follow out? No, and neither does this movie, making it all the more better. The dialogue is also perfect. The hamburger conversation feels like a conversation you would find me and my friends having on a normal day. The only complaint I have about this film is that the second chapter, with the boxer, seemed a bit out of place with the other two chapters. Maybe if they threw in a bit more of Vincent or Jools into the chapter it would have fit in a bit better. With that minor Quipe aside, Pulp Fiction is a movie that is more than just a movie you need to see, you have to see this film or forever be haunted by the awesome that got away."}, {"rating": "10", "text": "About as perfect as a film will ever get. See it."}, {"rating": "10", "text": "[sarcasm] Max W, you seem smart. I like smart people. You should tell the world about Tarantino's crappy ideas and the then REDO Pulp Fiction with your amazing filmmaking skills. I'm sure we would all be pleased with the results. [/sarcasm] But, seriously, this movie is great - if you don't get it... move to Canada (or something like that)."}, {"rating": "10", "text": "Brilliantly entertaining. This was the movie that revitalized American cinema in the mid 1990s... though it would have been nice if other directors took his example for inspiration rather than just becoming copycats. This is the 10 in Tarantino's repertoire... nothing before or since has been better than an 8."}, {"rating": "10", "text": "Easily one of the best, most finely-crafted films ever. The only movie that could ever reach the cinematic brilliance of Pulp Fiction was Wizard of Oz, more than 70 years ago."}, {"rating": "5", "text": "Tarantino in full-force and this seem like even more of a talkfest than his others."}, {"rating": "6", "text": "I think there's too much talking along the movie. Good for those that enjoy Tarantino's ideas. In fact, I just watched it once there's lots of people talking about the movie, but it's not big deal."}, {"rating": "6", "text": "I cannot recommend this movie, it is incredibly slow, the idea of a circular narrative does not make sense. Maybe it was non-linear? in which, I can appreciate that they went against the grain with this, but both me and my buddy were watching this film thinking. When the hell is this movie starting?It was incredibly slow, things didn't make sense, i felt like the overdose scene and the boxer scene didn't add too much to the over arching story.I did like the dialogue though, i felt like that was the strongest part of this movie"}, {"rating": "5", "text": "Another boring movie by Quentin Tarantino. I like the fact that the movie have a portuguese actress but that are so... I don't even know. People talk about Pulp Fiction like that was the biggest thing in the world, I just say NO!"}, {"rating": "6", "text": "I kinda like QT movies but honestly this one is a bit weird. The dialogue is non-sense (too much blah blah for nothing), the acting is mediocre at best and there is no action, no emotion, not a good and interesting story with bad guys etc. It's not funny at all. Ridiculous. It's not a garbage but it's too overrated. I have seen better movies from Tarantino, like Kill Bill (better by far), Inglourious Basterds, Django Unchained, Jackie Brown and Reservoir Dogs. Death Proof was good too. The Hateful Eight was as mediocre as Pulp Fiction, which means....a huge dissapointment! Only the music is great."}, {"rating": "6", "text": "I feel bad for everyone that saw this movie after hearing all the hype and praise. If you don't expect too much, you'll find it very entertaining, even sorta silly. I'm happy to say it gave me a newfound admiration for Bruce Willis."}, {"rating": "4", "text": "the movie had its moments, but there is nothing in it that would glue my attention to the screen. Unnecessary and long dialogs and monologues that lead to nothing ... no intriguing twists. i would praise the performance of actors, but nothing else."}, {"rating": "7", "text": "The title of the movie basically describes itself, while Pulp Fiction is funny and sometimes even smart in certain ways, there's still a lot of gritty and nasty stuff to be dealt with. I would probably watch it 1-2 times again, just to fully comprehend what's going on, but I still don't really see the appeal many others see and I wouldn't go as far as hailing this movie as a masterpiece of our modern time, it's still a good movie though, and a must watch, if you like character-driven movies with lots of strangeness to be seen."}, {"rating": "6", "text": "I dont i understand what this movie want to tell me he is start from the end and evreything not conccted together"}, {"rating": "3", "text": "The most overrated flick i've seen so far. just a random movie with a boring and pointless plot and cheesy dialogue."}, {"rating": "6", "text": "I'm about to say the words that no one dares saying: Pulp Fiction sucks. Look, I can like films with just talking. Once Upon a Time in Hollywood is one of my favorite films, and that's all they do. But at least in that movie, what they were talking about was interesting and funny. Pulp Fiction is neither. It's just people talking with nothing to back it up. Not even the outrageous and shocking scenes don't hit that hard. You don't care about anything, you don't laugh, you don't get excited, you don't feel ANYTHING. At least the plot comes around in an interesting way and there are some memorable moments. But one is for sure. I don't believe this movie is one of the greatest films of all-time."}, {"rating": "1", "text": "A ridiculous show with a more ridiculous screenplay that has become popular only because of the famous actors in the film.‌‌"}, {"rating": "10", "text": "Even years after the release the movie feels fresher than many of the movies made today. Quentin Tarantino  takes a story, twists it and turns, plays with our expectations and leaves us with a masterpiece."}, {"rating": "10", "text": "This is probably one of the greatest movies ever to hit the silver screen (in my opinion that is). Tarantino, you're one hella director, keep it up. If you haven't seen this movie or you're debating on seeing it, well...SEE IT!!!!!!"}, {"rating": "5", "text": "This is a weak movie, not much stories that didn't connect, and I really didn't care. This not my favorites. I'll take Revservoir Dogs anytime."}, {"rating": "5", "text": "Average movie, nothing stand out in particular, Samuel Jackson is crap, so does Travolta and this is the most offensive and racist movie ever, Quetin Tarantino is racist as hell, how could Hollywood would allow a White guy to use the word N***** in this movie?"}, {"rating": "10", "text": "If your idea of a good movie is filled with slow motion or flashy action sequences, love scenes, and a clear cut happy ending, don't watch this movie. But if you want something gritty, real and entirely different than most the movies out there, you just might need to see this one."}, {"rating": "10", "text": "Definitely belongs to the 10 best movies of all times !!! The story and the dialogues are just awesome and it's really sad to see that it only received the script-oscar. What about this ridiculous Forrest Gump is worth these many trophies !"}, {"rating": "10", "text": "Everyone is entitled to his or her own opinion, of course. But I don't think that any serious viewer -- or at least any viewer with an opinion worth considering -- will grant Pulp Fiction its rightful place in the canon. That doesn't mean the film is perfect or that reasonable viewers can't differ on its relative strengths and weaknesses. Those who find the dialogue too steeped in post-modern hipsterism, however, can still marvel at a non-linear storyline that may best \"Citizen Kane\" in its elegance and ingenuity. Those who find some of the plot twists (think Gimp, baby) too contrived can still appreciate performances -- and character interactions -- whose artistry will stun audiences for many, many generations to come. In other words....hell, that guy below is right: If you don't find something -- or lots of things -- to love about this movie, see a doctor. It's time to get that stick removed."}, {"rating": "10", "text": "One of my favorite movies ever, and classic Tarantino. Noone can shoot these disjointed action dramas with such finesse and creativity. He won't be able to top this one, but he has had great movies before and after it."}, {"rating": "10", "text": "Might be the best film of the 1990's. Tarantino established himself as one of the most stylish and individual directors alive with this masterpiece of pop cinema, which combines several stories involving a vivid array of characters who could only be seen in a comic book. The dialogue is fantastic (one of the best and most entertaining screenplays ever), the performances are fantastic, and the soundtrack rocks throughout the entire movie. This is one of the key films in American cinema, and should be watched and loved by anyone who calls themselves a fan of the movies."}, {"rating": "9", "text": "I seriously don't know what to say about this film. It was mind blowing. It was very well written. I loved the dialogue especially the beginning scene in the dinner with Tim Roth. The best part of the film has to be the directing. With Quentin Tarantino there's no way that it's sucks. The stories of different people connecting simultaneously has been bone before but not as good as this masterpiece. John Travolta dying at the middle of the film and walking out of the dinner at the end was very well planed out. This film doesn't even fallow the same time period. Don't forget about the violence. It was very violent and bloody. This film deserved to win best picture at Oscars over Forrest Gump. I don't have much else to say so what are you still doing here. If you haven't seen the movie go see it and if you have seen it go see it again."}, {"rating": "10", "text": "The greatest film ever made. Dialogue in the film is perfect, brilliantly written by Tarantino.A superb performance from John Travolta and Samuel L. Jackson."}, {"rating": "0", "text": "This movie is absolutely dog actually trash movie written by a bunch of idiotic monkeys how could anybody watch this horrible film and live to tell the tale im pretty sure this picture gave me stage five suicidal thoughts i literally want to die after viewing this film do not watch it. terrible writing, bad screenplay. and even worse character development. another dumpster fire by quentin another horrible production in the books"}, {"rating": "10", "text": "Yo The Godfather: I'm really happy for you... Imma let you finish, but Pulp Fiction is the best movie of ALL TIME... of ALL TIME!!!  but really I have yet to see better movie"}, {"rating": "9", "text": "Pulp Fiction may be Tarantino's best film ever. From the opening scene to the very end, there is not a single dull moment. There is always someone getting shot at , someone doing drugs or someone getting cussed at the best possible way.The starring actors do an excellent job, Which is't a surprise. The script is typical in Tarantino's style.Something to note is that the acts aren't in chronological order, but will still make sense"}, {"rating": "9", "text": "That's how an awesome motion picture should be like. Fantastic screenplay, terrific actors to the point of the tiniest roles (Steve Buscemi as a waiter or Christopher Walken as an ex-soldier) and a marvelous kind of story-telling. Tarantino at his best, I would've given it 10 points, if there weren't the lame Bruce Willis part. It's not bad, but it's improper in my opinion. Still a must-see and one of the best movies ever made!"}, {"rating": "10", "text": "24 years later and not a single movie since has ever topped this masterpiece!"}, {"rating": "4", "text": "Overrated to the point of ridicule. Pulp Fiction, what is supposed to be one of the greatest films ever, was a cluster of bizarre scenes that were patched up like a rag doll."}, {"rating": "10", "text": "An unbelievably acted directed and written film. The film is engaging and very funny.  The film is very engaging and is never dull. All the scenes in the film are superbly crafted and there is not one thing wrong I can say about this film. A true masterpiece and one of the best films of all time. To bad the rest of tarantinos films I have not enjoyed although I have not seen Kill Bill 2 and resevoir dogs."}, {"rating": "9", "text": "Not a huge fan of all of Tarantino's films but this one is great. Great music.. great cast... great dialog!!!!!!Must see - *highlights* Samuel J, Travolta, Steve B... great performances"}, {"rating": "10", "text": "One of my faves."}, {"rating": "10", "text": "Quentin Tarantino has created a masterpiece in the film industry. Intense action, legendary lines, and memorable characters. It's one of the best movies ever made. The entire cast is absoloutely entertaining to watch, and Tarantino's style of telling events out of order is intelligent. The film is epic as any movie can get. It is an intense, sexy, addictive crime/comedy/drama that warps into overdrive and thrown into the hands of one of hollywood's greatest directors and producers that puts crime into something so addictive, nobody can resist. It's like watching a sex scene on steroids while drunk. Fantastic and ultimate perfection!"}], "recommendations": ["reservoir_dogs", "the_big_lebowski", "morbius", "scarface", "twelve_monkeys", "black_panther_wakanda_forever", "aquaman", "inherent_vice", "inglourious_basterds", "v_for_vendetta", "dredd", "the_suicide_squad", "the_a_team", "thor_love_and_thunder", "all_eyez_on_me", "the_departed", "the_three_musketeers", "moon", "hercules", "edge_of_tomorrow", "king_arthur_legend_of_the_sword", "serenity", "gran_torino", "ben_hur", "hancock"]}