{"id": 3816, "title": "Punisher: War Zone", "starring": ["Ray Stevenson", "Dominic West"], "runtime": 102, "genre": ["Action", "Crime"], "description": "Waging his one-man war on the world of organized crime, ruthless vigilante-hero Frank Castle sets his sights on overeager mob boss Billy Russoti. After Russoti is left horribly disfigured by Castle, he sets out for vengeance under his new alias: Jigsaw. With the \"Punisher Task Force\" hot on his trail and the FBI unable to take Jigsaw in, Frank must stand up to the formidable army that Jigsaw has recruited before more of his evil deeds go unpunished.", "releaseYear": "2008", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/oOvKJgYUIpfswGHAdW6159bPbvM.jpg", "categories": {"plot": 6.483870967741935, "acting": 7.033333333333333, "ending": 5.5, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 6.5, "action": 6.769230769230769}, "reviews": [{"rating": "5", "text": "Ray Stevenson and a few ridiculously funny scenes can't completely save this rather dull and forgettable movie. Although some poeple were not fond of the previous film, I found some interesting aspects that kept my interest. This is just cinematic chewing gum, quite enjoyable while its on but has no lasting impressions what-so-ever. I can only recommend this to die hard Punisher fans."}, {"rating": "5", "text": "First, off...its better than the first attempt...but not by much. The first Punisher film (IMO) was horribly miscast and was totally lacking in substance and character...this version of the Punisher stays true to the brutality and \"no nonsense\" of the Punisher character himself...but its thrown in with some of the most over the top, gratuitous \"action\" ive ever seen in a movie...it will probably tickle your funny-bone more than it will raise your pulse. One thing they nailed was the casting of the Punisher...Ray Stevenson walks the walk and talks the talk...and has the \"look\" down to a T and unlike the first film, this movie has a Punisher that truly has NO problems dispatching the guilty without remorse (as the Punisher character should)...but the weak story tarnishes this. There is a story...its just not in the least bit interesting, which is fine, because i dont think this film was going for anything \"thought worthy\"...but more \"balls to the wall\". Dominic West plays a decent enough villain...and he plays the character well, seemingly having a good time being a slimy, tough talking mob boss...obsessed with his looks (his accent during some of the dialog gave me a HUGE chuckle). If you are looking for something action packed, story-less, and hammy then this will be your \"cotton candy\" for an evening...cant recommend as a buy however. Overall...its worth a look...if anything, just to watch something loud and dumb which is nice from time to time...but to also see a potentially cool Punisher character...and afterwards, you can wonder what wouldve have happened had they gotten it right...oh well. Recommened as a RENTAL"}, {"rating": "8", "text": "Die beste Marvel-Umsetzung die es gibt. Brutale Action und coole Schauspieler.\rKlar auf den Moral-Quatscht hätte man verzichten können aber das holt die Action locker wieder raus.\rIch für meinen Teil habe immer wieder sehr viel spaß mit dem Film-"}, {"rating": "7", "text": "Most faithful adaptation of the Punisher we ever had in a movie. Stevenson delivers as Frank Castle, the action is pretty great, just the right amount of gore, the plot is okay, the cinematography too. The rest of the characters are a bit cartoonish and two-dimensional..."}, {"rating": "10", "text": "As far as super hero / anti-hero movies goes this is much better than the Thomas Jane and John Travolta affair.  and someone who actually reads the comics, knows that Punisher: War Zone comics are more over the top violent than the original Punisher series. Coming in second to the Punisher Maxx series... I like Ray Stevenson as Frank Castle, he did well. Action gore at it's finest. While some dialogue is incredibly cliched, it's to be at least somewhat expected because it's a comic book adapted to a movie.  very fun turn your brain off revenge movie."}, {"rating": "10", "text": "Hats off to Lexi A! SPOILERS; A blend of Garth Ennis' MAX and the classic punisher to boot. hilariously bad gangster accents with tons of blood and Micro; who doesn't get a proper send off but does manage to be less annoying than you'd expect. Ray Stevenson makes a good Castigleone but seems to be cracking up too much, a decent film really."}, {"rating": "8", "text": "Fantastic action, found myself laughing from the over the top spoof like comic but still a great action flick from start to end.\r Watch it online for free: https://www.primewire.ag/watch-24-Punisher-War-Zone-online-free"}, {"rating": "8", "text": "Over the top? Yes. Ridiculous? Yes. A showing of the REAL punisher in action? YES!\r Here's the thing. The first punisher sucked okay kids. It wasn't anything like the comic book character. In that movie he goes around like a assassin messing with the minds of his enemies and taking them out from the inside. This isn't James Bond dudes.... It's the punisher. The punisher just shows up and guns you down. That's who he is in the comics and this movie gets it right.\r Here's the thing that's annoying and stupid though. Punisher 1 is liked even though it's not like the comics. Punisher 2 aka warzone is hated for following the comics...\r Dead pool in wolverine didn't follow the comics and everyone hated it. Deadpool in his own movie followed the comics and everyone loves it.\r WHAT????\r This is proof that most people are dumb.\r Anyways the movie isn't perfect but it does a good job with the character. Also Dominic West is a great villain in the movie. He's similar to the joker in comedy."}, {"rating": "5", "text": "Warzone wasn't terrible nor was it great, however it was better then the other 2 movies. If you enjoy over the top action and gore, you'll love this movie. If you prefer a story drivin movie, you're outta luck. I prefer a good story movie, but I liked the action and gunfire sequences. So I gave it an average 5, but any fan of hardcore action and/or gore will find something to like in Warzone."}, {"rating": "3", "text": "There's so much potential with a superhero film like this - a tormented, religious vigilante cleaning up city streets by any means necessary, no spandex, no mercy. This potential is largely wasted with Punisher: War Zone thanks to a woefully underwhelming script, a pedestrian and cliched plot and a general lack of passion. Ray Stevenson can do so much better than this (the excellent TV series Rome for instance) but is limited to glowering and reducing goons to pulp. Even if he's brutally killing evil thugs, Frank Castle needs to be somewhat relatable to be a compelling protagonist, and it takes more than pulling a sad face whenever the film flashes back to the tragic deaths of his family. The rest of the cast are a mix of the good and the bad. Dominic West's performance as scarred mob boss Jigsaw is hammy, and often comes across as a really bad Robert De Niro impression, and Colin Salmon plays the same character he plays in every film, another cool authority figure. At least Wayne Knight's backstreet armourer and Dash Mihok's sympathetic bumbling cop provide the film with some much-needed comic relief, and Stephanie Janusauskas acts everyone else off the screen as a little girl who is brought into Frank Castle's life because of a tragic accident. The film does have a pleasingly over-the-top and bloody final set piece where The Punisher shoots, explodes and stabs his way through a hotel full of heavily-armed gangsters and mercenaries. It really takes something for a film to attempt to be this dark and broody, and to come across as camp, but this film somehow manages it at an alarmingly frequent rate, and the big over-arching theme of the film, the failures of the American Justice system has been handled much better in nearly every other film that has tried to tackle it, even Law Abiding citizen, which wasn't a good movie. Punisher: War Zone is a missed opportunity in short. It's not awful thanks to a few laughs, a few thrills, and young Stephanie Janusauskas, but it's pretty bad."}, {"rating": "10", "text": "This is my favorite of the 3 Punisher movies although I thoroughly enjoyed the one starring Dolph Lundgren.  This one is gritty, **** in your face death and destruction with no apologies.  The action is sweet, the weapons are bad-ass, and Ray Stevenson's Frank Castle are spot on."}, {"rating": "7", "text": "Where the 2004 'Punisher' movie was more focused on a revenge-fueled story rather than blood-fueled carnage, 'Punisher: War Zone' flips the table completely. While there is a story to be found in here, this sequel undoubtedly works more as an action film than it's predecessor. I didn't find it as good as the first film, but I did enjoy it nonetheless. The action and violence may turn some off, but I was enjoying myself as The Punisher was blowing people to bits and destroying faces with the might of his fist."}, {"rating": "2", "text": "It went from the solid previous film that had good drama and interest to a pointless action packed film that was far too unrealistic. While Ray Stevenson is a good lead and a good choice for the punisher, The rest of the cast sucked."}, {"rating": "3", "text": "For a film that is claiming to represent a 'war zone', its scenes are far too stilted, calculated, and formulaic. Stevenson unengagingly mopes around depressed for the time he isn't killing people, which makes for incredibly boring dialogue. Though, when the story is this cheesy and cliched it doesn't matter how it is delivered. That being said, the acting (particularly from Dominic West) is so campy that it contradicts the movie's attempt at a gritty noir-esque atmosphere. The one saviour for War Zone is its unapologetic ultraviolence, which is just too silly to be considered disgusting, and keeps the film from becoming too tiresome. Give this a pass unless you are particularly fond of the source material."}, {"rating": "3", "text": "War Zone is like a bomb going off in your TV.  Its a nerve-jangling cacophony of noise and flashing lights and splattering DNA that doesn't bother with anything resembling story.  But strangely, I couldn't help feeling slightly more entertained than I did with the Thomas Jane outing."}, {"rating": "2", "text": "Is it seriously that hard to make a decent Punisher movie? Really? The Marvel Comics anti-hero is pretty much simplicity itself: After watching the gangland murder of his family, Frank Castle goes nuts, dons a T-shirt with a skull on it, and kills every bad guy in sight. Figure out a way to throw in some decent action scenes, temper it with some hand-wringing about the cost of revenge, find the right unsmiling face to play the guy with the guns, add explosions. Bang. There's your movie. And yet Punisher: War Zone is the third attempt to bring the Punisher to the big screen—it follows two different movies called The Punisher, 1989's low-budget Dolph Lundgren effort, and a bigger-deal 2004 movie starring Thomas Jane and John Travolta. Neither of those films made good on the seemingly simple task of translating one of the comic-book world's simplest characters.\r Punisher: War Zone at least trades up in Punishers. Rome's Ray Stevenson has the right mix of imposing bulk and sensitivity to look simultaneously hurt and pissed while blowing the brains out of bad guys. He's joined by another slumming former HBO star, The Wire's Dominic West, who spends most of the film sporting cut-rate deformo makeup as the bad guy.\r Their presence doesn't suggest the class of this movie so much as the difficulty that cable actors have finding decent roles when their shows end; this is junk, a bunch of hard-R action scenes kept together by the thinnest of plots. Which would be fine if it were entertaining junk, but the parade of dimly lit skull explosions grows old quickly, and director Lexi Alexander (Green Street Hooligans) brings neither energy nor gravity to the over-the-top violence, which would feel excessive if the film knew the meaning of the word excess. It's a joyless plunge into gunfire that doesn't even know how to draw blood."}, {"rating": "9", "text": "It's The Punishe! It's supposed to be action packed, gore filled and dripping with bad assery. Much better than the other 2 films, and finally does the character justice. Plus it doesn't waste precious screen time explaing the already explained backsotry. A must see if you're a fan of the character."}, {"rating": "10", "text": "This is one of those movies the critics were completely wrong about. Any fan of Frank Castle who's even looked at a comic book knows that the last two movies were something awful. War Zone takes it in the right direction, and Ray Stevenson does a much better job of portraying Castle than does Jane - heck this movie even has a halfway accurate back story which already puts it over Jane's Punisher any day. The action is intense and gritty, just like you'd be reading one of the comic books. The acting isn't the greatest thing in the world, but anybody who's going to watch this movie and enjoy it isn't there for the acting - or even the gore - you're watching it to see Frank Castle kick the crap out of some scum, and War Zone finally lets him do it."}, {"rating": "10", "text": "This movie isn't getting enough credit. A comic book movie should be rated on two things, how entertaining was it, and how well did it meet the feel of the comic book. This movie was very entertaining and was just like the comic. As far as comic book movies go this gets a 10/10."}, {"rating": "10", "text": "To the general population this movie would seem shallow and gruesome. Yet for the hardcore fan of comics and the Punisher you will surely be pleased. Not to give away the plot, but imagine a Punisher movie where his family dies accurately? Or he walks and talks and shoots like ex-special forces rather then a super hero. If you suffered through the first two Punisher installments, then this one will make up everything those took away. Highly recommended!"}, {"rating": "2", "text": "Grandmas die. In popular culture, usually from natural causes, but sometimes they get run over by reindeer. During its time, that Christmas novelty song, a Dr. Demento favorite, was considered to be in questionable taste. Babies and old ladies, for the most part, are spared the spectacle of a grisly murder. But earlier this year, all bets were off, when a Nazi soldier shish-kabobed a crying baby in Spike Lee's \"Miracle at St. Anna's\", an aspect of German savagery that Steven Spielberg, and most filmmakers, wouldn't touch. Sure, the right people die in \"Punisher: War Zone\", gangsters and their ilk, as Frank Castle(Ray Stevenson) embodies every gamer who points and shoots at anything that moves. He flatters the gamer by rarely missing, while remaining impervious to the falling bodies. They're points, not people. \"Punisher: War Zone\" is yet another in a long line of movies that resemble video games. And just like a video game, a shooter game such as \"Grand Theft Auto\", for instance, there's going to be collateral damage. In an actual film, the audience, at least, goes through the motions of mourning the innocent victim. Not here, though. Not this new breed of video game-inspired quasi-films. While both video game and movie share the same objective of fighting for justice to prevail, the head of an old woman, bloodied and almost completely eviscerated, supplies the gamer with the cheap thrills he experiences when innocent people catch a bullet. In a film such as \"Punisher: War Zone\", a dead grandma is the gamer's idea of black comedy. It's supposed to be funny."}, {"rating": "10", "text": "Just awesome! It's been a more than accurate adaptation of the comics universe. Highly recommended."}, {"rating": "10", "text": "BEst action film for the second half of 2008. The official \"critics\" are too conservative to feel safe giving this anything but a sour review. THe fans were totally engaged and happy."}, {"rating": "8", "text": "This is the Punisher movie that fans of the comic have been waiting for. The action is rampant, and the gore is over-the-top."}, {"rating": "10", "text": "Okay this movie was just plain fun to watch. I laughed out loud, I stared wide eyed, and smirked out of sheer \"awesomeness.\" Seriously don't listen to the critics on this one. They obviously were expecting something different than plain ball's to the wall action. I mean seriously it's a punisher movie... did they expect profound plot lines and uncanny twists at the end. The acting fit perfectly with the style of the movie. One last thing... Ray Stevenson is the baddest son of a gun I've seen on the screen in ages! He makes Statham look like a school girl. GO SEE THIS MOVIE!"}, {"rating": "8", "text": "This movie was exactly what it is was meant to be: a testosterone-injected non-stop thrill ride. This is not the movie you take your girlfriend to. This is guy's night out movie, chock full of blood, gore, and insane weaponry. As soon as I saw this movie was a Marvel Knights, I knew it was geared towards the right audience. Ray Stevenson is the best Punisher yet, regardless of what anyone else says. He even looks like the comic book character. Go watch this movie - not to see amazing writing or oscar-worthy acting, but for a sadistic and entertaining experience!"}, {"rating": "8", "text": "First off, the critics have been a bit harsh when reviewing this film. I respect Roger Ebert and I generally sift through the reviews here to see what he has to say about most movies that I watch. His is a fair review. As far as film quality, this is no Godfather. Then again it's not supposed to be. War Zone is the Punisher pulled from the adult targeted comics and projected on screen. The gore and violence is over the top, but then again Frank Castle is an over the top vigilante. I loathed the Dolph Lundgren Punisher. There was very little about that film that resembled the Punisher that fans know and love. The Thomas Jane Punisher wasn't as bad as many will argue, but I am sympathetic to the fact that his Punisher was poorly scripted and spent way too much time on a muddled and wrong backstory. As much as Thomas Jane loved the character, he couldn't save that movie from the rightful criticism that they took the worst corny elements from the Max line and used them for the story. However, this time the Punisher has been done right. They took some of the best elements of the comics and brought them to life on screen and it's going to be a pleasing spectacle for all fans of the Punisher comic line. Also of note, they ignored the fact that the last two films existed and thereby relaunched with the proper origin story unlike the Jane film. As a huge Punisher fan, I am glad they finally cast someone who looks the part, plays the part well, and more importantly filmed a script that does justice to the character. I can only hope the film is successful enough to warrant a sequel."}, {"rating": "9", "text": "This movie rocks, idk why its getting such a bad rap. I mean its no batman or anything, but the action is all u could ever want from a punisher movie. The story is nothin special and some of the acting is corny but if your goin to c this movie your going for the gore and killing. I mean people loved the movie '300' and it was for the amazing fights and killling. This movie gave me what i wanted from the horrible hitman and max payne movies. I mean they tried to go serious last time with the punisher and although i liked that movie a lot of people didn't so don't go criticize it for trying to be different and more like the comics."}, {"rating": "0", "text": "Thanks hollywood for ruining what should have been a great movie... again. Will the punisher ever get a good film?"}, {"rating": "10", "text": "If you're an hardcore fan of the punisher like i am(i read punisher comics since am 10 i'm now 28),you surely gonna like this movie Thomas jane was to clean to play franck castle.the real punisher is in this movie!We the real fans understand and like this movie others will not... period!!By far the best of the three movie. Thumbs up!"}, {"rating": "9", "text": "this is the real punisher, vengance and fury...yes"}, {"rating": "10", "text": "If you're a snob that can't enjoy movies, don't see this. If you appreciate enjoyable movies, watch Punisher: War Zone. It's one of those movies the critics were completely wrong about. Rent it at Redbox, it's free on Mondays, and only $1 anyways. If you don't enjoy this movie, I feel sorry for you."}, {"rating": "7", "text": "The Punisher: War Zone was a very good comic book adaption, actually it was much better than I expected, this 2008 reboot of the 2004 The Punisher with Thomas Jane and John Travolta(Which was just as good as this one.) is actually a straight out comic book adaption of a mini series which is the title of this film. Ray Stevenson( who I thought was a better Punisher than Thomas Jane.) stars as the titled character who continues his four year fight against organized crime. And has to confront his greatest foe. Jigsaw, Jigsaw was a underboss named Bill Ruso( they slightly changed it for the movie Rousoti.) who was nearly killed by the Punisher, and now wants his revenge for horribly disfiguring him and will stop at nothing to kill him. The Punisher: War Zone is nothing like the first, the first was much tamer and less violent than this, and that's what separates these tow form one another. The Tones are different and the stories are different, giving you a whole new feel when your watching this film. You don't see the first one , your not thinking of the first one, your watching a whole new movie that is just as good( and maybe even better.) than the first."}, {"rating": "9", "text": "Very good movie better than the Thomas Jane one. Dont understand chad.s as its based on a comic book not a video game. Action and gore a plenty captured the Ennis feel very well."}, {"rating": "10", "text": "Hey look, a movie that actually stays true to the comic books, and everyone hates it. Big surprise. This is how the punisher is supposed to be."}, {"rating": "9", "text": "Those who felt The Punisher with Thomas Jane was too tame and lame compared to the brutal carnage portrayed in the modern Punisher comics will be smiling with glee watching this Punisher. I know I was. Those expecting to see Oscar-caliber acting performances and story lines are complete morons: this movie is all about action and it provides in bloody chunks. Ray Stevenson actually plays a better Punisher than Thomas Jane, which i thought was impossible since Jane did a good job as Frank Castle. The only bad thing(s) are the villains, Jigsaw and Loony Bin Jim, who try their best to ham it up and add an unnecessary element of cartoon silliness to an otherwise gritty story. Punisher fans thirsty for blood will be pleased!"}, {"rating": "0", "text": "God awful piece of garbage! If you like this movie, you have no taste for quality film."}, {"rating": "8", "text": "This is a classic example of mainstream media critics simply not being qualified to review movies that are just a bit out of the mainstream. The same thing happened with Mr. Brooks. If you're a fan of the genre, this version of Punisher was extremely satisfying 5 minutes into the movie. There are a few corny lines and some plot twists that were a bit hard to believe - that's why I gave it an 8, but if you're prepared to suspend disbelief in this regard, and your a fan of these types of movies, I recommend it. The guy who playes Jigsaw overdoes the wise guy attitude."}, {"rating": "5", "text": "It may not be fair for me to rate this film as I missed large chunks of it to sleep. I'm not sure how it manages to be so bloody and boring at the same time. It could be the lack of plot. My favorite part was the suspended from the chandelier gag that was stolen from \"Boondock Saints.\" If you're going to be boring, dumb and gruesome, the least you could do is go about it in an original way."}, {"rating": "10", "text": "As was said earlier, the critics are way off on this one. This was one of the most faithful and entertaining comic movies ever. I had my doubts about Stevenson as Punisher, but he nailed him; in demeanor and in the action sequences. I feel bad about Microchip dying, but that was my only complaint. I hope they make more of em!"}, {"rating": "8", "text": "Just came back from watching the movie and I was definitely pleased. I was a bit worried that I would be let down after reading some of the early reviews, my suspicious about the reviewers not understanding the character were confirmed though. Stevenson is a brilliant Frank Castle, the guy is a tank in this movie, shredding through his opposition just like a on screen manifestation of the character should. The critics complaining about the gore prove them unfit in being tasked with stepping anywhere near the film with a pencil and paper, doling out stars or thumbs. While Im afraid the film will not get the critical recognition it deservers, with the majority of critics not understanding the character, I as a fan of Castle say I'm thoroughly pleased by the work the entire cast and crew have put forth. While I agree that the movie was loyal to the source material and worth my dollars, there was one main area I think should have been retooled. Jigsaw and Jim's accent is over the top, and in the end took away from the character, especially in the case of Jim. At a glance Pros: Unapologetically Punisher Level Brutality Stevenson is a compelling Frank Castle Movie pacing is great Cons: Cliche accents Could have used some more dialogue from Frank Overall: 8/10 Bottom Line: If you are a punisher fan, you're in for a blast."}, {"rating": "9", "text": "yeah, thats right, i gave it a nine out of ten. allow me to explain: I'm a comic book junkie, and the punisher is one of my favorite characters. The punisher was never especially deep, he wasnt even brooding or sad or depressed, or really emotional in any sense. Thomas Jane's punisher attempted to make him more human, tried to add a believable element to Frank Castle. We all know how that went. The punisher is more a force of nature than a man and this movie did not attempt anything other than emphasize that perfectly. The punisher cannot be stopped because quite simply he WONT be stopped. he wont give in and he doesnt fear his own death. one of the best descriptions of this movie was \"a slasher flick with guns\" and the Punisher is the new Jason. never in the film do we see him at a point where he is in anyway struggling against his foes. he rips through them like they were nothing. nuff said. I completely understand that many people will think this movie is awful, however to see a comic book movie done with such a passion for the fan base ( every single character in this film has been plucked from different points in the comic) Its not the perfect film by any means. but as far as a film based on the punisher? hell yeah it is. this movie is everything the punisher is supposed to be, and if you like the punisher, you'll love this movie too."}, {"rating": "8", "text": "There is really not much I can say that has not been said already on this list of audience reviews. I will say that Dominic West chews scenery as the mob king Jigsaw. He brings a love of destroying things, and he is the perfect character to battle the Punisher. The casting of Ray Stevenson is well deserved and should have been done in the 2004 film. Tom Jane is a great actor but the look of the Punisher character is already established and he did not look the part. This film is very true to the comic and is ultra violent. This character is well past the point of redemption and Ray Stevenson brings appropriate weight to his scenes of regret during the movie. A person should see this movie if you have ever felt that the producers and/or directors did not give a comic book movie the \"authentic\" look. A great action film."}, {"rating": "10", "text": "Great movie. For what it is. While Dominic West's portrayal of Jigsaw seemed a bit old school (this movie was filmed pre-the Dark Knight) , Ray Stevenson's Punisher was straight out of the comics.Also, where blood and gore doesn't \"behoove\" certain films it is an essential for a Punisher movie (ask any true believer!), and this film delivers by the bucket load!"}, {"rating": "4", "text": "All action, pizazz, gore and special effects and no substance. The plot, if you can call it that is weak, the acting is fair. I does have some great visuals."}, {"rating": "10", "text": "This movie is amazing! If you love the comics or are a fan of violence you will really enjoy this movie. Be warned it is not for the tame. I didn't think I would like this new Punisher as much as I liked Jane, but Stevenson does an amazing job. He is the grizzled war vet that you read about when you look at the Punisher comics. The Punisher is violent and if you think you are going to see an Oscar performance you came to the wrong movie. Again do yourself a favor and buy this movie. It deserves to be acknowledged and a sequel deserves to be made. This is one of the best, if not the best comic movie ever!"}, {"rating": "10", "text": "The critics must be smoking the good stuff because not only was this one of the best marvel movie, it was the BEst ACTION movie of 2008. Not many people saw it in the theaters because there were not many commercials. except for the blood and gore it was a clean movie for kids to see. No nudity or dirty stuff like watchmen."}, {"rating": "3", "text": "I really wanted to like this movie but it was terrible. No plot line, the Punisher looked old as dirt and the acting was bad. Man, I thought this was going to be a good movie but I was disappointed. Aside from a couple of good violent scenes a la chair leg to the eye of the bad guy, you should give this movie a miss."}, {"rating": "1", "text": "Plot? No. Action? Yes. Terrible dialogue? Yes. Are those topics important to you? You decide."}, {"rating": "10", "text": "Absolutely brilliant! A huge congrats to Lexi Alexander. Finally a Punisher movie with some balls. Perfectly cast, perfect amount of violence, and as a huge Punisher fan, the best movie adaption of the Punisher hands down. Wow, I thought no one would ever get it right. Ray Stevenson is much more menacing on screen than any previous Punisher. Definitely a movie for the fans and not for the critics."}], "recommendations": ["the_punisher", "batman_v_superman_dawn_of_justice", "dredd", "rambo_last_blood", "the_losers", "polar", "the_a_team", "hercules", "venom_let_there_be_carnage", "justice_league", "surrogates", "green_lantern", "terminator_genisys", "spider_man_3", "percy_jackson_sea_of_monsters", "kingsman_the_golden_circle", "deadpool", "morbius", "rambo", "bright", "death_wish", "i_am_number_four", "gamer", "the_twilight_saga_eclipse", "underworld_blood_wars"]}