{
  "id": 1308,
  "title": "Quantum of Solace",
  "starring": [
    "Daniel Craig",
    "Olga Kurylenko"
  ],
  "runtime": 106,
  "genre": [
    "Adventure",
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "Quantum of Solace continues the adventures of James Bond after Casino Royale. Betrayed by Vesper, the woman he loved, 007 fights the urge to make his latest mission personal. Pursuing his determination to uncover the truth, Bond and M interrogate Mr. White, who reveals that the organization that blackmailed Vesper is far more complex and dangerous than anyone had imagined.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/e3DXXLJHGqMx9yYpXsql1XNljmM.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 6.15,
    "ending": 6.571428571428571,
    "soundtrack": 5.0,
    "cinematography": 4.333333333333333,
    "familyFriendly": 6.0,
    "funny": 9.333333333333334,
    "action": 6.0625
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The plot is just slightly too complex to follow, the Bond-girls aren't quite as stunning, and the writing is not quite as polished as its predecessor. \"Quantum\"'s primary problem is that it had to follow \"Casino Royale\". A moderately-fun action movie, an adequate addition to the Bond franchise, but a below-average sequel. Regardless, it's still worth a look. Maybe even two or three."
    },
    {
      "rating": "7",
      "text": "Not up there with Casino Royale but a great follow up to it. The acting was still great but the movie rushed through its self a little bit. Daniel Craig still does a good job and makes me forget about that Pierce guy. Overall a very good movie."
    },
    {
      "rating": "7",
      "text": "i found this an enjoyable movie however what has let it down is too much action. The acting was good as you would expect from a james bond movie and so was the storyline. it was just too fast paced there was not much talk involved it needed to take sometime to slow down every so often"
    },
    {
      "rating": "8",
      "text": "I don't understand critics not being on board with this film.  I greatly enjoyed it, not quite the level of awesome that Casino Royale achieved, but still a strong action film with a plot that builds upon its predecessor.  Worth seeing if you ask me."
    },
    {
      "rating": "7",
      "text": "Quantum of Solace turns back the clock on Casino Royale's unconventional structure to bring about a more traditional Bond adventure. Craig still makes for an excellent 007, investing the role with emotional gravitas. The action scenes are more fantastical than it's predecessor and as such have that tangible James Bond feel to them. Quantum of Solace is a good movie, even though it makes me cry to see a DB7 banged up so roughly."
    },
    {
      "rating": "9",
      "text": "I find the negative reviews of this film laughable: 1. I DOES NOT UNDRSTAND DER PLOT... why? because the film does not pause to explain everything like so many modern films do? Everyone I watched this film with understood the plot without many questions. 2. WATER? WATER?... being completely unaware of how valuable water is makes a poor excuse for disliking a film. Having no understanding of current events and problems is just sad. 3. SO MUCH AKTON IS NOT BOND... yes, it is. This film does action sequences better than the slow and clumsy Bond films of yesteryear and that is a good thing. 4. I LIKE BROSNAN BETTERER... yes, those were great movies. No one should question that."
    },
    {
      "rating": "9",
      "text": "An underrated gem of a Bond film. No, its not your usual epic, lavish Bond adventure. It is instead a very taut action thriller in the vein of films like Taken and euro-thrillers. I have no doubt that in years to come it will become more highly regarded as other \"different\" Bond films like On Her Majestys Secret Service and Licence To Kill have."
    },
    {
      "rating": "8",
      "text": "Stuck on this film, the story editing is great and fast moving for all the right reasons, but some action scenes (such as the opening) makes no logical sense,  Yes it's thrilling (In large thanx to the sound effects) but It is dizzying instead of entertaining. The film is well made but the half a second editing still enhances the film at certain times (planes chase sequence, hotel room fight) and hurts at others. The film is well written for the genre and actually improves certain aspects of Casino Royale, but the overproduced editing hurts it from being better than Casino Royale."
    },
    {
      "rating": "10",
      "text": "I'll tell you straight! The film Quantum of Solace is not for everyone. Those who watched movies as a child because of the steep Bond shootouts, chases, fights will be very upset because of their absence. And those who watched them because the story will be completely satisfied. You can also recommend this film to those who did not sign with the Bond. They will appear in this film a masterpiece. I belong to the latter. So I put it the highest rating."
    },
    {
      "rating": "7",
      "text": "Muy aceptable. Acción a raudales desde el primer minuto. Continuidad con la anterior entrega de Daniel Craig. Globalización a tope, enseñándonos como la economía y el poder pasan por encima de los mandatarios. Lealtad. En contra algunas escenas con demasiado movimiento que necesitan un esfuerzo de concentración, así como el deseo de venganza y demasiadas muertes. Es cierto que después de la venganza se nos muestra que esta deja igualmente un vacío.\rFabulosa la interpretación tanto de Daniel Craig como de Judi Dench."
    },
    {
      "rating": "7",
      "text": "Like a solid second act. Ends up being only a follow up to the original instead of its own movie. A step down from Casino Royale, but I'm still looking forward to future installments."
    },
    {
      "rating": "9",
      "text": "I'm going to go against the grain here and say that I really, really like this movie.  I am not a fan of old Bond - I loved Casino Royale, and think that this film really stands up as a sequel to it.  I liked that it had one, clear plot, and tied in well with Casino.  At the end of that film, Bond realizes he has been betrayed by the only woman that he ever let himself love - he responds by shutting his feelings off entirely, and beginning a mad quest for revenge.  The action scenes are smart and quick, and Olga Kurylenko as Camila is extremely beautiful, but also very interesting with a subplot of her own.  There are so many small character building moments in this film, and the villain leads us to believe that there is a sinister Bilderberg type group pulling the strings for all of these coups in major countries.  Nice to see Felix back again, and the political intrigue parts of the film were sharp.  M's maternal relationship with Bond is subtly expanded upon.  The Opera scene is flipping brilliant.  Overall, I think that this is one of my favorite action movies of all time, and honestly it's super underrated."
    },
    {
      "rating": "8",
      "text": "This is a very good action movie. The story is good, The cast is good, just everything is good. I give this movie an 8 because I expected more as casino royal."
    },
    {
      "rating": "7",
      "text": "\"Quantum of Solace\" might be the least best in the Daniel Craig series, but that doesn't mean it's bad. It's just a bit short of these awesome movies."
    },
    {
      "rating": "10",
      "text": "I watched this movie with skepticism but was truly surprised and happy with the end result.  The action sequences are sublime and the story is more than entertaining.  Bond is well represented and well played.  I may be a minority for loving this film but I feel it has everything that makes the Bond character amazing.  Love the movie from start to finish!"
    },
    {
      "rating": "10",
      "text": "Saw this again today 2020, loved it. The films actions scenes are insane from minute one till end, Daniel did such a great job in all action scenes. I love hi. As Bond!! No holes in the plot. The politics of the plot kept you interested. Daniel .C does not disappoint. Super entertaining and wonderful shots of Italy. Must watch."
    },
    {
      "rating": "7",
      "text": "(73/100)It had less quality than Casino Royale but still an OK movie in it's own right. Quantum of Solace also seems to be finishing old and setting up new story plots instead of focusing on the story that's going on in the movie itself. Action scenes were also incomprehensible, too many cuts and too much shaky cam."
    },
    {
      "rating": "2",
      "text": "Stereotypical action movie-200 hundred guys with machine guns shooting at the main character and nobody can hit him! Even worse, there are way too many characters without introductions that confuse you all movie."
    },
    {
      "rating": "3",
      "text": "Worst Bond film ever based on many facts: no character development, no depth to the plot, very plain action sequences (with many borrowed from previous films) and way too many loose ends. It seems like all the good scenes were edited out to leave this skeleton with no meat for a story. Wait for video."
    },
    {
      "rating": "2",
      "text": "Extremely poor plot and very far fetched, even for a bond flick. The director expects us to believe bond miraculously survives multiple certain death situations with giving even a hint as to how. I had hopes that the bond franchise had wisened up given a more human nature of casino royale, but they have gone terribly of the rails this time around."
    },
    {
      "rating": "6",
      "text": "With absolutely no explanation of what is going on from scene to scene, what could potentially be a very interesting storyline becomes a mess of over-dramatic action scenes. James Bond just happens to find himself in exotic places on boats, planes and fast cars but with no explanation... Also, for the first time, I get the feeling that this James Bond is as bad as the other villains! James Bond is supposed to be the hero, not the revenge-seeking murderous d*ck. Action scenes are fun to watch and they happen in a good variety of locations around the world - this is all that saves this film."
    },
    {
      "rating": "2",
      "text": "Piss poor."
    },
    {
      "rating": "0",
      "text": "Village Voice has it right - this was edited in a blender set on indecipherable. Utter garbage. Give me Brosnan or any other Bond for that matter. The director should never be allowed to work again."
    },
    {
      "rating": "7",
      "text": "Production wise, I couldn"
    },
    {
      "rating": "9",
      "text": "When Casino Royale arrived two years ago I was a very happy person. I was one of what feels like the few people that actually wanted Craig to do well as Bond. I wasn't moaning about him being blonde, I wasn't moaning about the lack of gadgets, I was just happy to see one of my favourite fictional characters back on screen. As many people know I am a huge Bond fan, I have all the movies, I love them all in their unique way, and even if Casino Royale had been a disaster I would have found some enjoyment out of it. Thankfully it wasn't a disaster, it was actually one of the best Bond movies made. Quantum of Solace is a direct sequel of Royale, and so I once again had high expectations of it. Perhaps even more so than with Royale, as now I knew Craig is a superb Bond, and I wanted the story to evolve more. Let me start off by saying Solace is not as good as Royale, and for many people that will be a problem, as so many people were expecting an even better movie. While it is an extremely good movie, and a brilliant Bond movie, its just not one of the best and does have a few problems. Still as a Bond fan I still absolutely loved nearly every minute of the movie. It isn't overlong and outstays its welcome like Royale, but neither is it rushed as I feared. The performances are incredibly strong once again and there are some thrilling action sequences thrown in as well.Daniel Craig once again is very strong as Bond, and unlike what a lot of critics have said, is actually good fun. He can deliver a pun quite well, and he also does the dramatic and seriousness of Bond to perfection. In short he is definitely up there in terms of quality with Sean Connery. He feels a bit more comfortable as Bond this time around, he doesn't have to say the famous line which sadly felt a tad forced at the end of Royale. Instead he does get his fair share of brooding, although his verbal sparring with Gemma Arterton is pretty brilliant. The lead Bond girl this time is played by Olga Kurylenko, who I last saw in the dismal Hit-man movie. Thankfully here she plays a very interesting, although different Bond girl. She doesn't appear much for the first half, and her first sequence seemed more random than interesting. However she does develop quite nicely and by the end she is definitely one of the better Bond girls. Lead villain duties go to Mathieu Amalric. I have to say he was a bit of a disappointment after the brilliant Lechiffre in Royale. Amalric is a slimy villain, and he does put in a good performance, but his villain just isn't all that menacing, and I can see him being one of the easily forgettable Bond baddies. Judi Dench gets an awful lot more screen time this time round, and its all the better for it. M has been rewritten as a superb character, and gets some nice bit of swearing to do. Finally Gemma Arterton is fairly decent as a wasted Bond girl. She has way too little screen time, and far too little to do, however she does shine through, and features in one of the more memorable moments of the movie.Quantum of Solace story wise is perhaps where the problems begin to slip in. Royale's story was simple and very easy to follow, while Quantum is nowhere near as confusing as people are making it out to be, the movie is a bit overcomplicated for its own good. The villains plan is nowhere near as diabolical as it really could be, and I feel I need to watch the movie again just to get the intricate details of the movie. However as most Bond fans know story is not always a Bond movies strong point, just look at Live and Let Die, Die Another Day. So long as it manages to entertain I am quite happy. Solace thankfully is a brilliantly entertaining movie for the majority. I will admit, the pre-credit sequence is a very big disappointment. I know the stunts were good, and it should have been thrilling, but I felt so oddly bored by it. However once the credits sequence began, to a song I am steadily coming to like, the movie kicked off. The rest of the action sequences were particularly well done, my personal favourite being a bit in an opera house, extremely well edited. Drama wise the movie is very solid, there are some lighter moments to keep people happy, and some amusing one liners, but the movie for the most part is pretty down to earth.Quantum of Solace as I've said is a great movie, and no doubt many people will love it, although some will be a bit disappointed by it. Either way Craig is still a great Bond, and I cannot wait to see more adventures with him as the lead. Although we could do with a more interesting villain next time round please."
    },
    {
      "rating": "8",
      "text": "Daniel Craig is good in this film once again. The action sequences are good and film in general is good as well but not as great as the previous fim. I still enjoyed it though."
    },
    {
      "rating": "10",
      "text": "I am a huge Bond fan. I have read the Flemming novels and I have seen all movies. Quantum of Solace is my favourite Bond movie by a mile.It has everything that you could want from a bond film. Awesome action, excellent acting, hot Bond girls, a realistic plot and a realistic villain with a genius plan. The car chase and fight scene are better shot and easier to follow than anything in the Bourne films. They're hard hitting and thrilling to watch.It pays homage to most of the great early movies like Goldfinger and The Spy Who Loved Me.Sean Connery played Bond just like the character in the Flemming novels but Daniel Craig is by far the best actor to ever portray Bond. He looks classy and he kicks ass when he needs to. Highly recommended."
    },
    {
      "rating": "5",
      "text": "The most action-oriented Bond movie that I can remember seeing. I don't have a problem with that, but I do have a problem with the way the scenes were done. I literally can't watch the action scenes in the movie. I get so frustrated by following whats going on through the cut-scene-orama that it makes me angry. Did anyone who made this movie actually watch it when they were done? That was a rhetorical question because the answer is obvious. No. My advice - dont drink 26 cups of coffee before you edit the next Bond movie. Thanks."
    },
    {
      "rating": "7",
      "text": "Tooooo short and not enough lighter/comedic moments.  All bond does is go around shooting people and then doesn't even kill the one guy at the end.  The action was good besides the shaky camera which I personally don't like.  Not really a good bond movie but a decent action movie."
    },
    {
      "rating": "7",
      "text": "Daniel Craig's second outing as 007.BIG set pieces, lots of carnage (Bond seems to wreck every location he goes to), fast, furious & slightly silly.Bit of a mess this one & doesn't really hold together as the brilliant Casino Royale did.Craig is fine & basically an emotionless maniac which, considering his profession, is what he'd be.Nice perfomances also by Olga Kurylenko (Blimey Charlie!!) & the great but under-used Giancarlo Giannini.The bad guys aren't as a prominent as other films but it's still a damn sight better than any of the awful Pierce Brosnan films."
    },
    {
      "rating": "8",
      "text": "It may not be edited perfectly or nearly three-quarters as well-crafted as its predecessor, but \"Quantum Of Solace\" still stands tall as a thrillingly engrossing Bond film."
    },
    {
      "rating": "0",
      "text": "The worst Bond film of all time. I thought nothing could be worse than Die Another Day. This manages it with some aplomb. The direction is horrible - all split second jump cuts designed to create excitement and stimulate action. It does nothing of the sort, only creating a sense of nausea. The story is boring and flat. Give me back the megalomaniac who wants world control and save me from these weary eco-stories. This has NOTHING in common with any Bond film. No sexiness, no gadgets, no exciting villain, no villain's lair, no henchman, no decent theme, no John Barry music, no intro, no nothing. The worst Bond film or all time, maybe one of the worst films of the year."
    },
    {
      "rating": "0",
      "text": "Okay, after the horrid \"Casino Royale,\" I thought that this was going to be a lot cleaner. It wasn't. The clasic \"Gun barrel\" opening was tossed away to the end of the film and done with horrorfying results. Bond is no longer an Agent he is a midless killing machine. Oh and if this is still part of 007's first mission EVER WHY THE *@!$ IS IT IN MODERN TIMES?! After \"Die Another Day\" we no longer get to see what Bond's next adventure is the re did the whole thing with crappy decisions! No story, tons of action that is poorly developed and RIPS off of Classic bond films! \"Goldfinger\" is in here but rip offed of it as well as \"GoldenEye,\" \"Thunderball,\" and \"Live and Let Die\" It has the Bond movie title and logo but it is NOT a Bond film, complete garbage."
    },
    {
      "rating": "1",
      "text": "What a dismal Bond movie. It had none of the character development or plot of the last one. Purely two-dimensional. On top of that, the actions scenes are shot in the increasingly popular super-close style that makes it so you can't tell what's actually going on. I frequently couldn't determine which black car or black suit was chasing the other. Overall, profoundly disappointing."
    },
    {
      "rating": "3",
      "text": "Just another Action Movie, not Bond anymore."
    },
    {
      "rating": "7",
      "text": "This movie had a lot of action. Aside that I had no clue what the story was. I never liked this actor as James Bond either. It was not worth sitting through but the action was packed."
    },
    {
      "rating": "2",
      "text": "Unfortunately this film couldn't be saved by the awesomeness of Daniel Craig in the role of Bond. It just couldn't overcome the poor, messy script or the shaky 'what the hell is actually happening' camerawork. Worst of all though was the useless bad guy. He just never felt sinister enough for a Bond villain. Absolute shite unfortunately. Here's hoping that the next Bond is closer to the standard set by Casino Royale."
    },
    {
      "rating": "3",
      "text": "I've literally just returned from watching this Bond movie, and while walking out of the theater, my dad commented on what he considered to be the lame plot. Listen- no one should go to a Bond movie expecting a coherent plotline; in fact, they've never had coherent plotlines. Honestly, Daniel Craig is the best Bond since Connery and I don't think anyone can seriously dispute that. The girls in QOS are perfectly acceptable and the locales are exotic, as should be expected. The major flaw with this film is the quick-cut method and hand-held camera work used by the director during action sequences. Stuntmen were injured while making this Bond film, Craig lost part of his finger during an action sequence, but damned if you can tell what's going on at any point while the action takes place. As Bond films are all about the action sequences, the quick-editing and shaky hand-held camerawork destroys a good portion of the film as a whole."
    },
    {
      "rating": "4",
      "text": "Plot, editing, and acting aside, I'm surprised no one seems to be complaining about the rapid-fire attempted rapes near the end. I'm not a huge Bond fan, but part of the fun of these movies is the cartoonishness. Moon-based lasers? Fun. Slightly disturbing brutality? Not so much."
    },
    {
      "rating": "8",
      "text": "Bond is back again...and Craig is on his second film playing everyone's favorite spy. Quantum picks up alsmot immediately after the events of the Casino Royale...so there is little time to get ready for this film, because it starts out \"balls to the wall\" and rarely lets up till the big explosive finale. In comparison to the first (Casino Royale), Quantum of Solace lacks a bit...whether it be the story the directorial style...nothing about this film seems as elegant or as well put together as its predecessor...it definately amps up the action a few notches however. The action scenes better choreographed and far more explosive...so it certainly excedes Casino in that regard. It's really the story and lack of substance that make this film a bit ho-hum at times...its just not interesting to follow, something about a greedy enviromentalist on the hunt for oil and he isn't afraid to lie and kill to get what he wants and then this even less important story about a girl trying to get revenge on a general for brutally killing her family (yawn)...but you really won't care about any of that, it almost seems like filler until you get to the real meat of what this movie is about...ACTION and lots of it, as its easy to see where most of the care went. Casino Royale is a far more polished Bond film...Quantum is certainly watchable and its actually quite entertaining as a hollow action film, it dosent seem to really expand on the Bond character other than we know he is even MORE upset and far more lethal in his methods now than before. it comes HIGHLY RECOMMENDED...if you are looking for action, this is it, if you are looking for story....i strongy recommend you watch Casino Royale to catch up."
    },
    {
      "rating": "1",
      "text": "Never before has there been such abuse of the name bond. All those years theve spent building a franchise only to have this aboination to come along. The story was week and confussing, the fighting was good but covereing a girl in oil??? Come up with an orginal idea rather than stealing from other bond films. Everyone envovled is a turd. End of."
    },
    {
      "rating": "0",
      "text": "A horrible film consisting of no plot, no story, no acting and no sense. James Bond is not a action hero, get that straight Hollywood, and next time actually try to make a new Bond film a good one and a memorable one. \"Quantum of Solace\" is one of the worst of 2008."
    },
    {
      "rating": "3",
      "text": "Very very poor bond movie. Bad story, and honestly quite a boring movie to watch. Makes the awesome Casino Royale look like a classic."
    },
    {
      "rating": "3",
      "text": "Pitiful Bond movie. The last two are a real let down. No super spy gadgets, cars, etc. Just blow 'em away brutality. A raw film that rubbed me raw. In attempting to make super spying into some gritty, hardcore killer flick, the writers have fallen prey to a neverland that would have the 00 spies bouncing off their asylum walls. Way over the top without the fantasy gadgets...too much unreal realism. What can I say to some it up? It was a real downer. Redeeming lines within the thing about forgiveness...that was good."
    },
    {
      "rating": "3",
      "text": "I really did not enjoy this movie at all. I gave it a 3 because, for an action movie it had some cool action sequences. I didn't care for any of the actors in the movie either. I didn't care for the story."
    },
    {
      "rating": "5",
      "text": "Never have I been this critical with any Bond film. The Man with the Golden Gun was pretty bad, but this one was just off the charts. Never have I seen a Bond film suffer from an identity crisis this bad. The film is a mess. The screeplay's a mess, the action scenes are a mess and even the climax is a mess. I don't think James Bond needed to be restarted, I think he needed a good screenplay thrown his way."
    },
    {
      "rating": "5",
      "text": "This movie is a toss-up since License to Kill. A corny and weak plot so unimaginable winds up being concentrated on something else. Also the movie is short despite five good action scenes and there's nothing else special in this one."
    },
    {
      "rating": "5",
      "text": "It really sorted of abandoned all plot in exchange for good action sequences. I did like however that Craig was able to show a more serious side then he did in the previous film, Even though it made his character come off a bit of an emo (but thats because of the poor script, not Craig himself). Also the film was pretty much a knock off of The Bourne Ultimatum. The action sequences reminded me a lot about that film and it made Quantum Of Solace look cheesey.\r Overall the film is a huge step down from the first film, I expected better."
    },
    {
      "rating": "4",
      "text": "What is so sad about Quantum of Solace is the tremendous step down it was from Casino Royale. The only thing that makes this a Bond movie is Bond himself. All the style, action, and fun is sucked out and replaced by painful mediocrity."
    },
    {
      "rating": "4",
      "text": "Yes, it's true what they say. 'Quantum of Solace' is a silly, choppy action movie that felt less like a Bond movie and more like a Bourne movie.\r Daniel Craig still maintains the role magnificently well, doing what he can in a silly action film. Olga Kurylenko makes a good Bond girl and Mathieu Amalric is an okay Bond villain. I don't remember him as much as previous villains, especially Mads Mikkelsen ('Casino Royale'), and then Javier Bardem ('Skyfall') four years later.\r I am not sure whether 'Quantum of Solace' would have been a much better movie if it wasn't a follow up to the great 'Casino Royale' (2006). It felt more like one of those dumb, gimmicky Pierce Brosnan movies after 'Goldeneye' (1995), this movie reminded me of 'Die Another Day' (2002), I was afraid that this current series of Bond movies would fall into that routine of dumb action and gimmicky moments. After starting off so well in 'Casino Royale' (2006), I feared this movie would end Daniel Craig, luckily he survived this one.\r I just hope we never see another dumb action Bond flick ever again."
    }
  ]
}