{"id": 4053, "title": "Race to Witch Mountain", "starring": ["Dwayne Johnson", "AnnaSophia Robb"], "runtime": 98, "genre": ["Adventure", "Family", "Fantasy", "Science Fiction", "Thriller", "Action"], "description": "A taxi driver gets more than he bargained for when he picks up two teen runaways. Not only does the pair possess supernatural powers, but they're also trying desperately to escape people who have made them their targets.", "releaseYear": "2009", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/zoKcwyQk8VyWeMsaf8mgHzzWERZ.jpg", "categories": {"plot": 5.583333333333333, "acting": 5.166666666666667, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.5, "funny": 6.5, "action": 6.1}, "reviews": [{"rating": "9", "text": "Liked it very much. Dwayne Johnson did fairly well in this one. Was liked by entire family."}, {"rating": "6", "text": "This Movie is for the whole family nothing really interesting going in the movie.I enjoyed the movie with my family but the movie has a weak plot.The movie is fun to the whole family but not everyone would love it."}, {"rating": "5", "text": "Relentless, excessive, noisy. 10% normal dialogue, 80% action sequences, and 10% action dialogue. Yes, the director forcefully tries to make even dialogue scenes an action sequence (most notably all military personnel scenes). I.e. Fast paced rock music in the background, unnecessary over-the-top spastic dialogue, cliche acting and intentions, and the convenience of \"God Technology\" where two people can know anything and everything in under 10 seconds (director's notion of story-telling). The two kids and Dwayne Johnson played their roles fine along with other (non-military) supporting cast. Despite the heavy emphasis on action (which I thought was a little annoying) there was still enough here to warrant at least a 5."}, {"rating": "3", "text": "Two stormtroopers get into a cab; two grown men all decked out for a space expo. Apart from setting off my internal Triumph the Comic Insult Dog alarm, this throwaway visual is loaded in semiotic connotations. A certain breed of moviegoer will recognize the historicism inherent in the allocation of the costumed men and cabbie. Armed with prop guns, the underlying subtext of the scene can be construed as \"Star Wars\" coming to snuff out \"Taxi Driver\". In other words, this unremarkable scene is enhanced by a filmic metaphor that explicates on how special-effects driven films consigned the sort of personal filmmaking practiced by directors of Martin Scorsese's ilk to a post-Skywalker grave. When Travis Bickle was tormented with insomnia, he put himself on the night shift; whereas Jack Bruno(Dwayne Johnson), while working the heavy bag(\"Rocky\" thrown into sharp relief from the Scorsese classic), declares that he can't sleep, agrees to the long fare(albeit the next day) proposed by two juvenille humanoids as a means of burning off restless energy. A joyless affair such as \"Race to Witch Mountain\" is just one more progeny from the teat of a certain shark, that heralded the birth of the summer blockbuster, in which an emphasis on spectacle leaves storytelling and character development in the dust. For starters, at some point, shouldn't the taxi driver tell the kids that its \"just Jack\"(not the too formal Jack Bruno), like the Sean Hayes character on \"Will and Grace\". \"Race to Witch Mountain\" spends nary a moment on developing a bond between Jack and the \"kids\"(following \"Starman\" as an example, the human should humanize the alien) that would justify the \"E.T.\"-like tears during their overblown parting. To its credit, however, the film has a self-awareness of its own disposability, a la \"Mystery Men\", when Janeane Garafolo said, \"I would like to dedicate my victory to support...those who seek out independent films,\" has a mainstream film gazed at its own navel and critiqued itself. After Sara(AnnaSophia Robb) tells Jack that humans have the potential to levitate small objects, too; she says, \"You humans haven't learned to use your brains to full capacity.\" True to its word, a film such as \"Race to Witch Mountain\" won't teach humans to use their brains to full capacity, and maybe Sara's observation was a subversive act of honest authorial commentary."}, {"rating": "5", "text": "The movie had good actors, the soon to be Hunger Games villain, Alexander Ludwig and well-known AnnaSophia Robb with Dwayne Johnson and Carla Gugino. Despite the acting talents, the story was boring."}, {"rating": "8", "text": "Story was involving enough. Attractive, likable cast. Plenty of action, in fact, the most intense action and violence I've seen in any Disney film. The only flaw for me was the hand-held-camera style in some of the scenes, although some people seem to like that, On the whole, entertaining."}, {"rating": "8", "text": "Some of these critics need to find a new job cause they don't know a good movie when they see one !"}, {"rating": "5", "text": "Parts of the movie was rather good, but other parts of it was laughable. I mean one of those men have got to get some serious acting training, the kids don't help either. Of course the suspense was good enough for this movie, and it was still likable for some people."}, {"rating": "8", "text": "Fast action from the beginning, which is good for a family film, since children often become bored by too long of a slow moving character setup period. Dwayne Johnson does a great job of being a likeable tough guy for family films."}, {"rating": "8", "text": "Dwayne \"The Rock\" Johnson has that appeal like Will Smith. This is a family movie that everyone will enjoy. Just enough scary things to make it PG. A nice way for a family to spend some quality time together."}, {"rating": "8", "text": "I thought this was a really good movie. Maybe a bit much for smaller children but a good date movie or for tweens. How can you go wrong with The Rock on the screen!?!"}, {"rating": "6", "text": "In spite of many \"Disneyisms\", it's an entertaining movie. Great pace, good special effects and score. Dwayne Johnson is good. Fun, it always held my interest."}, {"rating": "8", "text": "Much better than I expected. Sort of Borne Ultimatum for 10 yo boys. The 10 yo I had sitting next to me loved it. I was not bored, but want to see the original again to compare the times."}, {"rating": "4", "text": "Definitely for kids. I went in knowing it was gonna be stupid, but I was hoping for a little better than this. Escape to Witch Mountain was one of my all-time favorites when I was a kid and it was a stupid movie too, but it had that Disney magic. I hope that this movie has the kind of magic for today's kids that made me love the original so much when I was a kid, but I just didn't feel it and/or maybe I can't tell anymore. I probably should have re-watched the original first. Good luck."}, {"rating": "8", "text": "It's the usual alien government conspiracy story, but with a new sense of humor and charm. Unfortunately, it fails to be original."}, {"rating": "4", "text": "While it surely is entertaining, the film is not very good. It provides for action, and plenty of it. It is mostly good enough action, but nothing one hasn't seen before. The story is somewhat intriguing, but ultimately rather flat and obviously cannot survive on its own without the action sequences. The effects were not quite as good as I hoped, and the acting was rather bad. I have to point out that Dwayne Johnson was atrocious in his attempt to act. The kids were much better, though they were no stars either. I don't know, it was entertaining but it was a typical Disney film that did not provide for anything that would make you even scratch your head and think, let along challenge anything. The villains are hyper-villains, the good guys are good, and The Rock is a good cabbie, who happens to be able to kick ass... ah, when unrealistic things are annoying me in a film about aliens, you know something's wrong. But, I guess it's ultimately worth for the action... or is it?"}, {"rating": "6", "text": "Not nearly as cheesy and bad as I expected. I have to say that Dwayne Johnson is starting to grow on me. For a Disney movie the plot was decent and the acting wasn't as bad as I imagined it would be. I don't have any real complaints so I will just leave it by saying for a family flick there are many movies that are worse than this."}, {"rating": "8", "text": "The rock did good here. The story makes some sense and there is plenty of action throughout. I can't recall any dull moments."}, {"rating": "7", "text": "The film is entertaining, with some good and bad special effects. The plot of the film is very original."}, {"rating": "6", "text": "Race to Witch Mountain is a mildly diverting but forgettable family-friendly flick with no particular good things about it, but no particularly bad ones either."}, {"rating": "5", "text": "Race to Witch Mountain is a bizarre adventure. The action is good but not great and the overall premise is odd. Dwayne Johnson does well and the acting is pretty fair. Nothing bad or great I can really say."}, {"rating": "5", "text": "A regular movie , the plot good , the bad, so boring it is, and the funny Sera that Dwayne Johnson will play babysit some kids from another planet? Who do crazy so he had to do that to Dwayne Johnson ?, That Funny."}, {"rating": "5", "text": "Race to Witch Mountain struggles itself for the ultimate ending which is ruined by the struggle of this movie. Most would love to praise Dwayne Johnson, but I wouldn't."}, {"rating": "6", "text": "Şimdi ki aklımda oturup izlemeyeceğim, ilgimi çekmeyen bir film olarak görüyorum. Konu bakımından heyecan uyandırıcı hiçbir kısmı yok fakat çocukluğumda yine televizyonda denk geldiğim film, o zamanlar hoşuma gitmişti. Şimdi karşılaşınca ortalama bir film olduğunu düşünerek, 6 puanı uygun görüyorum."}, {"rating": "10", "text": "dope movie best ever get nother one ther bra please mobester we ready bra ha"}, {"rating": "6", "text": "Race to Witch Mountain is an enjoyable family movie. The story is too simple and execution was also not that great. The movie started off track but started coming on track as the story proceeded. The performances by all the actors were good and the characters are likeable. Overall, this movie is a good enjoyment."}], "recommendations": ["jack_the_giant_slayer", "ant_man_and_the_wasp_quantumania", "shazam_fury_of_the_gods", "incredibles_2", "hercules", "skyscraper", "bumblebee", "turbo", "lockout", "jumper", "shazam", "hanna", "spies_in_disguise", "wild_card", "twister", "bloodshot", "love_and_monsters", "kingsman_the_golden_circle", "transformers", "the_last_witch_hunter", "the_ice_road", "guardians_of_the_galaxy", "jungle_cruise", "real_steel", "angel_has_fallen"]}