{"id": 4347, "title": "Race", "starring": ["Stephan James", "Jason Sudeikis"], "runtime": 134, "genre": ["Drama", "History"], "description": "Based on the story of Jesse Owens, the athlete whose quest to become the greatest track and field athlete in history thrusts him onto the world stage of the 1936 Olympics, where he faces off against Adolf Hitler's vision of Aryan supremacy.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/3pKLVyz6LGQU8xEDhYHSHsfy5Bg.jpg", "categories": {"plot": 7.0, "acting": 6.666666666666667, "ending": 6.5, "soundtrack": 4.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 2.0}, "reviews": [{"rating": "8", "text": "RACE is a fine old fashioned movie about an amazing athlete who overcame poverty, prejudice, and competing pressures to set Olympic and World records and to finally deciding to take the risk of participating in Hitler's Olympics where he might have failed and reinforced the Third Reich's hateful belief that Jews and Blacks were not even human. Instead, he won four Gold Medals and formed an amazing friendship with an enlightened German competitor. Sadly, the US president never invited him to the White House and he struggled to work upon returning home. James Stephens is an appealing actor, as is his coach and girlfriend/wife; the story is amazingly accurate and compelling, and I was never bored even knowing the ending. Fine job giving us a story of acceptance and decency."}, {"rating": "6", "text": "An inspiring, though somewhat schmaltzy and rather formulaic biopic about Jesse Owens' remarkable feats at the 1936 Berlin Olympics in which he triumphed tremendously in the face of Adolph Hitler's attempts at establishing and flaunting his new Arian empire. While the film effectively captures the look and feel of the period and addresses the many facets that made up Owens' story, it nevertheless suffers from inconsistent performances, uneven pacing and occasionally trite dialogue. Watching \"Race\" makes for a good high school homework assignment, though it's far from groundbreaking cinema."}, {"rating": "2", "text": "As one might expect, over dramatisation and historical innacuracies run wild within this and the dialogue is dull. Do not even bother watching this movie."}, {"rating": "10", "text": "Great movie well told story, I actually learned something from this movie. I don't trust a lot of reviews from the negative trolls on this site. Trust me I been using this site for years and I can tell when people just like troll an give moves bad reviews. Just go out and see this wonderful movie. and Bleep you Hitler"}, {"rating": "3", "text": "Another sterilized, sugar coated Hollywood movie about race relations to make white people feel good.  Characters are quite shallow and uninteresting and doesn't tell us anything about real Owens.  Jesse Owens wished he had it that good back then when lynching was a common thing for just talking back to a white person."}, {"rating": "6", "text": "Race is racing to get to the positives, but failed to do so.... ending up in a 6. While Race brings us heartbreaking moments and heartwarming moments at the same time, Race brings us another \"Been there, done that\" plan that perfectly describe movies like these."}, {"rating": "7", "text": "It was a pleasant surprise that in spite of expected \"Hollywoodzation' and already knowing the outcome \"Race\" is a good movie that holds your interest from beginning to end. With the powerful story, excellent acting, some touching scenes between the coach and runner, loving scenes between the man and woman plus understated but hard hitting race relation scenes here in the USA and how 'Negros' and Jews were treated in Germany in the 1930s.\r There might be many younger people who don't know the saga of Jesse Owens but even those who have a fleeting memory will be impressed with what this young financially poor Black man from Cleveland, who was a remarkable runner, who paid his way through Ohio State University, achieved in one Olympics. Also there are many behind the scenes that took place at the Olympics from suggesting the boycotting the games to deals made with industrialists, stopping Jewish athletes from participating and a female German director who would make memorable documentaries of the 1936 Olympics celebrating Aryan supremacy.\r Stephan James gives a strong performance as Jesse Owens, evenly matched by Jason Sudeikis as the coach Larry Snyder who, from their first meeting when he tells the athlete to look at a man in the eyes when he talks to him, shows the runner how to use his power in more than one way. They both handle, tackle and face what had become accepted discrimination from other athletes, people in high places whether it be an amateur sports group or the leader of countries.\r There is chemistry between James and Shanice Banton as his wife while William Hurt as a judge and  , as industrialist Avery Brundage, give strong support. Carice von Houten as the German director, Barnaby Metschurat as Josef Goebbels, with Jeremy Ferdman and Sam Stroller as the only Jewish ruunjers at the Olympics show two different sides of the same coin. David Cross has a potent turn as Europe's best runner while Michele Lonsdale Smith and Andrew Moodie as Owens' parents give a solid background story to what made him the man he was to become. There is a 15 minute segment revolving around Chantel Riley, showing a possible flaw that the world would come to see as a hero, that really could have been cut without changing the story and making the 2 hour and 15 minute story move at a faster pace.\r The screenplay by Joe Shrapnel and Anna Waterhouse follows the standard Hollywood outline of an award winning athlete but Jesse Owens story makes them detour from the template for strong effect. I do wish they had spent a little more time with the father/son aspect of the athlete's younger life. Director Stephen Hopkins does a journeyman's job while the movie's score by Rachel Portman adds to the impact of many scenes .\r \"Race\" shows an important time in American and world history involving both defintions of the word with a good story. Hopefully it is not being shown too early in the year to be forgotten comes Oscar 2017 time, especially for the performances of Stephan James and Jason Sudeikis.\r Be sure to stay for the 'what happened after' information during the end credits."}, {"rating": "7", "text": "While this movie never reaches its full potential with such a tremendous true story like this, Race is still a well acted, solidly entertaining film to watch.  Honestly, its hard to not like a movie about such an incredible story."}, {"rating": "7", "text": "This is a good introduction to the life and times and struggle of Jesse Owens. Although the movie seemed to play very slow, there seemed to be two movies here-struggle to the Olympics and the struggle at the Olympics. I can't say much for the acting as it wasn't Oscar material, I was impressed with Sudekis. Mostly I was disappointed with the almost complete disregard for the inner conflicts Owens must have had to endure-inner and outwardly."}, {"rating": "8", "text": "A really good movie which depicts Jesse Owens and how he got to win many gold medals in the 1936 olympics and all the drama surrounding that. I would have put 9, but there are some factual things which are changed which I didn't like, so I put 8 instead, but it still is a great movie"}, {"rating": "6", "text": "The double entendre of this film’s title is apt. It details the athletic success of Jesse Owen as he works his way to his record-setting 1936 Olympics, as well as the racial travails that made his journey such a challenge. It’s very informative, especially the details about the reactions of the Nazis, who were hosting those fateful games in Berlin. While it’s well made and has a solid (if traditional) structure, it lacks the fervor that would have ignited the story’s passion. The cast does fine and the direction is competent. It’s more a fascinating history lesson than a stirring film. (The CGI locations are the most obviously fake in recent memory.)"}, {"rating": "5", "text": "I found this movie interesting. The movie's title was perfect for this film. The actual true story is incredible, but the film i a little rough around the edges though. With Jesse an African American who is an Olympian during the Adolf Hitler reign is very bold and risky. I was very surprised that Jason Sudeikis does very good and Stephan James does portray Jesse Owens perfectly. Good watch, nothing special though."}, {"rating": "7", "text": "We know the story of Jesse Owens winning 4 gold medals in front of Adolf Hitler and defeating his superior Aryan race.  But the story of how Jesse got there is the crux of this movie.  The racial taunts Jesse endures at college makes you think he's attending Alabama or Mississippi or Georgia.  But no, it's Ohio State, way up north in Yankee land.  It's a good insight on life in America in the 1930's.  Avery Brundage, who became the head of the IOC, takes a pounding here, used by the Nazi's to get the Americans not to boycott the Games.  On a side note, as Avery drives into the German sports complex, there's a sign that says \"No dogs or Jews.\"  Lest we feel too superior, my Jewish friend, who grew up in Baltimore, said he saw a sign that read \"No dogs, no Negroes, no Jews.\"  That was 1955."}, {"rating": "6", "text": "Race is a formula, made-for-TV type biopic that never really penetrates the phenomenon of Jesse Owens. I would liked to have seen how the students at Ohio State reacted to Owens after his collegiate victories, as well as his neighborhood and family. I would have enjoyed seeing how other Olympics athletes react to Owens. How did his community welcome him home? How did Owens feel about his own greatness. Those emotions didn't have enough screen time. Thus, the movie comes up a little flat. This story would have probably done better as a 3-part mini series on HBO or Showtime. Then they could have told the complete story. But even with its flaws, \"Race\" is still worth a look."}, {"rating": "7", "text": "The best part about Race is that it showed all aspects of the 1936 Olympics. Owens preparing for it, the US politics at the time, Nazi Germany wanting to look good in front of the world, and the racial injustice suffered by blacks in the U.S. and Jews in Germany. The games are shown from all viewpoints. All the racing scenes have suspense and the story becomes enthralling in the second half. This is helped by decently good acting. Unlike other recent biopics, Owens is shown as a real person instead of a perfect character. His coach is also shown as an imperfect character; making us care for everyone to succeed. In addition, the era is shown in an uncensored way; giving us a great view of the 1930's. On the other hand, there are a few issues. First, because of the various plots and subplots; Owens life is only shown on the surface. The film never goes deep inside his mind or his history. Second, some of the dialogue felt unrealistically simple and paltry. In addition, the editing is a bit choppy and some set pieces seemed rather fake. Overall, while Race only covered the basics of Owens life; it is suspenseful, interesting, and showed all aspects of the time / event in good detail. Race is as intelligently good as the double meaning of the title implies."}, {"rating": "6", "text": "Its too long and could have dug deeper into the ethical quanderies of the day, yet Race is nevertheless an important and fairly well-executed period sports drama. Its also refreshing to see Sudeikis act in a more serious role."}, {"rating": "7", "text": "A liked it a lot, but the more I think about it, the story is layed out like a lot of true stories. It feels like more of the same. The story was inspirational though. It is worth a watch."}, {"rating": "4", "text": "It's pretty fabricated movie, mostly just \"Yay USA, Boooooo Germany.\" Yeah, yeah I am well aweare about Hitler etc. but USA isn't any better even in these times. Also there are some scenes that you are \"Mhm, yeah sure that really happend\" like the crows starting to chant for Owens after just one race and the whole stadioum in Berlin chanting USA. Also the music could be better beside in th eopening tittle."}], "recommendations": ["free_state_of_jones", "hidden_figures", "judas_and_the_black_messiah", "42", "snowden", "green_book", "the_mauritanian", "the_imitation_game", "the_white_tiger", "the_post", "the_last_duel", "the_lost_city_of_z", "patriots_day", "only_the_brave", "a_bronx_tale", "darkest_hour", "spotlight", "the_hate_u_give", "hostiles", "a_united_kingdom", "machine_gun_preacher", "valkyrie", "the_33", "12_years_a_slave", "fighting_with_my_family"]}