{
  "id": 4278,
  "title": "Radioactive",
  "starring": [
    "Rosamund Pike",
    "Sam Riley"
  ],
  "runtime": 111,
  "genre": [
    "Drama",
    "Romance",
    "History"
  ],
  "description": "The story of Nobel Prize winner Marie Curie and her extraordinary scientific discoveries—through the prism of her marriage to husband Pierre—and the seismic and transformative effects their discovery of radium had on the 20th century.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/akHIQu8W3rOgT28r25ggXaKcQIr.jpg",
  "categories": {
    "plot": 4.833333333333333,
    "acting": 4.625,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I really don't get what 'Radioactive' was trying to do here. Is this a biopic? A commentary on xenophobia? A romance story? A cautionary tale about the use of radioactivity? It seems like Jack Thorne's screenplay wanted to cover a lot of ground in under two hours.Although Rosamund Pike's acting is not that bad, the clunky dialogue and so many awkward situations don't favor her and her character. It's kind of weird when she's talking to her daughters like they're her colleagues.And what was all that about those flashback and flashforward scenes? I mean, I get the parallel between her work and the future consequences, but it feels like the movie is trying to \"open our eyes\" to situations that have concerned the whole world for ages."
    },
    {
      "rating": "3",
      "text": "Rosamund Pike is miscast, she tries too hard. The whole production would have worked without her strident portrayal of Marie Curie. Painful."
    },
    {
      "rating": "2",
      "text": "Finished this film, the only things this can be described is 'misleading'. It is simply trash for anybody who wants to hear a little bit about Marie Curie without even thinking how she got her achievement. This film create a shallow scientific researcher (Marie Curie) that do all the important things of nuclear science without giving credit to the men it despises. Other works like the film of 1943, a simple book or even the wiki page give you a better insight of her discoveries without any misconception. If still you want to watch it, i suggest researching everything the film tells you, to not get a really bad picture of Marie Greatness. And also, Marie is a terrible person, like all of us, and the film doesn´t bother to show you this fact, so please, caution with this film, it is radioactive."
    },
    {
      "rating": "2",
      "text": "The film tries to sell propaganda instead of focusing on great scientist. Lack of good historical character is such lost opportunity here. Some parts are gallop, some unnecessary. After half of time I got bored and lost interest completely, which should not happed in such movie. Not recommended, even if you're scientist."
    },
    {
      "rating": "7",
      "text": "(Mauro Lanari)\"Stale, rushed and lacking any insightful emotional depth, 'Radioactive' is a dull watch throughout, failing in its attempt to capture both the significance of Curie's discoveries and her own personal struggles\". When I read similar reviews I wonder if I've watched the same movie. The non-linear diegetic structure is decisive for communicating the sense of incalculable chaos in the consequences of every activity, human and non-human, scientific or not."
    },
    {
      "rating": "7",
      "text": "Se nos narra la vida Marie Curie; la trama está bien y la actuación de Rosamund Pike es buena; la recomiendo."
    },
    {
      "rating": "6",
      "text": "Rosamund Pike plays famed scientist Marie Curie in this tolerably traditional biopic. There are a few flash forwards to show relevant results of her research, but they don't really add much to the drama. The narrative starts with her struggles to be recognized by other scientist, until she meets Mr. Curie and they partner in the lab and life. All of the highlights of her career are covered, including both Nobel Prizes and her disastrous love affair. Even though this film feels comprehensive and the performances are decent, it doesn't have much emotional heft and sometimes wanders unexplainably off course. Anyone interested in Curie's story may be rewarded with a solid biopic, but don't expect much additional insight."
    },
    {
      "rating": "5",
      "text": "While the story and Marie Curie of course is very important for our history, the movie itself was somewhat boring and while it was long, at same time it felt like it didnt tell enough in dept. Maybe not the best story material for cinema?"
    },
    {
      "rating": "5",
      "text": "Even with a low profile, Rosamund Pike offers another solid performance that well deserves to be the main reason to enjoy this film, even though it'a a failed film.One that will hardly leave indie circles so that more moviegoers can appreciate it."
    },
    {
      "rating": "5",
      "text": "True story of Marie and Pierre Curie and their Nobel prize winning work that changed the world. The film seems to make out that Marie Curie was responsible for events that happened after her death Chernobyl and the A Bombs being dropped on Japan. They try to make her into a villain, I didn't like the way this movie was edited and put together, But Rosamund Pike's performance in this is oscar worthy but the rest of the movie just lets her down badly."
    }
  ],
  "recommendations": [
    "the_good_shepherd",
    "the_book_thief",
    "the_giver",
    "snowden",
    "donnie_darko",
    "20th_century_women",
    "the_social_network",
    "risen",
    "the_reader",
    "her",
    "mark_felt_the_man_who_brought_down_the_white_house",
    "predestination",
    "the_last_duel",
    "hereafter",
    "cloud_atlas",
    "closer",
    "zero_dark_thirty",
    "spotlight",
    "searching",
    "personal_shopper",
    "the_banker",
    "into_the_wild",
    "crash",
    "tolkien",
    "all_the_bright_places"
  ]
}