{"id": 2553, "title": "Raiders of the Lost Ark", "starring": ["Harrison Ford", "Karen Allen"], "runtime": 115, "genre": ["Adventure", "Action"], "description": "When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime.", "releaseYear": "1981", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/ceG9VzoRAVGwivFU403Wc3AHRys.jpg", "categories": {"plot": 9.653846153846153, "acting": 9.666666666666666, "ending": 9.666666666666666, "soundtrack": 9.666666666666666, "cinematography": 10.0, "familyFriendly": 8.0, "funny": 9.75, "action": 9.475}, "reviews": [{"rating": "10", "text": "Indiana Jones, the character responsible for making archaeology the most exciting and sought for career ever is at best found in his first and inarguably greatest classic. Raider's of the lost Ark was one of a number of classic brought to the screen in the 1980's, other notable masterpieces were time travel saga the Back to the Future trilogy, the original Terminator and the Empire Strikes Back, and Spielberg's action adventure near enough trumps them all.\rSet in the backdrop of mid 1930's, where the second world war is on the verge, the film begins in a middle eastern jungle, Indy is venturing for a golden idol, he begins with three mercenaries, the whip crashes and five minutes later, he's running from a boulder having just set off the booby trap that would encave the entire temple. Five minutes in and one of the film's, of not one of cinema's most iconic scenes has rolled its way on to the screen, surely it can't get better?\rIt does, watch on.\rSteven Spielberg is on top form in this department, providing camera work and action set pieces galore, scripted wonderfully by 80's superman Lawrence Kasdan (Empire Strikes Back.) But it's Harrison Ford who takes the cake as arguably the greatest (super)hero in cinema history, running from set piece to set piece whilst driving his story with impossibly cool suave and underlying moral dilemma. It's a film that, when first thought about ($20m globe trotting actioner starring Han Solo?) should not be good, bar even watchable, but the dream team of Lucas, Spielberg, Kasdan and Ford make it some of the most exciting, visually arresting adventure pics in creation. A must watch."}, {"rating": "9", "text": "This is primarily an action movie, and it does its job of thrilling us with brilliant action sequences one after the other more than satisfactorily. Harrison Ford plays Dr. Indiana Jones, a professor of archaeology at an unnamed university. Don't let his profession fool you. In his spare time, he likes to go on prolonged hunts for antiquities. This hobby of his takes him from South America to Nepal to Egypt.\r He finds trouble everywhere he goes, or trouble finds him. Indy is not interested in riches, but seeks to hand over each discovery he can to the museum. But Belloq, his nemesis, seems always to be one step ahead of him, and he has powerful friends who then have more friends of themselves, always among the local population. Shooting frequently breaks out wherever Indy goes, buildings explode, henchmen die and so on.\r The main plot follows Indiana Jones on the search for the lost Ark, which the Nazis are digging for with the help of Belloq. An object that is a key toward finding it is with Marion, Indy's past love interest. Circumstances force them to go on the search together, but they must do this before the Nazis, who would stop at nothing to bring the Ark to Berlin for the Fuhrer, to use as a weapon.\r The pacing was too fast at times and little time was left to develop the mythology and the importance of the Ark. We were expected to come into the film with a crash course on it. What the movie excels at is not making us Ark enthusiasts, but letting us glimpse what most treasure hunts must feel like to the people who pursue this course of action.\r All the action might have bored an average viewer if not for the quirky lines that crack you up, uttered by the characters in the face of impending death. Indy doesn't seem to believe for one moment that all those bullets flying over his head could really hit him. Often times, he uses his whip to slash at opponents and as a fulcrum to propel himself forward or lower himself or hold onto something. It serves nearly unlimited purposes.\r Set in 1936, the movie captures the look of the time as well as any other movie could. We have the cars, motorcycles, planes; and the dresses and uniforms and weapons. All this combines to create a very convincing world in which we absorb instantly.\r The movie has more than its share of explosions, car chases, shooting, fist-fighting and all that. You hardly ever pause to reflect, or become bored for that matter. You never learn how the Nazis find out which ship was Indiana travelling in. All this is good, and I thoroughly enjoyed the movie, but what I couldn't digest was the ending. It isn't necessarily bad in any way. Actually it failed to make any kind of impact on me. It kind of fizzled out. I feel like it should have held true to the joyride which came before it. Go out with a blast, not with a fizzle. Surely greats like George Lucas and Steven Spielberg could have done better. It was too deus ex machina. I found it anticlimactic, and it lessened the effect the movie had on me until then.\r Hailed as a great movie by many critics and audience alike, I cannot deny that I enjoyed the ride. But I can't concur in good conscience that this movie was great in light of the ending of the movie, though I will be fair and rate it as it deserves."}, {"rating": "10", "text": "For me it is not only the best of the series but one of the greatest adventure films ever made. It is breathless excitement from start to finish, and to be honest I cannot fault it really. The production values are wonderfully evocative, and John Williams's score is outstanding. The script is filled with wit and invention, and the story is slickly paced and exciting. The action is spine-tingling, with booby-trapped caves, snake chambers, Nazi spies, religious demons, damsels in distress and romance, and the special effects are dazzling especially in the superb climax. The direction is effortless, and there is little to complain about the acting either. The part of the unorthodox archaeologist fits Harrison Ford like a glove and Paul Freeman brilliantly plays a smooth villain. Karen Allen, Denholm Elliot and John Rhys-Davies are excellent as well. In conclusion, brilliant and if you haven't seen it do. 10/10 Bethany Cox"}, {"rating": "10", "text": "I've seen thousands of movies and this one stands up.  Maybe the best movie ever made."}, {"rating": "9", "text": "Raiders of the Lost Ark successfully blends archaeology with history and becomes a lively and fascinating action adventure around the globe. The collaboration involved on this first Indiana Jones flick is staggering - even for then. It's no doubt it has become an epic classic."}, {"rating": "10", "text": "Simply the greatest adventure movie ever made. Harrison Ford does great in the title role and the rest of the cast is top tier, as well. Raiders also fascinates me with its interesting back story about the Ark of the Covenant."}, {"rating": "10", "text": "One of the best movies of all time. This is a classic. It did everything right. When it was released it was new and different. It was action-packed and suspenseful right from the beginning and has lots of humorous parts thrown in, lots of scary parts too. Another movie with an amazing musical score by John Williams, the music is amazing in this movie! I love the style of the way it was filmed, my girlfriend who is an art major told me the name for it but I forget, anyway it is filmed the way really old movies used to be filmed which looks way better than the typical Hollywood film you see today."}, {"rating": "9", "text": "An obvious classic, \"Raiders Of The Lost Ark\" is a splendid showcase of stellar storytelling, excellent imagery, and a healthy action. Truly impossible to forget."}, {"rating": "9", "text": "In 1981, Steven Spielberg and George Lucas came together for a film called \"Raiders of the Lost Ark\", and thus brought to the world what would quickly become an immortal new action hero, Indiana Jones, played with irrepressible charisma and charm by Harrison Ford. Made in the spirit of the old movie adventure serials, we follow Henry \"Indiana\" Jones, professor of archaelogy and 'obtainer of rare antiquities', as he is asked by the government to locate the biblical Ark of the Covenant before the Nazis, who are also searching for it to unleash its theological powers. And what else is there to say? This is a classic adventure film, full of memorable characters, fantastic action scenes, drama, humor and an iconic music score. Certainly a top-tier movie from \"top men\" in the business."}, {"rating": "9", "text": "The best action/adventure movie of all time. Smart and cool that deals with the Nazis. A great movie that makes you stand up and shout with enjoyment."}, {"rating": "10", "text": "I remember first watching this when people talking about the return of Indiana Jones. Since I was a fan of Steven Spielberg I figured I's give this movie a shot. It was an incredible action-packed adventure. First off, the storyline is interesting and puts you on the edge of your seat. Second, the characters are awesome. I figured some of the lines would be quorky and lame, but it was surprisingly well written. And finally, the action. For an old classic like this, the action is very intense, fun and enjoyable. This is one of those movies that I wished I had already known. This is definitely one of the biggest movies ever made. Just ask an folk if they've seen Raiders of the Lost Ark. They'll most likely tell you they loved it. Overall, it's the biggest adventure in the history of cinema."}, {"rating": "9", "text": "The beginning of one of the best franchises of action, and nothing but a lot of fun, full of innovative action, a character who became an icon of pop culture and immortalize Harrison Ford, and one of the first good plots that would become a model for movies action  adventure."}, {"rating": "10", "text": "My Number 1 favourite movie of all time and pretty much the pinnacle of adventure cinema \"Raiders of the Lost Ark\" is a film that no matter how many times it re-runs on air i can sit down and watch it indefinately.\r \"Raiders\", a marvel piece of cinema was created and brought to life by two of hollywoods biggest names at the time (Steven Spielberg \"Jaws\" & George Lucas \"Star Wars\"), Inspired by the old film serials of the 30's and 40's where adventurers will survive and escape virtually in-escapable peril,\r Harrison Ford is in his prime as the famous fictional architect Indiana Jones, whose journeys would involve bizarre riddles and strange hyroglifics that would usually result in biblical proportions.\r At the very beginning of the movie we are treated to a jungle exhibition with a mood defining score from John Williams and a younger, thinner Alfred Molina. Suddenly we enter a cave and finally the film already set it's moods and expectations in no less than 15 mins!!!\r Suddenly we see what little of Jones's regular life is like as a College professor, and in no time we see him off on another adventure searching for the legendary Ark of the Covenant (Built by the Israeles to hold the fragments of the Ten Commandments). this ends up seeing Jones traveling to Nepal to meet his old flame Marion (Karen Allen) who may hold the key to finding the Ark, unaware that both of them are being followed and hunted by Nazi Gestapos sent by Hitler to collect the Ark for himself, this revalation pairs Indy and Marion together as the head for Cairo to find it first.\r Among the Highlights of the movie as said before is The Cave, The Barfight in Nepal, The famous Market chase and the undeniably funny \"Gun to the Swordfight\" scene and so many others, even the ENDING of the film is so famous it has been more than parodied to death in recent Pop-Culture.\r The special effects and visual style in this film are truly a lost art, from the wax melting faces and giant fiberglass boulders, to the spirits, streets of Cairo, dimly lit dungeons and tombs, everything and anything could come out from anytime, anywhere.\r Also many people do not know all the talent behind this movie, Joe Johnston won an Academy Award for his effects and would later turn to directing, most notably recent \"Captain America: The First Avenger\" where the Nazi Villian utters \"And the Fuhrer digs for trinkets in the desert\" ;-)\r And Michael Bay was the storyboard artist who thought the movie was going to be horrible, saw it, loved it and eventually became a film-maker himself (yet he really needs to learn something or two).\r Even then though as i write and dive into this movie i can't explain why it's such a gem, Adventure films before and after to me never really reached this magnitude (not even the sequels) and no matter when and where it's on i'll just have to sit and watch it. all in all you're along for the ride and once it's started there's no going back.\r \"Raiders\" even after all i've said there no possible way to fully describe the experince as a whole, but why it means so much to me, in one sentence is...\r \"One of the most Imaginative movies ever made and that's what i consider Cinema and Story telling is all about\"\r Final Verdict: I loved it the first time i saw it, and i'll most likely continue to love it till the day i die, My ultimate number 1 movie of all time."}, {"rating": "10", "text": "Raiders of the Lost Ark is by far one of the best, unforgettable films of the 80s. To the great leaders George Lucas and Steven Spielberg brings adventure to life."}, {"rating": "10", "text": "\"Spielberg can never top this. Period.\"  Luke Y. Thompson, Dallas Observer Luke is right. This is the best Spielberg film as of yet. I don't believe he can top this. The movie's charm and adventure just captivate you and fully engage you in the movie. It works like clockwork.\r This film combines adventure, greed, power, love, Nazis, Harrison Ford at his best, and many other things to make the best adventure film ever made.\r All the actors seem to enjoy their roles, and I especially love Paul Freeman's crazy French archaeologist character, Belloq.\r There are many iconic scenes here; the boulder chase scene, the plane explosion, the U-boat scene, the \"kidnapped Marion\" scene, the \"Indy-shoots-the-guy-with-the-sword\" scene, and of course the melting faces scene. I could go on and on. You will like every moment of this movie, and will want more. Since you want more, you have 3 almost-as-good sequels to watch!"}, {"rating": "10", "text": "An amazing, wonderful tale of a man's quest for a holy yet cursed chest in the mythology, Raiders of the Lost Ark boasts strong, heroic from Harrison Ford, and undeniably greatly benefits from a fantastic storytelling."}, {"rating": "10", "text": "My favorite movie by far. Indiana Jones is the most interesting/awesome/amazing character ever put to film. 90 doesn't do it justice. It should have won best picture."}, {"rating": "10", "text": "This movie is amazing don't for for the big words that others use such as ''monotonous'' or ''linear'' these people are complaining that this movie isn't complex or sophisticated Indiana Jones isn't supposed to be either it is basic and simple finding nemo was supposed to be finding nemo not the godfather this movie has all the great things a movie needs a great story, action and of course characters the characters in this movie are just so easy to fall in love with and you do care for them when they are harmed overall indiana Jones and the raiders of the lost ark is a must see"}, {"rating": "10", "text": "Raiders is one of the most entertaining movies ever made.  The action is great, the writing is smart, the acting is great, and Spielberg's direction is brilliant."}, {"rating": "9", "text": "Every person who i know has seen this movie and has liked it! It is a fantastic movie and my second favorite Indiana Jones movie. This is definitely better than the 4th movie >,"}, {"rating": "9", "text": "Raiders of the Lost Ark may just be the movie that defined the term 'classic'. With a timeless story, unforgettable characters, an iconic score, and some of the best action scenes ever made, Raiders solidifies itself as one of cinema's great achievements. This is in my personal top five best films ever made.  Although in my honest opinion, it is not fully deserving of a perfect score, even though it comes incredibly close.\r 9.9/10"}, {"rating": "10", "text": "One of the best movies of all time. This is a classic. It did everything right. When it was released it was new and different. It was action-packed and suspenseful right from the beginning and has lots of humorous parts thrown in, lots of scary parts too. Another movie with an amazing musical score by John Williams, the music is amazing in this movie! I love the style of the way it was filmed,"}, {"rating": "9", "text": "Yet another masterpiece starring Harrison Ford. Though he gained fame from Han Solo, in this film he is the true star! Raiders of the Lost Ark is thrilling and action-packed with an amazing soundtrack to match!"}, {"rating": "9", "text": "A fun adventure/action story from the days before CGI when the story had to be the driving force behind a good action film. A true classic that should not be missed."}, {"rating": "10", "text": "Man, as archeology ever been this interesting? I don't think so! An iconic masterpiece by Spielberg with a sense of mystery and adventure like any other film and also an unforgettable performance by Ford."}, {"rating": "10", "text": "Released in 1981, Raiders Of The Lost Ark puts Ford in search of the Ark of the Covenant, racing against Nazis who would use it for their own purposes, and bulldozing through one action-packed episode after another. Much of the blame for the all-action-all-the-time approach of current summer blockbusters can be placed on Raiders, but if any of the copycats had Spielberg's command of storytelling and visual gags, it wouldn't matter. Raiders finds the right balance between reverence and wit, and the sight of Ford outrunning that giant boulder thrills as much on the 14th viewing as the first."}, {"rating": "10", "text": "Despite what the DVD marketeers are currently claiming, the title of this movie was, is, and always shall be Raiders of the Lost Ark, not Indiana Jones and the Raiders of the Lost Ark. There are times when revisionism can be taken too far, and this is one of those instances. I don't need all of my Indiana Jones titles next to each other in my DVD library. I'm perfectly capable of going to the \"R\" section for Raiders rather than having it alongside the sequels, Indiana Jones and the Temple of Doom and Indiana Jones and the Last Crusade.\r You have to love a movie that is so devilishly clever as to make the hero's every effort, no matter how Herculean, irrelevant to the conclusion. Had Dr. Jones elected to go on an extended vacation to Mozambique and never have anything to do with the Ark of the Covenant, nothing would have changed. Jones doesn't save the day. In fact, he doesn't come close to rescuing it, unless one considers his having failed as being the key to success. (Although he does get the girl.) Yes, the movie ends with melting faces, but, underneath all of that liquefying flesh and exploding heads, there's an abundance of irony just waiting for the attentive movie-goer to unearth. When was the last time that an action hero has been so utterly, completely inconsequential as Indiana Jones?\r But, in discussing the ending, I'm getting ahead of myself. Better, instead, to go back to the beginning. Where that is, is anyone's guess. It could be back in the late '40s, when a young George Lucas was enthralled by the cliffhanger serials that would inspire this film. It could be in 1975, when Steven Spielberg made a little movie about a not-so-little shark and suddenly became a big name in Hollywood. It could be in 1977 when Lucas' Star Wars singlehandedly revived science fiction and solidified the concept of the summer blockbuster. Or it could be later in that same year, when Lucas and Spielberg, while both vacationing in Hawaii, decided that they had to work together on a project. That project would become Raiders of the Lost Ark.\r Action movies were a different breed in the pre-1981 years than they are today, and one of the reasons for their transformation had to do with Raiders of the Lost Ark. Before this movie, James Bond ruled the roost and the Bond formula was the accepted path that any self-respecting action movie would follow. The first Indiana Jones outing changed that. The film was constructed as a series of cliffhangers with narrow, death-defying escapes. Not since the era of serials have audiences so often asked the question, \"How's he going to get out of this one?\" It's unfair to claim that the 007 outings were unexciting, but, compared to Raiders of the Lost Ark, they come across as sedate. Raiders transformed the action movie landscape. In the years that followed, nearly every action movie would try to generate the same sense of suspense and tension. Even the Bond movies would catch on.\r Certainly, Raiders of the Lost Ark is a breathless, white-knuckle experience of a movie. It is also perfectly paced. There's enough time in between the frequent action scenes to provide the minimum of exposition and character development for us to understand what's going on and to appreciate the relationships between the individuals who populate the screen. There's none of the frantic quick-cutting that has since become a staple of action movies (thank you, editor Michael Kahn!), and the production does not seem frenzied and out-of-control. This isn't a case of cardboard figures running around in circles and blowing things up. We care about Indy and Marion in ways that we rarely care about protagonists in this genre. When Marion \"dies,\" it stings.\r For composer John Williams, who has long been favored by both Spielberg and Lucas, the chance to work on Raiders of the Lost Ark offered him an opportunity to collaborate with them both, and to add another memorable theme song to his list of credits. In the five-year period from 1977 to 1982, Williams created five of movie-dom's most popular title tracks: Star Wars, Close Encounters of the Third Kind, Superman, Raiders of the Lost Ark, and E.T.\r The deserved popularity of Raiders of the Lost Ark resulted in a huge box office bonanza for Paramount Pictures. This is the kind of movie that, even today, audiences immediately fall in love with. It has all the right ingredients: a smart script, a likable hero, a dash of romance, more than a touch of comedy, and a lot of fast-paced action. The two sequels are vastly inferior - Indiana Jones and the Temple of Doom is too ponderous and Indiana Jones and the Last Crusade is unforgivably fatuous. Yet, because the first entry of the series leaves such an indelible imprint, the existence of lesser chapters to the Indiana Jones saga does nothing to dilute its impact. Raiders of the Lost Ark is a movie to be savored by viewers of all ages and all persuasions."}, {"rating": "10", "text": "Raiders of the Lost Ark is one of the best movies of all time. Everybody agree that. And it is one of my favourite movies of all time. So it gets 10 out of 10. An A+."}, {"rating": "10", "text": "It is possibly the greatest action/adventure films of all time! The action scenes are intense, the lead characters, both male and female, are charming and strong, the music is iconic, and the story is engaging! Steven Spielberg is one of my favorite filmmakers, and he proves his excellence further with this awesome classic."}, {"rating": "9", "text": "Indiana Jones : Raider of the lost Ark is a excellente movie. The screenplay is perfect. Actors play very well their roles. the music ismagnificent .  Action, adventure , humor are there."}, {"rating": "10", "text": "When I first saw this movie in the cinema i immediately fell in love, this movie has everything you could wish for: a cool hero, action, adventure, mystery, humor and fantastic music (by John Williams). Who could ever forget the main theme song of this movie? (ta tata taaaaaaaa, ta ta taaa! ta tata taaaaaaa, ta tata ta ta!)\r Raiders of the Lost Ark is a classic, the best movie directed by Spielberg and one of the most enjoyable movies ever made. I think I have seen this movie more than 10 times.\r I rate Raiders of the Lost Ark with a perfect score of 10 out of 10."}, {"rating": "10", "text": "Just like the old movies from the early days, this adventure moves from one improbable event to the next.  If you are a realist, you won't like this.  But if you can just let go and enjoy the ride, what a ride.  This was the first of the Indiana Jones films, and the best.  I don't have many DVDs but this one is in my collection."}, {"rating": "10", "text": "Indiana Jones, the character responsible for making archaeology the most exciting and sought for career ever is at best found in his first and inarguably greatest classic. Raider's of the lost Ark was one of a number of classic brought to the screen in the 1980's, other notable masterpieces were time travel saga the Back to the Future trilogy, the original Terminator and the Empire Strikes Back, and Spielberg's action adventure near enough trumps them all.\rSet in the backdrop of mid 1930's, where the second world war is on the verge, the film begins in a middle eastern jungle, Indy is venturing for a golden idol, he begins with three mercenaries, the whip crashes and five minutes later, he's running from a boulder having just set off the booby trap that would encave the entire temple. Five minutes in and one of the film's, of not one of cinema's most iconic scenes has rolled its way on to the screen, surely it can't get better?\rIt does, watch on.\rSteven Spielberg is on top form in this department, providing camera work and action set pieces galore, scripted wonderfully by 80's superman Lawrence Kasdan (Empire Strikes Back.) But it's Harrison Ford who takes the cake as arguably the greatest (super)hero in cinema history, running from set piece to set piece whilst driving his story with impossibly cool suave and underlying moral dilemma. It's a film that, when first thought about ($20m globe trotting actioner starring Han Solo?) should not be good, bar even watchable, but the dream team of Lucas, Spielberg, Kasdan and Ford make it some of the most exciting, visually arresting adventure pics in creation. A must watch."}, {"rating": "9", "text": "Such an amazing film and no one can be a perfect Indiana Jones than Harrison Ford himself. An adventure of progress is waiting for you to experience with or without anyone near you."}, {"rating": "10", "text": "One of the best movies of all time, steven Spielberg has made a absolute masterpiece. It has amazing action, humor, and harrison Ford as jones is the perfect pick for such a adventurous character."}, {"rating": "9", "text": "Action movies were a different breed in the pre-1981 years than they are today, and one of the reasons for their transformation had to do with Raiders of the Lost Ark. Before this movie, James Bond ruled the roost and the Bond formula was the accepted path that any self-respecting action movie would follow. The first Indiana Jones outing changed that. The film was constructed as a series of cliffhangers with narrow, death-defying escapes. Not since the era of serials have audiences so often asked the question, \"How's he going to get out of this one?\" It's unfair to claim that the 007 outings were unexciting, but, compared to Raiders of the Lost Ark, they come across as sedate. Raiders transformed the action movie landscape. In the years that followed, nearly every action movie would try to generate the same sense of suspense and tension. Even the Bond movies would catch on.\r As played by Harrison Ford, Indiana Jones represents a different kind of action hero. By hearkening back to the protagonist from those black-and-white serials, Lucas and Spielberg created the model for the future. Jones is as close to an \"everyman\" as you're likely to find in an action movie. He's tough, but not that tough; he has women problems; he wears natty, \"lived-in\" clothing; he doesn't drink martinis, regardless of whether they're shaken or stirred; he frequently gets bumped, beaten, and bruised; and he doesn't have biceps like a Mr. Universe. One has to wonder if someone like John McClane (Die Hard's fly in the ointment) could have existed if Ford hadn't trailblazed this road. Certainly, there wouldn't have been any Jack T. Colton (Michael Douglas' character in the best of the Raiders re-treads, Romancing the Stone) or Rick O'Connell (Brendan Fraser in The Mummy).\r The film, which transpires in the late 1930s, opens with a wonderfully tense, pulp-inspired sequence inside a ruined temple as archeologist adventurer Indiana Jones seeks to avoid a number of pitfalls and traps on his way to recovering a priceless artifact. Tarantulas, gaping pits, lethal spikes, arrows, and a huge rolling boulder are a few of the dangers he overcomes, only to lose possession of the statuette to his arch-rival, Rene Belloq (Paul Freeman), once he emerges. Indy escapes relatively unscathed, but returns home with his tail between his legs, disappointed at being unable to retrieve the prize. His consolation, however, is that the U.S. government would like him to track down the Ark of the Covenant, and they are willing to pay handsomely for him to do so.\r Indy's journey in search of the Ark reunites him with an old flame, Marion Ravenwood (Karen Allen), who holds a key piece of the puzzle necessary to pinpoint the artifact's location. Then it's on to Cairo, where he teams up with an old friend, Sallah (John Rhys-Davies), who gives him information on the Nazi dig site, supervised by none other than Belloq. It becomes a race between Indy and Belloq for the prize - a race that Indy wins before Belloq steals away the spoils, leaving Marion and him trapped in near-darkness surrounded by thousands of hissing snakes. But Indy isn't finished, and, after escaping from Belloq's trap, a chase ensues involving planes, trucks, ships, and a submarine. In the end, the Nazis get the Ark, but learn that sometimes it's better to lose than to win.\r Certainly, Raiders of the Lost Ark is a breathless, white-knuckle experience of a movie. It is also perfectly paced. There's enough time in between the frequent action scenes to provide the minimum of exposition and character development for us to understand what's going on and to appreciate the relationships between the individuals who populate the screen. There's none of the frantic quick-cutting that has since become a staple of action movies (thank you, editor Michael Kahn!), and the production does not seem frenzied and out-of-control. This isn't a case of cardboard figures running around in circles and blowing things up. We care about Indy and Marion in ways that we rarely care about protagonists in this genre. When Marion \"dies,\" it stings.\r Which brings us to one of Raiders' great strengths: the performances. No Oscar nominations were awarded, but it's hard to imagine any group of actors doing a better job. By the time Raiders of the Lost Ark was made, Harrison Ford had filed off the rough edges that were apparent in his first outing as Han Solo.\r The deserved popularity of Raiders of the Lost Ark resulted in a huge box office bonanza for Paramount Pictures. This is the kind of movie that, even today, audiences immediately fall in love with. It has all the right ingredients: a smart script, a likable hero, a dash of romance, more than a touch of comedy, and a lot of fast-paced action."}, {"rating": "10", "text": "Best movie of all time.  Nothing comes close.  I remember seeing Raiders in the theater 14 times when I was a kid.  It was great to take my son to see it a couple of years ago when it was playing as a limited theater run.  What can I say? Indiana Jones IS adventure.  Everything about this movie is perfection.  There is an amazing action scene within the first 10 minutes which I think a lot of movies can learn from.  That scene was the hook.  Indiana and all the players were interesting and multi-layered.  I have seen this movie over 200 times and it is the best movie ever created.  If you haven't seen it, you haven't seen perfection on film."}, {"rating": "9", "text": "The film that secured Harrison Ford as Hollywood's best, Raiders of the Lost Ark is a brilliantly crafted adventure flick, and is filled with charming performances, unique set pieces, and a thrilling story-line."}, {"rating": "9", "text": "Harrison Ford takes on another iconic role led by Speilberg and Lucas. Raiders is another movie that is pure magic. It is a timeless classic. Indiana Jones has become one of the great icons in pop culture."}, {"rating": "10", "text": "Raiders of the Lost Ark is awesome. Harrison Ford as Indiana Jones is amazing. But its also the direction, the performances, the action, the production design, and the music that sets this film apart. It is a classic that all should watch."}, {"rating": "9", "text": "\"Raiders of the Lost Ark\" is a adventurous movie that plays out like a TV series, but one with a powerful script, cast, and story. Its like watching the best moments of TV in one cool movie."}, {"rating": "9", "text": "This film is \"The\" Adventure film and an example of how to make a good blockbuster flick. Entertaining as hell with memorable action scenes, solid acting and a well told story. Absolute joyride from beginning to end."}, {"rating": "9", "text": "Raiders of the Lost of Ark is a masterpiece. It has some of the most famous scenes in move history from the beginning to the end. It is adventure like no other."}, {"rating": "10", "text": "First off, this is a 10 out of 10.  Such a great adventure, that's just a masterpiece. Acting is great. Harrison ford was outstanding. Score is phenomenal. The classic lost ark music is just fun to listen, and overall it's just great to listen to. Story is also really good. Action sequences are great. Really well made. Overall, this is an outstanding movie. You should see this movie. It'll be a mistake if you don't see it."}, {"rating": "9", "text": "Awesome movie that introduced Harrison Ford's most iconic role (sorry Han Solo fans). Only complaint I had was because of the way the Ark of the Covenant was portrayed, but everything else was great!"}, {"rating": "9", "text": "I really liked it. Thought it was a good adventure film that established Harrison Ford as the go to guy for any action film. This is a must watch for anyone."}, {"rating": "9", "text": "10yrs old watching this in the movie theater....  nothing better. Just watched it again the other night and I still like it very much...  still a 9 for me 30 some yrs later :)"}, {"rating": "10", "text": "'Raiders of the Lost Ark' is THE shining example of a brilliant action/adventure blockbuster movie. It's by far my all-time favorite Spielberg film, and worthy of all praise it gets. I've seen all the Indy movies, and this one is definitely the best! I'd rank it among the best Steven Spielberg movies ever (and I'm not the only one): http://www.ranker.com/list/the-best-steven-spielberg-movies/lons"}, {"rating": "10", "text": "The film is so funny, it has a good soundtrack, the characters are funny that is what makes the movie so funny, the effects are good and creepy sometimes, it has good action, one of the best of that genre, and the only one in being nominated in the Best Picture Category. One of the best films made by Steven Spielberg."}, {"rating": "10", "text": "Brilliantly crafted with moving characters, delightfully evil antagonists, Raiders of the Lost Ark certain to hark up nostalgia of early black-and-white escapist films."}], "recommendations": ["captain_america_the_winter_soldier", "rocky_ii", "the_lord_of_the_rings_the_fellowship_of_the_ring", "back_to_the_future_part_iii", "mission_impossible_rogue_nation", "indiana_jones_and_the_temple_of_doom", "you_only_live_twice", "the_lord_of_the_rings_the_two_towers", "the_lord_of_the_rings_the_return_of_the_king", "creed", "terminator_2_judgment_day", "captain_america_the_first_avenger", "x_men_days_of_future_past", "mission_impossible_ghost_protocol", "die_hard", "blade_runner", "top_gun_maverick", "the_scorpion_king", "jurassic_park", "the_island", "from_russia_with_love", "mad_max_beyond_thunderdome", "the_magnificent_seven", "the_league_of_extraordinary_gentlemen", "john_wick_chapter_2"]}