{
  "id": 601,
  "title": "Ralph Breaks the Internet",
  "starring": [
    "John C. Reilly",
    "Sarah Silverman"
  ],
  "runtime": 112,
  "genre": [
    "Family",
    "Animation",
    "Comedy",
    "Adventure"
  ],
  "description": "Video game bad guy Ralph and fellow misfit Vanellope von Schweetz must risk it all by traveling to the World Wide Web in search of a replacement part to save Vanellope's video game, Sugar Rush. In way over their heads, Ralph and Vanellope rely on the citizens of the internet — the netizens — to help navigate their way, including an entrepreneur named Yesss, who is the head algorithm and the heart and soul of trend-making site BuzzzTube.",
  "releaseYear": "2018",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4QNM5xkAjekFFhvmttyA6aX76ne.jpg",
  "categories": {
    "plot": 4.053571428571429,
    "acting": 4.551724137931035,
    "ending": 4.714285714285714,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 3.75,
    "funny": 4.15,
    "action": 4.5
  },
  "reviews": [
    {
      "rating": "2",
      "text": "It had a good premise and a few jokes, early on. However, the story is a total disaster. Halfway through, it starts dragging and then crumbles. 'Wreck-it Ralph' was a fun, clever movie. This movie is nothing like that."
    },
    {
      "rating": "6",
      "text": "This movie did not have the same heart as the original. The motivation to keep the story going fell a little flat. The relationship between Vanellope and Ralph take on a cringe inducing path. The new characters were lacking any substance and the overall story was a little boring. I had high hopes for this movie because the original was fantastic. The movie relied too much on the established characters and never fleshed out anything more worthwhile. I give it a soft 6. I loved wreck it ralph btw."
    },
    {
      "rating": "5",
      "text": "Yet another sequel that is mostly unnecessary. Though there are a few entertaining moments throughout, it seems they cared more about beating a world record for product placement rather than telling the best story possible. They sadly also spend too much time breaking Disney canon for the sake of a feminist message. The fact that the end message to this film is that you can leave everything behind and forsake people who depend on you all to pursue your dreams is a terrible message for our kids and especially young women everywhere. Let this be the end of it. C-"
    },
    {
      "rating": "3",
      "text": "It's not hard to see why no one defends this movie. It's an unfunny, unimaginative, embarrassing sequel that deserves a score significantly lower than the 71 it has. (For comparison sake, that's on par with stuff like Mulan (the REAL one from 1998) and the third How to Train Your Dragon.) It's not without a few good elements, which is why I gave it a 3 instead of anything lower, but it's still easily the weakest Disney film from the otherwise pretty solid 2010s."
    },
    {
      "rating": "2",
      "text": "Does this movie really has almost the same score as the first one? That means that THIS is almost as good as the original? I DON'T think so. I can't say this movie was disappointing because I wasn't expecting ANYTHING good from this movie, the trailers make it look like it was going to be another Emoji Movie and just Disney references, so cringeworthy.I'll start with the bad.The Bad:-The premise and concept could have potential to be good, but Disney just messed it up. The \"internet world\" they're representing is so bland, predictable and lacks any creativity, like I think that's what everyone imagines how the internet looks and works. I can't say I could do it better because if I was in charge of creating the world of this movie, honestly, I would have the same idea, but I expect some creativity from Disney. When your \"internet\" world looks very similar to the \"smartphone\" world of the Emoji Movie, you are doing something wrong.-The plot is so dumb even if it's aimed towards children. This movie gives so stupid and ridiculous explanations on how viral videos work. Is Disney trying to teach kids that they will get 27000 dollars in less than a day for spamming the internet with dumb videos of them copying already viral videos? Because that's the exact same thing Ralph does in the movie. That's not how the internet works and even for a silly kids movie, this is so ridiculous.-I actually liked the princesses scene, but the movie literally shows what you saw in the trailers and just a couple more minutes of it. Also it doesn't fit in this movie, this could be better if it was a standalone short, not a part of a movie like this, such an unnecesary scene, but well, I guess it was \"important\" for the plot after all.-I don't understand the praise towards the \"Slaughter Race\" musical number. Yeah it's cool on its own, it has that classic Disney Renaissance vibe, but it made me cringe when I remember from what movie it is from, it's an unnecesary scene.-They turned Ralph into an unlikable character, he does so many stupid things that just made me facepalm through the entire movie. He turned out to be this movie's twist villain, I guess.However, there is one thing I actually liked, SHOCKER!The Good:-The message this movie tries to give at the end of the movie. It's so realistic and relatable, if this topic was the focus of the entire movie, I think it could have been SO much better.Disney should stop making sequels, but I obviously know that will not happen as they are doing it for obvious reasons ($$$) Just makes me sad that they made a mediocre sequel to a movie that didn't really need a sequel. Why not release this straight-to-Netflix? I guess because they didn't have anything original to release in theaters in 2018 and they needed to make money."
    },
    {
      "rating": "1",
      "text": "The only thing I loved about the movie is that the \"internet\" concept was handled with humor. How it jumped to six years time is forgivable, but Ralph and Vanellope going out in their game more than twenty-four hours without creating conflict is definitely not (I distinctly remember that that was one of the major problems in the first movie) - very inconsistent. I also found the writing very lazy because the plot kinda feels \"forced,\" the characterization was boring, and the theme was common. So, it's a 1/10 for me."
    },
    {
      "rating": "3",
      "text": "Animation is top notch and sound is beautiful. But this movie felt like it did not belong. The main characters almost feel hollow and meaningless. The story was complete in the first one and I would welcome a sequel to a movie universe if you give me a reason. This doesn't do anything that is worth investing in, it just feels like a forced, failed scheme to milk a fanbase"
    },
    {
      "rating": "0",
      "text": "An annoying, unfunny, uninspired embarrassment that's not worthy of calling itself a sequel to the gem that's the original film. Unforgivable."
    },
    {
      "rating": "0",
      "text": "This is a boring movie. The first movie made some rules to follow by not jumping games and this film Veneloppe becomes Turbo. Wow.It is completely useless. It spoiled the name of the first movie. The internet is never ending land of ads. The movie didn't mention about Turbo. This movie is overrated."
    },
    {
      "rating": "3",
      "text": "Ralph Breaks the Internet is, like another reviewer said, a mixture of Ready Player One and The Emoji Movie, without the visual appeal of the first or the slightly redeemable pop-cultural references of the second. Ralph Breaks the Internet is too heavily reliant on tongue-in-cheek nudge-nudge references at the audience to create a semblance of a good story. The plot is overall lacking, with no central theme or thesis apparent. While the message that the movie wishes to send is readily obvious (a product of this movie's intended audience), it fails to deliver on that as well. Instead of showing the viewer what to think through provoking or resonant scenes, the movie chooses instead to deliver a musical number, out of place in a Wreck It Ralph movie, and to focus on Disney paraphernalia. The characters themselves seem not to develop much either. While they do eventually \"learn their lesson,\" nothing of value was transmitted to the viewer. All in all, if you enjoyed the Emoji Movie, this should be fine. Don't bring anyone you wish to later have positive relations with to this movie, for I assure you this will spoil any fine mood for the night and you will just go home thinking you just wasted $20. Child-friendly, yes. Adult bearable, ehhhhh sure why not. A good movie? Far from it. 3/10"
    },
    {
      "rating": "2",
      "text": "Top points for the imaginative way the Internet is depicted but everything else falls short. Just not as funny and memorable as the first. The characters are pretty dull, hardly any fix it felix and the writing isn't as sharp. For a film about game characters there's hardly any gaming or new gaming characters introduced. Also the title is misleading in the sense that Ralph only breaks the internet right at the end of the movie and you never get a sense of the real world panic that ensues. I was hoping you'd see everyone losing their minds. A real opportunity wasted in that sense. Mediocre is the right world for this. It's all topped off with a lashing of Disney sentimentality too as the plot becomes centered around relationship issues between friends and everyone has a good cry, yawn."
    },
    {
      "rating": "3",
      "text": "The movie was a narrative mess, full of loops and plots that lead nowhere, and even greater is the missed oportunities at every spot. It feels like a soul-less massive ad, where the brands are just plastered in your face with no real intention behind them other than \"hey it's the big brand that has offered more cash\". Even character cameos are missed oportunities (specially Sonic, who's only purpose is a brief exposition monkey with plenty of missed oportunities for jokes about SPEED and INTERNET).The music is so generic i was unable to recall any tunes right after i left the cinema when i was discussing it with friends.The motivations were weak at best, and everything was massively contrived and forced, and things that are complete non-issues. The representation and jokes about internet itself are also incredibly weak and dated, not to mention cringy and confusing. It's like some grandpa decided to make the script when he heard the word \"memes\" and \"youtubers\".And let's not talk about world originality, because it lacks it entirely: it's all big buildings and silly looking avatars walking around.And last but not least, it's a movie that is a sequel to a movie about games, for a movie about games, with characters that are videogame based, the gaming theme is completely Lost. There is one game in the entire internet and it's barely fleshed out, and you only know it's an online game and not an arcade because they show you two kids on their couches, literally, they act like only one or two gamers can be in the ENTIRE SERVER at the time, a game that should be like GTA, filled with different servers and thousands or millions of players, considering its popular and addictive enough that someone is willing to pay 40k for a car (and the players that attempted it and spent hours to get it didnt even look like your typical end-game character, so it adds more to the generic-ness and lack of understanding on online gaming of it all).Personally, avoid it even if its on Netflix, is not even bad in a funny way, it's bad in a boring and bland paste way."
    },
    {
      "rating": "6",
      "text": "Wasn't bad, although the most interesting part of the movie for sure was a 6 year old kid sitting behind me in the theater asking his mom if they could leave halfway through because he was bored."
    },
    {
      "rating": "2",
      "text": "was so looking forward to this loved the 1st one but after finally watching it i am so disappointed.1st they turned ralph into a youtuber the lamest culture on the planet. after getting through that your thinking it couldn't get any worse than that could it? Oh but it does your than treated with A LAME AF SONG sung by someone who is TONE DEATH! i literally had to skip the entire scene...what made the 1st one good is gone there is no comedy, no easter eggs, no chemistry and the whole movie is filled with lame AF internet pop culture the worst kind.if you loved the 1st one you will hate this.way to go destroying yet another franchise di$ney!"
    },
    {
      "rating": "2",
      "text": "Harsh review but I'm comparing it to great first Ralph movie. This one was dull, boring, too long... Jokes were way too simple and virtue-signalling is on overdrive in this one."
    },
    {
      "rating": "4",
      "text": "Ralph Breaks the Internet starts gamely, but quickly bogs down in the 2nd act with story decisions based on product placement for iconic Disney products.  The key to all animated Disney (Pixar) films is the dynamic relationship, and Ralph's and Vanellope's is lost in the barrage of Disney merchandising.  The average episode of \"Rick and Morty, Big Mouth, or One Punch Man\" packs in five times the laughs.   The first film was delightful, but \"Ralph Breaks the Internet\" always plays it safe, settling for family friendly mediocrity in an effort to build brand loyalty.   Kids may enjoy it, but adults will find most of the jokes falling flat, disappointing for a big release feature."
    },
    {
      "rating": "3",
      "text": "There is just something off putting about a 40 year-olds obsession with an 8 year-old as his best friend. Which is what this movie is about. Their \"friendship\""
    },
    {
      "rating": "4",
      "text": "Wreck-it Ralph was an uplifting movie based around video games. Ralph Breaks the Internet is.... something. Video games are just kinda somewhere in all this, not really any focus or anything. Of course they throw the Internet stuff around, but I don't think they did much research on some of the sites either. It's kinda mediocre at best."
    },
    {
      "rating": "6",
      "text": "The title should've spoiled it for me but yes Ralph doesn't only break the internet, He wrecks EVERYTHING! The movie's first 2 acts went along pretty good even if there wasn't much behind the gags but when it made it into its final act things started to turn for the worse. I really liked Gal Gadot's and Taraji P. Henson's roles, Shank and Yesss respectively. They both supported the movie but didn't take too much screen time away from Ralph and Vanellope. But that \"Slaughter Race\" game is what causes the 3rd act to fall so sharply. I think it was dragged on too far. It was almost 2 hours and that is entirely too long for a movie with not that much subject matter. It moved so quick in the first two acts that it's slow down in the third act was so much worse than it should've been. They also really had no idea what to do with Felix and Calhoun who have such a brief and non consequential addition to the story. The Disney part was cool but it was not very prevalent. At least if you watched the trailers. They shoved it down your throats and gave you little new things to discover. The princess's inclusion was very well sought out though. Overall Ralph and Vanellope work better as a duo which is why the third act fell so hard. Leaving the arcade was not the sweetest choice after all. It was gloriously pointless but hey at least this is gonna be a 2010s time capsule!"
    },
    {
      "rating": "2",
      "text": "Movie is colorful and plot starts off nicely. About halfway tru plot just disappears. Oh and its one big add for big corp. And full of feminist propaganda. Muh woman power! all men stupid, evil and incompetent."
    },
    {
      "rating": "1",
      "text": "I was upset that they only focused on how Ralph is being unreasonable. They never tried to focus on how selfish Vanellope was. She might not want to go back to her game but she ignores the other 15 racers that need a game. She just does not care and ditched Ralph. She did not even bother to let him know. Vanellope was a bad friend.﻿ 3rd wave Feminist cringe"
    },
    {
      "rating": "5",
      "text": "Disappointed. Unworthy & unnecessary sequel. This is not RALPH BREAKS THE INTERNET, this is RALPH BECOMES A YOUTUBER. I was interested in how would they use their own properties to present this movie, and they totally blew it. I am not sure who leaves 9 or 10/10 reviews here (maybe parents or blind fans?) but this movie was not OK. I really liked first one, heck I give 10/10 to Wreck it Ralph 1 right now, but this movie just used characters to re-create Emoji Movie, which was total crap.Beginning was rushed.Ralph was annoying.Product placement - the movie.Cringy YouTube video remakes and fortnite references.RALPH ONLY GOES INTO 1 game! This movie about video game characters and yet we only see 1 game! WTFThe \"Disney princess song\" was bad too.Woke-ass feminists princesses tried to \"joke about a man saving them\" which ironically comes from Rapunzel who was saved by a man... so what's the point?The message was good but badly done. Why Disney shows dark web so badly? Like it's a place where you can viruses? kids will google it after the movie. it's so wrong.It's sad how this movie wasn't good, i was hoping for it."
    },
    {
      "rating": "5",
      "text": "A slighlty better version of the Emoji Movie. A group of adults wanted to make a movie about the internet too many years to late. With outdated jokes and ideas that were not researched to make the jokes really hit. Without the Disney Princess` and the Disney style this movie would tank in score and box office."
    },
    {
      "rating": "3",
      "text": "The first movie had a central message: even outcasts are special. This one has none. Visualizing the internet is always cool and that gets 3 from me. Other than that, this movie was written by your local cool wine aunt who hated men ever since she found her boyfriend was cheating on her. Imagine not learning your lesson from star wars, get rekt Disney."
    },
    {
      "rating": "1",
      "text": "Social engineering to push PC agendas, that and the standard sexual jokes by disney pervade the movie so much. Disgusting. Why cant they just make normal movies anymore?"
    },
    {
      "rating": "3",
      "text": "Very disappointing, one of the dumbest animations and highly symptomatic of today's society."
    },
    {
      "rating": "6",
      "text": "This is mostly for the kids, pretty dumbed down, they even define Wifi and \"the internet\", but I continued watching because I wanted to see how they represented the internet. Would Facebook dominate? Would all the big names - Apple, Amazon, Google, Microsoft, Netflix - be represented, parodied? As it turns out, the internet was depicted as a space-age cityscape. It looks like Ebay bought the biggest sponsorship since they figured prominently in the story, though later, Disney got its play, mainly in the Disney Princess realm, so let me just say it now, this film seems really aimed at the daddy-daughter set. Google was represented as a high-rise office bldg where Ralph thought you got goggles. And I'm sure, much to Google's chagrin, \"The Search Bar\" was powered by fictional KnowsMore, and they used BuzzzTube vs YouTube (though the latter was referenced), so it looks like you only see a real-world representation if they paid the movie's production company for the ad-space, and the big names mentioned before were barely seen in the background if at all. Back to the story or rather the theme. As noted before, the key demographic for this is daddy-daughter and the prominent theme was the vicissitudes of kiddie friendship. A letdown for me."
    },
    {
      "rating": "6",
      "text": "I think the biggest issue I have with Wreck it Ralph 2 is the fact that the first movie pushed as many game recurrences as possible into the film and the second film pushed as many advertisements as possible into the game.I hope we see a third film that focuses on gaming and less on advertising like the second film did."
    },
    {
      "rating": "6",
      "text": "I love how the first movie teaches you about acceptance, contentment, and loving yourself for what you are, now throw everything the first movie taught you out the window because now going turbo and abandoning your kingdom with the possibility of being shut down permanently is now ok and without consequences whatsoever. Storywise the movie just basically revolves around ralph and ven trying to save her game while fan favorites like fix it felix and sgt calhoun are just relegated to sideline characters with no special purpose in the movie other than push an agenda that having kids are bad. We also have newcomers like shank and yesss which was introduced out of nowhere with barely any proper character development and they're basically just there to advance the story. The movie also has disney princesses which made the movie a bit interesting but mostly they were just there to also push an agenda that they don't need men to tell them what to do. Lastly there was really no proper villain in the movie other than the virus which only shows near the end. But all in all I can still say the movie is still ok but compared to the first movie this was a bit of a disappointment."
    },
    {
      "rating": "1",
      "text": "Just got done watching this movie. Wow, it was bad. I really enjoyed the first movie, but this one was just awful - seems like Disney is just going \"all in\" on the gender politics with their movies, even the cartoon ones now. Star Wars, MCU, and now the animated movies are 100% invested in feminism, making all men out to be the bad guys and the like. This was a terrible sequel. Cannot recommend."
    },
    {
      "rating": "3",
      "text": "UH OH ANOTHER BAD DISNEY MOVIE, my little brother wanted to see this **** when i already watched it and i told him this movie suck, this is a serious review okay and i just want to say that this movie has no soul all the character are stupid it trys to be sad when instead its just funny, like that time ralph was looking at the mean comments and there is sad music and its supposed to be very sad;-;. BUT no this makes me laugh LAUGH HARD okay there is nothing sad about that DISNEY maybe you wanted people to feel sad for Ralph because you wanted people to feel bad about you disney, because lots of people tell you your movies are **** and the new ones lately are crap DISNEY and you're like \"oh stop BEING MEAN with your comments\" and i'm like **** you disney why dont you stop making mediocre sequels and make good original movies HUH."
    },
    {
      "rating": "6",
      "text": "Ralph Breaks the Internet suffers from a lot of the same problems that I had with Wreck-It Ralph. There is more exploration of the world (which is something I wanted more of in the first one) and the inclusion of various brands and websites is awesome, but once again the story is just too simple and surface level for me. I get it; it's made for kids, but I was hoping for more."
    },
    {
      "rating": "5",
      "text": "From first impression, the internet concept worried me until watching the film. After watching the film, I can definitely say that it was not even close to as good as the first film. Ralph Breaks the internet is an average sequel to a fantastic Disney film. Fortunately, this film has fantastic animation as the internet looks great with very creative design and all the characters are full of life. I love how this film played around with most of its concepts. Although forced upon the audience, the message of friendship has a strong point.Unfortunately, this movie has several problems in the writing and characterization that ruin the film from being great. First, the story is a mess that becomes very predictable and completely breaks everything established in the first film by the third act. The film has an awful ending as Vanellope ditches Sugar Rush to be in Slaughter Race. This makes no sense and the character does not fit the tone of the game. Most of the humor is also weak with the exception of the princess scenes. A whole part of the plot has to do with Ralph making money off of stupid videos on a YouTube parody site made for the movie. In the first film, the use of video game characters lead to several great cameos, but nobody knows if these viral videos are going to be relevant in the next few years. While I did say the point of the message was strong, it feels like this film forces its message to its audience. I get that the film is about friendship, but the amount of times Ralph and Vanellope use the term \"best friend\" throughout the film is annoying. Also, Felix and Calhoun from the first film are completely forgotten here.Ralph Breaks the Internet is a disappointing sequel to one of my favorite Disney films. While the animation is excellent, the film has poor writing, bad characterization and a message forced upon the audience. This is definitely not one of the best films from Disney and it's a painfully average sequel."
    },
    {
      "rating": "4",
      "text": "Ralph's sequel moves almost entirely away from games and explores a visualized internet in the same way Inside Out visualized an emotional brain. I left feeling worse about the state of the internet, as the movie largely props up some somewhat sad trends:  1) Kids obsession with superficial fun (emoji's and silly shareable things, which is mostly fine) and 2) Kids idolization of internet popularity and fame, and the goal of gaining it through whatever means possible.I left feeling a mix of 'blah' and 'I've seen this before' - The finale, while computationally a feat, seemed more creepy than cool."
    },
    {
      "rating": "3",
      "text": "Stupid climax with actually talking and convincing the villain and full of left slogans like feminism and rescuing the men and adopting kids and etc. It's just a kids movie just let it alone.The beginning of the subject was interesting but how they worked it out was stupid and aimless just propaganda"
    },
    {
      "rating": "6",
      "text": "Ralph Breaks The Internet is an easier script than the previous one and without any polishing around the edges, the material is often chalky.Ralph Breaks The InternetJohnston and Moore's surf through the internet is free but definitely time consuming. Picking up from where we left these two characters, they had to create an almost newer dimension to fill in. And boy, did the writers came up with one. To capture an internet into a physical dimension itself scares you. It is a double edge sword though. It can be really easy as much as you are distracting the viewers. And since the glossy distraction in here is something that the audience is familiar- or in fact lives in it- it gets immensely effortless for them to hold us. Having said that, if not taken proper care of, and not worked on the details, it might come off as a one big hocum, which is what exactly happens in here.The script is definitely gripping and thoroughly entertaining. But the rich details that such animated feature usually contains, it lacks in aplenty. Aforementioned, the narration just surfs through the storyline and never digs deep, either the writers were afraid to open the vortex or just couldn't grasp it all in. Nevertheless, it still would have worked, if had better conversations, compelling arguments and genuine morale conflicts to bedazzle us.But what was once explored by Disney movies is left untouched in here. And with very little surface to walk on, it is still a smooth ride. In fact the concept has so much heart and potential in it, that the first hour of the narration is boost off by just visiting characters only. The structure of the script too is familiar to your usual Disney features. The performance cast though, ups the ante of the game. Revisiting their characters, Reilly and Silverman both are equally challenging on the screen. Their duo is a force to be reckoned with.His overprotective nature and her rebellious carefree attitude bodes well for the equation. And once again, the visual effects are jaw dropping, the artists do work a lot into it and it does pay off; this internet world projected in here is much more welcoming than the internet itself. Silverman's deep dive on mocking or updating the Disney princesses' sequence, is definitely the show stealer. One of the best bits of the storytelling is how it depicts both side of the range that this internet goes to. It shows you all the power there is by offering all the \"heart\" there is, within a snap. And it can also take all of it away with that snap itself.On that note, on that very message that is conveyed in here, the movie is a sure shot win. It also has possibly the least enthralling final acts of all. Where it was supposed to fiddle intellectually with the viewers, it instead puts up a behemoth physical stature to climb upon. It is not the most mature script ever to come across in a Disney world, but it surely is an entertaining one. Ralph Breaks The Internet is an easier script than the previous one and without any polishing around the edges, the material is often chalky."
    },
    {
      "rating": "5",
      "text": "The pros: It is beautifully animated and the improvements in fluidity and range for our main characters is a sight to behold. The cons: Most of the film feels pointless and meandering. The references to the internet and Disney IP are cringe-worthy, the jokes didn't land, and worst of all, the message that the film tries to promote in the third act goes against the established rules of the first film and feels out-of-character for Ralph and Vanellope. It pains me to write this because the first film holds such a big place in my heart, but this sequel is unfortunately, all dust."
    },
    {
      "rating": "4",
      "text": "John C. Reilly is back in the title role and he's joined by the spunky racer from last time (Sara Silverman). They venture outside of their safe video game world into the expanse of the internet, where numerous brands get their logos in animation. While the visuals are bright, colorful and dense, the extended one-on-one conversations between the 2 main characters drag down the fun. Some of the most enjoyable comic moments come from the bevy of Disney princesses as they play to and against stereotype. When there's action, the movie's entertaining, but there's too much slow, relationship development trying to instill positive messages. Stay thru the credits for 2 bonus clips."
    },
    {
      "rating": "6",
      "text": "The concept is quite simply brilliant, but after about an hour it seems to have played itself out. Adults may enjoy it more than children as it is too sophisticated for young kids to really understand. Let's face it isn't the Emoji Movie which was generally more enjoyable and probably easier for kids to digest. Flashes of brilliance abound, however."
    },
    {
      "rating": "4",
      "text": "I expected more from this movie. The first one its much better and this just looks like a cash grab with fan internet service and poorly written story. Got funny moments, but honestly, i didnt laugh at anything in the first 20 min of the movie. Everything is so bland. No great characters, no villian and the plot is just, boring. just disney ads everywhere. And when they enter the disney place is so cringe and so boring. Im mad how disney is just milking marvel and star wars franchises with their boring gags. The only funny thing on this movie was the post credits scenes. What a big letdown. Disney is not the same company that peaked years ago. their in a downfall. in quality and writing. Movies like finding dory, frozen, monsters U, cars etc are prime examples. and i could add more to the list. including this one."
    },
    {
      "rating": "4",
      "text": "Going into this movie i already knew this would be the emoji movie 2, wow look it's wreck it Ralph doing a funny fortnite dance, haha funny. what happened? the movie has amazing animation and overall the first half of the movie i found very enjoyable, but then ralph (without trying to spoil anything) he becomes a youtuber, and then it becomes one of the worst segments to ever exist in a disney movie, the second half becomes another emoji movie and feels like its 2 hours long, it has a good lesson in its story but man, they really push it out there, play a drinking game, every time they say \"insecurity\" take a shot, you would be in a coma, well scratch that you would be dead. bummer that this is a sequel to a near masterpiece."
    },
    {
      "rating": "4",
      "text": "Paid Promotion: The Movie.It wasn't awful, but not nearly as well made as the first."
    },
    {
      "rating": "6",
      "text": "An ok movie, but no more than that. The first one was full of video game references, however this one was full of internet references - basically advertising large companies such as facebook, amazon, ebay, etc. I didn't like the way they developed the female character who became really selfish towards the end whereas poor Ralph was reduced to a sidekick. Best scenes were with the Disney princesses, but of course as this is Disney they were there to push a feminist agenda. Gender/Race politics is all over Disney these days."
    },
    {
      "rating": "6",
      "text": "+Looks great in 4k HDR+I laughed+Great voice cast+Interesting characters/designs-Poor use of video game genre-Forgettable animated movie plot-Tropey tropes mctropeI had very low expectations going in but enjoyed this far more than I expected to. If you're a fan of the animated movie genre you will probably find something to enjoy here."
    },
    {
      "rating": "0",
      "text": "Feminists really do ruin everything. This kind of guy bashing trash makes me so happy we got a full refund."
    },
    {
      "rating": "9",
      "text": "First of all, the friendship between Ralph and Vanellope in this film is excellent. It felt like a real-life friendship between these two. They have their highs and their lows but in the end, they’re still the best of friends. Everybody can easily relate to these two’s friendship. I also really liked the animation in this film. Mainly with the little people in the internet. It was a really unique look in the film but was well chosen. The way the film showed the internet was fantastic. They didn’t hold anything back when it came to showing what happens online. Everything they experience everybody who uses the internet will have experienced at least once or twice in their lifetime. The humour in this film wasn’t overpowering which was great. There is humour in this film it’s not overbearing like some other animated kids films have. The final good thing I want to mention is the emotions this film brings. This film had me nearly crying towards the end. This once again can circle back to being able to relate and connect with these characters. Now onto some of the bad things in this film and to be honest there wasn’t a lot. One of my things is the pacing in the film. In the beginning of the film, it felt a bit to slow for me. Compared to the end which seemed a bit to fast. Nowhere in this film did it feel the correct pacing. Now I get and it’s a kids film so it has to quick to hold the kid's attention. The other thing was it including things that could have been taken out. I’m not going to say what it was but they showed stuff that could have been easily removed and it wouldn’t have affected it in the slightest. The last thing is the subplot. The subplot could have been taken out and made the film probably a bit shorter. In the end, Ralph Breaks the Internet is a great family movie with a great message. I highly recommend seeing this film."
    },
    {
      "rating": "6",
      "text": "I will not deny that this film still has all the Disney quality all over it. After all we're talking about Disney and this is a huge film for them, but frankly although I was entertained and I wasn't disappointed, this sequel feels disposable and with that word I don't mean that its quality is bad or that its quality is disposableThe problem is that I failed to see or feel any relevance in the story. It feels quite forced and reached a certain point the film becomes just a mere product placement exercise even beyond the emotional message behind it.The film is fun, the kids will definitely love it. Mainly because kids now know perfectly the internet world and all its ways, but the truth is that to me it didn't feel superior to the first one in any department or level and in the end it only remains as what it's now: A novelty but ultimately I think it will become a irrelevant sequel within the Disney catalogue."
    },
    {
      "rating": "5",
      "text": "( 53/100 ).No estoy enojado para nada, he tenido el honor de conocer el gusto a través del descaro que puede tener una película para impulsar la poca voluntad en los espectadores de exigir calidad en vez de contenido. Pero ¡Hey! También se necesita ingenio para qué, hasta su público más crítico, sucumba ante los cariños de una sátira bien hecha. No lo digo por mi, la mayoría lo confirma: Metacritic le da 71, IMDb 76 y Rotten Tomatoes, en medio de su chanchullo, le da 88, o 73, depende de donde se vea, y 63 por parte del público.Créanme, no soy ningún hater, ya confesé que me gustó la película, pero esa no es mi opinión total. Les advierto, los siguientes párrafos no serán totalmente amenos a éste nuevo proyecto de Disney.Ralph regresa con Vanellope a una aventura auto-impuesta y de una forma algo absurda en la que la pareja de amigos se ve en la necesidad de visitar el vasto mundo del Internet. Su gran diversidad y espacio seducirá y obstaculizará la fortaleza de la amistad que Ralph y Vanellope lograron en la película anterior.La decencia que tiene Ralph Breaks The Internet está en su sátira. El permiso que Disney le otorga a la película para burlarse de sí mismo es lo que le da formalidad, no solo a la película, sino a la transición moral que ha buscado y logrado la compañía en toda su historia. El dialogo y la presencia de las princesas de Disney generó una auto-crítica y una sátira con suficiente éxito como para aplaudir el hecho de que Disney no es solo una empresa productora de contenidos y experiencias, sino que también es un ente que crece poco a poco junto a su público; y el hecho de que se burle de sí mismo y le de paso a los personajes más icónicos de la historia de la animación a adaptarse, lo demuestra como una empresa que ha madurado y que no le molesta jugar con los errores de su pasado, pues ha aprendido de ellos y aspirará a ser lo más correcto posible.Sin embargo es triste que haya decidido hacerlo junto a una de sus formulas, ya, más añejas. La historia es un reciclaje más de las aventuras que tanto Disney como cualquier otra productora masiva ha presentado en sus historias más comerciales. Ese reciclaje presenta una historia que no solo ya es muy usual, sino que ya hasta parece tonta: El viaje de los protagonistas para salvarse que pone a prueba su amor o amistad para luego presentarlos como sus propios enemigos gracias a que se dejan llevar por el impulso personal y sin reflexionar en sus decisiones para que, al final, aprendan uno sobre el otro; dejar de tomar decisiones irresponsables, vencer los miedos o inseguridades propias y que la relación se fortalece por la distancia sino por la voluntad. No considero ésto un spoiler, pues son tantas las veces en las que los estudios cuasi monopólicos nos han presentado esta trayectoria. Tampoco estoy molesto, repito, el ingenio de la película está en que supo colocar una sátira bien realizada en un mal montaje, lo disfruté, pero no negaré que sin ese lado cómico, probablemente me hubiera enojado. En fin.Visualmente tampoco hay mucho espectáculo, pero sí mucho mercado. La animación de Walt Disney Animation Studios ha evolucionado inmensamente, y podrá no tener las mismas habilidades y valores que Pixar, pero nadie podrá dudar de su esfuerzo. Sin embargo una parte de mi quiere ser suficientemente cruel como para decirles \"Oigan, dejen de animar, hay quienes lo están haciendo mucho mejor, ayúdenles. O sorpréndanos. Hagan algo increíble e imprevisto que se gane el respeto de su público. Pero si se quedan en medio, estarán condenados a ser parte de un tumulto gigantesco de ideales imposibles de ubicar e innecesarios de recordar; la otra parte de mi prefiere solo ser indiferente a su existencia.En resumidas cuentas, Ralph Breaks The Internet es un juguete de cereal. Si escoges al cereal por el juguete, entonces el producto está haciendo algo mal. Pero vean el lado positivo, ¡lanza agüita! (el juguete)."
    },
    {
      "rating": "7",
      "text": "While it doesn't live up to the spirit charm of the first film it does have its moments of excitement. At its core Ralph breaks the Internet is about the relationship between Ralph and Vanellope which is a success even when the trip to the internet is just okay. Overall a solid to high 7 a B+."
    },
    {
      "rating": "5",
      "text": "Since first getting a Facebook account on August 2008, immediately before sophomore year of high school, my social media history has been an interesting one as it helped me tremendously with friendships. With ten years’ worth experience in the communal web, I can easily say Ralph Breaks the Internet can barely understand friendship, nor decide whether it prefers to sustain friendships in person or over technology. While there’s a place for it, the internet is also an easy place to start heated pointless arguments over whether Angelina Jolie or Alicia Vikander portrayed Lara Croft better.The problem is that this mega surface-level feature celebrates the fake glory of the impersonal digital saturation, giving greater development to the flat Disney princesses amplified by the trailers. The lack of real characterizations is covered up by blaring Demi Lovato’s “Let it Go“ rendition for the kids and throwing around pop culture gags for the parents. It isn’t always successful however, as some jokes, such as one 1960s Batman transition into princess pajamas, may bore parents with the inconsistent personality, while other pieces of dated media will confuse kids ten years from now. Other efforts to satisfy everyone with an otherwise fun musical number is less imaginative than any Disney classic readily available on Amazon Prime.While both Vanellope and Ralph do wind up tarnishing each other’s wobbly story arcs, everyone behind the microphones still express a new immersive side to social media, packed with one climactic animation achievement after another. While constant, the modern trends are still utilized to the best of the directors’ ability to push the plot forward, most effectively being the realistic graphics of modern online games that promise money. It sounds exactly how a civilized internet city would sound, including a “Which Disney Princess Are You” personality test interpreted as a game show, alongside some lickity-split live auctions at eBay. In between, the terrific Taraji P. Hensen, voice of the dysfunctional head running BuzzTube’s algorithms, graces the ears. It makes me anxious to see what LinkedIn would look like!These clever setups are all used to say that blocky video games ought to fear the internet, like how any  common experience on Facebook starts wonderous, then defies expectations after going deeper. It’s demonstrated by Ralph and Vanellope’s first cheery impressions past the WiFi, the scariest the public web gets being a couple of Stormtrooper guards inside Oh My Disney dot com. Needed humanity furiously breathes in the always happy static web, particularly an “Ask Groot Anything” panel that even then isn’t nearly as hilarious as a post-credit scene that serves as a punchline to various humans controlling these tacky cube-headed avatars. With that level of passion in creativity, it’s forgivable that Disney fails to point out more of their own princess clichés without briefly embracing some racist stereotypes.Now, just one last tidbit of praise before getting to the meat of this movie’s issue: Sarah Silverman’s adorable liveliness as Vanellope allows the sweet moments between her and Ralph to shine, especially when she starts nervously glitching. It contrasts Bill Hader’s quickly paced newspaper boy voice of a spam bot, which is just one of many details that springs the vast world to glowing life.Okay now, back to my Facebook account, I would still be lost today without its convenience of helping me acquire better interpersonal sympathy. Hence, my understanding of people far surpasses how these screenwriters understood the logic of their script, which I would argue even matches the logic of that weird 1993 live action Super Mario Bros. adaptation. For the sake of plot convenience, Vanellope successfully drives a new car for the very first time, a level of carelessness that removes depth from the newer characters. Not to mention Disney’s familiar emotional beats are here without any genuine screenwriting risks taken.Laws seem pretty loosey-goosey around the world of Ralph and Vanellope’s arcade, with the sole security between them and the WiFi being a few police lines. Heck, the whole reason the two must go into the web in the first place is because the Sugar Rush track drove itself, causing the wheel to break, a fracture that has never happened before in the history of arcade games. There’s also a virus creator with a tumor-twin who becomes a butt for predictable tumor puns, and can simply conjure up viruses on a whim; shouldn’t dangerous virtual threats then happen more frequently? While we’re at discussion about our own world, which seems to be the subject of this movie, how is it Wreck-It Ralph doesn’t exist… yet all other Disney properties do? Somebody please explain the confusion!"
    }
  ]
}