{"id": 849, "title": "Rambo", "starring": ["Sylvester Stallone", "Julie Benz"], "runtime": 92, "genre": ["Action", "Thriller"], "description": "When governments fail to act on behalf of captive missionaries, ex-Green Beret John James Rambo sets aside his peaceful existence along the Salween River in a war-torn region of Thailand to take action.  Although he's still haunted by violent memories of his time as a U.S. soldier during the Vietnam War, Rambo can hardly turn his back on the aid workers who so desperately need his help.", "releaseYear": "2008", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/r8LPeldxskHrGJTPfhICguCip2H.jpg", "categories": {"plot": 8.666666666666666, "acting": 4.166666666666667, "ending": 7.285714285714286, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 8.5, "action": 8.473684210526315}, "reviews": [{"rating": "5", "text": "Starts out pretty interesting, good even, but towards the ending it just gets so mindlessly dumb it falls short of being even somewhat noteworthy. Hard to rate, depends largely on whether or not the gore appeals to you. A 5 is be pretty generous with an ending like that, but I'll let it slide for the short time in which I thought the users were right and this might actually be well worth watching."}, {"rating": "8", "text": "I did enjoy this one a lot, even though I had heard bad reviews about it. I think it had nice action, quite intense and while maybe for some they didn't like that Rambo had more help here, I still it was great movie and that it also showed problems about Myanmar(Burma)"}, {"rating": "10", "text": "Most violent movie I've seen in recent memory. Shows the grotesque reality of war. Awesome action movie!"}, {"rating": "10", "text": "pretty gruesome stuff!!"}, {"rating": "10", "text": "In my opinion although it's more like a FACT, this movie was very well directed and written. It takes place in a very realistic environment and is in a very real life situation that could pass for something that still happens in 3rd world countries today. The action in the film is definately for true moviegoers and definately for Rambo fans. If you want fast paced, eye popping, jaw dropping, heart pumping action then this is the movie for you. I personaly think this movie should be enjoyed by all who know or dont know what great film-making is all about. I'd say congratulations Stallone on bringing a nice BANG to start 2008 and I hope there are more ideas in the works."}, {"rating": "9", "text": "Insane adrenaline rush action film that didn't need to make me think for me to thoroughly enjoy it."}, {"rating": "10", "text": "I cant even begin to explain how great this movie was."}, {"rating": "1", "text": "First Blood is a distant, distant memory. This movie is one giant bloody mess. Gone is an interesting story. Gone is any hint of excitement. Gone is the soul that existed in the first film. I wouldn't watch this again even if you payed me $50. Worst Movie I have ever seen in a theater."}, {"rating": "9", "text": "This movie was great due to the extreme action scenes. This movie is packed with dismemberments, 50 cal shells, and explosions. Richard Crenna would have would have gone a long way rounded out the film a bit better (RIP). However, the tight editing kept the action from mixing together into an incoherent mess. This is an action movie of course but it does bring the plight of the Karen people to light. It is hard to believe that some of these crimes against humanity are actually happening. Stallone brings the character of John Rambo around full circle and the body count is very high (246 kills) but this is rated R after all. Great movie, I can't wait for a sequel!!!"}, {"rating": "10", "text": "This really is an owesome movie!!! Be ready for heavy duty military action."}, {"rating": "10", "text": "U.S.A.! U.S.A.! This movie was simply amazing. It brought entertainment to the whole crowd. Everyone in the theatre was oo'ing and ah'ing and hell yeah'ing through the entire movie. Amazing."}, {"rating": "10", "text": "I would like to know how all these critics got their jobs. Because they are freaking idiots. This movie was Awesome. Any critic that says otherwise is an idiot."}, {"rating": "10", "text": "Excessively violence I suppose but being a Burmese person, being violent to an evil regime seems rather justified. As a movie though, I was not disappointed. I knew it was going to be violent and damn did it deliver. This is the most awesome Rambo movie, like he LIQUIDATES like a 100 soldiers. awesome."}, {"rating": "9", "text": "Excellent movie! Could have been half an hour longer but still delivers."}, {"rating": "9", "text": "Oh man. I went into this movie expecting very, very little. I was very, very surprised. Forgive my stereotyping, but I doubt this will be a movie you'd want to take your wife or girlfriend to, unless they loved Saving Private Ryan. The plot is perfect, what little plot there is, you at least feel like Rambo is fighting for something, not just pulling the trigger. You WANT him to take out the bad guys, and man, does he! Surprisingly well directed by Sly himself. Loved every minute. I gave it a 9 because, cmon it's Rambo-not Raiders of the Lost Ark."}, {"rating": "10", "text": "for all the people who thought this movie was going to be bad your so WRONG. this movie is pact with action,violence,gore. great movie 4 STARS!!!! deserves an Oscar. by far the best movie ive seen in a long time. those critics don't know anything there job is to destroy good movies. bastards. Stallone brilliant actor/director. LONG LIVE SYLVESTER STALLONE"}, {"rating": "10", "text": "One of my favourite movies, it really deserves more than it got. Great story and action, Stallone is really charismatic. An awesome finale to the series."}, {"rating": "10", "text": "Holy Crap that was awesome! In a culture that demands that everyone must be equally and pathetically feminine, I completely expected the critics to respond in the same spineless, limp way they always do. Heaven forbid a man act like one. Anyway don't worry, I'm sure watching one episode of \"Will and Grace\" will wash that mean man right out of your hair. For everybody else, keep them coming! There are some of us that still haven't found that feminine side yet."}, {"rating": "3", "text": "What's good about First Blood is that not only is it one of the best action movie of the 80s, it's also an emotional portrayal of the psychological after-effects of the Vietnam War. Rambo tries to re-integrate into society, the challenge that's face by many American veterans, and Stallone was brilliant as Rambo.\r After the success of the first film, it spins bad to mediocre sequels and Rambo is one of them. The war may be fictionalized but at least make it believable like First Blood. There is no new ideas in Rambo, just more mindless violence. A film that values money over imagination, fan boys just eat it up without even realizing that Rambo is not as deep as First Blood. Therefore, it's not as good.\r More violence, killing (236 guys) and gore doesn't make it good or better. The final action sequence is just stupid, it's just Rambo on a machine gun shooting down guys for about 10 minutes. Anyone could have come up with that! This is not the worst Rambo film, Rambo III is, but it does suck. Not seen Rambo: First Blood Part II but who cares, it's not highly cerebral."}, {"rating": "0", "text": "\"Rambo\" is the work of a desparate actor/filmmaker, who missed a golden opportunity to dig deep; to finally make amends with his big payday-motivated career choices and corresponding downward trajectory in popularity. The financially successful \"First Blood\", and its blockbuster follow-up, probably ruined his reputation as an actor like how \"Smokey & the Bandit\" made Burt Reynolds likewise, a washed-up A-lister, and industry laughingstock(before Paul Thomas Anderson's \"Boogie Nights\"). Instead of living up to his \"the next Marlon Brando\" billing, Sylvester Stallone made films like \"Over the Top\" and \"Tango & Cash\", which would later lead his nadir, \"Stop! Or My Mom Will Shoot\"(w/Estelle Getty). It wasn't until James Mangold's \"Copland\" did audiences remember that Sylvester Stallone was indeed an actor, not just a celebrity. \"Rambo\", to my disappointment, is no meditation on violence like \"Unforgiven\"(in which Clint Eastwood returned to the western as a older, wiser actor/filmmaker); this fourth installment of the John Rambo saga is shockingly reductive. What little artistry that remains in the mind's eye of this filmmaker, based on this witless display of bang, bang, bang, and ka-boom, was spent on the nostalgia-heavy \"Rocky Balboa\". The violence on display here is supposed to be justified by its social consciousness; its global citizenry duty of shedding light on the social upheaval in southern Asia. Yeah, right; as if this movie's target audience gives a rat's ass about Burma. \"Rambo\" is pared down to the genre's essentials; blood and explosions, made reprehensible by its purported dilligence in political awareness."}, {"rating": "3", "text": "Ultra violence and gore is campy now? What a waste of time. Stallone's worst acting performance, ever."}, {"rating": "5", "text": "As many of critics would say, it's a Rambo movie so don't be so serious. We take it serious because we waited and had high hopes for a new Rambo movie. Aside from violence, the substances that made the old movies great are missing."}, {"rating": "8", "text": "Rambo. A real hell of a place. Although the 4th film about John no longer catches the same stories as the previous films, this does not make it worse. This part is where the real MEAT happens. The final scene and the scene of the shooting of the village is great in terms of cinema and very terrible in terms of life."}, {"rating": "10", "text": "!!!amazing movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "10", "text": "Went with my dad & son for a Saturday afternoon at the movies. My son picked Rambo, I had little to no expectations. This is an excellent action film, very well done, from the cinematography to the sound, direction, script, special effects, and acting. Of course if this not your favorite movie genre & you don't like Stallone stay away, but please leave your bogus comments to yourself."}, {"rating": "9", "text": "just saw it as the fourth movie in a Rambo marathon, and even after the first three, it stands out for being crazy violent. really fun, really good, nice way to say goodbye to an 80s icon."}, {"rating": "10", "text": "Saw the movie lastnight! just as Thomas said! absolutly amazing...explosions,mindless gruesome violence and manliness! none of the censor-board-safe-good-for-my-child!loved the movie!"}, {"rating": "10", "text": "Rambo kicked my ASS! A great finale to the series."}, {"rating": "10", "text": "The best thing about this movie is that it depicts what's going on in Myanmar(albeit a little bit exaggerated). Sure... it doesn't have the critic-appealing factors in movies like Children of Men but IMO, the best movies are the ones that stick in your head and stays in your mind (i even heard guys whistling to the Rambo tune in the washroom after the movie)...and Rambo 4 definitely leaves a lasting impact. Great movie to watch if you have the balls for it. To me, it really made me look at the Myanmar situation seriously. And for that alone, this movie deserves a perfect 10."}, {"rating": "10", "text": "Much more like first blood than its sequels. This is by far the best Rambo since first blood. and boy is it violent. You like action.....than don't miss Rambo."}, {"rating": "10", "text": "John Rambo is a real action movie.Probably the best. The movie have a deep message and is outstanding.Maybe the critics wants to see in John Rambo a love movie well its not, its a masterpiece. This is the best Rambo ."}, {"rating": "9", "text": "I really enjoyed it. Stallone is a man with moral as well as physical courage--he has the cajones to say that when dealing with evil men it takes more than appealing to their better nature."}, {"rating": "7", "text": "It could be as good as \"First Blood\", but the need to show flying limbs and \"strong lines\" it's way down. I like many things on this movie, and surely is in par with Rambo II. Maybe it's a cross genre, a homage or Sly only wanted to show all his fury and hatred. For an action movie, maybe we couldn't ask for more. But man, this is not Commando. This is not Delta Force. This is John Rambo, and he deserve some respect... since Rambo III, actually. Sometimes the violence is necessary. Sometimes, we want to and we need to see it happening to feel a little confort while the bad guys are dying. But sometimes, just sometimes, we want to imagine, and Sly doesn't open this window for us. Let's hope in the next episode of Rambo, Sly forget about the excess, think about better lines, and gives us what John Rambo wants to tell."}, {"rating": "9", "text": "Fantastic movie. While it may be a bit gorey, this is reality over there. A Rambo shoot em up with a political message. Couldn't have done a much better job. The critics have officially lost their minds."}, {"rating": "9", "text": "Sly is back on top after a slight misstep with 06's Balboa. An almost perfect movie if it wasn't for the score. If Sly would have brought in his brother Frankie to do the music, this would have been a perfect 10!"}, {"rating": "10", "text": "It's Rambo. Based on the Rating: \"R for strong graphic bloody violence, sexual assaults, grisly images and language\" It is everything Rambo is about, it doesn't need a story, just 1 and a half hours of mindless violence, explosions and manliness. Can't wait for the UK release!"}, {"rating": "10", "text": "oscar worthy, eh..no brining back the true legacy of Rambo, yes! this will turn into a cult class, mark my words a definite fan pleaser"}, {"rating": "10", "text": "This movie kicks ASS!!! It did not disappoint. It's everything that a Rambo movie should be, it's the most surrealistic violence since Saving Private Ryan. Stallone knows how to end a series..."}, {"rating": "9", "text": "It's great to see John back....Stallone has excelled again in direction after Rocky Balboa....a treat to Rambo fans."}, {"rating": "9", "text": "Don't bring your girlfriend - go to a bar and have a few with your buds and prepare to be blown away by some of the most graphic combat scenes every to make the screen! There are some classic one-liners by Rambo and if you can accept the movie for what it is...you will enjoy the ride of your life! P.S. Bring a helmet..."}, {"rating": "10", "text": "Why did the Philadelphia Inquirer give it such a low score and such a positive comment? I'd be disappointed if the critics liked this one."}, {"rating": "10", "text": "This was the BEST action film I've seen in 20 years!!! It's nice to see a movie made for guys who wear their balls with pride!!!"}, {"rating": "9", "text": "WOW, i expected garbage, but came out surprised and pleased...lol...lots of action, very intense at times...the bad guys are reallly bad, which makes it that much more exciting when rambo takes them out.......funniest part...KING KOBRAA!"}, {"rating": "10", "text": "A fantastic and highly entertaining move. What a rush! More manliness than critics can handle. We need more rambo! Sylvester, give us another!"}, {"rating": "10", "text": "Great movie to kick off the year. 1.5 hours of blood and explosions, that's what Rambo is all about!"}, {"rating": "9", "text": "That Philadelphia Inquirer review made me want to see it more."}, {"rating": "9", "text": "Rambo got me emotionally involved. A strong American kicking some butt that deserved it. A movie like this has been long over due. Thank you Sly."}, {"rating": "10", "text": "It's funny looking at the \"professional reviewers\" compared to the viewers. They are not allowed to say they liked this movie. It was a blast. It was Rambo. He shows up, kicks the crap out of 200 guys, and goes home. I really loved it."}, {"rating": "7", "text": "The best part of this movie, which is an absolute meat grinder (like the first 20 minutes of \"Saving Private Ryan\" on steroids - with about 20 carbon copies of Mau from \"The Deer Hunter\" thrown in for good measure), was the fact that just about everyone in my theater in Marina Del Rey - all dudes, of coruse - was talking or yelling at the screen pretty much throughout every action scene. Stuff like, \"Oh, yeah, that dude NEEDs killin\". When somebody's head flies off, or 3 or 4 dudes simultaneously liquify around a Claymore, the theater just erupted. It was a pretty darned good time. Not nearly as much story as First Blood I or II, but I'd compare Rambo to \"Rocky Balboa\" - a reminder of how cool the series was - a celebration of the series with some over-the-top mayhem. All I know is that the Burmese can't be too happy with their portrayal in this - I don't think ever a group of \"bad guys\" has looked this bad. Oh well, they all get killed anyway."}, {"rating": "10", "text": "I am not sure if critics even know what to look for in a movie. I realize in today's politically correct non emasculating society that we live in that a action hero is not popular. But, in this case, they are incredibly wrong, Rambo freaking rocks."}], "recommendations": ["rambo_last_blood", "underworld_blood_wars", "the_condemned", "machete", "death_wish", "kick_ass", "the_expendables_2", "polar", "crank_high_voltage", "live_free_or_die_hard", "ninja_assassin", "peppermint", "salt", "punisher_war_zone", "doomsday", "the_tax_collector", "four_brothers", "i_am_number_four", "underworld_evolution", "the_marine", "eagle_eye", "death_race", "the_expendables", "rambo_first_blood_part_ii", "crank"]}