{
  "id": 615,
  "title": "Rambo: Last Blood",
  "starring": [
    "Sylvester Stallone",
    "Paz Vega"
  ],
  "runtime": 89,
  "genre": [
    "Action",
    "Thriller",
    "Drama"
  ],
  "description": "After fighting his demons for decades, John Rambo now lives in peace on his family ranch in Arizona, but his rest is interrupted when Gabriela, the granddaughter of his housekeeper María, disappears after crossing the border into Mexico to meet her biological father. Rambo, who has become a true father figure for Gabriela over the years, undertakes a desperate and dangerous journey to find her.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kTQ3J8oTTKofAVLYnds2cHUz9KO.jpg",
  "categories": {
    "plot": 7.944444444444445,
    "acting": 7.875,
    "ending": 7.444444444444445,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 8.384615384615385
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I was not expecting a good movies because the reviews were bad and biased. I watched today and i'm very surprised. Stallone was born to be Rambo, the actions, the explosions, and the script was all impeccable. I recommend you watch. Thank you Stallone for the moments of intertainment!"
    },
    {
      "rating": "10",
      "text": "A must for any die hard Rambo fan.  Probably the best action flick of the year and was well worth the price of admission!"
    },
    {
      "rating": "8",
      "text": "This is a F * CKING JOHN RAMBO movie, did you happen to want some political morality or no violence? Rambo Last Blood is a great old-fashioned action movie, so if you were expecting anything other than \"Shot, Punch, Bomb and Blood\", then you're wrong."
    },
    {
      "rating": "9",
      "text": "The legend never quit fighting rambo aka sylvesterstallone is still rock solid action star !! This one will be a good entertainment to the fan boys and girls and to violent action lovers !!Enough story, engaging screenplay and good ambience background score work and energetic and fierce performance from Sylvester Stallone Warning is violence is extreme here!! Note it!For me as fanboy rambolastblood statisfied me much :)"
    },
    {
      "rating": "10",
      "text": "Dont listen to the critics and their so called expert reviews. The movie is a entertainer and it does that job well."
    },
    {
      "rating": "9",
      "text": "Really enjoyed this film. Stallone is great, other acting is very decent. A great action movie, with a terrific ending, and a surprisingly half decent story line. A fitting final tribute to the franchise. Ignore the politically correct snowflake movie press. This is what an action film should be, and it’s action the whole way through, albeit very violent, so not one for the kids. One of my favourite films from 2019. I saw it in the big screen, just enjoyed it again on TV download."
    },
    {
      "rating": "7",
      "text": "John Rambo with a quite a bit of over the top gore. Nothing to really put me off in this action movie. The story isn't terribly original or clever, but it's probably the best Rambo-movie you'll ever see."
    },
    {
      "rating": "9",
      "text": "I am so glad, that this was not another toy-pistol shooter. Feel like I was in a 90-s today. Worth it."
    },
    {
      "rating": "10",
      "text": "excelente pelicula muy entretenida y muy GORE!! una historia muy interesante que esta actualmente pasando en Mexico acerca de los Narcos"
    },
    {
      "rating": "10",
      "text": "A real movie finally compare to the garbage Hollywood and Disney makes!! These no PC rubbish in it or dysfunctional \"girl power\" rubbish as well. Characters act normal (muscular men, feminine women). It's nearly impossible for Hollywood to produce \"normal\" characters today."
    },
    {
      "rating": "7",
      "text": "It's not a bad storyline, good acting, gore and great actions. It's a sad ending but rambo is alive and well. It would have been a much better ending if she is alive and i would rate it 9/10 instead of 7. I guess this movie sends us a message \"life sucks\""
    },
    {
      "rating": "8",
      "text": "Rambo: Last Blood is partly an action film but also a good crime thriller in my opinion. The action scenes are bad ass and when there isn't any action the story is still intriguing and suspenseful. Overall a good movie."
    },
    {
      "rating": "10",
      "text": "Masterpiece ❤️❤️❤️❤️ I loved it very much, the story of the fifth movie its very important to us to know what's happened with John Rambo after the wars, and it's different from the past movies because that what the story is, why the critics hated it, because they aren't Rambo fans, we are. 10/10 Thank you Mr. #SYLVESTERSTALLONE FOR THIS EMOTIONAL MASTERPIECE"
    },
    {
      "rating": "9",
      "text": "Screw the reviewers.   These are the same liberal idiots that certified ghostbusters reboot and the last jedi as fresh.   The reality is that a movie like this upsets the democrat narrative of open borders for all.   Notice that the user scores are the exact opposite?"
    },
    {
      "rating": "8",
      "text": "What a great end to an iconic franchise. Blood, pain, justice, explosions.  It's not the best Rambo, but a great one."
    },
    {
      "rating": "7",
      "text": "Glorious, over-the-top violence, that brings as much laughs as gasps.A narrative so bad it serves to do nothing more than justify the gore.Choca-block full of stereotypes, bad acting and shoddy CGI.What more could you ask for, or expect?"
    },
    {
      "rating": "8",
      "text": "Nostalgico assistir mais uma vez o rambo matar os vilões, apesar de serem bem genericos"
    },
    {
      "rating": "7",
      "text": "Rambo The Last Blood fue una película muy buena, demasiado... Después de Rambo 3 y Rambo 2008 no me esperaba que la saga mejorara tanto, incluso tornándose entre mis favoritas de la saga y del genero! Si bien en cierta medida se siente distinta a las anteriores, al no centrarse tanto en la guerra y mas que nada en cuestiones familiares, al final la película resulta agarrar muchas cosas de la primera película, cosa que me encanto. Tiene una historia emotiva, y al final la acción deja un buen sabor de boca, teniendo una de las escenas mas intensas de toda la saga. Y si bien en algunas partes es medio exagerado, no llega al nivel de irrealismo y de malos efectos especiales de Rambo 2008.Aunque nunca se sabe como es que los mexicanos encuentran a Rambo (a lo mejor el les dejo una dirección en la foto), y la historia en si tampoco es tan original. Sin embargo, agarra las mejores cosas de la saga y del genero para hacer algo muy disfrutable. No considero que sea la mejor de la saga; la primera tiene personajes tan memorables y una historia muy buena, pero no tiene nada que envidiarle. Totalmente recomendada."
    },
    {
      "rating": "6",
      "text": "The movie is EXACTLY what you expect it to be.  Stallone and his team did not set out to make a masterpiece; they just want to entertain, deliver the goods, and they succeed.  My only quibble is the use of Paz Vega, a legitimate actress: why did she sign on when she knew she would be wasted?"
    },
    {
      "rating": "10",
      "text": "Ignore the critics and those who have grown up snowflakes. While it's not \"Rambo\" in the sense of a guy running through a jungle with a gun or whatever, it's a solid movie that kept me entertained from beginning to end and it's easily Sly's best film out of his most recent ones. It also has a message to the movie that a lot of people don't seem to like but is completely acceptable. Solid watch."
    },
    {
      "rating": "5",
      "text": "Decent film, Sly Stallone works his ass off to make this work.. The action scenes are cool and the kills are jaw droppingly violent and over the top. The last half of the movie almost reminded me a bit of a twisted version of Home Alone due to all the traps he uses to kill people. The main issue is THERES NO STORY or if there was it could have been done alot better. It's still worth a watch if you're a fan of the series and action movies"
    },
    {
      "rating": "7",
      "text": "Not nearly as bad as critics made it out to be. But there is just to much set up and not enough payoff. It really takes a while to get going but ends with a bang just like the last Rambo movie. I was not disappointed, maybe it could have been better, but it's Rambo and you know what to expect overall. Script could have been a bit tighter overall and it's really slow for nearly the entire first half of the movie. Worth a view for sure."
    },
    {
      "rating": "5",
      "text": "Well \"Rambo Last Blood\" has all the staples of the franchies, nonstop violence and a straight forward plot that's predictable, having watched all the other four movies and what they achieved, some were bad and some have cult state, I went into this not expecting a whole lot, to be honest, I watched for the trademark killing scenes, you just can't get enough of Rambo blowing **** up and killing people in a creative way.There isn't much to be said here other than the obvious, they had to end it somehow I guess."
    },
    {
      "rating": "7",
      "text": "Don't read the reviews by critics, they just wanted politics in this Rambo movie. Yeah, crazy right? This movie imo is almost as good as Rambo 4."
    },
    {
      "rating": "5",
      "text": "Um filme sem alma, sem inspiração. O primeiro arco do filme foca muito no desenvolvimento do Rambo como um personagem humano, com medos, traumas e arrependimentos. O problema é que isso entra em contradição visto que a \"narrativa\" é abandonada rapidamente, e o pouco tempo de construção de personagem é feita de forma superficial. O problema disso é que todo o nosso sentimento pelo personagem se torna inexistente. Você não liga se ele morre ou vive. O mesmo vale para a adolescente, que não condiz com a personalidade de uma, e os vilões super caricatos. Inclusive, o plot que se torna o motivo pelo qual ele quer matar os caras é super previsível.O segundo ponto são as cenas de ação. Eu não assisti aos filmes antecessores, mas acredito que esse tema stealth seja uma característica do personagem, mas isso não é uma desculpa para cenas tão mortas cinematograficamente. Como eu disse a principio: você não liga pra quem vive ou morre. Toda aflição que poderia ser alcançada foi extremamente desperdiçada. Sem contar que esse modelo de combate poderia ser mais explorado aqui, saindo do mais do mesmo pra uma nova forma de mostrar o que está acontecendo."
    },
    {
      "rating": "3",
      "text": "For me it was extremly boring and finaly when some action came in it was 15 minutes before end. It was the avarage movie about revange and defending the last thing that left for main character that everybody already saw at least once."
    },
    {
      "rating": "8",
      "text": "Great time watching voilently driven plot with little hinge of story yet great satisfaction!satisfy to see rambo as last outing with this movie i really love action and acting of everyone as per the run time is concerned screenplay and score were great!a must watch as per actions!with little run time comes with a action makes memorable farewell to franchise!"
    },
    {
      "rating": "10",
      "text": "Finally a good old action flick... No sjw **** Just a good popcorn movie, like in the old days.. Don't listen to the bluehaired critics. One of the best movies last year"
    },
    {
      "rating": "7",
      "text": "While I didn't enjoy some of the plot elements and the more shallow acting from Stallone himself, Last Blood stands out to me as one of the most enjoyable and brutal action flicks to grace the screen this year. The film is littered with ultra-violent set pieces and manages to keep a brisk pace while the carnage spews on-screen. The story is half-baked and the script leaves much to be desired, but that's exactly why this series is not for everyone to enjoy. But for the sickos (like me), this one is a bloody and brutally fun ride from start to finish."
    },
    {
      "rating": "4",
      "text": "How could users love this movie ?!?!?!I mean haven't we had enough of solo heroic movies?!?! I miss something meaningful from America these days..."
    },
    {
      "rating": "10",
      "text": "As a long time Rambo fan, this movie was amazing, i don't understand why review disliked it so much... We actually se so much about the character and his inner struggle and what is doing"
    },
    {
      "rating": "6",
      "text": "Not terrible but kind of empty. It’s better than most of the other Rambos except First Blood."
    },
    {
      "rating": "7",
      "text": "This movie is Awesome and this movie has lots of action!! I never had any problems with this movie only thing is seem like was too short to me !!"
    },
    {
      "rating": "10",
      "text": "This is a great movie, don't listen to those fragile, easily offended critics"
    },
    {
      "rating": "10",
      "text": "Awesome to see Rambo back in the saddle. Really good action movie because everyone involved sought out to make... a really good action movie. If you're looking for a rom-com, superheroes in tights, or some faux-intellectual sociopolitical commentary, look elsewhere."
    },
    {
      "rating": "10",
      "text": "Best Rambo movie ever !! Everything we would like to see in a Stallone movie"
    },
    {
      "rating": "10",
      "text": "73-year-old Stallone shows he still has the energy to play this great movie character."
    },
    {
      "rating": "10",
      "text": "its good papi, go and watch it.i wont tell spoilers but you probably can imagine what will happen with the title like \"last blood\" if you watched and liked first blood, this is a must for you."
    },
    {
      "rating": "10",
      "text": "Love Rambo movies. Since the First one. So I have read the book and love ir more. In this one, you feel the hate and bagging for gore."
    },
    {
      "rating": "10",
      "text": "Seems these reviewers are more interested in reviewing the Rambo movie they would have made (if they had the talent to actually make one) than the movie we got. Sorry, this one isn't about making a profound political statement or circling back to the original film. This is about giving the audience more of what they want and it succeeds in spades. Great action, solid story and STALLONE still has it. No need to put political spin to this one, it's pure Rambo fun. Highly recommended."
    },
    {
      "rating": "10",
      "text": "Again... I really wonder how anybody can rely on \"professional\" critics nowadays. Just look at how users rate it vs. professionals rate it.This is getting rediculous! I've stopped reading reviews for movies, games etc. a while ago. And I urge you to do too - don't waste your time. It's obsolete."
    },
    {
      "rating": "10",
      "text": "Its getting to the point that the official reviewer's should be just mixed in with everyone else. Completely unreliable.You enjoy action flicks or classic stars like Stallone and Schwarzennegger?  Then guess what...your going to enjoy this movie.  Great action and even the story is better then your average boom flick."
    },
    {
      "rating": "10",
      "text": "Fight, explosions, kills, guns, knifes... Forever Rambo. The best film of the 2019."
    },
    {
      "rating": "9",
      "text": "Awesome action movie. Stallone can still play in really good action.Can only recommend it."
    },
    {
      "rating": "10",
      "text": "Everything I wanted from the film... Stallone gave another great performance, let's not forget the man is in his 70's! I can only assume the critics are anti Trump and this film is certainly pro wall! Listen to the users not the Hollywood bias."
    },
    {
      "rating": "10",
      "text": "Its a great movie! I was surprised since all 'journalists' and 'critics' kept talking badly about it! Sly is awesome in this! I had a great time watching it and highly recommend it."
    },
    {
      "rating": "10",
      "text": "Great old school action flick,I don’t know why those critics hate it so much,it is a great movie"
    },
    {
      "rating": "10",
      "text": "Its a Rambo movie. Havent seen a good action flick in a while this did not dissapoint."
    },
    {
      "rating": "10",
      "text": "I see the snowflake critics decided to burn the movie, cant wait to see it tonight, should be real good."
    },
    {
      "rating": "9",
      "text": "This movie was made for Rambo fans.  It delivers what they would want.  This is not a straight to video like Escape Plan 2.  Surprisingly solid production values."
    }
  ],
  "recommendations": [
    "rambo",
    "underworld_evolution",
    "eagle_eye",
    "bright",
    "hercules",
    "the_a_team",
    "the_expendables",
    "the_marine",
    "polar",
    "rambo_first_blood_part_ii",
    "underworld_awakening",
    "underworld_blood_wars",
    "the_expendables_2",
    "red_dawn",
    "venom_let_there_be_carnage",
    "ninja_assassin",
    "i_am_number_four",
    "predator",
    "punisher_war_zone",
    "crank_high_voltage",
    "the_expendables_3",
    "salt",
    "gamer",
    "gods_of_egypt",
    "gemini_man"
  ]
}