{
  "id": 1843,
  "title": "Rambo III",
  "starring": [
    "Sylvester Stallone",
    "Richard Crenna"
  ],
  "runtime": 102,
  "genre": [
    "Action",
    "Adventure",
    "Thriller",
    "War"
  ],
  "description": "Combat has taken its toll on Rambo, but he's finally begun to find inner peace in a monastery. When Rambo's friend and mentor Col. Trautman asks for his help on a top secret mission to Afghanistan, Rambo declines but must reconsider when Trautman is captured.",
  "releaseYear": "1988",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/UJvIpryPRrstX4nhOKg7VRk3k2.jpg",
  "categories": {
    "plot": 8.428571428571429,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 6.9375
  },
  "reviews": [
    {
      "rating": "1",
      "text": "I quite liked First Blood made in 1982, First Blood part II was stupid but okay.. Then Rambo III was made and it's a stinker especially when a tank is blown up with Rambo inside and he gets out uninjured. Sylvester Stallone's worst if not one of the worst Rambo films ever made. So unrealistic and too violent it's a real insult to not only Stallone but the viewer. Not only is the action scenes unrealistic and stupid but Rambo III is a very boring film and even the action can't save it. A massive failure from Sylvester Stallone and an awful film!"
    },
    {
      "rating": "7",
      "text": "I still enjoyed this, even though I understand why it is less liked as others in original trilogy, but to me it was still interesting. For people saying it is propaganda film etc, in a way all Rambo movies where, you don't have to treat them as history. I actually think it would be more weird for Americans now this movie than when it was released, since all the problems with Afghanistan"
    },
    {
      "rating": "7",
      "text": "Rambo III ... well, the jumping doll. It was a cut. One had great action, but two shoved it into her pocket and it was nothing. But the third part gave it a crown, because this is a really INCREDIBLE action room! A story in style, as in previous films. Something has been talked about for a while. But it doesn't take long and Rambo gets the mission. From now on, the film is the event itself, which is perhaps the best in the series. Maybe I also liked it because we are in the desert in the film and I love the deserts, especially the action passages in them. I don't have much to add to this. The film is quite far from number one. It is more like a double, but it still surpasses it in action and thus created a luxurious spectacle that could explode everywhere. Lovers of action just do it. Don't expect fans of quality stories from this film. For me, a good film that I recommend."
    },
    {
      "rating": "0",
      "text": "Stupid propagandise Film, about evil russian and 'kind' and 'justiсe' americans.This film not history and it show russian pepople bad orcs. I recomend this film for nazi and russphobs."
    },
    {
      "rating": "10",
      "text": "What is one of the most cliche things in action movies? In the middle of the rush, the hero finds a badass woman to save and it stops the action scenes for more dramatic speeches. Well, Rambo III has no girls. And it has no stop either. Even the scene that Rambo is enjoying a game with horses is interrupted by hellicopters, bombs and explosions. So, what else do you need? It's an awesome mindless rush of shootings. Let me put this on other way: Do you know that scene on Rambo: First Blood Part II that Stallone enters the hangar with a M60 and shoots the hell out of computers and displays? It's that with people instead of screens and 102-min long."
    },
    {
      "rating": "8",
      "text": "7.5\rThis film is a wild and dull rip off of lawrence of arabia\rbut you know? this film is pure entertaintment\r.yeah,it´s stupid,but is intense\rand the stupidity make this film more interesting. the action sequences are amazing.\rYou can´t expect anything else from sly\rit´s so savage and over the top that make you laugh"
    },
    {
      "rating": "10",
      "text": "Rambo 3.....why would this be bad?...it's Rambo!"
    },
    {
      "rating": "10",
      "text": "Rambo agora terá que resgatar seu fiel amigo e superior Coronel Trautman,que comandou uma missão de impedir a invasão do Afeganistão pelos Soviéticos,porém fracassou e acabou sendo torturado pelo comandante Soviético Zaysen,agora rambo sozinho terá que enfrentar um exército gigante e bem armados por um fiel amigo."
    },
    {
      "rating": "6",
      "text": "Rambo 3 has lots of action but it can't beat my personal favorite First Blood Part 2. I don't like Afghanistan as the main setting as much as Vietnam. Rambo is just as badass as ever. If you liked the first two, chances are that you'll like this one as well."
    },
    {
      "rating": "10",
      "text": "Stupidly underrated same as Rambo II (1985), And the story about that the film don't have story & plot is **** like Stallone action films of 80's, Van Damme action films 90's, and other actions films of 80's 90's and Michael Bay movies"
    },
    {
      "rating": "10",
      "text": "...............................................................................A Great Action Adventure Movie................................................................Rambo III (1988)"
    },
    {
      "rating": "7",
      "text": "Rambo III. The war won't let go. Vietnam is over and now there is a new time and a new war, and no matter how John wants it, she also takes him to her. There are no big differences from the second film. Only the scenery has changed. Perhaps Rambo himself has changed. In the second film he was more secretive, in the third film he is the real Terminator."
    },
    {
      "rating": "10",
      "text": "My favourite in the franchise!!! Such an underrated movie! Don’t sleep on this one! You will have a good time with this movie!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "!!!amazing movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "6",
      "text": "Gets points for being totally crazy, this action fest is in the so bad its good box."
    },
    {
      "rating": "5",
      "text": "This one is even worse than the 2nd: One man against a little army equipped with tanks and helicopters. So there are many unrealistic scenes. Of course Rambo = USA is good, this time Sowjets are bad. So yes the movie is propaganda.There are no interesting characters, the story is simple. So in the end the movie is only about action and this is not bad."
    },
    {
      "rating": "6",
      "text": "Rambo 3 se nota demasiado inspirada en Rambo 2, y es que ese es su principal problema, ya que le falta innovar bastante (incluso los antagonistas de ambas son rusos y se parecen bastante muchas de las situaciones de ambas). Aun asi, las escenas de acción estuvieron a la altura como siempre y Rambo sigue siendo super carismático, aunque creo que la actuación de Truntman dejo bastante que desear. Buena película, pero en mi opinión es la peor de la trilogía."
    },
    {
      "rating": "6",
      "text": "A step up from First Blood Part II, this film is funnier and less ridiculous (if only a little) than its predecessor."
    },
    {
      "rating": "10",
      "text": "If your wondering why the soldiers are missing this much is because of how muscular and shiny Rambo is"
    }
  ]
}