{"id": 1097, "title": "Rambo: First Blood Part II", "starring": ["Sylvester Stallone", "Richard Crenna"], "runtime": 96, "genre": ["Action", "Adventure", "Thriller", "War"], "description": "John Rambo is released from prison by the government for a top-secret covert mission to the last place on Earth he'd want to return - the jungles of Vietnam.", "releaseYear": "1985", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/pzPdwOitmTleVE3YPMfIQgLh84p.jpg", "categories": {"plot": 7.333333333333333, "acting": 7.666666666666667, "ending": 7.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.3}, "reviews": [{"rating": "7", "text": "Rambo: First Blood Part II builds on the previous part and more or less repeats what the previous film did. Some introduction. A little chatter and then before you know it, there are explosions, bullets on the screen ... everything is possible. In short, it doesn't take long and the film is the action itself, but better this time. Much better! Maybe unrealistic from Rambo's point of view, how strong he is and what he can survive, but perhaps no one minds. If you liked the first film, I wouldn't hesitate and started the second one. For lovers of the event a delight for the eyes. Those looking for a deeper story will probably be disappointed. It's mainly about the event, which was already the first film, but the second underlined it many times over. For me, a good film that I recommend."}, {"rating": "10", "text": "One of the best in its genre. Outstanding ost by Jerry Goldsmith and very good acting by Stallone."}, {"rating": "8", "text": "Rambo's first excursion on our screen is a hard-straight drama with periods of action. This is an action film with a heart and a fine turn by Sylvester Stallone. The screenplay was smart enough to recognize that Rambo's appeal was not limited to his huge biceps and ability to mow down legions of bad guys with a really big gun. In First Blood, Rambo is a victim. In the three sequels, he is \"redeemed\" and transformed into a hero. First Blood has a moral compass; the subsequent entries in the series do not. The action is low key and before the final shootout in the warehouse there are really only two scenes- but they're well executed. The best part of the movie is the sequence in the woods where Rambo hunts down the bad guys. It is perhaps too easy to dismiss First Blood on the basis of what the Rambo series would become, but this movie is significantly different, and better, than its sequels. This is a great film for action lovers as well as lovers of movies that have depth. (First Blood is a fantastic all-round movie)."}, {"rating": "4", "text": "While I laughed out loud a couple of times, this film is generally too silly and too ridiculous to enjoy."}, {"rating": "10", "text": "My favourite in the franchise!!! Such an underrated movie! Don’t sleep on this one! You will have a good time with this movie!!!!!!!!!!!!!!!"}, {"rating": "10", "text": "!!!amazing movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "5", "text": "Has some okay action and acting but this is a pretty dumb sequel that doesn't deliver much."}, {"rating": "7", "text": "Clearly not so good like the first Rambo, because this one is too easy to understand. Only the ending is very interesting and the story about being betrayed by the politicians. Unfortunately the movie focus more to the action and doesnt follow this interesting plot. But the action is very good, but sometimes it is too much, unrealistic and feels like US propaganda. Stallone is stiff sometimes, but the Rambo here doesnt have many opportunity to show a deep character."}, {"rating": "8", "text": "I actually liked this one better than first one. As it made a bit more sense, but anyway this was very great movie just like most movies from Rambo"}, {"rating": "7", "text": "Rambo: First Blood Part II. He returned home. A more dynamic and more violent Rambo Part 2. He will go through all the betrayal, loss, torture and reach the end."}, {"rating": "6", "text": "Wish fuflillment fantasy for sure seeing how it played out. Far less grounded than the first movie. Enjoyable, but over the top dumb action flick for the most part."}, {"rating": "7", "text": "No es una secuela decepcionante pero si inferior. Intentaron mejorar la interacción entre personajes y la acción y lo lograron, pero ciertas partes dejan que desear."}, {"rating": "10", "text": "i liked it more than the first since the helicopter fight was pretty fun not gonna lie"}], "recommendations": ["underworld_awakening", "rambo_last_blood", "underworld_blood_wars", "transformers_dark_of_the_moon", "the_mechanic", "bloodshot", "the_expendables", "underworld_evolution", "underworld", "safe", "the_marine", "first_blood", "avengers_age_of_ultron", "hercules", "war", "quantum_of_solace", "predator_2", "escape_plan", "ninja_assassin", "death_race", "predator", "iron_man_2", "london_has_fallen", "riddick", "live_free_or_die_hard"]}