{
  "id": 648,
  "title": "Rampage",
  "starring": [
    "Dwayne Johnson",
    "Naomie Harris"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Primatologist Davis Okoye shares an unshakable bond with George, the extraordinarily intelligent, silverback gorilla who has been in his care since birth.  But a rogue genetic experiment gone awry mutates this gentle ape into a raging creature of enormous size.  To make matters worse, it’s soon discovered there are other similarly altered animals.  As these newly created alpha predators tear across North America, destroying everything in their path, Okoye teams with a discredited genetic engineer to secure an antidote, fighting his way through an ever-changing battlefield, not only to halt a global catastrophe but to save the fearsome creature that was once his friend.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/MGADip4thVSErP34FAAfzFBTZ5.jpg",
  "categories": {
    "plot": 6.1875,
    "acting": 6.333333333333333,
    "ending": 5.545454545454546,
    "soundtrack": 5.0,
    "cinematography": 5.666666666666667,
    "familyFriendly": 6.0,
    "funny": 6.4,
    "action": 6.023809523809524
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The story is very weak and the plot is very predictable. There's a lot of destruction and mayhem as the city of Chicago gets wrecked by 3 uber-large animals. A good way to while away, a  lazy, rainy, Saturday afternoon."
    },
    {
      "rating": "6",
      "text": "I think the user rating 6 is a fair and accurate score for this movie.  This is a blockbuster fun action movie, it's best to go in watch this movie without any high expectations and you will enjoy it more.  This isn't Dwayne Johnson best movie but as always a very likeable guy to watch.  This is the kind of movie to sit back on a Friday night where you can wind down and eat popcorn without much thought."
    },
    {
      "rating": "6",
      "text": "This is a entertaining monster movie with the Rock. It's not the worst movie ever made but it's better than the last couple Godzilla movies. The dialogue was bad at times. Some good actors in this but not sure they would be proud of this one. They didn't have much to work with. The Rock is not a good actor. But he always brings that presence and charisma that he has. The action scenes were entertaining but you really have to overlook how dumb the plot is.. Like in a lot of movies like this it's not winning any awards for the story. But it's worth a watch just for the action scenes."
    },
    {
      "rating": "10",
      "text": "Whenever a movie has even the smallest flaw, it becomes easier to criticize because you can easily come with why you did not like it. A flawless picture, on the other hand, it's a bit tricky. All you do is praise its qualities saying something along the lines of \"a deep, emotional masterpiece\" but that does not sound very argumentative. But it is how it is, so please indulge me while I try to pick myself up from the misery of this movie's greatness.Brad Peyton and his peers, especially screenwriter Ryan Engle took a progressive tone, slowly unraveling the love between the 46-year-old huge musclehead Dwayne and 24-feet-tall albino gorilla called George. Yet despite this progression being noticeable pretty quickly, it never fails to touch you (no pun intended) on an testosteron level, with every explosion being delivered like Michael Bay delivers his farts.Indeed, EXPLOSIONS and HUGE MONSTERS is what drives this movie, and Peyton's favourite weapons to unleash it are the EXPLOSIONS and most of all, the HUGE FKIN GORILLA. The fact that this takes place in San Diego/Chicago during summer allows for the landscape to become fkin hot. Indeed, every EXPLOSION, MONSTER or simple MUSCLE FLEXIN is augmented by occasionally filming characters from afar, letting the nature take the spotlight. And it is worthy of the spotlight, as \"nature has cunning ways of finding our weakest spots\".But even smaller elements of nature are presented often through symbolism, like the scene in which Dwayne fights a huge fkin mutated alligator. Its a sexual scene, but is also more complex than it look at first glance, as the alligator represents Lacoste, swag and Dwayne  represents every person who wants to be cool.But, this is till a coming-of-age story and Dwayne's frustration with sexuality unfolds through a beautiful yet heartbreaking search of a fkin HUGE gorilla. This, indeed, is not a film which glorifies and attempts to make us accept fkin HUGE MONSTERS, but a heartwarming, subtle, touching (see, I told you I would fall into the misery) and deep story about how to destroy a fkin city with the aid of a HUGE fkin gorilla , a flying wolf and the biggest fkin alligator i've ever seen . Arguably the best of the year."
    },
    {
      "rating": "3",
      "text": "There isn’t a whole lot to say about this one. It’s slow, boring, and stupid. About as average as action films get. However, at least it was short. It’s only about 100 minutes long, not that bad as far as these kinds of movies go. I guess 2018 was the year where video game movies stopped being awful and started getting mediocre. They’ll start getting good any year now! I just know it!"
    },
    {
      "rating": "6",
      "text": "It's dumb self-aware fun straight out of 1998. Overall Rampage is sorta forgettable and the CG is wonky here and there, but if you're into monster-mash movies or are looking for an enjoyable timewaster look no further than this cheesy goodness."
    },
    {
      "rating": "6",
      "text": "Horrible movie; live characters are poorly developed & their background stories are terrible; plot is a crap. Not all the film is bad because when the monsters are fighting it's really enjoyable & amused."
    },
    {
      "rating": "6",
      "text": "Rampage is one of those movies where you can't go in expecting some great story or amazing script; you just have to go in expecting to have a good time. And that's exactly what happened. I had a good time. Is the script a bit of a mess? Yeah. Does the plot have many holes? No doubt. But it was just a bunch of fun to watch, and while it would have been nice to have gotten more of the big animals destroying everything, it actually gave me more than I expected so I was satisfied. I'd put this movie in the same category as Pacific Rim: Uprising as far as what to expect, except this one isn't a follow up to a fairly solid movie, so it couldn't let me down quite like Pacific Rim: Uprising did. I also have to mention that The Rock is really the main reason why this movie works. Without him, this would have been straight to DVD garbage. Give this one a watch if you're looking to turn off your brain for a bit and have some fun."
    },
    {
      "rating": "4",
      "text": "The last time that Dwayne Johnson and director Brad Peyton teamed up was San Andreas, which was loads of popcorn fun. This time Johnson plays the primatologist who's unusually close with a particular gorilla. When a genetic anomaly infects him (and a wolf and an alligator), they grow enormous, turn violent and rampage thru Chicago. This is when it turns into a modern take on the Godzilla concept: mutant monsters destroying everything in sight. Almost single handedly, Johnson saves the day. While it's obviously designed for mass market action appeal, it lacks the clever approaches or exciting filmmaking that made their previous team up so enjoyable."
    },
    {
      "rating": "6",
      "text": "Another film with big animals and the threat from modern science that making in the DNA carried only large mutants and nothing else. A light and pleasant action movie with very infantile humor and a high dose of CGI. For me, cool though but I was hoping for a more interesting story."
    },
    {
      "rating": "4",
      "text": "Kinda boring honestly. Not enough destruction. It never tries to be anything more than cliche. The heavy focus on human characters makes for a poor representation of the video game. Not to mention that this human aspect of the movie largely doesn't work. There's no real payoff with the monsters here either like there was with other somewhat recent giant monsters movies like Pacific Rim or Godzilla (2014)."
    },
    {
      "rating": "6",
      "text": "I am not really that much of a sucker for Videogame Movies,given that I only saw The Angry Birds Movie,the Angellina Jolie Tomb Raider movies and this year's Tomb Raider,as well as that direct-to-DVD LEGO Batman movie (no,not counting Wreck-It Ralph). So going into Rampage,I wasn't excited because 'It was going to break the Videogame Movie curse',no. I was excited because I would have had a brainless fun time with The Rock. And man,did it deliver.While it's not a perfect movie,I can see it as the ''King Kong (2005) of Videogame Movies'',right up there with Angry Birds for sure,since both movies share the same issue: A flawed story with some fun and exciting moments.And you guessed right if I said ''maybe the story has issues'',because the first 5 minutes feel a bit to sloppy,and I get that they had to set up the story,and the villain has some lazy writing,like 'trying to make cash' isn't necessarily a bad thing,except if you talk about Universal,in that case Right On.But that doesn't mean it's bad. The third act (and some comedic moments) is where the movie succeded since it's all 'ROAR! SMASH,SMASH,SMASH!' in a dumb,yet exciting way,making me think if Warner Bros. hid an R-Rated cut with all the carnage and oil splatter going on in the movie.The cast was fantastic all along,from The Rock to Naomie Harris,with Jeffrey Dean Morgan being the standout with his one-liners. And in the technical aspect,I have to give props to WETA Digital (who just won an Oscar with Blade Runner 2049). This is the most gorgeous-looking Videogame Movie I've ever seen,and that's saying something given the technology we have today. All in all,I had a fun time with Rampage. Is it a Coherent film? No,but as a fun brainwasher? Indeed it is,but be cautious. If you know what you're getting into,then I'm not stopping you from checking it out,but if you think it looks stupid,then just don't go see it.Again,it's dumb,but I had a smile through the third act,so it's all good."
    },
    {
      "rating": "5",
      "text": "When a gorilla named George has more personality then any other human character, you know something is wrong. This characters have no depth to them, nothing. The acting of some is just atrocious, whenever Malin Akerman and Jake Lacy were on screen i couldn't help but role my eyes. Their attempts on comedy were scary at times, but it was funny at times, special with Dwayne Johnson, Jeffrey Dean Morgan embraced so much the role of Negan in The Walking Dead that the director probably just told him to act like Negan. All that being said, i think the 3rd act was good, i mean, very inconsistent, but i like seeing giant animals destroy stuff, and the scene with George in the end was a bit touching."
    },
    {
      "rating": "5",
      "text": "Rampage is a dumb, fun, big budgeted Hollywood action movie. That's really all there is to say! There are a lot of surprisingly enjoyable scenes, The Rock is a little all over the place, but when he finds his niche, he really does perform well. Naomi Harris and Jeffrey Dean Morgan do well in supporting roles. The CGI is actually quite nice, and the destruction of Chicago in the film's climax is a lot of fun to watch. The biggest flaw in this movie is it's script. A lot of lines and plot devices are eye-rollingly bad, if not outright problematic. Overall, there are worse options out there than Rampage."
    },
    {
      "rating": "6",
      "text": "Kind of paint-by-the-numbers type of action flick with a nod towards racial diversity, how progressive (eye roll). It's mostly dumb with The Rock not taking the role very seriously, just another $$$million paycheck for him. Despite its predictability, there are some touching moments where you have feelings for the plight of \"George\" but all's well in the end because Brad Peyton (director/EP) and the new kid-friendly Rock (star/EP) forced a happy Disney-like finish, ugh."
    },
    {
      "rating": "5",
      "text": "A man and his gorilla is easily the best part of this film. The Rock shines and when the monsters are destroying things the film succeeds. However the villains and all the other side plots make this a one time watch at best. Close to a mild recommendation but can't quite get it there. Overall a high 5. C+"
    },
    {
      "rating": "4",
      "text": "I guess I can really say that while you're watching it you’ll have a certain amount of entertainment, after all it's a mindless blockbuster designed specifically for that: Earning fast money with a formula as worn as it is practical.It’s said that Dwayne Johnson is the highest paid actor in Hollywood because he’s really good to raise money at the box office. I guess it must be true because he obviously charges quite well but I've never really enjoyed any of his movies and I have only seen him act well once.Rampage is no different and as I said it's practical entertainment, one so practical that you'll forget about it as soon as it's over.Does it justify the price of the entrance ticket? It will depend on whatever people want to find in it."
    },
    {
      "rating": "6",
      "text": "Short description: Pacific Zoo. Shallow story but still entertaining enough."
    },
    {
      "rating": "4",
      "text": "Excessive explosions, inconsistent one-liners, and lazy storytelling. We’ve come to expect these tired tropes from pictures starring B-movie champion, Dwayne Johnson and his newest release, Rampage, delivers it all in droves. While the script does put minor efforts into creating characters & relationships, much of the story recedes into sorry excuses for one excessive action sequence after another. Again, that is what a movie like Rampage is supposed to do to a certain extent but this film often slips into pointless, incoherent chaos.The limitations of Rampage’s action (from production to direction to writing) would be more excusable if the entire film wasn’t centered around it. All narrative scenes are executed with a level of disinterest that can only be described as negligent. In fact, some of the more emotionally dramatic moments feel outright inappropriate as this movie clearly wants to get on to blowing more stuff up. In the end, the charm of Dwayne Johnson, the playful supporting cast and the special effects all have their moments but the positives of this movie are mostly washed out by its noisy and cheap qualities. A film that hardly has any interest in itself, there are better movies to see than Rampage.Writing: 2/10Direction: 2/10Cinematography: 3/10Acting: 4/10Editing: 2/10Sound: 6/10Score/Soundtrack: 5/10Production Design: 2/10Casting: 7/10Effects: 4/10Overall Score: 3.7/10Original Article: https://thefilmguys.blog/reviews/augusts-reviews/rampage-2018/"
    },
    {
      "rating": "8",
      "text": "You have to see this movie for what it is: a moment to shut down your brain and enjoy oversized animals destroying a city with Dwayne Johnson kicking ass. The critics obviously can't give a good score to a dumb movie but if you see it for what it is you will enjoy yourself."
    },
    {
      "rating": "6",
      "text": "Films based on video games are rarely (if ever) a success, and one which is modelled on a particularly absurd arcade game with a giant gorilla, crocodile, and flying wolf would seem an odd choice. However, absurdity aside, the third act of this film redeems the sluggish opening somewhat, and there are many laughs to be had. The script is abysmal, though the clanging dialogue occasionally results in unintentional laughs, and The Rock is just charming enough to carry the ridiculous storyline to the epic conclusion. There is little substance here, and the cinematography often leaves much to be desired, but the final destructive sequences provide some thrilling moments, making for a silly yet occasionally entertaining film that is ultimately quite fun. 6.01/10"
    },
    {
      "rating": "4",
      "text": "All gods must fall down.  \"Rampage\" is the typical American blockbuster. And not necessarily one of the good ones. Titanic beasts, pompous action sequences, openly fanciful storylines, characters pigeonholed into lifelong stereotypes and one disaster, one apocalyptic disaster that incoherently assures the conception of a new franchise. We're so bushed of this situation that we're bursting with joy when an original idea doesn't become a shameless exploitation.Although many agree that Brad Peyton's newest movie chaos has been the best of video game adaptations due to critics consensus, actually, it's fairly incorrect and unfair to ensure that, based on the film itself, it's noticed that the 1986 arcade game launched by Midway Games doesn't conform even 20% of the DNA of Peyton's film, is a story frankly distant; It's better to say that it's a source of inspiration, but drastically not an adaptation.Toying with animalistic hybrids growing disproportionately and destroying almost all the City of Chicago, especially to Hollywood, looks suggestive, looks juicy, smells like money, an authentic CGI milking, and ultimately, that's what it becomes. There is not a story that really thrills the spectator, there are no attractable or special characters leading this unfortunate journey, there are no powerful twists and credible plot decisions for the film, in fact, there is not even a good execution of the action sequences, which, to be honest, have been one of the most frighteningly insipid, synthetic and soporific in a big-budget adventure movie, putting different kind of beasts in an urban quadrangle to fight each other is no longer as fun as before, just ask \"Pacific Rim: Uprising.\"The references and \"homages\" are obvious and offensive. The fight sequences between these gigantic animals bring back memories of the great classics of Japanese monster cinema, especially Kaiju and Daikaiju. Many of the set-pieces in which these creatures dispute without contention brought to my memory immediately the hyperstylized and bombastic \"King Kong: Skull Island\" by Jordan Vogt-Roberts, the dramatic and slow-burning \"Godzilla\" by Gareth Edwards and, of course, Ishiro Honda's Japanese masterpieces. The disappointing thing is that it never fulfills its purpose, a disrespectful honor, they simply use them to bestow a personality, that is already nonexistent, to a film that is as clumsy as long.There is something special to highlight Andrew Lockington's soundtrack. In different parts of the film, mostly in the first and second act, the compositions imposed on certain scenes were paradoxically appealing, I had never heard such unusual melodies in an action film, the effect I had on the scenes was minimal but moderately unusual and new. Jaron Presant's cinematography looks good, not spectacular, new-generation video-game zooms are well-used, four is the perfect number, but there are no risky or innovative ideas, a factor that should be key in this genre in which the script is terrible, the pictures must shine, Hollywood must attract people into theaters, at least, for their exaggerated production and art designs, but actually, if Warner's box office results for this movie are fabulous the only justifiable cause is The Rock, as its mediocre CGI and its futile premise end up being, rather a good focus of attention, a red alert for our money. As for Bob Ducsay' and Jim May's edition, there are not many good things can be said, as the film is tortuously long to be a pre-summer blockbuster, almost two hours of obscene visual gags coming from an albino monkey and frankly ineffective sequences that prey on the spectator's interest and end up overwhelming the experience, a cutting tactic, an endless nightmare that made me yawned fifteen times, but relax, long runtimes are only acceptable with films as \"Blade Runner 2049.\"\"Rampage\" by Brad Peyton is not a lousy feature film, but is not a moderately enjoyable one either, has a  fantastic cast — which is unfortunately thrown into the trash — but poorly structured, all-dimensional characters. The action sequences, the main offer of the studio for audiences, are odd-looking — not in the good sense of the word, — its edition does not give any impact to the cinematic experience it supposedly offers. The film won't harm the unstoppable career of The Rock, however, compared to the average of his films and the previous and much more exciting disaster movie with the same filmmaker (\"San Andreas\") is sadly inferior. A useless toy, grandiloquent and empty entertainment that will earn millions of dollars, but that will be forgotten as fast as the destruction of Chicago; excessively long, monotonous and clumsy; Warner Bros' last bet in the universe of video game adaptations slips back to the last position of the list."
    },
    {
      "rating": "5",
      "text": "this is just another kaiju monster movie, nothing special, if your going in to see monsters destroy stuff and fight you will be happy but everything past that is pointless in this movie, there is some good comedy and cgi but if you come out of this movie thinking wow what a masterpiece i highly suggest you watch some different movie genres, and even if grading this only compared to other monster movies its still not that good."
    },
    {
      "rating": "4",
      "text": "An average movie. The story is really standard by now. No special twist and a succession of cliché. George is an interesting gorilla with good expressions. It does follow the game. The CGI is pretty good for the creatures, but it's a mix bag for the structures they destroy. The actors don't have good lines and some of it is techno babble. Jeffrey Dean Morgan was amazing in his role. He is the best part of the movie, yet very sporadically. I give it a 40%. Too generic for my taste."
    },
    {
      "rating": "5",
      "text": "Рэмпейдж- красочный, но дурацкий фильм со Скалой. Сюжет простой и банальный. Персонажи скучные, только Скала блистает своей харизмой. Юмор есть, и иногда смешной. В середине истории, как по мне скучная драма на пустом моменте. Экшен и графика на высоте для таких фильмов. Если честно ждал больше, чем обычный проходняк, который через день забывается."
    },
    {
      "rating": "4",
      "text": "Meaning less movie. the movie just does not make any sense...they just made a movie with no proper story. fast moving and loud scenes...that is all what the movie has"
    },
    {
      "rating": "6",
      "text": "It was better than I thought it would be.  I enjoyed The Rock's performance in this a bit more than the new Jumanji movie. Other than that I felt it was just a typical monster/disaster movie that's been made time and time again."
    },
    {
      "rating": "8",
      "text": "I think this may be the best game to movie adaptation of all time, and i'm not even joking. just straight up fun with no unnecessary complicated plot or dumb drama. The characters also are endearing, but George is definitely the star of the film.Totally go watch it. Even enjoyed it more than Ready Player One, but that's just my opinion."
    },
    {
      "rating": "7",
      "text": "I had so much more fun than i expected with this one. Based in an game.Scientists posses some substance that when it comes in contact with some living being it makes the animal become bigger with the time, acquire new abbilities and get really angry with everything. When this substance make contact with George(albino gorilla), the friend of David(The Rock), wich is his creator, needs to figure what happened, how to help and do his best to avoid that a full Chicago got destroyed when they figured that other 3 animals were changed with the substance and are going to the same exact place.The plot of the movie isn't anything special, actually it is kind of lame, no big surprises during the story, it doesn't have any deepening with the characters, they do talk very little about the relationship between George and David, i believe that they could have extended a little more before he got exposed, even that you totally believe in their friendship. The villains of the movie are a mess, they are literally there only for have reasons for the stuff to happen wich is kind of lazy, the big bad one and a clumsy one to counter. They did had a reason for the substance to be created, but doen't make sense, wich you choose if it is a problem or no. But even with that, you can understand what is going on with the movie, you really need to have some suspension of disbelief if you really want to enjoy some stuff, there are a lot of lazy writings in here, some characters does teleport out of nowhere, and others are just forgotten during the movie. Some sequences are just ridiculous, some characters leave somethings behind that just didn't make no sense at all, some excuses to make the plot goes foward are so lame that you got ashame sometimes. They do add a background for David that is good for some things that happens to make sense. The interaction between David and George is great, the way that they communicate and every aspect that they give to the gorilla worked a lot. George have a peculiar personality and it just make you relate to him more, wich is great.The acting was on point, it is true that the movie didn't requisitioned much from the actors and actresses, but they did a good job. Dwayne, The Rock, Johnson did what he do normally, he was that nice guy that you would like to be a friend off, with such charisma, he did it with competence, he have a great comical time, sometimes i found myself just laughing of some good lines that he had. Jeffrey Dean Morgan was also pretty good, he did that sarcastic and confident federal, he have a nice turn and the movie gave him some time to make us know him well. Joe Manganiello have a small row as a military, his name is Wilson(cannot be a coincidence, right?), he is the leader of a group and pretty much present to us one of the big creatures. Naomie Harris did a good job, she did pass some idea of concern, and sometimes guilty, tha wasn't great but was at least good and believable.The cgi of the movie was on point, like 98% of it was used with mastery, there was like only 2 or 3 moments that it did was easily noticeable and kind of took me off of the movie, but mostly it was perfect and well covered. All the facial work job that they did had with George maked the movie soo much better, because you could easily noticy when he was happy, when he was confused, afraid, angry or laughing, it was great, it did make us care much more about the character and also helped to giving him his personality. They did a good job on the development of the monsters, the did apresented we well the features and changes that it had, you know what those beings was and have, like abbilities to fly and stuff. The hole destruction of the city sequence for me was great.There is nothing to talk about the cinematograpy, it was really simple, nothing remarkable. The song isn't any memorable, the soundtrack, i bearly noticy.The full fight part, for me, was very good and entertaining, the destruction of the city was nicely done it is full of energy without getting overwhelmed, the monsters did used different resources to climb and fight, i did like it how they showed that. And it is nice beacuse you actually care about what is happening, you care about George, it does make a difference for some others movies like this.The movie is really fun to watch, if you want a good script, logic, coherence it won't be a good experience, but if you don't it will be a nice time that you will have. You gonna laugh, be entertained with their interaction, the fights and everything that runs beyond those big monsters. Probably if you watch the movie at home, it will be harder to like it, this is a movie to be watched in the theater."
    },
    {
      "rating": "2",
      "text": "i should shave my head..RampageAs much as bigger it gets on screen on visual aspects, the feature goes smaller on its narrow vision that never had it right at the first place. It has a wafer thin script that is written too shallow to bring out anything colossal out of it (except the action sequences) for it is an epitome of a cliched episode that has predictable turns, repetitive dialogues and dull characters. Brad Peyton's execution skills fails to draw the attention from the big bucks for there isn't much creativity on craft left for the viewers to seek or go deep into it. Dwayne Johnson might be fit for such a role but still needs some work to do on delivering a genuine performance or even a dialogue which is utterly missing in it and addition to that even a good supporting cast like Naomi Harris and Jeffrey Dean Morgan are not in their A game. Rampage is one of those features that is exactly what it looks like and a bit lesser than that and questions the integrity of the viewers whether they are smarter than a vfx explosion mended on a large scale or asks for more."
    },
    {
      "rating": "8",
      "text": "Surprisingly far better then I had expected.I didn't have high hopes for Rampage, I figured it would be a horrible video game movie with the normal horrible video game tropes. However, it has Dwayne \"The Rock\" Johnson in it so I as sure it would be fun. Maybe those low expectations helped as I was pleasantly surprised though to find it not just fun but a rock solid monster movie.It won't win any high drama awards, but it stayed in the lane of being a monster movie and because of that there were no other expectations on it that it could fail. It included the requisite monsters, government ineptitude, great special effects, brutal monster eating people sequences, an evil corporation, and a hermit like scientific primatologist who used to be special forces, what wasn't there to like.The even more surprising thing is that the movie did not feel like a video game movie. Maybe that is why I liked it so much. It didn't have the cheesy video game tropes and instead just took the basis of the video game and made it a decent monster movie (much how I always liked that Resident Evil was unevenly successful at the same thing but as a horror movie).Nothing negative to say about this, it is a solid action and special effects driven monster movie that has The Rock as an ex-special forces primatologist.The good: Everything was rock solid as a monster movie. Much better then The Mummy in this respect. Special effects, monsters, the Rock all enjoyable.The bad: There wasn't anything bad as long as you come in expecting just a monster movie. I did feel bad for the wolf though, won't anyone think about the wolf?"
    },
    {
      "rating": "10",
      "text": "For those who understand that Kaiju (Giant monster/ robot films) are a genre unto themselves. Which many critics don't want to accept. This film more than delivers and doesn't shy away from pointing out the human cost of such a catastrophe. If you are wanting to see a great monster movie mashup go see this. If you are wanting to see a Pride and Prejudice style film don't but also don't go expecting such a film. Doing so is much like going to a Mexican restaurant and expecting great sushi."
    },
    {
      "rating": "7",
      "text": "I watched both this film and \"A Quiet Place\" today. While this was an incredibly silly, goof-fest of a film, it aimed to entertain the audience and the writers made some attempts to at least follow the logic of the world which they created within the script. Whereas, the critically lauded \"A Quiet Place\" forgot early on to make any sense even given the conceits set up by the writers from the get-go. Also, \"Rampage\" doesn't lie to or betray the audience the way the other film does and has a sense of humor about itself. Want to be entertained for a couple of hours this weekend? Go with this one"
    },
    {
      "rating": "7",
      "text": "Pelicula muy entretenida y disfrutable que sin duda alguna recomiendo a aquella gente que quiera ir al cine a pasar un buen rato. Sus increibles escenas de acción y gran ritmo harán que no te aburras en ningún momento."
    },
    {
      "rating": "7",
      "text": "Like most gamers my age (32), I experienced the colossal carnage and destructive exploits of George and Lizzie on the Nintendo Entertainment System (NES).  While the game already existed as an arcade game, I had never heard of Rampage until one fateful sleepover at a friend's house.  That night, my friend's mom took us to the local video rental store to pick out a game or a movie.  My friend convinced me to agree on Rampage as the chosen rental even though I had never heard of it before.An hour later, we were sitting in his basement eating Pizza Hut pizza, drinking soda, and playing Rampage stomping through the city of San Jose as a mutated primate and lizard.  The game instantly clicked with my young boy brain, and eventually, I would find a way to snag it for my game boy color a couple years later as well as Rampage: World Tour for the Nintendo 64.New Line Cinema has now opted to bring us the 1980's classic arcade hit as a feature film adaptation.  If that sounds as absurd as a Battleship adaptation, well, that's because the notion certainly is.  Both games, one a table-top game, the other a video game, are devoid of any kind of narrative.  Ergo, the film is only going to be as good as the story injected into it.  In this age of modern cinema, it's hard imagining a movie with a 1960's-esque sci-fi setting involving humans, through alien or science experimentation, transforming into gargantuan monsters who level cities and eat humans as a viable option for a theatrical release.Whether it was difficult to imagine or not, it's what happened.  However, the setting was somewhat modernized providing an over-the-top, but scientifically safe explanation for why our three antagonists mutate into larger creatures.  Unlike the video game, George, Lizzie, and Ralph were never human.  They were always animals, but were unfortunate enough to be the recipients of a genetic altering concoction supplied by an overtly evil corporation, Energyne.  With the plot of subverting the destruction of a major city by enormous, destructive monsters supported by a sub-plot where the hackneyed trope of an evil corporate ship steered by a brother-sister duo out to fill their bank accounts, it's entirely appropriate to say that this film is 100% predictable at just about every single level.  The one-liners and snidely whiplash level of evil-doer schemes are the epitome of cringe-worthy 'cheesiness' at times.  But even that was a predictable aspect of the film going into it.The film is centered around Davis Okoye (Dwayne Johnson), a primatologist, who spends his days at a San Diego wildlife preserve with his primate pal, George, an albino and one-of-kind gorilla.  The movie goes to great lengths to ensure the audience understands that there is a strong bond between Davis and George actually offering a short, yet emotional backstory regarding their first meeting years ago.  Despite this aspect, there isn't much else in the way of exposition, and the film doesn't waste much time getting into the thick of it.   Before long, George is infected with the life-altering pathogen as well as a random wild wolf and alligator.  Davis's involvement is a result of his friendship with George as he sets out to protect him and also attempt to understand what is happening to him.As I mentioned previously, this film is a one-note flick with very little depth that is as predictable as my chances of winning the lottery tomorrow.  But I'd venture to say that any one walking into the theater to see this film after being fed the marketing and promotional material likely isn't expecting a smartly written script, academy-nominated acting, or complex narrative.  Instead, the expectation is that this film is a fun, simplistic adventure that removes any need for active thought by the audience, and is to provide all the energy and thrill that a cataclysmic monster bash session featuring Dwayne \"The Rock\" Johnson can promise.  In principle, it's comparable to waiting in line for Splash Mountain.  Most everyone in line knows exactly what to expect, but can still anticipate the thrill and know they don't have to work for it.  They just want to be taken for a ride.Entering this film with the expectation that you are looking for a dumb, mindless, but fun ride might enable to maximize your enjoyment of the flick.  I took my young son to see this film, and while there were a few violent moments that he likely shouldn't have seen he still had a blast.  The plot was simple enough even for his understanding and he was a big fan of George by the end of the film.  We had a great time, and enjoyed the ride.With that basis, the film is entertaining, and I can recommend it wholeheartedly if you're in the market for that type of experience.  Additionally, if you were a fan of the games as a child (or an adult), the notion of George, Ralph, and Lizzie stopping around in modern cinema might be enough for you to enjoy at least one viewing."
    },
    {
      "rating": "2",
      "text": "Save your money, the movie may not be worthy not even by torrent standars, but most important save your time, I didnt. The only good thing about this movie in The Rock, the rest dreadful."
    },
    {
      "rating": "8",
      "text": "7.8/10  Although the story differs from the arcade game a bit as far as the monster's origins, the new backstories work quite well and make the overall film a very enjoyable and fun video game adaptation. Dwayne Johnson once again proves himself as the most versatile and entertaining action hero around with his great personality and sheer strength. George, Ralph, and Lizzie are all very exciting creatures to watch destroy and obliterate in brutal fashion and the finale is extremely well executed and exhilarating and stays very true to the original game's themes in that aspect. Some of the characters and dialogue was cheesy beyond belief, especially the Wyden corporate villains and the colonel which were utterly ridiculous but really its kind of necessary for this kind of film. In the end this film is a blast of a large scale monster action ride and delivers exactly on what it's supposed to. Honestly its probably the best video game adaptation so far."
    },
    {
      "rating": "9",
      "text": "The Rock is The Rock in The Rock, with monsters.A basic monster film with The Rock in it.Entertaining? Damn right it is! What do people expect from a movie about the Rock and monsters? So many whine \"It isn't Citizen Kane, reeeee!\" Well no duh. It's the Rock and monsters. I got everything I wanted and you will too."
    },
    {
      "rating": "7",
      "text": "It delivered exactly what i expected ,a visual good ,big monster movie where you don't need to use your brain to watch it,it's cliche and dumb ,but i advice it for everyone to watch who loves big monster movies"
    },
    {
      "rating": "9",
      "text": "I loved it. Much better than Infinity War. Really deserves a much higher critic rating. There is action and I bonded with the Gorilla. Johnson was great. The villains were good. The government was stupid. Ok, the science is crap, but this is not a documentary, it is entertainment, and for that I give it a nine. I was engaged for the entire movie, unlike Infinity war which was both confusing and boring at points."
    },
    {
      "rating": "9",
      "text": "One of the best summer popcorn movies in years.  This is what last year's Tom Cruise Mummy was trying for.  If you liked San Andreas, this is about equally entertaining, coherent and well done, if unnecessarily intense for young kids.  The intensity of it pushes on PG-13 barrier and for no reasons linked to character dev. Many things are done well here. Most astonishing to me is the syntax of summer blockbuster movie making.  This team, including star, actors, director, cinematographer (camera framing and movement) have it down.  Second most astonishing to me is the seamless VFX.  George the ape is brought to life as few digital characters ever have.Third thing done unexpectedly well was Jeffrey Dean Morgan's performance.  His new take on an abrasive foil was welcome. I'm not al all surprised it cleaned up overseas.  Not common to see a film with so few missteps given its genre."
    },
    {
      "rating": "8",
      "text": "Rampage prolly is the best Video game adaptation till date. It has everything a dumb action movie needs which is Dwayne Johnson Kicking ass and surviving everything , great monster battles and cgi with a simple and absurd plot."
    },
    {
      "rating": "8",
      "text": "Had a nice time with this, but it isn't on the same pedestal as such giant monster movies as \"Kong: Skull Island\" or the recent \"Godzilla.\" \"Rampage\" is a bit of a schlocky 90's throwback. It's one of those movies that's a fun couple of mindless hours and, while there's room for improvement, nothing is broken.Yeah, the script has it's fair share of cliches, some of the dialogue is very obvious, and the villains' plan is poorly thought out. On the other hand, everyone involved is having fun with the film. The Rock is as charming as ever and he really sells his relationship with the gorilla George. The actions scenes do not disappoint and all the giant monsters are pretty distinctive."
    },
    {
      "rating": "8",
      "text": "THE movie was alright. The fight scenes were amazing and the acting was really good."
    },
    {
      "rating": "8",
      "text": "The movie was pretty satisfying. It was pretty good with a gorilla and someone named Davis Okoye. Rampage was cool as it starred Dwayne Johnson and his adventures. #Rampage"
    },
    {
      "rating": "10",
      "text": "I took my family to see it yesterday.While i used to play the game back in the day i noticed some differences bit i was totally fine and happy with the movie.loved it as well as the fam"
    },
    {
      "rating": "7",
      "text": "The movie was entertaining if you can get pass the amount of questionable moments."
    },
    {
      "rating": "7",
      "text": "Rampage has incredible scenes and was faithfully adapted from the games, it has good scenes like Ralf's jumping on the helicopter, Lizzie's appearance and Lizzie's death. The relationship between The Rock and George is very good, but what disappointed me were the horrible dialogues that this movie has and the villains of children's films."
    },
    {
      "rating": "9",
      "text": "Fun 80s style action film based on an 80s video game, fronted by Mr. The Rock smirking and wise-cracking in a flamboyant 80s style.2010s quality special effects dazzle with realistic looking giant monsters, impressive destruction and explosions.One of the most fun action movies I've seen in a long time."
    },
    {
      "rating": "7",
      "text": "Nice to see Brad Peyton didn't forget to add some humor to the mix this time. His last Dwayne Johnson vehicle San Andreas had the same amount of glorious destruction, but ended up being no fun thanks to a humdrum tone. Rampage doesn't repeat that mistake. It's giant monster action is backed up by the humorous one-liners being fired off from it's charismatic leading man. This basically puts it at roughly the same level of quality as your average big blockbuster action-adventure film, but I won't be too critical on it for that as I still think that American cinema could use more Kaiju-like movies. At least until that Pacific Rim cinematic universe gets started and most likely ruins everything for everybody.Now these video game beasts don't hold a candle to the likes of Godzilla and Kong, who have just kicked off what is currently the only good non-MCU cinematic universe (sorry Batman and Tom Cruise), but they're solid enough to hold us over until those two OGs get their sequels. The albino gorilla \"George\" actually has some personality and the giant crocodile is straight up FIERCE. It's design is grotesque and incredible. The wolf is more than a little out there. Why is it the only one with weird, non-species appropriate abilities? Did I miss the part where it was injected with porcupine and flying squirrel DNA? I realize that it most likely comes from the game(s) that I haven't played, but it's still odd and probably should have been justified to the audience in some way rather than just being pulled right from the source material with no context given to those unfamiliar with it.The cast supporting Johnson is pretty solid. Jeffrey Dean Morgan is the obvious standout brandishing his typical swagger. The only one I really had a problem with was Jake Lacy. He was overacting the entire time and I think he was actually meant to be a funny character, but every comedic bit with him just feel flat on it's face. At least until something fell flat on his face. Now obviously this is kind of a dumb movie. You come to watch stuff get destroyed, not for deep writing. That being said the villains have an unbelievably moronic plot to cover their tracks that is just laughable in all the wrong ways. A totally idiotic excuse to get all the monsters in one place to throw down. It works though. They got there and smashed some stuff. So while I can't consider it a win for the script, I might not call it a total loss either.Rampage doesn't exactly save video game adaptations, but it is another example of how they're getting better. It's got more wide-reaching appeal than any other to date and is a solid, if dumb popcorn flick. There were some laughs, stuff went boom, and really big animals punched each other. All stuff that lead to me walking away both satisfied and entertained. Really all one could ask for from a movie like this.7.4/10"
    }
  ]
}