{"id": 1110, "title": "Rango", "starring": ["Johnny Depp", "Isla Fisher"], "runtime": 107, "genre": ["Animation", "Comedy", "Family", "Western", "Adventure"], "description": "When Rango, a lost family pet, accidentally winds up in the gritty, gun-slinging town of Dirt, the less-than-courageous lizard suddenly finds he stands out. Welcomed as the last hope the town has been waiting for, new Sheriff Rango is forced to play his new role to the hilt.", "releaseYear": "2011", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/oVeRl1SRADz74OrY97usmP1flLV.jpg", "categories": {"plot": 8.075, "acting": 8.217391304347826, "ending": 7.5, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 7.875, "funny": 8.363636363636363, "action": 8.142857142857142}, "reviews": [{"rating": "8", "text": "Rango isn't a kids film, and it knows it. Riddled with adult humor, violence, and some pretty ugly characters, it's the perfect playground for a western lover such as myself. It pays little bits of homage to various westerns and is absolutely gorgeous to watch. Great animation, great humor, great story, and most important of all: A great western."}, {"rating": "6", "text": "ILM's first foray into animation features some dazzling visual effects, but they got the rest pretty wrong. A city chameleon (voiced by Johnny Depp) ends up in the desert, where he becomes the de facto sheriff of a dusty town in habited by an assortment of scuzzy fauna. There's an unexplained water shortage and the movie in a quest for the truth. This isn't a kids movie: there's too much taking and not enough cute characters or zany fun. This isn't an adults' film: it's not smart enough. There is some action and humor, but not enough to compensate for the lack of creative storytelling."}, {"rating": "6", "text": "Rango is the best looking film I have ever seen. This movie puts ILM at the top in terms of graphical detail, modeling, special effects and animation. BUT where it falls down is in the story department. There is absolutely no originality, with the plot being entirely predictable after the opening 20 minutes. Overall i would still recommend seeing this movie, just wait till it comes out on Blu-ray and watch it in HD to get a taste of the visual spectacle that is Rango."}, {"rating": "7", "text": "If you throw in a lizard, Beetle Juice, Salvador Dali, and a small Western town into a blender you get Rango. I must admit, the plot could have been more original, and the dialogue funnier - but the magnificently nightmarish characters keep you mesmerized. Nadim Basna"}, {"rating": "7", "text": "I mostly enjoyed this movie. There was lots of humor, found myself laughing out loud. For the most part my 7 year old had a smile on his face. But by the end he was bored and found it weird. But it's quite common for a movie to not hold his attention the whole way. But then after it's over he usually says he loved it. But this one he still affirmed, the ending was weird. I wouldn't say that, but I just didn't walk away saying I loved it. Depp was wonderful, as usual. The visuals were amazing. I'd say it's worth seeing, but don't go out of your way."}, {"rating": "10", "text": "This movie was entreating as an adult movie but certainly goes way beyond what I think is appropriate for children. Several scenes including the beginning showed a female naked torso of a mannequin, the phrase 'go to hell' was used and among other things, the word lesbian was used in such a way that an adult would understand and choose to like or dislike the connotation, but not a child. My 9 year old granddaughter stated in the car on the way home \" I liked the movie but there were some inappropriate words\". I couldn't help but agree with her. Great animation but also somewhat violent with lots of gunfire and in my opinion a reference to low self esteem that might lead to suicide. Unacceptable for children."}, {"rating": "9", "text": "Having a young daughter means I often get pushed into watching family movies, most of which bore me **** but RANGO is an exceptional movie, the stark contrast of city slicker pet vs wild desert critters in a western themed story is brilliant."}, {"rating": "10", "text": "Hands down the best movie ive seen this year so far. I enjoyed every second of this awesome animated picture. It is Gore Verbinski's best film and i hope that they make sequels because this was well worth $10.50"}, {"rating": "7", "text": "Rango is a film with lots of symbolism and witty humour. The film is very well acted by Johnny depp and is also masterfully animated, making visuals that are incredible to watch. However the film has a problem. I felt very distant from the story and it's characters I have no reason to think that but it's a reasonable feeling I had while watching this film. This feeling is enough to ruin the climax but still recognise the skill of writing and acting was put into the film."}, {"rating": "6", "text": "The movie was good but certainly not what I was expecting to see. I was expecting a comedy but it turned out to be an action film. Yeah, a full on action film. So, if you're expecting to watch a funny comedy film with your kids or whatsoever, - this isn't the right choice. Some may even consider it scary."}, {"rating": "10", "text": "What a glorious surprise ‘Rango’ turned out to be, it isn’t a dumbed down animated comedy or a family-oriented cartoon, its a very smart and beautifully rendered adventure that is a treat to look at, with a vast array of colourful and larger than life characters that look bright and cheerful as they light up the already bright screen. The setting of of the film is first and foremost, a Western, it delivers subtle but also not so subtle nods to the genre that defined an era, even if you haven’t seen the many films it borrows its content from, there is still enough to like about it, especially Rango himself. Johnny Depp lends his voice to the character, a run of the mill lizard, but his journey to an unknown location is disrupted after a roadkill, so he ends up deceiving his way into a local town called Dirt, which is running dangerously low on water supply while also being held under fear from the various villainous creatures of the town. As the film progresses, its clear to see the linear it follows, much the same as a Western, it has the stranger who isn’t part of the town, he breaks social order by confronting the rulers of the town, while he also has the chance to become honest. Rango tries his best to pull the wool over the eyes of the citizens, but birds, snakes and other unsavoury creatures make this quite difficult. Each character has been excellently brought to life through their voice actor, and through their relevant roles on screen, Bill Nighy and Ray Winstone are the ideal villainous cretins who terrorise the town, so Ned Beatty’s mayor decides that Rango should wear the Sheriff’s badge. The witty and smartly-drawn humour of the film is brilliant, it’s sort of a grown-up animation that has a variety of deadpan humour. Director Gore Verbinski shows his skills when commanding the great action sequences, there is a delightful chase sequence in the many canyons of the wild west that sums up the brilliance of the whole film, fast-talking, fast-paced and full of characters who could easily belong in a real film, they have limitless amounts of energy while the film has limitless amounts of opportunities to parody classical films such as Apocalypse Now and the endless amount of Westerns, it even use the talents of Timothy Olyphant to nod in the direction of the “Man With No Name”. This is a surprising and uplifting comedy that is colourful, breathtaking to look at and definitely raises the bar for a first rate story along with some excellent involvement of Hollywood stars, they bring the added flavour to the characters involved as Rango tries to figure out the water problem. Beauty and first-rate entertainment at its finest."}, {"rating": "8", "text": "Incredible animation. A little slow occasionally and a little slack on the plot. In a sense there was not a single original scene but I think that was the point. Check out the snowman in the snow globe, fear and loathing in Las Vegas, every Western ever made but especially high noon and all the Clint Eastwood pics. The clock looks like it was out of dark city. How about the Lord of the rings and the mines of Morea. Star Wars, Mad Max and above all Chinatown. I am sure somebody who really knows movies could find a few more. (I say the snake looks like Clint Eastwood not to mention Clint Eastwood looking like Clint Eastwood.)"}, {"rating": "10", "text": "This is the best animated film I have seen in a long time. Beautiful movie, absolutely fantastic to look at. Btw, all you over-sensitive idiots, this is what I would have wanted as a kid, a film that treats you like an adult."}, {"rating": "8", "text": "Neither an artful Hayao Miyazaki nor a glossy Pixar production, however Rango stands on its own,  with a bonkers of a story, great animation, intelligent directing and lots of fun!"}, {"rating": "8", "text": "This movie is NOT a kids movie. Sure there's an anthropomorphic lizard, and there's a wild west setting, but many of the jokes and even the art direction are not directed at kids. I did enjoy the film though. It was fun, and seemed very well made. Don't watch this movie and expect a pixar production though."}, {"rating": "8", "text": "\"Rango'' is the most bad-ass, well done animated film I had ever saw. The graphics are unbeatable, it definitely deserves a nomination for best animated film. If you love western movies, you will love ''Rango\", because it has those classic moments from old western movies (such as bad guys, gun fights, the girl, etc). It wasn't just an ordinary animated movie. The actors really had to ''play'' the scene in a studio (with all the technological materiel) in order to really incarnate there voices. I must say, it really showed that incarnation in the voices of the actors. Everybody did a good job, especially Johnny Depp (as Rango). It's a fun movie for all ages !"}, {"rating": "8", "text": "I liked it quite a bit, its not really a movie for kids in my opinion. There were some boring parts, started kinda slow, but overall i was happy with my purchase of a child's ticket to see the movie"}, {"rating": "9", "text": "Rango is indeed a quirky film; certainly not for kids, but still very satisfying. Not only a great comedy, animation, and adventure film, but also a great western. Rango is probably the first good film of 2011 and most people would agree with me. Plenty of great action and dialogue push this film along and it keeps on pushing until the end. The movie's theme is much more deep than I expected and the writing is excellent; something you would expect from a Pixar film. In short, I was happily surprised with Rango."}, {"rating": "8", "text": "This is a very good movie that should appeal to both adults and older children.  It may not have enough silliness for toddlers and there are a couple of places that might be a little scary for very young kids.   The animation was very well done.  The plots is fairly predictable but it has a few twists.   The plot delves into topics such as:  what it takes to be a hero, greed, and cooperation, so Rango has some good positive messages  for kids see.  There are a lot of computer animation films released each year, and the bulk of them are terrible.  This is an exception."}, {"rating": "8", "text": "All in all the movie itself was quite entertaining. The graphics were absolutely stunning, and the acting was appropriate. Each character had their own personality, and I personally find that a rare commodity in movies nowadays. I'm giving the movie an 8/10 because as entertaining as it is, I did find that it doesn't really hook you right away."}, {"rating": "8", "text": "I remember seeing the snake in the commercials but I never saw it's tail. when I finally went to the movie I learned the snake, instead of a rattle on the end of it's tail, had a MINI-GUN! A FREAKING GATLING GUN. That was awesome!"}, {"rating": "8", "text": "I very much enjoyed watching Rangoo, I thought it put a great spin on the old Clint Eastwood Westerns.  What stuck out the most to was creative the townspeople were.  It had a simple but wonderful storyline and it didn't try to get to complicated but just stuck with the basics."}, {"rating": "7", "text": "Wow, this move was spectacular. Its visuals were stunning, its characters were incredibly believable, and it's humor was like some I have never seen before. Just one tip, if you are planning to see this movie, just remember to get a ice cold drink, because by the end of the movie, you will feel as dry as hardened glue."}, {"rating": "8", "text": "A great children's movie tainted by the director and screenwriter into a decent adult movie. Gore Verbinski directed the Ring and the first three Pirates of the Caribbean movie. He was fired as director of the BioShock movie because he wouldn't direct a PG-13 version (he insisted on an R rating, not that I'm complaining). The screenwriter, John Logan, co-wrote Gladiator, wrote Sweeny Todd, Time Machine, Star Trek Nemesis, and The Last Samurai. So neither are known for light-hearted child entertainment. It's clear this movie wasn't intended for children under 14, but it was certainly advertised as such, to the film's discredit. That being said, changes were obviously shoe-horned in to make the story more accessible to the"}, {"rating": "10", "text": "Poissbly the best animated film this year will grab all awards from animation giant pixar, absolutely enjoyed it and loved how it page homage to the great westerns, amazing animated film :)"}, {"rating": "10", "text": "Overall I would say one of the better 3D animated movies in a long time (IMHO).  Visually unique and a funny movie for kids (and sophisticated enough for older viewers).  I'm very happy we're starting to get movies like this and not just repeats of Pixar-clones."}, {"rating": "10", "text": "So beautiful, so perfect, so perfectly timed. Finally Pixar has meet its match. This movie was perfect on all fronts, I didn't find myself bored or upset at any time in this film. Gore, please do more animated films!"}, {"rating": "8", "text": "Rango is one of those kids movies that you wouldn't take a young child with you to see, but more of a movie that you would want to see for yourself. There honestly aren't that many jokes scattered around the movie and many of the characters swear or threaten to kill each other. So if you are looking for more a family oriented movie, you may want to look elsewhere. Rango is similar to The Nightmare Before Christmas in ways. While it markets itself as a kid's movie, you don't watch it to get a good laugh or a happy little story, you watch the movie because of it's atmosphere and because of it's story. Rango is amazing in terms of it's visuals and character design. Everything is so detailed it's hard to take all the scenery in at once. Rango is probably the best looking animated movie that I have seen in a long time. Rango isn't too strong story wise though. It has a predictable plot that's been done many times before in different forms, but the dialogue between characters just flows so nicely that it's fun to listen to. Rango is definitely not a good movie for everyone, but if you are a fan of animated movies, then you must see this movie."}, {"rating": "7", "text": "For graphics, I give this movie a solid 10. Everything was crisp, bright, and highly detailed. The overall movie gets only a 7 because I felt that it was too busy paying homage to old Westerns rather than developing its own thing. The core movie seemed to lacking and I found none of the characters memorable. Still, it was an entertaining watch."}, {"rating": "10", "text": "This movie was wonderful and fun it is really a good start in 2011 for Disney, I have heard that some people hate it, I mean how can they say this the person that says this movie is terrible is really bitter and doesnt enjoy life, im tired of reading this reviews with people keep saying that most movies are terrible, come on people we must learn to love everything not matter what, execept violence! i recommend YOU to watch this."}, {"rating": "8", "text": "I just noticed that one of the few people who gave Rango a \"0\" also gave Sucker Punch a \"10.\"  Make of that what you will.  Rango isn't as good as it could've been but it was entertaining and I wasn't sorry I'd spent the $12 on a theater ticket afterward.  Great animation and it's intelligent in that it doesn't rely on bodily functions or T&A to get audience interest."}, {"rating": "8", "text": "Alright all you cinema lovers youâ"}, {"rating": "8", "text": "PG - 107mins - Animation/Adventure/Comedy - 4th March 2011With western films seemingly on the comeback in recent years, it was only a matter of time before an animated version of the wild wild west made it to our screens and it has done so in the guise of Rango.Rango (Johnny Depp) is an eccentric chameleon with ambitions of one day becoming the thespian that he believes he is destined to be. Fate casts him a die and as with many animated films these days catapults him from within his comfort zone, accompanied by his ever trusty sidekick Mr. Timms (a plastic goldfish) into the barren and unforgiving wild... the wild west in fact. As usual Depp brings his own unique style to the character of Rango really making it his own.Rango meets up with many other inhabitants of the desert (20+) who are quirky and unique animals in their own right giving the movie real depth and I have to say that the visuals in this are stunning. They are some of the best out there and it really is starting to get to that point that you forget it is an animation with the scenery and hot dry climate being portrayed looking top notch. Add the gritty aforementioned critters who look like they have been worn down by the desert sands over time and it's a hats off to the animators who have outdone their Pixar/Dreamworks rivals (it's a Nickelodeon production for those wondering).The movies humour is great and combines lots of slapstick, good one liners and excellent facial expressions that really got me going but this I felt is traded off, if only slightly, as the movie advances so that the plot can develop further. As usual with these films there is some subtle and some not so subtle comic references for the older generations that are likely to swoop over a few younger heads. Links to old wild west films are strewn in as well with the spirit of the west and the man with no name making their traditional western appearances. In fact more so than usual I would say that the humour is based more towards an adult audience than that of a children's one.Throughout the movie four singing mariachi owls accompany Rango narrating his tale a la the three mice from Babe, well not quite but you get the gist- maybe more akin to the rooster from Robin Hood and provide another perspective that does well to break the movie up and add to the comedy of it all. The mariachi owls music and the movie score also draws you in and any movie that can play Ride of the Valkyries on a banjo and still make it sound good wins my vote! Hans Zimmer (Batman, Inception, Gladiator, Lion King to name but a few) working his musical ability once again.All in all Rango has managed to combine great jokes, funny characters and stunning visuals within a solid story. The combination of Depp and Verbinski (Pirates of the Caribbean 1,2,3) has worked well again and it seems to have broken the mould in so far as it's a children's animation and yet I can see the adults coming away with the bigger smiles.Favourite quote: Owl 1 (In your best Mexican accent): \"Here in Mojave desert animals have had millions of years to adapt to the harsh environment, but the lizard -- he is going to die.\"Owl 2: \"When is he going to die.\"Owl 1: \"Soon.\"For further reviews feel free to check out: http://www.fanaticalaboutfilms.com"}, {"rating": "8", "text": "yeah this movie was awesome.   it wasn't for kids.    it was violent and funny too.    good movie.  i enjoyed it.   it was weird too.   it was a odd strange movie.   i liked it.  i thought it was good."}, {"rating": "8", "text": "I must admit, I didn't know what to make of Rango five minutes in. The story does take a while to get going, and even longer to engage you. But when it does, you're in for a real treat, especially for film buffs. The bulk of the plot is a loving homage to Chinatown, but there are numerous other film references throughout, particularly, and understandably, to classic westerns. The film looks great, filling a wild-west frontier town with hyper-real anthropomorphic animals, and giving your eyes a feast in extremely creative action set-pieces. The voice acting is top-notch, particularly Johnny Depp who makes Rango a classic good-natured lovable loser, Ned Beatty who tips his hat to John Huston as the town of Dirt's devious mayor and Bill Nighy who channels the venomous spirit of Jack Palance's bounty hunter character in Shane. Gore Verbinski is back on form, having made a clever, quirky, funny, character driven film more akin to the first Pirates of the Caribbean than their overblown and hectic sequels. The ending of the film is a little sudden and unsatisfying (though, happily it does contain the classic \"riding into the sunset\" shot) and the eco message is crow-barred in, but there is plenty in this rich, intelligent and humorous animation to satisfy."}, {"rating": "8", "text": "I sat down recently with Rango, Not really expecting too much from it.The movie was Surprisingly, good!Pro's:- Excellent visuals- Enjoyable characters- Funny!The bad:- Did drag a little- Somewhat predictable/clichÃ©8/10"}, {"rating": "7", "text": "Who said animation has to just be for kids. The film tries to run with this idea but falls short with a overall childish plot. I have to give credit where credit is due, though the plot was lacking the film stayed true to western film culture leaving a child friendly 21st Century wester that can be cherished and because of that it gets a bump from 5 to 7."}, {"rating": "10", "text": "A very good movie that is definitely not intending for kids.  Not every animated movie is meant for kids people.  Read some reviews of movies before you take the kids out and you won't be surprised.  The dry humor and comedy in it had me rolling in laughter, but I do have a very sarcastic and dry sense of humor myself.  If you want a laugh and a good time watch Rango."}, {"rating": "10", "text": "It started out, what the heck did you buy this for?  I then started hearing all kinds of different lines from all the old westerns from the 70's and 80's and then realized my wife did right.  Awesomely funny!  The Spirit of the West was the absolute.  Who'd of thought Olyphant as Clint, perfect.  Loved it, Loved it, Loved it."}, {"rating": "10", "text": "I never heard of this movie until i went to see it in the cinema on the kids club a few weeks ago. I really enjoyed it and my 7 and 8 year old did too. Its not the traditional animated movie id thought it be. It has a strong story coupled with some amazing voice acting and some truely breath taking animations. Its fun, silly and sometimes serious in places but this is the best animal crossover modern western movie ever put to film. Its not suprising that this is up for oscars next year. Very very good film, Johnny Depp is amazing as Rango and his supporting cast are fantasic too. Highly recommend to see this film and own it on DVD, I hope they make another style of movie like this. It is truely an epic tale."}, {"rating": "8", "text": "This is not a movie i would have payed money to see in theaters.But  when i ended up watching it with my nephew  , i was sucked in by the childish antics swirled together with serious issues.I was surprised that a movie with Johnny Depp as a cartoon lizard ; would address such issues as political corruption , resource manipulation , and political assassination.That coupled with  a very monkish armadillo , had my interests peeked and i had to watch it till the end.The only thing i had trouble with was the villainous turtle .But as the story unfolded , the depth of his evil became very apparent.If your looking for a movie to watch with a young one , i highly suggest it !"}, {"rating": "9", "text": ", click expand to view"}, {"rating": "8", "text": "A la fois parodie et hommage aux films Ã  la Sergio Leone, Rango est un vÃ©ritable bijou d'animation qui use de bon nombre de trouvailles comiques et de rÃ©fÃ©rences Ã  gogo (Las Vegas Parano, Arizona Dream, Apocalypse Now, Pulp Fiction...), dont les personnages reflÃ¨tent Ã  merveille le jeu des acteurs (ah, Johnny Depp...). Un film d'animation? On pourrait mÃªme dire un vÃ©ritable western spaghetti!!"}, {"rating": "7", "text": "Movie makes up for a few story faults by the gorgeous animation and quirkiness. My 6 & 9 year olds kind of liked it and I kind of liked it so that is good enough for a 7."}, {"rating": "9", "text": "ts...Very...Weird, But in a good way, Depp did a fantastic job as Rango, along with Bill Nighy as the snake, and Ned Beatty as the mayor, Though my only problem is that, well one its very weird and by weird i mean, weird like its never mentioned again, like the tunnel in willy wonka, And there is al ot of stuff that could be skipped over and it wouldnt have made a difference on the plot, Half the animals i couldn't tell what they were. But the movie was just decent overall, its at least worth seeing once but its a movie that you have to make your mind up for yourself, the weirdest part however is when Clint Eastwood (known as the spirit of the west) Appears in a vision or something to rango. Its a very strange movie and is definetly not for kids, There are several sexual references, And 9 uses of hell and one point the snake says \"Sign the Damn Paper!!!!\" But it pays homage to some of the old western movies with a funny little reference to \"Fear and Loathing in Las Vegas\" Which is also funny knowing how Depp was also in that movie. All in all a fairly decent movie with some good action, plot, and some good comedy"}, {"rating": "8", "text": "Rent-it - Johnny Depp truly is Rango, a pet chameleon accidentally stranded in the Nevada desert, and just like Depp, Rango is charming, smart, creative, beautiful, and definitely not for kids! Though it definitely is an early front-runner for Best Animated Picture in 2011."}, {"rating": "10", "text": "The voice talent is undeniably awesome, especially Johnny Depp, and the story is highly original and creative. Rango thoroughly exceeded my expectations. 4/4 stars."}, {"rating": "10", "text": "Rango has a great story. There is a big mystery behind it too, which also keeps you guessing. The visuals are amazing. The characters are so realistic."}, {"rating": "6", "text": "Somewhat entertaining and well animated film, a few laughs and the snake is cool."}, {"rating": "8", "text": "Rango is a hilarious burst of originality, charm and humor with even a bit of chills. The film benefits from dazzling animation and Johnny Depp's colorful vocal performance. The film even succeeds even if it does have a bit too much innuendo. I give this film 83%."}], "recommendations": ["the_croods", "rio", "shaun_the_sheep_movie", "puss_in_boots_the_last_wish", "ratatouille", "atlantis_the_lost_empire", "flushed_away", "the_lego_movie", "kung_fu_panda_2", "cars", "paranorman", "rio_2", "kung_fu_panda", "my_little_pony_the_movie", "ice_age_the_meltdown", "hotel_transylvania", "smurfs_the_lost_village", "meet_the_robinsons", "madagascar", "zootopia", "the_call_of_the_wild", "rise_of_the_guardians", "the_peanuts_movie", "peter_rabbit", "the_lego_batman_movie"]}