{"id": 4516, "title": "Ransom", "starring": ["Mel Gibson", "Rene Russo"], "runtime": 121, "genre": ["Action", "Thriller"], "description": "When a rich man's son is kidnapped, he cooperates with the police at first but then tries a unique tactic against the criminals.", "releaseYear": "1996", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/kFShhVUU5LfGmLvo9OJGM8dyDFL.jpg", "categories": {"plot": 5.176470588235294, "acting": 5.761904761904762, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "A good movie again went underrating ! This will keep you glued to the seat till it ends, guaranteed. The plot is pragmatic no flows either."}, {"rating": "0", "text": "Mel Gibson & Gary Sinise are awful in this thriller. The movie is very boring and the themes are highly exaggerated. This movie is totally flat and utterly unrealistic."}, {"rating": "5", "text": "Average at best and I hate Hollywood on remakes. I liked the original better with Ford even if it is a bit dated now. Nothing special here but worth a watch if bored."}, {"rating": "4", "text": "A simple, predictable film and where the best are the good performances of Gibson and Sinise.This movie is quite simple: A group of criminals kidnap the young son of a businessman who is being prosecuted on a bribery charge demanding two million dollars in ransom. The entire movie is basically set in the family drama surrounding kidnapping and the father's attempts to get his son back safe and sound.The movie works reasonably. It starts off very well, but the final part is pretty bad, predictable and unrealistic. It all rests on the backs of Mel Gibson and Gary Sinise, two very capable actors who were very effective in their respective roles, managing to give a certain dramatic depth to a film that would have far less quality without them. In fact, the characters of the two actors are classic antagonists to each other, in that they are all that the other is not and are destined to face an epic and climactic final confrontation. The rest of the actors have less visible characters who provide the necessary support: Rene Russo is quite good, even when hysterical. Lillie Taylor is dark and looks a bit sadistic, while Liev Schreiber and Donnie Wahlberg have poorly made characters who look totally amateur in the criminal world. Delroy Lindo, meanwhile, did what he could, but his character also seems totally lost and unsure what to do in most of the movie.Ron Howard did a good job of driving, but he could have done better and noticed some problems he didn't. Personally, I think the movie has some rhythm problems: not only does the abduction happen too early, preventing us from establishing a bond of empathy with the kidnapped child, but the role of Sinise's character in the young man's disappearance could have been revealed closer to her. end of the movie. The choices made here took strength and impact out of the entire movie, as we already knew everything that was going to happen."}, {"rating": "7", "text": "WTF????? What is wrong with the stupid public gaving negative reviews...\r A very solid Ron Howard movie about kidnapping, Mel Gibson is Perfect as ever here, Rene Russo is great, and the co. stars too, Some Iconic scenes of 1990's movies you find here!!!"}, {"rating": "8", "text": "The star of this isn't Mel Gibson (although his performance here is up there with his career best), but rather Gary Sinise, who in the role of Jimmy Shaker has portrayed one of the most criminally underrated villains in modern cinema. Genuinely cold, terrifying and chilling in his persona.\r The movie itself is very well delivered and holds up almost 20 years later. The mob connection subplot is the weakest thread of the script and isn't played out as well as it could have been, but the pacing is excellent throughout, the suspense nailed down to an artform and is a thoroughly enjoyable watch."}, {"rating": "6", "text": "A quality movie but one would expect more from Gibson and especcialy Howard after Apollo 13."}, {"rating": "6", "text": "Decent enough thriller, carried by a great performance by the legendary Mel Gibson. The plot is entertaining, but disintegrates into cartoonish nonsense the further on it goes. It feels like it doesn't know itself how seriously it should take itself, and maybe suffers a bit from that. Still, worth a watch."}, {"rating": "8", "text": "From where there are so much negative responses? The movie has turned out not bad. The plot is registered not badly, there are several excellent subject twists. It is just not the bad thriller with stealing, it is difficult to make something unique with such format. Mal Gibson has played not badly, not Mad Max of course, but at the worthy level."}, {"rating": "10", "text": "Mr. Howard has made Ransom in the same clean, swift, logical style that sent his \"Apollo 13\" into orbit, resulting in a spellbinding crime tale that delivers surprises right down to the wire."}, {"rating": "10", "text": "Mr. Howard has made Ransom in the same clean, swift, logical style that sent his \"Apollo 13\" into orbit, resulting in a spellbinding crime tale that delivers surprises right down to the wire."}, {"rating": "10", "text": "Mr. Howard has made Ransom in the same clean, swift, logical style that sent his \"Apollo 13\" into orbit, resulting in a spellbinding crime tale that delivers surprises right down to the wire."}, {"rating": "10", "text": "Mr. Howard has made Ransom in the same clean, swift, logical style that sent his \"Apollo 13\" into orbit, resulting in a spellbinding crime tale that delivers surprises right down to the wire."}, {"rating": "9", "text": "When I first went to see this it was an 18. Wow can’t believe it’s 1996 when this great thriller was made. Ok firstly it’s not a classic and it won’t be in many people’s top tens but the thing I like about this, it’s not your typical kidnap thriller. Ron Howard directs. Mel Gibson & Rene Russo star. Their boy Bradley Nolte (yes Nick Nolte’s son) gets kidnapped, the kidnappers want $2 million or the kid dies. Simple. But things don’t always go to plan as everyone knows. Just watch Man On Fire again a brilliant revenge thriller. But it’s the tension, the suspense, the twists and some very good performances from the cast. And Gary Sinise after his awesome performance in Apollo 13 turns in a very creepy but brilliant performance as the cop/baddie. I thinks it’s a brilliant thriller with a lot potential and yes some people won’t like it, that’s opinions and films for ya."}, {"rating": "6", "text": "No More Negotiations.RansomHoward's thriller drama respects the genre like never before. His focus to create a crisp tense environment is clearly visible and pays off more than enough. This is a more grounded version of such commercial films, it thrives more upon the drama than it does on antics. It also has a script that demands good performance from its cast, it gives them enough room and range to factor in equally. And even though there are few dodgy lumps and questions that can be raised here and there, in order to really enjoy Howard's thrill, it demands few plot points to be scoffed off immediately.One of the best bits of the film is mapping out the territories of their characters, no matter how obvious or cheesy it may sound like, this is all a big bluff coming from Howard, and they way he puppeteers these characters on screen is his masterful skill. To be fair Howard has a balanced script, that dares explore on either side of the drama, one that challenges the antagonist politically and one that challenges the protagonist emotionally, separating them with clean sharp vocab lies Howard and his execution. Gibson as the devil himself, or so he claims to be, has a very potent but risky play to play.And with Russo supporting him decently, this parenting part of the drama is in safe hands. Sinise, the antagonist, has a juicy role to play, brimmed with revelations and main antics of the script in his hand, he makes sure that the irritation communicates thoroughly if not the fear. Ransom is a mature if not smart tale of ego clashing head to head on screen, the result is stupendous that brings out a potential contender on both the side of the party, satisfying every last requirements of a weekend night."}, {"rating": "10", "text": "Ransom is a 1996 crime thriller starring Mel Gibson, Delroy Lindo, Rene Russo and Gary Sinise...... Gibson plays Tom Mullen who's a millionaire and has a wife named Kate Mullen who's played by actress Rene Russo in the movie... Some weirdo named Jimmy Shaker (Gary Sinise) who's actually a cop believe it or not kidnaps Tom Mullen's (Mel Gibson) son and holds him for ransom demanding money or something while Mel Gibson is still trying find out who the kidnappers are and where they are and where his son is. It's a race against time to find his son alive instead of dead and Tom Mullen (Gibson) must follow Shakers (Gary Sinise) demands and cooperate however Shaker is not alone as the kidnapper because others are working with him and hiding the boy... Ransom is full of riveting performances, suspense, tension, intrigue and fairly decent acting. Violence and bad language is ever present in Ransom too and fairly well made I guess most of it."}, {"rating": "10", "text": "Es tensa, dramática y muy épica, es una de las mejores películas de Mel Gibson.¡TOTALMENTE RECOMENDADA!"}, {"rating": "7", "text": "Jor, war ganz okay. Erinnerte mich irgendwie an \"Heavy Rain\" so ein bisschen, auch wenn die Story in eine andere Richtung am Ende geht. Kann man sich mal anschauen."}, {"rating": "10", "text": "Mr. Howard has made Ransom in the same clean, swift, logical style that sent his \"Apollo 13\" into orbit, resulting in a spellbinding crime tale that delivers surprises right down to the wire."}, {"rating": "10", "text": "Mr. Howard has made Ransom in the same clean, swift, logical style that sent his \"Apollo 13\" into orbit, resulting in a spellbinding crime tale that delivers surprises right down to the wire."}, {"rating": "10", "text": "Mr. Howard has made Ransom in the same clean, swift, logical style that sent his \"Apollo 13\" into orbit, resulting in a spellbinding crime tale that delivers surprises right down to the wire."}, {"rating": "10", "text": "Mr. Howard has made Ransom in the same clean, swift, logical style that sent his \"Apollo 13\" into orbit, resulting in a spellbinding crime tale that delivers surprises right down to the wire."}], "recommendations": ["fracture", "the_lincoln_lawyer", "the_fugitive", "insomnia", "primal_fear", "money_monster", "true_romance", "arbitrage", "conspiracy_theory", "from_hell", "state_of_play", "spy_game", "triple_9", "the_iceman", "blood_father", "the_judge", "training_day", "inside_man", "all_the_money_in_the_world", "a_few_good_men", "the_score", "street_kings", "son_of_a_gun", "outbreak", "the_quick_and_the_dead"]}