{
  "id": 325,
  "title": "Ratatouille",
  "starring": [
    "Patton Oswalt",
    "Ian Holm"
  ],
  "runtime": 111,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "description": "Remy, a resident of Paris, appreciates good food and has quite a sophisticated palate. He would love to become a chef so he can create and enjoy culinary masterpieces to his heart's delight. The only problem is, Remy is a rat. When he winds up in the sewer beneath one of Paris' finest restaurants, the rodent gourmet finds himself ideally placed to realize his dream.",
  "releaseYear": "2007",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/t3vaWRPSf6WjDSamIkKDs1iQWna.jpg",
  "categories": {
    "plot": 7.476190476190476,
    "acting": 7.454545454545454,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 3.0,
    "familyFriendly": 7.833333333333333,
    "funny": 9.8,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Let me just say that I hate and have no respect for Patton Oswalt whatsoever for reasons I'd rather not discuss. But watching this movie, I could easily forget he's the voice of Remy, becuase I loved everything about this movie. As always Pixar, great job!"
    },
    {
      "rating": "10",
      "text": "In my opinion, THE greatest animated film of all time, and one of the greatest all-around films of all time. It's perfect."
    },
    {
      "rating": "10",
      "text": "It seems so sad that some of the the fan written reviews written on this site are below the score of a 10. This movie is so appealing to the eye and has such a wonderful story that I do not understand the horrible reviews the fans have been giving it? Are you all just trying to be different because everyone seems to like the movie and you have some kind of problem with an animated pixar film? Suffice it to say, whomever have scored this movie in the yellow or red are officially morons."
    },
    {
      "rating": "9",
      "text": "This is a Pixar film that really appeals to both children and adults. The beautiful animation, the humor, the look inside a French restaurant kitchen are for the grown-ups. And there's also plenty of silliness and excitement for the kids. And this animated Paris is breathtaking - I wanted to jump right on a plane."
    },
    {
      "rating": "10",
      "text": "This movie hits an excellent balance of humor and emotion. Remy is a great protagonist, the kitchen staff is fun, and the critic has the single best monologue of any character in any Pixar film. The movie isn't perfect, but it is definitely good enough to earn a 10/10; the slower moments are made up for by the quality of the rest of the film."
    },
    {
      "rating": "10",
      "text": "Out of all 12 Pixar films, Ratatouille has to be the finest if only because it is one of the most visually stunning movies ever made. While other films try to show off the majestic look of Paris (Midnight in Paris, Taken and Monte Carlo) they never really succeed and its odd that the film that finally pulls it off isn't even live action. If anything Ratatouille is the most grown up of the Pixar fold (even Up) with the story being remarkably layered and engrossing. Sure the beginning is a bit slow but the slow build works because when Remy finally crawls out upon the magnificent vista that is Paris the film takes flight. It is a fast paced story of a rat named Remy (Voiced by Patton Oswald) who has always wanted to be a chef despite his obvious limitations He finally gets that chance thanks to an inept yet lovable human named Linguini (Lou Romano). There are some truly stunning parts of Ratatouille but you I won't ruin them because they really are fantastic. Of course it is a film for both child and adult as every other Pixar film but the thing that holds it up above all the others is the fact that the film builds as it goes. Unlike Up which has a brilliant opening sequence but doesn't live up to it, Ratatouille gets better as it goes with one moment near the end with Peter O'Toole's Ego being a brilliant piece of film despite the fact there are absolutely no words spoken. It is a classic film that gave me lots to think about after I watched it and even more after I watched it again. A real masterpiece."
    },
    {
      "rating": "7",
      "text": "Its very very difficult to get food appetizing in a cartoon and the animators did a great job in this movie. I enjoyed the culture of the film but the overall story was a little too predictable and standard, perhaps the movie needed more laughs. It's not Pixars best but Ratatouille was a fun and worth while animated movie."
    },
    {
      "rating": "10",
      "text": "This movie is the start of a flawless four film streak by Pixar from 2007's Ratatouille to 2010's Toy Story 3. This one is one the especially strong Pixar efforts in terms of Comedy. There's also a pure artistic appeal to the whole film, wether it's the animation itself, the French sets or the whole animated city of Paris, this movie seems like one of the most delicately executed and thought out  films of 2007"
    },
    {
      "rating": "10",
      "text": "Ratatouille is funny, original, heartfelt, well voice acted and beautifully animated. As Pixar makes more and more movies they make just fantastic films like Ratatouille. I give this film 96%."
    },
    {
      "rating": "10",
      "text": "Another wonderous achivement from Pixar that marks a major return to from after last year's 'Cars' came up short. A rich blend of comedy and pathos. Technically accomplished and visually stunning at times, 'Ratatouille' never forgets it's a story first and foremost. Bird and co. have lavished just as much attention to the script as they did the animation. The very reason Pixar is so far ahead of the pack."
    },
    {
      "rating": "10",
      "text": "The fact that a 3-year-old, a 6-year-old, and three adults can sit for two hours and be mesmerized by this wonderful movie says it all. Each Pixar movie gets better. This one is the best. Nothing was trite, nothing was too hip to keep it from being timeless, and nothing was formulaic other than the mild relationship to \"Ben and Me\". Just when you thought it was over, you say, \"Wait; what about Ego the food critique?\". And so it goes. Animation was magical and spectacular, and the character development was first-rate. I have already reserved a copy for me and for my grandkids from Amazon when its out for distribution."
    },
    {
      "rating": "10",
      "text": "This movie was a total delight, from start to finish. Unlike most \"children's\" movies, there was no annoying sidekick character playing the buffoon; the humor was wonderful--both kids and adults were hooting all around me; and the art of it was unbelievable--scratches on the copper pots, bubbles in the soup, realistic details everywhere. And in Paris, I enjoyed the \"special\" details cleverly tucked into the background--the \"no smoking\" poster in French, the traffic, the Bateaux Mouches, the Notre Dame rose window. I have loved movies my entire life, and this one is clearly in My Favorite Top 10!"
    },
    {
      "rating": "10",
      "text": "Not an animated film, a great movie. Well written, funny, well directed. This is what movies are all about."
    },
    {
      "rating": "10",
      "text": "While children will doubtless find this entertaining, there are much deeper issues permeating the latest PIXAR masterpiece. This is a film speaking directly to the adults in the audience while keeping the children occupied. The clumsy surface antics and clever dialogue will keep people in stitches while Bird and company tell a story about art, passion, and what drives people to create in the face of adversity. It's about following dreams, heeding the heart, and how perseverance can lead to triumph. Told and presented in a flawless technical skill, through characters and situations only PIXAR could deliver. This is a form of perfection, and do not deny yourself the experience."
    },
    {
      "rating": "10",
      "text": "One of the best Pixar films ever made. Beautiful to behold; it's a masterpiece."
    },
    {
      "rating": "8",
      "text": "Very good, but a little too sweet for my liking."
    },
    {
      "rating": "8",
      "text": "not my favorite movie, but it has great entertainment, great writing, and most of all: great animation.\r Rating: 85%"
    },
    {
      "rating": "10",
      "text": "This is one of Pixar's best movies yet. Remy the rat wants to become a chef and his dream comes true when he accidentally ends up in Paris and and discovers a 5-star restaurant."
    },
    {
      "rating": "3",
      "text": "I honestly walked away from this feeling largely indifferent. The plot doesn't do anything unexpected, The characters are typical tropes. TBH, I just didn't care for this movie at all."
    },
    {
      "rating": "8",
      "text": "Certainly not Pixar's most laughable film to date, Ratatouille features a flawlessly executed concept and story in the world of Paris. In addition to its stunning animated visuals, you'll find above-standard voice acting from talented actors such as Ian Holm and Patton Oswalt. Although a little light on food content, I regret having waited this long to see this one."
    },
    {
      "rating": "9",
      "text": "Ratatouille has more life, meaning and intelligence then almost every film out there. Pixar has always done a fantastic job of reaching out to children, while drawing adults in and Ratatouille is no exception."
    },
    {
      "rating": "10",
      "text": "Simple and genius in one pot. Good example of flawless quality of Pixar movies. Good for any ages, almost 2 hours of good laugh and relaxing watching guaranteed."
    },
    {
      "rating": "10",
      "text": "Even though it's rated G, this film has such an adult way of playing out and is very sophisticated. It is a melting pot of a movie. You get a little bit of French cooking, the secret ways of how a restaurant operates, you get a feel for 1930's Paris, and most importantly you feel the clique between Linguine and Collette. All of these elements come together in one helluva movie."
    },
    {
      "rating": "10",
      "text": "This one of the reasons pixar is great.They can make anyone or anything lovable. Evan if it is a rat. Remmy is a good black sheep,and every time  I watch this movie it makes me hungry."
    },
    {
      "rating": "9",
      "text": "Does anyone really want to see a film about a rat – you know, one of those promiscuous, verminous beasts who haunt sewers and spread deadly disease – working in a restaurant? On paper, hell no. From Pixar, yes with (dinner) bells on. Ratatouille overcomes any intrinsic ick-factor thanks to the bottomless charm of its teeny rodent hero, Remy (voiced by US comic Patton Oswalt). With its plate-wide eyes, pencil-eraser nose and ability to make the omelette of your dreams, this mini master chef couldn’t be cuter if its name was Nigella. Witness the turning-point scene where hapless gourmet-diner garbage boy Linguini (Lou Romano) quizzes the far-from-home critter (who understands English, but only speaks it with his own species) on his culinary talents: Remy’s adorably coy nods and self-deprecating shrugs prove yet again that Pixar has no peer when it comes to nailing the nuances of expression.\r Yes, Ratatouille thinks small, but with big results. Scripter/director Brad Bird rolls back the sweep of The Incredibles and doesn’t shoot for The Iron Giant’s emotional swell. Instead, he whips up a deceptively frothy soufflé. And, like any great cook, he knows that the trick lies in keeping all the ingredients in delicate balance. So there’s the sweet but not too sickly buddy-buddy relationship (a Pixar staple) between Linguini and Remy, the former becoming the toast of the town as he covertly channels the latter’s flair for French cuisine (via some deft hair-pulling puppetry) into new, delicious dishes. There’s also the obligatory moral (“Anyone can cook”), gently stirred in rather than shoved down the throat. And then we have the meaty chunks of chase action, Remy scampering through the niftily choreographed chaos like a four-pawed Buster Keaton (usually in flight from his Napoleonic nemesis, Ian Holm’s head chef Skinner).\r The pace never gets as overheated as the similarly ratty Flushed Away, though; after all, we are in dreamy Paris, a place-setting Bird lushly romanticises (dewy by day, coruscating by night) without going in-Seine. In fact, he’s not above a sly pop at the locals: “We hate to be rude... but we’re French,” quips Linguini’s tough-cookie love interest Collette (Janeane Garofalo). Ratatouille’s biggest beef, however, is with pernickety hacks, embodied here by poisonous, cadaverous restaurant reviewer Anton Ego (a super-snooty Peter O’Toole). As the film winds down, it fires up a from-the-heart polemic against professional critics. A pre-emptive attack, perhaps, after the mixed notices for last year’s Cars? Retaliation seems unlikely, though; while few will grade this among Pixar’s best (over-generous running time; solid but – O’Toole aside – unexceptional lung-work; one or two belly-laughs short), it’s too sophisticated, zesty and nourishing to be dismissed as fast-food entertainment. Anyone can cook? Not like this.\r Novel in concept, exquisite in execution, another family feast from Pixar suitable for all palates. Not a studio chef d'oeuvre, perhaps, but still the richest of this year's animations. Don't miss the starter course, hilarious space short Lifted."
    },
    {
      "rating": "9",
      "text": "Probably one of the most outlandish ideas as far as the culinary world goes (a rat cooking?!), but this is one beautifully visualized film. I loved the characters, and despite the cliched subplots that wove together to make the film what it is (no details without spoilers), it never quite felt unbelievable. Recommended for children and adults alike."
    },
    {
      "rating": "8",
      "text": "Ratatouillie's metascore is 96 because I Like this Film because it reaches Universal Acclaim and A lot of People like this Film Yahoo!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "This is the best animated movie I have ever see, Ideal for kids. Fantastic and fabulous are the only words I can say. Entertainment + Emotions + Inspiration + Soothing Music = Ratatouille Best I've seen so far!"
    },
    {
      "rating": "10",
      "text": "My life has been restored. My daughter fell in love with this little ratty boy and was him for Halloween (but the costume was horrifying). Anyways, this movie has it all: food, rats, and accents. I feel whole again to know that there's actually a good movie out there."
    },
    {
      "rating": "10",
      "text": "Best Pixar film? Maybe, Best 2007 film? definitely!! Ratatouille is a masterpiece that everyone will love. The characters, the humor, the memorable moments and basically everything in this movie is exellent. A delicious buffet.Note: Sorry for my english, im from Costa Rica."
    },
    {
      "rating": "8",
      "text": "\"Ratatouille\" is a movie created for only the Westerners and ends up appealing to both western and eastern people."
    },
    {
      "rating": "0",
      "text": "I can't believe this movie got 96 when i feel a sleep because i was so bored. This movie was supposed to be better then all the pirates, transformers, and lord of the rings. NO WAY! 6th best movie ever. Metacritic is unreliable and has low movie ratings for all teen movies and good ratings for all adult movies and boring kids movies!"
    },
    {
      "rating": "9",
      "text": "Watching it gets me hungry, and it has its  fun moments and great appeal. If you don't like it, thats just shocking then. Because this is the best Pixar film by far"
    },
    {
      "rating": "1",
      "text": "i cant stand this movie and i couldn't stand it when i was a kid and it made me not want to eat at restaurants for a while after watching itits about a sewer rat and yes the main character is a sewer rat that is obsessed with cooking and is considered the black sheep of his family and ends up working in a restaurant secretly while helping an incompetent chef cookthe ending made the whole movie worst for me it was awful already"
    },
    {
      "rating": "4",
      "text": "I really didn't enjoy this film, i'm a bit disappointed actually. I was looking forward to seeing it, I mean, the advert was quite good. But after watching the film I realised that the bits that were in the advert were the only good bits in the film, and that's not that many."
    },
    {
      "rating": "9",
      "text": "\"Ratatouille\" is a classic Pixar animation and a fantastic accomplishment. The animation is brilliant (as usual), it's well-directed, the script is intelligent and is consistently humorous. Pixar movies are textbook examples on how to make films for both kids and adults."
    },
    {
      "rating": "3",
      "text": "Beautifully animated, poorly written. Some of the most uncomfortable, cliched, awkward script moments ever. The movie seemed to try to go in two different directions and failed to give the audience a sense of completeness. Was it about Linguini's romantic struggle? Or was it about a rat who could cook? I had to dull out my brain in order to bear some of the inconsistencies in the movie. I am not surprised this movie got high ratings however. These days people will take anything shiny and distracting."
    },
    {
      "rating": "10",
      "text": "This movie is really outstanding! The graphics were excellent, the theme is great, the plot is mesmerizing, the characters were amazing. Everything in this film were fantastic. This is a true masterpiece..."
    },
    {
      "rating": "10",
      "text": "Simply One Of The Best Movies Of 2007!\rOne Word For This Movie: Amazing"
    },
    {
      "rating": "5",
      "text": "Good ideas. Visually excellent. But not very funny. And worst : Again and again in an US movie about France, the action is in the present, but the Paris you see is like the 60's. Black and white TV, cars of 60's... I was disappointed."
    },
    {
      "rating": "1",
      "text": "This film is a visual masterpiece, no question about it, but the tremendous work put into it is completely wasted because of the boring and mindless plot. It's about a rat who reads French cookbooks (I assume he can read in countless other languages  too). The ghost of a deceased chef haunts our cute creature. (How did he stumble upon a rat in the first place?) Remy learns a lot from the chef's recipes, and shares his immense knowledge with a nerd with no talent whatsoever, using him as a puppet, and this bizarre double act self-evidently outdo any well trained cook in Paris.  Moreover, the food critic whose devastating review made the former chef of the restaurant (our strange ghost) commit suicide, is enchanted with the dish based on the recipe of aforementioned chef, but prepared by our nerd who is guided bye the highly literate rat. This goofy mess of a story could still be partly compensated by a decent amount of jokes, but there is hardly any trace of them.  All we left with is the stunning animation."
    },
    {
      "rating": "3",
      "text": "the best part of this movie is its soundtrack--and it's not even a musical. the score is the only element with range (ooooh and every transition is seamless!), while the characters are underdeveloped and (...wait for it...wait for it...) flavorless--ha!, and the colors are as dazzling as the arc de triomphe in fog. hell, even janeane garofalo manages total insipidity! her covert vocals are wondrous to be sure, but only magnify that Colette (a fair-weather feminist) does nothing to jazz up her wet noodle, Linguini (yukyuk), who in turn gives the evil Ego less than zilch to bounce off of. now, please don't think me hard-hearted. i am a vegan who's been madly in love with three people, angus, matty and pouter--a scotch terrier and two cats. nothing makes me happier than to see animated creatures with personalities, facial tics and accents just as disparate and human as their real-life inspirations. oooooh, inspiration...where's that on the menu?"
    },
    {
      "rating": "2",
      "text": "By far one of the weakest recent animation films. The story is predictable and the script is banal without a hint of cleverness. Great for 10 year olds and Disney sycophants."
    },
    {
      "rating": "10",
      "text": "There are moments in \"Ratatouille\" that works on us in a primal way, like Ego who remembers the titular dish that his mother served him as a child. The pompous critic remembers why he loves food, as this dazzling comedy(you forget you're watching an animated picture) reminds us why we love the movies. \"Ratatouille\" is so sophisticated, there's an extra tier of sophistication that will fly under the radar of most moviegoers. \"Ratatouille\", to my utter disbelief, has references to the Canadian filmmaker Atom Egoyan and his film \"Felicia's Journey\". Ian Holm, who voices the role of Skinner, the chef in exile, was in Egoyan's \"The Sweet Hereafter\". This is such tremendous fun for cineastes because we can't understand why it's there in the first place. This piece of trivia is irrelevant to enjoying \"Ratatouille\", but the references are there, nevertheless. In an ordinary film, it's Linguini(voiced by Lou Romano) who'd be delusional(that a rat is actually doing the cooking), but in \"Ratatouille\", it's the delusion(from Skinner's point-of-view(he's the first person to see the rat); Skinner, who reminds me of that single person who sees the duck in those Aflac commercials) who has delusions(Chef Gusteau is Remy's muse). \"Ratatouille\" also has references to Carol Emschwiller's novel \"The Mount\" and Gary Larson's \"The Far Side\". And if you remember Ralph Fiennes' wine cellar speech to Embeth Davidtz in \"Schindler's List\", \"Ratatouille\" can be interpreted as a fantastical parable that sutures the rift between Jews and Germans. \"Ratatouille\" is a truly extraordinary movie that makes you laugh, cry, and most importantly, think. This is Pixar's high-water mark, and that's really saying something."
    },
    {
      "rating": "10",
      "text": "A fabulous movie. I took my daughter and was amazed. I love to cook and the film captured the rapture of cooking, paris and well rapture. I loved the visual and musical depictions of Flavour which reminded me of old Canadian National Film Board cartoons. It was a fantastic movie."
    },
    {
      "rating": "10",
      "text": "Ridiculously good. I liked it better than both The Incredibles and Cars."
    },
    {
      "rating": "3",
      "text": "We did not like this movie- visually impressive but should have been a 5-10 minute cartoon."
    },
    {
      "rating": "1",
      "text": "It was miserable, How could it get a 96, it was terrible."
    },
    {
      "rating": "3",
      "text": "This movie just aint that good. It kinda bored me!"
    },
    {
      "rating": "1",
      "text": "How can u be so stupid (or, poopid) , Metacritic? ra-ta-too-ee should have got like 15% instead of being da 6th best film EVER! I agree with Cameron A. HOW CAN EVERYONE BE SO STUPID?!?!? I'm starting to feel that metacritic is slightly dumb. IDIOT!!!"
    }
  ]
}