{"id": 51, "title": "Raya and the Last Dragon", "starring": ["Kelly Marie Tran", "Awkwafina"], "runtime": 107, "genre": ["Animation", "Family", "Fantasy", "Action", "Adventure"], "description": "Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. But when an evil force threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, that same evil has returned and it’s up to a lone warrior, Raya, to track down the legendary last dragon to restore the fractured land and its divided people.", "releaseYear": "2021", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/lPsD10PP4rgUGiGR4CCXA6iY0QQ.jpg", "categories": {"plot": 4.581632653061225, "acting": 4.063492063492063, "ending": 7.6923076923076925, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 5.8, "funny": 5.857142857142857, "action": 7.4}, "reviews": [{"rating": "8", "text": "The movie was pretty interesting,very colorful with amazing landscapes!However the story doesnt make sense in some parts of the movie."}, {"rating": "7", "text": "Great setting and visual design. Some questionable character design. Forgettable soundtrack with absolutely not a single song during the movie like other Disney animation studios films. Story felt rushed and poorly written along with bad actors. Other than that the visual design and world design is great"}, {"rating": "8", "text": "Not Disney's best, but certainly not their worst. Since it's on Disney+, you might as well check it out."}, {"rating": "10", "text": "Quem disse que toda trama de animação vive de final feliz, pelo menos não no amor, Disney anda inovando com temas interessantes como feminismo, o poder da mulher, sem preconceitos.'Raya e o Último Dragão' é bom pela história que é contada desde criança, em retrospecto contando até chegar na fase adulta que ela tenta proteger seu povo em uma luta árdua contra os inimigos.Bem, o filme traz uma perspectiva nova com muita cultura e cores, um dos mais promissores filmes desse ano, com belos gráficos é bom do começo ao fim, roteiro bem estruturado, nada de clichês de animação, uma história autêntica digna de um Oscar.Acredito que a Disney está vendo que 'princesas' não vingam mais, o mundo está mudando, isso eu percebia desde 'Frozen' que era uma princesa porém não se casou com ninguém, a história de final feliz nos filmes de animação nem sempre é um amor, casa e banho mas pode ser um final feliz tipo como esse de Raya salvando a sua aldeia e lutando por seu povo, excelente filme!"}, {"rating": "6", "text": "Premise sketchy. HD nice. Follows the Disney script, which makes it bland. Basically watch as visual candy."}, {"rating": "4", "text": "Raya and the Last Dragon is a movie that wants so very badly to be great. It's got great visuals, a great score, some enjoyable side characters, and is pretty edgy at times... So why is it so mediocre?While the side characters are kinda fun, they're pretty underdeveloped. There's a ton of cringe-worthy \"modern\" talk that feels out of a place for a movie set in ancient Southeast Asia, Sisu is a major tone-killer that's arguably worse than Olaf in Frozen II, and the attempt at the trust message is just so messy and heavy handed that it tanks the movie as a whole. I never felt like the rival girl deserved a chance at redemption because she did literally nothing to show that she deserved it.I've seen worse, it's not even within Disney's bottom 10 animated movies, but I don't think I'm ever gonna watch it again."}, {"rating": "4", "text": "Here's a movie that happened that nobody talks about or praises less than a year later.It could've been one of Disney's best, it's got a lot of great ideas, but in execution it's heavily flawed and doesn't hold up or get better as it lingers in my mind like Encanto or Wreck-It Ralph or most Pixar movies. If anything, it just gets worse. It should be lucky it's score is still as high as it is.I'll be quite surprised if anyone remembers this fairly mediocre adventure a year from now."}, {"rating": "7", "text": "The movie relies on its pretty visuals to tell the story, which damages everything else in the movie, Raya's character development is a least a bit interesting, but besides her I didn't care for a single other character, and the plot is a bit weak, but the character design and music are very good, which kind of saves the movie for me."}, {"rating": "5", "text": "Raya and the Last Dragon ultimately feels like a story and a world that’s too big to fit into its two-hour run time. Each of the locations and characters felt two-dimensional and left something to be desired as the story simply didn’t have the time to explore them in greater depth.While watching, I could feel how rushed it felt, especially at the beginning. Major plot points, characters, and relationships started to feel more like checkboxes than story beats. Then, once that pace had been set, it inevitably made other more lighthearted scenes feel like a waste of time given how brushed over everything else was.Overall the movie is enjoyable and the message is good, but I feel like Raya’s story would have been better told as a series. If it were a show rather than a movie with less than two hours to pack everything in, perhaps the plot and the characters would have had more room to breathe and develop naturally. Maybe Raya could have been the first LGBT+ Disney princess. (The seeds were definitely there.) Instead, the movie and the ending are exciting but ultimately low-stakes as the audience feels little attachment to the world or the people in it."}, {"rating": "8", "text": "Raya and The Last Dragon is a typical Disney adventure, with a South East Asian flair. It is on par with Moana in term of its quality. However, it doesn't stray with its usual formula despite its stellar production values. Is it worth going to cinemas for it? Considering Covid 19, probably not. But no problem, as it is available on Disney+ on several territories."}, {"rating": "5", "text": "Raya and the Last Dragon - or Raya and her Trust Issues - is a decent but unexceptional CG animated movie from Disney. The movie features vibrant and striking visuals, but a cast of essentially two characters plus a bunch of character shaped props.It is a movie whose moral is that it is only by extending trust can we expect trust in return wherein the ENTIRE PLOT is driven by people backstabbing those who were foolish enough to trust them.No fewer than two characters on two separate occasions are shot and killed by people with crossbows after extending their trust to the wrong people.And this is, ultimately, a major problem with the movie - it not only actively undermines its own moral but encourages the idea that people who hurt you are good deep down inside and just need the chance to show it - even though a number of the people show that they are tribalistic and don't care about anyone outside their tribe.Of course, this coming from the studio that brought us Stockholm Syndrome and the Beast, perhaps this shouldn’t surprise us.But let me back up for a moment.Raya and the Last Dragon is a movie about a young woman named Raya who previously was assigned to protect the Dragon Gem, a magical artifact created by the last of the dragons 500 years ago to hold back horrible fire monsters that were turning everyone in the world to stone. Raya’s father invites the other peoples of the world to the country of Heart to all come together, as they once did long ago, and have there be peace between the peoples of the world.As you might have guessed, this results in the other nations taking advantage of their hospitality to try and seize the Dragon Gem, resulting in it shattering, which causes the horrible fire monsters to come back and start turning everyone to stone, including Raya’s father. The only thing that can hold the monsters at bay are fragments of the Dragon Gem, of which there are five – and the leaders of each of the four other groups seize a chunk, in addition to the piece that Raya herself holds.Six years later, Raya is a grown adult and is searching the world for the last dragon. She eventually finds her, discovering that the dragon has been in a sort of stasis for the last 500 years, but finds out that the dragon can’t just make another gem – that gem was created by the combined magics of the last five dragons, so the only way to fix it is to reassemble all the pieces.Que the MacGuffin hunt.While this might sound like it is a movie about a girl and her dragon, as it turns out, the other main character of the movie is actually Namaari. Namaari is another young woman who appears in the introduction, trying to befriend Raya, only to reveal her actual purpose in doing so was to steal the Dragon Gem. It is Namaari’s fault that the world is broken, and throughout the movie, Namaari is hunting Raya, trying to figure out what it is that Raya is after and to seize the artifacts from her.The two young women clash repeatedly throughout the movie in a number of well-choreographed fight scenes that are nice to watch, and the relationship between them works pretty well – while they hate each other, there’s also a certain thread of familiarity between them, and we see at certain moments that Namaari regrets what happened on some level but doesn’t believe things can be fixed. Of course, this thread of hope is repeatedly dashed as Namaari repeatedly does things to keep furthering the fight between the two young women, and Raya herself is unwilling to tell Namaari what is really going on, concealing her quest from her because of their past together.This is all well and good, but the other characters are extremely flat.Sisu, the titular Last Dragon, is endlessly full of optimism and trust. The movie seemed like maybe it was going to create some sort of middle ground with her, but there is no character development for Sisu. She starts the movie the same way that she ends it, and there’s no real changes at any point.The rest of the cast gets even less screen time, and all rehash the same backstory of having lost their family to the monsters. While there are a couple of good moments here and there, they don’t really get developed.Meanwhile, everyone else in the world has Chronic Backstabbing Disorder, in a movie about trust. And indeed, two of these “party members” themselves backstab the party at some point.All of this might make it sound like I didn’t enjoy this movie, but I actually did enjoy myself while watching it. The main reason why is the visuals.This movie has really vibrant colors, and does a really good job of making its world pop, and the environments are distinctive. The action in the movie works well as well. The fight scenes look great, as do the dragon’s power ups, little as they are used. Ironically, the dragon herself is probably the weakest bit of visual design in the movie.Overall, the movie is mediocre. Okay, even. But not great."}, {"rating": "8", "text": "Raya and the Last Dragon is an original (oh thank god) Disney animation movie that was overshadowed because it's $30 on Disney+ and it came out the same day as the WandaVision finale. I was intrigued to watch this because of it being focused on Asian culture and the fact that it wasn't going to be a musical like Frozen. It felt like the Disney Animation Studios were going to do something different and I liked that. The premise \"Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. However, when sinister monsters known as the Druun threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, those same monsters have returned, and it's up to a lone warrior, Raya (Kelly Marie Tran), to track down the last dragon and stop the Druun for good\". So is this a great surprise or a very unwelcomed one?I want to get this straight off my chest but I love that this focuses on Southeast Asia culture. It's nice to see it get more representation in mainstream movies. I also really love the world-building with the Dragons, the overpowering evil force the Druun and the 5 tribes. It feels familiar such as in Avatar: The Last Airbender but in Raya, the world is still different enough to set it apart from others. It is such an interesting world that I wouldn't mind more movies or shows set in this universe.The animation is very breathtaking and gorgeous. It's very colorful and there are different variety of locations from the bustling city of Talon and the snowy plains of Spine but all of them are visually stunning.  I also have to praise James Newton Howard for the score is as there is some rapid music for the more intense scenes and some uplifting scores for the more hopeful moments. The entire score feels like it represents the world of Raya and southeast Asia perfectly and it elevates the movie to another level. It also has a great song in the credit \"Lead the Way\" by Jhené Aiko. There are also some surprisingly great hand to hand combat and swordplay that would put a fair amount of action movies to shame. It's genuinely got some exciting action sequences!The titular character herself Raya (Kelly Marie Tran) is also excellent. She's a fierce and courageous warrior princess with some swagger but is flawed in not trusting people and not believing the world can become united again. She never gets to the point of unlikeable and to a certain extent the movie shows she's right in some ways. I thought the dragon Sisu (Awkwafina) might be unbearably annoying from the trailers but she is pretty fun to watch. Raya's developing friendship with the contrasting view of Sisu is enjoyable and Sisu encouraging Raya to change is convincing. Namaari (Gemma Chan) the \"villain\" is also wonderful and her rivalry with Raya are some of the best parts of the movie. What makes Namaari work as a character is that she is not evil but also flawed like Raya but both have common ground with each other. Throughout the movie instead of wanting Raya to win, you want her and Namaari to solve their conflict and trust one another. The other supporting characters are hilarious and loveable as well. Boun (Izaac Wang) is funny as the owner of a shrimp boat restaurant, Tong (Benedict Wong) is a scary warrior giant with a heart of gold and there is a toddler con artist, need I say more? Every voice actor in this movie does a phenomenal job in their role, especially Kelly Marie Tran as Raya which is just perfect casting. However, I do wish it explored the supporting cast a little bit more through something like a flashback because they just feel like they're along for the ride than significantly important. Furthermore, the story is very predictable and there is genuinely no surprises as it hits a lot of the clichés which is slightly disappointing. The movie also has a surprising amount of exposition throughout the movie instead of just at the beginning which slows the pacing.Overall, Raya and the Last Dragon is one of the best original Disney Animation movies in a long time. It's filled with amazing visuals, great characters, exhilarating action sequences, a beautiful score and terrific performance from the voice actors. It just does a lot right. I loved the movie and hope Disney does more movies like Raya and The Last Dragon. Just don't do a $30 premium service and just make it free with Disney+ like Soul okay?"}, {"rating": "0", "text": "Bad, I struggled to get through the film and will not be watching it a second time; I can't list all reasons, as there are many, but here are a few reasons why.Disney yet again followed the same formula of an impeccably perfect female lead, whose only character flaw is that she's too perfect (she trusted too much and was too protective). This formula is boring and sexist.Disney ruined dragons for me forever; they made them blue, furry, and wore makeup. Disney, for some reason, makes all characters beautiful and felt it was needed to make the female dragon pretty.It's filled with cute animals, just for the sake of being cute, and is just oversaturated.The storyline is weak, basic, and lacks creativity in all senses.The film is filled with frustrating plot decisions, like the main character spent years training to defend the dragon stone, and basically be a ninja, and then goes and invites the first person she meets to see it, meaning the entire storyline of the world ending, is her fault, and is never addressed.I'm glad that it was set in a (fictional) East Asian setting; however, it is frustrating to see Disney making it as American as physically possible. The voice actors are of Asian descent; however, all have thick American accents. Their appearances are westernized and the rich Asian culture is generally washed out.Anyway, I would avoid and watch a Pixar movie instead, which are actually written well for many other reasons."}, {"rating": "3", "text": "Nothing special about this cartoon, you feel you watching something forced. Soon you realize what is forced is the interaction between characters. It has the visuals but non of the charm of other Disney works."}, {"rating": "5", "text": "This felt like a discount Disney princess movie compared to classic Disney. Unrealistic character choices and a disjointed story. Only 1 character earned emotional investment from me. Every other character was a caricature and monotoned."}, {"rating": "3", "text": "The \"Hero's Journey,\" as one of cinema's oldest tropes, hasn't been innovated since 1977.  Disney can throw all the gender trendiness, inauthentic ethnicity, Marvel Comics-style MacGuffin-ry, and purple-glowy animation at the cliché that it wants, but RAYA comes off mainly as unoriginal, over-expository, and childishly naive.  The \"princesses\" now punch and kick!  Yippee!  Some beautiful animation, but isn't that the very least we can expect these days?  This is a movie that you'll likely forget about 15 minutes after you've seen it, even if you are more of a fan of the genre than I am."}, {"rating": "2", "text": "Probably the worst Avatar: The Last Airbender knockoff yet.Characters are far too many and lack development. The writers don't seem to understand the importance of continuity of location. There is some queer subtext that the movie doesn't have the guts to do anything with. The dragon is straight up annoying and for some reason keeps making real-world references. The baby that's a scam artist is absolutely ridiculous. The animation, models, and everything is pretty great. The character designs are pretty bland.I'll give the movie credit for one thing. In Eastern lore, dragons are heavily associated with water and not with fire like in the west. That's the only thing really original to this film, and when it explores the mechanics of that, it gets more interesting.That said, it's by far not enough to save this film. The movie is basically watchable, but frankly, you're better off watching the show it so crudely cribbed off of or actual Chinese animation."}, {"rating": "4", "text": "It has a very interesting concept, but man does it also have issues. The pacing is not good and everything is a bit rushed, the characters constantly make mind numbingly dumb decisions, on top of not being developed very well. The movie also makes a rather stupid point to trust everyone and compares two situations that are not comparable. Trying to tell people to trust one another when one person caused the end of the world then doubled down on it is an exceptionally awful decision and should not be taught in any film. TL;DR: Somewhat interesting concept, could have executed world building much better, not very good character development, and LOTS of very very poor character decisions where everyone is insanely dumb. This is very much a don't use your brain movie."}, {"rating": "0", "text": "This movie was a massive disappointment, with no character buildup. Everything felt super rushed, moved too fast. The main character screws up so many times, but never owns up to her mistakes, pinning blame on others when shes a part of it. TLDR: Rushed, Hollow story, Hollow characters. Main character never owns up her mistakes.The only good part of this movie was the visuals.But pairing good visuals with garbage still makes it garbage."}, {"rating": "1", "text": "Paperthin character development. There are multiple clans, they had plenty more time that they could have added for character development (movie is only around 90mins) but disney says nope! Didnt care about any of the characters in the movie. This film is nothing close to Disney's usual hits. SOUL IS 10X better than this movie. And that one didn't have any action scene lol.MAJOR FAILURES & PLOT HOLES:This movie doesn't deserve the Disney branding. It doesn't even have BASIC LOGIC. #1. Your clan holds the most precious stone or jewel in the continent, you invite other nations to visit your place. NOT A SINGLE GUARD is present to Guard the treasure? Not a single guard is even present in the whole town. Meanwhile your visitors have squads of soldiers with them. Seriously? #2. How can a BABY still be a baby if her Mother got turned to stone 5 to 6 years ago? What the baby stopped growing because her mother disappeared? What a joke Disney. I think you need Kevin Feige to mange Disney Animations too. I'm sure there are tons of amazing stories to tell out there, how the h3ll did this story get approved? This movie doesn't deserve its current score of 7/10. A 5 or 6 is more acceptable. But yeah it felt like they just needed to make another asian themed movie so they won't be called out for any diversity issues. I am asian so I'll give this movie an asian rating. This movie is a B for BOBO."}, {"rating": "4", "text": "Best part? the visuals by a long shot! in the whole movie there are 4 male characters that have actual lines rest are just in the background and never get heard from or interact at all with them, it was too one sided and the story was so rushed.. the dragon was more focused on getting gifts for others than actually getting the stuff needed to save everyone....this is a easily forgettable movie that could have been so much more but either was a higherup trying to get money out of this asap or the director gave up mid way through and butchered the movie-Huge minus points for rushing a movie that had the potential to be sooo much more than what they did with it.-Huge minus points for uninteresting characters.-The only points that can be given for this are some of the Voice actors and the animators they did a awesome job"}, {"rating": "8", "text": "This fantasy takes place in a magical world where humans and dragons live in harmony, until an unfortunate incident divides the people into warring entities. Years later, it’s up to one brave, resourceful woman to find the titular beast and restore unity to the world. The narrative follows a traditional trajectory, but the lively pacing and beautiful animation makes it special. The highlight is the dragon’s character, provided by Awkwafina’s unique personality. The band of supporting creatures are cute. This is Disney animation in its finest traditions with an optimistic message and an upbeat heart. Be sure to arrive on time: There’s a wonderful short set to a groovy tune featuring an elderly couple who becomes young again when they dance in the rain.NOTE: At the end of the credits, they state that this film was made from 400 different homes with the punchine, “Dude, you’re still on mute!”"}, {"rating": "8", "text": "I enjoyed the message in the movie and the animation is gorgeous plus Benedict Wong!"}, {"rating": "0", "text": "I thought the cast did a solid job but this is honestly your generic copy and paste Disney animated movie. The plot is incredibly predictable, it hits one too many familiar tropes along the way, and it fails to bring anything unique to the table. If Disney didn't have their name attached to this, We wouldn't even be talking about it. It has absolutely no substance. Disney stuck to the formula on this one and it shows every step of the way."}, {"rating": "10", "text": "A really good animated movie that won me over with its characters, worldbuilding, themes and story. Also the art style and visuals are beautiful while they have also a great cast of voice actors. I was a bit late for a review because I did not want to pay extra money. Now it is free to watch on Disney+ so I used the opportunity. The movie is a mixture from a fantasy adventure and buddy movie garnered with action and philosophical themes. The story starts 500 years before the events of the movie. The land of Kumandra was a paradise where dragons and humans lived in harmony with the dragons being the guardians and helping the humans. One day the Druu arrived and starting to ravish the lands by turning all humans they touch into stone. The dragons started a last ditch effort to save Kumandra but it had a huge price for them. The humans instead of joining together split and formed opposing fractions constantly at the brink of conflict. Raya is the daughter of the Hearts tribes chief who are the guardians of an ancient gem. Her father wanted nothing more than the people to reunite to erase the conflicts, separation and distrust between the many factions. With this the set up starts and also Raya’s (heroes) journey. The story is engaging as the characters have all believable motives, the progress is immersive and enjoyable and the twists are good. I must admit that firstly I thought they used a lot (=too much) of tropes but they proved me wrong later as it felt fresh and was enjoyable. It avoided also the Disney princess tropes and at the end I was amazed by this. At the end the story was compelling and never felt boring. The characters are the greatest strength of the movie. Lets start with Raya voiced by Kelly Marie Tran who made the heroes journey. She is fully relatable in her struggles and a great character. Her growth is excellent and she won me over easily. Sidenote: Dear Rian Johnson this is the talent you wasted. Sisu voiced by Awkwafina is the comic relief and so enjoyable. Together with Raya they have a great dynamic and good chemistry. These two alone are worth watching the movie. It ends not here as we have little Noi voiced by Thalia Tran with her “gang” as hidden star of the movie. She is cute, a loveable scoundrel and you should never underestimate her and her gang ;-). Then there is Boun voiced by Izaac Wang who is an orphan who is far wiser than his age make him look. Namaari voiced by Gemma Chan is Raya’s rival. She made also a journey and has excellent character development. She and Raya are like two sides of a coin. Lastly for the team there is Tong who is a stoic and kind warrior. For the rest I will praise Virana voiced by Sandra Oh ans Benja voiced by Daniel Dae Kim for their smaller but good roles. I almost forgot Tuk Tuk who is Raya’s best (animal) friend and a cute mixture of armadillo and pill bug. Like I already said the cast is amazing and fully delivers. Then there are the visuals and art style. Everything looks great, made me want to explore the fauna and flora of the world including sight seeing for the locations. They put a lot of effort in it and I praise them for this. The soundtrack enhances the atmosphere and is truly great but I must admit that I did not look up on Google / YouTube for a specific song. The action and fights feel amazing to watch even when the focus is not on them. Finally there are a lot of philosophical themes in the movie and a lot to discuss (Wont go into details because of spoilers). Overall this was a truly excellent movie. It was immersive, enjoyable and had great humor atop of a great heroes journey. Might not be my favorite animated movie but is still worth a 10/10."}, {"rating": "8", "text": "Raya and The Last Dragon Flies By Too Fast?After watching Raya and the Last Dragon for the first time in theaters, I felt a bit of a rush going into this film. Now take as it may, almost everything was absolutely on point. When you deal with a pretty fast pace however, it is hard to connect with the film's merits. Raya and the Last Dragon had some amazing animation. From the fluidity of the water to well-motioned action sequences. In addition, the characters were absolutely enjoyable to watch. Especially the last dragon herself, Sisu. It was certainly a great sight to see! I just wished that the movie could have presented it in a bit of a slower pace. Instead, I felt like I was playing a game of leap frog with each scene jumping into the next. Going from one location to other, introducing a new character after the other, you name it. It all happens so fast, and I really wished this whole adventure could last just a little bit longer! Now this could just be me talking and someone else might get a different experience watching. No matter though, Raya and the Last Dragon is good start to 2021 animation cinema and I encourage general audiences to watch this. Just don't snore to the movie's ending in the theater like the father that was behind me. You will surprised how this all wraps up. 8/10"}, {"rating": "8", "text": "Great movie! Loved the plot and the animation. Also it stars a southeast Asian female warrior so it adds up the goodness!! Loved seeing my heritage appeared on this movie."}, {"rating": "2", "text": "The movie for kids is a good to go film how ever when it comes to the actual plot/ substance of the film for an actual viewers pleasure it’s story is vary basic and blatantly boring."}, {"rating": "0", "text": "The voice acting feels off - Raya's voice didn't change at all in the time it took her to grow up a bit and the father's lip-syncing at the start is weird.No real character development - Only Raya and the fang princess have any whatsoever and the other characters are flat and predictable.The comic relief characters suck - the baby is insanely unfunny/cute and the kid seems irrelevant and artificial. Unlike a movie like Shreck where donkey served as both a vital character and comic relief the ones here are neither funny nor good characters"}, {"rating": "4", "text": "Only bad writers would make a movie this generic and boring!  They actually made a dragon I didn't like, and that's saying a lot cause I love dragons.  Disney is going to hell, don't make the same mistake I did and pay a whole year of Disney+"}, {"rating": "3", "text": "Great graphic is not enough to compensate shallow story and inconsistent world mechanic. Things which makes sense in initial moment loose any sense a moment after. Fight mechanic is laughable. Movie message is very weak. Characters over the top. Another missed opportunity and improper use of pontential of great animators."}, {"rating": "5", "text": "Simply bland, they got the tech but not the heart. But hey! Look at the water simulation, and we got the creepy toddler with the monkeys, you can't not like it!"}, {"rating": "8", "text": "Raya is a very nice movie. Finally, Disney has made a movie outside Pixar that stands out with a great story and solid animations. Great voices over, soundtrack and sounds. The quality of the movie is equal with Pixar, and the ending of the story is simply a beautiful emotional ride. The movie does keep your interest alive and doesn't falter that much. I give it 85%. Yes there is a strong moralistic message under it all, but it's not that different from any Star Trek episodes out there. It is full of despair versus hope, and still very convincing in the end."}, {"rating": "8", "text": "Solid Disney flick with a great message about learning to trust one another, along with beautiful  animation and action.  Plus, you will leave the film wanting a 'Tuck-Tuck'."}, {"rating": "0", "text": "I knew I was in trouble when it opened with 5 minutes of exposition which is one of the very first things a good writer is aware not to do.  Generally I try to watch an entire movie before coming to a conclusion regarding its quality, but in this instance I simply don't have the will to sit through this trainwreck in order to write something for it. I don't get paid to do reviews and that's what it would take to make me watch this movie all the way through. So for the 20 minutes that assaulted my senses, it is definitive, Disney has put forth a D grade story with A grade visuals (the 1 star is for the visuals). Pacing is a problem right from the get-go where the main character is introduced as a princess and guardian of the magical dragon stone, only to see her lead her enemies directly to its hiding place in literally the next scene. It reminds me of the daydreamings of a 9-year-old girl, but I don't want to insult 9-year-old girls by making this comparison. I'm fairly certain that most 9-year-old girls' daydreams have more sophisticated plot lines than those that are being laid out in this trainwreck of a production. It is baffling to see such poor quality dialogue and plot rolled into a hundred million dollar production. It's insulting not just to writers but to every audience member who knows anything about East Asian culture and East Asian peoples' mythological. In a time where we're supposed to be reaching for authenticity in stories, Disney has decided to bastardize the myths of multiple peoples by stealing elements and then haphazardly throwing them together. It's clear to see that the Disney Renaissance is over and we're now slipping into a dark age of bad Disney animation."}, {"rating": "0", "text": "Looks like Disney has gone full woke supremacist. But what's worse is the writing is bad. Now all the women in Disney films are \"warrior princesses\". The voice casting is really bad too. The voices do not fit the characters at all. Raya's voice actor was switched out (probably a race issue, with them giving the role to a non-asian at first then switching to an asian person to be woke and avoid being criticized/cancelled by the woke supremacist mob. The narrative is sub-par. The pacing is bad. I think it was written and everyone was scared to criticize anything from anyone else because that could result in big problems (fake accusations of racism, sexism, etc). I don't think any kids are going to be dressing up as Raya. They purposefully leave out any male character. This is 100% feminist propaganda. Like with Aladin you have him and the princess or even the genie to dress up as (Jafar as well). But with this it's completely devoid of any male characters (on purpose). Just woke trash."}, {"rating": "8", "text": "This isn't the most original of stories or messages. It doesn't have songs. Some of the tasks feel a bit rushed and, well, easy. But this film kept my 8 and 5 year olds riveted to their seats all the way through. It has a solid story, great performances, exciting action scenes, fun characters, and lots of laughs. Above all, this film has a heart. Extremely enjoyable. We'd have loved a trip to the cinema to see this, so don't begrudge the extra cost - would be foolish to do so. If you enjoy a good family film, this is for you."}, {"rating": "10", "text": "Disney rarely releases movies about dragons. So I say this was real treat for everyone around the world that are into dragons. Hopefully in future they'll be able to work on a sequel."}, {"rating": "2", "text": "1) When Awkwafina's goofy, energetic, and comedic character is the serious one of the movie you know you got a problem. 2)This movie feels like what a western born and raised Asian kid would tell their non-Asian friends. 3)It has all the flash and familiar symbols but none of the meaning. 4)Also it paces its self at neck break speeds, just like a sugared up chatty little kid would too. 5)There's simply too much flat and high pitched noise telling an \"and then\" type of story that it's exhausting. 6)The final message of the story feels so shoehorned in that the anti-hero of the story replies correctly with the audience with a \"What??\". 7)Not a biggie but the main character's voicing always seems a bit off. The tone, energy, and timing doesn't match with how the character is acting"}, {"rating": "5", "text": "Raya and the Last Dragon felt like a missed opportunity. It has a good message but poor execution. Inconsistent animation quality throughout, forgettable characters with little personality, and a messy but simplistic plot. It’s very possible the production of this film suffered due to the pandemic, with different teams working on it remotely. Late changes in directors and multiple writers lead me to believe that was the case. While not a lost cause, the movie is forgettable and one of Disney’s weakest animated efforts in the last several years."}, {"rating": "9", "text": "It's funny and brings you some good times. It's not one-role-biased which is the strength point in my idea. It's like old movies that say trust and friendship bring the world back together."}, {"rating": "10", "text": "Absolutely action packed, heart wrenching, and all around fun. This movie was such a refreshing story from Disney and absolutely breathtaking. I loved it. You will love it. It’s Disney at its finest"}, {"rating": "4", "text": "Raya is cumbersome and difficult to follow. I couldn't make heads not tails of what was going on and the voice acting was awful."}, {"rating": "8", "text": "First of all, congrats Disney on finally creating their original film in a long time!I really liked the main idea of the whole story: humans, as of now, is a plague to our planet. We are the ones to blame for destroying nature and screwing up things on this planet. The worst thing is that it won't change anytime soon, unlike in this movie...Sisu says: Druun is a plague born from human discord. Instead of bringing life to the world, it's like fire that burning everything to ash...Again, she is talking about us, humans - we have the power to make the world better place, but instead we use that power to destroy our only home (Earth).The visuals is a technical and artistic achievement over many years - I can say it's one of the best graphics I've ever seen in movie!Now to the cons:- Story are rushed. Like REALLY rushed! For a more complete, not rushed version, it should have at least (!) 30 minutes more time! (up to 2 hours, without counting 10-min credits at the end). But instead they just wasted 20 min on prologue, REALLY screwed up thing from timestamps 1 hour:15 min to 1 hour:30 min (the MOST rushed section!).- Writers screwed up the plot and most of the characters, except two main ones: Raya and Sisu. Others just don't have enough time for character development... Story feels waaaaay too childish (you really treat kids like dumbasses?). Also, why we need so many tribes and locations if they serve their purpose ONLY as a scenery? We don't have ANY background of tribes, and environments changes too quickly to appreciate them (did I say story was rushed?).- Cliches - LOTS OF THEM! And I hate it!!!To sum up: great visuals and two main characters (Raya and Sisu), loved the main idea.But the narrative is waaaaay too rushed, inconsistent, blunt and childish.I still don't understand why they won't hire good script writers who would deliver mature stories in presentable way for kids (like anime does) without using TONS of cliches! (it's a problem of modern industry, not just in film, but in games too...)"}, {"rating": "10", "text": "Surprising good! No dry eyes in the house!! I keep saying it’s a Disney movie someone always dies!"}, {"rating": "10", "text": "Definitely one of my favorite Disney movies, great story and spectacular animation!"}, {"rating": "6", "text": "Funny and entertaining. Typical Disney. The affected and pretentious behavior of the characters is typically American, but no Asian characters would behave that way. This lack of depth is representative of the entire film. A Happy Meal version of a cross-cultural film with no real reference to Asian culture. In typical Disney style, a bit of Asian culture is abused to help the film succeed in Asia as well. But why this mistake is repeated after Mulan, which was not very successful in Asia, is incomprehensible. Disney, if you already write intercultural understanding on the flags, then you should show it also in your films! Otherwise it remains with the marketing propaganda."}, {"rating": "7", "text": "'Raya and the Last Dragon' is a solid new entry in Disney's animated universe. Despite a formulaic plot, the story and mythos built here are engaging and interesting. Raya and Sisu sure will strike a note not on young audiences but on adult ones too. The animation is outstanding and breathtaking. The downside: the writers don't seem too clever by forcing the story's trust theme whenever they can; still, the plot flows well almost all the time. Let's hope Disney can keep this momentum in future releases."}, {"rating": "9", "text": "One of the most beautiful animated movies I've ever seen with nearly every shot being eye-gasm. Solid story. Mostly a predictable plot. Excellent performances by all."}, {"rating": "8", "text": "South East Asia being represented was great. Moana for the Samoan. We need more like this. I'm looking forward to more representation of other ancient cultures."}], "recommendations": ["next_gen", "how_to_train_your_dragon_2", "the_good_dinosaur", "frozen_ii", "big_hero_6", "my_little_pony_the_movie", "the_nutcracker_and_the_four_realms", "how_to_train_your_dragon_the_hidden_world", "9", "the_witcher_nightmare_of_the_wolf", "bumblebee", "brave", "rio_2", "the_iron_giant", "turbo", "incredibles_2", "okja", "luca", "moana", "kubo_and_the_two_strings", "the_13th_warrior", "the_lego_movie_2_the_second_part", "ralph_breaks_the_internet", "the_croods", "mortal_engines"]}