{"id": 274, "title": "Ready Player One", "starring": ["Tye Sheridan", "Olivia Cooke"], "runtime": 140, "genre": ["Science Fiction", "Adventure", "Action"], "description": "When the creator of a popular video game system dies, a virtual contest is created to compete for his fortune.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/pU1ULUq8D3iRxl1fdX2lZIzdHuI.jpg", "categories": {"plot": 5.348837209302325, "acting": 5.911764705882353, "ending": 5.285714285714286, "soundtrack": 3.0, "cinematography": 4.0, "familyFriendly": 6.0, "funny": 7.571428571428571, "action": 6.538461538461538}, "reviews": [{"rating": "5", "text": "Continuing an unfortunate tradition that has come to characterize many of his recent films, director Steven Spielberg's latest big-budget bloated extravaganza dazzles visually but grows tiresome (some might even say exasperating) rather quickly. The picture plays like a glitzy, nostalgic stroll down an '80s version of memory lane, chock full of nonstop references to the decade's movies. music and memes (in itself an odd fascination for characters in a story set in 2045). What's worse, the film lacks a fundamentally compelling story and takes about 45 minutes too long to get to a central message that becomes patently obvious early on in the picture. If you're looking for purely mindless entertainment, you'll probably find this moderately amusing, but, if you want something more substantive, skip this one and watch one of the filmmaker's earlier (and much better) offerings."}, {"rating": "10", "text": "This movie does a great job of capturing the feelings and emotions as well as the aspirations of any VR gamer. The nostalgia also speaks to my age group as we enter the VR era. The only people who would not like this movie are non-gamers or self-absorbed trolls just being rude for the sake of it."}, {"rating": "2", "text": "I enjoyed reading the Ready Player One novel and listening to the audio book.  Unfortunately the movie was a huge disappointment.  The tone of movie is inconsistent, sometimes it's very real and at other times it's completely contrived and fairy tale.  In the end it seems like it was targeted for 12 year olds.  Some of the scenes work and others fall flat.  The humor never really connects and feels forced.  It doesn't feel like an adaptation of the novel, instead it feels like an adaption of a video game based on the novel."}, {"rating": "8", "text": "This movie is a visual spectacle to behold. I loved it. The theory of extraordinary virtual reality where you can do pretty much whatever you want is really awesome. The movie's ideas and the characters work their magic on the audience. However I felt that the plot was slightly messy and some parts were a bit rushed. Despite that the film is still very good. 8/10"}, {"rating": "0", "text": "The dude gave the challenge to the entire player base, but without the 1st key there's no hint on obtaining the rest of the keys. Just too many \"wtf\" and \"why\" moments."}, {"rating": "7", "text": "Spielberg makes a fun adventure  movie though it still pales in comparison to a Spielberg classic. From beginning to end you get immersed in this world and you can't help but have a blast. What keeps it from being great is the characters never captivate the emotion that you would hope for. Overall a Ready Player One is lots of fun and will fit somewhere in the middle of your Spielberg collection. High 7 B+."}, {"rating": "8", "text": "Ready Player One is a movie that is greatly open to an audience despite that there are some themes that aren't really Child Friendly. What you're gonna expect to watch in this movie is a plethora of your favourite pop culture references, greatly played out for the duration. Everything from emotion to the chance of joy is delivered especially the greatest things ever found through Video Games and Entertainment. The aspirations of VR gaming is greatly illustrated as well, being set in a futuristic world. Considered myself to be a disconnected society because of the addiction of a VR game, made by James Halliday himself."}, {"rating": "8", "text": "The story is different from the book, but it is still a good movie. The characters are interesting, but some feel as if they are shoved into the movie without enough explanation as to why. The story unfolds quickly and the action starts right away. Overall this was definitely worth the watch."}, {"rating": "8", "text": "Ready Player One is an action packed film with many references to pop culture along the way. It's nice to see all the references that are put in the film, whether they are in plain sight, or more obscure. The film is also beautiful with amazing CGI and special effects. The film is quite funny too, with a lot of clever jokes. However, the characters are fine, save for a few of them, but there is little to feel for these characters as the story arcs are kind of generic. Perhaps the biggest flaw comes from the pacing; often it feels like the film makers were trying to cram too much into the film at times. Nonetheless, Ready Player One is a great film from start to finish and I would definitely recommend seeing it."}, {"rating": "4", "text": "Not all adaptations are true to the original text as books and movies are different beasts, however you do expect the core of the book to intact, and the characters done justice. Unfortunately Spielberg has not done that, the story is diluted and weak, the characters paper thin with no depth. For all the special effects (which are great) and the cinematography (fantastic), it does not help hold the film to greatness. It's a shame since they spent alot of time and energy getting the rights for so many IPs into this film and if you had a remote and a copy of the film, you could pause it and check out every single easter egg and name every single character they have squeezed in, but that would mean watching this again, which is simply not happening.Stick to the book. It's fantastic, and really captures what it means to gamers to be part of the game."}, {"rating": "8", "text": "If Ready Player One isn't the type of adventure you're looking for, then I guarantee you I don't even know what is. With a load of cameos ready to be seen and references ready to be heard and being a huge improvement over the 2011 novel, Ready Player One is guaranteed to bring anyone who are fans of at least one of the many cameos and references this film holds. What I like about this film is that its plot only relies on Easter eggs similar to how the novel relied on Easter eggs, but intends to go more modern than what you only see in the novel. Steven Spielberg might as well be known for directing well-loved classics, but he's also the same guy who also directed modern art like The BFG and this film. This movie is one long Easter egg from start to finish and I do recommend it even in the near future."}, {"rating": "2", "text": "Imagine if you'd just read the book 'The Matrix' and though, wow!  The film is just four weeks away!   And then in the film, half of what Neo does is done by Trinity and in a disappointingly not very cool / dumbed-down fashion.This film is sometimes fun in a splashy sort of way.   What is annoying is that the  changes seem intended to give Artemis a kick-ass girl-power role.  What the director seems to have missed is that she already was kick-ass in the book in a more subtle way.  In making these changes, Parsival became a shadow of the character he should be.I tried hard to like it."}, {"rating": "7", "text": "Not a bad movie, perhaps I would have liked it more had I not loved the book.. many changes from the source material left me wondering if this is a case of a great book that is too difficult to adapt... Give it a chance and I bet you will have fun, just not as much fun as reading it."}, {"rating": "10", "text": "I generally keep my reviews short. So I will just say that I really liked this movie. One of the best movies I've seen in a long time."}, {"rating": "8", "text": "Having never read the book before I didn't have any expectations whatsoever going into the film but I really enjoyed it. I obviously can't say if it lives up to the book in any way but overall I thought it was a really interesting concept and well executed.I have no real gripes with the film if I'm honest, it's just a fun ride from start to finish."}, {"rating": "9", "text": "I didn’t expect this movie to be that good but it was amazing and the visuals were amazing"}, {"rating": "10", "text": "Фильм очень потрясный ме понравилась тематика видеоигр и вообще шуточки и динамичные сцены. Мне очень понравилось"}, {"rating": "10", "text": "I watch movie to get entertain and this movie is very entertaining and I love it, I haven't read the book but after watching this movie I'm very curious what the book might like coz some say it's different from the book but I think it's worth it coz why do we even go to a movies, to get entertain right? and this movie delivers."}, {"rating": "10", "text": "I'll start with i have read the book,I personally think this was a brilliant movie, the acting was a 9/10 and the story 10/10. If you're not a gaming or anything 80's fan miss this movie as you'll probably give it a negative review.The main problem i keep reading in reviews is, that wasn't put in and this wasn't put in the film. What people have to understand using characters in a book is totally different than in a movie, their things called licences which cost a ton of money and with this movie costing 175 million to make as it is, how much more needs to be spent to make everyone happy. Does everyone really think Blizzard let Spielberg use Tracer and D Va for free, plus all the other licences which were needed just to make this.People seriously need to get a grip and review this movie as a movie and not as a bookSo back to the review. The acting was hit and miss, some of the acting was great and some really didn't suit the character. visually it was epic and just sitting there trying to spot nostalgic characters, movies and games from the 80's and upwards made it even more enjoyable, I think i spent most of the movie saying \"oh looks it's\".Overall - Yes the book is better, but when have we ever seen an identical port from book to film. However, this movie stands fantastic on its own whether it was based on a book or not"}, {"rating": "10", "text": "A fantastic film, and a tribute to value everything that has formed eras of entertainment, the essence that also means to appreciate such works, stories. At every moment the movie bombards you with references of electronic entertainment, videogames, animation and other typical elements from 90's to 2000's. captures all the feelings and experiences of communities, developers, events, players, besides showing cameos of characters that do not usually include in movies of this theme, jargon of gamers, easter eggs, pop culture, wow is impressive.Personally, the fans and there is nothing more to add to the excellent CGI, very careful and colorful. Actually the argument remains as an impulse for everything really important. Beautiful."}, {"rating": "10", "text": "Amazing movie that making me feel like living in a game and you no need to be fabulous in life to excel in the game. Everyone is a hero in real life"}, {"rating": "1", "text": "Didn't really stay true to the novel nor much of the 80's culture that was the theme of much of the story. Wouldn't of been much of an issue for the movie going its own route if the novel wasn't just a far superior story over all. The movie just feels like the typical boy meets girl with a sprinkle of virtual reality thrown in and cameos all over the place. If you didn't read the book, you'll probably like the movie. It's a pretty simple weekend flick. Otherwise don't go in with a lot of expectations. Spielberg has to stop making movies."}, {"rating": "9", "text": "The great visual spectacle of XXIth century. It has received somewhat \"mixed\" reviews from the critics, but you got to have at least some knowledge of what videogames are to completely understand and appreciate it, and that's precisely what some critics lack. Besides that, it is a great experience, spectacular, funny and entertaining so for me it's a must see, and even a must-rewatch, as someone else has already said."}, {"rating": "5", "text": "Putting aside my book bias and evaluating the movie on its own merits, it's simply mediocre and forgettable. The world building is limited to the first 5 minutes of the film where Wade (aka Parzival) narrates an introduction to the viewers. It doesn't adequately explain WHY the real world has become so lousy that everyone wants to escape to the OASIS, merely that the OASIS has become the preferred escapism drug of the masses. No attempt is made to tie in the constant 80's references, leaving the viewer to wonder why kids in 2045 would give a damn about John Hughes or Twisted Sister. All we're really told is that the real world sucks, everyone loves the OASIS, and that if the Big Bad™ IOI and Sorrento win the late James Halladay's easter egg hunt the OASIS will become as lousy as the real world. So players like Wade and his best friend Aech are on a quest to win the hunt and save the OASIS from IOI's corporate oppression.Literally a few minutes later, we're introduced to Art3mis and the movie shifts entirely in tone. Art3mis is originally presented to the audience as a strong character who is apparently well known within the OASIS as one of the top Egg Hunters -- Gunters, in the parlance of the movie and book -- and Parzival is immediately smitten with her despite only seeing her avatar on Kaira's bike from AKIRA. At this point the movie becomes a cliche teen love, \"get the girl\" movie. Parzival still cares about the OASIS but only in the context of his relationship with Art3mis.In the real world, Art3mis (aka Samantha Cook) is portrayed as a member of some rebellion group who has at least one shadow operative working behind the scenes. Yet barely an hour after being introduced to Art3mis as a strong character with an axe to grind against IOI (and 10 minutes after meeting her in the real), Art3mis' character is turned into a shrinking violet who defers to Parzival and even sacrifices herself to the very thing that she was fighting against in order to save Wade in the real. This, of course, sets up the final conflict which becomes more about saving Art3mis than saving the OASIS. Parzival trashing IOI and bringing down Sorrento is a bonus but the real reason he feels he has to win the Easter Egg hunt is to rescue his love interest from the clutches of IOI.The other three members of the high five - Aech (Parzival's best friend ever), Daito, and Sho - are all given short shrift. They are paper thin characters both in the OASIS and in the real. Aech is the most prominent but Aech's role devolves into mid-movie comic relief and late movie chauffeur. Daito and Sho are practically afterthoughts.The movie bombards the viewer with CGI special effects and nostalgia bombs. It's worth noting, however, that a good 90 percent of the nostalgia and in-movie pop culture references were in the trailers. If you've seen the reveal trailer, the second trailer, and the final trailer you've seen almost all of the references. There's only three sections not shown in the trailers with a handful of references. The high point of the nostalgia trip is the second key challenge within a recreation of Stanley Kubrick's \"The Shining\". As an aside, I couldn't help but wonder why, in this universe, video gaming development died circa 2017 -- where everyone is still playing Overwatch, Borderlands, Halo, and DOOM 30+ years later. It's as if the OASIS came out and game developers just gave up. Since the movie doesn't take the time to really explain WHY these old franchises and 80's nostalgia are so prevalent, it feels shoehorned in and makes very little sense.Nostalgia alone is why this movie is getting high ratings by viewers. Take off the nostalgia goggles and evaluate the movie for the story it tells and how it tells it. It wants to be a nostalgia driven, young adult dystopia movie like Hunger Games or Maze Runner but lacks the story chops to pull it off and relies on CGI as glue to hold together the weak narrative. Bear in mind that this is just a view of the movie on its own merits. If I really wanted to do a deep dive comparing it to the book, well, that would take far too long. Suffice to say, if you liked the book and are expecting the book, you'll be disappointed. Especially if you're a fan of Ogden Morrow's character from the book."}, {"rating": "7", "text": "I first want to start off by saying that I had no idea this was based off a book until after I got home from seeing this and read some other users' reviews on this, many of whom had read the book claimed that this film wasn't as good as the book. Having never read it, I must say that I really enjoyed this for the most part and all of its numerous little hints, winks, references, etc. to countless other films, games, pop culture icons and phenomenons, etc. It did however become somewhat predictable and ridiculous at times, but the overall amount of fun I had with this film made up for that for the most part. Overall, it's got so many fun little details and moments packed into it that you'd be hard-pressed to find anyone who doesn't find at least a little bit of fun and enjoyment in this colorful and zany nostalgia trip."}, {"rating": "7", "text": "Light on character development, but heavy in nostalgic euphoria. A must-rewatch to catch all of its Easter eggs."}, {"rating": "2", "text": "Where do I start with this piece of garbage. How you could turn a great book into an average movie, only Spielberg knows. An exciting story has been traded for flashy cgi scenes and cringe worthy acting from all cast members. If you are a fan of the novel you will likely leave disappointed or indifferent at best."}, {"rating": "10", "text": "Loved it! a non stop rollercoaster. The book adaptation is quite loose and taking that into account results in a well deserved version. Not to be missed!"}, {"rating": "1", "text": "Unfortunately I read the book before seeing the movie. The movie was so bad compared to the book. A huge disappointment."}, {"rating": "9", "text": "'Ready Player One' is the most entertaining, most fun, and most visually stunning movies in 2018, and I loved every minute of it. Directed by Steven Spielberg - at 71 years old - he shows that he hasn't lost any of that old magic. He returns to thrilling sci-fi adventures where a group of young kids explore a world of wonder and endless possibilities. The year is 2045, and like most recent Hollywood blockbusters, the future is doomed. We meet a young boy named Wade Watts (Tye Sheridan), he says his name is like that because his deceased father thought it would be like a cool superhero name like \"Peter Parker\" and \"Bruce Banner\" (and the references don't stop there). Due to society being so stricken and misery populating the world, he often escapes into the virtual reality world known as \"The Oasis\". The VR goggles enter him into his Avatar named \"Parzival\", and the world of the Oasis is absolutely crafted in such a stunning way, you feel immersed and almost lost in its universe. The great mind behind the virtual world of the Oasis is James Halliday (Mark Rylance), who developed this feature over a decade before, to stop people from focusing too much on the harsh and economically struck reality, and escape to a world where they can feel free to be whatever they want. However, since Halliday died a few years back, he posted a video stating that he has left an Easter Egg somewhere deep within the Oasis, and that there are three keys to collect, in order to retrieve the egg. It's a race, and everyone begins to compete. And it is there that we meet our main antagonist of the film, Nolan Sorrento (Ben Mendelsohn) who wants the egg for himself so that the Oasis can belong to him. And he will stop at nothing to make sure that he gets there first. Spielberg adapts this novel from Ernest Cline and uses many of the pop-culture references well... from \"Back to the Future\", \"King Kong\" to \"The Iron Giant\", they're all in there for a reason. Not to add to our nostalgic enjoyment. This is Steven Spielberg's most exciting adventure since 'Minority Report' (2002), it's fast, always moving, and you're never bored watching it. I felt like a child again watching this movie as it's been so long since Spielberg has made a blockbuster movie. Yes, I absolutely loved 'Lincoln' (2012) as well as 'Bridge of Spies' (2015), but 'Ready Player One' is what Spielberg used to be, and he should continue to make more films like this. I can't wait to see it again."}, {"rating": "9", "text": "Personally, one of the few cases where I liked the film more than the book. I was really happy to see that they didn't kill off Daito! The 5 together were like a squad goals, which wasn't there in the book."}, {"rating": "10", "text": "Ready Player One is simply a fantastic film, bulging at its seams with visually stunning scenes and references that make any 20 to 40 somethings giddy with nostalgic delight."}, {"rating": "8", "text": "Ready Player One is set in a near future world where people immerse themselves in a virtual world known as \"The Oasis\" in order to escape the decaying conditions of the real world. The creator of the Oasis has died and has hidden an easter egg in the Oasis. The finder of this easter egg will become the new owner of the Oasis and will be given riches upon their imagination. We follow Wade Watts, an active player in the Oasis, as he tries to find the easter egg and win the prize. The movie has a lot of cool references to pop culture, including classic video games and movies. A lot of the movie is spent in the Oasis allowing for a lot of fun and interesting characters to be portrayed. The movie has a lot of fun high paced action sequences and has a good overall story. It is a movie that gamers will definitely enjoy for all the references, but even non-gamers can find a lot to enjoy about it as well."}, {"rating": "8", "text": "With a lot of pop culture references, most of them used in service of the plot, Ready Player One is Spielberg's love letter to pop culture and 80's references. Incredible action sequences and special effects but an overall lack of character development, RPO is a film that doesn't disappoint and doesn't get boring."}, {"rating": "10", "text": "Ready Player One was the best movie I have ever seen. It's a big hit and the #1 movie for me ever! Wade Watts is on a journey in the OASIS to find an easter egg. He needs three keys to get it. RPO was a big hit. Ready Player One is great!!!"}, {"rating": "9", "text": "It was like a dream. More you know, more fun you get. Steven Spielberg successfully created this new world and used it efficiently. I really liked it when I saw 'The Shining' scenes in it. When I watched this movie in 4D, I felt like watching Avatar or The Matrix first time. CGI was even better than Infinity War and movements were smooth. If you didn't watch it in theater, bad for you..."}, {"rating": "10", "text": "Tracers butt in this movie was very thick. 10/10 Would watch again. So accurate to the real butt in overwatch."}, {"rating": "5", "text": "Not bad I guess.It's a pretty movie.Some genuinely funny moments.It's great to see cyberpunk, video games, and VR represented in a mainstream movie.Product tie-ins / references are fun.Acting wasn't bad.Writing wasn't noticeably bad.Really strains the limits for suspension of disbelief, both in terms of the technology and the world built in the movie.Plot is predictable, unoriginal, and shallow.No real reason to care about any of the characters.Feels rushed, especially the love story.Scope is way too big.Not worth paying movie theater prices.Probably worth renting at home or watching on Netflix.Excited to see someone else make a (hopefully good) adaptation of Snow Crash if this movie sells well."}, {"rating": "10", "text": "See this score honestly blows my mind.... This was the best movie ive watched in a very long time. The acting was great, it was funny with no forced comedy like I felt was in Thor, and I love the story.  Not to mention the ridiculous amount of movie and video game easter eggs you see in it. Im sure ill watch it a few more times and catch more I missed. All I have to say is highly entertaining and a must see in theaters!"}, {"rating": "5", "text": "1. Extremely cliche storyline - boy meets girl, learns important life lessons, fights corporate greed - executed so horribly, that the movie becomes very sappy, very quick.2. First action sequence is wonderful, but the rest are very, very mediocre. It is not the blast that some people say it is.3. The movie is advertised as a gamer's film, but it really isn't. The game world of Oasis in which much of the movie takes place is really not impressive at all, either in content or in visuals. And a surprisingly large portion of the movie takes place in the real world of the dystopian future, which is designed equally badly.4. Humour is flat and surprisingly childish.Conclusion: A cinematic version of the \"How do you do, fellow kids?\", created by an old master who seems out of practice."}, {"rating": "9", "text": "For the first 20 minutes, I thought I would not be able to enjoy or understand this movie and that it was a movie for young people who like video games, like our grandchildern. But I was wrong. As senior citizens, my boyfriend and I enjoyed the premise very much along with the references from the late 70’s to 80’s, which we lived through. I can see how a society who’s depressed and discouraged would use a fantasy world to escape from reality. Yes, this film is why we go to the movies. It was entertaining!"}, {"rating": "9", "text": "If you're a movie junkie, this is a great movie for you. If you're a gamer, this is even better for you. If you're that type of person who loves drowning in nostalgia, 80's-90's pop cultures, and a movie & game lover, this might be the best movie of the century for you. Best parts: The Overlook Hotel, Chucky, the stunning visuals, Mark Rylance. (Can't help but add this: teary Tye Sheridan looked awfully similar to Miles Teller crying while J.K. Simmons foul-mouthing him)Worst parts: Third act's dragging pace."}, {"rating": "0", "text": "Not a fan. At all. Wooden acting, lack of character development, and loses all of the spirit that made the book a best seller.  Even if I had never read the book, I would have thought it was a mess of a movie. Such a wasted opportunity."}, {"rating": "0", "text": "Just a shame! If you've read the book, do not waste your time or your money on it. It has the same title, and perhaps the same beginning and end (except for Z's encounter with Art3mis), but an entirely different story. For example, how do they find the first key in the movie? In a car race? What the **** And neither the characters nor the story are well explored or developed. Just a shame..."}, {"rating": "10", "text": "Tracer and Reaper are dancing while listening the musci Stain' Alive. This movie is perfect.If you dont like it it's because you are too old (sorry :( it probably sucks to be you)"}, {"rating": "10", "text": "Goes to Ready Player 11The work of the Masters, transporting, good story. Gunna gonna c this 1 Imax time God willing."}, {"rating": "10", "text": "This movie was awesome. I am 50 (well in three weeks) and my wife (42) and two sons (12,11) all loved it. From all the nostalgia of yesteryear to the credible vision of the future (good and bad) it soared. Hey, let's face it, how a movies strikes you, much like booze and music, depends a lot on how you feel at that precise moment...and for me that moment was as soon Ready Player One began. Really wish there was an easter egg at the end of the credit roll though....would have made sense."}, {"rating": "8", "text": "Ready Player One is as exciting as a blockbuster can be offering thrills around every corner with a beautifully-created virtual world at the centre of it. The ensemble cast is great and the film is filled (for the most part) with little references rather than the direct references that the book takes. The film can seem a little rushed at the start in setting the world and the final act can feel a little prolonged but that all doesn’t matter when the story gets tied up perfectly in Spielberg-fashion.Steven Spielberg took what I thought would be an unfilmable book and created a magical world, full to the brim of pop culture references that everyone can enjoy. Who really doubted Spielberg though?"}, {"rating": "2", "text": "The director abandons the source material early on in favour of a nauseating litany of pop-culture references, overblown action sequences and cliched plot devices. Ironically, given the storyline, Mr Spielberg's artistic repertoire has not significantly advanced since the 1980s, and this is obvious in the appallingly stereotyped portrayal of the Bad Guy and of the Girl Interest - but most clearly thrown into shade by the cinematic quotations from the far more sophisticated Stanley Kubrick.  The actors are never given space to breathe, the character development is paper-thin, and every performance is therefore hackneyed to the point of cringeworthiness.  If you have read the book, this film will appall you, and if you have not read the book, there is no reason to see this film."}, {"rating": "1", "text": "Wow.  What a massive disappointment.  If you read the book Ready Player One for the love of God don't see the movie.  It's a train wreck.  I mean, I know that things get cut and storylines can change when they make a movie from a book, but there is no excuse for this monstrosity.  Barely any references to anything in the book: no Dungeons and Dragons, no Max Headroom, barely any 80's music or references to 80's movies, no Joust, no Ferris Beuller, no Monty Python, no Blade Runner, barely any old school video games... The quests all changed, the hints changed, the locations all changed.  Ugh. Ernest Cline should be ashamed of what he helped create in this screenplay. He sold out."}], "recommendations": ["warcraft", "the_hunger_games", "city_of_ember", "the_golden_compass", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "the_hobbit_an_unexpected_journey", "the_13th_warrior", "the_hunger_games_catching_fire", "maze_runner_the_scorch_trials", "ralph_breaks_the_internet", "the_hobbit_the_desolation_of_smaug", "tomorrowland", "percy_jackson_sea_of_monsters", "speed_racer", "john_carter", "the_mortal_instruments_city_of_bones", "beowulf", "final_fantasy_the_spirits_within", "the_maze_runner", "cloud_atlas", "the_witcher_nightmare_of_the_wolf", "the_giver", "vanilla_sky", "my_little_pony_the_movie", "inferno"]}