{
  "id": 1840,
  "title": "Ready or Not",
  "starring": [
    "Samara Weaving",
    "Adam Brody"
  ],
  "runtime": 95,
  "genre": [
    "Comedy",
    "Horror",
    "Thriller"
  ],
  "description": "A bride's wedding night takes a sinister turn when her eccentric new in-laws force her to take part in a terrifying game.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vOl6shtL0wknjaIs6JdKCpcHvg8.jpg",
  "categories": {
    "plot": 7.216216216216216,
    "acting": 7.419354838709677,
    "ending": 5.928571428571429,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 7.575757575757576,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Comenzaré diciendo que NO es una película de terror sino más bien un frenético thriller que una vez que comienza, no se detiene, la protagonista se luce y demuestra el verdadero instinto de supervivencia a toda costa y te hace que te preocupes por ella, quieres que se salve, contiene muchos elementos de comedia y humor negro que sostienen la cinta a la perfección de manera muy inteligente y sarcástica. Tiene una línea argumental que hace un guiño respetuoso y simpático a la franquicia The Purge sin caer en una vil copia de esto y aquello. Para finalizar, no podía faltar el gore, que si bien va de menos a más, no llega a ser excesivo, está en su medida justa y necesaria.En lo personal la disfruté muchísimo, la mezcla de comedia, thriller y suspenso me fascinaron por completo. Realmente no encuentro nada malo por destacar, fue toda una sorpresa para mi."
    },
    {
      "rating": "9",
      "text": "When I first saw this trailer I thought a interesting idea about a horror movie theme around hide and seek. First thought in my head it wouldn't work because there alot of horror movie that are bad when it based on a game like truth or dare. Overall this movie works and its self aware. Grace our main character is a common horror character type but ends up as a strong lead. She run away from danger but starts to fight back knowing she got a 50/50 chance of leaving. The family of Andy steal the movie completely. Everyone brings something comedic to the film. Not all jokes land and a tiny bit of bad writing. Still I loved this movie. Its better then Crawl which is a normal B horror film. Loved it too, I seen every horror film this year except for midsummer. But if you love a fun horror film I highly recommend watching. If you have AMC A-LIST definitely watch it. Right now this is my favorite horror film of the year."
    },
    {
      "rating": "9",
      "text": "Wasn't expecting much from this movie but upon hearing some positive reviews I decided to give it a try and see it for myself. With an interesting premise, a ton of humor and some violence here and there, Ready or Not was a pleasant surprise. The cast especially Samara Weaving and Adam Brody make this movie"
    },
    {
      "rating": "9",
      "text": "Amazing film!  It had the right balance of suspence mixed with a touch of comedy.   The ending had a nice twist as well.   Great movie."
    },
    {
      "rating": "10",
      "text": "This movie is fantastic and really entertaining. I would definitely recommend. It's got love, laughs, horror and heart."
    },
    {
      "rating": "10",
      "text": "Excelente película maneja muy bien su humor y gore, es más que entretenida y da para una secuela la verdad me sorprendió y la repetiria"
    },
    {
      "rating": "10",
      "text": "10 points. It's interesting movie, funny and scary ať the same time. Thank you."
    },
    {
      "rating": "10",
      "text": "To me, it was the quintessential Black Comedy and the lead actress was amazing."
    },
    {
      "rating": "8",
      "text": "The excellent Samara Weaving is the antithesis of a scream queen. With kick-ass roles in \"The Babysitter,\" \"Mayhem,\" and \"Guns Akimbo,\" she is vying with Harley Quinn as the \"vixen\" of modern cinema. An outrageous story with just the right balance of camp and horror, \"Ready or Not\" is a fun romp through the worst-ever wedding night."
    },
    {
      "rating": "4",
      "text": "\"Stand tall and **** them.\".( 43/100 ).Grace (Samara Weaving) y Alex Le Domas (Mark O'Brien) disfrutan de su boda con un ambiente tenso que hace sentir a Grace muy incómoda y, de alguna forma, desapegada, mal recibida y prácticamente odiada por la familia de su esposo. La solución a ello se presenta más tarde en esa noche cuando la familia la invita a jugar un juego de mesa que podría poner en peligro la vida de Grace. Dirigida por Matt Bettinelli-Olpin y Tyler Gillett, directores de \"Devils Due\" (2014) y participantes en colecciones de terror como \"V/H/S\" (2012) y \"Southbound\" (2015), películas que probablemente disfrutarán mucho si les agradó \"Ready Or Not\". Pero por mi parte desafortunadamente tendré que hacer un ejercicio de desprecio. Lo único decente en la película es el elenco y probablemente el maquillaje. El grupo de actores tiene un acuerdo decente y cierta unión que se refleja en el éxito cómico del film. Las actuaciones son excéntricas y exuberantes, sin miedo a romper algún límite que pueda imponer el guión. Por su parte, la película cae en un género gore y el trabajo de maquillaje y vestuario logra crear situaciones muy sangrientas, grotescas y repulsivas, sin embargo, no es excelente o lo mejor del año y los elementos restantes solamente disminuyen su calidad. El concepto o la idea pudo haber sido explorado de formas interesantes, pero los guionistas parecen haber optado por sustituir cualquier potencial intriga por una gran carga de morbo lidiadas por personajes idioticos bajo una justificación absurda. La película simplemente no tiene ni pies ni cabeza, no hay una introducción o contexto, el desarrollo revela secretos que nunca se aclaran, la catarsis de Grace, aunque razonable, es meramente impulsiva y arruina la resolución final que, por más lógica y prevista, se siente fuera de contexto ante la estampida de consumistas ilusos e incompetentes que toman compromisos que no saben cumplir.-Grace (Samara Weaving) and Alex Le Domas (Mark O'Brien) are on their wedding day with a tense ambient that makes Grace feel very uncomfortable, unattached, poorly welcome and practically hated by her husband’s family. The solution is presented later that night when the family invites her to play a board game that could threaten Grace's life. Directed by Matt Bettinelli-Olpin and Tyler Gillett, directors of \"Devi's Due\" (2014) and participants in horror collections as \"V/H/S\" (2012) and \"Southbound\" (2015), movies that you would probably like if you liked \"Ready Or Not\". Unfortunately, from my point of view, I'll have to write with contempt. The only decent thing in the movie is the cast and probably the make-up work. The cast has a decent acting agreement and some unity that is reflected in the comic success of the film. The cast is eccentric and ebullient, fearless to break any limit that the script could impose. On its way, the movie falls in a gore genus and the make-up and dressing work manage to create very bloody, grotesque and repulsive situations, nevertheless, it's not excellent or the best of the year and every other element just diminish the quality of the movie. The concept or idea could've been explored in more interesting ways, but the screenwriters seem to choose to replace any potential intrigue with a big load of morbidity led by idiotic characters under an absurd justification. The movie simply doesn't make sense. There's no introduction or context, the development reveals secrets that are never cleared, Grace's catharsis, if reasonable, it's merely impulsive and it ruins the final resolution that even if it's logical and predictable, it feels out of place in front of a stampede of naive and incompetent consumerists that make commitments that they doesn't know how to fulfill."
    },
    {
      "rating": "8",
      "text": "It's not scary, and not too funny either, but I liked the setting and how it was executed. It was entertaining enough for a lazy Saturday night. In overall, it was enjoyable with a twist at the end."
    },
    {
      "rating": "8",
      "text": "\"Ready Or Not\" is relentless, it keeps a steady mood of anticipation and thrill, coupled with a hint of witty, dark comedy, this doesn't disappoint one bit. The talented Sam Weaving performers to perfection as yet again she plays in a gore driven story after \"The Babysitter\", she hits all marks as her character developed throughout the film, great acting.This film is extremely fun to watch, not a single dull moment in it and on top of that it is shot beautifully, solid movie all around."
    },
    {
      "rating": "8",
      "text": "Definitely recommended. You can tell where this movie is going from the trailers but it is fun to watch it all unfold. Weaving is marvelous in this role and it's fun to watch her arc. Sort of a surprise ending. Good times."
    },
    {
      "rating": "8",
      "text": "Ready or Not is a cool movie in all of its genres 1. It is funny as a comedy2. It is creepy as a horror3. It is creepy as a Mystery even moreExcept for some poorly spelled secondary characters and one small scenario mistake is a wonderful movie, with a very unpredictable, surprising and beautiful ending"
    },
    {
      "rating": "9",
      "text": "Stunned!wow with a questionable plot greatly executed!every second of it felt like dark,bloody and awesome wish that movie should be at least 2hr long but even if its not its a highly intense classic with great score,screenplay,acting and great use of R rating!"
    },
    {
      "rating": "8",
      "text": "Dark comedy mixed with a little bit of suspense. Maybe some rich families behave like in this movie, who knows?"
    },
    {
      "rating": "10",
      "text": "just saw Ready or Not and I don’t think I’ve ever fallen in love with a main character that quickly like grace was a total bad ass."
    },
    {
      "rating": "8",
      "text": "We can’t all be Drag Me To Hell, but we can sure try. This one came close."
    },
    {
      "rating": "8",
      "text": "Ready Or Not was a big surprise for me. Its plot revolves around aspects of horror films, acid humor and survival. It is the first contact I have with the duo of directors Matt Bettinelli-Olpin and Tyler Gillett, and what I saw was very pleasant and fun.The characters are a mixture of people with strange archetypes with a deepening of a very discreet personality. Kristian Bruun's characters, Melanie Scrofano, Henry Czerny, Nicky Guadagni and John Ralston don't go beyond the line of character archetypes for a big depth. They are very shallow in what they propose, sometimes funny when it suits and convenient when the script needs it. They didn't captivate me and therefore aren't widely remembered for their deeds. The characters of Mark O'Brien, Adam Brody and Andie MacDowell are the ones that stand out for having well-established backgrounds and distinct personalities. They create their disagreements between the three because of their personalities and purpose that move them the during the plot.The highlight of acting goes to Samara Weaving who builds a smart, courageous, brave character and full of intermediary between these characteristics. We see a growing trajectory in his personality. If at the beginning of the film we saw that she already had these adjectives, throughout the film they potentialize themselves by becoming something incredible and coherent. Unfortunately your character is not so lucky even though your choices are the smartest for a horror movie. This character is wonderful.The story is very interesting with its rules and the crazy things that the script delivers to us. In my short stay on Earth, I didn't see many films in those aspects, so I can't be sure that the script for the film is original. The costume reminds me a little of the old times and I found the green and yellow colors interesting.Ready or Not is an entertaining film, it's interesting, containing a protagonist different from many others of the genre and that captivates those who watch it."
    },
    {
      "rating": "8",
      "text": "Ready or Not has many faults. Yet the film's wittiness and hilarious self aware comedy makes up for it. Samara Weaving leads great performances and completely steals the show. It will go down as a cult classic for sure!"
    },
    {
      "rating": "9",
      "text": "This weekend convinced me that, despite my 58+ years, I have no idea what makes a movie great.  Yesterday, I watched the critically-acclaimed Roma; I watched it mainly because I needed to see what all the fuss was about.  I didn't hate it but, at the same time, I couldn't figure out why all the praise was heaped on Alfonso Cuaron.  I just finished watching Ready or Not and I loved it.  I have a question for all the art-film lovers out there: when did we stop demanding of movies that they entertain us?"
    },
    {
      "rating": "9",
      "text": "Samara weaving gives a great performance and the viewer is genuinely interested in how she fairs throughout the film. There is lots of fun and much gore which adds to the story while managing to keep a brisk pace throughout. I was pleasantly impressed with how the characters acted off each otherr and seewhere the movie goes and everybody does a great job in making the outcome unpredictable. I loved everything this movie had the balls to attempt and was a thrill til the end. High recommended e end."
    },
    {
      "rating": "9",
      "text": "In this horror comedy, Grace (Samara Weaving), a bride, on her wedding night, unexpectedly finds herself in a ritualistic deadly game of hide-and-seek orchestrated by her rich in-laws. I found this to be a very well-put together movie.The backbone of the film is the dysfunctional Le Domas family. Each member is distinctive and well acted, and they have varying levels of competence and willingness. The ritual isn't a regular occurrence for them, and they act like regular people more than most horror movies featuring groups of killers. Half the fun is seeing the Le Domases try to figure what to do next as much as the heroine. Speaking of her, Grace is a fine lead. Admittedly, her character doesn't differentiate herself much from other movie heroines, but Weaving is good in the role. You do root for her as things get progressively worse.The actual backstory of why the ritual is taking place is thought-out and interesting.The movie blends the humor and the horror. Though the violent moments occur sporadically, they are pretty strong when they happen. I was kept tense by what was happening to Grace and what'll happen next.The design, sets, and costumes all look great. They have a classic haunted house or murder mystery feel to them.Be forewarned that although the film is generally amusing, I didn't have any laugh-out-loud moments. It's more about the general feel.Overall, I found this to be a pretty fun time and recommend it."
    },
    {
      "rating": "7",
      "text": "If you watched the trailer for Ready or Not, you know most of the story and you can probably predict how it will end. However, the execution of this seemingly simple story is actually really great. It's funny, it's bloody, and the ending takes a few twists that make it even more enjoyable."
    },
    {
      "rating": "7",
      "text": "Good movie: Part Battle Royale, part Kill Bill but mostly Get Out for White people. Enjoyable."
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    },
    {
      "rating": "10",
      "text": "Ready or Not is a delightful summer surprise -- a beautifully acted and very, very funny comedy about an eccentric family “welcoming” its newest member by marriage. The actors are all very convincing, especially Samara Weaving (the young bride). Sometimes you just take a chance on a film – and get lucky."
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "7",
      "text": "It doesn't come to reinvent absolutely anything but damn it's entertaining.I mean if you fully analyze the plot, it might sound dumb but that's kind of the idea if you really want to set your mind on the game and enjoy it with its black humor and violence.It isn't the analogy of anything, nor about you having some kind of deep talk after seeing it.I've heard that some critics tried to give the plot a greater meaning, especially what marriage implies within a wealthy family and the pressures of marriage but I didn't see that at all.For me Ready or Not it's simply a funny film that I can't really catalog as horror but rather a tension and action thriller with elements of horror and comedy that seeks nothing more than entertain its audience and it achieved that with me.That's its offer and it's successful with it. That was more than enough for me."
    },
    {
      "rating": "9",
      "text": "I loved this movie. Didnt know much then what I read in the movie description but I'm so glad I ended up watching it. Kept me on the edge of my seat with more omg then I've ever said"
    },
    {
      "rating": "10",
      "text": "A good mix of genres perfectly executed. Something we rarely see. Horror, comedy and mystery.Samara Weavings performance is stunning. Her unconventional talent makes her stand out completely and instantly makes you understand why her character does this and that. She doesnt even need explanation to her character.Other actors are good too. There are some overdone characters, in an Adams Family-manner, but still very believable and funny.The dry humor is placed perfectly and often far too real (which of course isnt funny in real life)."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"
    },
    {
      "rating": "0",
      "text": "This dark and violent film draws heavily from other fright movies There is nothing original or even suspenseful to redeem this piece of trash. Save your time and money."
    },
    {
      "rating": "7",
      "text": "Interesting movie with some original plot twists and a beautiful and bright main girl-character (Grace). Also, I had fun with a few jokes about rich's wishes and their view of world.Tension preserves the whole movie and the plot surprises with the course of events in some places.However, I saw a contradiction with the right logic in the sequence and the wrong logic of what's going on"
    },
    {
      "rating": "7",
      "text": "I think that Metascore is about right on the money, though I'll give it my bump to 70.  Loved the old dude from Revenge, and Weaving is really good - though  I would have loved some more depth written into the part.  How did she and the groom meet?  What makes her tick?  She's a bit too much of a tabla rasa for my liking. And I'll agree with most of the reviews in that it ends extremely effectively.  A friend of mine said he thought it had the same feel of \"You're Next,\" and I agreed going in. But it's not nearly as good as that horror masterpiece. But this film looks amazing, and it's so great seeing Andie McDowell back in the game. On the balance - recommended."
    },
    {
      "rating": "7",
      "text": "I went into this movie with zero knowledge of what it was, no trailer, no synopsis, no clue. It's a movie that owes a lot to other successful horror - Get Out and the Purge are the most obvious - it borrows heavily from other sources, and overall it works well. Samara Weaving is phenomenal at handling the juggling of horror/comedy/exposition. You won't be surprised by anything, but it's one heck of a fun ride. Hail Satan!"
    },
    {
      "rating": "1",
      "text": "This is what happens if Disney is involved in a \"horror comedy thriller\". The movie is confused with what it wants to be: social commentary, horror movie, suspense thriller or comedy. Unfortunately it doesn't tick any of those boxes and ends up as it's own punchline. At best, it's a B-horror movie that should have gone straight to DVD. The jokes are dry, the plot development is painfully obvious, the script reads as if it has been written by a badly trained bot and the characters lack any depth which makes it even harder to take seriously. Some of the actors did their best with the available material but unfortunately there wasn't much to work with. The concept is actually interesting but the execution is severely lacking.  I understand horror movies don't have to be deep but this was too surface level, too contrived, had no substance whatsoever."
    },
    {
      "rating": "7",
      "text": "Entertaining. Fun to Watch. The plot even if it’s simple it’s original. Lead actress lovable."
    },
    {
      "rating": "7",
      "text": "Ready or Not is a fun modern horror film, that is referential to home invasion movies but adds a sense of humour. Overall it didn't quite push the envelope as much as I would have liked but I do like an original idea."
    },
    {
      "rating": "7",
      "text": "Something about weddings is horrifying, it is an event where people repress their happiness.  In Funerals people repress their anger.  I think these 2 events when put together really show people for what they are.  I think gore in a horror movie should serve some purpose or it really detracts overall."
    },
    {
      "rating": "6",
      "text": "I love dark humor horror films, and this has flashes of being campy fun. It’s very self-aware and has some nice jumps and chuckles, but it feels a bit under-baked, like the jokes were first draft and clever kill ideas were limited. It’s no “Evil Dead” or “You’re Next”, but it’s a fun enough time."
    },
    {
      "rating": "0",
      "text": "This movie was so bad, I created a Metacritic account for the sole purpose of warning anyone else from wasting their money on this utterly sadistic, seemingly unending, steaming pile of cow manure with zero redeeming qualities to it.  The trailer gives you all you need to know.  The trailer is probably the extent of the actual movie running time that's not filled with dark, grotesque, graphic, gratuitous violence.  The characters are completely unlikable, with the sole exception of the heroine, and by the end of the film, you're even rooting for her to die...to put yourself out of the misery that is this waste of celluloid without having to make the \"walk of shame\" and leave the movie early, like one of the other 2 people watching this movie tonight did (within the first 15 minutes.  I so envied her!  The person I was with was the one who chose this movie so I couldn't leave).  Usually a suspense/horror movie will have at least one high point...it will turn campy, or it will have a somewhat interesting plotline, or funny casting.  I got nothing.  This movie should never have been made.  \"Ready or Not,\" if you buy a ticket to this, you will walk out of the theater wanting your money back...or at the very least, the wasted hour and a half of your life."
    },
    {
      "rating": "5",
      "text": "The movie was somewhat entertaining. I was sorta engaged most of the time, though the story contains so many holes that it's hard to reallly enjoy this movie. The bride is incredibly skillful at avoiding the family killers without any context as to where she acquired these skills. Put someone under enough stress and they'll miraculously acquire top skills in no time at all. Several things made little to no sense when you start to think about them. Many things just happen out of shear stupidity. The acting wasn't really bad, but the plot could have used quite a bit more work, unless it's just too thin to make something worth seeing from that at all. Too much meh, I should have watched something else."
    },
    {
      "rating": "6",
      "text": "A tantalizing concept is nearly undone by semantics and a persnickety penchant for the specific. I saw this movie for one reason and one reason only -- the simple, yet effective premise. \"A newly married woman must literally survive a night with her murderous in-laws in order to become a part of the family.\" What part of that logline doesn't pique your interest? Apparently a good portion of it if the creators of \"Ready Or Not\" are to be believed, as the actual finished product tries to jazz things up with drawn out exposition, convoluted backstories, and Satanism. Nothing typifies how badly this movie gets caught up in the \"how\" and \"why\" better than the conclusion, which somehow ends up being the most violent and least interesting moment in the film. Still, this sporadically inspired romp is mostly enjoyable overall. I just wish it was more focused on the dynamite idea at the center, and less on trying to sensationalize everything."
    },
    {
      "rating": "7",
      "text": "\"Ready or Not\" is a darkly funny and also tense horror-thriller that capitalizes on its unique premise. Its characters are fun and the ending is on the money."
    },
    {
      "rating": "7",
      "text": "I couldn't stop looking at Samara Weaving whenever she was on screen (which is most of the time) in Ready or Not, one hell of a slasher comedy that I didn't expect to keep me hooked throughout its 90-minute run. It's massively entertaining, thrilling, and hilarious and reignites my faith in horror comedies. Very-well executed and rarely boring. Give it a watch for a Friday night stress-busting session. TN."
    },
    {
      "rating": "4",
      "text": "The only thing keeping me from going red was the special effects. Once again I have fell prey to my fellow critics. Some ridiculous outburst of profanity did bring a chuckle to the sparse audience. other than that .. SAVE YOUR MONEY"
    },
    {
      "rating": "7",
      "text": "I found it quite nice - it had action, funny moments and was not boring throughout. It did have some dumb moments in it but overall I think it was a good movie"
    },
    {
      "rating": "8",
      "text": "First of all, I wish this film was a bit longer. The film is one hour and thirty-five minutes, with credits, and I feel like if it was longer it would have helped it out a bit more. This is a slight spoiler but it’s the opening scene so either skip over this or read it but the film just jumps straight into the film. There is no lead up into it, it just jumps right in so not till later in the film do we learn why they are doing this. So, I feel like a couple of extra minutes in this film could have helped it out. The acting starts out cheesy and kind of annoying but as the film goes on and the stakes get higher it takes a sharp turn and becomes pretty good. As the movie progresses you get to see which family members are fully invested into this and which ones would rather not do it. I will say that Grace is one of the most badass characters in horror and I was always cheering her on. I will say the editing in the film is kind of award at times and makes no sense. I say sometimes because most of the time it’s edited just fine but in a couple of scenes it just jumps to a scene that isn’t connected and almost feels like the directors were like, “Shoot we forgot that one scene well let’s just throw it in between these two scenes even though it doesn’t make any sense to.” This film is a horror-comedy and I will say they balance the two well and a couple of scenes had me chuckling. The last thing I want to mention is the score by Brian Tyler is great. In the end, I highly recommend checking out this film at least once because it’s a unique and original story and we don’t have a lot of that now a day. I give Ready or Not a 8/10."
    },
    {
      "rating": "7",
      "text": "Surprisingly fun and FUNNY! I do recommend watching it in theaters as getting crowd reaction is a bonus."
    }
  ],
  "recommendations": [
    "happy_death_day_2u",
    "the_wolf_of_snow_hollow",
    "signs",
    "it",
    "dark_skies",
    "the_babysitter",
    "now_you_see_me",
    "summer_of_84",
    "countdown",
    "marrowbone",
    "colossal",
    "better_watch_out",
    "the_mist",
    "us",
    "devil",
    "insidious_chapter_2",
    "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_",
    "american_ultra",
    "a_perfect_getaway",
    "it_chapter_two",
    "disturbia",
    "happy_death_day",
    "now_you_see_me_2",
    "old",
    "chernobyl_diaries"
  ]
}