{
  "id": 255,
  "title": "Real Steel",
  "starring": [
    "Hugh Jackman",
    "Dakota Goyo"
  ],
  "runtime": 127,
  "genre": [
    "Action",
    "Science Fiction",
    "Drama"
  ],
  "description": "Charlie Kenton is a washed-up fighter who retired from the ring when robots took over the sport. After his robot is trashed, he reluctantly teams up with his estranged son to rebuild and train an unlikely contender.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4GIeI5K5YdDUkR3mNQBoScpSFEf.jpg",
  "categories": {
    "plot": 6.204545454545454,
    "acting": 5.8125,
    "ending": 7.166666666666667,
    "soundtrack": 4.666666666666667,
    "cinematography": 5.0,
    "familyFriendly": 5.92,
    "funny": 5.0,
    "action": 6.8
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Real Steel is definitely The Real Deal . Its was enjoyable to watch , It was remarkable to see those robots fighting & its was incredible to feel this movie . Real Steel is an amazing Si-Fi film and best of 2011 of this genre(tie with Super 8).Another SS masterpiece. Hugh did superb,He was just freaking amazing and he really was the perfect choice. Dakota did better then I hoped .Also Eva , Olga and others did really good job . Effect was definitely Top Class.Shawn did and amazing job directing this. Now lest go to the End of the film .... Not what I expected and sorry but didn't like it , I want to see this kinda twist on other film but not in this kinda films . Another thing is that this movie was too childish . Not that I hated it but sometimes it was too much that certainly doesn't go with Fighting films but they did make it enjoyable . But Now I wish It could have been more mature , darker with more violence . But Real Steel wasn't boring for a second ....Enjoyed , Laughed , Saw the 2020 Bot Boxing so hell yeah I want to see A sequel and One after that ... \" Real Steel Trilogy \" how's that sounds hah !!"
    },
    {
      "rating": "8",
      "text": "Ok Real Steel, the new Shawn Levy movie, what happen? The movie is really funny, have awesome effects, good performances, good cast, good trama. Real Steel is a good show for all the family."
    },
    {
      "rating": "7",
      "text": "This film isn't the best ever made by a long chalk but it also is not at all bad, it's just mindless fun, if you want a film you don't have to worry about too much or over think about, just a bit of good old fashion fun, this is it.  Hugh Jackman is great in it too."
    },
    {
      "rating": "8",
      "text": "Real Steel to me than a great movie, a movie that has the vibe and emotion from beginning to end .... It shows the friendship of a child and separated by a year, shows the difficulty in cohabitation, after the death of his mother ... Finally, animation, notes: 10. It was great fantastic, actors acting was great ... A film that keeps you in boredom ... However, I think I missed a bit of history, the film is attached to only two things, the child is with his father after years ... And the struggles of robots ... Otherwise the movie is very good ... and amazing!"
    },
    {
      "rating": "8",
      "text": "Critics... pah! This is great fun... does what it says on the tin. Robots smashing each other to bits.  Yes it's got an element of the cheese factor, but that's what we really love in a big budget special effect bonanza.  Reckon the fact I have 2 sounds made the film all the more emotional for me... yes, I welled up a little.  Honestly, I was surprised by how much I enjoyed this film, escapism, adrenaline, tears and my head didn't hurt with having to over-think plot and storyline.  Solid 8."
    },
    {
      "rating": "10",
      "text": "just one word to describe this MOVIE when im seeingand the word are \" AMAZING \"really2 amazing..im wonder whats the director use to make this movie.."
    },
    {
      "rating": "9",
      "text": "A man, who is lost in life connects with his son over the course of a summer whilst fixing and fighting robots.  Together they learn, love and find what they have been missing. Itâ"
    },
    {
      "rating": "7",
      "text": "Amazing visual effects, but a story that is too simple, rushed and without any development of the Characters; Hugh Jackman carries all the movie ass Bikerjames has written below - but I believe that the audience target was from older children and teenagers (beside their parentes, off course - ultimately movies are to have some good time watching them), and it has a nice message, and is a fun movie to watch."
    },
    {
      "rating": "8",
      "text": "I rewatched this movie today and it was better than before i watched the first time, sure its like rocky for robot, but it doesn't make it any worse, i'm a sucker for the underdog movie and this movie does that exceptionally well, Hugh Jackman is great in here and the 3rd act is breath taking"
    },
    {
      "rating": "7",
      "text": "Real Steel is a silly, fun, serious and enjoyable film.  I had a lot of fun fun watching this for good reasons.  The characters are good, but the characters are not used properly, so unpredictable at times which could be good or bad.  I should also point out how overly dramatic this film was, there’s some scenes you need to turn your head away from because the acting can be bad and hard to watch.  But I’m not gonna lie saying it was bad, I really enjoyed and loved it, but critically I cannot say it’s the best."
    },
    {
      "rating": "7",
      "text": "\"Real Steel\" is real. It has the visual action with a cheesy but good story. A good entertainment to watch with your kids or family."
    },
    {
      "rating": "9",
      "text": "Here is what you get when you see this movie:  You get to be with moviegoers that will cheer and clap out loud (when is the last time that happened).  You get great fight scenes. Real life Rock'em Sock'em Robots. You get the desire to stand up and throw a punch yourself.  You may get a tear in your eye.  If you go with your son, you get to watch him go through every emotion in two hours then talk about every minute of it for the next two hours. You get to watch a very good movie and you get your monies worth.  Again, when is the last time that happened?  No academy awards with this one, but you'll have some priceless snapshot moments with your family."
    },
    {
      "rating": "2",
      "text": "Either the majority of reviewers on here are HIGH, paid by  the studio or legitimately idiots.  I'm sorry but this movie sucked.  And not just in a silly, formulaic, seen-it-before kinda way.  This movie is bad from such a fundamental level that it literally pissed me off while I was watching it.  Let me clarify that I was excited to see this movie.  I missed it in theaters but it's always been on my list of movies to see.  So when I popped it in, I had no idea that by the 10 minute mark I'd be ready to rip my eyes and ears out.  The writing is atrocious.  I'm talking, abysmal dialogue, vague character motivations that seem to change on a whim, and probably the most annoying kid character ever.  So... an 11 year old is fluent in Japanese (because he plays video games, of course), a hip hop dancing prodigy, and the most innovative fight promoter/manager of all time.  That makes total sense.\r I give this movie a 2 only because the robot fight scenes are cool.  They are the only reason to watch but honestly, it hardly matters when you try to get through the s*** dialogue and the worst rap/hard rock soundtrack I may have ever heard.  If you value two hours of your life, I urge you not to see this movie.  It's not even bad in a fun way.  You will hate everyone involved with this film and you'll question Hugh Jackman's willingness to go along with this farce of a film.  I don't write reviews often but Reel Steel is so awful and these reviews are completely giving everyone the wrong impression.  You will not cheer, you will not clap and you will not shed a tear.  Except when you realize what a waste of two hours this crapfest is."
    },
    {
      "rating": "9",
      "text": "I went to this movie with apprehension and at first wondered if I had come into the wrong show until I saw Hugh Jackman at the wheel of his truck. I was expecting it to be far into the future but soon found it was in a time similar to ours, the not to distant future. It's a relatable world with characters not much different to us. Real Steel was a pleasant surprise and had a Disney flavour, it's really worth seeing. It has a great story line, interesting characters and great robot fighting scenes. They were well-done and the Robots look so real and you would hardly  tell that it was all done by computer simulation. This movie is a heart felt father son story between and ex boxer Hugh Jackman and his son Dakota Goyo. I wouldn't be surprised is there is a sequel and I'd definetly go alone and see it."
    },
    {
      "rating": "9",
      "text": "Here is an over-the-top idea to bring in a rock 'em sock 'em robot movie with Wolverine rather than Optimus Prime that many are overlooking from the trailers. Guess what, the movie was great and a lot of fun! I took the family and if the wife enjoyed it, then you know it wasn't that bad. The fights did remind me of Rocky and even a few of them seemed to mirror Balboa's fights, I was hooked into them no different rooting for Atom. My boy was loving every second of it. So if you want to be entertained, blow off the negative critics and go see it. That's what movies are about right, just enjoying it and not wanting everything to be grounded in realism?"
    },
    {
      "rating": "10",
      "text": "I am in a robotics team, so i might be a little biased towards robots, but i think this was the best fighting movie of the year!!!!!!! I was looking forward to this movie soo much, and it STILL beat my expectations!!!! It is a classic movie of a father getting to know his son better after leaving him alone with his mother and they are seeing each other for the first time because the mom died. However, the fact that the dad is a pro boxer and that he fights extremely high tech robots is a very good plot line. He is kind of a bum that is trying to earn money to pay off many debts, but he ends up getting a really cool son instead. If you like Rocky Balboa and transformers (mainly the robot part, not so much the transforming part), then you will think this movie is epic!!!"
    },
    {
      "rating": "8",
      "text": "Real Steel has cool parts were the robots are fighting each other in the ring and neatest part is that they have one of those dramatic moments that makes it real to begin with. Although it does make this movie turns into Rocky and Rock Em Soc-kem, but it's good movie that brings the action of best visual effects and good acting. And there's nothing compare Transformers or Michael Bay has nothing to do with it, but Real Steal is cool!"
    },
    {
      "rating": "8",
      "text": "This movie was just pure fun. Filled with awesome-looking robots engaging in eye pleasing fights. I loved this movie. Good story with great action. Hugh Jackman is one of my favorite actors. I was engaged from start to finish. Don't listen to the people complaining about it being predictable because isn't every boxing/sports movie these days predictable? Don't listen to the haters, because if you enjoy action, a good engaging father & son story, and lots of robots, then go see this movie now! You will not be disappointed if thats what you go in expecting and hoping. Fun and exciting film, 8/10"
    },
    {
      "rating": "7",
      "text": "I was hesitant to see this movie. Based on the previews, I had a pretty clear cut vision of what this movie was - a Rocky clone, but with robots! Robots! And Wolverine! These last two bits are important. Robots are awesome, right? And Hugh Jackman is awesome, too!. So, based on these two things alone, I bit the bullet and gave this movie a chance.The end result? I wasn't at all surprised. At all. About ANYTHING. You know everything that's going to happen before it does. But the action is visceral and believable, the 'bots are badass, Jackman gives a great performance and actually makes me cheer and hope for this character. The boy wonder (Dakota Goyo) initially made me very nervous (a bad preteen protagonist can ruin movies for me), but ultimately he did a \"pretty okay\" job, albeit a little over-the-top.I don't regret seeing this movie and look forward to the sequel.Pros:- Robots!- Hugh Jackman does a standup job and creates a good character.- Great fight choreography. They really nailed this.- Good, modern special effects.- They somehow make ROBOT BOXING sound like a legitimate, believable \"sport of the future\".Cons:- Kid sidekick never annoyed me, but I certainly didn't care about him.- The inner workings of the 'bots is never really explained. No science and very little character. Why can't the bots have a little more personality or character development?- 2020? Really? Are we THIS close to Battlebots: Bipedal Edition? And $50,000? I can get a miniature Gundam for the price of a nice car?"
    },
    {
      "rating": "10",
      "text": "Loved the movie.  Futuristic version of the original Rocky.  Nice tale of a father learning to be one.   I would recommend highly.  PG-13...there is some violence, but not brutal as in the Rocky Saga."
    },
    {
      "rating": "4",
      "text": "Real **** if you ask me. What a waste of time, my God. Disgusting acting, disgusting dialogues, disgusting SUPER predictable story, disgusting ..    ..........................................................................................Two hours later..............................Just because of Atom, who was somehow cute and the robot battles, I rate the movie with 4. So I guess.. No, I would totally not recommend that crap."
    },
    {
      "rating": "5",
      "text": "I was apparently WAY too old for this movie.  It was predictable from the opening frame.  Maybe a good family film to take your kids to but just didn't hold my attention the way Super 8 did which was also a family film.  Hugh Jackman carries the entire film as far as I'm concerned.  His model-looking girlfriend who is a mechanic (yeah right) is not used much and the kid is a little hammy at times.  Actually he's hammy most of the time.  Lots of preposterous eye rolling moments.  I looked at my watch a couple of times hoping it would end.  Also, Hugh Jackman plays a jerk who ignored his kid his entire life and couldn't even remember his wife's sister's name, and yet we're suddenly supposed to be cheering for him?  Now suddenly he's a good guy since he introduced his 11 year old son to the art of boxing and betting on sports?"
    },
    {
      "rating": "5",
      "text": "This could've been much much better if they just made one adjustment - remove the kid. Seriously one of the most annoying child characters ever portrayed on film. This kid is a shining example of Gen Y at it's worst. All throughout the film I was left cringing at his dialogue and his motivation, this kid was just too much of an arrogant brat to sympathize with or even understand.As for the rest of the film, visually it's a treat with great CGI and a really interesting mix of beautiful  American country side and state of the art futuristic robots. I thought the cinematography was excellent and gave the movie a look and feel unlike anything else. Hugh Jackman was great despite also having a slightly unlikeable character.As for the story it self, it's basically a mish-mash of a variety of Disney style family orientated films. Father reunites with son, old vs new, good vs evil, the underdog, little guy vs coorporation, etc. At times this movie lays it on so thick that you just want to vomit.To me this movie could best be described as 2 Stallone films in 1. \"Over the Top\", and \"Rocky\" + robots. Again, it's a shame the child character was such a douche which ultimately really detracted from the film."
    },
    {
      "rating": "10",
      "text": "My son at 10 minutes in: \"I LOVE this movie!\" :) Really well done - great fx, really good actors, good, personal story. Like a \"Rocky\" for kids. A good father-son bonding movie. :)"
    },
    {
      "rating": "4",
      "text": "This movie was below average. At some point it even felt like a parody, because the dialogue was so bad. I have to say I liked the idea of the movie - robots as boxers - but that was the extent of it. As for Hugh Jackman, I was amazed that he would be involved with this kind of movie with such a weak storyline. The robot fighting scenes where interesting and also CGI was great."
    },
    {
      "rating": "0",
      "text": "This is one of the worst movies I've seen this year.  The premise was interesting, the execution was not.\rI was halfway through the movie and decided I would give it a 5; but as it went on, I decided to drop it to the lowest possible score.  Why?  The kid.  Every time he was on, it detracted from what could have been a pretty interesting character study.  Instead, we got a crappy TV sitcom where the 11 year olds are smarter, wiser and tougher talking than the adults.  It really was truly unbelievable.  Oh, did I mention that he was also mechanical genius with robots even though he had never worked with them at all. I literally wanted to gag every time that snot nosed brat showed up onscreen. Don't waste your time or money on this dog."
    },
    {
      "rating": "1",
      "text": "I don't do movie reviews, but OMG, I can't believe the professional reviews (bought by Disney?), or the 7.9 by viewers.  1/3 of the way through the movie I asked my wife what the worst movie we'd ever seen was.  We agreed this was probably it.  We made it through to the end, but it is the weakest Disney effort we've ever seen!"
    },
    {
      "rating": "10",
      "text": "One of my favorite movies, the movie is an instant classic in every way. Great to take the family to, with the gf, go with friends... all around a great movie. It has tons of action.... who in their right mind doesn't wanna see fighting robots? It has some lovey dovey scenes, it makes you feel as if you are a part of Atoms journey to greatness and it really brings you into the lives of the main characters. The critics are being REALLY harsh, there's no reason to give this movie any less then a 9. If the movie interests you at all, it's defiantly worth seeing on the big screen. I found myself cheering Atom on the whole movie and really felt as if I could connect with all the main characters. Can't wait for Real Steel 2."
    },
    {
      "rating": "9",
      "text": "This is highly likely the film of the year. It's a daft concept, Rocky with robots, but it works and it works brilliantly. The film maybe cliched in it's plot but you should already expect that the estranged father and son will make amends and win the competition etc. These are acceptable cliches they are the cliches that you will enjoy seeing and thankfully the ones that you don't like to see are avoided. There were many points where I expected a certain cliche to happen and then nope it was avoided, it shows their was care and consideration put into the making of this film. The film gives you what you want and is a totally great feel good film. The robots look fantastic and the boxing is edge of the seat stuff, you will really give a damn about Atom winning his fights. Jackman is great as always and the little kid in this reviewers opinion was excellent although kids can be make or break for alot of people so you'll have to decide for yourself. Fantastic film, you'll love every second. Only problems are gangsta COD player soundtrack and lots of product placement. Easy 9/10, go see it!Final thought: How come a director with credits such as Night at the museum can make a movie with better robot fight scenes than Michael Bay? **** you Michael Bay..."
    },
    {
      "rating": "5",
      "text": "I found the movie very likable 3/4 of the way, but then the movie became very childish at the end. The special effects are very good, probably the best ones I seen to date."
    },
    {
      "rating": "10",
      "text": "A very good and entertaining movie. My husband liked it (he's a very critical person) and my 9-year old daughter loved it. Yes its unrealistic to us in 2011 but who knows what will happen in 2027. It's not a movie to take seriously but its what i call a \"fun\" movie. Watch out parents there's cursing throughout the whole movie including the little boy. That's something hollywood really needs to get rid of when it comes to cursing kids. My child would be disciplined if she curses like that. Besides that the movie is two thumbs up."
    },
    {
      "rating": "0",
      "text": "Just seen it, and I absolutely hated the kid... spoiled / ruined / blemished / atrociously KILLED the movie for me. Go Hugh Jackman, Atom & Noisy Boy!  Robots Rule! But not in this movie."
    },
    {
      "rating": "3",
      "text": "\"Real Steel\" might be a success with 7 to 12 year old boys, who think that action without soul is cool. Robots get into the ring and duke it out forever. Special effects are nice. Unfortunately there is nothing interesting about these robots. They are just chess pieces inside a single square. The players are outside the ring, but turn out not to be interesting at all. The queen of Lost is lost. \"Wolverine\" attempts to be \"Han Solo\", but fails to both shoot first, and even shoot at all. There is a boy in this movie, someone kids can relate to, good with technology, able to remake a robot overnight in a trailer, add voice control and stuff like that. Normal kid. It could have worked if the story wasn't so overly sentimental. I think every major character shed  a tear close to the end. I did not. What \"Real Steel\" needed was some reality and some steel. Some kind of chaos would have been nice. Some conflict that you could believe. Well, \"Real Steel\" didn't work for me, but due to impressive animation I'm willing to give the movie 3 out of 10. I saw potential in this movie. Like at a moment when a robot hugs a kid, what would have happened if the robot had by accident squeezed a bit too hard? I guess it wouldn't have been such a cute movie, but could have raised the stakes from zero to something, at least. Maybe."
    },
    {
      "rating": "7",
      "text": "\"OVER THE TOP\" with Sly Stallone = Child Custody + Arm Wrestling\"REAL STEEL\" with Hugh Jackman = Child Custody + Fighting RobotsNot much else to add.  Old story in a modern setting :D"
    },
    {
      "rating": "8",
      "text": "So Wolverine trains a Transformer, so that he could box like Rocky Balboa, in a rock ' em sock 'em league ? Some viewers may say that the story is ridiculous and it looks like it's gonna be a sh*tty movie, but there death wrong. \" Real Steel '' is the perfect movie to go see with some friends and family on any occasion. It's a heart warming, great, awesome movie about robot boxing. Even if it's predicable, the film is still entertaining and enjoyable. You know when you see a recognisable actor, you have seen him before, but you don't know his name. Yeah, I'm talking about Kevin Durand (as Ricky) , that guy, which he plays a complete d*ck, like most of his movies. For some reason I wanted to specify that, because I finally know his name. Anyway, Hugh Jackman showed once again his good acting skills. I notice that there were a lot of mean, snobby, arrogant characters, but very few likable ones. Also, the robots battles were so anticipating and intense, that I really wanted Atom to win. The connection between Max Kenton (played by Dakota Goyo) and the robot (Atom) reminded me of the movie '' The Iron Giant '' (1999). You know what I'm talking about, that special chemistry (just not as intense). The special effects were amazing. It's an enjoyable movie, definitely worth to watch."
    },
    {
      "rating": "8",
      "text": "How to make boxing can be accepted by young children? In thiz case, the answer is REAL STEEL. The Director Shawn Levy cleverly turns the rough boxing matches into fun, passionate and enjoyable family adventure by presenting attractive and super-cool Robot figures. Levy is well-known for CHEAPER BY THE DOZEN (2003) and NIGHT AT THE MUSEUM (2006). For me, he seems to know how to roll the dice of excitement. Besides being effective in constructing believable and powerful Robot-fights, thiz movie has heart-warming story of father and son relationship. Charlie Kenton (Hugh Jackman) is a former professional boxer who turns out to be Robot-fight promoter, just met his 11-year-old son he never knew before, Max (Dakota Goyo). Instead of Charlie teaches life lessons to his son, Max. On the contrary Max has been inspiring his father how to win World Robot Boxing, but more than that is about how to win life. There are some encouraging and gratifying scenes. One of them is when Max and his Robot, Atom show their dance moves. On the other side, I can almost say thiz is probably the most humane character that ever played by Hugh WOLVERINE Jackman. While the father character looks troubled and typical anti-hero, but it is relatively effective to gain sympathy. Spoiler Alert! The final scene reminds us of first ROCKY (1976) where the hero did not have to win the match, but he certainly won the heart of audience. Max shows his big heart by saying -It sounds pretty good to me. The Robot with the heart? Awesome!\r Visit My Blog on JONNYâ"
    },
    {
      "rating": "9",
      "text": "I think that the majority of the reviews for 'Real Steel' are not only harsh but smack of reviewer ignorance to the point where I even wonder if they watched the film. Yes it is a bit sappy, sometimes a little too much but it is a family movie for goodness sake. Take care when reading reviews from ragazines like the NY times (where the reviewer makes so many factually inaccurate statements about the film that it is obvious he did not watch the whole film) and pay attention to Metacritic. Spot on."
    },
    {
      "rating": "7",
      "text": "I was pleasantly surprised at Real Steel. I was expecting a Rocky carbon copy at best, and another Transformers instalment at worst. Yes, it does owe a lot to earlier boxing movies, the Rocky series in particular, from which it \"borrows\" entire story arcs, but it still manages to present enough new ideas to leave its own mark. At its very heart, Real Steel is a very human story about an estranged father and son growing to love each other through a shared passion, and through shared struggles. The film also has exhilarating action, interesting visuals which blend the futuristic with the retro, and an unexpected amount of decent laughs. Hugh Jackman does what he does best - playing another gruff streetwise smart-ass hiding a kind heart, and Kevin Durand makes a good villain, a rich and brutal Deep South scumbag. Everyone in the cast is acted off the screen however by the young Dakota Goyo, who looks a bit like The Phantom Menace's Jake Lloyd but has bucket loads of attitude and considerably more talent. Despite the film getting so many fundamentals right, you have to ask what the character of Evangeline Lilly's boxing club owner Bailey brings to film beyond bubbling romantic implications with Jackman's Charlie, you have to ask why the film needs to be over two hours long, and you also have to ask why Real Steel needs fighting robots at all. My guess is that the decision was purely mercenary, as the story would have worked just as well as a contemporary tale about a damaged father-son relationship that is healed through their shared experience with boxing.  But hey, robots beating each other to rust is cool, and you really can't complain much when the resulting film is this fun."
    },
    {
      "rating": "6",
      "text": "Real Steel is very predictable, has an annoying Justin Bieber character whom dances with robots and has a story with unnecessary 'conflict' stuffed in to fill each scene. The robot designs were so so and the story was meh. Real Steel is watchable and I didn't hate it but is uninspired."
    },
    {
      "rating": "8",
      "text": "It's not the best action-thriller/drama in recent years, but it's not Transformers. It's a reasonably compelling -- and heartwarming -- story with a terrific cast and exhilarating fighting sequences as well as stunning special effects."
    },
    {
      "rating": "7",
      "text": "I am 31 years old and I caught myself clapping at one point.  I love all sorts of movies and I believe they are meant to allow us to suspend reality for 2 hours.  I think our opinions on movies also depend on where we are at in our personal lives at the time we see it. I was looking to relax with a movie about boxing robots and I achieved that.  Real Steel is pure entertainment.  It will really surprise you and leave you smiling and feeling like a kid again."
    },
    {
      "rating": "8",
      "text": "A really surprising win, i'd heard from just about everyone that it was complete **** then watched it with some mates, and bam, I am never trusting Sarah Ison again. It opens with \"All of my Days\" by little-known (but freakin amazing) singer Alexi Murdoch, who SGU fans will know from S1E3 \"Air\", with his (arguably, best song) \"Breath\" featuring at the end. The moment that song started playing, I could feel a win coming on, the plot is fairly stereotypical, in what i'd like to think is a bizzare threesome child, the parents of which were Rambo, Robots and Big Daddy, but its genuinely touching and with the exception of the odd cliche here and there, not at all unbelievable. The acting is top notch, with every major actor playing their respective roles with true feeling and commitment that's rare to find in mainstream movies these days, particular props to Dakota Goyo, who plays Hugh Jackman's 11-year-old son, and of course props to Hugh Jackman himself, who delivers another brilliant problems, Aussie Power FTW. Add to the that the brilliantly choreographed and animated robot punch-ups and some real hardcore **** Yeah!) moments, and there's a movie well-worth seeing. One particular flaw was the average score, while the little ditties in the background did suit the different moods, nothing was particularly memorable, but this is more than compensated for by the brilliant soundtrack, featuring several well-known songs that when used are used very well ---Final Verdict: 7.5 (-Rounded to 8)"
    },
    {
      "rating": "10",
      "text": "The movie was amazing. At first i wasn't impressed at all but when the plot developed - it really got me going and wanting more. Even a tear from my eyes. This movie deserves all 10 from me."
    },
    {
      "rating": "3",
      "text": "Real Steel is a unique premise. Boxing has been stopped in favour of robot boxing and Hugh Jackman's Charlie is just trying to keep up. Along the way he is joined by the son he abandoned 9 years earlier. He is joined by him because his mother has died so he takes him on the road, showing him the world of robot boxing. The problem with this unique premise is that it never really makes sense. The script sweeps under the rug some major plot points (The death of the son's mother is mentioned literally once) and is packed with clunky lines and exposition. The cast is sub par with the worst offender being either Evangeline Lilly as Charlie's love interest Bailey or Dakota Goyo as Charlie's son Max who is remarkably reminiscent of young Anakin Skywalker (yes, its that bad). Jackman coasts through the movie on charm despite the fact his character really is reprehensible at times. However the action in the film is visually flawless with some great animation and effects with the robot fights being great to watch. The main problem with the film is that the main story doesn't start for a whole hour (much like S.W.A.T) as Charlie makes mistake after mistake. I get that its trying to show what kind of a man Charlie is but its just slow and pointless and could have been done in half the time."
    },
    {
      "rating": "4",
      "text": "I only need one line to describe this film:\"Rocky\" + \"Transformers\" + \"Over the Top\" = One of the stupidest, predictable, badly written and acted movies ever! EVER!!!!!!!!Plus, I really think that the owners to the rights for Stallone's 1987 \"Over the Top\" should sue for plagiarism because Shawn Levy and the gang aren't even trying to hide it, they're just banking on the fact that not too many people remember that film these days.http://www.rottentomatoes.com/m/over_the_top/"
    },
    {
      "rating": "8",
      "text": "Good film overall. Balanced in all sense, not tilm of the year, but a film that must to be seen soon or later (maybe in TV at last). Definitely is precdictable but after all sometimes we like to have the possibility to receive what we want to be given to us."
    },
    {
      "rating": "8",
      "text": "What a nice surprise Real Steel is. A movie with cold, ton-heavy steel destroying each other in a ring while maintaining a passionate and emotional story about a father and son reunion. It has big-budget special effects intertwined with a heartfelt family story. Itâ"
    },
    {
      "rating": "9",
      "text": "Rocky with Robots! It was packed with excitement and amazing visuals.  Cast was awesome and funny.  This is movie is definitely for all ages.  Though it doesn't make you think that much, it is pure entertainment."
    },
    {
      "rating": "3",
      "text": "This is the worst movie I have seen that was actually trying to be a terrible movie, every aspect of this film is a complete  failure, film techniques are so basic, the music is crap, acting is garbage.  Also did i mention all the terrible ad placements hp or nokia. Not to mention if this were actually possible all the technology bad for the future it is trying to make sense but it just doesn't make any at all"
    },
    {
      "rating": "2",
      "text": "Just bad so so so bad.  There is just so much wrong with this movie, but the kid is what really ruins it. His acting is bad, his character is annoying, and by the end I wish Hugh Jackman's character had sold him and this whole little adventure had never happened. As for the plot, if the reason robot fighting was developed was because people wanted more violence why wouldn't it be robot MMA? Another annoying thing is that it's   clear that Hugh Jackman's character doesn't know how to box a small but very annoying thing. Overall just a terrible movie."
    }
  ],
  "recommendations": [
    "incredibles_2",
    "jumper",
    "bumblebee",
    "i_am_number_four",
    "teenage_mutant_ninja_turtles",
    "transformers_dark_of_the_moon",
    "shazam",
    "transformers",
    "four_brothers",
    "the_karate_kid",
    "terminator_genisys",
    "astro_boy",
    "seventh_son",
    "kick_ass",
    "super_8",
    "turbo",
    "the_6th_day",
    "shazam_fury_of_the_gods",
    "the_mummy_returns",
    "the_angry_birds_movie",
    "race_to_witch_mountain",
    "spies_in_disguise",
    "ice_age_the_meltdown",
    "we_can_be_heroes",
    "love_and_monsters"
  ]
}