{
  "id": 3116,
  "title": "Reasonable Doubt",
  "starring": [
    "Samuel L. Jackson",
    "Dominic Cooper"
  ],
  "runtime": 91,
  "genre": [
    "Crime",
    "Thriller"
  ],
  "description": "When up-and-coming District Attorney Mitch Brockden commits a fatal hit-and-run, he feels compelled to throw the case against the accused criminal who was found with the body and blamed for the crime. Following the trial, Mitch's worst fears come true when he realizes that he acquitted a guilty man, and he soon finds himself on the hunt for the killer before more victims pile up.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/n0BUpxa6E8PYoZWbx5g6CxbdalX.jpg",
  "categories": {
    "plot": 4.375,
    "acting": 2.8,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "This movie was bland, predictable and felt like a episode of Law and Order were Sam Jackson was a guest star. It takes cliched tropes for these kinds of movies and just runs through the motions. The lead, who put forth such a dull performance I forgot his name, wears a look of guilt on his face so obvious it's odd that the other characters can't tell he's guilty of something. I only checked out this flick cause it was free and now I've erased it from my hard drive. It's a very boring thriller that offers no thrills since you can already tell how it's gonna end. Just watch three episodes of Law and Order and you have just spent your time better."
    },
    {
      "rating": "6",
      "text": "The reviews are being a bit too harsh, I felt that the movie was rather fun to watch, and although some things may have been unreasonable, it still completes its goal - entertaining the audience"
    },
    {
      "rating": "7",
      "text": "District Attorney, Mitch Brockden (Dominic Cooper), goes out one night to celebrate a big victory, and fearing for the safety of his car, in a bad neighborhood, decides to drive home drunk. On the way, he hits a kills a man, running across the street. Another man, Clinton Davis (Samuel L. Jackson) is charged with the crime and it's Brockden's job to prosecute the man accused of committing his crime. Not wanting to convict an innocent man, Brockden blows the case, but afterwards finds out that the wounds on the man he hit, were not consistent with being hit by a car, and match the wounds of seven unsolved homicide victims. Now Brockden must find out if he mistakenly let a serial killer go free. Reasonable Doubt, unlike many similar films, actually had a unique and original story. Both Dominic Cooper and Samuel L. Jackson were terrific, and the film really could have been the hidden gem of the year, but only got 3.5 stars. The reason is simple, while it was a great story, it was far too predictable to be what it could have been. I really it hate when the Writers assume that the audience is too dumb to figure out what's going on. That's what happens here, while the story is tremendous, everything is laid out in such a way, that even a child would know what would happen next. Aside from that, the great story and terrific cast make for an exciting film, that was quite enjoyable, but it was just predictable to a fault."
    },
    {
      "rating": "5",
      "text": "I randomly found this on Demand. For a movie I never heard of it was decent. It starts off slow feeling like a TV movie, but gets more interesting the further you get into it. Nothing amazing about Reasonable Doubt, but worth watching for movie lovers.Not a great movie, but I would be more critical of it I saw ads for it every other commercial. At least they knew this was not a big event movie while releasing it."
    },
    {
      "rating": "4",
      "text": "Reasonable Doubt had incredulous plot holes that they made me want to wreck the DVD (I couldn't however. It was from the library...). Here's one (the biggest one): a district attorney thinks he'll be fine if he drives home intoxicated. He hits someone, and they end up dead. Then he's the lawyer involved in the case."
    },
    {
      "rating": "0",
      "text": "\"Reasonable Doubt\" seems more like an unfinished script as a finished film. Unoriginal, illogical, predictable, unitelligent.\r Really remarkable about the film is only one thing: The running time is given by 91 minutes. In fact, he has only 80 minutes. The closing credits have more than 11 minutes. I think that's a world record. This has otherwise only epic-films with a running time of 3 hours.\r So \"Reasonable Doubt\" is an absolute bluff-package. In every respect."
    },
    {
      "rating": "2",
      "text": "A decent premise for a thriller that is spoiled by absurd plot twists and a sleepwalking performance by Samuel Jackson. There is a feeling of having seen it all before. And why did they leave that nice furniture on the porch in the snow in the last scene?"
    },
    {
      "rating": "4",
      "text": "Critics didn't like this movie much, 19 of 100 at Meta Score is Overwhelming Dislike...\r Samuel Jackson as a villain in the film may be one problem.  Not that he wouldn't be a good bad guy, but he does rarely play one.  Big Stars always wanna be loved... and in this one the Bad part about Sam is hard to find.  He seems innocent throughout, no real 'I'm a killer' tension from the script.  Even at the end it's hard to believe that 'The Jack Man' would be huntin' us!\r The DA, the other main character in the film, isn't too bright... he does any number of boneheaded things, especially for someone who is supposed to be on the side of Justice.  So there isn't much to cling to in our fabled 'good guy' area.\r VERDICT: lacks punch"
    },
    {
      "rating": "8",
      "text": "Contrived and predictable yet fairly tense.\r Watch this movie here for free http://www.watchfree.to/watch-29ddee-Reasonable-Doubt-movie-online-free-putlocker.html"
    },
    {
      "rating": "4",
      "text": "Médiocre sans être mauvais et de surcroît très générique, La loi du tueur fait penser invariablement à un téléfilm dans lequel Samuel L. Jackson se serait égaré pour payer les réparations du toit ; ce ne serait pas la première fois, cet acteur pourtant excellent a en effet quelques daubes à son tableau de service.Ainsi, bien que le scénario ait de la suite dans les idées, quelques détails sont traités par dessus la jambe et la réalisation terriblement conventionnelle ne l'aide en rien. En outre, le petit gars Dominic Cooper est bien gentil mais désespérément médiocre comme pour faire écho à l'ensemble du film. On ne s'y ennuie pas... mais on est loin de vraiment s'y intéresser !"
    },
    {
      "rating": "6",
      "text": "A solid 6-star movie -- meaning it's entertaining enough to merit watching all the way through, even if it may not be earth-shatteringly stupendous.  In addition, the star, Dominic Cooper, is a rare commodity: a handsome young actor who is not annoyingly glib & cheeky like so many are these days.  Samuel L. Jackson delivers a nicely understated performance, for once not hamming it up as he tends to do.  All the supporting cast is good, including Erin Karpluk and Ryan Robbins; and it was nice to see the lovely Gloria Reuben again (remember her as Dr. Jeanie Boulet of ER?)."
    },
    {
      "rating": "6",
      "text": "I found this quite a tense film with some interesting plot elements, although preditable to a degree. Not as bad as the critics make t out to be. It had a fairly fast pace, and was not stuck in the courtroom as one might expect with a film of this type, which was a good thing."
    }
  ],
  "recommendations": [
    "man_on_a_ledge",
    "the_little_things",
    "the_next_three_days",
    "honest_thief",
    "perfect_stranger",
    "those_who_wish_me_dead",
    "jack_reacher",
    "unhinged",
    "peppermint",
    "snitch",
    "jack_reacher_never_go_back",
    "killer_elite",
    "the_call",
    "the_town",
    "the_loft",
    "the_taking_of_pelham_1_2_3",
    "law_abiding_citizen",
    "live_by_night",
    "gone_baby_gone",
    "cellular",
    "flightplan",
    "taken",
    "taken_2",
    "awake",
    "a_walk_among_the_tombstones"
  ]
}