{
  "id": 306,
  "title": "Rebel Without a Cause",
  "starring": [
    "James Dean",
    "Natalie Wood"
  ],
  "runtime": 111,
  "genre": [
    "Drama"
  ],
  "description": "After moving to a new town, troublemaking teen Jim Stark is supposed to have a clean slate, although being the new kid in town brings its own problems. While searching for some stability, Stark forms a bond with a disturbed classmate, Plato, and falls for local girl Judy. However, Judy is the girlfriend of neighborhood tough, Buzz. When Buzz violently confronts Jim and challenges him to a drag race, the new kid's real troubles begin.",
  "releaseYear": "1955",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/n0oJB5fhcUth9ZbHziwsFuR38gT.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.181818181818182,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Wasting this review in praising the magnetic performances from the leads, James Dean, Natalie Wood, and Sal Mineo, or the exceptional chemistry between them, would be an insult to this brilliant piece of work. All I can say about what Nicholas Ray achieved in this film that he created a dystopian parallel world where all teenagers are completely devastated because of their dysfunctional families. But you can almost completely relate to all the characters, and that's because Ray used the stereotypical forms to make how his teenager characters look on the surface. For instance, you can see how they bully each other in the most typical way, and that's why when you will reach the end of the first act, you might think that some things and some small details haven't aged well in this movie, while it's not exactly the case. In fact, when you finish watching this movie you may think that it's actually ahead of its time!The major three characters have motivations that were, and still, unprecedented. Above that, they are three-dimensional characters, and fully fleshed-out that can be studied. Of course, Stewart Stern's screenplay is one of the main reasons for bringing these characters to life. He gave them some incredible lines that should be described as jaw-dropping, to say the least! Because my jaw literally dropped every time Jim Stark try to interact with his father, not to mention a couple other times. have kept repeating: THIS IS GENIUS!  The adult characters are intentionally dull to serve the movie's plot, but that doesn't mean that the actors who portray them should give a dull performances. I really found almost every actor/actress' acting who play the dad or mom is very poor and monotonous, despite how great their characters are written. Also, the editing in this movie could be the worst editing I've ever seen in film. The jump-cuts between one scene to another are unbelievably terrible. You have to see it to believe how bad is it!Rebel Without a Cause will never age because it doesn't present the  '50s juvenile attitude per se, but instead it shows us how the juvenile  would behave if their parents' issues have a great, and more dangerous effect on them. Still don't know how on earth James Dean didn't get an Oscar nod for this role, though!(8.5/10)"
    },
    {
      "rating": "9",
      "text": "A well-executed movie and a totally relevant plot, even in our days.Rebel Without a Cause is a sad movie that show us that a not understood character may be relevant not to their parents, the people they love, or even themselves, but just to an audience in a theatre.When we get that, we care about the characters.I Don't get people saying this is really bad, I think they should take another look at it.If this movie is so trivial - as the teenagers problems - as most people say, well, we probably will forget it in ten years from now (and like my teenage problems, I don't think so)."
    },
    {
      "rating": "7",
      "text": "A film that I consider a far more successful piece of American culture than a totally successful film overall, it's clear to me that \"Rebel Without A Cause's\" reputation may have preceded it a bit. That's not to say it's a bad film in any regard -- quite the contrary, in fact -- but it is one that everyone will remember (and should remember) for its cultural significance more than its total cinematic worth. Think about the era in which this was released. The household was such a rigid thing, where children were meant to be seen and not heard. Physical and sometimes sexual domestic abuse were things for a community to either forget or turn a blind eye to. And the power dynamics of the home were all too often neglected, warped, or aggrandized to a harmful degree. It was a different time. It must've taken some real audacity and courage for Nicholas Ray to bring a story like this to the forefront of American culture. Tack on the additional, metaphorical weight of this film being the first posthumous release for the late, great James Dean and you're really playing with fire. Again, it's unforgettable, but for me, the reasons why are more intangible than I expected."
    },
    {
      "rating": "8",
      "text": "Rebel Without a Cause. Ability to listen, not hear. Excellent display of all the moral of the film. The conflict between father and son and whose other son everyone abandoned, and both of them wanted only love and to be understood."
    },
    {
      "rating": "8",
      "text": "The movie film is a government assigned project to broaden and enlight people and glory of nation. Cultural learning is emportant to follow on global basis. We make our nation a better and more convenient place for house and living. Kazakhs are progressive and asstonishing people that with conclusion of project will have new optimistic"
    },
    {
      "rating": "9",
      "text": "It may be on the melodramatic side and the teenagers are more like intellectual adults than delinquents, but 'Rebel Without a Cause' uses its smarts and James Dean's Marlon Brando-esque performance to deliver an indelibly youthful stamp onto the pop culture for decades to come. Watching it today is still an inspiring experience for filmmakers and artists alike."
    }
  ]
}