{
  "id": 190,
  "title": "Rebecca",
  "starring": [
    "Laurence Olivier",
    "Joan Fontaine"
  ],
  "runtime": 130,
  "genre": [
    "Mystery",
    "Drama",
    "Thriller",
    "Romance"
  ],
  "description": "Story of a young woman who marries a fascinating widower only to find out that she must live in the shadow of his former wife, Rebecca, who died mysteriously several years earlier. The young wife must come to grips with the terrible secret of her handsome, cold husband, Max De Winter. She must also deal with the jealous, obsessed Mrs. Danvers, the housekeeper, who will not accept her as the mistress of the house.",
  "releaseYear": "1940",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1qz3qUOHnVy7dL7M7G8jSErxE4b.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "It looks great, but it’s just pretty boring. Not even fun in a bad way, it’s just blah."
    },
    {
      "rating": "4",
      "text": "Hardworking and academic, embodied by a bland duo of actors, there is only the Bentley to remember. And this delicious slut from K Scott-Thomas."
    },
    {
      "rating": "0",
      "text": "Absolutely atrocious film. There was not a single redeeming quality. The acting was terrible, the directing was worse. I kept waiting for something to interest me, or keep me engaged, but this movie just went on and on with nothing to say. Watch the original."
    },
    {
      "rating": "10",
      "text": "ABSOLUTELY LOVED IT!!! A wonderful adaptation with perfectly cast archetypes of womens power, the men paled by comparison which was a welcome contrast between 1940 and 2020 direction as well as a spotlight on how well Du Maurier channeled timeless female strengths 80 years ago!For me the garish yellow suits the alfa males cowardice; fear of living alone, of betrayal and of losing face. This actor was very close to the Maxim in my mind conjured from re-reading the book a 1000 times; handsome, commanding, hotheaded yet weak in character... a shell. We are not meant to fall in love with Maxim,  he is an object of pity; a male in distress. It is the simpering, unnamed heroine who defeats her dragon, embraces her dead rival, rescues her man and lives on... The book strikes a chord with women and this film highlights and celebrates its girl power where Hitchcock tactfully placed artful, broody shadows, perhaps to keep the book within his social lens and time. Nothing can touch a Hitchcock masterpiece however this film, in many ways is more honest towards Du Mauriers cunning flip of stereotypes.The locations, cinematography and costumes are superb.I think the critics are comparing the film to Hitchcock's vision not Du Maurier's book and for that very reason have missed the magic."
    },
    {
      "rating": "6",
      "text": "Lily James plays a relatively naïve woman working in Monte Carlo, when she’s swept away by a dashing English aristocrat (Armie Hammer). They end up married and moving back to his enormous estate. Meanwhile, the memory of his first wife pervades the property and haunts his memory, which isn’t helped by the sinister housekeeper (Kristin Scott Thomas in the movie’s most juicy role). First off, the scenery and rich locations are beautifully showcased (only 2 rooms were sets). Secondly, the other performances are adequate, while never especially compelling. Finally, the story’s twists are the most interesting part of the film. I’ve never seen the Hitchcock original, so no comparisons, but l’d imagine this version is certainly more romantic and lush than suspenseful. Still entertaining."
    },
    {
      "rating": "4",
      "text": "Nonsensical remake. Ben Wheatley disappoints with a silly film that suppresses all the good elements from the original. It seems that he just executed what Netflix wanted for this project, more in line with the romantic films they've been doing for quite some time. Nevertheless,'Rebecca' it's entertaining, but the acting is terrible."
    },
    {
      "rating": "5",
      "text": "It’s becoming quite impressive how often Ben Wheatley is willing to challenge himself in different genres and styles and his remake of Alfred Hitchcock’s Rebecca is another example of his bravery. That said, for as good as this film looks (and it does look very good indeed due to sumptuous production design) it’s essentially very hollow underneath. I’m a huge admirer of Wheatley’s and for two thirds of this film he delivers some impressive work but it falls apart when it matters most and ultimately leaves you feeling like it was a vacuous waste of time."
    },
    {
      "rating": "5",
      "text": "There's an old saying in the movie business cautioning against remaking the classics. That's especially true when a director attempts to follow in the footsteps of a legendary director. It's advice that would have been well heeded with regard to this remake of the 1940 Alfred Hitchcock classic \"Rebecca.\" When a naive lady's traveling companion is swept off her feet by a wealthy English aristocrat in Monte Carlo, she's soon overwhelmed by her new life when she joins him back at home as his new wife, becoming the lady of the house at his sprawling seaside estate, a mansion where the ghost of his deceased first wife allegedly still lives on -- and with whom he is apparently still obsessed. While the film features a superb BAFTA-nominated production design, gorgeous cinematography, and excellent performances by Lily James, Kristen Scott Thomas and Ann Dowd, the suspense factor that made this picture's predecessor a classic is virtually nonexistent here. Instead, this offering tediously rumbles along, tossing out occasional mildly interesting revelations but never reaching out and grabbing viewers in the way that a Hitchcockian-type tale should. The story even becomes somewhat at muddled as it moves toward its conclusion, diluting the impact of whatever modest chills it may have built up along the way. Indeed, this release is, once again, further proof that, when it comes to emulating cinematic icons, it's generally best to leave well enough alone."
    },
    {
      "rating": "4",
      "text": "If I were a film director I would be terrified to face this adaptation, because even with the merits that you can bring to the story, and even when it's not fair, your work will be judged against Alfred Hitchcock's film.ALFRED **** HITCHCOCK.And we have to be honest, even though when in some cases, things can work out, this Rebecca is not one of them and the result is a film that unfortunately raised many undeserved expectations and will be judged both by them and by its unfortunate contribution to the material.What I see in this film is that Ben Wheatley tried to do the same thing Baz Luhrmann did with The Great Gatsby.The difference is that Lurhmann gave his reinvention a personality, while Wheatley just made a lifeless adaptation that looks great, but if someone told him or he told himself that focusing on the visual would be enough, he was wrong, and boy was he wrong."
    },
    {
      "rating": "5",
      "text": "This week Netflix released a remake of an Alfred Hitchcock classic, Rebecca, that stars Lily James and Armie Hammer as the main couple at the center of the story. The film is based on a novel by Daphne du Maurier that has been on high school reading lists for decades though I've never read it or seen the Hitchcock version. I didn't know exactly what I was getting into, but I expected thrills, maybe a ghost and a tense mystery. Here's what I actually got.The basic premise of Rebecca is that a rich guy, Maxim de Winter (Hammer), falls for a young lady's companion (James) while on vacation and their swooning romance becomes an impulsive commitment. Maxim is a widower still troubled by his wife, Rebecca's death; but, he brings the new Mrs. de Winter to his estate, Maderley, where the specter of Rebecca lingers and clings to the shady housekeeper, Mrs. Danvers (Thomas). Hijinks ensue.Supposedly, there's a mystery surrounding the circumstances of Rebecca's death. We hear whispers, but get no real details. Mrs. Danvers acts very strangely and disapproving of the new Mrs. de Winter, but the sneering portrayal while good doesn't really enhance the material. Both Lily James and Kristin Scott Thomas fill their roles admirably. James plays the doe-eyed rube well. She reminds me of the charm she had from her days in Downton Abbey. Thomas gets to be icy and almost menacing. Her obsession with Rebecca is palpable, but it is not really clear why she is so stuck on her - it feels just like a power trip. Hammer just fills the role of window dressing - any actor could have played that part. He and Lily James do look good together and have some good moments, but she gets the credit for selling the romance aspect of this film.The look of Rebecca is really well done though. Manderley is a stunning estate inside and out. It has that English stateliness of a Downton Abbey, but it also is creepy - too big to be cozy and so many rooms. There are shots that are on cliffs that are beautiful and scary at once. The sprawl of all that is going on fills the screen so wonderfully. They really spent their money well on that aspect. If the plot were as interesting as the craft of the film, then this would be a real winner.Ultimately, Rebecca is a passable film for 2 hours. It is not entirely engrossing, but it isn't boring either. It takes a while to get to the point and for the mystery to develop, but even then, it feels like an afterthought. On a gloomy autumn evening, you could do worse with a handful of popcorn than watch Rebecca. Give it a try."
    },
    {
      "rating": "6",
      "text": "Una película que no ofrece nada nuevo, pero se puede disfrutar sin problemas."
    },
    {
      "rating": "3",
      "text": "Flat. Emotionless performances. So disappointed, I was waiting for almost two months for its premiere and was a waste of my time. I had not read the book or adaptation, but you should not have to, the film should stand on its own. The sceneries were beautiful, that was the only positive thing. I would not recommend it."
    },
    {
      "rating": "6",
      "text": "الفلم هو إعادة إنتاج لفلم كلاسيكي قديم بنفس الاسم صدر بتاريخ 1940 (كان فائز بإحدى جوائز الأوسكار) والاثنين بناء عن رواية صدرت بتاريخ 1938 بنفس الاسم أيضا. الفلم رومانسي وغامض، تدور أحداثه عن زوجة فقيرة وجديدة تنتقل للعيش مع زوجها الغني في قصره ولكن ترى نفسها مترهبة من الوجود الطيفي لزوجته الأولى (المتوفية). تصوير الفلم وإنتاجه كان جميل بالإضافة إلى وجود مقاطع رائعة ما بين الشخصيات الرئيسية ولكن أحداث الفلم كانت بطيئة. شخصيا أشوف إن ترابط الأحداث بالنهاية كان غير كافي وكنت متوقع أن المخرج يضيف أمور أخرى ولكن للأسف ما شفت هالشي. الكثير من الأشخاص اللي شافوا الفلم الأصلي (1940) ما امتدحوا هذا الفلم ولكن أنا اشوف أن الفلم كان بشكل عام جيد.Visit My Instagram @Vanished_Critic"
    }
  ]
}