{"id": 50, "title": "Red Notice", "starring": ["Dwayne Johnson", "Ryan Reynolds"], "runtime": 118, "genre": ["Action", "Comedy", "Crime", "Thriller"], "description": "An Interpol-issued Red Notice is a global alert to hunt and capture the world's most wanted. But when a daring heist brings together the FBI's top profiler and two rival criminals, there's no telling what will happen.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/lAXONuqg41NwUMuzMiFvicDET9Y.jpg", "categories": {"plot": 5.296296296296297, "acting": 5.1875, "ending": 5.947368421052632, "soundtrack": 5.0, "cinematography": 4.5, "familyFriendly": 6.0, "funny": 6.25, "action": 5.6}, "reviews": [{"rating": "0", "text": "ryan reynolds go away challenge. and dwayne too. my god hollywood is this close to self destructing in real time and if it does life will be fantastic"}, {"rating": "4", "text": "A $200 million budget, 3 world famous actors, and yet Universal Pictures understood they had a flop on their hands.Of course Netflix saw the opportunity, and maybe it will pay off in the long run, but Red Notice is a waste of talent and entertainment.Its predictability is offensive, and the whole ordeal is basically a script that tries to pull different elements from other action films in an attempt to keep the story afloat despite the fact that none of the main characters have anything interesting to say, let alone anything interesting to do.Red Notice is a film in search of a good idea and a better execution. It never finds either."}, {"rating": "7", "text": "Quick comedic lines, fine chemistry, and a nice sense of adventure leads to mindless fun. This film deserves a strong 6 to a light 7."}, {"rating": "0", "text": "Boring, banal, overwrought, cliche, cringe. Take away the big names and you have absolutely nothing else."}, {"rating": "2", "text": "Completely unbelievable. Zero stakes to viewers, the main cast aren't even stealing these eggs for the money, just for fun. so bad"}, {"rating": "5", "text": "Red Notice is exactly how it looks; an action-packed, globetrotting adventure filled with witty banter and jokes. It's a mix of all of these stars existing franchises, with a little added Raiders and Mission Impossible. Unfortunately, the charisma of these stars can't save the weak script, and there just isn't enough here to separate itself in its genre."}, {"rating": "7", "text": "Not ground breaking but a fun film. Worth a watch of you already have Netflix. Lots a funny jokes and laughs on offer if you just want a chill film."}, {"rating": "6", "text": "The movie is not so bad, some good jokes and a bit of \"entrapment\" feeling. Nothing special but funny I guess."}, {"rating": "6", "text": "Red Notice is enjoyable enough despite its many faults. If you're willing to overlook a consistent lack of logic, give it a go! It works well as a family movie night flick - just don't jump in expecting a well-crafted thriller that'll leave you in awe. Unexpectedly, the majority of the film's success hails from its cast, which stars popular actors and internet icons such as Dwayne Johnson (\"The Rock\"), Gal Gadot (well known for her role as Woman Woman), and Ryan Reynolds (it's Ryan Reynolds). Their chemistry works quite well, and the banter is quite entertaining. However, the script is - at best - subpar. The action scenes are decent, but the film's twists lack explanation and often left me with more questions than answers.In summary: Red Notice is a fun and humorous movie with a great cast, but it lacks real substance. Give it a shot - just don't expect all that much. 6.5/10"}, {"rating": "7", "text": "FBI agent John Hartley is assigned to assist Interpol in investigating the potential theft of one of Cleopatra’s bejewelled eggs from a museum in Rome. Spotting international art thief Nolan Booth in the crowd, he gives chase and the two become entangled in a complex international conspiracy.Red Notice doesn’t make a whole lot of sense, and as is always the case with the heist movies, there is no way for the characters know their plans will play out. Thanks in large part to the charming lead trio of Johnson, Reynolds and Galdot however, it still offers a couple of hours of humorous and action packed entertainment."}, {"rating": "7", "text": "A decent comedy adventure. The leads, particularly Ryan and Dwayne, have a good chemistry, though Gal Gadot is a bit of a Mary Sue. The twist towards the end of the film is genuinely surprising. Lots of exotic locations, action, suspense scenes throughout - much like a comedy Indiana Jones film. You can do a lot worse than watching this."}, {"rating": "3", "text": "This is the epitome of generic action/heist movie. I am beyond tired of recycled garbage that has the depth of a kiddie pool. Every scene has some immersion breaking BS, CGI, or prop. All it has going for it is good actors. That is it."}, {"rating": "5", "text": "Not surprising after directing Dwayne Johnson in buddy action comedy Central Intelligence and the more action oriented Die Hard do-over Skyscraper, Rawson Marshall Thurber (Dodgeball and We're The Millers seem sooo long ago), would make Red Notice. An action buddy heist comedy that you'd find in the \"you might like\" section of Blockbuster back in 1998, with a title sounding like a rejected USA network series. Characters welcome, yup. Dwayne Johnson plays the stoic \"I'm serious dammit\" cop. Ryan Reynolds plays Ryan Reynolds Guy, his on screen quipping avatar. Gal Godot plays the Catherine Zeta Jones role if this was made in '98. And if I see one more special effect shot of two characters crashing through a window, with the camera following them to the roof below...that felt old ten years ago...Tastes like coffee made with five filters. There's some coffee flavor, but a lot of dilution."}, {"rating": "5", "text": "On paper this movie was a blast; I was looking forward to seeing Ryan Reynolds, Dwayne Johnson and Gale Gaddot, all of whom I enjoy as people as well as actors, together in an international heist movie. But the movie just doesn't work. It's tedious and, despite the many MANY action sequences, dare I say boring? No chemistry between Ryan and Dwayne, nor Dwayne and Gale. The story is completely unbelievable and feels like it was written by two drunk teenagers. Plot twist, Russian Goulag, Plot twits, Nazi treasure, plot twist, plot twist, plot twist! Maybe if I had been slightly drunk myself it would have been better. Watching it completely sober, it was a sobering experience. Too bad, I had such high hopes.."}, {"rating": "5", "text": "The great production quality and kinetic pace cannot distract you from the weak screenplay and green screen effects heavy heist-a-thon that is red notice. Everything felt soulless as if everyone was there to cash in their paycheck. In such an oversaturated genre I found there was little original material to titillate. Snarky lines from Reynolds, brow heavy face acting from Johnson and just the presence ofgadot was enough to make it to the end."}, {"rating": "4", "text": "Johnson and Reynolds doing Johnson and ReynoldsA switch off your brain 2 hour zone out with some legit laughs here and there but nothing you haven't seen from these two before.There's someone else famous in the movie, but she isn't there for her acting ability so must be something for the fellas to look at because the ladies get The Rock and Deadpool.Go in with rock bottom expectations and you'll enjoy it"}, {"rating": "7", "text": "On the downside, the CGI sucks, and the plot is predictable.  However, it's a fun ride with no need to think.  Ryan Reynolds is always enjoyable to watch, as is Johnson.  Just sit back, relax, and let your mind go free."}, {"rating": "6", "text": "This felt very cliche movie. I mean it was nice but it so much overused plot points from previous movies. I mean it felt them just putting all cliches in there as possible and movie coming out as a bit too cheesy."}, {"rating": "4", "text": "Red Notice is a mediocre movie. In addition to the cast, the film does not stand out, and only Ryan Reynolds stands out from the actors. Typical scenario, typical location. The whole film is just a set of scenes that the viewer has seen more than once in dozens of films. Red Notice is a movie trailer, everything interesting from the film has already been shown in the trailer on Netflix or Youtube. I can not advise anyone such a film."}, {"rating": "7", "text": "A solid movie that doesn't bring anything new to the table but still is enjoyable all the way through. Some things didn't make sense, but the movie still flows nice which makes you forgive all the unlogical things that happen. Happy for no leftist propaganda. The trio did well and some jokes were actually funny , which i didn't think will happen before watching this movie lol."}, {"rating": "7", "text": "Не плохой приключенческий фильм! Мне понравился! На 7 из 10 баллов. Дуэт получился хорошим!"}, {"rating": "7", "text": "Red Notice. Problems of married life. Funny and sometimes dynamic typical action movie with the brutal Dwayne Johnson, the film's main comedian Ryan Reynolds and the dangerous Gal Gadot. I didn’t get much emotion from watching it, but as a film for one evening, it’s not bad."}, {"rating": "6", "text": "Fun but very predictable.  Surprise ending however. The acting was good but the story seemed to be borrowed from too many other recent films. Still, a fun stay at home evening film."}, {"rating": "4", "text": "It's a pretty cartoon where some very famous actors were asked to make some sounds with their mouths and the camerawork is awesome. If you don't mind only 90's cliches instead of plot and don't turn your brain on for even a moment, fun 90 minutes spent on Netflix. I made it as far as the flawlessly preserved Nazi car with full tires and unspoilt gasoline and everything. I even laughed once, at the Jurassic Park joke, but that was instantly ruined by a character getting T-boned by a raging bull and he just dusts it off, as if someone just threw an apple at him or something."}, {"rating": "4", "text": "(Mauro Lanari)Whistling the tune of \"Indiana Jones\" (https://youtu.be/IgncJgSbbck) is not a tribute but an act of self-harm, self-sabotage, an own goal, since it induces comparison with the original and does not hold anything, like the first scene of the scaffolding skillfully dismantled piece by piece, but with that now usual excess of frenzy that prohibits you from identifying with some character and therefore sharing their events. Forgettable instantly, it differs from the Spielberghian quadrilogy also for the fact that it started from famous myths and legends, object of study and research, and it could stimulate a deepening of the Third Reich's interest in esotericism. Here, instead, we drag ourselves to watch the next idiocy of the Netflix catalog."}, {"rating": "7", "text": "The usual movie with the trio being amazing.the story was 1000th time used and the twists were literally that predictable that ryan sarcastically says to rock \"u didn't see that coming\". the plot of stealing eggs and the addition of nazis thing at the end with the whole indiana jones thing at end it was decent although the cat and mouse thing between the trio was entertaining.rather then story the scenes were engaging to watch the starting fight of duo and then the whole prison scene with the ryan's backstory at jail it was hilarious and the museum fight scene and finally the whole ending with the treasure thing and chase it was fun although the twist at end and the kiss between rock and gal literally felt like ryan's reaction and ended with chessy closing shot of trio walking, the whole movie with the comedy of ryan and rock being rock just like other movies and gal's charm it was a decntly entertaining movie!"}, {"rating": "4", "text": "Not a bad, not a good film. The film meanders along for the most part, and it's a struggle not to see that the film is pretty much the epitome of commercial cinema. It's hard to be either excited or enraged at it, because that would be a waste of time and effort.For the most part the acting is good, although Reynold's shtick is starting to feel old, I suppose he's found his niche and he's sticking to it. I don't really feel much chemistry between the three main stars, which is a shame since the vast majority of the film is framed around the clashing personalities of Reynold's and Johnson's characters.The film ambitiously sets up for a sequel which is par for the course these days. will it get it? Probably. Will it be worth watching? Maybe stick it on in the background while your doing some stuff around the house. If it's anything like this, it can only improve the viewing experience."}, {"rating": "5", "text": "A boring move  with lot of cliche got some good moments . A nice move to watch if there is something else in Netflix!"}, {"rating": "3", "text": "This can basically be summed up with  words. The Rock is big muscular masculine tough man. Reynolds is funny guy with irony and sarcasm. Gal Gadot is sexy.There. I **** said it.Other than that, they keep trying to shoehorn in a Reynolds-Rock buddy cop scenario. They work well off of each other, but the problem is how their relationship keeps flopping between \"We like each other and I have your back in a fight.\" and **** you imma leave you behind.\" The writing is also just bland and forgettable, with none of the big set pieces or unique scenarios to make up for it. And to top it off, contrived writing. Am I supposed to believe that point blank shots at tied up people would conveniently miss them and hit the locks tying them down instead? As well as security guards for international agencies slipping and knocking themselves out? I can excuse **** like rockets flying through helicopters, because that's an insane action sequence and big set piece. But **** that manifests for the plot is unforgivable. Take away the three big names and you have basically nothing. You can't make funny guy and strong guy the only appeal of your movie"}, {"rating": "6", "text": "Netflixowy Indiana Jones/Uncharted z masą klisz, stereotypów i akcji dla samej akcji. Kolejny prosty akcyjniak ze znanymi aktorami grającymi po prostu dobrze znane nam archetypy swoich postaci. Nie widać tego ogromnego budżetu, wręcz przeciwnie - wygląda dość tanio, jakby to była parodia filmów o poszukiwaczach skarbów. No i jeszcze te nieszczęsne zwroty fabularne (szczególnie ten na końcu), które nie mają żadnego sensu i są po prostu tylko po to, żeby ,,zszokować\" widza. Jeśli powstanie kontynuacja to mam nadzieję, że Netflix naprawi wszystkie te błędy, bo jakiś tam potencjał jest na ciekawe kino przygodowo-akcyjne ze skarbami w tle."}, {"rating": "4", "text": "Disappointing in many respects. Story was confusing. Acting was confusing. The story was convoluted and contrived. Most unsatisfying."}, {"rating": "5", "text": "The most expensive part of this film were the salaries. Everything else about this film is just \"fine\". Some action scenes are well-shot, but countered by the abundance of CGI backgrounds. All actors are just playing their usual selves, but at least their entertaining to watch.I don't get why Netflix is so unambitious with its movie content."}, {"rating": "5", "text": "Red Notice (2021) is the latest outing from Netflix and is a comedy, action, heist, adventure blend which is about an FBI agent trying to bring down the world's greatest thief with the help of the second greatest after things go screwy apprehending the latter. Starring Ryan Reynolds, Dwayne Johnson and Gal Gadot, I got excited and gave it a watch. Sadly, it turned out to be a very middling experience. One would expect that there would be a great deal of charisma, enthusiasm and quality back-and-forth banter with the Actors (particularly the male duo) the movie has at its disposal but one would be wrong. It's not that there isn't any but what you get for the most part and for a lack of a better word, is pure MEH. It's not terrible, you can stomach it but there is nothing special here. Ryan Reynolds felt like he was doing most of the heavy work by being his usual self with some of the Deadpool persona bleeding in improvising in a not-so-good script still being my favourite part of the movie, whereas the Rock was oddly enough living up to his name, by being a rock, and for whatever reason, he or the director decided this would be the movie for it, against Deadpool... It's good to live up to your name but you still gotta choose an appropriate time and this was not it. Gal Gadot, while being gorgeous and someone who looked like she was having fun, also came with a heft dose of cringe in some of her scenes. Couple that with the goofy nature of the movie which, in a better-written film with interesting comradery between the characters could have been highly entertaining, with a plot that is easily forgettable with the propensity for \"twists\" without the wit to carry whatever level of self-awareness that movies try to present leaves you with a mishmash of elements taken from much better films where neither the sum of its parts nor the whole is as entertaining as it should have been. Again, it's MEH. Also, with a reported $200 Million budget, it has some pretty shoddy visuals at times while having some cool shots and sets otherwise. This is a repeated trend I've seen in big-budget movies lately where they'll have massive budgets but you don't see that reflected in the visuals/production properly. And if DUNE can look wonderful with a relatively lower budget, these other movies have no excuse with the level of CGI they end up using. Anyway, I was hoping for a lot more fun than I ended up experiencing. You get a massive sequel bait at the end and there are two more entries greenlit by Netflix, so we'll get more of this Trio. Not excited but who knows, they might end up being better. This is an average experience at best which I can't really recommend unless you have nothing else to watch and just want something to pass the time. And if I were to rate it, I'd give it a 5/10."}, {"rating": "6", "text": "The cast carry it through. The story starts promisingly however as they try to introduce more twists and turns (think oceans) its starts to lose its way for me"}, {"rating": "5", "text": "बकवास फ़िल्म । बिना सिर पैर का  । प्लाट एक दम घटिया ।"}, {"rating": "1", "text": "Waste of time, predictable plot and the entire movie was filmed in a green screen"}, {"rating": "4", "text": "Being heavily generous to this OK action popcorn flick but the chemistry and presence of the main cast helps keep this sub-par movie alive. Has a good/unseen twist at the end to its credit. Would watch a sequel but only out of curiosity, not real interest. Overall? Meh"}, {"rating": "7", "text": "Highly entertaining, with a lot of twists and turns. Yeah it features the Rock and Reynolds. So do not expect deep material. It is a good movie after a hard day of work. Nothing more, nothing less."}, {"rating": "7", "text": "I found myself enjoying it a lot. It is funny, has a great cast and kinda plays with the classic heist movie themes. It is however a silly movie that doesn't take itself serious, which can be a problem for many people. It also tries to mix to much stuff together e.g. a healthy dose of Indiana Jones into an already crowded movie. I'm a bit torn about Gal Gadots part, she has some serious Mary Sue vibes, but it kinda works. Enjoy it with a few beers, I'm actually looking forward to a sequel!"}, {"rating": "5", "text": "I did not expect such nonsense from these actors.  time is money ............."}, {"rating": "6", "text": "Yeah this movie isn't great. It is pretty generic, and cheesy, but the movie is still fun to watch. I mean the plot twist at the end was a little bit predictable, but still it is not the type of plot twist I would expect from this type of movie. The movie isn't horrible, but still alright."}, {"rating": "4", "text": "тысяча роялей в кутах и глупых ходов. 4 балла толлько за актеров"}, {"rating": "5", "text": "Good actors and minimal fun scences. Nothing else is there in this horrible movie which once again proves that packing a bunch of Hollywood's biggest names isn't going to make Hollywood's biggest film."}, {"rating": "4", "text": "The most mediocre film I've ever watched. It's like vanilla ice cream but even vanilla vanilla is better than this. And oh btw the ending kinda makes the film look like a long interrogation scene. In that Nazi bunker when the Bishop teamed up with the guys i was like, oh so she's part of the team now? Then you see the kiss and just go wtf like Ryan Reynolds. It's not even a good twist. There was no build up or anything the movie just goes like, hey soo umm all the things you watched, they weren't real, yeah yeah we've been messing with you. It's like you watch stuff happen in one universe then from that point in Argentina you are now watching some other universe. It's like the tears in bioshock. You go through a tear and it's like a new story, new place except this movie just changes everything we saw and dumps everything in garbage."}, {"rating": "6", "text": "tbh I liked the movie. There was a good amount of comedy and a twist at the end. The chemistry between Ryan and rock was good but yes it too had its flaws too. I would give it 6/10"}, {"rating": "2", "text": "This was like reluctantly ordering a McDonald's burger only to find there's no patty in it, no sauce, and is basically just a plain, dry, tasteless bun."}, {"rating": "2", "text": "Why why why why whyWhy why why why whyWhy why why why whyWhy why why why whyWhy why why why why"}, {"rating": "8", "text": "Do not believe the critics. While not a masterpiece, it was very enjoyable. All there characters are fun to watch, Ryan and Dwayne have a really nice chemistry and the humor was pretty good.All in all you will be entertained for two hours as long as you take it as a comedy and do not try to overthink everything."}, {"rating": "7", "text": "One of the better movies in the action comedy genre to come out in years, and far better than the typical low standard Netflix original movie - I was not surprised to learn that it was made by major studios and later acquired by Netflix. Not generally a big fan of Ryan Reynolds, but he was genuinely funny and carried the movie, along with The Rock doing a great job as the butt of most of the jokes. Gadot clearly had fun with this role and they wisely didn't overuse her; she doesn't have the chops to carry movies on her own. Most of the jokes landed and there was a veteran professionalism in the screenwriting that was refreshing, in an era where so many movies feel like amateur hour."}, {"rating": "7", "text": "Fun movie with great actors. Even the big plot twist was a surprise for me. But there was one big let down; the sets/surroundings were so fake it really broke the immersion. It felt like the budget was entirely spent on the cast. Hope this will be better if there ever will be a second part."}], "recommendations": ["baywatch", "contraband", "lockout", "baby_driver", "knight_and_day", "rocknrolla", "kingsman_the_golden_circle", "bloodshot", "skyscraper", "keeping_up_with_the_joneses", "the_expendables_3", "wild_card", "shazam_fury_of_the_gods", "san_andreas", "the_meg", "the_losers", "the_spy_who_dumped_me", "this_means_war", "the_marine", "escape_plan", "hancock", "venom_let_there_be_carnage", "hercules", "american_ultra", "6_underground"]}