{
  "id": 1013,
  "title": "Red Dawn",
  "starring": [
    "Chris Hemsworth",
    "Josh Peck"
  ],
  "runtime": 93,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "A city in Washington state awakens to the surreal sight of foreign paratroopers dropping from the sky—shockingly, the U.S. has been invaded and their hometown is the initial target. Quickly and without warning, the citizens find themselves prisoners and their town under enemy occupation. Determined to fight back, a group of young patriots seek refuge in the surrounding woods, training and reorganizing themselves into a guerrilla group of fighters.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aHdxKDX36NOEYE2NyAyP7ThuAcm.jpg",
  "categories": {
    "plot": 4.518518518518518,
    "acting": 5.24,
    "ending": 3.4,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.727272727272727,
    "funny": 8.0,
    "action": 4.303030303030303
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I love the original Patrick Swayze version of Red Dawn, it was one of the best 80's movies that we certainly don't have time for a reboot. The new version starring a Hunger Games star and an Avengers star is pretty much says it. After a long period of delays since MGM (the movie's former company) headed for turbulance. And even bankruptcy, they should've released it when Sony acquired the rights to the troubled studio. Red Dawn is nearly half as bad as the floppy reboot Total Recall, so I thought it was gonna be called \"Crap Dawn\" or \"Turkey Dawn.\" Jennifer Grey (the original Dirty Dancer) could send a message to the late Patrick Swayze that the director who is responsible for the remake is making a fool out of himself making a stupid idea to remake Red Dawn. I already got the movie on VHS, sadly I retired the tape and wait for the Blu-Ray release. Reboots are nothing more than con artists and so does the Red Dawn reboot. A terrible, indulgent, and as Joe Biden said in the Democratic debate that I've never heard that \"Malarkey\" word, but it's incredible."
    },
    {
      "rating": "0",
      "text": "North Korea attacks The U.S. A.  This is the point where you should stop considering watching this teen fantasy movie! Some untrained kids from the local town later form a resistance group, and fight back the highly trained and fanaticized N.K. soldiers! Honestly I can not say how dumb that is..."
    },
    {
      "rating": "1",
      "text": "Worst movie I have seen. Bad acting, bad plot, bad directing, and so on. Please do not waste your hard earned money or your precious time on this garbage. It's BAD!"
    },
    {
      "rating": "4",
      "text": "I don't know why Chris Hemsworth always ends up in bad movies, but this is another one. Way too much teen/young adult angst, cliches, and hollow characters. Honestly, most of the people in here I couldn't have cared less about, nor do I remember them a day later. The story doesn't make any sense either, because by the end of the movie I still couldn't figure out why the hell there was an invasion in the first place, nor why an army which could defeat the US military couldn't kill a couple kids... Thankfully the action scenes are tolerably good, but overall there's too little fighting and way too much whining."
    },
    {
      "rating": "3",
      "text": "Another pointless remake that should have never been made.  The 1984 version has a story that's compelling because you have kids that are put through the worst circumstances, that ends up bringing two brothers together. In this one all the kids look like they just got out of the shower while just being in a bloody battle and you just don't care about the brothers relationship at all."
    },
    {
      "rating": "4",
      "text": "A solid movie that could have been so much better. The characters are not particularly interesting and it did not have as epic of a feel as it could have."
    },
    {
      "rating": "3",
      "text": "Oh yikes, is this one bad. Red Dawn is a useless reboot that banks solely on nostalgia. While the action sequences are well crafted, the story makes some very poor choices with its characters, and the ending is a slap in the face. It might be a good \"Bad Movie Night\" selection for you and your friends solely based on how ridiculously stupid so much of the dialogue and directing is."
    },
    {
      "rating": "0",
      "text": "Absolutely disgusting. Nothing short of a pathetic excuse of a remake that does not live up to it's original. Patrick Swayze would roll in his grave if he knew how much of a disgrace this movie was. The plot makes very little sense, and is overly patriotic. It is almost like they gathered inspiration from the awful video game Homefront. Do not waste your money."
    },
    {
      "rating": "4",
      "text": "This remake of the 1984 film has shifted the villains from Russia to North Korea. (It was shot several years ago with Chinese villains, but times have changed and so did the flags and uniforms in post production.). Pre-Thor Chris Hensworth and pre-Hunger Games Josh Hutcherson lead the cast of young people who take on the hostile foreign invaders. Their pluck and guerilla tactics are amazingly slick and successful for such an untrained group, but there's not much about this film that's realistic. Some of the action is good, but much of it is blurred and choppy"
    },
    {
      "rating": "2",
      "text": "\"Oh how the mighty have fallen.\" That is a phrase that you will repeat quite a bit if you've watched the original Red Dawn and maybe even played the video game Homefront before watching this. The movie is a gigantic rush job, which is a shame, as I'm pretty sure the original writer seems to have made the trio of American invasion movies/game, as the style is distinctly that of the original. The only problem? The execution. While the style it is done in has little differences, the script is a mess, spending no time developing female characters and constantly juggling ridiculous dialogue with a horrid plot, Much like Homefront, the original villain seemed to have been the Chinese. However, it seems to have been changed at the last second to avoid controversy. The writing is also a mess, and the action is like that of having a string puppet show involving a cowboy and a waving inflatable-arm tubeman duking it out. Do not watch this mess of a movie, and avoid it at all costs."
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "0",
      "text": "It's a little hard to get drawn into a movie when the main villain is a country that can barely has enough of anything in their own fridge, let alone invade another country."
    },
    {
      "rating": "4",
      "text": "Makes audiences nostalgic"
    },
    {
      "rating": "7",
      "text": "\"As a huge fan of the original, If you can put aside all the cheesy, corny acting of our leads, chances are your going to like this new take on the classic film. Its intense, exciting and builds up huge momentum on its original. I know i'm a wolverine.\"  B+"
    },
    {
      "rating": "6",
      "text": "Though it's not as bad as the critics make it out to be, there's no question Red Dawn is a silly, over-the-top, wannabe-bad ass sort of film. But despite all that, it's actually kind of fun."
    },
    {
      "rating": "3",
      "text": "Completely preposterous. There is a scene in the middle of the film where they run into a friendly and they tell him who they are. His response \"I was afraid of that\",  My response \"I couldn't agree more\".  I just could not believe I was sitting through this weird mess of a film. The only reason it is still in theaters is because there is nothing else to take its place. Why sit through this when there is a perfectly decent version of this movie from the early 80's to watch sitting in the discount bin at your grocery store. That one starring that chain smoking sex symbol Swazee back before he died choking on his own regurgitated tobacco tar."
    },
    {
      "rating": "0",
      "text": "Wow!  I can't believe someone actually likes this movie.  We are all unique and different.  This was by far the worst movie i have ever seen.  Who ask them to remake this movie?  The script was equally bad as the acting."
    },
    {
      "rating": "7",
      "text": "I was surprised by this movie. I thought it was pretty entertaining. It isn't amazing, but it certainly isn't as bad as the critics make it out to be. I felt that this movie had lots of exciting action sequences that were both crazy with effects and very suspenseful. This is a touchy subject, but I felt that this movie was an exciting, inspiring movie."
    },
    {
      "rating": "7",
      "text": "Sorry critics. I try to see what people are finding so bad about this film, but there is too many things I like here that should be highlighted. For one thing, this movie pays much more respect the the \"man in uniform\" than \"Act of Valor\" ever attempted to have. The action is awesome, and we have reasons to care for the characters here. Unlike \"Battleship\", this movie develops all of its characters. No, I have never seen the original \"Red Dawn\", and i'm not gonna let that affect my review. This movie stands alone as something entirely different. The point is, I recommend it. I feel that it is very underrated."
    },
    {
      "rating": "6",
      "text": "It's certainly not as bad as the pro critics would suggest.  As a tribute to the first film, it's decent, but it lacks the charm of the original.  Hemsworth is not nearly as magnetic as Swayze. But it's a dumb fun action flick that keeps the blood pumping, so I'd give is a modest recommendation to those who are into this sort of thing."
    },
    {
      "rating": "0",
      "text": "Aside from the fact that Hollywood caved to Chinese pressure, and altered the antagonists from China to North Korea - Ironic in the extreme because this movie is about Americans standing up to communists - this movie is pure garbage. How the hell would North Korea invade America? With what Navy? This is just simple tripe and typical of the crap Hollywood produces."
    },
    {
      "rating": "6",
      "text": "Enjoyable action film. Didn't have close to the storyline of the original, but enjoyable to watch. If you are looking for a remake of the original, this is not it. If you are looking for an action flick, have at it."
    },
    {
      "rating": "0",
      "text": "what the hell i just watched this is terrible as Dark knight rises and Amazing spider man 3.  For heaven shake people should not made this sort of war porn movies."
    },
    {
      "rating": "9",
      "text": "ReviewZone212 put it best, most people says this movie sucks. Well those people can suck it, this movie was AWESOME. Great action, great cast and for the most part of it funny and intriguing dialogue, my only gripe was that there wasn't really a great portrayal of a plot."
    },
    {
      "rating": "7",
      "text": "I still have a difficult time believing that people listen to critics. I have an even harder time believing they get paid for what they do. This was a good action movie. It's as if they were expecting a thriller. I was also looking through user reviews and had to laugh at the illiteracy of most of the negative scorers. Are children rating? I can't trust an individual's opinion if he/she seems incompetent. Anyways, dairy for the tangent. Good action movie. If you haven't seen it, just remember......ACTION MOVIE. NOT PHILOSOPHICAL."
    },
    {
      "rating": "3",
      "text": "The worst remake movies i seen  is The Stepfather (2009). and  Psycho (1998). Planet of the Apes (2001). The Wicker Man (2006).  Red Dawn (2012) , And wait for more bad remakes movies Carrie 2013 and . Robocop 2013."
    },
    {
      "rating": "8",
      "text": "I think this is yet another movie where the majority of the critics have gotten it wrong. Sure they could have dreamt up something a little more plausible than an invasion by paratroopers but the story wasn't so much about the hows or whys of war so much as to create a \"what if\" scenario. The characters were believable, the acting was pretty good, and the storyline was entertaining. There were some funny parts and some omg moments. Overall it was definitely worth seeing in the theater."
    },
    {
      "rating": "10",
      "text": "People say that this movie sucks, I really don't know why they say that, you watch a movie to have fun, this movie, Red dawn, combines everything that teens like to become an amazing movie, great characters, story and sfx, ill be watching this movie as one of my favorites, always."
    },
    {
      "rating": "7",
      "text": "This movie has a lot of action, and that's a good thing. So, they may have deviated from the original a bit, and that's fine. The acting is ok at best. Listen, I have watched BattleShip twice. I think the acting in that movie totally SUCKS. (Rihanna, acting, really?) The actors in this movie are far better. Go in thinking action movie, for about 2hrs, give or take, and you will be satisfied. Anything else, and you will probably be disappointed. i will recommend this movie on that condition."
    },
    {
      "rating": "8",
      "text": "I'ts just a movie! I don't know why some people try to compare a movie like this with some chance of happening in the real world. As far as I know, movies are made do entertain people, to make people get out of their boring routine."
    },
    {
      "rating": "8",
      "text": "Like \"War of the Worlds\", with aliens replaced by North Korea. This is a truly awesome movie with an original story, great action, and lots of twists and turns that make this movie impossible to turn off. Awesome, truly awesome."
    },
    {
      "rating": "5",
      "text": "Oh! This picture has failed to reach my upmost desires and expectation in a film of such topic. During the picture, i felt the desire to bash my skull into my adversaries while denouncing the queen herself! I declare this film treachery against England and her royalty. BAN THIS PICTURE AT ONCE! But...... Oh did i enjoy the appearance of \"Josh\". the lovely individual whom played Josh on Drake and Josh."
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "1",
      "text": "This is just a really boring movie. I wasn't going in expecting anything other than a bad movie, but even with that mindset this movie disappoints. Not even worth a rental. Absolute waste of time and money."
    },
    {
      "rating": "9",
      "text": "So the only reason I went to this particular movie was because it lined up with another movie we where  going to watch and we had to watch 2 movies back to back because the tickets we had expired that day and my wife and i had an engagement with friends in the evening. I was not particularly enthused to see Red Dawn because of the horrendous score it got from almost every single critic. I knew they hated the acting and the plausibility of the story so in particular I payed close attention to both. As far as the acting goes it was very good, Hemsworth does well of course but his supporting cast also did well. The acting brought me into the movie instead of taking me out. The story was interesting and even somewhat plausible, it definitely wasn't so bad it made the movie ridiculous. I mean it is a fiction \"what if\" movie but I could see it play out if there was an invasion. I'm not sure to what success but still this is only a movie after all. One particular critic mocked a scene were a girl fires a rocket launcher, I have fired rocket launchers in real life when in the military and i fired it next to girls also firing rocket launchers so I'm not sure what was so unbelievable there. All in all the movie was a great time with an engaging story that made me and my wife glad we went to see it. As far as it stacking up to the original, I cant remember the original very well at all so i really have no idea."
    },
    {
      "rating": "6",
      "text": "I am a fan of the original and this one was just fine...worth seeing (probably more of a Redbox than a $12 movie ticket), but good fun, different enough from the original but close enough to \"honor\" it."
    },
    {
      "rating": "4",
      "text": "Let me get this straight, Red Dawn is somewhat a fun movie. Despite that its boring direction and screenplay, the old version was defiantly better but tired directors that just want business made this film. Red Dawn is one of those films that makes the audiences bored and nostalgic. Some scenes were worthy to be in a Hollywood movie but this is one of the stink piles Hollywood makes, But Overall it's a fun movie."
    },
    {
      "rating": "6",
      "text": "It's mildly entertaining and highly unrealistic. I've never seen the original so I can't compare it to this remake. I can say that it can be entertaining at times but overall the odd casting choices and emotional moments that fall short bring the experience down. Still it can be worth a watch just for the decent yet unrealistic action sequences that are packed with explosions. The cast does a good job but the only character that feels like they belong in a movie like this is Chris Hemsworth. Seeing Josh Peck and Hutcherson take down numerous Korean soldiers better than a squad of fully trained marines is more than a little unbelievable. Still the movie is watchable, so if you have nothing better to do then there are worse things to watch in your free time."
    },
    {
      "rating": "3",
      "text": "O.k. so in this version of Red Dawn in lieu of an actual powerful, adversarial nation like during the Cold War the United States is instead invaded by a country with less then half the GDP of the poorest US State and roughly the population of Texas. This vast gulf in military power and funding is offset slightly by having China and Russia help out North Korea; which doesn't make much of a difference since the US Military has more equipment then the next 13 largest militaries...combined, and most of them are our allies. Of course they could get few actual Koreans to act in this movie, so the \"North Korean\" army looks more like the \"Peoples Republic of Greater Asia\", which in retrospect would have made a much more realistic storyline. Beyond the horrible plot that serves as a perfect example of the kind of paranoia that's driving our nation to bankruptcy spending untold billions on a gigantic military, the movie does do two things rather well. First, the comparison between the Wolverines and the insurgents fighting the US and the North Korean invasion force proclaiming that it wants to \"save\" America make the movie an excellent walk in \"the other sides\" shoes, essentially saying: \"this is what it feels like to Iraq, Afghanistan, etc.\" The second thing which it does well are explosions. They are done very well."
    },
    {
      "rating": "3",
      "text": "Remakes are all the style now as if Hollywood has run out of things to say so here is Red Dawn, a modern day remake of a 70s cold war paranoia picture. Back then the idea Russia could descend the world into darkness was very real and now its the same with North Korea, oh wait, no it isn't. The film follows a group of survivors of a full scale invasion of suburban America by the North Koreans (I am honestly not joking). This group must band together and start a campaign of guerrilla warfare to take back their neighborhood and their country. (yet again, I am not joking) I really should have hated Red Dawn more than I eventually did. Don't get me wrong, I still pretty much loathed it. The cast is filled with miscast actors or just plain dreadful ones but it also has a few pretty great ones. For instance Chris Hemsworth is the right kind of charming/brooding to play former soldier Jed although Josh Peck is just horrendous as his hot headed (which he plays as constipated) brother Matt. Adrianne Palicki seems to be making a thing of the whole action woman thing but has had to wait a good 2 years for her two action films to be released after being held back for years. However she entertains as tomboy Toni although Isabel Lucas irritates and infuriates as her sister Erica. A pre Hunger Games Josh Hutcherson is in the film but I honestly cannot say anything about him because his presence isn't memorable. The main problem is that there is a borderline decent film hidden beneath the bad acting and illogical story that was changed as not to irritate the Chinese (the Chinese that were never going to see the film in the first place) as if they hadn't heard of a story before. The main draw of Red Dawn is the fact it is directed by Dan Bradley, a stunt coordinator who understands what makes good action as he has proven in the Bourne films he has worked on. The action is never short of fantastic from the opening invasion to the final showdown in a taken over police station. Its visceral and honestly some of my favorite action in a while, its that good. It's shocking that a film with this caliber of effects and stunts is let down by an idiotic plot change late into production and some woefully bad acting."
    },
    {
      "rating": "10",
      "text": "Best movie ever. However North Korea is its own enemy by oppressing and enslaving its own people. I loved the action in this movie even though it is different from the original it is still awesome."
    },
    {
      "rating": "2",
      "text": "Shallow plot, shallow characters, shallow action and a horrible ending. They just took a hugeass dump on the original while creating one of the worst action flicks Ive seen in a long time. Hell, even Bourne Legacy was better than this pile of excrement. I felt sorry for the cast who had to put up with the cheap SFX, generic script and boring, uninspiring sequences that shouts below mediocrity. This should've been a made for TV movie from the start. Hell, had they retained the China vs U.S premise instead of this ridiculous North Korea vs U.S one it might've been a bit better. Because totally...the North Korean Army uses Hummers as part of their arsenal and are perfectly groomed like Korean pop stars. Avoid at all costs."
    },
    {
      "rating": "1",
      "text": "This movie was almost entirely unintelligible. It felt like watching a typical action movie on fast forward the entire time. Any form of realism or plot did not exist. There was so little time for any acting due to the immensely fast pace of the story that the fact that actors were even hired for the roles is a miracle. Even with a wealth of subject matter to draw from with the original story as a launching pad, this movie failed so dramatically that it should win awards to better encapsulate how poor of a job it did. The best moments were the opening credits It was all downhill from there."
    },
    {
      "rating": "7",
      "text": "I liked this movie, but it was a bit annoying how easy they take over everything. If you can get past all of that and not take the movie to serious it can be fun. I do think they should not have made it about some teens. It would be much better with Grown men. It`s not as bad as some people are saying it is, most people just seem to give a movie a 10 or 0 they know nothing in between."
    },
    {
      "rating": "2",
      "text": "Red Dawn has some good action scenes and some pretty actors thats where the good stops. Story telling is horrible, felt forced and predicable, Dialogue horrible feels like a standard Hollywood student script nothing special, Character Development sad(not in a good way) and horrible, seriously what made the old Red Dawn so good was the character development. You had time to get to know the people and feel what they feel and when they die its horrible but that's the point to involve the audience.  , Weapons and tactics horrible. I was looking so forward to this movie... Why did you have to mess up such a awesome genre. Could have made a classic, just another Hollywood B movie with lots of money pumped in it."
    },
    {
      "rating": "4",
      "text": "Horrible, just horrible. No word to describe how horrible this movie is."
    },
    {
      "rating": "3",
      "text": "Red Dawn is a remake of the 1984 film that starred Patrick Swayze, and sadly this remake is even more ridiculous than the original.  I have seen the original film a few times, and although it has its problems, it was a fun movie because of how silly it was.  This new version just isn't very fun and has nothing really special about it at all.  The characters are really unlikeable, the action is nothing we haven't seen before, and I honestly didn't care what was happening in the story the whole time.  When I walked in the theater I had an open mind, and I actually hoped that this would be a fun and silly action film.  Well sadly this movie really doesn't do anything fun or original to keep it interesting, and I walked out of the theater feeling like I had my money stolen from me.  What also disappointed me was that this movie actually has a good cast of actors too, and they just waste the talent they have.  I realized this was supposed to be a dumb and mindless action flick, but I at least wished I had some characters that were fun enough to cheer for.  I like brainless action films if they realize it"
    },
    {
      "rating": "5",
      "text": "Red Dawn is a passable action flick, the acting is alright but still mediocre, Red Dawn enjoyable at times but ultimately fails compared to it's past installment. Give it a rental if you're interested but if you're not there's nothing Red Dawn can do for you. Wolverines? More like Puppies...(Man I'm not proud of that)"
    },
    {
      "rating": "2",
      "text": "You can not believe what is thrown in your face, even if it is a film, where imagination has no limits, the idea sounds so shallow and misguided. You are not convinced at any time."
    },
    {
      "rating": "6",
      "text": "I was actually surprised with this movie. It has a lot of negative reviews so I expected it to really suck. I was actually  really surprised that I enjoyed this movie so much. No it's not anywhere close to movie of the year but it wasn't that bad. Granted,I didn't see the original and that may change my opinion."
    }
  ],
  "recommendations": [
    "indiana_jones_and_the_kingdom_of_the_crystal_skull",
    "the_mummy_tomb_of_the_dragon_emperor",
    "i_am_number_four",
    "battleship",
    "the_darkest_hour",
    "dark_phoenix",
    "poseidon",
    "national_treasure_book_of_secrets",
    "underworld_blood_wars",
    "riddick",
    "teenage_mutant_ninja_turtles",
    "the_tax_collector",
    "the_twilight_saga_eclipse",
    "jonah_hex",
    "terminator_genisys",
    "gods_of_egypt",
    "the_book_of_eli",
    "the_matrix_resurrections",
    "independence_day_resurgence",
    "hercules",
    "bright",
    "the_new_mutants",
    "shadow_in_the_cloud",
    "london_has_fallen",
    "doctor_strange_in_the_multiverse_of_madness"
  ]
}