{"id": 1368, "title": "RED 2", "starring": ["Bruce Willis", "John Malkovich"], "runtime": 116, "genre": ["Action", "Comedy", "Crime", "Thriller"], "description": "Retired C.I.A. agent Frank Moses reunites his unlikely team of elite operatives for a global quest to track down a missing portable nuclear device.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jW7bHZgkHKUtUJCsThFuqbZGVUL.jpg", "categories": {"plot": 6.463414634146342, "acting": 6.72972972972973, "ending": 5.833333333333333, "soundtrack": 7.0, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 6.596774193548387, "action": 7.294117647058823}, "reviews": [{"rating": "10", "text": "Simply put if you are a fan of the first movie and how excellent it was done, then you will enjoy the same formula again with Red 2, its a wonder again with my attempt to understand critic reviews, I wonder how many of them purchase the same bagel, cup of coffee or meal from their favorite establishment. A movie like Red 2 needs to keep with the same formula as the first because it worked another movie that comes to mind is Taken and Taken 2, same formula used with Taken 2 and just as entertaining. Red 2 gets the job done even with a few scenes of absurdity, but coolness blended in, the movie is entertaining. Go See it."}, {"rating": "3", "text": "‘Red 2’ is so boring I couldn't wait for it to end. First, it has no focus: there are three villains and the main one appears after the middle of the movie. Second, it lacks plausibility, e.g. the protagonists break into the Kremlin through the wall of a toilet or kill all the guards in the Iranian embassy of London without any police chasing them. Third, the jokes are pathetic (the worst is the interrogation scene) and slow the pacing. Fourth, the characters have lost their charm and coolness: Frank has become an inexperienced boyfriend, Marvin talks like a marriage counselor and Sarah is incredibly annoying as she tries to seem smart and useful all the time. The cast is wasted here, 'Red' was much better.\rargonautis.eu"}, {"rating": "9", "text": "What is wrong with you people? Can't you just go enjoy a movie? Are you averse to having a little silly fun with comedy that is smart, witty, and not filled with fart-jokes and stupidly drunk people?  Do you have to be so analytical that you can't enjoy the movie? This was a fun movie-I kept saying I felt guilty smiling as I walked out.  It was FUN. Will anyone win an Oscar? Probably not.  But I had fun.  I always think the fight and action scenes are over-done and too prolonged in most movies and at times this one had the same issue. I enjoyed the characters, their banter and interaction and had a couple hours of escape time watching this movie."}, {"rating": "7", "text": "If you didn’t see the first one (or don't remember), RED stands for \"retired, extremely dangerous.\" That applies to Bruce Willis and John Malkovich, who set out (with charming Mary-Louise Parker) to save the world from a special bomb. Along the way, they encounter Helen Mirren, Catherine Zeta-Jones & Anthony Hopkins. Watching this A-list cast fight and kill with efficient aplomb is the biggest draw. The action sequences are plentiful and entertaining, while the humor comes more from attitude than lines (and Malkovich's funny faces). This is an old-fashioned spy flick. It's not as good as the original or ground-breaking, but it's still plenty of fun."}, {"rating": "10", "text": "Excellent movie!  It follows the same characters into their next adventure keeping the cool wit and exciting action sequences intact. This is what other movie sequels wish they could be.  If you like the first one, you will not be disappointed with Red 2."}, {"rating": "9", "text": "Same type of movie as the first RED  if you were entertained by that movie you will be entertained by this one.  If you couldn't stand the first one, of course you won't like this one either.\r The action sequences are pretty over-the-top (it is a comic book movie), a little intrigue to keep things interesting and a lot of zingy, funny dialog to keep the characters rolling along."}, {"rating": "10", "text": "Red2 was a great sequel. The Red cast-Os were true to form. Every action scene is on point! The comedy was hilarious and no creativity was spared. This movie is a Red Lovers Fix."}, {"rating": "9", "text": "I really enjoyed the first film and was excited for the sequel--and it lived up to my expectations.  The movie takes the working formula from the last one and expands on it but doesn't try to reinvent it.  The core returning cast is still charming and have great chemistry together and the new players jump into the mix without any complications.  The humor is great, the action is exciting and the film is just pure fun!"}, {"rating": "7", "text": "Full of action, and has a lot of comedic tones to it, mostly by John Malkovich's role as the crazed Marvin. The love triangle within this movie really adds to the fun. It's hard to imagine oscar winning people in these roles, but they continue to surprise us."}, {"rating": "6", "text": "Red 2 is fairly entertaining, has some fine characters, also some funny moments. The best thing in it  is of course Anthony Hopkins  probably the best actor of recent time. Main plot isn't very good, action par is ok, overall it's slightly above average!"}, {"rating": "7", "text": "It's in no way as good as the original, but Red 2 has a little more fun with its characters and the plot, since no introductions need to be made in the world of Frank Moses!"}, {"rating": "3", "text": "The plot of Red 2 is surprisingly convoluted, but plot here is about as important as it was in Grown Ups 2. The real idea is that there are worse things you can do than spend time in the presence of such luminaries as Malkovich, Helen Mirren, Anthony Hopkins, David Thewlis, and Brian Cox, as they goof around with this sort of material. The first Red had the same basic idea, too. But it also had a jaunty energy and some surprising visual flair, probably courtesy of director Robert Schwentke, an underrated stylist. Now with comedy veteran Dean Parisot (Galaxy Quest, Fun with Dick and Jane) at the helm, the new one is more about the jokes. It’s funnier than its predecessor, but also less human. Willis and Parker, who had some decent chemistry in the earlier film, are blander this time around. The script doesn’t give them much to do with one another besides bicker; otherwise, they seem to just be along for the ride. But there are some nice touches, too. As before, Malkovich makes for excellent comic relief, and there’s a mildly adorable ongoing romance between Mirren’s British assassin and Brian Cox’s ex-Russian secret agent. (Also, Dame Helen looks awfully fetching in camouflage.) But no movie with this much ass-kicking should feel so lifeless. Nothing in Red 2 is actively offensive, but for the most part, it’s hard to really care for anything that’s happening to these characters. The compositions are so drab that when the onscreen transitions come  in which the action freezes into a comic-book frame and then swishes toward whatever foreign destination our characters are headed next   the movie seems to be commenting on its own visual flatness. Oh, who am I kidding? Why even try? Old people! Guns! Chuk-chuk!"}, {"rating": "0", "text": "Lazy, stupid, boring, and unfunny. What is going on with the state of movies these days? Have we forgotten everything about how to make a decent movie?  I'm thinking this must be made for very stupid children.\rHow about adding some suspense, by not mixing the emotional tone of the movie every damn 2 minutes. Funny, serious, funny, serious, funny, serious, angry, funny and so on. If you mix this with the totally unbelievable conversations, that sound sooo rehearsed, you have a freakin recipe for disaster."}, {"rating": "1", "text": "Must agree with all the other critics here, such a waste of A-list talent and just  throw  plausability  out the window, all your main characters are unkillable while everyone else falls like paper cutouts. As for the actors, all should be ashamed of how they compromised action-drama for their feeble attempts at comedy. All this is the director's fault, of course; this is the same guy that directed \"Galaxy Quest\" where the comedy did work because it was in the film's dna as a parody but this film is supposed to be action-drama, not a parody. And I'll call out Mary-Louise Parker for most disdainment since she showed no acting talent and couldn't even emote for what must be botoxed facial paralysis. Now I understand she carried the series \"Weeds\" but whatever acclaim she got for that doesn't make any appearance here. I saw this for no charge and still feel ripped off due to time invested."}, {"rating": "8", "text": "Overall a good comedy. But, at times, it felt forced. Definitely more action then the original and the characters were pretty much the same as in the first one. If you didn't like the first, you won't like this. If you enjoyed the first. Go see Red 2."}, {"rating": "6", "text": "As far a sequels go, the usually don't work so well. This one surprisingly works. Grant it it's no \"The Dark Knight\" but for a movie like this, it's fun and enjoyable. Be sure to check out my YouTube channel \"TheMovieManLife\" and let me know what you think. Overall it's a fun popcorn movie to watch on a Saturday night."}, {"rating": "8", "text": "An excellent action movie with rich and meaningful comedy. Every bit of the movie is interesting and it makes us laugh though they are too serious....."}, {"rating": "1", "text": "The slightly witty humor didn't make up for the terrible plot, the clearly predictable villains, or the terrible gun play. It was a waste of time watching this, just another formulaic action movie without any real moral or objective plot line.\r The worst part for me was seeing the supposedly \"best assassin in the world\" miss over and over, and then finally switch sides in the end. WHY WOULD THEY SWITCH SIDES? WHY WOULD THEY TRY TO KILL YOU TO BEGIN WITH IF THE MONEY WASN'T WORTH IT? They tried to explain this with the guilt trip that the main protagonist comes up with, the \"we need to save millions of lives\" routine, but is someone who kills for a living actually going to have the morality to not kill for the 20 million just to save lives? I doubt it.\r In all reality, everyone in this movie was a villain, there wasn't actually a \"good side\", and I found myself hoping that they just killed each other off."}, {"rating": "7", "text": "\"Red 2\" 10 Scale Review: 7.0 (Good) ...\r The Good: Genuinely humorous without overdoing it. A solid blend of action and comedic moments. While Willis was good enough in his own right Malkovich, Mirrem, Hopkins and Lee stole the show every time they were on screen. Lee was especially great, not only with his martial arts but with his comedic delivery ... which caught me off guard and was a pleasant surprise. At it's core, it is an interesting story that kept you guessing.\r The Bad: It did go a little over the top on the action a few times and watching Willis survive crashes in numerous vehicles and a deluge of bullets got old. I understand that he is supposed to be good at what he does, but he can't defy physics and is not bulletproof. Mary-Louise Parker was up and down with a few great lines but then some awkward ones that weren't really very funny. Catherine Zeta-Jones was mostly wasted and didn't impact the movie much."}, {"rating": "10", "text": "I don't know the reason this got such poor reviews. It was a fun silly movie, with way better writing (and acting) than I expected, and several twists and turns. It was also really fun to see how much older actors, believably, could be badasses in their golden years. I mean, the oldest ones do less kungfu stuff and more intimidation or just practice their skills  like a 30th level arch-assassin. In fact, it felt more like watching an RPG than a movie, but that was fine. The movie isn't meant to be taken anymore seriously than something like Under Siege, but hey both were really fun to watch."}, {"rating": "6", "text": "I found this to be much better than the first movie, which I didn't enjoy. Just like the first I find the humor to be much better than the action, so the much improved jokes are greatly appreciated. Once again John Malkovich steals the show and Lee Byung-hun makes for an excellent addition to the cast. So while the movie exceeds at humor and cast, it stumbles with it's action and plot. The plot is slightly confusing, familiar, and ends up going nowhere. The action is tolerable but nothing spectacular. All in all it's a decent action flick that surpasses it's predecessor, but fails to leave a lasting impression. Still might be worth a rental to fans of the original."}, {"rating": "7", "text": "Red 2 is a great sequel that recaptures the stupid, dumb fun of the original. So if you happened to like RED, then RED 2 will certainly satisfy. If you didn't like the first movie, however, RED 2 will also suffer the same fate. I had fun and Anthony Hopkins was a blast!"}, {"rating": "7", "text": "I thoroughly enjoyed this film. I liked the first and I wasn't sure how this one would compare and I actually liked this one better. Lots of action, HILARIOUS throughout and just a good time, can't ask for more. Definitely worth a watch, especially if you liked the first. 7/10"}, {"rating": "8", "text": "The first Red felt like it was a movie trying to find the best in its performers but not really taking advantage of the films interesting premise. Red 2 feels like phase two, a film that benefits from both a good story and some strong direction by Dean Parisot. When Frank Moses (Bruce Willis) gets dragged back into his past CIA life yet again when Marvin (John Malkovich) asks for his help. It isn't long before Frank and his girlfriend Sarah (Mary Louise Parker) are thrown back into the thick of it. Brimming with plenty of comedy, both loud and quiet, Red 2 is a fast paced action thrill ride with a good sense of self and a cast of actors who are clearly loving the experience. Willis leads a cast who have a good grasp of the inherent comedy in the films plot. Malkovich who was the highlight of the original shines yet again, mainly thanks to a costume department who dress Marvin in some of the most inventive and ridiculous outfits you can possibly imagine. A globe trotting adventure film as well as a comedy conspiracy film, all wrapped up into one excellent picture. Smartly written by Jon and Erich Hoeber, Red 2 is a wonderful treat but it does rely on crazy twists that are all too simple in their execution making for a rather dull and predictable final act that does make you laugh (one moment had the whole cinema in fits of laughter) but doesn't amaze due to the predictable conclusion. It's all good fun but it isn't quite the finished product, even if its an improvement on the first."}, {"rating": "6", "text": "Red 2 continues to be the romp that began with the original Red, with the incomparable Bruce Willis, John Malkovich, Helen Mirren, Mary-Louise Parker—and with this second round, Catherine Zeta-Jones and Anthony Hopkins. The plot is convoluted and a little confusing, but there is a weapon of mass destruction out there called Nightshade, and the CIA wants to kill its very own Frank Moses (Willis) and his cohorts because they were vaguely associated with the secret project. The inventor of the secret bomb is a slightly senile professor named Bailey (Hopkins) who has been kept safely locked up in a sanitarium for over thirty years, Stalin-style, until he is rescued by the aging agents Moses and Victoria (Mirren). Although the ex-agents try to pretend they are retired, you can't keep a good spy down, and when called, they serve. And they serve with skill, talent, and dry humor in spite of their gray hair (or no hair) and wrinkles. They're more fun than James Bond.\r Frank Moses' best friend Marvin Boggs (Malkovich) stages his own death in the beginning but resurrects himself just in time to save his friend. Malkovich struts through the film with his signature blase attitude, his Zen-like calm, and that mesmerizing lilt in his voice. Frank Moses has already rebelled against his age by taking on a new girlfriend, Sarah Ross (Parker), who wants to be an agent just like her boyfriend Frank, but he only wants to protect Sarah from herself, for he is convinced that she's too weak and vulnerable to be a real player. Not since Diane Keaton la-dee-dahed us in Annie Hall have we seen such charming naivete and spontaneity in the archetypal role of the presumably helpless girlfriend. Parker as Sarah Ross is 49 but looks like she's 29, so she may appear to be a midlife crisis for boyfriend Frank, but she is in fact age-appropriate.\r The dynamic pack of senior spies have to face impossible obstacles, such as rescuing Bailey from the asylum for the criminally insane, which looks like a fortress, and then having to penetrate the Kremlin, which is truly a fortress. The plot would not be a comic book (the film is not trying to be overly realistic) if there were not an evil Asian contract killer (Lee Byung-hun) who has sworn to kill Moses. And then Moses's ex-girlfriend Katya (Zeta-Jones) appears, and she is a suave, sophisticated Russian KGB type who is also after Nightshade, and she teams up with her former beau Frank while swapping mild insults with his girlfriend Sarah, who is slightly threatened by Katya's charisma. “She's cute,” says Katya to Moses while glancing over at Sarah. “Where did you find her...Nebraska?” she asks. “Kansas,” chirps Sarah who is listening in with interest. Katya is described as “Frank Moses's kryptonite,” and Zeta-Jones delivers the goods in the role of an exquisite rhymes-with-rich. Willis does a variation of his unperturbed yippee-ki-yay character from Die Hard but with a new sense of resignation and eternal patience that only a senior citizen could have. Mirren continues to play the role of an omnipotent spy-genius—there is nothing she cannot do while making caustic remarks through it all. Hopkins fools us by playing a role within a role, as he pretends to be the bumbling and harmless professor.\r Although completely zany and unrealistic, the film is irresistibly beguiling because of the megawatts of charm generated by the actors. The theme is perhaps not quite as fresh as it was in the first Red, but hopefully there will be a Red 3 where the producers will work a little harder on the plot."}, {"rating": "5", "text": "Somewhat entertaining but mostly very unoriginal and not funny enough. Acting is okay."}, {"rating": "6", "text": "Although not as well constructed as the prequel, these senior action heroes still have gleeful somewhat appealing spy adventure. Like all the movies with collection of stars, RED 2 adds some familiar faces into the mix. Anthony Hopkins and Lee Byung-Hun are nice inclusion, they bring some novelty with nice acting and stunts. The story is far from impeccable, it's a bit rushed, contains too many half-baked plan of infiltration and relies more on firepower than the previous title. However, it is still decent and fun to watch as the cast seem to enjoy the mash, especially towards the end.\r Story revolves around the usual conspiracy, framed heroes and zealous contract killers. It passes some points with little explanations, these scenes occasionally turn silly, not in the witty parody of spy flick, but simply ridiculously mindless. Bruce Willis has decent performance, although sometimes he looks overly joking, or just sleepy, and can't be taken seriously. John Malkovich is good, he provides strange nuance as if he's funny with that little grim side tucked away. These two and Mary Louise-Parker seem to be enjoying their roles and it gives the movie a lighter tone, almost comedic even.\r Anthony Hopkins is suavely convincing, his voice exudes sophistication although he appears slightly frail from his age. Catherine Zeta-Jones plays the femme fatale from the past, but she's trapped in a generic role and her rivalry with jealous main character is very silly. The martial artist Lee Byung-Hun completes the cast as it's almost mandatory to have an Asian to do all the fight stunts. Surprisingly, he has fairly amount of humor part as well, it won't be a surprise to see him more often in Hollywood movies.\r While the cast does possess weighty names, the script is rather weak. Jokes are stale, with only a few of them able to force chuckle. Screenplay also isn't executed neatly as in the first, half of it is predictably sluggish. It picks up the pace towards the end and ultimately ends up passable. More explosives and bullets are utilized, although they are dull and have less impact than they are meant to be. Aside from the occasion tussle and despite the soundtracks' fervent attempt to fire up the audience, the action is only average.\r RED 2 has some merits, it's fairly enjoyable, but it's arguably inferior to the first. It is less charming, not as clever and not an appealing case for another sequel, which is a shame since RED has potential to be a smarter version of Expendables."}, {"rating": "8", "text": "In 2010, DC Comics introduced the world to one of it's lesser known series, R.E.D. (Retired Extremely Dangerous). What I loved about that film was that it took old school action stars and put them into a modern action movie. The expectations for action movies are much higher today, no longer are they just chases, explosions, and gun fights. Today, people expect action films to have some kind of story, characters with personality, and even some humor. RED delivered all that and more and so does it sequel. Even though there are some bigger names in RED's second installment, the humor didn't play as big a role as it did previously and the story moved a lot faster. To some, this may have been a good thing, but for me, too much happened too quickly. I liked it better when we didn't know the characters or what to expect from them, when things were explained, and not just delved into. The first film made RED seem very original, but it's sequel really does play like a story that was adapted from a comic. Don't get me wrong though, while the second film doesn't compare to the first, it is still far better than some of the other action films released lately. You really can't go wrong in having an action film that stars Bruce Willis and John Malkovich, they seem to just be oblivious to the signs of aging and are as believable today as they were in their prime. Alone, this pair would have been terrific, but you add true legends of the screen like Anthony Hopkins and Helen Mirran to the cast, and honestly, I don't see how any movie fan would want to miss that! The acting is terrific and the story, while proceeding much too quickly, was still a pretty interesting one. I did really enjoy RED 2, my only wish is that they had slowed things down a little and let us catch our breathe."}, {"rating": "6", "text": "Typically sequels of this nature fail to bring any fresh and/or exciting looks into the realm of their first installment. Red 2 contains a similar formula, but manages to provide thrill after thrill."}, {"rating": "6", "text": "You walk into “Red2” knowing exactly what you are getting. After checking your brains at the door you lean back and observe the actors from how beautiful Catherine Zeta-Jones is to how much fun Helen Mirren appears to be having even to the point of playing a queen gone mad in one scene. There is John Malkovich playing crazy as only he can and Bruce Willis flipping off repartee as if he was back in “Moonlighting” only this time sparring with Mary-Louise Parker. First spotting Anthony Hopkins you may think Charles laughton has come back to life. With this cast it is hard to stand out but Korean star Byung Hun Lee, as a lethal body weapon, gets laughs with his ‘want my plane back’ tirade at Bruce Willis and Neal McDonough is ready to jump into the next James Bond movie as a villain extraordinaire.\r Director Dean Parisot and screenplay writers Erich and Jon  Hoeber  know they aren’t making a picture for the ages but a fun romp with stellar performers. Yes they throw in a mad scientist, a device that will blow up, if not the world, then at least Moscow. There is a timing device ticking down and wires being cut but suspense is not the name of this game. Have a few car chases, blow up a few more cars, break a lot of glass and have Helen Mirren come out blazing with a gun in each hand plus a sexy scene with her, being a sniper, and Brian Cox enthralled by her and her shooting and her toes curling with each round she fires off and you will be smiling.\r What can you expect of a movie that takes place in Paris, France, Moscow, Russia and Teterboro, New Jersey, that also has a subdued, but pounding beat of a music background by Alan Silvestri and throws in “Papa Loves Mambo” sung by Perry Como?\r This is the type of movie that throws away a line like “Is that a stick of dynamite or are you just happy to see me?” to burn in your mind and go right on to the next line!\r Hot and/or rainy day? Want to forget everything for 2 hours and just relax? Definitely go see “Red2” and watch pros have a good time!"}, {"rating": "6", "text": "One thing about this movie Is that it's incredibly boring. The first half is going nowhere and is a great cure for Insomnia. Then we meet Hopkins (who steals the show) and we get the ball rolling and you start to have fun but you realize the movie ends."}, {"rating": "6", "text": "An entertaining sequel that benefits from weak competition from other opening movies this weekend. I found it ultimately forgettable. Not that it was a bad movie per se, but I will not be calling my friends telling them what a great performance Willis makes doing something new and different. Hey, much better than the last Die Hard movie though. Much Much better...."}, {"rating": "7", "text": "A pretty average movie to be honest, not as good as the first. But definitely entertaining mainly because of the cast which benefits from names such as Helen Mirren, Anthony Hopkins and David Thewlis. Most of the jokes fail and you forget, but the ones that work are very funny and mostly come from Mary Louise Parker which is very different from the first movie where she just pulled faces and acted sarcastic. Bruce Willis has swapped with her and only has one facial expression throughout the whole movie."}, {"rating": "8", "text": "Anyone who is a fan of the Red 1 will enjoy the sequel. It's got the same comedy style, action, fight scenes and clever dialogue between characters. In addition we see character growth (epecially for Frank Moses and Sarah), learn more of the main characters' history, and see the same familiar faces along with some new ones. The story lacks humour this time and is more serious but is still very enjoyable.\r Anyone who hasn't seen RED 1 is interested please go see this. These two films present the best way to make a spy spoof without being ridiculous or completely silly i.e. Johnny English or Austin Powers. The story, action, and setting is serious like a action film however the conversations, skill, and body language these characters have is where the comedy comes from. All is all it's funny without taking the piss and directly ripping off or referencing other action or spy films. Plus Bruce Willis' character (Frank) is a great parody of his career in action films.\r I will be content if they don't make RED 3 but if they do I'm really looking forward to it. See Frank (Bruce Willis), Marvin (John Malkovich), Victoria (Helen Mirren), and now Sarah (Mary-Louise Parker) kick butt is so entertaining I can't wait to see what happens to them next. Hopefully it involves Ivan (Brian Cox) and Han Cho Bai (Byung-hun Lee) too."}, {"rating": "5", "text": "It's an unrealistic action movie, and for that reason, it's walking on eggshells right off the bat. Again I have endured a film that lacks significant identity. It has just been thrown together in an untidy fashion in the hope of achieving something. However unlike action films of a similar quality, it is able to successfully incorporate comedy into the experience, and that on it's own can make a film. The story doesn't deserve recognition but the entertainment factor it delivers does."}, {"rating": "9", "text": "I loved the first Red movie so I have to say that I was excited for this movie, and the results? Well, Red 2 is awesome. I left this movie fully satisfied with the content. It just goes to show that older people still do kick ass and the Red franchise has not suffered one bit. You like action packed movies, watch Red 2, if you like the first Red movie, watch Red 2, if you like funny movies, watch Red 2. What I loved about Red 2 is that it did what most sequels fail to do, and that is take all you love about the first movie, polish it, and make it just the slightest bit better. Red 2 is an accomplishment and I am looking forward to its release on blu-ray."}, {"rating": "8", "text": "\"Red 2\" was one heck of a ride and I enjoyed every second of it. I went into this film feeling skeptical because I didn't LOVE the original but this film blew it out of the water for me. This film was surprisingly funny and had a couple of twists that you may or may not see coming. Every actor & actress was great, nothing out of place. I give this film a solid 8/10, worth seeing at the movies."}, {"rating": "10", "text": "great action and interplay with a awesome cast...fun date night movie....both my wife and I liked it. the line play between the characters got laughs from the  crowd throughout the movie"}, {"rating": "8", "text": "The \"action packed\" sequel Red 2 returns with more explosions and entertainment, releasing July 19th. The movie begins with Frank Moses and Marvin Boggs meeting up in a local Costco where Marvin is warning Frank about danger arriving in the future and that he needs Frank to come help. After Frank refuses many times, we see Marvin get into his car and drive away. Nothing too out of the ordinary, until Marvin's car explodes and Marvin is pronounced dead. Frank pokes Marvin with pins and nails trying to get him to awake because he knows that he is once again faking his death but he doesn't budge. As predicted by most of the audience at the screening, Marvin is here to save the day when Frank and his girlfriend Sarah Ross are in danger.\r Marvin explains that they are being hunted by everyone even Victoria (who worked with them at Moses and Boggs at MI6), because Frank was was wrongly associated with a leaked document talking about a 70's explosive knows as project nightshade. One of the most dangerous men out to kill the boys is Jack Horton (Neal McDonough).\r Victoria ends up changing sides and works with Frank and Moses. They even go further to hire Han Cho Bai, the best hit-man to live. Towards the beginning of the movie we see him kill a man with a piece of paper folded into origami. When he worked against them also towards the beginning, he pulled up in a rigged van that contained a massive automatic weapon (which felt like it had unlimited ammo) and tried to just kill Frank and Marvin even if it took his whole round. Cars exploded and fire hydrants busted open but that was no match for Frank and Marvin who managed to stay alive.\r They continue to try to prove themselves innocent and meet up with Bailey (Anthony Hopkins), who has been in an underground prison for 32 years. He is a crazy man and also created nightshade. Characters turn on each other and we also learn the truth about others.\r Red 2 was an action packed comedy that has lots of violence and entertainment for a PG-13 movie. I recommend it to any viewer even if you did not see the first movie. I think that this is the type of movie where you don't have to see the original (Red) to understand Red 2. I really enjoyed it and would see it again with friends or family. Though the movie had a two hour run time, it did not feel like it at all and I did not believe the time when I walked out of the theater. I am really hoping for a Red 3 with the same amount of enjoyment in the future."}, {"rating": "1", "text": "Very very long. Not particularly funny basically an all star cast running around in circles with very little in the way of surprise. I honestly thought it would never end at about the hour mark not exactly a ringing endorsement. What a waste of Anthony Hopkins."}, {"rating": "8", "text": "When evaluating something, the most important is to realize what is the intended purpose of the subject, and considering that, this is a good movie. If you are looking for realism you won't find it here, this is the type of movie made to entertain, to be fun, to have action, and it achieves that just fine.\r Characters  8\rWhile they are based on cliches, I think that is the purpose, they aren't meant to be unique, they are meant to be badass and funny, and they achieve that.\r Plot/Story  7\rI think its quite good for the type of movie, it could be better, but it could be much easily worse. While it has some holes, definitely some impossibilities, predictable to some extent but also has some nice twists.\r Action  6\rWhile I think the action sequences are well made, the \"enemies\" of our heroes are just a little too dumb, you know, the special forces fully equipped grunt that is as skilled as a common soldier...\r Comedy  7\rWhile most of it is simple and obvious, I liked it, its all about being in the mood to watch the movie, if you are not, of course you will only look at it like its all cliche comedy.\r Acting  8\rEveryone makes a nice job, Anthony Hopkins makes a great performance.\r Special Effects  8\rI could point out a few things that don't look that good, but in overall they are well done.\r The soundtrack and sound effects are OK, nothing remarkable or bad to point out.\r Just make sure you go watch this movie with the right mood for it, if you do so, then you will have a good time, if not, then don't waste your time."}, {"rating": "10", "text": "\"Red 2\" was one heck of a ride and I enjoyed every second of it. I went into this film feeling skeptical because I didn't LOVE the original but this film blew it out of the water for me. This film was surprisingly funny and had a couple of twists that you may or may not see coming. Every actor & actress was great, nothing out of place. I give this film a solid 10/10, worth seeing at the movies."}, {"rating": "10", "text": "I have not seen the first Red  thats ok if i did not see the first one because RED 2 kicks ass. Based on the comic book novel by Warren Ellis  and Cully Hammer i am a fan of Ellis's Work on Dead Space let me skip right to the point. There Back ! Starring Bruce Willis ( Sin City, Die hard ) , Mary Louise Parker , Jhon Malkovich , Helen Mirren, Award Winning Anthony Hopkins ( Hitchcock) , Katherine Zeta Jones , and Byung- hun lee who kick ass in the sequel. very talent actors,actresses. This will Moviegoers and Fans of Spy movies never forget the name\" RED \" 10 times better then James Bond movies are old then then today. Grade A+. Even if critics don't like picture watch anyway"}, {"rating": "6", "text": "This more ambitious sequel embraces even more it's comic book origins. With bigger and sillier action scenes, more interesting characters and a more out there plot, if you were a fan of the first, you will enjoy this sequel."}, {"rating": "6", "text": "Bottom line: I didn’t expect much from Red 2 and I wasn’t disappointed; it is funny at times and is, overall, a pleasant enough movie.\r I didn’t see Red because I was never the biggest fan of movies where the kick is that older people are doing things typically associated with younger people. I will say that I would rather see old people in a film than children. Both groups make snarky comments but I feel like once you reach a certain age, it is fine. I was pleasantly surprised by Red 2. It’s funny here and there and it isn’t really trying to be anything more than a comic book movie. It isn’t too stylized but it isn’t too realistic. “Stylized,” mind you, isn’t inherently bad but is when executed poorly. I suppose anything could be bad but it’s the difference between Kill Bill and Baytown Outlaws.\r Red 2 is about a bunch of retired CIA (MI6, KGB, etc.) agents going back into action to track down a missing Cold War super-weapon before it falls into villainous hands. I liked each of the characters. I was a little wary of Mary-Louise Parker. She teetered on annoying but she was sympathetic enough to not make me hate her.\r The humor in Red 2 is a lot like the following joke:\rTwo hunters are out in the woods when one of them collapses. He doesn't seem to be breathing and his eyes are glazed. The other guy whips out his phone and calls the emergency services. He gasps, \"My friend is dead! What can I do?\" The operator says \"Calm down. I can help. First, let's make sure he's dead.\" There is a silence, then a gun shot is heard. Back on the phone, the guy says \"OK, now what?\"\r There is something matter-of-fact about the violence which intertwines with the humor. “It’s been months since you’ve killed anyone, Frank,” says Marvin (Malkovich). “That’s a good thing, Marvin,” Frank responds.\r One thing I thought was kinda funny was the word choice. If you recall Live Free or Die Hard using ‘technical buzzwords’ like “download”, Red 2 uses the word “Internet”: “Ever since that document was put on the Internet....” and “There’s no way to take down the list after it was posted on Wikileaks on the Internet.”\r A driving subplot is the relationship between Willis and Louis-Parker. He is a former operative and she is a former phone operator for the Social Security Administration office. Much like the rest of the movie, it isn’t tense or drawn out. It provides opportunity for quick little jokes such as the scene where John Malkovich (another retired CIA hitman) and Byung Hun Lee (the world’s best hitman) give relationship advice to Bruce Willis. I can imagine how having three hitmen talk about feelings might not seem worth a sequel, but it is. Instead of adding stupid jokes Red 2 let’s silly little situations speak for themselves. This is to say that Red 2 generally shows restraint, which I appreciate.\r Overall, I’d recommend Red 2 for a Sunday matinee kind of thing. It could make for a cute date movie. It isn’t the best movie ever in any respect but it was good enough for me to want to see the original some time."}, {"rating": "8", "text": "This is a typical example why the so called \"critics\" and the official score at Metacritic sucks.This is simply a greatly entertaining movie."}, {"rating": "7", "text": "This is an action packed film, much as the original ('RED') film was and so I'd categorise it as a comedy action film, as there are some scenes that are a bit ludicrous and I found myself laughing at them. I suppose it'd also be fair to call it an action parody as well.Generally there is more in the way of gun fights, moderate violence and some special effects than there is in the way of plot, which again is similar to the original film. That aside, its quite entertaining, quite comical by way of the over the top characters (in terms of their capacity to hold their own and survive all the situations their presented with) and there is some witty comedic dialogue present, so I enjoyed it. Thankfully, unlike other film sequels, this features an equally impressive cast, including Bruce Willis and Helen Mirren in the same roles as before. Bruce plays the main character, Frank Moses, who, in the beginning of the film, is revelling in his retired status (but, of course, that isn't the case for long). He plays no-nonsense Frank much as you'd expect, given that he tends to specialise in action films. Meanwhile, Helen Mirren returns as the sassy, equally no-nonsense MI6 agent Victoria. I liked her character in the first film and I did again in this sequel, in as much as I find it admirable to see an assertive and independent women who isn't afraid to stand her ground t- all of which applies to Victoria. I can't say I'd ever imagined seeing Helen Mirren in such a role before these films were made but I like it!. Other cast members include John Malkovich, Anthony Hopkins, John Malkovich, Catherine Zeta-Jones, Brian Cox and Neal McDonough. Evidently its not short of a big name or two and generally the cast do a good job of portraying their characters as somewhat hum-drum people trying to accomplish their goals and get on with their lives. It is a bit ludicrous but then thats kind of the charm of films like this.So, as I say the story is rather incredulous and it has a comic book style or tone to it, which is visually represented by some of the title shots and moments before the start of a new scebe, in which characters are depicted as cartoon-esque drawings.This film features some quite futuristic sounding music, or muzack? which helps add to the fast pace. The camera work may not appeal to anyone who suffers from motion sickness or anything similar, as scenes are frantically shot involving multiple different angles etc., to add to the sense of action. I particularly enjoyed one scene with a car chase involving two characters in an old Citroen (2CV or similar?) car across Paris. If I were to compare this film to others in general, as far as the cinematography is concerned, the first franchise to come to mind would be the Bourne films.Some of the comedy is a bit childish, such as one character 'flipping the bird' when the others become trapped while chasing him but its certainly not meant to be a film thats taken seriously - heck, the film title alone should be a clue to that (RED being an acronym, which is as follows - Retired and Extremely Dangerous).Content wise, unsurprisingly this film features some mild to moderate violence (nothing especially graphic), some strong language and drug references. Due to this, its been given a 12 certificate. I imagine this film would appeal more to adults than a younger audience, due to the cast, seeing the numerous a listers and b listers in a more exaggerated, somehow unrealistic film - ultimately having fun playing super heroes.One other thing I should perhaps mention is that there are a few (though not many) scenes which include subtitles, as characters speak in non-English languages. I think it was just in German but there may have been another, I can't remember for certain.Yes, I'd happily recommend this film. The plot is a bit thin and it isn't entirely believable but then I suppose it isn't supposed to be. Its very watchable, it features a big cast with some enjoyable performances and there is some witty and amusing dialogue, adding a comedic element to it. The camera shots may be off putting to anyone with motion sickness, or similar conditions but otherwise I reckon its well worth a watch."}, {"rating": "8", "text": "Way better then the first. Way more action too and explosions. This one is hilarious too. It needs a part 3 now."}, {"rating": "8", "text": "Retired black-ops CIA agent Frank Moses reunites his unlikely team of elite operatives for a global quest to track down a missing nuclear device."}, {"rating": "5", "text": "Compared to the first film, which was enough, this film is just mediocre. A film that I was able to recover only a short while ago and I've already forgotten it, in fact I don't remember what it was about at all, which means how profound it was and how much it struck me."}], "recommendations": ["red", "knight_and_day", "spy", "spenser_confidential", "kingsman_the_golden_circle", "snatch", "the_losers", "american_ultra", "logan_lucky", "16_blocks", "jack_reacher", "from_paris_with_love", "lucky_number_slevin", "daredevil", "the_nice_guys", "deadpool_2", "red_notice", "grudge_match", "angel_has_fallen", "jumanji_the_next_level", "seven_psychopaths", "demolition_man", "rocknrolla", "boss_level", "the_suicide_squad"]}