{"id": 2761, "title": "Red Lights", "starring": ["Sigourney Weaver", "Robert De Niro"], "runtime": 119, "genre": ["Thriller"], "description": "Two investigators of paranormal hoaxes, the veteran Dr. Margaret Matheson and her young assistant, Tom Buckley, study the most varied metaphysical phenomena with the aim of proving their fraudulent origins. Simon Silver, a legendary blind psychic, reappears after an enigmatic absence of 30 years to become the greatest international challenge to both orthodox science and professional sceptics. Tom starts to develop an intense obsession with Silver, whose magnetism becomes stronger with each new manifestation of inexplicable events. As Tom gets closer to Silver, tension mounts, and his worldview is threatened to its core.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/sukxYMaUTNizM7bcEJ4YeH80e8h.jpg", "categories": {"plot": 7.5, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "For the initial two-thirds of the movie, I was hooked, plot pace was quick and unexpected. Once the story shifted to finding his wife, the movie losted its intensity and suspensefulness."}, {"rating": "9", "text": "I love the movie! I understand however, that in some countries, like in the States, a movie like this doesn't have the same effect that what it has in Europe, Latin America or even in some areas here in Australia (i.e Sydney, Melbourne, and Adelaide that are more European-like) . In my case, this movie is 'my type', perhaps partly because of my European ancestry. I believe  the exposure to European culture has given me a different perspective of things-besides the Australian- and that includes art. Nonetheless, I have to agree that the film could have been better, that is for sure! There were things to be improved and they could have prolongued the tension and twisted the plot a bit more, but I enjoyed it so much as it was, anyway! An excellent movie...original, well crafted, great performances...! A real delight!"}], "recommendations": ["amores_perros", "arrival", "cloud_atlas", "upside_down", "eternals", "argo", "the_13th_warrior", "samson", "hugo", "risen", "blood_diamond", "mortal_engines", "blade_of_the_47_ronin", "victor_frankenstein", "oblivion", "master_and_commander_the_far_side_of_the_world", "inception", "the_last_samurai", "the_girl_with_the_dragon_tattoo", "searching", "minority_report", "agora", "donnie_darko", "your_name", "flight_of_the_phoenix"]}