{
  "id": 2321,
  "title": "Red Sparrow",
  "starring": [
    "Jennifer Lawrence",
    "Joel Edgerton"
  ],
  "runtime": 140,
  "genre": [
    "Mystery",
    "Thriller"
  ],
  "description": "Prima ballerina, Dominika Egorova faces a bleak and uncertain future after she suffers an injury that ends her career. She soon turns to Sparrow School, a secret intelligence service that trains exceptional young people to use their minds and bodies as weapons. Dominika emerges as the most dangerous Sparrow after completing the sadistic training process. As she comes to terms with her new abilities, she meets a CIA agent who tries to convince her that he is the only person she can trust.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vLCogyfQGxVLDC1gqUdNAIkc29L.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 4.578947368421052,
    "ending": 5.294117647058823,
    "soundtrack": 6.666666666666667,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 6.0625
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I went in not knowing much about the film. I thought it was a great thriller which kept you guessing the entire movie. I thought the acting was great throughout too. A unique storyline to a spy movie."
    },
    {
      "rating": "0",
      "text": "I can describe this only as an \"insulting\" film. Characters have no motivation, poor acting. This anti-soviet/anti-russian propaganda would be nice back in 50's. Feels bad it's 2018."
    },
    {
      "rating": "3",
      "text": "Hollywood keeps mashing the cold war concept with current times, and that doesn't work. The movie feels out of place, it can't shake the feeling that something is not right. That makes it a failure, like The Sum of All Fears. Also Lawrence doesn't help with her blank face void of emotion."
    },
    {
      "rating": "1",
      "text": "Nonsense impersonating history. Endless holes in the plot and his despondency do not give the right to this video to be called a film. For complete idiocy there are not enough drunken bears driving around on the red square, on unicycle."
    },
    {
      "rating": "2",
      "text": "The performances are ok but the characters are pretty stereotypical and the plot is nothing to write home about. The overuse of sex throughout the movie was clearly used in an attempt to mask any shortcomings and they do a poor job of doing just that. It's watchable but that's about the only good thing I can say about it."
    },
    {
      "rating": "2",
      "text": "This movie had unnecessary gory violence.  I was looking to have an enjoyable time but had to put my hand over my eyes several times.  I almost walked out three times but held in there.  Would not recommend this movie."
    },
    {
      "rating": "3",
      "text": "Red sparrow made an attempt at flying, fluttered for a little bit, but then belly flopped into the pool of the local Russian YMCA. She walks thru the rest of the film as a cold wet bird struggling to find herself.I have no doubt that this film, which netted J Law unprecedented millions of Denaro for just showing up and talking in a concocted Russian accent will get the Oscar nod during award season.The plot is mostly about loss, yet at times I am at a loss for words. She breaks her leg in a freak ballet accident (who knew ballet could be so dangerous?) and then things just keep getting worse for her along the way, including a couple rape scenes.Spoiler Alert: J Law couldnt hit a golf ball inside of a steam room of the local Russian YMCA to save her life. She should definately stick to being a ballerina.The film was formidably watchable for the most part only until the end where a plot twist that makes absolutely zero sense occurs. The confused little bird tries to make out with her uncle and then strangely gets him shot just to upset her American lover. If this moment was important then the director certainly failed to build it up. Makes me think Rian Johnson rewrote this script it’s so bad. Go see it, but only if you like torture (literally)."
    },
    {
      "rating": "10",
      "text": "ubyfugugugugugugugihoujopijuytreeqsdinguigihhiohohohihihihihihihihihihihihihohohihihiihihihihiihihihihihihihihih"
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;;::;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "4",
      "text": "I couldn't finish the movie. The first 45 minutes are bearable, but after that it becomes painfully slow. The dialogues are just boring and there isn't enough tension for that kind of movie. I don't really blame the actors. It just wasn't appropriate for a movie. I give it 40%."
    },
    {
      "rating": "10",
      "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"
    },
    {
      "rating": "2",
      "text": "A terrible, deeply disturbing movie. It tries to shock you but for no other reason than shocking itself. It's empty and the plot is primitive, it has cliche over cliche multiplied by violence. I must admit, camera work is pretty great, and that makes for a great trailer, but not enough for a good movie."
    },
    {
      "rating": "4",
      "text": "Not very good. Disjointed. Sloppy. Gets better towards the end but ugh. I am a J Law fan but I have to say her accent was terrible. Have a Russian ex and have spent time there, and it's bad. Some good moments, some laughable moments though unintentional I'm sure. Couldn't wait for it to be over."
    },
    {
      "rating": "0",
      "text": "really boring and slow movie. acting is wooden imo. the whole thing is predictable"
    },
    {
      "rating": "5",
      "text": "Jennifer Lawrence is all grown up, graduated from the Hunger Games and is now attending Sparrow School. Seducing men and getting everyone killed in the process.Dominika Egorova (Jennifer Lawrence) is a witness to a crime she shouldn't have seen, so her only option is to become a Sparrow. A secret Russian intelligence service who specialise in training young agents to use their bodies as weapons. Not the fighty action James Bond kind of way but more in the seductive and manipulative kind of way. They can also pick locks so as far as the training goes that's about it. Dominika finishes Sparrow school as perhaps the most deadly of all the sparrows. Capable of using her mind and body as a weapon, her mission now is to get information from American CIA agent Joel Edgerton. The plot gives you all the information you need to figure out what exactly is going to happen before it happens. The twists and turns don't offer much in the way of surprises and at 2 hours and 20 minutes you can bet there's a lot of them. What it does offer is a good enough espionage movie packed full of violence and torture to peak your interest. At the very least it got my attention, so although the story is dragged out for much too long it manages to pull itself together into an \"only gonna watch it once\" popcorn flick. Much darker than I expected which is enough to separate it from the usual generic stuff. This is probably the best performance from Jennifer Lawrence in a while, not enough to get the bad taste left behind by Mother! but it's a start. Recommended if you've seen all the Oscar movies and looking for something a little different."
    },
    {
      "rating": "4",
      "text": "There's some solid performances and intense moments, but this is mostly just a messy, over-long, predictable, and over the top movie with very little to enjoy. I don't know was going through the screen-writers minds when they were writing this but they probably need some help..."
    },
    {
      "rating": "5",
      "text": "The movie was too violent and had too many horrific torture scenes.  Parts of it were unbelievable.  The main character brutally attacks two ballet dancers and later we find out she broke the dancer’s toe?  I thought both dancers would have been dead after the beating.  The main character is tortured and her head is whacked hard and yet she’s fine a day later?  In real life she would have been dead.  I didn’t really care about her after the first ten minutes because of her brutal attack on the ballet dancers."
    },
    {
      "rating": "3",
      "text": "the first half is basically just a porno and it was so painfully slow! cut off the graphic sex scenes as well speed it up a bit and would have been a much better movie! shame, not her best work."
    },
    {
      "rating": "4",
      "text": "Red Sparrow is a lot like last year's Atomic Blonde. Both films are about femme fatales, both films take place largely in Russia, both films have twist and turns in their spy thrillers, both films use some bold colors (Atomic Blonde blue, Red Sparrow red), and both films are by the number spy thrillers that are not interesting. The only different is that Atomic Blonde was at least fun and did not have really uncomfortable undertones like Red Sparrow does!One thing that I can absolutely give Red Sparrow credit is that it is a technical well made spy thriller. Francis Lawrence, most known for directing three of the four Hunger Games films, as well as I am Legend, isn't exactly an interesting or stylish director, has definitely stepped up his game, making a visually striking film with some great use of red color hues. I won't call this movie stylized really and there's not a lot of subtly and substance to really analyze, but there is certainly a lot of interesting shots that does feel pretty cool. The score is also pretty great too, being done by James Newton Howard. It's largely classical inspired and even using classical pieces, that both fit the film and adds a bit of tension and even beauty to what is going on. And that's about it for the positives really.I mean the acting is alright really, but these characters are so bland and by the numbers they just feel like carbon copies of characters you've already seen before in spy thrillers. This is very much true for Jennifer Lawrence's character, Dominika or as she is referred to \"Sparrow.\" J-Law has proven to be a great actress, and she goes as far as she can with her role, even with her fake Russian accent, but her character is so flat that her natural charisma does not elevate her role as far as we really want. Add to some stale chemistry with Joel Edgerton, who is shockingly bad in this film, and any sex appeal from this movie is gone down the drain.Speaking of bland, this story is just so dull! It's nothing you have not seen before, the plot is convoluted and hard to follow at times, and it's just so long and the film drags! Like I was so bored by this dull movie. It's not a constant fun, action-packed spy film and more in the vein of Tinker Tailor Soldier Spy, a spy film more about wit and intrigue instead of being action oriented, which I can respect. But like I have to care about what I am seeing, which I do not! It's just so uninteresting.And not to mention really uncomfortable! Like this movie is super graphic with it's violence and sexual imagery. Like there is a scene in the film that basically was going to full blown rape, I am not kidding. This is to add to some feminist subtext with the film, but with how needlessly graphic the film gets, and really analyzing this movie in a feminist critique it is incredibly shallow. Sparrow doesn't do much work on her own as she basically has to be told what to do, including having a man forced upon her! Yuck! I can somewhat respect this movie if it was at all handled the touchy subject respectfully, or just full blown exploitative and unapologetic, but it never goes that extra step and just feels like a tepid mix of Tinker Tailor and Girl With the Dragon Tattoo. Maybe the book did it better but I have no interest in picking up the source material after watching this.I can't hate this film too much because it is a well shot movie and the score is good, but it's just a long, boring, and uncomfortable slog to sit through. It's too boring for a spy film, too shallow for a feminist movie, and too scummy for J-Law fans. Just skip it altogether!"
    },
    {
      "rating": "0",
      "text": "**** **** ****!!!!Anyone who likes this piece of **** is a deranged idiot!!!"
    },
    {
      "rating": "3",
      "text": "what have you done..Red SparrowBeing rich and clean visually, the feature endorses intensity and practicality capturing some indigestible brutal scenes depicting the clear genuine effort and hard work that went behind the stage which unfortunately makes it more sad in the end as it nullifies everything to zero. A common mistake while creating such character driven feature is that if the characters and the offered environment to the audience isn't intriguing enough to invest in it, the movie starts to fade off slowly but surely in front of their eyes. Francis Lawrence is definitely not short on execution but what lacks is enough material to feed the audience for more than 2 hours and hence fails to offer any lose thread to hold them. Jennifer Lawrence aces on her side of the act and is supported too with a great cast like Joel Edgerton and Jeremy Irons saving the 'performance' objective of the feature. Red Sparrow is a slow pill whose attempt may be admirable but won't connect to the viewers in any tone for it fails on offering gripping content, better editing and a genuine reason or soul."
    },
    {
      "rating": "2",
      "text": "Usually, the best thing about a movie Jennifer Lawrence is in is her being in it and she is the best thing in “Red Sparrow”.The set up is simple with a Russian ballerina suffering a career-ending accident during a performance and is forced, by her pedophile uncle, to go to a Russian intelligence school referred to “Sparrow School”, where sex and body are used as weapons, in order to continue taking care of her sick mother.From then on we are watching a convoluted screenplay by Justin Haythe that is even more confusing when tried to explain at the end and, in my opinion, does or doesn’t point a finger at the mother.The sex, of which there is plenty, and a lot of nudity, is gratuitous and worse, boring. The violence is almost to the point of the audience vomiting along with some of the movie’s characters. The British Board of Film Classifications had the film to take out parts of a particular scene—I wish they had taken it out completely!—to get a less certification for strong, sadistic violence. Rated is “R” in the USA for ‘strong violence, torture, sexual content, language and, yes, smoking’!The direction by Francis Lawrence is haphazard and very slow moving for what is a spy thriller. The ‘love story’ is far from believable and there doesn’t seem to be any ‘heat’ by the two stars.Jennifer Lawrence has a couple of striking scenes, one as the ballerina and one of her in a sparkling red dress that is more interesting than anything that happens in this movie.Her co-stars do their best but with a bad script, a very talky, slow-moving 139 minutes spy thriller that doesn’t really thrill, “Red Sparrow” a book trilogy should start and end with this one."
    },
    {
      "rating": "1",
      "text": "The russians were again shown as villains. Again this primitive! Writers and director russophobes who do not have any clever ideas."
    },
    {
      "rating": "0",
      "text": "This movie is the first movie that made me to leave the cinema before the end. I was trying to enjoy it but I don't know where to start, I was there for 40 mins, hoping that something was going to be at least better than the previous scene, but nope, so finally I decided that if they took my money, they were not going to steal my time.Acting was wrong, awfully wrong, but it wasn't the worst, in fact it was the less wrong stuff of all this \"\"movie\"\" (because is not a movie, is just more anti-russian propaganda), what about Jennifer Lawrence being raped because... I still don't know the reason?, I guess the director just wanted to see her nude and in that manner, so that brings me to -> is this casting (director, plot writer, etc) a casting of criminals? I don't know if that STRONG word would fit them, but definitely something is wrong with them, the hate that they show (on purpouse) on this movie, is just aaaaawful.Don't go to watch this... THING, you will completely spoil your time on it."
    },
    {
      "rating": "0",
      "text": "This film is unwatchable. I waited to see it on the plane. I tried 3 times and had to turn it off each time it was so bad. The fake accent, the same expression, the one dimensional characters she plays. So I fast forwarded to the end; her expression was  still the same. So if you think the movie might get better when it reaches cable, I'm sorry to tell you it doesn't, but at least you can turn it off."
    },
    {
      "rating": "4",
      "text": "I get where the movie was going, but I don't consider the idea well executed. Everything was so cryptic that I eventually stopped caring who is helping who. I'm also disappointed in the cast, although I think their performances were mainly worsened by the script and directing. Cringe-inducing, long sex scenes, gory torture scenes that make you wonder what the movie is trying to be: A classic spy thriller, Fifty Shades of Grey, some gory shocker? I don't know, It seems to be a mixture of all three where no part is really thought through. All in all, a pretty disappointing flick. Had hopes in the cast that were shattered by the horrid writing. 4 Points go to a few decent acting moments (in the not-cringy scenes), a good score and fairly decent cinematography and editing.Oh and by the way: Is this what female empowerment in \"me-too\"-Hollywood looks like? The female protagonist seducing, having sex and getting raped on screen? Oh come on..."
    },
    {
      "rating": "5",
      "text": "The first hour is full of shock value setpieces which feels blatantly exploitative for little to no real artistic reason but get past that rather slow first half and the story is a good slow burning spy drama. Nothing special but definitely watchable."
    },
    {
      "rating": "6",
      "text": "Red Sparrow, Directed by Francis Lawrence and starring the eccentric Jennifer Lawrence. This film wasn’t terrible, but it also wasn’t that great. The middle ground where this lies is an okay movie about a ballerina that becomes recruited to be a spy for the Russian government. Sounds pretty “meh” right? Yeah I thought so at first too. There was no style or flare to it at all either, there was just more focus on its character moments that were overdrawn to highlight some plot details that were missable. The film was marketed in a way that could be mistaken for a spy action thriller, but there was barely any of that too. The action that did happen was brutal and quick but really at times served as plot devices to move the characters’ story along for the sake of the film, and at a certain point for the sake of runtime, this **** was long.Overall, Jennifer Lawrence doing a Russian accent for over 2 hours is pretty interesting, but the rest of it didn’t deliver like the music of the film thought it did. Great acting, great score, uneven story.6/10. P.S. Go see Black Panther"
    },
    {
      "rating": "1",
      "text": "One of the worst movies I have seen in a long time. Amateurish plot was hard to follow. Hard to understand what was being said. Two great actors were wasted on this movie."
    },
    {
      "rating": "3",
      "text": "If you enjoy flicks where you can guess accurately:(a) the ending in the first 15 minutes(b) the characters nationality by their penchant for inhumanityand want to be surprised by the amount of crass rape/gore/torture scenes, you'll really love the experience.For everyone else, do yourself a solid one and stay away.The movie dons a pseudo-dark exterior to swindle the spy thriller masses, but what you get out of it are one too many \"seen that one coming\", usually followed by \"I wish I could unsee that\"."
    },
    {
      "rating": "1",
      "text": "This is an R rated film, but in fact it should be X rated! To say that the director went too far would be an under statement. Scenes of violence, explicit sex and sex crimes have left me feeling violated! My husband and I went to watch the movie for our date night last night, expecting an exciting action thriller. Instead we were met with an indecent pornographic film. At one point I really wanted to leave the cinema, but the cinema was packed and I didn't want to cause a scene. If this is the type of movie we have resorted to calling entertainment, then I am deeply saddened for humanity. Anyone with any sense of decency will simply find this movie a violation of all that they are. Not to mention the fact that the Russian accents were so poor and many of the actors would even slip out of their accent!"
    },
    {
      "rating": "4",
      "text": "Besides Jennifer Lawrence's boobs there is nothing special about this film."
    },
    {
      "rating": "3",
      "text": "Absolutely horrible and not in the way it wants to be, simply a bad film. Acting by Lawrence was pretty decent everything else...just bad. I can't believe critics are giving films like this positive reviews when they Bomb films with any funding by Netflix which in general are much better than this trash. Do yourself a favour, save the money and give this a skip."
    },
    {
      "rating": "9",
      "text": "Red Sparrow Movie Review: 8.5/10Great and intriguing story, Jennifer Lawrence performance is perfect and the rest of the cast is just amazing.The plot is unexpected and I loved the dark tone that Francis Lawrence decided to give to this breathtaking movie."
    },
    {
      "rating": "3",
      "text": "An artistically boring storyline accompanied with cliche character narratives, Red Sparrow is simply awful in its direction, making the film one of the most atrocious representation of espionage."
    },
    {
      "rating": "0",
      "text": "My wife and I saw the previews for this movie while watching another one.  It looked like it was going to be a pretty decent movie in the Spy genre from what we saw, so we picked up a copy.  It started out well, but the graphic rape scenes, nudity and just the subject matter of training these young people to be whores was absolutely disgusting. When we saw the naked lead actress obeying orders to spread her legs for the man that just tried to rape her earlier, that was enough for us.  The blue ray disc was popped out, broken in half and tossed into the trash.  Absolutely disgusting.  We watch movies to be entertained, not to feel violated. They could have gotten their points across without these graphic scenes.  We just couldn't take it any more."
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    },
    {
      "rating": "8",
      "text": "unlike many others here, i did enjoy this razor sharp thriller, and its twists and turns. The music adds another appealing layer to the engrossing film."
    },
    {
      "rating": "6",
      "text": "A russian young girl that trained to be a ballet dancer wich was her purpose in life, which made her special at that time, but after a injury her carreer is over and impossibility she to dance again. Then in order to help she and her mom to have a decent life, she got a invitation to get in a school to become a sparrow by her uncle, that school trained her to be a sparrow, agents that work for someone in favor of get information with the sensuality, approaching of targets using her body. Based on a book and directed by Francis Lawrence.The story of this movie goes in a slow rhythm, it does have a dark aspect and emotionless. I liked the tension that was in the story, and it made me believe that pretty much everyone was in dangerous, not exactly made care about them, but did me believe that anyone could go any time, by any stumbling. The core of the movie is very interesting, and the way that they explored it was very good, showing her training, and demonstrating how did she learn those things was very good. The big problem is that the movie tries to imply a confidence and assurance that really comes out of nowhere, things that happened to fast and didn't felt organic or natural, it felt rushed and even senseless, wich is curious considering that the movie have 150 minutes, that's a lot of time and still things felt out of palce, crucial things, a character that was supose to be rival with the other and just start to believe in the other out of nothing felt really wrong and took me out of the movie. The story goes in a way that during it a lot of things happens that doesn't make sense at all and feel dislocated, but at the very end it is explained and combined it does, wich i like. It does have some plot twists, and the movie kind of tried to make the viewer not to be sure if the character was in one side or other, wich i also liked.The acting wasn't a high point in this movie, even considering that the film was indeed with a purpose of emotionless, but i really don't buy it in every moment. Jennifer Lawrence character was the perfect example of emotionless, she didn't had much faces in this movie other than that poker face, she could show fear in some moments, but normally, in moments that she should pass me a woman that is looking to care of someone, in her eyes or voice tones, she didn't delievery this other part, just seemed to be a wall. Joel Edgerton also didn't had much expressions, but i could buy him caring about other characters, and his devotion into a purpose, it didn't convinced me 100% but it wasn't bad. Matthias Schoenaerts was kind of the older relative, that always had advice, he was a little threatening and i believe that he did a good job. Charlotte Rampling, showed confidence and was certain about she was talking, i completely bought what she was talking, she did very well. Jeremy Irons doesn't have a lot of screen time, but the little he convinced me, he was cautious and it convinced me.The cinematography of the movie don't talk much to us and isn't the most pretty neither, but is worked in some moments and helped to creat this emotionless scenario. There are some moments that the character are explaining what they are going to do and are already showing the thing happening, that was very nice. The soundtrack isn't memorable and doesn't call much attention neither.The movie makes everybody talk english with a russian accent, sometimes that didn't worked out, it was like if they just forgot about it in some scenes. The movie also forgets some characters that they had. The movie have problems of continuity, it does have sequences that doesn't take nothing to nowhere, comes with some really uninteresting things, and that took me out of the movie sometimes as well. The character does not have layers, taking away one or two. There is the villain and there is the hero, and you needed to choose between them.The movie also in some moments have a nice mystery, it does have some sequences that are really entertaining, it does have some nice twists and tense moments, it does have a nice editing. The intensity of what happens is really high, it is brutal, it can be gore or even make you want to turn your head in some moments, it does have some triggers that keeped me interested in it, and have a nice ending connecting things that happened before, even if some are a little forced.This is a thriller of espionage that doesn't have much new, and have a bunch of flaws, but definely have some good things right there."
    },
    {
      "rating": "8",
      "text": "Jennifer Lawrence in the lead role in a Russian agent film. I have to say I liked the beginning and the end very much, it was sometimes disturbing, very exciting and also very brutal (especially when it comes to the torture). Actually, I have nothing to complain about except with Lawrence's mother, which I found a little weak.Lawrence had to give up her ballerina career and take the path of an agent who is supposed to get information primarily with her sexual stimuli (especially the training in school 4 was very extreme). So far, actually quite good, unfortunately the film lost me a bit in the middle part, there was hardly any tension for me and the whole thing was babbling to itself.As already mentioned at the beginning, the end is impressive again and the clasp succeeds (e.g. the glass). All in all, a film worth seeing for me 8/10 Sparrows."
    },
    {
      "rating": "10",
      "text": "++++++++++++×××××÷÷÷÷÷÷××××++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "8",
      "text": "A gripping and uncomfortable experience, this is a film exploring female power not to take lightly. Lawrence is utterly mesmerising, and the savagery she brings to the brutal action sequences, coupled with the cultivated vulnerability of her appearance is breathtaking. The pacing is slower than one might expect, though it quickens in the third act, but the true pleasure is to be gained from the twisted plot which truly keeps the audience guessing even in the final moments. There is a raw edge to this film, which makes the violence more visceral and disturbing than other recent genre pieces, resulting in a film which is more affecting than anticipated. 8.43/10"
    },
    {
      "rating": "8",
      "text": "I cannot believe what I've read in these bad reviews. \"Too difficult to watch\"... are you kidding me? That's like watching a horror film and saying \"It's too scary!\"."
    },
    {
      "rating": "8",
      "text": "Red Sparrow is what I'd expect from a good thriller: Watching this movie was an exciting experience and sometimes even borderline uncomfortable - in a good way though. The story evolved quite unexpectedly and the movie overall had good cinematic too it. One thing I didn't like at all was the \"Russian accent\" which seemed way too exaggerated and thus made it harder to focus on what's really important. Otherwise it's a movie I'd recommend."
    },
    {
      "rating": "7",
      "text": "Like many others, I didn't know much about the film prior to seeing it. I was expecting a female driven James Bond espionage movie, but to my pleasure what I got was something entirely different. Red Sparrow is not an action-packed spy movie, but that doesn't mean it shies away from intense and brutal scenes. The typical spy movie action that I'm referring to consists of chase scenes, drawn-out fight scenes, improbable stunts, and so on. This movie doesn't really possess any of those qualities. I know there was some controversy surrounding this movie. Some were upset and under the impression that it was politically charged, while others thought the movie was misrepresented through advertisements. The movie was unexpected, but not in a bad way. I think that for people that expected and looked forward to a typical spy thriller were let down. Also, I understand why some people thought the violence and nudity was gratuitous considering they were expecting something more appropriate. Personally, I didn't think the violence or nudity in this film was gratuitous by any means. But I am someone who sees a lot of films from a broad spectrum, so it's hard for me to be offended by what I'm seeing. As far as the actual film goes, it was good. There were definitely some problems with the film as far as character development goes. You have a hard time really understanding the protagonist, whether that's by design or not is unknown. The relationship between Jennifer Lawrence's character and Joel Egerton's character will create a lot of questions; it doesn't seem natural, and the chemistry just wasn't there. The twist at the end is pretty good though, and was definitely the best part of the film. Well, that and Jennifer Lawrence's amazing acting yet again. I would recommend seeing this film."
    },
    {
      "rating": "8",
      "text": "Do not listen to the critics. For me, this film was better than Atomic Bomb. It's a thriller,   with no kick ass action, violent, sexual, and brutal. Lawrence delivers a good performance as usual. I was impressed with the supporting cast as well. The twist at the end was fantastic.  It's not perfect, but it's enjoyable if you like spy films."
    },
    {
      "rating": "9",
      "text": "Her fake accent did not bother me at all.She did it very subtle and believable.The plot was alright. Entertaining movie."
    },
    {
      "rating": "8",
      "text": "Please do not assume based on these reviews that claim this is a bad film. It's not. It's frankly disappointing to see a movie like this being given such poor marks, especially from audience members. The main complaints seem to be that the film is slow, boring, and poorly written. Those who are voicing these complaints probably worship Marvel films and need a gratuitous action sequence every 3 seconds. On the contrary, the character development of Red Sparrow is spot on. The film is gorgeously shot. James Newton Howard's score adds tension in just the right areas. The action scenes are spread out, making the film more dialogue-centric; but that's what makes it so gripping. Those with small attention spans should wait for the next Mission Impossible or Thor sequel 32... while others should go and appreciate the true slow-burn thriller that Red Sparrow has to offer."
    },
    {
      "rating": "8",
      "text": "No idea what some of these critics are smokin' because I had a lot of fun with this film.  Sure, a couple of the sequences and transitions were rushed, but 6 red scores for this movie?  Nah.  Well made."
    },
    {
      "rating": "9",
      "text": "Director Francis Lawrence, DP Jo Willems and composer James Newton Howard are at the top of their game in this; I applaud them for never holding any punches. This is an unapologetic brutal film, a rare find for a big release nowadays. I felt a very Fincher-esque vibe with this, and I think that was the intention.If you enjoy a slow burn, old-fashioned spy thriller; this is a must-see."
    }
  ],
  "recommendations": [
    "eastern_promises",
    "a_history_of_violence",
    "hanna",
    "brimstone",
    "a_perfect_getaway",
    "dragged_across_concrete",
    "miami_vice",
    "a_walk_among_the_tombstones",
    "the_november_man",
    "gone_girl",
    "drive",
    "taken",
    "sicario_day_of_the_soldado",
    "bad_times_at_the_el_royale",
    "the_equalizer_2",
    "man_on_a_ledge",
    "jolt",
    "terminal",
    "guns_akimbo",
    "the_counselor",
    "haywire",
    "tenet",
    "big_game",
    "savages",
    "the_loft"
  ]
}