{
  "id": 3347,
  "title": "Red Heat",
  "starring": [
    "Arnold Schwarzenegger",
    "Jim Belushi"
  ],
  "runtime": 104,
  "genre": [
    "Action",
    "Crime"
  ],
  "description": "A tough Russian policeman is forced to partner up with a cocky Chicago police detective when he is sent to Chicago to apprehend a Georgian drug lord who killed his partner and fled the country.",
  "releaseYear": "1988",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AoJTHXmO01EZgT0p1YTsGBEQxLj.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 3.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.75,
    "action": 3.4
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Schwarzy après les Terminator, Commando (et Predator !) est clairement sur la pente ascendante dans les années 80 et cherche déjà à se diversifier pour le meilleur et pour le pire, essayant de s'affranchir quelque peu du gros film d'action qui tache et défouraille à tout berzingue...Ainsi, ce film au ton nettement plus léger, ce film de \"potes\" à la 48h dont Walter Hill a le secret (et la recette plus ou moins -a-variée), ce \"Red Heat\" en version originale, comédie d'action surfant sur les clichés de la Russie en pleine perestroïka, une Russie qui laisse encore s'interroger les Amerloques à propos des Russkofs : \"ce sont encore des enfoirés de Rouges mais ils commencent à devenir sympas puisqu'ils ne sont plus des enfoirnazes de communistes\".Le film joue donc sur les contrastes et les exploite autant que faire se peut avec le joyeux James Belushi toujours à tenter de dérider notre Terminator soviétique aussi inexpressif que possible mais aussi têtu et borné qu'une borne kilométrique de 1943 à Stalingrad. Notre Soviet pas suprême s'adapte néanmoins avec rapidité au monde capitaliste lors de la traque du méchant trafiquant de drogue russe exilé à Chicago et en cheville avec une bande de crânes d'oeuf noirs !Qu'importe, l'espèce d'histoire se laisse oublier tandis que Belushi dit des gros mots et que Schwarzynatoff ne remue pas une oreille mais joue du flingue avec application. On ne s'ennuie pas dans Double Détente, on sourit de temps en temps -peut-être- à quelques vannes et on apprécie la mise en scène sans fioritures...Cependant, rien à faire, Schwarzy est coincé et ridicule et Belushi est beauf parmi les beaufs ! ça en devient gênant parfois... Heureusement, la superbe musique de James Horner à la fois opportuniste ( ce thème kremlinesque !) et fidèle à elle-même reste toujours aussi efficace, dans la même veine que celle de... Commando !"
    },
    {
      "rating": "10",
      "text": "Just rewatched it on Netflix and wow, what an amazing and ageless film.  Loved it back in the 80's and love it even more today.  Awesome lines, Belushi and Arnold are brilliant, great chemistry.  Acting by all is really fantastic and convincing.  Red Heat easily earns a spot among my favorite Arnold films including T1, T2, and Predator."
    },
    {
      "rating": "4",
      "text": "Um decepcionante filme de Schwarzenegger,um filme de ação fraco sem piadas boas,ainda conta com uma história fraca executadamente sem sucesso sem boas cenas de ação"
    },
    {
      "rating": "10",
      "text": "This movie is absolutely great.Arnold Schwarzenegger fits the role fantastically and he really has some of great sentences in the film and it has funny scenes such as when that drunk hobo guy comes to Arnold and asks for money for parking and Arnold hits him and says \"hooligani\".This film is a very nice thriller with awesome and funny moments and cast is very good.James Belushi is a fantastic choice and without him this movie wouldn't be as near as good as it is.This is a classic!"
    },
    {
      "rating": "6",
      "text": "Uneasy blend of comedy and action, but it does entertain. Arnold Schwarzenegger is fair, James Belushi is much better and well cast. Some nice location scenery in Moscow and Chicago. The plot is a little far fetched, but then again, that's fairly routine for Schwarzenegger."
    },
    {
      "rating": "5",
      "text": "I absolutely love Walter Hill and 80's Arnold, so this movie is a wonderful test of nostalgia vs reality.  It is corny, I read they worked a lot on 48 hrs to make the characters pop and here it feels like they tried to conform to the script.  I also read they brought John Milius in  for Hunt for Red October 1 year later to make the Russian dialog more authentic, that would have helped here.  The dialog in general is generic.  Arnold was too stilted, it felt like they wanted it to be funny but he was more human as a robot in Terminator. The long crawl for the key when there was no tension really showed a lack of direction.  The music also could have been more involved.   I like Belushi but his role is too corny, less would be more.  I rarely don't finish a movie, made it half way."
    },
    {
      "rating": "6",
      "text": "Red Heat. Soviet Terminator. A little boring, but a funny film from the era of warming relations between the USA and the USSR. Arnold played a more human killer machine, and James Belushi added to the comedy of everything that happened. It remains to say only one thing: - Какьие Вашьи доказателства?!"
    },
    {
      "rating": "5",
      "text": "This is very much a stereotyped action thriller film of the late 1980s. The mock Russian accents are cringe-y, to say the least. Its a fairly entertaining watch otherwise I suppose although not exactly chock-full of substance, I think its fair to say.Watching Art Ridzik,(the wise guy cop played by Jim Belushi) get annoyed with Ivan Danko, played by Arnold Schwarzenegger, was amusing. I also spotted Peter Boyle, i.e. the dad from Everybody Loves Raymond and a young(ish) pre-Matrix Laurence Fishburne. This is an alright, if unsurprisingly by the book, action thriller that may be of interest if it sounds any good but I don't know I'd especially go far out of your way to watch it."
    },
    {
      "rating": "2",
      "text": "Red Heat is a 1988 mindless action thriller that stars Arnold Schwarzenegger.. After a druglord kills Schwarzenegger's buddy cop Russian friend and escapes to America he must also go to America to bring the druglord (Rosta) in. When in America Schwarzenegger who plays Russian cop Ivan Danko teams up with joker, clown and a wisecracking cop (James Belushi) to find the druglord and killer. That's pretty much the story and plot because the rest is just blood, mindless shootouts, bus chases and violence and Gina Gershon turning up dead. Arnie plays this giant, musclebounded cop with no personality at all and is boring and at least Belushi is funny at times and has a sense of humour but even with the humour elements and James Belushi's hilarious acting abilities I think Arnold Schwarzenegger's horrible acting and boring presence onscreen and the depressing villains make this action film very borderline boring and uninteresting even with all the violence and action. The whole film feels depressing to be honest and mostly horrible."
    },
    {
      "rating": "3",
      "text": "Red Heat is a 1988 action thriller film directed by 48 Hrs director, Walter Hill.... You can see some of his trademark elements from Another 48 Hrs in Red Heat, Ed O'Ross is in it and the basic feel and horrible look of Red Heat and the shootout scenes... Arnold Schwarzenegger, James Belushi, Laurence Fishburne, Gina Gershon also star with Ed O'Ross in Red Heat and there's lots of violence, blood, shootouts, chases and bad language in Red Heat and some nudity. One chase I believe involves a stolen bus and there's some humour elements mixed in with the bad language and the chemistry between Arnold Schwarzenegger and James Belushi I think works well but this can't be said about the rest of the cast because it's plain horrible. Schwarzenegger plays Russian cop Ivan Danko and after his Russian cop buddy is gunned down Danko flees to Chicago to bring the killer and druglord in and is teamed with another cop to capture him (Belushi)... James Belushi is a funny guy in Red Heat and decent cop however even with the blood, violence and shootings in the film Red Heat feels very horrible and a mess in a bad way. It feels depressing and gloomy all the way until the end and some of the acting is laughable so this must be one of Schwarzenegger's worst movies for me along with Total Recall, True Lies, The Sixth Day and a few others... Avoid Red Heat because it's a horrible film."
    }
  ]
}