{
  "id": 3518,
  "title": "Reign of Fire",
  "starring": [
    "Christian Bale",
    "Matthew McConaughey"
  ],
  "runtime": 101,
  "genre": [
    "Adventure",
    "Action",
    "Fantasy"
  ],
  "description": "In post-apocalyptic England, an American volunteer and a British survivor team up to fight off a brood of fire-breathing dragons seeking to return to global dominance after centuries of rest underground. The Brit -- leading a clan of survivors to hunt down the King of the Dragons -- has much at stake: His mother was killed by a dragon, but his love is still alive.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vZVXCj3jXzIPJUHLaQohzt2uTM3.jpg",
  "categories": {
    "plot": 6.1875,
    "acting": 5.875,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 6.0,
    "funny": 3.6666666666666665,
    "action": 4.5
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Not the best movie ever... but mildly entertaining. The characters are somewhat likable and the story was predictable but decent. PS Aron, your not cool and couldn't write a review worth reading to save your life... regardless of what Mindy might think."
    },
    {
      "rating": "7",
      "text": "A stupid ending, with laughable dialogue and Matthew McConaughey looking and acting like something out of GI joe and yet I was never bored and found it quite entertaining. I'm a bit annoyed though because it's never as epic or explosive as it should be and never as heartfelt as it wants to be. The cover and posters are misleading"
    },
    {
      "rating": "5",
      "text": "Heartbreakingly mediocre for such a list of good ideas."
    },
    {
      "rating": "10",
      "text": "I love this movie, its great. Don't know why it received such bad reviews, after all, its fantasy."
    },
    {
      "rating": "8",
      "text": "Best epic of the year! I was at the edge of my seat throughout the whole movie. The only problem is that the story needs some work."
    },
    {
      "rating": "8",
      "text": "Good, enjoyable rubbish!"
    },
    {
      "rating": "2",
      "text": "One of the worst fantasy films ever made, which is disappointing considering its lively cast. Even more hilarious considering Christian Bale thought a sequel could be forged from the disaster fire which is this film."
    },
    {
      "rating": "7",
      "text": "Far from the classics that were also released in 2002 such as Signs and Spider-Man, yet good silly entertainment none-the-less. Don't expect much more, though."
    },
    {
      "rating": "6",
      "text": "Reign of Fire is a fun monster movie. The effects are mostly good and it has some decent action scenes. Reign of Fire also drags a scenery chewing performance out of Mathew McConaughey: \"You go ahead and have your little soiree. Personally, you people make me sick!\""
    },
    {
      "rating": "6",
      "text": "It is a movie that I want to praise and scold at the same time. It has unique ideas, a good cast of characters and an interesting fresh setting. But on the negative side some parts of the story are unbelievable or outright ridiculous, you will often feel that they could have gotten more out of the setting / concept and it is strangely fast forgotten. For the setting / story: During an underground construction in London workers awaken a slumbering dragon from hibernation. This leads to the awakening of countless other dragons that over the years destroyed the civilization and driven humans nearly to extinction. It is the story of Quinn who was a child when the events started and is now a leader of a group of humans who hide in an old castle and a group of soldiers lead by Denton van Zen who still tries to exterminate the dragons. Rest would be spoilers so I will end it here. The setting is refreshing and it is a post-apocalyptic Mad Max style setting with dragons. Just awesome. Then there are the characters. Quinn and Denton are the main characters and do a good job. They are polar opposites and have a good chemistry. The rest of the cast does also a good job. The CGI are excellent here. The dragons look great and menacing. Also the sets and visual give a great representation of a post apocalyptic scenario. You get the feeling of a grim and scary world where (nearly) all hope is lost. So far so good but there are negative points. Like I said the story is unbelievable even for a fantasy setting. Dragons are strong, menacing and scary but are no match for modern weapons. In Fables they have a similar discussion and came to the conclusion that no dragon is even a challenge to a fighter jet and only as an unrelated to this movie side-note that a man armed with a machine gun outperforms a wizard with twenty years of training (A sharpshooter can also eliminate any wizards with ease). Can you imagine even ten thousands or hundred thousand of dragons standing a chance against the combined military forces of the world? If mankind perfected anything in their history it is the art of war and killing. I also did not even point out nuclear, chemical or biological weapons that will diffidently be used. Yes there would be human causalities probably in the millions but even when the nations will not work together they will exterminate the dragons fast. Maybe with some left alive in unpopulated areas and zoos. Then there is the observation that is plot relevant and I cant spoil. The chance that this got overlooked is smaller than a snowballs chance in hell. Also I think stories placed at an earlier time of events could be far superior. For example during the beginning where the existence of dragons would be denied being a pipe dreams, when the battle against dragons started or the final stages of the war. I think I have said enough. Overall this movie has refreshing ideas and is worth watching. However it is fast forgotten as I have not heard anyone in many years heard talking or mentioning this movie. With a bit of more creative writing and minor improvements this could easily become a classic."
    },
    {
      "rating": "9",
      "text": "This was the first movie that 'opened' my mind new ideas, mixing Mythology with post-devastation Sci Fi. But also, strong concepts as survival, friendship and especially how a religion starts from a real necessity of indoctrination when there is no universal education, or how technology can beat giant monsters (usually represented invulnerable, from heavy tanks to nuclear bombs, removing the small trail of credibility that fantasy need). I was a child and didn't think about these things, just started to renew my stories with that trail of realism I experimented for first time here."
    },
    {
      "rating": "7",
      "text": "I like this film very much! I first saw him as a child. Very good atmosphere of post-apocalypse in film, good actors and unusual villains - dragons. However film is short. For all time was killed only two dragons - not enough action, In addition dragons are rarely seen in film. Very weak and sometimes stupid story... But despite this, I think this film is very good. Even today it looks good, but the film was created in 2002!"
    },
    {
      "rating": "4",
      "text": "This film is a mix of action, adventure and fantasy - probably primarily fantasy, genre wise and it features themes including survival, fighting and militia. It starts off resembling almost a family film, with a young boy striding along in a construction site but within a few minutes it quite clearly turns much more dark and bleak in tone and otherwise. The main character, Quinn, is played by Christian Bale, so in a way you could argue that was the first clue that it'd be a somewhat dark film, as Bale does tend to appear in rather sombre/dark films.It has a somewhat medieval dystopian feel of sorts, which is a little bizarre given its a film set in the future but the outpost depicted has to rely on candlelight and the adults are shown (early on in the film) attempting to provide basic entertainment for the younger members, so it made me think of that. It has quite a chilling feel to it as the pace quickens, while we see that something is clearly not right and we're left to try and figure out whats going on, not long off the start of the film. I did think it had somewhat of a feel of a feature length TV show about it - I'm not sure what the budget was but it seemed mildly under-whelming somehow. It made me think of other fantasy based shows shown at the weekend, such as Robin Hood or The Three Musketeers. I felt the obviously dark lighting was frustrating, as I found myself struggling to entirely follow what was happening, with large jets of fire appearing in different places and people running, desperately attempting to get out of harms way, while violins etc. played furiously. I thought it made me feel slightly claustrophobic - its not necessarily a bad thing to convey the sense of fear and panic in characters depicted on screen but there does come a point in which its little other than frustrating, or mildly annoying, when you feel your guessing what things are where, where specific people are and so on.Cast wise, as I say Christian Bale plays the main character, that of Quinn. He comes across as quite strong and ready to fight, a rebellious warrior type, which is the sort of role that he's known for I think. Meanwhile, Matthew McConaughey plays Denton Van Zan, one of the less-than-admired Americans. Other cast members include Gerard Butler as Creedy - a typically Scottish man, (not afraid to say how he feels - I quite liked him) and Izabella Scorupco as Alex Jensen.There is the ocassional witty line present in the dialogue, although nothing especially laugh out loud funny but the ocassional amusing line, which surprised me as I didn't really expect to hear anything in the region of comedy in such an otherwise quite serious style of film (what can be more serious than a large number of fire breathing dragons terrorising earth?!).Music wise, I felt this film was a bit cliched - its pretty much what you would expect from a TV show broadcast on Saturday (or maybe Sunday) evenings i.e. an unoriginal classical score, trying to add tension and make the viewer more concerned about what may be to happen but it didn't feel quite right to me. It felt a bit too forced somehow - I'm not sure I can explain how but it did.Content wise, there is some moderately strong language used and it features some moments featuring topless men (although some may feel that to be a plus side - esp. if your a fan of Christian Bale!), there's moderate violence, including nothing particularly graphic but the threat of violence is relatively real and there are obviously numerous scenes with sudden fires appearing and people attempting to avoid a burning. There are one or two slightly intense fight scenes above this and of course younger viewers (young children) may find the CGI dragons themselves to be quite frightening but otherwise it didn't seem especially likely to offend. Due to this, it was given a 12 rating.The CGI was alright but not as good as I've seen in other films.  I did think the film was somewhat suspenseful, although I can't say I felt especially emotional, or otherwise greatly bothered, by any of the characters as such. It didn't hit the mark for me but I imagine that if your seriously keen on fantasy films and dragon based films then you may find it more suspenseful and perhaps a slightly more gripping watch than I felt it was. For me it was ok but not much more, hence my rating.I don't think I'd recommend this film as such, as it didn't feel (to me) to be particularly impressive or memorable as such. I suppose im not the biggest fan of fantasy films but I do appreciate a well made film, I'd like to think regardless of the genre and I just felt this didn't quite make the mark. It isn't awful, it has some good qualities, such as its quite suspenseful and features some witty dialogue at times but it felt a bit too cliched for my personal liking and it certainly didn't seem memorable to me, hence why I'm not going to recommend it."
    },
    {
      "rating": "10",
      "text": "This movie is one of the early distopian world movies before Divergent, Zombieland, Maze Runner, the Hunger Games and many more. The cast is none other than the triple threat Christian Bale, Matthew McConaughey, and Gerard Butler who all are survivors in a dragonic hell. It is apparent that dragons weren't just some myth or story passed down from sightings of a prehistoric reptile, in fact the creatures were just slumbering miles below our feet in massive cave systems waiting to be introduced to a new feeding ground. Their low light environment they evolved from makes them excellent hunters during the night and their extreme environments made their scales hard as armor, they make quick work of the oblivious world above defenses and leave very few survivors. A group of american survivors armed to the teeth with military grade equipment and rambo like skills are hunting the alpha in a last attempt to save the world.  My personal opinion is this movie was way underrated, if this movie was given a REAL chance at a sequel or even a show it would do well."
    }
  ],
  "recommendations": [
    "mortal_engines",
    "captive_state",
    "battle_los_angeles",
    "the_girl_with_all_the_gifts",
    "300_rise_of_an_empire",
    "pacific_rim",
    "they_live",
    "the_matrix_reloaded",
    "sunshine",
    "stargate",
    "surrogates",
    "what_happened_to_monday",
    "annihilation",
    "chaos_walking",
    "riddick",
    "elysium",
    "the_purge_election_year",
    "independence_day",
    "the_matrix_revolutions",
    "the_13th_warrior",
    "abraham_lincoln_vampire_hunter",
    "x_men_apocalypse",
    "hellboy_ii_the_golden_army",
    "constantine",
    "arrival"
  ]
}