{"id": 3504, "title": "Reign of the Supermen", "starring": ["Jerry O'Connell", "Rebecca Romijn"], "runtime": 87, "genre": ["Science Fiction", "Animation", "Action"], "description": "In the wake of The Death of Supermen, the world is still mourning the loss of the Man of Steel following his fatal battle with the monster Doomsday. However, no sooner as his body been laid to rest than do four new bearers of the Superman shield come forward to take on the mantle. The Last Son of Krypton, Superboy, Steel, and the Cyborg Superman all attempt to fill the vacuum left by the world's greatest champion. Meanwhile, Superman's death has also signaled to the universe that Earth is vulnerable. Can these new Supermen and the rest of the heroes prove them wrong?", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/e9TzqscNRUaG8HqEP3K1jUvi8pC.jpg", "categories": {"plot": 5.555555555555555, "acting": 4.75, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.0, "action": 6.0}, "reviews": [{"rating": "7", "text": "Though better than \"The Death of Superman\", there are quite a few script flaws and some lack of character development that might have made this film better. Overall though, it is enjoyable."}, {"rating": "6", "text": "+Great plot+Some great action sequences-Writing feels average-Production value is averageI had fun watching Reign of the supermen, although it isn't the strongest DC animation I've seen, its definitely worth your time if you're a fan of DC/superman."}, {"rating": "5", "text": "Mediano. Nao empolga em nenhum momento. A DC já teve animaçoes melhores. Vale a pena se nao tiver outra melhor para assistir!"}, {"rating": "6", "text": "This made-for-DVD animated video is the conclusion to the previous The Death of Superman and follows the rise of four Supermen after the demise of the original, including a cyborg who claims to be him. What results is a film that is reeeeaaalllyyy hit-and-miss.On the plus side: There is some very nice character work. This is really Lois Lane's film as she compellingly both deals with grief and investigates the new Supermen. Liked the heroes Steel, a decent every-guy, and Superboy. They go with the classic nineties shades and leather jacket Superboy, and oh how I've missed him, constantly trying to show off and being a self-appointed ladies man.No complaints about the fight scenes here. There is also a visually unique method to create a portal device that I applaud the writers for.A couple of funny lines in this as well.On the negative side: The film suffers from trying to fit the four Supermen, who had multiple issues to develop themselves in the original comics, into 87 minutes. Steel and Eradicator, especially the latter, get the short shrift in the plot department.I wish they hadn't set this in the animated DC film universe. With the little amount of time available, it felt the use of preexisting elements and teasing developments for later ones pulled focus.Waaaaayyyy too much time is spent on Lex Luthor, who really just had a minimal role in the original comic story line. To make matters worse, the character is basically a check-off list of predictable Lex Luthor storyline tropes. You could make a drinking game out of it. I felt Rainn Wilson to be one of the weakest Luthor performers.The whole plot does reek of poor planning altogether, Mercy Graves, who served as someone for Lex to talk to in The Death of Superman (and to be honest they didn't really need her as he has another lackey) is waylaid very early in the film as it's clear they didn't know what to do with her.For a movie that is about the hope and goodness that Superman represents, there are a couple moments in the movie that are way more dark than they need to be. They feel unearned and took me out of the film. There is one scene at the very end after the big cliimax, which was just uber nihilistic.The animation is okay in this but not the best.Overall, I guess I liked this more than I didn't, but it's not a movie I'm planning to revisit."}, {"rating": "5", "text": "Chafa la historia, solo el super boy y el superman de gafas son los mejores. Lo que hacen con la liga de la justicia es lo peor, son una bola de pendejos, y batman lo unico q hace es ver por binoculares."}, {"rating": "7", "text": "Though not as emotionally resonant as its predecessor, this sequel succeeds through its compelling mystery elements, a strong protagonist and high-impact action."}, {"rating": "4", "text": "La es la secuela de la muerte de Superman, donde vimos como es asesinado por Doomsday, la idea de tener varios supermanes la he visto desde los videojuegos de Snes, y he leído que como otras películas está basada en los cómics, hay varios supermanes que son presentados solo superficialmente , y se enfocan en Superboy que resultó ser el hijoQue resultó ser el hijo de Superman y Lex Luthor, bueno exactamente no es el hijo de ambos pero tiene los genes, Lex Luthor dentro de sus investigaciones creo clones de superman, varios de ellos fueron inestables por lo que los desecho, pero Superboy fue uno de losas estables , apareció otro Superman con la apariencia robótica llamado Acero, y otro que resultó ser un holograma , que se encargaba de proteger a Superman, que era parte del sistema tecnológico con el que contaba Kal el, (Verdadero nombre de Klarl Ken).Me recordó mi infancia ver diferentes tipos de Superman , en Sudamerica , recuerdo haber tenido muñecos de estos personajes , al final vilo que supean revivió con un traje negro, barba y pelo largo lo que lo hizo verse más rudo.Buena película, aunque me hubiera gustado ver a un Superman, con esa misma apariencia de rudo. Saludos a todo yo le doy 4."}, {"rating": "7", "text": "Although this is no where near as good as death of superman, its still a good movie. Amazing story and plot."}, {"rating": "0", "text": "The fist part was great...This one is very boring and have too many characters"}], "recommendations": ["superman_returns", "the_dark_knight_rises", "superman_iii", "fantastic_beasts_the_crimes_of_grindelwald", "spectre", "star_wars_episode_i_the_phantom_menace", "back_to_the_future_part_iii", "creed_ii", "quantum_of_solace", "fantastic_beasts_and_where_to_find_them", "batman_the_killing_joke", "star_trek_into_darkness", "fantastic_four_rise_of_the_silver_surfer", "toy_story_4", "terminator_3_rise_of_the_machines", "pirates_of_the_caribbean_dead_men_tell_no_tales", "star_trek_nemesis", "bumblebee", "how_to_train_your_dragon_the_hidden_world", "star_wars_episode_ii_attack_of_the_clones", "the_bourne_legacy", "harry_potter_and_the_chamber_of_secrets", "the_karate_kid_part_iii", "avengers_age_of_ultron", "sin_city_a_dame_to_kill_for"]}