{
  "id": 3348,
  "title": "Remember the Titans",
  "starring": [
    "Denzel Washington",
    "Will Patton"
  ],
  "runtime": 113,
  "genre": [
    "Drama"
  ],
  "description": "After leading his football team to 15 winning seasons, coach Bill Yoast is demoted and replaced by Herman Boone – tough, opinionated and as different from the beloved Yoast as he could be. The two men learn to overcome their differences and turn a group of hostile young men into champions.",
  "releaseYear": "2000",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/825ohvC4wZ3gCuncCaqkWeQnK8h.jpg",
  "categories": {
    "plot": 8.363636363636363,
    "acting": 8.545454545454545,
    "ending": 7.0,
    "soundtrack": 10.0,
    "cinematography": 8.0,
    "familyFriendly": 5.0,
    "funny": 10.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I think you should ignore the critics on this one. This is definitely one of my favorite movies! I can watch this movie over and over again. The story is absolutely great! Personally I like football a lot, which makes this movie even more appealing to me. And the fact that it's all based on actual events from 1971, makes this movie to what it is; a masterpiece! A must-see!!"
    },
    {
      "rating": "10",
      "text": "I'm sick of all these snooty uptight movie critics that can't recognise a movie masterpiece, and bad mouthing such an amazing movie. Not only are there strong emotional content but there are also the necessary kick butt football scenes!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "Ignore the Metascore critics and pay attention to the user score critics for this film. Remember the Titan(2000) is an amazing and well made film with great humor and lesson about race equality."
    },
    {
      "rating": "10",
      "text": "I hate critics this movie was one of the best movies ever made and shows a truly captivating experience. ive noticed that everyone should ignore critics and they should all be fired because they are obviously not human. This is a must see for families or anyone who isnt racist."
    },
    {
      "rating": "10",
      "text": "My Favorite Movie!  I taped it and I will play it even if I am not watching the whole movie, I love the soundtrack!  I graduated in '72.... I know the racial issue during this time... I am white and the school was integrated.  I was a cheerleader (one of three white girls and two  black girls).   I developed friendships with white and black.... and there were white schoolmates that Chastised me.  However my family (who I would never imagine at that age, were not prejudice ,,,hmmm)  my parents met my friends and it didn't matter their color, but they met them as a human being.  This is what this movie is about."
    },
    {
      "rating": "9",
      "text": "Another great movie about how sports can transcend issues beyond the field. I greatly enjoy movies like this and Remember the Titans has to be one of the best sports movies out there. The acting here is very well and you almost feel yourself getting emotional during the intense moments in this movie aside from Denzel Washington and Will Pattons great performances."
    },
    {
      "rating": "10",
      "text": "This movie is a sports classic. Its moral and sports parts go well hand in hand and make the movie what it is. It is not a Fellini-like piece but it is about as much as you could expect from a high class sports movie."
    },
    {
      "rating": "10",
      "text": "This is my all time favorite movie!! I hate football but this movie was a great one. Ryan Hurst was hotter than ever, and I watch this movie every night!! P.S. I am watching it right now."
    },
    {
      "rating": "10",
      "text": "I love this movie it is my all time favorite and I love to watch over and over again."
    },
    {
      "rating": "10",
      "text": "These critics are so stupid! I bet if the critics had to do it all over again they'd give it a much higher grade. Even We are Marshalls got a better rating than this! WTF!! I cried when I first saw this movie, the story was emotional and told from the heart. It's the only movie I never get tired of watching."
    },
    {
      "rating": "10",
      "text": "This is a fantastic movie that I enjoyed very much. I loved the era appropriate music and I remember the tension of those times as well. The story being true and my love of sports drove this on to the bank for me. The critics boorish and childish admonishments are clearly screwed along geo-political lines as the contrast between ACTUAL viewers and snotty reviewer prejudices could not be more clear here."
    },
    {
      "rating": "10",
      "text": "This movie was so good and touching. Who cares if it's inaccurate? It's a damn good movie."
    },
    {
      "rating": "7",
      "text": "just perfect."
    },
    {
      "rating": "7",
      "text": "RTT is a movie that tries to fit 2 things in one movie: Racial Desegregation and Titans football, but fails to do justice to either. The movie is an inspiring one as all sports movie tend to be, but if you are a tough nut to crack, you may start yawning at some places. It is quite predictable if you look at the movie objectively. There's the first half with all the good-for-nothing individuals, inspiration, motivation and boot camp training. Then there's the second half with the initial hardships, near losses, the inspired masterstroke and the big final win. But thanks to the racial undertone, the proceedings are dramatic enough to watch.The script is inconsistent that is it is too weak/lame at some points but very strong in other instances. Almost all energy has been put into making sure that everything looks right from the outside. Individual characterizations are poor and it shows in the actors' performance. Some scenes are written beautifully but some scenes fail to impress. The director Boaz Yakin too surprisingly sticks with the script and doesn't explore the many possible angles.Denzel Washington does an amazing job at the centre playing the insanely tough and bullish coach, Herman Boone. Will Patton who plays his calm deputy Bill Yoast is passive in the first half (thanks to the poor writing) but comes to the foreground and gives an acceptable performance as the movie progresses. Wood Harris and Ryan Hurst share a great chemistry and give believable combined performances playing leaders of the black and white bandwagon respectively.The football scenes are a treat to watch. Make sure you know the jargon and tactics of football because if you don't enjoy them, you are gonna miss half the fun. Everything from the warm ups, the handful play sequences, the individual player's sacrifice for the good of the tea and the exchange between the coaches. The choreographer (if its the right word) deserves a round of applause for his work. Watch it if you are a fan of Denzel Washington or if you want to discover the meaning of team spirit. Watch the movie expecting exactly whats present in it and you will be impressed and walk out completely satisfied. But if you randomly walk in hoping to see something a class apart from others, this one will be a bit of a disappointment. But all in all, the experience will be worth 'remembering'...well at least for sometime."
    },
    {
      "rating": "7",
      "text": "Really surprised the critics didn't like this one. I have seen this movie so many times i can practically recite the whole thing off the top of my head. One of my favorite sports movies ever."
    },
    {
      "rating": "8",
      "text": "This is such a good movie. It has so many characters and memprable scenes and it teaches a valuable lesson of working together no matter what ethnicity you are. Denzel Washington does a good job with his character. It's also cool to look back and focus on a young Ryan Gosling. I will \"remember the Titans\"."
    },
    {
      "rating": "8",
      "text": "The embodiment of excellent modern sports dramas, \"Remember The Titans\" is inspiring, compelling, and intelligent."
    },
    {
      "rating": "10",
      "text": "This film is incredible! One of the best I've ever seen! Truly inspirational with great performances all round and based on a real life story! A must see in my eyes!!! I can and have watched it a number of times."
    },
    {
      "rating": "9",
      "text": "Remember the Titans is an inspirational sports film about a football team in Virginia. The plot in this movie is great and everyone was absolutely great at acting. From Denzel Washington to the barely seen football players on the team. In my opinion, this is a good inspirational movie for everyone that I recommend you see."
    },
    {
      "rating": "7",
      "text": "A Disney story with a Disney ending. The movie tweaks a few details of the true story to make it pleasing for everyone watching. And that is exactly what it was, enjoyable to watch with great quotable speeches. But it was just too predictable and too \"soft\" for my taste but good insight to what it was like in those days. My final score is 71.8 out of 100."
    },
    {
      "rating": "10",
      "text": "Are the metacritics just ignorant or what? How does this movie not have  90metascore (atleast), This is one of the best movies ever made. I can watch this movie over and over again, without being bored. Simply, amazing."
    },
    {
      "rating": "10",
      "text": "When  first saw this, I knew what was going to happen and such, but it's how they get there, with an amazing emotional turn and fun, this is one of my favorite movies."
    },
    {
      "rating": "10",
      "text": "This is probably the best sports film I've ever seen. Just a great ensemble cast that grows more and more comfortable with each other as time goes on. Denzel Washington is not exactly but he seems to tone himself down because there are points in the film where he does not need to be the star of the show. All the members of the cast undergo some significant development in this movie and its a true inspiration."
    },
    {
      "rating": "7",
      "text": "I thought it was pretty good. The acting was very well done, they fit the characters well. The story was actually good, but slow. They made it to long in the middle, and to short of a beginning and end. I reccomend it though,"
    },
    {
      "rating": "6",
      "text": "A African American and cacausion coach must put aside there racial differences to coach one of the worse teams in their school. They soon become one of the hottest teams and best teams to ever play for the school. Until tragedy strikes. The saddest thing is this is a true story."
    },
    {
      "rating": "8",
      "text": "Disneys light racism in this football flick was on Denzels back. it really shines light on how different colors doesnt matter on the field, its all about heart, dedication, blood, sweat and tears. tough love humbles you and gets results."
    }
  ]
}