{
  "id": 551,
  "title": "Reminiscence",
  "starring": [
    "Hugh Jackman",
    "Rebecca Ferguson"
  ],
  "runtime": 116,
  "genre": [
    "Mystery",
    "Science Fiction"
  ],
  "description": "Nicolas Bannister, a rugged and solitary veteran living in a near-future Miami flooded by rising seas, is an expert in a dangerous occupation: he offers clients the chance to relive any memory they desire. His life changes when he meets a mysterious young woman named Mae. What begins as a simple matter of lost and found becomes a passionate love affair. But when a different client's memories implicate Mae in a series of violent crimes, Bannister must delve through the dark world of the past to uncover the truth about the woman he fell for.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/17siH6wJRQ2jZiqz9BWUhy1UtZ.jpg",
  "categories": {
    "plot": 5.621621621621622,
    "acting": 5.6,
    "ending": 6.0,
    "soundtrack": 5.5,
    "cinematography": 4.75,
    "familyFriendly": 6.0,
    "funny": 6.0,
    "action": 4.555555555555555
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Think of every cliché you can imagine in a film, and you'll still be very far. 'Reminiscence' is a cringe-fest. You probably heard of all the 'Chinatown' and 'Inception' comparisons, but this neo-noir attempt is absolutely boring and uninspiring. It reminded me of 'Gattaca', and made me appreciate it even more because this is just bad at so many levels. You'll stop caring about the plot halfway or before."
    },
    {
      "rating": "3",
      "text": "this movie really needed to focus more. It is all over the place. the world the tech the history just serves no purpose and it harms the film and pacing."
    },
    {
      "rating": "3",
      "text": "You got some good actors in this movie, but it doesn't help.The problem with this movie is the writing.The way the talk to each others,it just off.A sign that a movie probably is going to be bad is if the same person write and direct a movie."
    },
    {
      "rating": "6",
      "text": "Reminiscence is clearly an ironic title for this film which is a pastiche of past, better works of many films including Joy's own brother in law's, Chris Nolan; films that include Inception and the Prestige.  It evens mirrors and contains casts from Joy's other work, which was superior mind you: Westworld.  Despite its stellar leads, this is Lisa Joy's first effort as a Director and it shows. Sure, she has all the best support staffs: but the film feels like a very long TV movie, and a good fit on HBO Max but not the cinemas."
    },
    {
      "rating": "4",
      "text": "Terribly cheesy and corny. Highly unbelievable on multiple levels and pretty simplistic. Turned it off 45 minutes it, couldn't watch any more of it. A real waste of time."
    },
    {
      "rating": "6",
      "text": "Reminiscence is an uninteresting story that takes place in a highly interesting world. It's cinematography, visual ideas, score and cast performance are above average and are the reason I think this film is worth a single viewing. Story is king however, as the screenplay and dialogue leave much to be desired. Ironic that, for a movie about remembering things, this one will likely be forgotten."
    },
    {
      "rating": "5",
      "text": "Reminiscence has certainly a lot of ideas but lack focus. The story just setup too much stuff and maybe worst of all, try to tie them all together through a memory machine. Those ideas aren't bad at all, it's just that you can do a movie for each of them instead of cooking all those ingredients together. The actors are pretty good in the movie. The FX are impressive. The action is minimal. The best action is surely the hand fight in the end. The singing is great but the soundtrack isn't always with the scenes. I found the rhythm to be a bit slow. I give it 53%. I think Lisa Joy can definitively do better, but you see that she didn't exactly do a nice transition between Tv to movie."
    },
    {
      "rating": "4",
      "text": "From the masterminds behind HBO's Westworld comes this sad return to the action genre for Hugh Jackman.The mix that it was presenting, sounded pretty good and looked pretty good, but the mystery conjured up in this tale is actually really poor and mostly unattractive.I'll be honest, halfway through, I really stopped caring what the hell happened to Rebecca Ferguson's character, and it turned out even worse when it revealed how terribly simplistic her fate was.Reminiscence has all the structure and semblance of being a great science fiction blockbuster, even with its relatively modest budget, and if you only look at the facade.However in a cruel joke with its title, it's reminiscent of many other films, and ultimately the puzzle it asks us to put together is just very simplistic.And the intrigue delivered isn't enough to want to go all the way until the end.But hey, we got to see Hugh Jackman for the second time acting completely infatuated by seeing Rebecca Ferguson singing."
    },
    {
      "rating": "4",
      "text": "This is a boring movie. The best thing about it are the visuals of cities under siege by rising ocean waters. Other than that by the time you wake up they will fill you in on what happened with a sportscenter like highlight show for a climax. Not worth your time"
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)Lisa Joy's debut is an unsuccessful remake of \"Blade Runner\" threaded between \"Strange Days\" and \"Waterworld\": the score of Vangelis is missing, the charisma of the actors is missing, the emotion of that post-catastrophist atmosphere is missing. Which is explained by remembering that the director is the co-author of \"Westworld\" (the TV series) and, above all, that she produces together with her husband Jonathan Nolan. Therefore it is spelt \"Reminiscence\" but it is pronounced, once again, \"Memento\" with its convoluted reflections on the three temporal extensions and on love as catabasis and anabasis."
    },
    {
      "rating": "1",
      "text": "Laughably bad futuristic noir with Hugh Jackman wading through a flooded Miami and a muddled script to deliver one of the biggest turkeys of the year - 1 star for the bizarre sex scene involving Hugh splaying himself out on a chair in a wacky tribute to Flashdance."
    },
    {
      "rating": "2",
      "text": "A great cinematography to support a boring and cheesy story. The fight scenes are a big miss, not filmed properly but much more like a drama instead of dynamic moves and closer frames. The project is not bold enough and some risks should have been taken considering the futuristic semi-post apocalyptic context where the overall mood is too sanitized and proper. The bad guy character played by Daniel Wu is out of subject, limit hilarious, and should have been replaced by Sam Medina who has much more charisma and fits the part perfectly. Overall, we feel the Nolan family influence and understand a directing job and deal were given by relationship and political context of diversity and inclusion… which excludes prioritizing talent which is common mistake by studios nowadays. A huge budget for a deception at its level."
    },
    {
      "rating": "6",
      "text": "Is 'Reminiscence' good or bad? But I would rather go for a mixed review. Reminiscence is not bad at all but however it didn't went in a proper way as expected. The story revolves around Nick Bannister(Hugh Jackman), a private investigator who also helps in recovering his clients lost memories along with his friend Emily(Thandie Newton). He suddenly fells in love with one of his client Mae(Rebecca Ferguson). But one day she disappears and Nick begins to search for her which leads him into the criminal underworld of Miami where he uncovers an unknown truth about Mae which starts haunting him. The movie ended in an emotional bittersweet way where some might say it as happy while others will go for a sad one(I again vote for the mixed one) . The movie started off somewhat excellently engrossing us with it's concept of reminiscence but after some time it started to falter and became boring. But there are some nicely layed ideas from director Lisa Joy but failed to make it's mark due to poor execution of the movie. It is good to see Hugh Jackman after a long break and I should say he played his part very well. The acting was good and the dyastopian setting of a flooding Miami was awesome. But other than that there is nothing to it except for some good imaginations and ideas. Director Lisa Joy tried to come up with an interesting movie but somehow it failed to make an impression. However it's her debut directorial and in that way she had given her best efforts. So let's come to the question is 'Reminiscence' worth watching. It cannot be said as worth watching but anyway it can be seen as a simple weekend romantic thriller which we can just watch and forget."
    },
    {
      "rating": "7",
      "text": "Reminiscence is a Neo-noir film taking place when global warming has caused rising sea levels, socio-economic disparities have increased, and technology has been delivered for people to mentally re-live their past memories.If you enjoy the neo-noir genre, you should watch this film - even if it is not as good as it should have been.It is written, produced and directed by Lisa Joy who created Westworld with Jonathan Nolan.Lisa Joy is extremely creative - but, she doesn't have the broad skills to produce, cast and direct a complete project like this.  The casting is off, the writing needed work to better fit the actors and the directing was not effective.  And, I guess other things like editing and cinematography where good but were not excellent.If Lisa Joy wants to take a bigger role in producing her work, she should seek professionals who can help her.One last thing - Hugh Jackman is a good actor - but, I'm not a huge fan.  He did not quite fit the role just right.  Perhaps it was not entirely his fault.  Perhaps Lisa Joy got off on the wrong foot when Hugh Jackman was cast in the lead role.I'll add that I add just finished watching a very dark Nordic-noir detective series just before I watched PG-13 rated Reminiscence.  The stark difference between the two, especially with Hugh Jackman and his comic-book level charisma, made Reminiscence seem more of a teenager level material and less substantial and serious."
    },
    {
      "rating": "0",
      "text": "Really a terrible movie. No world building, underdeveloped/nonsensical  characters, amateurish direction - shot framing, terrible visual effects, claustrophobic universeand a linear, cliché, uninteresting plot"
    },
    {
      "rating": "3",
      "text": "Hugh Jackman is one of the best actors there is.  This movie is reminiscent of one that he shouldn't have made."
    },
    {
      "rating": "10",
      "text": "Reminiscence is kinda look like Steven Spielberg's Minority Report but it's a totally different story, Jackman's and Ferguson's chemistry and performance is incredible, though they're not even together in person so long, the chemistry is there and so strong, so we and me personally care about it, sad about it, worry about it, and angry about it, Reminiscence is sad and depressing yet it's a very solid film and simply one of the best films of the year."
    },
    {
      "rating": "2",
      "text": "Kept waiting for this to make sense and it never got there.  I’m all for twisty scenarios where, at the end, you go “ahhhh!!”  At the end of this, you go “huh?”   Glad I didn’t pay anything for this movie.  It would have been a waste of money. The only redeeming feature was seeing Hugh Jackman shirtless."
    },
    {
      "rating": "3",
      "text": "Right off the bat, I'm taken out of my suspension of disbelief. If I worked next to Thandie Newton every day, I wouldn't even notice Rsbecca Fergeson if she walked in butt naked. I just find her so very generic in every way. I think I might have found her compelling once (Dr. Sleep?), but now she's just meh. Might be her ridiculous take on Dune (she claims the script had to be doctored for 21st century audiences because obviously any male writer from the 60s is sexist, even though she admits to not only NOT reading it, but unable to understand the few pages she did. She laughingly admits to needing her male costars to explain it to her . LMAO, she needed mansplaining, ROFL). The rest is just a bland sci-fi noire that tries to be Eternal Sunshine of the Spotless Mind? Boring romance scenes over and over. I guess there's a warning g about climate change in there. It's a dud despite Jackman's likeability and Newtins sex appeal."
    },
    {
      "rating": "9",
      "text": "well done Hugh! one more great act. really enjoyed watching it, by the way don't pay attention to the negative scores, the movie's nice."
    },
    {
      "rating": "10",
      "text": "Reminisce... probably one of the best Movies that's like an Adaptation to a Game! Called The Sinking City..."
    },
    {
      "rating": "7",
      "text": "not sure where all the hate comes from. don’t compare this to other movies, take it for what it is. this is a fun sci-fi crime mystery movie. Rebecca Ferguson and hugh hackman had such good chemistry and the visuals were stunning in the film. the plot kept you hooked throughout. felt like the story couldn’t used a little refinement as there were some dull scenes i def would of cut. but overall solid watch  and would recommend to my friends"
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "0",
      "text": "disgusting disgusting disgusting disgusting disgusting disgusting disgusting disgusting disgusting disgusting disgusting disgusting disgusting disgusting disgusting disgusting"
    },
    {
      "rating": "4",
      "text": "Bad Bad Bad Bad Bad Bad Bad Bad Bad Bad Bad Bad Bad Bad Bad Ba Bad Bad Bad Bad! Reminiscence..."
    },
    {
      "rating": "6",
      "text": "Hugh Jackman plays a man who runs a facility that allows people to relive memories. A woman (Rebecca Ferguson) shows up as a customer, but ends up in a tangled love affair. Needless to say, this includes danger, murder and conspiracy. While it’s sufficiently interesting, the story or direction never grip the emotions or surprise expectations (and some of the tech fails logic). With the constant voiceover and a reality altered by a failing environment, the film harkens back to the original Blade Runner. The movie’s coolest feature is Miami’s partially submerged underwater world (the piano fight scene is the visual highlight). Overall, this is a rather pedestrian film noir that’s major asset is the CGI city."
    },
    {
      "rating": "7",
      "text": "A good try of a retrofuturistic noir movie, with an amazing cenography, complex history and touching ending."
    },
    {
      "rating": "6",
      "text": "A nice-enough blend of Minority Report, Inception, and Chinatown. You’ve seen better, you’ll see worse…"
    },
    {
      "rating": "3",
      "text": "My goodness. This is seriously weak sauce. I struggled to get through it, and ended up skipping quite a bit. Felt like someone using two hours to tell a really boring story."
    },
    {
      "rating": "4",
      "text": "It tries to be sentimental and fails completely. And why do memories produce a complete 3D scene from a third person perspective? Answer: plot convenience. I didn't buy any of it."
    },
    {
      "rating": "7",
      "text": "Superb cast and dialogue serve as an intriguing filler for a neo noir sandwich of sci fi gumshoe investigating the minds of its characters in an unlikely post global warming flooded Miami-come-venice backdrop. While it was very entertaining it never quite reached me enough to move me beyond the average needle. Good but not great. Intriguing but not wholly original."
    },
    {
      "rating": "6",
      "text": "It's truly disappointing when a film starts off with great potential but then squanders its viewer-earned goodwill as the story unfolds. So it is with director Lisa Joy's debut feature, a future noir offering that mixes sci-fi, romance and mystery in a blend that draws from films like \"Blade Runner,\" \"Brainstorm,\" \"Inception,\" \"Total Recall,\" \"Elysium\" and \"Deja Vu.\" In a war-ravaged, environmentally degraded version of Miami in which depressed residents escape their troubles by recalling cherished memories thanks to sophisticated mind-tapping technology, a former Navy interrogator who runs a business providing this service finds himself caught up in a steamy romance with a mysterious femme fatale who suddenly disappears without a trace. But, in his attempt to locate her, he unwittingly finds himself caught up in a web of drug trafficking and corruption, circumstances that he would have been better off leaving alone. It's when the film turns from stylish romance to crime saga that the picture starts getting bogged down in too many plot tangents, underdeveloped story threads and conventionality, all of which undermine what this release had going for it at the outset. To be sure, the romantic and sci-fi elements of this story generally work well, but the more conventional aspects of the story intrude far too much, taking away from the overall viability of the production. The filmmaker shows promise with this debut, but future projects call for better judgment when it comes to determining what works and what doesn't."
    },
    {
      "rating": "6",
      "text": "Hugh Jackman and Rebecca Ferguson have teamed up again to star in a neo-noir style sci-fi drama that is reminiscent of other movies like Strange Days, Inception and Blade Runner. Nick Bannister (Hugh Jackman) is a private investigator of the mind, navigating the alluring world of memories and nostalgia. His life changes forever when he meets a new client, Mae (Rebecca Ferguson). What begins as a simple case soon becomes an obsession for Nick after Mae suddenly disappears and he desperately tries to learn the truth and if she really was the woman he thought she was.It’s entertaining and enjoyable to watch in the moment. There might be a bit of a missed opportunity here as there is a lot going on and perhaps the most impressive thing about Reminiscence is the world building it has created. Set in a dystopian future where due to the devastating effects of global warming many parts of the city is either underwater or badly flooded. The city only opens up at night due to the extreme heat during the daytime, this very much adds to the neo-noir theme. The ultra-rich have built dams allowing them to live comfortably in the drylands, leaving the poorer members of society to live in the flooded remains of the city. There’s enough storylines here about class division and corrupt police to expand on but it’s limited to a two hour movie. I liked it but the main story does feel like something we’ve seen before. From a technical point of view Reminiscence is very impressive and clearly in the hands of a director (Lisa Joy) who knows what she’s doing. The fight scenes are well done and very clear, no shaky cam anywhere which is always a bonus. Also added to the cast are Thandiwe Newton and Cliff Curtis, both giving impressive performances. I’m not surprised to see Jackman and Ferguson appear again in another movie after their onscreen chemistry in The Greatest Showman. However, unlike The Greatest Showman Rebecca Ferguson actually has the chance to show off her impressive vocals in Reminiscence. The soundtrack is worth listening to, both for Ferguson’s seductive singing and Ramin Djawadi’s original score.I felt nostalgic watching Reminiscence, which considering the film’s topic is very appropriate. Recommended for the Hugh Jackman and Rebecca Ferguson fans."
    },
    {
      "rating": "7",
      "text": "It's a serious drama featuring a strong romance, and a mystery that sets our protagonist on a course with many twists and turns, but no aspect of that was needless and the movie makes use of it's many locals and characters. With all this, it's easy to believe that a plot point will not be resolved, but I found them all wrapped up well to my satisfaction.The scenery was also well done. The movie considers a near future where rising sea levels have overtaken coastal cities, but not to the point that people can't live in them. This is not a major story point, and instead, it simply provides an aesthetic to the movie. The sea is always present -- whether brushed up against buildings with their first floors submerged, or covering the local roads, but not enough to make them unusable. The sun reflects across these features beautifully in many scenes, and it provides an almost fantasy-like setting for the story to be told. I ultimately can't say I liked Reminiscence simply because it made me sad. But when I try to remove that feeling from my head and consider this movie on its own merits, I find that it was well done."
    },
    {
      "rating": "5",
      "text": "this film is Blade Runner meets Inception with a side of Dark City, Lisa Joy had some really good ideas, the the execution was ultimately a failure."
    },
    {
      "rating": "6",
      "text": "Do you remember the time when we fell in love? Do you remember the time that you first read Stream to Big Screen, girl! OH AYE! Sorry, I got caught up in my memories of that song. Anyway, this weekend a new movie premiered in theaters and on HBO Max, Reminiscence. Also known as The Jade Earring, Reminiscence is a mystery/thriller/love story that follows Hugh Jackman as Nick Bannister, a private investigator of the mind as he navigates the alluring world of the past when his life is changed by new client Mae. A simple case becomes an obsession after she disappears and he fights to learn the truth about her.I know what you're already thinking. An investigator of the mind?! Yes, it's reminiscent of an all time great, Inception. Is this a review within a review within a review? No. We are just talking about how Reminiscence has borrowed a storyline but with a strangely unoriginal while nicely executed story. And by nicely executed, I don't mean how slowly this movie unravels so obviously. I mean who doesn't love a who done it? The story unfolds in a way that you feel each character. I found myself either lusting after Mae (Rebecca Ferguson) or eagerly seeking answers like Hugh. One might say that was just the actors doing a really good job, which I won't deny. Let's not talk about how Thandie Newtown was grossly misused and underutilized. I also think it is a testament to how generally good the direction and the writing are. With that said, I feel like the movie could have been cut a bit to make it quicker and more hard hitting. Of course, there are times where we need to linger but there were definitely times where the movie held on too long to a part we don't really care about.The biggest misstep of this movie comes with the scenery though. Why in the heck did the world need to have water everywhere?! Honestly, this movie only had one cool scene in the water and the rest of the movie could've been dry. It sticks out like a sore thumb and quite frankly makes zero sense. Why does everyone have to have soggy socks and athlete's foot? Sorry, I may be looking at this too realistically but the water setting is the biggest why the heck was this necessary at the end of the movie. The other misstep of this movie is that while the twist and turns of the story are pretty good, the result is just so unsatisfying. I feel like there was no payoff at the end of the movie. The movie does give a nice, loving ending, but the chase for the Maltese falcon of who done it was just so... who cares.Reminiscence, at the end of the day, is a solid seductive toxic relationship with an okay who done it. The actors make the movie worth watching with their chemistry and delivery. Yet, at the end of the day, half of the movie seems completely unimportant. Reminiscence is a nice ride for a streaming movie, but I could see how a moviegoer would be disappointed. Streamers grab yourself a bowl while those of you loving the movie theaters again don't brave the Delta for this flick but run to HBO Max."
    },
    {
      "rating": "6",
      "text": "This film is not the next inception that the advertising made it seem. The film emphasis on the noir, investigative story than on the sci-fi premise. The world building is almost non existent. It could've been set in the near future and not much would have changed. Hugh Jackman acting is great as he gives so much exposition with a soothing voice (it's actually important to the movie). Give this one a try if you want to see a middle of the road sci-fi film."
    },
    {
      "rating": "5",
      "text": "cough cough - Strange Days & The Sinking City.Reminiscence - written by who excuse me?5 for Hugh he was trying as much as he could, cinematography colors FX and design was decent."
    },
    {
      "rating": "10",
      "text": "A good cocktail of \"The final cut\" and \"Inception\" with a small drop of \"Waterworld\"."
    },
    {
      "rating": "3",
      "text": "Boring... The most interesting part of this movie is the opening and ending."
    },
    {
      "rating": "7",
      "text": "Хороший фильм, но иногда диалоги очень затянуты. Концовку сильно растянули"
    },
    {
      "rating": "9",
      "text": "great movie about living our life again. acting is wonderfull wow. hugh jackman is great."
    },
    {
      "rating": "6",
      "text": "Reminiscence (2021) is a sci-fi noir thriller and is a directorial feature film debut of Lisa Joy, the co-creator of Westworld alongside her husband Jonathan Nolan. She also directed one of my favourite episodes from Season 2. It is set in a not-so-distant future Miami where the world has been subject to rising sea levels wreaking havoc. Memory tech is a craze where one can relive their cherished moments from the past and Hugh Jackman's character is running a business of it alongside his friend played by Thandiwe Newton. Things go awry when a customer, played by Rebecca Furgeson, goes missing and Hugh's character takes it upon himself to find her. I was curious to check this out and sadly it was disappointing.The movie is competently made for the most part i.e the sets, the production design, the CGI, sound effects and music, the pacing, the cinematography, the acting, are all executed well enough that you get the feeling of a proper good looking and sounding movie. It's in the writing and story department where it falters and drags the entire experience down from being a good or even great one to a middling one at best.The movie mixes in different ideas and concepts, none of them new, and while on their own they are cool, when blended together with the story you get, it doesn't work nearly as well as there is a lack of energy and urgency that you don't really get throughout. You are experiencing the story play out and it's kinda OK but it never goes beyond that.There is superficial depth to the themes and ideas where the movie thinks it is being deep and poignant but you don't really get that feeling. It's just sorta there. Not to mention the fact that the entire plot hinges on a romance that was hardly developed so you don't get that connection which should hook you.Take out the competency in other elements and high profile actors and this would be bad but since those things are present, it goes up a few notches, so props to Lisa Joy for that at least and hopefully her next outing will be better. Rebecca Furgeson's beauty alone kinda pushes it one point above for me not gonna lie, it is what it is. Simply put, it was just OK. Disappointed cause it could have been a lot more. Maybe if Jonathan Nolan was helping with the script, that would have been the case, who knows. Not recommended but hey, if you are curious, give it a shot. And if I were to rate it, I'd give it a 6/10."
    }
  ],
  "recommendations": [
    "bad_times_at_the_el_royale",
    "blackhat",
    "terminal",
    "the_invasion",
    "cube",
    "a_cure_for_wellness",
    "last_night_in_soho",
    "minority_report",
    "good_time",
    "inception",
    "sicario_day_of_the_soldado",
    "color_out_of_space",
    "what_happened_to_monday",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "valerian_and_the_city_of_a_thousand_planets",
    "broken_city",
    "coherence",
    "hugo",
    "the_conjuring_the_devil_made_me_do_it",
    "chaos_walking",
    "mortal_engines",
    "signs",
    "the_prestige",
    "10_cloverfield_lane",
    "the_beguiled"
  ]
}