{
  "id": 3592,
  "title": "Repo Men",
  "starring": [
    "Jude Law",
    "Forest Whitaker"
  ],
  "runtime": 111,
  "genre": [
    "Action",
    "Science Fiction",
    "Thriller",
    "Crime"
  ],
  "description": "In the future, medical technology has advanced to the point where people can buy artificial organs to extend their lives. But if they default on payments, an organization known as the Union sends agents to repossess the organs. Remy is one of the best agents in the business, but when he becomes the recipient of an artificial heart, he finds himself in the same dire straits as his many victims.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/briDKf5nrLzox2zcI6pquKeqWz8.jpg",
  "categories": {
    "plot": 6.142857142857143,
    "acting": 5.833333333333333,
    "ending": 5.9,
    "soundtrack": 3.0,
    "cinematography": 2.0,
    "familyFriendly": 3.0,
    "funny": 5.333333333333333,
    "action": 5.153846153846154
  },
  "reviews": [
    {
      "rating": "9",
      "text": "A movie that teaches one the value of credit. Great movie, though it's a little slow towards the middle which becomes understandable why later on. It is based off of the book Reposession Mambo (The same movie repo the genetic opera is based off of). It's not for the squeemish. I didn't find the gore anything excessive, but I have a super strong stomach. It's not a movie for everyone... But is quite enjoyable."
    },
    {
      "rating": "9",
      "text": "No where near as terrible as its being made out to be. Its a solid acton flick. There were scenes me and my friends couldn't stop talking about after we left. The switch ending was completely unnecessary, but overall, a much better film than I thought it would be. Gory - yes. Plot holes - yes. Worth seeing - Hell yea."
    },
    {
      "rating": "6",
      "text": "Remy(Jude Law) is no romantic; no Parisian/Montmarte poet dreaming about a comely courtesean named Satine, as he hunts and pecks at a manual typewriter. He's not writing \"Your Song\"; he's writing about your kidney, your liver, your heart. Remy is a repo man, a murderer. If this futuristic government organized a tribunal for the medical crimes perpetrated by these blue collar killers, both Remy and Jake(Forrest Whitaker), and others like them in \"The Union\", would no doubt utilize the Nuremberg Defense(the glee in which the repo men go about liquidating a ship seems very Nazi-like), since they were only following the directives from their boss Frank(Liev Schreiber). Unwilling to take his wife's advice about taking a new position in the company, Remy, nevertheless, becomes nearly human again after a near-death experience. While on a job(he shows up at the house of a composer who is late on a payment for his heart), Remy finally faces the music when an occupational accident leads to an organ outfitting of his own. With his humanity restored through addition by subtraction, the \"heartless\" repo man can no longer laugh at delinquent clients who \"Cry [Him] a River\" at collection time. As Remy hears this Etta James song a second time, performed by a lounge singer/prostitute(?) named Beth(Alice Braga), he receives the lyrics like poetry, without the veneer of his profession's cooptation back at the nightclub, where the credo \"a job is a job\" was uttered. During a routine sweep with Jake, the repo man uses his stun gun on a child, but he can't finish the job. Unlike Chan-wook Park's \"Boksuneun naui geot\"(\"Old Boy\" is not the only Park film that gets referenced), this young boy is spared the scalpel. Although \"Repo Men\" degenerates into pure spectacle near the end, it climaxes with a spectacular display of masochism, clearly, a loving homage to Korean film, in which Remy and Beth consumate their love(for each other and for humanity) through pain."
    },
    {
      "rating": "7",
      "text": "I saw Repo Men today. It was an entertaining film, that was extremely violent and had an interesting premise and story. The cast was good, but the predictability of the plot and the adrupt ending left something to be desired. Still, it was good. A 7.5/10."
    },
    {
      "rating": "3",
      "text": "Good first thirty minutes, but turns dull soon after. The setting is futuristic, but it seems like deja vu because you've seen the same futuristic city scape too many times before. The film is too dark, and the action is average. Oh yes, let's not forget about Jude Law. What can I say, a role that seemed to fit perfectly with the film, but the film didn't fit perfectly with him. If you have money to spare, see it. Although, you'll be forgetting about it soon after."
    },
    {
      "rating": "8",
      "text": "i watched the movie yesterday and it was pretty good!! and trust me i've seen a lot of movies in my life!! a lot of people are hating the movie because of the ending!!? grow up!!"
    },
    {
      "rating": "8",
      "text": "Don't let a bad critic rating stop you from seeing this movie, it was good from start to finish and was defiantly worth seeing. Very entertaining!"
    },
    {
      "rating": "3",
      "text": "Interesting premise wasted on a crappy movie."
    },
    {
      "rating": "3",
      "text": "Repo Men is one of the most gory and violent films you will see. If you're like me you will also need subtitles. Forest Whitaker mumbles through his lines and you can understand about half of what he says, while the other leads have English accents. Jude Law did the best he could with the cluncky diologue and shows promise as an action star, but this was not the right vehicle for his action debut. Worst of all, I hated the manipulative ending that I won't give away. I've seen worse, and this one does have a few good moments, but not enough."
    },
    {
      "rating": "10",
      "text": "I really enjoyed it, and even that strange bit near the end could make me hate it."
    },
    {
      "rating": "0",
      "text": "A bad movie in general, it doesn't help that the entire plot bases itself off of an overlooked cult classic (Repo! The Genetic Opera)."
    },
    {
      "rating": "2",
      "text": "What did I just waste m time watching? garbage!!!"
    },
    {
      "rating": "2",
      "text": "Wow. Talk about a complete waste of time. Crap."
    },
    {
      "rating": "2",
      "text": "Pornographic gore from excellent cast.  Why did they agree to do this?  Great premise wasted on hyperbolic direction.  We wish for the camera to cut away every time Jude Law thrusts his hands inside another living creature.  Save me from this nightmare."
    },
    {
      "rating": "4",
      "text": "A Film Review by: Sam Fragoso\"Repo Men\"**There were many good things in this movie but also alot of really bad scenes that kinda of ruin the movie in some ways. How ever there were some up sides like... Jude Law has a solid performance and the action in Repo Men was really new and inventive and I truly enjoyed seeing that. They didn't overdue the action which is probably a first in most movies, so thats what kept me interested. When it's all said and done the ending is pretty rediculous and you realize you wasted the last half hour (need to see movie in order to understand). Anyways it was a half way decent movie with solid performances and new action so with that alone I say \"Rent it\"."
    },
    {
      "rating": "2",
      "text": "It's shocking how this film was ruined so much by a pathetic excuse for an ending. It was a little slow at times but overall the film wasn't too bad, but to end it in such a sloppy way is just unforgivable. Change the ending and you have yourself an OK thriller."
    },
    {
      "rating": "6",
      "text": "Wildly uneven, with flashes of brilliance, this is a well acted, but conflicted story that ultimately collapses under the weight of unrealized potential. Droll, at times fetching, with over-the-top gore, it is film worth seeing, in spite of its shortcomings."
    },
    {
      "rating": "6",
      "text": "As the respectable critics note, _Brazil_ this movie ain't (nor up there even with _Repo Man_ [singular]). Still, _Repo Men_ is an interesting failure and scores some satiric hits. If it's got problems with structure and restraint, well, it is in the satiric mode, and satires tend to sprawl and have never been much into self-discipline, or respectability. At a time the US Congress takes a year and (as of this hour) still can't put together a bill to pay for US health care, there's much to be said for a nasty slicer/dicer dark comedy showing a terminally nasty corporation selling organs with usurious loans. _Repo Men_ deserves to become a cult classic."
    },
    {
      "rating": "4",
      "text": "This film is an uneven mix, starting off as a black comedy, shifts quickly out of funny territory and into stilted drama, and eventually finds itself stumbling into an action picture. The plot, which has been derided by some as a poorer, commercial version of the cult classic \"Repo! The Genetic Opera\" and dismissed by others as a barely more palatable version of the atrocious \"Repo! The Genetic Opera\" in fact bears almost no resemblance to the 2008 film. In fact, it owes much more to \"Logan's Run.\" If you saw that film, you've already seen this one, and seen it better done with more imagination. The main problem I had with the setup of this film is that there was no reason to believe that this would actually happen, that in an otherwise quite mundane world we'd allow people to kill each other on the streets for the price of their artificial organs. That wouldn't be a barrier if the film embraced it's early, satirical tone, but as it quickly attempts to take itself seriously, it becomes very hard to ignore the fact that the entire premise is utterly ridiculous. In the end, I can't make up my mind as to whether this picture is a poorly conceived critique of the health care system in the USA or an unnecessarily graphic action vehicle, but it doesn't ever quite work on either level."
    },
    {
      "rating": "6",
      "text": "Not nearly as bad as everyone made it out to be. The acting goes from inspired to forced. The same can be said for the plot. A good premise none the less, though."
    },
    {
      "rating": "4",
      "text": "Not a good movie, but an interesting ending. I was sad for the protagonist, but it would have been a ridiculous if everything just happened to go so well for him."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this film.  People seem to be taking this film far too seriously.  An interesting future concept which held together some unexpected action sequences.Take it with a pinch of salt and suspend your disbelief.  You might just like it."
    },
    {
      "rating": "10",
      "text": "They would have done a much better job then they did  on this.  They should have been repoing cars or other cool stuff.. not  body parts1.. come on that was wack  Jay"
    },
    {
      "rating": "0",
      "text": "The only good thing about this movie is its premise. OH WAIT Repo! The Genetic Opera got there first. The premise sure was original when Repo! first used it. I guess someone thought it would be a good idea to take all the music and enjoyment out of Repo! and replace it with failure."
    },
    {
      "rating": "7",
      "text": "Seen so many bad movies, this one doesn't reserve such bad critics, think most bad critics are because of its argued disregard for life maybe.Anyway, watchable movie and in its genre quite unique.>>7"
    },
    {
      "rating": "10",
      "text": "Very similar themes and twists to Logan's Run, Equilibrium, Minority Report (men carrying out morally questionable jobs discover the error of their ways). The excessive & needless blood-letting seems to have alienated reviewers. Look beyond it and it's well performed, reasonably enjoyable, and with the best ending  of this brand of movie."
    },
    {
      "rating": "8",
      "text": "For me, it is a good stylish old-fashioned Sci-fi movie, looks like Total Recall (Total Recall is also a gore one, isn't it?). Sometimes funny, a little bit of references, cool music. As much of gore as we used to see and as exist in any medical profession."
    },
    {
      "rating": "8",
      "text": "This movie isn't that bad. I mean okay it's doesn't really have the greatest dialog ever, but this movie has some great action sequences and a very shocking ending."
    },
    {
      "rating": "8",
      "text": "This movie is one of those good underrated movies. Do not listen to the critics on this one, they're very often wrong. The movie was one of the best action movies of 2010. The story was very interesting, and it carried all the way to the end. I really wasn't expecting anything from this movie when I bought it, but now I think I'm even gonna read the book."
    },
    {
      "rating": "10",
      "text": "This movie was more than just decent. From all the negative reviews I've heard about it in the past I had ignored this movie for so long, which I now regret after finally watching the movie. I rated this movie so highly because I felt I needed to average out all of the horrible scores/reviews the movie received, when in actuality I feel like this movie was just misunderstood by too many."
    },
    {
      "rating": "5",
      "text": "A solid sci-fi action film with a pretty cool premise. Jude Law and Forest Whitaker work pretty well together in buddy cop sort of way, Liev Schreiber also does well. The story though is pretty generic and the ending will both surprise and irritate."
    },
    {
      "rating": "7",
      "text": "TLDR: Repo Men is a sci-fi thriller about the dangers of treating peoples lives, health and well-being become a commodity. It deals with ethics and morality, and while it never reaches the great heights, it is a solid movie with a surprise twist.\r Full Review: A movie set in a bleak future reminiscent of a Ayn Rand-esque society where money decide whether you get to live with the help of artificial bodyparts or die, \"Repo Men\" sets out to show us what happens when one those tasked with repossessing the organs that people can no longer afford the payments on, finds himself with an artificial heart.\r The setting is fairly clever, and it is a dark and cautionary tale of what happens when the health and well-being of people is treated like a commodity. The movie has a gritty and occasionally extremely bloody artistic expression, best seen in the disused housing complexes where those who try to avoid being killed and having their organs repossessed by the repo men. The violence is in no way toned down and there are scenes that will make anyone with a weak disposition feel ill, but this only adds to the feeling that the movie has a message about the ethics and morality of \"just doing your job\"\r The actors are a bit \"flat\", but this may be as much from their characters being desensitized after killing people and ripping their hearts, livers, kidneys and so on out for years, as from a lack of acting enthusiasm.\r The ending, which many have disliked struck me as a necessity. Yes, it angered me too, but without the last few minutes we would be left with a generic sci-fi action thriller, while this ending made the moral and ethical questions stay with me, and force me to think more deeply on the implication of this movie.\r It is not a masterpiece, but it is a good movie that has a message to us all.\r 7/10"
    },
    {
      "rating": "4",
      "text": "Trop long, le film s'en sort à grand'peine par son cynisme sur la sécurité sociale du grand futur où les organes artificiels sont devenus un abominable bizness de gros bâtards de multinationales usurières. Le côté dystopique est ainsi bien rendu puisque dans le cas où la dernière hypothèque de la baraque ne suffit plus à payer les traites du nouveau coeur, les \"repo men\" viennent prendre repossession de l'organe impayé : cruel mais juste...Tout cela se tient assez bien ma foi avec ces \"Blade runners\" de la récup' jusqu'au moment de la \"rébellion\" téléphonée et sans surprise qui transforme alors le film en débauche d'action médiocre au fil des brèches s'ouvrant de toute part que les scénaristes tentent de colmater avec du chatterton et du fil de fer. Seule la fin tente de se rattraper in extremis, cynique elle aussi, comme un obèse tente de se rattraper aux branches d'un jeune arbrisseau, finissant par l'écraser de tout son poids dans un splatch énorme.Sanguinolent et d'assez mauvais goût avec toute sa charcuterie, Repo Men ne fait certes pas dans la dentelle ; heureusement, les acteurs font ce qu'ils peuvent, hormis l'indécrottable radasse Alice Braga, horripilante tête à claques qui pète plus haut que son cul. La musique se repose beaucoup trop sur de crispantes chansons merdouilantes pour ajouter une sorte d'aspect \"décalé\" (ironique peut-être ?) à la situation.Repo Men fait donc preuve d'un manque de suite évident dans les idées malgré son postulat intéressant et son acerbe critique du (prochain ?) système de santé (future) des Américains."
    },
    {
      "rating": "9",
      "text": "\"New Kidney: $524,000New Eye: $345,000New Heart: $975,000Total Payment: $2,600,000\"**** I should kill myself then reborn.Movie deliver with a new concept I never seen. Excited and I like the ending."
    },
    {
      "rating": "10",
      "text": "Cool movie. An interesting plot. Not a banal ending. Good actors. What else do you need for a good movie ?"
    }
  ]
}