{
  "id": 75,
  "title": "Reservoir Dogs",
  "starring": [
    "Harvey Keitel",
    "Tim Roth"
  ],
  "runtime": 99,
  "genre": [
    "Crime",
    "Thriller"
  ],
  "description": "A botched robbery indicates a police informant, and the pressure mounts in the aftermath at a warehouse. Crime begets violence as the survivors -- veteran Mr. White, newcomer Mr. Orange, psychopathic parolee Mr. Blonde, bickering weasel Mr. Pink and Nice Guy Eddie -- unravel.",
  "releaseYear": "1992",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xi8Iu6qyTfyZVDVy60raIOYJJmk.jpg",
  "categories": {
    "plot": 8.346153846153847,
    "acting": 8.266666666666667,
    "ending": 8.0,
    "soundtrack": 9.666666666666666,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 8.5,
    "action": 8.666666666666666
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Tarantino's debut is still arguably his most powerful. \"Reservoir Dogs\" shows a rathe timid Tarantino in the beginning of his career, but that doesn't mean it's lesser than his later films. \"Reservoir Dogs\" packs a mean punch full of violence, obscenities, and hilarity all into very fast crime thriller that is sure to get your adrenaline pumping. \"Reservoir Dogs\" does lack what makes Tarantino's later films somewhat better; a brilliant screenplay. I would love to see Tarantino redo \"Reservoir Dogs\" now that his confidence in directing and writing has grown considerably. However, this is a fantastic cult film that should be watched by every lover of the cinema."
    },
    {
      "rating": "9",
      "text": "The movie that made Tarantino awesome. Probably one of Tarantino's greatest films next to Pulp Fiction, it has everything you expect and love from Tarantino; Memorable dialogs, well written characters, well paced non-linear storyline, constant references to pop culture and tribute like feelings. If you want to explore Tarantino's films, start with this one."
    },
    {
      "rating": "9",
      "text": "As the camera circles and observes the scene, it's clear to see the talent involved in 'Reservoir Dogs', director and writer Quentin Tarantino is one of those men sitting at the table, alongside Michael Madsen, Harvey Keitel, Steve Buscemi, Lawrence Tierney and Tim Roth amongst others, they are well dressed in black suits and are having a rather crude discussion surrounding the Madonna song \"Like a Virgin\". These men don't know each other, but they share chemistry over coffee, but we soon learn that they have reason for being there, a jewellery story heist that we see in flashbacks, because for most of the film, we have a lot of dialogue taking place in the warehouse that was the agreed rendezvous, but you can now judge from this wording that it all goes horribly wrong, and as a few start to appear at the warehouse with various theories as to what went wrong, the most prominent of these being an informant within the pack, injuries and deaths have happened, and now they must find out what truth there is to the 'rat' business. The unfortunate shortcomings of the film lie with its characters having little intrigue or prospect about them, the plot revolves around them, but at the same time it revolves more around trying to find out what went wrong, the plot is intriguing, but not enough time is spent working up a point to each 'colour', each man being called a different one so as to protect their names, but that isn't to say the performances aren't immense, with Madsen almost stealing the show with his cold and collective attitude, each time he's about to speak is edgy because of his unpredictability and menacing demeanour. Keitel is the level headed one who looks after Roths character after he is shot. There are plenty of surprises and shocks along the way, while introductions to the characters through flashbacks intertwine well with the main arc of the warehouse, but we don't have particularly witty or mesmerising dialogue, the script relies on its characters and its conclusion of figuring out the problems of the heist. Tarantino is a proven marvel when it comes to unique filmmaking, this film was the kick off to some dark humour such as Madsens \"Mr Blonde\" toying with his victim as he dances to \"Stealers Wheel\", it funny but frightening, we have no idea what is about to happen, and Tarantino has carried on this witty and quick fire shooting that captures smaller but significant details that matter. This isn't his finest work, but here we get a crisp and sharp introduction to the technique and capabilities of Tarantino, he assembles quite the sought after cast with equally impressive performances, and a soundtrack that works well with the darkly humorous script, not as tight as it should be but still a cut above most, it talks perhaps a little too much, but never becomes boring or stale."
    },
    {
      "rating": "10",
      "text": "It's Tarantino's debut and breakthrough in Hollywood.\ri fully admire his efforts on the story and direction.\rEverybody just did a great job.Joe,Eddie and our prominent colors steals the show.\rInfrequent violence scenes make it powerful and the acting is just over the top.Screenplay rules.\rI really liked everyone but Steve Buscemi,Tim Roth and Harvey Keitel just steals the show.\rThis movie starts the style of Tarantino's long conversation about pop culture,daily and criminal activities which people enjoys till now.\rEspecially,the infamous cop-torture scene and the when Mr. Pink shoots at cops repeatedly are too good.\rThis is a perfect crime movie.\rIt's that kind of movie ,you can see 10 times ,if you liked it.\rIt was my first non-linear story line Hollywood movie ,they did it so perfectly that now i love this kind.\rIt's fast pace wouldn't let you bore for one freaking second.\rPeople who love to see crime movies will surely adore it.\rEverything is so great which make this flick unforgettable."
    },
    {
      "rating": "8",
      "text": "Not a movie to watch with your family, but a movie worth watching, Reservoir Dogs brings a lot to the table. With so much fast-paced action, the dialogue still remains the main focus. Being carefully crafted to surprise and make the audience think, the bold dialogue contains a lot of smart discussions sprinkled with just enough humor to be entertaining. As much as I like the action to be  arranged chronologically, the \"messy\" plot gives the movie just the right amount of ingenuity it needs."
    },
    {
      "rating": "10",
      "text": "It's unquestionable that Quentin Tarantino is a very creative and very unique director. And he shows it in his first production. All of his trendmarks like slashed and chic sense of humor, barrels of blood, mindblowing plot, genial scripts and memorable dialogues that causes empathy in watcher. An explosion of debut. Simply sensational."
    },
    {
      "rating": "10",
      "text": "Tarantino's first film is one that catapulted him into Cinema greatness forever. Reservoir Dogs is iconic, and one of the best crime dramas to come out in the 1990s. Excellent performances, stylistic script and audio choices that would become the staples of Quentin Tarantino still hold up today. A movie about identity that is well worth watching."
    },
    {
      "rating": "10",
      "text": "Brilliant Start To Tarantino’s CarrerReservoir Dogs is fun, violent, and terrifically acted."
    },
    {
      "rating": "10",
      "text": "The feature-lenght directorial debut of Quentin Tarantino is just a classic of independient filmmaking. It's a gangster film about a robbery that's not shown on-screen, so we are left with nothing but wonderful acting and dialogue. This movie managed to make a lot with such a small budget and it's a movie that I would rewatch over and over."
    },
    {
      "rating": "10",
      "text": "Brilliant movie with phenomenal storyline and nonlinear style of storytelling.  Another masterpiece from Tarantino."
    },
    {
      "rating": "8",
      "text": "Man, I really liked Quentin Tarantino before he became a retard, directing movies like \"Kill Bill\". His Sundance movie \"Reservoir Dogs\" was a great example why; it had everything a crime thriller doesn't need, from great, unexpected directions to a solid cast (mainly Harvey Keitel doing the job). It was a controversial blast that had powerful, appealing force, and that's why I admired it."
    },
    {
      "rating": "10",
      "text": "Simply, a classic. Great cast with great acting and great dialogue. Gangster movie about a bank robbery you don't actually see, you only hear what happened and yet your eyes are glued to the screen every second of the movie. A must see for any movie lover."
    },
    {
      "rating": "5",
      "text": "This is your perfect example of people liking something strictly because it's different. Other than the acting, which was actually very good, everything else about the movie was mediocre. Quentin Tarantino thinks that you can simply use chaos to replace good storytelling and that's just not the case. This is a cult classic but like most of those, it's majorly overrated. Outside of the opening scene, nothing about the movie was entertaining in any way and really could've been told just as well in 20 minutes. Honestly, that's what Tarantino does. He takes a 15 minute story and fools the audience into thinking it's a halfway decent movie by using over an hour of fluff to fill out time between the constant back-and-forth of the plot. The acting and the opening scene earned the movie a 5/10. Anything more than that and people are just lying to themselves because they want to feel part of the cult following."
    },
    {
      "rating": "6",
      "text": "A fine attempt by Tarantino, but one of his weakest films. Sure, the action, cast and unique story telling style is very good. However, I didn't feel as though any of the characters actually mattered, so the ending wasn't very powerful at all. The core backbone of the story was missing, but each individual component of the film was excellent. If only these were more connected, the film would be a 9/10."
    },
    {
      "rating": "8",
      "text": "I loved this movie and I enjoyed watching it. The cast was good and it was interesting. Yet the film is a bit too predictable and that sort of ruined it a little. I would still recommend it though."
    },
    {
      "rating": "6",
      "text": "Somewhat overrated. Presents itself as another Tarantino masterpiece, however just appears mediocre. Steve Buscemi and Michael Madsen had interesting and fun characters, however the rest were incredibly bland. Quentin Tarantino's character was quirky but he wasn't alive for the majority of the film. Overall, this film is just mediocre at best."
    },
    {
      "rating": "10",
      "text": "This unique take on the heist-film-gone-wrong was excellent--stylish and intelligently made, yet very funny and inexpensive. Tarantino's accolades from giving American cinema the resuscitation it needed mirrors what has happened, at least since the 70's, with Martin Scorsese's 'Mean Streets', both in terms of entertaining violence and usage of music in the scoring of films. I greatly thank Harvey Keitel for taking a chance on Tarantino back then--It paid off in spades."
    },
    {
      "rating": "5",
      "text": "I just can't see what people see. Almost every Quentin Tarantino's movies are so boring. This movie was great at the beggining but like 1 hour after I almost turn it off."
    },
    {
      "rating": "6",
      "text": "Tarantino's most predictable movie but still a very good one mainly because of the clever storyline and the extended violence which isn't as humorous as is in his rest filmography"
    },
    {
      "rating": "10",
      "text": "Sorry for the translation.\r The year was 1992 -\r In the cinematic landscape is a new director and a new movie. The director named Quentin Tarantino, the film Reservoir Dogs.\r Synopsis: Robbery, fleeing in a warehouse, debates, quarrels, emotional consequences, death stars. (Except one, perhaps).\r Who is Quentin Tarantino: A brilliant storyteller. (S.m. skillful storyteller)\r About Reservoir Dogs: A film against intellectual arrogance. When you're seriously pissed use the tools that are familiar to make you feel better.\r What are the symptoms (nervousness): A brilliant storyteller and surprises you when he talks about topics such as handling, race, music, religion, violence. So his characters before the cameras never lose vitality even in extreme situations. Everything is structured around the conversations that are always stimulating. Tarantino shakes you from stupor.\r As you can: through the camera, leaving no escape. You're down there shooting, anyway.\r What is comparable to the work of Tarantino: The most famous artist Mamontow toy. The Russian dolls.\r In that sense: The Russian doll is a collection of dolls, Russian wood of different sizes, nicely colored. Each piece can be inserted into another and is divided into two parts. The pieces in them are not full, but empty. Only the latter, the smallest, which is called \"seed\" is full.\rThe largest piece is called \"mother\". The Russian doll, the figure represents a peasant mother and generous as it may be the land. The creative mind of Tarantino is generous as it is a Russian doll.\r Got a message for Mr. Tarantino? Yes, welcome in Italy. Venice is beautiful. A partnership with Carlo Verdone would an Oscar in Italy.\r An example of imaginative narration (narration).\r Ok.\r Un giorno, un non vedente era seduto sul gradino di un marciapiede con un cappello ai suoi piedi e un pezzo di cartone con su scritto: Â«Sono cieco, aiutatemi per favore!Â»  \"One day a blind man was sitting on the slope of a sidewalk with a cap at his feet and a piece of cardboard with this written on it: â"
    },
    {
      "rating": "10",
      "text": "Reservoir Dogs was Quentin Tarantinoâ"
    },
    {
      "rating": "7",
      "text": "It wasn't THAT good. The acting was great, but the script is below average."
    },
    {
      "rating": "2",
      "text": "How does Joe's son die? No one shoots him."
    },
    {
      "rating": "2",
      "text": "It had no real point to it. Just another movie about a job gone wrong where everybody dies. The dialogue was one of the least impressive things about it... It was awkward and unconvincing, despite being acted by decent actors. I couldn't see the film as an unfolding story, I could only see it as Tarantino's writing. I think that seeing dudes screaming and covered in blood was supposed to cloud people's judgement with shock. The fact that the actors were good made everybody assume that the rest of the movie was good. I am an empathetic person who doesn't like violence, but even I couldn't see this as \"brutal\". All I saw were actors with red crap on them making hurting noises. I didn't buy it.\r I loved Pulp Fiction, and I had high hopes for this movie, and I was very disapointed. Upon seeing the credits roll, I said one thing out loud:\r\"That was retarded.\"\r Maybe I'm not 'getting' the movie, maybe I need to see it again, but for the time being I'm giving it a thumbs down."
    },
    {
      "rating": "10",
      "text": "I just have one thing to say.. You put the Lime in the Coconut and you drank 'em both up Put the lime in the coconut, you drank 'em both up.. :D Such a brilliant movie with that song on the credits, it makes it only more brilliant and more Tarantino."
    },
    {
      "rating": "6",
      "text": "Quentin Tarantino's debut is essentially a hyperviolent version of \"Clue.\" It has the style and flair of Tarantino's other features, but not as much of the fun."
    },
    {
      "rating": "9",
      "text": "It's sad that not as many people have watched this gem. It's such a great film I did not give it a 10 because some parts drag on a bit but overall this is one of the best movies of all times in my book."
    },
    {
      "rating": "9",
      "text": "\"If you shoot me in a dream, you better wake up and apologize.\" Simply fantastic. Tarantino is in a league of his own. And to think, his next film was Pulp Fiction."
    },
    {
      "rating": "10",
      "text": "Reservoir Dogs is the debut film from legendary Director, Quinton Tarantino, and that's why it's taken me such a long time to see it. Most Directors, even the great ones, aren't always successful right out of the gate. In fact, it's a very rare thing to accomplish, but I should have known that if anyone could do it, Tarantino could. In his signature style, Tarantino heavily uses flashbacks to piece together an amazing story of a heist gone bad. The score of a lifetime is at Joe Cabot's fingertips, so he puts together a crew of six of the best criminals his city has to offer. To make sure nothing goes wrong, everyone remains anonymous and is given a nicknames. Right from the start of the film, we know that something has gone terribly wrong, but what happened? That we'll eventually find out in pieces, through flashbacks, in a style that is pure Tarantino. Even in his first film, you can see the style, classic lines, and intriguing that made Tarantino the household name that he is. Aside from flashbacks, the other thing Tarantino is known for, is putting together unlikely casts, that turn out to be perfect for the roles they are in. Harvey Kaitel as Mr. White, may very well be the best of the lot. Kaitel is at the top of his game, and while older and unlikely to be the leader of the group, he turns out to be much more, including the star of this film. Reservoir Dogs is nearly twenty-five years old and it is still as exciting and relevant today as it was then. I never thought anything would ever come close to topping Pulp Fiction as my favorite Tarantino film, but Reservoir Dogs certainly makes a compelling argument for the top spot on that list."
    },
    {
      "rating": "9",
      "text": "I believe this is Tarantino's best movie...well, to me it is definitely better than Pulp Fiction. A great movie indeed, not a 10 but close...I hope to watch it again soon. What else can I say that hasn't been mentioned yet?"
    },
    {
      "rating": "8",
      "text": "This violent thriller does not reach the american nostalgic charm that Pulp Fiction created, but it certainly provides Tarantino the oppurtunity to create claustraphobic reactions for his audience and characters."
    },
    {
      "rating": "8",
      "text": "I enjoyed Reservoir Dogs, but i found it rather slow and REALLY WANNA  SEE WHAT ACTUALLY HAPPENED, besides that the plot was very interesting and different other all i really enjoyed the movie, and will probably have to sit down again and have another watch though, 8/10"
    },
    {
      "rating": "8",
      "text": "'Reservoir Dogs' marks the debut of legendary Quentin Tarantino, who revolutionized the heist genre with this movie. Crude jokes, nearly 300 uses of the f-word in a running time of only 90 minutes and an awful lot of blood. In the Tarantino-esque manner of using as few scenes as possible, this film is focused on the dialogues. Tarantino himself describing what Madonna"
    },
    {
      "rating": "8",
      "text": "With top notch acting performances, interesting story, non-linear story and well made action scenes, Reservoir Dogs is not only the first of Tarantino's movies, it's also one of his best movies."
    },
    {
      "rating": "10",
      "text": "Definitely up there with Pulp Fiction as Tarantino's best. Reservoir Dogs is simply brilliant in all aspects. It is very brash, abrasive and unrelenting, but works tremendously with that sort of tone. The cinematography is very good I think, and the soundtrack is very appropriate and fitting. The story is wonderfully compelling, while the dialogue is very hard-boiled and attitude-laced with plenty of pop culture references, and references to TV shows and hip movies. Tarantino's direction is excellent, and so is the acting. Both Harvey Keitel and Tim Roth give performances that are among their best, while Michael Madson and Steve Buschemi are outstanding. Overall, I think it is a must. Maybe not for all, but I loved it and consider it one of Tarantino's best. 10/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "Really good film, much better than I anticipated, much better than Pulp Fiction. The entire film is expertly shot, the actors are brilliant and convincing, and both the story and the way in which it is told is/was original."
    },
    {
      "rating": "10",
      "text": "Simply, a classic. Great cast with great acting and great dialogue. Gangster movie about a bank robbery you don't actually see, you only hear what happened and yet your eyes are glued to the screen every second of the movie. A must see for any movie lover."
    },
    {
      "rating": "7",
      "text": "La opera prima de Tarantino, buen inicio de su carrera como director, pero lejos de ser tan espectacular como muchos dicen."
    },
    {
      "rating": "0",
      "text": "Premier film de Tarantino et déjà... de la merde ! on y retrouve en effet tous les tics et les obsessions compulsives obsessionnelles du réalisateur pédant qui fait toujours son intéressant et tente désespérément d'attirer l'attention...Déjà donc le bavardage intempestif permanent du début à la fin de tous ces branques qui n'arrêtent pas de jacter, tout ça pour raconter de la merde. Comme d'habitude, le film ne raconte rien à vrai dire ou si peu que ça revient au même : c'est comme un big mac, quand tu l'as bouffé, t'as l'impression d'avoir rien bouffé. Et là, c'est pareil, on a l'impression d'avoir rien vu... peut-être parce qu'on s'est endormi devant ce tissu de conneries qui s'est retrouvé en plus dans le mauvais sens : une tare typiquement tarantineuse de tout raconter dans le désordre pour faire \"genre\". Enfin, la lenteur encore une fois typique de Tarantino... si le film fait largement moins de 2h, il ne fait que meubler et jacasser, car il n'a même pas la matière pour en tirer davantage qu'un gros quart d'heure comestibleUn film résolument à chier, annonciateur de la filmographie abrutissante du réalisateur le plus surcoté tous les temps."
    },
    {
      "rating": "10",
      "text": "This movie was so awesome. And though Tarantino was not the first director to make use of non-linear plotlines (Mystery Train by Jim Jarmusch), he very much brought a quirky style of direction and storytelling into the end of the twentieth century and now into the twenty-first. Reservoir Dogs remains my favorite gangster movie only because it isn't so stereotypical of that genre of film."
    },
    {
      "rating": "6",
      "text": "I'm normally a big fan of Tarantino but this film is vastly overrated. Original, stylish, well acted and directed but not a modern masterpiece."
    },
    {
      "rating": "10",
      "text": "Pulp Fiction has a great story, acting and direction, but it doesn't seem real; neither does Jackie Brown. Reservoir Dogs succeeds on these terms simply because it feels so creepily real. The dialog, acting and genius plot are simply brilliant."
    },
    {
      "rating": "10",
      "text": "Excellent performances. Dialogues contain a lot of abusive language but its worth it. Tarantino'ds performance as Mr. Brown as well as the director and writer is excellent. The other performances also shine. Overall, a great movie with great content."
    },
    {
      "rating": "10",
      "text": "I cannot stand critics who dislike Tarantino because his movies contain violence. God, if you can't watch movies with violence why on earth are you a movie critic? This is one of my faourite film of all time, and, you can quote me on this, Quentin Tarantino is a genius."
    },
    {
      "rating": "10",
      "text": "Reservoir Dogs, the movie that started it all. Such a widely replicated directorial debut has never been made and never will be. Tarantino presents an alternate view of reality as in the perspective of those that break the law as the good guys. Police are the perpetual villain, always present yet out of sight and all the characters know it. This is one hell of an adrenaline ride and a must see for any fan of film."
    },
    {
      "rating": "9",
      "text": "Speaking as a Tarantino fan, this film is great. His first film (written when he was 28) is extremely original, with a clever script and a unique outlook. The acting is top-notch, and carries the film, although the trademark Tarantino script goes a long way also."
    },
    {
      "rating": "7",
      "text": "This movie sparked the millions of fans of Quentin Tarantino and made him a big name in independent film. But is the movie good? Yes because it is a interesting look at the jobs of killers and No because it doesn't add up as well and some of the acting isn't as good as I would hope. The violence is very visual and surreal but it shows the brutality of people in a way that you may never have seen before. Also interesting how the incognito's of the killers are colors and also how the language is over used and makes the characters less appealing. The movie is good but not the best out of Tarantino in any form."
    },
    {
      "rating": "8",
      "text": "A witty script and impressive acting carry this movie, which isn't really that as good as all the hype. The quotable dialogue, black comedy, and great performances make the movie worth it, and I really enjoyed it, but Tarantino has really refined his technique since this movie. For more of the unique dialogue with everything improved upon watch Pulp Fiction, a true masterpiece."
    },
    {
      "rating": "9",
      "text": "One gripping piece of filmmaking, with the most terrifying scene on film?"
    },
    {
      "rating": "10",
      "text": "It's a witty and intense movie, with some of the most stylish sequences ever seen."
    }
  ]
}