{"id": 379, "title": "Resident Evil: Welcome to Raccoon City", "starring": ["Kaya Scodelario", "Hannah John-Kamen"], "runtime": 107, "genre": ["Horror", "Science Fiction", "Action"], "description": "Once the booming home of pharmaceutical giant Umbrella Corporation, Raccoon City is now a dying Midwestern town. The company’s exodus left the city a wasteland…with great evil brewing below the surface. When that evil is unleashed, the townspeople are forever…changed…and a small group of survivors must work together to uncover the truth behind Umbrella and make it through the night.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/7uRbWOXxpWDMtnsd2PF3clu65jc.jpg", "categories": {"plot": 2.204081632653061, "acting": 2.342857142857143, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.0, "action": 4.0}, "reviews": [{"rating": "0", "text": "“A movie for the fans.” “A faithful adaptation.” C’mon, don’t make me laugh. This garbage is an insult to any fan of the franchise. Only twitter would praise this."}, {"rating": "0", "text": "Worst casting for Leon S Kennedy and Jill Valentine. Leon S  Kennedy look s like Carlos Oliveira from Resident Evil 3...Worst Resident evil movie..."}, {"rating": "1", "text": "Weird choice for Leon....and Jill... overall just not that I wanted. I felt betrayed as a fan with a bit of the pandering...why can they just do justice and make the movie based on the events of one single game as well I didn't like this film at all."}, {"rating": "2", "text": "What ain't wrong about it? They simply got everything wrong from costume to story..."}, {"rating": "2", "text": "Even a mediocre Resident Evil script would be ok with me. I'd love to keep this franchise going, but this script was terrible. There was no character development. In fact, the viewer doesn't care about any of the cast to be honest. The writers were lazy and uninspired. The director cast the whole movie in the dark and/or rain. It was pretty much just people running around with guns. If you want to see anything about the Umbrella Corporation then this movie is not for you. At the start of the movie, most of the cast has to take a helicopter to a residence in the woods - a helicopter. However, there is also a secret passage from town to the same residence. Huh? Lazy. So lazy. There's a bumbling cop. The big bad is boring and a bit pointless. There's a woman you never really care about who is not a cop who can apparently pick any lock, fire any gun and ride any motorcycle. The entire story was weak, unimaginative and dull. You can't keep making movies like this Resident Evil ! Sigh. Pass on this one."}, {"rating": "2", "text": "it's just an other example of 'if you want to see a decent video game movie, go watch the fan movies on youtube'. i mean they're at least made by the fans of the series and have a lot more love and care put into them. when going through this movie it was even difficult to keep up with which actor was playing which RE character, everything was put in a jumbled up incoherent mess and so it was even hard to keep up with the chronological order these sequences were put in. you think it's gonna start at resident evil 1 but then it cuts to the truck driver and you think 'oh, res evil 2 then?'. just know there are better movies out there"}, {"rating": "0", "text": "The director has made a lot of changes in the story of the movie and has connected the trilogy of the main game that old fans may be disappointed with."}, {"rating": "0", "text": "They wanted to give a reboot to the saga wanting to base it on the original video games, which they did badly and even worse with their senseless progressive arguments to change the appearance of the portagonistas and worse still the story, worse than the previous saga better dedicate yourself to another thing"}, {"rating": "1", "text": "-Missing Characters-Characters' personalities are changed-No explanation for a ton of events-Plot armor for.main characters-Misused Easter Eggs-2 events crammed into one-MiscastSo many things wrong with this movie. There's NO WAY that the director is a fan of the games. No possible way. This was unspeakably, shockingly bad. They couldn't just split up the 1st.and 2nd games into 2 different movies?Overall it was a waste of time and money to go see. Play the 1st 2 games remake or originals if you want a better experience. This makes me appreciate the 1st 2 Paul WS Anderson movies, and that's saying something. Also, I've been a fan since '97 and still can't figure out how they keep making the same mistakes making the movies."}, {"rating": "1", "text": "What a joke of a movie. It doesn't even feel like fan-film, because no fan would ruin Leon like this. Awful."}, {"rating": "0", "text": "If you're like me, a big fan of the games and CGI movies. You love and respect the lore and source material. You would expect a film based on the games it would not be a 1:1 recreation but at the very least mostly resembling them. That's not the case in Welcome To Raccoon City. The film  takes games 1 and 2 (remake). Mostly 2 with a 10 minute pinch of 1 and smashes them together to create an poor original story with elements and moments from the games.  Many characters are not even present. No Enrico, Rebecca, (only 1 member of Bravo they come accross is Kenneth, because of course they needed an iconic game moment with the turning zombie) Not to mention Bravo apparently took an SUV to the mansion and not a helicopter. Marvin Brana, Hunk and umbrella forces, and Tyrant. And no chance for characters such as Carlos, Nikolai, Mihkail, and enemies such as Nemesis. Since they forwent anything to do with RE3. Brad Vickers also dies at Spencer mansion afte crashing the chopper into the mansion after being bitten and turning. Wesker kills his zombified self.  Then characters who are present are nothing like there video game characters. In appreance anf personality. For example, Chief Irons is a good guy and not a maniac.  He becomes best friends with and Claire and Leon and attempts to escape RPD with them Then is killed by a Licker of all things.Leon is a complete bumbling idiot who needs Claire to save him throughout. His origin is he only got on the force because of his dad, and gets scorned by a fellow rpd officer for shooting his partner in the ass.  Wesker is also a \"good guy\" who doesn't even betray Chris and Jill. The lab/nest is undoubtedly the worst scene. Now Wesker and Birkin have never met. Completely ignoring the game lore, they both started at Umbrella both very young and were co-workers. Wesker then shoots Birkin and then he injects himself with the G-virus. Then Wesker kills Annette. Sherry then grabs Annettes gun, and Wesker and Sherry are aiming at eachother. (Who has no pivitol role in the movie at all, she's just there to tag a long)  Moments later everyone else swoops in and Jill shoots Wesker, then runs to his aide and proceeds to give the worst acting performance ever before he dies. Birkin only reaches stage 2 mutation before Leon kills him with a Rocket Launcher he \"found in 1st class\" as he puts it.  Ada Wong who's MIA the whole movie. Appears in a mid credits scene with a now resurrected Wesker, where it's Ada who gives Wesker his trademark sunglasse! They also took an idea from the Paul Anderson movie. Resident Evil: Apocalypse. Umbrella seals off Raccoon City and nukes it at the end. Same thing here as well. The solider \"stating raccoon city locked down\" while sporting an umbrella patch on his shoulder. Whereas in the game world. It's the US government that seals off Raccoon City and destroys it with a nuke. So much lore and source material was there to work off of was not even acknowledged The characters in the movie look and act nothing like the video game counterparts they are trying to portray. The story is all over the place, and is rushed through to get everything and everyone they could in 1hr30m."}, {"rating": "3", "text": "Just a huge disappointment Seriously Leon ? no this cant be the Leon from Resident Evil !"}, {"rating": "0", "text": "Это...это не фильм. Это набор клишированных популярных обрывков из нескольких частей игр, сваленных друг на друга в кучу, которые помимо того, что отвратительно поставлены так ещё и омерзительно сыграны, хотя дело тут не столько в самой игре этих актёров (которые, судя по всему, ни сном ни духом о том, что такое RE), а в том, какие характеры они показывают. Чего стоит один только инвертированный \"Леон\", который мало того, что выглядит полной противоположностью того, каким он был ВСЕГДА, так он ещё и ведёт себя абсолютно противоположно! Это дёрганая, зашуганная инфантильная истеричка, не способная принять ни одного решения, которая постоянно пыхтит, кряхтит и чуть ли не плачет! Ладно ещё Клэр - она хотя бы отдалённо похожа на Клэр из Revelations 2, хотя характером она абсолютно никакая, примерно как Бэлла из \"Сумерек\". Но это мы опустим - я не привыкла хвалить что-либо за то, что оно хоть чуть-чуть  соответствует ожиданиям. Такое в плюсы не записывают.Вообще почти все персонажи не вызывают никаких ассоциаций с теми, на кого они должны были быть похожими, а ведь мы ясно видим, что создатели этого выкидыша пытались сыграть на стандартных для серии RE триггерах и наиболее запоминающихся моментах из игр и их сюжетных линий. Нет, это отнюдь не переосмысление и не какой-то альтернативный подход. Я искренне не понимаю, на что рассчитывали создатели этого богомерзкого подобия фильма, но по итогу он не подходит никому: ни любителям \"классического канона\", ни тем, кто любит какие-либо нововведения и \"свежие решения\". Просто потому, что никто из нас не является кинокопрофилом."}, {"rating": "0", "text": "Absolutely awful movie with little to no redeeming qualities. Everything from the black washed cast to the rushed plot and terrible CGI brings this movie into the corner of yet another awful game movie."}, {"rating": "0", "text": "Such wasted potential. so much cramming, so much changing. Nothing Coherent."}, {"rating": "3", "text": "The director/writer seemed so preoccupied with Easter eggs and references that he forgot to make a movie. This film feels like a giant checklist rather than a faithful adaptation. If you aren’t a fan of the games, avoid this like the plague. If you are, at least experience it once just to get it over with."}, {"rating": "3", "text": "What went wrong here…Not enough budget to realize this story.  Poor script with no character development.  Badly directed.  The pacing was weird…. It was boring for the first half with way too much setup, then they crammed the mansion incident and police station all into the back half of the film and neither was fully satisfying.  It was just amateurish from start to finish.  I have a lot of bad things to say about this movie.  I was open to a campy good time but what we have here is not even interesting.  The original Resident Evil movie, while frustratingly nothing like RE1 the game, is a much better film.   Something that sticks out in my recollection was the poor characterization of Leon.  Leon was always portrayed as a stars in the eyes rookie but noble and heroic.  Here he is portrayed as an imbecile with frayed nerves and little self confidence.  Not sure why this choice was made.  You can still have the character arc from inexperienced rookie to seasoned bad ass without having the character start out this weak.  This feels like a fan project…but fans would never do this; fans would do a more literal retelling of the stories and include a character like Ada Wong who adds a lot of intrigue to the story.  And not cut everything creepy  to do with Chief Irons.  And not cut Tyrant and Mr. X.  And the Lab sections of both games.  They basically cut all the interesting stuff.  This is a really really bad movie and it sucks because we’re probably not gonna see them try this again.  Thank god for Resident Evil 2 Remake that shows us how this sort of thing can be done right.  In fact I’ll go play it right now.  Skip this movie, even for fans."}, {"rating": "0", "text": "It's a complete joke!!!!!They ignored completely the lore and mixed RE1& 2 with no sense, it feels rushed as ****"}, {"rating": "0", "text": "So disappointed as a long time re fan. The director clearly thought he could get away with saying it's faithful to the games then adding a bunch of references and scenes from the games into the trailer to make it seem true. I could already tell just from the trailer and casting it was going to be horrible but decided to give it a chance. Characters personality in WTRC are absolutely nothing like the characters personalities in the games. Especially leon, completely butchered his character. Was excited to see the gang together, too bad they're completely different people. Overall very boring, lacklustre and extremely unfaithful to the games"}, {"rating": "4", "text": "I was initially annoyed when I heard the news that the Resident Evil film series was going to get a reboot so soon after having dominated theater screens for about 15 years. You could hardly blame Sony Pictures and Constantin given how much money they made though. The one silver lining was that fans of the source material might finally get a movie with a little fidelity. It's no secret that Paul W.S. Anderson's hexalogy had almost nothing to do with the games it was supposedly based on. He might have borrowed a monster design or a name here and there, but for the most part created his own mutated beast complete with an original protagonist and everything.Well, upon having now watched this revival of the franchise's cinematic half I can state for certain that gamers have at long last received an adaptation that actually has something to do with the stuff they've played. The heroes are all familiar faces like Leon Kennedy, Jill Valentine, and Chris Redfield while the story sees them uncovering the secrets of Spencer Mansion and, of course, surviving the outbreak in Raccoon City. Both locations found in the original two PS1 classics. It even fully embraces the property's horror roots by going heavy on the scare attempts rather than just focusing primarily on the action like its predecessors did. Unfortunately, all this faithfulness is kind of wasted given that the feature presentation itself isn't very good.When the characters are shooting their way through the undead to try and escape their doomed town, it's alright. Things go straight down the toilet though the second someone opens their mouth, usually to utter a line of profanity, or the narrative tries to give an explanation behind the whole scenario. The writing is just so bad with the new takes on the cast turning some members of it into bumbling idiots for an intended comedic effect that feels wildly out of place, as well as there being elements that make no sense like how the entire police force is the only portion of the local population to be unaffected by the \"Umbrella\" pharmaceutical company's deranged experiment for some reason.There are aspects I can praise. The set design is fantastic with a lot of interesting little details to pick out in the backgrounds. Every environment manages to capture a vibe and atmosphere that reminded me of what terrifying Playstation gems I have managed to play, such as the first Silent Hill, and watching the survivors battle groups of great looking zombies in their cramped interiors can be genuinely tense as Johannes Roberts has a knack for crafting unsettling scenarios. The score is also fantastic. It's got some serious issues with the plotting and dialogue however, and they're enough to derail the entire experience.Perhaps this will go over better with someone who has a greater appreciation for the works that inspired it. Personally, I've only ever touched the 5th, 6th, and Revelations spin-off titles so I'm sure the majority of the Easter Eggs and parts recreated onscreen missed their intended mark with me. Still, even if you do manage to pick up on everything that doesn't change the fact that it's largely cheap fan service in lieu of legitimate quality. Not saying that isn't enough to provide a good time, but in my mind it can't save this from somehow being the worst Resident Evil flick. I'd be down to attend a sequel regardless."}, {"rating": "4", "text": "From 2002 to 2017 the world had 6 Resident Evil films starring Milla Jovovich.15 long years of mediocre movies that really had nothing to do with the video game beyond some characters and of course, the zombies.Now with only 4 years apart we have a reboot that tries to be more faithful to the source material and it shows, but splashes the good details with an unsuccessful execution, turbulent action and sloppy storytelling.The merit that at the same time becomes a disadvantage is that Resident Evil: Welcome to Raccoon City, pretends to offer fan service instead of creating a true horror film that can stand on its own, and above all separate itself from the shadow of the video game.You can be part of a franchise and still have your own identity, but while the director goes about giving little easter eggs that will only satisfy people who recognize them, he forgot to create a film that actually deserves to be seen for its best elements, instead of trying to sell itself with the poor and basic components of what it ultimately attempts."}, {"rating": "0", "text": "It is time to stop giving shows like this a chance. No attempt at characterisation? Check. Typical box-ticking cast? Check. Cheesy 90s vibe? Check. Stop giving things like this a chance."}, {"rating": "3", "text": "***Spoiler Alert*** If you go into this movie not knowing anything about Resident Evil then this is a decent movie. Has a creepy atmosphere with some good scares. If you are a fan of Resident Evil then you will probably like all of the easter eggs throughout the film while hating it at the same time. You will hate how they have completely butchered the story and characters. Pretty much massacred all the character and storylines. Not sure if Johannes Roberts that wrote the screenplay had ever played the games or read the books. It feels like he lost the cliff notes for most of the story and filled in himself. Then he decided to put all of the characters abilities and attributes into a hat and draw them out randomly to put with which ever character he was writing for at that moment. Most of the characters have been rewritten to be the complete opposite of their game characters. Bravo team is now just two regular looking cops in a truck instead of a team in a helicopter. Barry Burton has once again been screwed and left out of the movie. That might actually be a good thing. God only knows how they would have written him in. Probably as an old skinny janitor with a drinking problem. Not sure how Richard Aiken made it onto Alpha Team, let alone in the movie. There is also no mention of all of the murders that lead them to investigate the Spencer mansion. The outbreak is now from a spill into the water system and not from the infected turning the entire town. I really wanted this movie to be good after the last series crazy storylines. There is to much story from the first two games to put into one movie. The mansion storyline deserved its own 2 hour movie at least. They did keep the iconic S.T.A.R.S. Beretta pistols from Kendo's gun shop in the movie. But should have been seen more with better close ups. So here are some of my issues with some of the characters.Wesker is now great friends with his small team and has nothing to do with Umbrella or Dr. Birkin. He's just a cop being paid to steal stuff. He is just trying to escape the dying town.Chris and Claire Redfield now hate each other and don't get along. Claire now has the ability to pick locks. She shows up to Raccoon City to warn Chris of a possible issue instead of coming from college to check on him. Chris is in love with Jill Valentine who he apparently now grew up with. Chris can at least still shoot good. No mention of military background. Jill Valentine is now just friends with all of the guys because I guess she grew up with them now. She is also in love with Wesker. No mention of her background or dad as a thief. Vickers isn't really shown as being a coward. Just someone escaping an attack. No mention of him being chicken heart Vickers. Chief Irons is shown to know something about Umbrella, but not much. Also, more of a coward than being a complete monster. Leon S. Kennedy. What in the world happened there. Let's just make him a completely useless character who gets saved by his rich daddy when he screws things up. They slaughtered his character and storyline. Made you want him to die to keep his character out of this movie. Lisa Trevor is no longer bad. She is just a lonely monster who is being helpful. So, if you're not a Resident Evil fan and just want something entertaining then ignore my review. If you're a fan of Resident Evil then consider your self-warned."}, {"rating": "3", "text": "I consider myself a Resident Evil fan, though not a longtime one. But I'm not so particular or purist that an adaptation has to be 1:1 from its source material; obviously some things have to be trimmed and reworked for flow and budgetary restrictions. I get this.But this movie confused me.On one hand, there were some things that had exquisite attention paid to the little details: Claire's outfit, for instance, is adapted right from the RE2 remake down to the little feather necklace she wears. The Raccoon City PD building was identical to the game. But these lovely little details are overshadowed by some of the most BAFFLING choices made by the filmmakers. Choices like making Chris and Claire have a personal history with William Birkin, reducing Leon to incompetent comic relief.And how can I forget the fact that they had the first and second games occurring concurrently? I had hoped that the mansion scenes would play out before the scenes with Claire and Leon for some semblance of chronological order, but instead they literally just mashed the plot (SOME of the plot) from the first two games together. I do not understand this bizarre attempt at combining RE1 and RE2. Why not adapt the first game to film as best as you can, and then adapt the second later- you can even combine it with RE3 since they take place within a few days of each other! This had a lot of potential, but these little Easter eggs and references to the games actually highlight how badly the film is put together: \"Yes, we know all these details about the game, and yet we STILL chose to have it play out on screen this way.\"Not great."}, {"rating": "3", "text": "Milla Jovovich as Alice 10 times better than this. So sad((((((((((((((((((((("}, {"rating": "0", "text": "Just another cashgrab that have nothing to do with the RE lore. Not even the spinoffs. The characters are a mix of clueless ignorant cosplayers that somehow ended up in a cheap sitcom. And what completely stands out is that the male roles are extremely over the top dumb and mentally challenged, in reality these would not even be able to clean toilets in some dump factory let alone be police officers, drivers, etc."}, {"rating": "1", "text": "As someone who has been a die hard fan since 1996. Having played EVERY game entire. I honestly want my money back. Completely changing most of the story, and character arcs. This just goes to show that NO movie director can actually do a good/true Resident Evil movie. I'm very disappointed at how this film turned out. Save your money, and wait to see it on netflix."}, {"rating": "1", "text": "Executive producer: Paul W.S Anderson...... That's what made me the angriest. I have a resident evil tattoo, I am in Healthcare and even researched COVID, resident evil formed my life since I played it as a kid.They had one job. They completely dropped the ball. I have no problem with Chris,Wesker and Jill's and chief irons casting or acting,they were the best part. Leon was completely miscasted and written like an incompetent idiot. What I have a problem with is that this movie is nothing but easter eggs and they ruined the jump scares by putting everything on the trailer. They tried to put 1 and 2 together, which if they had competent writers, could have worked. This is a SCI FI channel movie or direct to TV. The CGIbis horrible,I dont understand how sony and capcom could be proud of this movie. Fans will hate this movie, and random people are going to be completely lost.  Based on their previous seriesz their budget should have been way more than 25 million after the crap that anderson and milla gave us.I give it a 2 just because some of the easter eggs were dope, but the pacing is horrible, this is badly written, executed poorly, whoever marketed this should be fired. I swear to God if they mash RE3 with RE4 or code veronica I wouldn't be surprised because this director thinks he is a genius.I get you maybe want to save tyrant for another movie but you literally had 3 monsters. No Yawn, No spiders, no sharks, no barry, no legit air force background for Chris.They should have had a tyrant in birkins room, sherry shoot at wesker, but accidently hits the tyrant tank, annette isn't immediately killed so she could give exposition, william infects himself and shoots something to infect sherry. Annette should have been given the opportunity to tell everyone about the vaccine and that would have explained how STARS can't get infected and can be bit, except Leon or something, and the vaccine is deeper in the lab for G. Shouldd have had Leon, Claire and Sherry go into the lab and introduce Ada, while Chris and Jill are chased by the tyrant trying to get the train running. I literally just made the move another 40 minutes longer that would have made the movie a 6-7 for me."}, {"rating": "0", "text": "What an absolute pile of garbage. Why they would make something like this is beyond me. The trailer was a red flag already."}, {"rating": "0", "text": "As a resident evil fan I felt insulted watching this garbage. The cast is a joke. just stick with the games capcom"}, {"rating": "0", "text": "Leon! Look how they massacred my boy.What a horrible movie. The original story is soo good, why **** the story by adding all kind of cheap Hollywood clichés?"}, {"rating": "0", "text": "Another \"SJW\" garbage if you wanna watch.. WTH happened to Leon man? What about Jill?! Ugh.. Forget it."}, {"rating": "2", "text": "I was excited when watching the trailers to see that Resident Evil was going with an actual horror theme to their movie this time. That being said knowing how cheesy and awful the OG series of movies were I went into this with extremely tempered expectations, and Oh Boy was that a good idea! The film is super cheap and times almost appearing as if it was a college film. The actual game was like that so I could forgive that, but the **** dialogue in this thing is mental cancer. They changed every single character inside and out (Besides Chris kind of), and even a lot of the story to make all three plus games barely fit into one film. There's such a tonal unawareness to the whole thing that I was genuinely upset to how anything was even unfolding. It's not a horror movie at all, which might be the real killing blow to the whole thing. Half the time it's cheesy teenage drama comedy which really doesn't work. It's not worth the cost to watch and certainly not worth the brain power to view. If you have to see it wait till it comes out for free on whatever streaming service you have, cause I doubt this one will even be available to rent."}, {"rating": "0", "text": "Es la peor adaptación a los video juegos lo único interesante son las referencias"}, {"rating": "5", "text": "I apologize in advance if it sounds like an incoherent rant, I just need to get this out of my system~I'm on the fence about this one because as a die-hard fan of Resident Evil, I was really looking forward to a movie that followed the games entirely. Honestly, a few reviews are about the actors they chose but I actually grew to love the actors for Jill and Leon. The biggest problem for me was how much they changed in order to fill 2 games into 1 movie. They glossed over multiple things such as Jill's background and they switched the role of \"Greatest Lockpicker\" to Claire instead of Jill, which didn't make much sense. The Spencer Mansion seemed dumbed down, which I can understand since it's huge in the game, but it still would've been nice to see it in all its glory. Also, the fact they just waltzed into it was quite disappointing since the chase, in the beginning, is what gets you excited to play the game (or in this case, watch the movie). And who the hell said, \"Let's replace Barry with Richard\"? Richard isn't even on the Alpha team and they didn't bother adding the Bravo team into the movie, presumably because it wasn't in the budget to find an actor for Rebecca, or they just couldn't find room for her in the story. I'd also guess the reason they didn't add Barry is that Wesker didn't manipulate him into being a good little soldier because they didn't even bother adding the whole \"Wesker is evil and selfish and he also the ex-partner of Dr. Birkin\" which was probably the thing that pissed me off the most. Also, who decided to make this a love story between Wesker and Jill??? I thought we all agreed that Wesker's heart is cold and dark and he is incapable of love so why was this even a thing. They even had the audacity to make Leon look like an idiot. This whole movie feels pointless because they joined 2 games that have months in between them. The only reason Claire goes to Raccoon City in RE2 is to find Chris after the events of RE1. This might've completely ruined the chances for a Code Veronica movie, which is one I want to see more than anything. Another thing is Annette seems oblivious to Williams's work like what?? Girl aren't you also an Umbrella Researcher, how tf are you in the dark on this. I'm also confused about Claire and Chris's backstory. I know it was never really confirmed how their parents died and what happened to them afterward until they grew up but like Umbrella Orphanage? Really? How canon is that? It may sound dumb, but I want everything in the movie to be exactly the same and it's sort of uncomfortable having new information come out that isn't from the mouth of Shinji Mikami. Lastly, it hurts to see Chris and Claire literally hate each other but whatever. Let this be a warning to all you RE fans, you might be disappointed but you might enjoy it. Overall, I had a blast watching it and pointing out the easter eggs but as always, there was things they could improve on.I'm unsure if it's true or not but I heard they only made this movie to keep the rights to Resident Evil which, if it's true, makes me furious. We deserve a team of people who actually give a sh*t about the games and strive to make a movie we can all enjoy."}, {"rating": "2", "text": "Yeah, there's issues with this, lots of changes to the original plot, but it looks fun.It's not just look worst even worst than I expected, what a way to destroy a perfect game again"}, {"rating": "0", "text": "the worst movie ever Don’t watch it don’t even think about watching it.,.,.,"}, {"rating": "0", "text": "As a huge, lifelong fan of the franchise since I played first played the classic RE2 in 1998 I am so tired of seeing Resident Evil adapted into laughably terrible movies.  The Paul Anderson \"excuse to cast my wife\" movies were pretty bad but at least had arguably accurate casting and production value.  This one trades that for woke-quota casting and a budget so low you'd be forgiven for mistaking it for a YouTube fan film.  On top of that they tried jamming two games into a single movie that actually occur many months apart and totally disrespected the source material by making massive and unnecessary changes to the story and characters.  Literally the only thing I can say good about it is that they did faithfully recreate some of the sets but with the amount of disrespect they showed the source material in virtually every other aspect earns this movie a giant rotten zero from me.  I hope that this thing flops hard enough to kill any potential sequel and that if Resident Evil is ever adapted into a film in the future that it is done faithfully by someone who actually understands and appreciates the games."}, {"rating": "0", "text": "This movie is an insult to game fans and movie fans. It fails as an adaptation, completely mischaracterizes the characters and has many other problems. How can capcom authorize this type of approach? Call Alice back..."}, {"rating": "2", "text": "What the **** Film Hovno!!!!!!!! It couldn't get any worse.It couldn't get any worse!!!!!"}, {"rating": "0", "text": "I'm a Brazilian fan and I went in hopes of going to the cinema to see the movie, I felt extremely frustrated watching it, a bad movie and a bad adaptation, horrible movie, I felt that my money and time on this movie were spent for nothing, it didn't add me on nothing, you didn't send me any messages, just a bad movie, not even the mansion part saved the movie, oh my God, what did you guys do..."}, {"rating": "2", "text": "I went into this movie as a massive fan of the game franchise. It was barely halfway through the movie when I got up and left the theater. The movie tries to tell both the story of the first and second game and fails to tell that story. It moves way too fast to the point where I could barely keep track of the characters. The only thing that helped me keep going was Leon, but even he couldn't save this movie."}, {"rating": "1", "text": "The only good thing about this adoptation is Claire actress, she is pretty hot.Other cast is poorly selected. Script is awful. Fanservice is awkward. Whole movie feels like a budget Bmovie."}, {"rating": "1", "text": "Ya want resident evil but woke? Then here is your movie"}, {"rating": "0", "text": "Absolute garbage. Let’s start with the casting. They couldn’t even find actors that resembled Jill and Leon in some way? I mean, come on. Claire looks pretty bad but at least they tried with that one. Chris is the only good casting choice in the movie.An absolute insult honestly. I could go on for hours but I don’t have time for that ****"}, {"rating": "5", "text": "Welcome to Raccoon City is not a good film, but it is not a terrible one either. The movie is well shot, the acting is pretty solid, and there are some cool designs and set pieces. But, the script is a mess, the plot is way too overpacked, the pacing is bad, some character decisions are not explained and/or developed, and the whole movie just feels far cheaper than it should. There are some cool references here if you are a fan of the Resident Evil/Biohazard video games, but there are also a lot of things that do a disservice to the games. Maybe watch Welcome to Raccoon City when it is being streamed, for free."}, {"rating": "0", "text": "Фильм намного хуже предшественников, что очень странно, так как никто не ожидал, что может получится хуже. Наглое изменение сюжета и персонажей вызывает только негатив со стороны фанбазы и недоумения со стороны людей которые не знакомы с серией. Все \"нововведения\" были ничем другим как просто неосведомленность и наплевательское отношение к проекту. Делался фильм не для фанатов, а для денег которые можно поиметь с фанатов. Надеюсь, что все кто приложил руку к проекту не будут заниматься фильмами."}, {"rating": "0", "text": "One of the worst movies of all time, because they had all the possible things to make it great, budget of 25 million and they just ruined it, by disrespecting everything Resident Evil has built over the years. This movie is million times worse than 2002 movie."}, {"rating": "4", "text": "Since the writing of the video game series is always stumbling from being fascinating to making you feel like you are made fun of for taking it serious, cleaning it up is a good idea, and some consistency would have gone a long way.Instead the movie is namedropping characters and locations like a Hollywood hopeful at their first party, but that's only a problem if you came for the fanservice.A few years, and a few billion zombies in dozens of movies and series and games ago, this would have been a decent movie, even though it kind of loses both pacing and plot in the second half. It's not bad-bad, it's just borderline impossible to impress any audience old enough to be allowed to watch this since they grew up with a steady diet of the undead. And since it's also certainly not shakespearean drama, or great acting, or comes up with anything even remotely challenging, seeking the mediocre middel-ground right at the center, it's really hard to feel like you haven't been wasting your time, and money. Watch this at home if you really have nothing better to do."}, {"rating": "1", "text": "So get along with Leon, do you have children that get a job and are just as stupid?"}], "recommendations": ["monster_hunter", "resident_evil_apocalypse", "hitman_agent_47", "silent_hill_revelation_3d", "terminator_dark_fate", "doctor_strange_in_the_multiverse_of_madness", "stay_alive", "priest", "the_new_mutants", "unfriended_dark_web", "tomb_raider", "divergent", "max_steel", "the_old_guard", "jurassic_world_fallen_kingdom", "men_in_black_international", "the_6th_day", "teenage_mutant_ninja_turtles", "space_jam_a_new_legacy", "would_you_rather", "the_purge_anarchy", "suicide_squad", "legion", "the_hunger_games_mockingjay_part_1", "doom"]}