{
  "id": 2510,
  "title": "Resident Evil: Damnation",
  "starring": [
    "Matthew Mercer",
    "Courtenay Taylor"
  ],
  "runtime": 100,
  "genre": [
    "Animation",
    "Horror",
    "Action"
  ],
  "description": "U.S. federal agent Leon S. Kennedy sneaks into the \"East Slavic Republic\" to verify rumors that Bio-Organic Weapons (BOWs) are being used in the country's civil war, which the U.S. and Russia are making preparations to jointly intervene in. Right after his infiltration, the U.S. government orders him to leave immediately. Determined to uncover the truth, Leon ignores the order and enters the battlefield to end the chain of tragedies caused by the BOWs.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9T3u6laO3TRgJk4SFntt4UK1oXW.jpg",
  "categories": {
    "plot": 8.424242424242424,
    "acting": 8.5,
    "ending": 8.0,
    "soundtrack": 8.666666666666666,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 8.052631578947368
  },
  "reviews": [
    {
      "rating": "8",
      "text": "For die-hard fans of the original 'Resident Evil' video game series, this film may come as a disappointment, as the general horror and darkness that made the games so unnerving has been ditched here, in lieu of an intense action-thriller. Nonetheless, in its own right, this film is highly entertaining.Milla Jovovich puts in a superb performance as Alice, who is lead into an underground base of a multi-national corporation to do battle with a series of ghoulies and monsters, including a horde of the undead. With terrific co-star Michelle Rodriguez, there is never a dull moment, moving at a furious pace with just the right mix of dry humour, mystery that surrounds the \"Umbrella Corporation\" and its motives, and impressive action sequences featuring an agile Jovovich in the dress she's barely wearing performing some remarkable stunts."
    },
    {
      "rating": "10",
      "text": "Personally, I think RE is one of the best movies I've ever seen, and trust me, I've seen a lot of movies! It has an original story, good characters, and extremely good storyline and there's so much in the movie.. action, horror.. the relations between the characters, the way they need to unite to survive.. it's such a good and interesting movie!  I find so weird that people have so many negative critics! I mean, I know it was inspired in the game, and i know Alice isn't in it.. but people need to get one thing straight: those are two different things! and to be honest, I think it's pretty cool that there is a female bad ass the major character!"
    },
    {
      "rating": "7",
      "text": "While I'm a huge fan of pretty much anything Resident Evil, I can't let that affect my honest review. The movie isn't so bad and I do watch it from time to time. I like horror movies, and this is one of the movies that I'm able to watch more than once which isn't always the case. I would honestly say the movie is worth watching, or owning if you can find it cheap. It's interesting and has a lot of action so at times it'll have you on the edge of your seat."
    },
    {
      "rating": "10",
      "text": "Brill movie, great action and great for if you want to watch a good horror!"
    },
    {
      "rating": "10",
      "text": "An action packed movie from start to finish."
    },
    {
      "rating": "10",
      "text": "Watched this movie in theatres atleast 6 times... Brilliant acting (maybe not the best ever but put yourself in the characters shoes) and a nice story, love the special effects. First 30 min. are the best, could watch that over and over and over again."
    },
    {
      "rating": "9",
      "text": "I actually enjoyed this movie a lot. I played the games and am well aware of the \"lore\" of RE, but sometimes the movies don't need to follow exactly. Plus, this is kind of new territory here, with the movie actually coming after the game. I still wish I could filter reviews and remove all \"0\" scores. A movie that bad should make you *literally* vomit in your mouth, unable to even watch it in its entirety and sad for the plot of humanity and anyone's soul who came within 10 feet of it. Thus, only a handful of movies would be able to get such a ridiculous score."
    },
    {
      "rating": "7",
      "text": "I disagree with that critics 33-or-something score, it's actually the best movie out of all the RE saga. It has a pretty well developed and isolated enviroment, a nice horror mood to it, plus convincing characters and actors.The script is decent and the setting is eye-catching and identifiable from other horror movies. Plus: the ost provides a pretty nice thriller flavor to this film."
    },
    {
      "rating": "7",
      "text": "This movie was not so bad. It could have ended better and told the story better but it was entertaining and I love Milla."
    },
    {
      "rating": "7",
      "text": "It's a really entertaining movie, but Is it Resident Evil? Certainly not. It would've been cooler if they had actually followed the game's storyline."
    },
    {
      "rating": "8",
      "text": "I originally watched \"Resident Evil\" at a movie theater when it was first released in 2002. I hadn't played the games. There was no Rotten Tomatoes and I didn't read reviews back then so I went in blind. And I utterly enjoyed the movie: the story, the action sequences, the underground \"Hive,\" Mila Jovovich and Michelle Rodriguez kicking serious ass, and more. Panned by critics (36% RT) but liked by users (67% RT), Resident Evil was one of the first examples of how mainstream critics just don't \"get\" horror. Movies that try to be artsy get great reviews even as key elements fall flat for the rest of us. The recent \"Beach House\" is a perfect example of this -- it was loved by critics (81% RT) and panned by users (28%). Unfortunately, the rest of the \"Resident Evil\" sequels except for a few moments, rarely captured that first movie's originality and allure.  Instead, check out the writer/director's excellent previous outing \"Event Horizon.\""
    },
    {
      "rating": "6",
      "text": "This was... alright. It didn't follow the RE lore exactly, though did a good job with story telling.\rThe action scenes didn't fit RE at all, and felt too cheesy.\rThe sequels are actually decent, and I did enjoy this as a movie series in it's own right. It'd be worth a rent to any RE fan I'd say."
    },
    {
      "rating": "8",
      "text": "I've always been a fan of the RE games because of their gameplay and not so much for their story or characters so this movie really elevated the whole brand when it came out. The story here is much more contained both in scope and setting building up tension continuously before an electrifying escape from the hive. OST and cast are also great!At that time the games were more horror oriented than action packed tps so it made sense for the movie to be such a tense thriller and honestly I have always felted it lacked a bit of gore. But it does one thing right that many horror movies fail to realise: make you care for the characters and then kill them all. That's a key ingredient that eventually will be lost throughout this series also because of problems casting the same actors in the sequels.This has become such a classic as while being a modest budget movie it was capable of doing better than the original material and and becoming iconic on its own merits. There are a few boring and cheap moments like the escape through the pipes scene but it also perfectly ties to the Final Chapter which sheds new light on so many details in a clever way. Paul W.S. Anderson is objectively not a good writer but did well here and he's a great director with a unique visual style. You can see it in the beautiful sets designed for this movie and the rest of the franchise. I honestly think he quite invented a new genre with this series and this is the beginning of it all. \"My name is Alice and this is my story\" (worth over 1B$) 8/10 Read my other RE reviews, here's my ranking:Resident Evil The Final Chapter 10/10Resident Evil retribution 9/10Resident Evil 8/10Resident Evil Extinction 8/10Resident Evil Apocalypse 7/10Resident Evil Afterlife 6/10"
    },
    {
      "rating": "8",
      "text": "Very good convert from video game to movie, kept true to the game for those that have played it.\rIt is what it is and far this reason I rate it highly."
    },
    {
      "rating": "7",
      "text": "Resident evil tries too much to be like the games and it's not really a good result.The fight scenes are cheesy and and the last monster is made with some incredibly bad CGI effects."
    },
    {
      "rating": "7",
      "text": "One of the better videogame adaptations. I must also point out the movie uses only themes, names, concepts and ideas and is not a direct adaptation of any game in the series. Resident Evil while not inventing the genre is the poster child for survival horror games and a well know series in the industry. Over the years there were many games, spin offs, remakes and some controversies. Mainly the game focus on characters stuck in nightmarish situations caused by a virus that causes the transformation into zombies and even far worse creatures. An evil company is behind it in the earlier games. Back to the movie: In a secret underground Umbrella Cooperation laboratory called the hive a sample of a virus and the antidote is stolen. To hide all evidence the cult-print spreads the virus in the complex. The AI named Red Queen is now in full damage control and quarantine mode. Nearby the protagonist Alice awakens in a mansion without remembering anything and is shortly after recruited by a heavily armed group that stormed the house and wanted to enter the hive. So starts the story. We got some good twists, action and menacing situations that have to be solved. The actors are good and deliver mostly. Milla Jovovich is excellent as lead actress in this kind of movies. The rest of the cast is maybe a bit underused or underdeveloped. I only remember Michelle Rodriguez and Eric Mabius to have bigger moments that made them interesting with exception of Heike Makatsch ( Maybe because of a very short screen time). Additionally the script is really good for this kind of movie. There is no time to bore the watcher which means also good pacing. Remember this is an action horror movie and does not have or need a Shakespearean story as it would be not expected. The special effects however looked really good for the time and budget. Overall this is a decent or even good videogame movie. Worth watching and has memorable moments (The Laser scene is often quoted). Be warned that the sequels are not as good and especially the final movie has an awful conclusion."
    },
    {
      "rating": "8",
      "text": "Боже мой, да тут даже сюжетные повороты есть!Да, фильм туповат, а точнее герои, да и просто странности есть, но это именно тот резидент, который я бы хотел видеть - узкие коридоры, не убиваемый ГГ...Итог: Лучшая часть франшизы."
    },
    {
      "rating": "7",
      "text": "A decent Sci-fi with some clichéd action sequences and a little horror elements thrown in. Barely if at all follows the games, but has some similarities. The original Resident Evil film surpasses the later installments. The set pieces are well done. They feel claustrophobic and unsettling just like the earlier games on Sony's PlayStation. The environments involving underground tunnels and labs are definitely the film's strong point. Overall, it's an average movie that's easy on the eyes. For a movie adaption of a video game it could be worse. Just don't expect good acting and sadly no \"Jill sandwich\" lines."
    },
    {
      "rating": "7",
      "text": "I used to love this movie so much especially being such a huge fan of the video games when this came out I loved it, out of all the movies this one is probably the one that has more horror elements. That being said the acting and some of the affects haven't aged as well especially Michelle Rodriguez I just can’t stand her trying to act she is so terrible overall though I enjoyed watching this movie again it came out almost 18 years ago so it doesint hold up as much as I would like it too but it’s still a fun zombie movie and one of those movies that reminds me of my childhood."
    },
    {
      "rating": "9",
      "text": "Just add rating remembered this old one and wanted to show him some love :D"
    },
    {
      "rating": "7",
      "text": "Decent FunResident Evil is pretty dumb, But it’s a lot of fun at the same time."
    },
    {
      "rating": "8",
      "text": "\"Prep for entry to the Hive.\" \"I shot her 5 times, how was she still standing?\"Based on the game franchise 'Resident Evil' by Capcom. A company that is very influential in the world, be with money or political situations, very poweful in different sectors of society. That company develop strange and dangerous stuff in their secret underground location, in one day they face a situation where one virus, the T-Virus, got exposed in the facility and all of the employees died becaused of that. A team is sent there to figure the situation and solve some problems, what they weren't expecting is that they would find a bunch of living dead persons, animals and monsters down there to confront. Directed and Written by Paul W. S. Anderson.]The main story of the film is beyond simple, but honestly, very functional, i think that it did a good job in that. We have some side stories that i'm not so sure, there are the story between Alice and the brother and sister, Matt and Lisa that also got Spencer envolved, i know that the whole point of this part in the plot was to have a reason for the the T-Virus to get exposed and have another antagonist further the zombies, but i don't think that it would be that necessary, the final motivation of what was done there doesn't seem to be worth it, but isn't horrible neither, i just think it could have been better at those moments. The overall of the story is basically get inside of an unfamiliar place for a mission, finding out that it is hostile and trying to get out, but what they face in there and how they do it, for me it is a good point, the situations and arguing with the red queen, the struggle that they went trough, not perfect, but really good.There are some moments that are really funny, but not intentionally, how the team moves, the songs that are played in some parts, some moments are goofy, some work and others doesn't.The action plus horror are funny in some moments, creepy in others and they try to have some badass moments that don't really work. The laser room, for me it is a great sequence, the song, what is happening, it was so distressing, first, not knowing what was going to happen, and then after each time things got more tense and nervous, i could see myself in that **** situation. The first time the team met the zombies were really good, they figuring what they were doing or what was going on, i enjoyed. Now, there are some moments in slow motion, or when Alice faces the Licker, where they tried to be so epic that i found bad, doing acrobatic moviments, or fighting the Licker in a way that it would only work if she was way stronger than it, so there are some moments that was poorly done.The Licker CGI is terrible, and they don't try to hide it in any way, when bad cgi's like this happens, the good to do would be try to hide it, only showing the cgi in dark places and hiding it in smokes or shadows, but in here they used it in places with high lights and together with the actors, so it got really bad in some moments.The atmosphere in this film is really nice, the whole idea of being confined in a unkown place with a bunch of zombies is so dark and feels so good to be in a place like that in this film. The scenarios are all very nice and are essential to making this film that fun. The whole labs and rooms that we go into this movie have such of a dark sense, it is like you can feel the evil, the death in those places, it is so well done. Still about the ambience in this film, how the details in scenario and mise-en-scene made so much difference in making this film good, i love so much the atmosphere, objects destroyed, tables turned and covered in blood, broken glasses on the ground, grids cutted off, cages and a lot of strange stuff with pipes, sewer, flooded places. All of that together with the the zombies plus being under the ground helped into making this that nice.The sound design is also very good, the choices that they made in here in a lot of moments making echoing sounds that the characters don't know what it is, hearing from far away, im some momentos coming from different places, it can give a paranoid position that, for me, worked really fine. Sounds of muttering, groan, incomprehensible sounds in some situations, things being dragged. Still helping into making the atmosphere to work perfectly. The soundtrack have a lot of metal songs, during action moments it worked and made some scenes being funny, probably not intentioned, but still made me laugh. The score have some nice fatures, the sounding and the less of it in other moments do a good job, helps in composing the scenes.This first Resident Evil movie is really good and very different from the others, even if there are a few moments where you can have a shot of what is going to become, but in here the atmosphere is perfect, there jumpscares and good moments, not intentionally funny moments, really fun film."
    },
    {
      "rating": "10",
      "text": "Slick, brutal, and fun which all adds up to an amazing time acting as a techno-flavored haunted house.Slick, brutal, and fun which all adds up to an amazing time acting as a techno-flavored haunted house."
    },
    {
      "rating": "8",
      "text": "I love the games and i love most of the movies. Why do fans of the games have to **** on the movies just because they don´t follow the storyline? I love Uncharted but I will not judge the movie based on how accurate it is. Try to distance the two mediums."
    },
    {
      "rating": "9",
      "text": "I'm a big fan of the Resident Evil games and I was so excited by the prospect of this film coming out especially since one of my favorite directors was doing it. I was a huge fan of both Mortal Kombat and Event Horizon. I absolutely loved this movie and I still do. This adaptation is sort of a prequel to the first game. The movie centers around a young woman that awakes in a shower with no memory of who she was and why she was there. Soon after she discovers that the house she was in was on top of a top secret facility tat stored bio weapons. One was released and has transformed the recently dead into zombies from people to animals. The movie plays out as if you were playing the game and you are her character, learning about herself and leveling up. The movie is highly atmospheric and very entertaining. Milla Jovovich is such a bad ass and the movie is so stylish with an amazing score by Marilyn Manson. It's not flawless Michelle Rodriguez's performance is a bit extra and some of the digital FX have not aged well. That being said its still fun and surprisingly scary. This is more of a horror film than the rest and pays homage to the undead classics of yesteryear lovingly. I know alot of people don't really care for it but this is definitely my thing. Plus it has the best cliffhanger ending of any movie ever made.Budget: $32mDomestic Box Office: $40mWorldwide Box Office: $103m4.5/5"
    },
    {
      "rating": "10",
      "text": "Best film in the series. As an adaptation from the game is not as good as what really is, but the atmosphere and the dark tone of the film, performances, action and the story make this movie the greatest video game adaptation."
    },
    {
      "rating": "7",
      "text": "Resident Evil is far from an excellent movie, and it certainly has many pitfalls, but it has earned my love as a sort of comfort movie. It's never really too scary or too ridiculous, it lays in a comfortable area between those two where the movie is a fun watch with friends or something to do when you need background noise or isn't doing anything. However, the odds that you'll be pissed by the amount of stuff it ignores or changes from the videogames if you're a hardcore fan are high."
    },
    {
      "rating": "8",
      "text": "I was pretty much thinking this would be either so-bad-it's-good or just plain bad, but no! I really enjoyed it.Don't get me wrong, it's not an Oscar-type epic, but it's a fun movie where you know exactly what you're gonna get. It avoids overdoing the bad-ass female lead cliché. I really enjoyed the music and the overall feel of it.Good, uncomplicated fun. Does what it sets out to do."
    },
    {
      "rating": "10",
      "text": "10/10 Sterne. Resident Evil ist so cool. kann mich nicht beklagen. Das waren Zeiten.^^^^Top."
    },
    {
      "rating": "7",
      "text": "I enjoyed this movie. I don't know about the sequels yet but this one was fun to watch. Casting and acting was okay except the main leading actress. Plot was simple but shown in effective way.  Horror element was also good, there are some jump elements also. What I liked about the movie was that it didn't show everything straight, it tried to create suspense.Overall, would recommend this to anyone who loves zombie movies."
    },
    {
      "rating": "7",
      "text": "seriusly this is the only good resident evil movienothing to say, it was interesting but fail, 7/10"
    },
    {
      "rating": "8",
      "text": "One of the best movies based on a video game and simply a great zombie action movie with a good cast.Oh man, the room with the lasers.."
    },
    {
      "rating": "7",
      "text": "I remember watching the movie without knowing of the game, so I could not really understand the reaction of many. I later catched on to the games and could see why some were disappointed. Still, as a movie on its own, it delivers a good zombie outbreak experience that I watch from time to time."
    },
    {
      "rating": "10",
      "text": "this movie introduce me to resident evil franchise. i was never into the games until i saw this movie. so with that out of the way. out of the entire franchise this is the best out of all of them it had great character moments from everybody that had survived in the story the red queen perfect villain ever. \"your all gonna die down here\" - the red queen most iconic rememberable line ever. what killed this franchise is the side character that switched to lead character is the actress milla jovovich that played alice/janus prospero and the somewhat lead director paul w.s. anderson but that's a whole another story. outside of that i love this film."
    },
    {
      "rating": "10",
      "text": "Despite what critics and some people had to say about it, I absolutely loved Resident Evil. Sure the story doesn't exactly follow the games, but it created its own identity and was a well-written, competent story. The action scenes were well done, even if the zombies lacked blood and there was plenty to go around in terms of excitement. I loved the music and it fit well with the themes. Best of all, Milla Jovovich kicks so much ass in this film! Give it a try, it's actually quite good."
    },
    {
      "rating": "6",
      "text": "\"Resident Evil\" is a zombie movie based on a famous game franchise. The movie is different from the game and offers new perspective and entertainment, if and only if you can handle the cheesy dialogue and the lost-its-way plot of the movie."
    },
    {
      "rating": "10",
      "text": "Having never played any of the games, I rate this without the \"...but it didn't follow the game's plot, 0/10\" nonsense. I thought this was a fabulous movie. Although the whole zombie thing has really taken over a lot of movies, apps, and games lately, Resident Evil brought a fresh take on the slow-moving, falling-apart crap we're so used to nowadays. I appreciated the fact that there was a plot, and a pretty decent one at that. It wasn't just the characters pulling ammo out of their asses and killing hundreds of zombies. It was a great movie."
    },
    {
      "rating": "8",
      "text": "Considering how low a budget this film had, it was really surprising just how far they stretched it. This is perhaps the only Resident evil (non-animated) movie that I liked. I really like that they decided not to just remake the story from the games and make an original character with her own story. I really like Alice and Milla does a great job playing her. Rodriguez also does a good job but she more or less just plays the same character that she always plays. The rest of the cast were just forgettable. As to the movie as a whole, it was a decent horror that did have some chills and did a good job capturing the tone of the games, or at least the first two games. Overall: An enjoyable movie that is perhaps one of the better video game movie adaptations."
    },
    {
      "rating": "7",
      "text": "i thought this movie was an alright start to the resident evil franchise despite not following the original game series storyline. the story was satisfactory not perfect and the cast performed well and convincingly. i would recommend this movie"
    },
    {
      "rating": "8",
      "text": "I've never played the video games so I can't compare this to them, but I can tell you this is a very enjoyable Zombie movie, this movie actually made me jump twice, it's really a great movie, and I'm looking forward to the other movies in the series."
    },
    {
      "rating": "10",
      "text": "I personally don't understand all the hate towards the Res evil films. I feel like this film is drastically underrated and so I've given it a 10. Probably deserves no better than a 8, but it can still be a pretty compelling film. It's not about to blow your damn mind, but I really think it's worth the time of day if you are just looking for a sweet zone out film that you can still follow what's happening."
    },
    {
      "rating": "10",
      "text": "This is one awesome story of carnage. I loved Alice. I loved Rain but shame that she got infected. I liked the lazer slash and dog chase screens. Everybody should watch this one!"
    },
    {
      "rating": "10",
      "text": "i love resident evil trilogy and this one3 it is go epic watching a group of rad ass people kill zombies but this one  is never better then dawn of the dead or world war z . resident evil is better then shaun of the dead"
    },
    {
      "rating": "10",
      "text": "CAMON!\rplease dont do this to me! critics are negative? in all movies????? but why? CGI are bad? plot are bad? crew are bad? well, is just an user review against all of those critics but the users win and in the end, Resident Evil rules!!!! --thank God!"
    },
    {
      "rating": "4",
      "text": "It isn't a movie that's going to set the world on fire and it certainly isn't the best video game adaptation out there, but Resident Evil succeeded mildly at making an entertaining, if boring at times, film. It obviously isn't perfect and the horrible CG looks almost stop-motion at times (the Licker in particular could have been done far better, or dropped completely) and it foreshadows enough to give you a reason to watch the sequel."
    },
    {
      "rating": "9",
      "text": "Resident Evil franchise is more than a gripping story. it is the aesthetics of the movies, that with certain scenes are engraved in memory for years. I adore the entire series, and cannot understand why it is not getting much higher ranking, as it is realy very well done, very artistic, not stupid, maybe prophetic, certainly enjoyable. and Alice is the best!"
    },
    {
      "rating": "7",
      "text": "When i first watched it i thought it was ok but after afew more views i realised it could have been done alot better and by then i was over the dissapointing licker scene and the flying dog kick scene.\rGoing back and prefering it and the sequels now ,the reason for it is because im now in my thirties and when i first watched it i was in my early early twenties and a massive Res fan.\rTheres always room for another director to try again or maybe enjoy what Capcom are bringin to the screen and with a great start from Res Evil:Degeneration which is a complete graphical movie it does a better job of catering for the fans.\rAll that aside though,coming back to these films i realise its not great but good is good enough especially when so much crap is coming out these days that this film and its sequels are quiet enjoyable afterall. Just dont expect too much."
    },
    {
      "rating": "7",
      "text": "Resident evil has amazing suspension, though struggles to maintain direction. There is no stand out performances here however, nothing below average. The first half of the movie is very strong until the zombies are introduced. The creepy atmosphere and unanswered question will intrigue even the simplest of audiences."
    },
    {
      "rating": "10",
      "text": "This is the one good resident evil movie the rest is bad, its a classic and was great for when it came out the cast just fitted this movie milla is great actress along with the other cast members, this is why I give the movie a 10 on metacritic"
    },
    {
      "rating": "10",
      "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD"
    }
  ],
  "recommendations": [
    "resident_evil_apocalypse",
    "the_last_witch_hunter",
    "silent_hill",
    "silent_hill_revelation_3d",
    "prince_of_persia_the_sands_of_time",
    "doom",
    "underworld_awakening",
    "tomb_raider",
    "lara_croft_tomb_raider",
    "monster_hunter",
    "i_am_legend",
    "rampage",
    "final_fantasy_the_spirits_within",
    "i_am_number_four",
    "underworld",
    "maze_runner_the_scorch_trials",
    "world_war_z",
    "riddick",
    "underworld_rise_of_the_lycans",
    "pandorum",
    "stay_alive",
    "the_conjuring_the_devil_made_me_do_it",
    "devil",
    "priest",
    "hitman"
  ]
}