{
  "id": 2867,
  "title": "Respect",
  "starring": [
    "Jennifer Hudson",
    "Forest Whitaker"
  ],
  "runtime": 145,
  "genre": [
    "Drama",
    "Music",
    "History"
  ],
  "description": "The rise of Aretha Franklin’s career from a child singing in her father’s church’s choir to her international superstardom.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iUtPwOBZJc8uJnDqlCXTibdgxKz.jpg",
  "categories": {
    "plot": 7.142857142857143,
    "acting": 8.423076923076923,
    "ending": 5.0,
    "soundtrack": 9.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "\"Respect\" nos faz questionar porque diabos parece existir um grande espaço entre \"Dreamgirls\" até aqui na carreira de Jennifer Hudson. O que ela precisa para estar em grandes filmes? Mais um Oscar? Sua atuação é o que não te faz tirar os olhos de \"Respect\" nem por um segundo, mesmo que você tenha que ver transições não tão bem executadas, cenas desengonçadas e saídas fáceis do roteiro. Porém, quando Jennifer abre a boca é como uma borracha que quase apaga tudo de irregular que você viu. E, claro, Forest Whitaker também está ótimo. Quero essa dupla na próxima temporada de premiações, viu!"
    },
    {
      "rating": "10",
      "text": "Best film about a musician ever.Jennifer Hudson was born to play the queen of soul, and she gives her all to this role, I hope she wins an Academy Award for this performance"
    },
    {
      "rating": "8",
      "text": "Over the years, we have seen a lot of musical biographies. And we have seen a lot of actors and actresses win awards for their performances.  Jamie Foxx for \"Ray, Joaquin Phoenix and Reese Witherspoon for \"Walk the Line,\" Rami Malek for \"Bohemian Rhapsody, Cate Blanchett for \"I'm Not There,\"  Sissy Spacek for \"Coal Miner Daughter,\" Angela Bassett and Lawrence Fishburn for \"What's Love got to do with it and Renee Zellwegger for \"Judy.\" Jennifer Hudson's performance in \"Respect\" has ALL of them beat... by far."
    },
    {
      "rating": "10",
      "text": "The only word to describe this film is Astounding. Jennifer Hudson knocks it out of the park as the queen of soul, a once in a lifetime perfomance, capturing every aspect of Aretha's life so well that it's hard to imagine anyone but her playing her. Apart from JHud's crowning jewel, and marvel, the supporting cast is simply on"
    },
    {
      "rating": "10",
      "text": "Brillant and extraordinary. Jennifer Hudson gives the best performance of 2021, and if there's any justice for women of color at the white people's awards (a.k.a Oscars) she should win Best Actress"
    },
    {
      "rating": "10",
      "text": "Jennifer Hudson was so electrifying portraying the Queen of Soul. She entrances you into forgetting it’s her on the screen. Instead of mimicking the source, like some actors in biopics, she hammers the essence and genius of Ms. Franklin through a pivotal time in her illustrious career. Her singing these songs LIVE and not to a prerecorded track cements her performance as a contender for an Oscar. I would go as far to say she deserves the Oscar barring some monumental performance of a lidtetime."
    },
    {
      "rating": "0",
      "text": "So boring , Is like a cheap karaoke...Jennifer is playing like her last Oscar winning caracther , no versatility"
    },
    {
      "rating": "4",
      "text": "Jennifer Hudson es una artista inmensamente talentosa, hace bien su papel, pero no para impresionar demasiado, fuera de eso es la música lo único que puedo rescatar ya que no es una película que pueda trascender como si lo hizo Bohemian Rhapsody, es demasiado dispersa en cuanto al guión y su planteamiento y parece no tener un enfoque en concreto que se vuelve soporífera al punto de sentir alivio una vez que todo se acaba."
    },
    {
      "rating": "8",
      "text": "After quite a wait, RESPECT came out and was an enjoyable film for the most part. Jennifer Hudson hit a home run at every turn in this film and truly took my breath away multiple times, sending shivers down my spine with how wonderful her voice was (I mean what else could we expect from one of the best voices of our time)!The film touched on some very impactful moments of Aretha's life, which is to be expected in a biopic.  However, it did seem to fail in the area of her relationship with her children.  It portrayed Aretha as perhaps one of the worst parental figures of our time basically having the children just on the outskirts of the film the entire time.  You never really see her spend time with them except for a few scenes and in the rest they're background characters and rarely alluded to or mentioned.  It was a big misstep as far as direction goes.  Children shouldn't be counted out as major plot points of a biopic ever.  The remainder of the cast did a pretty great job with the film as well.  I was glad that they took some sensitive early moments and portrayed them the way they did instead of using a graphic depiction.  It was, to me, more impactful this way. Overall, I'd say the film did a great job, but definitely had some misses and opportunities to be better.  Some portions of her life they seemed to dwell on at times and it would last much too long, when other moments that may have seemed very important were dealt with much quicker and could have been longer instead of others in the film. I look forward to having this film at home, but it is certainly one that needs to be seen in the theater sheerly for the sound design.  The music all felt live and really utilized the surround sound technology to encompass the audience completely in a wonderful experience."
    },
    {
      "rating": "7",
      "text": "It seems like so long that we've been talking about this Aretha Franklin biopic coming out, and now, it's finally here. Yes, Streamers, Respect was released in theaters this weekend - almost 3 years to the day after the Queen of Soul left the building. Many know the highlights of Ms. Franklin's story, but now, Jennifer Hudson get to to flex her singing and acting chops to honor this musical legend. Let's see how she does.In Respect, we get a glimpse of Ms. Franklin's life from the precocious musical prodigy through the tumultuous times until the triumphant and transcendent production of her \"Amazing Grace\" recording. The plot of a biopic can be cliched and filled with tropes that bog down biographical movies. Respect is no different. Even though these tropes depict what occurred in the subject's life, it would be interesting if one of these musical biopics found a way to tell its story without dwelling on what's already been told. Nevertheless, in this one, there is the no-good husband, there is the domineering and indulgent father, there is the sexual abuse, there is the alcohol abuse and there is the \"come to Jesus\" moment for Ms. Franklin. Although the film is packed with biopic cliches, at least, each step of the way is enjoyable and well-told. Since the story is not told in any novel way, it really is just about the music and the performance by Jennifer Hudson that make Respect worthwhile.Yes, Jennifer Hudson won an Oscar for playing Effie White in Dreamgirls. That was a performance that built to one moment of singing that most likely clenched that award for her. I can't say there was a lot of \"acting\". Here, Hudson gives a valiant effort in playing Ms. Franklin. She does a good job of finding her speaking voice and physical mannerism. There is a lot of \"respect\" in this performance. But, you really came for the songs and the singing; and that's where Jennifer Hudson truly kills it. She doesn't sound like Ms. Franklin, but Hudson sing all of the feeling and bombast in each song. She's great.I will say that the film is kind of long. It takes a while to get going, but it picks up around the time Ms. Franklin starts arranging \"Respect\". Once the hits start rolling, the soundtrack takes over and time starts to pass much more quickly. The movie devolves into a highlight reel of the Aretha hits a bit, but that's not much of a complaint when the songs and singing are as good as they are. You'll rarely be bored even if you know where it's going and how it will get there. But, that's a biopic for ya!Ultimately, Respect is just another biopic about a musical legend. There isn't anything new or interesting in the storytelling as it seems all musicians have taken the same life journey. Jennifer Hudson is a good reason to see Respect with her interesting performance as Ms. Franklin and her considerable vocal talent. As the hits start rolling through, Ain't No Way I Think you should miss this, Chain of Fools. Respect that with a box of popcorn."
    },
    {
      "rating": "10",
      "text": "Amazing with Jennifer Hudson coming for that Oscar brillant, great, fantastic, amazing"
    },
    {
      "rating": "10",
      "text": "Jennifer Hudson is going to be the first Black woman of win multiple Oscars, by winning Best Actress and Best Original Song period"
    },
    {
      "rating": "10",
      "text": "Jennifer is Amazing thank you for this incredible movie for the Queen of soul"
    },
    {
      "rating": "10",
      "text": "Oh my goodness this movie is AMAZING and everything about this movie is PERFECT. The chemistry between Audra McDonald and Skye Dakota Turner was amazing and it was so beautiful to see the chemistry being carried on later in the film with Audra and Jennifer Hudson. Despite only sharing one scene, they made it feel like they've known eachother their whole lives and they share a true mother-daughter relationship. Watching Forest Whitaker and Jennifer and even seeing the bond that Aretha and her sisters had was so beautiful. I was completely captivated by the movie that my eyes were just glued to the screen! Watching Aretha's development was so special because we see her starting out as timid but later, we see her discovering her voice and realizing that she's got this. Seeing that scene where Aretha was done with Ted for the last time and when it cut to her singing \"Think\", it was really a testament to her development. The movie was a huge reality check for me because it made me realize that Aretha had her demons and was human just like the rest of us. At times, it was really cool to realize that the movie was an actual movie because I felt so immersed in Ms Franklin's life that I felt like I was actually there. There were many scenes where I was on the brink of tears and one of the best scenes throughout the movie was the Amazing Grace scene. It was so emotional seeing Aretha surrounded by everyone closest to her while she sung what she wanted to sing. Seeing Tituss Burgess as Reverend James Cleveland interacting with Aretha really packed a huge punch because of their bond. It goes without saying that the music and singing was perfect, and to see how Aretha's mind would always be thinking about music really showed her artistry. No matter how small the role, you can definitely see the blood, sweat and tears put into the making of this film and Liesl Tommy REALLY outdid herself by directing this movie so magically. Thank you to everyone involved in the making of this film, from the prop team to the set makers and to the actors themselves. You've depicted the Queen's life so wonderfully and I look forward to watching this classic a 100 more times in the future and listening to the soundtrack for evermore."
    },
    {
      "rating": "5",
      "text": "I expected more from this movie. Jennifer's and Marlon's performances felt forced. They didn't embody their roles and become their characters. My favorite part of was Jennifer's singing in church her voice sounded great just wish her and Marlon's acting was up to par. Because that would have made the movie better. I think the Genius series about Aretha did better job at telling her story in a more honest and compelling way it's just a shame Aretha's family wasn't apart of the series. I wish this movie was better especially since Aretha handpicked Jennifer to play her in her bio pic."
    },
    {
      "rating": "6",
      "text": "This version was “authorized” by Franklin, who blessed Jennifer Hudson for the title role. There are similarities and vast differences in this 2:30 version vs. the National Geographic series Genius: Aretha. That one spent more time on the early gospel circuit, while this one just references it, along with virtually no mention of the years after the LP/movie Amazing Grace. That’s because the NatGeo project was produced by Clive Barnes, who apparently saved those records for his series. After moving from her childhood (featuring spectacular vocals from Skye Dakota Turner), this movie follows Franklin as she rises to fame. Those sequences are like a concert with Hudson singing Franklin’s early hits almost back to back. The singer’s troubled personal life is chronicled with extended segments dragging down the pace. Of course, Hudson nails the songs with power and her dramatic segments are her strongest work yet. Forest Whitaker (as her father) is OK, while Audra McDonald (as the mother) makes a magnificent impression in her brief scenes. Anyone looking to learn more about this icon will certainly find new information, but as a dramatic experience, the film is a \"respectable\" biopic."
    },
    {
      "rating": "5",
      "text": "Every musical biopic besides Rocketman and Straight Outta Compton is just Walk Hard: The Dewey Cox Story in a different coat of paint and cast…"
    },
    {
      "rating": "8",
      "text": "When telling the life story of an iconic and complicated figure like Aretha Franklin, it can be difficult to get everything right. Decisions regarding what should and shouldn't be included can be fraught with difficult choices, some of which will undoubtedly disappoint while others will be perfectly spot-on. Considerations like these almost assuredly had to have gone into the process of devising the narrative and screenplay for the biopic of this storied entertainer and activist, the result of which has drawn decidedly mixed reactions. For my money, however, director Liesl Tommy's debut feature mostly gets it right, especially in the outstanding Oscar-worthy lead performance of Jennifer Hudson, the supporting portrayal of Skye Dakota Turner as Aretha's younger self and the musical numbers, all of which are absolute knock-outs. Admittedly the film is somewhat formulaic (some might say predictable or even trite in certain sequences) and a bit overlong in its attempt to capture as much of Ms. Franklin's life story as possible. Nevertheless, in the greater scheme of things, \"Respect\" is a capably made, exceedingly entertaining offering that's far from deserving of most of the petty sniping that's been directed its way. Doing justice to the Queen of Soul is a daunting prospect, to be sure, but I find it difficult to believe that she would be disappointed by the results."
    },
    {
      "rating": "6",
      "text": "It was ok for me - yes Jennifer Hudson was good in the role and yes Aretha Franklin deserved her own movie, but maybe because I, while knowing of her biggest songs, don't know much about the rest, the story was a bit boring at times - I see why fans would love it, but for me just because it is a film about legend doesnt mean it will be my favorite."
    },
    {
      "rating": "6",
      "text": "There are good biopics, and there are some very bad ones that only take advantage of the person's name and their life.They will make some real parts of it, and they'll fictionalize some others.In Respect the problem lies with the script.Jennifer Hudson faces the challenge and does it quite well. Her work is not at fault here.The problem that comes with the script is its inability to know how to give it an adequate balance.Not a minor issue, but isn't a catastrophic one either.However, I have a problem that I really find extremely tiresome, and it has to do with many professional reviews that use the same poor argument that this is a movie that plays it safe and doesn't do justice to a figure like Aretha Franklin.Are you telling me that with 140 minutes they are going to cover an artist like Aretha Franklin?That may sound interesting and pretentious for their editor-approved writing, but to some people with more than basic knowledge about her, that just sounds stupid.Unless you're expecting a whole retelling of her life and career, then Respect is a decent enough film."
    },
    {
      "rating": "6",
      "text": "(Mauro Lanari)Just the fact that the first emotion comes after 52 minutes with Hendrix's \"Hey Joe\" is not auspicious. From that point on, Aretha's story is scripted in a remarkable mix of private and public life, family or sentimental relationships and her commitment as an activist in political-civil battles in favor of women and coloureds. It is also remarkable how this is translated into the making of her music, into the composition of her songs. The unexpected trouble is that artistic intuition is not transfigured into spiritual intuition, paradoxically due to the excess of scenes and dialogues on her religious roots. If so, then the problem would be caused by the debut director with a still too immature, flat and anonymous style."
    },
    {
      "rating": "10",
      "text": "What Jennifer Hudson achieves with this perfomance is otherworldly, her portrayal of Aretha Franklin is legendary, and the film is extraordinary"
    },
    {
      "rating": "10",
      "text": "In one word Jennifer Hudson reincarnates Aretha Franklin to life, what she brings here is beyond magical and I pray for her winning the awards for this performance"
    },
    {
      "rating": "10",
      "text": "Bringing an incredible mix of gestural subtlety and musical power, it cannot be said enough what Hudson achieves here by transmitting a rich sense of interiority, staying true to who Franklin was in private with every look given, word spoken, and melisma sung"
    },
    {
      "rating": "10",
      "text": "Jennifer Hudson performance is Oscar worthy in 2022.  The soundtrack is also worthy of a Grammy."
    },
    {
      "rating": "10",
      "text": "Jennifer Hudson completely transformed  into the Queen of Soul rendering a raw, nuanced(yet powerful), vulnerable performance. The film itself is stunning, and tastefully done. As an Aretha fan, I appreciated the LIVE music and vocals. Thank you Liesel Tommy for truly honoring our Queen’s legacy.⭐️⭐️⭐️⭐️⭐️"
    },
    {
      "rating": "10",
      "text": "Amazing movie. Jennifer Hudson embodied Aretha. It a must see movie. The movie show a beautiful story  about Aretha and all she went through."
    },
    {
      "rating": "10",
      "text": "What a way to tribute our Queen. Oh my God you will have to get your family to watch this movie. This movie is a must see. You will laugh, cry and praise God like you are in church. This uplift my soul and Jennifer embodied the essence of Aretha beautifully."
    },
    {
      "rating": "10",
      "text": "This movie was incredible and Jennifer Hudson nailed it as Aretha Franklin something Cynthia Ervio couldn't do at all. It is a must see because this was done with Respect and with Aretha knowing about it and not waiting for Aretha to die and disrespect her wishes by doing something behind her back and excluding her family from the process."
    },
    {
      "rating": "9",
      "text": "Um filme muito bom.Espero que ela seja indicada ao Oscar porque ela realmente merece."
    },
    {
      "rating": "9",
      "text": "Learning of Aretha's activism was inspiring in my current walk. Costuming was beautiful. Jennifer Hudson performance was powerful. I hope they hat therapists on set because film had a lot to unpack in terms of American history and trauma."
    },
    {
      "rating": "10",
      "text": "Bring tissues!  I cried three times during this movie.  Jennifer Hudson absolutely KILLS it in this!  In the theater I was in, everyone clapped at the end.  Amazing movie!"
    },
    {
      "rating": "10",
      "text": "This movie is amazing!!! Jennifer Hudson did a amazing job!! I’ve seen interviews with The Queen Aretha Franklin and whew!!! Jennifer Hudson nailed it."
    },
    {
      "rating": "3",
      "text": "A paint by the numbers biopic that doesn't really say much about the life of Aretha Franklin. Jennifer Hudson gives a competent performance, but the generally superficial script limits what Hudson can do. Aretha Franklin deserved a better cinematic tribute, but the influence Franklin undoubtedly had over the film is what makes the film mediocre. I would've preferred an honest depiction of who Franklin actually was, not who the real Aretha Franklin wanted us to think about her."
    },
    {
      "rating": "8",
      "text": "Jennifer Hudson gives an admirable performance in RESPECT. Highly entertaining and full of life, this is a beautiful biopic fit for the late Queen of Soul, Aretha Franklin. Bravo"
    }
  ]
}