{"id": 4388, "title": "Return to the Blue Lagoon", "starring": ["Milla Jovovich", "Brian Krause"], "runtime": 98, "genre": ["Adventure", "Drama"], "description": "In this sequel to the 1980 classic, two children are stranded on a beautiful island in the South Pacific. With no adults to guide them, the two make a simple life together and eventually become tanned teenagers in love.", "releaseYear": "1991", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jhUTLuPgc3Qcvr5xtji8oiWSfYy.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 8.0}, "reviews": [{"rating": "8", "text": "I feel like I shouldn't love this movie but I do. I wasn't a big fan of the original film a found it a tad boring and depressing bit I loved this sequel. It's more hopeful and engaging. Picking up right after the first film's events. The boat is found by a passing ship and only the baby has survived. The only woman on board takes charge of young Richard until suddenly they are forced off board with another crewmember, her daughter and Richard because there is an outbreak of cholera. After days at sea with no hope the crewmember tries to throw the children overboard and she kills him. Soon after they arrive at the island from the first film and grow into a handsome Brian Krause (Sleepwalkers) and the gorgeous Milla Jovovich (Resident Evil). Along the way incidents happen and soon enough they are faced with civilization. It's all dramatically engaging, romantic and suspenseful at times. It all moves forward towards a thrilling climax. The movie is shot gorgeously with solid performances. It still holds up as a intriguing romantic adventure.Budget: $11mBox Office: $2.8m4.25/5"}, {"rating": "6", "text": "Aunque tiene una historia muy simple, no es tan mala como dicen y se puede disfrutar."}], "recommendations": ["greta", "prey", "evil_eye", "the_manor", "the_space_between_us", "the_rhythm_section", "lady_macbeth", "deep_impact", "the_way_back", "the_craft", "the_water_man", "flightplan", "monte_carlo", "the_marksman", "no_escape", "land", "the_age_of_adaline", "everest", "the_autopsy_of_jane_doe", "hotel_artemis", "tracers", "identity", "panic_room", "the_lost_city_of_z", "cast_away"]}