{
  "id": 2808,
  "title": "Return of the Living Dead III",
  "starring": [
    "Melinda Clarke",
    "J. Trevor Edmond"
  ],
  "runtime": 97,
  "genre": [
    "Horror",
    "Drama"
  ],
  "description": "Having recently witnessed the horrific results of a top secret project to bring the dead back to life, a distraught teenager performs the operation on his girlfriend after she's killed in a motorcycle accident.",
  "releaseYear": "1993",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dfFY2ZlCUyoWpUGKHKoTzq2Yd9C.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "I really don't know why I bothered with this one considering I did not like the first two at all but I still watched it and hated it just as much as I did the others. Once again, the plot is poor, The acting is weak and there is far more focus on the living than there is the dead. This trilogy is simply bad. There's no way you can really defend them."
    },
    {
      "rating": "8",
      "text": "It looks a little cheap and the army base is unconvincing. The aspect ratio is ugly. The sound is fine. The practical effects are totally awesome. Technically ample would be my summary. This movie is insane. If you are into piercings then you would love this. The characters are nuts but fascinating. It matches the nutty gore. I love how insane this movie is. It is funny, gory, stupid and so entertaining. This is the craziest stuff ever. Up there with The Evil Dead (1981) and Braindead (1992)."
    }
  ],
  "recommendations": [
    "leatherface",
    "robocop_2",
    "transformers_revenge_of_the_fallen",
    "immortals",
    "van_helsing",
    "legion",
    "jason_x",
    "anaconda",
    "army_of_the_dead",
    "the_green_inferno",
    "ghost_rider_spirit_of_vengeance",
    "underworld",
    "polar",
    "day_of_the_dead_bloodline",
    "the_nut_job",
    "priest",
    "cabin_fever",
    "twilight",
    "hellbound_hellraiser_ii",
    "battleship",
    "mortal_kombat_annihilation",
    "siren",
    "clown",
    "blade_trinity",
    "the_bye_bye_man"
  ]
}