{"id": 4572, "title": "Revolt", "starring": ["Lee Pace", "Bérénice Marlohe"], "runtime": 87, "genre": ["Science Fiction", "Action"], "description": "The story of humankind's last stand against a cataclysmic alien invasion. Set in the war-ravaged African countryside, a U.S. soldier and a French foreign aid worker team up to survive the alien onslaught. Their bond will be tested as they search for refuge across a crumbling world.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/eM2zipCkAXhp0BZF2noDp7bRFgV.jpg", "categories": {"plot": 4.0, "acting": 4.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "Quite enjoyed this. Decent plot, some good CGI and a fair few twists and turns. I also feel it benefited from setting it in Africa rather than a western country. Just a shame they got rid of Bérénice Marlohe half way through; would have been nice to have seen the two protagonists reunited at the end."}, {"rating": "10", "text": "excelente fiction, good history, likes persons, studio indie!! very nice film"}, {"rating": "4", "text": "A lazy entry into the sci-fi/alien invasion genre.Lee Pace is competent enough as the main character, but overall it was dull and lacking in thrills."}, {"rating": "4", "text": "Revolt could be said that is a combination between Rambo, The Walking Dead and a generic science fiction movie, but it does not achieve anything, staying halfway. The story is very cliche, the characters are not interesting at all, there are incongruous data (such as the fact that in one scene a robot resisted 3 missiles but then later people knocked it down), or a lot of unexplained things! Why did the ship capture people? How did the invasion start and why? Why was Bo locked in a cage? Why the robots choose him? Why did they put that \"device\" on? It is a shame! The only thing that more or less saves him are certain moments of action, but nothing more. I'm not saying that I can't get to entertain in some parts, but I can't recommend it"}], "recommendations": ["the_last_days_on_mars", "captive_state", "spectral", "monsters", "pacific_rim", "battle_los_angeles", "reign_of_fire", "sunshine", "predators", "alien_outpost", "riddick", "elysium", "aliens", "the_tomorrow_war", "kong_skull_island", "alien_covenant", "jurassic_world_fallen_kingdom", "daybreakers", "resident_evil_apocalypse", "world_war_z", "surrogates", "prometheus", "abraham_lincoln_vampire_hunter", "the_girl_with_all_the_gifts", "mortal_engines"]}