{
  "id": 4061,
  "title": "Revolutionary Road",
  "starring": [
    "Leonardo DiCaprio",
    "Kate Winslet"
  ],
  "runtime": 119,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "A young couple living in a Connecticut suburb during the mid-1950s struggle to come to terms with their personal problems while trying to raise their two children. Based on a novel by Richard Yates.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/63PKnmHjaDcTAjZIfj6bWVN8gvw.jpg",
  "categories": {
    "plot": 7.071428571428571,
    "acting": 7.333333333333333,
    "ending": 8.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 9.666666666666666,
    "action": 9.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Easily the best film of 2008. It is SO annoying that a film that tackles the subject of sububan unhappiness is getting such low scores from those who think it is too depressing. Life can be depressing! To assume that all films should be happy and void of emotions such as loss, fear, emptiness, sorrow and regret would make going to the movies a bore. Mendes is a master filmmaker and this ranks as one of his best works. This film is only for those who can appreciated the mastery of a genius director and actors at the top of their game!"
    },
    {
      "rating": "10",
      "text": "One of the most undiluted, bravest and incredible films i have ever seen. You feel the tension, hate, love and thanks to Sam Mendes, the killing blow which is the lie of the perfect american dream which can be found without problems. The film is so devastating andit will leave you sitting in your seat pondering the film, letting the feeling sink in...just like any masterpiece should."
    },
    {
      "rating": "10",
      "text": "This is a top ten movie of the 21st century so far, and a top 100 movie of all time. Where do I begin? Very rarely have I ever seen three characters so well developed as in this movie. Kate Winslet plays an aging, failing actress, while Leonardo DiCaprio plays a former soldier, now working in an office, just like his father did. The two eventually gather up the courage to realize where their lives are, in comparison to what they thought their lives would've been like. Michael Shannon plays the son of a neighbor of theirs, who is the only person who understands their situation. He is seen as crazy, and even Kate and Leo's characters start to come off that way to their friends. Each scene is so realistic, and the more you can relate to it, the stronger the emotions are. I am envious of the life of the reviewer who said this movie wasn't realistic. I feel like everybody sees themselves as special. After all, we are the stars of our own lives. This movie is about realizing you're not. It's difficult to put into words. The poignancy of the movie should speak for itself. The fact that some people don't appreciate this movie makes the movie even more real to the people who do. Even though this movie takes place in the 50's, and is a commentary to what domesticity was like back then, it is actually timeless. There will always be people who don't understand how the life that might seem ideal to most people, actually can feel like a prison to others. The former are the majority, and the people who are lucky, and will not feel this movie's pain, or the pain of the novel upon which this movie was based, while the latter are the people who could be motivated by this movie to change their own lives."
    },
    {
      "rating": "9",
      "text": "One of the most devastating trials of a couple in film history. It's always honest and, certainly, painful - but we feel for these lovers like none other. Kate Winslet and Leonardo DiCaprio are magnificent."
    },
    {
      "rating": "10",
      "text": "This is a great movie and a serious movie for adults. I think the bad ratings come only from those audience members who constantly want \"escape\" rather than deepening. I think Leo DiCaprio and Kate Winslet are in top form here, and Kathy Bates and Michael Shannon are terrific in supporting roles. There isn't a single scene or moment that rings false. It's not a nice holiday movie, but a tragedy very well-observed by Sam Mendes."
    },
    {
      "rating": "8",
      "text": "A beautiful, heartwrenching film with signature performances from Kate Winslet and Leonardo Dicaprio. Sam Mendes delves honestly into a marriage that is running on empty, without the hopes and dreams it started out with. Every credit in this movie is flawless and I am baffled by the Academys indifference to it. It is not a cold heartless movie but a tragically real and honest film."
    },
    {
      "rating": "9",
      "text": "Sam Mendes is at his best with this kind of subject matter. Revolutionary Road is probably his best work since American Beauty, although I loved JarHead as well. I was deeply moved by this movie and it was extremely pressing for me. I felt almost nauseous at the movie theatre at times. It was very tragic, but sadly so true. Revolutionary road has a great cast and Leonardo DiCaprio and Kate Winslet have amazing chemistry on screen as we have seen before in Titanic over ten years ago. I was actually thinking that this movie is almost like sequel to Titanic. What if Jack wouldnt have died? I also want to give extra credit for Michael Shannon, who well deserved his Oscar nomination. In this world where societies norms dictate how people live their lives the only sane person was the the crazy person. So it raises the thought that was he even crazy or was he the only normal one in the whole film? Shannons character sums up the whole theme of the movie and he said all the things that people are afraid to say, or even think."
    },
    {
      "rating": "10",
      "text": "It's a beautiful film ! Oscar for diCaprio !!!"
    },
    {
      "rating": "9",
      "text": "This is a wonderful picture for adults, with a fantastic cast all the way around-- Winslet strong as hell and DiCaprio continues to be just mindblowingly good (how lucky we are to have a working, young leading man of this gigantic talent, with great taste, and who isn't crazy). No, it's not a chipper romp, it's art. The kind that Kafka says we should seek to wound and stab us and act as an ax for the frozen sea inside. This movie stands at the opposite pole from the laughable tripe that is \"blah, blah Benjamin Button,\" against which it competes, and dwarfs with its scalding dignity."
    },
    {
      "rating": "10",
      "text": "Can people really find their authentic selves? Are communication and love possible or are people doomed to live in their own little ego-shells? The two characters in this film struggle with these questions. Not a happy movie, but pretty true to the soul of its subject matter. Most people simply won't like this movie because they prefer not to deal with these hard existential matters. I don't think anyone involved in the making of this movie was out to win a popularity contest."
    },
    {
      "rating": "10",
      "text": "This film is one of the best of 2008 and one of the bests i've ever seen. Sam Mendes is a great director, that makes you get every detail in the film. Winslet gives an stunning performance as well as her good friend leonardo Dicaprio. They both deserved an oscar nomination for this film, and the film itself deserved it for best picture, just as in the Golden Globes! C'mon it is better than MILK! Anyway, it is a great movie, with intense dialogue and characters. Mise-en-scene is excellent and the atmosphere felt in this movie is unbelievable!"
    },
    {
      "rating": "10",
      "text": "Outstanding! Winslet gives us the performance of the year!"
    },
    {
      "rating": "8",
      "text": "Powerfully acted, Kate Winslet is excellent, but the entire cast is outstanding. God attention to period detail, very well written and directed. The film never loses focus and is always interesting."
    },
    {
      "rating": "10",
      "text": "Masterpiece. Its gonna do ZERO box office, though, cause with today's climate it might cut too close to home for a lot of people. This isn't the time for going to the movies and watching films about utter hopelessness and the vacuous lie that is the American dream."
    },
    {
      "rating": "9",
      "text": "This is an intense heartwrenching examination of a marriage flying to pieces.  The characters fight about things that are so silly but at the same time so tragic and real.  Despite the serene environment of a 1950s Connecticut suburb this is a frighteningly dark film."
    },
    {
      "rating": "7",
      "text": "This movie features great performances from both Winslet and Dicaprio alike, but it is as hard to get through as trying to break a 5 meters long brick wall in only 5 seconds. Dumb comparison, but it isn't as unsatisfying as the end to this movie; \"whimsical\"."
    },
    {
      "rating": "10",
      "text": "It's almost hard to believe that \"Revolutionary Road\" is 10 years old at the time of writing this review. This is definitely a very realistic film that hit very close to home for me in particular. Anyone who deals with a suburban life or an unhappy relationship will have a lot of empathy for our two leads, Leonardo DiCaprio and Kate Winslet, who honestly give amazing performances. I think Revolutionary Road will get even better with age, if that is at all possible."
    },
    {
      "rating": "10",
      "text": "Obra maestra, grandes actuaciones, el tiempo dejara en claro que esta es una mejores peliculas del año y de la decada, kate winslet en el mejor papel de su carrera y del año, ella merece el oscar. di caprio excelente tambien merece el precio o al menos la nominación, los secundarios de lujo. al igual que la ambientación, la musica de tomas newman me dejo con los pelos parados en el momento final.\run final devastador, me encanto la pelicula"
    },
    {
      "rating": "1",
      "text": "While I haven't read the book (which is supposedly a lot better) on which the movie is based, in contrast with the problems in the world you can't help thinking there is something contrived about April and Frank's desperation for a better life. Few people are doing what they dream about, but most stuff their disappointment, count their blessings and muddle on. In this case the couple have no financial or medical problems, two healthy children, and are barely thirty years old. Realizing (as in the case of the Kate Winslet character) that you will never be a great actress, and in the case of Frank a great something else (he admits he has no clue as to what that would have been), being a rite of passage makes it hard to sympathize with the premise that if they just moved to another country (with April working as a secretary and Leo becoming a stay at home Dad), their dreams would fall into place. I would have found the premise even more irritating had the movie not been so relentlessly depressing, from the first scene - to especially - the last. Cyanide pills all around - sheesh!"
    },
    {
      "rating": "0",
      "text": "I find myself in the unique position of having watched a movie that was beautifully acted, deirected, and shot, and absolutely hating it. Why did anyone feel that this grim, proudly sad movie that trumpeted the hopelessness of the 50s housewife needed to be made? I would rather go see drivel like Inkheart. At least then I wouldn't leave the theater feeling just as empty as these people did."
    },
    {
      "rating": "0",
      "text": "Words cannot begin to describe how much I despised every cringe-indusing, eerie-feeling second of this film. Not even the wonderful Kate Winslet is wonderful, in fact she's pretty bad, just like the rest of the cast. Also, how did Michael Shannon get a nomination? He didn't even belong in the film, and he was painful to watch."
    },
    {
      "rating": "2",
      "text": "You basicaly watch two people in a fake relationship argue for an hour and a half."
    },
    {
      "rating": "0",
      "text": "Never have I seen a more selfish, ungrateful and disgusting set of people. What is so wrong with their life? I can't believe their behavior. This movie is all fake and wrong. It's all too painfully pretentious and self-aware. For god's sake it's called being thankful for what you have and if you aren't it's called a DIVORCE!!! Get over yourselves."
    },
    {
      "rating": "0",
      "text": "This movie was extremely boring. I kept waiting for something to happen but nothing did. Don't waste your time."
    },
    {
      "rating": "0",
      "text": "Revolutionary road is the worst film of the year.Di Caprio makes the worst performance of the year."
    },
    {
      "rating": "0",
      "text": "Without question the worst movie I have seen in years, almost without redeeming features. An unbelievable plot, a hyper-exaggeration of suburban angst, with characterisations lacking in warmth and softness, the perfunctory callous sexual scenes unsizzlingly pornographic - as if all these things were clever or artistic to set out thus. I often like Kate Winslett's performances, in fact as she's a distant cousin I am predisposed to approve, but even that can't elevate this movie to adequacy. If you are contemplating suicide, breakup or mental breakdown, by all means go for it, it will nicely help you on your way; otherwise, do yourself a favour and stay away.How this ever got nominated for awards is amazing to me, a testament perhaps to the \"Emperor's New Clothes\" effect."
    },
    {
      "rating": "2",
      "text": "Despite having at its source a critically acclaimed book and the casting of several usually good actors in key roles, this dreary venture had me wishing that for once they had tossed Rob Schneider (under less urgent circumstances, by no means my favourite comic) into the mix for some relief. As it is, thank Kathy Bates for providing the only light refreshment as the one character who appears at home in her role. The delivery is stilted and stagey and the supposedly 1950's dialogue, set and props are rife with anachronisms, at times humorously so but more often just jarring (even a bad episide of 'Mad Men\" is more authentic). If you're intrigued by the possibilities of the wife's take on a well-worn Death of a Salesman theme, read the book; you won't want to after seeing the movie."
    },
    {
      "rating": "2",
      "text": "A good film If you want to take a nap. or sleep profoundly! My God! I can't belive I spent THREE hours of my day watching it!"
    },
    {
      "rating": "3",
      "text": "Very depressing from start to finish and was disturbing in the end."
    },
    {
      "rating": "5",
      "text": "Here is another example of a fine novel poorly translated by Hollywood. Although it is beautifully filmed and beautifully acted, this movie ultimately lacks the heart and sensitively crafted innuendo of the novel,. leaving the viewer totally indifferent towards the characters."
    },
    {
      "rating": "5",
      "text": "Revolutionary road is neither a good film nor a bad film. It is good because the actors are amazing and it is bad because it has gaps in the plot and some things happen for no reason and they are not explained or even discussed in the film. Leonardo Dicaprio, Kate Winslet and Michael Shannon  were great. The plot and what was happening in the film was not well done and it had serious gaps. Such a shame as it could have been a much better drama"
    },
    {
      "rating": "6",
      "text": "\"Revolutionary Road\" is only poignant (as a movie) for its commendable investigation into the suffocating nature of suburbia and its ability - somewhat - to imbue its audience with the necessary degree of pessimism to escape it; cinematically, however, this movie fails on several counts: it fails to escape - or provide a nuanced version - of the traditional narrative of the 'couple,' it fails to provide any worthy performances, and it fails to do any justice to its laudable inspiration: Richard Yeates' arresting 1961 novel."
    },
    {
      "rating": "5",
      "text": "Usually, I love this sort of movie, but this one left me cold. The dialogue is too stilted. They don't sound like real people. It's a shame, because basically I like the theme of the story, but the director tends to hit you over the head with it. It's a shame, because it's a waste of a wonderful cast."
    },
    {
      "rating": "9",
      "text": "Great movie with incredible acting and a very believeable 50's setting. This one is sure to garner several Oscar nominations...and it deserves every one!"
    },
    {
      "rating": "9",
      "text": "Amazing performances!"
    },
    {
      "rating": "5",
      "text": "A predictable disappointment , if such a thing is possible. First, what must have seemed like shocking material in the '50s (adultery! abortion! -- all lurking just below the surface of affluent post-war suburbia) is ho-hum today. Second, Mendes is just too enamored with surfaces -- the movie should win costume and art direction Oscars -- to get at seem underbellies. As far as the performances go, you have to admire the chutzpah of casting the protagonists of one of the most iconic screen romances in cinematic history in these roles. But precisely because they have to overcome our expectations generated by Titanic, the performances call attention to themselves -- they are most definitely crafted -- in a way that I found distracting. Michael Shannon as the \"village crazy who speaks the truth\" has a pair of great scenes, but all said maybe Oscar got it right in largely ignoring this one."
    },
    {
      "rating": "9",
      "text": "If you're looking for Yellow Brick Road, you may not appreciate Revolutionary Road. But, if you're interested in the \"human heart in conflict with itself\" (Faulkner) as well as excellent performances and precise direction, you will agree that Mendes' film is a masterpiece. This film is for all of you that wish you had a hearing aid to turn down while Hellboy 2 is playing in the neighboring theater....."
    },
    {
      "rating": "10",
      "text": "Really intelligent, comprehensive, engaging and tragic just asit was intended to be."
    },
    {
      "rating": "9",
      "text": "I love this movie, in a screwed up kind of way because it so impressively comments on how even the couples that are put on pedestals have their own secrets behind closed doors, very somber and unnerving throughout but really well done."
    },
    {
      "rating": "8",
      "text": "Great acting for people who like realistic depictions."
    },
    {
      "rating": "10",
      "text": "One of the bravest films I've seen.. no easy answers provided for the audience.. anyone who thinks these 2 characters are merely \"delusional\" are either deliberately and crudely trying to white wash what this is about, or, sadly they just dont get it"
    },
    {
      "rating": "9",
      "text": "This is a very thought provoking movie about the human condition, the difficulties of intimacy, the struggle to find meaning in life."
    },
    {
      "rating": "9",
      "text": "I totally got it. I don't think it is a movie people in general would get because it is for women who want/ed out of the ''standard''. The line where she says that they had another child so that it is clear the first one was not a mistake, WOW, that was so powerful."
    },
    {
      "rating": "7",
      "text": "This movie is good. It's also a bit over the top and melodramatic. DiCaprio and Winslet are good actors, but I honestly didn't buy them in either role; I felt I was aware I was watching actors the entire time. I don't want to be too negative, because there are some very good moments in the film, and the opening minutes are especially good. However, I personally felt the film just came up short of its (quite huge) potential."
    },
    {
      "rating": "8",
      "text": "Heartfelt and heartbreaking, \"Revolutionary Road\" stayed with me long after I left the theater."
    },
    {
      "rating": "8",
      "text": "Winslet is outstanding - and makes the movie worth the price. Led to great ranging debates in our house, women, men, relationships, dreams, socialisation and so on. But there is little in the chracters to like and less to love. Beautifully shot."
    },
    {
      "rating": "5",
      "text": "not a strong adaptation. would be better off on the stage. mediocre acting at best by both leads, and i found the music irritating as it directly echoed the \"american beauty\" soundtrack from 1999. the \"new yorker\" review basically sums it up for me."
    },
    {
      "rating": "6",
      "text": "Winslet almost singlehandedly blows the movie with an overly enunciating impression of a 50's housewife as accurate as a Gwyneth British accent."
    },
    {
      "rating": "4",
      "text": "The 4 is only for the art direction and costumes. The script was glacially paced, ponderous, and predictable. Dialogue was stagey, melodramatic, overwrought , and so on the nose that it made mine hurt. Winslet and diCaprio tried, but Mendes should have had them tone down the screaming. At least when I saw Who's Afraid of Virginia Woolf? on TV I could stop i watching it. This, I paid 9 bucks to see so I had to stay till the bitter end. And how stupid was diCaprio's character in their last scene not to think Winslet's was going to kill herself?"
    },
    {
      "rating": "9",
      "text": "I think all the folks negatively reviewing this film are calling it too \"depressing\" but as far as I'm concerned, that is what the film was trying to achieve. There is no shining light in this film. Its about two people who will never care to understand each other nor will they ever find happiness in the next thrill they search for. The direction is magnificent, the performances are amazing, paticularly Winslet's who completely absorbs you in her character's ordeals. She is heartbreaking and believable and deserves all the praise she has received and will continue to receive as awards season continues."
    }
  ]
}