{
  "id": 3609,
  "title": "Richard Jewell",
  "starring": [
    "Paul Walter Hauser",
    "Jon Hamm"
  ],
  "runtime": 131,
  "genre": [
    "Drama",
    "History",
    "Crime"
  ],
  "description": "Richard Jewell thinks quick, works fast, and saves hundreds, perhaps thousands, of lives after a domestic terrorist plants several pipe bombs and they explode during a concert, only to be falsely suspected of the crime by sloppy FBI work and sensational media coverage.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5Lgkm8jt4roAFPZQ52fKMhVmDaZ.jpg",
  "categories": {
    "plot": 6.928571428571429,
    "acting": 6.782608695652174,
    "ending": 6.333333333333333,
    "soundtrack": 5.666666666666667,
    "cinematography": 6.25,
    "familyFriendly": 3.0,
    "funny": 8.25,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This suspenseful, well-acted and well-directed biopic of an innocent man accused of a heinous crime hits most of the right notes save for one very big one -- the truth of how the reporter who broke the story actually got her information. This controversial story thread, which has drawn angry criticism from those who knew the journalist, seems to linger somewhere between possible truth and outright fiction, an element that undermines an otherwise-fine film and the principal point it's trying to make. However, even if this aspect of the film is a glaring error, there's still plenty to like in director Clint Eastwood's work, especially when it comes to the excellent performances of its superb ensemble, including Paul Walter Hauser, Sam Rockwell, Kathy Bates, Jon Hamm and Olivia Wilde. Granted, this one may have to be taken with a hefty grain of salt, but the picture's many strengths more than outweigh its very large shortcoming, which, had it been handled differently, would have made this an otherwise truly great film."
    },
    {
      "rating": "6",
      "text": "Compelling, timely, and well acted of course under the sure hand of icon brand Clint Eastwood, it ultimately winds up underwhelming.  Both the FBI and the press are in question now like never before, but the parallels of this true story aren't quite enough to raise the suspense stakes in a post 9/11 world.  The premiere audience seemed to love it anyway."
    },
    {
      "rating": "6",
      "text": "If you were alive in 1996, you probably remember the titular security guard's name. He found the bomb that exploded during the Olympics in Atlanta. This film details how his life was shattered after he went from becoming a life-saving hero to the FBI's #1 suspect. As is often the case with films directed by Clint Eastwood, there's more information than passion. The performances are all solid (with Kathy Bates proving especially effective). The complexities of the case are laid out with plenty of blame, but the toll it took never delves the depths of emotion (even though there are some tearful moments). Like several other recent fact-based films, this is more a fascinating glimpse of a historical event, than a moving drama."
    },
    {
      "rating": "10",
      "text": "This film is based on the story of Richard Jewell, a security guard at the Centennial Olympic Park who during a concert discovered a suspicious bag with a bomb, which resulted in an evacuation. Though it wasn't completed before the bomb blew, the evacuation at least lessened the number of casualties. Unfortunately for Jewell, he fit the criminal profile. The FBI initially tried to trick him when being interviewed and their suspicions were leaked to the press, which caused him to be blamed by the media though there were no charges. The film follows Jewell's sad tale and how he and his lawyer fought it. This was a really well made film.This is a gripping, well-written tale. This is largely a film about dealing with the law and media, which has a lot of scenes of just talking, plus it runs at two hours and eleven minutes. Yet, the movie never feels slow. The setup to the finding of the bomb is just excellently paced and leaves you hooked. The dialogue is really good; for a movie about a serious subject it lightens the film with a little bit of dry humor.Casting is really good in this. The main triumvirate of Paul Walter Hauser as Jewell, Kathy Bates as his mother, and Sam Rockwell as his lawyer all work so well together.Now, I know a lot of critics have already mentioned this, but it's difficult not to address. The reporter Kathy Scruggs (Olivia Wilde), who first reported on Jewell is portrayed as super insensitive and obsessed with success over anything and everything else. From what I've read, the late Scruggs' colleagues disagree with her portrayal. It's a little uncomfortable that a film about the dangers of the media being used to vilify someone, is itself doing the same thing. (To her credit, Wilde does a good job selling the role she is given.)The Scruggs thing aside, I highly recommend this. It's especially impressive considering that director Clint Eastwood is 89. The movie hasn't been doing great in the box office right now and that is a shame."
    },
    {
      "rating": "3",
      "text": "The movie starts incredibly boring and slow making me dislike the main character and his preachy attitude feels like e lives in a different world than the rest of us.After the first 40 minutes the movie starts becoming interesting with nice shots and music added and the character kinda becomes more likeable but just be very little.In the end I couldn't care about anything that was going on in the world presented and the main hero making me not recommend this movie to anyone unless they have patience and like dumb protagonists."
    },
    {
      "rating": "6",
      "text": "As a director, Clint Eastwood is known and respected for his spare storytelling, getting rid of non-essential dialogue and action to focus on the essence of his characters.  In “Richard Jewell,” Eastwood puts that skill set to good use again, but only inconsistently.The title character in this film was a security guard at the 1996 Olympics.  Richard Jewell was credited with discovering a bomb at the Centennial Park music venue and saving many lives by alerting authorities and helping to evacuate the area before the bomb detonated.  For three days, he was celebrated as a hero.  (The film uses actual footage of Jewell’s interview with Katie Couric on “The Today Show.”)  Soon, however, the FBI’s manhunt trains its sights on Jewell, whose life is torn apart by the FBI scrutiny and the related media frenzy.Paul Walter Hauser (best known for his clueless characters in “I, Tonya” and “BlacKkKlansman”) is extremely effective in the title role.  He convincingly portrays Jewell’s earnest zeal to protect the public, while also embracing his tendency toward braggadocio, overreaching and general officiousness, traits that got him fired from a sheriff’s department and a university security force.  However, as Eastwood compellingly points out, nobody deserves what Jewell went through.This film could have been a lot more interesting and much more compelling if Eastwood had been equally attentive to any of the other characters in the film.  The lead FBI agent (Jon Hamm) is a caricature, a bully entirely comfortable living in the gray areas of the law during his rush to build a case against Jewell.  Similarly, Kathy Scruggs (Olivia Wilde), the newspaper reporter who broke the story that Jewell was under investigation, is a one-dimensional study in arrogance and ambition.  In the film, she’s portrayed as sleeping with an FBI agent in order to get her story, a contention that has no basis in fact.  Indeed, “The Atlanta Journal Constitution,” her employer, unsuccessfully demanded an apology from Eastwood’s production company for its misleading portrayal.  Only Sam Rockwell, as Jewell’s defense attorney, uses his sardonic style to overcome this general lack of development of any of the secondary characters.Ultimately, “Richard Jewell” advances two themes.  First, the film is persuasive that, in its rush to judgment, law enforcement and the media sometimes get it wrong.  And as the film powerfully portrays, by the time the wheels of justice have turned and the wrongly accused has been exonerated, nobody is paying attention any more.The second theme of the film, equally well-developed, is that people are complicated.  We’re all a frustrating mixture of good intentions, bad judgments and, often, a painful lack of self-awareness.  This would have been a much better film if Eastwood had been able to address the other characters with the same observational skills, sympathy and compassion he reserves for Jewell himself."
    },
    {
      "rating": "8",
      "text": "Very solid film, the direction was good and the acting was spot on. As someone who was alive in '96 but too young to have remembered this story, it was good to see it fleshed out on the big screen. Richard Jewell deserved to have his story told in the right way and I believe this film did him right. A good film is one that stays in your mind after you leave your seat and this film definitely had that effect on me. I felt compelled to research the bombing in Centennial Park and the unfair media coverage that Jewell received. Clint Eastwood brought his A game for this film and it shows. Highly recommend to anyone that likes a good drama based on historical events."
    },
    {
      "rating": "10",
      "text": "\"Richard Jewell\" was, by far, the finest movie I saw in 2019.  The actors who portrayed Jewell, his attorney, and his mother were excellent; and the story of the Olympic Park bombing and its aftermath was told in an absolutely riveting manner.  There was applause in the theater at the conclusion of the movie, which, in my experience, is rare.  The content of the movie is something every American needs to see and understand.  Many people are dismissive of the gross violations of civil rights, the multiple transgressions of policy, the unethical and illegal investigative practices, and the extreme prejudice￼￼￼ that were revealed recently in Inspector General Horowitz’s detailed report concerning the despicable abuse of our FISA courts, which were established primarily to prevent another 9/11, which was a major systemic failure of our government to protect us￼.  They cannot believe our government would do such things.\"Richard Jewell\" is a reminder of the perfidy of federal law enforcement￼ and the fact that any person who works for a federal agency should be approached with the utmost skepticism and with fifth amendment rights at the ready.￼In the case of Richard Jewell,￼ gross misconduct on the part of both the federal government￼ and the media caused a man who had conducted himself heroically and who had saved countless lives to be smeared for months￼. We Americans would like to believe that the sordid tale was a one-off, but it has been repeated many times since the Olympic Park bombing.￼\"Richard Jewell\" is both an artistic triumph and a much-needed wakeup call for Americans who, plagued with either naivete or ignorance, are far too willing to trust both the government and the media."
    },
    {
      "rating": "10",
      "text": "This is the BEST picture of 2019. Eastwood truly delivers! This film has brought Eastwood back to the way he once made movies. The hero who becomes the villain who becomes the hero again. Richard Jewell was falsely accused of planting a bomb that they then allowed the mainstream media to ruin this mans life when they could've stopped it at any time. They needed a scapegoat and used him because they couldn't admit they couldn't catch the real bomber. This movie delivers raw emotion, will absolutely draw you in and leave you wanting for watch it again and again."
    },
    {
      "rating": "8",
      "text": "This is the latest film by an actor-turned-director Clint Eastwood. I generally like his movies, they are solid and done well. This latest one is not an exception.The film is based on real events, 1996 Summer Olympics bombing in Atlanta, Georgia. Many people remember it.Richard Jewell was a security guard who found a backpack with explosives, notified authorities and heroically worked to save public from danger.However later on he was chosen by FBI as a primary suspect because he fit a profile of a lonely bomber.A local newspaper journalist got a hint from FBI and destroyed Richard's reputation without checking any facts.FBI abused their power by intimidating and manipulating a suspect instead of collecting evidence.Even though the movie is about events that happened back in 1996, it is very relevant today as never before. Fake news are abundant, many newspapers are biased and dishonest, FBI \"railroads\" (this term is being used in the movie) people's lives for reasons that have nothing to do with what they should be doing.I think the timing of this movie coming out *now* is not accidental. It is a warning to all of us.I liked mostly all performances, especially Richard's mom Bobi, played by Kathy Bates.I recommend this movie to be seen."
    },
    {
      "rating": "9",
      "text": "We all know how this ends, since it was real life, but what you don’t get to see from the real life drama is the behind the scenes real life emotions portrayed by the actors of this film. Clint Eastwood has done such a good job of directing the actors that you might actually think at first this guy, Richard Jewell, might just have had the stereotype or personality profile to have done this crime. It delivers the truth, that being, that the freedom of the press to deliver news, while important, does not outweigh the need of the public to receive factual evidence. Hollywood is responsible for telling stories and the media is responsible to report facts, not opinion or sensationalized stories. It seems the two have been flipped when you watch this movie. The one thing I personally didn’t like was that the reporter responsible for this mess, that slept her way to the front page, was later remorseful for what she had done. Her personality on screen to that point was die-hard, ruthless, do-anything-I-can-for-a-story type. I have a hard time believing that someone like that could change suddenly, as she is portrayed to have emotions and tears of sadness for her ill-reported story during the scene where Bobbi Jewell pleads for her sons exoneration by our president. Of course, I tend to believe that Clint has directed truth, so I’ll give him the credit that he lived up to the truth in every scene and didn’t sugarcoat any detail. That was the point of this movie. Not to allow abuses of power. I think he did a great job of exposing the real abuses of power that exist even more readily around us today. Freedom is not free. It costs lives of men on battlefields and the diligence of free citizens to uphold truth in the face of mountains of pressure to go with the flow. Responsible reporting of facts is the responsibility of our press to the public. This “story” says that more clearly than the media is responsible to do.Maybe younger people won’t care to see this movie because they don’t remember that time, or it moves too slowly, or it isn’t quick and easy like their life today, but they should. Society can only move forward if we understand our past and harness the lessons it teaches us. This “story” tells the truth of a situation that plagues us today and should be a lesson to teach us how to be better people going forward. Let your learning come from time spent examining facts, not fiction."
    },
    {
      "rating": "10",
      "text": "Excellent film.  Really gives you the feeling that you know Richard Jewell.  The film does an excellent job of exposing the abuses of the media and the FBI -- and how they destroyed one man's life -- someone who should have been viewed as a hero.  Clint Eastwood is a terrific storyteller."
    },
    {
      "rating": "8",
      "text": "It is a tragic, tragic thing to see an individual's life virtually destroyed by the media and government in favor of expediency and convenience. It is a similarly tragic thing to see a film based on that individual's life commit an act that's in the very same spirit of what it's trying to decry. For one, this act (and, yes, I am referring to the movie's questionable portrayal of certain journalists) of rhetorical malfeasance was completely avoidable. Furthermore, it's a relatively small element occurring within a movie that's still largely effective and memorable. And the final kicker is thus -- it's a sin that was committed by a respected screenwriter, who once wrote and directed a movie about the importance of integrity and honesty in storytelling (see Billy Ray's \"Shattered Glass\"). Why? Why was this call necessary? Do these people realize what they undid in employing this minuscule, unnecessary little audible they called in? I wring my hands not only because \"Richard Jewell\" is a genuinely great film in every other regard, but because the true story at the center is so very important. \"Frustrating\" is a word I've thrown out time and time again this year, using it to describe a number of movies that were just on the cusp of being great, but ultimately erred into the realms of being only \"ight.\" Well, \"Richard Jewell\" is still great. But, what it lost in its faulty decision-making was a chance at being one of my favorite movies of the year."
    },
    {
      "rating": "7",
      "text": "I haven’t seen a lot of Clint Eastwood films but I would say this is probably his best film. What really holds this film up from being mostly mediocre is the performances. A majority of the actors do a pretty great job with Sam Rockwell and Kathy Bates stealing the show. Rockwell brings this attorney with a temper and emotion for his old friend to life while Kathy Bates brings a loving mother figure for Richard with probably the most powerful scene and performance in the entire film. This is Paul Walter Hauser’s first major leading role in a film and I felt he did a pretty great job. He was able to show a lot of emotion with just his body movements. Olivia Wilde and Jon Hamm did a good job but just weren’t as good as the rest of the cast. The film’s message is very poignant in our culture today. The film’s central message is that we need to take news from ANY source with a grain of salt because they could be totally inaccurate or blown out of proportion to make someone look like a monster. While portions of the film were generally uninteresting, there were a couple of scenes I thought were really well put together and executed. One such scene would be the actual bombing scene in the beginning of the film. The sequence was incredibly tense because you know the bomb is about to go off but you don’t know when. There is an interview sequence with Richard Jewell’s mother and it was my favorite scene in the film. Kathy Bates breaking down with everyone around her starting to realize that Jewell may be innocent was pretty powerful. The final scene I really liked was a sequence close to the end of the film where Richard Jewell finally confronts the FBI. The way Richard Jewell confronts the FBI and talks to them about why he is being investigated and when they don’t respond is pretty powerful but not the most powerful scene. The thing that keeps this film from being higher than a 7 is that the technical aspects are just okay. The cinematography is serviceable and the script is fine. The film says what it needs to say and then ends. It’s plain and simple. Overall, Richard Jewell provides an insightful message on our culture today about the media with powerful performances to back it up."
    },
    {
      "rating": "10",
      "text": "This is Clint Eastwood's best work in a decade. Compelling, heartbreaking and fantastic. Absolutely 2019's best film. A must see and I can see why so many critics are angry with this film."
    },
    {
      "rating": "7",
      "text": "Democrats and Republicans each can find something in this film to point out to each other though director Clint Eastwood sort of stacks the deck for the Conservatives. Based on a true story a viewer never knows what is true and what is imagined such as the reporter having sex with the FBI guy to get a story really true? The reporter is dead and the FBI man is really a mixture of a few people.There is no falsehood behind the story of reporter Kathy Scruggs of the  Atlantic-Journal Constitution naming Richard Jewell as the suspect in the 1996 Summer Olympics in Atlanta, Georgia after he was hailed for being a hero when he found the bomb and alerted the authorities saving thousands of lives. Tom Broker, on NBC TV, also reports that Jewell is a suspect. We watch the FBI, and the media, tear apart the lives of both Jewell and his mother who he lives with. Kathy Bates, as the mother, has two very strong scenes that would justify her being nominated for an Oscar while Sam Rockwell as the lawyer committing himself to clear Richard's name gives another one of his strong performances and Paul Walter Hauser as Richard Jewell gives a once in a lifetime performance and certainly deserves a lot of movie awards during award time! The actors are the ones who make this movie with the screenplay Billy Ray a little too scattered and director Clint Eastwood seems to want to show that liberals don't run the movie business so we have a lot of unnecessary politics and wasted time.I do recommend \"Richard Sewell\" for the aforementioned excellent performances plus what could be a realistic look at how a man's life could be ruined without substantial facts accusing him of something he hasn't done."
    },
    {
      "rating": "10",
      "text": "Richard Jewell is a brilliant and bold film that explores government & media corruption in how a witch hunt plays out.Richard Jewell was the victim here, not the female reporter who wrote multiple hit pieces against him...not the AJC publication. It is sad that the narrative is being flipped around against the film due to a minor use of creative license which is being vilified. This woman did have a prior romantic entanglement with a cop on the case, so the film did not reach much when it came to that plot point as to how she leaked the info to the press.This is a gripping and important movie. It is probably Eastwood's best movie in the past ten years. Paul Walter Hauser is a revelation. Sam Rockwell gives a powerful performance as his indignant lawyer and he deserves an Oscar nomination. Kathy Bates is heartbreaking as his traumatized mother. Richard Jewell is the victim and the film pays tribute to injustice. It doesn't matter if you are left wing or right wing. I hope the film is vindicated during awards season because I think some of the media injustice, manufactured overblown controversy is damaging the film."
    },
    {
      "rating": "8",
      "text": "This was very informative movie.I learned a terrorist attack in 1996.The movie was quite long.It was over 2 hours.Other than that, I really liked it."
    },
    {
      "rating": "5",
      "text": "Clint Eastwood's political and social points of view are quite clear and he has voiced them a lot of times. Unfortunately this film never ceases to feel like a vehicle for his agenda and perhaps the worst of it - besides the script - is that almost 90% of the characters he puts on screen act and look completely incompetent. Therefore there's barely some sort of connection with the story.And the most important thing of all, is that he never really seems to care about the main character and from the little I could read about Richard Jewell, the truth is that the script doesn't feel honest and even though you know a film can twist the real events, when the material is manipulated that way, it cannot help feeling too manufactured.Eastwood directs fine enough but this is another forgettable film for his career"
    },
    {
      "rating": "9",
      "text": "Great movie.  One of the best I’ve seen in a long time.  Highly recommend."
    },
    {
      "rating": "10",
      "text": "This was the best movie of the year.  it is about our Constitutional rights and how rogue government destroys well meaning con•sci•en•tious individuals.  Eastwood is a master of character development, and a big part of that is showing the flaws.  Richard Jewell is a very flawed individual, seems mildly autistic.  But he provides a valuable service and is happy to help and is deeply empathetic.  Arguably the most complete character in an Eastwood movie.  And well portrayed by John Paul Hauser.  Excellent casting choices of Kathy Bates, Sam Rockwell and John Hamm, every single one a good actor with a chance to breathe a little.  It was very surreal to see the crazy guy correct. There is a lesson in all this, it is that people are trash.  The FBI, media and employers would never have behaved in this fashion if anything else were true.  Decent people are an island in an ocean.  I was incredibly moved when he said he is not allowed to talk to people anymore, I have recently reached the same conclusion for different reasons, that is brilliant filmmaking.  All I can say is Sam Rockwell definitely earned his Snickers.  I cried when he said his mom only got to be proud for 3 days of her son, i cried a lot at this movie, like watching The Elephant Man win.  This is Jungian individual vs collective at it's best, with some Kafka arbitrary justice thrown in, bravo Clint Eastwood, mastering philosophy and contemporary Constitutional rights at once.  The crazy guy walked away disappointed with the incompetence of the government."
    },
    {
      "rating": "7",
      "text": "I very much enjoyed this movie. It’s very heartbreaking to see even in the 90’s what our government and media will do for their own gain. So happy the truth came out in the end."
    },
    {
      "rating": "8",
      "text": "To be honest I never watched any of Clint Eastwood movie beforeClint Eastwood made the actors played they're best because I never heard about Paul Water House and he looks super cool in this roleThis is an absolute drama with a great atmosphere and soundtrack for 1996It feels like Clint is 20 or 30 now, BUT he is 89. WOW.Respect"
    },
    {
      "rating": "4",
      "text": "Excellent movie great entertainment great acting and great directing. Highly recommend"
    },
    {
      "rating": "10",
      "text": "Richard Jewel was a heartfelt movie of just a simple man with great values who became a victim during the Olympic bombings in 1996. Sam Rockwell did an outstanding job as his quirky lawyer.Clint Eastwood is amazing, I thoroughly enjoy his ability to direct and tell a fine story.I am disappointed the movie did not did not receive more recognition."
    },
    {
      "rating": "3",
      "text": "I think the most frustrating thing about this movie is that the cast does a fine job but there is no real emotion, there is a severe disconnect that really prevents this movie from reaching a deeper level than what it could have. And that is what prevents it from being a truly great drama.The cast is fine, The directing is fine. It's just the writing that really causes this lack of personal and emotional exploration for Richard, who really is portrayed as kind of a simple person, rather than someone who's life is genuinely being torn apart for doing absolutely nothing wrong. He is portrayed as a one-trick pony when I am sure the real-life counterpart was jumping up and down the emotional spectrum through all of this.I wish they did better in that regards and it really prevents the movie from being any good."
    },
    {
      "rating": "5",
      "text": "Quel film étrange... on dirait l'invité du dîner de cons, boy scout de son état, le petit doigt sur la couture, fidèle adhérent à la NRA, amateur invétéré de hamburgers, respect de la hiérarchie et de l'autorité, obsession des procédures... bref, un authentique champion qui se retrouve à l'insu de son plein gré sous la loupe du FBI !Evidemment, ils ont tiqué lorsqu'ils ont vu un tel énergumène, un gros con de compétition pareil, ils n'avaient jamais vu ça... alors la machine infernale s'est mise en route, prête à tout broyer sur son passage... Et ¨Papy Clint de se précipiter sur ce \"fait divers\" pour faire oeuvre de justice sociale comme on ferait don aux bonnes oeuvres !Lui, le type plutôt de droite voire à droite toute, le vrai patriote, le défenseur des (gros) flingues et de la légitime défense expéditive (Juge Dredd, où es-tu...) lui, le grand Clint se rend compte qu'il vit dans un état policier et paranoïaque avec les fouilles-merdes... euh je veux dire nos amis de la presse sur le qui-vive, prêts à dégainer leurs caméras et à fondre sur leur proie comme des charognards jour et nuit !Alors, ça reste globalement assez bien fait avec une réalisation comme de coutume de grande qualité et bien sûr des acteurs tous excellents, du rôle principal au brillant Sam Rockwell qu'on retrouve ici avec joie... mais le métrage est tout de même trop long (2h10 !) et la guimauve reste trop appuyée et souvent maladroite comme (trop) souvent dans les films de Pépé Clint.Comme je le disais au début, l'ensemble reste si exagéré qu'on se croit à un Dîner de cons (le retour) ou un Dîner presque parfait (c'est le FBI qui régale !) d'où un effet presque comique ici et là... très involontaire certes mais qui aide à faire passer le film, lui aussi à l'insu de son plein gré. Finalement."
    },
    {
      "rating": "8",
      "text": "The character arch for Richard is interesting, and the character is played in such a way that you can actually sense there is also a bit of darkness behind the goofy autistic goody-good demeanor. Interesting story, likeable characters. Two things bugged me.  First, how the news lady started crying all of the sudden realizing the mistake she made and how she ruined some lives. She is presented like a cold hard unempathetic person for 95% of the movie and all of the sudden she realizes she was wrong and this makes her regret her actions. The change of traits was way to sudden there. Secondly, I thought the was the story finds it's happy end was too fast paced. As in the 2 main characters go to the FBI interview, the realize the FBI has nothing on them, give a speech about how they stopped respecting the FBI, then leave. That was that. So it seemed a bit that the story took it's sweet time to present characters and setting at the beginning but had to speed up the resolution in the end. Overall an enjoyable movie, very good acting and a story about redemption that makes it even more enjoyable because all adversities never changed the hero in his core."
    },
    {
      "rating": "6",
      "text": "It's one of those forgettable Oscar bait films. The acting is good (Kathy Bates shines and Paul Walter Hauser was really good as Richard Jewell) but Sam Rockwell plays yet again the same character he played in Three Billboards and Vice: A quirky, sarcastic man who works in some kind of public charge and deep down has a heart of gold. He's honestly becoming another Jesse Eisenberg. Besides the acting everything else was unremarkable. The story is interesting but Clint Eastwood did the bare minimum in terms of direction or screenplay. Olivia Wilde's character was a stupid cartoon character (and it actually made controversy in real life) and the cinematography is just dull. There aren't really things that are terrible but it did nothing exceptional. Clint Eastwood should retire. Literally his last good film was American Sniper. After that he has just released Oscar bait trash like Sully or 15:17 to Paris."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)Before considering Eastwood's heroes as Kafkaesque characters, one should prove that can distinguish Max Brod from his friend. And the latter has never written about persecution by earthly, governmental or media powers, but by a metaphysically obscure Power. A topic that never seems to have interested Clint, who, by dint of flying low, pays the price of the maxi flop at the box office."
    },
    {
      "rating": "8",
      "text": "I thought this was a fascinating film - the story intrigued me and the performances are good. There's a decent cast and its quite a thought provoking and insightful watch. Yes, I'd recommend it."
    },
    {
      "rating": "9",
      "text": "Such a great movie and such a spectacar cast! I understand the outrage over the portrayal of Kathy Scruggs and I see it too. That being said, it's still a great movie and a story that needed to be told. Richard Jewell is an American hero and a lot of people still think of him as the bomber."
    },
    {
      "rating": "5",
      "text": "What a movie!!Catches you, takes your breath and diesn‘t let you go. This is what storytelling at its best can be: So authentic that you feel you experience the truth.Brillant cast, otherworldly lead performance by Hauser! And the one thing that means: a masterful director: Clint Eastwood has truly earned his place in the Hall of Fame of Movie Directors."
    },
    {
      "rating": "9",
      "text": "This is an excellent film from Clint Eastwood!Firstly, what a terrific performance from Paul Walter Hauser! He plays lead perfectly, as he makes it impossible not to root for the titular character - which is admittedly a given due to the plot, but Hauser adds an extra level of believability to proceedings. I felt every intended emotion.Sam Rockwell does very good behind Hauser, as do Kathy Bates and Olivia Wilde. Jon Hamm is good, too, as he returns to an Eastwood flick, having made his film debut in the latter's 'Space Cowboys' nineteen years prior.Portraying a messed up true event, 'Richard Jewell' is a film that I'd most definitely suggest you check out. 9/10 from me."
    },
    {
      "rating": "8",
      "text": "Great movie. It makes the FBI looks like a complete group of idiots! the acting is excellent. Clint did it again"
    },
    {
      "rating": "3",
      "text": "A great story I was unaware of with some good performances, questionable editing, and an amateur screenplay. This story of a true believer in the the United States justice system being shown its darkest side is a compelling one. The way it's told is from a very one-sided point of view, but I don't have too much trouble believing that there was little exaggeration in the details that mattered about it.Walter Hauser gives an impressive performance in a role that is arguably quite difficult to empathize with and Kathy Bates came to her supporting role in a lane I didn't know she had: a tired, withering, mother. If there's one thing this film has, it's great performances in difficult roles. Playing a smart character with strong convictions is one thing, but getting an audience to empathize with less educated characters with strong convictions is a difficult task, in my experience. Unfortunately, some other things went wrong. Some films are saved in the edit. I would argue this one was partially lost in it. One buzz phrase in film making is \"arrive late, leave early:' This film unfortunately did the opposite and you feel it. This may have also been a screenplay issue, of which there were many. Copious flashbacks and one cliche dream sequence are written into this script and it just did not need those things on top of the other fluff that dragged this film out to 2h12m. This story definitely did not require that runtime to tell. For those reasons, I'm out."
    },
    {
      "rating": "10",
      "text": "Una historia real impactante; es dramática, tensa y conmovedora.¡TOTALMENTE RECOMENDADA!"
    },
    {
      "rating": "6",
      "text": "Before talking about the movie, it can be said that \"Richard Jewell\" is one of those movies that proves that art does not know age. Ninety-year-old Clint Eastwood is still alive in the cinema and can make good films. The most important strength of the movie is its strong characterization, so that in the very first few scenes, we get a good definition and knowledge of the main character, in a way that from the very beginning, Richard finds his place in our hearts. And we want everything that is good for him until the end of the film. This innocence of Jewell, which turns into oppression throughout the film, keeps us by his side until the end of the movie and does not allow the viewer to be indifferent to Jewell and his fate. The camera also plays an important role in completing this characterization and the viewer 's closeness to Jewell's character, from the very opening scenes that represent him, the middle of the film which is the culmination of events for him and his mother and the end of the film which is a good ending. This strong characterization has also been performed for Jewell's mother, who is also far from exaggerated and can be fully understood and believed. This point, however, is a bit weak for the lawyer, so that the reason for his acceptance of the case is a bit weak, but with the progress of the film, his efforts are somewhat acceptable, although this point still has no effect on the emotional depth of the film. The script, which is the most fundamental cinematic element of any movie, plays a very important role here as well, and this characterization comes out of it.This coherence and quality of the script makes Richard's ideals of believing in the law and the police credible And it does not let his honorable sentences in the last interrogation seem like slogans at all. In the meantime, the good acting of \"Paul Walter Hauser\", \"Sam Rockwell\" and of course \"Kathy Bates\" cannot be easily overlooked. Kitty's character is also somewhat good, but her sudden and emotional change at the end of the movie is not very believable. Eastwood has done well in instilling a hatred of the media in the viewer which is sometimes even more dangerous than the law and its injustice, but one downside to the film is that the federal police investigation process is somewhat vague and it is not clear exactly how and with what evidence they can advance the case so much, but this movie is enough good that these negative points do not have much effect on its quality. The final sequence of the interrogation is also a good sequence, because we see the release of real Jewell's thoughts and ideals, not slogans, through words that are still uttered innocently, like himself, and according to the characterization and script, it is not a cliché at all. Also, it should be noted that the camera works well in the same sequence and the mise en scène is also acceptable. In general, \"Richard Jewell\" is a good film that entertains and satisfies the audience as much as it can."
    },
    {
      "rating": "7",
      "text": "Está bastante guay, no me esperaba que fuera tan buena, sobre todo ese toque de frenetismo."
    },
    {
      "rating": "8",
      "text": "Probably the best Eastwood movie of the last 15 years alongside Sully. Film that accurately tells (and finally devoid of sentimentality and patriotism) the story of Richard jewell."
    },
    {
      "rating": "7",
      "text": "A somewhat interesting story that is saved by its absolutely amazing performances."
    },
    {
      "rating": "8",
      "text": "Clint Eastwood continues to demonstrate his storytelling prowess with 2019’s ‘Richard Jewell.’ Paul Walter Hauser shines in the role of the hero-turned-suspect-turned-hero again, and is strongly supported by Kathy Bates and Sam Rockwell. While Olivia Wilde and John Hamm’s performances may have been a bit underwhelming, the witty dialogue between Rockwell’s lawyerly Watson Bryant and other characters adds an element of cleverity. Based on a true story, ‘Richard Jewell’ is suspenseful and entertaining enough to keep viewers engaged despite many knowing the outcome. Although it may not have received the recognition it deserved, this impactful film is deserving of admiration.Clint Eastwood continúa demostrando su destreza para contar historias con ‘Richard Jewell’ de 2019. Paul Walter Hauser brilla nuevamente en el papel del héroe convertido en sospechoso convertido en héroe, y cuenta con el firme apoyo de Kathy Bates y Sam Rockwell. Si bien las actuaciones de Olivia Wilde y John Hamm pueden haber sido un poco decepcionantes, el ingenioso diálogo entre el abogado de Rockwell, Watson Bryant, y otros personajes agrega un elemento de inteligencia. Basado en una historia real, ‘Richard Jewell’ tiene suspenso y es lo suficientemente entretenido como para mantener a los espectadores interesados a pesar de que muchos conocen el resultado. Aunque puede que no haya recibido el reconocimiento que merecía, esta impactante película es digna de admiración."
    }
  ],
  "recommendations": [
    "spotlight",
    "the_mauritanian",
    "just_mercy",
    "judas_and_the_black_messiah",
    "patriots_day",
    "the_post",
    "dallas_buyers_club",
    "denial",
    "donnie_brasco",
    "the_hurricane",
    "philadelphia",
    "snowden",
    "the_last_king_of_scotland",
    "the_card_counter",
    "the_imitation_game",
    "arbitrage",
    "wall_street",
    "fracture",
    "miss_sloane",
    "only_the_brave",
    "the_last_duel",
    "the_good_shepherd",
    "jackie",
    "the_lincoln_lawyer",
    "the_judge"
  ]
}