{
  "id": 1017,
  "title": "Riddick",
  "starring": [
    "Vin Diesel",
    "Matt Nable"
  ],
  "runtime": 119,
  "genre": [
    "Science Fiction",
    "Action",
    "Thriller"
  ],
  "description": "Betrayed by his own kind and left for dead on a desolate planet, Riddick fights for survival against alien predators and becomes more powerful and dangerous than ever before. Soon bounty hunters from throughout the galaxy descend on Riddick only to find themselves pawns in his greater scheme for revenge. With his enemies right where he wants them, Riddick unleashes a vicious attack of vengeance before returning to his home planet of Furya to save it from destruction.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pUul9pGWOKT7X0smkTvsIEIQxcP.jpg",
  "categories": {
    "plot": 6.533333333333333,
    "acting": 7.0,
    "ending": 6.0,
    "soundtrack": 3.0,
    "cinematography": 5.666666666666667,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 6.612903225806452
  },
  "reviews": [
    {
      "rating": "10",
      "text": "dont believe the critics. They are wrong as often. If u liked part 1 an 2 u will love part 3. Not an academy award candidate but a typical vin diesel riddick and highly entertaining. I luved the movie. go and watch it!"
    },
    {
      "rating": "6",
      "text": "If you didn't like pitch black but liked chronicles of riddick, you might not be impressed by riddick.\rI loved the chronicles of riddick, all the unique races and cool set pieces.\rThis movie seems like a rehashed pitch black,\rThe whole movie felt like an anime filler where you know at the end nothing really matters.\rThis whole movie dragged on while showed very few parts of him in chronicles to explain that he gets betrayed \"all in about 2 mins\".\rI was really hoping for the chronicles side rather then pitch black side, and even then its not as good as pitch black.\r Don't get me wrong its a good movie, its just not \"chronicles good\" its just a not as good pitch black."
    },
    {
      "rating": "5",
      "text": "Went to see this movie last night and came out with mixed feelings. The film splits into 2 sections; Rambo in space and a sort of antihero sided bounty hunt. There were aspects of the film that were enjoyable such as the colour palette, creatures and Riddicks' resourcefulness, but I just wish they could have found someone to look over the script who could write affecting dialogue as was pretty simplistic which stopped any engagement with the supporting cast.\r The other aspect that was disappointing was the pacing. The tempo in first section of the movie was slow but rewarding, but the section section was quite boring and unnecessary in places causing you to look around the theatre and disengage with the story.\r I do not want to seem all down on this movie as it was brave, partially interesting and a different take on the action movie. The movie felt more independent than many Hollywood action movies I have seen but maybe lacked the pacing and payoffs we have all become used too.\r I think this movie may benefit from a  re-cut and if they were to do it again I would say speed up the survivor first half by 20%, cut out huge swathes of the repetitive second section and create a new jaw dropping ending."
    },
    {
      "rating": "6",
      "text": "In this 2rd sequel, Vin Diesel is alone on a barren planet. First, he fends off an assortment of lethal alien animals, then 2 teams of bounty hunters land to provide human foes. It's like a reverse slasher flick: you're rooting for this seemingly superhuman slasher to dispatch the others one by one. The quality varies widely: some of the visuals scream fake, others are cool. The dialogue is leaden and dumb, esp. with Diesel's gravelly tone. The action is plentiful, but not often special.\rFans of the genre (or the star) may find it enjoyable."
    },
    {
      "rating": "4",
      "text": "Awful sequel of an equally awful trilogy. The first movie 'Pitch Black'' was a kind of horror/sci-fi film, that got mediocre critics-and I agree, because it's a waste of time!!!!! Don't EVER try to watch this awful, terrible-with a lot of blood and nudity-film!!! Go somewhere else!!!"
    },
    {
      "rating": "4",
      "text": "A major plot hole turned this from a 7 to a 4. It's not a terrible movie if you don't mind a bit of cliche'd writing and a plot hole here and there. Otherwise, I'd stay clear of this one."
    },
    {
      "rating": "1",
      "text": "An absolute error. From start to finish, it's just awful. For this kind of movie, scenario isn't that important & the visuals are quite good BUT that's all. Acting is awful & the movie is taking itself too seriously at the beginning. 30 minutes of \"Riddick vs Wild\" followed by sheer stupidity."
    },
    {
      "rating": "6",
      "text": "I've seen the movie, and i think Riddick is trying to go back to the root, just like the pitch black. i love the concept, where Riddick abandoned and trying to survive. but the creatures... they are too easy to beat. kinda boring after we know that Riddick can beat them all. and the mercenaries, cmon... too much corny joke. from my opinion, the jokes kinda ruin the movie... but overall its worth to watch"
    },
    {
      "rating": "5",
      "text": "I've watched this movie twice, Comes down to; could have been way better. Also way different, It was hysterically sad  we called it pitch orange, or pitch black remake. Same names, all the difference is a dog\rthey could probably make a Chronicles of dog, for the series,  must have been small budget, along with bad script, 10 years in the making and they Chose to make Pitch Black again. Lol! wow they got me.\rDiesel  Somebody boo him."
    },
    {
      "rating": "6",
      "text": "This is a Riddick movie. It's really hard to describe it past that except by saying it would be a better Alien Vs. Predator movie. It features Vin Diesel and is exactly what you expect in some ways and less so in others. If you see it just shut your brain off and have a good time. Even thinking about it won't bother you. There is a whole lot of silence when Riddick is just out doing his things but once more characters arrive  there is some interesting dialogue. In general it is worth seeing but only really worth a rental unless you are a big Vin Diesel fan."
    },
    {
      "rating": "5",
      "text": "A watchable movie, but far from being good. This movie brings the good background scenario of 'Pitch Black', and mixes it with a dose of anti-hero versus bounty hunters action and fails at combining them.\r I like the main plot, its clever and could have worked well, it all makes sense, there's no big holes in it, considering of course that we are talking about a Riddick movie. But in the end, its only a good plot concept in the background composed of empty scenes that just lack in almost everything, dialogue, action, suspense, acting...\r Plot  5\rLike I said before, a good solid concept that has everything to work, however, it fails on a scene by scene basis.\r Cinematography  5\rIts hard to rate, it wasn't bad but it feels like it could be so much better.\r Action  1\rTerrible even for Riddick standards, I wasn't expecting great action scenes but this is just too bad. In fact its like if this action scenes aren't even action scenes, Riddick comes out of an impossible nowhere all the time, just ridiculous and the bad guys look like they are hunting a deer, that's how careless and stupid they are. When fighting the predators its just a bunch of guns shooting and blades swinging, really really poor.\r Scenario  9\rThe planet where Riddick is left stranded looks stupendous, the colors, the landscape, stunning. The predators are well designed aswell.\r Acting  3\rAll actors failed to make me believe they were living that story. The characters they were supposed to be weren't also good which didn't help at all.\r Special Effects  7\rSome details could be better.\r A promising plot, poorly developed, in the end it feels like it could have been so much better, it's a shame really."
    },
    {
      "rating": "3",
      "text": "First Riddick not being able to recognize his own home planet and get screwed like that?\rI wont even comment on his fall from that rock.\rThe thing about the lesbian asking him to do her... Pathetic. Its like Vin Diesel personally paid to get his ego polished.\r The movie indeed had its good moments as well, but mostly it was just a kids movie.\rI loved the first 2 movies, but this is just not what I expected."
    },
    {
      "rating": "2",
      "text": "by far the worst of the triolgy...he was fighting alien birds in 1 and people who could teleport but a few ordinary bozos he fights for an entire movie.? maybe its just too hot on the planet like it was in the second one...the only way this movie could have been a 3 instead of a two is if he threw an alien scorpion at the mercenary bozos. Not a good buy on my part"
    },
    {
      "rating": "9",
      "text": "Wow, what a well crafted movie.  My only critique is that I was hoping for an even more dramatic ending.  If you liked Pitch Black but not Chronicles of Riddick, this is more like a direct sequel to the first movie, but don't worry, they acknowledge the continuity from Chronicles of Riddick very well.  Karl Urban!  Anyway, it was really good, not for younglings though.  Good sci-fi. Diesel and his crew are clearly a devoted fan to Riddick and the genre."
    },
    {
      "rating": "9",
      "text": "Great movie and don't mind what the critics say. They movie was a hardcore Sci-fi and action movie and the aliens in it were amazing. The planet they set it on was amazing looking and the story was even better."
    },
    {
      "rating": "8",
      "text": "Worse than I expected this movie is still awesome. I waited long time for it since Chronicles of Riddic. Chronicles was 10 from 10 to me, this movie is little not what I expected. Still, its full of action, full of space travels, full of baldness of Vin Diesel"
    },
    {
      "rating": "10",
      "text": "I loved it. The CGI was purposeful and well executed (watched it at IMAX) and supported the storyline (really felt an emotional response towards all the creatures that Riddick meets).\rVin Diesel put in a good performance, as did the rest of the crew (Katee Sackhoff kicks ass), and I loved the small plot twists that bring back the best Riddick moments but also expand the character with subtle emotional outbursts.\rOne thing that really surprised me was how funny some scenes where while still keeping the characters and interactions plausible (I laughed out for those scenes, while being on the edge of my seat for most of the movie).\rSome scenes felt slightly too long, but the plot and interactions made common sense from start to finish.\rHope it does well in cinemas and Vin Diesel is up for a sequel!"
    },
    {
      "rating": "10",
      "text": "The critics are soooo wrong on this one it makes me laugh. This was better than Pitch Black, Chronicles of Riddick, and just about any other movie Vin Diesel has made. Of all the summer blockbuster letdowns this was the only thing to deliver  and I wasn't even expecting it to. This was hands down the best movie of 2013 so far."
    },
    {
      "rating": "9",
      "text": "Please ignore the critics, because they have lost their minds and are just out to ruin movies as of late.\r If you watched and liked Pitch Black and The Chronicles of Riddick then you will love this movie! Feels like they took the best of the two prior movies and melded it together. Had the sci-fi horror and the combat style from the second.\r I wish they did a little more for the ending, but it left a great opening for the next Riddick movie to go anywhere they want plot wise.\r I took my wife and a few of her friends to see the movie that normally don't like sci-fi movies and they really enjoyed it so do yourself a favor and go see it."
    },
    {
      "rating": "0",
      "text": "Utter nonsense.\rThe writers cobbled this together on the way to work.\rI wasted two hours of my life watching this tripe.\rAvoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-Avoid-"
    },
    {
      "rating": "6",
      "text": "Riddick despite his B movie status is an iconic movie character and Vin Diesel is excellent as the titular hero but its a shame that director David Twohy decided to essentially remake Pitch Black for the third instalment of the semi popular franchise. The film follows what happens when Richard B Riddick (Diesel) is betrayed and left for dead on a planet filled with creatures trying to kill him. He is forced to summon two ships of bounty hunters to the planet to find a way off world before a dangerous threat reaches him and the ships he has just called. While Pitch Black was more of an ensemble survival film, Riddick relies solely on the abilities of Diesel with a few fun side characters dotted about for good measure (a cameo by Karl Urban early in the film is a nice way of keeping the continuity of the disastrous Chronicles of Riddick.) For his part Diesel is excellent, an intense presence worthy of the character. The visuals are great for a film on a reduced budget and the world Riddick finds himself stranded on has much more personality than the one in Pitch Black. The film opens with a gripping 25 minutes of Riddick surviving and learning the rules of his new environment and while a man alone on a planet sounds boring, it is by far the best aspect of the film as it really gets to the core of the Riddick character as Diesel conveys so much of Riddick's thoughts through his facial expressions and actions. Light on dialogue and intense the first act is riveting stuff. Katee Sackhoff makes a welcome addition to the Riddick world as mercenary Dahl and Matt Gable shows up with an interesting link to Riddick's past that makes for an interesting new dynamic to a seemingly predictable affair. The ending while generic is exceptionally well realised and directed by Twohy with some beautiful shots depicting the desperate situation Riddick and the surviving mercenaries find themselves in. It's actually rather moving up until an obvious plot twist ruins it all. The film does have some clunky writing and some poor performances but Twohy is smart enough to kill them off early to avoid embarrassment. Ultimately its a nice return to this universe after the calamity that was the Chronicles of Riddick and if Twohy manages to maintain the enjoyable B movie cheese I will continue to watch this hit and miss series."
    },
    {
      "rating": "7",
      "text": "In a throwback to Pitch Black lore, Riddick regains some of its sci-fi tension and although is not as incredibly colossal as some action movie recently, it's a decent action thrill with proven traditional approach. Once again Riddick finds himself in a strange realm chased by hunters, both humans and beasts. The premise is set so similarly after Pitch Black, down to some of its stereotypical characters, I couldn't help the surging feel of deja vu as I watched it. The simpler theme, for most and better part, works well for dark action Riddick is known for.\r Vin Diesel returns to his old fugitive character after a while, it's a good direction not to portray Riddick as constantly overwhelmingly hero. He's vulnerable at some points and relies on his predatory stealth skill instead of sheer brute force. The highlights of the movie is when he tinkers with the mercenaries and outwits them with trickery. He is presentable as hazard to other human beings and built like the part as well. However, the acting might stumble a bit as Riddick barely registers emotion aside from taunting grin or low pitch grunt.\r As for the incoming threat of monsters, it may be hit-and-miss. These creatures don't have the presence of the old photophobia beasts from Pitch Black, and appearance-wise a bit too generic. CG for them is acceptable, especially for the space dog for Riddick's companion. Action goes smoothly even if there are segments that look awkward. The use of lightning and color dye fit the atmosphere of dry hostile planet, scenes in the dark are meticulously done as they are still coherent and focused. I personally dislike the habit it does with shining the flashlight straight into the audience though.\r Cast is wildly brash. Most of these characters might be offensive or irritating, as the mercenaries are supposed to, but the script doesn't really help adding personality into them. Everyone is one dimensional as they come, from the erratic merc leader, the more sophisticated merc leader, the usual henchmen merc and one sexy merc. If you have seen the trailer, these people will act as expected as that thirty second shows. For depth and characters, I'd say the original Pitch Black has more likeable ones, at the very least more tolerable.\r Riddick is old school sci-fi action, it doesn't use flamboyant CG and rightly so, since the appeal is the larger than live legend Riddick has. The ending might slightly underwhelming and it is placed in more niche category compared to the recent Pacific Rim or Star Trek, nevertheless it's still an enjoyable foray to the dark realm which its claims victim one at a time."
    },
    {
      "rating": "3",
      "text": "Basically a two hour music video.  Rare dialogue and too much narration make this movie hard to watch.  Was ready to leave after an hour.\r Should be called Ridiculous Riddick for a largely unbelievable plot."
    },
    {
      "rating": "10",
      "text": "Awesome fun. If you like your comic book sci-fi and loved the original Riddick films, this won't disappoint. A worthy addition to the Riddick universe. I only wished it was longer. Hopefully the directors cut will add an extra scene or two. On the topic of the poor critical reception: it's a shame that critics don't know the market they are supposed to be critiquing for. Thankfully most of us stopped paying attention to their pretentious bullsh1t ages ago."
    },
    {
      "rating": "7",
      "text": "It's decent. Some of the ya right plot decisions were a little strange. I actually said \"Yea Right!\" out loud when the only lady on the planet decided to take a shower in the middle of an active mission involving her team. That of course caused a few shhh's from the people around me in the theater. Actually though overall it has the good vibe of the first Pitch Black and left behind the convoluted mess that was Chronicles. For that alone I give it a go and hope for more squeals."
    },
    {
      "rating": "10",
      "text": "Understanding what had to happen for this movie to come to be I am very happy.  Vin placed his very home on the line to help fund the movie (why it may have not be as big and going to as many different locations as past movies).  The fact that studios did not want to make another movie.  However, the team pulled it off- its fun, action pack not to over the top and a little bit different feel as well.   I hope I will be able to see the final two movies they have plan to finish up the tale."
    },
    {
      "rating": "5",
      "text": "With the dramatic and somewhat confusing transformation into a messy and ridiculous Space-Epic with The Chronicles of Riddick following the release of the of the downscale low budget(by comparison) Pitch Black the Riddick franchise has been an odd one at best leaving many feeling confused. It would seem that, following the relatively positive reception of the first movie, the creators got the idea that the audience was hooked solely on the exploits of the character Riddick as opposed to the frightening scenarios and interesting setting that the movie provided and so the idea that they could spawn a massive space epic centered around that one character spawned and it was an idea that didn't do them any favors. The sequel flopped and Vin Diesel, who played the brutal yet now somewhat uninteresting hero, moved on to other projects.\r Riddick sees the return of director David Twohy and Diesel himself in an attempt to take the series back to its more humble roots with a much lower budget to bring us the more downscale set pieces and a smaller cast, something which carries over from Pitch Black, as though this will repair the mistakes made by Chronicles on its own. Sadly it doesn't, while the movie is a significant improvement over one of its predecessors it proves to be the more mediocre one of the three with acting that is somewhat questionable at times and a script that leaves something to be desired with an array of bland lines that lack impact and feel flat(If you've seen the trailers you've already heard Jordi Miller's \"I've come to collect your head in a box!\" and already sort of know what I'm on about) and characters that are stereotyped and are left unexplored.\r The movie does show some promise and times however and provide some entertainment with the first act focusing on Riddick surviving in the wilds of this new planet after being left for dead by the Necromongers that were introduced in the first movie. Riddick fashions spears, finds shelter and adopts a space-wolf in scenes that are entertaining and visually interesting, with some very attractive settings and creature designs. Then comes the second act in which Riddick faces off against two seperate groups of mercenaries. This act is much less interesting with generic and cheap looking action scenes that even the mildly humorous bounty hunter dialogue can't save. In the third and final act the film unashamedly tries to retread the steps of the original by introducing fearsome creatures that only come out when it's raining, a concept which seems to have been directly copied from the original Pitch Black script with only slight changes made.\r All of this is concluded in a finale that seems sudden and abrupt and incredibly anticlimactic. That's not to say that the movie was building itself up for an explosive climax however; in fact the movie fails to increase tension entirely with only a little of the unpredictability of the first movie to help it along in the form of a single plot twist and one or two unexpected deaths.\r The movie, as said before, is significantly better than Chronicles but despite its best attempts doesn't quite manage to be as interesting or entertaining as the original and it's evident that the Riddick, the title character himself, has become rather dull and uninteresting which is a shame after the debut which painted him as a true unpredictable killer of an antihero.\r The movie is entertaining however and while it might not be worth a cinema trip or a DVD purchase it's certainly worth a rental if only to see that the it is possible to revive a franchise after such a major flop."
    },
    {
      "rating": "10",
      "text": "I saw this at the 8pm Premiere in RPX  Regal Theaters. Firs toff, the uptight, liberal and politically correct critics are very wrong about this movie. He plays Riddick as Riddick has always been and it shows how wimpy a socidety we have become for this to \"offend\" so many delicate sensibilities. You can't go to a Riddick movie and fairly judge it if you are a \"The Notebook,\" type of person.\r This is hardcore SCIFI(thankfully as it has been too long since we have had one), it is Adventure, Action, and even has a bit of comedy. I give it a 10 to offset the pathetic people slamming it because it has too much \"machismo.\"\r Put simply, if you enjoyed Pitch Black(especially) as this is more like that) and like the Riddick character, then do yourself a favor and go watch this! If you don't like exciting scenes with monsters, gratuitous violence, men acting like men(hey they even had PC scenes for the feminist crowd-  a woman beats a guy down improbably several times, but he really deserved it.\r So it is simply, if you like Pitch black, if you like horror, thrillers, scifi, and action then do yourself a favor and go see this. Don't listen to biased critics whose own reviews impeach themselves as being against this movie before they saw it.\r I would give this an 8.5 btw and Pitch Black a 9.5 were it not for the horrible and FALSE reviews, so I gave it a 1.05+ to tr and even out these BS reviews.\r Thanks to Metacritic though for allowing people to speak out when the critics unfairly target their hated genres/actors, or whatever political beliefs they have that remove all impartiality from their reviews and make it about feminism and such.\r To me, this wasn't as good as Pitch Black, but it was GOOD. Remember this too, Vin put his own money on the line because he wanted his fans to have this movie.\r A tip: this isn't a spoiler, but hopefully will save you some time: there is nothing after the credits so don't feel stupid like I did and sit there until the credits end. :)\r SCIFI IS BACK BABY!!"
    },
    {
      "rating": "8",
      "text": "Despite some underwhelming adherences to stock sci-fi stories and characters, as well as moments of eye-rolling dialogue and a few indulgent character beats, Riddick offers a solid action-horror experience. A more experienced performance from Vin Diesel helps transition Riddick from an over-the-top action hero into a fully realized character that is actually capable of sustaining a quality film franchise. While longtime fans will surely enjoy seeing Riddick back on the big screen, the latest series installment should have no problem drawing in non-fans too  not to mention set the stage for further chronicles of Richard B. Riddick"
    },
    {
      "rating": "10",
      "text": "Thanks bin for making this movie! I thought it was awesome I love the screen time between jordi molla and sackoff molla was actually very funny!!! Minor spoiler: Some of his dialogue was awesome!!! I love the storyline how riddick has to find his animal side again because he got soft!!! The beginning was awesome I loved the whole movie!!! I hope it succeeds so vin can make many more of these.  Thanks again vin for listening to the fans and being one of the best actors in Hollywood!!! I hope for many many more of these awesome awesome flicks!!! OMG the rated r rating was also awesome!!!!  The gore was fantastic!!!!! Loved it!!!"
    },
    {
      "rating": "8",
      "text": "A thrill ride from the start, that just doesn't quit. Looking for an entertaining time? You'll find it here with the third installment in the Riddick franchise. Vin Diesel is truly at his best as Riddick, and both him & Director David Twohy deliver the thrills and excitement of a kick ass rock concert from beginning to end. After waiting 9 long years now, It's really good to have you back, Riddick. Let's just hope the next installment of the franchise will be a little closer to us than 9 years from now. A LOT closer."
    },
    {
      "rating": "3",
      "text": "Just awful  no exceptions. Based on claims that this film would harken back to the original themes established in \"Pitch Black,\" the casting of Katee Sackhoff (as well as the return of Karl Urban), and reviews on this site telling me to ignore the critics (hint: listen to the critics), I was hopeful. But the result was worse than disappointing. In fact, it was horrible. Karl Urban's role was reduced to a brief flashback set to establish the background of Riddick's heavy-handed survivalism on a graphics-poor planet of overly done CGI that seemed to come straight out of \"Star Trek: The Next Generation.\" His \"dingo-dongo\" companion (yes, that's what they actually call the alien-dog-predator-thing that Riddick somehow manages to befriend) is an additionally poor attempt at child-like humor and in the end is less than endearing. Even Riddick's rumblings failed to make up for the non-terrifying, and certainly uninteresting, group of mercenaries that come to track the man down. What could have been a compelling dynamic between the mercenary Dahl (Katee Sackhoff) and Riddick boils down to a one-dimensional, unestablished, and implied sexual interest that never comes to fruition. Oh and let's just say that Sackhoff's character isn't exactly inclined towards someone of Riddick's masculine features, which only makes it doubly unbearable. Besides the Necromonger flashback, the only real attempt to tie in the plot of \"Riddick\" to previous films in the series involves a character so obscure that only ardent fans will understand the sub-plot. The most promising element of the film that actually did seem to recall \"Pitch Black\" was a creature that seemed to simultaneously evoke the bird-like terrors of that film and poorly plagiarize the xenomorph hordes of \"Aliens.\" A missed opportunity to revitalize this franchise, \"Riddick\" is just a poor film."
    },
    {
      "rating": "10",
      "text": "Ignore the mainstream media reviews on this one.  They are idiots to rate this so low.  This goes along with Man of Steel as one of the year's best films.  Entertaining throughout."
    },
    {
      "rating": "9",
      "text": "What can I say?  If you like Riddick, you'll love this movie.  Faithful to the character and the universe created by Vin Diesel and David Twohy with a great cast all around.  Good work, guys!"
    },
    {
      "rating": "9",
      "text": "Caution, if you don't like action, sci fi or any of the other Riddick movies, then your not going to like this. If you did, then this is a great follow up. Good pacing, good action, more then just the previews and good acting. Also, it was funny at times. Which was a pleasant surprise."
    },
    {
      "rating": "5",
      "text": "Riddick is a good film for action, sci-fi and weapons but the story is just too silly and with way too many plot holes and errors that just didn't make sense to me combine that with the inconsistency of the plot and you just get a crummy result. Overall, you would watch it for all the fun violence and gore but don't expect too much from it."
    },
    {
      "rating": "9",
      "text": "It's not always the smartest, there are a lot of eye rolling cheesy moments and dialog, but it's still a very fun and action packed sci-fi movie. Diesel nails it as the cocky bad-a*s Riddick, and the rest of the cast is also entertaining. Considering all the crap that sci-fi movies have been lately, it's nice to see one that is just a lot of fun. I can't compare it to the originals, but I can say this latest \"Riddick\" movie was a lot of fun, at least in my opinion.  So go ahead and give it a shot. I think you'll find it worth your time."
    },
    {
      "rating": "7",
      "text": "Riddick was a good movie and an interesting installment to the \"franchise\". I put quotes around it because these movies haven't really connected all that well. In fact, they've almost been more of stand alone films than anything. Vin Diesel was a B.A. as usual and the rest of the cast was solid. The overall feel of the movie didn't quite meet that Pitch Black vibe that was so special but it didn't feel like a Star Wars movie like Chronicles did. There's not much else to say other than it was just a good movie that doesn't quite reach that epic feel. There's that same situational dialogue humor that has been in both of the prior films and some really cool fight scenes. The entertainment value is pretty high but it doesn't feel like much progress was made towards any real story arc, which is probably it's biggest fall back for me."
    },
    {
      "rating": "10",
      "text": "Don't understand the people or critics who blasted this movie. I've watched and loved pitch black and Chronicles of Riddick and Dark Athena, and to tell you the truth something was telling me that this movie was going to suck, and I have to say I was pleasantly surprised.\r The movie is definitely great, Vin Diesel does an as usual excellent job of portraying the silent gritty killer Riddick, the movie has a lot of action, is \"believable\" (in the context of the movie universe) and has good supporting roles by actors that are relatively uknown (except for the lady that plays starbuck on Battlestar Galactica and the guy who did Dredd, he's \"Commander Vako\" in the movie.\r I particularly liked the \"new kid\" bounty hunter actor (sry don't know his name) and as usual the guy who did Commander Vako does a great job. The lady bounty hunter (Starbuck from BSG) really did a great job too, she really sold me on being a female bounty hunter in the universe of Riddick, and she delivered on just the right amount of humor and sexiness without making her entire part about being hot like some actresses in other movies do.\r Everyone did a good job in the movie, the special effects were really nice, even though sometimes they could have been a \"little\" bit better, and all in all the Riddick storyline was moved along nicely even though there wasn't as much about Furya or what happens with the Necromonger fleet as I would have hoped for, but to be honest, the movie would have been \"too busy\" if they touched on all that, and the director has already stated that the next two movies in the series (and the last) will be focused on these plot lines to finish out the story of Riddick's character.\r All in all, it was a great movie, and a REALLY great sci fi movie, in a market where getting a good sci movie is really really rare. I gave this movie a 10 here because I saw some really ignorant and biased negative reviews. I think this movie deserves at solid objective 8/10 and me as a Riddick fan I would give it a 9/10."
    },
    {
      "rating": "4",
      "text": "Just when I thought that Man or Steel had disappointed me, Riddick delivered a new level of disappointment.\rMy first yawn was in the first 10 minutes of the movie and after that things were getting better though I was still yawning.\rPlease believe me when I say that I really want to like this movie since I like the previous two movies.\rBut I just can't. Everything seems wrong:: the effects, the plots, the characters and God-knows-what-else.\r Don't waste your time watching it. Just 're-watch the first two movies and you'll be safe."
    },
    {
      "rating": "7",
      "text": "This review contains spoilers, click expand to view. This movie was not at all wat I expected. The first part is very slow, with silly moments between Riddick and his new puppy, that remind me more \"The Pacifier\" movie than The chronicles of Riddick or Pitch Black. The character in the first part of the movie has lost almost completely his sharpness, his \"badassness\". He has been depicted as a weak man lost in an unfriendly planet, and it is not clear where the story is heading to. The second part of the movie saves it all, with more action and finally with almost the same charismatic character we are used to know and the story takes finally off. I give this movie a 7 because the second half of the movie is really good and unveils all the smoky reasons for which this time Riddick has been hunted by one of the bounty hunters, but more than a full \"7\" I'd give this movie a 6,7 rating."
    },
    {
      "rating": "10",
      "text": "The Chronicles of Riddick was terrible, but this third installment breathes life back into everyone's favorite antihero. They do a good job of tying up the necromonger stupidity at the beginning, so it's out of the way, and to me, that's a very good thing. This is very much a back to the roots movie. Riddick is in his full element, on a hostile world where he defeats nasty monsters and makes his oppressors look like fools. But this movie even has more than one would expect of it. There's a happy ending :D It was excellent. It was full of macho stereotypes, but that's why one watches a Riddick movie. Richard B Riddick, escaped convict, murderer! ^_^ \"\r I found it more entertaining than most action flicks you put on. It's great to see Vin Diesel reprising his best character. Also, the dog was just an incredible idea and he really complemented Riddick's animal side. I wish we could have seen more of the intrepid zebra pooch."
    },
    {
      "rating": "5",
      "text": "Third installment of Riddick is obviously inferior to previous. It has a good start, but than it became lackluster, unambitious fiction story with predictable ending! It slightly above average"
    },
    {
      "rating": "5",
      "text": "Meh! Looks like a boring remake of the very good 'Pitch Black'. The story is quite boring, characters are both flat and idiotic. Not to forget is the toal lack of a true ending (what is presented in the first scenes is never resolved in the story)"
    },
    {
      "rating": "8",
      "text": "Not as good as Chronicles (which is under appreciated  I think there is a version out there that doesn't contain critical information) but I enjoyed it and hope they will make another one.  He still needs to find his birthplace."
    },
    {
      "rating": "5",
      "text": "When I heard that Vin Diesel funded the whole film with his own money, I felt that he was the only one wanting to continue the Chronicles of Riddick. The newest film out of the trio features Richard B. Riddick, who we follow as he is being hunted by the \"dead Riddick\" team.\r The movie took so many different turns that I wasn't quite sure what genre film it was. From thriller, to drama, to science fiction, Riddick definitely appealed to a large audience, especially with its PG-13 rating. With so much potential in the film, it seemed to me that director David Twohy did the least of his directing abilities to quickly make a \"sloppy\" film. He made it in such a way that it was part of the series, but it easily could've been a standalone film.\r The first half of the movie was completely useless and left me bored stiff. There’s a presentation etiquette skill saying to always start with something engaging to put the viewers in the right mood. Riddick did the absolute opposite. After a good 40 minutes of basically no one saying a word on the screen, I was about ready to feel I wasted both my time and money, when the film suddenly picked up. I recognized that all of the little sea monster critters seemed like a bad rip off of the sea monsters in Prometheus.\r A lot of the movie was quite predictable, especially when Riddick would be hiding somewhere. It was easy to know that he was somewhere in the scene, and the camera would pan to a corner where he would be, which bugged the crap out of me. A lot of other film critics tended to disagree with me on my harsh comments, saying \"how good it was,\" but it really did nothing for me.\rThe last 35 minutes or so were entertaining, and I thought that overall Vin Diesel did a good job in the main role. There was one scene that impressed me, when Riddick was chained and flipped a knife in the air, kicked it, and cut a man’s head off. That was probably the only thing that was original for me.\r Whatever, I won't remember the movie in a week, but that head scene will be what is shared with some friends tomorrow. I think that if you’re a fan of the other two (painful to watch) films in the series, definitely go see Riddick to get your full fill of Vin Diesel's movie (in IMAX 3D). Other than that, I was truly disappointed with the film, and for sure won't be recommending it. But still, that head scene was cool!"
    },
    {
      "rating": "10",
      "text": "I was actually surprised. I mean, I knew it was going to be great, I love the Riddicks and it's universe, but the trailer was only showing an ok movie with good effects and common story. I must say they did a really good jobs on the concept art, the effects, and even the story and the characters (for this kind of movie). It is far more than a fan movie and definitely better than the second one. Go watch it if you like scifi and action, its definitely worth it.\r I don't know where the critics are from (probably not from our generation), but it feels like they go watch a kind of movie they know they don't like and then write a bad review. It's not objective at all."
    },
    {
      "rating": "5",
      "text": "Love the character Riddick but sadly I dont think this film done justice. The start of the movie looked hopeful with being on some deserted world hoping to be in search of fuyron, where he is from but just ended up being a hunt for Riddick and monsters.. Nothing new at all... And really I didn't think it was that great either.\r I hope they expand on the story of him finding his home world fuyra with Falco because that is where I think the story should have gone. They could really make an epic epic movie with this character but their not. This character could have been so much. Lets see what happens.."
    },
    {
      "rating": "6",
      "text": "It's a movie that takes a while to get it into gear. I mean it literally feels like 3 separate movies in one. But it definitely goes back to that \"Pitch Black\" vibe. While it's not the best movie ever. It's entertaining to check out."
    },
    {
      "rating": "10",
      "text": "This is hands down, the best action movie of the last 3 years, and the best movie Vin Diesel has ever made. Sometimes I wonder what these so called \"professional\" movie critics are smoking. Even my wife who hates these movies was thoroughly entertained from beginning to end. Absolutely fantastic movie, and a brilliant addition to the Riddick story."
    }
  ],
  "recommendations": [
    "the_last_witch_hunter",
    "pandorum",
    "poseidon",
    "surrogates",
    "i_am_number_four",
    "the_meg",
    "pirates_of_the_caribbean_on_stranger_tides",
    "independence_day_resurgence",
    "the_tomorrow_war",
    "avengers_age_of_ultron",
    "hercules",
    "bloodshot",
    "guardians_of_the_galaxy",
    "transformers_the_last_knight",
    "pacific_rim_uprising",
    "the_new_mutants",
    "maze_runner_the_scorch_trials",
    "underworld_awakening",
    "i_am_legend",
    "teenage_mutant_ninja_turtles",
    "the_darkest_hour",
    "jumper",
    "serenity",
    "underworld_blood_wars",
    "terminator_genisys"
  ]
}