{
  "id": 3583,
  "title": "Ride Along",
  "starring": [
    "Ice Cube",
    "Kevin Hart"
  ],
  "runtime": 99,
  "genre": [
    "Action",
    "Comedy"
  ],
  "description": "For the past two years, high-school security guard Ben has been trying to show decorated APD detective James that he's more than just a video-game junkie who's unworthy of James' sister, Angela. When Ben finally gets accepted into the academy, he thinks he's earned the seasoned policeman's respect and asks for his blessing to marry Angela. Knowing that a ride along will demonstrate if Ben has what it takes to take care of his sister, James invites him on a shift designed to scare the hell out of the trainee. But when the wild night leads them to the most notorious criminal in the city, James will find that his new partner's rapid-fire mouth is just as dangerous as the bullets speeding at it.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ihKj5zsdkbm8FQ0IsOpAaaqPGX7.jpg",
  "categories": {
    "plot": 4.666666666666667,
    "acting": 5.833333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.5,
    "funny": 5.242424242424242,
    "action": 4.25
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It's MUCH funnier and a MUCH better time than the critics give it credit for.  Ice Cube is a little off his game in terms of comic timing, but Kevin Hart is hilarious! Easy recommendation if you're just looking for a night of laughs."
    },
    {
      "rating": "4",
      "text": "Despite the best efforts of Kevin Hart, Ride Along limps along and never really works as a comedy thanks to a listless Ice Cube and poor direction from Tim Story."
    },
    {
      "rating": "1",
      "text": "I can honestly say that this is by far the worst film I have seen in my life! Kevin Hart is hilarious in stand up... but this is just ridiculous! I can't even put it into words... All I can say is PLEASE don't watch this movie! you'll be doing yourself a huge favor!"
    },
    {
      "rating": "5",
      "text": "An average buddy cop movie with predictable plot and some funny moments! But it have been a while since we have this kind of movie, so it's fun time but not one original thing about it"
    },
    {
      "rating": "7",
      "text": "Very enjoyable and funny this sadly is one of only a few Black cop buddy films out ever. Kevin and Ice Cube pulled this together. Respectable to me as far as humor ,story and character development goes . Felt really balanced with the drama and heavier moments . Next movie Universal Pictures needs to do is a Black gay comedy to break the cycle ."
    },
    {
      "rating": "6",
      "text": "This movie is a mixed bag on one side is Kevin Hart mostly improvising which give most of, if not all of the film's funny dialogue, he also shares good chemistry with Ice Cube, on the other side the scripted jokes, are most of the time well lame, this fun to watch now than most of the movies are ****"
    },
    {
      "rating": "5",
      "text": "I like Kevin Hart but this movie is like the same joke being repeated every ten minutes for an hour and a half.  We know what is going to happen and what Kevin Hart and Ice Cube will say throughout the movie, but if you don't expect much (which you shouldn't), just enjoy how much non-sense Kevin Hart can say in just a few minutes."
    },
    {
      "rating": "4",
      "text": "This is a horrible movie. I am currently watching this movie with what I thought were friends and feel as though I'm being held hostage. This is a terrible, terrible movie and has ruined my Friday night.  As I am writing this my only thoughts are Why HAS NO ONE STOPED THIS ABOMINATION!!!!"
    },
    {
      "rating": "5",
      "text": "\"Ride Along\" 10 Scale Rating: 4.5 (Mediocre) ...\r The Good: Kevin Hart is hilarious at times, though that is expected. Ice Cube does a very solid job playing the straight man and for a few fleeting moments, this is a decent buddy comedy.\r The Bad: I don't expect a whole lot in regard to story from a film like this, but even still ... this movie was underwhelming in that regard. While Hart was funny, they leaned way too much on him and on occasion it went on too long and wasn't humorous anymore. The film's final act is a predictable dud. A very formulaic movie."
    },
    {
      "rating": "6",
      "text": "Hilarious movie, and very entertaining. The interactions between Kevin Hart and Ice Cube are worth watching. However, the movie's ending feels rushed and incomplete, and basically makes the rest of the movie feel as though it was there for nothing. A lot more could have been added to the movie; in fact, an additional 30 minutes could have been added to prevent the ending seeming as incomplete as it is."
    },
    {
      "rating": "9",
      "text": "This movie deserves more than it gets. It kept me rolling!! This movie is number 2 on my Top 10 funniest movies ever. Ice Cube wasn't acting the best this time but that's okay Kevin Hart made us look over the fact that cube wasn't on his game. It's definitely worth the time. So if you want a night of good laughs this is the movie to watch. So I give this movie a 9 out of 10. Thanks for reading."
    },
    {
      "rating": "0",
      "text": "this movie is definitely a piece of ****  I know this because it popped up on my computer and pissed me the **** off.  I would never, and will never support such an asinine form of advertisement, and refuse to participate in such a bogus form of intellectual degradation.   Piss the ****ed off.\rMe"
    },
    {
      "rating": "7",
      "text": "If you're a Kevin Hart fan then this is definitely one that is worth a watch. This is Hart's show, and when he takes control it's easy to find the laughs. It's his goofy character that never stops talking that makes the movie worth watching, and easily makes up for the lackluster plot that is full of cop movie cliches and the surprisingly disappointing Ice Cube. So yeah if you're looking for some laughs Kevin Hart brings them. It's just a shame that the rest of the movie around him isn't so spectacular."
    },
    {
      "rating": "3",
      "text": "The only positive thing I can think of was it kept my attention. The bad news, predictable, clumsy, and most of all annoying. The combination of Kevin Hart and Ice Cube screaming for unnecessary reasons is a reason to avoid this film."
    },
    {
      "rating": "3",
      "text": "Don't understand the appeal of this film.  It's a compilation of a 10 other films with no originality at all.\rKevin Hart acts \"funny\" but his rapid-fire talk makes it difficult to understand him at times. The sad thing about a film like this is that its rock-solid financial success will result in more Ride-Alongs when the first one wasn't even that good.  I'm not sure what this says about America's cultural appetite but I'll bet that it isn't healthy."
    },
    {
      "rating": "8",
      "text": "Kevin Heart is the new fad in comedy right now. I don't know if his brand is endearing but it is good for 2014. This movie was much better than staying at home and playing Call of Duty. Now I can go to the theater and watch actors pretend to play Call of Duty. All this while Ice Cube pretends to be a detective with no self control, and some forgotten actress pretends to be some borderline annoying clueless forgotten girlfriend/sister with a strange midget fetish. But hey its funny and your bored so what do you have to loose?"
    },
    {
      "rating": "3",
      "text": "Painfully stupid. Ice Cube is funny in more of a supporting role as in 21 Jump Street, and after awhile just got annoying here. Typical, weak january fare."
    },
    {
      "rating": "3",
      "text": "Yolanda Williams is an idiot. This Movie was so stupid and unoriginal with a predictable plot and bad humor. Few scenes will make you laugh but most is just an unsatisfying mix and not worth your time or money.By the way Yolanda critics grade movies on quality and Ride Along was just a disaster. Please Yolanda get off the internet."
    },
    {
      "rating": "3",
      "text": "The previews for Ride Along were better than the actual movie. Kevin Hart is hilarious per usual, but like I said- I've already seen the funny parts 200 times via commercials and previews, that by the time I watched the movie I was annoyed seeing it again.\rI was very, very bored with it- I wanted to leave since it was so predictable."
    },
    {
      "rating": "3",
      "text": "This definitely a very bad movie with its entirely cliche and predictable plot that doesn't even start properly until 60 minutes of its 100 minute run-time has passed, yes that's right a majority of the movie is dedicated to presenting to us not so funny scenarios that has Kevin Hart doing his best to make his ranting sound funny with moderate success. The 40 minutes that do relate to the main plot just shows the audience how unoriginal this movie is , with its main mystery going to waste and the ending turning into useless mini-version of die hard providing a very unsatisfying ending.\rThe characters are cliche and consists of everyone you would expect in a typical cop buddy movie, a bad ass cop protective of his sister, the strict police commissioner who disapproves the bad ass cop, and the seemingly puny weak stupid guy who is in love with his sister and of course, some sort of uninteresting gang or cartel with its mystery leader. I would highly recommend anyone to not watch this movie."
    },
    {
      "rating": "2",
      "text": "terrible............................................................................................................................................................................................"
    },
    {
      "rating": "2",
      "text": "2/5★ Kevin Hart works for every penny. He's on fire from the first frame, and he does not stop, like a little energizer bunny who is always jumping around. Unfortunately, he doesn't distract from the unoriginal and only mildly entertaining film.\rVerdict: For the Buddy Cop genre/Kevin Hart fan."
    },
    {
      "rating": "3",
      "text": "Ride Along is a predictable buddy cop action-comedy that falls victim to Tim Story's inability to create adequate character development or storytelling in his films. Instead what is left is an unoriginal cliched plot filled with more jokes than real story. Although the chemistry of Ice Cube and Kevin Hart is good, Hart's manic demeanour becomes overbearing sometimes. The buddy cop genre is terribly cliched but a little more effort in story and characters would have gone a long way to making this a better film. Ride Along is a very undemanding piece of action entertainment so if I were you, I'd just ride along and not expect anything."
    },
    {
      "rating": "1",
      "text": "What is there really to say? The point of a comedy is to make the audience laugh and guess what? I DIDN'T LAUGH ONCE. Keven Hart gives it his all but he can't get pass the stupidity of this script."
    },
    {
      "rating": "2",
      "text": "Arguably one one of the worse movies I've ever seen. Hart's acting reaches levels of annoyance previously only Chris Tucker ever had. Ice Cube, however, sounds as if he's a franksenstinian amalgamation of cliche'd overworked cops that we've seen time and time again. The plot is clustered and unfocused, the relationship between Hart and Ice Cube makes little sense, starting off rough, as was intended, and follows through with that until the very end, with little to no form of development in between barring the insane amount of slapstick humour. The plot is clustered and non-sensical, and, unfortunately, even though the entire focus of the movie is the jokes, it fails at that miserably. I would only suggest this movie for any government agents looking for any viable torture techniques."
    },
    {
      "rating": "8",
      "text": "Ride Along is easily one of the funnier films I've seen in a while. Kevin Hart is the funniest man in Hollywood right now and everything he touches is golden. The only negative, to be honest, was Ice Cube. He seems to have regressed, if possible, as an actor and there were certain scenes that were just tough to watch without his mediocre acting breaking the immersion. All in all though, this is definitely a hilarious movie worth watching. As usual, the critics know nothing about comedy."
    },
    {
      "rating": "5",
      "text": "Eh, it's ok. Pretty predictable but it's never mind numbingly stupid like a Sandler movie, and Hart is always dependably funny. The dialogue never really has any comedic bite but there is a funny recurring joke about how Hart's obsession with a video game actually makes him a weapons expert. Nothing all that memorable or hilarious though."
    },
    {
      "rating": "6",
      "text": "You simply can't judge this type of film too harshly.  Cube is great, and Hart is funny as hell.  Hart's fiancee character is a terrible actress - or the director didn't give her much to work with.  Otherwise, it's a laugh, and likely will not be remembered come Oscar Season next year.  But who cares????"
    },
    {
      "rating": "4",
      "text": "A very predictable buddy cop film that just lacks enough humor.  By predictable I mean every step of the way you can guess where this film is going.  It's not unbearable like the spoof comedies but I didn't laugh enough.    D+"
    },
    {
      "rating": "5",
      "text": "It has its shares of outrageous laughs, but in the end, \"Ride Along\" is a comedy that delivers not many laughs that you would expect. I really enjoyed the second half of this movie more than than the first half. Maybe because there are scenes full of comical moments that are not seen anywhere in the trailers or promos. Other than that, it's still missing a step. Overall, even with some outrageous laughs, you still walk out of this movie feeling a bit underwhelmed. I give it a C+! But lets face it, you won't agree with me. So why fight it. Everyone else will love this. Overall, you'll still laugh your butts off."
    },
    {
      "rating": "6",
      "text": "Really good! In fact, I really enjoyed it! It funny, entertaining & has cool chemistry between the two main actors. It is cliched & done before, but it is just a cheesy bumpy ride throughout!!"
    },
    {
      "rating": "5",
      "text": "Completely unfunny, tedious, spectacularly moronic, and completely barren of any laughs whatsoever, Ride Along is a complete waste of comedic talent and time."
    },
    {
      "rating": "5",
      "text": "Where do I start?\rI never saw the preview before watching Ride Along. I heard it starred Ice Cube and Kevin Hart, so I didn't expect much from it. Ice Cube was typical Ice Cube, and Kevin Hart stuck to his comedian small guy act. Everything in this movie was very predictable. The acting was on the low side. But I did get a few good laughs in. Lawrence Fishburne was perfect for Omar's character, even if it was a small part to play."
    },
    {
      "rating": "4",
      "text": "Some funny scenarios and good chemistry between Ice Cube and Kevin Hart isn't enough to save Ride Along from buddy cop comedy clichés. My advice: skip this ride."
    },
    {
      "rating": "8",
      "text": "If you are looking for a clean comedy with Kevin Hart and Ice Cube, this movie is as clean as it can be with very little cussing and loads of action, I did enjoy this movie and also love watching Kevin Hart!!\rMy score for this movie is 8 out of 10."
    },
    {
      "rating": "5",
      "text": "This film is just not very well put together.  The plot is predictable even for a buddy cop movie, and the action is not very good.  That being said Kevin Hart was funny and the movie did score some big laughs in the theater I was in.  However despite its humor the movie does start to drag on.  I would only recommend this movie if you are a big Kevin Hart fan."
    },
    {
      "rating": "5",
      "text": "Frankly, Ride Along was only watchable due to the fact that I've enjoyed these actors in other movies. Kevin Hart is the sole actor to bring any humor out of the script, but given the flat performance of Ice Cube, Lawrence Fishburne and the rest of the cast, I just can't say that Hart's part is enough reason to watch.  Also, plot points are often introduced to soon be abandoned for the next minor plot point."
    },
    {
      "rating": "5",
      "text": "Ride along is yet a dumb funny buddy cop movie with a few laughs  and some entertainment but lacks some value and sense in its movie..What have been better with a proper storyline ..all in all I give it a 50/100"
    },
    {
      "rating": "8",
      "text": "Well, I must start off with the fact this movie is a bit cheesy, and some of the acting and such is a bit eh. However, for the most part this movie is hilarious and the funniest parts, to me, are the subtlest. Ride Along is a feel good movie worth going and seeing. Had it been R rated, who knows how good it could've been."
    },
    {
      "rating": "4",
      "text": "\"Ride Along\" manages to get a few laughs from me, but the main character played by the wild eccentric talented comic Kevin Hart is so annoying, yes I know he's supposed to be that way but it's so annoying and painful watching him for one-hour and forty minutes. Kevin Hart plays Ben Barber a security guard, who has tried to convince James (Ice Cube) that he is worthy of marrying James' sister Angela (Tika Sumpter). Ben is invited to the police academy, James decides to test his mettle by inviting him along on the shift designed to scare the trainee. Director Tim Story (Barber Shop, Think Like A Man and Fantastic Four) provides Hart and Cube some funny comedic landscape and Story does succeed by making it making it funny, but overall Hart and Cube would do better if they had a different director and had a better director instead Hart and Cube are trying to shine and make the script work also outshine the bad direction by Story. Laurence Fishbourne is good as the villain, also John Leguizamo is miss-cast."
    },
    {
      "rating": "6",
      "text": "Not the best comedy movie, but if you have nothing else to do, it can lighten your mood in many ways, there are plenty of funny scenes. But not the best story tbh."
    },
    {
      "rating": "6",
      "text": "Ride Along is pretty funny, but it's also kind of stupid of how they portray the \"ride along\", because a friend of mine described to me that the ride along he went on was scary."
    },
    {
      "rating": "7",
      "text": "I liked this movie. Not great acting or epic theater but who cares,  It was funny and kept me watching. Cube and Hart made a good team...  A bit predictable but this is Hollywood where nothing is a surprise anymore.\rIf you like Ice Cube and Kevin Heart and enjoyed movies like Rush Hour then this is worth a watch."
    },
    {
      "rating": "6",
      "text": "Its alright. Ride Along is a movie about a guy who tries to impress his girlfriends brother by proving to be \"Badass.\" It is pretty funny I just didn't think it deserved all the hype it got. The plot is pretty good except it is very easy to get lost in it due to all of the other information you are getting. Its extremely funny and a good comedy but the lack of plot isn't good. It felt a lot like a sequel then a new movie and you do not want your movie to look like a sequel.\r Ride Along gets a 6/10"
    },
    {
      "rating": "5",
      "text": "I really like both ice cube and Kevin hart but the movie is nothing special. The only way I see people liking it is if, like me, already like the actors or are young kids and teenagers. Its watchable but not too funny.  I smiled here and there laughed a few times and sad to say that was it. The chemistry between cube and hart was pretty good but with a so,I'd script and director I think they could be great together.  It's very formulaic in the story structure, characters are not too deep (doesn't need to be in a comedy but depth still helps) as with most movies, especially comedies dumb things people say or act  that would never happen in real life do happen in the movie for the sole sake of moving the story forward. There's no real tension and I think it just comes from a weak script and the directing could have been miles better."
    },
    {
      "rating": "7",
      "text": "This movie was a funny movie altogether, you would get to some part's that weren't interested but other then that its was a good movie .\rKevin Hart over course was hilarious , and Ice Cube was not too funny but played the part well ."
    },
    {
      "rating": "6",
      "text": "Not bad for what it is , As a partner cops making a movie with  Action, Comedy, Crime categorize you will find all the above   , Believe me I've seen worst :)"
    },
    {
      "rating": "6",
      "text": "If we see the movie from a technical standpoint and meticulously take a look at performances,execution,plot and production value we do not treat the movie right.Of course the movie is weak in all the above aspects but it is not meant to impress and win awards.This movie is enjoyable to watch from start to finish because of the personalities that take part in it.You will get a few laughs out of it and memorize some funny lines to discuss with your friends.The scenario is not the one that will get you thrilled but the approach and the attitude will win you over.If you want to be 0% serious and relax for a few minutes while turning your brain off that's the movie for you.For me this movie covered the aboved points and that was exactly what I expected.It is not worth watching in theaters but it's worth renting for a night."
    },
    {
      "rating": "5",
      "text": "Kevin Hart tried to be funny on this one. Like I could see that he was just trying way too hard in some scenes. Ride Along is not a terrible movie it's just an OK. I really tried to stay and enjoy it. But it barely make me laugh. All I can say it's that you will forget about this movie soon."
    },
    {
      "rating": "6",
      "text": "I give this a 5.5 which translate to a 6 but I was expecting more effort in the plot than what it turned out to be. I love Kevin Hart and I think he is naturally funny, but he did nothing here that I haven't seen before. Good thing Ice Cube showed up as his polar opposite or else this would've turned exponentially banal.\r As far as comedy movies go, this is average as it gets and really seems formulaic. I don't easily laugh at old elements of comedy and I tend to look for something new so this movie disappointed me there. Another thing I want to say is not all the scenes are particularly captivating so expect lulls in the film.\r All in all, it gets a 6 because you'll get the laughs and who doesn't love a bit of cop-badguy action?\rWord to describe: Wandering, it's not as good as you think as it gets predicative so your mind will wander every once in a while.\rWatch it with some friends and it's okay to get the annoying movie friend to come because it's a comedy. Even the annoying movie friends deserve to laugh a bit."
    }
  ],
  "recommendations": [
    "ride_along_2",
    "horrible_bosses_2",
    "30_minutes_or_less",
    "identity_thief",
    "stuber",
    "the_other_guys",
    "central_intelligence",
    "tower_heist",
    "the_longest_yard",
    "the_watch",
    "this_means_war",
    "the_wedding_ringer",
    "cop_out",
    "spy",
    "thunder_force",
    "little_fockers",
    "baywatch",
    "the_wrong_missy",
    "zoolander",
    "hubie_halloween",
    "paul_blart_mall_cop",
    "22_jump_street",
    "rush_hour_3",
    "dinner_for_schmucks",
    "get_smart"
  ]
}