{"id": 1880, "title": "Ride Along 2", "starring": ["Kevin Hart", "Ice Cube"], "runtime": 102, "genre": ["Action", "Comedy"], "description": "As his wedding day approaches, Ben heads to Miami with his soon-to-be brother-in-law James to bring down a drug dealer who's supplying the dealers of Atlanta with product.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/2433Vt8xuDnAIDAJTNx6DEtf9Qb.jpg", "categories": {"plot": 5.071428571428571, "acting": 5.769230769230769, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.775510204081633, "action": 5.571428571428571}, "reviews": [{"rating": "5", "text": "Typical comedy sequel that can't live up to the hype of the first movie, funniest moments were ruined by the trailer. Mediocre movie with not many laughs."}, {"rating": "3", "text": "Check out the Formal Review episode on Ride Along 2and full review here:\rhttps://youtu.be/K8UoO4lGTvg\r Enjoy, comment, and subscribe!\r -Classy Guy in a Bow Tie"}, {"rating": "8", "text": "Ride Along 2 was a very funny movie. I enjoyed it and would recommend my friends to check it out. I really enjoy Kevin Hart. Would like to see more movies with him in it."}, {"rating": "3", "text": "Ride Along 2 isn't worth riding on to the theaters to see. If Ice Cube and Kevin Hart can be good buddies, then it should only be the first one that's worth it."}, {"rating": "5", "text": "A meager entry into the \"Kevin-Hart buddy comedy\" sub-genre, \"Ride Along 2\" is a stale, recycled cop caper that is rarely funny and filled to the brim with half-hearted performances."}, {"rating": "1", "text": "I get that people watch this for Kevin Hart and some people watch this to get entertained. I'm the second type of people. Kevin Hart is like Adam Sandler. He plays the same character as before and get this, he tried so hard to give you a laugh. Ice Cube actually made me chuckle a little because the insults he gave Kevin, felt like I was saying it to him. Anyways, Ride Along 2 is just terrible, childish, and unfunny (sometimes funny)."}, {"rating": "0", "text": "I would say \"Ride Along 2\" is Kevin Hart's funniest movie yet but that could be construed as hate speech. He seems like a great guy in interviews but not all great guys are funny or creative."}, {"rating": "7", "text": "Ride Along 2 does have its moments and Kevin Hart and Ice Cube have outrageously good chemistry as well as Ken Jeong and Olivia Munn, but the film is just too cliched and it's your regular buddy-cop comedy. The film is long, and the plot is the same thing in every single buddy-cop comedy. It isn't too much worse than the original, but I guarantee you that you've definitely seen this before."}, {"rating": "3", "text": "Ride Along 2 is almost exactly like the first Ride Along - sure, it has it's standout moments, but most of it is boring and stupid. The film just can't grasp the viewer, and leaves them bored."}, {"rating": "10", "text": "I found this movie to be hilarious.  The entire audience seemed to agree with me as the whole theatre was laughing throughout.  Weird that it only got 15% from the critics.  I think it did it's job which was to provide the audience with laughs :D"}, {"rating": "4", "text": "Oh great we get to see Kevin Hart be annoying and unfunny again in this Ride Along franchise [sarcasm]! I didn't think the first Ride Along was funny at all, yes it gave me a few laughs but I find Kevin Hart annoying and unfunny but Ice Cube saved the mediocre action buddy-cop movie. But now we have a sequel just what this stupid mediocre action-comedy franchise needs. Let me tell you that this sequel is not good at all, the gags are unfunny (but some do work). Ben Barber (once again played by Kevin Hart) a former high school security guard who is a month out of the police academy and a week away from marrying James' sister (Tika Sumpter). He wants to be a detective like James (played again by Ice Cube), his future brother-in-law, James reluctantly takes Ben to Miami to follow up on a lead that's connected to a drug ring. The case brings them to a homicide detective (Olivia Munn) and a computer hacker (Ken Jeong) who reveals evidence that implicates a respected businessman. It's up to James and Ben to prove that charismatic executive Antonio Pope (Benjamin Bratt) is actually a violent crime lord who rules southern Florida's drug trade. Munn and Jeong shouldn't be in this movie because both of them are talented, and they can't save this film either. Director Tim Story directs once again, and the direction is once again terrible. Bratt as the villain is okay, he did an okay job. Jeong isn't funny here, he deserves better material. If your a fan of the first one, go see it! But for the rest stay away, this film isn't worth the ride. Let's not hope their not making another one of these movies. 2 out of 5"}, {"rating": "9", "text": "ok i really dont get why this movie is getting such bad ratings i mean i thought it was absolutely hilarious myself and come on people did u rerally expect it to be like the first if so then rewatch the first and let us enjoy it for what its truly meant to be a comedy meant to make u laugh and brighten your day i think it did its job myself i say go see it"}, {"rating": "8", "text": "Like most comedy sequels, \"Ride Along 2\" tries to give audiences more of what they enjoyed with the first movie, only bigger. The situations Hart and Ice Cube get themselves involved in are crazier and more absurd this time around, but the real laughs still come from watching Kevin Hart's motor mouthed character getting shutdown by Ice Cube again and again.\r The biggest problem with most comedy sequels is that as they get more over-the-top, they lose touch with what worked in the first movie and end up being more stupid than funny. Ride Along 2 however is one of those rare cases where bigger actually is better. The reason for that is because of it's two leads.\r Both actors are completely committed to their roles. It's their enthusiasm and ability to roll with whatever situation they are thrown into that makes it all so funny. Not every joke nails the landing, but I still found plenty of laughs to be had here.\r The main area where this sequel stumbles is in the actual cop side of things. The crime, villain, and detective work are all too familiar. We've seen it all before which leads to a huge sense of predictability. The set up works in allowing there to be plenty of humorous situations for the duo to get involved in, but watching them hit road bumps in their investigation that everyone who watches it will see coming from miles away just makes the characters look really stupid. At least we get some nice explosions. The firefights that surround them aren't much to talk about.\r When it comes to jokes Ride Along 2 delivers. Ken Jeong is a great addition and Hart and Ice Cube are great at using their personalities to keep bouncing (most) of the jokes off of each other. It stumbles where the police work is concerned due to familiarity and the not very exciting action, but this is a comedy so it's the jokes that matter most anyway. Ride Along 2 goes bigger than it's predecessor and in a rare turn for comedies ends up better. If they can keep the Hart, Cube, and now Jeong magic going I wouldn't actually mind seeing a third movie, as there are plenty of laughs to be found here and potential to keep things going."}, {"rating": "5", "text": "For Ride Along 2  bigger doesn't always mean better,but satisfying more the less.One thing Ride Along 2 did good no GREAT was Kevin Hart, the guy is just the best comedian in Hollywood and it shows in this movie and I guarantee Kevin Hart fans will not be disappointed, every time he steps on you just laugh and laugh although it feels he carries the weight of the film too much unfortunately the same things can't be said for the co-stars.Ice cube who plays as Kevin Hart's partner is just too dry at times and his seriousness doesn't always match with Kevin's wit although there were some fun moments between the two.Ice Cube and Kevin Hart just don't have great chemistry and some of the heart felt moments between the two felt cheap, same thing can be said about Oliver Munn who is the exact same character as Ice cube but she has tries to have a more comedic role which felt awkward and cringy at times with makes you go no Psylocke no(fingers crossed she won't do the same thing in X-Men Apocalypse), but all this can be ignored because there is a lot fun and enjoyment in this movie . This sequel outshines the original in the comedy as Ride Along 2 is Funnier and crazier although some of the jokes feel forced and lazy and the first half of the movie is rather dull but picks up fast.Ken Jeong is the best new character this movie has and he has some great scenes as well as Tika Sumpter who plays Kevin Hart's girlfriend who wasn't in the film as much but was good in the film as Ben's girlfriend.The villain in this film is rather generic and cliche but is a better villain than the first movie, but if you don't mind cliché villains you won't mind.So overal Ride Along 2 is not as good as the first Ride Along but is a satisfactory sequel, a good popcorn flick,if you're looking for something deeper in this film you won't find it as the film has weak character growth, but no  the less Ride Along 2 has great comedy, some wild action and if you can ignore some bad CGI and weak characters you will have a great time."}, {"rating": "7", "text": "They both are getting closer professionally as well as family.\r When I liked the first movie, I wanted a sequel and now they made one for it that I liked even better than the original. I don't think Ice Cube's solo performance could have pulled the crowd in, the impact was because of the Kevin Hart's presence, he really rocks. He's doing some awesome movies lately, and he's the best sidekick and comedian available for now in Hollywood, just like Simon Pegg in England.\r Once again a movie is totally underrated, especially by foul mouthed film critics. Trust me, this film is much better than what they say. If you liked the first, you'll surely going to enjoy it as well. I'm confident the rating will recover in the later days once the regular people rent it. A simple follow-up story, but it was the comedy that lifted this film. The two cops soon-to-be bros-in-law goes to Miami on a job, but the case they're working connects with others, so they join the local force to take down the gang behind it.\r Who needs a spoof film for it, the movie mocks its own characters by saying 'a low budget Jackie Chan' for Keng Jeong. Apart from the comedies, the action sequences were very impressive. Olivia Munn was a great addition and I believe she would hangouts here for the next. Yep, I want the third movie and I'm hoping it to be even more stylish kick-ass action-comedy. So just retain the director and writers, after the first two films, I got high hope on them.\r 7/10"}, {"rating": "6", "text": "Not bad for what it is , As a partner cops making a movie with  Action, Comedy, Crime categorize you will find all the above  in it  , That part I liked more than the first one but can't rate it more :)"}, {"rating": "4", "text": "Alright first of all no one ever asked for a sequel to the ride along movie. Secondly this one is worse than the first. This is just a rehash of the first movie but with different objectives. The chemistry between Hart and Ice cube is not good at all though they’re the best part in the movie. This movie isn’t funny at all most of the jokes were flat. It even had a terrible way of editing just like the first one. The only thing that was interesting in the movie was the car chase which was really unique and enjoyable. The villain was god awfully terrible and cliched.In the end Ride Along 2 is a very forgettable movie with Hart trying hard to make people laugh but at this point people are getting tired of kevin Hart’s comedic movies."}, {"rating": "6", "text": "This movie was full of mediocre action and senseless humor. Overall I enjoyed this movie. If you don't have a good sense of humor this movie is not for you. It's not worth a trip to the theater but definitley a rental"}, {"rating": "4", "text": "A sequel that is about on level with the first film.  While the film fails to bring much new to the buddy cop genre, it has a chuckle or two so it's not completely unwatchable.  C-"}, {"rating": "4", "text": "Ride Along 2 is generic, unnecessary and predictable. However, it remains entertaining throughout and is funny if not hilarious at times. The chemistry between the two leads work here."}, {"rating": "4", "text": "Ride Along 2 feels like a movie that no one asked for. It re-uses lots of humor and jokes from the first film. It still has it's moments like the first movie but they are few and fair between. It's got a generic story that you feel like you've seen before. If you enjoyed the first Ride Along you may enjoy this film. But sadly it doesn't really bring anything new to the table."}, {"rating": "7", "text": "I quite enjoyed the movie. Maybe it is a bit similar to first part and I wouldn't say that it is unbelievably funny, but I do recommend it if you want to watch something fun without going into it too much."}, {"rating": "1", "text": "Another bad Kevin Hart movie. Kevin himself is funny, but his movies are just so bad. They always are a huge cliched boring mess. I wish he would just move on from movies."}, {"rating": "4", "text": "Ride Along 2 was much better than I expected, in that I casually chuckled more than a few times. Hart and Ice Cube are great, and I love Olivia Munn. This isn't good or hilarious but it's diverting enough."}, {"rating": "2", "text": "It's no surprise that a buddy cop movie with Kevin Hart and Ice Cube isn't funny or entertaining in thr slightest. Much of the humor is dependant on slap stick and sex jokes and is usually forced. Ice Cube is playing himself again and Kevin Hart is playing that stubborn black elf character that he is known for. The movie struggles to find a story arc and is unsuspenseful due to each event being rushed into a January release sequel. The ending happened so fast that it almost seemed like the director didn't care to actually finish the project."}, {"rating": "5", "text": "This movie is bad.But kevin hart was good in this movie and there were a few laughs. But this movie is unforgettable and most of the jokes were bad.So I give ride along a 5/10 it is ok"}, {"rating": "8", "text": "They improved a lot about it, and I laughed a lot. The actors were funny, and played their parts well. They made the story better, and the ending was great. It is worth a watch."}, {"rating": "4", "text": "Ride Along 2 is one of those Kevin Hart films where you have to suspend your disbelief throughout the entire film or else you're going to have a bad time. The jokes, as you can expect, are hit and miss. Mostly Kevin Hart fans will be the ones laughing at the comedy. The action is mediocre, but then again that's not why you're in this movie. And the plot will have you saying \"what\" throughout the movie.Its really not that different from the first one. Its's Kevin Hart and Ice Cube teaming up to stop the bad guy. Overall, this is a movie made for those who want to see Kevin Hart on the big screen again or those who want to have a relax date night. If you don't go in expecting much, then you'll have a good time."}, {"rating": "3", "text": "i am not your servant..Ride Along 2Pointless to create the same old buddy cop with predictable dull script and less funnier than the first one even though the bar wasn't set so high."}, {"rating": "6", "text": "Not on the same level as the original, unfortunately.'Ride Along 2' still isn't anything bad or overly boring, it's possibly worth a single viewing, but there is nothing to remember from the 101 minute run time - which does drag at times. The humour is average.Kevin Hart (Ben) is probably the best performer here, not so closely followed by Ice Cube (James). Ken Jeong (A.J.) has a few mildly amusing jokes at the beginning, though soon turns into a forgettable character. Olivia Munn (Maya) is meh, while Benjamin Bratt (Pope) is a dull villain. There's a good cameo from a 'Fast & Furious' actor though.I like 'Ride Along', though its follow-up is disappointingly uninspiring."}, {"rating": "8", "text": "Very funny movie. Kevin Hart is so hilarious. It's almost like watching the movie Friday but with cops."}], "recommendations": ["ride_along", "cop_out", "the_other_guys", "tower_heist", "horrible_bosses_2", "spy", "the_longest_yard", "stuber", "central_intelligence", "22_jump_street", "30_minutes_or_less", "paul_blart_mall_cop", "identity_thief", "get_smart", "dodgeball_a_true_underdog_story", "the_wedding_ringer", "thunder_force", "masterminds", "horrible_bosses", "this_means_war", "get_hard", "rush_hour_3", "chips", "date_night", "little_fockers"]}