{
  "id": 4032,
  "title": "Rim of the World",
  "starring": [
    "Jack Gore",
    "Miya Cech"
  ],
  "runtime": 99,
  "genre": [
    "Science Fiction",
    "Adventure",
    "Action",
    "Comedy"
  ],
  "description": "Stranded at a summer camp when aliens attack the planet, four teens with nothing in common embark on a perilous mission to save the world.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yhzTeZU5OULn3ePGF58Rc5oIocZ.jpg",
  "categories": {
    "plot": 3.125,
    "acting": 1.25,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 4.75,
    "funny": 3.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Stranger things set in motion the production of a whole category of movies and Rim of the World is one of them.. Kids, sci-fi and the scent of the eighties. And while I am no fan of stranger things I admit that it tries to avoid some of the terrible clichés. Not so Rim of the World. Rim of the world celebrates them. Unabashed. It pulls no punches. It feasts on them. This movie truly does not show any shame in being a totally unoriginal.Just a small list..Fat kid that is the comic relief. Main lead is a shy kid, afraid of everything, including heights and girls.The third guy is the brave upright boy with a dark and sad past.The last is the girl who puts all the boys to shame time and again.This leads to the absurd moment in which the little sprout drives a muscle car around for which she simply lacks the length.The blond biatch is missing.. There is just one girl.The all have their predictable story arcs.The story?When the evil aliens strike earth.. the kids get hold of the key that will save all by destroying da mother-ship. It is a forgone conclusion that they will do so, but we have to watch 90 minutes of regurgitated material before the aliens snuff it. Bleh..I try to hold out, thinking that at some point they just must run out of clichés and be forced to do something original. But there is no end to it...If it was just funny and didn't take itself so seriously? But no..this is as deadly serious as they come..The only redemption is in the music.I pity the kids doing their best.But the best is not enough.Avoid at all cost."
    },
    {
      "rating": "1",
      "text": "When Hollywood is being ruled by marketing managers rather than artists, it shows. What an awful movie, pandering to teenagers, full of product placement. Don't waste your time. It's not funny nor entertaining. Just painful to watch."
    },
    {
      "rating": "2",
      "text": "Why would you make a movie that only kids would watch but rated for adults? Unwatchable."
    },
    {
      "rating": "3",
      "text": "Con el teaser tráiler me entusiasmé mucho, pensé que podría llegar a un 7 (porque el pésimo CGI se veía venir) pero no todo es \"buenos gráficos\" en la vida, así que le di una oportunidad. Casi de inmediato me gustó mucho la cosa del campamento, pienso que se hubiesen quedado ahí, lo que viene después me hizo pensar que un niño de 12 años creó esta cosa, aunque un niño de 13 no podría copiar descaradamente a Jurassic park, o si?, En fin, pésimo CGI, pésimos conceptos. ¿Eso es una visión térmica o que? Si están aburridos un domingo, muy recomendable, saludos"
    },
    {
      "rating": "0",
      "text": "This movie was truly atrocious in every regard. Nick Allen put it perfectly in his review. Avoid at all costs."
    },
    {
      "rating": "3",
      "text": "The first 15 mins of the movie were just too cringey. I hated the blatant racism towards white people and Asians and was offended by how they portrayed black people. It was a turn-off. A few days later, I finished it. The rest of the movie wasn't that but it was so meh and cringey that it isn't worth the time. If there is nothing else on, and you're falling asleep, it's a good movie."
    },
    {
      "rating": "3",
      "text": "Bad writing.  Mediocre acting.  Much of the subject matter annoying and humorless.  Juvenile beyond juvenile."
    },
    {
      "rating": "1",
      "text": "Not appropriate for kids. Kids swearing, racist stereotypes. Girl has no lines in the first 30 mins... I don't know what this movie is supposed to be, but not worth watching and not worth watching with kids."
    },
    {
      "rating": "8",
      "text": "I thought it was great fun. As an adult, sure there were plot holes and goofs. However the monster was pretty good, and it actually made me laugh out loud several times. As I remember Goonies made me feel about the same way. So people can trash it if they want I think it has some staying power with the teen set."
    },
    {
      "rating": "3",
      "text": "This movie simply didn't know what it wanted to be. Part \"stranger things\", part \"terminator\", part \"independence day\", but failing to capture any of these themes. The four main characters are all stereotypes that we've seen a million times in other, better movies. Very racist undertones as well, although in fairness the movie was equally racist towards the black, white and asian characters. Best avoided."
    },
    {
      "rating": "4",
      "text": "It feels like watching a B movie, but it's not without it's charm. The plot is full of gaping holes: Where exactly did everyone go? Where are all the rest of the aliens? And the one alien we do see looks like Goro made love to Venom. My under-13 children did have a few chuckles, however. \"It's another 7-11!\" I don't regret watching it, but only because my little ones thought it was pretty good."
    },
    {
      "rating": "8",
      "text": "Rim of the World is a Netflix movie in the same kid adventures vein as Monster Squad and The Goonies. It'd about three oddball kids at a summer camp and another one they meet. An alien invasion hits, and the kids end up trying to get a military data device to the authorities. I rather liked this one.The film is fairly amusing, and the four leads are pretty likable. The kids all have the same ol' worn trope of hidden, personal struggles, but the screenwriter seems to realize this and makes sure not to spend too much time on it. Cinematography consists of good lighting and some nice southern California scenery.There is some glaringly uncomfortable sterotypical black guy dialogue as only written by a white man. The romance is forced. The movie doesn't really seem to know how juvenile or mature it is supposed to be.Overall, I found this to be light fare. Not much of substance, but the movie is just having fun."
    },
    {
      "rating": "3",
      "text": "I don't really know what this disaster wanted to be. To be honest I don't know how McG still gets to make films."
    },
    {
      "rating": "4",
      "text": "film rather silly, beautiful quotations of famous films, but very badly narrated, little special effects and all very obvious."
    },
    {
      "rating": "0",
      "text": "Just when is Hollywood gonna come clean with the ethnic jokes? \"Black\" this and \"White\" that. And what really ticked me off was the comment to the Asian girl about \"calling off the attack from North Korea\". Netflix and Hollywood in general plays a great game of calling out racism, yet they love to promote it. And with a movie aimed at teens that no doubt will be viewed by younger viewer too. This kind of behavior in films only teaches kids that it's okay to do this. And the stereotypical kids (and all characters basically) in the movie are outrageous. The black/Indian kids part was hard to watch and I felt embarrassed (and I watched the movie by myself) when he delivered most of his lines and actions. A blatant rip-off of Kenan from the \"Kenan and Kel\" show, but with a bully attitude.As far as the movie goes, I got through 49 minutes and had to give it up. The jokes didn't bother me as much as the productions insult to the audiences intelligence. Snatching scenes and even sound effects from so many other films is lazy and the reason why this movie was never going to see a theater showing. It's on Netflix for a reason. It's no doubt a rejected movie from other studios, and those of us who actually pay for Netflix, bought into this terrible film. As Netflix prices go up, and their quality goes down and is becoming saturated with garbage, I'm flirting with cancelling. Something I thought I'd never be considering."
    },
    {
      "rating": "1",
      "text": "\"Kids on a daring adventure\" type movies live or die based on heart. This movie has no heart.You have to connect with the characters and feel that they are likable, relatable, and that their adventure has real meaning. This movie misses all of it, leaving the kids as either blanks, unlikable, or just forced and fake. The young actors do their level best, but nothing can save this movie from terrible writing.If it were at least a bit more family friendly, it would have that going for it and you'd forgive it, but no. It's often too vulgar or too violent for families. Hard pass."
    },
    {
      "rating": "3",
      "text": "7/10 sepcial effects 3/10 story, the story is total garbage, i want my time back, next time im going to watch Dirty Grandpa"
    },
    {
      "rating": "3",
      "text": "It’s just like Stranger Things with aliens except it’s writing, acting, directing and story is not good."
    },
    {
      "rating": "3",
      "text": "This film is just pure cringe but not awful, but not great writing. They spent to much time on the visuals, clearly. And Darius, just deserves a massive punch in the face."
    }
  ],
  "recommendations": [
    "spy_kids_all_the_time_in_the_world",
    "the_smurfs",
    "free_birds",
    "we_can_be_heroes",
    "diary_of_a_wimpy_kid_the_long_haul",
    "g_force",
    "alvin_and_the_chipmunks_chipwrecked",
    "home_sweet_home_alone",
    "cloudy_with_a_chance_of_meatballs",
    "project_x",
    "bad_moms",
    "fifty_shades_of_black",
    "the_emoji_movie",
    "the_boss_baby_family_business",
    "the_war_with_grandpa",
    "chicken_little",
    "uglydolls",
    "minions",
    "the_croods_a_new_age",
    "planet_51",
    "norm_of_the_north",
    "goosebumps",
    "zookeeper",
    "space_jam_a_new_legacy",
    "shadow_in_the_cloud"
  ]
}