{
  "id": 1586,
  "title": "Rings",
  "starring": [
    "Matilda Lutz",
    "Alex Roe"
  ],
  "runtime": 102,
  "genre": [
    "Horror"
  ],
  "description": "Julia becomes worried about her boyfriend Holt when he explores the dark urban legend of a mysterious videotape said to kill the watcher seven days after viewing. She sacrifices herself to save her boyfriend and in doing so makes a horrifying discovery: there is a \"movie within the movie\" that no one has ever seen before.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yp4CDOVpVmNwiPoZKQeFCpW8CFo.jpg",
  "categories": {
    "plot": 4.5,
    "acting": 4.0,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Although it isn't terrible, \"Rings\" is a completely unnecessary sequel that does not offer anything new to this franchise, but instead muddles the mythology and previous plot points up."
    },
    {
      "rating": "2",
      "text": "\"First you watch it, then you die\"...of boredom. Don't ask me why I keep seeing these awful horror movies, you just never know when one might be good. Rings starts with such a hilariously terrible scene you end up asking yourself, it can't get any worse can it? Well actually yes. Yes it can. Join a bunch of one dimensional characters as they watch a video they're not supposed to and generally stumble through this jump scare infested predictable **** of a movie eventually leaving you at a dramatically over the top conclusion that caused the entire cinema (i.e. all 20 of us) to burst into an uncontrollable fit of laughter. NOT recommended, save yourselves."
    },
    {
      "rating": "2",
      "text": "Describing Rings in a couple of words without having the entire whole review to be overflowed by words of wisdom would be hell for me. Not only it tries too hard at baiting people, but it just hits the \"Make Stereotypical Sequel\" button and lands on the \"Release Movie Early\" mark. Seriously, movies like these are so terrible that it makes me want to go do a speedrun of the original Sonic the Hedgehog games where I manage to collect every ring without getting hit. In fact, since I said that, it makes me wonder why he isn't in these movies. We could easily forget about these dumb horror movies if that ever happened which is completely doubtful."
    },
    {
      "rating": "2",
      "text": "A convuluted mess of a sequel that tries to add to the lure, but instead takes from it.  There is nothing that makes this sequel stand out.  Rings is sloppy and highly forgettable. D"
    },
    {
      "rating": "0",
      "text": "I think that this film was a very dumb remake of the original Rings in 2002. Rings 2002 was a much better film than Rings 2017. I think that all of the cast's and crew's talent was wasted on a terrible film. I was so excited for this film but my excitement was wasted when I saw this movie. I will never see a film like this in theaters again."
    },
    {
      "rating": "7",
      "text": "I had a special history with the Rings franchise because I remember The Ring being the first horror movie I ever watched as a kid that really scared me.Johnny Galecki and Vincent D'Onofrio I thought did an excellent job in their roles. Unfortunately the main couple that were clearly late 20-somethings cast at college freshmen weren't quite as inspiring.I thought the movie felt more like a psychological mystery with a darker twist than an actual horror film. Meaning I was never really scared while watching the film, for a part of the movie even Samara could be considered on the good team which makes it hard to be scared in that scenario. The film felt more like a reboot than a sequel as well. There were a few plot points I found intriguing, mostly I liked the ending, some might call it cliche but I didn't see it coming and it had the right feeling of how a horror movie should end imo.Overall I would say the movie was decent. I don't think it lived up to the reputation the first movie has and by no means am I saying everyone should go out and see it but I certainly don't think it deserves the 1/10 and 2/10 reviews it seems to be getting. It was a serviceable film and wasn't any worse than most of the horror movies that have came out recently. I think a 6/10 or 7/10 is a fair score."
    },
    {
      "rating": "7",
      "text": "The movie was cliché and stereotypical, it was predictable and it wasn't particularly scary, but the acting was generally good, the story wasn't too bad and the movie was entertaining. It isn't the best horror movie of the year, but it's not half as bad as what people say."
    },
    {
      "rating": "1",
      "text": "Невероятно плохой фильм, вроде должен быть страшным, но сидя на кресле 102 минуты можно было заснуть, тоска смертная. Скримеры не пугают, воздействия на психику нет вообще. Ужасно"
    },
    {
      "rating": "6",
      "text": "Rings took an odd over-the-top angle from the very start that did not pay off. The actors did a good job but could not make up for the plot which was clearly an attempt to out do the versions before it... in a bad way. You will notice this forced complexity to the story. You will find yourself more infatuated in mystery, than in actual horror itself. There are no moments that feel real. This film had much more to work with yet provided a slightly below average experience compared to the horrors it should have been competing with. First you watch it. Then you probably won't again. However, I will not be one of the idiots to give this movie a red score. It was still fun to watch, the concept is close enough to the original, and you have not seen a bad horror movie if this is the worst it can get for you. Worth the watch for the average horror fan if you have nothing else better to do on a weekend."
    },
    {
      "rating": "1",
      "text": "An absolutely unnecessary redesign of Ring.It is bloody and violent but the rest is for the ton. Very sad.I wish the Hollywood finally stopped filming old stuff again and again. No one needs that ****"
    },
    {
      "rating": "10",
      "text": "Very good movie. I love it very much. This is a better don’t listen to the crictic. The opening of this movie was very awessme. I watch watched it and I enjoyed very Much. Thank You paramount"
    },
    {
      "rating": "4",
      "text": "Rings isn't great. From the beginning we have a nonsensical gory scene that adds nothing to the plot accept that Samara's tape was in the VCR of a girl who had been killed a week previous. Overall the film is filled with horror tropes and seems more like an extra long episode of Supernatural than an actual film."
    },
    {
      "rating": "3",
      "text": "Despite being entertaining throughout and having a less than terrible mystery, Rings has bland characters and zero effective jump scares. A step down for the franchise."
    },
    {
      "rating": "3",
      "text": "Rings is boring garbage that you will forget in a couple of minutes    ."
    },
    {
      "rating": "5",
      "text": "An interesting take on the Rings franchise. The film held my interest for the majority of the 2nd and 3rd acts but fell flat in its deliverance of scares and horror elements."
    },
    {
      "rating": "3",
      "text": "When I heard that there was going to be a Ring reboot, I instantly got excited. The Ring was one of my favorite horror films growing up as a child. It’s one that I can still watch today and love. The trailer for the reboot looked good, maybe not like the best movie I would see, but good enough that I was excited enough about it to watch it the day it came out.Upon entering the movie,  I was pleased to see that quite a few other people shared my excitement, but also really upset that there were so many teenagers in the movie. I despise watching horror films with kids. They are always so loud. I sat with my popcorn and soda and waited anxiously for the movie to start, but I realized pretty soon that the previews were the best part of this film.The opening sequence on the plane showed such promise for the rest of the movie. It opens with a plane full of people, and of course one of them has seen the dreaded VHS film. Zach Roerig is the unlucky contestant on the plane, and he tells his worries to a fellow passenger. When he says that today would be the 7th day, you can see the dread on his face. Then, his nose starts bleeding. Chaos erupts on the plane after wards as the film starts showing on all of the mini seat TV’s on the plane. Basically, Samara is there to take our beloved Matt back to Mystic Falls where he belongs (If you don’t get the reference, I’m sorry, The Vampire Diaries is where Roerig belongs, not here).Quite honestly, that’s the best part of the movie to me. The rest is your typical bad horror movie. The premise for this reboot is a college professor buys a VHS player and sees the film. He learns if you make a copy and make someone else watch, your life is spared. He sees this as an opening to the “other side”. He’s dating on of his students, played by Aimee Teegarden, who I was honestly excited to see in another project, but disappointed with her performance, and she helps him choose “apprentices” from his class to watch the movie and then copy and make someone else watch. Basically, he is creating a never ending chain of doom. One of the students chosen is Holt, boyfriend of our protagonist, Julia. When Julia can’t get ahold of Holt for several days, she packs her bags and heads to his college, and gets caught up in the middle of all the drama.Holt hasn’t found anyone to watch his copy of the movie, and Julia wants to save him, so she watches the film herself. Honestly, I would have grabbed literally anyone and made them watch, but true love at it’s finest, right? Sure. When Julia tries to copy her film, it seems there are new images in the movie, and hers cannot be copied. So, she has to figure out the mystery behind Samara and save her life.I’ll admit, it had potential. But it fell flat on its face. It used elements of its 2002 predecessor, but didn’t execute them in a manner that could stand next to the original. Everyone hated The Ring 2, and even it is better than this one was. The whole film was boring, slow, and the acting was sub-par.  There was a little bit of a twist in the story near the end, but it completely went off course of how I thought the movie should have went. I didn’t like the creepy professor using his students as pawns in a life-or-death game story. I didn’t like the twist. Samara didn’t scare me. I didn’t get the creepy feeling I got from watching the 2002 version of this film. Overall, I just didn’t like this movie. It wasn’t the worst horror remake I’ve ever seen, but it is by far not anywhere near the best. I’m disappointed I paid $12 to see this, and I wish I would have waited.In my personal opinion, I recommend waiting to see this film when it’s released on DVD or Redbox. Instead, pop some popcorn at home and put in The Ring , it will be a much better time, I promise."
    },
    {
      "rating": "4",
      "text": "I thought this would be garbage. Turns out, it's much better than I thought. Does that mean it's a good movie? Nope. At least the movie is better than The Bye Bye Man."
    },
    {
      "rating": "2",
      "text": "'Chamados'O que é isso? , O que fizeram ? O filme é um reboot ou seja , uma historia a parte , mas meu deus , que coisa horrível! Primeiramente , era desnecessário um reboot , devia ter os personagens originais , fora que tem umas coisas sem sentido aqui , agora tem duas fitas! , a Samara 'salva' a Julia , mas tem umas coisas  boas também , o cara cego é pai da Samara , achei legal isso , porém , desnecessário para ser revelado em um reboot , e que final horrível , a Samara encarna na Julia , fora que parece que terá continuação , nem consigo imaginar uma sequencia , pois alem de estar 'fechado' , ficou ruim para uma sequencia da história original , trágico."
    },
    {
      "rating": "0",
      "text": "The perfect example of \"Lets make a movie just for the money, even if its not much\" There was literally no reason to make another one, its just recylced material ...."
    },
    {
      "rating": "3",
      "text": "I don't know what the hell went wrong here. This movie... is awful. Sadly, this is my first experience with the The Ring films, as I haven't seen the first one. Every scene is either mediocre, bad, or abismal. There is not one good scene. The worst scene has to be the climax, as the acting is corny as all hell. Please, from my experience, do NOT watch this if you have not watched the first one."
    },
    {
      "rating": "0",
      "text": "For the million time how’s this movie not rated r like dude these movies are not good either"
    },
    {
      "rating": "7",
      "text": "Rings is not as bad as people are saying. The concept is little bit different but that doesn't effect the movie.I liked the film and would see it again no problems. It links to the first film, has a start, has a development and has an proper ending.This film has structure, meaning and is consistent. Yes, it was less scary than first one but that isn't a problem. Most of horror movies nowadays are terrible, and this is not one of those at all, I'm sorry, it isn'tDon't get influenced by negative reviews. I don't know what negative reviewers wanted from it, I enjoyed it and would recommend it."
    },
    {
      "rating": "4",
      "text": "A film student ends up watching the tape because he was told to by his professor so her and his girlfriend need to move Samara's dead body out of a blind priest's basement...because reasons."
    }
  ]
}