{
  "id": 1045,
  "title": "Rio 2",
  "starring": [
    "Jesse Eisenberg",
    "Anne Hathaway"
  ],
  "runtime": 101,
  "genre": [
    "Adventure",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "It's a jungle out there for Blu, Jewel and their three kids after they're hurtled from Rio de Janeiro to the wilds of the Amazon. As Blu tries to fit in, he goes beak-to-beak with the vengeful Nigel, and meets the most fearsome adversary of all: his father-in-law.",
  "releaseYear": "2014",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/i5b1rX1gEFS2OEi2wApM1wLsAHX.jpg",
  "categories": {
    "plot": 6.47457627118644,
    "acting": 7.0,
    "ending": 6.25,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 7.1,
    "funny": 6.222222222222222,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The first movie was a silent hit. One of the best animations on that year. Usually successful movies make comeback in sequels and I expected the 'Rio 2', but was not sure. 'Ice Age' series were the massive hit from the Blue Sky Studios. Other movies did not look like coming back in sequels. So 'Rio' gave them a chance to go on with a sequel. After this movie's success, now you can count on the 3rd as well. If it doesn't come then it will be a disappointment.\r Nowadays the animation industry is not targeting only the children, but adults as well. So the contents, including the story must benefit all age groups. This movie series were excellent, good story with messages in it. Especially this second movie talks about wildlife conservation like the movie 'Happy Feet'. Showing to the kids would be an educational. What a cute way to learn something valuable.\r Blu and Jewel with three kids enjoying the life. Jewel is an ideal mother who wants her kids to learn everything that birds can do naturally. But Blu who was once a human companion is not made for those. This is the issue wanted to be solved after all they are the last of their kind on the planet. One day they get a news that the explorer sighted a whole flock of blue macaw on the Amazon wilderness. Blu and Jewel decides to go and find them and let their kids to connect with their roots. So this adventure is our great entertainment. Lots of fun and even more than that. Just like in the 'Madagascar' movie, who discovers where they originally belong to.\r ‘‘Birds of blue feathers...\rHave to stick together.’’\r The songs were really good and my favorite track is 'let's come together (beautiful creatures)'. Beautiful jungle beats, it is the latest addition to my free time listening list. There was nothing special in digital 3D, but definitely not bad. I saw the first movie in the regular version, but I enjoyed watching this in 3D. The story was not great, but humors were. The human characters were avoided until it gets into a crucial stage. The expansion of characters was exceptional. The original sidekicks from the first movie set aside to make their own fun which partially detached from mainstream story. The newer ones opened another dimension of the family and friend related drama, with happiness found and the jealousy kind of stuffs. Overall, a good animation, hard to leave behind unseen and not to suggest others. So if you like animations then don't listen to anybody, just go for it.\r 7.5/10"
    },
    {
      "rating": "9",
      "text": "Ignore the critics reviews, what would they know ... they are not kids... Out of my five year olds mouth about Rio 2 in 3D... \"I loved it can we see it again\"... That is all that should be cared about, what the target audience thinks not a bunch of adult critics...  I am sure most kids would give this at least an 8..."
    },
    {
      "rating": "8",
      "text": "Despite a rather silly ending, Rio 2 is a fun and really enjoyable film that does what a sequel should do; set itself apart from the original. While it doesn't top Rio, Blue Sky did a terrific job simply making a film that was just as enjoyable and just as visually appealing while not treading too much into the original film's template. They introduce new characters, pummel the animation into dazzling new heights and even throw in a three-way plot between Blu's push to be accepted by Jewel's father, Linda and Túlio's tango with deforestationists and Nigel's hilarious Tom and Jerry-esque chase for revenge with Gabi.\r Rio 2 is a delight for those looking for a casual ride down the spectacular and silly. This film is an affirmation that Blue Sky know exactly what they're doing, and that they're here simply to show us a good time. That is, until Ice Age 5 comes out, of course."
    },
    {
      "rating": "8",
      "text": "Story:\rBlu, his family, and his friends embark on a trip to the Amazon to find a hidden Spix's macaw flock after getting word from Blu's owners Linda and Tulio of a possible hidden flock. The 1st film's story was never great to begin with, so don't get your hopes up as the story here is slightly worse than in the 1st. Whereas the 1st film had a cliched romance story, this film features: A Meet The Parents main plot, Nigel's revenge subplot, A Talent Show style subplot with Nico, Pedro, Raphael, and Carla, and Linda and Tulio's environmental subplot. The big problem is that there are too many subplots here. The film would switch back and forth from subplot to subplot so much that it loses focus of the main plot. Speaking of main plot, none of these subplots have anything to do with the main story. The only positive I can say, is that the environmental message here is stronger than in other animated films due to how the film uses the Amazon as a location for the environmental message. Whereas other environmental films use fictional places, the fact that Rio 2 uses an actual location that's actually getting cut down in real life is what makes the message here stronger. Besides that, the story here is bad, BUT, I know that audiences don't watch these kinds of \"fun and entertainment\" films for the story, and since Rio 2 ISN'T plot-centered like a Pixar or Studio Ghibli film, having a bad story doesn't hurt Rio 2 as much as it could've if it took its story seriously. Watching Rio 2 for its story would be like watching Madagascar for its story, and we all know most of us don't watch Madagascar with that mindset of wanting story. These kinds of films are style over substance, and you can tell by the trailers. So if you wanna watch Rio 2, then change your mindset/expectations. 4/10\r Animation:\rOne of Rio 2's biggest strengths is in its animation. You can tell by the trailers that Rio 2 looks gorgeous. This sequel looks better than the first. The colors are vibrant, the backgrounds are stunning, some of the musical scenes are beautiful to look at, the human and bird modes are realistic, and the attention to detail here, especially on the birds, is astounding. If you're gonna watch Rio 2, watch it on Blu-ray or 3D. 10/10\r Characters And Comedy:\rAll of the cast from the 1st film return, and besides the Spix's macaws, none of them serve a purpose to the plot, and all of them serve as simple archetypes. Blu is the fish out of water, Jewel is the caring wife, the 3 kids follow archetypes as well with one loving music, one being smart, and the other being mischievous. I personally wanted to see more of the family together on screen. Raphael, Nico, and Pedro are just comic reliefs and judges for the talent show auditions, Eduardo is the angry father-in-law, Roberto is the Fabio of the Spix's tribe, Linda and Tulio are just ornithologists exploring the Amazon, and the logger villains are just cliched villains. While they all follow archetypes, I found some to be more entertaining than others. The best characters here would have to be Nigel and his sidekick Gabi. Gabi was entertaining to watch since she's a poisonous frog who loves Nigel, but can't touch him. And Nigel is still entertaining here as he was in the 1st. There were also some funny moments here with a brief audition montage serving as a highlight. The comedy here is solid, and the characters are still entertaining, albeit cliched. 6/10\r Sound:\rThe score does a good job here, but one of the biggest highlights here are the songs. There are more songs here than the 1st, and even if they don't hit the height that Hot Wings did in the 1st, all of them are fun to listen to. What is Love is a nice opening for the film, Rio Rio fits the movie's happy and fun tone, Ô Vida is an enjoyable song that plays in the background while Blu, his family, and friends travel around Brazil, Poisonous Love, is one of the highlight songs due to its operatic tone, Welcome Back is a good, albeit short song with Bruno Mar's clean vocals, Beautiful Creatures is another highlight for me with its tribal tone and percussion, Don't Go Away is a short, but lovely lullaby with Anne H.'s vocals, It's a Jungle out here is a nice montage track, I will Survive is an outlandish and great cover by Nigel, and Batucada Familia is a nice closing for the film. For me, the songs here are better than Frozen for being unique and different. 9/10\r Acting and Casting:\rThe cast here does a good job at voicing with Jesse E.'s voice fitting Blu perfectly. There weren't any voices here that really annoyed me, and I'm surprised that Bruno Mars can actually do a good job at voice acting. Overall, good voice acting here. 7/10\r Verdict:\rRio 2, like its predecessor and so many others like it, is a film you DON'T watch for its story.  Its writing isn't good, but its animation, visual gags, and songs are what makes this film soar. Change your mindset and give it a watch.\r Extra:\r+1 for being a sequel I liked.\r Rating: 8/10"
    },
    {
      "rating": "7",
      "text": "I was in the mood for a totally immersive sound score splashing, fun to follow plot of a grandiose 3D experience I had with RIO \"1\" but......... I nodded off during some middle sequences and bot even bored with some of the sub plots that were just too contrived to let me into them. I am a 74 yr old, 55 to look at, man who use to be in Hollywood 2D flat animation and have been totally blown away with the ever growing 3D industries expertise in the newer animation techniques, with still, 20/20 unaltered vision and the total range of hearing possible so I speak with a full theater patrons knowledge of what it is like to sit in a plush seat in front of a giant silver screen! I wouldn't ask for my money back but when this comes out for me to purchase the BluRay, I will know where I want to edit out the junk like hip hop scorings and lots of bad plots, which, will leave about 20 minutes and about 3 minutes of boring end credits."
    },
    {
      "rating": "7",
      "text": "I’m not a huge fan of the first “Rio,” as I think it is a very straight forward movie with little to offer. It’s fun and all, but lacking in emotional punches.\r “Rio 2” on the other hand is a far stronger movie than the original. It’s cast is superior and well balanced, the story has a few nicely done emotional sequences, and the animation is gorgeous. While I find the songs weaker than the highs of the first film, they are more consistent in terms of quality. The real highlight of the film is its script, which I think is Blue Sky’s first or second best script to date. It is well balanced with a fish out of water story, a well handled environmental message that isn’t being shoved down our throats, and well rounded humor.\r Overall, it’s a fun experience with gorgeous animation. The first third of the film is a bit conventional and rather boring, but the second they get into the Amazon, the film really takes flight and gets better as it progresses. 3.5/5"
    },
    {
      "rating": "7",
      "text": "well i sat down and watched 'Rio 2'. so what did i think about it? it was actually pretty decent. i really enjoyed it, i thought it was a nice follow up to 'Rio'. the story of 'Rio 2' talks about Blu, Jewel and their family visiting the Amazon to find a bunch of other birds like them, and Jewel also gets to meet her dad and ex-boyfriend. meanwhile Nigel comes back to get revenge for what happen to him in the first movie. i liked how in this movie, Carlos Saldanha was able to keep the fantastic animation, funny characters and great comedy from \"Rio 1\" and it was really entertaining. the voice acting was good too: i thought Jesse Eisenberg was really good as Blu; Anne Hathaway also did a great job as Jewel; Jemaine Clement was a great pick for Nigel; Blu and Jewel's 3 little kids were really cute and Jamie Foxx and Will.I.Am were hilarious as Nico and Pedro. but does this movie have a down part? yea it does. \"Rio 2\" tries to make everything bigger this time, which means it really starts to run outta steam a little bit. some of the side characters were pretty annoying, the songs aren't as great or memorable this time and even though it still had hilarious scenes, i thought \"Rio 1\" was a little funnier and smarter. either way, \"Rio 2\" was still a really decent and enjoyable sequel with fantastic animation, funny characters, nicely-written dialogue and great music and comedy. like i said, not as good as \"Rio 1\", but i liked it and i'm glad i watched it."
    },
    {
      "rating": "9",
      "text": "Rio 2 es una película que iguala o supera a su anterior entrega, con una muy buena adaptación de algunas obras muy conocidas, además de la carisma que ofrece su historia, logra ser una buen film animado."
    },
    {
      "rating": "10",
      "text": "All the old characters and the voice actors were recovered from Rio, and new voice actors and the characters were well-chosen. The music was just as good (maybe more better) as the in Rio, and the story was good. the film was dubbed in Finnish well. I hope Rio 3 will come someday! or in series..."
    },
    {
      "rating": "7",
      "text": "\"it was nice and also the message really cute so we already lived this stuation last year in istanbul its called gezi park protest to me its similar. and as animation already it was too quality\""
    },
    {
      "rating": "10",
      "text": "A truly engaging sequel! This is a true secret to a strong sequel: take off from where the previous film ends, thrown in new ideas for the plot to make it bigger and better, more colourful and vibrant and this creating a sole film into a franchise. Ignore the critics they are too serious. Rio 2 brings newly improved crispy and fleshy visuals than the original. It's story is great which deals family matters and relationship, the music is funky and lively, the voice casts is well-talented but the only thing that doesn't work out much is the hit-or-miss gags. Overall, it still enjoyable to watch at."
    },
    {
      "rating": "7",
      "text": "it is a good sequel almost a good as the original.I like the new chicks.And the ending is climactic along with the soccer sequence,Overall underrated as a sequel."
    },
    {
      "rating": "10",
      "text": "It was not as good as the first one in my opinion, but overall it is still a great movie. It could have been better in a few areas, but it is still definitely worth the watch. Personally one of my favorite animated movies. I would definitely recommend it."
    },
    {
      "rating": "8",
      "text": "To be fair, the people at Blue Sky are really good people. Granted, they don't make many good sequels, but that doesn't mean that they can't pull off a good movie every once in a while, like Epic, Robots, and of course, The Peanuts Movie. And then you have Rio, which is just okay, but the animation is beautiful and the songs are awesome. And this happens to be the rare followup to a Blue Sky movie that's actually good! The animation's at the top of its game, the songs are the highlight of the movie and the third act is surprisingly epic and intense. Sure, the movie does have its fails, like the humans play less of a bigger part (excluding Big Boss) and it can get a bit predictable at times. But those are just nitpicking. I can't believe I'm saying this, but Blue Sky actually made a good sequel."
    },
    {
      "rating": "10",
      "text": "For those not inclined to resist this over-insistent brand of educational entertainment, Fox’s latest collaboration with Blue Sky Studios should deliver still more of the winning formula that made the moderately charming “Rio” a surprise 2011 hit, grossing $486 million worldwide. Of that amount, about $341 million came from overseas, and “Rio 2” is already off to a similarly sunny start internationally, having grossed more than $10 million in a few territories (it opens March 27 in Brazil and April 11 Stateside). What may lend the film an extra commercial boost is an aggressively pre-marketed soundtrack that offers a vigorous fusion of hip-hop beats, samba riffs and Broadway-style showstoppers (once again overseen by composer John Powell, executive music producer Sergio Mendes and songwriter Carlinhos Brown).As a result, “Rio 2” plays even more like a full-blown musical than its predecessor did, reflecting a general spirit of inflation that’s evident from the opening scenes: more jubilant revelry in the streets of Rio de Janeiro, more fireworks exploding over Christ the Redeemer, and more town-vs.-country lifestyle angst for Blu (again appealingly voiced by Jesse Eisenberg) and Jewel (the sweet-toned Anne Hathaway), the extremely rare blue macaws who were united at the end of the first film. Now they’ve got three cute, spirited chicks (Rachel Crow, Pierce Gagnon and Amandla Stenberg) and are living more or less happily ever after, although the Minnesota-raised Blu still exasperates the jungle-born Jewel with his reliance on man-made gadgets and amenities; instead of fetching fresh Brazil nuts for breakfast, the way she does, he’ll cook the kids pancakes instead."
    },
    {
      "rating": "10",
      "text": "It’s a sign of creative desperation of sorts that this return trip to South America is so over-stuffed with subplots and extraneous new characters that it barely stops flapping its plot-propelling wings for a second. As a result, \"Rio 2\" ends up being not so much about the birds as mostly for the birds.The 2011 original dared to touch upon the issue of rampant poverty in the frenzied Brazilian party city of Rio de Janeiro while following a pair of rare blue macaws who fall in love despite their differences. What distinguished that outing from other recent cartoon flights of fancy was the way the furry-and-feathered wisecrackers were grounded by intoxicating cultural flourishes, rump-shaking rhythms and real-world urban surroundings.Instead, this time around, we are forced to deal with the avian version of \"Meet the Parents,\" a less-than-compelling eco-message about chopping down habitats, a soccer match that takes place in the sky and a jungle version of Amazon’s Got Talent as a string of exotic creatures audition as Carnaval entertainers.Timid Blu (whose nebbishy vocal quirks are once again provided by Jesse Eisenberg) and untamed Jewel (Anne Hathaway, at her best when carrying a tune) are happily nesting together with their three kids—save for the fact that Mama Bird yearns for a life that is more back to nature and less reliant on human-provided comforts. But when another blue macaw is reported to have been spotted in the rainforest, Jewel convinces her clan to take the 2,000-mile trek to mingle with others of their kind. Once again along for the ride as presumed comic relief are lively toucan Rafael (George Lopez), cardinal Pedro (will.i.am) and canary Nico (Jamie Foxx).Much humor comes at the expense of Blu’s nerdy attachment to his fanny pack, stuffed with such travel necessities as an electric toothbrush, breath mints and a portable GPS (note to filmmakers: “recalculating” jokes have long passed their expiration date). But he feels Ben Stiller as Gaylord Focker’s pain when Jewel reunites with her father, the brusquely judgmental and brushcut-sporting Eduardo (Andy Garcia, doing a Latin-flavored De Niro impression). Adding a dash of jealousy to Blu’s humiliation is the presence of Jewel’s childhood pal, the bedroom-eyed preening crooner Roberto (Bruno Mars)."
    },
    {
      "rating": "8",
      "text": "This is a really great film. Voice acting was good,story was also good,and animation was great.Due to mixed reviews from critics I have to lower the rank.I recommend that you watch this movie."
    },
    {
      "rating": "8",
      "text": "Rio 2 brings newly improved crispy and fleshy visuals than the original. It's story is great which deals family matters and relationship, the music is funky and lively, the voice casts is well-talented but the only thing that doesn't work out much is the hit-or-miss gags. Overall, it still enjoyable to watch at."
    },
    {
      "rating": "9",
      "text": "This movie is awesome imo. The characters are interesting, the songs are fun, and the story is executed well. The setting and atmosphere create a wonderful experience. I hope for a 3rd movie in the future."
    },
    {
      "rating": "7",
      "text": "Apart from the star-studded voices and detailed animation, it is the musical numbers that are the icing on the cake in Rio 2. Especially, the absurdly re-jiggered version of Gloria Gaynor’s “I Will Survive”, sung by the poisonous pink frog Gabi. Rendered by Kristin Chenowet, it’s definitely worth a mention. Though the film is visually appealing and picturesque, the highlight of Rio 2 is the beautifully choreographed soccer game in which Blu finds himself at the receiving end. Coming from director Carlos Saldanha, who had previously delivered Ice Age, Rio 2 would definitely appeal to kids and adults alike."
    },
    {
      "rating": "7",
      "text": "Certainly a beautiful film with seamless animation, but while it doesn't entirely fall into the sequel traps, it still has a very generic and basic story line with nothing new or unique to show for itself. However, it works perfectly for a kids film and has some nice contemporary morals."
    },
    {
      "rating": "10",
      "text": "I like enjoying the first \"Rio\" movie (which is just like the first \"Despicable Me\" movie). I think Rio 2 will be better as it is with \"Despicable Me 2\". I really want to see that movie during my graduation."
    },
    {
      "rating": "9",
      "text": "\" Beautiful\". New Story = Brilliant finally. I have the first one its was amazing beauty. Starring Jessie Eisenberg (Zombieland) , Award Winning Anne Hathaway , Will i am , Jamie Fox , George Lopez, Jemaine Clement , Andy Garcia  and Kristen Chenoweth.  not so ok cast. I only watch Rio because duh  watching Blu and Jewel's adventure and the beautiful city rio. Now that Blu and Jewel are taking a trip to amazon with their children tells their in for a quite good adventure your right. the forest is beautiful this could be the be the best sequel ever !. Grade A"
    },
    {
      "rating": "10",
      "text": "Wonderful movie...waiting and hoping to get a 3rd part\rVery creative and wonderfully done to make it a success...\rSo far this is my favorite film series :)"
    },
    {
      "rating": "7",
      "text": "Rio 2 is your standard, animated kids film. Whether or not that is a good thing depends on the willingness to sit through a well animated film held up by a by the book plot about saving the environment and impressing relatives.\r This film will give restless children something to pass the time, but it is the last place to go for anything even remotely different or original."
    },
    {
      "rating": "9",
      "text": "This movie was a lot better than the first. I loved this movie and I saw it when it came out. It was pretty funny and touching. A lot better than the first."
    },
    {
      "rating": "0",
      "text": "An example of why great movies shouldn't have sequels. This overly boring movie, with dull dialogue, flat jokes and a plot that tries to keep us intrigued, but all that is does is the opposite."
    },
    {
      "rating": "3",
      "text": "Why the hell everything in this movie's story was happening so fast? The final battle was just so easy without any drama! Jewel's father was like : \"who the **** are you Blue\" then\"thanks for bringing my daughter back\" and then \"you suck man, so weak and dumb\" later \"Ok i'll trust your plan, let's save the jungle\". And what the **** was happening to Roberto?! He was like \"Blue you're so lucky, Jewel's amazing\" then he's like \"if something happens to you i'll take care of your famly\" (that's when i thought that he would want to get rid of Blue) but later he went \"Blue's a good guy, i trust him\" and at the and, even though everyone thought that he was a true macho \"Omg i'm so scared, i'm the only ****in' scared bird out here!\". The story was so dumb and fast that i give it a 3/10 because it's stupidity made me laugh and also the songs were the only good part of this animation."
    },
    {
      "rating": "10",
      "text": "rio 2 very good........................................................................................................................................................"
    },
    {
      "rating": "3",
      "text": "Rio 2 will appeal to kids but that’s it. As always Blue Sky Studios turns out a sequel that while presenting beautiful animation has weak writing and serves as another soulless cashgrab to serve more intriguing and original projects such as 2015’s Peanuts. Most of the characters from the first film are there, the film tries too hard to be hip from pop songs, to technology, and shoves its environmental message down your throat. The tagline at the end of the film describes the number of jobs created by this film. While I’m happy tons of people were to find work it’s a shame it wasn’t put to better use as there is a talented team of animators on hand who deserve stronger writing to work with. Doubt parents will hate this as much as me but if you are dragged to this you can sleep through this one."
    },
    {
      "rating": "1",
      "text": "No parent should bring their kid to this irritating horrible film. The music and jokes are painful to listen to, with a story that hardly makes any sense. One of the worst films this year."
    },
    {
      "rating": "3",
      "text": "A tame and heartwarming story gets absolutely broken with this forced upon movie, adding mostly nothing but bland and boring characters. An excuse for a sequel."
    },
    {
      "rating": "2",
      "text": "I hate whamming on a kids movie but this is a terrible kids movie. It's not that much fun, the characters aren't as interesting as in recent animations and this actually got a sequel before The Incredibles did...what the hell? Years from now if I had to choose between showing my children Rio 2 or Toy Story, I would choose Toy Story because it's a far superior film and it even teaches you about family, friendship and doing the right thing. The worst animation since Ice Age 4."
    },
    {
      "rating": "0",
      "text": "Rio 2 more like Rio In2 the Garbge. What a complete Mess they have done I never saw a animation That was so bad that this, Ice Age 4, Strange Magic and Home are the worst animation movies ever."
    },
    {
      "rating": "0",
      "text": "Events with no purpose, movie doesnt even make sense to my kids, would not reccomend spending your money to watch it, since the plot is repetitive and makes no sense."
    },
    {
      "rating": "3",
      "text": "I like the fact that they made something other than more Ice Age, but Rio just doesn't work for me at all, it's still bland, unoriginal, and forgettable. Overall there's nothing interesting about Rio 2 other than the animation is pretty good."
    },
    {
      "rating": "9",
      "text": "ok................................................................................................................................................................................................................................................................................................................................................................."
    },
    {
      "rating": "4",
      "text": "I wasn't too thrilled with the first Rio, but I certainly expected more than this. It's got the excellent animation and top-notch voice cast that you would expect from a kids movie that's worth seeing nowadays, it's just missing the humor and charm. I'm sure young kids will get more than a few chuckles out of it, but older audiences like myself are better off letting the kids watch this one on their own.\r The plot is your standard, predictable, and cliched tale about a son-in-law struggling to connect with his father-in-law. They honestly could have ditched the part of the story involving the humans and the movie would have been better for it. A big part of the first Rio was the musical numbers, however outside of particularly memorable take on \"I Will Survive\" by Jemaine Clement's \"Nigel\" they all mostly fall short.\r Rio 2 is lacking in a lot of aspects that would have otherwise made this a good animated movie that any member of the family could've enjoyed. I spent the entire movie just wishing it would hurry up and end. This is one strictly for the young ones in your house. Older audiences may want to avoid. My total score is a 4.2/10."
    },
    {
      "rating": "5",
      "text": "Whilst Rio 2 does have its moments of glory, for the most part it is a loud, unfunny, and irritating animation extravaganza which becomes mostly tiresome."
    },
    {
      "rating": "6",
      "text": "What to do if you have not even idea what to do? Answer is just make second part of something.\rRio the First was a good enough movie, boring enough to see it few times.\rRio 2 that is movie which was produced to get you r money. High level of stupidity, scientist who will safe our world, bad guys who will ruin our world and so on.\rI wouldn't recommend this film for watching, that is wasting of your time."
    },
    {
      "rating": "6",
      "text": "Bem mediana, a animação está longe de ser legal como a primeira. Mas, ainda não é uma perca total de tempo. Vale a pena assistir apenas para passar o tempo."
    },
    {
      "rating": "6",
      "text": "A dull sequel with a very predictable plot that you can see coming a mile away. A few good songs don't really make up for this. First film was a lot better."
    },
    {
      "rating": "6",
      "text": "Animation was great and fun to watch. Story line was quite good and the dialogue was good also. I think that this is a good family movie with a lot to offer in the way of entertainment."
    },
    {
      "rating": "5",
      "text": "I loved the first Rio but the sequel is just a convoluted mess of side stories mixed together with the main plot. the animation was a true sight to behold especially in 3D but the humor and personalities of the characters were really dumbed down in comparison to the first with the exception of Nigel. altogether this was very disappointing. Not the worst sequel I've seen but certainly disappointing."
    },
    {
      "rating": "5",
      "text": "Rio 2 was terrible. There's no story, but that's what happens when you make a sequel, like Grown Ups 2, Ghost Rider: Spirit of Vengeance, and Mad Max: Beyond Thunderdome."
    },
    {
      "rating": "4",
      "text": "I gotta admit that I enjoyed the beginning of the movie but as it transitioned to the end the plot was very obscure. Furthermore the characters are very lifeless, in other words there's no clear purpose as to what they should do in the movie compared to the first Rio, except the main characters. The songs were quite enjoying and it shows that it's really for kids.\rIf I were to compare to the 1st movie I would say I really enjoyed the 1st because the plot (Blu finding love and learning to fly) was clear and perfectly presented. All the characters supported this plot by helping Blu earn his objective. In the 2nd movie Blu now has a family but it seems that the other birds such as Raphael, Nico, and Pedro have plans of their own and yet they still ride along the movie. Don't forget the antagonist.... which is who exactly, the guy that looks like a white mafian, poor flightless Nigel? If there's going to be a new antagonist in the new movie or an old one rather they should at least focus on how evil the antagonist could be and not easily foiled in just one swoop.\rFinally, this is a family type of movie but sadly the essence of having a family wasn't fully presented. Parents aren't really all mushy to each other, they sometimes argue about sensitive matters and, in worst case scenarios, fight. The stress of being parents wasn't even brought out either. I feel like this movie was meant for kids only and we're expected to just wait for the right time to ask the kids: \"Did you like the movie?\", not saying that I am a parent.\r Overall, I think the entire movie lacks a lot of solid characters and a solid plot. I think this movie was rushed by whoever wrote this story."
    },
    {
      "rating": "4",
      "text": "I seemed in my opinion, the most boring sequel to Blue Sky. It has excellent animation and a bellisimos funds, but the story is confused, the script is stupid, there are too many characters and songs and the amount of cliches I could not stand in the cinema. If you liked the first, this is not the sequel you are looking for."
    },
    {
      "rating": "6",
      "text": "This sequel is lacking the originality that the first one had. Although it seems a bit fun to watch and a bit interesting to think about, Rio 2 will at least pull out some moments in the movie and then end it with a score of mixed thoughts."
    },
    {
      "rating": "7",
      "text": "Disappointing, But DecentConsidering how damn great the first film was, This should’ve been more than “Just decent” with its script structure being it's biggest problem with WAY too much going on and can make the film feel boring at times. However, despite those issues, Rio 2 is still a generally fun film with mindblowing animation, Catchy music, The characters are still very likable, Very well done emotional scenes, and a talented cast (Chenoworth as Gabi was friggin hilarious). Though while some of its script hinders the movie, Rio 2 is still a decent sequel."
    },
    {
      "rating": "4",
      "text": "The animation here remains top-notch, however the film is bogged down with unnecessary characters, dull scenes and a boring villain."
    }
  ]
}