{
  "id": 2579,
  "title": "Risen",
  "starring": [
    "Joseph Fiennes",
    "Peter Firth"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "History",
    "Adventure",
    "Drama"
  ],
  "description": "Clavius, a powerful Roman military tribune, and his aide, Lucius, are tasked with solving the mystery of what happened to Jesus in the weeks following the crucifixion, in order to disprove the rumors of a risen Messiah and prevent an uprising in Jerusalem.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6hGh4z503k8wA8mLlmvwhTSGja.jpg",
  "categories": {
    "plot": 7.7407407407407405,
    "acting": 8.666666666666666,
    "ending": 8.25,
    "soundtrack": 9.5,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "An interesting slant on the old tale.  Like \"the Robe\" with Richard Burton, a Roman soldier has a change of heart about the man he crucified.  A little more insight on the politics of Rome and how it shaped Pontius Pilate's decisions.  A little to cliché in the acting, but an okay film."
    },
    {
      "rating": "5",
      "text": "If you're a Christian, you'll like this. It tells the familiar story very well, and doesn't risk anything. I was very bored, as I knew exactly how this would go, being so familiar with the story. Ethnic Jesus for the win."
    },
    {
      "rating": "9",
      "text": "I am a pretty harsh critic of typical Christian film making. This one, however, was very well done. The story is plausible; it does a good job of capturing an accurate cultural, historical and religious context for its setting. There are a lot of little details it gets right. The writing and acting are good. And the story doesn't try to do too much. It doesn't overreach.\r Granted, there are places that stretch the historical record and biblical accounts, but not dramatically so. But this story isn't a biblical account, so some liberties are expected and necessary.  I think the film will be under appreciated for the effort put into the making of the film convincingly fit within the biblical frame, even among Christians, which is a shame.\r All in all, though, a very good film and I would absolutely recommend it. The message is Christian.  If themes like sacrifice, forgiveness, loving your enemies, salvation and unconditional love offends you, you'll want to avoid the film.  Otherwise, enjoy."
    },
    {
      "rating": "10",
      "text": "This is the way a faith based film should be presented to an audience that seeks this type of movie. The makers of Risen had the courage the makers of movies like Exodus gods and kings, and Noah didn't."
    },
    {
      "rating": "9",
      "text": "A fun movie, with many touching moments.  It really is faithful to the original story of Jesus, but also completely different as the story of a Roman Tribune commanded to find the body of Jesus to quell the new messiah movement.  Jesus is played by an excellent choice of actor, and the Fiennes is awesome!"
    },
    {
      "rating": "10",
      "text": "If you are not a religious person please ignore my critique ....  for those of you who are this is one of the best filmed biblical stories I've ever seen.  Believable props and well directed acting. The 9 rating I know is high but it is for the genre. Believers will enjoy this movie immensely.   2 THUMBS UP  ...for sure"
    },
    {
      "rating": "9",
      "text": "We were expecting a fairly lenient story of Christianity in its early form but this was a surprise.  The story begins with the crucifixion of Jesus and has the Romans in Judea hunting for His body. This side of the story has NOT been told before by the secular media and so ratings that say it is \"another telling\" don't know their Sunday school stories.  The music is beautiful and the story itself will inspire you to ask, \"How would I go about solving this mystery if I was put in charge to do so?\"  Highly recommended."
    },
    {
      "rating": "9",
      "text": "I have seen that most of the negative reviews of this movie come from people who are more upset about the message than any particular scene or actors' abilities. Truth be told, this was a well acted movie that really made me think of what it would have been like to be one of  the eleven disciples. The movie's purpose was not to offer proof of the resurrection. This is where I think many who don't believe in the resurrection err, they were looking for the movie to convince them. That is not what the movie sets out to do, instead it is meant to detail the commotion that such events as Jesus's resurrection and the 40 days he spent on earth afterward would have made in the region. It does that masterfully without going over the top.\r From a movie perspective, the acting was good all around. I like the character who played Barnabas, he was just the kind of crazy you would have expected some of the disciples to be. Remember, all but one of these men died a martyr's death for preaching the Gospel of Christ. There is no record of even one recantation from any of these men, that is a miracle in itself. If you think it was a lie, try to convince eleven men under penalty of death, to stick to any story, true or otherwise. These men refused to recant knowing the consequences, they even refused to stop preaching it, amazing. Not to spoil anything, the way Barnabas acts when he appears before Clavius I thought was really well done. Of course Clavius was also very well done and a very believable character. Jesus looked like he was from the Middle East for the first time ever in a big movie production, and while not talking a lot, was convincing in the role. Peter's actor reminded me a lot of Tevye from Fiddler on the Roof. All around, it was just good acting.\r My biggest disappointment with the movie was that some very cool details were left out. I know that movies have to cut things to keep it moving along and that the movie is never as good as the book though :)."
    },
    {
      "rating": "10",
      "text": "Kind of takes your breath away :) I find most faith movies are too heavy on the message, and alienating of others, yet with very little dialogue Risen delivers an inspiring message I think only the most proud will not understand."
    },
    {
      "rating": "9",
      "text": "As you can see from my score, I really liked this movie. The casting was spot on, Joseph Fiennes was an excellent choice for the lead. This is a faith-based movie that has none of that cheese factor that some seem to exude. Highly recommended. I hope more people go and see this, that is how we continue to get good films. Thanks Affirmed Films."
    },
    {
      "rating": "6",
      "text": "While people usually enjoy movies like these, I usually try to do the same thing, but it's just that my taste most likely fails to catch anything enjoyable and good about this movie."
    },
    {
      "rating": "10",
      "text": "Great story, and message. Risen is a much better attempt at making a Christian movie in my opinion. I enjoyed every second of this movie from start to finish. Every single cast member was great, it didn't feel scripted at all."
    },
    {
      "rating": "10",
      "text": "Yeshua is alive there is no doubt about that. His tomb was found empty, all His disciples saw Him, and He is the most influential man to ever walk the planet. There's no wonder why! This is an incredible showing the glory of His resurrection. Watch it and encounter the One True Living God!"
    },
    {
      "rating": "9",
      "text": "I have to admit, even as someone who believes in God it is hard for me to fully enjoy the majority of faith-based films. It's not just because their budgets only allow for subpar, flat actors and presentation, but also the usually corny writing that goes along with them. More often than not Christian movies feature plots that come off more as sermons than genuinely believable scenarios.\r When I first saw the trailers for Risen I thought that this could very well be the movie to go against those typical constants. It was evident it had some actual money behind it, but it was a compelling set up. Having finally seen it I am happy to say that not only did Risen meet my expectations, it even exceeded them in several ways.\r For starters the attention to detail from the historical side of things is impressive. It's got little touches here and there that really sell the era. Another praise I have is that it isn't preachy. The movie just tells it's story without throwing little lessons in their for the audience. As a result the movie is more likely to appeal to nonbelievers, and might actually succeed in doing what so many of these faith-based movies fail to do; getting people actually interested in learning about God.\r The movie manages to capture emotion without coming off as melodramatic (another issue with Christian filmmaking). It even throws in some action and humor to go along with the mystery. To put it simply, Clavius' search for the body of Jesus is one worth watching. The writing is just all around better than what I've come to expect form these films.\r So are the performances for that matter. Joseph Fiennes is outstanding as Clavius. He's perfectly suited for playing a Roman tribune. He gives those interrogation scenes the necessary intimidation and weight needed for them to succeed and not bore the audience. The entire cast is just as fantastic. Cliff Curtis as (non-white!) Jesus is a welcome treat. This is easily one of my favorite portrayals of the Son of God. Actors like Tom Felton (of Harry Potter fame) give the supporting cast a heck of a lot of talent as well.\r All in all Risen is what the majority of faith-based, Christian movies aren't. It doesn't feel cheap and is backed by incredible writing and performances. However it's not just the fact that it's better than the average film of this type that makes Risen so incredible. It's also that it's an all around original and excellent idea brought to life by talented direction and attention to detail. Regardless of your beliefs, so long as you don't actively have something against religion (of this form or another), then you should enjoy this film in at least some capacity. As for me I found the films to be a stunning work. One I highly recommend seeing.\r 9.9/10"
    },
    {
      "rating": "7",
      "text": "\"I want to believe.\" Approach this as an X-Files episode and you'll be fine. An X-Files episode that just so happens to depict the seminal moment in Catholic orthodoxy. The point of view is that of the Roman Tribune Clavius played with steely grit by Joseph Fiennes, who is tasked with the nasty business of cleaning up Pilate's claim to fame: the crucifixion of Jesus.\r The movie is a solid historical period piece for three quarters of the film. It plays more like a murder mystery as Clavius tries to track down the whereabouts of the new disciples who represent a threat to the governing status quo, and more importantly, the crucified body that has vanished from the tomb under supernatural circumstances. Clavius doggedly kicks in doors and interviews witnesses, trying to make sense of it all before an expected visit by Pilate's boss. Then ultimately the producers show their cards and go all in on the Clavius conversion as he ultimately helps the disciples escape and rendezvous with Jesus at Galilee.\r This film was made by the Sony denominational studio Affirm Films, so the payoff for the expected demographic is not at all unexpected. Before the film started, there were a string of previews for upcoming faith-based features, so Hollywood has clearly identified a reasonably fallow market over the past few years. The difference now is we are slowly starting to see better talent and production values in some of these efforts.\r Risen should not be avoided purely because you may be a religious skeptic, just as you should not avoid a film about, say, strange lights in Roswell NM just because you don't believe in UFOs."
    },
    {
      "rating": "10",
      "text": "This was a very well done movie (faith based or otherwise). The acting was excellent. The cinematography was very well done. The direction and editing should be applauded by all movie goers. The story line keeps the viewer intrigued... it's a fresh approach to the truth (that Jesus is). I took 2 separate groups of people to this movie after watching it alone (I went to see it three times ...each time it was a blessing). I encourage all people of every walk to see this movie."
    },
    {
      "rating": "10",
      "text": "'Risen' is a movie which presents a great twist on the classic biblical story of the Christ's death. Set up as a murder mystery the movie is gripping and further enhanced by the casting of Joseph Fiennes and Tom Felton."
    },
    {
      "rating": "7",
      "text": "Entertaining film and innovative in some way, most films about Christ just focus on his last days alive instead of the days following his resurrection and specially from a roman non-believer point of view who can't find a reasonable explanation to what he's seeing.\r However it lacks action or intensive moments (like the one with the leper, the fishes, etc). Feels like a 20 minute movie elongated to match a standard movie timing, after you've finished the movie you instantly forget more than half of it because there was nothing going on. Still, innovative and interesting storyline and good acting."
    },
    {
      "rating": "10",
      "text": "Inspiring movie.  Well done, great acting.  I especially liked when he honestly and sincerely prayed and God answered.  I liked the love and affection Christians and Jesus showed.  It showed his love.  When anyone honestly looks for the truth, they will find it.  God will always lead those who look for him to Jesus as he states in scripture.  Must see this movie."
    },
    {
      "rating": "7",
      "text": "Pretty good take on the Resurrection that feels fresh and has good performances and echoes of Gladiator. Quite powerful at times."
    },
    {
      "rating": "5",
      "text": "This is just a middle of the road flick. There are other better Jesus in fiction films."
    },
    {
      "rating": "6",
      "text": "It's something beyond a manhunt...\r I just want to review it as a film, so my take on this is pure based on the entertainment and technical aspect, not historical or the religious stuff.\r The story was not bad, which is set in the Israel 33AD where a Roman man tells his story what he just went through. So the flashback begins, just like an unofficial sequel to 'The Passion of the Christ', the story continues after the crucifiction of Yeshua.\r Sealed the tomb with the roman mark and guarded it by an armed force, the body of Yeshua goes missing. With the widespread speculation going around and the order from a higher authority, the Roman soldiers led by Clavius attempts to locate the body by following the hints. So the rest of the story is racing against the time where many unexpected and strange events follows.\r It was a perfect setting for a tale like this. The characters were good, but in the end it certainly questions their actions based in what purpose. It was told from a Roman perspective and his transformation to what he ultimately believes.\r The details were good while depicting the events. A simple narration with not so fancy stunts and others tricks, yet somewhere it loses its realistic approach to the supernatural thing.\r Since they did not mention anything related to the real account, it is fairly debatable yet not worth debating seriously. Because different people have different opinion regarding religious, historical and entertainment angle. But absolutely this film is target every one of them.\r This kind of films is worth watching, because each writer, filmmaker gives us a different take on the person who is behind the world's largest faith. So 'liked it' or 'didn't like' should come after the view. Though it was a quite enjoyable film.\r 6/10"
    },
    {
      "rating": "10",
      "text": "The most beautiful movie about the Death and Ressurrection of the Saviour of the World I have seen in a while. If you love the Lord, you will cry tears of joy multiple times. If you are a atheist, you will either hate it or become a christian."
    },
    {
      "rating": "5",
      "text": "Risen is a case of a technically good movie overstaying it's welcome. It sticks to the source more than most biblical films usually do, but its just so boring. this movie is 40 minutes to long it spends most of the movie trying to get us to know the main character as best as we can, but that should 30 minutes of the film when it takes this movie almost an hour. The last chunk of the movie is pretty interesting but takes the film to long to get that point. In conclusion if you like the biblical story this is based you'll like this film, but if you don't than stay away from this."
    },
    {
      "rating": "5",
      "text": "Same story we've seen before BUT an original and fresh take on the story through the eyes of a nonbeliever. Very entertaining and new.I feel even non christian's can still enjoy this movie as well."
    },
    {
      "rating": "5",
      "text": "On connaît l'histoire par coeur, c'est un grand classique de chez classique (classicum en latin) et ce n'est pas le premier ni le dernier film, ni la dernière série à rabâcher ce sujet vieux comme le monde...En général, ça tourne au petit catéchisme (pour les nuls ou pas) avec une grande lumière et un homme barbu qui lève les bras tandis que les fidèles restent bouche bée... et on le serait à moins en effet. Ici, cela dit, l'approche est assez réaliste puisque le tribun de confiance de Pilate commence à enquêter sur la petite secte qui pose problème à tout le monde, aux Juifs et aux Romains.Les faits nous sont donc présentés comme dans un Columbo mais sans le chien et la 403. Joseph Fiennes s'acquitte de sa tâche avec conviction et brio, ainsi que la neutralité pas bienveillante d'un bon et vrai Romain. D'ailleurs, j'ai personnellement toujours préféré la multitude des dieux gréco-romains : pourquoi un dieu unique quand on peut en avoir plusieurs ?Puis, la \"révélation\" tombe sur notre tribun comme le ciel tombe sur la tête d'un Gaulois... et là, c'est de l'archi-classicus comme dans la légende (et le bouquin je crois) avec la ferveur, les miracles et notre barbu réanimator serein et souriant.Alors, le film reste bien joliment fait dans sa naïveté crédule (voir, c'est croire) et sans retape excessive pour sa paroisse -ou le minimum syndical- mais n'apporte pas grand-chose au mythe, voire rien pour ainsi dire. Il reste le cul entre deux chaises un moment, puis choisit la sienne définitivement. Difficile de juger un tel film sur un tel sujet, alors je reste avec précaution au milieu... car ça reste une belle \"histoire\" quand même."
    },
    {
      "rating": "10",
      "text": "This movie is a must-watch. It is so very well done and has the elements to really speak to your heart. This movie really brings to light the mind-disturbingly, difficult, and un-reconcilable situations the early disciples (and others) had to grapple with. The Resurrection. Especially for a proud Roman.Joseph Fiennes, the lead actor has done a marvelously great job in portraying the turmoil and chaos that goes on through His mind regarding the life-changing fact of the Resurrection. The testimony of the second guard in the tavern was raw and beautifully portrayed. Great acting performance. Fantastic work done by the script-writers. The soundtrack is beautiful. Mesmerizingly beautiful. and I have had it on repeat for days on end now! It is just that good. It takes you so well into the setting of the movie, and reminds you constantly of the first century Jewish and Roman times.I encourage you to watch this movie and gift it to a non-believer too. What a great movie for the glory of the Lord Jesus Christ!"
    },
    {
      "rating": "0",
      "text": "I ain't much into Beliefs but as a realist I find this concept not so significant like 2011 A Separation Movie."
    }
  ]
}