{"id": 859, "title": "Rise of the Planet of the Apes", "starring": ["James Franco", "Andy Serkis"], "runtime": 105, "genre": ["Thriller", "Action", "Drama", "Science Fiction"], "description": "A highly intelligent chimpanzee named Caeser has been living a peaceful suburban life ever since he was born. But when he gets taken to a cruel primate facility, Caeser decides to revolt against those who have harmed him.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/cjLsuP75UDlRdJVMXzXg3TJ4umX.jpg", "categories": {"plot": 7.795454545454546, "acting": 7.959183673469388, "ending": 7.666666666666667, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.5, "action": 7.818181818181818}, "reviews": [{"rating": "10", "text": "One of the best movies you'll see this year that isn't about comics!!! 10/10the movie is nice, it has some emotional parts, some funny parts, not boring at all, the action at the end is spot on. The movie is really great, the dialogue was nice, the characters were likeable except Draco Maulfoy. GO SEE IT NOW!"}, {"rating": "8", "text": "When this movie was announced, I was a little sceptical mainly due to fact that the last Planet of the apes movie sucked. I was surprised how good this film is.  James Franco puts on a top performance as does John Leithgow. While the plot takes a while to get interesting, the outcome is sweet bliss.CGI is brilliant, even more so than avatar. This movie in brilliant and I highly recomend this to anyone"}, {"rating": "10", "text": "A strong story along with a strong performance by Andy Serkis makes Rise of the Planet of the Apes one of the best in 2011.  A very exciting and emotional time."}, {"rating": "9", "text": "A tale where apes are the main characters that feels surprisingly human. Humanities cruelty and fear of that which we don't understand are the core themes here. The movie takes a look of how they, along with our arrogance can lead to our downfall.\r Andy Serkis once again shows that he is the master of motion capture, but this time he is backed up by other talented individuals. Every facial expression is excellently captured and display emotion in believable ways. They allow the ape characters to have real personalities, yet still feel and look like animals in the process.\r It's a good thing the ape characters are so well done, because the humans aren't. Most of them are just stereotypical villains. Our lead human character played by James Franco suffers do to a lackluster performance. Franco doesn't show any of emotion when it's needed. This can lead to scenes with him losing power.\r Overall though this is an amazing origin story. It made me establish an interest in a franchise I previously didn't care about. It's touching, powerful, and an all around excellent film. One I highly recommend seeing."}, {"rating": "8", "text": "I really liked this film. Nearly every ape, if not all, were performance-capture CGI, and every one of them looked incredibly realistic. Serkis is particularly brilliant as Caesar. The film tugs at your heart strings here and there while offering an interesting case-study with apes, Alzheimer's disease, and the various relationships and interactions with their human counterparts. Franco & Pinto are somewhat forgettable in this film, but Lithgow gives a good performance. There are many epic segments in this film that are unforgettable. What a great origin film!"}, {"rating": "8", "text": "Just a good movie. The story was pretty great, it was entertaining and moving. The performance of James Franco and Andy Serkis of course were fantastic. The directing was great. Just a great movie, most likely one of the best of the summer."}, {"rating": "8", "text": "This movie shows that each and every living being wants freedom and wants to live life by there way. This movie has great meaning in it. It is full of action, love, emotion & APES."}, {"rating": "8", "text": "No monkey business in Rise of the Planet of the Apes. The film was a great beginning to an obvious second adaptation. Yes, there could have been more of a story and a more in depth analysis of the characters (humans), but this movie is called Rise of the Planet of the Apes, not Rise of the Planet of the Humans. Caesar was a CGI spectacle and James Franco played an excellent role as Caesar's surrogate father. Look for Rise of the Planet of the Apes II to top this movie ten fold. When I see the trailer for the next movie, you can bet your ass I'm goin' bananas!"}, {"rating": "10", "text": "I really enjoyed the Rise of the Planet of the Apes. The Graphics were excellent and the acting great. I didn't think I would enjoy it much after seeing all the others."}, {"rating": "7", "text": "Having seen this a while ago I still can't get past why people think this is a phenomenal movie. It's good but not great. The plot gets a bit dull during the halfway point and you sit in your seat wondering when the whole rest of the movie is going to take off. Some of the dialogue between the human actors I felt was unneeded and really took us away from Caesar's problems (the real star of the movie). The next door neighbor was an irrelevant role, who's whole purpose in the film is to get sick? I mean the guy repeated the same line at least four times in the movie \"Just get out of here!\" The man only spoke about nine lines the whole movie. Overall i'm satisfied with my purchase but i'm not sitting here praising this movie like its a golden idol."}, {"rating": "10", "text": "Didn't excpect it to be this good. Nice that Caesar was a tip of the hat to Roddy McDowell, more so than Charlton Heston, he's Mr. Planet Of The Apes and this was a worthy edition to the original legacy.\r The apes saga is very clever as it's given itself a free pass for sequels and prequels - The original planet of the apes is sequeled by 'return' which although a bit hammy (bar the cool abrupt end) gives us the setup for the absolutely superb 'escape from the planet of the apes' IMO actually the strongest, most brutal and striking of the original films. Seeing Cornelius and Zera change from celebrities into feared and persecuted risks to humanity was brilliant.\rConquest could have been alot better but the ideas are definitely there - battle is very hammy but takes it to it's logical conclusion at the slightly averted timeline so we shouldn't get the events of 'planet of the apes' - it could have been alot better but was done on such a small budget that the 'epic' battles look pathetic. What was sad was the decreasing budget as the series went on - certainly 'conquest ' and 'battle' had poorer makeup than even the original- to be fair I thought the lead apes makeup was very good - it's only in the crowd ape scenes you see they skimped on everyone else- Zera and Cornelius conveyed an awful lot of emotion even through the latex. I guess the new one could be seen as a 'true' prequel to 'planet' as it shows us how we got to the events without a paradox."}, {"rating": "7", "text": "I enjoyed the film, As did my family. The few flaws the film had are as followed - James Franco is a terrible lead. He shows no emotion and honestly he is so plain and simple that its painful to watch him when he is on screen. The film is a bit predictable, Not very predictable but if you pay close attention you can almost always tell what will happen next. The script is terrible. Its makes everything seem so straight forward and it really doesnt add any creativity to the film what so ever. Thanks to a terrible straight forward script - It brought the entire film down quite a bit.\r However despite all this - Andy Serkis is amazing in this film. He truely brings the role of Caesar to life and should be at least nominated for a golden globe (which he wasnt) and an academy award for his performance. Also the action sequences and the interaction between all the apes,chimps, and so on and so forth is good as well. It was well worth the watch."}, {"rating": "7", "text": "A new vision--and quite a good one. What an excellent surprise, to a franchise that was considered long-ago buried. Andy Serkis continues to transcend technology and gives an Oscar-worthy performance as Caesar."}, {"rating": "7", "text": "Reboot after reboot, Hollywood is indeed out of ideas.\r Rise of The Planet of The Apes, just reed the title and you know it’s about apes and their rise for dominance. That’s mostly what the movie is about, and I was dumb to expect much action, but there’s not much except for the ending. Well enough with the critical aspects, I actually gave this movie a 7, which means it’s a good movie! I really like the main story, and the movie do raise many ethical questions on what’s right and what’s wrong. There’s also much famous and great actors like David Hewlett, who I’m a big fan of. I would love to say it’s a well-written film, but unfortunately it’s not. It took almost the whole first and second act until the movie really began, and there are some “I predicted it sequences”. The action is very low, and that bored the hell out of me. The greatest flaw in this movie is the CGI; I would rather watch the original Planet of The Apes. Yes it’s that bad. There are many negative aspects, but the ending is surprisingly great and that made me crave for the sequel.\r A great plot and superb actors, but the disturbing flaws like terrible CGI and too much lack of action pulls my rating under an 8. Still, this movie surprisingly did surpass my expectations.\r Rise of The Planet of The Apes gets a 7/10."}, {"rating": "8", "text": "Rupert Wyatt must have written the book on how to reboot a classic franchise. Of course the Planet of the Apes were a series that overstayed their welcome back in the 60's and 70's but with Rise of the Planet of the Ape it looks like they have intentions to change that. This film does not just rely on special effects as a lot of the original series did, there is a lot of substance to this film. It also makes you curious how the story will continue. This reboot is miles ahead of what Tim Burton tried to do!"}, {"rating": "9", "text": "Great characters, great story, great script and beautiful action scenes. This is definitely one of the best movies I've ever had the privilege to watch. It also set up nicely for its sequel."}, {"rating": "7", "text": "This movie was great. Even if you haven't seen the original \"Planet of the Apes\" series (which you should) this movie is still entertaining. The computer graphics are superb, the actors do a good job, and the movie does what it sets out to do. It delivers in nearly every department, except none of the human characters are interesting. All of them are rather bland or unlikable, but the apes are the center of this film, and you'll be rooting for them the whole movie. The action scenes are riveting and exciting and will keep you on the edge of your seat. This movie is definitely worth seeing and is very good, but not extraordinary."}, {"rating": "6", "text": "\"Rise of the Planet of the Apes\" is a good movie; it delivers the ending that creates a bridge to the 1970's \"Planet of the Apes\" using great CGI and Andy Serkis' powerful performance. However, like \"X men: First Class\", the movie precedes with a linear story that concentrates on heavy action clashed by two seperate sides (In this case, human v.s apes)."}, {"rating": "10", "text": "An excellent movie that entertains throughout and maintains a decent respect for the audience's mental capabilities.  Especially impressive is the character development for the ape characters given their lack of spoken dialogue.  Well worth the watch!"}, {"rating": "5", "text": "The visual effects are superb and Serkis' performance as Caesar is terrific, but the film is too one dimensional and simple minded to be truly engaging.  None of the humans in the film are particularly interesting or complex so you find yourself rooting for the apes to do their thing which doesn't take place until the final act.  Most perplexing is why Franco chose this film as a follow up to 127 hours.  He basically serves as a piece of human scenery."}, {"rating": "9", "text": "Even if you're not an \"Apes\" fan, moviegoers will appreciate the heart, intellect, and sheer excitement loaded into this blockbuster. Its a welcome surprise, and sure to be one of the most thrilling (and dare I say moving) pictures of the year."}, {"rating": "9", "text": "Fantastic movie which has very good emotional scenes and some other well filmed action scenes. All the plot is detailed and concise (eg his father's \"problem\" or his relationship with \"her\") when it needs to be. It will thrill you, but it isn't as shocking as the 1968 film, probably because you know the ending if you have seen the aforementioned film."}, {"rating": "7", "text": "Who knew a chimpanzee could be so cool, affecting and one of the best character this year. It's Caesar (played by Andy Serkis, which he did a phenomenal job) , ladies and gentlemen, a surprising animal that you will get attached to. So the movie starts a little slow. It's the beginning when Will Rodman (James Franco) adopts the chimpanzee, and starts to build a relationship. Then the story progresses quickly, until things are about to get real (when the apes escape). The first part is more about whats going on with the drug (a cure for Alzheimer tested on the chimpanzees) and the situation with Caesar, but it's still intriguing. Then the other part is the action. What I liked about '' Rise of the Planet of the Apes '' is that you can feel the chemistry between Will and Caesar. Also, there were some awesome parts that I wouldn't expected to be in the story. It's one of the best movies that came out this summer."}, {"rating": "9", "text": "I have never seen the original movie, but that doesn't mean i can't say that it was awsome! The growth of Caesar and the revealing of the power of the \"Cure\" kept you from getting the re-fills. There were a lot of scenes that amazed you, such as Caesar talking and when he did new things due to the \"Cure\". Although it wasn't the first ever of the movie, i still have to give props to the writters. No movie is perfect, but for a movie in it's catagory, it comes pretty close."}, {"rating": "9", "text": "After seeing the conclusion to the Harry Potter series, there was another franchise I had to follow: The Planet of The Apes series. Before I begin reviewing this one, I have a confession to make: I never saw any of the planet of the apes films (like I said in my review of the remake). Yeah, shocking wasn't it? But I did heard that they were very creative films. So, after seeing Tim Burton's disappointing remake, I saw the trailer for this movie when I saw Captain America: The First Avenger and I was so amazed I wanted to see it so badly. A few days later, I've succeeded in seeing it and boy was I impressed at how good it was. I'm not gonna write the plot because it's unnecessary, so I'm just gonna go with my opinion.Visual/Setting: The story revolves around San Francisco which is a very nice place to film this movie and was very creative.Plot/Premise: The plot was perfectly well-paced. The premise about the intelligent animals taking over the world was a very smart idea ever to put on film.Acting/Characters: Every actor you see has great talent. James Franco did an amazing as the main character even he and his love interest played by Freida Pinto were enjoyable. Andy Serkis gave out his excellent performance as Caesar, the intelligent ape and the leader of the clan. The rest of the actors, including Tom Felton from Harry Potter, were very entertaining.Action/CGI: This movie is packed with incredible action scenes with the apes that were very important to the story and the CGI effects along with motion capture were very solid.Problem: The ending was completely weak and gave me a WTF moment.Rise of the Planet of the Apes is not only an excellent reboot of a soon-will-become franchise, but one of the greatest movies of the year next to some of my favorites.90/100 A-"}, {"rating": "7", "text": "I was pleasantly surprised.  Caesar (Andy Serkis) is incredible throughout, and the movie is worth seeing for his performance alone. Franco is decent, and Pinto is just a throw-in, but the story is solid.  You knew that with the PG-13 rating, you're not going to see a ton of human carnage at the hands of the apes. (Yes, there are exceptions.)  I'd have to agree with most of the critics that it's one of the best summer action flicks - and better than just about every comic book hero flick in my mind.  (There's an additional scene shortly after the credits begin, but nothing post-credits, so no need to wait for it - fyi.)"}, {"rating": "8", "text": "A very solid piece of film making. Brilliant pacing and the CGI is incredible. Blows  Tim Burton's movie out of the water and even rivals the original for pure entertainment. The only thing I didn't like was the way the bad guy working at the Monkey shelter was so cliched and 2 dimensional. But other than that - awesome."}, {"rating": "8", "text": "The Good:  Great acting, greatest CGI character ever, entertaining, touching, and a true reboot to the original.  The Bad:  Special effects were a little shaky in parts, undertones were too strong, and the science was too shallow.  When a sci-fi movie comes out, I always have to compare it to Jurassic Park in terms of story telling.  Jurassic Park took a real premise and put their own twist on it and bent it to fit their lore and they made it work with precision.  One of my main gripes with this film is that it never sets you to truly believe in the lore.  Unlike Jurassic Park, where they explained everything and showed intelligent thought behind it, Rise of the Apes is just flat, just hoping that the audience will buy into \"hey apes are smart\" and never question it.  Now I know this is a sci-fi movie, so I understand that to a certain extent \"turning off your brain\" is required, but this film simply milked that requirement too much, this wasn't something that ruined the movie, but it was significantly more than a gripe, because while watching the movie, in the back of my mind i kept saying to myself that this is impossible on so many levels and i demanded answers and the movie never truly filled that gap.  However, the shaky special effects is nothing more than a gripe, this movie did go out of its way to shove its undertones down your throat.  It plays the cards of: Animal cruelty, animal testings, big corporations are bad and just want money, and etc.    Whether you agree with what its saying is irrelevant, it got to the point where the undertones were just obnoxious.  Although i've spent all this time bashing the film, it actually is a really good piece of art.  The actors all step up to the plate, however some of the characters were a bit cliche'd, but overall the acting was excellent.  The movie created \"out of this world\" emotional attachment with the apes, and even gets you to betray your species.  While movies like \"Transformers\" just rely on explosions and hot women to sell the film, RIse of the Apes actually creates a wonderful story and moving characters and I hope that there will be sequels."}, {"rating": "9", "text": "I liked the movie very much.I can say that it is one of the  best movies of 2011.It is well acted and also contains some amazing fight scenes.i can honestly say that it would be a blockbuster."}, {"rating": "10", "text": "I was proven VERY wrong about this film. I thought it was gonna suck, but I ended up REALLY liking it. Andy Serkis' performance is definitely worthy of a nomination for Best Supporting Actor, James Franco did a very good job as well, and the story was captivating and awesome. I have to say this is my second favorite movie of the year, right behind Fast 5. I cant wait for the sequel!!!"}, {"rating": "7", "text": "A very suprising good movie! A movie that ties in what happened at the beginning of the planet of the apes movies, I found the story very entertaining, it was intresting. The action flowed very well, I did find some part emotional. Its not a movie to be taken \"Seriously\" but its worth watching. Its a soild 7 out of 10!"}, {"rating": "7", "text": "Iâ"}, {"rating": "10", "text": "Honestly,  no need for a real review, just go see it.   This is one of this summers best films that needed no hype, no heavy marketing, just a great story, with great acting and amazing special effects.  One for fans and newcomers alike.  Don't miss this flick!"}, {"rating": "8", "text": "Although the live action stars didn't do very well. The incredible performance from Andy Serkis makes up for it. This film is also one of the most entertaining film's in a long time with great visual effects with it. I give this movie an 85% of a good movie."}, {"rating": "5", "text": "In the end, this film was too predictable and preposterous.  There are a lot of eye rolling moments, such as the humans are all stupid, the corporation greedy at all costs, the animal shelter that abuses animals, shooting lots of apes with machine guns at close range never hitting any, an army of apes that appear apparently from nowhere, etc. etc.  The film has nothing original to offer at all and is a conglomeration of many other films.  If you're young and haven't seen as many movies as I have you will enjoy it a lot more than I did.  The CGI and special effects are very good and there is no slow parts so it did hold my attention.  Not a bad movie but made more for the action than the plausibility."}, {"rating": "8", "text": "Andy Serkis was very good playing as Caesar who has very emotions that what he can do is to become a great ape since he did Gollum and King Kong. That chimpanzee looks very dark and the way he control his mind that he's turning one of them that humans face control on apes. Now this is new Planet of the Apes that people enjoy it so much and I watch this movie that it's more better than the Tim Burton version that doesn't hold up for now. I'm very impress that this reboot of Planet of the Apes is very strange story than the old version. I love the old version that has design of costumes, silly apes, great acting of over the top of any human could scream like Charlton Heston, and the story was great at times. But far from now, the new was pretty good that has best special effects that apes can do and of course Andy Serkis gets the best. Rise of the Planets of the Apes was very good, fun, and far fetch to the top of Planet of the Apes, although is not that amazing, but I can say was very cool to watch!"}, {"rating": "10", "text": "1st Point : This is a science fiction movie. 2nd If you are going to the movie theater expecting that you'll watch a movie based on \"Reality\" please don't go.Rise of the Planet of the Apes is Absolutely one of the best movies of the years and the best of \"Planet of Apes\""}, {"rating": "5", "text": "Another summer film that despite (or more likely, because of) massive CGI inspires shrugged shoulders.  As it was, the CGI in this one was not quite good enough to allow one to forget it was there.  I don't mind suspending disbelief if a film gives me a reason to, but this one doesn't.  There are some gripping sequences, I admit, but they aren't in the service of anything larger.  And frankly, I don't think PotA is a great series to mine for remakes.  The originals weren't that good, and they only became iconic because Charleton Heston was the worlds biggest canned ham.  We were laughing at those films, not loving them."}, {"rating": "5", "text": "Really? Rise of the Planet of the Apes. It is \"Rise of the Planet of special effects\". This movie is nothing more than an acceptable form of  a fantasy movie. The official trailer was emotional and attention-grabbing, but the movie is not just good enough."}, {"rating": "4", "text": "While \"Rise of the Planet of the Apes\" is definitely entertaining for its hour and a half, it is far from a good film. The idea of the film is good - to give us a prelude to the story we all know rather well for over 3 decades now. In films like this one expects a lot of visual effects, dumb plot and paper-thin dialogue. For a change, this is different. The dialogue is not as bad as it could have been, which goes to the credit of the writers. That being said, it is not good either. The direction of the film is absolutely horrible, and Wyatt is obviously a rookie who should not have been given the lead with this. My biggest issue in the film was the straight-out ridiculous portrayal of the monkeys, especially Caesar. While he is supposed to be highly intelligent and human-like, the director has taken it a bit too far, that it becomes almost a mockery and, in a strange way, insulting to monkeys. Yes, I cannot believe I am writing this either, but I felt as if it was not a positive portrayal - not that it was meant to be anyway. Nonetheless, it made me rather uncomfortable and it's not because of the prospect of a monkey-led apocalypse. The acting is mediocre, despite the rather decent cast. The visual effects are good enough, and the monkeys are extremely credible. I am excited to see what will happen with the franchise, but I do hope that the director will change. It has set a decent standard for the next film, which can only help the sequel, since this film wasn't too bad, but it shouldn't be too hard to make a better follow up one. Let's see what happens!"}, {"rating": "6", "text": "Actually not bad. Doesn't pretend to be anything more than it is -  a sci-fi thriller with little resemblance to the real world. On that count it succeeds. I genuinely felt for Caesar, the head-ape, and that's testament to the motion capture acting and CGI . I was rooting for the apes the whole way through and in that sense its a little like watching a football match. Apes Vs Humans. You want to see your side fight with some heart, play to the whistle and come out on top, knowing that victory will be so sweet. But  the thrill of the competition fades soon enough, at which point your attention turns to more important matters. Enjoyable enough, despite the cardboard acting of James Franco. Only downside is now I want a chimpanzee."}, {"rating": "6", "text": "An ultimately entertaining, if ludicrous, movie. It improves as the apes get smarter, because the humans seem like such dimwits. Much has been made of the CGI ape(s) and Sertis' role is immeasurable to making this work, but there is a major if unavoidable flaw and that is that the CGI ape is a human acting like an ape, which means we see human expressions and mannerisms. Just because an ape gets smarter does not mean it automatically takes on human gestures. That would take a huge evolutionary span. As great as the CGI is it's presence too often means that the intelligence of the movie suffers, and in the end we get a CGI spectacle but poor writing, plotting, and illogical presentation."}, {"rating": "8", "text": "Easily the best movie of the summer and, so far, the best movie I've seen this year. If you've seen the original or are a fan, you're in for a real treat."}, {"rating": "0", "text": "Rise of the planet of the apes is a poor excuse for a film.\rAs far as trying to give us an origin story to the planet of the apes franchise it  does achieve this though it is completely unrealistic and even comical.\rThe first half of the film has storyline and attempts to make the film seem acceptable, the second half is just a pure failure that only achieves to show off the CGI which is of a below average quality anyway."}, {"rating": "6", "text": "This prequel explains how the apes took over the earth, setting the stage for the original 1968 film. James Franco stars as a scientist testing a miracle cure on chimps until bad luck and mean humans upset everything. The plot is interesting and well told until the less-than-spectacular revolt. Disappointingly, the CGI apes are never convincing and that prevents full enjoyment."}, {"rating": "9", "text": "In a summer packed with comic adaptations (X-Men, Thor, Green Lantern, The First Avenger), franchise finales (Harry Potter, Transformers) and the odd box office surprise (Bridesmaids, The Smurfs)... Rise manages to stand apart from the pack.\r Rise features the best special effects of summer 2011, an engaging story and well-paced action sequences. To say that the movie is unrealistic and 'nonsense', as one user puts it, is to completely miss the point. Summer blockbusters have seldom been accused of being thought-provoking exercises. Jaws, a film widely viewed as the progenitor of the modern summer flick, was a movie about a giant shark which actually flops onto the deck of a boat in its attempt to eat the humans. 'Nuff said.\r At its core, Rise of the Planet of the Apes is an environmentally conscious flick in the guise of a loud and stupid action sci-fi. Do not let appearances deceive you... or you might end up missing the best that summer 2011 has to offer."}, {"rating": "10", "text": "Great movie ,it has a good storyline and also has some good emotionals parts u really must see it.In my opinion is the second best movie of the year before ON STRANGER TIDES"}, {"rating": "9", "text": "When I first saw the trailer for this movie, I thought it was going to be great. After seeing the film today, it turned nout to be just that. The human characters, though only a few, are pretty deep and have a reason for being in the story. The use of CGI on the apes was picture perfect with Andy Serkis again giving a top notch performance. It does move in predictable ways but still take spride in the progression of the story. Which in some cases may feel like a lull and keeps the film from being perfect. But it's better to see these than breeze over them and suck life from the story. So to see the progression from baby chimp to revolution leader is amazing."}, {"rating": "7", "text": "The original 1968 Planet of the Apes spawned its own sequel titles and even had its own remake with Tim Burtonâ"}, {"rating": "10", "text": "The original apes series in the 60's and 70's are one of my guilty pleasures.  We learned in the very first Charleton Heston version that this was the future of Earth, but we never learned why.  The remake in the early part of the decade with Mark Wahlberg was technically competent in terms of the effects and production values, but it was wooden and lifeless.  I didn't have high hopes for this one, but I was pleasantly surprised.  It had solid action, emotion, you actually cared about Caesar,  The computer generated special effects were good, but there is something a little off which can be disconcerting,  But the story actually comes up with a believable premise of how earth came to be taken over by apes.  And there were no comic book heroes like every other movie this summer.  I was very impressed."}], "recommendations": ["avengers_age_of_ultron", "war_for_the_planet_of_the_apes", "valerian_and_the_city_of_a_thousand_planets", "thor", "jupiter_ascending", "i_am_legend", "oz_the_great_and_powerful", "aquaman", "oblivion", "bumblebee", "clash_of_the_titans", "transformers_dark_of_the_moon", "doctor_strange", "thor_the_dark_world", "fantastic_four_rise_of_the_silver_surfer", "black_panther_wakanda_forever", "the_last_witch_hunter", "fantastic_beasts_the_crimes_of_grindelwald", "planet_of_the_apes", "alita_battle_angel", "hercules", "maleficent_mistress_of_evil", "moon", "edge_of_tomorrow", "serenity"]}