{
  "id": 3367,
  "title": "Robin Hood: Prince of Thieves",
  "starring": [
    "Kevin Costner",
    "Morgan Freeman"
  ],
  "runtime": 143,
  "genre": [
    "Action",
    "Adventure",
    "Drama",
    "Romance"
  ],
  "description": "When the dastardly Sheriff of Nottingham murders Robin's father, the legendary archer vows vengeance. To accomplish his mission, Robin joins forces with a band of exiled villagers (and comely Maid Marian), and together they battle to end the evil sheriff's reign of terror.",
  "releaseYear": "1991",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hbRnWUNJkKKVN5mkcuC5ooqjE4e.jpg",
  "categories": {
    "plot": 6.357142857142857,
    "acting": 6.0,
    "ending": 7.0,
    "soundtrack": 6.333333333333333,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 2.6666666666666665,
    "action": 5.333333333333333
  },
  "reviews": [
    {
      "rating": "7",
      "text": "entertaining movie with some length and onesided characters. But they created a believable world and you are well entertained."
    },
    {
      "rating": "6",
      "text": "Kevin Costner seems to not even be trying, his acting is monotone and dull, doesn't even attempt an English accent. The other characters were interesting and casted well. The movie itself feels small, like without the film look, bombastic classical music soundtrack, and celebrity cast, it would seem like a TV movie or syndicated fantasy drama series. It would have benefitted from more sets, using more locations, hiring more extras to make everything seem more real and alive. It's not a complete dud though, I recommend it if you're into films set in that general era (middle ages / medieval) and are looking for another one."
    },
    {
      "rating": "2",
      "text": "Costner is mis-cast, he just does not fit in pre 1950's time frames. Another movie full of American happy-happy BS which is just so out place in 12th century England during that time's equivalent of a depression (all the men off to war). The attempts at humour just consistently fall flat. Don't waste your time with this one."
    },
    {
      "rating": "4",
      "text": "Oh, man.Anyone who looks to this film as the bar for which all other Robin Hood adaptations have to measure up to should take a lap. Or maybe a few laps. What an unmitigated mess. \"Robin Hood: Prince Of Thieves\" incorporates every bad trope, gimmick, and studio miscue that defined the issues with what would become 1990's filmmaking. It's a tonal mish-mash of bad, half-attempts at accents, uninspired sub-plotting, all-over-the-place character work, random-ass fish-eyed close-ups, and Bryan Adams music. What's more, it's long, sitting pretty at an unforgivable two and half hours in length. Boy, oh, boy. Why didn't I hate this? Did it have something to do with Alan Rickman's desperate attempts at injecting life into this otherwise lifeless cash grab? It might've. Are the action scenes watchable, for the most part? Yeah, they are. But other than these two aspects, I cannot believe what we -- the moviegoing public -- fell for back in 1991. $390 million. My God. We were practically asking for \"Waterworld\" to happen four years later from the same director/actor pairing."
    },
    {
      "rating": "10",
      "text": "Great to catch up with this film 27 years later.Still worth a look in 2018.It is a mixed bag in terms of cast but freeman does a great job."
    },
    {
      "rating": "0",
      "text": "Ah Robin des bois ! quand est-ce qu'ils vont arrêter de nous les briser avec cette histoire à la con !?... même que y en a encore un qui sort cette année ou qui est déjà sorti... rien qu'à voir l'affiche, ça sent déjà la poubelle.Donc le Robin du fion avec Kevin Costner, acteur tout-à-fait sympathique s'il en est et même Alan Rickman le méchant de Die Hard, caricatural à souhait évidemment : ça doit être une sorte de blague d'initiés, non ?... mais où est passé le Bruce du coup ? avec son petit sourire en coin, il aurait fait un tabac. Et quelques jokes dont il a le secret.Mièvre, naïf et stupide, ce Robin reste en tout cas fidèle à sa réputation de cave. Il revient de croisade où il a croisé beaucoup de Croisés, je crois. Qui l'eut cru ? et il croise \"Petit Jean\" et sa bande de malfrats de la forêt. Et même qu'il ramène avec lui en Angleterre un Noir qui fait le Maure en la personne d'un Morgan Freeman presque jeunot (!) qui déroule son petit tapis à heures fixes.Bon, vous me direz que la crédibilité -à défaut de gros mots comme le \"réalisme\"- n'a rien à faire dans ce conte suranné à la petite semaine mais tout de même... Le film en plus d'être idiot se traîne aussi en longueur et reste aussi terne qu'un épisode de l'inspecteur Derrick, le ridicule en plus. Allez, on ouvre la poubelle, y a encore de la place."
    },
    {
      "rating": "8",
      "text": "Everything I do, I do it for this movie. 1991 is my favorite year for movies - T2, what about bob, hook, bill and teds bogus journy, boyz in the hoodz, turtles 2, don't tell mom the babysitters dead, defending your life. That year in movies defined my childhood"
    },
    {
      "rating": "7",
      "text": "Most people will probably remember the Bryan Adams song more than the actual movie, but in this loose retelling of the story, Robin Hood (Costner) attempts to lead a bunch of forest outlaws against the Sheriff of Nottingham in order to ‘rob from the rich, and give to the poor’. As so often seems to be the case with these Hollywood versions of classic tales (whether real or fictional) the accents of the cast are all over the place and there is no real attempt to make anything historically accurate. Thanks in large part to a memorable performance from Alan Rickman (is there anyone better at playing the bad guy?) however, it makes for a relatively entertaining watch if you’re willing to just go along for the ride."
    },
    {
      "rating": "5",
      "text": "this is not the worst, but not very good. Costner is miscast, the rest of them were okay. I don't get why they didn't have King John and have the distaste scene when the Sheriff was trying to rape Marian in the church."
    },
    {
      "rating": "5",
      "text": "90's nostalgia, terrible accents, quirky camera work, questionable costumes and dialogue aside - it's clear this was a labour of love for the cast and crew which still shines through the messy choreography, plot, direction and editing."
    },
    {
      "rating": "7",
      "text": "A movie that nearly everyone likes but nearly no one puts on her/his favorite lists. It just misses the final push. Robin Hood is one of the greatest and well known legends. Rob the corrupted rich and give it to the poor with his merry man while always being proud rascals that trick the corrupted leaders and are always one step ahead of them. He could be an or the archetype of a vigilante hero in fiction. Remark: It is still debated if Robin Hood is only fictional as there could be real life events that were decorated over all the years. The story follows the English noble Robin form Locksley who fought in the third Crusade (The one with Saladin and Richard the Lionheart). He escapees captivity together with the Moor Azeem who owns him his life as he saved him there. They return to England were he finds out that it has become worse and quite lawless. Here the actual story starts. It uses a lot of themes from the source material for the story. I think it does everything right that it needed and succeeds. However it does not reach the highest levels (= Satisfying but not awesome). There is a great cast with Kevin Costner as Robin Hood / Robin of Locksley who delivers and Morgan Freeman as Azeem who is a great addition to the source material (There is no bad movie with Morgan Freeman;-). Alan Rickman is an enjoyable villain as Sheriff of Nottingham. He is in the “Like to hate” category which is a good sign for villains. The merry man deliver with Christian Slater as Will Scarlett, Michael McShane as Friar Tuck and Nick Brimble as Little John. I think I should praise Mary Elisabeth Mastrantonio as Lady Marian too as she did a really good performance. Same as the story the actors or characters deliver but are also not in the highest category. The scenery is beautiful and enhances the experience. Most locations where in England with for example Castle Wiltshire, the Seven Sisters or Hulne Piory. The soundtrack is really good and Everything I do I do it for you became a hit in the charts. There are some drawbacks. Like I already mentioned it does a good job but could not reach the excellent status. There are a lot of Robin Hood adaptations that every new movie will be compared to and some are better (but this could be just personal preferences). Overall this is enjoyable but not remarkable enough to be remembered or put of top movie lists. Exception is the title song which is still played in the radio from time to time. Bonus: I recommend the Mel Brooks parody Men in Tights for humor, the Robin and Marian movie from 1976 for Sean Connery and Audrey Hepburn, the 1952 classic The Story of Robin Hood and His Merry Men and the Hammer movies (Hammer is/was famous for horror classics)."
    },
    {
      "rating": "6",
      "text": "Medieval-themed films are lovely, but rarely meet the minimum requirements of historical rigor, preferring to create a false idea of what the Middle Ages were like and how people behaved. This film is no exception, so if you want a film more historically respectful please look for another option. If your intention is just to have some fun, go ahead.In fact, this film is a typical medieval blockbuster of entertainment, full of sword fights, epic rescues and a lady waiting to be saved. Inspired by the classic legends of Robin Hood, they tell a story invented around the characters we already know.According to the script, Robin is the son of an English nobleman who traveled with his king on the Third Crusade, becoming a prisoner of Muslims. After escaping, with the help of a companion in arms, he is saved by that companion, who dies next. From there, accompanied by a Moor who becomes his bodyguard, he returns to England to find his home burned down, his father murdered and his lands taken by the violent, unjust and diabolical Sheriff of Nottingham. From there, marked as an outcast, he will join the bandits of the forest and devote his life to avenging his father by fighting the Sheriff, and also to protecting Lady Marion, the sister of the man who died to save him.This film was made during the golden age of Kevin Costner's career. He had just been successful in \"Dances With Wolves\" the previous year, and will reach the top of his career the following year, with \"Bodyguard\". And in this film he does everything he has to do: to shine, be the hero, save the day and fight against evil, embodied by Allan Rickman, another great actor who excels in his task of being worthy of our hatred, playing his character in a sinisterly funny way. I'm sure he was having fun with it. In addition to them, we have an excellent interpretation of Morgan Freeman, with touches of humor. Mary Elizabeth Mastrantonio is very boring and would never be my choice to play such a character, as she is unable to create any emotional depth or to have some chemistry with Costner. Christian Slater is annoying and serves almost nothing. Geraldine McEwan, Michael McShane and Nick Brimble are good at supporting roles, having little to do.As I have already mentioned, the film has nothing to do with the Middle Ages. It's just a modern film, with characters with very modern attitudes, but who dress like people from the Middle Ages. After all, this was already predictable in a film of this kind, where creative freedom weighs more than historical rigor. So, we have elements, some weapons, clothing and props from the 14th century in a film that is supposedly set at the time of the Third Crusade, in the 12th century. Incredible, they had time machines?! Nah, just a screenwriter deaf to the warnings of a good historical advisor. For this reason, I give a median note to the props, scenery and wardrobe: they may be beautiful, but they are out of place and out of season. The cinematography, however, is quite good and the soundtrack is memorable."
    },
    {
      "rating": "5",
      "text": "This seemed unnecessarily cheesy and over the top in a way that just didn't work for me. It's certainly entertaining and features some top names in the cast but I couldn't take it especially seriously. I found it interesting that Morgan Freeman's character, Azeem, is apparently a Muslim, or certainly someone who talks about Allah in any case. This is an ok, watchable film, it just isn't quite good as such, hence my middling rating. Oh and Kevin Costner in the titular role doesn't seem very obviously English as all, although Alan Rickman as the token bad guy is certainly amusing, even though it does come across as very much a panto type performance (but then perhaps that's to be expected?). I wouldn't specifically recommend this film as such, no but if you like somewhat old fashioned films of old folk tales then you may enjoy this."
    },
    {
      "rating": "7",
      "text": "Not the usual Robin Hood story line.  The names are the same, but the story is very different.  A lot of tongue in cheek humor.  Made for a more entertaining movie.  The critics are a unanimous 50+ score, viewers 70+, maybe they like the old tried and true."
    },
    {
      "rating": "9",
      "text": "To jest najlepszy film z serii o Robin Hoodzie jaki powstał ever. Możecie go negować itd. Ja i tak będę go lubił."
    }
  ],
  "recommendations": [
    "robin_hood",
    "daredevil",
    "true_grit",
    "spider_man_homecoming",
    "the_man_in_the_iron_mask",
    "gangs_of_new_york",
    "the_terminal",
    "the_quick_and_the_dead",
    "the_legend_of_zorro",
    "black_mass",
    "lawless",
    "hook",
    "gold",
    "the_second_best_exotic_marigold_hotel",
    "bridget_jones_the_edge_of_reason",
    "the_flintstones",
    "the_amazing_spider_man",
    "iron_man",
    "american_hustle",
    "going_in_style",
    "silver_linings_playbook",
    "highlander",
    "a_bronx_tale",
    "suburbicon",
    "42"
  ]
}