{"id": 1876, "title": "Robin Hood", "starring": ["Brian Bedford", "Phil Harris"], "runtime": 83, "genre": ["Animation", "Family"], "description": "With King Richard off to the Crusades, Prince John and his slithering minion, Sir Hiss, set about taxing Nottingham's citizens with support from the corrupt sheriff - and staunch opposition by the wily Robin Hood and his band of merry men.", "releaseYear": "1973", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/alcY9jZBgKw9OB7hiPYVNvh03Sb.jpg", "categories": {"plot": 7.2, "acting": 7.181818181818182, "ending": 5.142857142857143, "soundtrack": 9.0, "cinematography": 7.0, "familyFriendly": 8.11111111111111, "funny": 6.2, "action": 6.666666666666667}, "reviews": [{"rating": "10", "text": "Empire gave it 4 stars and I totally agree with them. Scotts version of the hood makes much more sense than any before it. All in all I enjoyed it."}, {"rating": "6", "text": "Pros -Special Effects -Battle Scenes -Scenery -giant horse drawing on countryside -Russell Crowe growling about capitalism -Explosions -Depiction of French people Cons -Soundtrack doesn't seem to fit -Scary hooligans wearing bags on their heads -King John's poor acting and characterization -King John's facial hair -History mixed with fiction doesn't work as well as it could -No evil emperor for Russell Crowe to slay."}, {"rating": "7", "text": "It's just like D-day in Normandy on Omaha Beach, but with bows and arrows, chainmail, and horses, lots and lots of horses. Told through the film language of Steven Spielberg, whose \"Saving Private Ryan\" deglamourized WWII so that it would reflect the same unspeakable horrors depicted in the canon of Vietnam films, this latest mounting of \"Robin Hood\" also effectuates the expulsion of any preconceived notions regarding war as romantic, an adventure in the making. Made for people who like their Batman dark as night, Russell Crowe's brooding take on the role made famous by Errol Flynn(Michael Curtiz's \"The Adventures of Robin Hood\") will not disappoint, but for the rest of us, seeing the tempestuous Aussie portray this iconic swashbuckler as a haunted mercenary tormented by unanswered questions about his absentee father, will no doubt be off-putting to fable purists familiar with the legendary English outlaw, champion of the penniless(especially Kevin Costner's \"surfer dude\" interpretation of the Nottingham stalwart in Kevin Reynolds' \"Robin Hood: Prince of Thieves\") as a congenial sort with pacifist leanings. Unlike past Robin Hoods, this latest model derives some modicum of satisfaction from killing. Essentially, an origin story, the filmmaker places Robin in a historical context(the waged war between the French and English over Plantagenet lands which Phillip II had seized from Richard the Lionheart while England's king was imprisoned), which in turn corrupts the literature(starting with the 1378 long poem \"Visions of Piers Plowman\") by transforming the subject of innumerable ballads and stories into a 12th century approximation of a combat soldier, who proves to be exceedingly violent on the English coastline during the climactic battle with the encroaching French mauraders. Although this final confrontation is exceedingly well-staged and exciting, it does have the effect of trivializing Spielberg's intention to honor WWII veterans by stripping the emulative spectacle of its predecessor's \"raison d'etre\", which entailed more than death for mere entertainment's sake."}, {"rating": "8", "text": "I think the critics and the voters on this site were confused...this is not your daddy's Robin Hood all over again. This is the backstory. Much more interesting than seeing another childish rehash of the same old story. Well-made film. VERY enjoyable. I certainly was not bored!"}, {"rating": "10", "text": "Great story, logical, people who gave it a bad review are morons."}, {"rating": "9", "text": "Almost perfect. This movie uses the Robin Hood story as a backdrop to talk about a lot of big-picture historical themes, but it isn't boring or heavy-handed. It's visually rich, and all the main characters are three-dimensional. Russel Crowe is good, and Cate Blanchett is great. This movie is one or two silly anachronisms away from being a ten, that's how well-done and balanced it was."}, {"rating": "8", "text": "Wonderfully acted with some amazing actions scenes. I thoroughly enjoyed it and Russell Crowe is a great Robin Hood. Cate Blanchett was great fun as Maid Marion."}, {"rating": "6", "text": "This would be more properly titled"}, {"rating": "8", "text": "Great overall cinematography,a few holes in plot but not much to complain about. Beautiful violence."}, {"rating": "8", "text": "Ridley Scott once again doing what he does best, this film is a great reboot to the franchise and I hope to see plenty of sequels. Great action, nice story and viable explanation as to how a man like Robin Hood could exist, not historically accurate but this is not supposed to be a history lesson. Crowe does what he does and blanchett plays her role well, there is much criticism for this film and it is largely unfounded. People should watch a film for what it is and not what they wanted it to be."}, {"rating": "9", "text": "Great new take on the classic, it just needed one more hour of deep dialogues to be one of the great movies of all times... next time Mr.Scott."}, {"rating": "10", "text": "This Robin Hood (Begins) returned me to childhood. I really loved the way Ridley wrapped up historic balads, poems, and legends. I encourage everyone to watch documentary \"The real Robin Hood\" to find out why Ridley made this kind of Robin Hood. Great movie!"}, {"rating": "9", "text": "Pretty darn good. Definitely not what I expected at all but awesome anyway. If you are looking for a rehash of Gladiator you will be disappointed but then again you could always just watch Gladiator again. The Story sets up Robin Hoods legend kind of like how Batman Begins did for Batman. I really hope there is a sequel and have never wanted to go visit England and drink a pint of ale more badly in my life."}, {"rating": "8", "text": "The film has a fantastic imagery and is a visual feast. Meanwhile, it is such a mess from historic point of view that it makes me shudder to think what sort of ideas would young people be left with. This charm offence on history is a good entertainment though."}, {"rating": "10", "text": "A Good adventure. Cate and Sydow are amazing!"}, {"rating": "6", "text": "The acting was good, but I feel like they did the wrong Robin Hood. I would much rather watch Robin Hood be Robin Hood for two hours than watch Robin be a soldier, a knight, a husband, a knight, and THEN an outlaw. A 10-15 minute flashback would have sufficed. Russell Crowe did a great job, but I felt like they could have gotten someone with a bit more personality for the role. Cate Blanchett was marvelous, but when she joins Crowe for the final battle, I honestly rolled my eyes and thought \"Hey, look, it's Lord of the Rings.\", of which Blanchett also starred in. All in all, I would give it a 6.5."}, {"rating": "10", "text": "Generally speaking, if one was to evaluate the movie on its merits alone and not according to any outrageous personal expectations, one would find that this movie has invested just enough into story, character development, plot twists, acting, and action. This movie is not about Sherwood Forest, nor does it intend to be. Like many Ridley Scott movies, the main character goes through a transformation to become the person fit to put an end to the movie's main conflict. This movie has everything done correctly through a delicate balance. Just enough time is spent with flashbacks and back-story to reveal the main character's relevance to the main conflict. The acting is well done. The action sequences are entertaining and artistic enough to stand out from other Ridley Scott movies, though not quite up to par with his previous titles. All the characters seem almost inhumanly diligent in their duties, being rather too idyllic in nature; such a thing is not a problem in a mythic story about heroes and villains. While being very dark, the movie stays consistent with itself. It would simply be ludicrous to expect a mob of happy-go-lucky villagers to be prancing around when under conditions of famine and poverty. If you enjoyed Gladiator, this movie will please you greatly. If you were looking for a \"fun-loving\" story filled with adventures in a world of characters unaffected by their circumstances, don't watch any Ridley Scott movie."}, {"rating": "8", "text": "Definitely not what I expected from a movie called Robin Hood, but if you can get passed that, it is a very entertaining movie. Beautiful cinematography. Russell Crowe does an exceptional job."}, {"rating": "7", "text": "The cast perfect. It was fun and enjoyable and took my mind off of current events. Good wins overall in the movies."}, {"rating": "9", "text": "Great acting from a perfect cast. Cate Blanchett shines as a strong willed maiden Marion and Russell Crowe is the most badass Robin Hood you've ever watched or ever going to watch.The supporting cast is also very strong.The battle scenes are excellerating and very well done this is Ridley Scott movie ''of couse there good'' .The soundtrack sets the atmosphere from sorow to battle enthralled .There is a little humor thrown in but at its core this film is driven by strong charactors whether they be righteous heroes ,a strong willed maiden,a ruthless king,an old knight, merry men and evil Fench villains.Its amazing how the French make such good villians(go figure). Don't listen to the cynics.This film well worth the watch.The only noticeable problem with the acting is Crowes broken accent but it certainly would not have been better if had had a strong goofy scotish accent .The story told in the film isint your traditional Robin Hood story but who wants to see the same old and tired story play out again anyways.The biggest complaint about th film is that its not merry enough,which is true but Im glad someone finally took making a Robin Hood movie seriously. Forget the the traditional story line.Its a prequel anyways.9/10 BULLSEYE."}, {"rating": "9", "text": "Not quite focused enough (in the plot and character development department) for a 10, but a most entertaining film that still delivers what it promises: A fresh take on the Robin Hood legend."}, {"rating": "9", "text": "Surprisingly good film epic."}, {"rating": "7", "text": "Big, loud, and dumb, but it is entertaining in its own darkly humorous way. For anyone looking for the chummy magic of the old Rovin Hood, you may want to look somewhere else, but for a very well handsome and thrilling action film, \"Robin Hood\" is fine entertainment."}, {"rating": "5", "text": "Felt a much longer than it should've; and no punchline. It tries to do too much and ends up playing like a pilot for 'Robin Hood' the TV series - in which, hopefully, all of the many characters will be developed. Interesting that Ridley would create a film that looks like 'Gladiator' but fails to hit all the Gladiator,Brave Heart, etc,  plot points i.e. : protaganist established as hero, family of hero is murdered by villain, hero is made outcast/outlaw  by villain, hero finds love/faith/need-for revenge, etc, etc. While most of those things happen in the film, they don't flow coherently, in fact it's all very disjointed; and too many villains. And the end I was left with a feeling that Ridley was going through the motions on this one."}, {"rating": "5", "text": "Epic, but what's the point of it?"}, {"rating": "1", "text": "If it reinvents the legend at all, one has to wonder why the legend exists in the first place.  The story and characters are painfully boring.  You've already seen all this action before, and the elements it borrows were selected from the bottom of the barrel.  Watch Kevin Costner's again instead."}, {"rating": "3", "text": "\"This movie i was expecting more , It was morally disappointing i expected way more from the Genius's behind Gladiator , Its way to long , It drags on more than it should and in the end your leaving with a Headache .. i actuall fell asleep at one point\" .. D+"}, {"rating": "10", "text": "I was both shocked and excited when we found out that Robin Hood was going to be rated PG-13. From the previews it looked like a Robin Hood version of Gladiator because both were directed by Ridley Scott and the main star of both is Russel Crow.  It wasn't exactly what I was expecting. It's more of an origin story of Robin Hood, whereas the previews make it look like the typical robbing from the rich to give to the poor. There were so many good things about this movie. The score is spectacular. I already bought the soundtrack. The acting is fantastic. The action is phenomenal, and it's a really good story. It did get a lot of negative reviews from critics, but I think that was mostly because the story wasn't what they were expecting and it's not as gay and marry as previous versions of Robin Hood. It is fairly violent, but if you can take that then I highly recommend it. I saw it twice in the 1st 2 weeks, and now I own it on Blu-ray. This new Robin Hood movie is serious and dark and gritty and awesome. The following is a comparison of the different Robin Hood movies to the various Batman incarnations:The Adventures of Robin Hood (1938 ) is as to The 60s Adam West Batman as Robin Hood (Disney 1973) is as The Batman Animated Series as Robin Hood: Prince of Thieves (1991) is as Tim Burton's Batman as Robin Hood (2010) is as Batman Begins as The sequel to Robin Hood (2010) will be as The Dark Knight."}, {"rating": "10", "text": "It may be a rip-off of Gladiator, but one of those good rip-offs."}, {"rating": "7", "text": "Stunningly beautiful, lots of money of the screen, nice love story, but some very lame dialogue."}, {"rating": "7", "text": "I liked this version of Robin Hood. The cinematography is outstanding and the costumes seem very authentic. This is a darker and more violent version than I was used to and felt it could have used some more humor but still enjoyed it."}, {"rating": "10", "text": "Fantastic film! Great story and action!"}, {"rating": "8", "text": "With all of the mixed reviews about this film speculating, I saw Robin Hood and thought that the critics were wrong about this film, this IS better than the last Robin Hood we were given but this isn't better than Gladiator."}, {"rating": "7", "text": "In the 13th century of England, following the death of King Richard in France, Robin Hood and his friends travel back to Nottingham to bring the sword to Walter. As he makes a love relationship with Maid Marian, Robin learns that a man named Godfrey killed his father and must navigate the politics of France in order to avenge his father's death.Robin Hood's plot was a little bit lacking and the dialog was underdeveloped, but the action scenes were great, Ridley's Scott's directing was brilliant, and the acting was a lot of fun. This movie isn't the best, but got me entertained as a worthy stand alone to the Robin Hood legend.There was good news that Ridley Scott is gonna work on a sequel and will someday reveal the release date since this is a flawed, but really good movie.7/10"}, {"rating": "8", "text": "Albeit, not the greatest of Ridley Scott's works, this action drama certainly falls well above the majority of the genre.  The strong cast harmonizes to bring to life a clever, though somewhat cliche, portrayal of the beginnings of the Robin Hood legend.  Well worth the time spent watching, I thoroughly enjoyed this film and would recommend to anyone looking for a nice cockle-stirring evening."}, {"rating": "0", "text": "This movie is plain torture. One of... if not the worst movie of 2010 so far. Russell Crowe is in basically every Ridley Scott, and I've disliked only 1 or possibly 2 movies that they've collaborated on. This movie is plain awful. I'd rather watch The Bounty Hunter 3 times straight than watch a portion of this movie worthy enough to be crapped on. Just garbage."}, {"rating": "5", "text": "The story was good, being different from the usual Robin Hood stories, but that's about the only positive aspect of this movie. The actors played average, the lines were far to simple, the action and fight scenes were unrealistic and uninteresting. I expected much more from this movie."}, {"rating": "8", "text": "This is a different take on the Robin Hood story that explores what happens before he was an outlaw, not the done to death version we all know. This allows for awesome action, and some touches of history mixed in. The script could use a little work, but the film was a fun film that has some nice side humor in it as well."}, {"rating": "1", "text": "Awful...from beginning to end."}, {"rating": "10", "text": "Great movie."}, {"rating": "0", "text": "One of the worst movies I have ever seen. Very boring acting, Fighting scenes dont compare to other films. Anyone else think its Gladiator meets A Forrest?"}, {"rating": "10", "text": "The most definitive Robin Hood made to date. The original classic, around 1939, was accessible to all age groups (though oriented toward the youth group), and was very entertaining, but this modern version is an example of great movie making. Keep in mind that all that is known about Robin Hood is that he may have been a robber known to help out poor people, but no one knows for sure who he was. The elaborate details in a movie are completely contrived. So, this version is totally different from others, and this likely upsets some viewers. This version is superb in all departments, in epic proportions. It is obviously a part I, and I look forward to the sequel."}, {"rating": "0", "text": "Big money , big names , big brand and in the end ? a scam , its isnt about Robin Hood , its about something else and nobody is sure of what it is(magna carta , robin hood , crowe/scott ego ,killing some french which is always good) The hero seems to do what he does because he s paid for ( like me when i dont wanna go to office but still go) To finish , i find its a bit rude to french , and it hides the fact that , at this era of time , french won (in france since the english invaded them and they were reuniting the kingdom), which is something that english-speacking people cannot allow, so they rewrite the history.ahhh good old english racism against france that america embraces with joy.......it makes sell more , thats all that is important finally:p i would be ashamed to have my name in the credits."}, {"rating": "0", "text": "If you want to sit through 2 hours of boring dialogue, with boring characters, boring action, not funny jokes, cliched storyline and Russel Crowe, then this movie is for you."}, {"rating": "1", "text": "I gave it a 1 just for compassion's sake. Cate Blanchettte and Russel Crow acting - reluctantly - in this movie saved it from Zero. What a JOKE. History is faked. Psychology is faked. PR is kept intact. If you loath spending money on bullshit - don't go and spend your money on this crap. (i did just because i was in Vienna and had 2 hours to kill before the plane to Paris). Cheers, my Children, Oleg"}, {"rating": "4", "text": "Unbelievably boring."}, {"rating": "0", "text": "Perhaps the worst film of the year. Blanchet and Crowe are a awful couple. I want my money and two hours of my life back!"}, {"rating": "3", "text": "Not every movie / story / TV show needs a \"reboot\". And that word in its current sense needs to be rebooted out of our lexicon. Rather than worrying about a reboot of a story that's been done to death, how about just telling a good story in an interesting way. Period."}, {"rating": "3", "text": "BOOOORING. I kept sitting in my seat praying it got better, only to be disappointed at the credits. Action is messy and sparse. They tried to make it darker, but the combat scenes just aren't brutal enough to convey that message. Recommend a skip."}, {"rating": "2", "text": "The more and more I think about this movie the more I think it is a rip off. The movie was so bad, I can't even explain how bad it really was. There was little for the actors to work with in the way of lines and story. They butchered one of my faviorite stories worse then Kevin Cosnter did."}], "recommendations": ["superman_returns", "thor", "captain_america_the_first_avenger", "the_scorpion_king", "the_amazing_spider_man", "indiana_jones_and_the_temple_of_doom", "the_legend_of_tarzan", "daredevil", "the_karate_kid_part_iii", "superman", "man_of_steel", "sin_city_a_dame_to_kill_for", "sherlock_holmes", "spider_man_homecoming", "underworld_rise_of_the_lycans", "black_widow", "hercules", "true_grit", "highlander", "the_forbidden_kingdom", "the_batman", "hulk", "spider_man_far_from_home", "fantastic_beasts_the_secrets_of_dumbledore", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader"]}