{
  "id": 2541,
  "title": "Robots",
  "starring": [
    "Ewan McGregor",
    "Robin Williams"
  ],
  "runtime": 91,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Science Fiction"
  ],
  "description": "Rodney Copperbottom is a young robot inventor who dreams of making the world a better place, until the evil Ratchet takes over Big Weld Industries. Now, Rodney's dreams – and those of his friends – are in danger of becoming obsolete.",
  "releaseYear": "2005",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bS94Dt0FKW1463UQyv78MVOw6Pf.jpg",
  "categories": {
    "plot": 6.428571428571429,
    "acting": 6.866666666666666,
    "ending": 8.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 6.6,
    "funny": 6.869565217391305,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A funny, hilarious adventure that looks visually amazing, with a decent storyline, and has such a great chase scene, and a great battle scene. Actors like Robin Williams steals the show and are given funny things to say. Overall Robots is funny, charming, and such a delight to watch."
    },
    {
      "rating": "10",
      "text": "Very good movie,hope in future thier is more."
    },
    {
      "rating": "6",
      "text": "It has a really similar plot to a lot of movies and isn't as funny as it should be but Robots benefits from its fantastic voice performances from Robin Williams and Amanda Bynes. I give this movie 61%."
    },
    {
      "rating": "10",
      "text": "Robots is my best favorite movie I ever watched. It's filled with excitement, spectacular real-life animation, fun, humor, romance, danger, and good music."
    },
    {
      "rating": "7",
      "text": "A fun, charming and hilarious film containing the voice talents of Ewan McGregor, Robin Williams, Halle Berry and Amanda Bynes. The film is perfect for a child to watch and fun for parents as well."
    },
    {
      "rating": "6",
      "text": "Robots mechanizes success.\rThe movie Robots is light, fun, and a little bit forgettable. The story is solid but not great and the jokes are okay but not hilarious, just a good kids film."
    },
    {
      "rating": "7",
      "text": "Robots is a good movie from Blue Sky Studios. What I normally don't get is why just on the 7's? It's only my opinion and you can have yours back while reading this."
    },
    {
      "rating": "6",
      "text": "Robots is colored and has some laughs. But characters may be unremarkable and story-telling not enjoyable enough to put the audience in shock. Robots doesn't soar, and it's plot is great, despite the not-good enough film that has came to the world."
    },
    {
      "rating": "4",
      "text": "It's good at first, but by the midway point of it's slightly overdrawn conclusion, Robots delves into a virtual cornocopia of childish stupid. No matter what talent was put into the pleasing visual/aural achievement (it's the best looking animated film to date), it doesn't quite compensate for a story this immature and goody-goody."
    },
    {
      "rating": "3",
      "text": "It wasn't funny to me. I was so bored."
    },
    {
      "rating": "5",
      "text": "Parts Of This Movie Are Genuis And Laugh Out Loud Funny... But Some Arent. Somtimes I Fell There IS NO CREATIVITY WHATSOEVER.... Because It's \"Robots\"...\rThis Isent A Bad Movie... Im Just Stumped On How To Score It...\r5"
    },
    {
      "rating": "0",
      "text": "It was weird and fake and too silly. So horrid, I almost puked. Completely ridden with overused cliches, there were at most three times where I laughed, one of which was due to how ludicrous the plot was. Honestly only enjoyable to the extremely young."
    },
    {
      "rating": "6",
      "text": "The movie Robots is light, fun, and a little bit forgettable. The story is solid but not great and the jokes are okay but not hilarious, just a good kids film."
    },
    {
      "rating": "1",
      "text": "It was weird and fake and to silly."
    },
    {
      "rating": "10",
      "text": "Robin Williams is so funny. I love this movie."
    },
    {
      "rating": "4",
      "text": "Robots makes the third graders that wrote Madagascar look like geniuses."
    },
    {
      "rating": "8",
      "text": "Great."
    },
    {
      "rating": "8",
      "text": "This movie was pretty good for an animated one."
    },
    {
      "rating": "10",
      "text": "Really liked this movie - just saw it on DVD."
    },
    {
      "rating": "7",
      "text": "While the film may be a tad cliché and gimmicky at times I still enjoyed the film. There was heart and some fantastic animation. I’d say its worth a rent. If you are watching this film its not that bad the beautiful animation will pull you throw even if the humor will make you roll your eyes at some points. There is enough charm here to keep you entertained unfortunately not enough to make this film a stand out."
    },
    {
      "rating": "7",
      "text": "its not an excellent movie. its just perfect. the jokes were funny, the characters were enjoyable, and the animation was pretty decent. if those are the same guys who did Ice Age, then this is what you're looking for."
    },
    {
      "rating": "7",
      "text": "Another very good animation from Blue Sky. Great visuals, characters and humour."
    },
    {
      "rating": "7",
      "text": "Not the best animated film. It isn't the first 'Ice Age', but it was still funny and exuberantly written. Maybe a few arcs could have been taken out, and some jokes missed their marker, it made up for it with a pleasant story that didn't make me want to wretch halfway in, when the hero usually falls in love. Again, just because it's enjoyable doesn't mean it's a work of art. But still, nice."
    },
    {
      "rating": "7",
      "text": "Another classic from my childhood, I'm impressed and delighted to say that \"Robots\" still holds up very well to this day. It's still visually sound, it's still pretty hilarious, and the voice acting is still pretty great. It may not rank as Blue Sky's best film, but it's certainly an enjoyable romp for the whole family!"
    },
    {
      "rating": "6",
      "text": "Actually a solid and entertaining animated movie but I don't think it holds up well enough today. It was also not that good that it could start a franchise or be remembered. I watched this movie in cinema back then and while I enjoyed it I forgot it existed until recently. For the movie: Imagine a world that is like ours but instead humans it is populated by robots. When the robot couple Herb and Lydia Copperbottom want a son they get via construction kit (Sounds legit for robots). Also growing / becoming older is getting upgrades aka new bigger parts. Her son Rodney has a sharp mind and wants to become a scientist / inventor like the famous Bigweld who is rich, respected and famous. His journey starts when he wants to travel to Robot City to meet his idol. It is a classical heroes journey. However it is quite a bit foreseeable and uses a lot of cliches and tropes. Back then the cast and humor distracted me enough to not notice it. Today I was amazed how I could not spot this immediately. The cast aka voice actors save this movie. It is almost an all star cast. We have Ewan McGregor as Rodney, Robin Williams as Fender, Mel Brooks as Bigweld, Halle Berry as Cappy and Amanda Bynes as Piper to name a few. Excellent performance and I praise the whole cast. Now to the style and animations. Something can be really good but not to your liking. I would never call these cheap, ugly or weak. It is just not my cup of tea. However I praise the bravery to try something new and the dedication of the team. The soundtrack was fine but I also forgot it too. Overall this is in the realm of movies that are enjoyable but fast forgotten. Today it would be rated lower as more and more great animated movies set the bars higher."
    },
    {
      "rating": "7",
      "text": "Robin Williams is in classic form as he steals scene after scene as \"Fender\" with witty dialogue all the way through. A fitting successor to \"Ice Age\", this animated motion picture is both funny and intelligent. I just howled at the scene with Fender teaching Rodney to make whoopee cushion noises with his arm pits, then the Rusties follow suit, leading to an encore by Aunt Fanny, to put the \"fun\" in dys_fun_ctional."
    },
    {
      "rating": "6",
      "text": "I watched Robots wondering whether I was going to love it or hate it. In the end, I liked it, but I couldn't help feeling disappointed too. The computer animation was definitely the best element to the movie, it was stunning with plenty of colourful, advanced and inventive visuals. I also thought the soundtrack was more than decent, I liked the premise and there are some characters that are endearing. The film does have a good message about following your heart. Not to mention a great voice cast, with Ewan MacGregor his usual charming and earnest self as Rodney, Greg Kinnear a nice surprise as Ratchet and Robin Williams wonderfully electric(and funny). There are some heart warming moments with Rodney and his family.However, as Bigweld Mel Brooks did disappoint; surprisingly there wasn't much to his character and Brooks sadly couldn't do anything with what he was given. While it was an enjoyable film technically, the story while constantly inventive and original takes a while to get going, and there is little character development. Also I got more the impression that Ratchet's mother Madame Gasket was more the villain than him. Speaking of Madame Gasket, I couldn't believe Jim Broadbent voiced her, totally unrecognisable and quite possibly the biggest casting surprise of the movie. The biggest flaw though was the script. I will admit I did laugh a few times, but that wasn't enough. Robin Williams did a great job and some of what he said was funny. However, the in-jokes weren't as funny as they should have been. It could have done with more wit and irreverence perhaps.All in all, I liked the movie. It is nice to look at and technically accomplished, and the voice cast in general do well, but the script wasn't sophisticated enough. 6/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "Move over Ice Age-THIS is Blue Sky's best movie. Not only is the animation a treat, the voice actors do a superb job, especially Robin Williams. The story is good too, it's really interesting. The laughs just keep on coming and the ideas are really creative and fresh. I loved this when I was small and I still love it now. It's a classic, I'd recommend it for all ages."
    },
    {
      "rating": "8",
      "text": "Robots may be not as great as Ice Age 1, but is a very good movie with a fantastic animation, funny characters, a good messege, a fantastic cast like Robin Williams and good comedy. Even is not much famous, i still a great movie growing up with this movie. Chris Wedge and Carlos Salhdana knows very well how can they do good movies."
    },
    {
      "rating": "8",
      "text": "For a movie as predictable and underdeveloped as Robots, this film has a lot of sentimental value.\r The visual magic, sophisticated retro designs and relevant gags help to further make up for the rusty story underneath the chassis."
    },
    {
      "rating": "8",
      "text": "Pretty NostalgicRobots isn’t the best animated film on the planet, But with fantastic animation and top notch casting (ESPECIALLY Robin Williams), Robots is a blast to the past to the 2000s."
    },
    {
      "rating": "7",
      "text": "It's a fun movie. There's a lot of adult jokes going around here, even though it has this \"kids movie aesthetics\". But I just couldn't understand what is every character motivation (sad Bigweld leaves corporation to build dominos or something).Still, it's a very funny movie to watch."
    },
    {
      "rating": "5",
      "text": "Robots desgraciadamente no es una película buena, cosa que me da mucha pena, ya que le tenia tanta nostalgia de chico, pero ahora, varios años después, reseñandola de forma objetiva sin nostalgia, descubrí que es bastante mediocre. Lo que si puedo destacar son los gráficos y el estilo artístico muy bien marcado, son bastante coloridos y detallados, algunos diseños de personajes son memorables y incluso en parte esta algo adelantado a su tiempo. Pero quitando eso, la historia es muy predecible, con situaciones y personajes cliche, y sin contar cosas que se desaprovecharon o no se terminaron de desarrollar como el hecho de que exactamente no dicen la razón de porque \"Gran Soldador\" abandona toda su empresa y Ratchet y su madre invaden todo. La verdad es que esta es otra de esas películas animadas que tienen muy mala historia, humor forzado y buena animación y ya con eso cautivan a los niños, como cuando a mi me cautivo hace ya muchos años. Pero ahora, dejando la nostalgia de lado, es muy mediocre y no vale tanto mirarla... Una pena..."
    },
    {
      "rating": "8",
      "text": "For a start; \"timeless\" is only relatively correct. Though this tries to refrain from associating with any pop culture at the time of 2005 and focuses more on political concepts like stocks, abuse of power, and poverty, in terms of production quality and execution of its concept, it shines, shines, shines as a late 2000s film and always will.However, it being partially outdated doesn't mean it's a film of mediocrity. Rather, it is not worthy of being called mediocre. It is an original concept and it has an original manner of managing its themes, although those themes in question are generic, along with the characters associated with this theme. I know this film would be absolutely libeled if it were released in the 2010s and I know this because, people who use their nostalgia to excuse any sort of objective quality something they experienced in their formative years may actually present of itself only like it for that reason and that if it were released in current time, they would shower it in negativity and criticism, never giving it a chance to simply exist.This is one of those films that should remain how it is. It should stay in 2005 and in peoples' formative years and stay in that perception only.Now in terms of the film itself, for a start, the way that it introduces characters in general is the way fictional media of actual quality introduces its characters, completely skipping any sort of name-based introduction and going straight to introducing their characteristics to the viewer. This is due to it not wanting to waste time with long periods of absolutely nothing valuable and going straight into the action. For example, the first speaking character's first line is \"Yahooo!\" about becoming a father, of whom the son is the main protagonist, and there isn't the film equivalent of a cold open where the [secondary] villain narrates. It doesn't want to divert our attention away from the plot. Instead, it waits for the real villain to be introduced after the protagonist tries to visit his idol, and fails because the company was taken over, sending out new policies and whatnot.The political messages can't make themselves anymore obvious, of course. Most of it is about the acceptance of intellectual ability among the social norms, the financial instability of the commoner, and the lengths a corporate conglomeration is willing to go to make a profit, of which is the equivalent of killing robots with no financial gains for their remaining parts. Eventually this ends with a final battle, of which lasts 5 minutes and the sidekick killing the main antagonist in their own furnace and the secondary antagonist causing himself to get into the same fate as his father, symbolically so. Though it may not seem like so, the political side of this film is dark compared to the comedic and characteristic side, as if it is not made obvious by the main antagonist, Madame Gasket, being a sadistic underground industrial dictator whose main assistants are the Sweepers, and eventually the Super Sweepers, patent pending from Ratchet. Typically, the main goal of the final battle for the main antagonist was to finish off the main characters and then set the Super Sweepers off into Robot City, of which was obviously a failure. Due to the in-universe urgency of this desire to set them all off, the battle between good and bad was basically forced into becoming 5 minutes long. Which is actually a rational decision on the director's behalf."
    },
    {
      "rating": "4",
      "text": "Not as bad as I remember, but this is Zootopia, except not all that great. I'm sorry fans."
    },
    {
      "rating": "7",
      "text": "----------------------------------6.9/10-----------------------------------"
    }
  ]
}