{"id": 4863, "title": "RoboCop 2", "starring": ["Peter Weller", "Nancy Allen"], "runtime": 117, "genre": ["Action", "Adventure", "Crime", "Science Fiction", "Thriller"], "description": "After a successful deployment of the Robocop Law Enforcement unit, OCP sees its goal of urban pacification come closer and closer, but as this develops, a new narcotic known as \"Nuke\" invades the streets led by God-delirious leader Cane. As this menace grows, it may prove to be too much for Murphy to handle. OCP tries to replicate the success of the first unit, but ends up with failed prototypes with suicidal issues... until Dr. Faxx, a scientist straying away from OCP's path, uses Cane as the new subject for the Robocop 2 project, a living God.", "releaseYear": "1990", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/bmErS9eMqctVSpNaieU56SLfMEC.jpg", "categories": {"plot": 6.0, "acting": 5.333333333333333, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.666666666666667, "action": 6.5}, "reviews": [{"rating": "5", "text": "Poor compared to the original. This sequel, like many others, is nothing in comparison to the first movie. Peter Weller and Nancy Allen, the movie's two primary actors, are there, but it doesn't have the same energy as the first one. I am a huge fan of Nancy's and would be inclined to enjoy this, but regrettably, it just doesn't measure up to the original. It's possible that the idea of Robocop is no longer novel to me or surprising. I'm not sure. Both performers perform roughly equally well, and I believe the scenario to be as plausible as the first (i.e., not very plausible). Just not as good. Sorry."}, {"rating": "5", "text": "So after the ending of Robocop I was interested in watching the sequel to it because after \"Nice shootin', son. What's your name?\" \"Murphy.\" I am really looking forward to watching Robocop 2, and what did I think of it? Well, I found it to be underwhelming. I found it to be quite boring. After Clarence Boddicker and Dick Jones are dead, Robocop has to track down the criminals for possession with nuke. Yeah, along with a young boy. The characters are forgettable so are the villains. Roobocop has a wife who thinks her husband is dead and she found him and he says Alex Murphy is dead and he doesn't know who she is. Wow, that's dumb. Since the middle of the film I was saying to myself saying \"I'm bored. Someone do do something to amuse me.\" While I am doing this, it's not as good as the first film, It's not as bloody as the first film and other than that I didn't particularly like it. After all the goods I had to watch, reviewing them after I watch them, this one is boring and mediocre. What really happened after that, there's a Robocop 3 here so I think this'll be bad too and after Robocop 2, there is something I'm not looking forward to."}, {"rating": "4", "text": "I definitely think there's a major drop off in quality from the first film. The main villain is just laughably bad and I felt that Murphy (Robocop) took a huge step back character wise, Going from someone who just kind of reclaimed his humanity at the end of the first film to being yet again another mindless robot in the second. And the big final act just looks so freaking terrible, It was hard to watch."}, {"rating": "6", "text": "Nicht der beste Film aller Zeiten.Original ist etwas besser. Kann man sich aber Trotzdem reinziehen."}, {"rating": "7", "text": "This is a great sequel - there is no question about that. It is as good as the first film but the question is whether it is better? It is everything that the first film was and maybe a little more. A highly entertaining, violent and worthy sequel with great action. There is suitable complexity in the enthralling story and the compelling characters. The special effects look dated but I appreciate and enjoy that they are real (not CGI). I appreciate the violence and that it goes far to not over the edge. This is a must watch for those who have seen the first film as this is the perfect complement to it."}, {"rating": "5", "text": "/    /"}, {"rating": "6", "text": "So to begin smoothly the movie starts with a triple car explosion to make sure everyone knows why they are watching this and what to expect of it.Acting is cool. The maire's acting (Felton Perry) is awesome. The villain is incredible even if a stereotyped a lot. However he loses all of his credibility as soon as his brain is transplanted into the robot. The idea of including a bad guy as a kid is really original and wonderful. His personal acting is amazing and well-balanced between making it too much and realizing he is just a kiddo immersed in an awful violent adult environment. It is crazy how he is often more intlligent and resourceful than armed thugs. However I can't rationally explain how he managed to almost kill a well-trained police officer. I hope it was not made to underline the fact that women and children can have a comparable strenght... I think it sucks that the movie is not centered anymore on Nancy Allen (Anne Lewis). We see more often Robocop and his opponents. And when she appears it is always and only to look totally useless next to the main character.Sound effects are often too much and especially the robotic sounds when Robocop moves quiclky become unbearable. Some other sounds are totally inadequate in the scenes they are used on.Scenario is quite lame. Why would a betraying cop come to a drug party with his cop uniform on? How come he is so dumb? I hope it is not linked to the facts that he is fat and addicted to drug... Some jokes are truly funny and especially the ones when Robocop goes out after being remastered by OCP company. The fake ads and flash news ideas remaining from the first Robocop movie are still here and really enjoyable. The major flaw of this movie is that it loses its coherence from the middle of itself. At the end the story is incomprehensible and the plot is totally exploded. For example the parallel quest of Robocop trying to find his humanity and wife and kid back is totally eclipsed as the plot moves on. It is sad because it would have been really interesting.Obviously the end has to be a huge gunfight in town. In 'DummyTown' of course because people can't prevent themselves to stand up and run while two robots are shooting everywhere. But clearly this movie has an issue with guns: each and everyone use them against Robocop even if he constantly appears to be immunized to bullets. Maybe that's the point of the movie: showing how much America hides behind guns to try to solve problems requiring something else than violence. Mmmh, I'll meditate on that. In conclusion it seems like the movie had great and deep original ideas but they were completely erased when the director chose to make it a stereotyped action movie. Intelligent characters become dull since they don't know how to join the fight with guns, drug or rockets. All these ideas so seems to be replaced by other ones. Other ones looking really malicious and insidious. For example what I recall from this movie is that the lady cop is unable to arrest villains and even loses in a bare hands fight against a kid! How perverse is this? I remembered her to be a strong and powerful woman is the first movie!"}, {"rating": "8", "text": "There's a reason this film killed the franchise. The violence and action are replaced with cheesy comedy that is more cringe-worthy than actually funny. Everything is dumbed down, From the terrible plot to the terrible acting, It's just awful."}], "recommendations": ["teenage_mutant_ninja_turtles", "the_old_guard", "transformers_age_of_extinction", "xxx_return_of_xander_cage", "max_steel", "jolt", "x_men_origins_wolverine", "lockout", "sabotage", "suicide_squad", "transformers_revenge_of_the_fallen", "kingsman_the_golden_circle", "unhinged", "iron_man_3", "terminator_dark_fate", "jumper", "the_predator", "iron_man_2", "the_6th_day", "battleship", "shadow_in_the_cloud", "wild_card", "terminator_salvation", "mechanic_resurrection", "leatherface"]}