{
  "id": 2562,
  "title": "Rocky Balboa",
  "starring": [
    "Sylvester Stallone",
    "Burt Young"
  ],
  "runtime": 101,
  "genre": [
    "Drama"
  ],
  "description": "His Wife is dead and his Son hates him but this old man still has fight in him!  When he loses a highly publicized virtual boxing match to ex-champ Rocky Balboa, reigning heavyweight titleholder Mason Dixon retaliates by challenging Rocky to a nationally televised, 10-round exhibition bout. To the surprise of his son and friends, Rocky agrees to come out of retirement and face an opponent who's faster, stronger, and thirty years his junior.",
  "releaseYear": "2006",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xUylDspiTKU3cYzZNeLsN8Krv12.jpg",
  "categories": {
    "plot": 9.27027027027027,
    "acting": 9.066666666666666,
    "ending": 8.8125,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 10.0,
    "action": 8.11111111111111
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I was somewhat disappointed because much of this movie felt really forced. The heavyweight champs in the other movies were very believable, this champ looks like middleweight. 60 year old Rocky had a bigger build than this Kevin Garnet look-alike. It's a shame that Stallone didn't use a real heavywight, because that would have made the final scene more realistic. Many of the other actors did not fit either, and some of the scenes were just too unrealistic [**SPOILER***] Rocky's son quiting his job after his Rocky's speech to watch his dad train . And do you expect us to believe that Rocky, after all these years, has no one else to bring to Vegas than \"little\" Marie and her son. I wouldn't expect Rocky to have to bribe people into becoming his friends. I really wanted to like this film, and the final scene made me forget some of the flaws, but as another reviewer said, it felt like it was written by a college kid."
    },
    {
      "rating": "10",
      "text": "Who would have ever believed that Rocky VI would be good?! Oh how we laughed at Stallone's desperation! Then we saw the movie. Rocky Balboa is the best Rocky movie by FAR and is one of my favorite movies of all time. It makes me cry and feel unbelievably happy every time I see it. Absolutely perfect!"
    },
    {
      "rating": "2",
      "text": "The worst rocky yet it was nothing but talking and like 1 minute training and rocky is flirting with a 30 year old and what happened to adrian."
    },
    {
      "rating": "10",
      "text": "This movie was good but as good as Rocky 4."
    },
    {
      "rating": "10",
      "text": "This movie was touching. I really love and enjoyed hearing those great little speeches that rocky made through out the movie,those are my favorite parts to watch.This is the best rocky movie in the entire series"
    },
    {
      "rating": "3",
      "text": "This movie was very disappointing. After seeing the older installments of the series, I expected to see a rival fighter with some character. Also, it seemed like Stallone was really forcing himself to get back to character, and failed while doing so. If you are younger, like me, and are a fan of the old Rocky movies, I would avoid seeing this one. The movie has a deeper meaning about aging, but for me personally, it ruined the entire series. Overall, not a horrible movie, but I would avoid seeing it. If you have not seen the older Rocky movies, see those instead!"
    },
    {
      "rating": "2",
      "text": "ONE OF THE WORST MOVIES ever all they did was talk the whole time and rocky was like 60 fighting a 25 yr old and the match wasnt even legit this movie sucked id rather be someones slave then watch it ever again."
    },
    {
      "rating": "9",
      "text": "These movies have been very cluttered, but entertaining to a point. After IV, I seriously lost hope in the series. I couldn't even sit through V all the way, even Stallone said he dislikes V.\r Luckily, this final Rocky movie is, well, incredible. Some may argue that it's melodramatic as hell, but it captures the spirit of the original Rocky and gives a satisfying ending to this disjointed franchise."
    },
    {
      "rating": "10",
      "text": "Just a few words to describe this movie: wonderful, perfect, fantastic. It has been the first film in my life that has made me crying! Thank you, Italian Stallion!"
    },
    {
      "rating": "8",
      "text": "What is it about Sylvester Stallone that inspires such vehement bouts of schaudenfraude in otherwise rational people? A fellow contestant on a movie-related TV game show I once appeared on launched into a gleefully profanity-laced tirade about what a 'loser' he thought Stallone was in his late career; Razzie award honcho John Wilson seemed a bit disappointed that Stallone's latest installment in the Rocky saga was actually quite good (and therefore ineligible for Razzie award consideration). Perhaps it has something to do with even his supporters' general assumption that since his first big success with the original Rocky back in 1976, the size of his ego has ballooned past that of his famous muscles, and that he tends to assume that we're all as interested in him as he is in himself. (I mean, who wants to hear his recent admission that he gave up sex while filming Rocky Balboa to get the same edge that professional boxers used to similarly abstain in order to give themselves? I don't WANT mental pictures of Stallone pouring ice water down his pants a la Jake La Motta in Raging Bull. TMI, Sly!) Since Stallone has always seen himself as Rocky and vice versa, and the fortunes of both larger-than-life figures have run parallel, it's not surprising that Stallone's many personal and professional disappointments as of late (an eponymous magazine that only ran 3 issues, a boxing-related reality TV series that was irreparably crippled by the suicide of one of the contestants, the failure of Cop Land to regain him Serious Acting Cred, and the fact that his biggest box office hit in the last 10 years was--gulp!--Spy Kids 3-D: Game Over) undoubtedly spill into this chapter. The result is that Stallone admirably humbles himself and his character, scaling down from the overblown tendencies of some of the previous chapters and suffusing Rocky Balboa with more tenderness, humanity and heart--the qualities that made Rocky an iconic figure to begin with--than we've seen since he took on Apollo Creed for the very first time so long ago. In fact, after the sincere but overwrought Rocky II, the entertaining if synthetic III, the fraudulent IV and the completely forgettable V, this is not only the best of the Rocky sequels by far, but the ONLY truly essential one. Stallone, like Balboa, goes back to the original's roots, remembering that it was a character study first, a love story second and a boxing movie third, and that our emotional investment in the first two was what made the third so effective. Talia Shire, as now-deceased wife and love of his life Adrian, may not show up here except in photos and flashbacks, but her presence is so powerful that it compares with Hitchcock's Rebecca in terms of characters who absolutely dominate the proceedings while not actually being around to actively participate in them. (That's why the much-discussed friendship that Rocky develops with a minor character from the first film, played here by Geraldine Hughes, is exactly that: a friendship. No less and no more. Another look at this movie's final scene establishes that.) Stallone also remembers that the best Rocky movies, like the best Disney animated features and the best James Bond films, feature the best antagonists, and here for the first time since Apollo, Rocky's opponent (Antonio Tarver) is not a cardboard cartoon villain but a complex, multidimensional individual with insecurities and vulnerabilities. (And let's have no more carping about how unconvincing and improbable the plot device that gets them together in the ring--a computer-simulated fantasy fight--may be. It's no more so than in Numero Uno, and anyway, when you're enjoying the ride this much, why grouse if the ignition initially sputters a little?) It's just one more indication of how much of a joy Rocky Balboa is to watch that the familiar musical theme by Bill Conti (best known in recent years as \"Stickman\", the Academy Awards conductor that Julia Roberts chewed out onstage for trying to attenuate her acceptance speech, so clearly this represents a comeback for HIM, too) once again elicits genuine excitement and anticipation rather than being an easy punchline. But then Rocky Balboa is so good at what it's doing that it inspires even those of us who have kept our esthetic distance from Stallone (and with Cobra, Stop or My Mom Will Shoot and Driven on his resume, it's safe to say that this covers nearly all of us at several points) for the first time in easily retrievable memory, to actually want a piece of the Rock."
    },
    {
      "rating": "9",
      "text": "Rocky Balboa succeeds because it was a movie that needed to be made. Unlike the previous 3 movies, this isn't a sequel for sequel's sake, it's a conclusion to a story that needed a good conclusion. Stallone and Balboa are both perenial underdogs that people love to see succeed since we know they can. Neither dissappoint this time around and it makes you feel great for both the filmmaker and the character."
    },
    {
      "rating": "10",
      "text": "I think this is a wonderful movie, it is going beyond a boxing exhibition. It is about the challenges an ordinary person can run into his/her life. Characters are well defined, I think this is a two thumbs up movie."
    },
    {
      "rating": "8",
      "text": "Great movie. Awe inspiring. No fancy things about. It was convincing especially with age and time. Basically it stuck to the core elements of what made the original great. A hero faced against the odds, to rise above them a win with your heart."
    },
    {
      "rating": "10",
      "text": "Awesome movie! Brought me back to when I just turned 16 and saw the first Rocky. It teaches about growing older, grief, loss, kindness, compassion and courage...It Ain't Over Till It's Over! Athough Adrian wasn't in this movie, she was its heart and soul. Yo, Rocky and Adrian, you did it again!!!"
    },
    {
      "rating": "2",
      "text": "Terrible dialogue, one dimensional characters, plain old terrible."
    },
    {
      "rating": "9",
      "text": "very good..it brings back the glory of the first film.many nostalgic scene and places,the pet shop adrian used to work,the city hall stairs, even the boxing gym where rocky used to train.when i saw rocky's mummbling and his gesture just like in the first film,man it was an amazing acting,perfect actually, to brought back the character he created almost 30 years ago and he didn't forgot.at first i though its gonna be a crappy low budget sequel like some other movies.but its nowhere near that category..it truly is a great movie"
    },
    {
      "rating": "10",
      "text": "Joe is an amazing fighter, has a bright future ahead of him hope to see him in many more pictures."
    },
    {
      "rating": "10",
      "text": "There are very few movies that could move me to tears but this one did. The other was Field of Dreams when Kevin Costner said, \"Dad, do you want to have a catch?\" Rocky Balboa is the fitting ending to a saga that started over 30 years ago. It turned an unknown actor who share the same philosophy as his character on the screen Rocky into the American symbol of never-give-up the good fight. The message has always been that it's better to try and fail then not to try at all. And Rocky connects again with a knockout blow that will stand the test of time. This movie is truly a holiday gift and we should all thank Sylvester Stallone for allowing us a peek into his alter ego one last time. Go see and enjoy."
    },
    {
      "rating": "10",
      "text": "The emotion of the movie reaches to the sky."
    },
    {
      "rating": "10",
      "text": "Rocky is back and just in time. I just saw it in a packed theater and his human indominable spirit remains as young as ever. Rocky is humble and looking back over the years we realize what a treasure this character truly is. Go see and enjoy!"
    },
    {
      "rating": "10",
      "text": "The professional critics are so hardened in their ways that they don't recognize genius when it hits them right between the eyes. Read what WE the people have to say about Rocky Balboa. This is a LOVEFEST for a character that all of us Americans have come to know, respect, and love for the past 30 years. He symbolizes the American Dream in that we should never give up. As for Paulie and Rocky they are true to their characters and play their final role in this series straight up and not over the top. As we watch one can't help but think of our own lives and draw inspiration from Sylvester Stallone on the silver screen. After all when Sly wrote this story Hollywood did not want him as Rocky as he was a nobody. Sly would not take NO for an anwser and persevered in real life and the rest is history. When you see this movie it is almost like a watching a loved one heading off into the final chapter of his life. Thank you Rocky because you will live on with honor for all eterity. This is a must see movie."
    },
    {
      "rating": "10",
      "text": "Cables your are entitled to your opinion but I have to disagree with you. People like you with ice water flowing through your veins are incapable of understanding the raw emotion that Rocky Balboa generates. Do you really think that you can be correct and 97% of your fellow reveiwers are wrong. I'm sorry that you did not enjoy the movie but don't insult a fantastic movie because of your own insecurites. This is a work of genius and word of mouth and at the box office will prove this review correct. This is a must see movie for anyone who still has dreams and ambition."
    },
    {
      "rating": "9",
      "text": "Rocky Balboa may not be the greatest movie to ever hit the silver screen, but it does delivers its message with full impact. Stallone gives us a fitting ending to the Rocky series that it has deserved for so long. This is a movie that any genration can enjoy. Its impossible to leave this movie in a bad mood...period."
    },
    {
      "rating": "10",
      "text": "This movie was simply awsome. Stallone was excellent and the story was touching."
    },
    {
      "rating": "10",
      "text": "this is the first boxing movie I've ever seen that features HBO's PPV boxing. it made it seem almost real. a must see in my book. And yes it is another classic that will be played again and again in my house."
    },
    {
      "rating": "8",
      "text": "It was a pretty good movie but it wasn't as good as the original Rocky. It was pretty sad that his wife died I wasn't expecting that at all. I give it to Sylvester Stallone for getting back in the ring though. If I had my pick of the best it would be Rocky V."
    },
    {
      "rating": "10",
      "text": "I think this was an excellent MOVIE! The story was great. It was not your typical Rocky, action-packed experience. It was real, it was human. Simply a person trying to get through some of life's curveballs thrown at him, and someone not wanting to be told how their life should be lived just because they've reached a certain point in it. The movie comes close to the original, and that says a lot for the 6th movie in a saga. GO GET'EM ROCK!!"
    },
    {
      "rating": "10",
      "text": "I couldn't believe what I was seeing! Sly looked just as good (or better) than he looked 30 years ago! Wonderfully written script! Great acting! Loved it!"
    },
    {
      "rating": "10",
      "text": "The Rocky series is one of the best of all time. I didn't like the way that Part 5 ended though and I've been waiting for 6 to come out for like 15 years. Thank you Sly. Thank you for giving one of the best series of movies a better ending. I grew up on Rocky and his story and this was a perfect ending to a true American Icon."
    },
    {
      "rating": "4",
      "text": "Too cheesy, cliched, trite and generally unintelligent for most British people to appreciate. I would recommend for adolescents only."
    },
    {
      "rating": "10",
      "text": "the story of the underdog boxer is highly inspiring to ones who want to take the film in the way they are supposed to, the way stallone would have liked each of his film to have been percieved.. critics beat every story down and sensationalize minor flaws, where i personally believe they should highlight more on the principles the movie is based on rather than jus browbeat irrelevant stuff.. the world needs optimism."
    },
    {
      "rating": "9",
      "text": "I was pleased with the way Stallone went about this movie. Its extremely heartfelt and uplifting. I don't think he could have written it any better. I put this one up there in the top 2 Rocky movies. All in all I was very pleased with this movie. I advise everyone to go see it!"
    },
    {
      "rating": "10",
      "text": "Superb, heartfelt and perfect. This film allows the audience to relate to Rocky at this stage in his life, and the results are truly inspiring. There are not many movies that have been made in recent memory where the director has a true love of the characters, and this shines through in the movie. More than a movie about fighting and training, this final installment in the Rocky series transcends life, and reaches out to the audience with raw emotion. The music is perfect, and all characters works so well together especially Rocky and Paulie. The perfect final installment to the orginal Rocky and Rocky Two. Thank you to Mr. Stallone for making this movie, and the inspiration you have provided to audience members to take the hits in life and to keep moving forward."
    },
    {
      "rating": "10",
      "text": "After much anticipation, the wait is finally over. Despite heavy scrutiny from everyone around me including most of my friends and my coworkers who deemed my excited behavior childish, I went to watch Rocky Balboa on opening night with the only two people who were excited as I was - my brother and one of my coworkers. Before I get deeper into my reactions of Sly's latest installation into the beloved Rocky series, let it be known that whatever I am about to write, I do not intend it as a review as I believe the Rocky series have gone beyond that which needs a movie \"review\". To me, and hopefully many others as well, Rocky has reached an echelon in it's own class. There are sequels, and there are trilogy's, but the Rocky series has impounded and unsurmountable amount of impact and influence into the lives of those who've kept faith in a character whom I feel is the truest hero that represents the meaning of courage, love and moral values. How many Hollywood heroes can you say that about? The Rocky series, at its core, is not about beating up bad guys, swash buckling adventure, or saving the world. It's a story about Rocky Balboa, a man with a big heart who goes through the ups and down of life in its most extreme. Boxing was always just a tool to illustrate the trials of life that he goes through. All throughout the series, Rocky never fights anyone in particular. In actuality, every one of his fights were internal. In the first Rocky, he \"goes the distance\" with Apollo Creed, but it was never about winning the fight. He was given an opportunity and the fight was about how far he could take himself. In essence, he was fighting himself. This underlying motif manifests itself best in the first Rocky and the latest, \"Rocky Balboa\". It does seem to get less apparent as the movies evolves from an Oscar winning drama into quintessential hollywood flicks, but it never really disappears. Some may criticize the series as getting lost from its original meaning, detracting to senseless action and formulaic plots. I would agree to a point, but I am not complaining at all! In fact, I applaud it for what it has become. As extensions of the original, the series has brought us the most memorable moments in film history. Who could forget the fight with Mr. T (\"dead meat\") in Rocky III or the big Russian dude, Drago (\"I will break you\") in Rocky IV. Nonetheless, beyond the adrenaline filled fight scenes and cool one-liners, these sequels still contained the core value that brought alive the character Rocky and the unforgiving world that is created. Time and time, Rocky is tested and the result is that he has to fight, but it was never ever for himself in the selfish sense. After going the distance, he fights for Adrian in the second (giving her a better life), and then he fights for Micky (but not for vengeance), and in the fourth he fights for Apollo who stood for America (again not for vengeance). Actually, my man Bill Simmons believes Rocky single handedly ended the Cold War!  Like Bill Simmons, I don't know how many times I've watched Rocky. You can not deny the characters' influence over our lucky generation. Rocky Balboa is by far a much better role model than the so-called heroes on film these days. [***SPOILER***] It just brings you to tears to see Rocky after all these years and long after Adrian's death, spending time in front of her grave and revisiting places they've been together. That is true love - undying love. \"Adrian is dead, but she never is in here\". This concept of love, I believe, is dead in the new generation brought up by MTV. Rocky stands for those heroes, famous athletes, or celebrities who are as nice in person as he is in the media (if there are any). A prime example of this kind of moral value that is lacking in not only movie heroes, but professional athletes and celebrities alike, is a scene in Rocky Balboa where Rocky goes and just casually changes the light bulb for a friend he just met. This kind of gesture is subtle but it is nonetheless powerful and reminds us that nice guys do exist. We are living in a generation of people who are more realists than idealists who accept \"darker\" versions of classic heroes like Batman and James Bond because to them it seems more \"believable\". It is nice to be reminded that throughout all these years and even though times have changed, Rocky still retains his high moral esteem. Rocky is still Rocky. The strength of his character has been tested, having been pinned against multiple opponents and the quality of his character comes in full breadth in \"Rocky Balboa\" and for one last time, it reminds us of an old belief that has been long lost. Thank you Mr. Stallone. You have truly created an unforgettable character and an epic story that should be retold with every generation so that his values can be passed throughout time. Just don't be like George Lucas and re-release the series with inserted scenes and computer graphics."
    },
    {
      "rating": "10",
      "text": "Fantastic. A truly inspiring story and a great end to the series. Stallone at his very best. This movie was more about the character and emotion rather than an action fest...Truly a triumph!"
    },
    {
      "rating": "9",
      "text": "In preparation to see this movie I watched all five of the previous movies over the course of a couple of days, and I'd have to say that aside from the Oscar-nominated original, Rocky Balboa is the best in the series. Stallone gives his best and most nuanced performance of the series, going back to some of the more interesting aspects of his character from the first movie. When I first heard the movie was being made, I thought it was a horrible idea but figured I'd see it for laughs. However, it was a legitimately good and inspiring movie that is much lower on cheesiness and implausibility than I had expected."
    },
    {
      "rating": "10",
      "text": "I was shocked at how good this was. The best I've seen in a long time. Its like night and day from Rocky V. The acting in this one is great, the story is great and really inspires. It will almost make you irrationally want to see yet another sequel."
    },
    {
      "rating": "4",
      "text": "Rocky's soliloquies were embarassingly simple and of the dime-store philosopher type. He still hasn't learned to keep his hands up, so he's still a human punching bag. Joe Cortez let the fight continue after the 50+ year old fighter was knocked down twice in one round? Never. Suspension of disbelief was impossible because we were given proposterous story elements. Bad performances and even worse dialogue pepper this disaster."
    },
    {
      "rating": "10",
      "text": "I remember when I saw the first 'Rocky' I thought it was 'pretty good' but not great. I actually liked Rocky 2 better. I thought the rest of the sequel were ridiculous. I thought 'Rocky Balboa' was absolutely outstanding!!! I cried like a child and thought it was BY FAR the best Rocky of all and the others didn't come close. Obviously Rocky I made the last Rocky what it was. Without Rocky I this last fillm would not have worked. Rocky Balboa is literally a masterpiece."
    },
    {
      "rating": "9",
      "text": "I was very impressed that they displayed his physical vurnerabilities because it shows a link to reality, it was nice to show the true spirit of Rocky come out and to those who think Stallone is a bad actor, the bloke always moved me as this character and makes you want to believe hes real and makes you get behind him and theres no better credibility for acting than this. It was also good to see he proved his point without winning. If he won it would have given us a predictable less satisfying ending than the way the man won our respects without winning the match."
    },
    {
      "rating": "10",
      "text": "Great Movie, I enjoyed how they focused on the man!"
    },
    {
      "rating": "1",
      "text": "This movie was a huge disaapointment! Why bother fighting at 60 yrs old? Why? The trainer remarks he has no speed, no agility and all we can rely on is massive trauma. Even the fight is pointless unless you could match Rocky in his prime against the champ who by the way has absolutley no personality. Rocky has heart but there is a time to let things go and move on without having to prove something you have already proven. Rocky deserved better, sorry SLY."
    },
    {
      "rating": "10",
      "text": "I have been a huge Rocky fan for years and although Stallone did not like the way V ended, I loved the film, but it was smart and justified in making another. Everyone thinks it's for the title that I have talked to. WRONG! Stallone needs money. WRONG! It's about heart, getting a second chance, an opportunity, and that you are never to old to climb the highest mountain if that is what you believe. There is no can't. If you think you are to old, then you are. If you act young and stay young, you can accomplish anything. That is what this movie is all about. Go ahead and crack the jokes, but Rocky is a legend, an icon, a historic figure that will give everyone hope that it's never over till' it's over. If anyone gives this lower than a 9, then do what you normally do... sit on the sofa, eat munchies and drink soda and think that the world always owes you everything. Go out and use Rocky as your idol. He will get you far if you believe in him. A perfect ending to a classic saga. I LOVE YOU ROCKO!!!!!!!!!!"
    },
    {
      "rating": "7",
      "text": "It's a decent movie, but as a boxing fan, the dramatized finale doesn't really do it for me any more. However, the character of \"rocky\" (which I forgot wasn't just sly in a hat) was fun to see again. And the movitvational speech by his trainer, Tony \"Duke\" Burton was worth the price of admission by itself. It's just a small, nice film. You'll enjoy it."
    },
    {
      "rating": "9",
      "text": "One of the best Rocky movies!! Great story and and even greater ending. Only a few complaints;1) I wish the training sequence was longer. In past movies it was some of the best. 2)The night before the fight should have been longer, and more heart felt. Like in Rocky I, the night before the fight is a powerful time, and it seems Rocky is reflecting, but then lil Marie comes in and thats it. Would have liked that part to be longer. Other than that, it was one of the best movies I have seen in a long time!!! Thank you Mr. Stallone!!!!"
    },
    {
      "rating": "10",
      "text": "I watched this movie tonight, and I couldn't believe it, but the theatre was just PACKED. It was truly an experience, the crowd was clapping and was right in to it. it was a great movie."
    },
    {
      "rating": "10",
      "text": "Great flick. It had enough of the previous rocky's to keep the nestalgia and flowed well enough that even if you've never seen a Rocky before, you know what;s going on."
    },
    {
      "rating": "9",
      "text": "For Fans of the series you will cheer the latest Rocky film. I had heard someone say this is Stallones proper farewell to the character and he pulls it off with only minor complaints from this fan. Don't listen to those who will say the series is tired and worn. Go Rock!!"
    },
    {
      "rating": "10",
      "text": "Let me say that the fact that this movie was even made is a miracle of \"Balbo-ic\" proportions. I never thought I would feel Rocky on my steps again but that is the true magic of one of the greatest story's ever told in cinematic history. It is so very American with it's simple \"work hard, make something of yourself and you can be successful\" message. Sylvester Stallone has earned his place among the world's best actors/directors with just this one story...the story of Rocky. Generations to come will learn of this movie franchise as they did the Godfather and I think they will embrace it even more so. Movies one and six are really the only ones that you need to know this story."
    },
    {
      "rating": "9",
      "text": "[***possible SPOILERS***] So I recently went to see a pre-screening in the UK and... Despite tickets getting mailed out too late the screening was pretty full and it was a large auditorium. I recognized a good few faces"
    }
  ]
}