{"id": 1325, "title": "Rocky IV", "starring": ["Sylvester Stallone", "Talia Shire"], "runtime": 91, "genre": ["Drama"], "description": "Rocky Balboa proudly holds the world heavyweight boxing championship, but a new challenger has stepped forward: Drago, a six-foot-four, 261-pound fighter who has the backing of the Soviet Union.", "releaseYear": "1985", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jmvpwgW5M2kduR9zB0q8qGFC4zM.jpg", "categories": {"plot": 7.266666666666667, "acting": 6.333333333333333, "ending": 5.0, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.0, "action": 5.9375}, "reviews": [{"rating": "6", "text": "Rocky IV takes Apollo Creed's death to make this film the best of the saga. Sylvester Stallone could make it, becoming this fighting-film on the year's best film. Sadly, Stalone, again a terrible actor on a movie, makes millions, only for put the audience in shock, but the results are very low."}, {"rating": "2", "text": "you can change..Rocky IVJust like the songs, exercise routines and repetitive clips, it seems redundant to add another installment in this already falling franchise when you clearly lack material. Rocky IV is petty, childish and seems overlong despite of its 91 minutes of run time for it merely has an idea of a TV drama episode which is stretched to a point of exhaustion. Its painful to watch Sylvester Stallone go through this enormous amount of training and hardly make a point out there. He fails on all the levels here; writer, director and actor, to deliver any loose end of the thread for the audience to hang on to. Rocky IV is predictable, loosely written and choreographed and executed unsupervised."}, {"rating": "10", "text": "this is without doubt in my very own opinion the best feature film in the long legendary Rocky movie franchise  and I don't know why critics hate it so much"}, {"rating": "9", "text": "Rocky 4 is still one of the best cheesy 1980's movie with the franchise'sbest boxing match and if not the greatest training montage in cinema industry.The Plot is pretty simple revenge story but what makes it engaging is its characters who you care about and masterful editing with great score."}, {"rating": "10", "text": "No doubt about it, it's the best of the Rocky movies. It's cheesy as hell, but I don't care. What matters is the fun, and enjoyment. The first Rocky was great, but IV was a lot more entertaining."}, {"rating": "9", "text": "Turning PointWith a brutal opponent, And suspense throught, Rocky IV is one of the best of the franchise."}, {"rating": "8", "text": "Rocky IV made in 1985 and directed by Stallone see's a new, powerful, more dangerous enemy in Dolph Lundgren... Following on from Rocky III which was awful we get the continuation of the story and the next chapter opening in the form of ROCKY IV and Talia Shire, Burt Young, Carl Weathers and Sylvester Stallone return and we see also Dolph Lundgren... Apollo Creed dies at the hands of Ivan Drago (Dolph Lundgren) who's from the Soviet Union in Russia and a hard hitter, muscle built, mean killing machine with good looks, blonde hair and a giant warrior of boxing. Rocky Balboa seeks revenge for Apollo's death and set's up a fight with Ivan Drago (Lundgren) then has a gruelling training schedule in Russia before the fight... Rocky's fight with Ivan Drago is good but so unrealistic it's laughable and stupid, they were hard, killer punches especially the right hands... Rocky Balboa (Stallone) must of got hit hard by the Russian at least 200 times and mostly if not all in the face. However even if stupid Rocky IV is never boring, the films not very long and it's entertaining so a great edition to the Rocky series!!!!!"}, {"rating": "6", "text": "Another decent Rocky film though they're definitely tiring, has some of the series' best music."}, {"rating": "10", "text": "The entertainment value was high in this one. This is the Cold War movie. I have no problem the robot in this film, I think is awesome to have robot."}, {"rating": "6", "text": "“Rocky IV” is not the best Rocky movie, but I do think it is the most watchable.  Come for the training montages, stay for the anti Soviet Union propaganda.  The first half is pretty enjoyable to watch, but the second half doesn't really offer much that we haven't already seen done better in the other Rocky movies, but I did appreciate that the movie ends with a call for peace, where it could have gone all in on making the USSR an unforgivable monster.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out."}, {"rating": "6", "text": "The fourth part has the same problems as the third part: ridiculous fighting scenes and a story and characters, that are not so interesting anymore. The idea to bring the fight to Sowjetunion is a very good one though. Although some scenes showed Americans not better than the Sowjets, the movie was US propaganda."}, {"rating": "7", "text": "Maybe another case of a so bad it is good movie. Be warned for many this is garbage and even I who find it entertaining would not (completely) disagree. It uses the Rocky formula of an underdog trying to break the odds with emotional baggage. Here they added the cold war or rivalry between Russia and the USA. Soviet boxer Ivan Drago played by legendary Dolph Lundgren visits the USA with a delegation. They challenge Rocky to an exhibition fight. Rocky does not want to participate but his friend Apollo Creed wanted to have a remarkable last exit before he quits. Now the story progresses and everyone will know that it will end in a fight between Rocky and Drago at the climax of the movie. It is so predictable that no one considered it even as spoiler. Which is a main complaint for the movie. While still somehow entertaining it is foreseeable and unoriginal. The movie won 5 of the golden raspberries. But I must admit that Ivan Drago / Dolph Lundgren does a great and praiseworthy job. He is an intimidating and powerful antagonist. Also Carl Weathers and Tony Burtons performance is again great. Then there is the patriotism and east vs west mixed in. It is a borderline idea. It is entertaining and especially the conclusion is great but I see why many hate it or find it overcharged. Then there is the excellent soundtrack. Survivor did it again. With  “Burning Hearth” they made another classic that is played even today from time to time in the radio. There are other great tracks like “Hearths on Fire”, “Eye of the Tiger, “No easy way out” and “War”. Worth buying the soundtrack. But lets go to my overall rating. This is so far the weakest in the franchise without a doubt. It is however really entertaining and this is the definition for the so bad that it is good movies. Worth watching."}, {"rating": "5", "text": "Loving as the first three Rocky movies but the franchise begins to fall apart during this movie. At least it's better than averagely what the people think ----- Rocky V."}, {"rating": "7", "text": "Terrible, yes, but I'll be damned if it isn't entertaining. Arguably the most iconic antagonist in the franchise, Ivan Drago, is introduced here, and sparks 91 minutes of cheesy 80's fun."}, {"rating": "4", "text": "Rocky IV. Davaj Rocky! The weakest movie in the series. Apollo Creed from a sensible boxer becomes a jumping clown. Ivan Drago is a huge living log that fights and utters a couple of phrases for the entire film. Rocky alone has not changed. The only plus of this film is the final duel, but which also slightly resembles the fight from the first film."}, {"rating": "10", "text": "Rocky 4 is a masterpiece of cinema for all the wrong reasons. What was supposed to be a serious revenge tale was turned into a laughing riot thanks to Dolph Lundgren's line delivery, over-the-top anti-Russian propaganda, and corny fights. A must-see guilty pleasure."}, {"rating": "10", "text": "Probably one of the best Rocky movies of all time, even though it's a pretty short movie."}, {"rating": "7", "text": "An allright entertaining 80's movie, a bit patriotic but still good.Rocky IV is not to be taken seriously since almost every sequel after 2nd film are more fun pop corn films."}, {"rating": "6", "text": "Decent!it was little entertaining but felt repetitive as per story it was like same plot type with new threat and silly situations.the music was great,the acting was amazing the new Russian Boxer was like a Beast he's amazing,the Rocky jr was adorable with his tech things and the Couple were sweet and the Apollo he was emotionally great with Paul being Hilarious and entertaining,the starting scene was amazing the Robot and Paul's thing was hilarious then the whole new challenge thing from Russia just for Balboa felt like here we go again and then the Apollo's decision to fight in ring with silly little training and then the fight resulting in utter rubbish tragedy which wasn't that impact-full or necessary it was heart-breaking and emotional for a while as per prequel connections not for this **** 2 seconds of silence and tears it wasn't manged well he was iconic character.then the match thing for Rocky and Adrian's side the conversation and all it was good,then the press meeting fixing the date of fight in Russia at Christmas it was amazing,the training in Russia and whole journey with Paul talking about Hygiene and all it was entertaining and hilarious,the Duke's conversation and him as trainer was amazing the whole training sequence in Russia is pure iconic and awesome,the last act was intense and the fight at last just like all prequels it was awesome and amazing the punches and intensity beating the beast it was great,the whole Russia vs USA Rivalry thing was amazingly showcased with awesome satisfying speech at end by Rocky upon the nations it was amazing,the fight lasting long 15 rounds it was amazing and ending was satisfying.Overall it's sometimes like silly,over the top but entertaining its a decent Movie!"}, {"rating": "10", "text": "I should hate this movie. But instead, i absolutely love it.  Rocky IV was flawless from start to finish. Definitely my pick for the best out of the 5 although I have yet to see 5. A movie that pays true homage to the legendary saga. The music, plot, storyline and the way that it makes you hate the main villain Ivan Drago is absolutely poetic. Sylvester did an astonishing job with this plot and made it go places. What is made out to be a really cliched filled ridiculously bad film is actually motivational, great, amazing and one of the best films I've ever seen. Just like the main plot Rocky IV defied all odds and was flawless. I could not find one thing wrong with this one."}, {"rating": "8", "text": "Rocky IV is the top of the series in my eyes. Already in the three, it seemed that maybe everything was done and that no one stronger could come. However, the fourth part showed that he can be in the form of a real Russian, who simply looked murderous. The best enemy in the ring. The best workout and for me the best part of the series. Great movie for me, which I recommend."}, {"rating": "7", "text": "Rocky IV isn't a bad movie. It is just forgettable. I actually think it's on the same level as Rocky III. The bar was set high after I watched the first two Rocky movies, and they never reached that bar with Rocky IV. Creed was really acting out of character in this movie. I mean he was always a little cocky, but this is just annoying. Rocky in this movie is the worst he has ever been. It wasn't that he was bad it was just that he was forgettable. It is still a good movie. I like the Russian a lot. I probably like him more than Mr. T. The training scene is good, but it doesn't compare to the first three. The action is as good as any other Rocky movie. I really liked the final match. That was done really well. I overall give this movie a 7/10."}, {"rating": "5", "text": "Not good.Rehash all the other Rocky movies, throw in a cold war theme with a cliched villian and you get Rocky IV."}, {"rating": "7", "text": "7.5/10Rocky IV delivers the weakest entry in the franchise so far with it's build up, and i'm not saying that it's bad or horrible, at the very least it was just ok for me, but even with that, Rocky IV close with possibly my favorite, possibly the best, and also possibly the most brutal main event in the franchise so far, a very very exciting and a really great match, and Drago was definitely a machine, and he's terrifying and he's brutal, Rocky IV did feels like it missing something in terms of an appearance and sadly some of the magic, but i can at least still see the effort that Sylvester Stallone have for the Rocky saga so far in Rocky IV by not only still bring some good new opponent, but by his bravery now to include politics, and it's the Soviet Union, which is quite crazy, so overall Rocky IV fills with partially a mixed but still mostly ok build up that close with a banger, combined everything Rocky IV was still pretty good overall."}, {"rating": "3", "text": "This movie had POTENTIAL, it set things up GREAT with the death of Apollo Creed, and then all of it was squandered. It used to be that boxing was only a heavy factor of these movies, not something that hogged all focus. Now, it's all boxing, talking about boxing, or training for boxing. All of the other stuff about life that was present before is pretty much gone. Creed's death is a good way to set up events to come, but from between there and the face-off between Rocky and Draco, a whole lot of nothing happened. Just a bunch of montages, changing locations, and a couple heart felts between Rocky and his wife. The grand final duel didn't feel like a final duel. I mean, I could certainly TELL there wouldn't be anything after this, but nothing felt like it'd been built up properly. It's just: Draco kills Apollo, Rocky beats Draco. We get to see barely any more of the Russian Terminator before his duel with Rocky, just a press conference and some training/steroids. The ending doesn't feel EARNED in the slightest. It just feels like Rocky got buff and then got revenge. This movie has so much filler, it could've been a tv episode. Except if this WAS a short, then Apollo's death would've felt like he'd been robbed.And yet despite all this, my dad tells me this movie ended the cold war. I guess the russians were so discouraged by how empty their rocky movie was that they gave up."}, {"rating": "7", "text": "The amount of actual normal scenes and dialogue in this is hilariously low. The first 8 minutes are the last 8 minutes of Rocky 3, there are 4 total montages with 1 being a recap of events in rocky 1-3, and there is a full 4 minute musical production. The soviet crowd becoming pro Rocky and Rocky solving the cold war are all time bizarre moments."}, {"rating": "7", "text": "People don't like how Rocky 4 delves too deeply into politics and the rivalry between the United States and the Soviet Union, but I thought those scenes were fantastic. It was also refreshing to see a different kind of boxer in the story instead of just Americans, and Dolph because of that became a star. This movie is also very sad because of Apollo's death, but I thought it was handled correctly, and this part also gives us some real life examples."}, {"rating": "5", "text": "Although I like this movie, it's my personal least favorite of the Rocky series because it's the most unbelievable of the group. He runs up a damn mountain for godssake!"}, {"rating": "6", "text": "Siendo honesto yo crecí con Rocky IV, pero esta película es en muchos aspectos propaganda nacionalista, ademas la película se compone un 60% de montages, en lo positivo Drago como villano impone mucho, la pelea final es en mi opinión la mejor de toda la saga y la musica es excelente y se volvió icónica, pero todo esto no basta para ser una buena película"}], "recommendations": ["rocky_v", "the_matrix_revolutions", "battle_los_angeles", "transformers_dark_of_the_moon", "pearl_harbor", "underworld_blood_wars", "mad_max_fury_road", "creed_ii", "thor_ragnarok", "terminator_3_rise_of_the_machines", "london_has_fallen", "the_matrix_reloaded", "underworld_awakening", "transformers", "star_wars_episode_ii_attack_of_the_clones", "the_fate_of_the_furious", "captain_america_the_first_avenger", "angel_has_fallen", "avengers_age_of_ultron", "king_arthur_legend_of_the_sword", "armageddon", "300_rise_of_an_empire", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "hercules", "abraham_lincoln_vampire_hunter"]}