{
  "id": 2588,
  "title": "Rocky V",
  "starring": [
    "Sylvester Stallone",
    "Talia Shire"
  ],
  "runtime": 104,
  "genre": [
    "Drama"
  ],
  "description": "A lifetime of taking shots has ended Rocky’s career, and a crooked accountant has left him broke. Inspired by the memory of his trainer, however, Rocky finds glory in training and takes on an up-and-coming boxer.",
  "releaseYear": "1990",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qCARerjCFZOEeLiVdomhwRYlDSn.jpg",
  "categories": {
    "plot": 5.238095238095238,
    "acting": 6.0,
    "ending": 7.1,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.933333333333334
  },
  "reviews": [
    {
      "rating": "6",
      "text": "It's the last 20 minutes that if finally kicks off."
    },
    {
      "rating": "8",
      "text": "I know it's controversial, but I believe Rocky V is the best Rocky movie since Rocky II. They tried a lot of new things, and payed off a lot of things from the previous movies. If they were to do another Rocky fights someone in the ring movie it would have been what we already have seen. Instead they try something new and give us a movie were he trains someone instead of Rocky being trained. I won't spoil anything, but it doesn't go the way you think. The end fight was original and something we haven't seen in the series. Although that's were I will start with my negatives about the movie. I like what the did at the end, but I thought it was drawn out for way too long, and it got to the point of being unrealistic. There was also some really weird editing choices at the end. Also some of the acting was not good at all. Other than that I really enjoy Rocky V, and believe it's a good way to close the main series."
    },
    {
      "rating": "3",
      "text": "Its not as horrible as, say, Batman & Robin, but Rocky V is consistently disappoints me and I don't think that its worthy of the standard set by its predecessors. Yes, the previous two installments were a little corny, but they were genuine fun. The biggest issue I have with this one is that Rocky doesn't end up fighting in the ring."
    },
    {
      "rating": "10",
      "text": "For true Rocky fans I feel they get it. Yes its hard to compare to Rocky 4 but in my opinion that is the best in the franchise. Now I know everyone wanted to see Rocky traing then in tue ring which could have easily beendone but they decided to go in a differnt direction. In Rocky one he was a loan shark with no money this movie returns Rocky to his roots and \"the Duke\" even says Rocky is a street fighter which he was. The point of the movie was what Adrian says in the street he's not Mickey and Tommy is not Rocky because he doesn't hhave his heart. The best line is when pauly gets knocked downbin the bar and Rocky says  You knocked him down why dont you try and knock me down!\" And Mickey telling him he has one more round and he didn't hear a bell speaks to Rocky's heart and it gives me goose bumps. This movie was panned by critics but what do they know? In closing if you dont watch every previous film then it wont have the same impact."
    },
    {
      "rating": "3",
      "text": "As weak as it being part of the franchise and as weak as it being a film alone, Rocky V will call Rocky to retire his job at making this movie. At least he comes back better 16 years later."
    },
    {
      "rating": "0",
      "text": "Definitely the worst of all Rocky movies. The scenes were just bad and the acting is really weird. This is the dark cloud of the Rocky franchise..............."
    },
    {
      "rating": "6",
      "text": "I've only watched two Rocky movies so far, Rocky IV & V. And I definitely prefer IV than V. The movie is a bit dull at times but it's definitely worth a watch (even just for the last fight). By the way I would give Rocky IV 9/10."
    },
    {
      "rating": "3",
      "text": "(Owen McKenna Rio Rancho, NM) Out of all the Rocky Movies this is my least favorite. I felt Stallone wanted to make a move and threw this one together. I see where he was trying to go with this movie, but I think  it could have been better.  Maybe I would have rated this higher if I didn't have the previous movies to compare it too.\rI rate Rocky the best, followed by Rocky II. Rocky III was OK Rocky IV was a little far fetched especially the ending. Rocky V did nothing for me."
    },
    {
      "rating": "7",
      "text": "This may not be a great film, but unlike all other sequels it feels like Rocky and is fairly entertaining, and still miles ahead of terrible movies like Rocky IV."
    },
    {
      "rating": "5",
      "text": "Rocky V was one of the worst Rocky films. Everyone thought Rocky IV was stupid, but wait until you see the fifth installment. You'll start thinking Rocky IV was a masterpiece!"
    },
    {
      "rating": "2",
      "text": "Rocky V is dule, not-much-funny, not-much-action, not-much-love film, that tries to continue a saga with a dramatic film. Unfortunately, this is not the Sylvester Stalone that we met in Rocky film."
    },
    {
      "rating": "0",
      "text": "Been there, done that, the film sucks. Every bit of it is pretentious and stupid, with terrible performances, including that of the usually reliable Stallone."
    },
    {
      "rating": "4",
      "text": "live through your eyes..Rocky VIt was better and more interesting episode of Balboa's life than the previous one, but it still doesn't make it good enough to invest in it. Rocky V is fast paced than the previous ones and seems to have material enough to run for around 100 minutes unlike its previous installments even though the content is predictable and familiar to the audience. Sylvester Stallone may not be able to attract the audience with its storyline but he surely puts enough gravitas on his character and also plays it with all the conviction to always let the audience ask for more of it and root for it and cheer for it. Rocky V is not nearly redefining it or justifying the originality and the purity of it but it is made for the fans and delivers enough action sequences and huge dramatic scene to capture their attention even though it still is poorly choreographed and repetitive."
    },
    {
      "rating": "9",
      "text": "Rocky getting back to his roots and learning to appreciate life."
    },
    {
      "rating": "10",
      "text": "Great performance by all the cast, along with a good storyline. Why doesn't Metacritic review the other Rocky films?"
    },
    {
      "rating": "2",
      "text": "a disappointment. I didn't like the movie. all this family-trouble with his pubertal son was just stupid and annoying and even the fighting scenes were bad. the only fact I liked was that rocky kicked tommy's - an ungraceful asshole - ass, so it's not a 0 but a 2."
    },
    {
      "rating": "3",
      "text": "This is a cash grab sequel. The story was so depress, the manager was annoying **** and street fight was dumb. They just throw any that sticks and none of them works."
    },
    {
      "rating": "7",
      "text": "I am surprised, that the reviews are so bad for this movie. I had more fun with this part than with the 4th part for example. Ok, the music is bad and the story has some weaknesses, especially the plot twists and some behaviours are not convincing. But finally this part is a bit different to the other Rockies, because the focus is more Tommy Gun and Rocky as a coach. The fighting scenes are bad as usual, but the street fighting was a nice idea. Also I like, when the movies are showing some background information about the boxing business."
    },
    {
      "rating": "6",
      "text": "Rocky V has a tendency to drag a little bit, and the plot is a little bit muddled at first. But, Stallone is still at his best and his character still seems fresh the whole movie. Along with the addition of Rocky Jr. And Rocky's protégée, the movie receives some much-needed fuel, and ties up the Rocky movies pretty well (even if they cheated and made \"Rocky Balboa\" 16 years later)."
    },
    {
      "rating": "3",
      "text": "The weakest movie in the Rocky franchise. It is more of a misstep. For example: Can you summarize the story of the movie so others would be hyped or interested to see this movie? Yes without a doubt. This is an indicator as everything in this movie can work if done correctly or with a different approach. Lets start with the story: Rocky is back at the USA after the events of Rocky 4. His health has however suffered terribly. Because he was fooled by an accountant he lost all his wealth and is back were he began as his health prevents him from boxing. He decides to become a trainer like Mickey and meets a young aspiring boxer named Tommy Gunn starting to train him. There are also side stories about his family but I stop here as more would ruin the story (Yes, many will claimed it is already ruined by default). From this alone it looks like an awesome movie. It fails in delivering the impact, emotions and characters. It is like doing stuff on a to do list without (enough) care or knowing how it works. Even Sylvester Stallone did not like the movie. It was nominated for 7 or 8 golden raspberries if I remember correctly. The characters again are diluted or weakened by the script. For example there are great scenes that show the potential but then there are others that feel like poorly scripted attempts to get it over. I think I am moving in circles so lets get to my final rating. Overall this is a misstep that had great potential but failed to deliver. Not near the worst movies of all times but also not recommendable. May be compared to Star Trek 5 as it is also the worst in the series but had also great potential. Bonus knowledge: The mentioned Rocky Marciano (Rocco Francis Marchegiano) is a boxer you defiantly should know. He is the only heavyweight champion that finished his career undefeated (49-0). He was not only an excellent boxer but also spent his money the smart way and stopped a potential comeback when he realized he was not as good as before. Remark: Rocky is not inspired from him. Chuck Wepner inspired Sylvester Stallone for Rocky."
    },
    {
      "rating": "4",
      "text": "The Rocky franchise has carried itself in a particular fashion that has made it popular and profitable. I feel like Rocky V strayed from that fashion. It claims to be an even further reach back into Rocky's roots as a street fighter and that that was a prominent part of his character all along when it really was never established  in any of the other films except vaguely in the first Rocky. There is merit in the story, and a lot of heart involved in the struggle Rocky has in salvaging what's left of his life and providing for his family. It was a new direction that was just too far for me. Were it standing on its own I may think better of it but considering its prequels and sequel, this is the runt."
    },
    {
      "rating": "6",
      "text": "The first half of Rocky V is genuinely well written and has some great emotional and dialogue sequences but the second half takes a left turn and becomes completely outrageous and a little to stupid the ending street fight is great though."
    },
    {
      "rating": "7",
      "text": "Though the cheesiest of the franchise, Rocky V has a lot more heart and interesting dialogue than previous entries. With a really strong performance by Richard Gant as George Washington Duke."
    },
    {
      "rating": "5",
      "text": "Rock BottomRocky V isn’t awful, But it’s a huge disappointment compared to the first 4 films."
    },
    {
      "rating": "7",
      "text": "Rocky V. Fighter of the ring and street. Controversial film. On the one hand, it is quite boring almost all the time. On the other hand, it is very atmospheric and effective at the end compared to the previous parts."
    },
    {
      "rating": "1",
      "text": "I love every film in the series except this one. Rocky V is a contrived and misguided film that completely butchers a premise that while already inherently flawed could have been much better executed"
    },
    {
      "rating": "1",
      "text": "I love every film in the series except this one. Rocky V is a contrived and misguided film that completely butchers a premise that while already inherently flawed could have been much better executed"
    },
    {
      "rating": "9",
      "text": "the best in franchise after 1st one its underrated gem!it was emotionally and mentally brilliant and satisfying,it was unique and fresh and new take on Rocky's journey rather than same plot another level fights,it was heart-breaking,touching and brilliant.the music was phenomenal,the story was brilliant so does screenplay,the acting was iconic the new characters were amazing with there politics and the family was great,the starting comeback from Russia and the new challenge for rocky from new Manager it was like here we go again it felt like its going same way as prequels but it was surprising,the whole bankrupt thing and the cause for it the Paul he's like it just happened it was over the top and miss-fortunate thing,the reunion of old house and the streets were amazing the flashbacks of Mickey's were emotionally touching and great,the back in business for Rocky as trainer and the new Guy Tommy and there friendship at start was amazingly developed although in between it the Rocky jr's thing was heart-breaking and sad his arc throughout the story was brilliant and full of life lessons,the little and small details to society and parenthood it was brilliantly showcased.the Tommy's training and winning scenes were amazing,the main twist with brilliant play by manager brainwashing Tommy and using against Rocky it was heart-breaking and emotional the street scene it was strong and brilliant then the later match wining speech of Tommy not mentioning Rocky and him watching in TV was literally Emotional and strikingly sad,then the Rocky's Realization of whats good for everyone and all it was pure brilliant then the whole ending the people telling Rocky as real champion and Tommy's obsession to defeat Rocky and the manager's tactic to letting them fight then the whole ending emotional conversation and street fight it was pure mind-blowing and amazing it was emotionally great,the last punch to Manager was satisfying as hell.the Rocky throughout the movie is literally the Man of heart he's dedication and heart-breaks with his morals he was pure brilliant,the whole movie was emotionally,dramatically entertaining and satisfying arc for Rocky it's a underrated Masterpiece!"
    },
    {
      "rating": "10",
      "text": "Very underrated film, it has always been my favourite of the series, it tried something different for the ending that I feel worked really well, I will always defend this movie against the ignorant masses."
    },
    {
      "rating": "5",
      "text": "Rocky V is not a bad movie. However, in my opinion, it is simply useless and, worst of all, such a demotivating one. Rocky is at the bottom again, he started smoking again, and the boxer who dropped his cigarettes and started training really became ... I don't even know. For the whole film we won't even see a real fight in the ring. For me, an average film that I just don't understand why it was made and I only recommend it to fans of the series."
    },
    {
      "rating": "5",
      "text": "I like the first 20 minutes of Rocky V, but then the rest of the film was just a flat out boring film fills with uninteresting characters and story, my major problem was Tommy, i just cannot click with him for a single second even when the first time they show him, even when he's still friends with Rocky i just never get him, Tommy did not work both in characters and appearance, he's not a good villain like Apollo Creed, Clubber Lang, and Drago, in Rocky V we were going back to a very familiar places, the underground, and it's another things i like was that we can finally see \"the old Rocky\" back again, and Sylvester Stallone really did the same old Rocky performance, dialogue, style, gesture, and personality and i really really like it, i also like some of the throwback like the priest, and i really do appreciate some of the few scenes and on how it ended i definitely not expecting it and i do appreciate it but again at the same time every time i see Tommy i always feel like he is just not the guy, loved seeing him get beat up but when he's face shown, it was a no, another conflict was Rocky and his son relationship that cracks also did not work for me, couple or three boring long sequence, cheesy moments, and again Tommy, Tommy, and Tommy was just uhhh, so overall Rocky V was simply the worst one in the franchise so far, it could've work if at the very least they got a better actor to play Tommy, and definitely a better story too, it's disappointing to say that overall Rocky V was indeed a bad movie."
    },
    {
      "rating": "6",
      "text": "The Rocky movie series had an intriguing beginning but became monotonous after the second movie. The strength of an Italo-American fighter who is white, giving, and kind to his wife, children, and friends has been the subject of several movies. But, this Rocky V somewhat made me think of the tragic tale of Joe Louis, one of the most well-known boxers of all time, who was forced to return to the ring to face a young and powerful Rocky Marciano. Louis was no longer considered to be the person who was unstoppable during the 1940s; instead, he returned as a result of mysteriously appearing debts that forced him to battle for his life."
    },
    {
      "rating": "7",
      "text": "I personally like this movie. Yeah, sure it's not a typical Rocky movie and he doesn't fight in the ring, but he beats the crap out of his student who became a complete D-bag. The ending street fight is great!"
    },
    {
      "rating": "5",
      "text": "Rocky V sufre de lo mismo que sufren todas las secuelas de Rocky, el ser innecesarias, sin embargo cuenta con el mensaje de nunca olvidar la familia y nos explora a Rocky como alumno de Tommy Gunn, pero seamos honestos, Rocky siempre fue un símbolo de superación, como para acabar donde empezó"
    }
  ],
  "recommendations": [
    "creed_ii",
    "rocky_iv",
    "rocky_balboa",
    "bumblebee",
    "terminator_genisys",
    "the_karate_kid_part_iii",
    "thor_ragnarok",
    "rocky_ii",
    "el_camino_a_breaking_bad_movie",
    "the_twilight_saga_breaking_dawn_part_2",
    "max_steel",
    "pirates_of_the_caribbean_dead_men_tell_no_tales",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "x_men_apocalypse",
    "pirates_of_the_caribbean_on_stranger_tides",
    "kingsman_the_golden_circle",
    "terminator_3_rise_of_the_machines",
    "nobody",
    "incredibles_2",
    "man_of_steel",
    "avengers_age_of_ultron",
    "spider_man_3",
    "transformers_dark_of_the_moon",
    "king_arthur_legend_of_the_sword",
    "the_many_saints_of_newark"
  ]
}