{
  "id": 4594,
  "title": "RocknRolla",
  "starring": [
    "Gerard Butler",
    "Tom Wilkinson"
  ],
  "runtime": 114,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "When a Russian mobster sets up a real estate scam that generates millions of pounds, various members of London's criminal underworld pursue their share of the fortune. Various shady characters, including Mr One-Two, Stella the accountant, and Johnny Quid, a druggie rock-star, try to claim their slice.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/i7eyngqjdvKB7NvrWtCjjTNNq8N.jpg",
  "categories": {
    "plot": 7.375,
    "acting": 7.523809523809524,
    "ending": 6.0,
    "soundtrack": 3.5,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 7.111111111111111,
    "action": 8.416666666666666
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Loved it, from beginning to end. I wild rollercoaster of a film, not too different from Snatch but when judged on it's own, it's a great film. The Real RocknRolla can't come fast enough."
    },
    {
      "rating": "10",
      "text": "This simply a great movie, it is well acted well directed and is the perfect blend of action and comedy 10 out of 10"
    },
    {
      "rating": "10",
      "text": "My favourite movie of all time. This movie got a lot of cr*p for no reason. Even though the beginning lacks a tad of action, the rest of the movie is filled with. I am definitely looking forward for the Real RocknRolla. The movie is action packed and funny. Some people say that the plot twists are too predictable, but I ask them, what plot twists their are none. It's just a flowing movie of awesome. Lots of people compare it to snatch, however it's completely different. Snatch happens in the little league gangs of east london, while as RocknRolla is with the high rollers of West London."
    },
    {
      "rating": "9",
      "text": "RocknRolla tells an engaging story, a surprise in itself given just how many character arcs are taken on, but screenwriter-director Guy Ritchie handles this monumental task well, each group of characters have their own individual story unfold, but crossover and intertwine with others until the conclusion, where the plot drives each of the characters to the one place. I am reminded of Grand Theft Auto IV and its two DLC (\"The Lost and the Damned\" and \"The Ballad of Gay Tony\") and how the main characters' stories, while on the whole entirely different affairs, crossover at certain points, maybe its just me, but that's a narrative technique that I find admirable. The cast pull it off with an aplomb, I mean, come on, Gerard Butler, Tom Hardy, Mark Strong and Tom Wilkinson to name but a few, this movie's casting is nothing short of inspired. But most important of all, the cast seem to have fun with their roles, and it's awesome to see actors who enjoy what they do not just for the extensive salary, but for the joy of acting itself."
    },
    {
      "rating": "8",
      "text": "I like Guy Ritchie as a director, his style and vision for his films.  I couldnâ"
    },
    {
      "rating": "8",
      "text": "RocknRolla brings an ensemble cast, some who have done extremely well in life after this film, and have thrown them into a very fast-paced and pulsating film that doesn't come up for air.\rThis isn't necessarily bad, Guy Ritchie, after all, is the writer and director of this British crime/comedy film, and he does an exceedingly good job at integrating each cast member to be of a particular use when the time comes.\rSo One Two (Gerard Butler) and Mumbles (Idris Elba) are basically thieves, if the complex story is to be believed, and they owe quite a debt to underground crook Lenny Cole (Tom Wilkinson) and his associate, Archie (Mark Strong), who lead in an awfully witty and humorous script that is up there with the best of Ritchie's films.\rThere is a vast array of characters who all play minor parts in the big picture, literally, because a painting lent to Cole has been stolen and is being traced down. Tom Hardy, Ludicrous, Jeremy Piven, Toby Kebbell and the cunning yet beautiful Thandie Newton, all play pivotal roles to create a largely entertaining crime film of the Ritchie tradition.\rIt does, however, have its shortcomings. The plot is a little complex to the point where it can sometimes be too quick, or too much going on to even give a damn to pay attention to the actual story and instead enjoy the action moments. There is also the problem of a large part of the cast being under used or not really standing out in their roles, apart from maybe Thandie Newton, Mark Strong and Tom Wilkinson, the rest just appear to be going along for the sake of it. Toby Kebbell is also annoyingly memorable in his role.\rBut these small problems aside, this is still and excellent and enjoyable film, with the cinematography being of true excellence, highlighting particular scenes to show their importance, or just to add depth, like most Guy Ritchie films. The witty and smart script is catchy and noteworthy, with plenty of British slang and quips to amuse the best of us, and is well delivered from the talent at show, some more so than others.\rit has all the potential to be a classic, with its underlying humour and glitzy take on crime in London, but a few minor story details and over-abundance of characters stop it from being masterful."
    },
    {
      "rating": "8",
      "text": "Fast-paced, a good, fun watch. Lots of small, funny, \"character moments\" that made it interesting and engaging. Don't know why it has such a low critic rating."
    },
    {
      "rating": "8",
      "text": "Watched this at release and I think the issue was I wanted a Lock Stock, watched it last night and it was a great couple of hours of entertainment. Mark Strong superb as ever and great cast and script.\rDid Sir Alan get hisLondon dwellings this way?"
    },
    {
      "rating": "10",
      "text": "Great direction, great casting, great acting, cool story line. Best film I've seen in ages. Vastly underrated."
    },
    {
      "rating": "9",
      "text": "The folks who say all Guy Ritchie films are the same are confusing style and substance. The style is the same as Snath and Lock Stock and 2 Smoking Barrels, but with a different plot. This is a film you can watch a couple of times and still catch new twists. It's a film I could watch with my teenagers and all of us enjoyed it."
    },
    {
      "rating": "9",
      "text": "Fantastic, Guy Ritchie has made one of the films of 2008. complex, funny and generally an enjoyable film. good stuff."
    },
    {
      "rating": "10",
      "text": "Awesome! If you liked Snatch, Lock Stock and Two Smoking Barrels, or any other good Cockney Gangster Film, you will love this."
    },
    {
      "rating": "9",
      "text": "The critics are off base here. If you enjoyed Snatch or Lock, Stock, this is worth seeing. I was apprehensive based on the Metascore, but this movie is fun and even the notion of a sequel (The Real RocknRolla) got me excited. It probably won't happen, since Ritchie is working on Sherlock Holmes, but i'm keeping my fingers crossed."
    },
    {
      "rating": "9",
      "text": "I really enjoyed this movie, it was witty, good and the critics are just complete assholes in judging it, it seems. This movie was a lot better than other ones that got higher scores in Wide Released status."
    },
    {
      "rating": "9",
      "text": "Although similar in some ways to some previous Ritchie films - RocknRolla delivered some tasty/nasty characters and a large number of belly laughs - Great flick for people who like to see those most deserving \"get it in the end\" *lol*."
    },
    {
      "rating": "10",
      "text": "VS.D, sorry, but go f**k yourself. Rocknrolla may in fact be the EXACT opposite to what you said. If you are considering seeing this film then you MUST do so! It is one of the greatest, most interesting, thrilling, satisfying movies ever. The story has some great unexpected twists and literally kept me on the edge of my seat all the way through, ok so its a little complicated but if you stick with it then you'll love it. The action sequences are awesome and original and I wouldn't swap just one of them for the ALL of the action sequences in Quantom of Solace. Plus the acting and characters are truly superb. All of it comes together to form something so unbelievably amazing that you simply HAVE to see it. Half of these reviewers are talking out of their asses, i'm not even sure we were watching the same movie!"
    },
    {
      "rating": "7",
      "text": "This movie was so much better then I though that it would be. I remember seeing previews for it and thinking it would be just horrible. After watching the movie I was proved wrong, the story soundtrack, acting, flow, plot were all great. There where only two minors complaints that I had. First it drug on a little in a couple spots and the dance scene was kinda stupid. Otherwise the movie was fantastic, I loved the robbery scene, I don't think I have laughed that hard in a long time. Overall the movie was enjoyable and fun to watch, this is a must see."
    },
    {
      "rating": "8",
      "text": "This is one of those films people will hate or love. The movie is more of a cult-hit sort of a deal where majority of the public will not be impressed, but a selected few will absolutely adore it. If you have seen Guy Richies previous work then, its more or less of the same thing (not a bad thing). If you plan to watch it however, I strongly recommend doing so alone or in a small group, DO however turn on the subtitles even if you are a native speaker, since some of the witty jokes are thrown out so casually you might not even notice em. The movie plays mostly off the atmosphere and interesting characters with the story taking a back seat most of the way. I have seen it 3 times and I noticed new things on each sitting(also understood the story as a whole after the final sitting)."
    },
    {
      "rating": "10",
      "text": "Best movie ever"
    },
    {
      "rating": "9",
      "text": "I like it how so many people say this movie is boring. You would have to be an idiot to even fathom that! its a fast paced action thriller with good action and well crafted humor. Excited to see the next installment!!!!"
    },
    {
      "rating": "10",
      "text": "This movie, by far, is the best film I've seen in a while. Yeah, this review is a little late, according to when the movie first came out, but i just saw the trailer again, so I saw it. Let me just say, as a critic, I do not, I repeat, DO NOT care for what you have to say about this movie, unless you have something good to say about it. I loved this movie, the cinematography, the storyline, the action, the humor, the mystery, it is nearly perfect. 10 out of 10."
    },
    {
      "rating": "10",
      "text": "guy Ritchie did it again with this movie, it is easily one of the best films i have ever seen witch for some reason is hated by critics. In any case before you gauge it go and watch it ... i promise you will not be disappointed."
    },
    {
      "rating": "2",
      "text": "This movie's a snoozefest. I shut it off after 40 minutes so that I wouldn't fall asleep. Truly hard to believe this much effort went into making something this slow-going. If you do rent this movie, make sure you've got a good book with you as well."
    },
    {
      "rating": "3",
      "text": "Disappointing to say the least. The acting is wooden and lacks direction and the cut means the end of the film makes little sense. Ritchie steals too much from previous films, the snitch boss a-la Layer Cake was horribly predictable, the film tries hard to be Lock Stock and Snatch, but lacks in every department and simply winds up as an unintentional parody of Ritchie films. Poorly acted for the most part, poorly cast, poorly directed and hopeless editing and cutting leaves this film as a ghost of what most people expected it to be. Unbelievable and unrealistic this is more a pantomime than a movie."
    },
    {
      "rating": "0",
      "text": "Boooooring, childish plot, twists if you are blind and on a rollercoaster. Really stilted scenes, like a long episode of hotel babylon. Crap."
    },
    {
      "rating": "5",
      "text": "There's not much new here. Sure, as a film alone it's not bad. There's some cool scenes and funny moments. The style and soundtrack make it all seem very exciting. However, if you've seen any of Mr Ritchie's previous films or the the great movie, Layer Cake, then this just seems jaded. In terms of the plot and characters, you can actually see where he's just lifted existing material (Johnny Quidd is the same as Mickey in Snatch; Lenny is like Bricktop and the bad guy in Layer Cake... I could go on. ) This would not be so bad if it was improving on the earlier films but it isn't. If anything, Ritchie's just getting sloppier. There's rehashed dialogue and a couple of story lines that seem very unnecessary and lack any real conclusion. So overall, this is worth a watch if you fancy some mindless entertainment and liked his earlier work... but don't bother if you're looking for something new."
    },
    {
      "rating": "4",
      "text": "Too confusing to follow."
    },
    {
      "rating": "2",
      "text": "What happened to guy ritchie? The only thing that made this movie good is the rocknrolla itself, standing in front of the mirror with the clash soundtrack playing, that is the only thing i can remember about this movie. Everything else is human waste."
    },
    {
      "rating": "5",
      "text": "I've never liked Guy Ritchie's direction, and although this film is more appealing than most of his movies, I still found it typically cold and unfeeling. It has style, no substance. Good performances, particularly Wilkinson and Newton. Fine score."
    },
    {
      "rating": "3",
      "text": "Not completely bad, but could use the subtitle \"Kinda like Snatch but not nearly as good\". I winced at Tom Wilkinson's speech about the crayfish, it was basically lifted from Bricktop's speech about pigs in Snatch. At least Jason Statham wasn't in this one playing the same character he plays in every. single. film. Still, a boring rehash that feels about 5 to 10 years old, when films and tv shows about gangsters were cool. Let's face it --gangsters are pretty played at this point. Your time is better spent on his first two films, and, Guy, rather than making the promised sequel/s, why dont you try something new?"
    },
    {
      "rating": "6",
      "text": "Not a fun picture to watch although the dialogue is stylish and the story quite confusing. Supposedly mob rogues acting silly and stupid as they go about doing their dirty deeds. Film saved by the final twist in the story but by then who cares. Watch it on DVD if you must."
    },
    {
      "rating": "5",
      "text": "This is not near as good as his previous efforts. It takes a long time to develop, so long in fact that you are just about ready to walk out. It finally starts to come together at the three quarters mark and is enjoyable from there. I would not go out of my way to see this film."
    },
    {
      "rating": "6",
      "text": "Guy Ritchie returns with dead rockstars, Russians, homosexuals, a painting, & the bloke out of 300.Top notch cast with Toby Kebbell, Gerard Butler, Tom Wilkinson & Mark Strong all giving good performances.The film is what you'd expect from Guy Ritchie, Cockney geezers giving it large, slick cut-aways, choonz & all round kerfuffle.Could have been a lot better considering the talent on offer & definitely not as good as Lock,Stock or Snatch which is what Ritchie is always going to be compared with."
    },
    {
      "rating": "0",
      "text": "Really really boring. Lock Stock was excellent. Snatch was a glossy replica that had a bit of diminished return but still came out good. Rocknrolla replicates Snatch and plugs in less lively characters, an equally convoluted plot but one that seems a lot more like running in sand, moving quick but not going anywhere... Thandie Newton plays a Bond girl, Gerard Butler is lame, and Jason Statham stayed home sick for this one. (Not trying to give him props though. Because then there was Revolver.)"
    },
    {
      "rating": "5",
      "text": "Most of the movie was nonsensical talking, screaming, swearing with attitude which although does make up most of Guy Ritchie movies, RocknRolla was confusing and hard to follow. The first half was unclear and a little boring, there are some good scenes towards the end when the movie starts to make sense but overall I found the movie jumbled and fairly forgettable."
    },
    {
      "rating": "6",
      "text": "RockNRolla is a very mixed bag. Kinetic and chaotic as all of Guy Ritchie's films, RockNRolla is a smart and witty crime comedy that features the very best of Ritchie's skill in the director's chair. The acting, especially from Toby Kebbell, is terrific. The entire cast is very talented and showcased it in this thoroughly British affair. The film has some pacing issues, namely in the middle. The ending picks up and is decidedly the best part of the film. The beginning is also strong, whereas the middle falls apart and is loosely connected to the beginning and end at best. The biggest problem, however, is the plot. In the middle, as mentioned, things fall apart and this is certainly evident in the plot. Overly convoluted and hard to follow, RockNRolla may be wildly entertaining, funny, and British, but its plot needed somebody far smarter than I to fully comprehend all the moving parts, especially since the film itself seems uninterested in telling its story. That said, the characters are terrific, but the film needed to be more focused. RockNRolla is a funny and fun film, but would have benefited from a better story."
    },
    {
      "rating": "6",
      "text": "Scattershot and confusing narrative notwithstanding, \"RocknRolla\" still clearly represents a well-crafted return to form for Guy Ritchie and an excellent mosaic of side-splittingly funny performances."
    },
    {
      "rating": "6",
      "text": "I enjoyed the movie but I have to be just. The plot was moronic and the characters all one dimensional. The only thing it had going for itself was style. There were a few good scenes but they weren't enough to rescue the movie."
    },
    {
      "rating": "6",
      "text": "This is a typical Guy Ritchie film. With a wide range of characters and some very powerful performances to random shots making you wonder where the story is headed but just in time to converge in one final showdown leaving you with just word.. WOW!! I can't help but compare it to SNATCH..as they are similar in so many ways...but SNATCH was much more intense, funny and a better script."
    },
    {
      "rating": "6",
      "text": "Old school.\r Rocknrolla to film przeciętny choć ogląda się go bardzo dobrze. Największą bolączką tego filmu jest fakt, że nie ma w nim NIC oryginalnego. Chodzi mi tu oczywiście o poprowadzenie akcji, żarty oraz montaż. Wystarczy obejrzeć Przekręt (tego samego reżysera), żeby zobaczyć masę podobieństw. Mi osobiście film kompletnie nie podszedł, ale widzę, że opinie są baardzo podzielone. Zatem oglądajcie!"
    },
    {
      "rating": "4",
      "text": "With \"Revolver\", Ritchie made one of the most intellectually profound movies ever. Unfortunately, this seemed to alienate most of his fans (who like him for his action comedies), making his best movie also his most despised movie.\r With \"RocknRolla\", Ritchie returns to his roots. The problem with that is that this movie is not as fast-paced as it needed be, not as funny as it should be, nor as innovative as it could be and therewith totally felt lacking of anything worth grabbing my attention.\r After being copied over and over by various directors during the early '00s, the style that made Ritchie famous gradually became repetitive and dull. While \"Revolver\" offered a whole new dimension to the genre by replacing most of the humor with philosophy and symbolism, \"RocknRolla\" felt like a rather soulless attempt in the exact opposite direction. It felt uninspired and rehashed, leaving me constantly longing for more.\r The only thing this movie adds to his older work is a bit of fan service to his gay audience, which by no means added anything of value to the average straight guy. Watching this movie and his later Sherlock Holmes movies, I'd say Ritchie sold his soul to commercialism and gave up trying to be an artist."
    },
    {
      "rating": "0",
      "text": "Una gran película desde el inicio hasta el fin. Cosa rescata ble la actuación, la historia y especialmente la música. ,,,,,,,,,,,,,,,,,,,,,,,,,,MMMMMMM"
    },
    {
      "rating": "8",
      "text": "It's pretty simple. If you like \"Lock, Stock\" & \"Snatch\" then your pretty much guaranteed to like this. Richie basically plays the same cards, but in doing so, you know what your going to get. As always, it's a fun ride and you will like the characters as well as the dialogue. This movie seems to be a little more stylish then his others. Maybe a little more \"grown up\" for lack of a better phrase. Put it this way: at the end, there's a hint to a sequel. I'm looking forward to it. Although it didn't do that well at the box office, so I wonder if that will actually happen. I hope it does."
    },
    {
      "rating": "8",
      "text": "This was pretty fun, although Thandie Newton reinvents the concept of \"dry\" in this. Anyway, I don't understand why Toby Kebbell (Johnny Quid) isn't an international superstar. He steals just about every movie he's in (Control, and Dead Man's Shoes with the equally great Paddy Considine, who is Britain's best actor right now)."
    },
    {
      "rating": "8",
      "text": "Come on, it's a really funny, exciting movie, with a awesome sountrack."
    },
    {
      "rating": "5",
      "text": "Its all following a formula its an expensive object some amount of money several gangster groups that fight for those two there also some other nationality involved so there is a different theme each time what else?oh the drug addict who screwed things up.etc You get the picture.Though i guess would rate it more there weren't any lock stock and 2 smoking barrels or snatch."
    },
    {
      "rating": "9",
      "text": "Now that Madonna has left Guy Ritchie returns to form and does here what he does best. If you liked Lock, Stock and Snatch you'l like this one as well. I've only seen it one time but it looked brilliant and I think the humor is even a tad different from the previous outings. Comes very highly recommended for fans of the genre."
    },
    {
      "rating": "9",
      "text": "I'm'a have to give Rowan F a high 5 here, its a fabulous film, one of the most enjoyable action films of the last few years, captivated from start to finish and left satisfied!"
    },
    {
      "rating": "8",
      "text": "I thought this movie was awesome. It had a lot of build/set up where I was doubting that the payoff would be satisfying, but all of a sudden this movie takes off to the Guy Ritchie storytelling we all know and love. Some really good sub plots and characters and some that would have been better left on the cutting room floor. Either way, I'm ready for more! Keep 'em coming!"
    },
    {
      "rating": "10",
      "text": "Guy ritchie is back with a true badass movie. After very weak Revolver when everyone thought Guy Ritchie lost his breath after Snatch this great movie came up and its just excellent. I cant wait for DVD."
    }
  ]
}