{
  "id": 2106,
  "title": "Rocky II",
  "starring": [
    "Sylvester Stallone",
    "Talia Shire"
  ],
  "runtime": 119,
  "genre": [
    "Drama"
  ],
  "description": "After Rocky goes the distance with champ Apollo Creed, both try to put the fight behind them and move on. Rocky settles down with Adrian but can't put his life together outside the ring, while Creed seeks a rematch to restore his reputation. Soon enough, the \"Master of Disaster\" and the \"Italian Stallion\" are set on a collision course for a climactic battle that is brutal and unforgettable.",
  "releaseYear": "1979",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nzc3igMZaESMLYk85iGTYafWRQl.jpg",
  "categories": {
    "plot": 8.555555555555555,
    "acting": 8.428571428571429,
    "ending": 9.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 10.0,
    "action": 8.533333333333333
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Second chances don't grow on trees, right? If one is presented, you have to find the necessary motivation, right? Something that we should be thankful for is that Stallone knew the right way to create a sequel that could well be unnecessary. As is the custom, the best part comes in the last minutes, and in what form."
    },
    {
      "rating": "8",
      "text": "Rocky II follows on from the legendary first part. In my opinion, two is also better. The rest stretches in a similar style. Have a good workout and show people that you just have it and that nothing will stop you. I won't say more about that. Great movie for me, which I recommend."
    },
    {
      "rating": "8",
      "text": "A more than solid sequel to the famed original.Follows the same formula for the most part as it's predessor and does it well."
    },
    {
      "rating": "3",
      "text": "O primeiro \"Rocky\" não é um filme extraordinário, mas ao menos trouxe algo de novo. Sinto que esse aqui abusa do legado do antigo, e cai naquele vicio de tentar potencializar o que já deu certo. Nem preciso dizer que deu errado. Muito errado.O primeiro filme também se esforça para desenvolver seu personagem, mas aqui, como eu disse acima, tudo aprece ser potencializado. Ao invés de ter um personagem lento, temos um personagem burro. Ele aguentava porrada antes? Pois então, vamos fazê-lo ganhar uma luta só tomando soco na cara, com a base pra baixo, em 90% da luta. Ele tá sofrendo com a pressão pós luta? Vamos pôr uma pra de caras falando merda pra ele. Tipo, é tudo tão obvio que perde qualquer tipo de senso. Não dá pra se emocionar, se identificar, nem mesmo torcer, pois se eu tinha duvidas antes, agora tenho certeza que Rocky é um péssimo lutador.E ainda tem mais, o filme se aproveita do sucesso passado, revivendo cenas e musicas do anterior. O que parece legal a primeira instancia, mas aspira falta de criatividade e preguiça. Outra coisa mal feita foi a transição de tempo, onde numa cena eles estão grávidos, e poucas após já está em trabalho de parto.Enfim, isso que dá por o protagonista para dirigir e roteirizar o próprio filme. Isso é ilógico e cega qualquer um.Audio: English, with Portuguese subtitles. Q60T TV SpeakersQuality: 1080p SDR [Netflix]"
    },
    {
      "rating": "10",
      "text": "Rocky II follows on from the original, directed by Stallone in 1979 it bares some contrasts to the original... Sylvester Stallone and Carl Weather's are in the hospital all mashed up from the first fight, Carl Weather's who plays Apollo Creed is in a wheelchair asking Stallone's character for a rematch....Rocky II has many great moments like the training at the end before the fight after Rocky's wife says WIN, also Rocky working in a meat factory before getting fired and doing silly aftershave commercials which are hilarious, him and his wife buying a new house and taking a walk through the zoo in the snow after Rocky is released from hospital, Rocky driving around in a new car which he eventually sells on, Rocky's wife slipping into a coma, just great moments after another... It's more or less similar to the original but Rocky II has more to offer, some newer ideas in there and seems more charged than the original and the rematch at the end certainly beats the fight in the original with the tempo of the fight at a faster pace and more brutal... Rocky II stars Sylvester Stallone, Burt Young, Carl Weather's, Burgess Meredith, Talia Shire and is a sports drama... Definitely the best Rocky movie in the series and beats the original so check out Rocky II... Excellent film even if Stallone seems very wooden at times."
    },
    {
      "rating": "7",
      "text": "Pretty good follow up to first film, takes a while to get going but pays off in the end."
    },
    {
      "rating": "10",
      "text": "This sequel tops the first one, this one is about trying to make a living. This is one the best sequels. Great job that Stallone has made."
    },
    {
      "rating": "10",
      "text": "Very similar to the first Rocky, that was already very good: The story around him as a character is perfect, also the performance of Stallone. I had fun with the humour and liked to see some background information of boxing. But the fighting scenes are ridiculous again, fortunately this part is less than in the first part. Technically it is better of course, so yes, I prefer this sequel."
    },
    {
      "rating": "8",
      "text": "The sequel is a bit weaker but still a good movie in the franchise. It starts directly after Rocky ended. While initially neither Rocky nor Apollo want a rematch Apollo has lurking doubts. Rocky has proven to be worthy and maybe a superior rival or at least hurt his confidence and pride. Many people even claim that Apollo or his staff manipulated the results of the fight. Meanwhile Rocky just wants a normal live with Adrianna. There is a quote in a later Rocky movie that life hits harder than any enemy could. This is shown here as Rocky (and Adrianna) struggle. He won the fame and respect but it is fast forgotten and society barely cares about yesterdays heroes. However it would not be a Rocky movie if there would be no rematch, harsh training and resolve. Again I like the relatable real live problems even when they have less of an impact than in the prequel. I must also praise the final fight as it is again intense and engaging. The cast is great again. Rocky, Adrianna, Mickey and Apollo are great in their roles. No missteps here. In my Rocky review I missed talking about the soundtrack. Maybe it is given for me that there are timeless classics. For me all Rocky movies have great soundtracks and we are not even at “Eye of the Tiger or “Burning Heart” by Survivor. But back to this movie. Overall they used the Rocky formula and made an enjoyable movie. It has not the same impact and creates not the same amount of emotions but that means not that it is garbage or even below average. It is worth watching and rememberable."
    },
    {
      "rating": "7",
      "text": "Though the performances are great, Rocky II's average writing and bland direction cause it to fall short of it's legendary predecessor."
    },
    {
      "rating": "9",
      "text": "Satisfying SequelThough not quite as good as the original, Rocky II is still a great film."
    },
    {
      "rating": "9",
      "text": "Rocky II. Go Italian Stallion! It’s not often my films shiver all over my body and this movie is now one of them. A very strong sports drama and after the first part it looks more serious. The last minutes of the film even shed a tear."
    },
    {
      "rating": "6",
      "text": "i did it..Rocky IIIt always is tricky and a huge risk to create a sequel and live up to the expectation especially when the first one is loved worldwide to this level and acclaimed by the critics and they did it, again; its just as good as the first one. Rocky II is sensationally upbeating and exhilarating with enough content for 2 hours of runtime; even though being predictable, is still fun and filled with all the clichéd drama. Sylvester Stallone's smart idea by picking it up right where it was left off works as a charm and gives enough depth to the characters and the plotline. And he stretches himself too, as a director and writer but also as an actor giving enough range to stage himself up along with a great supporting cast. Rocky II connects with the audience more than the previous one allowing the audience to root and even cheer for the protagonist which shows the excellence of the director on execution but again the choreography seemed a bit loose."
    },
    {
      "rating": "8",
      "text": "You never stop rooting for Rocky. It's still the best underdog story, not the best sequel, but good."
    },
    {
      "rating": "8",
      "text": "Decent sequel amazing movie!it was emotional,intense and dramatic with jaw-dropping and nail-biting end!the music was phenomenal,the story was amazing and screenplay too,the acting was iconic the Mickey's character is pure legendary he's dedication to train rocky and there relation was Great,the Apollo was amazing,the family members were great.the starting flash-backs of last match then the wedding of rocky and Adrian then there new journey it was amazing,the retirement thing of Rocky resulting in work with advertisements and all then the whole language shaming thing it was sad then the whole struggles of daily-life and Rocky trying everything to get a job,after failing then his wife doing job while in labor and after a while the disagreement on Rocky fighting all that conflict resulting in the tragedy was literally emotional and heart-breaking the Mickey's and rocky's emotions were hitting hard it was amazing moment,the mickey's dedication was literally on another level his presence in screen is literally magnetic.after the recovering from tragedy the baby's scene was adorable and sweet.the Apollo's obsession of kind-of losing to Rocky and wanting a rematch resulting in disgusting tactic for inviting a rematch then the whole training scene of rocky it was pure majestic and amazingly iconic,then the last act was literally masterpiece,the rematch just like last one 15 rounds full of adrenaline rush fight with one round for Apollo and one for rocky the juggle the punches and all it was literally Nail-bitingly intense and mind-blowing it was amazing fight then the ending with respect for both it was satisfying and great,the whole movie was emotionally,dramatically amazing the build-up was great with decent story and the ending with a blast it was amazing movie!"
    },
    {
      "rating": "10",
      "text": "Excelente secuela con una buena combinación de Drama, deporte, romance y un toque de comedia. Recomendada."
    },
    {
      "rating": "10",
      "text": "Rocky II was made in 1979 and Stallone directed it as far as I know, it's the continuation, sequel or follow on from the original Rocky movie... Rocky II see's the return of Talia Shire, Burt Young, Burgess Meredith, Carl Weathers and of course Sylvester Stallone.... To me Rocky II is a bit like the original but added more fun to it and there's scenes like Rocky (Stallone) and Adrian (Shire) walking through or near the zoo with snow on the ground and a tiger. We also see Rocky and Adrian getting married I think, Rocky doing some television commercial stuff involving aftershave, looking for work, training, driving around in a car, buying stuff, doing part time work in a meat factory or something and Adrian (Talia Shire) slips into a brief coma with Rocky (Stallone) praying she wakes up and seeking solace in a church and also the birth of their son happens. We see a great training scene when Rocky has to catch a chicken and he says to Mickey (Burgess Meredith) \"I feel like a Kentucky fried idiot\" which is pretty amusing. Basically this film is better than the original and offers more in terms of entertainment and the fight at the end is even better than the original. Great acting by everyone involved and the chemistry between the actors is great and Rocky II is about Rocky's rematch with Apollo Creed (Carl Weathers). Great film and in my opinion best one in the whole series."
    },
    {
      "rating": "8",
      "text": "Rocky II is pretty much the same like the first Rocky until the last 45 minutes where it gets a bit better, and especially the main event, the second chapter of Apollo Creed vs Rocky Balboa was shot better, made better, the choreography was better, and the fight itself was better and actually get me excited, more exciting than the first fight, so overall Rocky II still have some cheesy part, slow part, but Rocky a bit more charming relationship with Adrian also made Rocky II a better film and a good sequel, and i'm hoping it's getting better."
    },
    {
      "rating": "5",
      "text": "This was such a rehash and nearly beat for beat remake of Rocky I that it was little unsatisfying, even with an improved training montage and wonderful Apollo/Rocky stuff."
    },
    {
      "rating": "8",
      "text": "Even though the second installment is fairly similar to the first, the film manages to maintain some credibility. The movie moves a little more slowly than its forerunner, but it won't keep you from enjoying it. Even though the film lacks the depth of the first half, it is nevertheless a worthy and excellent sequel. The movie's screenplay is solid, but it slows down a bit in the middle. Both the music and the direction are excellent. Burgess Meredith and Sylvester Stallone both played their parts admirably, and the rest of the cast was as sincere. You will undoubtedly be entertained by the film, which is deserving of the label of sequel."
    },
    {
      "rating": "8",
      "text": "A great follow-up to 1976's Rocky, this movie has some really great moments and some fantastic acting. Although I do feel like it drags here and there, but nothing to ruin the film."
    },
    {
      "rating": "7",
      "text": "Rocky II se siente como una extensión de la primera y que extiende la franquicia de manera más lógica que sus secuelas posteriores, las actuaciones son buenas y por fin Rocky recibe su recompensa"
    }
  ],
  "recommendations": [
    "creed_ii",
    "rocky_iii",
    "creed",
    "rocky_v",
    "spider_man_far_from_home",
    "mission_impossible_rogue_nation",
    "top_gun_maverick",
    "rocky",
    "the_magnificent_seven",
    "captain_america_the_first_avenger",
    "brick_mansions",
    "captain_america_the_winter_soldier",
    "back_to_the_future_part_iii",
    "mission_impossible_ghost_protocol",
    "indiana_jones_and_the_temple_of_doom",
    "black_widow",
    "rocky_iv",
    "thor_ragnarok",
    "unstoppable",
    "angel_has_fallen",
    "john_wick_chapter_3_parabellum",
    "spectre",
    "top_gun",
    "american_made",
    "true_grit"
  ]
}