{
  "id": 3382,
  "title": "Rocketman",
  "starring": [
    "Taron Egerton",
    "Jamie Bell"
  ],
  "runtime": 121,
  "genre": [
    "Music",
    "Drama",
    "History"
  ],
  "description": "The story of Elton John's life, from his years as a prodigy at the Royal Academy of Music through his influential and enduring musical partnership with Bernie Taupin.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/f4FF18ia7yTvHf2izNrHqBmgH8U.jpg",
  "categories": {
    "plot": 7.896551724137931,
    "acting": 8.355555555555556,
    "ending": 7.777777777777778,
    "soundtrack": 7.46875,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.5,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Where's the band???  Guitarist Davey Johnstone, Drummer Nigel Olsson, Percussionist Ray Cooper, etc. --- guys who have toured with Elton for more than 40 years are quite literally non-existent.  The director seems to go out of his way NOT to show Elton with his band. One gets that Rocketman is a self-obsessed, self-portrait and isn't  primarily about the making of music.  Nevertheless, you would think that anyone important in Elton's life during that period would (at least ) appear in a cameo of sorts.  Yet throughout the 2-hour Rocketman film we catch not a word from --- nor even a glimpse of --- a recognizable band member. Instead Elton is occasionally seen solo at the piano, or more often on his feet surrounded by a motley cast of dancers, looking very un-Eltonlike.   Sadly, one is left with the impression that the band means nothing to Elton.  Nor does Elton ever seem to have any connection to his audience."
    },
    {
      "rating": "1",
      "text": "I'm a fan of Elton from way back and was hoping this might be similar to the recent Queen movie... sadly it does not live up to the hype. You are drug down into the seedier side of sexual confusion, substance abuse, and poor management, and there isn't much relief. you leave the theater a bit depressed, plus the musical parts were not even very good and did not feature some of the key songs you might expect."
    },
    {
      "rating": "8",
      "text": "TL;DR - The most shocking thing for me is even though I am a huge Queen fan and my knowledge of Elton John's work stops at Lion King, I still enjoyed Rocketman more as a movie. Taron Egerton is absolutely captivating in his portrayal along with stellar editing and writing makes the Biopic/Musical a worthwhile watch.  My lack of knowledge for Elton John's timeless work and personal life definitely had a lot of impact on my enjoyment and I assume is why I loved this movie much more as a work of semi fiction over a true fan or follower hoping to see his true life story.The GoodI was far more astonished at my own reaction for this film than you can ever understand. Even though it has some of my most hated movie elements; i.e, family drama, A Musical, sleazebag love interest and many more all of these elements are held up with good writing, beautiful cinematography, an understated excellence in performances creating something more than any genre tagline I can label. Everyone in this movie bring their 'A' game which helps propel this well written story ahead of the pack of generic Biopics, the editing definitely helps but the strong dialogue writing makes the character interactions some of the most powerful scenes in the movie. Particularly the ending left me with some good food for thought as we see Taron Egerton make his concluding steps to the end of his character portrayal.The BadBut as no movie can be perfect there were quite a few gripes I had with this movie, very, very minor gripes in comparison to the good entertainment value this film provides us. A few places the pacing seems to dwindle a little too much, the sleazebag manager/lover could have benefited from better character writing and a little more emphasis on the best part which is Elton John's interaction with his friends and family would have helped.Even though the character/friends and family interactions were the best part of the film it seems to lack a little, slightly over-shadowed by a few too many musical numbers. Some quieter more dialogue based character development scenes over certain Musical numbers was necessary to make this a tighter and more streamlined experience."
    },
    {
      "rating": "6",
      "text": "The predominant style over substance approach only works partially in this half biopic half music video take on the life and career of Elton John. I left the theater with a smile on my face, but also wishing that those brief moments of brilliance had carried on throughout."
    },
    {
      "rating": "1",
      "text": "A steaming pile of dog turd compared with Bohemian Rhapsody. I will never get those two hours back"
    },
    {
      "rating": "10",
      "text": "Would the Academy award an Oscar to an actor playing a famous musician 2 years in a row? Because Taron Egerton certainly deserves it. He not only captures Elton John's swagger and sounds great (that's him singing), but he also brilliantly and touchingly conveys the demons that haunted the singer. That was my one surprise/complaint: this was more a drama verging in tragedy. Still, director Dexter Fletcher's vision to present John's songbook as part of the narrative is masterfully presented, even sometimes moving. There's plenty of information to qualify as a biopic, but the creative, artistic approach elevates the film to a magical movie musical."
    },
    {
      "rating": "5",
      "text": "I pulled my original review and am posting this because I've grown more and more annoyed by this disappointment.  This film boils down to this tagline:  \"My life was unbelievably miserable & I had no fun being Elton John... THE MUSICAL.\"I'm a lifelong 47 Year Elton fan. I've been through thick and thin with him.  Comebacks and misfires.  When he went into recovery he was very happy to tell people two things:  1.)  I did a lot of booze, drugs, bulimia, shopping & 2.) A lot of my music suffered because of it.As this movie liberally rewrites history, so does Elton with this type of comment.  \"Oh?  You didn't like LEATHER JACKETS?  Me neither.  But I was so drunk then, wasn't I?\"  Isn't that a little too simple?  Too easy?There's something wrong with this movie underneath the surface.  In a weird way it's like yet another career suicide attempt, where the movie tries it's hardest to kill that happy place you had for this man's better music and happier moments.Please understand.  I'm not seeking a Disney version of his story.  I'm an ugly truth guy.  I actually despise most Disney films.  But two hours of whining does not an entertainment make.  If this film had included a third hour -- full of happier moments, comebacks, triumphs, finding the love of his life, adopting kids -- THEN you'd have something.  And if the real events were married to the real music of that moment you'd have something wonderful.As this film stands -- I can't tell a soul to see it.  They'd have no idea why I recommended the man or his music.  If you want to see a great 'film' about Elton John sit down, close your eyes, and listen to GOODBYE YELLOW BRICK ROAD from beginning to end."
    },
    {
      "rating": "6",
      "text": "Elton John is a musical legend and he had so much potential to have an unbeatable biopic but a lot of its potential was wasted in musical numbers. The exploration of his sexuality and substance abuse was so magical that it gave me chills but some of the film, especially the beginning felt way too much like a Disney musical. I did like some of these musical scenes but I would've preferred if half of them weren't there. Taron Egerton played the role so beautifully and gave Elton's discography such a smooth twist. Overall this movie is average, It's flaws hurt a lot of the beautifully executed parts."
    },
    {
      "rating": "10",
      "text": "Great Songs, Great Visual, Great Actor Play, Great Movie!I'm reccomend necessarily to view!"
    },
    {
      "rating": "10",
      "text": "As a long time Elton John fan, I was hoping that this movie would not disappoint. It did not! It exceed my expectations in regards to the imagery, musical score and acting. All were top notch. This is not an auto-biography. This was not a puff job or vanity piece. Instead, it is a reimagining of key events in Elton’s life “with embellishments”.It’s a shame that Rocketman opened the same weekend as Godzilla (and a weekend after the successful live action Aladdin) movies. Both films had boffo box office numbers with their key demos - young adults & families. However, I suspect Rocketman will still be playing in the theaters long after these movies have been replaced."
    },
    {
      "rating": "9",
      "text": "This is my favorite biopic about a musical artist. Rocketman is a movie that everyone should see. Please do so."
    },
    {
      "rating": "6",
      "text": "For my money, “Straight Outta Compton” is still the musical biopic to beat, but major props to this film for striving to be different. It’s much more of a stage musical than anything we’ve seen in this genre before, and Egerton is an entertaining Elton John."
    },
    {
      "rating": "4",
      "text": "One of the \"lesser\" musical biographies I've seen.  If you're  going to strive for a true musical, like this one does, you  have move the audience, and Rocketman simply doesn't.  Sure, you get Elton John's life story (with a tragically truncated last 15 mins or so), but there's nothing really compelling about it.  Nothing that a regular fan can sympathize with. I wish they'd have rather just done a straight drama with Talon playing Elton.  The \"musical\" element was lost on my completely."
    },
    {
      "rating": "6",
      "text": "The musical biopics are still going strong, with the immense success of Bohemian Rhapsody it’s no surprise Elton John has hopped on the bandwagon and this is just the beginning. Give it a few more years and there’ll be a biopic for every major artist, wait for it. I’ve nothing against these fairy tale biopics, though it would be nice to have a few documentaries to go along with it. We know a lot of Bohemian Rhapsody was made up or at the very least a lot of the more risky aspects of Freddie Mercury’s life were either downplayed or left out completely. Although Rocketman doesn’t hold back in many ways it also appears to be a work of fiction, entertaining yes but accurate? I doubt it.You can let that bother you or you can just make the decision to get over it and accept what Rocketman has to offer. I didn’t believe half of it but it’s still very entertaining, for me it wasn’t quite as enjoyable as Bohemian Rhapsody (Yes I loved Bohemian Rhapsody, get over it) but Rocketman plays a lot more like a musical, a fact I did not know beforehand so I was surprised when the entire ensemble breaks into full musical numbers at every opportunity. Once the shock of that is over you eventually come to expect this every fifteen minutes or so. Dexter Fletcher did well to take on Bohemian Rhapsody and he was the perfect choice to direct Rocketman. It’s also not just about the song writing process but uses as many songs as possible to move the plot along, it’s very much incorporated into the film and it works because who doesn’t love a bit of Elton John? One thing is certain, Taron Egerton knocks it out of the park. I was more than sceptical when I heard he was using his real voice and not miming but those fears melted away very quickly and no doubt they’ll be some Oscar buzz around his performance next year. Or at the very least they should be sure to give a nomination to the fabulous costumes, some of which are used for only a moment, I can’t imagine all the work that went into that. The musical biopics will always do very well because of one simple reason, the music. Queen, Elton John, choose the right artist or band and as long as you have a director who knows what he’s doing, a cast who are passionate about the project then there’s no reason why it shouldn’t be a massive success. Recommended for all the Elton fans."
    },
    {
      "rating": "1",
      "text": "Just a waste of time. From all the recent movies about musicians and bands this one is the worst."
    },
    {
      "rating": "10",
      "text": "One of the best musicals of the year, the movie has the amazing songs of Elton John, incredible actors and the story touches you. Taron Egeton shines in this movie and show us that he really is triple threat. The art direction is pretty good, the scenes are very well made and they make refferences to the art history. The movie is not afraid of showing the sexual life of elton and it does that in a very artistic way. Some characters could have a better plot, but nothing is perfect. In the end rocketman is a movie that reach it goals: lift off"
    },
    {
      "rating": "3",
      "text": "As a fan of Elton John, I'm enormously disappointed by Rocketman. And it has nothing to do with Edgerton.  He's the best part of the film - and Jamie Bell is really good, too.  The film is just terribly boring.  And if you're coming for the songs, you won't hear 'em!  Just bits and pieces of \"versions\" of the songs you know and love, but nothing that grabs you by the throat like his songs do.  And yes, it devolves into yet another addiction story that leaves us behind.  The best and only \"real\" moment in the film is when he goes back to visit his father (and half-brothers) to give him a gift and is essentially rebuffed. That had real emotion and pain to it.  The rest of the film is all gauze and wanna-be musical nonsense.  If only this film had one tenth the feel and heart of the \"Tiny Dancer\" scene in Almost Famous, they would have had a passablly good movie here. But no.  I'm shocked to be writing this.  And I'm guessing that the professional critics giving it the the  50 range are just scared to call a spade a spade and throw down some red scores. Ugh.  SO disappointed."
    },
    {
      "rating": "4",
      "text": "Bohemian Rhapsody was the best movie last year.  I gave it a 91.  I'm giving Rocketman a 45.  Rocketman is basically a broadway show where they will breakout into song or dance at any time like Fiddler on the Roof.  BR on the other hand made you feel like you were watching actual documentary about Queen.  In BR you truly cared about his love interests.  In Rocketman, they are just kind there on screen for a sec and then off screen for good. My friend loved Rocketman though."
    },
    {
      "rating": "6",
      "text": "I love music but I hate musicals.    Always have.    So \"Rocketman\" on that level does nothing for me.    Let's look at the problem with a film that tries to be a bio but insists on inserting the usual \"musical\" interludes with big productions, seemingly coming out of nowhere, bad edits of some of rock's greatest songs of all time, and next to no real focus on John's and Taupin's songs as far as inspiration, the story behind some of the songs, and again poor editing that cuts some of the songs in the worst possible places.    The other problem as a musician myself is how the film's directors and Elton himself as Executive Producer saw fit to totally ignore his band of those glory years, not even mentioning them by name.    So I will.    Where is Davey Johnstone, Elton's superb guitarist, who contributed the tough edge of the music and great rhythm work on John's remake of The Who's \"Pinball Wizard\" or the furious guitar on \"The **** Is Back\"?    No mention of him, bassist Dee Murray or drummer Nigel Ollson.    Not a very nice thing to do to a faithful band if you ask me.    The attention given Bernie Taupin was certainly important because he was and for all I know is a gifted lyricist who had a knack for putting into words a lot of the angst, personal strife and emotions of John's life.    And the forays into fantastical episodes such as the scene in L.A.'s legendary Troubadour Lounge where Elton John made his first U.S. appearance and featured part of \"Crocodile Rock\" and everybody on the floor floating around I found overblown and silly.    What those scenes were trying to do was to mythologize the man to ridiculous degrees.    He was already a mythological figure without resorting to unnecessary production numbers that only slowed the story down.    But not all is lost.    When the film stays focused on the real life and times of Elton John from childhood to superstardom, Taron Egerton does a great job as John.    He indeed does a good job singing, although I would have preferred Elton's own vocals, as was the case with \"Bohemian Rhapsody\" and just some straight numbers without the song and dance routine.    Like so many other icons in the entertainment industry, who are surrounded by sycophants, money grubbing thieves and hangers on all leaching the blood out of said performer, Elton John too suffered from the usual drug and alcohol addictions, struggled with his homosexuality at a time when it was indeed risky to step out and declare himself gay.    All in all, if you like the musical format you'll find this a better film than I did, but it isn't bad by any stretch.    It just irks me that the band itself was totally left out of the film.    Of course Elton is sober now and has been 28 years, good for him.    He and his husband have been together for a very long time and he has donated $450 million dollars to HIV/AIDS research worldwide.    That is a lot of money and Sir Elton is to be commended.    An up and down bio-pic aside, Elton John was one of the great rock and roll performers in history, wrote some of the most beautiful music ever created in a pop setting \"Goodbye Yellow Brick Road\" my favorite tune of his that is on a par with timeless classics of anything by the Beatles, and even tunes that will always be with us like \"Over The Rainbow\" or \"When You Wish Upon A Star\", which were enormously popular tunes in their day and rightfully so.    Sometimes the world gets lucky and perfect or near perfect music is bestowed upon us destined to last forever, like some of the classical bits Elton practiced as a youth."
    },
    {
      "rating": "6",
      "text": "Rocketman is a very good biopic about the early life of rock musician Elton John. While the film does a very good job replicating the story, it gets docked a few points for having the various musical scenes, which makes it play out more like a Rogers and Hammerstein play than a biopic. It's worth seeing, but be prepared for some off-kilter plot devices."
    },
    {
      "rating": "7",
      "text": "Interestingly enough, this film was directed by a guy named Dexter Fletcher (who stepped in to finish directing 'Bohemian Rhapsody' after director Bryan Singer was fired from that film), so I was interested to see how this film would compare and contrast to the style of that film. But overall, I must say that it's a fun biopic of Elton John, albeit a pretty standard and predictable one that does mirror the style of 'Bohemian Rhapsody' a little too much for my liking at times. It also felt constructed more like a Broadway Mlmusical often times, as characters would suddenly break into song and dance throughout much of the film, so it made me feel as though Elton John's life maybe would've been more interesting and compellingly told through a stage or Broadway musical rather than just another film biopic. Nevertheless, Taron Egerton was absolutely perfect as Elton (and if you ask me, he even gives Rami Malek's Oscar-winning performance from 'Bohemian Rhapsody' a run for its money!) He not only looked quite a bit like him, but had such great emotional, musical, and singing chops from start to finish! He's by far the main reason to check this out, otherwise it's pretty much what you'd expect from a musical biopic, but is still fun and charming enough."
    },
    {
      "rating": "10",
      "text": "It was everything I was hoping it would be. Great performances, excellent music even if some of my favorites were a bit truncated I expected that. The costumes, the production design, the choreography, the way the story was told were all very good. Anyone who likes 70's pop music should see this. It IS a musical. Don't expect rigid biopic formatting. There are liberties taken, but they all work in the fantasy element of the film. I will make an effort to see this again and I rarely go to the cinema."
    },
    {
      "rating": "10",
      "text": "Outstanding!!!! This movie is everything I had hoped and more! Taron is amazing! You forget that it is not Elton on the screen! Thank you for making an amazing biopic of a living legend.... and giving it all of the truth and fantasy that we would hope for in an Elton John story! Do not miss this outstanding film!"
    },
    {
      "rating": "10",
      "text": "Although I was \"of age\" during the early years of Elton John, I wasn't his biggest fan. After falling in love with Bohemian Rhapsody last year, I went into this movie without expectations.  In my opinion, Rocketman surpassed B.R. by far.  I'm not a fan of musicals, but this was entertaining, moving and inspiring.  I walked out of the theater wanting to go home and forgive those who treated me badly throughout my life and to love myself.  This was not just a movie, it was an experience that touched my soul.  That's huge!"
    },
    {
      "rating": "0",
      "text": "\"Where Rhapsody tiptoed into Freddy Mercury’s complex sexual life, Rocketman jumps into Elton’s with both feet and a hammer.\" No thanks."
    },
    {
      "rating": "8",
      "text": "Magic! Whimsy? Reality? Fantasy? Truth? \"Rocketman\" is all that plus more with a screenplay by Lee Hall, direction by Dexter Fletcher, director of photography George Richmond, not to forget the costumes by Julian Day as they reach into the life of Elton John with a not to be forgotten performance by Taron Egerton as the star.Opening up so soon after the massive success of \"Bohemian Rhapsody\" this movie has to do a lot of business to match it financially though the bottom line is \"Rocketman\" is a much better movie showing who the man is including all the bad out front and not being shy either about his addictions or his Gay life. At the very beginning we see Elton in a massive devil's outfit invading a rehab center and talking about his coke, crack, sex, shopping weed, alcohol among various addictions plus his bulimia and anger issues. It is at this point the fantasy musical numbers start along with his life before he became famous and the years that established him as a star up until he makes the decision to stop the drugs and booze.Targon Egerton is stellar as John Elton using his own voice to sing the Elton/Taupin songs without imitating the former. He goes through a heart attack, an attempted suicide (fantasy or truth?), loving people without the love being returned. He has a mother who tells him she wishes he had never been born, that because he was gay he would never be loved, a father who never hugs him and one day just leaves and never comes back, a lover/manager who doesn't love him, cheats on him and his feeling that he doesn't deserve to be loved. Matthew Illesley does a fine job as the child Reginald Dwight as does Kit Connor as the teenager Reginald, both to become the Elton John who is in so much pain as a young man.The one man who loves Elton John is his working partner, Bernie Taupin the man who wrote the words and still does and they both claim not to have had an argument in those 50 years, is not gay. He is played by Jamie Bell who deserves as much recognition as Egerton does. A third person who gives an explosive performance is Richard Madden as a self-serving manager and lover who betrays John in many ways.Playing his mother Bryce Dallas Howard comes over as too stereotyped in some of the scenes and Steven Macintosh as the cold father who doesn't love his son coveys that cold man while Gemma Jones as his grandmother comes across as the only adult who loves and believes in this child.There are several supporting actors who deliver the goods but it is Targon Egerton the whole movie revolves around and whose performance makes the \"Rocketman\" an outstanding movie. While there may be one too many fantasy song and dance numbers slowing the movie down the very effective ending will touch you just as it touched many in the audience today to applaud the movie. Be sure to stay for the ending credits for the happily ever after ending even Hollywood couldn't improve on!"
    },
    {
      "rating": "2",
      "text": "i was really expecting more music and a different movie all together,,,too many gay moments ,,more of a movie for gay people and not the 95% that are not gay,,,,just another example of the gay society trying to push gay choice on us rather than to let us decide for out own,,,,i mean there were parts in the movie where we get it that it was a gay moment but they really showed way too much gay scenes just like when gay people make out in public just to cause attention to themselves ,,this movie overloaded on that ,,Bohemian Rhapsody did it right ,,,"
    },
    {
      "rating": "8",
      "text": "This Movie is Based On Elton John's Story, My Favourite Song from Movie Is I'll Still Standing Because It's Really Rockin'& So Smooth So Much, It Made Me Dance, I Love this Movie So Much"
    },
    {
      "rating": "10",
      "text": "Elton John has had a career that has spanned decades, millions of albums sold, packed venues, awards, and more than a few headlines. In the new film “Rocketman” audiences get a look behind the man thanks to the amazing and Oscar worthy portrayal by Taron Egerton.The film opens with a flamboyantly dressed John entering rehab in one of his stage costumes. As he opens up with his group, he shares the story of his childhood as a shy child who is desperate to have his father show him any signs of approval or affection.When it is discovered that he has talent with the piano; his grandmother encourages him and even takes him to apply for a position at the Royal Academy of Music.His mother (Bryce Dallas Howard) is moderately supportive but is more focused on her social life brought on by her failing marriage.As the film unfolds; we see Elton working in a backup band and in time answering an ad that puts him with an agent. Paired with the man who would eventually change his life; Bernie Taupin (Jamie Bell), Elton and Bernie combine to write a series of songs which in turn leads him to a series of gigs in Los Angeles. The film shifts into high gear at this point as we see how their music becomes a smash and leads to a series of parties, drugs, and money.Elton meets Manager John Reid (Richard Madden), who becomes his partner both socially and professionally as Elton embraces his Homosexuality which he has kept largely hidden.As the record sales and hits mount, so does the destructive behaviors which leads Elton down a destructive path that threatens everything he has worked for.The movie is a masterpiece of music and story and it cleverly uses musical montages and segments around the performances to outline various segments of his life and his rise to stardom.The performances are amazing and Egerton was simply amazing as he not only captured the complexity of his character but performed all the vocals of the hit songs himself and they were spot on.During our Press Screening I noticed many people singing along, tapping their feet, or bobbing their heads along with the music which helps to underscore just how timeless and popular his catalog of music has been as the songs have endured the test of time.The film also evokes some unexpected emotion as there were more than a few people wiping their eyes during the film which at its core is a store of a young, shy boy desperate to be accepted and loved.I truly hope the film is recognized come Awards season as it is a wonderful and memorable cinematic experience.5 stars out of 5"
    },
    {
      "rating": "8",
      "text": "The main difference between Rocketman and Bohemian Rhapsody is that Bohemian Rhapsody is a celebration of Queen's music with a focus on Freddie Mercury, while Rocketman is the story of Elton John where his music comes after the downbeat moments in his life. I think we really liked seeing how Queen came up with their songs, who wrote which favorite Queen song, and how they recorded the songs. We go to the movies a lot, so we want to be entertained. I'm pretty sure that people who don't normally go to the movies offen, will also pick a movie that makes them happy. That's why a movie about celebration will make more money than a movie about the reality of life. Somehow they make Bohemian Rhapsody upbeat even though Freddie died. Anyway, we have our own downbeat moments and we don't need to pay to see someone else's troubles.  Nonetheless, for those who want more reality, yes, Rocketman is more true to life than Bohemian Rhapsody. Rocketman is a good picture, where the focus is Elton John overcoming and surviving, and his music comes second. Considering how many musicians have died doing the same things Elton John did, it is an accomplishment."
    },
    {
      "rating": "8",
      "text": "\"Rocketman\" is a story of Elton John's life through his music.  While \"Bohemian Rhapsody\" gave a relatively upbeat examination of Freddie Mercury's life, \"Rocketman\" is more of a cautionary tale about the trappings of fame. Taron Egerton, who does his own singing, is very good.  Bryce Dallas Howard, is also worth mention for her outstanding performance as Elton's mom. \"Rocketman\" plays more like a traditional musical with plenty of singing and dancing. Unlike \"Mamma Mia: Here We Go Again,\" where the staging of the musical numbers seemed perfunctory, a lot of creativity and imagination is on display in \"Rocketman.\"  The film does an excellent job of showing the passage of time without slowing the film down with subtitles and awkward transitions. However, fans of Elton's music will probably wish they got more than short excerpts of each song. Overall, a very good biopic that avoids hagiography and cheap sentimentality."
    },
    {
      "rating": "9",
      "text": "The year's first real contender for Best Picture makes itself known in approximately extravagant fashion. Dexter Fletcher's \"Rocketman\" is a musical biopic told in a manner that just about perfectly embodies that of the film's legendary subject. It's bombastic, soulful, fierce and visually involved, surging brightly ahead of other, similar films with ease and charm. What cannot be oversold here, though, is the absolutely career-defining performance from Taron Egerton, who tackles just about every kind of difficult scene an actor can perform, from crying scenes, to sex scenes, to full-on song and dance numbers and more. Regardless of your relationship or familiarity with the music at hand, it is really an impressive and imaginative sight to behold."
    },
    {
      "rating": "10",
      "text": "A flamboyantly engaging biopic that hits all the right notes from start to finish. The film's inventive song-based approach to this character study adds punch to the storyline, playing like an old-style musical, one that actually works in a contemporary cinematic landscape largely devoid of this genre due to stale or forced releases. Taron Egerton gives a career performance as the rock idol who had, and nearly lost, it all, a portrayal easily worth an Oscar. Director Dexter Fletcher's offering is nothing what I expected -- and exceeds all of what I hoped for. Don't miss this one."
    },
    {
      "rating": "8",
      "text": "Very consistent piece of work. I had high expectations and still didn't leave any bit disappointed. The writing is competent and allows characters to be developed. The cast does a very good job with Taron being incredibly reminiscent of Elton's persona and maneirisms. The musical numbers are engaging and the last part of the movie is touching and brings all to a full circle. I only missed the part of princess Diana and George Michael and a few more focus on some songs..."
    },
    {
      "rating": "9",
      "text": "First of all, Taron Egerton and Kit Connor were amazing as Elton John. Kit Connor plays him when he’s a kid and you barely see him but he just leaves such an impact that it’s great. It also helps that he looks like a tiny version of Taron. Now, Taron Egerton is just amazing as Elton John and he helps make him seem like a normal human which is hard for somebody like Elton. As I was watching him I got so invested into his performance that at certain points I actually was starting to tear up all because of his performance. He also, at the request of Elton John, did all of his own singing and it’s amazing. I really hope that he gets a nomination for his role. Jamie Bell, who plays Bernie Taupin, also did a great job. Instead of just using the songs as if he was recording them the movie used them to help transitions from one point to another and it was really clever. The music was used to help montage parts of his life and show what was going on in his life. This was definitely the best option because if they didn’t do it then the movie probably would have dragged out longer. This movie is two hours and one minute long and honestly, I never felt it dragging on for too long. Each moment in his life felt the appropriate amount of time spent on it but there were certain points that I wished they would have spent a bit longer on. The one thing I would’ve added in though is little title cards that say what year it is because it got a little confusing at times what year it was and how much time has passed since the last scene. Like I mentioned earlier in this review the story got me emotional and that’s because of how the film felt like a fly on a wall throughout his life and showing the ups and downs he went through and honestly you can’t watch this movie and not just want to help him out. All of the costumes in this film are hands down spectacular. You can see how much care and work went into making these costumes look as accurate as possible to the real thing. In the end, this movie does an amazing job of showing the like of Elton John and definitely not holding anything back. I highly recommend watching this even if you aren’t a fan. I give Rocketman a 9.5/10."
    },
    {
      "rating": "10",
      "text": "Rocketman was a revelatory experience. I could not have seen a better movie about Elton John who truly is an icon for me! It was touching and insightful and INSPIRING!!"
    },
    {
      "rating": "7",
      "text": "Achei o filme ok, mas eu prefito bohemian rhapsody, pq eu conhecia a historia do queen e do freddie mercury e algumas musicas, nesse filme eu nao conhecia nenhuma musica do elton john e nao sabia nada da historia de vida dele, mas ainda assim e um bom entreterimento, e pra quem e fan vai ficar super satisfeito"
    },
    {
      "rating": "10",
      "text": "Beneath the flashy veneer there is depth, pathos, emotion and fabulousness. Followed by more flashy veneer. And then more depth, pathos, emotion and fabulousness.  A really entertaining movie that knows exactly what it is and what it’s trying to say."
    },
    {
      "rating": "9",
      "text": "As a die hard queen fan and after absolutely loving bohemian rhapsody, I found my self loving rocket man even more! The acting was amazing and the movies ability to show so many of Elton’s famous outfits was clear. It was evident that this movie was made with care and I’m defiantly going to see it again!"
    },
    {
      "rating": "9",
      "text": "Great film, entertaining musical numbers, Taron is great as Elton John. Film hits familiar beats, but it’s flare elevates itself above an average biopic film."
    },
    {
      "rating": "10",
      "text": "best movie i’ve ever seen hands down. it was beyond moving. i can’t get over how amazing the entire movie was. i want to watch it over and over again. the acting is PHENOMENAL and Taron Egerton portrays Elton John incredibly. I couldn’t have asked to spend my money, that I bought my ticket with, on anything better. It was a privilege to see this movie and I will recommend it for the rest of my life!!!"
    },
    {
      "rating": "0",
      "text": "They sweetened the coffee a lot so it doesn't taste bitter.And people drinks it"
    },
    {
      "rating": "7",
      "text": "A great talent with a shallow life. It is a musical so it doesn't delve too deep. Over kill on the Freudian backdrop (hint: father issues) and definitely overkill on the Bacchanalia. The music is great though and like Bohemian Rhapsody it's entertaining throughout. It would be nice, however, to see a musical genius without gay and drug issues."
    },
    {
      "rating": "6",
      "text": "This is a really difficult movie to critique.  Elton is my favorite musician of all time.  This movie is filmed in a fantastical musical style, taking leeway with the timelines of the songs.  For example, they have him starting with Crocodile Rock at the famous Troubadour show that rocketed him to fame.  That song was written several years later and was never played at the Troubadour.  The second half of the film is a complete downer, concentrating on his drug and alcohol abuse which is extensive.  I can't help but think that Elton experienced SOME good times during this period as well.  He even toured Russia with Ray Cooper during this time, something nobody had ever done before that was never mentioned in the film.  I was very disappointed that his fantastic band mates, Davey Johnstone, Nigel Olsson, and Dee Murray were never mentioned and they certainly had a part in the overall success.  As far as the portrayal, Taron Egerton does a great job.  I honestly would have preferred he lip sang to Elton's songs, because his voice is nothing like Eltons and I found it distracting, but at least he can sing, and he looks somewhat like Elton.  Overall the movie was such a downer that it isn't something I would want to watch again.  The movie seems to have been made with Broadway in mind rather than a straight up Documentary style.  Not my cup of tea."
    },
    {
      "rating": "6",
      "text": "Oh how conflicted I am after watching Rocketman.As for the positives, it is very evident the heart and soul that went into this production. It's also refreshing that it doesn't resort to hagiography or making Elton out to be a saint. If you know his history or have seen his documentary Tantrums & Tiaras, then you know that Elton was prone to angry outbursts, not to mention his battle with drugs. The film doesn't paint him as a saint, and it's all the better for it.As for Taron Egerton, he absolutely demands year end awards notice. If Rami Malik's lip-syncing, surface level, impersonation of a performance can win him an Oscar, it is Egerton who truly deserves the praise. His voice is beautiful, and instead of just trying to mimic Elton John, he finds the perfect balance of embodying him while still making the role his own. He is absolutely phenomenal.Unfortunately, Rocketman never takes off the way I wanted it to. There are some stand out musical numbers, but more often than not they end before they are able to truly exhilarate. While placing certain songs at the wrong times in John's life. There are plenty of other fabrications or embellishments of his life (he didn't get his last name from John Lennon, for instance) that are just unnecessary.I'm a huge Elton John fan, and Rocketman is far from terrible. But unfortunately it's also a bit of a disappointment. Still, Egerton is outstanding.I just wish I loved it more."
    },
    {
      "rating": "5",
      "text": "The film sometimes lacks genuine emotion, which forcibly tries to introduce with a host of unnecessary and extremely incoherent musical numbers in certain points of the film. As a musical, it can be poor, but as a drama, that is where the strengths of the film are shown. A musician who drags his own demons while trying to survive in the music industry is something that can be interesting, especially the way that the director conducted. Taron Egerton is incredible in his role (maybe not as Oscar winner) but rather credible and outstanding, also the actress Dallas-Howard, who is really good. Would I see it again? I doubt it, but I still applaud certain decisions in its execution, like the scene of forgiveness."
    },
    {
      "rating": "8",
      "text": "When watching Rocketman I couldn't help but compare the film to last years Bohemian Rhapsody, especially since director Dexter Fletcher ended up taking up the reigns to finish the chaotic production of Bohemian Rhapsody following Singers departure. Whereas Bohemian Rhapsody shied away from showing some of the more controversial moments in Mercury's life and seemed unable to live up to the larger than life presence of the band, Rocketman doesn't try to back away from Elton's R rated life and is infused with the kind of energy which an Elton John movie deserves.The story is the same kind of music bopic you've probably seen before in something like Ray, Walk the Line or Hard Walk: The Dewey Cox Story. Following a difficult childhood, an artist becomes one of the biggest stars in the world. However the stresses of fame mixed with their own personal problems leads them in to a life of addiction and push away all those they care about. This forces them to fight their own demons to overcome their struggles and find happiness in their life. I don't know whether I should criticise Hollywood for not greenlighting more original biopics or music prodigies for living such similar lives.Though what differentiates this story from a standard music biopic is Elton as a character. Whilst there's always a slight concern when the subject of a biopic plays a role as the producer of his own movie, since they may attempt to force a romanticised version of themselves to the screen, it's clear that Elton doesn't have a problem in showing the painful moments of his life or the darker side of his personality. Instead he embraces his pasts mistakes and own them as part of how he became who he is today.Another major part of bringing Elton's personality to life on screen is that Edgerton may have been the best choice they could have made for playing him. Beyond nailing his look, he seemed able to switch between the emotional wreck that he was in his personal life in to the hypnotic on stage charisma so naturally. In one of the films best moments we see him broken down and exhausted about to step on stage, before breaking in to a smile and a happy march the moment that spotlight hits him. With this and the comedic skills he shows off in the Kingsman series, he's definitely an actor who I'm curious to see where their career is going to go.But you couldn't have an Elton John movie without an Elton John Wardrobe and the movie does not disappoint. From the moment he steps on screen dressed as a sparkling devil, with wings so large you'll wonder how made it through doors, to the hundred other costumes we see Edgerton wearing throughout, the film this ends up being a greatest hits compilation of both Elton's music and his outfits.Unlike some other music biopics, this movie doesn't try to just copy Elton's musical performances. The filmmakers are smart enough to know that no matter how good Edgerton is, there's no way they could just use Elton's songs as it would never live up to just watching a concert film of Elton performing. Instead they claim their own versions of these songs, blending Edgerton's great voice with a style more similar to a stage musical to give them a separate identity to Elton's. Combine this with the impressively executed dance sequences, which similar to La La Land feel like modern day versions of a classic Hollywood musical, these sequences stand apart from Elton's as their own entertaining versions.The film mixes these great sequences with a constant kinetic energy which flows through every scene, moving song to song and blending scenes together seamlessly. Especially later on in the film, where Elton's drugged out state leads scenes to transition into one another at times like a dream and at other times like a nightmare. Though at times the film carries this momentum to a fault, with scenes moving so quickly that we hardly get a chance to breath before the films already moved on to the next song.We do also get a slightly rushed ending, with all the loose emotional plot threads in his life being tied together in a single scene and leaving us with a brief Animal House style of cliff notes for how the rest of Elton's life went instead of something more creative like a montage showing us the rest of Elton's life. But even with this, Rocketman is both one of the best music biopics and a thoughtful look on the self-destructive effects of addiction. I just hope that every future music biopic is given the same amount of care and thought as this film has been given."
    },
    {
      "rating": "3",
      "text": "The movie starts out like a Disney musical, and I really don't like musicals, though I do love music. I was hoping for something more like A Star is Born or even Bohemian Rhapsody. Instead I was served an up and down bio-musical that just never really caught my attention. I had hoped for more."
    },
    {
      "rating": "7",
      "text": "I laugh at the reviews criticising this bio-epic for being an honest bio-epic but on the other hand, praising the Queen bio-epic despite that being mostly made up. I thought Egerton did a phenomenal job as Elton and he's actually singing the songs was a huge plus for me and something that Malak didn't do in Bohemian Rhapsody.Rocketman doesn't try to be a feel-good movie, It gives you a pretty in-depth look at who Elton was at various stages of his career and it was great to see him turn his life around. All in all, It's just a satisfying movie that offers a good blend of music and drama. It was everything that Bohemian Rhapsody should have been."
    },
    {
      "rating": "7",
      "text": "\"Better titled as Yellow Brick Road\"The title Rocketman doesn't really work for this musical biopic by Dexter Fletcher, a longtime actor trying to direct and with not much success. As others have noted, the production is kind of all over the place, some parts decent other parts forgettable. Many key sequences are put to music which are hit and miss, take Rocketman for instance, you'd think it would have something to do with outer space or its loneliness but they pair it with a hospital scene, ugh. Taron Egerton excels in the role but the supporting cast fades pretty much. The film, with Elton John as one of the EPs, does reveal to us his life of being mostly unloved by parents and those that profess to love him, with Bernie Taupin really being the only one by his side the whole time. One key disappointment was that it gave such short shrift to his first marriage to a woman and whiffed on the associated \"Someone Saved My Life Tonight\" hit song. Another disappointment is that it doesn't keep us informed of what year many of the scenes play out. This biopic could've and should've been so much better. (originally posted on IMDB 9/23/19)"
    }
  ]
}