{
  "id": 1630,
  "title": "Rock Dog 2: Rock Around the Park",
  "starring": [
    "Graham Hamilton",
    "Ashleigh Ball"
  ],
  "runtime": 90,
  "genre": [
    "Animation",
    "Comedy",
    "Music",
    "Family"
  ],
  "description": "When Bodi and his band 'True Blue' leave Snow Mountain, to tour with pop sensation, Lil' Foxy, they learn that fame comes at a price.",
  "releaseYear": "2021",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kETYRGA15L0wkVPugSl8lKmSgFn.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 8.0,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 4.0,
    "funny": 7.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Rock Dog easily ends up being on the \"Forget Me\" list for movies not because it's likely it'll be forgotten by the time the next two weeks come, but it's cheesy enough to be forgettable by the week after this movie hits theaters."
    },
    {
      "rating": "6",
      "text": "I found this movie to be not awful by any means, actually I enjoyed it pretty ok. But it's not good enough to really capture me. Movie follows the plot predictable at the beginning with some differences, the dad actually gives the kid a chance to try and get into music. What feels off is the script a bit, main character doesn't know what a radio is but knows about pizza? Idk that felt odd to me.The animation is subpar for an animated movie but I never felt like it was born of the north or direct to DVD. But it's just short of being standard. The 2D animation in the beginning actually is really good.In the end, I enjoyed it enough to rate it positively but it never gripped me hard like zootopia or half of the movies from last year. It's middle of the road ok, worth a rental or Netflix."
    },
    {
      "rating": "7",
      "text": "The film is not only good as it has a totally different footprint than I imagined, it’s not a film just in the style \"I am not like my father and I want to follow my dream\", it passes of this, the enmity between the two demonstrated in the trailer hides that nothing is more than a son discovering the world and his father who wants to protect him and teach him how to protect others.Even with the clichés all there, the basket idol that uses the innocence of the hero for his own benefit, the famous rain scene that shows that all dreams are over, the stupid henchmen who try during their clutches to capture the hero to cheer the boss, Hilarious with his OCDs in relation to colors and even the friends who sympathize with the hero from the beginning and already \"includes\" in the group as if it were always one of them.The soundtrack is a good one, all songs, sings or environments, are easy to identify, especially the song \"Glorious\" made by Adam Friedman especially for the film (would make me be happy if it at least competes for the best Oscar Original song). Outside musical amusements aside like guitar solos, musical battles and everything a movie about a musician seeking his dream needs.For adults (myself included), the film can impress for different reasons of the children, these the target audience of the film, which shows relationships between father and son, master and apprentice and even how to found yourself without having to change his lifestyle.Just as the protagonist refers to his homeland from which he left to follow his dream of being a rock star, I can’t get out of the head of how glorious this movie is in its own way."
    },
    {
      "rating": "8",
      "text": "Rock Dog is one of the most beautiful films of all time, I know it's a Movie what China gives up, but Reel FX made this movie as possible. The director who made Surf's Up and Toy Story 2.8/10, because It looks Great without unfunny comedy, I know the Animation is lack luster and the pasting is really well done. The Characters are cute and LikableThe Voice acting is niceThe Plot is fitting how it was refreshing"
    },
    {
      "rating": "4",
      "text": "Every dog has its day.Yeah, just like what we say in our country on 'made in China', a poor and cheap quality product. It seems they never ever see the bright side in this business (making products). This is the Sino-US collaboration product and as usual the film was too poor. The animation was much better than some of the B animation features. But the universe was too small, or you can say restricted for certain enclosure makes it fall in as a bad film. That's when you observe the backgrounds, you would notice how substandard it is.Visually and basic storyline seems not much different from other animated flicks. Because it kind of reminded me many awesome films from the recent past like it either be ' Kung Fu Panda' or 'Zootopia'. All about chasing the impossible dream and an inspiring theme. But still I believe the little kids like under 6-7 might enjoy it. Yeah, this is definitely not for the grown ups like most of the modern animated films are. That's a sad part, yet some adult would find it better.The film was built on the most common clichéd platform. A young Tibetan sheepdog is not interested in what his kind destined to do. Instead, he's very much into the musics and after inspired by what the famous musician said, he embarks a journey that would decide his fate. So how his life going to change comes with the remaining parts. There were some nice comedies, but nothing tried hard to uplift film. From the beginning itself, it was so familiar, which did not give any space for a better improvement in the later parts. An average film, maybe below that, yet watchable one. Short film though, with the nice music.4/10"
    },
    {
      "rating": "10",
      "text": "Something was evidently lost in translation where the blandly rendered Rock Dog is concerned. An adaptation of the graphic novel, Tibetan Rock Dog by Zheng Jun, this draggy, computer-animated feature exhibits neither bark nor bite in its portrayal of a sheep-guarding, guitar-playing Himalayan mastiff who has his head perpetually in the clouds.Coming after the film’s Chinese release last summer, which disappointed its 14 executive producers by bringing in less than 10 percent of its $60 million budget, the Americanized version, with a voice cast including Luke Wilson, Eddie Izzard, J.K. Simmons and Sam Elliott, will be hard-pressed to do much better, with a marketing campaign catering to younger pups.While groomed by his gruff alpha dog dad, Khampa (Simmons) to keep the wolves away from the woollier inhabitants of Snow Mountain, young Bodi (Wilson) has always been distracted by the sound of music."
    },
    {
      "rating": "5",
      "text": "Another cliche children’s movie, predictable and forgettable, Rock Dog doesn’t bring anything new or interesting to the long line of children’s movies that have come out this year"
    },
    {
      "rating": "8",
      "text": "I tried taking my daughters to this movie in the theaters last year, since it was the only kid movie at the time, but we missed it.  Never heard of it before, and nothing since.  Got some low scores overall, and saw no one praising it.  Well, it's on HBO now, and I got to see it with my daughters this weekend, and I have to say:  relative to all the other animated films with a Critic rating in the 40 percentile, this one does not deserve to be rated so low.  Not a perfect film, but quality animation, good voice acting, funny jokes, and an easy watch.  I almost completely missed this movie, and glad I didn't.  I am pretty strict with children's movies since I normally watch with them, and 'Rock Dog' is a solid 80% film.  Nothing stellar, but certainly good enough when you are looking for something fresh to watch with the kids!  Believe me: there are much much worse films that have the same and even better ratings here on Metacritic."
    },
    {
      "rating": "10",
      "text": "This film has an excellent level of animation, despite the fact that it is partly of Chinese production. The film has a beautiful soundtrack. If do not find fault with the use of family problems in this film, then this film is pretty good."
    },
    {
      "rating": "10",
      "text": "Esse filme me deixa com alto astral nas nuvens. Trilha sonora e efeitos visuais excelentes, combinados com um roteiro simples, mas, com uma mensagem forte a ser passada."
    },
    {
      "rating": "6",
      "text": "Está bien para ver en una tarde aburrida; la trama es genérica y la animación es decente; tiene algunos momentos divertidos, pero al final se queda corta si se le compara con otras películas animadas actuales."
    },
    {
      "rating": "9",
      "text": "Personally for me this movie gave me alot of inspiration and art guidance. This is why i love it. Simplicity of design makes it even better, even tho it became iconic for this movie"
    },
    {
      "rating": "5",
      "text": "its not even so bad its fun to watch like \"the christmas tree\", its just so bad its a bland \"sing\" rip-off"
    }
  ]
}