{"id": 2616, "title": "Rocky III", "starring": ["Sylvester Stallone", "Talia Shire"], "runtime": 99, "genre": ["Drama"], "description": "Now the world champion, Rocky Balboa is living in luxury and only fighting opponents who pose no threat to him in the ring, until Clubber Lang challenges him to a bout. After taking a pounding from Lang, the humbled champ turns to former bitter rival Apollo Creed for a rematch with Lang.", "releaseYear": "1982", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/3avfzaUDxMieyEgGPopVvh8ABXR.jpg", "categories": {"plot": 7.666666666666667, "acting": 7.833333333333333, "ending": 8.5, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 7.888888888888889}, "reviews": [{"rating": "10", "text": "This was great, not as great as one nor two, but great a third one, this is the original Dark Knight Rises, from a fallen hero, to a risen hero."}, {"rating": "10", "text": "An amazingly strong movie for a third installment. It continues the story of Rocky who is world champion and has defended his title in ten matches. But now comes a challenger unlike everyone else. Clubber Lang played by the legendary Mr. T. Who is young and hungry while Rocky became mollycoddled by his success and wealth. Basically it is the same that happened to Apollo Creed in Rocky 1. “Small spoilers”: After things I wont spoil Apollo Creed comes to Rocky to help him. “End of Spoilers” This is an amazing idea for a story. It relates to the first movie and gives you a perspective. The characters and drama is excellent. Rocky, Apollo Creed and Clubber Lang work so well together. The additional cast is also excellent and I will praise especially Burgess Meredith as Mickey. Like before the sets are great and fights are shot intense and engagingly. I must of cause mention the soundtrack. Survivor delivered with “Eye of the Tiger” a timeless classic that became one of the most well know tracks of all times. There are so many training montages, sketches and fights that use it. Overall while I am admitting that it is not as emotional as Rocky 1 it is an excellent movie with bonus of Mr. T and “Eye of the Tiger;-). A must see in the franchise."}, {"rating": "9", "text": "Amazing and Entertaining movie!it was emotional,dramatic,entertaining and full of high octane fights it was amazing,the music was good,the story was simple and amazing,the acting was pure phenomenal and iconic the Mickey's character is pure legendary again in this movie specially he's emotionally great,the new challenger's aggressive and abusive nature with amazing intensity it was well performed and Apollo and family members of Rocky they were amazing,the starting intro with Paul being Jealous of Rocky and the situation amazing handled by Rocky was amazing then him in peak of his career with the small fights it was amazing then the whole charity wrestling fight and cameo of Hulk hogan was extreme and over the top entertaining thing the fight and insanity of Wrestler punching everyone was disturbing and awesome,the new challenge for Rocky for title while retiring the whole Statue scene the challenger's abusive arguments it was insanely amazing then the whole prep for fight and Mickey's thing for Rocky it was brilliant,the Mickey's last moments and the crowded push scene it was literally heart-breaking and emotional scene literally he's the most iconic character he was brilliant,then the whole Apollo taking the place as trainer and his friendship with rocky was amazingly showcased the training scene were amazing as hell,the beach conversation of Adrian and Rocky was great and amazing,the last half was literally amazing the rematch fight with punches and insane arguments it was hell of a amazing and intense fight it was entertaining and then the ending with title it was awesome and satisfying the ending friendly match between Apollo and Rocky before credits was amazing way to end,the whole movie was simple and amazing,it was intense,dramatic,emotional and entertaining its a amazing movie!"}, {"rating": "8", "text": "The third movie in this huge franchise and the weakest thus far. Still an entertaining movie and has many similar traits to 1 & 2 but the bar has been set high with those 2 movies and it just falls short"}, {"rating": "6", "text": "Definitely a step down for the series but still a solid entry. Stallone is good despite the screenplay."}, {"rating": "4", "text": "you thought i was tough..Rocky IIIThere is a sense of wanting more for the character but at this point it seems obvious that they are stretching their way down the road where box office is given more importance than quality of it. Rocky III is flat out predictable and a typical sport movie filled with cliched action sequences to complete the run time of the movie. Sylvester Stallone seems to be working hard on it since being aware of the platform he has got and gets a good supporting cast on screen. Rocky III is of course made for the audience with more action sequences and fan boy moments but looses the touch of originality and the soul of it."}, {"rating": "1", "text": "Rocky was a great film, Rocky II was by miles better than the original.... In 1982 we saw the return of Sylvester Stallone as he returns as Rocky Balboa in \"ROCKY III\" and this time Mr.T is his opponent to try and defeat. Rocky (Stallone) gets KO'd and destroyed by Clubber Lang (Mr.T) then Apollo Creed (Carl Weathers) says when he beat him it hurt his pride and it hurt him and tells Rocky he needs to get the Eye of the tiger back to defeat Clubber Lang. So Apollo trains him but there's a catch, Burt Young who plays Paulie keeps moaning and being annoying but after training Rocky Balboa (Stallone) must face Clubber Lang once more after strong words about not giving up and if he loses at least he loses with no fear and honour which is roughly what is said by Talia Shire.. Micky Goldmill (Rocky's usual trainer) dies after the first fight with Clubber Lang and Rocky Balboa. This for me is a weak edition into the Rocky series because some of it's good but also laughable and some of it is boring. Thunderlips played by Hulk Hogan does Rocky III no favours either as his character was stupid, unnecessary, laughable, annoying and pathetic."}, {"rating": "7", "text": "After Rocky's second film, it looks like he's at the very top. It doesn't take long and a villain arrives, which changes it very quickly, so a proper workout will be needed again, which will make the main character even stronger. I have nothing more to say. For me, a good film that I recommend."}, {"rating": "7", "text": "Clearly worse than the 2 parts before: The fights are ridiculous as always. But in this part the story isnt so interesting like before. Mr.T is an interesting bad guy and Stallone is very good as always. Also there were some strong scenes, for example the trust and love between Rocky and Adrian is beautiful again. But still something is missing."}, {"rating": "8", "text": "Eye Of The TigerRocky III is another entertaining addition to the classic franchise."}, {"rating": "8", "text": "Rocky III. Eye of the Tiger. What can I say briefly about the third film about the boxer Rocky Balboa. Fights have become much more spectacular, especially the final match in which continuous series of strikes. However, there is already no such tension and emotions that were when watching the second film."}, {"rating": "8", "text": "8.5/10The first hour of Rocky III was fantastic, it's full on exciting and good time and also quite emotional, the last 40 minutes of the film was basically the first Rocky and Rocky II combine all over again which means there is still some good, exciting part, but there is also a cheesy, slow, and on this one just a little bit boring, but before we get right to the main event, Rocky III introduce the rich and more professional version of Rocky Balboa, and i'm pretty sure as the time goes we all gonna miss \"the old Rocky\", and we all gonna leave that sweet memory on the first two movie, the new Rocky opponent was Clubber Lang played by Mr. T, their first match was a brutal straight forward and nothing special, their rematch i was also find quite underwhelming but it still have some parts and the way it ended, the climax of  that fight was great, and also besides the stuff in the film, Rocky III was also fills with another great score including the main theme, but Survivor Eye Of The Tiger song was fire!!!, overall Rocky III was still great, despite the underwhelming overall last 40 minutes, the first hour was great and incredible, and so it makes it still worth it and in some way yes it's better than the first two, i can also say that the first Rocky trilogy overall was acceptably both watchable and rewatchable."}, {"rating": "7", "text": "More Creed meant a better movie than the first 2. Honestly maybe the coolest man/character ever."}, {"rating": "8", "text": "Of course, the acting is not especially good, but who watches a sports movie for acting? It's comparable to turning to John Wayne for a touching tale or, for that matter, for quality acting. You opt for action, and game absolutely delivers with fantastic action. It even adds Survivor's Eye of the Tiger, raising the grade of the movie to at least a 6. The eighth is derived from the tale, and the seventh from the action. It doesn't have to be upbeat like much of Rocky I was to be a good narrative; it simply has to be excellent. It simply is. In a nutshell."}, {"rating": "9", "text": "Probably the best Rocky sequel is right here. Watching Rocky become so popular he forgets about where he came from, after the death of Mickey he needs to get back his roots and Apollo Creed is there to help out."}, {"rating": "6", "text": "Rocky III cuenta con el principal problema de que transmite una sensación de alargar por alargar, pero lo hace por lo menos desde una perspectiva de un Rocky rico, el cuál pierde la \"hambre\", pierde \"el ojo del tigre\" y que es ayudado por su amigo Apollo, eso es sin duda junto a la actuación de Mr. T como Clubber Lang y la canción de \"Eye of the Tiger\" lo mejor de la película"}], "recommendations": ["rocky_ii", "rocky", "creed_ii", "the_incredible_hulk", "spider_man_far_from_home", "john_wick_chapter_3_parabellum", "rocky_iv", "creed", "spectre", "rocky_v", "transformers", "kung_fu_panda_2", "top_gun", "the_world_is_not_enough", "john_wick", "hulk", "mission_impossible_ghost_protocol", "thor", "indiana_jones_and_the_temple_of_doom", "captain_america_the_first_avenger", "star_wars_episode_ii_attack_of_the_clones", "quantum_of_solace", "shang_chi_and_the_legend_of_the_ten_rings", "mission_impossible_rogue_nation", "black_widow"]}