{
  "id": 1134,
  "title": "Role Models",
  "starring": [
    "Seann William Scott",
    "Paul Rudd"
  ],
  "runtime": 99,
  "genre": [
    "Comedy"
  ],
  "description": "Two salesmen trash a company truck on an energy drink-fueled bender. Upon their arrest, the court gives them a choice: do hard time or spend 150 service hours with a mentorship program. After one day with the kids, however, jail doesn't look half bad.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ki79dSjh6Rr51xrsz4dT04UGxSU.jpg",
  "categories": {
    "plot": 6.9375,
    "acting": 6.842105263157895,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.9423076923076925,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Role Models sadly does fall for the cliche that little kids saying swear words is still funny, but still Paul Rudd, Sean William Scott and Jane Lynch give very impressive performances which is too much to resist. I give this movie 64%."
    },
    {
      "rating": "8",
      "text": "This movie is an hilarious raunchy comedy. Sure it has a cliche story line, but like I Love You Man, if you have the right actors/actresses you can strike comedic gold."
    },
    {
      "rating": "10",
      "text": "I was ROFL for the entire length of the movie ! And I am 45 years old...not really sure what that says about me. Great cast, great script...bulls's eye !"
    },
    {
      "rating": "9",
      "text": "After seeing a 59 on metacritic I assumed I would be watching a so so comedy with some familiar actors. This movie was FAR better than the 59 it received. It was easily one of the best movies of the summer, and by far the best comedy. You will not be disappointed."
    },
    {
      "rating": "0",
      "text": "Quirky, funny, good looking actors, and the theater I was in was completely sold out with ages 17 - 25 or so (movie is rated R), all very young. The movie sends a great message to kids that says, even if others don't like it or don't appreciate it, you should just \"be who you are.\" Unless your gay, that is. This movie sends a powerful and consistent \"sub-message\" as a major component of its humor that everyone should be wary and vigilant of anything that smacks of homosexuality. The movie includes full-volume use of the word \"faggot\" in its most pejorative sense (equivalent to the \"N\" word amongst gay and lesbian people, by the way). Several of its characters offer repeated expressions of concern that one or another of the kids in the movie might be gay, along with a showing of great relief that this concern is eventually resolved as unfounded. This movie's homophobic foundation sends a pretty awful message to the clearly sought-after young people, both straight and gay, that make up this movie's prime market. The writers and producers of this movie need a lot of enlightenment here, as do its hip adult and kid actors who are complicit in sending that message. The unabashed homophobia thoroughly woven into its plot structure is a disgraceful mark against this movie."
    },
    {
      "rating": "5",
      "text": "Lighthearted comedy that really is a fluff piece without much substance. Some funny spots but otherwise relies too much on sexual inuendo. Not much to think about as it appeals to all those who want to check their brains in at the door. Good for a rainy afternoon."
    },
    {
      "rating": "10",
      "text": "Hilarious movie. Whoever wrote the script is godlike, because it's not written like a movie, it's written like real life human beings would have conversations. Just see it, you will be pleasantly surprised."
    },
    {
      "rating": "0",
      "text": "This movie was not funny period!"
    },
    {
      "rating": "6",
      "text": "It was ok. A little sad at times (when you relize just how pathetic the younger kids are) and the acting was alright. However it just doesnt really hit as good as it could have."
    },
    {
      "rating": "5",
      "text": "It was ok. A rather generic comedy if you ask me. Paul Rudd, Sean William Scott, and Jane Lynch give good performances in this and that is what really carries the film. Funny at times and corny at others."
    },
    {
      "rating": "9",
      "text": "Hilarious! Role Models is the best comedy since American Pie!"
    },
    {
      "rating": "9",
      "text": "Great movie. Funny comedy. But better overall movie. Perfect casting creates believable characters."
    },
    {
      "rating": "9",
      "text": "Unless you are offended by words this is a very funny movie. Better than the majority of raunchy comedy movies of the day. The only knock is the sub-par ending."
    },
    {
      "rating": "8",
      "text": "Loved it. It's a hell of a lot of fun and the characters are great."
    },
    {
      "rating": "8",
      "text": "Don't get me wrong, I really liked this movie and thought it was hillarious, but I felt like the film itself had more to tell about what it means to grow up."
    },
    {
      "rating": "9",
      "text": "I don't think I've been this surprised by a \"dumbass comedy\" since Deuce Bigalow! While the dramatic side to the plot is only above average, the comedic side is hilarious. It's great to see good comic actors given such nutty characters, such memorable dialog, AND effective gags all in the same movie. The humor is fairly crude at times, but it goes for cleverness far more often. Seriously, this film deserves some special award for sheer amount of double entendres (usually delivered with seeming unawareness). Fans of \"The State\" will not want to miss this one, since it features 4 of the 11 cast members, and was directed and co-written by David Wain. And if you thought Christopher Mintz-Plasse was funny as \"McLovin\", just wait until you see him unleash the true geekness here. After watching it a second time, I have to rate it one of the 20 funniest movies of all time (up there with \"Idiocracy\", \"Monty Python and the Holy Grail\", \"Death to Smoochy\", \"Trading Places\", and \"Spinal Tap\")."
    },
    {
      "rating": "10",
      "text": "Really good movie. Better than expected. This is Christopher Mintz Plasse's coming out party."
    },
    {
      "rating": "6",
      "text": "Typical movie-for-the-masses with Jane Lynch stealing the entire movie with every scene she's in. Is Christopher Guest the only director in Hollywood that knows that?"
    },
    {
      "rating": "10",
      "text": "Awsome movie. Very funny and very touching at time. Damaged people finding out the joy in life following thier bliss."
    },
    {
      "rating": "8",
      "text": "Role Models was a really engaging and fun film. Mintz-Plasse was good, Paul Rudd and Sean William Scott were really warm and the kid he was hilarious. I love the \"Boobie\" lessons. And the LARP scenes were pretty smart."
    },
    {
      "rating": "9",
      "text": "The kids were hilarious. I thought this was really funny."
    },
    {
      "rating": "8",
      "text": "Wow! After a dull beginning to the movie, Role Models really turned out to be a great movie in the end, Personally, I think that this movie is worth seeing when you want to see a movie with a couple of friends, and all of you like comedies. 8/10 for Role Models."
    },
    {
      "rating": "10",
      "text": "Hilarious movie with total rewatchability. Perfectly cast."
    },
    {
      "rating": "9",
      "text": "This movie will give you some good emotions, believe me."
    },
    {
      "rating": "6",
      "text": "The actors are the plus for this film, they do a great job. The characters are likable and well developed. The story lacks originality and it is predictable though. Fun but not very memorable"
    },
    {
      "rating": "8",
      "text": "Surprisingly funny and at times heartwarming. Nothing that will be groundbreaking or a classic, but some good laugh out loud moments. Rudd is endearing and entertaining as well."
    },
    {
      "rating": "6",
      "text": "This movie is funny, really dies off towards the end though."
    },
    {
      "rating": "10",
      "text": "It's a lighthearted comedy that could have gotten away with PG-13 if the cursing and nudity had been cut down a lot. However, the language is totally necessary at points and will leave you laughing even at a serious point in the movie. Other than that it is a lighthearted comedy with a few surprising morals and an over feel-good attitude once you leave."
    },
    {
      "rating": "8",
      "text": "Rudy(Chris Makepeace) can't fail. Under Tripper Harrison's tutelage(Bill Murray: Canadian role model), the gawky teen has a chance to be the star of his camp. If the unlikely North Star outpaces the favored Mohawk runner in the last event(the marathon) on the last day of the Olympiad, the nerds will win the clash of the warring summer camps. Ivan Reitman's \"Meatballs\", like Bill Melendez and Phil Roman's \"Race for Your Life, Charlie Brown\" before it, succeeded because Rudy and \"Chuck\"(what Peppermint Patty would call Lucy's \"blockhead\") were likable underdogs in need of redemption. And what better way to get it than in competitive sports? \"Role Models\" climaxes with a medieval role-playing tournament that somehow permeates a level of palpable excitement on par with anything from the \"big game\" scenario in countless inspirational sports movies, or Peter Jackson's \"Lord of the Rings\" trilogy. Thanks to Gayle(Jane Lynch), \"Role Models\" exhibit sturdy wings, and not broken wings, when she assigns the right boy to the right mister; a preventive measure against \"College\"-like transgressions. Augie Farks(Christopher Mintz-Plasse) gets Danny Donahue(Paul Rudd), a misanthropic energy drink peddler as his \"big\", who advises his charge to \"lose the cape\". Wheeler(Seann William Scott), on the other hand, if he was Augie's mentor, would physically remove the stigmatizing garment from his neck: no capes in this man's army. A serious horndog, Wheeler(who mentors his \"little\" about the fine art of inconspicuous \"booby\"-watching), given the opportunity to mentor an older boy around Augie's age(Ronnie, played by Bobb'e J. Thompson is about nine or ten), potentially could have upped the raunch factor of \"Role Models\", and degenerate into a sex romp about Wheeler helping the sword-wielding misfit lose his virginity(he takes Ronnie to a house party but the kid is too young)."
    },
    {
      "rating": "10",
      "text": "Even though we share the same last name I've been critical of his work in the past. This time David Wain nails it! Just the right mix of romp, raunchy and ridiculous to give you a great night at the movies."
    },
    {
      "rating": "10",
      "text": "In my opinion, this movie is the best original comedy ive seen in a while. Its actually really funny and the acting is great. It was directed well and plasse was hilarious, as well as paul rudd and seann. Yes its raunchy, but its funny and very original. Perfect in my opinion."
    },
    {
      "rating": "8",
      "text": "I ended up seeing this one twice (circumstantial) and watching it a second time, it was still a funny and enjoyable movie. Sean William Scott plays the same character as I've seen him in every other movie and he's still doing a good job. I would definitely recommend this movie and I'm sad that it didn't receive higher ratings by critics."
    },
    {
      "rating": "10",
      "text": "David Wain, coupled with a hilarious cast, produces an amazing work of art. The writing is amazingly well done- witty remarks are scattered throughout the film. It does use sexual humor and contains nudity, so I wouldn't recommend seeing it with a parent. A must see."
    },
    {
      "rating": "8",
      "text": "A movie that started out bland quickly turned into something else. The movie's cast is great to contribute to its simple, yet hilarious comedy. Although, predictable, it is worth the watch."
    },
    {
      "rating": "9",
      "text": "Ridiculously funny! Casting is perfect and the banter between the main characters is classic."
    },
    {
      "rating": "10",
      "text": "I haven't laughed that hard since 40 year old Virgin and Old School."
    },
    {
      "rating": "8",
      "text": "Finally, a decent Sean William Scott movie (maybe it's because of Paul Rudd)"
    },
    {
      "rating": "8",
      "text": "Funniest movie I've seen in a long time. Although I think it is a comedy most appreciated by men 36-50 yrs old. Paul Rudd really has that character down pat. Wheeler's \"little\" had some of the best lines."
    },
    {
      "rating": "9",
      "text": "This is one of the funniest movies i've ever seen, the main characters all compliment each other nicely, my only complaint is that I'm not cool seeing a kid who looks about 10 years old cuss every sentence, but still a hilarious movie."
    },
    {
      "rating": "6",
      "text": "Some chuckles are guaranteed, but as with most new comedies it isn't about the jokes as much as it is about the crudeness and vulgarity. Role Models had the perfect set up for a great comedy and at times worked really well, but instead of running with it the director reverted to classless adolescent jokes and language which really hampered to movie rather than help it."
    },
    {
      "rating": "8",
      "text": "I ended up really enjoying this movie. The little kid was so funny and surprisingly bounced off Sean William Scott. It's just a genuinely funny and nerdy film. It has a decent premise and a great ending."
    },
    {
      "rating": "9",
      "text": "Hilarious movie. Paul Rudd never disappoints. And the two performances by the littles are hilarious as well as a ridiculously funny small role from Jane Lynch. Definitely recommend this one."
    },
    {
      "rating": "8",
      "text": "I really like this movie, it has a pretty good story and a hilarious script. At the beggining i sucked a dick..................................................................................................................................................................................................."
    },
    {
      "rating": "8",
      "text": "It is actually pretty funny. The acting was unexpectedly great. There are not a lot of reasons to not see this intensely humorous comedy with great performances."
    },
    {
      "rating": "7",
      "text": "Basically anything Sean William Scott is in will be hilarious. And when you add Paul Rudd and McLovin and the little kid Ronnie, you've got a funny movie."
    },
    {
      "rating": "7",
      "text": "An overall entertaining comedy, with a cast of colorfully written characters."
    },
    {
      "rating": "8",
      "text": "Solid comedy that I actually didn't think I would enjoy but ended up getting a nice surprise as it was quite funny! Both Paul  Seann work great together and both of their 'kids' they have to watch are funny also. It's a good storyline with good messages behind the comedy that's originally presented. The jokes are also consistent and with hilarious characters throughout it's held up well  Overall an enjoyable comedy with plenty to chuckle at, and it's well worth a look!"
    },
    {
      "rating": "8",
      "text": "The two mains are good, Paul Rudd especially. But the real star of the show is Christopher Mintz Plasse as nerd Auggie Farks. His performance is hilarious and almost as good as the legendary McLovin in Superbad. I would say that Role Models is a very funny film which will definitely entertain you, mainly because of Christopher Mintz Plasse being on hilarious form."
    },
    {
      "rating": "7",
      "text": "Overall good comedy with a positive message. Was a little too elementary at times, with Sean William Scott's character being a little too juvenile, but other people play their parts well."
    },
    {
      "rating": "8",
      "text": "Sean William Scott and Paul Rudd come together and produce a comical-bromantic-based story. With their costars shining as bright as the main stars, the film presents a funny atmosphere with the typical satirical feel. A clever script/plot bounded together with a joyous and hysterical hold."
    }
  ]
}