{"id": 4266, "title": "Roma", "starring": ["Yalitza Aparicio", "Marina de Tavira"], "runtime": 135, "genre": ["Drama"], "description": "In 1970s Mexico City, two domestic workers help a mother of four while her husband is away for an extended period of time.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/kxZUWtJGbGqaUdXCYg2CTs8wyEc.jpg", "categories": {"plot": 4.28125, "acting": 5.351351351351352, "ending": 3.5, "soundtrack": 5.0, "cinematography": 5.315789473684211, "familyFriendly": 3.0, "funny": 5.0, "action": 5.5}, "reviews": [{"rating": "1", "text": "Baffled by the positive reviews. This was one of the MOST BORING films I've ever seen! The main character shows almost no emotion throughout the movie. In one scene where she is rejected you think she'll FINALLY show some emotion but the camera does not show her reaction! Unbelievably tedious and boring and I kept wanting the movie to end, as I'll never get back the time I wasted watching it."}, {"rating": "10", "text": "The best film I've seen this year, last year, probably the year before that, and probably next year too. The kind of masterpiece most auteur filmmakers have seemingly forgot how to make these days. Incredibly powerful and dramatic. Nostalgic without being overly sentimental. Just as stunning on a technical level as Gravity was, without being nearly as showy. Simply flawless."}, {"rating": "0", "text": "I am shocked at the reviews of this thing called Roma.  First off, I have no idea what ROMA actually is.  Is ROMA a person?  A place?  A terrible film?  All of the above?  This moving photograph will mean nothing to anyone other than a critic looking for a high brow concept with a low brow delivery.  All I came away from the screening of this thing was #MaidsLivesMatter and... so what.  The flimsy story is constructed around beautiful images, that more rightful belong in a photo album and not on a movie screen.  I was appalled at the lack of reality in the substance of the characters.  Also, I do not believe that the ending is in any way plausible.  The character who was the weakest suddenly becomes superhuman and stronger than a riptide.  I call bollocks.  Any one who isn't trying to blow something up someones somewhere, will not like this movie, and that is most everyone."}, {"rating": "3", "text": "I guess it depends why you go to the movies. I like movies that have a story. Apparently critics and the self-important art-house crowd only care how a film is shot. I even read one review that called it a \"masterpiece\" but also said it had \"not much of a story.\" Another, which was one of the lower rated, said something to the effect of \"no one would care about this as much if it was done by another director.\" I shrugged my shoulders after the credits came on and will likely never independently think of this film again."}, {"rating": "3", "text": "Bored AF. Boring,boring,boring and boring. There's raelly NOTHING going on. Only one scene in this movie is worth watching. ONE!And it's 135 minutes long!"}, {"rating": "6", "text": "The technical and visual aspects are just impeccable. Nothing bad to say about that at all.But and the story...?Any mexican people could tell me that this was the story of any Mexican soup opera and I would believe it with absolute certainty and that's devastatingly alarming coming from Alfonso Cuarón.I'm not really disappointed because my expectations about this film were not into that side, but to call this film a masterpiece, is simply a scandal."}, {"rating": "6", "text": "Everyone has mad respect for Alfonso Cuaron, for good reason ... and I think that's part of the critics' love for this film. It is his very personal, touching memoir of his own childhood, filled with evocative details and oh-so-arty in black and white. I enjoyed the slice-of-life aspect of it, but was distracted by the fact that the lead actress can't act. At all. It's a completely wooden performance, and it really stretches credulity that she was nominated for an Oscar!"}, {"rating": "2", "text": "I'm Mexican I know all the movie talks about and all the places, and as much as I tried to like the movie it just doesn't. One thing good about this movie tho; the photography, really beautiful shot.Now.... The actual history behind the movie is predictable, boring and poorly written. I never got to connect with any character, thanks to a very lack of emotions from them they are just cast into a one dimensional role, and they never get out of it. If he tried to portrait the maid as they are in Mexico (I mean very submissive and so desperate that they accept any circumstances) then all the other characters should have a large array of emotions so there's contrast. But there's just no contrast they're all superficial stereotype persons.A lot of scenes could  have also been removed and we could have ended up with a much shorter and less tedious movie instead we have a very long, predictable with a lot of useless scenes movie, might it repeat again there are some beautiful shots tho. I hope it doesn't get the Oscar because there are just so many better narrated and well shot movies out there.I will end my review doing this comparison;Roma is like a picture of some delicious food that you see it and it looks just so good, but then cut the picture and realize it was nothing but emptiness and regret to ever tried"}, {"rating": "3", "text": "Roma is quite underwhelming. Its not for everyone, those in the comments below who raves about this movie probably saw something in it that i couldn't see. If we are going sentimental, there are better movies out there that portrays that emotion. This one doesn't seem to give it enough... impact. It could be the black and white scheme it went for, it could be something else. Just my opinion. Im don't watch many of these types of films, but some that i do watch has etched an impression on me. This doesn't seem to have.﻿ Good cinematography but bland protagonist and a story ive definitely seen or heard before a hundred times."}, {"rating": "3", "text": "Another Black and white? Can someone explain reasons? Some scenes are just there just to prove the director is an intellectual! However the birth scenes was a success, in contrast to the rest that feels excessively orchestrated!"}, {"rating": "5", "text": "Despite the good  directing and the good acting (not amazing !) The movie is very poor when it came to the plot, there was almost no story ! the Film just show the Normal life of any above midlevel Family and their daily routine life, waking up kids for School, absent Father and little Brothers  fight  ! I can’t believe that such a Movie can be nominated to any kind of Trophies."}, {"rating": "2", "text": "I fail to see why \"Roma\" is getting all the raves and awards it has been getting. In many ways, it reminded me of films from the 1950s and 1960s from European directors, mainly Italian, such as \"Bitter Rice\", \"The Bicycle Thief\", \"Open City\", Michelangelo Antonioni, Robert Rossellini and Victoria De Sica. The main differences are that these films and directors didn't take 2+ hours to tell their stories or linger too long even by a second on a scene whether it be a boy looking out a car window or a dog jumping up against a gate. They brought new cinematography to the screen and more depth to their stories.Maybe it has been a long time since critics/people have seen such films that reflect life between the classes or maybe \"Downton Abbey\" has given them a false picture of the same. There are little passions or emotions shown by the director/screenwriter Alfonso Cuaron.The surprising aspect of \"Roma\" is the acting debut of Yalitza Aparicio as a maid who has a warm connection to the children of her employers and though she is a presence throughout the film it only comes alive when it concentrates on her trials and tribulations.With the exception of maybe 15 minutes, I was bored during most of the 2-hour 18-minute  \"Roma\"."}, {"rating": "0", "text": "Aside from the photography that looks great, there are a lot of issues within this movie, the passing, the plot, is pretentious and unfocused. On the other hand, there are certain things that seem 'empowering' but they are the other way around, sure it depicts a lot of issues like racism and social classes which is OK but my problem is that by the end of the movie it kind of have a racist and social message within itself, I don't think that it was intentional but is there. If you don't mind that, I hope you are prepared to lose like 2 hours of your time."}, {"rating": "4", "text": "The most OVERRATED movie everThe photography and  scenary is excellent but the actations and story is so boring, have the depth of a piece of paperyou wait  great surpises but you have a great deception"}, {"rating": "3", "text": "My wife and I see a lot of movies every year -- over 100.  Usually the critics are helpful in finding the good ones.  They blew it on this one.  Collectively!  Some good photography, but usually not interesting material.  No character insights.  A waste of time."}, {"rating": "0", "text": "Using tabus to overwhelm human emotions into getting you a critical acclaim is a cheap way of making movies. I hate everything about movies like this. It's a masterpiece from the point of cinematography , but the story and its elements are straight up disgusting and unacceptable because all they meant to do to stir up the very core of your soul with sadness and empathy. Some might get off on this. I personally think movies like these should not exist, or only exist for those who seek them. Solid 0 in my book"}, {"rating": "1", "text": "Nothing short of groundbreaking! Quality cinema. And no wonder it’s taken every award for Best Cinematography - so many beautiful shots, from the smashed mug on the floor to waves on the beach, to Cleo literally brushing up dog ****Great acting, a good pacing, that can sometimes feel like a slow-burn but it all just comes together!Now, my removal of 3 points may bare unpopular opinion, but I honestly felt like not a lot happened. It was a great film, with a pensive portrayal of the life of a beloved maid in 70s Mexico. Definitely one of the best films I’ve seen in ages, but I couldn’t tell what the climax was - the baby arriving or the kids drowning. While not every film needs a “climax” to sum up a great story, I just felt this was a slightly less enjoyable watch than A Star Is Born or even The Favorite. Roma is a film with a meticulously curated series of shots that cleverly cover a thin story. A film which the critics love but the audience may struggle to enjoy. I enjoyed it... It can take every Best Cinematography award, it’s unmatched this year, but Best Picture? Not too sure."}, {"rating": "6", "text": "“Roma” is a film written and directed by Alfonso Cuaron and is his attempt to pay homage and acknowledge his childhood in the Roma section of Mexico City as well as the housekeepers that cared for him and his siblings. Filmed in black and white this film has become the choice of so many critics and award entities so I find myself again at odds with the so called pros for this film, as good as it is, is not great, nor in my opinion is it worthy of the accolades being heaped upon it. This is the story of a family, a marriage and those who kept house for them…..and that is where it all really begins and ends.So, like a fly on a wall, we watch the residents and servants interact in a really not too exciting series of mundane events as they go about their assigned chores and fulfill their designated roles. I give the film a 6 rating as I continue to wonder what the excitement regarding it is all about..Perhaps the highest award should go to the distributor’s PR firm for being able to generate such unwarranted hype and activity.."}, {"rating": "0", "text": "Every now and then a movie comes along that reviewers who want to appear sophisticated and \"in the know\" feel compelled to heap all kinds of praise upon. This is one of those movies. Boring, slow, tedious, and lame don't begin to describe it. Hate is a strong word, but it is the only appropriate one to describe my feeling towards this waste of film. I honestly don't see how any real human being could like or enjoy this movie, and I suspect that very few actually did, despite their phony reviews."}, {"rating": "3", "text": "Critics fall over themselves for another slick foamy soapy film from Cuaron, with very simple cinematographic tricks. It is obviously copying Zerkalo (The Mirror) by Tarkovsky but with far less ingenuity, creativity and poetry. Whereas Tarkovsky makes his life and his memories interesting by cleverly destroying time and space, blurring the lines between reality and dream, and making us think, think, think about our own memories, Cuaron serves a linear, egotistical, boring diaporama of his own life that didn't touch me at all. All this of course with a heavy dose of sentimentality and \"humanism\" that can't go wrong with middle-class critics.But what about the cinematography?The initial slow constant circular movement of the camera is obviously designed to clash with the perpetual zig-zagging of the little bee worker, create this extra tension and the rest is just like that. The scene of the fire is completely in line with his work in \"children of men\" with camera shifting from different points of foci in the same frame. All this is probably well crafted, and different from Hollywood, but doesn't inspire any beauty or even elicit any form of intellectual reflection.It's better than Gravity, but that doesn't say much!"}, {"rating": "3", "text": "OK, I'll say it -- when it comes to this film, the emperor is indeed naked. I'll admit that the film's stunning black-and-white cinematography is exquisite and that the scenes introducing the picture's final act are emotionally mesmerizing (or maybe it's just that I was glad that something interesting was finally happening on the screen). Unfortunately, those are about the only redeeming qualities this release has to offer. The rest is a big, bloated, underdeveloped bore that tries the patience of even the most tolerant cinephile. It's obvious this was a heartfelt project for director Alfonso Cuaron, and his personal passion is written all over it. But, given that he's dealing with uninteresting characters in largely unexplained circumstances in a time frame for which little to no context or back story is provided, he's not giving the audience much to work with other than a glib implication that essentially says \"This is authentic -- just trust me on this.\" Also, the picture's anemic attempts at incorporating philosophical and metaphysical themes show the filmmaker's got some brushing up to do in terms of effectively conveying his meaning in a comprehensible way. If you're willing to risk the time watching this, be sure to pack a pillow and a lunch."}, {"rating": "4", "text": "This Critics darling will find its nemesis with the general public. I mean, really , what is their to love. It's long, slow and largely uneventful. The baby scene and the swimming scene, which come towards the end of the film is as good as the drama gets. The most over rated film of this year which underlines how pretentious a lot of film critics are. Come back Bohemian Rhapsody their was nothing to forgive!"}, {"rating": "1", "text": "Artsy movie that gets critics all fired up. In reality roma is a hollow and booring movie."}, {"rating": "2", "text": "Character. Writing. Photography. Acting. These things make critics swoon. I prefer entertainment, excitement, originality, imagination, intensity, emotion, drama and comedy. Roma has none of those things.If you are quite young, or naive, or a film critic who goes gaga on the story of a normal sensitive young women you may like this film. If you want entertainment go elsewhere. Boring movie."}, {"rating": "7", "text": "There are a few undeniable things about 'Roma.'  It's amongst the most gorgeously shot black and white films on record, which is all the more impressive considering Alfonso Cuarón serves as the film's writer, director, AND cinematographer.  There's also no distinguishing between fiction and reality.  In particular, the actors in the movie make this slice-of-life film feel like it's a biography.  And finally, if 'Roma' indeed goes on to win the Oscar for Best Picture--right now it's certainly a contender--it'll eventually be saddled with the reputation of being undeserving of the honor, much like 'Crash' or 'Shakespeare In Love.'The bottom line is that no matter how vividly shot a picture may be  (*cough cough* Terrence Malick), without an engaging plot, everything else is just cinematic masturbation.  Lastly, a point of privilege: one reviewer fawned over Alfonso Cuarón's camerawork, setting expectations rather high.  However, while a number of sequences are indeed wonderfully shot, basic left-to-right or right-to-left pans aren't exactly innovative.  For comparison, watch 'Shoplifters' while paying special attention to camera placement and movement.  It's nothing short of extraordinary and likely the best camera work of any film this year."}, {"rating": "3", "text": "Una película que dividió opiniones en todos lados. Algunos la consideran una obra de arte, otros la clasifican como un intento de ser una película intelectual, cuando indudablemente no lo es.Yo soy del tipo de personas que gusta de ir al cine y ver una historia en la pantalla. Como se desenvuelve y como llega a un clímax y a una conclusión.No soy para nada un experto en cine, ni mucho menos. Ni tampoco soy amante de Derbez u Omar Chaparro, como muchos de los simpatizantes de Cuarón gustan etiquetar a los que no piensan igual que ellos.Hablando objetivamente, la película tiene una fotografía increíble, como todas las películas de Cuarón (obviamente este es su fuerte, no la trama. Como ejemplo, tenemos Gravity).Yalitza como Cleo hizo un buen trabajo considerando que no es una actriz.Pero de ahí en mas creo que intenta demasiado ser una película \"inteligente\" de \"arte\" con su filtro en blanco y negro que no agrega nada. En fin. Cuarón una ves mas demuestra que su fuerte solamente es en lo visual, en lo que a historia respecta es aburrida y nada especial. No por nada la mejor película de Cuarón es Harry Potter 3, porque tuvo un gran material para trabajar."}, {"rating": "10", "text": "Alfonso Cuarón  created a cinema masterpiece with Roma. Beautifully directed, excellent performances and cinematography. Cuarón balances nostalgia and sentiment just right without things getting overbearing but still gripping you. It’s a shame not more movies like this reach cinemas. In a world saturated by superhero movies and kid stuff one can only reminisce the good old times when cinema was truly in the hands of daring filmmakers with a vision. What does it say of our current movie going culture that everything is, so dumbed down?"}, {"rating": "0", "text": "After watching this film I was moved to make an account.If artsy black and white footage of cleaning up dog **** is your thing, you will love Roma.For everyone else, this is the emperor's new clothes of films. Dull, self indulgent, tripe. The cinematography is occasionally beautiful, but the story and characters are slow and dull. Very little happens, and that very little happens veeeerrrrry slowwwwwwwly.I stopped watching after about 90 minutes. I don't remember the last film that was so bad I didn't want to finish it."}, {"rating": "1", "text": "One of the most boring and pointless films I’ve ever seen. And I’m someone who enjoys “slow” movies but this takes it to an entirely new level. If you have interest in watching what feels like a documentary about a very nice yet uninteresting person where nothing happens at all, here you go. She basically just climbs stairs slowly and cleans up dog poop over and over. Drink plenty of coffee if you have any intention of finishing this."}, {"rating": "0", "text": "OMG! This is the worse film ever.. its pointless, there is no story, no acting, no color ( black and white ). It looks like a home made movie following people doing pointless stuff as cleaning, eating, driving.. just boring pointless scenes.. but because is a foreign movie we it has great reviews.. the standards for these people are extremely low that we try to give awards for this as a “ movie” and “ acting” which as a fun fact the person nominated wasnt even an actress before the movie.. this just shows how low the standards are in out politically correct world now a days. And to all the so called film “ critics “ your dishonesty is a disgrace.. if there was ever a file someone could be a critic on was this one."}, {"rating": "3", "text": "I am no expert or critic, so take my opinion for what it is.I found the movie boring and uneventful. The story telling is passive and slow. What is the point of watching a movie that is more boring than your own life?"}, {"rating": "9", "text": "I'm amazed that few, if any, critics have been talking about the great divide in this beautiful, poignant film:  The disparity between men and women.  It is a tribute to women - Cleo, the protagonist, but also all who prominently appear:  The other housekeeper, Adela, as well as the two patrician women in the household (though they are flawed, they are kind and loving overall), right down to the female obstetrician.  On the other hand, we have the men who abandon them and their families; the shooters;  the posers like Fermin who show off to a point that becomes downright ridiculous (you will remember that scene); the ones in military bands who march through the streets for no apparent reason at all ... and who of course are flying the planes that intersect the sky throughout.  In the big martial arts demonstration in the field, who among them is able to execute the pose demonstrated by the teacher?  The martial arts students are all falling over, while (did I see this wrong?  The movie begs repeat viewings) isn't it Cleo, among the women on the sidelines watching all this, who pulls it off?  Is there one likable male character here at all?The ultimate message I got was that it is women who know how to love, while men are absorbed in themselves, to the point of disruption, and the most profound effect of this disparity is on the children.  Women save and nurture while men work against them. The betrayed and abandoned wife says bluntly that women are always alone.  Here, they are in one sense - that men disrespect them and/or fail to even stick around; but the women actually aren't alone.  It's love that binds them to each other, and to the children who could not thrive without them.  What an homage to the women who made Cuaron such a sensitive director, and an exception to his gender (as he sees it) in doing so."}, {"rating": "4", "text": "Static camera and self-indulgent reminiscing?  Some bits were great but it kinda seemed like one of those Film School student films but longer.  Much longer."}, {"rating": "10", "text": "Simply the movie of the year.  A new renaissance of emotional film-making. There is one unnecessary scene that threatens to ruin the beauty of the rest of the movie, but I can forgive it because the rest of the movie is that good. Outstanding film!Update: Post-Netflix, the theater experience is superior to the television experience sadly. The sound is flat where in the theater it was immersive and 3D (such as the laundry scene and the hill scene with the animals), and the size and scale of the set really is not given its full due on a television screen. I can understand why people who saw this on their television might not get the hype, but it is so much more transporting when the sound/screen is done right. Still a great movie, but it is sad to see and understand why people are not getting the hype/why people are so fascinated and impressed with this film."}, {"rating": "10", "text": "Sublime, engrossing work. If you can't see it in theaters, lose yourself to a dark room, two hours on your laptop and a great pair of headphones."}, {"rating": "10", "text": "Roma is an astonishingly beautiful film filled to the brim with emotionally devastating and uplifting moments. Yalitza Aparicio and Marina de Tavira deliver Oscar-worthy performances, however the star of this spectacle is director, writer, editor and cinematographer Alfonso Cuaron."}, {"rating": "10", "text": "One of the best films of the 21st century and DEFINITELY the best film of 2018. This is a level of masterpiece that doesn't come around often. It is beautifully, emotionally and dauntingly shot, one of the most daring film scripts of recent times, completed by excellent performances. The direction of Cuarón balances subtle emotion and powerful sentiment in a rarely perfect manner, for any art form. It deserves to take home the majority of major Oscars this year, in; Best Picture, Best Director, Best Lead Actress, Best Original Screenplay, Best Cinematography and many more."}, {"rating": "10", "text": "Beautiful, touching. Amazing cinematography.A very smooth plot that makes the movie look like a short film how good is it."}, {"rating": "10", "text": "At this point, it's either #1 or #2 on my movie-of-the-year list. There were a couple of moments in this film when the woman sitting next to me looked over because I unconsciously let out gasps.  Incredibly emotional and beautifully shot.  Yalitza Aparicio as Cleo is incredibly good in the role.  The hospital sequence and the beach sequence were two of the best scenes committed to film in recent years.  I knew going in it had to be good when Joe Morgenstern called it the best movie he's ever seen (though I was a bit skeptical of that for a time - felt like hyperbole), and it absolutely lived up to the hype.  This is a film that demands that you see it on the big screen with other people around you.  It's a human film that requires your not seeing it along."}, {"rating": "0", "text": "This is one of the worst films I've ever watched in my entire life. I kept waiting for something to happen.A complete waste of time…"}, {"rating": "10", "text": "Cuaron's Roma is undoubtedly one of the best realistic films throughout history, I say this because you'll find yourself lost in Roma, so immersed with how things are happening in a tedious way, much like life itself, that aspect of realism is fully captured by Cuaron as he presents us with an insight so vivid and so clear and raw you could swear that you're watching a real-life events happening in front of you, it gives you the chance to observe and asses and more importantly feel and relate to strong emotions from pain to love and in a manner that is very genuine, in all honesty, Roma is something really special, I can't start to describe how into it I was, I loved how Cuaron chose his camera angels, to provide the maximum presence, it just flows naturally, again at times it feels all too real, and that right there is near impossible to capture in such manner, it takes and lot to make something so simple.The acting is spectacular, almost half the film we're presented with articulate shots that speaks volumes and doesn't need any dialogue to explain it, an also, Cuaron's attention to the background which is a story in and of itself.What I'm trying to say here is Roma is as pure as they come, it's like an untouched part of nature so beautiful and so wild, it demands admiration, so ultimately, Roma is a fine piece of craft and an extremely rare gem, I absolutely, completely, utterly, fully enjoyed and loved this film, the power of film doesn't get stronger than this."}, {"rating": "8", "text": "Roma has all the trappings of a phenomenal piece of cinema. Gorgeous cinematography, emotionally gripping storytelling and great acting as well. It's also incredibly apparent the Cuarron is at his absolute best here which considering his pedigree is almost unbelievable. However with all of that being said I did not enjoy the movie that much personally. I found it overall to be a very lonely and boring movie that just overall didn't have a lot of interesting things going on up until the last hour or so of the film. I'm almost sure this is somebody's cup of tea if you are a cinema connoisseur but I just found it hard to get through and had to watch it in about three different sessions. I'm quite sure this will be taking all the Oscars this year and I do think it's deserving of it because after walking away from it I found my still having an enormous amount of respect for it at the very least. Which is why despite my personal feelings about the movie I would be lying to not at least give it a solid 8/10."}, {"rating": "10", "text": "'Roma' is one of my favorite movies of 2018. 'Roma' is not just a movie, it's a work of art. It is sentimental without being mushy. Simply flawless"}, {"rating": "8", "text": "Roma la tan aclamada película que habla sobre una criada indígena en el año 1971,la película como tal no está mal.Esta muy bien ambientada,pero el único problema que encuentro es que la primera hora es pesada y la escena del desnudo es tan irrelevante, pero fuera de eso la encuentro entretenida más no una obra de arte"}, {"rating": "10", "text": "Roma ReviewBy Chase M\tNot only is Roma (2018) Alfonso Cuarnó’s most personal work, it’s also his best. The film grabs you from the first frame, and doesn’t let you go until the end of its 2:15 run time. Cuarón’s mastery of the camera is evident in scene. Every shot contains so much painstaking detail; you can’t help but feel the passion and commitment that went into this project. Roma, is the story of Cleo who works as a maid for a middle class family in the 1970s. The film documents a year in her life.\tBefore I discuss anything else, let me heap more praise onto what Cuarón did. To take these childhood experiences, and recreate them in such a loving way is something truly special. The writing in this film is simple yet moving. The film really made me care about, and connect with the character of Cleo. Cuarón’s cinematography is something to marvel at as well. Each shot is beautifully presented, and the lighting is top notch all the way through. I could go on about how great the camera work is, but I won’t. Just know it’s something special and go experience it.\tThe performances are all strong. Particularly those of Cleo and Sofía, played by Yalitza Aparicio and Marina de Tavira. Both embody the strong female figures that become the focus of the film. Aparicio as a first time actress is particularly impressive, she delivers a powerful performance full of emotion. The acting nominations for these two, were well deserved.\tRoma is a masterpiece. It is the culmination of all the work Alfonso Cuarón has put in throughout his career. I was skeptical going in (mostly due to the fact that it’s a Netflix movie) but I loved every second of it. This movie is a victory for foreign film makers everywhere. It’s a shame the Academy didn't pick Roma as ‘best picture’, because it deserved it more than any of the other nominees. Regardless, Roma is exceptional in every sense of the word and deserves to be experienced by anyone who appreciates the art of cinema. 10/10"}, {"rating": "10", "text": "It feels difficult for other films to be able to match — or exceed — films like Roma. It's hard to compete with this amazing film in the seasons of film awards in the coming weeks. Beautiful cinematography, strong scripts, brilliant acting, are only part of the greatness of this film. Roma, as a whole, is an amazing film and Netflix has successfully made elitist parties think again about the films released by Netflix. Netflix succeeded in proving that their own films could succeed in various film festivals with very positive remarks. No doubt, Roma is one of the best films of 2018 that cannot be missed."}, {"rating": "8", "text": "The good: Lack of Hollywood superficiality and trite conventions. This is a film not a movie. There are many situations and moments inserted that are a bit strange and memorable.The unfortunate: There is almost no character development, and no certainly no arc to the story. As the film advances the story of the wife becomes important, but she oddly is left as a peripheral character. You come away without any insight into the main character, she is almost always an onlooker with little revealed.The bad: For a film shot in black and white, it was flat- no deep blacks, and an overly warm grey palette. The cinematography was usually wide angle, which means no close-ups of faces and eyes, contributing to the visual lack of character development. It felt like the Director had a check-list of scenes drawn from mostly Italian and Italian Neo-Realism films. So while the film did not seem superficial, the effort was in the end more of a style exercise than emotional storytelling. I give it an 8 because movies today are so dreadful. This film is worth watching and discussing, but does not rise to be considered a truly great film."}, {"rating": "8", "text": "Very well done cinematically. Beautiful story but not terribly original. Entirely subtitled and therefore I assume it will be a Foreign Language contestant at the Oscars and not Best Picture."}, {"rating": "9", "text": "Intellectualise all you wish about the black and white, the nostalgia, the sentiment, the script, or whatever. I challenge you not to be moved by the human force of this movie. Ace production design, and Cuaron himself as cinematographer getting great shot after great shot, this is one of the movies of the century. Loved the opening sequence, which is simply the maid sluicing the ceramic tiles - with the totally Cuaron exception of a tiny airplane reflection in the gleaming water. He's put his best soul into this, and will never equal it."}, {"rating": "10", "text": "Just can't explain how much I liked this movie. MUST see if you're into good camera handling and good shots. Quite slow movie but that makes you enjoy it more. 10/10 for me, absolutely."}], "recommendations": ["hugo", "the_green_knight", "the_master", "cloud_atlas", "perfume_the_story_of_a_murderer", "youth", "the_social_network", "barry_lyndon", "annette", "the_american", "joker", "drive", "the_fountain", "dunkirk", "marie_antoinette", "black_swan", "all_eyez_on_me", "you_were_never_really_here", "the_neon_demon", "babel", "eyes_wide_shut", "2001_a_space_odyssey", "magnolia", "there_will_be_blood", "the_power_of_the_dog"]}