{"id": 3770, "title": "Romeo Must Die", "starring": ["Jet Li", "Aaliyah"], "runtime": 115, "genre": ["Action", "Crime", "Thriller"], "description": "Two warring gang families (one African-American, the other Chinese) maneuver for bragging rights to the Oakland, California, docks. Hang Sing and Trish O'Day uncover a trail of deceit that leaves most of the warring factions dead … or worse!", "releaseYear": "2000", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/aLjBcVUfw3eT5csKi28pvs0V8he.jpg", "categories": {"plot": 10.0, "acting": 9.333333333333334, "ending": 10.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 9.11111111111111}, "reviews": [{"rating": "7", "text": "hihivuvhugugguihugugugugjjihhhfffdddasazzccvxcvbnmohyfjbjhigydygugyfuhihugtdtdhgtsethuuuyytrfghjlmooytfhijbjgjgh"}, {"rating": "7", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "7", "text": "¤¡¤¡¤¡¤¡¤¡¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"}, {"rating": "7", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■■●■●■●■●■●¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡***************************"}, {"rating": "7", "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》"}, {"rating": "6", "text": "I've seen this film once before and I didn't think much of it but I thought I would give it another chance, but no this really isn't a film for me. It has a lot of action and fight scenes, obviously made for Jet Li, but lacks substance. The only real reason I watched it in the first place was Aaliyah, and yeah she's pretty hot in it but acting wise she isn't really up there. Honorable mention to the awkward death scenes with heart-bursting special effects  Overall it's OK, but nothing special."}, {"rating": "10", "text": "A really enjoyable movie with a really good jet Li. I know that today other movie set the bar higher but back then it was really enjoyable. It is loosely based on Romeo and Juliet but set in modern times in Oakland. There is an uneasy settlement between the Chinese and Afroamerican families who rule the streets. When the son of the leading Chinese patriarch is murdered in a provoking way a gang war is imminent. Jet Li plays the now only son of the patriarch who escape prison from Hongkong where he was jailed because he helped his father escape from justice. He moves to Oakland to avenge his brother. On his investigation he discovers some inconsistencies and ask Trish played by Aaliyah the daughter of the Afroamerican leader for help because his brother wanted to contact her before his death. That is the interesting set up. The story has some good twist and revelations I wont spoil. I was surprised that they don't put the spotlight only on action and martial arts. They deliver a good story with solid character development with believable motives. The acting alone is praiseworthy. Jet Li and Aaaliyah have great chemistry and deserve credit for their performance. It doesn't end here. Henry O as patriarch of the Chinese families, Isaak O’Day as leader of the Afroamericans and their right hand men Isaiah Washington and Russel Wong are excellent. Bonus points for Maurice (Anthony Anderson) who is used for some comic relief. All actors are well chosen. The fight scenes were choreographed by Corey Yuen. He is great actor / choreographer and you should defiantly read his resume. The fights were awesome, well choreographed with an impact and intense you can feel. They used a damage view for some hits were you see the impact on the bones. It was new at the time and spectacular. Mortal Kombat used something like this later (videogames not movie). Then there is the soundtrack. We got some pretty good tracks with “Try again”, It really don't Matter, Pump the breaks, Revival and Swung on. AT last while the movie has a serious tone they have also a good sense of humour. Especially a scene with the leaders of the Chinese families. Overall this should have received praise and regarded classic. I don't know why movies like this will be forgotten."}, {"rating": "10", "text": "forget the critics this movie was great. It had a perfect balance of action, drama and romance and I believe Aaliyah did great to say this is her first film."}, {"rating": "7", "text": "*\"*\"*\"*\"*\"*\"*%*%*%*%*%*%*:*:*:*:*:*:*:**;*;*:*:*;*:*;⊙°°☆⊙°••°⊙☆•°⊙☆•°⊙☆⊙°•☆⊙°••°☆⊙°☆•☆"}], "recommendations": ["man_on_fire", "creed_ii", "the_equalizer", "troy", "john_wick", "warrior", "blood_father", "the_marksman", "heat", "captain_america_civil_war", "tomorrow_never_dies", "fighting_with_my_family", "training_day", "lawless", "the_fighter", "captain_america_the_winter_soldier", "savages", "true_lies", "gangs_of_new_york", "top_gun", "taken", "donnie_brasco", "the_foreigner", "spider_man_far_from_home", "killer_elite"]}