{"id": 3313, "title": "Rough Night", "starring": ["Scarlett Johansson", "Kate McKinnon"], "runtime": 101, "genre": ["Drama", "Comedy"], "description": "Five best friends from college reunite 10 years later for a wild bachelorette weekend in Miami. Their hard partying takes a hilariously dark turn when they accidentally kill a male stripper. Amidst the craziness of trying to cover it up, they're ultimately brought closer together when it matters most.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ttC00xcQ5UIO04kU8y0h5OAIYYJ.jpg", "categories": {"plot": 4.266666666666667, "acting": 4.615384615384615, "ending": 4.666666666666667, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.538461538461538, "action": 5.0}, "reviews": [{"rating": "8", "text": "This spiritual successor to Bridesmaids is an excellent comedy that is well paced, with a hilarious script that brings frequent laughs and unexpected events that work on many levels. Johansson is a great lead for this brilliant cast, and the often ridiculous but thoroughly engaging storyline is sure to keep audiences entertained. The soundtrack is delightful surprise, and whilst it's not a perfect film, the humour and performances make this a wonderfully fun experience. 8.47/10"}, {"rating": "4", "text": "Rough Night focuses more on the comedy than on the story. It isn't safe to say that story is more important than comedy, but in a genre that is in the comedy section, a story is arguably needed. Basic instructions of a movie is to make a story that at least feels like a great ride on a roller coaster. In this case, they failed to give much to the story by giving the comedy more than expected. Great on paper, terrible on screen."}, {"rating": "4", "text": "This is the female cross between \"Weekend at Bernie's\" and \"The Hangover.\"  Five friends (Scarlett Johansson, Kate McKinnon, Jillian Bell, Ilana Glazer, and Zoë Kravitz) travel to Miami for a wild bachelorette weekend. The hilarity is supposed to get complicated when they accidentally kill a stripper, but that's not the case. Despite the non-stop spunky energy and potentially comic situations, there's not much genuinely funny. McKinnon turns in an enjoyably wacky performance, while Bell is like Melissa McCarthy…a little of her bluster goes a long way…and there's LOTS of it here. The whole night is amusing to watch, but more jokes die than land. NOTE: McKinnon has an amusing song DURING the credits and Bell drops a plot surprise AFTER the credits."}, {"rating": "3", "text": "Some of the dumbest characters in the history of cinema, makes up this below average comedy. I got a few chuckles here and there, but with Girls Trip out the same year it shows the flaws with this film. Also when I say dumbest I mean dumbest. D"}, {"rating": "1", "text": "Charm. Its a useful ingredient, like salt. There is none in this movie. Utterly, totally, completely none. As the negativity piles up and up and up, nothing breaks it. No laughs, no sweetness, no character development. Nada. How do put ScarJo on screen and not be fascinated? This movie answer that question."}, {"rating": "1", "text": "Really, really, really bad movie. Weak script, forced acting, with a spattering of funny lines. Kate McKinnon couldn't even save it, and frankly was not used as much as she could have been."}, {"rating": "4", "text": "The cast is attractive and dedicated, but only Johansson and Kravitz are consistent. Bell, Glazer and especially McKinnon (sporting a very annoying Australian accent) are very hit and miss, all too often ending a joke too soon or dragging it on for too long. The whole film feels like the rough draft of a great black comedy, but it ends up just being a bunch of missed opportunities."}, {"rating": "8", "text": "Well, I liked it. It's not perfect, but I did find it fun even if every joke wasn't laugh-out-loud. I'd consider buying it. The first third before the death is the weakest part. The weakest jokes dominate this segment. Also, the character traits and their paths are all obvious, I admit this. But after it hits the fan, things get crazy. Things get increasingly insane throughout. Watching the characters panic and act weird was entertaining. As always, Kate McKinnon steals the show as the oddest one."}, {"rating": "7", "text": "Easily one of the most underrated films of the summer. I laughed pretty consistently throughout. The supporting actors killed me - esp Ty Burrell and Demi Moore destroyed."}, {"rating": "3", "text": "There is some talent in this movie, but the script and writing are just terrible. The film is a mixture of drunken bachelorette tropes mixed with bachelor party tropes. Hey they accidentally kill a stripper at the party. Their attempts to deal with the dead body are stolen from Very Bad Things and Weekend and Bernies. The director/writer Lucia Aniello also has to throw in some man bashing and ham fisted feminism. The male characters in the movie as emasculated, effeminates who oh and ah over wine tastings. The other men are criminals. There is also a plot of two of the friends being former lesbian lovers who reunite. Perhaps all of the flaws could be overlooked if you gave a **** about any of the women. Only Kate McKinnon's character is even remotely likable and brings the most humor to the group. The rest of them are selfish, egotistical, jerks. They also never get any sort of comeuppance. Their multiple murders just get washed away with some hand waving and everything keeps going. There is no remorse, no real growth, no humor. Thumbs down."}, {"rating": "5", "text": "Let me be perfectly clear.  This is a terrible movie that has a couple of laughs.  Some of it is so stupid, I had to laugh at how stupid it was.  Everything is way over the top.  The performances aren't bad, but the dialogue is middle school and the plot is ridiculous.  I asked the ladies I was with what they would give this movie on a scale of 1 - 5.  Four of them gave it a 1.  I gave it a 2 and one other gave it a 3.  Usually when critics hate a movie, users like it.  But, this one seems to be universally disliked.  Be advised.  Wait to see it when it comes to Netflix or DVD."}, {"rating": "3", "text": "Wouldn’t be nice if there was an American mainstream comedy – you know, one of those dirty ones, resembling, say, „The Hangover“ – but with girls instead of guys?I mean, all-girls remakes are getting quite hot right now, 2016’s „Ghostbusters“ gathered nearly 230 million dollars – probably not enough to turn profit, probably, but still. Also, there’s „Ocean’s Eight“ coming in June 2018, and we could capitalize on this by producing a quick comedy right now, yes? „Colossal“ garnered good reviews too, so what’s not to like, eh?All we need is some sweet but sexy star on the lead – I know, Scarlett Johansson can do it, she is only the most profitable actress on the planet now but still so down to earth and everything, and I bet she would like to do something quick and fun between all those superhero projects.Oh yeah, we need four more girls… How about a*„kind of fat but kind of pretty“ one,* token „black but not too black“ one (played by the daughter of Lenny Kravitz, no less!) that every mainstream comedy needs,* Australian one so we can make fun of her accent,* and the edgy one, because what we’re doing is so edgy, right, girls? Of course it is.So the producers had everything they wanted. It surely means that the result is something cool because having girls instead of guys is surefire way to comedy heaven already, no?Well… no. „Rough Night“ sucks. It’s the second suckiest movie I’ve seen this year, right after the sequel to „50 Shades“. Don’t be tempted by more or less OK trailer, the movie’s bad.They don’t have almost anything that we enjoy about this kind of raunchy comedy. No inspiration, no decent acting (everybody feels tired, uninspired and/or just not funny), no good vibe, chemistry or flow between players.I didn’t even laugh once which is really rare for me when I watch a mainstream dirty American comedy. I am a bit of a fan of the genre.If you endure the whole movie, you may want to check out the two additional scenes in the end, the first during the credits, the other one after them. The second one is not bad, actually, and paves way for a possible sequel. Not that you’d need one, or the box office results encourage now.Oh yeah, I remembered something. There is actually one pretty cool thing about „Rough Night“ – the unexpected appearance by certain former female star and current star of the popular sitcom „Modern Family“.But they don’t have enough screen time to justify the ticket price or 101 minutes of your life."}, {"rating": "0", "text": "Irresponsibly shows this hip young ladies engaged in perverse harmful behaviors. How destructive for young girls that will see this movie. Film makers such as these will be held accountable when this life is over.\"“It is impossible that no offenses should come, but woe to him through whom they do come! 2 It would be better for him if a millstone were hung around his neck, and he were thrown into the sea, than that he should offend one of these little ones.\" Luke 17:1-2"}, {"rating": "10", "text": "I went with a big group, and everyone really enjoyed this film.  Lots of laugh out loud moments!  Yes, it does sound derivative from the trailer, but it was unique. Stellar cast really pulls it together.  Funniest comedy I've seen in a while in the theater.Perfect date night movie or girls night out."}, {"rating": "8", "text": "Usually I like films that are easy with critics but this is exceptional....cast especially Kate McKinnon are attractive and the film's flow never drops for a long time"}, {"rating": "8", "text": "let me start by saying I am a single straight guy who went to see this movie based on some of the cast and I can mostly say they didn't let me down ' kate mcinnion was a riot along with a coupel of others ' this is the funniest movie I have seen all summer so far it might not be brilliant but its hilarious and that's what makes it what it is its not trying to be something its not just a laugh out loud brainless comedy"}, {"rating": "6", "text": "Bachelorette gone wrong!This kind of girls night out flicks are not fun anymore. Yet it is hard to ignore them from watching. So I watched it not expecting anything special out of it. And I did not get any. But... it was okayish. Moreover, Scarlett Johansson was the main reason I wanted to watch it. You can't always do superhero, action films. This is something offbeat. Often need to take this path, no to fail miserably, but to relax from the mainstream. So this was enjoyable, but not by all.It is like the female version of 'Hangover'. Five friends go to Miami for one of theirs bachelorette party. It's supposed to be fun without any rules, but a disaster strikes in the early and makes them to cover all the evidence. The night turns their worst nightmare ever. How they manage to come out of it are the remaining film that revealed with a twist at the end.The reception was as expected, but it was not that bad if you are seeking only a timepass. It ended like there could be a sequel, but now it seems very unlikely. One of the issues with the film is it was so traditional narrative. With so many jokes repeated from other flicks. The majority won't approve that. As far as I think it is watch and forget kind of film. An average film. Disliking it does not change what it is!6/10"}, {"rating": "4", "text": "Oooh girl, this is a hard one to get through. In the 90 or so minutes of this movie I laughed maybe twice, but overall it was such a horrible mess of a film, clearly made on the popular wave of Bridesmaids."}, {"rating": "1", "text": "\"Rough Night\" is populated by uninteresting characters, jokes that don't land, a haywire plot, terrible acting, a weak script, and an overall bland tone."}, {"rating": "6", "text": "Actually it was above my expectation also its funny and enjoyable youwon't get bored watching it , I wish comedy movies be as good as the80's where you could easy laugh to rather than just talking badwords which  considered as comedy !"}, {"rating": "8", "text": "I think it was a really fun comedy with lots of unexpected twists and it didn't involve too much of potty humor etc, which most of the comedies nowaday do and come out being just dumb."}, {"rating": "5", "text": "\"Rough Night\" was a very funny feminist film, but a little predictable, and we do not know how Scarlett Johansson has done to get to act, this kind of comedy, rude comedy with alcohol, drugs, and body parts jorks, but in the end, I enjoyed it, although the pace was not so fluid."}, {"rating": "6", "text": "A slightly boring and highly unoriginal take on the \"night out gone wrong\" story-line, Rough Night manages to make good use of its talented cast, who deliver countless laughs that help make up for the film's many weak moments."}, {"rating": "6", "text": "Starts off great but loses its way a bit, \"Rough Night\" remains a relatively entertaining night at the movies. The ensemble cast help carry it through some of its more \"rougher\" moments, and it delivers a few genuine laughs."}, {"rating": "6", "text": "Taking into consideration that this movie was a comedy, I can only rate it 6/10. Because it's humor it's mostly hit or miss. Which means there are a lot of great laugh out loud moments but there is also a lot of awful and unnecessary jokes. The pacing of the movie is slow, so at the beginning it's boring. But it quickly picks up,but then at the end, it's a **** no good, and basically non existent conclusion, which is also cliche and cheesy at the same time. Which is bad. The actors where OK, and delivered pretty good, but the writing was also lazy. So overall this is an average comedy, and even worse movie."}, {"rating": "5", "text": "It was certainly a predictable movie. I thought I was going to love it because of the cast, but I was wrong, it wasn't anything like I was expecting. It was also a very feminist movie as well. I am a college student, however, I am married and I feel that it gives off the wrong idea for what college students and bachelorette parties should be like."}, {"rating": "6", "text": "This movie was way over the top... some of things had me dumbfounded... like they all simply lost all common sense & reasoning... it still had it's funny moments but it was more like \"wooooow really\"."}, {"rating": "10", "text": "I think this movie is destined to become a cult classic. One of the funniest movies I’ve ever seen. I didn’t know it existed, it was just randomly on Comedy Central. I loved it."}, {"rating": "2", "text": "This is by far the worst movie I've seen in the last 5 years, maybe 10. The characters are painfully stupid, making one stupid decision after the other in a progressively worsening \"comedy\" of errors. There is no humour in this, in fact it's not funny at all and the subject matter is extremely tasteless and shallow. It was a complete waste of data/time. This movie really shows how dumbed down people have become. It stoops very low. have become"}, {"rating": "5", "text": "Not much to say here other than its a little forced but not a terrible movie. It definitely had its moments."}, {"rating": "7", "text": "It did have some funny moments, but not particularly memorable. Then again, my wife watched it three times within a few days, so maybe I'm not the target audience."}, {"rating": "4", "text": "Jakiś taki dziwny.... Niby śmieszne,ale jednak żałosne... Jeżeli już totalnie nie będzie nic w tv, to może wtedy oglądajcie."}], "recommendations": ["neighbors_2_sorority_rising", "identity_thief", "baywatch", "neighbors", "the_hangover", "the_watch", "30_minutes_or_less", "this_is_the_end", "jexi", "ted_2", "hall_pass", "knocked_up", "the_wedding_ringer", "the_change_up", "what_happens_in_vegas", "thunder_force", "couples_retreat", "jackass_presents_bad_grandpa", "a_million_ways_to_die_in_the_west", "the_spy_who_dumped_me", "sex_drive", "trainwreck", "the_happytime_murders", "sex_tape", "the_hangover_part_ii"]}