{"id": 4258, "title": "Run", "starring": ["Sarah Paulson", "Kiera Allen"], "runtime": 90, "genre": ["Thriller", "Horror", "Drama"], "description": "Chloe, a teenager who is confined to a wheelchair, is homeschooled by her mother, Diane. Chloe soon becomes suspicious of her mother and begins to suspect that she may be harboring a dark secret.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/ilHG4EayOVoYeKqslspY3pR4wzC.jpg", "categories": {"plot": 6.352941176470588, "acting": 7.3, "ending": 5.666666666666667, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 8.666666666666666}, "reviews": [{"rating": "10", "text": "Intrépida, audaz e intrigante. Una historia muy buena ejecutada brillantemente a la perfección llena de detalles y giros inesperados; las actuaciones y la banda sonora son otros factores que vuelven a esta película una verdadera joya del 2020"}, {"rating": "6", "text": "It is just extremely predictable. Not bad, just generic. You will see each next plot line coming a mile away.The ending for me was such an anti climax. If they would have made it more impactful i might have raised my score a little but nope. Overall i didn't mind it."}, {"rating": "8", "text": "Originally intended for release in theaters this smart, intense thriller was sold to hulu and premiered Friday. The brilliant Sarah Paulson (American Horror Story) stars as the mother of a supposedly sick child that she's spent 17 years taking care of her. The young woman Chloe, played by solid newcomer Kiera Allen begins to suspect her mother may be the one keeping her sick. The movie is intense and edge of your seat filled with clever twists and turns. Although the material is familiar its executed creatively by Aneesh Chaganty of the criminally underseen Searching. This would have been great in theaters but is still damn good at home. ****/5Eric: ****.5/5"}, {"rating": "8", "text": "This movie was actually very good! New concept, great storytelling, solid cinematography, it wasn't boring, and it had super good acting. I already knew Sarah Paulson was phenomenal because she's a great overall actress, but wow... Kiera Allen's performance was AMAZING!! An overall great Thriller."}, {"rating": "9", "text": "A smart thriller that intentionally keeps its plot simple, letting the performances shine."}, {"rating": "9", "text": "A straight-forward thriller/horror film that is in the same vein of Misery, What Ever Happened to Baby Jane and Mommie Dearest. Sarah Paulson, of course, is excellent."}, {"rating": "7", "text": "Even with a good story, in the end, there is nothing that we have not seen in Hollywood."}, {"rating": "7", "text": "+Echoes of misery and psycho+Superb tension building and suspense sequences+Excellent cast+Memorable sequences-Predictable plot beats throughoutI was surprised and entertained far more than I expected to be. If you're a fan of the horror/ thriller genre then this will entertain."}, {"rating": "10", "text": "It's such a refreshingly unique thriller that doesn't stop putting me on the edge of my seat. The simplicity of the plot doesn't derail the tension at all, because the core idea is just so great, and the acting is totally on point. Please watch it! Highly recommended. It's on the level or maybe even transcends thrillers like Don't Breathe."}, {"rating": "8", "text": "I watched a lot of movies and it had been a long time (over the pandemic year/s) since I have seen such a gripping thriller involving a family. In Run, a mother and a daughter's relationship starts to strain when the latter suspects her mother is doing ill on her. As you continue to guess what it might be, Run takes you by surprise. It delivers the goods and it keeps you hooked till the last second. Go, watch it already!"}, {"rating": "4", "text": "A thriller for rookies. I can't explain it any other way, since the suspense it builds is basic AF.Unluckily for this film its story is too thin and it relies a lot on the protagonist's disability in order for it to work.It's basically like Misery because it ties the character to being unable to be more proactive in her escape due to her physical limitation, which the film manages to move at certain points so that the story progresses.The problem is when you realize the enormous simplicity of its plot twist, and the empty background that is provided to the characters. And if you add that Sarah Paulson overacts too much, the little that Run achieves as a film of tension, it's just wanting to know where the thing is going to end; whether the girl escapes or dies, beyond that, there's no narrative satisfaction in its resolution. The revelation here, ends up being Kiera Allen, who manages to give authenticity to her anguish and who's also a true wheelchair user, so that's points for inclusion. For the rest, again, as I said, unless you're beginners in thrillers, you can argue that its suspense is effective, for my part, I found it totally missing.Significantly disappointing."}, {"rating": "8", "text": "Confusing Ending, Average Storyline but the Actress is strong acting.Really Fun and Well MadeThis was such a good thriller. I think it was one of the most effective ones that i have seen this year.It was defiantly a fun, hour and a half popcorn fun movie but i think it was just that little bit extra too. The filmmaking was above that for me. It just had that little bit of extra care put into it and i think it made all the difference.The acting was really great from both of the leads. I was really impressed with Kiera Allen. This was her debut film and i think this will net her even more roles because she was fantastic.I found the score really great too. It really worked together with the script and filmmaking to really get you into the film. I appreciated it.You should definitely watch this, its really fun, supper quick and well made."}, {"rating": "8", "text": "I really dug this and did not expect to. It gets going right away and doesn't look back. The pacing is excellent. While there isn't non-stop action, you still feel very engaged and don't want to miss a thing. I really dig the tone at the end. Very fitting."}, {"rating": "8", "text": "Exciting until the last minute due to the excellent performances of the actors. Sarah Paulson, with her acting skills as the mother, has carried the film with character traits that are almost sinister. Furthermore, the story had an excellent pace without the feeling of being rushed. The movie was worth it!"}, {"rating": "3", "text": "Well, Streamers, it seems that this season there will be new movies coming out like bargain hunters on Black Friday, except it’s still mostly online. Hulu premiered a thriller, Run, starring Sarah Paulson and Kiera Allen this week. The sinister tagline of this movie is this: You Can’t Escape a Mother’s Love. Hmmm… let’s see.Run is the story of Chloe Sherman (Allen), a wheelchair-bound homeschooled 17-year-old, whose mother, Diane (Paulson), is consumed by caring for the teen and is overprotective. Diane provides Chloe her medications, physical therapy, sets a strict educational curriculum and a stricter diet to manage all of Chloe’s ailments. As Chloe awaits acceptance from the colleges she’s applied to, Diane begins to tighten the already constricting reins; and Chloe begins to question her mother’s motives as things stop adding up. A sick child, who wants more freedom, and an overprotective parent, who resists at every turn – c’mon, you know where this is going.Run is directed by Aneesh Chaganty, who wrote and directed the very engaging and original Searching (2018), which was similarly a thriller about a parent-child relationship. Unfortunately, Run isn’t even trying to be original. The twists are predictable and the turns are laughable. It fits right into the canon of Lifetime “Original” Movies of paint-by-numbers thrillers. The best part of this film is the feature debut of Kiera Allen. Allen is feisty and curious enough to make what her character does understandable, but the movie itself is just too obvious and ridiculous to be believed.Ultimately, there’s nothing to run to in Run. If you’ve see one Lifetime movie, you’ve seen them all. Run does nothing to improve on this story. Although it’s less than 90 minutes, your time could be better used this weekend catching up with your family or friends or shopping online. Give Run one popped kernel, if you must."}, {"rating": "8", "text": "A good movie but extremely predictable. If you're a horror movie fan you'll have the plot figured out within the first 5 minutes. Otherwise it is scary at what it does and it puts forth a coherent little story."}, {"rating": "7", "text": "Un thriller bastante bueno; la trama es buena y las actuaciones de Sarah Paulson y Kiera Allen son excelentes."}, {"rating": "7", "text": "Highlighting the good acting and the handling of the camera, Run is a film that will keep your hair standing on end in many moments, despite the fact that the script does not explain some things that happen."}, {"rating": "3", "text": "Horribly-acted woman loses her baby, steals someone else's, raises it, poisons it to the point of being wheelchair-bound and then, gets upset when it wants to go to college."}, {"rating": "10", "text": "Why is this consider a thriller? There's no thrill in this movie, it's terrifying. This should be labeled a horror, this is Psychological Horror at it's finest and I loved it."}, {"rating": "9", "text": "Psycho movie...! Like it for sure... Will creat a tension cloud..and very engaging movie .!!"}], "recommendations": ["i_see_you", "the_call", "before_i_go_to_sleep", "the_next_three_days", "the_good_liar", "orphan", "the_rental", "man_on_a_ledge", "a_walk_among_the_tombstones", "summer_of_84", "split", "the_invisible_man", "10_cloverfield_lane", "the_little_things", "marrowbone", "a_simple_favor", "the_black_phone", "ready_or_not", "gone_girl", "the_others", "the_uninvited", "bad_times_at_the_el_royale", "prisoners", "insidious_chapter_3", "the_lodge"]}