{
  "id": 3089,
  "title": "Run Hide Fight",
  "starring": [
    "Thomas Jane",
    "Radha Mitchell"
  ],
  "runtime": 109,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "A 17-year-old girl uses her wits, survival skills, and compassion to fight for her life, and those of her fellow classmates, against a group of live-streaming school shooters.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/wlP25H14OvKoFORIwuKomZzioA5.jpg",
  "categories": {
    "plot": 9.631578947368421,
    "acting": 9.48,
    "ending": 9.666666666666666,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 9.0,
    "funny": 9.5,
    "action": 9.652173913043478
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Great movie! Well written, well produced, enjoyed it very much - especially for Daily Wire's first foray into movies!I wonder why the critics don't like it... Hmm..."
    },
    {
      "rating": "10",
      "text": "Very, very intense movie. First time in a while that a movie has kept my eyes and emotions locked in. The movie took a huge risk to create a story surrounding the topics it did, and completely hit a home run.  I haven’t rooted for a main character like that since watching Lord of The Rings for the first time. Well done."
    },
    {
      "rating": "8",
      "text": "DO NOT TRUST THE CRITICS Honestly, I thought this was a fun and enjoyable watch. Yes, it is disturbing and is not easy to watch especially the first half, but it is entertaining. There are a couple of issues I found that did not help, for instance the parts where the mom came are not verry good. Some of the acting is not all ways on point, and the villains lack in character development. Overall 81/100"
    },
    {
      "rating": "10",
      "text": "As soon as I saw the trailer, I was excited. (Covid lockdownitis?) A teen die-hard doesn't do this movie justice. Zoe Hull (Isabel May) is a badass, but doesn't shove feminism in your face. She's got issues & isn't doing too well. I didn't see this movie as a conservative or 2A flick. Just a darn good action film. I found my fist repeatedly flying in the air, & \"Eff Yeah!\" escaping my mouth.We can all have the hard choice to Run, Hide, or Fight."
    },
    {
      "rating": "10",
      "text": "This movie is really good. I came in with expectations of trying to push a conservative agenda, but that really never happened. While it does subtly promote 2nd Amendment rights, it never really goes beyond that. A lot of suspense, and I was biting my nails the whole time. The ending is a bit iffy but the movie as a whole is raelly great."
    },
    {
      "rating": "10",
      "text": "This movie was awesome, it brought me back to the same thrilling emotionally stirring feeling that u had during iron man/spiderman when I felt as if I could really be a hero, it was a movie that instilled values not to give up and to always fight for what's right, even when its not easy too, or SPOILER ALERT, WHEN I LITERALLY HAVE BULLETS IN MY BODY.  Zoe, the main character caught against all odds to save her entire school, she was exceptional, and the daily wire is amazing for publishing this exceptional movie. I was lucky to catch the free screening on youtube for the release and it brought me through the ride of my life. This movie invoked some real sadness touching upon zoes relatio ship with her deceased mother from the intro, and as the story progressed it built up to the heroism which I felt she portrayed perfectly. 10/10 for such a fantastic movie."
    },
    {
      "rating": "10",
      "text": "Excluding movie, great acting, gripping plot and interesting back story. Must watch!"
    },
    {
      "rating": "10",
      "text": "This is a solid action film. It was well written and acted. It reminds me of Death Wish, but starring a teenage girl. I think the only reason that some reviewers don't like it is that it has a pro-gun message. There is so much woke messaging in Hollywood these days (on purpose) it's good to see a movie that doesn't do that. I enjoyed it, and so did most real viewers, Hollywood critics be damned."
    },
    {
      "rating": "10",
      "text": "Ignore the political affiliation of the people releaseing this movie when you go into it.  That has nothing to do with the quality of the movie.This film is hard to watch, given the subject matter.  Especially since it doesn’t pull any punches.  But man does it draw you in, keep you on the edge of your seat, make you root for each and every good guy and neutral party, make you desperately want to see the main bad guy fail, and leave you wanting more.  It’s also not quite as unrealistic as some people say.  Individuals do go up against violent offenders.  Some people are willing to risk themselves to save others, if the opportunity to overcome is presented.  This movie makes you think of those people.I’m not surprised by the poor critic ratings...or the glowing viewer ratings.  It’s seriously amazing, and I can’t wait to see what these guys come out with next."
    },
    {
      "rating": "10",
      "text": "I loved so many things about this movie. There was enough to please both my husband and me. It was equal parts action and emotion, making you feel a wide variety of things from happiness and relief to hopelessness and fear. The main actress who plays Zoe is fantastic, she is truly a talented artist that captures you and brings you into her world. It was also the perfect length, not too long and just right to portray the story. I have never seen a movie like this before and it really made me think about our future. This movie brings up so many topics of conversation about our school system and the protection of our children while under their care. It got my husband and I talking about it after. Give it a watch with an open mind. It's graphic but very realistic."
    },
    {
      "rating": "9",
      "text": "Riveting film with solid acting and depth of substance than many current films can’t claim."
    },
    {
      "rating": "10",
      "text": "I thought they did well giving a backstory to the main character in the very beginning, without having to do flashbacks, or fillers. The antagonist of the film where also very clever in setting up their plan, and executing their objective. The main protagonist certainly have great traits, such as leadership, courage, and a cunning personality."
    },
    {
      "rating": "9",
      "text": "Well written, acted and shot action movie. A suspenseful thriller that's a must see, no doubt!"
    },
    {
      "rating": "10",
      "text": "Fantastic Movie. Great acting and the suspense left my eyes open the entire time."
    },
    {
      "rating": "10",
      "text": "Great movie! Really good acting and directing. My only complaints is that I don’t think the news media would play a live stream of such events, but it helps with the point the writer is making about fame. This movie is really well put together and it tells a great story of bravery."
    },
    {
      "rating": "10",
      "text": "The only reason for the low critic score 13 is due to who made the movie... It is a really good movie user score 9.5"
    },
    {
      "rating": "10",
      "text": "Intense and gripping. I was glued to the screen from beginning to end. It's nice to be able to see a thriller that drags you into the story and doesn't boot you right back out with the usual ham-fisted, sociopolitical messaging that Hollywood has been spewing out for so long.Don't take my word for it, see Run, Hide, Fight for yourself."
    },
    {
      "rating": "8",
      "text": "Suffers from some stereotypes of thrillers like having no idea how guns work. But has one major appeal, that of escapism. Celebrate the hero, demonize the perpetrators. No political messaging getting forced down your throat."
    },
    {
      "rating": "9",
      "text": "With limited choices of good movies while sitting in lockdown, I thought “why not?”. I had low expectations going in, and I have to say, this film completely had me enthralled and entertained. The production quality was fantastic. The actors were engaging and believable. And the plot, as well as the action, made the 1hr and 45 min fly by. I’ll admit, lately I’ve struggled to get through movies without falling asleep (odd for me to admit in a review). But, this is the first movie in a long time I’ve been engaged the entire time. I can’t recommend it enough."
    },
    {
      "rating": "9",
      "text": "For the Daily Wire's first entrance into the entertainment industry, this is a surprisingly good film. The stated purpose of this movie is to provide entertainment to compete with Hollywood so that all of the entertainment you get doesn't come from people who have absolute disdain for middle America.As such, they wisely sidestep the preaching and the social cliches in favor of engaging characters, excellent performances, and an attempt to foster independent thought and discussion about the real-world conventions here. My only nitpick is that the ending is a tad anti-climactic, but the build-up throughout the movie kept me on the edge of my seat, and seeing the way students and teachers responded really hit hard at a few points.The Hollywood critics, of course, despise it because they can't handle competition either in the entertainment business or in political beliefs, but don't blindly take their word for it. See the movie for yourself and decide whether this kind of competition is worth supporting. If nothing else, it will definitely keep you entertained."
    },
    {
      "rating": "10",
      "text": "Solid film that tackles a tough subject with real style and gut wrenching rawness, both emotionally and cinematically."
    },
    {
      "rating": "10",
      "text": "The film was excellent. It tells the story of a heroine who uses the skills her father taught her to fend off a school shooting scenario. There is no shortage of suspense and action as the heroine fights to save her classmates from being killed by school shooters.  It touches on some of the current problems with society and the risk it poses to youth at schools by not having a \"good guy with a gun\" to protect students in an active shooter scenario."
    },
    {
      "rating": "9",
      "text": "Intense is all I have. Keep you on the edge of your chair 85% of the movie. Not to watch before bedtime as your heart pounds too much."
    },
    {
      "rating": "9",
      "text": "Great movie. Production is not as high scale as other big hollywood movies but Its a must see"
    },
    {
      "rating": "10",
      "text": "Great non-political movie by the Daily Wire. Don't listen to the critics! Watch it if you can!"
    },
    {
      "rating": "10",
      "text": "An intense, captivating movie with dark themes and messages. The action is very well done and keeps your eyes on the screen, the acting is very solid across the board, my only problem is some of the dialogue comes off as cringey or unrealistic."
    },
    {
      "rating": "10",
      "text": "Started watching with low expectations but I was blown away by the quality of the writing and the acting. Run Hide Fight is a brilliant film with a terrific cast. This movie kept me on my toes the entire time, and it’s depiction of the events is incredibly realistic and respectful."
    },
    {
      "rating": "8",
      "text": "Good movie, there's a few parts that was not exactly realistic but was in the realm of what could happen so I think it's a 8/10."
    },
    {
      "rating": "10",
      "text": "This movie was phenomenally written and produced. I enjoyed every minute of it."
    },
    {
      "rating": "10",
      "text": "An action-packed thriller.. A must watch for everyone, highly recommend it."
    },
    {
      "rating": "10",
      "text": "This movie was hard to pause. Thank you for putting a movie out that was entertaining but thought provoking. We would love many more of the types of movies."
    },
    {
      "rating": "9",
      "text": "As soon as the first shotgun blast rings through the air you are in the edge of your seat wondering if that really just happened. Action was realistic (young girl doesn't magically overpower men larger than her), the acting was top notch, and the story is both well written and believable.Critics dislike the movie simply because it does not throw in politically correct propaganda to keep the woke happy and it was produced by a conservative company (although this movie is not political in any way). Remember, if the audience score is high and the critic score is low, chances are it is a great movie."
    },
    {
      "rating": "10",
      "text": "Great movie… Slowly builds up suspense and does a great job of character development. Zoe is a pillar of women’s strength.  It’s a little edgy… So I can’t show it to my daughters quite yet. But this movie screams girl power!"
    },
    {
      "rating": "10",
      "text": "Riveting from the beginning.  So new and refreshing to actually see the depiction of a young, strong, brave female lead character.  Current and on-point regarding the effects and saturation of social media to the detriment our culture.  Superb acting and directing. As usual, we need to filter the biased critiques as irrelevant.  But beyond all of that it was a powerful, exciting and emotional movie worth 10 stars!"
    },
    {
      "rating": "10",
      "text": "While by no means a perfect film (dialogue near the end seems frightfully forced) this is a very good movie and highly recommended. The action is well-paced, and, for the most part, believable. Great acting, cinematography, sound is a little spotty, or, maybe it's just these old ears. Not for kids. Oh, and, poor Bambi."
    },
    {
      "rating": "9",
      "text": "Edgy and relevant. Surprisingly well executed given limited budget. I found the film disturbingly visceral and am sure it will have it's fair share of detractors. Otherwise, enjoy a film from an alternative media source, the Daily Wire."
    },
    {
      "rating": "10",
      "text": "On the edge of my seat excitement... Zoe is a young female John Wick! I truly appreciated a good action film but all of them have too much nudity, sexual content, and pole dancers - this one does not, just packed full of action and drama. This film is graphic and scary but raw and really puts the viewer inside the of a mass shooting. I will be waiting on a sequel."
    },
    {
      "rating": "10",
      "text": "Movie is a solid 8.5 but since it will get smeared for no reason,  other then its from the daily wire, I have to give it the full 10. If you want a thrilling action movie this is for you. Best part no political messages from either side, just an entertaining movie to enjoy"
    },
    {
      "rating": "10",
      "text": "Run Hide fight felt genuinely real and the acting felt too real. I know people will have a hard time watching this but it's certain that in today's culture we are disconnected with what happens in the real world and by putting us in their shoes it felt honest and a wake up call. on top of that it was thrilling and an emotional movie without trying too hard to be."
    },
    {
      "rating": "10",
      "text": "Fabulous movie!  Things like security guards that don't have guns.  Locking kids in rooms like sardines to be shot at instead of getting them out safely.  Talking about how social media is ruining our children.  Subtle hints.  Great acting.  Just a really good movie that kept me glued."
    },
    {
      "rating": "7",
      "text": "Overall movie is good enough for a movie night movie.  The acting in the movie is good.  The movie is well shot.  Loses a few points on dialogue. Also loses a few points because some situations are a bit contrived to get certain confrontations in the movie."
    },
    {
      "rating": "7",
      "text": "Not a fan of these types of movies but this was well acted and exciting to watch"
    },
    {
      "rating": "10",
      "text": "A great start from Daily Wire to inspire us.  Looking forward to more movies from Daily Wire.  Hollywood expects very little from its audience except to push a political agenda.  No political agenda here.  Lead character has depth and there are no typical Hollywood high school caricatures, Hollywood copy/paste plot twists, or Hollywood standards of Wokeness.Art for art's sake."
    },
    {
      "rating": "10",
      "text": "Run Hide Fight was better than I anticipated it would be.When I first saw the previews for this movie, my first impression was that it looked really good. However, I had an undertone of hoping that it wasn't going to be corny. I was not disappointed! I would pit this movie against any of the other thrillers out right now, or recently released.This movie also exposes some of the problems with most school systems' standard protocol in response to emergency situations to this day, which I find to be valuable conversation-starters.I hope to see more movies like this come out in the near future."
    },
    {
      "rating": "10",
      "text": "I love it! Ultimate Girl power! It had me bitting my nails, screaming at the screen and a little crying. I really enjoyed it!"
    },
    {
      "rating": "10",
      "text": "This movie is engaging and very \"edge of your seat\". The acting is awesome and it promotes the idea that one can fight back and shows how stupid the policies that are in place in many schools are.  Ignore the paid critics, their agendas are clear, they don't like it because it doesn't condemn gun violence, if your a pansy leftist you might not like it but it really is a good movie."
    },
    {
      "rating": "10",
      "text": "Fantastic Movie. No matter who you are or what you believe. The acting is incredible and the plot kept me on the edge of my seat the whole way through. Highly recommend."
    },
    {
      "rating": "10",
      "text": "It was great, the movie is deep and seems to be made accurately with a focus on what actually happens during these situations. I also really appreciated how they show why the shooting took place"
    },
    {
      "rating": "8",
      "text": "Ignore the news, it’s a solid movie. RHF had a great young cast of upcoming actors who put on a great performance. the story was intense keeping you on edge the whole time and realistic. love zoeys inventiveness and ingenuity throughout the film. Movie dealt with interesting questions around school shootings, social media, guns, self responsibility etc. For a film with a small budget it is was a great watch and better than anything i’ve seen on netflix in the past couple months"
    },
    {
      "rating": "9",
      "text": "This is an adult, intense movie that probably shouldn’t be viewed by anyone under the age of 16, and for the 16-18 year olds it should be viewed only if they are mature and accompanied with a serious discussion with the parents.  The movie certainly isn’t perfect: it at times stretches credulity and some of the writing is a bit fake.  However, it is still a very engaging and emotionally compelling movie.The story centers on a school shooting from the perspective of one of the victims.  This makes for an uncompromisingly intense experience right through to the end.  May is spectacular in her role, which is demanding and emotionally deep. Each of the young adult/child actors does an incredible job in this film in making you believe, and understand, what they’re going through...even those playing the villains, all but one who is fleshed out.  As I wrote above, the movie has flaws, but it is surprising to see the critics hate this movie as much as they do.  The best I can figure, they hate the movie not because of its artistic statement or the craft in the work, but because the writer/director has made some movies with politically right leaning values and one producer has been accused of sexually assaulting a 16-year old.  Despite being distributed by the right wing media company The Daily Wire, the movie is not political in any way.  It can be enjoyed by anyone regardless of their political beliefs because the movie doesn’t preach or force or even make any political statements.  It is merely a compelling story of a culturally relevant topic.  The biggest difficulty for someone looking to legally watch this movie in North America is that it does require a subscription to The Daily Wire, a right wing media outlet owned and created by the controversial Ben Shapiro.  The movie will not be enough to entice politically apathetic or liberal minded people to join.  But if you are conservative, libertarian, or a free thinker and interested in politics, the movie might be good enough for you to sign up for a trial run and see if there is anything else on the site which interests you."
    }
  ],
  "recommendations": [
    "chappie",
    "equilibrium",
    "the_kingdom",
    "nerve",
    "guns_akimbo",
    "fight_club",
    "limitless",
    "v_for_vendetta",
    "end_of_watch",
    "code_8",
    "zero_dark_thirty",
    "lucy",
    "antebellum",
    "taken",
    "sucker_punch",
    "no_country_for_old_men",
    "what_happened_to_monday",
    "elysium",
    "the_lobster",
    "jarhead",
    "children_of_men",
    "the_butterfly_effect",
    "the_13th_warrior",
    "the_equalizer_2",
    "a_history_of_violence"
  ]
}