{
  "id": 3797,
  "title": "Run the Tide",
  "starring": [
    "Taylor Lautner",
    "Nico Christou"
  ],
  "runtime": 100,
  "genre": [
    "Drama"
  ],
  "description": "When their drug abusing mother is released from prison determined to rebuild their family, Rey kidnaps his younger brother Oliver and escapes their desert home for the California coast.",
  "releaseYear": "2016",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/6QwGnsw1Dk1aU8jtnfg5j13RK31.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Emotional and engulfing movie about a family adjustment after the mother is released from prison. Enjoyed watching the movie, beautiful composition of scenes and music."
    },
    {
      "rating": "8",
      "text": "I didn't want to see this film. It has Taylor Lautner in it and from the promotion I thought it was some lame surfer movie. The reviews were also terrible. BUT my girlfriend insisted, and it was her choice, so we ended up streaming the film. I'm conflicted writing this because I really loved it. It's not a surfing film at all, it's a story about two brothers who have had to grow up without a real parental figure in their lives. Ray (Taylor's character) has been a father figure to his young brother because their mother screwed up their lives due to her abuse and drug addiction. The film is about the effects of that on these kids and a mother trying to make things right. The movie starts with her getting out of jail and looking to reenter her family's life but Ray wants nothing to do with her. So he kidnaps his brother and hits the road, running far away. That's what puts this film into motion. The question becomes; will Ray be able to forgive and give his mother, and brother, a second chance at life even if that means he has to give up something of himself in return? There's a lot of talk and this movie isn't flashy at all. It's a bit of an odd mix as I'm used to seeing Taylor in nothing but popcorn, action type films but he's really good in this, down to earth, and it's definitely his best performance to date. It can be a bit ponderous at times but it really feels like real life and the ending doesn't wrap up in the ways that films like this so often do. It's beautiful in a melancholy sort of way, and it captures the pain of growing up without stable parents. Definitely emotional and so very moving. I recommend the film highly."
    }
  ],
  "recommendations": [
    "wonder",
    "miracles_from_heaven",
    "home_again",
    "about_time",
    "the_florida_project",
    "where_the_wild_things_are",
    "flipped",
    "the_pursuit_of_happyness",
    "monte_carlo",
    "the_age_of_adaline",
    "endless_love",
    "captain_fantastic",
    "13_going_on_30",
    "if_i_stay",
    "the_water_man",
    "courageous",
    "into_the_wild",
    "big",
    "about_a_boy",
    "the_perks_of_being_a_wallflower",
    "the_descendants",
    "instant_family",
    "the_glass_castle",
    "we_bought_a_zoo",
    "midnight_sun"
  ]
}