{
  "id": 4604,
  "title": "Runaway Bride",
  "starring": [
    "Julia Roberts",
    "Richard Gere"
  ],
  "runtime": 116,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Ike Graham, New York columnist, writes his text always at the last minute. This time, a drunken man in his favourite bar tells Ike about Maggie Carpenter, a woman who always flees from her grooms in the last possible moment. Ike, who does not have the best opinion about females anyway, writes an offensive column without researching the subject thoroughly.",
  "releaseYear": "1999",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3JpHNd6V8hvR1JFGGSAJsZDYHoR.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "asjdkfofmqwkeiroorpkpiuuttbjklmmjhhchshahzbdgsgdnjjkkflfrokfofjgofmogmfkdmfmvmdmskdkdodmcocm"
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie. Runaway has a different storyline, the actors all add to the movie. The movie is amusing, it isn't as good as pretty woman but it is still well done. Many actors reappear in this that were in Pretty Woman, and they are all stellar actors. This movie didn't deserve the negativity it received because it is a witty, amusing comedy drama."
    },
    {
      "rating": "8",
      "text": "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^............................"
    },
    {
      "rating": "8",
      "text": "In real life, Julia Roberts canceled her own wedding to Kiefer Sutherland only a few days before the ceremony in 1991. They met on the set of the thriller Flatliners in 1990."
    },
    {
      "rating": "8",
      "text": "jgugguugugugugugugugguugggjk+++×××÷÷÷==*&&*%***#@*#?$*%!*$()().,?!\"!:!:??;......????'s☆⊙°¤○♡▪♡○♡●♡♡□○"
    },
    {
      "rating": "8",
      "text": "Ike loses his grip on his crab mallet and sends it flying in a reverse of the iconic scene in Pretty Woman (1990) when Vivian Ward accidentally launches her escargot across a restaurant while at dinner with Edward Lewis. Both scenes involve a fish-out-of-water character struggling with an unfamiliar shelled food everyone else is accustomed to. Julia Roberts and Richard Gere played the romantic leads there as well. Garry Marshall also directed Pretty Woman."
    },
    {
      "rating": "8",
      "text": "SYNOPSISIn a last-ditch effort to save his tarnished career, a big-city reporter (Gere) chases a scoop about a mercurial, small-town girl (Roberts) known as the Runaway Bride due to her habit of leaving her grooms-to-be at the altar."
    },
    {
      "rating": "6",
      "text": "If it's a comedy, it's not funny. If it's a drama, it's not dramatic. If it's a romance, it's not romantic. The only excuse for this film was getting Julia Roberts and Richard Gere on the same movie, and if you could throw in some of their Pretty Woman sidekicks, well, the more the merrier. But it's not all exploitation: some smart lines, good acting, and a mostly original storyline saves it from the depths of a complete failure. And by the name of god, that dress was UGLY!"
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "8",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "8",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    },
    {
      "rating": "2",
      "text": "Even when they slow dance after being with the audience for a while, I didn't see any spark.Runaway BrideThe director Gary Marshall, I think, didn't see this coming. And I know no one presumes the film to perform bad. But there is a certain level of expectations, a ballpark figure, a certain range that it would cover. This is a total disaster. And to be honest I can see what could be the birth of this idiosyncratic idea that it plants so proudly in this farm. But as I have always said an idea isn't everything. At least we can agree in this show business by now is that no idea is stupid. The depiction of a smart idea done poorly comes off stupid.And no matter how stupid an idea, if executed carefully, we have seen such films turn classic instantly, take MASH for example- the Donald Sutherland one. But if a stupid idea is project stupidly, it's a stupid film, in capitals; just as stupid as using this word these many times. Still I'd like to defend the film. And you can only do it with Julia Roberts, its finest asset colored totally lazy in the film. The film's actual odd and even contradicting nature comes because of her character and still there is a lot to explore there.That is of course, not to say that the storyline in any manner justifies the decisions of the film. But for a brief period, her character shows us something profoundly mirroring to what our society whips us with religiously. And when that note, which is either rushed on questionably or the makers were not aware of the magnitude of its brilliance, hits the screen there is a comforting realization and surprise in our face that a film of this genre usually does not offer us. Runaway Bride is still a forgettable date movie, I mean I can't even promisingly say that there is some chemistry."
    },
    {
      "rating": "8",
      "text": "●●●●●●●●●■■■■■■■■■■▪▪▪▪▪▪°°°⊙⊙⊙⊙⊙♧◇♡☆☆☆☆☆☆《》《》¡¿{}[]:;!?&()$%+×÷=\"\"\"\"\"\"\"\"\",,,,,...\"\""
    },
    {
      "rating": "8",
      "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆"
    }
  ],
  "recommendations": [
    "the_dilemma",
    "fracture",
    "knives_out",
    "enola_holmes_2",
    "widows",
    "a_simple_favor",
    "lucky_number_slevin",
    "conspiracy_theory",
    "the_gunman",
    "arbitrage",
    "the_town",
    "don_jon",
    "silver_linings_playbook",
    "the_lincoln_lawyer",
    "the_judge",
    "suburbicon",
    "solace",
    "broken_city",
    "i_feel_pretty",
    "the_intern",
    "the_nice_guys",
    "the_woman_in_the_window",
    "american_hustle",
    "the_tourist",
    "jane_got_a_gun"
  ]
}