{
  "id": 1755,
  "title": "Rush Hour 2",
  "starring": [
    "Jackie Chan",
    "Chris Tucker"
  ],
  "runtime": 90,
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "description": "It's vacation time for Carter as he finds himself alongside Lee in Hong Kong wishing for more excitement. While Carter wants to party and meet the ladies, Lee is out to track down a Triad gang lord who may be responsible for killing two men at the American Embassy. Things get complicated as the pair stumble onto a counterfeiting plot. The boys are soon up to their necks in fist fights and life-threatening situations. A trip back to the U.S. may provide the answers about the bombing, the counterfeiting, and the true allegiance of sexy customs agent Isabella.",
  "releaseYear": "2001",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aBQf2vMiCINeVC9v6BGVYKXurTh.jpg",
  "categories": {
    "plot": 7.4,
    "acting": 6.166666666666667,
    "ending": 6.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.25,
    "funny": 6.478260869565218,
    "action": 8.181818181818182
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Rush Hour 2 is a rare gem; it's almost, if not better than the original. This time, the action spreads to Hong Kong, and Chan is more free to use his martial arts than in the culture restraints of the first one. \"2\" is fun, hilarious, and profoundly entertaining."
    },
    {
      "rating": "7",
      "text": "It's nowhere near as funny as the first installment, but \"Rush Hour 2\" is still chuckle-worthy and, thus, deserved of a few viewings."
    },
    {
      "rating": "0",
      "text": "In short, one of the worst movies I have ever seen. In long, it's an insipid trip through China where virtually all of the humor is derived from cheap sexism and racism (I'm really a guy that can appreciate the humor in this, but all of the jokes were so unoriginal and flat), as opposed to the fun and ridiculous situations in the first Rush Hour. Jackie Chan's acting is more tired than it has ever been before, and Chris Tucker's antics get worn thin after the first 5 minutes. To me, this ranks among the worst sequels ever made (right alongside Lawnmower Man 2 - there, I said it.)"
    },
    {
      "rating": "7",
      "text": "Pretty hilarious by today's standards of forced, politically correct comedy."
    },
    {
      "rating": "6",
      "text": "The huge flaw of this movie was the uninteresting plot and the disapointing twists in it as well. Also there are a ton of recycled jokes from the previous film as well. Its still enjoyable and fun to watch though."
    },
    {
      "rating": "0",
      "text": "Jackie Chan persiste avec cette suite, la comédie américaine pitoyable sur tous les fronts qui nous fait monter le rouge au front et saillir les veines d'énervement. Pourquoi vendre son âme ainsi au grand satan américain ? même en Iran, ils étaient scandalisés et ont encore brûlé des drapeaux. Humour de fond de latrines et ne parlons pas de Chris Tucker, l'innommable Chris Tucker, je vais devenir vulgaire."
    },
    {
      "rating": "10",
      "text": "Great action comedy movie."
    },
    {
      "rating": "6",
      "text": "Same old, same old, this is a pointless but even dissapointly shorter than the first. I only laughed about twice. Not a funny movie, Bret Ratner needs some more practise. But for this, its okay."
    },
    {
      "rating": "10",
      "text": "I love Jackie Chan, and Chris Tucker. And together they are the unstoppable duo. A mix of action and comedy, made me cry with tears of laughter and sweat because of anxiousness."
    },
    {
      "rating": "8",
      "text": "I always enjoy Jackie Chan movies even though I watch no other \"KungFu\" type shows. His stunts are hilarious. I liked Chris better in this one, and even noticed the guy is handsome if he just would not open his mouth. Never a dull moment in this movie."
    },
    {
      "rating": "10",
      "text": "Great movie, very funny."
    },
    {
      "rating": "9",
      "text": "I know not why the critics gave this series such bad reviews, I believe that this is a classic. Though it did kind of mimic the basic plot of the first and followed some of the cop hero movie clichés it still gave me good laughs and contains many quotable lines. It is definitely one that is a must see if you haven't seen it yet, if you haven't you must live under an uncultural rock. not a joke on many Asian vs American references."
    },
    {
      "rating": "8",
      "text": "Rush Hour 2 isn't quite as good as the first film (or third for that matter), but it is still rather funny at times and the plot is good enough to keep you watching until the end. I don't really know why it's the weakest of the three, but it just doesn't seem quite as good. Still very enjoyable and definitely worth a watch if you are a fan of the first film."
    },
    {
      "rating": "8",
      "text": "Such a great funny movie. I really love the adventure and all the different locations it takes you. I really can't think a movie that compares to it. Every scene has something memorable."
    },
    {
      "rating": "6",
      "text": "Less entertaining than the first, but \"Rush Hour 2\" still remains funny with Chris Tucker's ridiculous jokes. Once again, Chan does not demonstrate his powerful kung fu skills, which once again, disappointed me. I do love how nearly half of the film is set in Hong Kong."
    },
    {
      "rating": "8",
      "text": "I enjoyed the sequel just that little bit more than the first thanks to a few things. There was more Action and I think the addition of two kick-ass females in the mix really helped things out. Chan & Tucker still work great together and I can't help but be impressed by Chan's commitment to the stunts as well. Storyline is pretty straight forward and more about the Action rather than the content, but overall a solid Action/Comedy that I think outshined the original just that little bit."
    },
    {
      "rating": "6",
      "text": "Honestly, i liked the first part better! But i cant deny how fun and interesting this movie was! Im looking forward for the last part of the trilogy!."
    },
    {
      "rating": "5",
      "text": "Rush Hour 2 is basically on par with director Brett Ratner's take on X-Men; there's a lot in it and you want to like it, but at the end of the day it's only a so-so film."
    },
    {
      "rating": "7",
      "text": "It is the type of a more of the same sequel. Again this is an action comedy / buddy movie made enjoyable by Jackie Chan and Chris Tucker performances. It is however not as good and refreshing as the prequel. Over the years my rating declined a bit but I still say it is worth watching. The story starts with James Carter played by Chris Tucker visiting Hongkong to meet his friend inspector Lee played by Jackie Chan. However due to a critical event at the US Consulate the holiday is cut short and ends with the two banding together to safe the day. The story works but is mostly a vehicle to carry the characters, action and humor. It is entertaining but not that special. The main appeal is of cause the buddy movie aspect. I repeat my statement from the prequel that Jackie Chan and Chris Tucker work well together. Their good chemistry carries the movie and is enjoyable. Jackie Chan does the action and Jackie Chan stuff people expected and Chris Tucker adds a lot of humor to it. I must admit that by Jackie Chan standards it is a weaker performance compared to his better movies (Clarification: It is still an enjoyable performance and not garbage as I have yet to see a movie were he fails). In addition to this I always enjoy Zhang Ziyi since “Hero” and both John Lone and Roselyn Sanchez did a good performance too. The humor itself works well enough to entertain but I can not remember a remarkable joke except the hilarious chicken scene (Those with the language barrier;-). On paper so far this looks really good. Sadly like I already said it has some weakness. The movie is basically a redoing of the prequel minus the pulling together in a new setting. Without the main actors this would be average at best and it uses a bit of too much tropes and stereotypes. After watching this in the cinema I would have given an 8/10 same as the prequel but after some time I realized that it was not that good. I am struggling between a 6/10 or 7/10 now. I will give a rounded up 7/10 because of the cast and main actors. Want not to end this to negative and say I still prefer this over many modern spoof movies any day."
    },
    {
      "rating": "10",
      "text": "one of the greatest action comedies ever made. I've seen it 30 times and still laugh out loud. Only other movie I can say about that is step brothers (and i truly dislike all other will farrell movies)"
    },
    {
      "rating": "5",
      "text": "Comedy never looks too great with action alone. That's where Rush Hour 2 comes to action... I mean... play comedy on the screen. You'll be better with Rush Hour even though that's mixed as well."
    },
    {
      "rating": "7",
      "text": "The sequel remains enjoyable with plenty of laughs and great fighting stunts delivered by Jackie Chan."
    },
    {
      "rating": "7",
      "text": "I'd personally say Rush Hour 2 isn't as good as the first one but its got some amazing fight scenes throughout the movie. Also, Chief Inspector Lee (Jackie Chan) and James Carter (Chris Tucker) have got some perfect chemistry together throughout this movie."
    },
    {
      "rating": "9",
      "text": "A great film with great acting from both Jackie Chan and Chris tucker, a great balance between comedy and action, a must watch for all movie lovers."
    },
    {
      "rating": "10",
      "text": "My favorite out of the series is part 2. Way more action and a lot funnier too. I laugh so hard still when I watch this movie."
    },
    {
      "rating": "10",
      "text": "Vegas bound in this sequel. crazy **** with bomb, 2 vs 100 in the middle of a spa and sketchy karaoke. Lee and Carter in this cop classic. cheap suit!"
    },
    {
      "rating": "3",
      "text": "Unlike the previous part, the beginning of the film does not have funny or attractive scenes , but in the middle of the film, the situation is a little better ,  although it is not acceptable . In general , it is weaker than the previous part of the film."
    },
    {
      "rating": "8",
      "text": "----------------------------------8.2/10-----------------------------------"
    }
  ],
  "recommendations": [
    "rush_hour_3",
    "hot_fuzz",
    "johnny_english_reborn",
    "around_the_world_in_80_days",
    "kingsman_the_secret_service",
    "22_jump_street",
    "spy",
    "stuber",
    "ride_along_2",
    "deadpool_2",
    "shanghai_knights",
    "the_rundown",
    "get_smart",
    "last_action_hero",
    "the_longest_yard",
    "this_means_war",
    "venom_let_there_be_carnage",
    "chips",
    "grudge_match",
    "pineapple_express",
    "the_other_guys",
    "ride_along",
    "spenser_confidential",
    "knight_and_day",
    "the_green_hornet"
  ]
}