{"id": 1781, "title": "Rush Hour 3", "starring": ["Jackie Chan", "Chris Tucker"], "runtime": 91, "genre": ["Action", "Comedy", "Crime"], "description": "After a botched assassination attempt, the mismatched duo finds themselves in Paris, struggling to retrieve a precious list of names, as the murderous crime syndicate's henchmen try their best to stop them. Once more, Lee and Carter must fight their way through dangerous gangsters; however, this time, the past has come back to haunt Lee. Will the boys get the job done once and for all?", "releaseYear": "2007", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/rZ7IxJlPhNNJ6Rn8z1rzsXuA70P.jpg", "categories": {"plot": 4.764705882352941, "acting": 5.8, "ending": 4.833333333333333, "soundtrack": 5.0, "cinematography": 4.333333333333333, "familyFriendly": 6.0, "funny": 5.405405405405405, "action": 4.615384615384615}, "reviews": [{"rating": "8", "text": "Could have been better, but what did you expect from a movie like this one? Jackie provides the stunts, Chris provides the laughs, and everybody else just shows up."}, {"rating": "10", "text": "Yes while this is not a touch on the first two there are still lots of comedy bits. \"The closer I get to youuuuuuuuuuu\" being just one of many. Anyway like I said not a touch on the first two but even they are rated low scores."}, {"rating": "0", "text": "Mais ?... mais il remet le couvert ? Jackie Chan a-t-il perdu toute dignité ? jamais deux sans trois dit le dicton. A ce point je m'interroge sur sa rapacité tout de même... ou serait-ce une grave dépression ? s'infliger une daube pareille avec -encore- l'autre débile, Chris Trucmuche, pour la troisième fois ! les dialogues affligeants, les poncifs racistes au taquet, les clichés éculés véhiculés, les situations d'une mongolerie à faire mourir de honte Benny Hill et nos Charlots réunis. Non, franchement j'ai honte, Monsieur Chan, je ne vous salue pas."}, {"rating": "9", "text": "Pretty gosh darn funny. Plot was useless, but go figure. All i cared about was watching something that would make me laugh throughout. it did that and more. go see it"}, {"rating": "10", "text": "A great movie, really funny. That now makes my favortie movies... 1. Rush Hour 2 2. Rush Hour 3 3. Rush Hour Obviously these critics haven't seen the first 2 because if you have, and you liked them, this movie is just a good."}, {"rating": "0", "text": "This movie was deplorable, and in no way fell in line with the story line of the other Rush Hours. The CGI was also terribly unrealistic, and many of Jackie's stunts were clearly faked with camera tricks or CGI. This movie is a \"Turn your brain off\" movie, and that does not sell to anyone older than 20 that isn't on or smoking something. If I were 5 years old I would have probably been thoroughly entertained. For the first time ever, I went to the manager and requested a refund. Avoid it like the plague!"}, {"rating": "3", "text": "OH MY GOD. The movie had no ending (SO anticlimatic, yes they killed the baddie, woo...), felt cheap, crappy, lacked solid laughs (yes I laughed, you'd laugh at a 2 hour film of fart jokes, doesn't make it good). The fight scenes were utterly unimpressive."}, {"rating": "0", "text": "I've never seen so many embarrassingly stupid one liners crammed into such a small period of time in my whole life. Pauly Shore, Marlon Wayans, and Gilbert Gottfried could have a screaming competition and it would be less annoying than Chris Tucker on screen for five minutes."}, {"rating": "0", "text": "I'm of Chris Tucker and his annoying high pitched voice. I walked out of the theatre with a frown."}, {"rating": "3", "text": "A cheap money grab. There's action, but the new characters and storylines are just skeletons. There's no real development anywhere. There's just enough to string from one action scene to the next (most of the time). Its like Pirates of the Carribean 3 - throw some garbage out as a sequel to 2 decent movies and enough people will see it to make money."}, {"rating": "5", "text": "I'm the type of guy who **loves** the idea of Tucker + Chan teaming up in a buddy bust-em-up action movie. I've waited for this movie since Rush Hour 2 with high hopes that it would be the best of the series. The first Rush Hour was the funnest, the second had a bigger grander scope and this one was just a big mess. I didn't know what was going on (story-wise) for most of the movie (until 2/3rds the way through they explain it.. and then it's still stupid and poorly connected) and the camera angles, while cool, were edited too tightly (in a bad way) which made the whole movie appear rushed. The comedy felt too forced most of the time and most of the scenes were far too shallow to show off either of the stars' talents. The most depressing part of the movie was Jackie Chan's performance, which was weak to say the least. Even if he doesn't look 53, he acted like he was in this movie. Most of his fight scenes were lame and there were no memorable moments to be had. He needs a successor badly, but I don't know if anyone could ever take his place. I had to see this film because I saw the first 2 and because I love Jackie Chan and the type of movie this is. I hope the buddy cop movie genre never dies, but after seeing this movie I think it may just one day. Do your self a favor and rent this movie when it comes out if you really must see it. :("}, {"rating": "9", "text": "I really loved the movie...I was ROFL...LOL....and LMAO the whole time. The only reason I give it a 9 and not a 10, was the acting from the horrible dialouge from the Chinese ambassadors daughter, and some crappy dialouge from Jackie himself. Besides that, I loved it...I really recommend it"}, {"rating": "9", "text": "Forget the reviews that \"movie critics\" are putting out. I dont know about everyone else but when I go to a comedy movie, I want to laugh. It made me laugh just like the first two did. That makes it good by my standards. If you want to see a funny movie, then please go see it. But if you want some groundbreaking, award-winning film, then keep your money."}, {"rating": "9", "text": "Was a great movie and very funny! The plot was kind of dumb, but scenes were great. you will definitely be laughing and action sequences are good"}, {"rating": "2", "text": "In my opinion, very predictable and not particularly funny."}, {"rating": "10", "text": "You're all just whining and complaining about a movie just because the rest are doing the same. Who cares how long or how short the movie was. If you actually sat down in the theater and watched the movie with everyone else, (being that I saw it twice, in two different theaters), everyone seemed to have enjoyed it. Twice, after the movie, they clapped and whistled. Laughed constantly, enjoyed the action, and just seeing Jackie and chris filming together again. Get over it. Sitting there over analyzing a movie and giving it disgustingly bad reviews and ruining it for others is retarded. Go out, get a drink. Smile. Take a shower. Rush hour 3 was awesome."}, {"rating": "8", "text": "If you liked Rush Hour, or Rush Hour 2, you'll like Rush Hour 3. They stick to the same formula, and while the movie may not be as fresh as the first or second, Tucker and Chan are still a winning combination. All the bad reviews? Reviewers with large, pointy and snobby sticks up their tooshes."}, {"rating": "10", "text": "I don't why people expect more on sequels! It was funny and great I laughed throughout the movie"}, {"rating": "6", "text": "I've seen funnier and more thrilling films in my life but this film did the trick for a good night out at the cinema. It's a good laugh, even though many of the jokes are just downright racist. The length of the film was a bit short but there were no boring moments are pointless scenes. It was to the point, very silly and far fetched but all I came for was for a good laugh and a good laugh I got. The film also glorifies violence, which I didn't like, and the film even admits that through the French taxi driver."}, {"rating": "5", "text": "What a disappointment....after waiting years for this, we get what felt like a completely rushed, uninspired sequel. Like the recent Shrek 3, Rush Hour 3 seems focused on bringing its characters back but not focusing on actually what made the first 2 movies so great to begin with. Rush Hour 3, from the beginning, felt forced. The humor felt forced, the re-uniting of the characters felt forced...and it never managed to capture the fun and energy of Rush Hour 2. Not helping are the complete lack of fight scenes...Jackie Chan has only about 1 fight scene in the entire movie (not counting the sword fight,) and it's over in about 10 seconds. Chris Tucker seemed to have had more hand-to-hand combat this time around than Jackie Chan. An exciting finale on top of the Eiffel Tower is really all that there is to remember this movie by....there's nothing else here. Even the outtakes during the credits were more focused on Jackie Chan's inability to speak English than on his actual stunts...probably because he had so few. Without the exciting fight scenes or the energy of Rush Hour and the excellent Rush Hour 2, there's just very little to recommend about this movie. Nobody's more disappointed than I am. Chan's first US movie in years turned out to be a complete dud. I think it's about time to end this series; it probably should have ended after 2. Bring us Shanghai Dawn, please."}, {"rating": "7", "text": "Great fun even though as sequels go it did not top the first one. Jackie and Chris have improved on their chemistry as a team, and as with the past films the women are smart, skilled, and unlikely to be found in our average daily business environment."}, {"rating": "9", "text": "I walked into the theatre with even the people their telling me it's gonna be horrible. I expected it to be horrible. Was it? Nope! It was my 2nd favorite of the 3 (favorite is 2, and least favorite is the original) It was funny, had a great and interesting storyline. Don't pay any attention to the reviews! They didn't like 1 or 2 either. See this movie! Why a nine? Used the singing joke one to many times."}, {"rating": "0", "text": "Some advice, enjoy the movie, don't go in expecting crap like the second one. But go in and watch it. I laughed a billion times,but all Brett Ratner does is formulate the short plot and translate it to an entirely humorous sequence throughout. The comedy is all we focus on in these rush Hour films, while there is so many flaws. This one is crazy with laughs, but isn't their finest hour. It sucked, its like Spider-Man 3: the only thing appealing is the relationship with Harry and Peter fighting for a life with MJ. All this movie does is focus on the comedy, while the movie was super-short. It felt like 25 minutes, and the story wasn't engaging, they used made-up words in the dialogue, the movie is cliched throughout. It needs work. Its a huge mess that has a huge problem, as the comedy here on fourth is the only thing above average about the film."}, {"rating": "5", "text": "-The second movie was stupid, but it was hilarious. This movie is just stupid. Some of the jokes were good, but it wasn't as funny as the last one. The plot was thinner than the second movie, and that's saying something. Chan fighting his adopted brother didn't provide a good conflict because it was just too unbelievable. The fight scene at the end was okay; nothing spectacular. -Oh, and The Simpsons fans: didn't that scene at the start when Chris Tucker is dancing and controlling traffic seem like the Simpsons episode where Eddy does the same thing (the ep. where Marge joins the Cherry Red Tomatoes and tries to rob Mr. Burns?)"}, {"rating": "8", "text": "funny movie. don't listen to these idiots saying it wasn't funny."}, {"rating": "5", "text": "It was a decent movie it wasn't nearly as funny or as entertaining as the first 2.It had some funny moments but its pretty forgettable. I think Jackie and Chris should call it quits on the Rush Hour series.Don't listen to the first 3 reviewers they are clearly high on something."}, {"rating": "4", "text": "More of the same, but a lot of it was done rather poorly. A lot of the lines got no reaction from the audience and just weren't funny. Added to the fact that Jackie Chan isn't up to his caliber in the stunt department. I should have seen The Borne Ultimatum."}, {"rating": "0", "text": "I loved the first two movies but this one was sadly far away from both. The action was sub par and not amazing, and the humor was so ridiculously juvenile it's shocking that anyone laughed. I kept a straight face throughout the entire thing because basically it wasn't funny. I enjoy Chris Tucker usually, but in this case I'm going to have to say no. Of course, if you're a loyal Rush Hour Fan then of course you'll go see it, but go in as I did, knowing you're only going for the sake of loyalty. Perhaps you'll enjoy it despite the copycat story, low energy action sequences, and ridiculous jokes. That or you'll shed a few tears because of how disappointed you are."}, {"rating": "5", "text": "Had some laughs. Definitely tried to play up the humor, although a lot of it had me groaning rather than laughing. As an action movie, it used just about every imaginable action cliche in the book. My buddy and I had more fun laughing at that than anything else. It's the kind of movie I can watch on TV on a lazy Sunday afternoon and not feel too bad about watching. Paying for it, well...that's another matter."}, {"rating": "5", "text": "The main problem with this film is that it just wasn't needed. It has a an unoriginal story full of the usual cliches. All this would be forgivable if the movie had the same charm as the original, but it never gets to that level. Some of the jokes here are rather funny, but most go on for far too long and just become repetitive or they are just way too cheesy. The action on the other hand is still exciting to watch, but even this was ruined with a rather over the top scene near the end of the film."}, {"rating": "2", "text": "the movie was flat out horrible. the humor was virtually a boring copy of the first two. throughout most of the movie Jackie Chan did not even appear to be acting, just going through the motions. i was bored the entire movie, never being sucked in. I regretted going to this movie, and i got in for free."}, {"rating": "5", "text": "As a fan of the first two Rush Hour movies, I was really disappointed with this sequel. Plot didn't make sense. Lee suddenly forgetting that his brother (or half brother) is dead and starting to dance with Carter doesn not equal a good ending. And frankly, the movie felt much shorter than the previous two (when the actual differences aren't that big), which was probably becuase there was such a shortage of laughs that was abundant in the first two."}, {"rating": "8", "text": "Possibly the funniest of the Rush Hour films, but it has the worst plot of the three. If the plot were better and more up to the standards of the first two then this would be the best one. I was very wary of the film, thinking it looked like it would just be OK, when I first saw the film in the Cinema I thought it was OK but a real let-down like I expected it to be. But recently I watched all three of the Rush Hour films within about 2 weeks, and the third one is really no worse and I could really make a case for it being the best of the three."}, {"rating": "7", "text": "I liked it better then the second film but not as much as the first. Its good to see how far Rush Hour has come as a series in this movie. Just a solid buddy comedy/action flick imo."}, {"rating": "6", "text": "The thing that I am most impressed with \"Rush Hour 3\" is that it's still funny. Usually, after one or two installments, the third film tends to recycle jokes but \"Rush Hour 3\" proves otherwise. That being said, however, the film does not contain any surprises. It's almost the same as the first two with a different location."}, {"rating": "6", "text": "Nowhere near as entertaining as the first two installments, but \"Rush Hour 3\" does prove to be at least passably funny."}, {"rating": "7", "text": "So the third installment in the series is probably the worst of the three, but having said that its still pretty entertaining thanks to the starts. It's missing what I really liked about the sequel and while there is still enough Action and Comedy here to keep me interested, its not as much as the first two had. I think they might have started to run out of ideas which is probably why a fourth one has been put off, but overall its still an entertaining film with some decent Action/Comedy."}, {"rating": "6", "text": "Rush Hour 3 lacks the charm and wit of the first two films, and Chan is getting too old for the role. The story in Rush Hour 3 isn't as fresh and exciting as the first two as well."}, {"rating": "2", "text": "The real tragedy about the third film in this franchise is that the third time around Chan and Tucker lack the energy and enthusiasm of the first two installments. The story is weak and doesn't really cover any new territory and the film itself is pretty much a mess."}, {"rating": "6", "text": "The final movie in the Rush Hour franchise. Basically it is the same kind of movie as the prequels with some variations and you have to decide if this is a good or bad thing. For many people this is the mayor complaint and even I who likes all 3 movies must agree that they have a somehow valid argument here. It is again an action comedy / buddy movie that is carried by the two main characters / actors. Story: It is set a few years after Rush Hour 2. Ambassador Solon Han (from Rush Hour 1) wants to rise the awareness of fighting against the Triads (Traditional Chinese crime syndicates. I hesitate to give a better explanation as I am unfamiliar and “Chinese Mafia” would be probably a bad comparison) at the world criminal court in Los Angeles. He wants to announce the whereabouts of Shy Shen who is a legendary figure and irreplaceable leader of the Triads. However one does not do this easily and it is again the job of inspector Lee played by Jackie Chan and detective Carter played by Chris Tucker to safe the day. You get what you expect. Jackie Chan being Jackie Chan and Chris Tucker adding more humor to the mix. They work great together but like I already said it is neither that original or refreshing anymore but still enjoyable. I will also admit that the words “More of the same” come to my mind. Characters: Without Jackie Chan and Chris Tucker this would be below average. They save this movie from being bad and their chemistry is still a strength in the movie (and franchise). Then there is Hiroyuli Sanada who gives a truly good performance in this movie. Maybe a bit too much wasted by the script but that is not to blame on him or his performance. Bonus for Roman Polanski as Commissar Revi who is so an enjoyable slime-ball. Small role but remarkable. He is in the love to hate category. Generally I see no missteps here in the cast. Other than that the humor works well but is not on a top level. Jackie Chan is always amazing and I continue to say that there is no bad performance by him even in his weaker movies. It is also fair to say non of the Rush Hour movies would be in my top 10 Jackie Chan movies list (or on anyone I knows list). Overall I am a bit divided. It is still a solid movie and enjoyable. It is also nowhere as good as the better movies in the genres. Maybe not everything needs to be a masterpiece. I will say it is worth watching and has memorable moments but will be forgotten in the end. Today I would add “Franchise fatigue” to the review but back then I did not know the term (or if it existed back then)."}, {"rating": "6", "text": "Rush Hour 3 was very cliche, and I'm saying this WITHOUT having seen the first two. The two actors in it were very funny (more Chris Tucker than Jackie Chan; Tucker is black), and a certain cameo was very funny (you just have to know who it is and watch how the two leads act towards him). These of which carried the whole movie."}, {"rating": "4", "text": "\"Everybody was Kung fu fighting! That man was fast as lightning!\"The only good thing about this movie is Roman Polanski getting punched in the face by both Chris Tucker and Jackie Chan. It serves him right."}, {"rating": "4", "text": "\"Rush Hour 3\" was a film that instead of being entertaining, it turned out to be tedious and in bad taste, although the action and comedy was not lacking, and the performances were good, it is a misplaced idea to close a franchise like this."}, {"rating": "4", "text": "Could someone please bring me a drain plug in this room because Rush Hour 3 is flooded with so much comedy not even a single bit of action is seen from the flood?"}, {"rating": "1", "text": "Really nowhere as good as the first one, or even the second. This one is bland, full of dark humor, and boring. I did not enjoy watching this Rush Hour film."}, {"rating": "6", "text": "Although certain jokes are recycled and a little tired, \"Rush Hour 3\" is not dull or boring in any way."}, {"rating": "8", "text": "Rush Hour 3 is honesty pretty good, despite the plot and the weird camera work, it's actually quite funny. The funniest thing about this movie would have to be Detective James Carter (Chris Tucker), he honestly has to be the funniest and entertaining character throughout this movie. Also, the action scenes with Chief Inspector Lee (Jackie Chan) and Detective James Carter (Chris Tucker are very entertaining throughout and they never felt like they dragged. Overall, it's an underrated gem of a comedy, you can honestly tell Chris Tucker is having the time of his life and he makes this movie even better."}, {"rating": "6", "text": "Not as good as the other 2 but still a good enough movie. Where they travel to Paris now to chase down the white man and the triads."}, {"rating": "6", "text": "a slick, funny, actiony, and very UNnecessary sequel to the first two great films. carter and lee are back at it in France. \"triads in Paris\" sounds very close to that one song. i hear theres a 4th installment in the works. unless you are a long time fan of the series then i wouldnt hurry to watch this one."}, {"rating": "6", "text": "----------------------------------6.3/10-----------------------------------"}], "recommendations": ["venom_let_there_be_carnage", "30_minutes_or_less", "hot_fuzz", "deadpool_2", "22_jump_street", "the_hangover_part_iii", "ride_along", "identity_thief", "the_a_team", "ted_2", "the_marine", "this_is_the_end", "zombieland_double_tap", "this_means_war", "anchorman_2_the_legend_continues", "baywatch", "the_other_guys", "6_underground", "night_at_the_museum_battle_of_the_smithsonian", "crank", "the_expendables_3", "rush_hour_2", "johnny_english_reborn", "the_hangover_part_ii", "furious_7"]}