{
  "id": 2338,
  "title": "Rush",
  "starring": [
    "Chris Hemsworth",
    "Daniel Brühl"
  ],
  "runtime": 123,
  "genre": [
    "Drama",
    "Action"
  ],
  "description": "A biographical drama centered on the rivalry between Formula 1 drivers James Hunt and Niki Lauda during the 1976 Formula One motor-racing season.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5akKFgS7eeXUw9rKTEujryKrH17.jpg",
  "categories": {
    "plot": 8.982758620689655,
    "acting": 9.08955223880597,
    "ending": 8.666666666666666,
    "soundtrack": 8.25,
    "cinematography": 9.285714285714286,
    "familyFriendly": 3.0,
    "funny": 8.666666666666666,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Was not expecting much going into the theater, but was pleasantly surprised. Ron Howard captures the rivalry really well and always keeps the story in a believable tone. The 70's washed out color scheme sets a great mood with these sets. I just wish this movie would make more money at the box office. It is a quality film much better than so many others released this year. Maybe it will get a few awards later bringing it more attention."
    },
    {
      "rating": "10",
      "text": "Never been so mesmerized with sports drama movie. I can say this is the best I've ever seen. Im on the edge of my seat hoping that this rivalry romance story between the two rivals never end. Chris Hemsworth & Daniel Brühl  played the character so perfect and  well balanced, they complement each other. Oscar worthy!"
    },
    {
      "rating": "10",
      "text": "I may be forgetting something, but, to me, Rush is the best film about sports I've ever seen. The race sequences are beautifully, brilliantly enthralling. But the greatness of the film lies in its characterization of the psyches of its rival protagonists, Hunt and Lauda. The whole cast does an excellent job, but Bruhl as Lauda is absolutely superb. And the script gives Bruhl plenty to work with in making Lauda as complex as he does. An Oscar performance if there ever was one. One of the most convincing acting jobs I've ever seen in my life in a big-budget Hollywood film. One of the great Hollywood studio films of all time. Howard certainly deserves an Oscar."
    },
    {
      "rating": "10",
      "text": "Probably the best movie I've seen this year (not saying too much this year). And I'm not even a huge F1 fan. I went into this expecting it to be a run of the mill racing film and wasn't expecting much from Hemsworth. Man was I wrong. Hemsworth delivers his best performance so far, the drama is genuine, the action is truly thrilling. It's a bit of a puff piece at times but not in a way that makes me roll my eyes. The part where Lauda returns to the track after his injury and finishes in fourth gave me genuine chills for the entire scene. I can't say how much I respect that about people. When they have a genuine passion for something and will do whatever it takes to continue doing what they love...for all the things I hate about people, this is something I truly respect."
    },
    {
      "rating": "9",
      "text": "\"Rush\" is one of the best films of the year. I was pleasantly surprised by the amount of depth and emotional story telling this film possess. From its brilliant script that infuses humor, drama, and a story about a fascinating rivalry to its impeccable and detailed oriented direction, this film succeeds on every level.\r Ron Howard’s direction is extremely noteworthy as I felt like a part of the journey and involved with the characters as I cheered them on. In the beginning, I was rooting for James, but as the movie progresses and things unravel, I was cheering for Niki. However, as the movie moves forward, I couldn’t choose one over the other. This is the type of engagement that I love in movies, it keeps the audience involved and contently thinking about every situation and the characters as a whole.\r This film is well edited and shot as well. I couldn’t find a useless or uninteresting moment in this film. Everything flowed very well and the film moved at a brisk pace. It felt as every shot or sequence is catered to moving and developing the characters and their story forward. The racing sequences are well shot and make you feel a part of the race. My heart rushed when characters successfully made narrow life endangering turns. It is a really good film to look at as the scenery and environment crafted feels inviting and absorbing.\r The cast in this film is superb. Chris Hemsworth gives his finest performance to date as a carefree playboy. Even though his character James Hunt doesn’t appear serious, he struggles with his inner demons trying to be taken a bit more seriously. Daniel Bruhl also gives and equally impressive, if not better, performance as Niki Lauda an arrogant self-absorbent racer. It’s interesting to see his character go from caring only about himself and racing to something more important. The greatest aspect of the characters are their interactions. I really enjoy how they can’t stand each other, but can’t be successful without each other either. While they hate one another, they find a mutual respect for the other. It’s quite endearing to see how they have each others back off the tracks.\r Overall, “Rush” is an amazing movie and totally worth your time. It’s a movie that has everything, from drama to humor to love. The greatest aspect of the film is its truly brilliant and masterful score by Hans Zimmer. His score gives the right amount of emotional punch along with improving everything we see and giving the film a greater amount of importance. I give this film an extremely high 4.5/5, a well oiled film that has no wasted parts."
    },
    {
      "rating": "10",
      "text": "This is an amazing film. I can't recommend it highly enough for F1 fans like me, sports fans, or anyone interested in a story of rivalry i.e. something different to the unoriginal junk movies which get churned out each year.\r All the crew involved should pat themselves on the back. They've done a fabulous job making this film critique, explore and honour two memorable F1 drivers.\r James Hunt's fun, party lifestyle along with his brash and raw driving talent. This is contrasted against Niki Lauda's methodical thinking, technical brilliance and professional lifestyle. These two characters are total opposites but as their lives are explored it also acknowledges the value of an enemy, i.e. something to beat. I believe this is a commentary on human nature in that the best of us shines when we have something to beat or overcome.\r Do yourself a favour and see it now"
    },
    {
      "rating": "9",
      "text": "Not really a big fan of f1 but i really enjoyed this movie! The characters opposed each other perfectly and really suck you into the plot which is well written and very enjoyable. Really made me see f1 in a whole different light, i would definitely recommend this to anyone!"
    },
    {
      "rating": "9",
      "text": "An entertaining account of the rivalry between James Hunt and Niki Lauda. Rush starts slowly and in a somewhat formulaic manner but after about 40 minutes things kick into high gear and the movie soars. It helps that Peter Morgan's script has bite and rises above the average ambitions of this type of movie. Ron Howard is to be commended for his direction of another film which, whilst obviously having popular appeal,in no way aims for the lowest common denominator. He captures the high energy world of the race track perfectly and the quality here, as in most of his previous films, is apparent in every frame. Chris Hemsworth charismatically portrays Hunt, but it is really Daniel Bruhl who steals the show. His Lauda is definitely the more interesting character and his presence dominates, but doesn't over balance, the film. Technical achievements are aces. Point of view cinematography puts you excitingly on the track and first rate editing keeps you there. The sound is also great. Lovers of fast moving, good old fashioned styled movies with no axe to grind should rush to see it."
    },
    {
      "rating": "10",
      "text": "\"Perfection\" is not a great word to describe this movie  This movie is \"the\" movie of 2013  I'm a Formula 1 maniac and of all motoristic sports, I'm a minor driver as well so I can understand more stuff, feeling it (no offense, just passion), so I can say that this movie is so great  Niki Lauda was acted by Daniel Brühl so perfectly, his acting was above of all oscars on this earth and Chris Hemsworth too, playing James \"The Shunt\" Hunt...The plot is so real, I mean, is so close to 75-76's era and when I was watching it, it was like I was just watching the TV, watching the Gran Prix live in that moment  Wow  What a feeling  I don't want to say so much for the people that haven't seen this movie yet, but I guarantee you, this is purely EPIC  Ron Howard is one more time a crazy genious  This movie made history this year  Great  I'm still electrified"
    },
    {
      "rating": "9",
      "text": "I never knew (or cared) a thing about Formula 1 racing, but this movie brought to life the visceral appeal of this sport and its practitioners so perfectly that I left the theater feeling like I had driven all of those races  and fought all the real-life battles that these two men endured  myself. The screenplay, cinematography and editing brilliantly juxtaposed and fused all the contradictions that make this life-threatening sport a compulsion for men like Hunt and Lauda. The two stars were perfectly cast and their portrayals (particularly that of Daniel Bruhl) perfectly humanized the characters."
    },
    {
      "rating": "10",
      "text": "I've just raced home after witnessing one of the best examples of filmmaking I've experienced in a long time. It is a character study in the manner of Chariots of Fire, with excellent acting, story, pacing, setting, dimension, and moments of pure visual poetry. If you ever thought that director Ron Howard was asexual, you were flat-assed wrong. This movies is sexy as hell. If I knew Howard better, I would give him a smack on the lips for his remarkable achievement--Rush."
    },
    {
      "rating": "10",
      "text": "Ron Howard has done a simply stunning job on this story of F1 legends, the cinematography and direction is something to behold, the actors, Chris Hemsworth and Daniel Brühl do an amazing job of portraying James Hunt and Niki Lauda respectfully. The supporting cast is just as believable and well played. Even though I knew the story going in I was shocked at how real and true Ron Howard kept it, some scenes will stay with me for a long while yet and I cant wait to see them again. This is my favorite film of the year and its going to take allot to knock it off its pedestal."
    },
    {
      "rating": "9",
      "text": "planed out very nicely shows years of the formula one race drivers james hunt and niki louder cut down also the great tragedy which also looks amazingly done incredible performance from chris who has come so far this is a film about legends this film is legends this is one of the best films i have seen all year"
    },
    {
      "rating": "10",
      "text": "The film is talking about the legendary rivalry with Niki Lauda English driver James Hunt. In 1976, during the German Grand Prix Ferrari Lauda too suddenly came around a corner and crashed. The driver was trapped in a burning car in the accident was seriously injured and in a coma. In this race eventually won by Hunt. Six weeks later, Lauda returned to racing and one of the most exciting rivalries in the history of Formula 1  I recommend 100%"
    },
    {
      "rating": "9",
      "text": "Ron Howard invested his own money and made this film without studio support because he believed there was a great story here and he was right. Howard is known for great directing and this shows in this film. I have seen some comments about how they used old race footage, but they should know the recreated most of what you see on the screen. It is amazing the attention to detail Howard and his crew did when making this film.\r I wish I could say I know the historical details to tell you how much is Hollywood fluff and how much is real, but I will say so far this seems very accurate. It is a based on a true story and do mean more then just 5% of it is based on a true story like some movies.\r The acting was good overall. Not only was the casting good, but the attention to detail with clothing, sets, cars, etc, is top notch. They did a great job creating that 1970s vibe.\r I appreciate that they did not not drag out the racing scenes. This is movie is about the people, not the cars. The racing scenes are very well done, but movie really does focus on the characters. Many automotive based movies become super cheesy, but Howard did a good job keeping it under control. There are few times is bordered on crossing the line.\r Yes, if you hate hearing the \"F\" word or seeing people use the middle finger, this film may offend you. Unlike movies who seem to use harsh language for no reason, this feels like how they really would have spoken. You will see short moments bare butts and breasts, but none of it us vulgar.\r If you are looking for a good drama with some action, this is a great movie. If you enjoy racing and do not know this story, you must see this movie. If you want to see the movie industry make a wider range of movies, then see this movie because no studio would have made this. If Ron Howard shows there is a market for more than popcorn and horror movies, then we may see more quality films of this level come out."
    },
    {
      "rating": "8",
      "text": "Immensely entertaining. I quite like F1 but I've never been massively into it so I was a bit dubious about how much I would enjoy this film but it turned out to be one of the best films I've seen this year. I'm a big fan of Chris Hemsworth so I expected a great performance off him and was not disappointed. I hadn't really seen much of Daniel Bruhl before this so wasn't sure what to expect but was thrilled with what I saw. Both of them put in a fantastic effort and the chemistry between them is really entertaining.\rBased on the brilliant writing, direction and acting I would highly reccomend this film whether you're an F1 fan or not. Definitely worth watching."
    },
    {
      "rating": "9",
      "text": "I came in feeling like this would be just another Ron Howard movie in the 7 or 8 range. I came out with a smile on my face and realized that this was not a usual Ron Howard film. The strong F1 battle between great s Niki Lauda and James Hunt could not have been documented any better. The cinematography was top-notch, and the acting was okay. The action and races in the movie were so intense, I thought that if every sports fan in America saw this movie, Formula 1 racing would make a major comeback, and possibly put an end to NASCAR. This movie is amazing and possibly an oscar winner in the future."
    },
    {
      "rating": "9",
      "text": "I went into this movie with great expectations, I am an F1 and racing fan, am familiar with the great true story the movie was based on, and I think old Opie has made some pretty good movies over the years.  Don't get me wrong at all, the movie was good, but I cannot quite call it great, and interestingly enough, I sort of expected the warm, compelling figure to be Hunt, but Lauda is really the more sympathetic and interesting character to me, even before the stuff happens in the movie that might make you want to root for him.  Still a great rivalry, great story, I am actually changing my rating from an 8 to a 9 as I write this and think about the movie, definitely worth a watch whether you are an F1 fan or not.  One of the great things about the movie is that if the story wasn't true it would seem too \"Hollywood\" but it is true, and a great story."
    },
    {
      "rating": "9",
      "text": "terrific movie, laughs, tears, tension, best use of 'ahole' ever...entertaining as a movie should be...go see this on the big screen, intelligent and exhilirating..."
    },
    {
      "rating": "10",
      "text": "The 1976 Formula 1 season saw many exciting twists and turns, but the stand out of the season is\rthe rivalry between Nicki Lauda and James Hunt. Rush is probably one of the best films I’ve seen this year, maybe even in my life. Rush is definitely one of my favorite films. I love the direction, the sound, the cinematography, acting and most importantly the story. It was incredible.\r The acting in this film is captivating. Daniel Brühl is incredible, he hits the perfect mark at playing Nicki Lauda. Brühl commands the screen whenever he is on it, his screen presence is incredible. To be honest I think that the performance delivered by Brühl in Rush is going to get him a nomination for an Academy Award for sure. Hemsworth delivers probably the best performance of his career, Hemsworth delivers a mesmerising performance as the ladies’ man and talented driver James Hunt, and Hemsworth’s charismatic performance gives the film that extra kick which pushes it into top gear.\r Another feature of the film which I love is the cinematography, I love the up close in action shots of the races. I love the use of the position of the camera in the actual position it was in when the crash happened. I loved the beautiful shots from inside the engine, the phantom camera footage of the inside of the engine working, I also loved the use of the footage of fuel being lit inside the engine.\r Ron Howard is one of my favorite directors, I love the way he can bring those fun little jokes and looks from the characters. I love the attention to detail and the way he makes even people like me who dislike Formula 1, sit on the edge of their seat during the races.\r I loved absolutely everything about the film Rush and here is to hoping that it picks up as many awards as possible and gets the recognition a film of this calibre deserves."
    },
    {
      "rating": "9",
      "text": "Very interesting! Very well directed! Emotional, I highly recommend watching this movie! It was over 2 hours! But I wasn't bored with it! It kept me on the edge of my seat till the very end!"
    },
    {
      "rating": "9",
      "text": "Director Ron Howard continues to surprise with something that looks and feels entirely European. Gorgeously shot by Anthony Dod Mantle (Slumdog Millionaire), this has been aptly described as a character study but on a grand scale. The acting is impeccable and the story and race sequences  although shorter than what I wanted  will keep anyone on the edge of their seat. One criticism is that even though the film clocks in at 2:03, it feels rushed and hurried at times, which might be appropriate considering. However, this does not take away from the overall effect of being an incredible entry into a sport that America still has not seem to discover: Formula One racing."
    },
    {
      "rating": "9",
      "text": "Ron Howard's best film in years, Rush is also one of the best film of 2013. Great drama, exciting action scenes...it really portrays the risk and toll of this sport on its 'heroes', the cool playboy Hunt and the calculating genius Lauda.  Highly recommended."
    },
    {
      "rating": "8",
      "text": "It's not the racing that will keep you on your seat, It's the great acting by Bruhl and Hemsworth that make this film all worth while. Bruhl was perfect and Hemsworth proved that is not only a very good actor but also capable of breaking from his type-cast roles as well. Ron Howard once again proves why he is one of Hollywood's top directors as well. Very well done film and I would definitely recommend it."
    },
    {
      "rating": "7",
      "text": "“Rush” is the true story of Niki Lauda (Daniel Bruhl), Formula One race car World Champ,  an Austrian born,  disciplined, mind on the prize, controlled and controlling of his life and career versus James Hunt (Chris Hemsworth) a womanizing, smoking, drinking,  charismatic, dope taker who loved the spotlight, claimed to have bedded over 5,000+ women and wanted to take that World title from Lauda. The first hour of the film concentrates on their rivalry, most of all their differences, leading up to to 1976 when the last race would determine who was the champ.\r As an example of the difference between the two men we meet Suzy Miller (Olivia Wilde) who Hunt proposes marriage after knowing for her for a minute and two years later she leaves him and marries Richard Burton while Lauda meets Marlene (Alexandra Maria Lara) and his marriage proposal to her seems more of well thought out decision to become part of his all work and no play. Marlene’s steadfast belief in Lauda changes the latter’s life and leads to the horrific and hero building second half of the movie.\r Director Ron Howard, with the help of director of photography Anthony Dod Mantle and the editors Dan Hanley and Mike Hill, takes you into the center of the cars, and the races, to the point you almost feel you know what the drivers feel behind the wheel whether it be driving in bright sunshine or beating rain hitting your helmet. As Marlene is shown being given and plugging in ear plugs it might not hurt for you to bring a pair to the theatre. In addition to the deafening sound of the racing cars there is additional, unnecessary, noise added by the music of Hans Zimmer on the soundtrack.\r Peter Morgan, who wrote the screenplay, shows you the difference between Hunt and Lauda and will have you rooting for one and then the other but he fails in not giving a payoff to that rivalry for the audience to cheer and though there are other characters on screen he doesn’t really give them any depth but they bring more to the screen than written. Alexandra Maria Lara gives off more looks than words but her looks are meaningful while Olivia Wilde is a portrait of  a 1970s jet setter. Members of the race teams add realism to the film and Pierfrancesco Favino, as real race car driver Clay Regazzoni,  who competed with Hunt and Lauda, provides humor and heft when each is needed.  Chris Hemsworth shines as James Hunt and Daniel Bruhl as Nick Lauda matches him as an opposite who seems to carry the world on his shoulders. The two actors carry the movie on their shoulders and do an excellent job.\r Don’t forget to bring earplugs and some of you get ready to take your eyes from the screen during the crash and hospital scenes! Keep in mind it is a movie!"
    },
    {
      "rating": "10",
      "text": "Before watching the film, I thought this was going to just be a silly car racing movie, with no real point whatsoever. After watching, I realized I was completely dead wrong. This movie is exciting, well-directed, well-acted and it is fantastic. Director Ron Howard does the tension incredibly well in this movie. Definitely a recommendation."
    },
    {
      "rating": "10",
      "text": "Brilliant movie, Brilliantly directed and brilliantly acted. Ron Howard once again proves he is one of the worlds best Directors. I can not say enough good things about this movie"
    },
    {
      "rating": "8",
      "text": "I enjoyed this.  I didn't know anything about either of these drivers and not that much of Forumula 1.  The story and acting were good.  I later read about a few story inconsistencies that I felt didn't need to be modified, but still an enjoyable movie and held pretty true to the facts overall.  Some of the racing sequences could have been filmed better.  Good solid popcorn movie though."
    },
    {
      "rating": "10",
      "text": "The only racing I get interested in usually involves the words “kart” and “Mario” but I was shocked by how much I enjoyed “Rush.”  The story about Hunt’s and Lauda’s rivalry during the 1976 Formula 1 racing season is interesting enough but the performances from Chris Hemsworth and Daniel Brühl are just impossibly good.  Add that with fantastic visual and heart-pounding race sequences and the film ended up being far better than I thought it could have been."
    },
    {
      "rating": "10",
      "text": "Just watched this and was blown away by an amazing story of rivalry and respect between James Hunt and Nicki Lauder in the year of 1976 with a great soundtrack to power things along. Hemsworth and Bruhl give amazing performances and yet again Ron Howard has produced another hit film for all to enjoy."
    },
    {
      "rating": "8",
      "text": "I hate racing, but Rush isn't about racing by itself, it's about an intense rivalry. Even the racing is made interesting because of the sound, score, and cinematography.\r Rush gets an 8.3/10"
    },
    {
      "rating": "9",
      "text": "Being an avid Formula 1 fan, I could not wait to see this - and it was worth the wait, Beautiful cinematography, multi dimensional characters that you care about and the trueness to the real story line make this a must see, F1 enthusiast or not."
    },
    {
      "rating": "9",
      "text": "“Rush” is about the real life fierce rivalry between Chris Hemsworth’s character, James Hunt and Daniel Bruhl’s Niki Lauda. Hunt and Bruhl were both formula 1 drivers during the 70′s and the movie tells us what happened during the years they both raced against each other.\r Chris Hemsworth may never get the Thor- stamp off him (and that isn’t that bad since those movies make tonnes of money) but he is genuinly great in this film and the best part is that he isn’t Thor. Chris Hemsworth portrayes James Hunt brilliantly. Hunt is a reckless playboy who is willing to risk his life in a car. Not only does Chris look the part, he also acts just like you would imagine Hunt acting. Daniel Bruhl as Niki Lauda is the polar opposite of Chris as Hunt. He is the rich, good boy who goes to bed early and who doesn’t party all night. However Lauda and Hunt are not only nice guys and playboys respectably. They are much more than that: Lauda is kinda douchy and not actually the nice guy you would have in a typical movie. Hunt is also troubled and you can, much thanks to Chris’s performance, see the scared side of the character. I can only say that the characters and the actors are the best part of the movie.\r Ron Howard is a very underrated director. He is a two time Academy Award winning director and yet he’s never really mentioned in the top. He is however directing this film incredibly well. The editing is also fantastic, Daniel P. Hanley and Mike Hill are really sharp, working with quick cuts, my favorite technique. There was a certain sequence in the movie where the race wasn’t shown but the result were presented through text on the screen. That directing and editing trick caught me of guard and I admire the wat it was handled.\r “Rush” isn’t really about racing. It focuses on the characters more than the cars and that’s how I want my sport movies. Similar to “Warrior” (a review for wich can be found on this very site) I don’t care for the sport in it, I care about the overall story. That being said, the sound of the motors and the way the characters (I seem to constantly come back to the characters) behave towards the sport are great and they kinda made me an ounce interested.\r I contend that John Williams is the greatest composer ever but I also believe that the best soundtrack for a movie is the one for “Inception”, “Inceptions” score is composed by Hans Zimmer. He also composed “Rush”. Zimmer crafts a score with might similar to a motor and  with the emotion and passion of the driver. It’s a beautiful soundtrack.\r A surprisingly good thing about the film is the product placement. It gave a form of credibility to the 70′s racing.\r The only real complaint I have about the film is how the relationship between Niki Lauda and James Hunt progresses. While the development is great I didn’t really buy into the way they went from non-respect to respect. I saw how they tried to introduce the growing friednship but it didn’t translate that well ont the screen.\r Overall, “Rush” is an intense, thrilling ride (pun intended) with the right focus and no real big flaws. It’s good to see more from Chris Hemsworth and even better that his range as an actor increases. The movie is far from predictable (but if you know about the real life events you obviously know how it’ll end), something that is hard to pull of in a sports movie. Even if you don’t like racing, I think you’ll love “Rush”."
    },
    {
      "rating": "7",
      "text": "Set against the decedent and dangerous backdrop of 1976’s Formula One World Championship, Ron Howard’s latest true 20th Century story focuses on the bitter rivalry between Brit James Hunt (Chris Hemsworth) and Austrian Niki Lauda (Daniel Brühl).Reuniting with screenwriter Peter Morgan (Frost/Nixon, The Last King of Scotland) Howard’s dynamic style and keen eye for period pieces bring the proceedings that Spielbergian sense of a heightened reality. From the choice soundtrack to Hunts flamboyant wardrobe the style effortlessly evokes the 1970’s while resisting the temptation for nostalgia.The films greatest strength is the ambiguous nature with which it treats the central characters. Both Hunt and Lauda are presented as flawed, driven men, though completely different from one another in their approaches to the sport. It is never made clear who we are to root for and as the season has its ups and downs audience allegiances will turn almost from race to race.Hemsworth brings the same affable arrogance to Hunt as he did to his most famous creation but is also given an opportunity to add layers to the man and as the film progresses it becomes more and more clear that the cocksure attitude and flippant disregard for life frequently displayed by Hunt is only skin deep.Brühl’s passionate Lauda drives the film with a sheer minded focus and determination that can at times be both admirable and incomprehensible.Through strong performances, dynamic direction and a sharp and evenly weighted script, Rush transcends its Formula One backdrop to focus on the nature of rivalry, sportsmanship and risk. Like all great rivalry films (see The Prestige, Warrior) it will split your allegiances, make you sympathize with and at times detest its characters and entertain regardless of your interest in the subject matter."
    },
    {
      "rating": "8",
      "text": "Surprisingly really good and even it being a true story makes it even more amazing, the cast do really good for what they're given, especially James Hunt (Chris Hemsworth) and Niki (Daniel Brühl) they give probably the best performances throughout. Also, the makeup artists do a fantastic job with certain characters and it honestly looks real for the most part, which is really good. Finally, the story is outstandingly brilliant and honestly there's some brutal and bloody scenes throughout this movie, which I wasnt expecting but it still adds to the movie being really good. Last thing here, I think the race scenes were quite fun and entertaining and I really liked them. Overall, I'd honestly say if you like true stories and racing movies, this is the movie for you. Its honestly, worth the watch."
    },
    {
      "rating": "9",
      "text": "I'm not a Formula 1 fan, but this movie was really appealing to me. The development of characters and plot are so well constructed that it is impossible no to enjoy this movie as a master piece."
    },
    {
      "rating": "10",
      "text": "\"Rush\" is an awe-inspiring story filled with nail-biting, fast-paced racing scenes and it's right up there with some of Ron Howard's best films. While you might go into \"Rush\" thinking it's going to be Hemsworth's show, it's Daniel Brühl's unforgettable performance as his rival that has the most impact"
    },
    {
      "rating": "10",
      "text": "What an amazing  movie about to legends of the track  Niki Lauda is a machine unbelievable driver and technician and James Hunt just pure raw talent  Chris Hemsworth &  Daniel Brühl do them both justice such a enjoyable movie well filmed really intense action just one of them all round completely brilliant films a must see."
    },
    {
      "rating": "10",
      "text": "This movie is everything it should be. It's superbly shot, edited, acted and it tells a good story. It's definitely a hollywood-type movie... that's a bit fluffy... but it's a lot of fun. I felt something for both the characters, was on the edge of my sit at moments during the race scenes... and was moved by the ending. The theater was full at last night's show... more than half the audience clapped at the end... as did I."
    },
    {
      "rating": "10",
      "text": "What a great movie, shows how Formula One was (is), it's good from beginning to end. Not sure if this is a date movie, but if you like racing, it's great. Ron Howard is the best."
    },
    {
      "rating": "10",
      "text": "Simply, one of the best movies ever made!!! I have already watched it 2 times!!!! Pure entertainment, pure rush!!! Watch it!! Go see it!!! It's absolutely wonderful!!!"
    },
    {
      "rating": "10",
      "text": "This movie has a lot going on for it  it's stylishly shot, has great energy and direction and a good SOLID story to go with it! The performances are great, at times I was sitting on the edge of my seat, other times\rhaving a good chuckle and then other moments or actually feeling sad and sympathetic for the characters. Someone else said the audience clapped at the end of the movie, they did at my screening too.\rIt's pure entertainment, would have been a great summer blockbuster."
    },
    {
      "rating": "7",
      "text": "It's a good, solid action flick, but not nearly as good as Senna from a few years back.  Supporting characters are merely ok. Daniel Bruhl as Nikki Lauda is an interesting and compelling figure that I wanted to know more about. His on-screen wife Alexandra Maria Lara is striking and outstanding, as usual. The visuals are extremely slick  if you have any interest in the sport, definitely check it out. Just keep your expectation in check  it's not a transcendent story."
    },
    {
      "rating": "9",
      "text": "You don't have to be a fan of formula 1 racing, if you like great acting with a great script and tremendous back-and-forth rivalry, then you'll love this movie. Overall, it's an interesting rivalry. Be sure to check out my YouTube channel, \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "10",
      "text": "its quite please to watch and definitely oscar material.One of few movies that managed high standards and fan friendlyness.full with emotions and thrill and no over ating at any point at all."
    },
    {
      "rating": "8",
      "text": "Wow.now this shows how formula 1 has become a n ultimate competition.truly inspiring.awesome movie.Chris hems worth has shown his career best performance"
    },
    {
      "rating": "5",
      "text": "It took a while for me to decide if I actually enjoyed Rush or not  and eventually I concluded that any film that left me with such a mixed impression should be critiqued as such. While Daniel Brühl gives an outstanding performance, the direction is inconsistent and a lot of the beginning is very bland and cliche. Overall, the film had some very strong highliights, but there were some weaker moments that felt out of place. The main problem, oddly enough, can be solved with one small storytelling choice: Don't hide Lauda as the main character. Let him emerge as the star, and the rest would've fallen into place."
    },
    {
      "rating": "9",
      "text": "Rush fue una sorpresa que me atrapó con los pantalones abajo en la sala de cine, porque, obviamente no me esperaba tal cosa ¡Qué equivocado estaba! Rush, del veterano director Ron Howard, aparte de captar una narración espléndida, tiene atrás suya dos de las mejores interpretaciones del año, Chris Hemsworth como Hunt, y Daniel Brül como Lauda. Una película que recomendaría más que nada a las personas que disfruten del automovilismo en general, pues las escenas de carreras son magistrales en todos los sentidos. Muy seguro de mi mismo, digo que estamos ante una de las mejores películas del año 2013."
    },
    {
      "rating": "10",
      "text": "几乎是一部完美的电影，可以说是挑不出任何的缺点，从影片的基调，剧情故事，演员表演，剪辑，配乐等等无一例外都是好莱坞的最强水准，特别是Hans Zimmer激赞的配乐百听不厌，几场比赛更是爽快至极，两位主演带来了他们最好的演技。"
    },
    {
      "rating": "1",
      "text": "Firstly, all the race scenes including spectators were just ripped-off from the original race clips!!! Secondly, did Lauda used the \"F\" word often. Hemsworth and Burl did their job well. Overall the movie was nothing original!!!"
    }
  ]
}