{
  "id": 3622,
  "title": "Safe House",
  "starring": [
    "Denzel Washington",
    "Ryan Reynolds"
  ],
  "runtime": 115,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "A dangerous CIA renegade resurfaces after a decade on the run. When the safe house he's remanded to is attacked by mercenaries, a rookie operative escapes with him. Now, the unlikely allies must stay alive long enough to uncover who wants them dead.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7SYBPjv5ywF6cI4BSFFtlDyChT2.jpg",
  "categories": {
    "plot": 6.351351351351352,
    "acting": 6.2894736842105265,
    "ending": 5.75,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.926829268292683
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Is it a great film?  No.  Does Denzel once again prove he is one of the most amazing actor's of his generation?  Yes.  Ryan Reynold's is passable, but it really is Denzel's film and he is able to turn a good script into a very good one.  Worth seeing alone for Denzel's performance.  Loads of action, lots of fun."
    },
    {
      "rating": "7",
      "text": "Knowing that the critics gave it a lukewarm reception, I went in with moderated expectations, and I was pleasantly surprised.  Reynolds is not the typical nubie (he's more deliberated, focused, and cerebral), and Denzel does his typical solid job as the dramatic heart and soul of the movie.  The look of the film is fantastic, and the action sequences are exciting. The conclusion could have used some work."
    },
    {
      "rating": "6",
      "text": "In a complicated deadly game of international espionage things are rarely what they appear to be. Take the case of Matt Weston (Ryan Reynolds), a young man who, for all intents and purposes, appears to divide his time between his adoring French girlfriend (Nora Arnezeder) and a South African hospital. But if one were to pull back the curtain they would learn that Matt is actually a CIA agent who spends his time watching over a safe house, an assignment of painfully tedious monotony. In the new action thriller â"
    },
    {
      "rating": "5",
      "text": "The film provides the great acting of Denzel Washington and Ryan Reynolds' poor talent. Although in some ways the film is entertaining, in other respects doesn' t exceed expectations. Safe House is an inconclusive film."
    },
    {
      "rating": "8",
      "text": "This was a fine action thriller with some, um, really thrilling action. Now I'm just typing words. Words words words words words words words words words words words words words."
    },
    {
      "rating": "8",
      "text": "What else could be said about Denzel Washington? The man has started in AAA titles for most of his career. We all know he's very selective of the roles he chooses & better yet, the co-stars he surrounds himself with. From big names like Russel Crowe to Ethan Hawke. He's very particular. So when I saw that his co-star in this film was Ryan Reynolds, I thought \"Hmmmm?\" & let me reassure you people, Reynolds delivers! Ryan Reynolds plays \"Matthew Weston\" a \"house keeper\" which is an agent for the CIA in charge of an interrogation house in the numerous locations all around the globe. Weston's location happened to be in Cape Town, South Africa. His average day is pretty uneventful, until one Friday morning agents bring in \"Tobin Frost\" basically the black version of \"Ethan Hunt\" played so well by Denzel Washington. Now up to this point all you need to know is that Washington was brought into the \"Safe House\" which Reynolds is in charge, to be interrogated for something he holds \"within himself\". PS: I'm trying my hardest no to give out too many spoilers in this review, but its pretty hard not to. Back to my review. All of a sudden about 12 heavily armed men bust into the \"Safe House\" & the massacre commences. Now Reynolds is pinned to a corner, he knows they want \"Frost\" alive & that he will die in the gunfire unless he does something.... & fast. From there on out the film shifts into \"hyper-drive\" & never lets off the gas. I really enjoyed the fast action pace of \"Safe House\" but most of all I was SUPER impressed by the performance by Ryan Reynolds. Not to take anything away from Denzel Washington but the man is like a fine wine, he only gets better with age. Reynolds on the other hand, has had bad films like \"The Amityville Horror\" & \"The Green Lantern\" I thought this guy really couldn't redeem himself after that pile of crap. I stand corrected, tonight proved that a great actor can make an iffy co-actor step his game up to a much higher league. Reynolds not only kept up with Mr. Washington, he challenged him. Not an easy task when you're talking about Denzel Washington. In closing I'd like to recommend this film to everyone who's looking to have a great time at the movies & loves an action packed thriller. Because \"Safe House\" is the \"Safest\" bet at the  movies, so far this year."
    },
    {
      "rating": "8",
      "text": "First things first.... this is an action movie.  Nothing more, nothing less.  I was amazed at the hypocracy of just about every critic who reviewed this movie (the first critics reviews I read were from James Berardinelli, Todd Mcarthy, and Justin Chang).  Those 3 critics (among others) praised the most recent Mission Impossible movie, when that movie was similar to this one.  Similar in the sense that Mission Impossible had a crap story (like Safe House) and was all about the action.  I can't understand why they loved that movie, but didn't like Safe House.  Safe House's action is completely believeable, and is very intense.  There are 6 legitimate action scenes, all of which are gritty and suspenseful, which is much more than I can say for that crap movie Mission Impossible.  Safe House is meant to be an action movie.  That was clearly the goal of the director for this movie, and they pull that aspect off beautifully.  Critiquing a pure action movie for a poor story is fine, but it's pretty much the same thing as knocking a drama for not being funny enough.  Go see Safe House for the action, and if that's what you're expecting you won't be disappointed.  Denzel hasn't kicked this much a$$ since Training Day.  His character may not be as interesting as it could have been (same for Ryan Reynolds), but they have a solid chemistry together.  The story is pretty average at best, and the writing/acting is average as well, but I have to give this movie a lot of credit.  Action movies RARELY have good stories or character development, and Safe House is no exception.  Still, Safe House's action is relentless and exhausting.  It was definitely worth my time and money to turn off my brain a little to enjoy it.  To hell with the hypocritical critics."
    },
    {
      "rating": "7",
      "text": "I liked it - even though I knew going in the general premise, it was just well done, and actually believable. Which is more than I can say for Mission Impossible, and for the critics who panned this movie while praising that one, you are most likely in the pocket of the big studios - I call you out - foul! MI is so beyond reality that I can't even watch them anymore"
    },
    {
      "rating": "8",
      "text": "Yes, many of us have seen such flix before but this is somehow refreshing in its gritty authenticity. Lots and lots of fighting with several twists and turns accentuated by key 'splosions, it's a good time for guys - keep the kids and chix away."
    },
    {
      "rating": "6",
      "text": "It doesnt have a substantial plot and channels a lot of Alias spy drama done years ago but I do think that the movie is very well acted by Ryan Reynolds showing great emotion and Denzel Washington showing great wit."
    },
    {
      "rating": "8",
      "text": "A very solid action thriller, Safe House looked a bit Bourne-esque to me, with the plot revolving around CIA, with it being corrupt. its agents betraying each other and some \"social stealth action\" with main characters evading baddies using crowds. Washington and Reynolds' performance is outstanding, the plot is gripping, and it's a really good movie overall."
    },
    {
      "rating": "8",
      "text": "A great film. The movie will have you jumping out of your seat every 10 minutes. One of Ryan Reynolds best performances (which isn't saying much) but it was still an enjoyable performance by him. Denzel Washington has once again proved that he is one of the best actors of our generation. This movie is definitely a must see."
    },
    {
      "rating": "9",
      "text": "The film starts out fast and rarely lets up. I found myself rooting for Reynolds the entire movie and against Washington, of course until the end. Both actors played their roles phenomenally."
    },
    {
      "rating": "9",
      "text": "Awesome Acting, Ryan Reynolds does an outstanding job is this movie. Great and realistic fighting scenes. Big Explosions! You get right into the story."
    },
    {
      "rating": "5",
      "text": "If you are 20 years old and have seen 30 hot pursuit movies then this move will be fantastic. However, if you have seen 100 such movies in your life then this will be boringly formulaic. If you are wanting to see the stunning Cape Town, rather go watch a travelogue."
    },
    {
      "rating": "10",
      "text": "I love the movie safe house, and I seen this one in theaters when it first came out. I think Denzel Washington did an awesome job, as a CIA agent who went rogue, and while on the run, he had met Ryan's Character and he gave him some really great advise. He  told Ryan's Character to not be so trusting in those he's working for, because they will stab him in the back and they did. This is Denzel's very best performance, ever, yes better than training day. I think when the famous Oscar's are approaching and the nominees are chosen and the movies are selected, this should be on the Oscar's number one list of best movies, and I also think no one should turn their heads away from Ryan Reynolds who also gave his best performance. If this movie isn't consider an nomination for best picture, I will never, ever, ever watch another award show forever. Especially the boring and ever so snoring Oscars. But watching those  who you really want to win, will definitely living things up all together."
    },
    {
      "rating": "2",
      "text": "Yuck film......I mean the acting is good and the action free flowing but the plot is completely devoid of any originality.  I love an action flick as much as the next bloke but it tried to be too smart and failed and therefore failed as a film......Dont waste your cash.Oh and Brendan Gleeson is better than this even if Denzel isn't"
    },
    {
      "rating": "4",
      "text": "Denzel Washington snoozed thru this formula copycat of Borne.  Not much to see here with a totally predictable ending.  Wait for this one on free TV if you must see it."
    },
    {
      "rating": "5",
      "text": "Ryan Reynolds works for the CIA \"hosting\" a safe house in Cape Town. It's dull work until Denzel Washington (rogue ex-CIA agent) shows up as a detainee. After they're forced to flee, there's lots of chasing, lots of fighting and lots of jerky camerawork that makes it hard to see what's really happening. Washington plays his usual cool character and Reynolds gets to be sensitive and insecure. The plot is predictable and the action is never special. Although it's never boring, it's in no way special."
    },
    {
      "rating": "5",
      "text": "If you haven't seen any of the \"Bourne\" movies, then you might enjoy this one.  The plot is completely stolen from \"Bourne\" which made the movie totally predictable for me.  Ryan and Denzel give it their all, but their performances alone couldn't carry the film.  I'm also getting more and more irritated at directors that insist on using the \"shaky camera\" technique.  Will this new shaky camera fad ever end?  I liked the locale where it was filmed but hope there is more originality if the series continues."
    },
    {
      "rating": "2",
      "text": "I wanted this film to be good but it was just exhausting. Denzel's scenes were left on the cutting room floor because they set him up as the master manipulator and then no manipulation. For some reason it turned into a Ryan Reynolds movie running around reacting. This isn't a Denzel film it is a Green Lantern without the costume set on earth without the aliens."
    },
    {
      "rating": "5",
      "text": "You donâ"
    },
    {
      "rating": "3",
      "text": "Good acting I guess. Its just that the movie sucks . Its no Jason Bourne. Its not even complicated. Its weak. Amazing how even with such good actors a script like this seems to slide past everyone."
    },
    {
      "rating": "1",
      "text": "I can overlook a lot of flaws for a good action flick.  But this movie is so flawed all the way through, there is nothing left to like.  How some reviewers can think that \"documentary style\" camerawork enhances filming is beyond me.  \"Safe House\" is shot like a shaky hand-held home movie -- maybe they did use a hand-held camera?  How else could they have gotten all the jiggling and swinging up and down, back and forth?  It's often hard to tell who's fighting, much less who's winning and how they're doing it.  I guess the shakiness and jiggling are meant to keep the audience on edge, but to me it's cheating to try to create effects that should come from the action with just an annoying, uneven camera.  It did keep me on edge, but in an irritating way, not an entertaining way.  This jiggling is kept up all through the movie -- not just in the chase and fight scenes, but also in offices and phone conversations, the camera just can't stay put.  There's not much of a plot, either, but this isn't essential in an entertaining action movie, which this definitely is not."
    },
    {
      "rating": "10",
      "text": "I was pumped to say that this is one of the best Ryan Reynolds films I've ever seen. Worth watching since we get to see Denzel and Ryan act with a load of action scenes."
    },
    {
      "rating": "5",
      "text": "It's not like u won't enjoy it at all, but this talented combo could hv produced so much more w a helping of originality & innovation, instead of the formulaic, lone wolf vs. the big bad intel organization.  U've seen this b4, & probably done better.  If u think u know how it's going 2 turn out, ur right, u do.  Unless ur just a die hard Denzel fan, I'd skip this one.  Re-watching Hurricane would b an improvement."
    },
    {
      "rating": "3",
      "text": "In the beginning it starts out as an action filled  thrilling movie, but than it loses its excitement and it becomes a simple action movie which we have tons off.  The good actors performance like Denzel keep the movie running and stops you from running away screaming \"HELL NOOOOO!!!!\".  No more to say and i was still generous with the 3/10"
    },
    {
      "rating": "10",
      "text": "Good Movie. Good Story. Good Cast. Good Action. Excellent film, not something I would see if there was another 'better' option on, but there wasn't and I enjoyed it. :)!"
    },
    {
      "rating": "2",
      "text": "What a disappointment! I don't see how Denzel Washington could associate himself with such a low-quality production"
    },
    {
      "rating": "6",
      "text": "Solid performances by Denzel Washington and Ryan Reynold's and a promising story are let down by a shallow script.It's a mostly okay movie in terms of espionage thrillers but it could have been more and a bit less predictable."
    },
    {
      "rating": "6",
      "text": "Denzel Washington is a charismatic actor capable of delivering powerful performances.  In Safe House he brings us yet another solid performance, however not in the class of his Training Day stunner."
    },
    {
      "rating": "7",
      "text": "A well made film with some nice stunt work and an awful lot of fight sequences; maybe a couple too many IMO. The performances from both Denzel Washington and Ryan Reynolds were pretty good, although nobody was particularly stretched. Plot-wise, I guess it was ok but it didn"
    },
    {
      "rating": "8",
      "text": "I loved this movie. Denzel Washington did a great job acting, but I thought Ryan Reynolds actually out-acted Denzel in this movie. It started out very fast and kept going with the action. The plot wasn't the best but it was interesting and I'd like to see a sequel. I thought that the ending could have had more of a bang, but I was satisfied at least. Good solid movie."
    },
    {
      "rating": "6",
      "text": "So full of gun play that I swear I left the theater with GSR and blood splatter on my clothes.  Still, Reynolds and Washington made for an interesting odd couple approach to the usual paranoid spy-based shoot 'em up. Sometimes you're in the mood for one of these films... Had they cut some of the endless car chasing stuff in favor for the inner workings of how a safe house works? It would have given us a little breather."
    },
    {
      "rating": "6",
      "text": "CIA agent Matt Weston (Ryan Reynolds) is stuck in a dead-end position looking after a safe-house in Cape Town, South Africa. When Tobin Frost (Denzel Washington) is brought into his custody he is given an unexpected chance to prove himself to his superiors.\r Featuring all manner of gunfights and car chases, many of which are very well shot, and thanks to very good central performances from Reynolds and Washington everything moves along at a good pace. However after an interesting opening Safe House settles into a rather over familiar plot in which the duo attempt to keep highly sensitive information from falling into the wrong hands. Many of the plot twists, including the ending, are also rather predictable meaning that, while it is more than watchable, this is not really a must see movie."
    },
    {
      "rating": "9",
      "text": "52 is an astronomically low score for this movie. I don't know if the critics watched the same movie as i did, but the movie i saw, titled Safe House with Denzel Washington and Ryan Reynolds was a damn good movie. Ryan Reynolds gave the performance of his career, i can now label him as an actor, after such horrible films like the change up, and the very disapointing green lantern film adaptation. Denzel Washington was of course Denzel Washington, badass, and another perfect performance to go in his book of superb films. Safe House will have you on the edge of your seat and throw you onto an action-packed ride you will love for sure. It will have you rooting for the good guy and the bad guy at the same time. It's pulse-pounding, action-packed, and VERY exciting. If you appreciate good movies, you will LOVE this one, go see this now, you won't regret it. 9/10"
    },
    {
      "rating": "4",
      "text": "As a thriller lover i gotta say this movie really disappointed me. Nothing new . Seeing many films with same pattern was this was probably the worst. The story sucked so much. It wasn't like other Denzel Washington films.  I loved all his films but this one was him worst . Not his acting though . He did fine , so did Ryan . But the story and everything else just sucked . Direction wasn't that good either . It seemed just like a 2 hours long Bad TV Action Drama.Expected more and it had let me down !"
    },
    {
      "rating": "4",
      "text": "Not too much to say about this one ...\r Predictable, shallow, regurgitated, nothing new under the sun. Borderline booooring.\r Yeah yeah. Denzel is good, as usual, but even that's not enough to spring life into this \"been there, done that\" film.\r It's the Jason Bourne series' little brother with down syndrome ..."
    },
    {
      "rating": "6",
      "text": "Can't really go wrong with a Denzel Washington movie, even one as predictable as this one (this one is exceptionally predictable).  Ryan Reynolds does another decent job in a non comedic role.  The plot could have been flushed out better and the story could have been more original.  I think a monkey could have penned the story on this one: corrupt CIA agents double cross each other and innocent guy is caught in the middle---hope thats not a spoiler--considering i think its the theme of about 70 other movies.  The director does do a great job with pacing and making the movie particularly intense.  Not one you will fall asleep on.  Worth the rental or two hours on HBO."
    },
    {
      "rating": "5",
      "text": "A Bourne knock-off with some cool action but nothing very original or clever."
    },
    {
      "rating": "6",
      "text": "Denzel Washington is one of the best actor out there. He elevates what can be considered a typical spy caper, action flick into something a bit more.  But this film has been done before, and its called 'Training Day'. Once it focuses on its characters, Safe House is pretty good. But there's just too many generic action set pieces in between.  Ryan Reynolds again is saved after gosh..how many flops he's in. He's a GREAT supporting actor, but not a good leading man.  Don't expect this film to rock your world or anything..."
    },
    {
      "rating": "7",
      "text": "According to cinemas, when spies get in trouble, they always have assortments of safe houses just waiting to be temporarily populated, free of all pursuers at least until the next scene. As Safe House would say it, instead of only a vacant house, there's actually someone watching over the house called housekeepers and not always a thrilling job. Matt Weston (Ryan Reynolds) is an agent in charge of a safe house in Cape Town who is unsatisfied with his low ranking job. It will soon change as Tobin Frost (Denzel Washington), a high value target for selling vital information is captured and brought to his secure residence.Ironically after Frost set foot in there, it's not that safe anymore as a mysterious party chases him desperately and determines to kill everyone in sight, Weston now included. Then off they go in a cataclysmic run across the town, leaving trails of bodies and broken cars. It becomes apparently and painfully clear from the start that the editing and cinematography suck, horrible even. Majority of the shots are blurry, excruciatingly dark, from odd angles and questionably shaky. I can't comprehend what's the point of the shaky cameras. If the director wanted to do rawer outlook, certainly it didn't require him to use epilepsy point of view.The same goes with the action, compared to recent Haywire which had quite similar chase scene, this one feels too forced and out of focus. The editing is a pure mess, it steals the rhythm and really takes you off the action which could be decent otherwise. Its use of color is a bit drab, which in itself is not bad considering Denzel's previous movie, Unstoppable, also had dreary look to it. But the way Safe House is presented is headache-inducing, especially in darker scenes with lots of camera changing.The cast however gives an excellent performance through out. Denzel's acting is superb, he exudes confident and experience, continuously changing from silently harsh to ice cold with charisma. Ryan is just as good, perhaps even better in some scenes. His depiction of young agent is cleverly filled with emotions. He is sort of an idealist faced with predicaments that could alter his beliefs. Sometimes he looks like he's about to fall apart, only to get back up and encounter even direr problems.Aside from these two, the rest are also great talents. Vera Farmiga (Up in the Air), Brendan Gleeson (One-eyed guy In Harry Potter), Sam Shepard (Black Hawk Down), each plays CIA agen. One of them might, or might not be involved in the mess. Weston is constantly tested as he tries to figure out where his allegiance lies. Some of the lines are somewhat dull, unfortunately impede their brilliant performances. In fact, the better moments come from more quiet ones, not in the midst of loud gun shots and screeching tires. And it is unapologetically horrifically loud. Fight and chase scenes have appeal, but again the camera and editing ruin them. There are little bits of Bourne trying to squeeze its way to the surface fruitlessly. The script is predictable and story isn't that original. Regardless of poor directing and flaws, the cast manages to pull this one to an enjoyable height. 7/10"
    },
    {
      "rating": "6",
      "text": "The acting was phenomenal and the fighting and action sequences were really well done. Unfortunately, there's also a plot and it was terribly cliche from beginning to end. This movie felt almost like they took the stories of all the other movies in the genre and took all of the common denominators and made the plot based off of that. I also wasn't a fan of the way the movie was edited together. The massive amount of quick cutting didn't make the movie more intense, it just made it annoying to watch. There was definitely some entertainment value here but the flaws stood out too much to really get entrenched into the story, which was pretty weak anyways."
    },
    {
      "rating": "6",
      "text": "Denzel Washington is one of my favorite actors, and anyone who follows him knows that he is pure intensity. For that reason, he is usually best paired with someone who is charismatic, but in this film, he's paired with Ryan Reynolds, another intense actor, leading to a very straightforward and inflexible film. Safe House is your typical C.I.A. inspired action film, that features a wanted traitor turning himself in, in order to escape the men he's doubled crossed. The names and places are different, but the story is the same, lots of fighting and corruption, traitors and double agents, it's nothing new. The intensity in Safe House is just off the charts, as there isn't one second of comic relief. The movie starts intense and just continues that way until the end, which really does an injustice to the always strong performance of Washington. The fact of the matter is that this film could have been an interesting one, had Washington and Reynolds had any chemistry whatsoever, but they were basically the same person, on opposite sides of the table. Chemistry in a film like this is really everything, even in a film like Unstoppable, another straight forward and highly predictable film, it was entertaining because of the chemistry between Washington and Chris Pine. All in all, Safe House is an average film, without much of a supporting cast. It's two hours of chases and gun battles, over the same stuff that all these other films are based on. It's a textbook example of an action movie, with nothing else. It is forgettable and isn't unique in anyway, just the same thing you've seen a million times before."
    },
    {
      "rating": "6",
      "text": "It was nothing special. Entertaining, for the most part. Denzel Washington's character was an interesting one, and he also played him well. I kind of saw the 'twist' coming, as I didn't expect Denzel to be the bad guy. Overall, it's an OK movie."
    },
    {
      "rating": "6",
      "text": "Decent story and acting, ruined by intentional technical carelessness. Shakycam is evident throughout the movie, continually reminding you that there is someone holding a camera. Film grain, of all things, is everywhere. Several scenes or actors are shot completely out of focus. This sort of hipster-esque discarding of any decent filmmaking abilities has destroyed many recent movies, this being another victim."
    },
    {
      "rating": "5",
      "text": "I don't know what I expected from this film, but this definitely wasn't it.  The best way I can describe it is that the writer/director lacked confidence in the story (for good reason, it's pretty bland) and tried to overcompensate by trying too hard to be clever.  The acting is passable, but there was no real sympathy for any of the characters, and I really didn't care what happened to any of them.  Disappointing."
    },
    {
      "rating": "8",
      "text": "Angels:I love Denzel (I agree with werecar-Denzel can turn dross to gold), and Ryan Reynolds is a good actor.  They both play their parts well.  And the  fun part was that I predicted who the bad guy was, and I got it wrong! (See the movie and you'll understand what I mean.) So why do I only give this 8? The problem is that I keep comparing it with the 2nd Bourne movie, and the 1st blond bond (Danny Craig) movie and it does not stack up. OllieWillie is right;  the plot is derivative. (Except of course that I could not predict who the bad guy was.) Also, a movie like this needs great fighting.  And the fight scenes were only so so. Again, it loses in comparison with Bond & Bourne.  Still, my honey and I agree (this time) that it was an enjoyable evening with Denzel and Ryan. And honestly, somewhere, there is a portrait of Denzel where he appears old, decrepit and desiccated. Angels, protect me."
    },
    {
      "rating": "5",
      "text": "I always love denzel washington. He plays a great hero character,and also makes a great bad guy. Here he's some of each, which is interesting to watch, but also confusing to the plot. Most of the movie i felt like i was trying to catch up with what was going on, between the hyperactive shaky camera chases and spy technobable..lots of people talking about 'clearences' 'black ops' etc..by the end of the movie you wonder what it was all about, and why the characters felt it was so damned important. You wish a movie like this had something a little more directly threatening  hanging in the balance, like say, a nuclear bomb or poisin gass cloud or something. Safe house is mostly a bunch of shadowy figures barely identified running around killing each other for some information on a disk of some sort, which could be embarrasing to some other people we don't know about, and therefore may or may not be worth money. At the end of all that chasing and bloodshed the payoff seems so blandly inconsequential you wonder how so many people had to get killed in the first place. And speaking of the killings,  the director seemed fixated on cheap jump scares over and over. If you're watching the movie and two people are speaking casually, watch out, there's a shooting coming. So many people were surprised by bullets when they weren't looking that i left the theatre thinking they could have alternatively titled this !!BANG!!!: the movie."
    },
    {
      "rating": "8",
      "text": "I've been to the movie theater, and I just got home from watching Safe House, and I actually thought it was pretty good. Judging from how good I felt the movie was, I was kinda shocked to see it only scored 52 here on metacritics, so I decided to register and give my 2 cents. The movie on its own was really good, I liked the plot, the way the movie was shot (the shaking camera, despite seeing people bad mouthing the movie because of this), but the actors really helped to lift Daniel Espinosa's work - both Ryan Reynolds' and Denzel Washington's acting.Great movie, 8/10 from me."
    }
  ],
  "recommendations": [
    "the_taking_of_pelham_1_2_3",
    "snitch",
    "the_equalizer",
    "unstoppable",
    "angel_has_fallen",
    "run_all_night",
    "the_commuter",
    "the_mechanic",
    "2_guns",
    "contraband",
    "jack_ryan_shadow_recruit",
    "parker",
    "shooter",
    "16_blocks",
    "the_italian_job",
    "the_town",
    "killer_elite",
    "homefront",
    "jack_reacher",
    "jack_reacher_never_go_back",
    "the_guardian",
    "inside_man",
    "triple_frontier",
    "mechanic_resurrection",
    "21_bridges"
  ]
}