{
  "id": 308,
  "title": "Safer at Home",
  "starring": [
    "Jocelyn Hudon",
    "Emma Lahana"
  ],
  "runtime": 82,
  "genre": [
    "Thriller",
    "Horror"
  ],
  "description": "Two years into the pandemic, a group of friends throw an online party with a night of games, drinking and drugs. After taking an ecstasy pill, things go terribly wrong and the safety of their home becomes more terrifying than the raging chaos outside.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/2mfnSVdDartB6TJ3k7Qyn0zMzKu.jpg",
  "categories": {
    "plot": 0.0,
    "acting": 0.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 0.0,
    "familyFriendly": 5.0,
    "funny": 0.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Just hang in there, one day will get a good movie surrounding COVID.This is yet another one of those movies that takes place on a laptop or some online chat room like Zoom, but in this movie, there make up a website that's just like Zoom. And of course, something bad happens in the call, but this time it’s no ghost or anything supernatural. I find it a little strange how every character in this movie has the best quality cameras ever, especially on a live call, because it looks HD and cinematic. Whatever the call glitches out, you can tell it was added in post-production and it looks so terrible. And every time someone picks up their laptop or phone, they grab the camera, so it's not 100% clear what's happening there. The acting from everyone was awful, not funny bad, just bad. There's a really stupid moment in the movie that takes up the whole movie. Basically, the incident that gets this movie going is a heated argument between a couple while on online call with friends, he accidentally pushes his girlfriend (or his wife, I don't remember and I don't really care) to the ground, hitting her head and knocking her out cold, we shortly see blood start to comes out. You would think at this point one of the people in the call would call an ambulance, but for whatever reason they don't, and instead they take up the time to fool around in panic mood. I was literally yelling at the screen for them to call an ambulance, but sadly the characters could not hear me. That's the whole movie right there, someone accidentally commits murder while everyone else on the call is a witness.  So, expect a lot of running, a lot of yelling, and a lot of crying. The cops are called at some point. The cops chase after the guy who committed the crime. The cops shoot the guy while this online chat is still going with everyone watching. However, it turns out the girlfriend isn't dead at all and she was just knocked out. She wakes up just in time to watch her boyfriend die on camera. And then the cop who shot the boyfriend picks up the camera and sees who's in the chat, and everyone (expect for the girlfriend) quickly logins out of the call, which was unintentionally funny during a \"serious\" moment.So, if you look at the poster, the woman screaming her head off, that is her reaction to seeing her boyfriend dying.I just summed up the whole movie right there. You're welcome. So, all of this could've been avoided if they just called the ambulance. What a stupid **** movie! And yes, I just spoiled the movie. You know a movie is bad when I don't care about spoiling it, because it's such a waste of time.What was the point of this? Overall rating: Dumb"
    },
    {
      "rating": "0",
      "text": "This movie was one of THE worst acted and written dumpster fires I’ve ever seen. The premise is an exaggerated disaster, rife with shallow political commentary. The actors are annoyingly overly dramatic. They reuse multiple video clips throughout while driving a car. The plot has more holes than an Oklahoma highway. It was a titanic waste of 90 minutes, and this is coming from a guy that loves B movies and independent horror films. This flick was not scary, thrilling, humorous, or intriguing. It gave me indigestion and it was a journey just to get through."
    },
    {
      "rating": "0",
      "text": "Garbage sjw nonsense masquerading as a horror film. Save it, we've had enough of this bs"
    }
  ],
  "recommendations": [
    "frozen",
    "the_strangers",
    "paranormal_activity_2",
    "paranormal_activity_3",
    "the_devil_inside",
    "paranormal_activity_the_marked_ones",
    "the_bye_bye_man",
    "halloween_kills",
    "unfriended",
    "paranormal_activity_4",
    "28_weeks_later",
    "project_x",
    "how_it_ends",
    "knock_at_the_cabin",
    "cosmic_sin",
    "the_purge",
    "stay_alive",
    "doomsday",
    "slender_man",
    "snakes_on_a_plane",
    "jurassic_world",
    "unhinged",
    "cloverfield",
    "awake",
    "machete_kills"
  ]
}