{
  "id": 368,
  "title": "Salt",
  "starring": [
    "Angelina Jolie",
    "Liev Schreiber"
  ],
  "runtime": 100,
  "genre": [
    "Action",
    "Mystery",
    "Thriller"
  ],
  "description": "As a CIA officer, Evelyn Salt swore an oath to duty, honor and country. Her loyalty will be tested when a defector accuses her of being a Russian spy. Salt goes on the run, using all her skills and years of experience as a covert operative to elude capture. Salt's efforts to prove her innocence only serve to cast doubt on her motives, as the hunt to uncover the truth behind her identity continues and the question remains: \"Who is Salt?\"",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ppXyhOe8UCEOrBRSYqE3SkHwrcR.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.333333333333333,
    "ending": 3.5,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 5.875,
    "funny": 3.3333333333333335,
    "action": 5.235294117647059
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Like \"Jerry Maguire\", \"Salt\" could have been the usual blockbuster with a obvious script/formula if it wasn't for Angelina Jolie's surprisingly good performance."
    },
    {
      "rating": "10",
      "text": "Salt is great. Really entertaining summer movie, not pretentious at all. Angelina is phenomenal."
    },
    {
      "rating": "8",
      "text": "It's true. I'm an Angelina Jolie fan for all the wrong reasons. For my taste, she is at her best playing an action heroine and oozing sexuality. Make it a spy thriller and you can pretty much bet that I'll be first in line. In my opinion, there are two ways to evaluate any film. You can consider its technical elements and the precision of its actors, or you can just ask yourself if you enjoyed it. Well, I'm going with the latter this time, and I enjoyed the hell out of Salt.Without giving away too much, I can tell you that the film is a spy thriller with lots of double crossing. In fact, the story is quite outlandish and barely even believable (okay, I lied, it's really not believable at all). But it's FUN. It keeps you guessing and rooting for the bad guy, or good girl, or whatever you want to classify Jolie's character as. She plays a spy who is suddenly outed as an undercover Russian agent when a very wanted Russian bad guy claims that she will soon kill the Russian President during his upcoming trip to America. That makes sense, right? Don't worry about it. Trust me. It will. And even if it doesn't, you won't care because it will be too loud and there will be too many explosions for you to remember what was supposed to happen anyway.Salt is a thrill-ride. It's pure crazy fun and Jolie does a decent job of trying to keep it together. But with three versions offering three separate endings on the DVD, this is one you can watch over and over and still get a kick out of every time. You might need to suspend reality just a tad when viewing it, and have something to wipe away the drool, but it will be worth it."
    },
    {
      "rating": "8",
      "text": "Those complaining about the holes in the \"plot\" just don't get it. Hey, guys, it's a fast-moving, totally entertaining action spoof. Enjoy it on that level and/or for the awe-inspiring feats performed by Jolie and (especially) her stunt double. It's entertainment, not a documentary!"
    },
    {
      "rating": "6",
      "text": "Jolie is oustanding and the action is passable, but overall, Salt is an amplified action thriller trying so hard to be something more profound that it does end up being trying indeed."
    },
    {
      "rating": "5",
      "text": "Wildly improbable plot, wildly improbable action sequences, wildly improbable wigs on Angelina Jolie. Still, kind of enjoyable. Jolie puts a lot into these action roles and her face, as always, is mesmerizing."
    },
    {
      "rating": "4",
      "text": "This movie has alot of action  but it wasn't as good as i expected. I thought that this was going be one of her best movie, well i was wrong. This movie isnt that good. It has a lot of action but it wasnt action that caught my attention and I knew what was going happen since the beginning. The screenplay was okay. They could have did a better job on it. I love Jolie but this movie wasnt near one of her best."
    },
    {
      "rating": "7",
      "text": "The more we run, the more they chase. It is what happenned to Evelyn Salt. Since Mat Damon BOURNE IDENTITY (2002) which is using more advance believability approach in runaway espionage tale, now everybody wants to be Bourne by running, jumping, shooting, fighting, car-chase, motorcycle-chase, you-name-it and it all happenned in one action-packed. Couple examples which using the similar patterns are: John Travolta FROM PARIS WITH LOVE (2009), Tom Cruise KNIGHT AND DAY (2010), Ashton Kutcher KILLERS (2010) and now it is Jolie turn. The story follows Evelyn Salt (Jolie) who has been instant-accused as a Russian spy who may be able to jeopardizing the national security. The Director is Phillip Noyce, the man behind THE BONE COLLECTOR in 1999 (also with Jolie). The camera angle is dynamic, especially in action sequences. Yes, the movie is full of twists and turns, even sometimes the story just go by itself without proper explanations, leaving too many questions and missing links. That is the uniqueness of the plots! The story is intriguing. It is successful to make us stay put in our seat by expecting what is going to happen next. To let Jolie fuses into action adventure like thiz is like releasing the fish into water, it is what she does best. Jolie is still the focus, shines among her mysterious partner (Liev Schreiber) and plain-straight boss (Chiwetel Eijiofor). If someone complains about how absurd thiz narratives has become, it is simply arguable and it all happens to every modern action movies. One thing for sure, Jolie is back with some kiss-ass moves, to show us she is definitely one of the most comfortable action heroines in our time. Thiz SALT is happened to be sweet more than you think it is.\r Visit My Blog on JONNY'S MOVEE on : http://jonnyfendi.blogspot.com"
    },
    {
      "rating": "4",
      "text": "There was a lot of action, as well as twist and turns. Angelina Jolie is a tough ass, as usual, but while salt was definitely entertaining to watch, the storyline was a dry, done, and out-dated. I mean Russian spies in 2010?!? Come on... It left a lot to be desired."
    },
    {
      "rating": "0",
      "text": "Mindless generic movie that got more and more annoying with each scene. The plot, characters, acting, stunts and fight scenes were ludicrously stupid and unlikable. Angelina Jolie beats & kills American & Russian agents/police like a T-X character. Nothing in the story is believable or makes sense and Earth to Hollywood, the Cold War ended years ago."
    },
    {
      "rating": "5",
      "text": "(Que deep, gritty, movie-trailer-guy voice) \"This summer ... Bourne has had a sex change ... and he's making the same movie like before ... but not so good\""
    },
    {
      "rating": "5",
      "text": "Don't give me wrong, this movie had a lot of action. But it was a little bit confusing and kinda ridiculous.  For a minute, she's a Russian, then she's the good guy and all the way around. It's that kind of movie that you don't want to see again. The only fun part of the film were the actions scenes. The rest was non-sense crap."
    },
    {
      "rating": "9",
      "text": "With all due respect to James Bond, Evelyn Salt(Angelina Jolie) does it better, at least since, incidentally, Lewis Gilbert's \"The Spy Who Loved Me\", made in 1977, when the Cold War was still cold; when the Russians, by far, made the best villains. For those who can remember, \"Salt\" makes you nostalgic for the days when the ABC telefilm \"The Day After\" scared you silly. The \"evil empire\"(Ronald Reagan's words) was good for the action-thriller genre. Islamic fundamentalism? Not so much. The Arabic language, and more importantly, the Arabic accent, have little or no entertainment value, no camp kick(i.e. Nazi Germany), at all. That's why Jonathan Demme's retooling of John Frankenheimer's \"The Manchurian Candidate\" will never work on the level of escapism, even if the United States someday makes peace with the Muslim world. Russians are more fun: that's the masterstroke of \"Salt\". The Russians still have active sleeper agents; the Russians still hate our guts(who knew?), a whopping nineteen years after the Soviet Union dissolved following the signing of the Belavezha Accords. For clarity's sake, the expository scenes that show the Russian children's training could have been more explicit in naming names. \"Salt\" never makes mention of that magic acronym(the U.S.S.R.), even though Orlov(Daniel Olbrychski) is a communist hardliner who still pledges allegiance to the hammer and sickle. The old school commie, a colleague of Brezhnev, is no doubt bitter about losing the Cold War, so \"Salt\" should have followed through with its bizarre retro choice in antagonists and made \"Day X\" less convoluted day of reckoning against the United States by being more pointed in their motivation. This splinter group, who as children resented Mikahl Gorbachev's employment of Glasnost to draw back the Iron Curtain, hates Americans every bit as much as the Muslims. That's the note that the filmmaker should have expounded on. Lest we forget, as an afterthought, \"Salt\" makes room for our current enemy when the final stage of \"Day X\" is revealed; that's when \"Salt\" becomes certifiably loony. But then, Jolie, in a scene reminiscent of Jack Ruby gunning down Lee Harvey Oswald in cold blood on live TV, reins in the overplotting with the sheer force of her presence, proving that it's she, and not Bond, or Bourne, who is the best. (Apologies to Carly Simon.) \"Salt\" is an inspired popcorn flick."
    },
    {
      "rating": "3",
      "text": "The entire movie builds up to the final twist ending that offers very little payoff. The movie is simply not enjoyable. It started out promising, and had the potential to be so much more, but really falls short. It has a few decent scenes, but it's definitely not worth your time."
    },
    {
      "rating": "4",
      "text": "This is my first review for metacritic, so I'm sorry it's negative. This movie made me feel old.. In the first 40 minutes I wondered what the point of all this running about shouting was. It all just seemed a bit silly and pointless. In fact, frighteningly it reminded me of a Bruckheimer film where running about, shouting, leaping onto and off things with lots of explosions and impossibly gorgeous women are stock in trade. Although I have never been a Jolie fan particularly, I kind of thought she was respected as a serious actress. Here, she looks like Megan Fox's auntie. This movie may have salt but I guess I was looking for a little balsamic dressing."
    },
    {
      "rating": "7",
      "text": "A very solid summer action flick. Jolie is perfectly cast in this movie."
    },
    {
      "rating": "0",
      "text": "Movie sucks. Its a Bourne rip off. Angelina was good at action scenes, but the Movie ridiculous and the plot is unbelievable."
    },
    {
      "rating": "3",
      "text": "This Movie looks unrealistic in many places, Jolie is awful and the script is bad nothing new though it has some fun in some places, overall it is pathetic,"
    },
    {
      "rating": "9",
      "text": "Angelina is in her element and a tour de force. Thoroughly enjoyed this flick -- impossible plot and all. They tee'd it up and I can't wait for Salt 2."
    },
    {
      "rating": "5",
      "text": "Totally unbelievable... come on. Utterly predictable... people that say this is \"unpredictable\" and what not are completely out of their minds, or not paying attention!"
    },
    {
      "rating": "0",
      "text": "I've not HATED a movie soo much in a long... Strike that... EVER! My intelligence was under as'salt from the first to last frame. I will admit that my inability to supend disbelief when my b.s. meter is pegged is my hang up but,  I was insulted for having seen it. What a steaming pile."
    },
    {
      "rating": "0",
      "text": "One of the worst action movies I have ever seen. It was like watching very cheap old Hong Kong made fight \"masterpieces\". I was laughing at myself at the end that i waisted my time and money for this. No Plot no engaging acting not even little humor absolute rubbish from start till finish. The only puzzling is such a high score in both Critics and Users reviews. For those how actually understand the art of movie making DO NOT BOTHER. Have a good lunch instead."
    },
    {
      "rating": "1",
      "text": "One of the worst movies I've seen in years. The film doesn't take itself seriously, and doesn't expect the audience to - unfortunately it is so absurd, poorly written, and poorly executed that I feel insulted this made it the screen. Save yourself the money, don't see this. The underlying plot felt as though it had potential, but the end product is a rushed mess of a film. One of the worst displays of direction of any action film in the past 10 years."
    },
    {
      "rating": "10",
      "text": "I don't understand the low ratings some movies get because for my money this was the best of it's kind this year. I'm not a Jolie fan, like anything with DiCaprio and a couple of others their name makes me think twice before going to see any movie they're in. But she did a great job here with a story that could have been far worse than any 24 script. The sleeper premise is far-fetched but if you can get past that it's a very entertaining film with more going for it than stunts and action. But since it's a summer movie there is plenty of both. I guess we need a break from reality and a trip back to the bad old Cold War days was almost a relief. I saw lots of happy faces leaving the theater after this one."
    },
    {
      "rating": "10",
      "text": "Non stop action from beginning to end. Never boring, go see it. Can't wait for the sequel, Angelina Jolie is a damn good actress."
    },
    {
      "rating": "9",
      "text": "it is like bourne on crack! was definitely worth the money."
    },
    {
      "rating": "10",
      "text": "Go see it. You won't regret it. Action from start to finish."
    },
    {
      "rating": "10",
      "text": "Angelina is a goddess. Undisputed queen of action. Salt is an absolute adrenaline rush."
    },
    {
      "rating": "10",
      "text": "This is what a Summer Action movie is all about. Loved It !! Angelina ROCKS !!"
    },
    {
      "rating": "10",
      "text": "Exciting, gripping and LOTS of fun."
    },
    {
      "rating": "7",
      "text": "Silly movie, but never boring. jolie is irresistible ... those lips, those eyes, that voice. this woman has serious skills. can't wait for the sequel!"
    },
    {
      "rating": "7",
      "text": "Lots of holes....but a fun ride....Jolie is bad ass."
    },
    {
      "rating": "1",
      "text": "Another stupid action movie that is not believable in the least! At least with Bourne Movies you can somewhat say, yeah, that can happen. This, it is absurd!!"
    },
    {
      "rating": "1",
      "text": "One of the stupidest movies I've seen in quite a while. Unbelievable that Ms. Salt jumps from truck to truck, gets beat up, fights and kills so many people with nary a scratch on her. But the Brangeloonies will come."
    },
    {
      "rating": "3",
      "text": "The worst movie I've seen in a long time. The script isn't well thought out it's extremely sporadic at the end you just dont even end up caring. This movie is poorly executed how can somebody take that much of a beating without a scratch? me and my friend were the only people in the movie theater to see this and we both can agree it was a major waste of time and money."
    },
    {
      "rating": "0",
      "text": "This is the most ridiculous movie of all times, is the worst action movie that I've seen. Simply it is so absurd, so meaningless, so stupid. I wasted my time and my money"
    },
    {
      "rating": "9",
      "text": "Non-stop action, good twists, and Angelina Jolie. What more could you want. The action was great, plot was average/above average, and their can be potential sequels. If the director just touches up on a few things, this could be the next BOURNE series. Except this won't bore you to death, and you can see Angelina kicking bad guy ass."
    },
    {
      "rating": "9",
      "text": "Very entertaining ! Jolie is top notch."
    },
    {
      "rating": "8",
      "text": "Angelina Jolie is Salt."
    },
    {
      "rating": "1",
      "text": "Below Average Action thriller, this movie offer nothing than the cheap thrills and leaves a salt in your mouth"
    },
    {
      "rating": "10",
      "text": "I and my girlfriend we loved Salt.Angelina is best actress ,i will see again."
    },
    {
      "rating": "10",
      "text": "A great movie! Yep, it is very over the top with an outrageous story line, but with the plot twists and the action it was a outrageously great time. For my money Angelina is the best action star today, male or female."
    },
    {
      "rating": "8",
      "text": "Very good action movie. Jolie is terrific. Sort of like Bourne except that it's a good film and Jolie makes Damon look like a ... girlie man."
    },
    {
      "rating": "9",
      "text": "LOVED IT!!! Silly script, great direction, pacing and score. Angelina was FANTASTIC!! Heart breathtakingly tender and killer cold."
    },
    {
      "rating": "5",
      "text": "This movie was pretty terrible because of the poor directing, emotionless script and lack of logic. There's too many quick camera cuts to make the movie feel somewhat believable but it fails. The Batman and Bourne movies made more sense because they were well directed. This movie just made me go WTF a bunch of times then I left the movie feeling really disappointed. Seriously, the this is direct to DVD quality action stuff and don't see this movie. Only people with no taste will enjoy this."
    },
    {
      "rating": "1",
      "text": "One of the stupidest movies I've recently seen. Completely and totally implausible and how did the frail Salt jump from truck to truck yadda yadda without barely a scratch? Idiotic. Thank God Inception ruled again at the BO."
    },
    {
      "rating": "3",
      "text": "Flat out bad. The stunts were poorly performed , the story was cheesy and clichéd (not to mention stupid), the acting was mediocre, and ultimately a below average action movie."
    },
    {
      "rating": "10",
      "text": "Salt allowed me to suspend my critical mind, an incredible feat since I grew up in Studio City and am a writer myself. Angelina is so damn GOOD that none of it matters, though. Her acting is great between actions scenes that she dives into with aplomb and a vitality that makes your jaw drop knowing she did all the stunts and fights herself. It doesn't hurt one bit that she's also one of the most perfect genetic productions of human evolution (beautiful!) ever to walk the planet. Angie has a look on her face in fights that's both spooky and genuine, and her moves would make both a black belt and a mother mountain lion proud. Loved it!"
    },
    {
      "rating": "7",
      "text": "It was a high-octane action film that was throughly entertaining. The plot was absurd at times, but the cast makes it intruiging enough for you to invest on all the B.S. happenning, especially Angelina Jolie. She is great as always, and she really owns the character of Evelyn Salt. A 7.5/10."
    },
    {
      "rating": "7",
      "text": "Let me just start off by saying that the trailers for Salt do it absolutely no justice and make it look like the most generic of forgotten identity action movies. Salt  is much more than that. Due to seeing that trailer around 50 times, my expectations were deflated but truthfully those expectations were never very high. I sat and watched as every minute my negative thoughts for this movie before I saw it were washed away and I became immersed in the action. If you are like me and were close to writing it off as garbage, think again.Salt stars Angelina Jolie as Evelyn Salt, a â"
    }
  ],
  "recommendations": [
    "furious_7",
    "transporter_3",
    "xxx_return_of_xander_cage",
    "mission_impossible_iii",
    "mechanic_resurrection",
    "lockout",
    "wanted",
    "the_marine",
    "london_has_fallen",
    "the_ice_road",
    "transporter_2",
    "the_mechanic",
    "the_fate_of_the_furious",
    "the_expendables",
    "angel_has_fallen",
    "sabotage",
    "escape_plan",
    "the_expendables_3",
    "infinite",
    "the_transporter_refueled",
    "crank",
    "the_expendables_2",
    "6_underground",
    "battleship",
    "war"
  ]
}