{
  "id": 1825,
  "title": "Samson",
  "starring": [
    "Taylor James",
    "Jackson Rathbone"
  ],
  "runtime": 110,
  "genre": [
    "Action",
    "Drama",
    "Adventure"
  ],
  "description": "After losing the love of his life to a cruel Philistine prince, a young Hebrew with Supernatural strength defends his people, sacrificing everything to avenge his love, his people, and his God.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/v7Zaj1IEzMMB7KzfglpxdXWB66u.jpg",
  "categories": {
    "plot": 6.181818181818182,
    "acting": 5.333333333333333,
    "ending": 6.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "This film is an absolute travesty. As if Pureflix couldn't get worse than their terrible God's Not Dead movies, they've somehow lowered the bar even further with Samson. This is just a bland and uninspired look at what could potentially be a powerful story."
    },
    {
      "rating": "0",
      "text": "This movie was so bad it’s not even funny. The acting is terrible and the entire movie is just bland."
    },
    {
      "rating": "10",
      "text": "Never thought I'd be one of those guys saying \"the critics are being unfair,\" but boy do I disagree with the hate. Samson is a great film to laugh at, with a nice mixture of cheesy goodness and over-the-top fight scenes. This is the best Christian B-movie to come out thus far, and I really hope they make one of David next!tl;dr - It was better than Black Panther."
    },
    {
      "rating": "9",
      "text": "best bible movie ever lol, it was like a super hero movie but based on christianityvery enjoyable, glad i ignored the negative reviews"
    },
    {
      "rating": "6",
      "text": "The first ever biblical B-movie. Even by Pure Flix standards this was cheaply made. The costumes look like they were picked up from a Halloween store, the beards are ridiculous, and the acting never rises above amateur level. The directorial work is strong however and the whole thing calls to mind fantasy-adventure films from the '80s. You can see the inspiration from the likes of Conan the Barbarian, Hercules, and Clash of the Titans. It also isn't afraid to deliver some of that Old Testament violence.The action scenes are quite entertaining. The movie is at it's best when it's focused on displaying Samson's feats of strength. It is in those moments that it almost becomes the Christian epic it's striving so hard to be. Things a noticeable turn for the worse when the romance and drama take center stage. The performances are simply too weak and the writing to cheesy to really hold one's attention for too long. Things like watching Samson ogle village girls and the dialog are quite silly. Unfortunately it's this kind of stuff that makes up the majority of the movie.Watching the growth take place in the title character's life was actually something they did very well. It definitely made it feel like he went through a real adventure. Just one that wasn't always interesting to watch. The low production values, over-dramatic performances, and all around cheesiness aren't going to win it many supporters outside of the religious target audience. It was nice to see a faith-based take inspiration from the fantasy epics of the past. It's a shame the overall final product wasn't more respectable. Samson has some entertaining qualities, but it won't exactly convert any non-believers. At the end of the day though I don't see anything wrong with preaching to the choir."
    },
    {
      "rating": "8",
      "text": "I think it was good. I don't care this film slammed, it captured the Samson's story very well. I don't get why everybody hates it. No movie can pleased everybody, but it pleased me fine."
    },
    {
      "rating": "6",
      "text": "As I have already had the opportunity to say, the Bible is an excellent source of good stories, regardless of our faith or religious beliefs. Cinema has always enjoyed biblical stories and this has already resulted in a series of films so good that they have become part of our collective cultural memory. However, a few years ago the fashion for remaking many of these films emerged. This is another remake and, to be honest, the biggest difference between both films is how they approach the story told and the names of some characters.The story told does not need great presentations, even those who have never read the Bible have heard of it: a thousand years before the birth of Jesus, Jews were enslaved by the Philistines and their last great hope of liberation lay in the herculean strength of Samson, the which he was appointed at birth as leader of the Jewish people. But Samson seems reluctant to accept his fate and is delighted by Taren, a Philistine. The marriage is disrupted by Rallah, the ruthless and cruel heir to the Philistine throne, Samson's fierce enemy, who will pursue his entire family and use his lover, Delilah, to seduce and to steal him of his strength.If the 1949 \"Samson and Delilah\" addresses the classic biblical story from the point of view of a tragic novel, where the crossed loves between the characters are central to the plot, this film focuses much more on the action. The loving relationships are just another reason for the two antagonists - Samson and Rallah - to hate each other more and more. If this resource seemed smart on the one hand, making the two films different, distinct approaches to the same story, on the other hand it made the character Delilah much more secondary than we are used to. It is a more masculine film and the central characters of the plot are masculine (Samson, Rallah, King Balek). Delilah is virtually thrown to the periphery of the cast until the last half hour of length and never has the development she should have. Another thing much more visible in this film is the cultural and religious difference between Jews and Philistines, and the way in which religious issue made them incompatible.The film's cast is led by Taylor James, who appears to have been selected based on the size of his biceps and not his ability to embody the character. During the action scenes he is truly monstrous and looks like an iron colossus. In the rest he never goes beyond the average and sometimes it sounds artificial and cliché. Jackson Rathbone succeeded in the task of looking sufficiently psychopathic and crazy, but that was the only thing he did correctly. Frances Sholto-Douglas was fine, but at times she seems to behave and speak in an too anachronistic way, like a teenager of our time. Caitlin Leahy was very unlucky with the material received and gave us an incoherent and cliché Delilah. Better were Rutger Hauer and Billy Zane, but their characters did not have enough weight and time for the actors to show much more.From a technical point of view, it is an equally forgettable film. In fact, I don't even know if it was designed for the big screen... I don't think so. Everything in this film breathes television and I feel that it would be much worse than it is if it were shown in a theater. Or maybe this is due to the limited budget available for production... I don't know. The film has considerable doses of average CGI, which never looks real but works well enough to do what it has to do. Cinematography is regular and does not deviate from industry standards. The sets and costumes are quite interesting, and I felt that there was a genuine effort to give the film a more realistic look, stripped of epic artifice. It is to be commended and it worked, albeit with some flaws. The soundtrack works, but it seems clearly made for a TV movie and not for the cinema. The best in the entire film are the action scenes (especially the battle in which Samson uses a bone as a weapon) and the final scenes, in the pagan temple."
    }
  ],
  "recommendations": [
    "blade_of_the_47_ronin",
    "ben_hur",
    "the_darkest_minds",
    "cloud_atlas",
    "risen",
    "v_for_vendetta",
    "victor_frankenstein",
    "the_monuments_men",
    "the_13th_warrior",
    "equilibrium",
    "blood_diamond",
    "black_panther_wakanda_forever",
    "the_nutcracker_and_the_four_realms",
    "what_happened_to_monday",
    "mortal_engines",
    "chappie",
    "alexander",
    "beowulf",
    "dredd",
    "chaos_walking",
    "eternals",
    "alice_through_the_looking_glass",
    "valerian_and_the_city_of_a_thousand_planets",
    "perfume_the_story_of_a_murderer",
    "the_last_airbender"
  ]
}