{"id": 352, "title": "San Andreas", "starring": ["Dwayne Johnson", "Alexandra Daddario"], "runtime": 114, "genre": ["Action", "Drama", "Thriller"], "description": "In the aftermath of a massive earthquake in California, a rescue-chopper pilot makes a dangerous journey across the state in order to rescue his estranged daughter.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/2Gfjn962aaFSD6eST6QU3oLDZTo.jpg", "categories": {"plot": 5.290909090909091, "acting": 5.155555555555556, "ending": 4.333333333333333, "soundtrack": 6.0, "cinematography": 4.75, "familyFriendly": 5.833333333333333, "funny": 3.5, "action": 5.964285714285714}, "reviews": [{"rating": "7", "text": "Almost a remake of 1974's 'Earthquake' with references to both 'The Towering Inferno' and 'The Poseidon Adventure' thrown in for good measure. Although this is not as good as any of those classic 70's disaster movies this one still has plenty of excitement and amazingly good special effects, model work and Art-Direction. The story is perfunctory and the occasional risible line of dialogue raises a good natured smile, but the film entertains hugely and the destruction of San Francisco really is a visual spectacle."}, {"rating": "8", "text": "A good action disaster movie starring the Rock; who was great in the film.  The movie also starred Alexandria Daddario (of True Detective fame) as the daughter of the Rock character, and she was also great in the movie.  If you want to have a good time seeing an action movie, this is one to see.  The movie also showcased some San Francisco landmarks, an area we were going to visit the following week."}, {"rating": "7", "text": "It's big and it rarely takes a moment of pause - San Andreas is a massive disaster movie that has been done several times before, but it doesn't displace the awe that comes with destruction on such incredible scale.  You won't find any Oscar performances here, just a roller coaster ride that carries enough twists and turns, ups and downs, to satisfy the thrill seeker in its intended audiences.  The best part, from a science standpoint, is that these aren't just mindless earthquakes but sequential seismic events that are all a part of the fault-line that so many people in the Western United States are watching closely for the biggest disaster moment of the last century.  Whether or not it will be quite THIS bad is anyone's guess, but San Andreas does a lot to walk through some of the scenarios that people might fact should something this horrific ever strike near home.  Anyone walking into this should know what to expect and, if you do, you shouldn't be disappointed."}, {"rating": "4", "text": "I'll take a wild guess and say the writers spent no more than a day on the script because the best way to describe anything but the action sequences is pathetic. Its borderline embarrassing in parts and silly. The movie works better when the camera shows the larger picture instead of the personal view of lousy characters. Oh did I mention its the biggest cliche movie of all time? ."}, {"rating": "4", "text": "Typical disaster movie. Can be entertaining. Don´t look for anything else. Oh and after Mad Max Fury Road this year, all these CGI overload which gets bigger and bigger with the years seems just so unimpressive (if used right it is great, but lately it is being too much and the only thing going on in so many of these blockbusters, for example in most of the comic book movies, which have literally nothing else going on for them)."}, {"rating": "7", "text": "As a disaster movie, San Andreas works better than some of its recent, big-budget predecessors. That's not to say that it's a great film or anything close to it. The plot is bog standard for the genre, and some of the dialogue is so predictable that you're likely to get there before the actors at least half the time.\r But it looks terrific. If disaster porn isn't your thing, you'll probably be bored, but then why on earth are you watching a Dwayne Johnson film named after a fault line in the first place? Mr. Johnson is, by the way, as fun and charismatic as ever."}, {"rating": "6", "text": "The film begins with a scene of a careless driver who seems to have no regard for her safety and well being, or that of others. If you were in the mood to search for deeper meanings in a supposedly dumb action flick this is almost a subtle introduction to the story. The film's disaster earthquake that wrecks everything could be taken as symbolic for Ray and Emma's divorce and the damage that the separation of families does to children.\r That said, this is about as deep as the story goes. As is typical of action movies the action takes the front seat instead of the plot and in San Andreas it is just exciting enough to make you ignore the plot weaknesses. If anything San Andreas could have done with less unnecessary back story and cringe worthy dialogue.\r Particularly the worst part would have to be the Malory Talk where it gets all dramatic as Ray is talking with Emma about their dead daughter. It is just so out of tone with the rest of the film. And of course I did not think for one second that Blake was actually going to die.\r Overall San Andreas is an enjoyable action flick that is fun to watch but nothing too special that you would have to rush to the cinema to see it."}, {"rating": "3", "text": "\"San Andreas\" 10 Scale Rating: 3.0 (Bad) ...\r The Good: As expected from the trailers, the effects were well done. The scale of the destruction was amazing to see and capture the imagination. As with most disaster films, it was entertaining to see landmarks destroyed in creative ways.\r The Bad: I don't expect award winning performances from big budget disaster films, but I do expect performances that are at least somewhat decent. I didn't get that here. Dwayne Johnson's undeniable charisma usually makes up for a bad film, but he was wooden and stiff here. His character was poorly written and everything about him was cliche. The rest of the cast was even worse. They tried to cram in personalities and back stories for everyone, but they felt like an afterthought and I didn't care about a single character in the film. Lastly, the film was full of comedic moments that were not meant to be comedic. In fact, every escape and \"near miss\" action moment caused me to laugh out loud at the absurdity of it all. Epic destruction is all around, yet our leads consistently overcome impossible odds and survive unscathed. You expect and accept this from a film like this to some extent, but they took it way too far and included far too many of these laughable moments."}, {"rating": "7", "text": "This is a fun disaster movie, with all the thrills and frills!  If your expecting academy award performances, then this isn't the movie for you.  If your expecting over the top actions, good special effects, with an average storyline-that is atypical of movies like this then go ahead watch and enjoy.  All in all it was what I expected, but still enjoyable, I will say some of the special effects and super human type efforts were just a tad bit over the top"}, {"rating": "3", "text": "I think i am the only one who sees a pattern. If a movie gets a whole lot of attention of TV then it will turn out to be a bad movie. Unlike Mad Max Fury Road. It did not get sponsored on TV till the last week of its release. Entourage got so much attention , it turned out to be a bad movie. I saw a critic say that San Andreas is \" non stop action\" Hmmm kinda like Mad Max Fury Road. Dont see movie till you read the reviews."}, {"rating": "5", "text": "San andreas has some cool special effects but the characters are poorly written, most of the performances were stale and awful, the one liners were cheesy as hell and every single 90s disaster film cliché makes an appearance in san andreas.\rOverall: Stupid movie with some cool special effects"}, {"rating": "9", "text": "If you're the type that enjoys an epic disaster flick once in a while you will like this one. Some of the best effects ever and the acting was better than some are saying. Alexandra and Carla were very easy on the eyes. DJ was cool, and Paul Giamatti is one of my favorites (Sideways). Don't believe the red flag whiners, this movie was solid  and everything it was supposed to be. I'm giving a 9 to make up for the haters."}, {"rating": "7", "text": "San Andreas is big, loud, cheesy, and filled with clichés but boy Is it a fun movie.  The film revolves around veteran Ray Gaines played by Dwayne “The Rock” Johnson (The Scorpion King, The Fast and the Furious) who after years of serving in Afghanistan returns and works as a helicopter pilot for the Los Angeles Fire Department.  As the movie continues we learn that Ray Gaines is taking some time off from work in order to take his daughter Blake played by Alexandra Daddario (Percy Jackson, Texas Chainsaw Massacre 3D) to her first week of college. However, Ray’s plans get interrupted by the destruction of the Hoover Dam, forcing him and his Rescue Team to go to work.  Upon his arrival, he finds that various earthquakes are starting to happen all over the San Andreas Fault that is affecting the entire state of California. As the earthquakes continue to occur, Ray’s ex-wife played by actress Carla Gugino (Watchmen, Night in the Museum, Sin City) and his daughter Blake become endangered, therefore he must come to their rescue. Along with these characters, we also have Lawrence a seismologist, played by Paul Giamatti (Sideways, 12 Years A Slave) who plays a key role in the film. Lawrence’s main goal is to inform the citizens of California to evacuate and find shelter during this disaster.\r As a film, San Andreas is not a masterpiece by any means, but I can assure you that it is an absolute blast to watch on a big screen. The effects team behind this movie did an excellent job bringing the disaster onto the big screen. A lot of the destruction scenes looked sharp, especially the Tsunami scene that “The Rock” Johnson goes against in his boat.\r As for the performances in the film, they were not as bad as I expected.  Dwayne Johnson steals the show like always thanks to his charismatic attitude and presence on screen.  And let’s be honest, if he was not in San Andreas, the movie would be a complete disaster. So props to Mr. Johnson for that. As for the rest of the cast, no one really stood out to me. One of the major problems seen consistently throughout the film was the horrible script written by Carlton Cuse (Lost, Bates Motel) and Andre Fabrizio (Vice, The Prince). Thankfully there were times that the horrible screenplay was forgotten, due to Dwayne’s charm.\r Overall, San Andreas has proven to be time well spent at the movies. To truly enjoy this one, you simply have to make sure to turn off your brain, let go, and enjoy this disastrous wild ride.\r Final Score: 7/10"}, {"rating": "9", "text": "It was a solid experience, a couple hitches in the plot and the actions done by Johnson. I would have to say it did keep me interesting, despite the crap load of cliches it had."}, {"rating": "8", "text": "I can't believe this movie received such bad reviews! I thought it was great! It had action, it made me laugh a little, & above all else it made me cry and I mean like ball out crying. Carla Gugino who played the mom was so believable when she thought she lost another child she literally broke my heart. Not to mention it makes you think how you shouldn't take anyone or anything for granted bc you never know what can happen."}, {"rating": "1", "text": "The movie was so bad and I mean it. The only good thing was about special effects, so I suggest to cut down all the other scenes and then the movie would last for 30 minutes and then you could go home. I am glad I have watched the movie with my unlimited cinema card, so I did not have to pay anything extra. Bland stupid plot, unrealistic to the extreme, horrible acting, very predictable, lack of any depth."}, {"rating": "8", "text": "I really like this Movie,amazing special effects,But this Movie is just about to The Rock and is Daughter and the\rDisaster,but i pay 4 Euro in Cinema city"}, {"rating": "6", "text": "San Andreas is good with the special effects. But the plot is overstuffed and the characters is just not that thrilling. But Dwayne Johnson has a great performance in the movie."}, {"rating": "0", "text": "Such such SUCH a stupid movie!!!\r The effects are maybe the only good things in this movie! The story is soooooo lame!\r Why i have to write 150 characters when i can sum it up in a few words?!"}, {"rating": "9", "text": "Saw \"San Andreas\" in 3D last night.  Wow, what a film!  The Rock actually gave a good performance, and Alexandria Daddario is a hottie whom I will keep track of in future movies.  Paul Giammatti and the science of the movie's script were both credible and spot-on.  The visual effects will likely be nominated for an Oscar in 2016.  As for the 3D, it is totally immersive...I felt like I was there in the cities during a real earthquake at times.  Compared to the Roland Emmerich film, \"2012\", \"San Andreas\" effects were different but equal to \"2012\".  As an earthquake disaster film, \"San Andreas\" shoots to the top as one of the best.  Being a published disaster film novelist, I was completely entertained.  Sure, I will admit that some lines of dialogue were corny and logic and credibility were tested at times, yet director Brad Peyton was not trying to present a James Cameron \"Titanic\"-type masterpiece.  His goal of generating realism, eye-popping visuals, and an overall good time at the movies was met.  Was worth the wait!"}, {"rating": "1", "text": "If you like pretty good special effects and scenes of major landmarks being decimated in the same cheesy vein as Independence Day, then you may very well enjoy San Andreas. If you enjoy things that most movies are required to have (like story, believable characters, and plot points that make sense) you most likely will not. There is nothing even remotely original or interesting about this movie and if you've ever seen any disaster movie before then you already know how the \"family dynamic\" story played out. Emphasis on \"played out\".\r There is a certain amount of cheese and silliness that I am willing to take in my action movies but the sheer amount of contempt and disdain that San Andreas shows for its audience overshadows anything that could have otherwise been enjoyable. The dialogue is perfunctory at best and the plot points are so completely ludicrous that you feel kind of like an idiot just suspending your disbelief to go along for the ride. This movie is designed for those who don't want to think while watching their movies. If you are quite content not using your brain whatsoever, then by all means go check out San Andreas. However, if you find cookie-cutter characters who always make exactly the right decisions based on no information and sheer luck then you'll probably find this movie as insufferable as I did. And I'm a Rock fan! But not even that can make me okay with this stupid, horrible, insulting excuse for a movie. All of the positive reviews for this movie (which I'm shocked by, frankly) seem to have been written by teenagers who have never seen special effects before. Because they're actually NOT THAT GREAT! I mean, if you want to watch The Rock boating through what could be a very cool video game background, then you can see that here. And yeah, the earthquake stuff looks cool. But in the end, that's all it is. A bunch of shaking around with absolutely nothing of substance holding it up.\r Skip this one."}, {"rating": "8", "text": "Terrible joke: Now when I search \"san andreas\" on google, I don't get a bunch of GTA: San Andreas results!\r Actual Review: Has a lot of action in the movie. There is little to no plot throughout the whole movie, but it has a lot of destruction. Probably even more than a Michael Bay movie!"}, {"rating": "0", "text": "In the realm of stupid movies, there is but one King. San Andreas the First, and let's pray there's never a second one. The only good aspect of this movie are Alexandra Daddario's **** bouncing around."}, {"rating": "8", "text": "The movie itself is fantastic, but not necessarily Oscar-worthy. It contains quite a few cliches here and there, but for the most part, if you're wanting to pass 2 hours by, this movie is for you. It's loud and intense. For the people that say this movie isn't realistic, they're basically saying that a huge mega-quake (like the one that happened near Japan in 2011) apparently won't happen.\r Don't rely on my opinion though. You have your own. Just don't tell us that like the movie to neuter ourselves because we simply liked it."}, {"rating": "8", "text": "I'm not going to sit here and tell you that San Andreas is the best movie I ever watched but it was certainly entertaining. The film has a great cast headlined by the Rock and  he just does his things which is going to be enough to drag people to the theater to see this. I know that the script is not the strongest but the visuals are great, I wouldn't recommend the 3D though, I thought that it didn't need to be in that format. Alexandra Daddario was good at playing a strong female character that needs to be present in more movies today. In the end I came out of the theater thinking that San Andreas was worth the money I paid the see it and I'm sure there will be many people will have fun with this movie."}, {"rating": "1", "text": "Yes, special effects can get really  boring no matter how realistic they look.  The acting is horrible....wow a big earthquake ... haven't we seen this movie 10 times before  ????  Just a boring 2 hour ride, you know what is going to happen and who cares how it ends.....there is no story here, and nobody wants to watch some washed up actress."}, {"rating": "9", "text": "I'm curious. How do you criticize a movie that delivers, or over delivers, exactly what is promised? Disaster movie folks. People are dying. People are being rescued. Stuff is blowing up. Tidal waves are rocking thru San Francisco. Building are crumbling. People are screaming. The CGI is the best ever. The Rock is driving a boat thru downtown SF. Understand?\r Its a blast. Its not Citizen Kane. Go see it."}, {"rating": "0", "text": "This movie was so bad that it was bad. Even people in the audience were laughing at it not with it and don't even get me started on that ending cause oh boyyyyyyyyyyyyyyyyyy......"}, {"rating": "7", "text": "Disaster films are expected to have the same type of story development but this replication of 2009's massive \"2012\" has a stronger and slightly more emotional family dynamic that helps a bit in the chemistry between the characters and their respective performances. The film in a much smaller scale of destroying part of the US with earthquakes and tsunami, finds its success that not only Emmerich is the only director who should monopolize the genre. The outstanding quality, eye-popping CGIs, stunning visual effects of disruption, good shots of cinematography of the disruption, thrilling challenges for survival and powerful scores by Andrew Lockington are on par with \"2012\"; even the theory discussed in the film might seems erroneous but not entirely foolish and ridiculous. While it repeats the same mistakes - lacking of awareness and precautions on natural disasters, the spirits and the energy of the people to help each others during hard times is one of the most inspiring element that keeps engaging with audiences which is not found in other disaster films."}, {"rating": "1", "text": "California, in the words of Steely Dan, tumbles into the sea and \"San Andreas\" somehow manages to make it boring. The inept script for \"San Andreas\" has less verbal fireworks than your average made for TV movie and possibly less than a tupperware party. In a nutshell, \"San Andreas'\" completely brain-dead script focuses on the \"original\" story of a steroid+collage infused couple -- who are \"nearly\" divorced --being swept together by massive catastrophe. That weary chestnut is complimented by a bevy of equally \"original\" characters like cowardly rich guys; moronic youngster who fall in love within 5 seconds, and knowing scientists who take hours to start shouting \"Take cover\": This movie has everything you want in an utterly cliched movie and more. One of the most laughably bad scripts I've had to sit though in a long time. And people around here poke fun at \"Interstellar?\" This is a reminder how we need to fall down on our knees and praise movies like \"Interstellar\" that at least try to say something smart. At least if the effects in \"San Andreas\" were worth waiting out the doldrums, it might have made sitting through the movie worthwhile, but they weren't even that good. Just average computer bits showering down all over the place.  And you know the pace: SPFX -- talk -- SPFX -- talk --- and talk -- and talk. And what talk. Who writes scripts like \"San Andreas\" -- some rich producer's wife while she's having her nails done, chatting on the phone and watching a Lifetime movie? Once can only sit and scoff at the jello for lines the actors are given to work with. Even the mass of muscle known as The Rock looked weak and helpless about making this dog work. Even worse, it manages to make the smartest actor in Hollywood, Paul Giamatti look like an eyeball rolling puffin -- whose magical computer model predicts the end of the West Coast but doesn't tell him to at least put a call into a disaster agency to share the news.  Word to director: When you're filming the apocalypse, next time try not to shoot the whole thing in medium closeup -- just ready for that leap to TV where it belongs. Poor TV."}, {"rating": "6", "text": "In the aftermath of a massive San Francisco earthquake, a rescue pilot makes a dangerous journey across the state in order to save his family.\r Dwayne Johnson is charming and manly as always, playing the pilot who saves his estranged wife Carla Gugino from a crumbling tower and together set out to find their daughter, delivering cheesy one liners along the way. Their daughter, played by Alexandra Daddario, is on a journey of survival as she befriends Hugo Johnstone-Burt and his younger brother. Meanwhile Paul Giamatti, along with Archie Punjabi's news team, try to understand the earthquake's movements and warn the city in order to save lives, with cliche dialogue that is now expected from these kind of films. San Andreas keeps a focus on these characters, with some time for Ioan Gruffudd and his strange sudden shift from likeable step-dad to a cowardly survivor who meets a timely death. Kylie Minogue makes a cameo... but to zero affect.\r The silly but exhilarating action sequences are worth the price of admission, especially the boat race over the tsunami and destruction of the Golden Gate Bridge. Overall It's nothing we haven't seen before from modern disaster films, with a family drama played out alongside stunning but repetitive special effect sequences."}, {"rating": "0", "text": "The worst movie I've seen so far for 2015. The special effects aren't so special. Actually they are pretty lame and boring. What a waste of time and money."}, {"rating": "1", "text": "This movie was terrible.  Granted I went to the theater high, and so I actually enjoyed it.  But the screenplay, directing, plot/story, and acting can be characterized by words such as lazy, formulaic, uninteresting, etc.  The group that produced this film was completely taking the piss out of the audience, the majority of whom they clearly expect to be on the wrong side of 100 IQ.  I too was laughing out loud in many parts because the dialogue was so ridiculous and apathetically delivered.  It's like the actors didn't take their delivery of dialogue too seriously to save themselves the embarrassment of looking like they're trying to make it work.  But hey, as long as we keep paying for movies like this, the studios will keep making them.  Shame on us, really."}, {"rating": "6", "text": "San Andreas does have flaws, but the bumpy ride through spectacular visual with rock solid lead proves to be an entertaining one. Using the same premise from many disaster movies such as 2012 and even Volcano from years before, San Andreas delivers a more superior spectacle. However, it also copies many cliché elements. Cheesy script to build up tension and assortments of convenient plot devices are scattered through the story. This is a movie designed to entertain with over-the-top visual, and with welcomed addition of Dwayne Johnson as the lead, it succeeds in doing so.\r In a streak of unfortunate geological events, California is in immediate danger of massive earthquakes. Ray (Dwayne Johnson) is a pilot of rescue helicopter who must journey across the quivering land to save his family. The calamity serendipitously offers a chance of reuniting the estranged father as he proves how far he's willing to go for his wife and daughter. This theme has been done so many times, Day After Tomorrow and 2012 comes to mind. Luckily, The Rock is a demanding on-screen presence, with charisma and superhero physique, he's a good cast as the savior type.\r The script offers back stories, while not all of them pan out, The Rock does his best to convey his character. Another perspective is presented by Paul Giamatti as Lawrence, a professor who investigates the incoming catastrophe. He's here to deliver partially scientific explanation to the audience. Ironically, his role is quite predictable with foreshadowing comments to get the momentum rolling.\r Visually, San Andreas is breathtaking. Expect tons of falling buildings witnessed in extraordinary viewpoints and multiple set pieces to awe the audience. There's one particularly amazing continuous shot that follows characters as they weave back and forth as everything collapses around them. It will not disappoint those who come for high octane explosive scenes.\r It does have several problems like predecessors of the genre. Some of the sequences are highly implausible, most notably with the characters having plot armor and impeccable timing. Dialogues are not always charming as only few moments of the human drama are thoroughly engaging. It then eventually sets up for resolution analogy or the inspirational survival gimmick. Audience should be familiar with this method of suspending disbelief.\r Although the plot can be faulty, San Andreas is still a visually delightful journey. Presentably fascinating for a popcorn flick."}, {"rating": "4", "text": "Another apocalyptic disaster summer film. It has to fit in there somewhere to skim off the rest of the blockbuster successes. San Andreas is like Donald Trump running as a presidential candidate to crash the party just to get attention and recognition, but not to be taking seriously. It makes 9/11 look like a ****"}, {"rating": "2", "text": "There are far worse premises for a blockbuster action film. But when you mix it with mostly shoddy special effects, god-awful dialogue and some very questionable acting... you have another disappointing Dwayne Johnson film."}, {"rating": "4", "text": "Honestly i don't know what to say about this movie because it's so wrong in many level.\r If you go to see this movie for just entertainment and CG you might be okay with it but for me this is probably the contender of the worst movie of this year (Taken 3 probably take win the title though)\r Every single thing is super cliché and super repetitive you can just see the ending and plot twisted from miles away and you won't even feel exciting about those plot twisted either.\r The plot is cliché , the characters is terrible , dialog is bad , some CG is good (like those tsunami scene in the trailer) but some are just terrible and looks fake and ultimately the movie make no sense in like every single way it's just dumb stupid movie that just doesn't try to be smart at all (and that's good in some way....)\r Overall for pure entertainment San Andreas probably just super barely pass the gate but in the quality it failed so hard you just don't want to watch it again even it's free."}, {"rating": "1", "text": "I love my wife and it's only because of that fact that I was willing to see any movie with Dwayne Johnson, who makes Keanu Reeves look like he's overacting by comparison.    There's a reason they call crap like \"San Andreas\" disaster movies, and it has nothing to do with earthquakes or tidal waves.\rHideously horrible acting and an even worse script guarantee this will be a stinker worthy of Mystery Science Theater.    Yes, the special effects were done pretty well, but computer animation does all the work nowadays, and how hard is it to screw up demolition?    If you want to see a city suffer, watch the most recent Godzilla movie.    That had the lighting and fear down pat, where this flick was about as moving as watching a leaf fall off a tree.    So that being said, here's what I'd rather do than EVER go to a Dwayne Johnson movie again:\r Be held without charges in a Libyan jail.\rLie in state.\rListen to an accountant's lecture at a convention.\rJump into a pool full of wet cat food.\rListen to nothing but Bob Dylan for 24 hours without a break.\r Get the idea?"}, {"rating": "8", "text": "Surprisingly good. The acting from The Rock was extremely surprising, with very good acting. The side characters such as the wife and kids were also excellent. Movie's plot was surprisingly good. There was plenty of good comedy. CGI was absolutely amazing, and profoundly surprising. If I were to describe this movie using only one word I would use surprising... 8/10, and I strongly believe it deserves it.\rP.S.: Alexandra Daddario is an absolute hottie, especially in this movie!"}, {"rating": "7", "text": "A worthwhile action movie with some great CGI, San Andreas does feel a little bit too similar to \"2012\", but is good nonetheless. The plot and the script is below usual standards, but the film makes up for it in special effects and explosions- isn't that why you came to see it in the first place?"}, {"rating": "0", "text": "Campy, stupid, boring and overlong, San Andreas is an absolute disaster for the Rock and others involved that would measure high on the Richter scale."}, {"rating": "8", "text": "Seriously guys stop comparing this film to 2012!! Disaster movies have been around for a long time and they are ALL pretty similar. The biggest difference with this film is that the rock is way more likable a lead then john Cussack.\r This film knows what it is trying to be and it does it well, the plot is simple but takes time to flesh out the characters and the rock carries the emotional side plots with his family very well.\r The action is well staged and looks great and the film manages to be thrilling the whole way through with a touch of heart and some simple character development.\r All in all this a good example of a big budget disaster movie with solid performances and a simple but engaging premise.\r And regarding 2012, that film had some good set pieces sure but it was strung together with lazy writing , annoying characters and a garbled confusing plot and terrible pacing.\r San Andreas is the simple entertaining disaster movie that 2012 should have been.\r If you ever liked disaster movies and just want to see a good example of one then watch this film. It isn't a cinematic master piece but it was never trying to be and it is a hell of a lot better then 2012 (I hate that film 3.5 out of ten)."}, {"rating": "6", "text": "San Andreas has all the disaster movies cliches. Such as a family trying to reunite during a crisis; that we even saw in Godzilla last year for instance.\rYou also have the Rock of course having to be there for his ex wife (Carla Gugino) and be the hero she and her daughter needs. While Gugino's new boyfriend of course is a coward. The Rock and Gugino some how finding time to discuss where their marriage went wrong is also pretty cliche.\rHowever the movie has great cgi and plenty of exciting gripping moments. While the Rock and Carla Gugino (Spy Kids) work well together and they should; this is like their 3rd movie together. I was into the movie throughout despite deja vu from many disaster films that have come before it."}, {"rating": "7", "text": "It's cheesy, predictable, incredibly cliché, and honestly pretty dumb, but San Andreas is a lot of fun to watch with solid performances, amazing visuals, and powerful sound design."}, {"rating": "6", "text": "San Andreas is today's vision of The Day After Tomorrow, Deep Impact and 2012 but a lot more fun.\r The story San Andreas is about a massive earthquake rocks California, a rescue chopper pilot will stop at nothing to find and save his estranged daughter.\r So I just San Andreas and I had a lot of fun watching it, it's not a amazing movie if I'm looking at it closely and yes the movie dose have it's flaws, but really what was I expecting from this movie? well I was expecting Dwayne Johnson character saying really cheesy one liners that are bad but funny. Big CGI environment, dramatic music from every disaster movie out in the 90's and everyone being dead serious. And I got some of that but not that the cheesy one liners which I'm glad it's not in the movie.\r Who every says that Dwayne The Rock Johnson can't act...you are right but this guy has been acting for a while now and it's getting pretty old saying he's acting wooden, same with Arnold Schwarenegger he's been performing for almost 40 years now and everybody just accepted his acting as I think everybody knew it got old after a while saying the same thing. Both have something in common, both can't act but at least they both have that likability to them that every time they on screen I'm happy to see them, because they both really likable in real life. Dwayne Johnson in this movie pulled off a action hero very well and at least he had fun with the role and he didn't take it way way too seriously.\r Now it comes to disaster movies you got to have good visual effect's and for the most part this movie did have good effect's. It really helped to set the scale of a big disaster and it give the action scenes that solid concrete impact that a movie like this needed.\r Now for problems: When I said some of the CG was good, well there was some noticeable and fake looking CG at times. The opening of the movie which involves a car crashing and hanging off a deep hole in the background. Some of the effect's worked and some didn't.\r The character's in the movie are so freaking retard and I don't mean Dwayne Johnson, Paul Giamatti and Carla Gugino character's, I mean the supporting character's. This isn't really a spoiler for the movie but these a scene where Dwayne Johnson daughter played by Alexandra Daddario, she's stuck in the middle of this disaster and then she finds out about a tsunami that's on it's way due to all of the earthquake's, and what does she do? goes into a unfinished building that's not even close to done and she thinks that would save her from the tsunami, nope the building couldn't hold the power of a giant freaking waving that's more power then other wave (The movie made that point out about the tsunami and earthquake's) and it starts flood the whole building and soon falls over.\r I got nothing against Alexandra Daddario. I've seen her do a solid performance in TV shows and movies, but she wasn't all that great in the movie, actually she was pretty bad. She kept doing that boring looking face even when this big disaster is happening around her.\r Overall San Adreas is a enjoyable action movie. As I said before it's not flawless but it's better then most disaster movies that we got today. I thinking if this movie came out in the 90's this would have been a smash hit and this could have been the next Independence Day, just think about it."}, {"rating": "7", "text": "I was torn between a 7 & 8 rating but went with the higher due to the Rock's role. There are many tense action scenes to keep you alert.  The cinematography was fantastic and the story was believable. The ending was a bit predictable thus reducing my rating. Overall worth going to see."}, {"rating": "1", "text": "There's nothing to say about this movie...visually spectacular and \"somewhat\" entertaining but with a lazy and superficial script that gives ZERO development to the characters to follow this earthquake journey. Even Dwayne Johnson's charisma is not worth of our money and time but well, we already knew what would be this movie, a Hollywood dumb disaster movie. What surprises me is why so many people watched this poop..."}, {"rating": "7", "text": "I truly enjoyed this film. Has a bit of the same feel as 2012 especially in the effects department but still a good film. Loved Duane Johnson. He stood out; not because he looked great in the wet grey tee. I would recommend this film."}, {"rating": "8", "text": "The Rock and company give convincing performances and are likable. The effects are very good. Just enough character development is provided to give the stunts some real heft. Recommended."}, {"rating": "7", "text": "What more can you say... The Rock and a Disaster movie!!!\r It had all you need and some more.Plus in 3D, wow!!!!!!!\r I can't wait till it comes out on Blu Ray..."}], "recommendations": ["into_the_storm", "poseidon", "skyscraper", "independence_day_resurgence", "volcano", "hercules", "lockout", "jumper", "bloodshot", "the_meg", "battleship", "seventh_son", "geostorm", "rampage", "national_treasure_book_of_secrets", "edge_of_tomorrow", "xxx_return_of_xander_cage", "infinite", "transformers_dark_of_the_moon", "angel_has_fallen", "pompeii", "clash_of_the_titans", "the_guardian", "transporter_3", "teenage_mutant_ninja_turtles"]}