{"id": 3544, "title": "Sand Castle", "starring": ["Logan Marshall-Green", "Nicholas Hoult"], "runtime": 113, "genre": ["War", "Action", "Drama"], "description": "Set during the occupation of Iraq, a squad of U.S. soldiers try to protect a small village.", "releaseYear": "2017", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/c9buG2jVRgAu68E4D4jpwlgqhO1.jpg", "categories": {"plot": 5.428571428571429, "acting": 4.8, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 7.6}, "reviews": [{"rating": "7", "text": "This is not a typical shoot-em-up war film.  You might see more action in a documentary actually.  But I like that it was written by a guy who actually served there so its true to what probably happened.  (That in some people's cases it was not all shooting and excitement 24/7 but sometimes other...more boring tasks like helping Iraqi's rebuild stuff etc.)  There IS a fair amount of action though, its just not done with a big enough budget to be anything that great.  Its really more about the characters reactions to their predicament and just telling a story of what life was like there for an \"average\" soldier.  Overall it was a \"good\" but not great war film.  (I think the budget was so low that during 1 scene they could not even show a large enough location to show who he was shooting at so you just see a close-up of a guy shooting his gun at something, but you never see at what.  It takes you out of the action as you can't see whats going on in the battle like most films would show and you end up a little bored just staring at a guy shooting a gun from the same spot for 2 minutes.)   That was really the biggest negative I can give it though.  Otherwise it did have some good action at times and the overall story was good and there are a lot of quality supporting actors in the film that help it as well."}, {"rating": "3", "text": "Some actors here aren't that good. The main character is bland. The shooting scenes are boring, the plot is hopeless & boring for a war movie. It drags a little bit and that's bad for an already mentioned boring film, with boring shootings, & boring main plot."}, {"rating": "4", "text": "Sand Castle is not terrible just filled with cliches.    Netflix still can't do movies, one thing they should figure out in the future"}, {"rating": "8", "text": "I enjoyed this movie. Until this movie, I never liked Logan Marshall-Green, but he was very good in this story. Nicholas Hoult of X-men fame is also very good. A good depiction of a no-win situation in Afghanistan."}, {"rating": "7", "text": "Good solid war movie about the futility of it all. It doesn't bring anything new to the table but the film's focus is sharp and the story engaging. I feel the critics' reviews are a bit harsh on this one. I'm glad I watched it."}, {"rating": "10", "text": "Touching micro-pic about one incident of war and its collateral damage. Very well acted within convincing, authentic locations. When reality strikes, it wakes you up, doesn't it?"}, {"rating": "10", "text": "It's maybe the best war-movie I've seen yet.Good CharaktersMuch ActionGood sense for military scenesA interesting grounded story...But most important well made military action"}, {"rating": "4", "text": "Poorly directed film. Been done so many times, enough is enough. This film never really takes off in the sense that makes it worthwhile watching. I have read that it is a true story, and if it was directed better, with more passion and, a longer story that had been weaved together more smoothly. It would have been a great film. Several of the actors are much better than they were in this film. They were directed horribly."}], "recommendations": ["midway", "the_outpost", "12_strong", "pearl_harbor", "gemini_man", "blackhat", "infinite", "triple_frontier", "wrath_of_man", "hunter_killer", "jarhead", "the_kingdom", "the_equalizer", "battle_los_angeles", "red_tails", "bloodshot", "london_has_fallen", "the_1517_to_paris", "safe", "project_power", "pompeii", "war", "end_of_watch", "haywire", "the_equalizer_2"]}