{
  "id": 4806,
  "title": "Sandy Wexler",
  "starring": [
    "Adam Sandler",
    "Jennifer Hudson"
  ],
  "runtime": 130,
  "genre": [
    "Comedy"
  ],
  "description": "When a hapless but dedicated talent manager signs his first client who actually has talent, his career finally starts to take off.",
  "releaseYear": "2017",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/38SDqWOt4utiLOnWlas7BfrYQGS.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.125,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.5,
    "funny": 6.625,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Indeed the best Adam Sandler movie since Funny People. I liked it a lot. It is not really a comedy, it is a light-hearted drama with some amusing scenes, but not a typical Sandler movie. Also, very family-friendly. It's definitely a drama which just happens to make you laugh or smile at times, and honestly it's emotional in a way that it makes you feel for the guy. Also, amazing celebrity and comedian cameos, really fun movie."
    },
    {
      "rating": "8",
      "text": "One of the best adam sandler movies in a while, his character is zanny but not over the top ridiculous like i expected and his act as a chronic liar feels natural, its pretty funny but its very focused on its plot which is nice. The cutaway to the present with several notable actors is also pretty funny as well. Sure to be a hit for adam sandler fans and even more reserved individuals that aren typically fans of adam sandler should enjoy this"
    },
    {
      "rating": "10",
      "text": "This movie has Adam Sandler's (and probably a bunch of other peoples' hearts). That part is amazing. However, Adam persists in the same style of humor more or less with the same tone with which he started his career. The problem is that comedy has transformed significantly since that time. My thought is that Adam should transition away from comedy centered films. He is a good storyteller."
    },
    {
      "rating": "7",
      "text": "Sandy Wexler takes a bit to get going. It's early attempts at humor are almost painfully unfunny. The character himself takes some getting used to as well. The cartoonish voice used for the character is the kind of thing Sandler hasn't done in a while and is something you don't really see in comedies anymore. However, once Jennifer Hudson's character takes the screen things start to look up. What we get is a movie that harkens back to Sandler's glory days, and may just catch you off guard with how remarkably sweet it can be.It's nice to se Sandler playing a real character again, as everything since That's My Boy has just been him basically playing himself over and over again. His Sandy Wexler is kind of a Little Nicky/Waterboy-esque character. So basically he's playing another lovable loser. That's one thing I've always kind of enjoyed about Sandler movies. They've always had a way of sticking up for the little guy. Here though, the crap Wexler goes through for the majority of the film feels kind of mean-spirited. Almost like he's being punished for being a dork. While this does ultimately make you root for Sandy more, it's not hard to notice how rough the guy has it at times. You'll see him get beaten to a pulp over an accidental fender-bender, disgraced and kicked out of a dinner party, and constantly mocked by just about everyone he meets. It's believable because that's how people like Wexler get treated in everyday life, but it's almost too real at times. Luckily, the movie never crosses that line into uncomfortable viewing thanks to the sharp punctuation on the comedic notes during these scenes.The movie's biggest troubles are related to the comedy. Early on you can tell that a lot of the jokes just aren't working. Sometimes they are too weird, cheaply delivered, and even trying too hard. While things do eventually get better, and there are some genuinely hilarious moments, it's a problem that persists throughout the entire movie. Making the moments where the plot slows down a bit a slog.Speaking of the plot, it's surprisingly the best part of the movie. Unexpectedly well-written, the romance at the core of things is remarkably sweet. Mix that with how unexpectedly endearing Wexler becomes, and you really want to see him succeed and get the girl. Especially when he and Hudson are so great together onscreen. The setting is also well-executed. The movie is filled with cameos and 90's references.While it doesn't always succeed at bringing the laughs, it's nice to see Sandler deliver something familiar to his roots. It's also just nice to see him look like he's having fun again. Mix in the good story with some genuine romance and the endearing main character, and what you're left with is one the better Sandler movies in quite some time. Definitely worth a watch for fans. I think it goes without saying though, that if you don't like Sandler movies this won't change your mind."
    },
    {
      "rating": "0",
      "text": "Adam Sandler is bad.  Spare yourself the review and just don't watch itSo bad!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "1",
      "text": "This movie is without a doubt high production quality from Netflix, and I respect that, but it's based on the typical Adam Sandler \"comedy\", which we all know sucks. It hurts that Netflix funded this expecting a good movie, maybe Sandler's \"possible comeback\", but that's not happening. This movie sucks, waste of time."
    },
    {
      "rating": "5",
      "text": "No matter how bad or unbearable his movies get, I always seem to find myself giving Sandler the benefit of the doubt by watching each new one he comes out with. Maybe it's due to wishful thinking and I think that he might churn out something halfway decent for once, or maybe it's because I miss 90's Sandler so much and I hope that he'll give us something more along the lines of Happy Gilmore, Big Daddy, Billy Madison, The Waterboy, etc. Well, with this third outing with Sandler and Netflix, I must report that this movie surprisingly fell into the category of the former: It amazingly did turn out to be halfway decent in my opinion, but certainly doesn't come anywhere near his best and funniest 90's efforts, as mentioned above. However, like I said before, the film was surprisingly a small step above Sandler and Netflix's previous two films together, \"The Do-Over\" and \"The Ridiculous 6\", which were both some of Sandler's absolute worst. On the plus side, the film has a lot more sweet and well-meaning moments in it than most of Sandler's recent outings, which was quite unexpected. The cast assembled, which includes Sandler's usual entourage consisting of Kevin James, Rob Schneider, Kevin James, Nick Swardson, etc., along with the presence of Jennifer Hudson, and some other notable cameos throughout kept things somewhat interesting. However, on the downside, it does rely quite heavily and obviously on the usual Sandler comedy formula that's been heavily diluted into every single movie of his pretty much. Overall, if you're like me and you're still holding out hope for Sandler with every new movie he makes, certainly don't hold your breath on this one. I'm just somewhat relieved that this wasn't as near as painful to watch as \"The Do-Over\" and \"The Ridiculous 6\" were, which, again, isn't saying much, but if you're still holding out hope for Sandler, take that for what it's worth."
    },
    {
      "rating": "3",
      "text": "Sandy Wexler (Adam Sandler) is a talent manager working in Los Angeles in the 1990s, who could be a major player if he didn’t lie all the time and have a bumbling talk.He falls for his newest client, a tremendously talented singer (Jennifer Hudson) which is a start to a decades-spanning star-crossed love story.In a world where the studios are ready to spend big bucks to make a movie out of literally every- and anything („The Emoji Movie“), it does not come as a surprise that there’s a 130 minute comedy about how talent managers can be cool, too, if they would only be able to stop lying all the time.What could have been a semi-decent couple of minutes long sketch has taken a form of Adam Sandler project which means the storytelling and quality of directing are unbearably limp for most viewers but Sandler fans (including me) still magically get something out of it.2010’s have not been good for Sandler fans, and this Netflix-produced thing is possibly one of his lowerst quality efforts yet – calling it a comedy or even a movie belonging to a genre would be kind of stretching it.Based on the result, we can deduce that the screenwriters – Sandler is one of them – didn’t really know what to do with not a bad idea of following a talent agent’s life and U.S. showbiz in general.Also, they didn’t know how to create a story containing more than basic Sandler cliches which we have had enough already during 20+ years he’s been a movie star. Some cliches, like the main character bumbling most of the time instead of speaking, are downright pathetic by now already.And for a „comedy“ lasting for more than two hours, there are only a couple of amusing ideas, including Terry Crews as a WWF wrestler and Beavis & Butt-head harassing the titular hero by phone (to hear that you have to endure til the very end, or just start the movie when the end credits start). They can’t even make fun about 1990’s life properly!To add insult to the injury, despite all the (semi-)famous faces that joined for cameos or small parts, the makers seemed to have no idea how to use them in any exciting way.There’s a probably some record breaking myriad of showbiz talent involved, not to mention a bunch of has-beens, Sandler regulars and/or comedians who belong to his circle (excluding Steve Buscemi, sadly. How come they couldn’t get something funny out of that?And yet despite all this, Sandler comedies still work for me after all these years and sharply declining in quality during the 2010’s. I don’t know what’s wrong with me. I still find him endearing somehow.„Sandy Wexler“ is the third of five Netflix-produced movies that Sandler has agreed to. Let’s see what happens when this sweet deal runs out."
    },
    {
      "rating": "8",
      "text": "One of the best Sandler films in years, and one of my favorite Sandler films of all time.  I didn't watch his other 2 Netflix films yet, as the reviews were poor, but this one based on a real person intrigued me so I watched it without even looking at any reviews.  This is a film with heart, with some of these events having actually happened in some form based on a real character.  If you like any Adam Sandler film, you will almost for sure like this movie.  If you do NOT like Adam Sandler movies...I find it funny that people would even watch it so...why would you even watch it ?   Very funny movie, with heart, and very silly like any other Adam Sandler movie, as...that is what he does with the exception of 2 films in 20 years.  I find it funny people complaining that its \"not like\" his older films (and they cite Waterboy or Happy Gilmore etc.) when...this film is EXACTLY like those films.  If you liked those films there is near 0 reason to not also enjoy this film.  Its 2017 and internet hate complaining is its own sad hobby.  This movie is every bit as good as any Adam Sandler film of the last 10-15 years and the complaining is odd, and funny.  Great film no matter what uptight reviewers or complainers say.  (and I watch slow moving dramas, Oscar winning films....I know good films and this movie, while silly, is a pretty well done film for an Adam Sandler movie, and one of his best in a long time.)"
    },
    {
      "rating": "6",
      "text": "The 90s Hollywood from a manager's perspective!It seems the Americans desperate, deliberate hate towards Adam Sandler, Michale Bay et cetera never going to calm down, even they have started to give good films. That's an unfortunate mindset from the west. While the rest of the world enjoying these guys films without prejudice. This is not Sandlers best, but a better one. Initially, it annoyed me to see the Sandler with the same old accent. But seeing the some of the scenes, it actually made sense. I especially thought it should have been a serious drama, but then it would haven't worked out with the kind of characters it had. Particularly the Kevin James.It is a 90s tale about a Hollywood manager. Narrated as a flashback as the film stars recall his legacy. His latest find, a young woman with a golden voice, is an upcoming sensation. He always stood for her in all the good and bad situations. But time comes he to back off and focus on his other clients. The remaining is about his job, how it shapes are told. I have heard that it was loosely based on Sandler's own manager. I also liked cameos, particularly Rikishi! A long film. But I liked it at the end. It is an okay film. Those who hate Sandler should stay away and let the rest of the guys enjoy it.6.5/10"
    },
    {
      "rating": "1",
      "text": "I mean he stopped trying a long time ago    but this is probably the pinnacle of it.    This netflix deal is worse than the espn-mnf deal"
    },
    {
      "rating": "5",
      "text": "It's just a T.V movie, as same as most of Adam Sandler movies that composed of silly and funny jokes."
    },
    {
      "rating": "4",
      "text": "While the movie provides a fair share of absurd humor, Sandy Wexler fails to entertain minimally."
    },
    {
      "rating": "3",
      "text": "i didn't say that..Sandy WexlerThere are few laughs here and there which is actually in lower amount than usual Adam Sandler but what it surprisingly possesses is a great character development inherently written on the script before it even hits the screen. And after it does, Sandler's brilliant portrayal of this eerie character sets the bar and expectations higher which unfortunately feature never catches up. Steven Brill's world doesn't stay true to its tone resulting onto a loosely placed execution that may get better on some aspects but it still isn't saying a lot. The feature doesn't quite find its place between comic sequences and high pitched drama ones failing completely on walking the central line of it. Sandy Wexler might be a beautiful love letter by Adam Sandler on performance level but it needed a lot better editing, execution and plot line to make its way up there."
    },
    {
      "rating": "10",
      "text": "sure this is the best comedy in 3 years till now..this is masterpiece.i dont understand why people hate this movie..every 2-3 minutes i really big Lol..for every scene."
    },
    {
      "rating": "3",
      "text": "I freaking hate that movie. It also might be the only Adam Sandler movie that I really dislike. Critics hate the early Sandler movies while audiences and fans just worship them. This is just one of those movies that the audience doesn't hear a laugh, cause really, NONE of the jokes aren't funny to me, and I don't even remember laughing at this movie when I watched it with my family. I'm not telling you guys to really not watch this movie if you're an Adam fan, but I don't think I would really recommend it to people I know."
    }
  ]
}