{
  "id": 45,
  "title": "SAS: Red Notice",
  "starring": [
    "Sam Heughan",
    "Ruby Rose"
  ],
  "runtime": 120,
  "genre": [
    "Drama",
    "Action",
    "Thriller"
  ],
  "description": "An off-duty SAS soldier, Tom Buckingham, must thwart a terror attack on a train running through the Channel Tunnel. As the action escalates on the train, events transpire in the corridors of power that may make the difference as to whether Buckingham and the civilian passengers make it out of the tunnel alive.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/6Y9fl8tD1xtyUrOHV2MkCYTpzgi.jpg",
  "categories": {
    "plot": 2.0,
    "acting": 2.0,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Sam Heughan (the hunky hero from Outlander) takes on an action role. He plays an SAS soldier who’s taking his girlfriend on the Chunnel to Paris, when the train is hijacked. While military forces apply pressure from above, it’s up to our hero to single-handedly save things. Even though situation is unique, nothing about what develops is original and some of it defies logic. The action beats are regular, but none of the encounters are special. NOTE: In other outlets besides Netflix, this film is titled “SAS: Red Notice.”"
    },
    {
      "rating": "2",
      "text": "I was looking forward to watching this film, the cast is half decent so I'm not sure how they all manage to act so unconvincingly. I think it has a lot to do with the script which is comically bad, full of plot holes and the characters motivations and consistency are all over the place. The characters actions don't make any sense a lot of the time, which would be OK if the action carried the film along, but the action sequences are also quite comically bad.The action is like a dud firework, you expect to be at least somewhat entertained but the action is badly choreographed and very underwhelming. It like a very bad straight-to-TV 80s low budget film. Looking at the credits they have a load of people that worked on the movie, but they seemingly forgot to hire any military advisors. Why are they using grenade launchers as weapons in close combat house clearance?? It makes no sense. You ask questions like this all the time, I think all the advisors got furloughed and Andy McNab is just allowing the use of his pseudonym for the cash. Even the love story (yes, it its core it really is a love story) is really corny and doesn't work. Some of the dialogue, especially in the ending is just so unbelievably, facepalmingly, bad, and not in a so-bad-its-good way.Who Dares Wins, almost 40 years old, still hasn't been bettered and if you want to watch a SAS/action movie just watch that instead it is leagues better in every way."
    },
    {
      "rating": "8",
      "text": "Expectations were low going in, but expectations were exceeded coming out. Terrific set pieces. Ruby Rose is having a blast playing the ruthless bad girl whom you never want to double cross. She gives as good as she gets mixing it up w/Sam Heughan who could be Tom Brady's doppelganger.  Is it an original story? No. Is it a believeable story? Not really, but it's made for watching on the big screen where you can get lost in the action/stunts/locales. The very definition of a better than average Saturday afternoon \"popcorn\" thriller."
    },
    {
      "rating": "2",
      "text": "This film is bland, boring and probably would've been received a little better if it came out in the early 90's.The problem is that the narrative of someone trapped in a space while being hunted by 'bad guys' has been done to death. So, to do it now would require some inventive writing and unique new ideas that could reinvent that style of film and make it interesting. Unfortunately, any form of unique/interesting storytelling devices that could've made this film interesting, unique or good are absent.In terms of movies using this 'trapped narrative' it's not an all-bad idea, had it had a different protagonist and antagonist (preferably better actors) I might've enjoyed it. I didn't like either of their performances and they left me disinterested, they weren't unique, they weren't well written and they were a bore to watch.A good example of this trapped narrative done well (lol well not well, but at least entertaining) would be the film lockout, the writer sets it in space to be different and creates a character that's sarcastic and quippy, but oddly likeable.You see, if we're spending so much time with these characters and you write them as interesting and they're acted well, then even if the story's bland at least we as viewers spend time with people that entertain us and can trick us into feeling like we're watching a good movie... but none of that is here. Instead, we get Ruby Rose, who's acting is so bad it's criminal and some dude I've never seen before.Saying all that actually makes it a real shame that they've hired some other really decent actors:Andy Serkis, Tom Wilkinson, Hannah John-Kamen, Owain Yeoman and Noel Clarke (who's passable I guess...)All people that can usually provide a good performance let down by a lazy script, poorly acted antagonist, boring protagonist and a subtext so transparent, lame and ham-fisted you start to think his girlfriend is the actual psycho.Not worth your time, unless of course you like films that just make noise and go \"bang!\", if that's you, then have at it... Or watch lockout, lol it's stupid and ridiculous, but it's got the aforementioned \"bang!\" and a protagonist that actually has on screen charisma."
    },
    {
      "rating": "9",
      "text": "For some reason, the entire point of this movie is missed in the reviews I have seen.  This was an action movie but it was also an intellectual movie with an important point about human psychology.  For anyone who thinks this movie didn't have a solid plot, you missed this point.  Even the title of the movie refers to this point about human psychology and what is going on in our society right now.\"Black Swan\" is a term they are using to refer to Psychopaths.  The group of paramilitary fighters who are the villains in this movie are psychopaths, and the movie points this out directly in many ways.  The older man says he has never loved anyone in his life.  The female villain commits many violent acts with zero remorse.  The hero in the story, Tom, is one who is sort of on the spectrum but not really.  The question is raised multiple times throughout the movie: does he have remorse?  Can he truly love?  Empathy and remorse are entirely lacking in psychopaths, so the question is asked, is Tom a psychopath?  And in the end the question is answered: no he is not.  He is capable of killing when it is necessary, and he does not regret the loss of life if it is a violent psychopath he is killing.  His fiance finally accepts this necessity at the end.  And Tom is capable of love, and is devoted to her.  There is another point about psychopaths that this movie makes.  They are out there, and they hide in plain sight.  You think they are normal people, but they are not.  They operate in society in ways that do not necessarily make them obvious to spot.  And they have value to the military because they will not hesitate to pull the trigger.  They do the dirty work that no one else wants to do.  This movie demonstrated the reality that the military KNOWS about these people and uses them for their own purposes.  In this movie the Black Swans were used to clear a village that was inconvenient, by our government.  It is apparent that this is not theoretical: this is happening in our military.  And the problem I have with it is that the military is not doing anything to support the people who are affected by them: their families.  Psychopaths abuse others around them simply by default.  When you don't have empathy, you are casually and inadvertently cruel.  Also these people have a lot of hatred and anger because they don't have tender feelings, and their spouses and children bear the brunt of this.  The military needs to do more to identify these traits in their members and to put limits on their abuse of their families.  I know all this because it happened to me.And finally, the title of the movie has an even deeper and symbolic meaning.  \"The RISE of the Black Swan\" is a reference to the fact that we have more of these people in our society right now than we ever realized.  The hatred and discrimination and ideas about \"cancel culture\" that have arisen over the last 5 years are directly related to the fact that these people have very recently been enabled to come out of their closets and demand their right to be hateful without censure.  They are sick of hiding and pretending to be like the rest of us in empathic society in order to get along and get their needs met.  What we have been witnessing is a sociopath revolution.  The end result of allowing this to go on will be a fascist takeover of our country.  Fascism is the government style that sociopaths/psychopaths prefer.This movie was clearly an attempt by the producer to shed light on these issues with psychopaths in order to bring this risk to our democratic/empathic society into general awareness.  If all you saw was an action movie, then they failed."
    }
  ]
}