{
  "id": 808,
  "title": "Sausage Party",
  "starring": [
    "Seth Rogen",
    "Kristen Wiig"
  ],
  "runtime": 89,
  "genre": [
    "Adventure",
    "Animation",
    "Comedy",
    "Fantasy"
  ],
  "description": "Frank leads a group of supermarket products on a quest to discover the truth about their existence and what really happens when they become chosen to leave the grocery store.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vNgdPJQ5CI60oEiiHLKRNrsDhMy.jpg",
  "categories": {
    "plot": 4.266666666666667,
    "acting": 4.4,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 3.6363636363636362,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The movie tries to be humorous and atmost times falls flat.\rI kept getting the feeling that the writers wanted to try and be south park meets a pixar movie... and they just failed miserably."
    },
    {
      "rating": "1",
      "text": "A sub-par film that's 'Gimmick' of unexpected violence and profanity outwore it's welcome within the space of the first trailer, the majority of this film's 'substance' consists of food based racial caricatures, frankly uncomfortable amounts of sexualisation, and poorly-done social commentary. Save yourself the time and money, the script for this travesty leaked online months ago."
    },
    {
      "rating": "5",
      "text": "Gratuitous vulgar foul mouthed way over the top sexualised food anime. If they hadn't been so over the top on the sex, then they would have had a mini classic because a lot of this was really funny, but the sex stuff, just too too much...I mean ugh ugh too much, like finding your parents porn stash ugh..."
    },
    {
      "rating": "4",
      "text": "I had no idea what this movie was about when I saw the posters appear. I eventually got a brief synopsis of the film. I thought it would be raunchy, but amusing. I rented it from my local library. In the world of Sausage Party all food items are alive and can move around, humans just can't see them. THe grocery story items believe that when humans taken them home they go off into paradise. Frank is a good old fashioned hot dog that just wants to be taken home along with a pack of buns featuring his girlfriend Brenda. He wants to put his sausage all up in her bun. After a jar of honey mustard is returned to the store with insight into the real world (food gets eaten) there is an accident that spills Frank, Brenda, and other assorted food out into the store aisles. They try to navigate the store and along the way find out about the great beyond. Oh yeah and **** **** **** ****ity **** There are some interesting sight gags in the film and the animation is well done. Most of the jokes are beyond juvenile and you can see them coming from a mile away. I still enjoyed the first 75% of the movie though. Eventually I wondered how they would resolve the main issue (humans are eating food but the food is alive). They don't really, the movie just sort of goes off of the rails. I guess this is expected due to the absurd nature of the movie.The food also really wants to get funky. There is a giant food orgy at the end. Food characters who are clearly designed to be same sex get it on. Group sex. Just lots of really raunchy stuff. Oh wow you have the two male(ish) Jewish and Arab foods who bickered all movie get down and have sex? Wow what an enlightened movie. The food orgy was funny for about 10 seconds but kept going and going and going. This was the hole point of the movie. Seth Rogan said \"hmm how can I show food ****ing\" and then the rest was built up from there. Blah."
    },
    {
      "rating": "5",
      "text": "It must have been a nice sesh. The writers baked the sh1t up, confident that the ideas They are getting are incredible and funny. Reality is that every idea You conceive being high is funny as hell only when you stoned... And this film is a proof what happens when You make this ganja fulled ideas true. Banal pseudo philosophical ganash done with the most talented voice actors alive. What a shame...\rOn the other hand watch this film high as **** and You will enjoy it! But don't expect \"This is he End\"-quality"
    },
    {
      "rating": "5",
      "text": "This is an okay movie, but I didn't find it all that funny. Animation was very good, and story was alright. The only thing that ruined this movie is that non of the characters are likable. Humor wasn't all that funny. F-bombs are everywhere. It's okay, but not as good as the Trailer."
    },
    {
      "rating": "6",
      "text": "This is an alright motion picture, however I didn't think that its all that entertaining. Liveliness was great, and story was okay. The main thing that demolished this film is that non of the characters are agreeable. Silliness wasn't too clever. F-bombs are all around. It's alright, yet not on a par with the Trailer. Watch and download this movie here Download film online."
    },
    {
      "rating": "5",
      "text": "I am disappointed.In this movie there are a lot of vulgar jokes.I have not laugh while I am watching this movie. Really boring story and characters. The last 15 minutes was extra. I give 5 because of the idea."
    },
    {
      "rating": "9",
      "text": "Unsubtle and unashamed of it, this is consistently funny and rarely ineffective. If you can get through the opening song and the first scene or two you'll know if it's for you or not."
    },
    {
      "rating": "8",
      "text": "Wow, what a crazy experience! And yes, this is a very \"R\" film, but it's hilarious overlaying the social-commentary-filled storyline on animated food. Good times, whether you're high watching it or not."
    },
    {
      "rating": "4",
      "text": "Puerile, mean-spirited and not very funny. It tries so hard to be offensive that it rarely amounts to anything authentic or worthwhile. Pretty disappointing overall."
    },
    {
      "rating": "5",
      "text": "I expected something much more funnier, but this was the usual Seth Rogen weed smoking humour - it can be good at times and this movie did involve plenty of funny jokes, but some just felt out of taste and not that funny, or maybe trying to get reaction too much kind of jokes. I really had higher hopes based on the trailer for this movie."
    },
    {
      "rating": "4",
      "text": "Disappointing. I had fairly high expectations of this offering from Rogen but, sadly, this was a premise with promise which simply didn't deliver. The satirical skewering of religious faith could have been brilliant, but the racism and complete, gleeful lack of finesse undermined what might have been an otherwise substantive commentary. There were some moments of hilarity, but they were few and very far between, and they were overshadowed by the many moments I was rolling my eyes rather than laughing. 4.21/10"
    },
    {
      "rating": "7",
      "text": "Sausage Party does exactly what it says on the tin, delivering an outrageously hilarious and offensive Disney spoof that's as much fun for the audience as it seems to be for Seth Rogen and company."
    },
    {
      "rating": "4",
      "text": "Overall it was just ok movie but I was expecting to see a far better & much funnier movie than this.\rIt was just dull boring in lots of parts.\rI would only recommend this to watch this movie on DVD/BluRay or in TV."
    },
    {
      "rating": "4",
      "text": "Look, I don't have a problem with any of the shots at religion or adult humor Sausage Part has. My problem with this movie is that it just isn't very funny. In fact, the trailers are the best part of the movie and spoil most of the funny moments. Cussing in a movie never bothered me and some are actually better with it but this one actually goes over board to the point that it's kind of annoying. It's like the writers couldn't really think of any good jokes so they thought throwing in the F bomb in every piece of dialogue would cut it. And the sex themed jokes come off as a bit weird also. I'm sure I laughed a little at some scenes but nothing really stuck in my mind after viewing besides that totally messed up in a bad way ending. The only positives that I can think of is that the animation and voice acting are good. Other than that, this is a below average movie for me. I would not see it again. I recommend catching it on HBO or whatever premium channel it comes out on or maybe even a rental."
    },
    {
      "rating": "5",
      "text": "I saw this movie yesterday, and I thought it was disappointing. Some scenes made me laugh, but the movie for me felt pretty bland. Even the trailer was funnier than the actual film. Some funny jokes here and there, but overall..it's not a good comedy."
    },
    {
      "rating": "5",
      "text": "WTF!!!!! This is one of the main things I was saying in a both good and bad way after seeing this film. This is one of those films that really rides the shock value of the film really hard with sometimes working to its favor and other times going either too far or shooting itself in the foot with comedy value. To get into this film you must understand that more than likely it will make fun of you in some way but also the fact that those who wrote the script were probably on alot of experimental mind altering drugs. The major problem for this film is that I don't know what to think of it either as a bold and daring move on adult animated films or as a gross cash in on simply trying to find out what is the most shocking thing they can throw up on screen and get away with. Though I will say I would recommend that you watch this film when it comes out on dvd just so you can say you have seen this crazy film because this film is honestly a one and done film. As an added note, the critics taht say this film is written clever or smart as a way to parody religion are incorrect as there isn't anything real clever or subtle about it and hits you over the head with it which is perhaps the biggest detriment to this film's premise."
    },
    {
      "rating": "4",
      "text": "Sausage Party is offensive, crude stuff. It works right half the time and the other half, it disgusts viewers with the most average and petty sex jokes there are in the book. It is definatley not for kids, and maybe, just maybe, not for some adults even."
    },
    {
      "rating": "5",
      "text": "I feel dumber for having seen this, although my dad score is high for my 16 year old that wanted to see it badly.  Kind of uncomfortable when we coincidentally had hot dogs for dinner afterward.  Rated R for a reason, and they went to areas I wasn't expecting.\r Movie was OK, if not a little boring.  I wish I had seen something else."
    },
    {
      "rating": "5",
      "text": "Sausage Party is easily one of the weirder movies that are out there, and I don’t mean that in a good way. First and foremost, if you are easily offended in any way, shape, or form, do NOT see this movie! This film goes out of its way to offend as many people as it possibly can. I can’t think of a single group of people who aren’t targets of some kind of joke, stereotype, or just outright racist expression. Be strong of heart, ye who enter here.\r Now for the most part, the movie isn’t that bad. The concept and story are interesting and creative, most certainly something original. The voice acting is actually spot on, not at all distracting and matching every character perfectly. The animation is really good, though, with a strange amount of detail being put into the characters despite the style being cartoonier. Unfortunately, the comedy is really lackluster. There are a few jokes that work (a particularly good one with a certain singer who shares his stage name with food), but most of those are in the trailer and the rest of them are based on the aforementioned racism in this movie.\r For about the first two thirds of the film, if you can get past the incredibly offensive stereotypes, it’s an alright film. But towards the very end, pretty much the second to last scene of the film, it takes an insane sharp left turn into “what the f**k” territory. And unfortunately, the scene goes on far longer than it really should. It’s such a bizarre, out there scene that I don’t think anyone in the theater knew how to react to it. I won’t exactly say what it is, but I will say that the sexual innuendos and sexual talk in the film is blown out of the water and firmly secures this movie’s “R” rating.\r This one scene completely flips the movie on its head. What was just an average comedy film was swiftly shoved into the realm of “DO NOT SEE IN THEATERS” in a matter of moments. Wait until this movie comes out on Redbox, and watch it ALONE to decide whether or not it’s something you really want anyone else to see."
    },
    {
      "rating": "3",
      "text": "This movie's gimmick is the animation. This film is a weak attempt at edgy humor and social commentary that just comes off like a living room full of bro-tastic frat jokes. Watching this film it felt like someone forgot to tell the writers that the use of the f-bomb in and of itself is not funny. I maybe laughed 4 times during this entire film. I went in expecting something on the lines of Team America. But instead got a bad CollegeHumor student film. The film's attempt at an anti-religion social commentary is about as subtle as a brick through your windshield. Racial stereotypes and characterizations abound without any of the true craft of self exploration through humor.\r South Park, Family Guy, and the Ted films do this kind of thing so much better.\r This movie is garbage. Don't see it, or better yet watch a bootleg; because that's all this movie is worth."
    },
    {
      "rating": "3",
      "text": "Well it's not for kids, that's for sure! So let's move on shall we? I came into this film expecting dark adult-humor, and that I did get... Sort of. What I wasn't expecting was some very strange messages about religion! Odd... Not really worth the money for a full price ticket."
    },
    {
      "rating": "6",
      "text": "Though more outrageous than it is downright funny, \"Sausage Party\" contains just enough wit and welcomed social commentary to reassure you of your ticket purchase. It could have contained a much larger dose of the more nuanced and performance-based humor that made other Point Grey films so great, but for what it was, I can't say I left the theater regretful."
    },
    {
      "rating": "2",
      "text": "On paper this must have seemed like a sure fire hit. A crude and politically incorrect toon about food stuffs misguidedly dreaming of a better life outside of the super market shelves. Unfortunately, the execution leaves a lot to be desired and the bad taste jokes remain just that with the lack of laughs exacerbating the true offensive nature of the material, which possibly has something to offend almost everyone. There is a certain irony to be had from the fact that the film, aimed squarely at the adult market, is more juvenile in concept and writing than ‘Finding’ Dory’ or ‘Zootopia’, both of which are intelligently written, imaginative and truly funny. For most of its running time ‘Sausage Party’ flounders without inspiration in a desperately hysterical manner. A couple of gags raise a grudging smile and there is one very good sequence where the different sausages and veg discover their fates in a suburban kitchen. Other attempts at humour, however, involving a lesbian taco, a Stephen Hawking inspired bubble gum and a Middle Eastern pitta bread all fail miserably. Where the film does succeed though is in underlining the low level of humour to which the whole enterprise aspires."
    },
    {
      "rating": "1",
      "text": "I'm not offended by animated food arse **** I didn't much get my PC knickers into a knot over the racial stereotypes. I just flat out thought this movie was boring. The humour is set to the lowest possible level, it dragged one or two laughs of me at first, but the jokes wore thin. There's a trace of some great ideas in there, it probably sounded really funny over beers and bongs ten + years ago when they came up with it. But in the final execution, it doesn't even look like quality animation. It's just a really appalling waste of people's time, both those involved and those watching."
    },
    {
      "rating": "5",
      "text": "I actually thought this movie was going to satisfy me but it didn't quite did the job. It starts off well, by meeting hilarious characters and I loved the chemistry between the weiners. Jonah Hill was great and Seth Rogen was Seth Rogen. It's like they wanted to make sure that this movie is RATED R by just dropping f bombs every 10 seconds. I don't have a problem with cursing, believe me,  cause I didn't mind it in The Wolf Of Wall Street. But in this occasion, It gets boring and repetitive. I like the idea of this movie but it didn't really bring a smile to my face."
    },
    {
      "rating": "3",
      "text": "Don't get me wrong, I tend to like vulgar, outlandish comedy, but for me this movie was like having a bad acid trip. There's a number of scenes that are outright disturbing. I get that it's all food involved, but when they intentionally present the food as people the **** that goes on is actually quite horrific. It's the kind of movie where a lot of the jokes are the exact same jokes done over and over again. Mainly sexual innuendos and ethnic/sexuality stereotypes. I found it amusing for a bit, but it becomes desensitizing. And the cannibalistic doucher... my god. Utterly terrifying is all I have to say about that."
    },
    {
      "rating": "6",
      "text": "Beautifully animated and original but lacks a lot of the laughs that the trailer promised us. I counted maybe three or four gut busting moments during the course of the film and an ending so over the top that my jaw dropped and had me nearly rolling on the ground laughing. But a lot of the jokes they went with at a while got very stale and repetitive. While I was smiling and smirking at a good portion of it, this movie should have had me laughing consistently throughout."
    },
    {
      "rating": "0",
      "text": "Is everyone who is giving this high scores drunk or delusional?  Did we see the same movie?  Absolutely can't believe this garbage is being made.  Don't let Hollywood keep making this unclever crap that leans on it's crutch of 'swearing in animation' until it breaks."
    },
    {
      "rating": "0",
      "text": "2 people left during the movie -- I wish I had done the same. I laughed about once or twice, but honestly speaking, they are not funny at all. I wish I could unsee it."
    },
    {
      "rating": "3",
      "text": "I wanted to like this movie, but there were just a few too many things that bothered me with this movie. the movie is constantly reminding the audience that it is Rated R. Being a raunchy comedy as a parody of Pixar movies I understand that. This movie is still constantly cussing non stop to where it becomes distracting because of how much they cuss every other sentence. It makes the dialogue a lot less good for my tastes when it keeps on doing this over and over. The racist stereotypes could be funny, if the joke with them as less about, \"Look it's funny because we're being super racist in an animated movie\" I've seen and love South Park. South Park does something with the fact they use stereotypes without the joke literally just being, \"laugh because it is a stereotype.\"\r The movie is relying too much on the concept that it is an R rated animated movie to push beyond that. I wish I liked this movie, but it just fell flat and stopped being funny when the running joke got old."
    },
    {
      "rating": "5",
      "text": "A banana only cost me $1 and provides way more quality entertainment than this movie.  If you enjoy that last sentence, you will like this movie. If not, avoid this movie like it's the swine flu."
    },
    {
      "rating": "0",
      "text": "I'm giving this movie a zero not because of the quality of the film itself, but because of the absolutely atrocious manner in which the makers of this film treated their animation team ranging from unpaid overtime to omission from the credits of the movie itself. Such business practices should not be tolerated.\r https://www.washingtonpost.com/news/arts-and-entertainment/wp/2016/08/17/for-audiences-sausage-party-was-a-laugh-riot-for-some-animators-it-was-a-nightmare/"
    },
    {
      "rating": "0",
      "text": "This is the worst movie ever. Don't waste your money. If you have seen the trailers, then you have seen the best of the movie. I actually wanted to leave halfway through this mess. BORING!!!!"
    },
    {
      "rating": "0",
      "text": "I never thought I'd say this and MEAN IT, but you'll find more profound social commentary in an episode of Family Guy. This movie was just PROFOUNDLY unfunny. Once the novelty of the vulgar cartoons wears off (which will be immediately; it is right out of the gate and relentless) you'll be left with another hour and a half of lazy, uninspired writing and over-the-top disgusting visuals. That it seems to think highly of itself for it's \"inspired\" views on religion and racism is an insult to anyone who's ever watched literally anything else. \"We're not so different after all?\" \"We should be respectful of one another?\" You mean the last 45 seconds of every relevant episode of South Park? I didn't exactly go in expecting the moon, but it was a disappointment and I was actually uncomfortable watching the people I was with. I like Seth Rogen and I like a lot of his films. Pineapple Express is a movie that I love and quote constantly. But honestly I'm going to be a lot less enthusiastic about whatever he does next. I chuckled once the entire film, at an overly polite and apologetic six-pack of Canadian beer. Take from that what you will."
    },
    {
      "rating": "0",
      "text": "I wish I didn't waste my time and money on such a horrible movie. I laughed maybe four times throughout the whole film.   The unrestricted trailers really do make it seem like a better movie than it really is.    This movie was purely intended for grown folks with an adolescent brain.    Time and money I'll never get back.   Two thumbs down on this steaming pile of sh!t!"
    },
    {
      "rating": "1",
      "text": "This movie has a strange but interesting commentary on religion near the end and a truly unexpected ending. Too bad the journey to get there is gruesome, racist, uncomfortably loose with consent, and humorless. That last one is the key, because much of the rest could be partially forgiven if it made me laugh. But it didn't. It was awful. its discomfort for discomfort's sake. If it has point, crudeness is not inherently wrong, but it its pointless, its pointless. I wish I could un-see this movie. But i cant."
    },
    {
      "rating": "0",
      "text": "This movie is nothing more than a cheap excuse to use crude, sexist humor to appeal to the lowest common denominator- including stoners and college guys.  It is NOT worth the price of admission."
    },
    {
      "rating": "0",
      "text": "I myself tend to try and find the good in every film, even films that completely tank in the box office, but 'Sausage Party' was such an awful, terrible, boring, and vile film that even I cannot find a single positive characteristic in this mess of a production. The plot was boring and unoriginal, the anti-religious theme was so blatant and repetitive that I honestly have a genuine dislike for almost every actor now, and the content was so crude and void of humor that I can actually count the number of times I laughed at this film on one hand. Though I tend to think of myself having a dark/edgy sense of humor, this waste of 89 minutes showed me that some peoples' sense of humor isn't actually humorous, it's just a culmination of random and sick narcotic-fueled ideas.\r Coming from someone that actually enjoys watching South Park, Family Guy, and listening to Daniel Tosh's stand-up comedy, as well as not even being phased by the elephant scene in the 'Brothers Grimsby', DO NOT SEE THIS FILM. It is so vile and disgusting and profane that I honestly would rather drive railroad spikes through my crotch than waste another second watching this piece of garbage film."
    },
    {
      "rating": "6",
      "text": "The trailers present you with exactly what you'll get while watching Sausage Party. If you liked the trailers, you'll like this movie. If you didn't like them, the movie does little else to get you on board.\r It effectively hits its target audience and doesn't hold back in its vision whatsoever, but I was still left with the feeling that such an interesting concept could have been utilised to a more consistently interesting and exciting effect. The profanity misses the mark many times because its too nonchalant; the f-bombs are so non-stop that they might lose their thrilling potency too quickly for some viewers. I feel like the inevitable sequel will be a vast improvement and get most of the issues the film has right, particularly in the animation department"
    },
    {
      "rating": "0",
      "text": "les joke de se film la son poche en criss , meme qui en a meme pas de joke c juste du pipi caca pénis toute le long ma toute tué ceux qui participer a se film ma retrouver seth rogen pis ma le pendre le gros tabarmak"
    },
    {
      "rating": "0",
      "text": "bande de caca ceux qui donne des 100 a se film la doit etre des gens extremement con dans la vie le genre quon devrait tuer avant qui fassent du mal a quelquun telement sont cave"
    },
    {
      "rating": "1",
      "text": "It's like the plot was written by a 13-year-old, with the script written by a 2nd-year college drop out. One of the worst movies I have ever seen. I would have walked out of the theatre 10 minutes in if I was seeing it alone. It's not very funny, it's not \"edgy\", it's just bad. Not even so bad it was enjoyable, it was just terrible."
    },
    {
      "rating": "0",
      "text": "This film is an embarrassment to film.  Whoever approved this script, whoever approved the execution of this movie being made, should be sacked, his office burned to the ground and have all creative ability or control completely taken away from them.  This is shockingly bad for a movie.  So shockingly bad that I don't even know how to rate it, so I'm refusing to give it anything beyond the lowest rating available.  This is so insulting on a comedy level, so utterly despicable, so utterly offensive, and so ultimately FORGETTABLE that I fully support any argument claiming mental damage from viewing it.   Can't even fathom why this exists, its that bizarre.  The film might have worked, had \"Food Fight\" never existed, or \"Toy Story\" never existed, but it still would've been hailed as some of the worst animated garbage ever created by human kind.  I'm literally embarrassed for the people that were involved in this film.  I hope they're parents are proud of them."
    },
    {
      "rating": "0",
      "text": "The entire movie consists of retelling the same jokes over and over again. It's so stupid and painfully unfunny. I am shocked that this got a near 70 metacritic score lol."
    },
    {
      "rating": "4",
      "text": "Pretty much the same juvenile, toilet humor that youd expect from a Evan Goldman and Seth Rogan. “Sausage Party” is perhaps their most direct offering of raunchy mischief, only now their game’s been upped from the live-action realm to the CGI-animated realm, delivering a somewhat intelligent film that’s packed with the usual cursing, sexual situations all involving supermarket food.  If youre looking for a movie thats amusing but not really as funny or even as hilarious as movies like Neighbors and Neighbors 2 then definitely go see this movie.  But in terms of the usual films youd expect from Seth Rogan, this isn't good comedy."
    },
    {
      "rating": "5",
      "text": "I recently saw a video on YouTube titled \" Werner Heisenberg VS the New Atheist\" and the content of that video summarizes my problems with this movie's take on religion and the Human condition. Anyone who finds this movie to be intellectual or thinks its commentary on religion is \"deep\" seriously has to lay down whatever substance they are on and actually read the history of religion.\r In terms of quality, this movie looks like the project of wealthy teens from the Hamptons tasked with making an animated movie on (new) atheism mixed with juvenile humour. The jokes in the movie are plain not funny and just made me cringe throughout the entire movie time. The humour is largely based on less than subtle dick jokes that one would hear in high school emanating from the class clown. I really find it amusing that grown adult film makers wrote and produced this \"comedy\" movie.\r Overall, I would not recommend buying a ticket at full price at the theater to watch this \"comedy\", just wait till it is on Redbox and rent it for a day or two. Trust me, there is really nothing to see here."
    },
    {
      "rating": "0",
      "text": "Sausage Party starts off pretty strong. You're immediately brought into the world of a super market, where it's discovered that all the food items are in fact alive. Afer some philisophical discussions, a ragtag group of edibles then try to save themselves from certain doom. Kind of a funny movie actually, but it weakens towards the end. It gets way too crazy, and not in a good way. The ending was weak, capping off a mildly enjoyable film with a disgusting taste in your mouth. It leaves you asking, \"What were they thinking?\" However, if really raunchy humor is your thing you just might enoy this."
    },
    {
      "rating": "2",
      "text": "is it animation for fun and make some fun times ?really ?is it porn animation maybe ?i dont think so .i think this film is sexual content very strong for nothing.i disappointed."
    }
  ],
  "recommendations": [
    "the_interview",
    "the_happytime_murders",
    "borat_cultural_learnings_of_america_for_make_benefit_glorious_nation_of_kazakhstan",
    "good_boys",
    "jackass_the_movie",
    "fifty_shades_of_black",
    "neighbors_2_sorority_rising",
    "ted_2",
    "g_force",
    "the_hangover",
    "the_hangover_part_ii",
    "a_haunted_house",
    "idiocracy",
    "jackass_presents_bad_grandpa",
    "free_birds",
    "the_dictator",
    "movie_43",
    "project_x",
    "white_chicks",
    "cloudy_with_a_chance_of_meatballs",
    "deuce_bigalow_european_gigolo",
    "this_is_the_end",
    "the_host",
    "anchorman_2_the_legend_continues",
    "barbershop_the_next_cut"
  ]
}