{
  "id": 4832,
  "title": "Savages",
  "starring": [
    "Taylor Kitsch",
    "Blake Lively"
  ],
  "runtime": 131,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Pot growers Ben and Chon face off against the Mexican drug cartel who kidnapped their shared girlfriend.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/a5h5FvryxiALwfv3FzgUKxJHHPG.jpg",
  "categories": {
    "plot": 6.326530612244898,
    "acting": 6.787234042553192,
    "ending": 6.142857142857143,
    "soundtrack": 6.666666666666667,
    "cinematography": 6.5,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "5",
      "text": "It is the typical movie you do not know if you liked it or not."
    },
    {
      "rating": "0",
      "text": "Terrible movie. Couldn't root for any of the main characters, especially the blonde, so you didn't care what happened to them. Stakes were therefore zero. Plus her annoying Voice Over which is a lazy man's device- if I wanted to listen to someone read me a story I'd buy a book on tape, not go to the movie. And the double ending was hilariously bad. People in the theater actually laughed. And this isn't a comedy. Save your money and see anything else."
    },
    {
      "rating": "0",
      "text": "Steer clear of this movie - it is terrible.  I love action/suspense thrillers and went to see Savages after seeing an overall positive score for it on Metacritic.  I have no idea how Savages got a score of 62 - I would give it a 2 at best.  Save your time, brain and money and see something else."
    },
    {
      "rating": "10",
      "text": "The most stylish, thrilling and sexy Stone movie in ages. Savages a drug fuelled thriller in which Director Oliver Stone lives up to his filmmaking and gives us a story about Chon and Ben played the aero five Aaron Taylor Johnson and Taylor Kitsch. When their girl- Ophelia played by Pretty Little Lire's sexy Blake Lively gets kidnapped for their pot growing business by a Baja Drug Cartel, they get the odds to the evens. It may sound stupid but this is effective acting by Lado played by the one and only  Bencio Del Toro and Elena played by Salma Hayek. Both actors are what that makes up Savages. Also Johnson gives a fine performance as Ben. In the end you are hallucinated by this thriller and the deep score that adds up to a fine masterpiece by Oliver Stone."
    },
    {
      "rating": "9",
      "text": "Oliver Stone is back in ruthless form in this in-depth exploration of the war on drugs, drug dealing, and the inner workings of Mexican drug cartels. As a viewer who has seen his previous work, I wondered if some of the influence of the Iraq/Afghanistan war veteran character was a reflection of Oliver Stone's Platoon and his own experiences in the vietnam war. The torture scenes echo the brutality of that earlier film, and push the limits of grotesquery. But nothing is over the top. As someone who has read articles and studied the war on drugs, everything in this film is realistic. The performances are amazing, a surprising Travolta is electrifying. This is his best work since Pulp Fiction. Del Toro once again humanizes a horrific and unique character and Hayek holds her own. The younger leads, Kitsch and Johnson are also exceptional, at times I found myself forgetting they were acting on screen. The only downside to this film was Blake Lively, who seems to be acting like less of a bimbo-airhead-california blonde and instead just acting like her normal self. Her skills aren't really up to par but that's not to say it wasn't an adequate job, but in a film with powerhouse performances from Travolta and Del Toro, it is noticeable. Overall, the film was an exceptional thrill ride and exploration of the war on drugs. It's got Stone's subtle metaphors and hints and the \"surprise\" ending is one of the best endings I've seen in years. A warning, though - the film is exceptionally violent and ruthless. Savage, actually."
    },
    {
      "rating": "6",
      "text": "In his reversion to graphic, unrelenting brutality and incendiary sensationalism--elements found in his frenetically charged \"Natural Born Killers\"--Oliver Stone celebrates a trio of non-heroes against the backdrop of the pot industry; everything is well, even an unconventional menage a trois, until the consequences of their homegrown operation take a pernicious turn. Mixing an overtly expressed \"Butch Cassidy and the Sundance Kid\" love triangle with a ruthless ring of drug lords, Stone creates a flashy- meets-filthy-mess of a spectacle sure to satisfy fans of the summer caper, while too, alotting time on the soap box, pushing a political agenda--though not excessively--all while capturing the idiocy of current legislation. As for the characters themselves, it's the trio not mentioned that are the most effective; Del Toro, as Lado, is delightfully dark and chilling as the deranged assassin, a middle-aged, fatted, amorally disciplined Travolta is also worthy of mention, as he renders his best performance in years, delineating the greatly desperate family man, and arguably most entertaining of all is Hayek, the svelte Cleopatra-esque boss who avoids falling into camp thanks to her dexterous handle on the moral complexities that come from maintaining the facade of power on the outside with the melancholy ruefulness she holds privately behind closed doors. She nails the balance, and does so passionately. Though many will find \"Savages\" to be far too violent, and unwarrantably so, others voicing opposition in relation to its conclusion, all should be joyed to see Stone in his regular form: dauntless and headstrong. This, however, is not without noting the undeniable mess he creates and craftily \"cleans up;\" let's not deny, love him or hate him, Stone is one of the best in the business in that regard. At times taking the audience away from the film, (I'm sure I'm not the only one who was frustrated by Lively's intermittent narrative) \"Savages\" doesn't always immerse, as by the end of it all, one might question why they should care about the three uninterestingly woeful friends (Klitsch, Johnson, Lively). Further, \"Savages,\" is energetic and entertaining, no question, but the closer the eye examines Stone's cunning skill for deception, and what lies beneath the elaborately stylish skirt he loftily casts, the more familiar this summer caper looks--the only difference being--this one has an eye for fashion."
    },
    {
      "rating": "0",
      "text": "I kept waiting for it to get better. It doesn't... it gets worse. The final ending really sinks it. Could they make the female character more whiny? She is someone you can't identify with and yet they continue to have her narrate. This is an art film with mainstream violence thrown in to make it sell."
    },
    {
      "rating": "8",
      "text": "Savages is a brutal, bloody mess and thats what makes it so entertaining. Benicio Del Toro is incredible as Lado, and delivers the best scenes of the whole movie. The ending was a bit strange and I wasn't the biggest fan of the \"real\" ending, but that was my only real problem. The plot is good, the acting mostly great and the Mexican Cartel torture scenes are pretty f'ed up."
    },
    {
      "rating": "6",
      "text": "Overall the movie was more good than bad.  It achieved goal #1 of any movie: be entertaining.  The story was a little slow to start, but once it got in the swing of things I was very interested to see what would happen next.  The cast was good for the most part, but the story didn't really give much room for character development outside of maybe Salma Hayek's character.  It had a very stylish look to it, and the vibrant colors gave it a trippy feel, which worked well considering the subject matter.  Despite this, there were two things that really annoyed me about this movie, and that was Blake Lively's multiple  voiceovers, and the horrible ending."
    },
    {
      "rating": "3",
      "text": "Caught up by one-too-many obstacles and loses sight of quality filmmaking. The premise is also vague--taking numerous turns, creating an unbelievable and indistinct piece of film."
    },
    {
      "rating": "3",
      "text": "I reviewed the movie \"Savages\" and find it rather disturbing and somewhat confusing to watch at times. At a few scenes my eyes had wandered off. The movie starts off with two young men, one  that I could remember tended the University of Harvard, and his course of study was in Biology. What a waste of time, because he did not do anything with that education, but grow lousy cannabis.That was such a waste of time tending such a prestigious college, who does not accept just anyone. The other guy is so prone to violence and utter rage he takes his bad temper out on others, which is the real reason his friend does not do the dirty work in their operation. Both men are operating an illegal cannabis organization. The Harvard college/ Biology major not have a mean and violent streak, but his simple minded friend sure does. Besides the confusing explosive scenes, and shootouts, and car chases all rolled up into one motion picture, I do not see the real point this film. But the real action happens when Mr Harvard biology major's and Mr. angry guy's girlfriend is abducted, and held as a hostage. The two men are dating the same woman. How the heck does that happen? They did get into an illegal business, mixed up with maybe another competing drug cartel, which I am sure, that is the main reason the girlfriend  was abducted. The  main man in charge don't want any competition messing with his business. And so the dope man taken something that belongs to them, since they are taking away the most important business he has in his life. And to top it all off, they got involved with a crooked FBI agent played by John Travolta, who's also got his hands full with the same cartel, and now he is really involved in the abduction of this woman, and is trying to call the cards of her survival. That so ridiculous!. Mr. dop man in total charge holds the girl hostage and tortures her. I do not know why the girl is so important to abduct and torture, because she's dating them both, and she's not either of their girlfriend. All I see in this movie is a lot of shootings, a few explosive scenes, violence, abduction, torture and bullying.  The movie does not take you anywhere, well not me, not to the main point anyway. But all and all it is still better than wasting your money on \"That's MY BOY\"!"
    },
    {
      "rating": "6",
      "text": "Benecio Del Toro's performance as Lado was \"Savages\" primary saving grace. The brief time the film does devote to familiarizing the audience with the protagonists only generates feelings of aversion. All of the 'good guys' are part of a peculiar, domestic love triangle that consists of two men (Ben and Chon) and a woman (Ophelia). Ben comes off as a naive, Pseudo-Buddhist stoner; Chon comes off as a bitter, depraved Veteran; and Ophelia comes off as a bland, irritating bimbo with an undeserved sense of entitlement.  In a scene shortly after her capture, 'O' is shown complaining to Hayek, the leader of the cartel, about not being given healthier food such as a salad. Pretty sure if I just almost had my fingers cut off after being captured by a Mexican drug cartel that would not be my priority. We won't even get into"
    },
    {
      "rating": "1",
      "text": "The intent of Savages is to make a case for the legalization of marijuana.  That's all well and good.  But ideas should never trump narrative.  Similiar to horror films, Savages has one-dimensional characters making moronic decisions because the plot needs them to.  The events following the setup require Ben to be naive and Chon to be suicidal.  Ben and Chon are guilty of hubris, and O pays the price.  But if only there were a reason to care what happens to O.  The problem here is that Savages is asking us to care about O because she's in trouble, rather than making us care about her first, and putting her in danger second.  The film's third act treats the audience with disdain, twice over.  You'll be lied to, and then cheated.  Some payoff, eh?  Full review on my blog."
    },
    {
      "rating": "9",
      "text": "\"Savages\" was a very entertaining piece of work that i enjoyed from the moment it started all the way to the trip out ending! i had read the book right before i went to see the movie, which gave me a better appreciation for the story and characters. I suggest you go out and see this bloody, thrill ride because its one of the better and story-driven movies to come out this year."
    },
    {
      "rating": "9",
      "text": "If you liked The Town last year, you'll like this. It's the same perfect blend of tone: Action, melodrama, and humor. These are the kind of movies that hollywood action should be. It felt like a whole season of Breaking Bad, but with a great director and huge budget. SEE THIS.... I will buy it on DVD."
    },
    {
      "rating": "0",
      "text": "Wargasms? Are you kidding me man? I had to turn this film off. It's trying far too hard to be cool. Not gritty at all. Over the top in the extreme with the music, editing, even to the point of glamorizing the violence.  Not a good idea to have a woman shot in the head followed by some cool music with a bunch of gangsters strutting along looking all bad!ass. This film might be trying to say something good, who knows. I just couldn't hack the style. Ok so Scarface is over the top, but it had atmosphere, mood, and it was intense, The violence was necessary but not gratuitous for the sake of it."
    },
    {
      "rating": "3",
      "text": "Take away the violence, mostly gratuitous, the sex scenes, a lot of needless voice over and this 2 hour and 10 minute movie would be an hour shorter and faster. Oliver Stone is out to prove that all people are evil, in other words savages, and in his directing appears to be the most savage of all.\r The story takes place in Laguna Beach plus other areas of Southern California and North Mexico, with some beautiful shots of the Laguna Beach coast. The film goes out to the desert for stunning vistas but people and gunfire keep on messing it up. It as if Oliver Stone is trying to make up for all the violence he couldn"
    },
    {
      "rating": "7",
      "text": "It's a wild ride of a movie with a bit of a cheat ending. Selma Hayek clearly steals the show, and she exposes Blake Lively as a relative lightweight.  In fact, if I had to point to a single true negative about this film, it's Lively - or the director's focus on her. It would be like focusing on a cotton ball that rolls across the floor when there are so many other interesting elements to the story.  It's strange to say it, but Lively is actually a pretty solid actress, given a good role.  She's certainly better in Gossip Girl.  But the \"look at me! I'm sexy! Everyone wants to have sex with me!\" crap that this film serves up for her is just repellant."
    },
    {
      "rating": "4",
      "text": "The movie was a fine effort by the director and the actors but the subject matter was sick, really dark....the most likable character was a corrupt DEA agent. Maybe a little too close to reality is the problem. Another scary commentary on society."
    },
    {
      "rating": "6",
      "text": "Two great performances by Selma and Benicio as really bad guys.  They seem to have a great deal of fun with their parts.  It's hard to care at all about the good guys, whose story is convoluted and not all that interesting.  Blake Lively is hot, but her character thinks she is smarter than she is.  Basically, the bad guys are really interesting and sadistic and the good guys are a little boring (one is an annoying tree hugger; the other is a vicious Iraqi vet),  There is a buried legalization of weed story.  But this is mostly about the implied torture porn angle.  The bad guys make the movie entertaining.  It is not as preachy and pedantic as Oliver Stone movies tend to be.  Though, the movie would have been way better with more interesting protagonists."
    },
    {
      "rating": "7",
      "text": "Oliver Stone applies his distinctive directorial style to a by-the-numbers drug plot. Two men (Taylor Kitsch  & Aaron Johnson) are ying-yang partners in a pot enterprise: one is a hot-blooded vet and the other is the Buddhist business head. The only real twist: they share a girlfriend. Their lucrative business is challenged by a Mexican cartel that results in kidnapping, deception, murder and more. While there's nothing original here, Stone has given the film a muscular force that propels the action. There are a few violent or gruesome moments and some of his signature flashy flourishes, but nothing to make this film standout. The ending (which I hated) feels like it was tacked on after focus groups. But overall, it's brassy and full of fun performances."
    },
    {
      "rating": "8",
      "text": "This is just what the doctor ordered. A movie with an easy to understans story that has the momentum of a 1,000,000 ton train moving at 1,000,000 mph. It's a combination of modern filmaking and 70's pretentiousness. And that's great. This destroyed my theater made blues. Awesome."
    },
    {
      "rating": "7",
      "text": "This was a very great movie all the way up to the frustrating ending. The acting was better than expected. Benicio Del Toro was fregen awesome and Blake Lively was hot, what more can you ask? Haha, but really the story was perfectly written with a engaging script and a perfect cast. This movie was suspenseful, it was funny, it was gruesome and in the end its exactly what you want in a film, great entertainment. If you don't like gruesome scenes or alot of smoking and drugs than stay away, but if you can deal with those and love a great story and a hell of an entertaining film with action, story and the whole nine yards then you'll love Savages, the only reason it isn't a 10 is because the ending bothered the crap out of me, theres nothing more frustrating than a movie ending with a good scene and then there like \"but that isn't what really happened\", and then it rewinds and gives you a different ending. It's frustrating and annoying, and it was definitely worth me negating 3 points. 7/10"
    },
    {
      "rating": "6",
      "text": "Brutal, bloody, and ruthless.   Savages was worth the rent, however it lacked the realism that makes most movies in the crime drama genre great.  Blake Lively's( \"O\") over the top stoner got annoying after about 15 minutes of the movie----which made it more aggravating that  her character was the narrator.   Still other performances, especially Del Toro, picked up the movie.   That being said I came out with that feeling of not knowing whether or not I truly liked it.  It was nothing compared to Ted Demme and Johnny Depp's \"Blow\"."
    },
    {
      "rating": "7",
      "text": "Surprisingly good effort from director Oliver Stone, in a territory that his fellow peers Martin Scorcesse is famous for: the crime drama.  The younger casts are quite good, while both Hayek and Del Toro again showed us their acting chops. Typical of this genre, there's the usual ultra violence and gore.  Too bad the ending felt tacked on. Otherwise, a pretty good crime flick."
    },
    {
      "rating": "7",
      "text": "This was a good movie but it was nowhere near the type of movie the previews led on. The trailers made it seem like almost a Taken style of movie but with a love triangle and drugs. Instead, it was a much slower style film. The acting was great and the politics and plot development was solid but I just was expecting a different vibe."
    },
    {
      "rating": "7",
      "text": "We've all seen our share of epic films that are based on the Italian Mafia, but few have done one that is based on the Mexican cartels. Additionally, this story is told from the prospected of a group outside the organization, bullied into working with the cartel. It's no secret that Ben & Chon (Kitsch/Taylor-Johnson) make the best weed in California. Everyone knows that their stuff is the stuff you want, including the Baja Cartel. The cartel go to the pair and make them a very profitable offer, but weary of getting into business with the ruthless organization, Ben & Chon turn them down, but when has the Cartel ever taken no for an answer? I very much dislike Oliver Stone. His films, especially his historical ones, are filled with conspiracy theory and inaccuracies, that people take as fact, and contribute to the ignorance of society. I gave Savages a shot however, because it is based on a novel, and we all know that films that were originally books are the best. Savages is every bit as ruthless and action packed as you'd expect it to be and beyond that it is loaded with star power. As for the story, it is what you'd come to expect from an Oliver Stone film, filled with unexpected twists and turns, but finally in a way that doesn't confuse the audience! Typically Stone's films go over the top and back around again, until no one knows what's going on, but this time, (perhaps the novels influence) the story is never hard to follow, just unpredictable, which is what you want! The filmmakers also so how manage to avoid the problem of too many cooks in the kitchen, despite the enormous cast, something I very much appreciated. The bottom line, Savages isn't Goodfellas or Casino, it isn't even close, but is a rare look inside the business of the cartels. I love how it's told from an outside perspective and that the main star power actually takes a step back for newcomers like Taylor Kitsch and Aaron Taylor-Johnson. Some parts of this film are brutal and it is quite long, especially the unrated version, but in my opinion, well worth your time."
    },
    {
      "rating": "7",
      "text": "\"Savages\" was a pretty entertaining violent drug cartel tale. I may be alone in stating that the all-star cast detracted from the tale because it lent a saccharin celebrity-fest tone to it. Again alone here, but I didn't like Salma Hayak in that role, she doesn't come across as ruthless, at all, she's too feminine and dainty, totally miscast. That role, along with most others, should've gone to up and coming unknowns to give them a breakout film. I supposed Oliver Stone wanted his A-list buddies in it, so it's tainted for his personal choices. Otherwise, the storyline and pacing are good and you get several perspectives on savages throughout with an ironic twist just before credits roll."
    },
    {
      "rating": "7",
      "text": "Quite frankly, I am at  loss for words. Not because the film didn't deliver enough content to speak of. Surely, enough people get shot, blown up, stabbed, beat senseless, raped, smacked around, set on fire, flagellated, and even spat on the face, to just mention a few. It's just that I feel completely unaffected.\rA case could be made for the fact that in modern times violence has become daily bread in all media, and also having watched way too many movies at this point, I might have grown numb to all this violence. But then I think back to movies like Black Swan, or TV shows like Breaking Bad, where I definitely feel something. And it's not that I am making a case of those films being better than this one. It's just that I am at a loss for words, and I am not used to experiencing this in an Oliver Stone film.\rI am a big fan of this director's work. Not just his efforts commanding a picture, but also his writing, and most projects he's produced. I can count a large percentage of the Stone trademark holding a spot in my list of favorites.\rPerhaps it was the actors involved. No doubt they are fantastic to look at. But their performances, again, I am at a loss for words. However professional were their deliveries, I'm pretty sure any other competent dramatist could have done no less.\rNow, I'm sure some of you out there are saying, \"Hey! how about Benicio!? He was great...\" Yes. He was. But he was doing Benicio as Benicio does Benicio. So it's already built in in the expectation. I thought the idea was to give your fans something to be surprised by. You know, like Salma Hayek's performance. Now, there's some acting with balls. The problem is that she is the only strong delivery in the entire film, and no war is won by a single soldier.\rWhich brings me to that narration by Blake Lively... Wow... I don't think we needed so much of it. The visuals gave plenty. Specially when she sounds like she is reading off a teleprompter. No heart into the words whatsoever. Next time. Just keep her in a bikini instead of kidnapped in a corner in a full dress. Get your money's worth when you are hiring a super hot lady.\rThe plot was clearly intertwined with some skill. And, in fact, I noticed no less than three writers took credit on that script. They really had a go at it. It's just that, well, I'm at a loss for words... Maybe they should have called in that fourth writer to give us a better version of something we have seen fifty five times by now.\rBy all means, go watch the film. You will probably like it. Contrary to what you might think reading these words, I did enjoy it. It is fun and will help you kill two hours plus with no problem. Just don't expect to remember it next week, or maybe even by tomorrow."
    },
    {
      "rating": "10",
      "text": "This is not a great movie at all. Benicio del Toro is the only great acting in the movie. The story is weak and the acting bad. Not even worth watching unless you are very sadistic :P Very disappointing, specially for an Oliver Stone movie."
    },
    {
      "rating": "5",
      "text": "This is a very different movie from Mr.Stone, it differs a lot from his usual patriotic films like Born On The Fourth Of July. It's a darker film and it gives solid performances from a well casted film. But the ending wasn't really my taste"
    },
    {
      "rating": "5",
      "text": "Stone sets up a interesting plot but then takes it absolutely nowhere. Once O is kidnapped, the story moves nowhere. I have never seen \"dangerous \"drug cartels\" where the leader goes on her own to meet or where her daughter is basically unprotected. How more unrealistic could this be! Travolta character was typical. An important player but no major development in the story. The story just was not plausible and it really dragged out. Also, why did it take over two hours to tell? I like a good long movie but this story could have been told in one hour at the max. The other thing that keeps disturbing me is the substitution of good story telling with graphic violence. Violence can add to a movie but it seems to be the focus too many times now. Another disappointing night out at the cinema."
    },
    {
      "rating": "5",
      "text": "when I saw the trailer for this film was one of the ones I get excited to see in 2012, and I saw the 2/3 of the movie seemed good but not magnificent or memorable, compared to masterpieces like Traffic. But the end ..... blessed end! I dare say that between the 3 worse end was I seen in my **** life, that  way to **** a movie."
    },
    {
      "rating": "5",
      "text": "There was too much violence for me - some of it gratuitous violence. But I guess with news stories of the drug-related killing in Mexico, it must be realistic. Sad to see that this is reality. Good acting by the principals."
    },
    {
      "rating": "8",
      "text": "I don't know what to say. It was a captivating movie, with the most brutal scene I've ever seen on a commercial film. It kept my attention and focus from frame one till the end -- which folks should be debating, and about which I would love to hear from Stone. IF you can take a very dark movie, this is one of the best of that genre."
    },
    {
      "rating": "8",
      "text": "Every time Oliver Stone comes to the big screen, the nostalgic thought comes to mind, (Wall Street), which is a great made film, and (Platoon) which won stone his first oscar win for best director. With a fantastic resume, Can Savages live up to the expectations of previous stone films? Chon, played by (Taylor Kitsch) is part of a drug rising and selling business with his best friend Ben (Aaron Johnson). Together, they have an empire of marijuana. Also, in their empire, they are both in love with O (Blake Lively, who plays a true slut, Haha). Mexican Cartel leader Elena, played by the ever so beautiful, (Selma Hayek), who plays a very passionate cartel leader, who when seeing her on screen, you know she has complete power. Elena wants to work with Chon and Ben, and use their knowledge of the drug business to make one huge profit. Along the way we are introduced to Lado (Benicio Del Toro), who steals every single scene in the movie with such a charismatic style, and Dennis performed by (John Travolta), who personally I"
    },
    {
      "rating": "8",
      "text": "This movie has a good premise and starts off very good.  It maintains its intensity throughout the movie until the last 1/2 hour, then it falls apart.  I would have rated it higher if they had some reasonable ending.  Overall the acting is good.  Plenty of action and great scenery."
    },
    {
      "rating": "8",
      "text": "This was one of the best movies I've seen. Salma Hayek was absolutely beautiful and she played her role very well. Everyone in this movie was wonderful."
    },
    {
      "rating": "10",
      "text": "Just saw Savages. Wow. I am in love with this movie. Everything about that movie was just great. The music was perfect, the the story was fun, fresh and original and the casting was BRILLIANT. Let's start with that. First of all, I cannot believe that this is the same Aaron Johnson that we saw in Kick-Ass. He looks so much more mature and he acts it to. And then there is Taylor Kitsch. Taylor Kitsch has had an AMAZING year so far. Well at least in my eyes... I thought John Carter was easily one of the best movies of the year and Battleship, while far from perfect, was still a lot of fun. What really sucks is that both of those movies tanked in the eyes of studio executives and unfortunately they will look at it as Taylor Kitsch's fault since he was the lead in both. That is really really unfortunate because Savages just once again shows me how much I love this guy as an actor. The rest of the cast is just brilliant as well. Blake Lively was great, John Travolta was amazing and oh my god where Benecio Del Toro and the stunning Salma Hayek both genius. Those to where seriously phenomenal.\r What makes the actors so great was that they had amazing characters to play. I loved all of the characters in this movie, especially some of the minor ones. None of them felt like throwaway characters who where there just to serve up a plot detail. They all felt real and they where all so very interesting.\r Besides the brilliant acting and extremely fun story was the fact that this movie just had a great style to it and the music really helps to add to that to. You can see this movies style in the fantastic promotional materials this movies been putting out. That poster? One of my favorite posters of the year. And the trailer was great to because it really did a great job of not spoiling anything because there are a lot of places that the story goes that I just wasn't expecting.\r All in all, if you liked what you saw in the trailer then you will love the movie. It's so much fun. My only two problems where A) it got a little hard trying to figure out who was who in the epic finale and B) I wasn't really digging the whole super zoomed in look the movie had throughout most of it. But that may have been because I was sitting down closer to the screen than usual because the theater was sold out. Which is good because this movie deserves to do well."
    },
    {
      "rating": "7",
      "text": "my roomate's step-mother brought in $15301 last month. she has been making cash on the computer and moved in a $482100 condo. All she did was get fortunate and put into work the information given on this web NuttyRich.com"
    },
    {
      "rating": "7",
      "text": "While Savages could have been a little more than what it was, it's still a fine piece of film-making. Some may find the violence distasteful, but the performances are what keeps the film going along."
    },
    {
      "rating": "7",
      "text": "A nasty, gory piece of entertainment. It's a lot of fun seeing how low-lives and scum stab each other in the back, side and front. Fine acting and cinematography too, with just some close-ups being too long and unnecessary. I had a problem sympathising with the leads, which I found to be a bit boring. Salma Hayek has the more interesting role. Two problems are more serious: The movie does not find it's own tone between sexy hippie story and hardcore gangster drama (which makes it about 15 minutes to long too). And the ending sucks! Otherwise a darkly good time (B)."
    },
    {
      "rating": "6",
      "text": "They remove Blake Lively's greatest asset by having her narrate. The villains make the movie while the ending nearly ruins it. A mixed bag if there ever was one, but it's entertaining."
    },
    {
      "rating": "3",
      "text": "Savages, a film by Oliver Stone, tends to be so over the top, you begin to wonder how the actors all keep a straight face. This is a film that's cheese ball, but doesn't know it's cheese ball. Those are the worst kinds of movies."
    },
    {
      "rating": "5",
      "text": "A return to form for Stone's dark side,\"Wall Street: Money Never Sleeps\" and \"World Trade Center\" were almost insultingly faceless, a definite problem for a director whose best films exude righteous anger. \"Savages\" generates ruthless energy, a battle between good and evil, except that everyone in it is evil, and the momentum generated by the savagery doesn't compensate for a lack-luster storyline.\rCalifornia dudes Ben and Chon (Aaron Johnson and Taylor Kitsch) are dragged into a turf war with the expansion-minded Mexican cartel run by Salma Hayek's drug-war widow Elena, and her brutally amoral deputy, Lado (Benicio del Toro). The Mexicans regularly show their power by creating and disseminating videos documenting torture and lots and lots of beheadings. Eighty miles over the border, in Laguna Beach, Ben and Chon supply their ultra-potent, genetically engineered strains to legal medical dispensaries but make their real money illegally shipping out of state. The product and its profits fuel the boys' lifestyle of neo-hippie decadence, embodied by the business partners' enthusiastic bedroom sharing of poor little rich girl turned eco-friendly, hippie Ophelia (Blake Lively). Both sides consider the other to be \"savages\"-which we know because they say it aloud repeatedly just in case we didn't catch it already.\rMexican Baja Cartel decides to move in and demands that the trio partners with them. When the merciless head of the BC, Elena, and her brutal enforcer, Lado, underestimate the unbreakable bond among these three friends, Ben and Chon--with the reluctant, slippery assistance of a dirty DEA agent (John Travolta), wage a seemingly unwinnable war against the cartel. And so begins a series of increasingly vicious ploys and maneuvers in a high stakes, savage battle of wills. Honestly, not that bad but not that good either, resulting in complete indifference on this one. A talented cast that doesn't feel fully utilized and a story that's not all that compelling. Soul is something \"Savages\" lacks and feels hollow, not least because Kitsch and Johnson, who take on lead roles, register as blanks on-screen. In contrast, Hayek and del Toro, both sporting apparently intentionally terrible wigs, give over-the-top performances who command our interest while committing heinous acts, and setting a record for number of beheadings in a single film."
    },
    {
      "rating": "0",
      "text": "Another comic book extrusion by Ollie Stone.  The \"violence\" was so contrived, and the characters so manufactured, that it seemed about as real as an elementary school play, with little kids and plastic swords. Blake Lively as the hot babe?  She's way over the hill.  John Travolta again?  Won't he ever go away, and do us the favor of keeping his bloated, cross-eyed, ferret-like mincing persona out of our collective view?  And Salma Hayek with the Uma Thurman wig straight out of Pulp Fiction (a similar failed exercise in Hollywood cool-ness).  How derivative can you get?  I will say though that the movie got better after the 4th glass of wine."
    },
    {
      "rating": "0",
      "text": "Too much exaggeration and commercialism. All the love-making and inhumane treatment of human bodies did not support the main point of the movie or at least, make up for the lack of real action. The kind of action is like throwing grenades and shooting big guns..nothing that requires too much skill (the way a real action film is suppose to be). This movie tried too hard to be sexy, scary, and hardcore."
    },
    {
      "rating": "2",
      "text": "This film is horrendous and I was very surprised when I read the director was Oliver Stone. The worst part of it is, of course, the plot: trite and dull, where the only new thing we haven't already seen a million times is the double ending, which is an utter mess, so much so that I don't even want to write about it.\r The acting is laughable, with the exception of Benicio del Toro who is, as usual, great in this simple-minded, one-way character he was given."
    },
    {
      "rating": "8",
      "text": "Oliver Stone has done a great job with this film. From the beginning to the end I was thoroughly entertained, particularly with Benico Del Toro.\r Ignore anyone who comments on the story being racist. They're seeing something which conflicts with their views and react negatively to protect themselves (Cognitive dissonance). It's just a film and shows both sides can be good and bad.\r It must be said the love triangle you'll witness is very believeable too. Whilst some may think this is odd or strange within their world and context it is plausible. Very progressive for a mainstream hollywood film!\r I highly recommend this to anyone. My friends went into it thinking it was going to be crap and left quite satisfied. Sit back and enjoy!"
    },
    {
      "rating": "7",
      "text": "A fun stylish action film, Savages is a lot of fun.  It's good to see Oliver Stone making a strong action movie again.  The only thing that made this film an 8 was a weak ending."
    }
  ]
}