{
  "id": 1599,
  "title": "Saving Private Ryan",
  "starring": [
    "Tom Hanks",
    "Tom Sizemore"
  ],
  "runtime": 169,
  "genre": [
    "Drama",
    "History",
    "War"
  ],
  "description": "As U.S. troops storm the beaches of Normandy, three brothers lie dead on the battlefield, with a fourth trapped behind enemy lines. Ranger captain John Miller and seven men are tasked with penetrating German-held territory and bringing the boy home.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1wY4psJ5NVEhCuOYROwLH2XExM2.jpg",
  "categories": {
    "plot": 9.625,
    "acting": 9.564102564102564,
    "ending": 10.0,
    "soundtrack": 9.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 9.555555555555555
  },
  "reviews": [
    {
      "rating": "9",
      "text": "One of the most realistic WW2 movies, \"Saving Private Ryan\" has everything; a powerhouse cast, smart action, deep character depth, and a poignant sacrifice."
    },
    {
      "rating": "10",
      "text": "A very high quality, which blends extreme action, with a underlying sadness for the disaster that was world war 2. All put together with superb casting."
    },
    {
      "rating": "10",
      "text": "after this film I felt, I saved the ryan. because after first scene of this film, I was a soldier of this crew. No need to say about film scenes, you live together with this film."
    },
    {
      "rating": "10",
      "text": "Masterpiece"
    },
    {
      "rating": "9",
      "text": "Phenomenal film. While extremely graphic, it is nice to see a war film that does not sugarcoat anything  and this certainly does not sugarcoat a thing. It's tragic, tormenting, and a mixture of being impersonal and personal, all of the things it should be. Ultimately, it is hard to think of how a war film could be done better."
    },
    {
      "rating": "10",
      "text": "Another masterpiece from Steven Spielberg! He shows the true face war, humanity and veterans! Amazing acting, superb story and great soundtrack from John Williams makes this movie a MUST WATCH!"
    },
    {
      "rating": "9",
      "text": "What a masterpiece. The depiction of fighting in World War II is incredible to watch and feels very realistic. The set decoration is amazing and with Tom Cruise as lead actor it is tough to go wrong here. However, the movie is almost three hours and does drag on a bit but it has many really terrific scenes. This is a must see and I give it an 89.9 out of 100."
    },
    {
      "rating": "9",
      "text": "Totalmente y simplemente una buena pelicula, las cosas que buscan varios directores que espesializan en este tema son sorprendidos por el gran director Steven Spielberg quien saca esta produccion al estrellato del exito."
    },
    {
      "rating": "10",
      "text": "Perfect War movie.The first 27 minutes are no less than real. It has everything from emotions to acting.\rGreat direction by critically acclaimed Steven Spielberg and superb acting by Tom Hanks aka Capt. John H. Miller."
    },
    {
      "rating": "10",
      "text": "One of the greatest movies ever put to film. A must watch for anyone who can stomach the realistic and gruesome battle scenes. The acting, special effects, and cinematography are amazing."
    },
    {
      "rating": "10",
      "text": "There is not one dull moment in this film. Saving Private Ryan will keep you hooked until the very end, its paced very well and the characters are done well. One of the greatest war movies I have ever seen."
    },
    {
      "rating": "10",
      "text": "One of Spielberg's greatest movies! The script is amazing and the the acting is great, also one of Tom Hanks' greatest movies. The violence, action and tragedy in the movie really bring out the realism of the war. I would certainly recommend this movie to anyone that can handle some graphic, painful, bloody action."
    },
    {
      "rating": "9",
      "text": "A true work of art and masterpiece in every sense of the word. Maybe it's just because I'm a fan but I don't think I'm being biased when I say that this is one of the greatest motion pictures in the history of the cinema. The only thing that prevents me from giving it a perfect rating is because I feel the graphic detail of violence, however realistic and brutal reminder of how horrific war can be, leaves no room for imagination. But other than that this is an exceptional film."
    },
    {
      "rating": "8",
      "text": "Spielberg at his best, this film has great acting and visuals, a high degree of realism and moving story."
    },
    {
      "rating": "9",
      "text": "Raised with a strong performance from Tom Hanks and the entire cast. A Spielberg movie brings firmness to realism and redefines the war genre    ."
    },
    {
      "rating": "9",
      "text": "This movie was amazing. Hanks was spectacular and Speilberg did a absolutely amazing job directing. The movie was horrid and hard to watch which makes it an effective war movie. It also pulls at your heart strings in just the right way. Couldn't ask for more."
    },
    {
      "rating": "10",
      "text": "One of the most powerful war movies out there, Saving will hit you with such an emotion for the characters that it feels like you're in their shoes, in that battle zone, fighting for your life. Tom Hanks is at his best in this movie, and Matt Damon is perfect as Private Ryan. If you don't want to watch all of the movie, at least see the first beach scene. It will change your view of... well, everything. It will make you glad to be alive."
    },
    {
      "rating": "10",
      "text": "This film blows me away completely. Awesome! It brings the brutality of war to the small screen so that everyone can feel exactly what those soldiers felt in the Great Second World War. Spielberg and Hanks are the best, for sure"
    },
    {
      "rating": "10",
      "text": "Saving Private Ryan was such an amazing movie. This definitely would have won the Academy's Best Picture Award if Shakespeare in Love wasn't an option."
    },
    {
      "rating": "10",
      "text": "Probably the best(with Full metal jacket) war movie ever made.Realistic action scenes,credible actors and awesome script.This movie has everything you ever wanted in a war movie."
    },
    {
      "rating": "9",
      "text": "\"Saving Private Ryan\" is a realistic war film that proves itself to be worthy of its own genre, thanks to richly directed performances and tension setup."
    },
    {
      "rating": "10",
      "text": "Devastating. If, for some reason, I was asked to write a one-word review of Saving Private Ryan, that would be the term I would use. As was true of director Steven Spielberg's other masterpiece, Schindler's List, the impact of this motion picture must be experienced; it cannot be adequately described. No film since last year's The Sweet Hereafter has left such a searing and indelible imprint on my mind and soul. This movie did not need to be released at the end of the year to be considered for a flood of Oscar nominations; it's so forceful that no one who sees it will be able to forget it -- not even Academy members with two-month memory spans.\r Saving Private Ryan opens with a 30-minute cinematic tour de force that is without a doubt one of the finest half-hours ever committed to film. This sequence, a soldier's-eye view of the D-Day invasion of Normandy, is brilliant not only in terms of technique but in the depth of viewer reaction it generates. It is certainly the most violent, gory, visceral depiction of war that I have ever witnessed on screen. Spielberg spares the viewer nothing of the horrors of battle, using every tactic at his disposal to convey the chaos and senseless waste that lies at the core of any engagement. We are presented with unforgettable, bloody images of bodies being cut to pieces by bullets, limbs blown off, entrails spilling out, and a variety of other assorted examples of carnage. And, when the tide comes in with the waves breaking on the body-strewn beach, the water is crimson. Those who are at all squeamish will find the opening of Saving Private Ryan unbearable. This aspect of the film almost earned it an NC-17 rating; only the fact that Spielberg rigorously avoids even a hint of exploitation convinced the MPAA to award an R.\r In addition to showing what happens when projectiles rip into the soft flesh of the human body, the director employs other methods to capture the essence of battle - hand-held cameras, a slight speeding up of the images, muted colors, and several different kinds of film stock. Put it all together, and it adds up to a dizzying, exhausting assault on the senses. As good as the rest of Saving Private Ryan is, and it's very good, the D-Day attack on Omaha Beach is the sequence that everyone will remember most clearly.\r Most World War II movies fall into one of two categories: heroic tales of glory and valor or biopics (my all-time favorite film, Patton, falls in the latter camp). Saving Private Ryan is neither. Instead, it's a condemnation of war wrapped in a tale of human courage and sacrifice. In many ways, the picture painted by this movie is more grim than the one Oliver Stone presented in Platoon, which has often been cited as the most daring anti-war film to come out of Hollywood. Saving Private Ryan quickly and brutally dispels the notion that war is anything but vicious, demoralizing violence that makes a cruel joke out of the human body and spirit. Although the film is only loosely based on a true incident, it's hard not to accept these characters and events as real.\r With Saving Private Ryan set alongside Schindler's List, Steven Spielberg, once known as a purveyor of well-crafted-but-lightweight feel-good fare, has given us two of the decade's most gripping, disturbing, and powerful motion pictures. I consider Schindler's List to be one of the most amazing movies I have ever experienced, and, in many ways, Saving Private Ryan is its equal. Although both films take place during the same time period, they focus on different ideas. Schindler's List personifies good (Schindler) and evil (Amon Goeth), and plays out the struggle against a tragic backdrop. In Saving Private Ryan, there are no human villains, and the enemy isn't so much the Germans as it is the implacable, destructive specter of war. The film's central question (When is one life more important than another?) is never really answered. For those who are willing to brave the movie's shocking and unforgettable images, Saving Private Ryan offers a singular motion picture experience. I will be surprised if another film tops it for the best of 1998."
    },
    {
      "rating": "8",
      "text": "This is definitely one of the more powerful war films out there, if not the most powerful. I will admit, when I first saw it at school, I found the first half-hour extremely upsetting to watch.The acting is outstanding. Especially from Tom Hanks and Matt Damon, and the music alongside Schindler's List is John William's most haunting score I've heard.It does drag in the middle and the dialogue doesn't always flow as well as it should, but what we have is a historically accurate, extremely well made and directed and unashamedly brutal film. I mean, in the stabbing scene, towards the end, my English teacher had to leave the room. It was like watching Frankenstein's monster tearing out Elizabeth's heart.8.5/10 for a truly emotional and appropriately sombre war-film, that is a little slow at times. But it deserves to be in the top 250, really it is that good! Bethany Cox"
    },
    {
      "rating": "10",
      "text": "There's nothing to say about Saving Private Ryan except for the fact that it's arguably the greatest war movie ever made. The movie excels at capturing the sacrifices which soldiers made, as well as the extreme violence which took place during the brutal conflict that was World War II."
    },
    {
      "rating": "10",
      "text": "Saving Private Ryan is the best war movie ever made and one of the best in general in the movie history.This movie is very realistic and shows how the war is very ugly and there's nothing heroic about it.It shows the sufferings of the characters and the way they deal with certain real situations.It is also perfectly shot and directed,as Spielberg did an incredible job here.Even the hand held camera work is believable and it takes it to a whole new level of realism.It truly gets ugly,with deaths all over the place and by the end you are very invested on some of the characters,especially the main one played by the awesome Tom Hanks,Captain Miller.This characters is so well developed and interesting that it makes you root for him all the way through,and that is a great thing.The effects are really good and realistic,as everything else in the movie,and also the movie does change directions a couple of times,but each time is a smart change and an interesting one.The actors do an amazing job here,besides Tom Hanks,there's also Tom Sizemore who impressed me so much,and I loved him on the role.Matt Damon is also very good,and so is every single one else.This movie succeeds at every level and everything it was going for,it is a near perfect movie with realistic portrayal of the war and its ugliness.I really love this movie,it is one of my all time favorites"
    },
    {
      "rating": "10",
      "text": "One of the best Tom Hank must-see movie. The best movie about war on the western front of World War II"
    },
    {
      "rating": "8",
      "text": "Probably the best realistic war film of all time. \"Saving Private Ryan\" reflects all the themes that war deals with, and it really focuses on the bonds between soldiers. The visuals are creditable, and the story had powerful emotional stakes."
    },
    {
      "rating": "10",
      "text": "I don't wanna spoiler you mist see this movie its awesome directed by one of the best directors of all time"
    },
    {
      "rating": "10",
      "text": "An intensely personal and intimate film, bold, difficult to watch but not artless. Less of a movie and more of a parable, a reminder of heroism and an experience and an exercise in empathy for a new generation when it came out and today. What struck me immediately with the 4K transfer, besides the vivid colours of fire and blood, and those incredible and soulful close-ups, is how the documentary style of the film is still often so present and immediate and fresh. It revivifies the themes and the meaning of the film all over again and a perfect promotion for what upgrading the quality of films can do for them. This too happened with Apocalypse, Now: Final Cut. Saving Private Ryan is a film constructed to say so much with so little, the characters of the film follow the same rule, effortlessly watchable with no one painted with broad strokes and left, like comrades, with their depth and uniqueness just bubbling beneath the surface. The aural soundscape is second to none, overwhelmingly impressive and immersive. There’s nothing sadistic about this film and yet it is brutal and pulls no punches. It’s a warm hearted warning about war and a subtle and unstuffy character study about men at war."
    },
    {
      "rating": "10",
      "text": "A masterpiece of war movies, one of If not the best war movie ever made...."
    },
    {
      "rating": "9",
      "text": "I love this movie so much that I re-watch it every month its one of the few movies thats actually made me cry especially during Wades Death"
    },
    {
      "rating": "9",
      "text": "Masterpiece , all that people must watch this movie!so realistic ww2 scenes."
    },
    {
      "rating": "10",
      "text": "This movie does everything its set out to do. Nothing short of a masterpiece. I give all the side role characters just as much credit as Hanks for there performance. For the few that cant be open minded enough to see just how brilliant this film captures the feels and reality of the time and the place in which these events actually happened all i can say is maybe this movie just wasn't for you."
    },
    {
      "rating": "10",
      "text": "Best WW2 War movie. You realize how horrible D day is...I can say I really cried in some scenes"
    },
    {
      "rating": "10",
      "text": "i saw it last year and i just watch it again, fully recommended as a war film"
    },
    {
      "rating": "10",
      "text": "One of the best movies of all time, not just war movies!!! If you haven't seen it watch it, if you have, watch it again!!"
    },
    {
      "rating": "10",
      "text": "There is no war movie so powerful, so special, so amazing, so impactful, so long but incredible, than 2 hours and 50 minutes of Spielberg's Saving Private Ryan, it's not like watching a movie, it's like watching a real war with an amazing camera work that always follow the soldier wherever they go, we are like one of them but we can't do anything besides watching them in pain and die, Spielberg's did it again, making another Masterpiece."
    },
    {
      "rating": "10",
      "text": "Saving Private Ryan: When you have Steven Spielberg directing, John Williams doing the score and Tom Hanks staring what could go wrong the answer nothing. I really can’t explain the way this movie make me feel, everything has weight in it, if these people can’t save Ryan then their screwed. Everything about it is amazing the cast, everyone does a fantastic job obviously Tom Hanks is the standout. I have never seen Tom actually be in a really serious role, I mean in Green Mile he was still serious but still was a light hearted character but in this he’s full on more serious then I’ve ever seen. The score it’s John Williams obviously it’s amazing. Overall just go and watch this movie please. Ranking Masterpiece"
    },
    {
      "rating": "9",
      "text": "this is one of the best war movie there is. Tom Hanks was good for the role he played, everyone else did their best like he did. I love how emotional the movie gets as well. One of my favorites."
    },
    {
      "rating": "10",
      "text": "Although I'm a history buff and love good war movies, there have been very few decent ones during the last 15 years.  Saving Private Ryan is not only a masterpiece in every regard, it's arguably the best war film of all time."
    },
    {
      "rating": "9",
      "text": "I believe that Saving Private Ryan is one of the more accurate portrayal of WWII in film history. It has a stellar cast, incredibly deep character depth (you know, characters that you'll actually care about), and a surprisingly poignant story."
    },
    {
      "rating": "10",
      "text": "In middle school some friends and I would have movie night every week. As we watched this particular film I began to cry. I was overwhelmed by the sacrifice these characters were making in an attempt to rescue a solitary soldier. I felt strange crying in front of my friends, but I realized in that moment that great cinema evokes great emotion. Our favorite movies make us feel poignantly. This was the first film to make me feel something so powerful that it caused me to shed tears."
    },
    {
      "rating": "10",
      "text": "Greatest war movie I have ever seen. It is powerful, moving and keeps you wanting to watch more. Tom Hanks' and Matt Damon's acting is very good and every one of the characters are deep and you feel like you emphasize with them and understand them. Some scenes bend the laws of physics, but it doesn't make any difference. This movie is not for the faint-hearted as it contains some incredibly gory scenes reminiscent on Saw. Awesome film and should stay on every shelf in every house."
    },
    {
      "rating": "9",
      "text": "Saving Private Ryan was one of the most powerful, intense movie experiences I have had in the cinema. I originally watched this movie in the cinema while sitting next to a WW2 veteran - his reactions were very interesting. Its a great movie with great acting, setting and props and characters to care about. Perhaps its only downside is some of the over done action in the second half. Must See Movie."
    },
    {
      "rating": "10",
      "text": "This movie blew my mind, I watched it in 2003 when I was 13, because I was being rebellious and went against what my mom told me to do. I was so mesmerized by how well it was made, that I became what people eould call these days, an \"overly obsessive teen\". I focused my teenage life on this movie, and at my grad I quoted it when I was chosen for  Valedictorian. This movie was amazing. That's all I have to say."
    },
    {
      "rating": "9",
      "text": "Watching this movie drew me in and shook me to the very core with a gritty, realistic and bloody vision of WWII that makes you think \"was it justified?\". I usually think that Spielberg's earlier Schindlers List was superior, but seeing this for the first time has changed my outlook completely. One minor complaint is that too many parts of it feel like a full on action movie that could be viewed as disrespectful to the veterans. All in all, a cinematic experience that isn't afraid to shock."
    },
    {
      "rating": "10",
      "text": "Saving Private Ryan is an amazing movie, it is also the best war movie I have ever seen. The plot is gripping and keeps you enthralled while the characters all work together to deliver a star-studded performance that amazes. Saving Private Ryan defty blens the action and emotion into a package that is thrilling, a place where other movies tend to fail. There are virtually zero faults in this movie maybe except for very obscure missteps but so obscure that you must pay attention to see them. Overall Saving Private Ryan is a great movie that I recommend everyone watch, even if you are not into war movies you will still love this movie for it's characterization for it will also change your expectations for war movies forever. Breakdown for Saving Private Ryan: Presentation: 9.5, Plot: 9.7, Acting: 10, Script: 10, Lasting Appeal: 9.6. Overall Score: 9.6 out of 10 \"Amazing\"."
    },
    {
      "rating": "10",
      "text": "The film opens with an old man collapsing to his knees under the weight of the guilt of having survived all those years ago.  We see it in his tear-filled eyes and hear it in his trembling voice... This scene has the power to move me like virtually no scene in cinema history.  The rest of the film is both terrifying and beautiful but it's those quiet moments of raw human emotion that Spielberg captures perfectly and makes Saving Private Ryan one of my top ten all-time favorites.  A truly unforgettable experience."
    },
    {
      "rating": "10",
      "text": "Probably one of my favourite movies of all time. As you can see by my username, I'm a huge Tom Hanks fan, and this is probably one of his best performances, besides Forrest Gump. He plays an amazing role as a Captain John H. Miller, who gathers seven men to look for Private James Francis Ryan and to bring him home. Great story, nice effects, way ahead of its time, great acting too. On top of that, Tom Hanks is the greatest actor known to man. All of his movies are good, Forrest Gump, Saving Private Ryan, The Green Mile, Cast Away, The Terminal, The Polar Express, Toy Story, Apollo 13, the list just goes on"
    },
    {
      "rating": "10",
      "text": "Saving Private Ryan has to be an all time favourite for everyone who likes war films. I personally enjoyed the movie because of its gripping action scenes and the very moving storyline which shows the bond between soldiers who have been tasked with a near-suicidal mission. Just simply amazing."
    }
  ],
  "recommendations": [
    "hacksaw_ridge",
    "the_deer_hunter",
    "platoon",
    "braveheart",
    "gladiator",
    "black_hawk_down",
    "unbroken",
    "the_patriot",
    "empire_of_the_sun",
    "apocalypse_now",
    "troy",
    "war_for_the_planet_of_the_apes",
    "cold_mountain",
    "hotel_rwanda",
    "raging_bull",
    "dunkirk",
    "deepwater_horizon",
    "the_thin_red_line",
    "full_metal_jacket",
    "master_and_commander_the_far_side_of_the_world",
    "1917",
    "american_history_x",
    "avengers_endgame",
    "we_were_soldiers",
    "black_widow"
  ]
}