{
  "id": 884,
  "title": "Saw III",
  "starring": [
    "Tobin Bell",
    "Shawnee Smith"
  ],
  "runtime": 114,
  "genre": [
    "Horror",
    "Thriller",
    "Crime"
  ],
  "description": "Jigsaw has disappeared. Along with his new apprentice Amanda, the puppet-master behind the cruel, intricate games that have terrified a community and baffled police has once again eluded capture and vanished. While city detective scrambles to locate him, Doctor Lynn Denlon and Jeff Reinhart are unaware that they are about to become the latest pawns on his vicious chessboard.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wvdsqBqFrAcUvp9VNdhQkmgBhL5.jpg",
  "categories": {
    "plot": 5.9,
    "acting": 4.866666666666666,
    "ending": 5.222222222222222,
    "soundtrack": 7.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 2.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It's Amanda's story and is really pretty brilliant and heartbreaking. It's the best of the three."
    },
    {
      "rating": "8",
      "text": "Saw 3 is easily the best Saw movie in the triology. For once, the acting is way better than the first two, especially the first one. Saw 3 shows how sick and messed up Jigsaw is but yet it shows his reason behind things and how he gives people a chance to survive the games rather than just torture. It also shows the downfall of Amanda and how no one can be Jigsaw. The movie is much more \"dark\" than the other two and I like that. It has its twists, although the other two, in my opinion, had better twists. But, Saw 3 has better plot and character development, and of course, it has blood, tons of it."
    },
    {
      "rating": "6",
      "text": "The only reason it deserves six points from me is because Saw III did good job iin explaining the whole background of its previous ones. Just like the first two, it has a shocking plot twist/ gruesome scenes. nevertheless, b/c the plot twist was kinda expected and there were simply TOO MUCH blood in my opinion. If you are a hardcore/semi-hardcore saw fan, this should be on your must-see list for it explains the previous stories also."
    },
    {
      "rating": "6",
      "text": "Not quite as good as saw 1 but better then saw 2."
    },
    {
      "rating": "9",
      "text": "Woo! Awesome fella. Better than the previous one. Still a little shallow and too incomplete. But the deaths are quite favorable to my preference. The ending really breaks my heart though."
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■÷%÷%÷%÷÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "9",
      "text": "Ok Saw II was pretty crap, Saw III however goes back to what made the original great. It begins to continue the story of detective Matthews but then loses itself in an even bigger story, someone is copying the Jigsaw killings but giving their victims no hope of escape. With Jigsaw on his death bed dying of a brain tumour and his apprentice Amanda being a pretty stubborn **** a doctor and her husband must play their own games to earn back their lives. Though the plot is pretty crappy the traps are nice and finally some good gore rather than the **** few litres of blood we have been used to over the past couple of years. Intestines, brains and even some mulched up pigs are thrown into the line up with the most disgusting Saw yet."
    },
    {
      "rating": "6",
      "text": "Surprisingly despite the gruesome cinematography and a cynically unexplained plot, \"Saw 3\" bests the its other 2 prequels by focusing deeply into character depth. Although the depth is shallow, at least they tried."
    },
    {
      "rating": "9",
      "text": "A nightmarish film but yet so good at its plot it is sensitively awesome. And seeing Jigsaw finally getting killed was a important part in the Saw trilogy. Definitely a must watch for die-hard Saw fans like me."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "0",
      "text": "This movie is just a whole bunch of people dying in rediculously painful ways with no way of escape. There is no story, there is no way to live. Jigsaw is possibly the dumbest character ever created. He hates murderers yet he puts people in a position where theres a 99% chance of dying. The people in the traps are usually no better. They are aggressive and stupid and can't figure out how to get around the most basic traps. This movie is a complete waste of time unless you enjoy bloodlust."
    },
    {
      "rating": "0",
      "text": "Why would anybody find pleasure in this sick and boring fest of unnessacary gore and unresulting terror. This movie may be grim, but it is not scary. It is simply a brillant load of garbage. Worst flop of 2006. Well of course its #1 in the box office for the first week but so was grudge 2 and that fell apart after three seconds."
    },
    {
      "rating": "1",
      "text": "Just like the first two, a waste of time and money. Will surley dissapoint horror fans and there craving of gore. If saw 4 wants to get serious, i say go for the NC17."
    },
    {
      "rating": "4",
      "text": "Stylish and impressive, but that's only for a horror movie. It achives cheap scares through old tricks and new gore but really leaves you dissapointed at the end. Lets hope 4,5 and 6 are better than the first three. My ratings for the movies thus far: Saw -7.1 Saw ||- 3.4 Saw |||- 3.9. The first was the best because it played with real character development and showed plot twists while achiving low-budget but brillant scares and always keeping you intrested with good acting. The second was only there for the purpose of money and proved to be a complete waste of time: Watching people brutally suffer for pleasure while showing no real plot and just making the viewer sligtly disturbed with ketchup gore. The Third: A girl takes control of the killing making it more fun. But the unorginal scares and copy-cat script makes the movie dull and uneffective. The gore is real but not revolutionary and the acting is all together dreadful.  The Saws, in general, suck."
    },
    {
      "rating": "4",
      "text": "Nowhere near as good as the first two. The end twist was and dual storylines were good but the two hot babes working as the doctor and psycho assistant was too much of a stretch. Saw got a little too Hollywood compared to the first two."
    },
    {
      "rating": "2",
      "text": "Filth. Rubbish. Muck. Drab. Bad. Pointless. Unnecessary. Redundant. Hollow."
    },
    {
      "rating": "6",
      "text": "Gorier than the first two combined, Saw 3 officially labels the series as torture porn. Despite the more emotional path it takes, this instalment has little else to offer asides more smart twists and well-elaborated tortures, which wouldâ"
    },
    {
      "rating": "5",
      "text": "This movie is alright, it is too long- I thought Jigsaw died in the second movie.  I mean- it's gory and disgusting, this movie needs to be shorter, i saw the unrated cut, it was too long"
    },
    {
      "rating": "5",
      "text": "This is probably the most \"human\" of the Saw films. You're actually allowed to get under the characters' skin this time round, and given time to care for the sympathetic protagonists, a melancholic surgeon (Bahar Soomekh) kidnapped to care for the dying John Kramer, and a grieving father (Angus Macfadyen) who is forced by Kramer to confront those responsible for the death of his young son. Tobin Bell is still great as Jigsaw, and steals the show despite being bedridden throughout the film, but it is Jigsaw's apprentice Amanda (Shawnee Smith) who is actually more terrifying than her mentor. Without Jigsaw's strict (if misguided) moral code, she's more like a rabid dog than a calculated killer with purpose, and actually seems to relish the misery she puts others through on her master's orders. There are some particularly nasty and inventive traps, the best of which unusually for a \"torture porn\" film actually doesn't involve bodily destruction, but instead rancid pig carcasses are turned into slurry and dumped on the victim. The film is generally quite engaging and keeps your interest until the final act which well and truly begins to ramble and comes across as rather preachy. The now traditional Saw \"twist\" doesn't come as a surprise either, making me miss the ingenuity of the first installment's spectacular ending. Saw III is far better than Saw II because it's written by series masterminds Leigh Wannell and James Wan, and only directed by Darren Lynn Bousman (one of the failures of the second film was that Bousman wrote and directed, and he is far less talented as a screenwriter than he is behind the camera) and so the film feels more connected to the first film than any other in the series. That said, the message of the franchise (if there is one) has well and truly been lost by this point, and the third film brings very few new ideas to the table. You can appreciate Saw III for decent writing, good performances and a certain perverse joy in death in cruel and unusual ways, but the twisted novelty of the series is beginning to wear off, showing a glimpse of the ugly truth at its heart. Perhaps they should have ended Jigsaw's blood-soaked saga here, but as well we know, box office returns can be ever so persuasive..."
    },
    {
      "rating": "3",
      "text": "This film is why I stopped watching the SAW franchise. Not only do we get a lot more of the same tired brutal murder scenes, we also have a long exposition at the end of the movie to explain that the killer had been watched the whole time, which again shows the brutal death scenes compiled."
    },
    {
      "rating": "2",
      "text": "I admit that Jigsaw is a pretty great villain, but the fact he can't save the movie from being an overload of scary clichés makes him want to stop playing the Jigsaw game and end the entire franchise all together."
    },
    {
      "rating": "2",
      "text": "Oh god part 3? Who wanted this? It's just the same thing! Some different traps, characters who have one personality, and an awful story. And there are more sequels."
    },
    {
      "rating": "4",
      "text": "Starting to go downhill. Interesting enough of a story...but I think this is where everything in the series starts to get confusing."
    },
    {
      "rating": "5",
      "text": "Saw 3 is a bit the opposite of Saw 2. Not much is happening here. Although it's happening, it's not exactly the best. I would compare the whole film to Star Wars: Episode II, which was mainly about Anakin's relationship with Padmé and it was one of the worst parts for me. Unfortunately, this is the same problem and it is mostly a relationship that I don't really know if I can call a relationship. But I won't spoiler. In addition, we have other characters, which are significantly less than the two. This is not a bad thing at all, but unfortunately I found it uninteresting and did not even reach the knees of the previous ones. The whole film seemed so useless to me and even the final resolution didn't save it much, which was good, but lags behind the previous ones. Unfortunately, this is an average film that I do not recommend."
    },
    {
      "rating": "5",
      "text": "New games follows the father of a boy killed in a car accident getting the chance to kill/spare the people who caused the accident but by making the wrong choices, ends up killing his wife."
    },
    {
      "rating": "6",
      "text": "The story continued well and offered more blood and gore. It was cleverly made and the ending finished the trilogy off as well as you could expect. The twists were good. I found that the twisted killing was not as painful to watch as in the previous films. I never jumped and in fact found the first half of the movie jumped around too much without anything happening. You have to watch the first two films before you can watch this one. It is worth watching the trilogy as they are all good."
    },
    {
      "rating": "9",
      "text": "Saw 3 builds on the foundations of the two previous installments of the series, and to that it should take credit. It follows almost flawlessly from the story of the previous movie, seamlessly integrating the unique themes, storyline and motives. Writers Leigh Whannell and James Wan, who co-wrote the first two installments, create a fresh new atmosphere, heavily influenced with the token horror mystery thriller genre that leaves audiences suspended on the edge of their seats. Although not for the faint-hearted, and admittedly a little disturbing, the visual effects provide an appealing complement to the plot."
    },
    {
      "rating": "0",
      "text": "This movie was very disgraceful. I mean, does Mr. Jigsaw over there say anything but \"its all a test\"? There is no plot what so ever. All it is, is a bunch of people being tortured in contraptions that they have a 0% chance in surviving."
    },
    {
      "rating": "8",
      "text": "A great film, but not as good as the first 2. The movie has more blood and gore than the first 2 which is good. I recommend you go see it, if you're a fan."
    },
    {
      "rating": "1",
      "text": "Boring and dumb. Bad acting, bad dialogue, lame deaths. Last ten minutes are the only good scenes."
    },
    {
      "rating": "8",
      "text": "A cut above the rest and just enough around the edges to cause white knuckle grip. This flick is predictable mayhem and wholsale carnage, but thats just what our customers paid to see. A classic \"B\" sreamer!! A Thanksgiving Day must watch!!"
    },
    {
      "rating": "10",
      "text": "Incredible, a reality horror film, good end, good begining, a good movie."
    },
    {
      "rating": "1",
      "text": "Too much gore, too little scares."
    },
    {
      "rating": "9",
      "text": "SAW is still the best horror franchise out there and while 2nd and 3rd films are weaker than original, at least this one has a rather different direction (Though more like SAW2)."
    },
    {
      "rating": "9",
      "text": "Although some of the scenes were quite out-played and over done. It was, in my opinion, the best movie since \"The Lobsterman From Mars\" or \"Killer Klowns From Outer Space.\""
    },
    {
      "rating": "7",
      "text": "Saw III is annoying in two main ways -- these may or may not bother you, so take this with a grain of salt. Firstly, the storyline does not become apparent until exactly one full hour has passed. I was hoping for some originality here, and it didn't deliver. The entire first hour of the movie was a long, drawn out mess that basically rehashed the Saw I and II formula. Secondly, the ENTIRE MOVIE is on steroids, shot as if it is a music video. Cameras are zipping here, zipping there, flashing back, etc. On TV, this may not be an issue. But on the damn big screens, where their horrible resolution for motion shots (you MUST know what I mean -- everything blurs!), you may find yourself annoyed as hell. The violence and gore was good, but come on! Hasn't every horror movie lately been a blood-soaked mess? The MPAA has been asleep, and when a bunch of underage kids are whipping popcorn around and yelling, you know the rating system doesn't work anymore. Do you really want to go see a movie on the basis of gore anymore?"
    },
    {
      "rating": "10",
      "text": "This movie was excellent. I loved the blood and the sadistic games of Jigsaw. Everybody who thinks the movie was too awful are typically Britney Spears roadmovie fans."
    },
    {
      "rating": "9",
      "text": "First of all, the Saw movies are not really meant to be scary in my opinion. They are popcorn movies that you will talk about for days after viewing, either good or bad. This flick definitetly accomplished that for me. It wraps up a lot of the holes I had forgotten about from the first two, and makes the series better as a result. It is a fun, no nonsense, bloody and squirm inducing good time. Just watch it and have fun!"
    },
    {
      "rating": "2",
      "text": "Saw has always been flawed. Jigsaw's \"reasoning\" is like the Nazis pleading innocent at the Nuremberg Trials based on the fact that some of their prisoners, the ones who actually \"tried,\" survived. Ridiculous, I know. But it isn't until Saw III that it gets really annoying as Jigsaw preaches more than the first two movies combined and the pointless body count just increases. Unlike Saw II, however, which was just gross and boring this second sequel is at least laughably bad. The last fifteen minutes of the movie is literally a flashback montage which ridiculously shows things that literally happened ten seconds ago in the movie. I don't know about other people, but i couldn't stop laughing during this."
    },
    {
      "rating": "3",
      "text": "Saw 1 was a good movie with a great ending. Saw 2 was a terrible movie with a decent ending. Saw 3 is just plain terrible. The reasoning behind this movie, in particular, makes me question whether the writers truly had no idea where to go with it. I found the movie tedious and frustrating to watch, and the ending \"twist\" was laughable. I was so disappointed with this movie after several people told me it was the best in the series."
    },
    {
      "rating": "0",
      "text": "There was no point in this movie at all.The first movie was very good, the 2nd movie was just ok. But this one just takes the cake its so BAD!!!! Its like they did this movie with their eyes closed. They should have at least made the ending much better."
    },
    {
      "rating": "9",
      "text": "Awesome!! This movie was for sure better then the first as it explained the entire trilogy. Also I love the testing of Amanda it was a great twist with great games and great horrors."
    },
    {
      "rating": "9",
      "text": "Although it does not live up to the much anticipated release- it captures many storylines from first two in series, it does the series justice and I am eagerly awaiting a SAW4 in Oct if it comes to be."
    },
    {
      "rating": "6",
      "text": "The first 15 minutes were among the MOST DISTURBING MINUTES I've ever spent watching a movie. I almost turned off the movie! That being said, I enjoyed it. Not as good as the first one...but sequels never are. I have it on DVD now, and I will never watch it again. That was too graphic, even for me. But, it's a \"puzzle piece\"--please forgive the pun--that needed to be in the saga. I'm almost afraid of watching Saw 4 this Halloween"
    },
    {
      "rating": "7",
      "text": "I think it was a good movie. It wasn't better than the first (mainly because the first ending was so original and unexpected). It was definitely better than the second though. The bad part about it is that the Jigsaw killer kept giving away the ending of the movie, and it was made very apparent who was actually benig \"tested\" due to all of the emotions that character was portraying (she was the worst actor in the movie to me as well). Visually, it was definitely a cut above the rest, I am an avid horror film spectator and never, I mean NEVER feel like anything is too graphic to endure. This movie definitely made me cringe, especially in the opening sequence. For those who say there was no story line, what movie were you watching? There is definitely a story line, which is fairly decent (not great or spectacular), at least until the very end. Anyone who thought differently is being waaaayy too critical, because the plot was actually well drawn out. The very final test was the most ridiculous lead-in to the sequel they have ever come up with, and will result in disaster if they try to formulate it into a Saw 4. But the rest of the movie was enjoyable and interesting at least. Don't watch this movie expecting it to be a true horror movie, because it is actually more of a Drama. And if you go into it expecting it to be better than the first, you will definitely be dissapointed. If you rent or buy the movie and watch it with a fresh prospective (and an open mind), you may actually enjoy it."
    },
    {
      "rating": "10",
      "text": "It makes you think! existentialism."
    },
    {
      "rating": "9",
      "text": "Although \"Saw III\" is even less scary than its prequels, it retains the unique mood and attitude of the series while boasting the best story yet. The level of gore has been raised considerably, which is actually a positive characteristic - it maintains a series trademark in a film that otherwise could have easily been shown on the Lifetime channel. For its ability to mix an important message with an extreme level of gore and a surprising ending, \"Saw III\" is the best \"Saw\" by far."
    },
    {
      "rating": "0",
      "text": "Morally repugnant, sadistic and pointless unless you kick your kicks watching people being tortured physically and mentally. If you do then you should probably join Al-Queda."
    },
    {
      "rating": "5",
      "text": "Very disappointed.I liked Saw and loved Saw II but this one was terrible."
    },
    {
      "rating": "1",
      "text": "Awful, awful, awful. Perhaps the worst movie I have ever seen. Are we supposed to care about any of the characters? The plot and dialogue could have been developed by a middle-school drama club. The acting is atrocious, but the script is likely responsible for most of that. And the horror is simply gratuitous torture. I guess I'm giving it a \"1\" because I'm sure a worse movie will come out at some point... or perhaps not."
    }
  ],
  "recommendations": [
    "jigsaw",
    "saw_3d",
    "saw_ii",
    "saw_vi",
    "saw_iv",
    "paranormal_activity_4",
    "saw",
    "the_final_destination",
    "final_destination_2",
    "rings",
    "would_you_rather",
    "spiral_from_the_book_of_saw",
    "the_last_house_on_the_left",
    "saw_v",
    "the_devil_inside",
    "the_grudge_2",
    "the_collection",
    "hostel_part_ii",
    "the_hills_have_eyes",
    "malignant",
    "texas_chainsaw_3d",
    "devil",
    "brightburn",
    "the_strangers",
    "paranormal_activity_the_marked_ones"
  ]
}