{"id": 1618, "title": "Saw VI", "starring": ["Tobin Bell", "Costas Mandylor"], "runtime": 90, "genre": ["Horror", "Mystery"], "description": "Special Agent Strahm is dead, and Detective Hoffman has emerged as the unchallenged successor to Jigsaw's legacy. However, when the FBI draws closer to Hoffman, he is forced to set a game into motion, and Jigsaw's grand scheme is finally understood.", "releaseYear": "2009", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/9fFI57FuE9X4pUCIiKZZZCB7caK.jpg", "categories": {"plot": 6.4, "acting": 6.333333333333333, "ending": 6.3076923076923075, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.0, "action": 8.0}, "reviews": [{"rating": "6", "text": "A definite improvement over the last, Saw VI equalizes gore and heart, and although I feel horribly disgusted with myself after the credits roll, my 90 minutes were thoroughly and persistently entertained."}, {"rating": "10", "text": "This is an amazing film. While they are dragging the series on, this is a great movie. It answers a lot of questions from previous installments as well as an amazing storyline that takes a stab at the failing healthcare system."}, {"rating": "8", "text": "People bash the series as it continues to go on, they judge it based on its pieces, without seeing the whole thing. If one piece (movie) isn't what they wanted or expected, they give up on it, and they have no idea what they are missing!"}, {"rating": "5", "text": "I expected \"Saw 6\" as my final Saw movie. Turns out the movie is better than its prequel; it has the theme of blood, gore, horror, a appropriate (but still Cliched) plot twist, and redemption. Bravo Mr. Greutert!"}, {"rating": "6", "text": "Now, this was unexpected. I didn't expect \"Saw VI\" to be a big step up from the previous two. It's true though. The plot made some sense and had some decent twists. The acting can easily be seen as wooden in some places and the story does have some holes, but what more can you expect after watching two previous movies that are twice as worse?"}, {"rating": "1", "text": "\"Do you want to play a game\". No thanks Jigsaw I`ll pass.Gets a \"1\" because you can re-use the DVD as a coaster.Metacritic actually insists that I write more about this movie, even though I don't want to. There is actually nothing else to say about it. Apart from that there should be a ban on releasing sequels that take a franchise beyond a trilogy. I`m all for artistic expression, but the ideas in this film were artistically expressed enough long ago. And really, if you can't tell a story in three films maybe it would be better off as a book."}, {"rating": "6", "text": "the traps in the previous movies were even more gorier than the first three and people were like paying attention watching those trap scenes. anyway, Saw VI wasn't excellent, but its so good it is also grisly."}, {"rating": "6", "text": "It was ok. The acting was decent and the traps no longer relied on just violence but they actually meant something to the person who was being tested. Sadly though the entire plot is just a poor take on a real issue and it doesnt fit well in the Saw world. Its a decent addition to the franchise but nothing really special about it."}, {"rating": "0", "text": "stupid scary too bloody movie -.- , this is even worse than the final destnation that is even the same people don't want these goddamit awful movies  ,...... All things considered, this was the worst Saw movie yet"}, {"rating": "9", "text": "This is by far one of the best in the Saw series, the plot is awesome, my only complaints are that Hoffman isn't as enjoyable as John was, and the ending was a little confusing, but it's by far one of the best Saw movies so far."}, {"rating": "6", "text": "The whole franchise is an endless merry-go-round- a detective is found alive, kidnapped by Jigsaw, and put into another one is sick, twisted but fun as hell to watch games.There's nothing wrong about that, it's just when you continue to make installment's to a fran, your supposed to make them more exciting,fresh and still fun-not increasingly dull."}, {"rating": "3", "text": "Eh it was ok. While Tobin Bell once again shined in the parts that he was in, The acting (besides him) was pretty average. The traps were lame and not that interesting, The film wasnt scary at all. It was pretty generic if you ask me and it was a poor take on a realistic issue. Really disapointing overall."}, {"rating": "5", "text": "Solid acting through out. The plot was a terrible take on a real life issue and while it was interesting to see how it would be handled in Jigsaw's world, It was simply poorly executed. The traps werent made for shock value (something I liked), They were made to truely test the man who was being tested (He was a higher up in a medical insurance company and he constantly refused coverage/help to people who needed it, His actions resulted in the death of a man who had coverage but he used a loophole in the coverage to get out of paying for his treatment and the man ended up dying). It was a decent horror film at best though."}, {"rating": "3", "text": "Ugh this is still happening...and it didn't even finish here!! If the nest film isn't the last one I will hang myself, I used to love this series but now its just taking a dump and shoving it in my face. Ok so SPOILERS Hoffman is Jigsaw and that guy whose name I forget totally died at the end of the last film, now he is going after John Kramer's life insurance broker who refused to fund his potentially life saving operation or something. You know what this is **** stupid I just quit with this film series."}, {"rating": "9", "text": "And excellent penultimate movie in the Jigsaw Killer franchise. It featured a new protagonist. Hoffman's legacy, awesome traps and the best ending for any Saw movie by date. This movie should have got a higher metascore shame."}, {"rating": "6", "text": "Much improvement from the previous two. The story is better with less flashback and more concentration on a game. And the game actually makes sense this time and is also more creative. At the end I actually cared if the person lived or died which was different from Saw IV, V. However, due to it being just an average story line and similar to what we have already seen I cannot give this any better then 61.8 out of 100."}, {"rating": "6", "text": "Saw VI focuses on a story of helpfulness and revenge, so it has a meaning. Nevertheless is the movie booring after awhile and the traps can't really improve this situation."}, {"rating": "6", "text": "Okay, okay... this movie's alright. It's not the best saw movie ever made, but it's also not the worst one ever made. The acting is okay, and the traps aren't that bad. It can get a bit boring (as the fourth and fifth were), but towards the end, it'll get you at the edge of your seats. I actually didn't think it was THAT bad, but it's not that good, either. I really liked the first three."}, {"rating": "4", "text": "May I see you starting to climb a little. The film is not the same as the previous two films. Anyway, I think I have a very high expectation from a series of seven movies."}, {"rating": "7", "text": "\"Saw VI\" is a great return-to-form for the franchise. It's intense, interesting, and bloody: everything I expect from a Saw film. The overall premise of the film is somewhat strange for the Saw franchise, and it didn't feel like it fit with the rest of the films. Nevertheless, it's a great sequel, and I'm glad the series can raise from the dead.... that is until Saw 3D came out."}, {"rating": "4", "text": "As the health-care debate rages on, let it be known that Jigsaw, the sinister puppetmaster played in life and beyond by Tobin Bell, favors a robust public option. (This, in the world of political punditry, is what they call a “game-changer.”) It isn’t in character for the Saw movies to embrace topicality, but at this point, anything that can help distinguish one entry from the next counts as progress. Since the first Saw came out in 2004, Lionsgate and a limited group of artisans (the writing team of Marcus Dunstan and Patrick Melton have turned out the last three, and VI director Kevin Greutert edited all the others) have been giving audiences exactly what they expect, while keeping an eye on the company ledger. Adding a layer of social significance isn’t the worst strategy for a franchise that keeps piling on the convoluted mythos, yet hasn’t changed its risible mix of mechanized death and tongue-clucking morality. Each one plays like a very special episode of Fear Factor, or Extreme Makeover: Self-Mutilation Edition.\r Dead since the third entry, yet living on via flashbacks and one endlessly elaborate master plan, Bell’s Jigsaw entrusts the legwork to detective Costas Mandylor, who sets up the “games” his late master devises. After an entertaining prologue that pits one exploitative mortgage broker against another—more topicality!—Saw VI settles on Peter Outerbridge, a health-insurance executive who makes it his business to deny coverage to those who desperately need it. As ironic punishment, Outerbridge is forced through a timed series of trials where he must make those same life-or-death decisions for a selection of carefully chosen victims. Meanwhile, there’s some muddled intrigue involving Jigsaw, his wife, his past and current disciples, and a box he left behind.\r Because Saw does nothing to alter the look, tone, and engineered gimmickry from one movie to the next, it keeps going deeper into backstory and character arcs than horror series past, as if this ugly, cheap-looking schlock were somehow The Lord Of The Rings. Even the implements of death are recycled: An acid bath, a power saw, and the signature “reverse bear trap” all make appearances, along with your favorite gears, bolts, and fluttering florescent lights. And clearly, the filmmakers have taken no graft from health-insurance lobbyists, so there’s a soupçon of integrity to the mindless bludgeoning, too."}, {"rating": "2", "text": "Will the Saw franchise end? Not with this one, but we'll know when it'll exactly get terminated so we don't have to see a bunch of (not) scary clichés all over the place anymore."}, {"rating": "5", "text": "EhThough it has some scary moments, This is still not a very fresh film however."}, {"rating": "9", "text": "Saw VI is a great film in the saw series! This healthcare plot is very intriguing and done well. These traps are also very interesting and enjoyable. Also, Rodrick from Diary of a Wimpy Kid is in this, and Devon Bostick's acting is great!"}, {"rating": "0", "text": "The acting is awful, the kills are the same, and the story...it's not a story and the twist.....feels more like a twist in my ankle more then a movie twist."}, {"rating": "4", "text": "Much better than 5, but still...why can't this series just die already? And they need to stop assuming we'll keep watching the rest of the series to get everything answered in the already confusing plot line."}, {"rating": "5", "text": "This sixth instalment is certainly a step up from the previous two movies, but it isn't enough to save the franchise."}, {"rating": "7", "text": "Saw Vi Is a big improvement over Saw V Saw VI is about Hoffman still being the killer Of Jigsaw William Is one of my fav characters in this movie It makes since what happened he was not giving the people the help they needed the traps are interesting nothing special tho Jill Is in this one more than Saw V Jill Is Really good also Trying to stop Hoffman But it fails sadly Hoffman has no reason to be a killer anyway My main problem with Saw IV, Saw V, and Saw VI Is Hoffman helping jigsaw makes no since So Yeah Saw VI is a lot better than Saw V I had so many problems with that movie So I give Saw VI a C-"}, {"rating": "5", "text": "All the people who denied Jigsaw medical insurance coverage for his cancer treatment are put into a game that he had obviously been planning for a long time."}, {"rating": "7", "text": "While it may not have the amount of traps and gore as the last 2 films did, this film actually has a plot that doesn't feel like filler. The traps also felt more important and more psychological, which made them better to watch and helped to keep the suspense high. Although it is the best one since 3, i doubt the series can get much better for two reasons. Jigsaw was killed three movies ago, and even though Tobin Bell gives us another great performance, his lack of a physical appearance will make the films weak when it comes to the main character. The other reason is, Hoffman isn't a very good villain. His character isn't nearly as compelling as Jigsaw's and when you look at him, its obvious he is trying to hide something. Also, its pretty strange to find a conclusion for something that happened 3 movies ago (Amanda's brown envelope) but apart from that, the plot was pretty good. Overall, its not as good as the first 3 movies but its definetly a step up from 4 and 5."}, {"rating": "7", "text": "It made me laugh a lot at some parts. The twist at the end was pretty decent. For that i give it a 7."}, {"rating": "9", "text": "A breath of fresh air to the franchise. Certainly the one where you feel bad for the victims."}, {"rating": "2", "text": "This film was abysmal. Uncreative, boring, drab...By far the worst film of the series. Saw II was better than this, and I didn't think it could get much worse than that."}, {"rating": "4", "text": "More Saw splatter with the requisite amount of gore. This time it's the evil insurance agents that get tortured by the late Jigsaw from beyond the grave."}, {"rating": "8", "text": "I don't understand why critics hate this film that much. Guess it's a love/hate thing. The saw films are exactly what they are supposed to be, and they actually contain many serious subjects. Not everybody understands them. They should have their own genre, the saw genre. I like them, and they deserve more credit than they get. Ok, some logic issues in between, but giving it 0 points is totally not serious. Tobin Bell is also an excellent actor."}, {"rating": "5", "text": "I didn't see this movie but I have to say.... t c you have no idea what you're talking about. The first Saw was BY FAR the best, and the series has gotten progressively worse with each film. 4 was so lousy, I didn't care to watch 5, which got god-awful reviews."}, {"rating": "10", "text": "I thought this movie was fantastic and is probably the second best in the series after Saw III. I will admit that Saw IV and V weren't 10 out of 10s but I still think they were pretty good because they showed alot of back story. But Saw VI fills so many plot holes. and the cliffhanger ending was a surprise to me, and it definitely leaves more room to continue the story, and I am interested to see how they do that with Saw VII and Saw VIII. The only thing that irritates me about the Saw series is that alot of people just seem to think that Jigsaw is a guy who goes around torturing/killing people for fun, but obviously those people can't pay attention or understand what the movies or the story behind the movies is about. Anyways GREAT movie, can't wait until the next one."}, {"rating": "10", "text": "seriously people just love to hate on the saw series. I dont know why people seem to bash it. I thought this was one of the best horror films of the year and the best saw movie since the first one. you people can hate on it all want but what it comes down to, you cant think of truly valid arguments, your ratings are border-lining on trolling and you are acting like a child."}, {"rating": "8", "text": "I found myself with a clenched fist over my mouth as i saw the new traps jigsaw has this go-around in the franchise. Alot of unanswered questions in the previous installments of \"Saw\" are put to rest,with jaw-gripping results. Great movie."}, {"rating": "5", "text": "By far, it's the least favorite in the franchise. Slowly each film has decayed in quality. This one had no suspense, it was very predictable. Saw is known for its twists and this one lacked that. Also, the acting was not of great quality and the \"games\" were not of the usual standing."}, {"rating": "10", "text": "WFT is everyone's beef with this series? its one of the strongest and longest running series in all of horror history. and the films keep getting better! the first saw was totally shabby and 2 wasnt much better, but by 3 they were really getting it together. 4 and 5 are borderline horror masterpieces and 6 was directed by the editor of 1-5 so it is technically incredible! get off your high horses for once."}, {"rating": "10", "text": "This movie was great, I liked how it had all of the old actors and tied the storyline together!"}, {"rating": "1", "text": "Clearly, ever since well Saw 2 the producers don't give a darn about telling a good story they only want to keep making sequels. I think we're entering the law of diminishing returns and way too many splattered brains. The shop is closed."}, {"rating": "8", "text": "Really good, the best since Saw 2. Way more than just blood and gore this time around."}, {"rating": "9", "text": "I'd never imagine that they'd be able to topple Saw II. Why I ever doubted is beyond me considering Kevin Gruetert, the new director, has been with the franchise ever since the beginning and knows the ins and outs of the series. Saw VI is quite possibly the best installment in the franchise, and for once we can relate to the people put into the traps and the traumatizing pain that the few survivors of the twisted games actually experience after their games. It all becomes better with the new protagonist, William, being given the responsibility to choose between who's life to save in the games, and the guilt that he feels when he takes someone's life in order to save another. This installment is deep, complex and adds a great ending twist along with it, and if people've ever doubted in the franchise, this installment is the perfect reason for curbing that feel. Saw has never been better."}, {"rating": "4", "text": "More Bad Than good, Saw 1-3 Great. Saw 4-6 MEDIOCRE."}, {"rating": "9", "text": "The saw series tells you right away, blood and guts with a plausible story...im deeply sorry it doesn't have a story like the academy awards winners, but it is the first horror movie with a believable story..i'd much rather see this then \"friday the 40th birthday- jason put in a nursing home\"."}, {"rating": "8", "text": "Saw VI (2009) Genre:Horror/Suspensecompare When I went into the theater, I thought Saw VI would just be a plain old \"meh\" movie, but, it was actually one of the best installments since the original in my opinion! Saw VI brings the game full circle, answering almost all questions about any about Saw III, IV, and V. The story: Saw VI begins with a grisly test, pitting two people in a fight for survival! Afterwards,Hoffman escapes the glass box from the end of V, and emerges as the unchallenged succesor of Jigsaw's legacy. While the story had twists at every corner, it did have some instances most horror movies suffer from. Such as some iffy acting and a not airtight script in some parts. Soon after the story starts to revolve around an insurance company worker named William Eastman. The plot does take a major jab at insurance companies. Plot Score: 7.7/10 The interpretation: Saw VI had again, a very good story but in some instances, could have been interpreted better by the director's. The scene at the begining, was well made. The carosuel room was phenominal,and the movie was very well made. Interpretation Score 8.5/10 The Actors: Saw VI featured familar faces from the previous chapters, such as Tobin Bell, Shawnee Smith, and Costas Mandylor. All three of those actors played their role well! While actors like Peter Outerbridge(William Eastman) and Tenedra Howard(Simon)could've been played a bit better,but they still did a great job. The actors score: 7.9/10 The Overall: Overall,Saw VI was a well made movie with the fans in mind, not just the HUGE amounts of money it's going to make. This was a very good installment and is a great movie for hardcore Saw fans and people just into the series! Overall score: 7.8/10 Great!"}, {"rating": "0", "text": "Terrible acting, zero suspense, laughable logic and the promise of another one next year. How can we get this policy canceled?"}, {"rating": "8", "text": "Great movie, but how in the hell can a man plan this out even though he's been dead for 3 movies now..."}], "recommendations": ["jigsaw", "spiral_from_the_book_of_saw", "saw_3d", "saw_iv", "saw_iii", "saw_ii", "saw_v", "the_new_mutants", "brightburn", "rings", "paranormal_activity_4", "saw", "maze_runner_the_scorch_trials", "paranormal_activity_the_marked_ones", "unfriended_dark_web", "wish_upon", "terminator_genisys", "the_twilight_saga_breaking_dawn_part_2", "would_you_rather", "i_am_number_four", "i_am_legend", "insidious_the_last_key", "the_x_files_i_want_to_believe", "the_final_destination", "the_purge_election_year"]}