{
  "id": 1537,
  "title": "Saw V",
  "starring": [
    "Tobin Bell",
    "Costas Mandylor"
  ],
  "runtime": 95,
  "genre": [
    "Horror",
    "Thriller",
    "Crime"
  ],
  "description": "Detective Hoffman is seemingly the last person alive to carry on the Jigsaw legacy. But when his secret is threatened, he must go on the hunt to eliminate all the loose ends.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dpiS8OcDaTkBdQZkkrdQPPXdJgK.jpg",
  "categories": {
    "plot": 5.611111111111111,
    "acting": 8.5,
    "ending": 7.0625,
    "soundtrack": 0.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "It was actualyl rather fine, Probably one of the best in the series. Solid acting by the cast, Traps that didnt just focus on violence but really the idea of actual vengence and paying retribution towards the wrongs that the people in the traps commited. It ended perfectly imo."
    },
    {
      "rating": "3",
      "text": "My god...I can't believe they dragged a brilliant film into a **** up franchise with exaggerated Cliches and preposterous plot twists. \"Saw 5\", a disgusting movie filled with 'gore' but no 'horror', precisely proves my statement. You have to stop your game, Jigsaw. It's not scary anymore"
    },
    {
      "rating": "10",
      "text": "great movie!"
    },
    {
      "rating": "2",
      "text": "Fails explicitly to live up to the success of the third, the franchise has now tumbled into what it was trying to avoid to be in the first place - pure, narcissistic blood-gushing torture porn. The moral of the story is now overlooked and almost neglected, and each scene is all about wanting to please the mentally-unstable gore fans."
    },
    {
      "rating": "10",
      "text": "I believe this was one of the best saw movies, it demonstrated what a human being would do in situations effectively. It has us on the edge of our seat on who will be the last man standing and sums up with an excellent twist."
    },
    {
      "rating": "5",
      "text": "Go AheadThis is just, well, a Saw movie at this point, This franchise is losing blood quick."
    },
    {
      "rating": "7",
      "text": "Damn, I was hard on this film before. I do like Saw V more than Saw IV for being easier to follow and not being cluttered with characters. There are some flaws though.This movie's trap plot doesn't connect to the cop plot that much, and it kind of feels like a subplot. Despite feeling unnecessary, I love this trap plot! These characters are very interesting, and their conversations, thinking, and reactions are wonderful! And their traps are great too, with a nice twist about having to work together, and that twist made the first trap even better.But the cop plot isn't as great imo. There's this note about someone knowing who Hoffman is, and it's kind of stupid, especially when you figure out who it is in Saw 3D. And the glass coffin ending, doesn't make that much sense to me. What was Strahm supposed to learn, what was the point of that?How about Hoffman abducts Strahm, puts him in the room, and gives him a test to either hurt himself by getting into the coffin, or close it and die? That would've actually made sense.Overall, Saw V isn't as great as some of the previous films, but I liked it, and I found it to be better than Saw IV. 7/10"
    },
    {
      "rating": "6",
      "text": "Saw V is a very boring Movie They keep going to Saw III ending it gets annoying for some reason there are making a story for that And Hoffman as the killer is just dum he as no reason Even the backstory is non-interesting I'll say the ending was decent that was it very boring movie all round So I give Saw V An D-"
    },
    {
      "rating": "3",
      "text": "A thriller/horror that does not thrill nor horrify. Dull story and you'd probably fall asleep in the middle with too much unnecessary flashbacks and not enough gore to boot."
    },
    {
      "rating": "3",
      "text": "I don' t know if anyone else noticed this in their viewing of this movie, but you could see the microphones they use to hear the actors. It was hanging down the entire movie, and the shots were always off-center. Poor production from a movie I expect a lot from. And the story was completely lost in this. They should have stopped at 3."
    },
    {
      "rating": "10",
      "text": "Classic Saw movie better then Saw 4. Storyline is awesome loved it."
    },
    {
      "rating": "10",
      "text": "This movie was so awesome. It was as good as the first and second film. I definitely recommend it to anyone who liked the previous saws. however it wasn't perfect, because they did leave some loose ends. Thats probably because of saw 6 next year! I can't wait!!!"
    },
    {
      "rating": "7",
      "text": "There has already been a lot of hate for SAW V, but I honestly think everyone needs to back off. Yes, a lot of the movie was flashbacks, but I really think that's what the fans asked for after SAW IV came out. It seems like this movie is mostly trying to make room for SAW VI, so don't expect a masterpiece. The movie goes further into Hoffman's motive and what happens after the end of SAW IV. And that's another thing. It's really impossible to like this movie if you haven't seen the previous 4 movies. Most people are ticked off that there are 'a million saws' and stuff like 'they should have stopped at 3'. SAW also has its competitor, High School Musical 3. A lot of teenage from High School Musical say stuff like 'its just watching people getting tortured, High School Musical is way better.' But SAW is really actually a very smart series that has some big plotline twists, and stuff like that. But I seriously think that a lot of people who haven't even seen the movie just assume that its 90 minutes of people getting killed. Overall, this is a great addition to a fantastic movie series with lots of scary scenes, and an AMAZING end. But DO NOT see it if you don't know anything about the rest of the series, or else throughout the movie, you'll only be wondering what is going on."
    },
    {
      "rating": "6",
      "text": "It was a decent enough film to watch if you have nothing better to do. Although there really was no twist at the end of the movie, I greatly preferred it to the fourth iteration, as it actually seemed to GO somewhere. They really didn't try for a twist in this one, which I consider to be better than trying to create one and failing miserably. As I said before, go and see it if you have nothing better to do and wish to get a glimpse into the mind of the man who was the Jigsaw Killer."
    },
    {
      "rating": "9",
      "text": "Okay, this is probably the worst case of \" The critics hate it, the audience loves it\" I've ever seen. Sure there really isnt much of a twist but overall, the movie was pretty damn good. Much better than Saw IV. I'd probably rank it either 2nd or third."
    },
    {
      "rating": "4",
      "text": "Do you honestly expect this movie to have a high rating? C'mon, it's Saw.. It's more like a cult following. Surely nobody's expecting an Oscar winning performance."
    },
    {
      "rating": "10",
      "text": "I understand that this series always gets a bad review but I personally LOVED it. This addition to the series is full of crazy twists and keeps you wondering all the way through."
    },
    {
      "rating": "0",
      "text": "Truly a waste of time and money, friend convinced me to go and see it with her, waste of time."
    },
    {
      "rating": "3",
      "text": "Personally Saw 1 2 and 3 were i thought to be a very good series alone.. Then you make saw 4?..witch wasnt as bad as i predicted.. but Saw 5.. come on now.. this serious is going down the drain just like the friday the 13th, hellraiser, and halloween series's. Saw 5 had nothing at all..even the traps are dumb.. You need only one thing to make the Saw Franchise good and thats jigsaw..but he died in saw 3.. the only reason why they keep making more saw movies is because eveybody including myself buys tickets to go see it every halloween and believe it or not when they make saw 6 next year everybodys going to see that too.. Saw is finally dead... Game over"
    },
    {
      "rating": "9",
      "text": "As a long time fan of the saw series I will not claim that any one of the individual movies is a masterpiece. Nor will I claim that the acting is great or the production values very high as well. To understand saw you have to have seen every single one. The story is full of plot twists and the 5th saw cleans up much of the confusion left by saw 3 and 4. As a whole, the series is great and has been a 5 year tradition with my friends, week before Halloween go and see the new saw movie. At the end we leave each one, disturbed, frightened and generally confused waiting next year"
    },
    {
      "rating": "10",
      "text": "Once any Horror film goes past a sequel, people automatically have a blinkered view to any of the proceeding movies. Saw was amazing and revolutionary, the rest were very good in their own right. Saw V has gone back to basics but with more emphasis on story rather than gore. This franchise can't win with some people who have made their opinion before they've even cast eyes on the movie!!!"
    },
    {
      "rating": "10",
      "text": "Cannot believe some people didn't like this! So funny! I was actually hurting, I laughed so much. Beginning to end, not one unfunny moment. Brilliant! Best Comedy I've seen!"
    },
    {
      "rating": "9",
      "text": "All of SAW sequel is not comparable to Friday the 13th or Halloween or even less Nightmare on Elm Street. This is way much better, the writers of these movies are amazing (you gotta be a bit crazy but...) I hope that they go at least up to SAW #10. Its a shame that Jigsaw is dead !!!"
    },
    {
      "rating": "7",
      "text": "Are these movies starting to get disgusting and to similar."
    },
    {
      "rating": "7",
      "text": "Saw V was not the strongest in the series or the weakest. It was more sick than any of the others. It could of been a bit better with some of the traps. At leased two or three of the traps were just pointless, Strahms head box trap was brilliant, the pendulum is my favorite out of the whole series. It was a good movie but could of been made into something great."
    },
    {
      "rating": "10",
      "text": "You Know What? To Hell with what the critics say. They have only one genre in their heads and Horror/Torture/Mystery is not any of them. SAW V was more of a clean up of the the previous 4 films and still giving us the suspense and terror as it always have. Besides, Tobin Bell has been making it look so good and you can't criticize actors who make movies draw many people's attention to keep watching. I say Critics such as THE NEW YORK TIMES can suck it cause they don't have the passion to see a film or to keep up with a story such as this. They have been breast fed too long. Keep it up James Wan and Leigh Whannel and everyone who makes these films. Don't let the critics get you. Your Fans are the Real Critics and they still stand aside with you awaiting for the next installment. ROCK ON EVERYONE ! ! ! ! ! !"
    },
    {
      "rating": "1",
      "text": "You would think that after killing the protagonist off 2 movies ago, and receiving worse and worse ratings after each movie, that Lionsgate would be done here. But Jigsaw isn't dead yet. He's never dead. As long as Lionsgate keeps pulling Jigsaw apprentices out of nowhere, kills them off, and repeats that process, Saw will continue. Saw 5 was truly a horrible movie. Production values, low. The traps, not so clever. The actors, bad. The ending, terrible. I really wouldn't even recommend this to hardcore Saw fans, which I am. I still kick myself to this day for wasting money on this horrible movie."
    },
    {
      "rating": "7",
      "text": "Knowing the prequels really made this much more enjoyable than its meta-rating!!"
    },
    {
      "rating": "9",
      "text": "I watched it yesterday and found it a wicked film, you need to watch all of them to get into it. The only part that put it slightly down is why the old man, the FBI agent was running around everywhere, when srath died anyway."
    },
    {
      "rating": "9",
      "text": "Contrary to common opinion, I actually believed that Saw V was one of the strongest entries in the series. I throughly enjoyed the film, especially the traps. While it did not really feel like a Saw film, I think that is what I liked about. The gore was not as intense as the previous two films which I prefer. The Long Haul scene is a powerful scene and was well done, only let down by some dodgy lines and questionable acting. My only main criticism is the 5 Become 1 traps, as they felt tacked on and ultimately unimportant to the story. At least the Trap House in Saw 2 had greater importance. The lack of a \"Game Over\" didn't take TOO much from the ending but it was sorely missed. But all in all, I enjoyed the film and would definately recommend a watch."
    },
    {
      "rating": "10",
      "text": "I actually really enjoyed this (I always assume the worst from sequels as usually they go downhill and die). Like Lowe said, the pieces didn't com together completely, but it doesn't really diminish the fact that there are a LOT of loose ends from previous in the series that are tied together now."
    },
    {
      "rating": "8",
      "text": "The Movies storyline was right on!!! I loved the movie, but was not to thrilled with the ending! Also it leaves you hanging on what happens with that Mrs. Tuck ladie??? Overall i think it was better then the other saws.. So yes i recommend everyone to check out this movie at least once"
    },
    {
      "rating": "7",
      "text": "good movie but with no twist!where is the ending?in the end all the pieces don't come anywhere near being put together."
    },
    {
      "rating": "2",
      "text": "Saw V. Yes indeed I saw this film, or in other words a self-mockery of what was once a pretty good movie series. This film is so repugnant and repetitive that one should feel a sense of \"I have been here before\". This series should have died after the third one. Just another reason to prove that talent in Hollywood has fallen so much. What a shame, or in this case for all you ticket buyers; what a sham!"
    },
    {
      "rating": "3",
      "text": "Zzzzz oh,it's over. Damn, I could have used a longer nap. BORING, and a waste of $11. Should have stopped after the third one."
    },
    {
      "rating": "7",
      "text": "Decent movie, especially for the die hard Saw fan but the film was way to short and half of it was flashbacks to 3-4. It had a pretty good Storyline though, expliaining Hoffman's involvement. Ending was decent although i would have chosen a differnt one. I think Saw 4 and 5 or 5 and 6 could probably be combined into one movie but where seperated for purposes of financial gain."
    },
    {
      "rating": "0",
      "text": "Danny Glover in \"Saw\", that was unexpected. Then again, after Miles Davis lended his sax to a Scritti Politti track(\"Oh, Patti(Don't Feel Sorry for Loverboy) from the album \"Provision\"), nothing could ever surprise me to quite that extent again. Davis actually went so far as to cover \"Perfect Way\"(from \"Cupid and Psyche '85); he thought Green Gartside was a musical genius. Some music critic, at the time(I think it was Rob Sheffield), called Davis' assessment about Scritti Politti's music, \"a cry for help\". Glover, on the other hand, participated in the original \"Saw\", strictly for the money. By lending his name, he gave the low-budget film some credibility, just as Donald Pleasance did in John Carpenter's \"Halloween\". Now Glover is back, sort of, as a black and white image on a 8 X 11 photograph, and a flashback. Since \"Saw\", Glover has worked with Lars Von Trier, Michel Gondry, Fernando Merilles, and John Sayles. Thanks to \"Saw\", Glover underwent a renaissance. He became relevant again(the \"Lethal Weapon\" star was also in Bill Condon's \"Dreamgirls\"). Filmmakers saw \"Saw\"; saw his cry for help, and put his talent to better use. That 8 X 11 glossy, that flashback, are probably the classiest moments in \"Saw V\". Maybe seeing the last three sequels would help me understand whatever subtleties lie in this poorly photographed, poorly acted film, but being \"Saw\"-literate still wouldn't make the \"creative\" murders any more easier to stomach."
    },
    {
      "rating": "7",
      "text": "I enjoyed it for what it was having seen the previous films. The flashbacks were a bit hectic but it told me what it needed too."
    },
    {
      "rating": "8",
      "text": "Not a masterpiece, but better than the last two and a solid, smart continuation of the franchise with gore to spare. No big twist as promised (though the final scene is freaky), but entertaining nonetheless."
    },
    {
      "rating": "0",
      "text": "The Saw 'franchise' is an example of Hollywood at its worst. Take an interesting indie film and turn it into a series of boring, identikit, brain-dead films. Saw should have never been a 'franchise'. It should have been one standalone movie. Funny how the first movie is good and all the sequels are terrible. Could that be because they're trying to pull story out of their arse and add to a film that had no more story to tell once it ended?"
    },
    {
      "rating": "1",
      "text": "The scariest part about this movie was me knowing i couldn't get a refund, The HORROR!!!!! It was that bad. Sloppy job of putting everything together and loopholes everywhere."
    },
    {
      "rating": "10",
      "text": "great movie!"
    },
    {
      "rating": "7",
      "text": "Alright."
    },
    {
      "rating": "10",
      "text": "Kick ass movie."
    },
    {
      "rating": "8",
      "text": "Hey! Anybody that hasn't seen saw 1-4 cannot say anything about saw 5. Of course you didn't like it. Saw 5 spends its time explaning saw 1-4. If you went to the movie theater just tio see people get fu*ked up. then go watch an edited verision of just people getting killed. But, if you want to see a complicated story unfold then saw 5 is your best bet."
    },
    {
      "rating": "0",
      "text": "Saw 1 and 3 were great, (i personally prefer three) saw 2 was alright, but saw 4 was pretty bad. by saw 4 they were making shit up and production values were getting lower. But by saw five... well lets just say it was MORTIFYING."
    },
    {
      "rating": "2",
      "text": "At first I was a big Saw fan as i enjoy gory horror films, and i like all of the games throughout the films. This Saw went so far away from the first movie it was unbelievable, After all when you go to watch a horror you do expect blood, all there was in this was one game which was crap, a plot that jumped around from 1 saw to another throughout it made you feel dizzy and a ending which was a total let down, i mean i love saw 1 but it has now got terribly numb."
    },
    {
      "rating": "6",
      "text": "Ok , if u have seen all the others u have to see this one ,. i really liked it. and it really gives a concluicion to all of the otthers."
    },
    {
      "rating": "0",
      "text": "saw is the most disgusting thing ever,how can any of you saw saw 1-4 are the best is it nice watching others get tortured, i know it is only a movie but a movie represents something i am not saying dont watch em but still you cant say they give you anything you to learn"
    },
    {
      "rating": "4",
      "text": "It was a disapointment... \"Saw IV\" was pretty good and surprised me. This one is confusing. There's no more history to tell, and they already making things up."
    }
  ],
  "recommendations": [
    "saw_iv",
    "jigsaw",
    "rings",
    "saw_3d",
    "saw_vi",
    "saw_iii",
    "spiral_from_the_book_of_saw",
    "saw",
    "paranormal_activity_4",
    "saw_ii",
    "paranormal_activity_3",
    "the_devil_inside",
    "the_babysitter_killer_queen",
    "wish_upon",
    "the_twilight_saga_new_moon",
    "see_no_evil",
    "better_watch_out",
    "a_nightmare_on_elm_street",
    "the_ring_two",
    "paranormal_activity_the_marked_ones",
    "friday_the_13th",
    "unfriended",
    "the_collection",
    "dead_silence",
    "the_bye_bye_man"
  ]
}