{
  "id": 1107,
  "title": "Saw 3D",
  "starring": [
    "Tobin Bell",
    "Costas Mandylor"
  ],
  "runtime": 90,
  "genre": [
    "Horror",
    "Crime"
  ],
  "description": "(AKA- Saw: The Final Chapter)  As a deadly battle rages over Jigsaw's brutal legacy, a group of Jigsaw survivors gathers to seek the support of self-help guru and fellow survivor Bobby Dagen, a man whose own dark secrets unleash a new wave of terror.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vC9T3hjrV9jEBIQ5Ce9eZzN1xxJ.jpg",
  "categories": {
    "plot": 4.888888888888889,
    "acting": 4.318181818181818,
    "ending": 5.745098039215686,
    "soundtrack": 0.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 5.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "saw 3d is an insanely cool ending to the saw films, i couldn't have enjoyed it more, and the twist at the end is almost impossible to see coming."
    },
    {
      "rating": "5",
      "text": "Saw 3D is (for the most part) poorly scripted, laughably acted and wears it's low budget like a badge of honor. The one thing it has going for it is a killer of a twist ending, which does nicely wrap up the series, but which I also think has blinded some of the others users on here into thinking they saw a really great film (eg, mrcritic giving it a \"9\" after admitting the 3D is awful and the acting isn't great -- those are two pretty big factors to only dock 1 point for, in my opinion).  The Saw movies stopped being scary a long time ago and now they are just endurance tests for the audience and while Saw VI was one of the stronger entries in the series, Saw 3D is a bland, strictly by-the-numbers affair. Logic and plausibility have never been high on the series checklist, but here they're thrown out the window and any sense of adhering to a realistic timeline is fuzzy at best. Betsy Russell, Cary Elwes and Tobin Bell are all welcome returns but even they can only do so much with what they got. Still, there is that great ending...just don't get duped into thinking it absolves the previous 80 minutes from being anything more than just average at best."
    },
    {
      "rating": "9",
      "text": "Any Saw movie past the 3rd is automatically awful. That seems to be the general consensus now and it's really quite ignominious. Who cares if there are 7 movies in the series? That's not really a superfluous amount when they're all well written. Sure, a lot of the plot twists are similar, but they work! People need to get over the number of movies an look at the story. It's not just gratuitous violence. There's a really interesting plot unlike Hostel. The only reason Saw 3D isn't the best in the series is because the first movie was so disparate than anything we had seen in horror before. Sure, the acting is not the best in these movies, but for me, Saw 3D negated any problems I had with the characters.Jigsaw is teaching people to appreciate life through traumatizing yet allegorical means. That's the goal anyway. When Amanda is helping him though, she rigs the traps so people can't escape, believing that they don't deserve a chance. Hoffman does what Jigsaw asks, but blackmails Amanda for his own gain, and in Saw 3D, goes on a revenge killing spree after facing his own \"test\" in Saw 6.The Saw series is meant to be a story about people learning to value their lives and become better for what they've experienced, but for the most part, things don't go according to plan because everyone is so  close-minded. The plot becomes much less convoluted after the 5th installment, but again, people don't want to give it a chance because of how many there are. All the movies are under 2 hours in length, so do yourself a favor and see them if you haven't. Saw 6 makes up for Saw 5, and Saw 3D has the perfect ending for the series that I should have seen coming, but didn't, and I think that might be the case for a lot of people. All the loose ends are tied up, and there is no hint of an eighth movie. Saw 3D gives the one, final twist that it needed to make up for any mistakes in the past, and while not all of the traps are as brutal as those in previous movies, they will make your stomach churn, your throat sore like mine, (you'll see)."
    },
    {
      "rating": "1",
      "text": "With an incomprehensible storyline, illogical plot-twists, poor actors, laughable dialog, and cheap CGI, Saw 3-D has saved the worst and most sadistic for last."
    },
    {
      "rating": "4",
      "text": "\"Saw 3D\" offers nothing. You see massive cliches and blood flying around for 90 minutes. The ending is hurried and the actors perform terribly. I would have given this a 2, BUT what saved the movie is director Greutert's manageable directions and the newly equipped 3D, which helped me watch eyeballs and body parts flying around 'artistically'. Game Over."
    },
    {
      "rating": "8",
      "text": "A fitting end to a series that has continued to divide opinion - I for one have enjoyed every sequel, as much for the mystery and suspense as the gore and ingenious traps (although I found Saw 3 to be too explicit).  I was pleasantly surprised by the 3D, as I didn't find it nausea inducing as I have previously, and the traps were fittingly OTT.  In regards to the other films, I'd say this wasn't as good as the original, but probably on a par with 2 and 6.  A satisfying conclusion to an original and tense series."
    },
    {
      "rating": "10",
      "text": "Saw 3D es una película que muestra un gran historia en su sipnosis, en donde todo está bien planeado para ejecutarse y así mantiene un buen ritmo de acción y emoción en el film."
    },
    {
      "rating": "0",
      "text": "It should've been Jill(Betsy Russell), not Mark(Costas Mandyor), a serial killer with no showmanship, no panache, who should have carried on Jigsaw's work as a good samaritan. (He's getting rid of a**holes, right?) But in \"Saw III\", the batty moralist dies. Maybe \"Saw\" shot its wad too soon, killing off John(Tobin Bell) in the midst of a then-wildly popular franchise, leaving the keys to the kingdom in Mark's hands, leaving \"Saw\" in a lurch. Without having seen all seven(!!!) films, my guess is that Jigsaw was better alive than dead, a proactive character with a puppet who would look more at home with the cast of Peter Jackson's \"Meet the Feebles\" than Jim Henson's Muppets. More than John, Mark needs that puppet; he'd be nothing without that male ventriloquist's dummy. The man is a cipher, when you compare this dirty cop with other iconic villains from other popular horror movie franchises. Must we name names? Well, for starters, Freddy Krueger didn't need no stinkin' traps to be interesting. \"Saw\" made a mistake in that third installment, which probably cost them at the box office in the long run. After the father of a kidnapped daughter runs a skill saw across Jigsaw's throat, the series could have gone in two directions. (Both more interesting than its chosen path.) Since the puppet, not the puppetmaster, is the films' lasting icon, why not consolidate the two and have Jigsaw calling the shots as a reanimated insentient toy(a soul transference closer to the spirit of Richard Attenborough's \"Magic\" than Tom Holland's \"Child's Play\", since the former also featured a ventriloquist's dummy, whereas Chucky was a doll), with Jill, playing the Anthony Hopkins role, in which you're not sure if it's her, or the doll, doing the manipulating. The second scenario would have been an ever greater improvement, especially when applied to \"Saw: 3D\", a film that's all rote murder and no surprises. This scenario doesn't exclude Mark; he could kill some, but just don't leave ALL the killing to him. Make Mark the second copycat. Like the Jonas Ackerland-directed music video for The Prodigy's \"Smack My **** Up\", \"Saw: 3D\" could have used the short form music video's first-person approach to conceal the trap designer's identity, especially her sex. In \"Smack My **** Up\", the aggressive behavior on part of the unseen person suggests we're watching a man. To find out that the agitator is female, is a shock. Having two psychos help account for the moral inconsistencies of the one-man judge and jury, Mark, who in one instance, takes the skinheads trapping(David Lowery of Camper Van Beethoven \"Take the Skinheads Bowling\" instead), then in the same breath, has no qualms about involving a complete innocent like the author's wife, who had no inclination that her husband lied about being a Jigsaw survivor. Like Ellen Page in David Slade's \"Hard Candy\", Mark doesn't care if the skinheads hate minorities, both he and Hayley Stark(she doesn't really care if the pedophile, played by Patrick Wilson, f*cks underaged girls) just get off on torturing people. (Look at the poster for \"Hard Candy\", it's very \"Saw\"-like.) \"Saw: 3D\" just simply thinks too highly of itself. The final installment of this pioneering torture-porn series insists on mythologizing itself by returning Dr. Lawrence Gordon(Cary Elwes) to that warehouse bathroom like it was a paramountcy moment, on par with Luke Skywalker first arriving at Tatooine in George Lucas' \"Star Wars Episode III: Revenge of the Sith\", rather than honoring the most important horror trope of them all: the \"final girl\". As the final girl, Jill is supposed to own the pleasure of killing the killer, but no, torture porn plays by its own rules, having little regard for the old school template of the pre-\"Hostel\" days that served a film like John Carpenter's \"Halloween\", and others, so well, because Mark grabs hold of Jill, seats our heroine, and rips her face open with a bear trap."
    },
    {
      "rating": "0",
      "text": "BOOOOOOOOOOO!!!! The Saw series has gone soooooo off track since the first film.  I enjoyed the first and the third, the 2nd and 4th were borderline a waste of time.  Followed very closely by all the rest!!! I enjoyed the twist in the last movie but everything else was a sick explotation of murder and gore (seriously who needs to watch a piece of intestine fall from the ceiling on to the floor, followed by a 5 second close up of that same intestine).  I expect this from Hostile but man the first one was so smart and intricately weaved with a briliant conclusion.  Anyone says they like this movie is just DUMB!!! I'm sorry but DUMB!!!"
    },
    {
      "rating": "5",
      "text": "\"Saw 3D fails to grasp what it has going for it , tho some of the traps are clever & original but with its cheesy effects & laughable performances ii can't take it seriously. But its the perfect ending to a dragged out series lets hope it stays that way...\" .. C+"
    },
    {
      "rating": "10",
      "text": "I believe that this movie was a great ending to the saw series and also that negative feedback were people who probably just couldn't cope with horror movies, not the movie itself. Some argue that the movies predictable, however I don't think so, did we expect Hoffman to be in the body bag? no. In a nutshell, it was an excellent movie and I recommend it to people with a strong stomach and saw fans. Not people who go to watch the movie and give negative feedback just because they don't like the \"torture porn.\" Also the movie contained greater suspense than ever like every saw movie :)"
    },
    {
      "rating": "0",
      "text": "The film is laughable in its feeble attempts to gain shock value through gore we've all seen before. This horse was dead about after the third film, and I wish someone would tell them to stop making them."
    },
    {
      "rating": "2",
      "text": "A bad movie. This film errs by excess, the deaths are too exaggerated and the story is weak and dowdy, not the characters are engaging and can clearly note the lack of creativity of the creators of the series."
    },
    {
      "rating": "5",
      "text": "I think Saw 3D is the worst Saw-movie so far. The blood is too pink and this movie focuses more on the traps instead of the characters. This means the viewer can't really feel for the characters. Nevertheless is the story quite interesting and the ending is the best part of it."
    },
    {
      "rating": "2",
      "text": "Saw in 3D looks insanely bad, especially putting out the same old scary clichés that never even gets old to newbags on movies or fans of the franchise. Saw 3D finally puts the termination to this painful franchise that should've ended a long time ago."
    },
    {
      "rating": "4",
      "text": "Hugely Disappointing EndingSaw: The Final Chapter should’ve been a satisfying close, Instead it focuses WAY too much on 3D and now bland horror."
    },
    {
      "rating": "3",
      "text": "Saw 3D gave the gore fans exactly what they wanted: Gore.  So much gore, delivered in various ways - some more inventive than others.  Sadly, for those who have followed the story and kept up, gore alone was not going to make this a good film.  I won't repeat the many flaws this film has, as other reviewers here have that base fully covered, but I will elaborate on something most just mention.  Lazy/poor scripting.  Characters weren't just killed; they were assassinated.  Jill, for example, had been a quiet character who used her head and kept her cool.  She knew the part she had to play, and until the end of Saw VI she had played it well.  However, in Saw 3D she appeared to have a complete character reversal.  Gone was the cool and calculating woman who could rely on her quick mind to escape almost anything.  What we got instead was a typical horror movie \"screaming queen\" who did nothing but blunder around without anything resembling a thought process going on in her head.  There was no fight in her as she fled from Hoffman, and she seemed to just resign and accept her fate once she was captured.  This change was repeated for the other main players in this film.  6 films' worth of character development was thrown aside so the characters could do what the script wanted them to do, instead of the script bending to the needs of the characters.  Yes, the previous films were guilty of giving highly dubious reasons as to why people were doing the things they did, but at least some attempt of justification was given as to why this wasn't \"out of character\" behaviour.  Saw 3D made huge changes and offered no explanation as to why.  That's what upset me the most about this film, and why I think it's the weakest of the bunch."
    },
    {
      "rating": "10",
      "text": "This movie is a great way to end the saw series, whoever gives this movie a low review is... well i just dont know how you can give this movie a low review. I have been a fan since the first one and this finally gives some conclusion to the story, amazingly amazing.Amazing btw."
    },
    {
      "rating": "3",
      "text": "You have to be a complete idiot to not see that plot twist coming. Really? Talk about going out with a whimper. I was extremely disappointed. I had hopes with Kevin Greutert, who directed the, admittedly, good \"Saw VI\". However, my hopes were not met. Tedious, boring, and featuring some of the worst 3D i've ever seen, \"Saw 3D\" is not worth a moment of your time."
    },
    {
      "rating": "2",
      "text": "spoilers: Im a big fan of saw and loved all 6 of them. But saw 7 was just disappointing. Saw 7 was supposed to be the collision of ALL 6 movies combined. We wanted to know more about the man we have been waiting to see for the past 7 years.(Gordon) The justification for Bobby and his victims were so dumb. If you like watching people die then you will like it. There are plenty of loose ends and you would think that there would be a saw 8 because of the unanswered questions. Why has Gordon assisted Jigsaw? What happened to Easton's killers,sister, and saved victims? Why did they just lazily scrap the 2 victims of saw 5? What happened to Gordon's family? I assume the other 2 pigmaks resemble Gordon's appretinces as he takes on the rightful role as Jiggsaw. Now, the point of Bobby was so that since he could not understand the pain of being a victim, he had no power to save others, but he did. He helped alot of people appreciate life. Who cares if he lied, he may have been in it for fame and fortune but what he got wasnt justified, it was a cheap excuse to put more traps. Bobby's victims were even more innocent. You put in traps because you dont appreciate life or your ruining someone elses. They didnt do either. There wasnt much of Tobin(Jiggsaw), he only had like 1 scene. Saw1-6 were true to the series giving deserving punishments with great twists. But saw 7 wasnt. You would expect the last one to be the best. Why didnt Gordon return for Adam? Throughout the movie, your supposed to be fixated on Hoffman and Bobby, but the fans are obviously on their toes, waiting for Gordon. Many things are unanswered but to be honest, its somewhat implied. But we really want to see why Gordon became the new Jiggsaw. Saw has a knack for giving us a great ending that will make us want to come back to see the sequel so we can find the answers to the questions we have been wondering. Saw 7 does the same except provides no sequels so no answers. People criticize it for saw 7 trying to tie up loose ends instead of tell a story, but they didnt even tie up the loose ends, some of it is still loose. Ok im done, ill be in my angry dome, drinking cups of anger tea."
    },
    {
      "rating": "0",
      "text": "This movie was a piece of trash. Every kill within the movie felt whimsickle and needless. Bringing in Doctor Lawrence Gordon as an additional Jigsaw apprentice is highly unrealistic. You can see how pissed off that his family was put in danger at the end of the first Saw movie. He should have been hunting Jigsaw. Additionally, the killing of Jill Tuck was the only thing that was slightly poetic. The fact of the matter is that this movie didn't sum up the series at all. This movie was supposed to be the culmination of all of Jigsaw's work. This did not summarize anything. It did not wrap up the story. The only thing it did wrap up was the recently tainted Saw series. **** you saw 3D."
    },
    {
      "rating": "6",
      "text": "Not as good as the preceeding Saw's. It's storyline was pretty good, and the traps were well designed, but the 3D could have been improved. This is not state of the art 3D. And the acting was like the other saw movies in the franchise... meh. Go see it if you like any of the other saw movies. If they offer it in 2D as well... go with 2D."
    },
    {
      "rating": "0",
      "text": "Get an extra hour of real life now - it's free ! - don't watch this piece of trash.qwertyqwertyqwertyqwertyqwertyqwertyqwertyqwertyqwertyqwertyqwertyqwertyqwertyqwertyqwertyqwerty"
    },
    {
      "rating": "4",
      "text": "Saw 6 and Saw 7 (or Saw 3D as it's titled) went against the essence of the entire franchise. The greatness of the first five movies was the possibility of redemption, and how traps had the ability to teach lessons. Yet, the producers and directs have chosen gore and violence over cleverness, and it's so disappointing. I saw the movie in 3D and I don't think the 3D effects were used enough, and it's not like theaters are set up to spray you with red water when you see blood splatter so the 3D is really a gimmick. I can say, I'm glad the series has ended because what once had intriguing twists and outcomes eventually lost those very things that made it so great."
    },
    {
      "rating": "0",
      "text": "Yeah, gore and more gore, people like it, understandable since people have never really seen someone actually get ripped up before, if they did, well they probably want to just do it themselves and should be arrested. This movie leaves you with nothing but, 'hey i saw a new movie now I can go home and maybe do something else for the day...' and no, the 3D didn't really do anything either."
    },
    {
      "rating": "3",
      "text": "In my opinion, it was the most blazing movie of the saga. The makeup was very well done and comes up with convincing the realism exposed to the killings. Closed with the saga in a convincing and satisfactory way."
    },
    {
      "rating": "10",
      "text": "Sometimes in order to make something fresh and exciting again, you have to go back to the beginning, and that's exactly what Saw did. While I enjoyed all the movies, this one has less flashbacks, and is as creepy than ever before. If you are not on the edge of your seat for this one, there is something wrong with you! The final chapter as they claim it to be, might have been the best Saw film yet and the way they chose to end it will just blow your mind all over again. Even if you gave up after the first two or three, SEE THIS MOVIE!"
    },
    {
      "rating": "10",
      "text": "i saw this in 3d and it totally rocked, this was a more than amazing conclusion to my favorite torture-horror franchise ever, great inventive death scenes, decent performances, and a knock-out twist."
    },
    {
      "rating": "7",
      "text": "oh, i wish they could have made a better end to the franchise, but, it's not like we can get a second ending at this point, at the least, it does the series justice."
    },
    {
      "rating": "10",
      "text": "epic!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1"
    },
    {
      "rating": "2",
      "text": "Saw has shown a ferocious unwillingness to evolve. Once the huge grosses started rolling in, plenty of franchises would upgrade to better actors, pricier screenwriters, and production values that didn’t fall somewhere between a Roger Corman cheapie and a snuff film. But the producers behind the Saw films are understandably reluctant to mess with a winning formula. Each entry feels more or less like the last. They’re seemingly filmed on the same grungy, dirty, barely lit set, reusing the same generic-looking C-list actors. And in a particularly stubborn act of willful water-treading, they continue to prominently feature Tobin Bell as the mischievous, moralistic protagonist, even though his character died several sequels ago.\r In Saw 3D, the eighth and ostensibly last series installment, David Cassidy look-alike/Boondock Saint Sean Patrick Flanery plays a bestselling author who’s made a fortune off an inspirational book in which he fictitiously recounts having survived one of Bell’s deadly traps. Saw makes its victims suffer for even the most minor transgressions, so Bell’s flunkies cook up a punishing test for Flanery, to fit the severity of his crime. In order to save his beloved wife, Flanery must make his way through a series of deadly traps involving his friends and handlers. Meanwhile, series veteran Betsy Russell, playing Bell’s traumatized ex, goes to the police and dimes out Bell accomplice/law-enforcement agent Costas Mandylor, who sets about enacting revenge the only way he knows: through a series of gruesome traps.\r Bell’s minions continue to behave like the world’s grisliest life coaches. They even use the touchy-feely language of therapy-speak; traps are designed specifically to teach Flanery important lessons about reexamining his priorities and valuing his loved ones. Successories-style sentiments get joined to low-rent gore, maddeningly redundant setpieces, and an arbitrary police procedural about a hotshot detective intent on taking Mandylor down. With the possible exception of Final Destination, no horror franchise is as devoted to cheap gimmicks, and no gimmick is more ubiquitous these days than 3-D. But Saw 3D does little with the technology; even in 3-D, the film looks flat. This entry is being billed as the series closer, and as a tiny change of pace, but don’t believe the hype. Saw 3D offers the same old overwrought, laughably melodramatic **** only this time in one more dimension."
    },
    {
      "rating": "6",
      "text": "LAS PRIMERAS 3 PELÍCULAS DE LA SAGA ERAN QUIZÁS LAS MEJORES, PERO DE ALLÍ HASTA LA ULTIMA FUERON REFRITOS DE LAS ANTERIORES, UNA HISTORIA QUE AVANZA UN PELÍN ENTRE SECUELA Y SECUELA Y AL PARECER LOS DETALLES QUE SE VAN REVELANDO EN LA HISTORIA SON MÍNIMOS, DETALLES INNECESARIOS, ESTA SECUELA NO ES LA EXCEPCIÓN, A QUIENES LES GUSTA EL GORE, LES GUSTARÁ ESTA PELÍCULA, A LOS QUE LES GUSTEN LAS PELÍCULAS GORE Y A SU VEZ QUE TENGAN UNA TRAMA SÓLIDA, NO LES GUSTARÁ MUCHO."
    },
    {
      "rating": "9",
      "text": "as someone who loves all of the saw franchise, you learn to get over the bad quality and enjoy the storyline and the twists and turns you encounter on the way. the ending to saw 3D almost had me in tears as it was the perfect way to sum up all of the movies for good. i would recommend it to anyone, as long as they have seen all the rest of the movies"
    },
    {
      "rating": "4",
      "text": "Ugh. I know that some people were getting sick and tired of the franchise since the 3rd film, but I thought the first 6 films were at least, good. This is actually self parody.This film starts out with a trap that's shown to the public. Why would Hoffman make this decision? There's 2 dudes and their girlfriend having to fight to see which one dies. There's a way to keep all 3 of them alive, but these guys are idiots. The dialogue is also cringy as hell, and I end up laughing. \"I think we're breaking up with you Dina!\" just makes me laugh so f**king hard, it's so stupid.And if you're wondering how that scene and the characters contribute to the story, they don't!This film should've opened with the garage trap, because the scene has Hoffman blowing up a car to distract the people, so he could take one of the body bags and hide in it to sneak his way to the police station.There's other problems as well. Gibson is an obnoxious character who's always calling Jill crazy. And he's SO IMPORTANT to the plot that he, gets killed 20 minutes before the film is over and is never mentioned at all. Wtf.There's also this stupid dream sequence with Jill being killed, and it's just dumb.Then there's the trap plot. Bobby Dagen's traps has him having to save his co-workers and wife. Out of the 4 people he has to save, all 4 of them die! Why the hell should I care?! You could've kept Cale alive, his death is just getting hanged by a noose. Nina's and Suzanne's deaths were at least bloody and gory, but Cale's is just boring! And Joyce, the wife, is punished more than Bobby is, though she is actually completely innocent!For his final test, Bobby should've been the one who dies if he fails instead of Joyce!Also, the trap plot doesn't contribute much to the story, and it ends so early, that I actually forgot about it.There's other problems like Hoffman murdering a bunch of people at the police station. Not only is this out of character, but he kills so many people, when he only needed to kill Heffner, Palmer, and Rogers!And then there's the plot twist about Dr Gordon being another Jigsaw apprentice. This adds almost nothing to the plot, except for Hoffman being locked up in the bathroom. If it was just Gordon needed to take action if Jill was harmed, then I would've been fine. But nope, he's another Jigsaw, and this is f**king ridiculous.Now this film is called Saw 3D, because it was filmed in 3D. The 3D effects are awful, and because it's in 3D, the blood looks pink. There's also this cheap look to this film, and it sucks.I've been ranting for so long, so let's name some positives. The gory kills are great, like the skinheads deaths in the garage trap, Nina's throat impalements, and Suzzane's eyes and mouth impalements. The Reverse Bear Trap on Jill finally shows someone getting their jaw ripped open, and it's fantastic. The traps are great for the most part, although Bobby's final trap is revealed to be a bunch of bullsh*t, the scene with previous Jigsaw survivors is an interesting idea, and the story is written well for the most part.But the final product just turned out to be a crappy disappointment. 3.5/10"
    },
    {
      "rating": "7",
      "text": "Saw The Final Chapter I like pretty much the victims in this one And Jill also And Hoffman was a lot better in this one  I do like the pacing in this movie also than the other ones Jill is still really good but what happens in the 3rd act really holds this movie for me and bringing back Gordon was not a good idea there trying to put Saw 2004 And Saw III And Saw IV together and the end which just really bothers me in this movie Because the first and second act to me is really good I enjoyed what they were trying to do But When Hoffman Kills Jill And Gordon Kills Hoffman takes me out of this whole rest of the movie Also Gibson as One of the leads for the Officers Is really good I also liked his character And a lot of the traps Bobby can't even help the other people Like Jigsaw said's he has not murdered anyone but The last seven movies it's been victims I don't get it But Saw The Final Chapter Is a Solid Ending But could be better So I give Saw The Final Chapter a C+"
    },
    {
      "rating": "6",
      "text": "since the beginning of time, we have watched others suffered. now it all comes down to this. the final movie in the series. Saw 3D!!! I watched it twice, but when I did, it gave me pretty much a headache. I just don't know why. so, whats my opinion of it? well, true. the filming was messy, the writing was kind of sloppy and the acting was poorly, but this movie is enjoyable, yet not memorable, the 3D effects weren't so bad and they were the only saving grace of why this movie is a good lackluster installment in the series. an eighth installment was planned, but due to the decrease in the box office performance for Saw VI compared to previous installments led to Saw 3D being the final planned film in the series, and the plot concept for Saw VIII being incorporated into Saw 3D. Saw 3D is an irritating, but a good way to end the series and thank god it is finally over. Grade: D+"
    },
    {
      "rating": "8",
      "text": "Not exactly sure where the hate of this movie is coming from....I enjoyed it and how it wrapped up all the loose ends of the story and what the gigantic climax was at the end. Gotta say that final scene when one of the main guys is completely screwed no matter what they did gave me chills.I'll pay to see it in theaters again, too. In 3D no less.PS: Much better than 6 in my opinion. #5 was the worst I believe."
    },
    {
      "rating": "0",
      "text": "This sucked, Simple as that. I was a huge fan of this franchise but Saw 3D killed it for me and it showed to us all that the Saw franchise simply needs to die."
    },
    {
      "rating": "0",
      "text": "Well, I don't know - maybe there's some system of making movies for them, but the fact is that the 1st, 3rd and 5th movies were best for me, 2nd, 4th and 6th \"not very good\". So, from this part i was expecting something good. But the plot is dull, actors play awful (especially new detective), death-scenes are disgusting. Well, there is only one good moment - the ending (that lasts for about 3 minutes)... Hole movie is a big mess, it shouldn't be made. Thanks god, that i watched it NOT in 3D!"
    },
    {
      "rating": "4",
      "text": "Saw 3D is the most disgusting saw  movie I have ever watched, the story is quite good but it's real badly acted, there are good scenes but, THIS IS NOT 3D!!!!!!"
    },
    {
      "rating": "4",
      "text": "It is a generic horror film that everyone has seen many a time over. Bad script and acting. Still though a good movie to go and see with your friends one night if your bored."
    },
    {
      "rating": "10",
      "text": "this movie is not as good as the others have been i think they tried to put so much story into this one that they forgot to make the killings look real and the 3D made it look very cool and all but it just wasn't the same as number 1 and didn't have the cool affect of it. the reason i watched saw was because i liked the creative ways he would kill people but this one has very much so disappointed me sadly to say."
    },
    {
      "rating": "2",
      "text": "Let me start off by saying I have seen all the Saw Movies, 1-6, and decided to see the final Saw film. I was more than disappointed.I am doing a comparison to what the Saw films were originally like, if you don't like that then don't read my review, simple as that.Saw 1, 2 and 3 (In my opinion) relied mostly on a gripping understanding of morals and a complete regression to violence to resolve problems. However, Saw 4 and 5 just relied on slice and dice gore like most of the horror industry is these days. Saw 6 then came as a surprise to me, it made me seem like they had a shot at making the franchise start up well again. So I went into Saw 7 with high hopes that it would live up to the 6th film and the first three movies. Needless to say, it went back to what Saw 4 and Saw 5 did, mindless gore, lackluster plot. But only this time it had the introduction of something that almost all movies have these days, 3D! (Which was also lackluster).Also the plot twist.... Really? The lack of imagination was both disappointing and boring.My Review: 23/100Consensus: If your new to the series, stay WAY away, rent the first movie and start from there. If your a fan, go ahead and watch it, it won't hurt, it might lower your standards though.If you want more reviews like this, or want to request a review, go to gamerspurgatory.darkbb.com, sign up and message DarkZX"
    },
    {
      "rating": "7",
      "text": "A decent way to finish off the Saw series, it's nothing new or original and only the most hardcore of Saw fans need apply, and honestly it just feels gory for the sake of being gory, honestly throughout the movie when some of the people died, I honestly was thinking ok did that person really need to die? you'll also notice some characters from previous movies, honestly it doesn't try anything new, this is basically a thank you note for all the fans that have stuck with the series."
    },
    {
      "rating": "10",
      "text": "The seventh film has an unusual, fun atmosphere to it. It's not the same, let's just think of a real easy way to kill em' idea,It's- If were making a final installment of a sick and twisted franchise-Let's add a little flare and sickness to. a dash of 3-d- and vamoose!!! a highly watchable,  saw."
    },
    {
      "rating": "4",
      "text": "Holy Cow. I didnt need to see this. Stretched out, boring, and awful ending. Only nice thing is the thing \"final chapter\", that means i am not going to torture myself with this garbage anymore. Bad luck for movie serial, but this is sheer disaster."
    },
    {
      "rating": "10",
      "text": "SAW 3D well-manges to prove a series can continue going without hitting rock bottom. I don't care about the acting very well, but perhaps not even the 'Top Critics' get the plot of this film, which makes me sad. In SAW 3D (SPOILER ALERT) When Bobby Dagen shows his scars, and what he has to say... It is actually, interesting. If you listen carefully to some of these kinds of moments in this film, or the WHOLE series... I am pretty sure you will know what I am talking about, but you really do actually have to listen. I can end this review, saying it truly is now SAW VI or III, but it sure is a great way to end the franchise."
    },
    {
      "rating": "4",
      "text": "This one spoilt it for me. I'm not having a go at the saw series, because I think it is well written, and I'm not having a go at how many movies there are, because all of them up to now have been decently written. After Saw III, the films went downhill a bit, but they were never bad. They always had a couple of interesting plot twists that would keep you watching until the end. But this one wasn't good at all. The main trap of the film has nothing to do with the plot, though it is slightly interesting. The plot twist at the end is alright but there's only one, and it's not really the finale ending we were all hoping for after six movies. I am a fan of the Saw movies, but I can't say I like this one. It was a poor ending to the series and I expected better."
    },
    {
      "rating": "2",
      "text": "I want to love this film and Saw has this manipulative way.  You to forget about everything and watch the next film. However this time, what was done cannot be forgotten. Horrible acting performances, borderline pointless story line and deaths that happen so quick and often that you can't even possible connect with any individual character. Worst movie that I have seen this year!!!"
    },
    {
      "rating": "2",
      "text": "Bottom Line: Umpteen merciless slashings, with a side dish of guts and blood.  Plot?  Whoops, we sure forgot that one didnâ"
    }
  ]
}