{
  "id": 1291,
  "title": "Saw IV",
  "starring": [
    "Tobin Bell",
    "Costas Mandylor"
  ],
  "runtime": 96,
  "genre": [
    "Horror",
    "Thriller",
    "Crime"
  ],
  "description": "Jigsaw and his apprentice Amanda are dead. Now, upon the news of Detective Kerry's murder, two seasoned FBI profilers, Agent Strahm and Agent Perez, arrive in the terrified community to assist the veteran Detective Hoffman in sifting through Jigsaw's latest grisly remains and piecing together the puzzle. However, when SWAT Commander Rigg is abducted and thrust into a game, the last officer untouched by Jigsaw has but ninety minutes to overcome a series of demented traps and save an old friend...or face the deadly consequences.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/e3pLI0qN1AKGHwOcMuwTpyI2SLN.jpg",
  "categories": {
    "plot": 6.068965517241379,
    "acting": 6.142857142857143,
    "ending": 6.882352941176471,
    "soundtrack": 5.0,
    "cinematography": 1.0,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Wow. People who enjoy this garbage need to realize these movies achieve nothing. They express some failed writers narcissistic bondage fetish. It needs to stop and people need to stop condoning this act of attrition on the art of film."
    },
    {
      "rating": "10",
      "text": "Apparently a lot of people watched the movies and didn't light up that they aren't what it looks like. They were like pieces of the big picture. If you'd like to know why you think they're stupid, well i will tell you...These movies are like one big puzzle. Each movie connects the pieces together and the 4th one really did introduce new hidden parts of it. All of the movies are very interesting and all of them twist in a way to keep your attention if your IQ is not that low enough to get it. IF you want to watch just horror and be left with good impressions of SAW then watch the 1st or 2nd one IF you want blood and slaughter, well all of them got it and IF you watched them and understood how entertaining the story is, well let's hope they keep it this way And i certainly don't think the ideas are ran out. Actually it seems like it is one big idea ever since the 1st one."
    },
    {
      "rating": "6",
      "text": "\"Saw IV\" is where the series started to go downhill, but, thankfully, not all at once. The story is very slow, but it's still reasonably entertaining for fans of the series. This entry probably had one of the better plot twists in the series. It tied up some loose ends and plot holes that the first three had. I say give this one a shot if you liked the first three."
    },
    {
      "rating": "4",
      "text": "\"Saw 4\" is battered with preposterous Cliches and silly characters with dumb, idiotic plot twist. They should have stopped their Jigsaw game at \"Saw 3\"."
    },
    {
      "rating": "1",
      "text": "A waste of time"
    },
    {
      "rating": "8",
      "text": "Saw IV I really like the back story of Jigsaw Daniel is Awesome also where he is a Detective trying to figure out what is going on What I like what he does is goes through with Jigsaw To help Eric He tries to help Eric but he was too late Jill Backstory Is great also explaining what is going on with Jigsaw and why he started to do this My problem with this movie is the ending it tries to put Saw III ending into this very messy and the editing is too much also at the ending than the Peter I guess was Jigsaw TF is that But Saw IV Is an interesting movie the backstories is great in this movie I give Saw IV An C"
    },
    {
      "rating": "6",
      "text": "SequelitisSaw IV still has satisfying kills, But it’s starting to feel old."
    },
    {
      "rating": "4",
      "text": "Saw IV is probably the most forgettable movie in the Saw franchise.I like the characters, the drama, and some of the traps. But I have many problems.This film is overstuffed with characters and plot. Some of it could've been cut out, like Art Blank's and Kramer's connection. Just make Blank a corrupt lawyer who's forced to help Jigsaw or die.I also did not like how Daniel Rigg traveled from trap to trap. In the other films, the test subject was abducted, placed in some secret room, and was limited to that area. In this film, Rigg has to go from location to location, IN PUBLIC! What type of bullsh*t is that?!I also didn't like the Bedroom Trap, as Rigg had to get the specific guy, force him into the trap, and move to his next destination. Why didn't Jigsaw put the guy in the trap?!Then there was Perez getting injured, and then presumed dead in Saw V, and then is revealed to be alive in Saw VI. That was pointless.And then there's characters like Detective Fisk who don't do anything and could be cut out.This film helps add some nice details into the Saw series, but its flaws and stupidity is just frustrating for me. 4/10."
    },
    {
      "rating": "4",
      "text": "The twist is in the timeline that events take place as Jigsaw, now dead, recruits a new guy to run the game but the cop playing the game ends up killing everyone by not paying attention to the rules."
    },
    {
      "rating": "3",
      "text": "I guess a bad saw movie had to come along eventually. This seemed like a total rush job/ cash in. I hope they can turn it around for saw V."
    },
    {
      "rating": "0",
      "text": "Sick."
    },
    {
      "rating": "1",
      "text": "Not one to defend the SAW movies, infact I think there all aload of frenetically cut (to hide the fact that the pacing and cinematography is terrible) load of twoddle, but where is the rule that dictates a film should stand on its own? Such as 'Election 2', which doesn't make any sense unless you have seen Election, so what, they are great films. Film is an extensive medium where anything should be possible, it is only large corporate film companies and dim witted audiences that would put such restrictions on movie makers."
    },
    {
      "rating": "3",
      "text": "In its over-the-top, gross-out opening sequence, the newest 'Saw' film shows the corpse of Tobin Bell"
    },
    {
      "rating": "7",
      "text": "I haven't watched all 4 parts of this movie. I have only watched the first one and then the 4th. I have to say that I like the first one better, and sadly, 4th wasn't that scary at all. But overall, I wasn't bad either. I mean I cant really comment until I watch the 2nd and 3rd but I would probably rate it about 7."
    },
    {
      "rating": "9",
      "text": "This movie was great. I would most likely rate it second best in the franchise following the original. After that i would say the second is good, and the worst in the series being the third, which was still a darn good movie. This movie had me constantly in suspense and had a twist ending that was great. Cant wait for V and VI."
    },
    {
      "rating": "3",
      "text": "What went wrong? Was it the rehashed ideas? Was it the not-so-surprising twist? Was it the detailed study of the saw series demanded by this movie? Or is it just a franchise stretched beyond its limits? Saw should have died with Jigsaw. Perhaps i am harsh.The movie did have some worthwhile scenes. Like the wife-husband torture and the grisly,highly detailed autopsy performed on dear old jiggy and the...hold on...thats it! while saw 1 2 3 had shocking powerful scenes that frightened in a unique way, saw 4 holds not your attention for too long. The \"saw\" factor is destroyed."
    },
    {
      "rating": "10",
      "text": "I loved it i hope there is a fifth one!!"
    },
    {
      "rating": "6",
      "text": "The details on Jigsaw's background were excellent, but the plot itself was a disappointment. The twist ending was a case of shock for shocks sake as opposed to a plausible one like Saw II's big reveal at the end. Worth seeing if you are a big Saw fan, just expect not to appreciate it as much as some of it's predecessors."
    },
    {
      "rating": "10",
      "text": "Of course I love all the SAW movies so I'm going to give it a high rating but I must say...WHAT THE HELL HAPPENED? I'm so confused but it was still good."
    },
    {
      "rating": "10",
      "text": "1 of the best movies ever saw.  Amazing acting from Tobin bell and writing."
    },
    {
      "rating": "6",
      "text": "it wasn't as good as the other 3...it concludes the stories and the reasons of the other movies. But this is utterly disgusting,which made me realize to not watch the 5th one! TERRIBLE MOVIE! Do not watch it."
    },
    {
      "rating": "4",
      "text": "The first SAW was great. It was original and made you guess who the killer was. This is a gore fest. It's mildly entertaining. It uses the hidden sadistic nature in all of us to entertain. Sadly, that's all it does. It's becoming another victim of cash-in in the film industry. Just like endless slasher from the 80s... it will have a sequel.... or sequels... or even prequels.... hopefully the number doesn't reach X..... a decent film for the Halloween spirit... nothing more."
    },
    {
      "rating": "8",
      "text": "This movie was really good. you had to watch all of the series to understand this movie. i think this one was the goriest of them all. i got confused at some parts and did not understand some parts of the movie. but overall it was a great movie."
    },
    {
      "rating": "8",
      "text": "The movie was awesome, and believe it or not, it teaches us all a very important message which is to cherris our lives, although jigsaw chose an extreme method to do so, some learned the lesson all the same."
    },
    {
      "rating": "9",
      "text": "Even being a large fan of the saw series, i had reservations going into a fourth installment, for much the same reasons everyone else has. However, I left the cinema a very happy person. Saw 4 is definitely not for everyone though. You may not NEED to have seen the others for it to make sense, but you do to be able to appreciate what does take place. I'll leave this free of spoilers, but part of the beauty of saw 4 is it brings so many characters back and gives them resolution, resolutions that simply wouldn't mean much if you hadn't watched their horrific sagas begin from the start. Others will also complain that this film deviates from the \"saw\" franchise; well, really making ANY sequels to saw 1 was deviating from the point of the movie. And if thats you're feelings, then of course you're not going to enjoy this. However, those that come into this with an open mind, and happy to accept the saw franchise evolves with every installment and is constantly changing ( imo) in a positive way, are likely to walk away happy. The traps are back, but more subdued compared to saw 3 ( which i believe was the right move), the twists are back in spectacular fashion, to the point where even if you figure out 1 or 2, there's going to be one or two more to catch you out, and a new killer is revealed....or is there? Due to the nature of the twists, saw 4 leaves the viewer with many new questions to ask, but thankfully these questions are enough to warrant a sequel in my opinion, so hopefully saw V will be the success this has already become! Overall, i give this a 9. I take away one point for the fact many involved in the movie are pretending its a movie where you don't need to have seen the sequels - its not. I'm not saying people won't understand everything (although a second viewing is advised), but the biggest thing is the saw series for me is the character development and the way the viewers become invested in such flawed people; because we can relate. You can't invest in many of these characters, and therefore the events if you haven't seen the rest. However, everything else was spot on, and as a whole movie, i think it may actually be the most compelling of them all."
    },
    {
      "rating": "0",
      "text": "Please, everyone involved with the Saw saga. Stop. Your films will not get better, only worse. Seeing how everything degrades to the moment of still-ness and chaos; your saga will end like that (if they haven't already)."
    },
    {
      "rating": "10",
      "text": "I did not enjoy the third movie, so I was reluctant to see this one. However, I walked out of the movie theater smiling after seeing this one. It will be much better if you've seen the 2nd and 3rd movies. The ending wont be as good if you haven't. I'd say this this movie is about just as good as the first one."
    },
    {
      "rating": "8",
      "text": "How can you say that you DON'T need to have seen 2 + 3 to understand this one. there are many characters stories, in this one that started in 2/3. and Possible Spoiler*****4 is set at the same time as 3 and explains whats going on at that time*****End Spoiler the film can be watched without the others but if you don't watch the others you will undoubtedly like this film less than usual. there were bits in this film that were gross *opening scene* but compared to 3 this one was a breeze (imo) anyway i thought it was a great film but i didn't like the end , it rounded things off nicely BUT Possible spoiler******i felt it copied the original SAW's great Twist [*** END SPOILER***] overall i thought it was great and i cant wait for the next installment."
    },
    {
      "rating": "3",
      "text": "Okay now it's getting out of control, Saw 1 was the best and leave it at that. You could make like twenty Saw movies, but now we've got to stop and start from scratch at something new."
    },
    {
      "rating": "2",
      "text": "I gave it s a 2 because it managed to kill some time, but that's the only redeeming feature from this load of \"stuff\". Ok, we get it. Torture and what-not is scary. Can you please give us a new reason to watch it?"
    },
    {
      "rating": "10",
      "text": "An extraordinary and intelligent screenplay which puzzles us; a thrilling diagnosis about how things are in the world right now; a series of films that have been evolutioning getting better every time."
    },
    {
      "rating": "6",
      "text": "It should have ended after Saw 2. Saw 1 was a creative and interesting movie with a cool twist and Saw 2 upped the ante and the stakes and both movies were about a group of people put in desperate situations who then had to work together to get out of them. Saw 3 was where they clearly began running out of ideas and sure enough, the writer left the series after this installment and Saw 4 brings on a new team of writers. There's a lot to like here; the death traps in this installment are top notch; easily the best in the series and in the genre as well, and a huge step back in the right direction after the comically over-the-top ones featured in Saw 3. Darren Lynn Bousman (director of this installment and Saw 2 and 3,) does a great job of filming this and creating a great atmosphere, and the editing's quick and stylish. We also get some great scenes showing Jigsaw's development and how he became what he was. This is also easily the creepiest installment in the series since the 1st one, bringing back some horror into the series with a few moments that sent chills up my spine. The series's trademark \"plot twist\" is here as well, although it's unfortunately more confusing than surprising. The problem is that the movie is extremely difficult to follow. I have a great memory for movies, so I can remember the events of the first 3 movies very well; that said, I was lost at times here and was downright confused near the end, where I completely lost track of the characters. I strongly recommend you re-watch the 2nd and 3rd movies before seeing this one or you're going to be entirely lost. (And you still will at times feel lost anyway.) When they're not confusing you by flashbacks, flashbacks-within-flashbacks, or a needlessly large cast of characters, the movie pretty much plays out exactly like Saw 3, with 1 character going from 1 victim to another and being put in a series of tests. It's not a bad movie, but it's one that feels at times too similar to the 3rd one in plot and structure. At other times it shows us some cool ideas with different characters and locations, as well as some great death traps...Unfortunately, it too often completely confuses us by cutting to other characters before the many issues and characters that are brought up are resolved. Saw 5's going to be starting production with these same writers and a new director very soon, and I don't know if I'll end up being excited for it; Saw 2 was great but since then they've had to strain to keep this series going by constantly manipulating a huge amount of backstory and cast of characters to the point where only die-hard fans who have watched the past movies hundreds of times will have any hope whatsoever of following these new releases."
    },
    {
      "rating": "2",
      "text": "Movie sucked what more can I say?"
    },
    {
      "rating": "2",
      "text": "This is entertainment?"
    },
    {
      "rating": "4",
      "text": "Another completely uninteresting volume of entertainment. You know it's a problem when someone gives a review, saying you HAVE to see all the other Saws before this one, because thats absolutely right. You won't really know the purpose of anyone, or what they are all doing, or any intentions of the random characters they just toss into this movie like wildfire. This is no easy transition into the series, its not like Bourne Ultimatum, where it flows well enough to be its own movie, instead of completely depending on the movies before it. Because ultimately, thats what this movie is. It strings together the exact same formula that the third one was,and brings along the same problems. The contraptions the poor victims find themselves wrapped in are no longer intelligent, no longer plot-worthy, they are simply set for gore and they deliver. But thats the only thing that delivers. Gore, gore, gore. No wit, no intelligence, gore. The story is loosely tied as we go back and forth and back and forth to the past, present, interrogation rooms, an abandoned warehouse building, with some absolutely TERRIBLE video editing. And, well, for the acting, how reaching can a horror movie be when they have to hire Gilmore Girls' Patterson to take a main position? Saw was better when Jigsaw was alive, and when it centered itself around the characters. But in Saw IV, the characters are a just a vehicle to the gore, and the \"twists\" are just there to simply follow its formula. You won't be impressed, or at least, you shouldn't be."
    },
    {
      "rating": "9",
      "text": "Great movie ... so exciting!"
    },
    {
      "rating": "5",
      "text": "I didnt see 2 or 3 and I understood this movie just fine. People who think you need to see all of them before you see this one are either stupid or think the rest of us are. With that said, it still wasnt a good movie. The Saw series as I see it is 1 part torture porn and 1 part mystery/psych thrilller. When you take the mystery part out you are left with a bunch of meaningless torture. The \"lesson\" taught and the \"conclusion\" are evident from the first 10 minutes. The gore was repeated and the frenetic editing is in my opinion just a tool to add artificial confusion to a plot line that is inherently simple. Wait for the DVD."
    },
    {
      "rating": "6",
      "text": "Hey, what happened? This wasn't what i expected... i am a big, i mean, huge saw fan, and it really disappointed me... what happened? oh my god, I'm gonna be in shock... Damn, didn't happened... damn, well... I'm gonna buy it when it comes out on dvd anyway,,, nothing impressive."
    },
    {
      "rating": "3",
      "text": "Remind me not to see the fifth one. Or the sixth. Or the seventh."
    },
    {
      "rating": "10",
      "text": "way better then the 3rd"
    },
    {
      "rating": "8",
      "text": "It's consistent with the rest series. If you liked the previous 3 like I did, you will almost certainly enjoy this one. Something I've always appreciated about the series, is it requires some thinking. It doesn't have cheesy lines or a dumb story, like most films in the genre. Other reviews are likely harsh either because they're offended by the content, or don't understand certain plot points. It's true the plot is more friendly to people who've seen the previous 3."
    },
    {
      "rating": "0",
      "text": "This movie is so terrible. Watch Saw I, you might be scared, watch Saw 2, you might have seen it already, watch Saw III you start to be disgusted, watch Saw IV and wish you've never watched that perverted trash showing blind violence instead of having some ideas."
    },
    {
      "rating": "4",
      "text": "The first three \"Saw\" films were distinguishable from most other modern horror films in that each installment delivered a message on morality and the human condition. \"Saw IV,\" however, uses the gratuitous gore that made the series popular for the purpose of marketing a morbid display of the mutilated human body. Beginning with the first scene, \"Saw IV\" scrambles frantically for every possible situation that may justify the ruthless depiction of relentless suffering. A few interesting plot points and allusions to past \"Saw\" films keep \"Saw IV\" fairly entertaining, but neither the story nor the film itself is fully satisfying. Like Jigsaw, the \"Saw\" series is able to pull off a few tricks after death, but, in the end, it is still dead."
    },
    {
      "rating": "5",
      "text": "Wasn't as good as i thought it should be. didn't explain that well on how that cop became the new jigsaw"
    },
    {
      "rating": "2",
      "text": "Highly disappointing. At this rate the next SAW will be in negative numbers. I'd give SAW I a 10, SAW II a 7-8, SAW III was at best a 4, and now this clunker barely comes in at a 2. Much as I enjoyed the first two, I fear this series has run it's course...worth seeing if you have seen the first 3, but don't expect to be thrilled by it."
    },
    {
      "rating": "9",
      "text": "This film is not just another gore-fest like everyone says it is, if you look past the traps you see why John is the way he is. There is a story behind all the death and destruction, but some people don't bother looking, and just want a reason to complain about a perfectly reasonable film about human survival."
    },
    {
      "rating": "10",
      "text": "Amazingly scaring. make sure you dont pee your pants."
    },
    {
      "rating": "0",
      "text": "Atrocious torture porn."
    },
    {
      "rating": "9",
      "text": "This is better than the 3rd one...it really tells a lot more of the background story...and I'll stop there cause I don't want to ruin anything...highly recommended for any true Saw fans...the end might be a bit confusing though."
    },
    {
      "rating": "10",
      "text": "kickass! cant wait til Saw 5."
    }
  ],
  "recommendations": [
    "jigsaw",
    "saw_vi",
    "saw_3d",
    "saw_iii",
    "saw_v",
    "paranormal_activity_4",
    "spiral_from_the_book_of_saw",
    "unfriended_dark_web",
    "saw_ii",
    "paranormal_activity_the_marked_ones",
    "paranormal_activity_3",
    "rings",
    "saw",
    "the_devil_inside",
    "unfriended",
    "better_watch_out",
    "paranormal_activity_2",
    "bird_box",
    "maze_runner_the_scorch_trials",
    "the_new_mutants",
    "chernobyl_diaries",
    "the_twilight_saga_breaking_dawn_part_2",
    "the_hunger_games_mockingjay_part_1",
    "would_you_rather",
    "the_collection"
  ]
}