{
  "id": 330,
  "title": "Say Anything...",
  "starring": [
    "John Cusack",
    "Ione Skye"
  ],
  "runtime": 100,
  "genre": [
    "Romance",
    "Comedy",
    "Drama"
  ],
  "description": "Lloyd, an eternal optimist, seeks to capture the heart of Diane, an unattainable high school beauty and straight-A student. He surprises just about everyone-including himself-when she returns the sentiment. But Diane's over-possessive, divorced Dad disapproves and it's going to take more than just the power of love to conquer all.",
  "releaseYear": "1989",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nkucKciFGSRalw6dJtsglWqOXMC.jpg",
  "categories": {
    "plot": 8.333333333333334,
    "acting": 8.1,
    "ending": 7.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Sometimes slow, but with smooth performances by John Cusack and Ione Skye, a great soundtrack and its mark in cultural significance, Say Anything is a great coming-of-age flick from the golden age of teen films. If you haven't seen this movie already, see it."
    },
    {
      "rating": "9",
      "text": "A skewed love story built on the American class system. Director Cameron Crowe is a marvel."
    },
    {
      "rating": "10",
      "text": "The best Cameron Crowe movie! And that's saying a lot."
    },
    {
      "rating": "8",
      "text": "I love coming of age films and Say Anything is certainly no exception. Featuring fantastic performances from John Cusack and Ione Skye, the film is the quintessential coming of age film. With iconic moment after iconic moment, Say Anything crafts a truly adorable romance that provides moments of adorableness and moments of pure comedy. Together, Cusack and Skye have incredible chemistry to help make this sweet high school dramedy come to life and feel fully authentic. Honestly, I wish Cameron Crowe still made films like this instead of, well, bad movies. Crowe really does a nice job writing and directing this one and crafts a truly nostalgic and sentimental look at the time between high school and college. Overall, Say Anything is one is the many quintessential 1980s high school films for good reasons: it's sweet, charming, and truly a riot."
    },
    {
      "rating": "7",
      "text": "A notable performance from John Cusack here. The script sparkles with authenticity, and the stars take advantage of this. My only criticism is that it was a little slow in places and a little too long, but otherwise a fine teen flick for fans of John Hughes."
    },
    {
      "rating": "7",
      "text": "Say Anything...: 7 out of 10: Repeat after me; Cameron Crowe is a genus. Nobody wrote dialogue for teenagers as he did. In his films they talk like actual people. (I have never written a screenplay myself but from the evidence of the sheer number of filmed screenplays, that fail absolutely at this, I would gander that it is quite difficult.) While Fast Times at Ridgemont High created his reputation, Say Anything cemented it. There simply is not a false note in the entire film. All three leads (Ione Skye, John Cusack, and John Mahoney) are pitch perfect. The situations are realistic and flow well. The support cast is also excellent. The ending is both realistic and sweet.\r While Say Anything is without faults, it also is not very memorable. Unlike the previous Fast Times at Ridgemont High, there are only a few scenes that stick out. It is a pleasant story and certainly worth a revisit if it has been twenty years since you saw it.\r I on the other hand saw for the first time a few days ago. Unfortunately, I was to busy watching movies like Less than Zero in the late eighties to see Say Anything. Imagine how much better my life could have turned out if I had only allowed Mr. Crowe to guide me one more time."
    },
    {
      "rating": "8",
      "text": "Say Anything is an excellent directorial debut for Cameron Crowe, one of my personal favorites. It hangs on to its time and you can always associate this film with the time frame it was released in. It's got all the quirkiness that became Crowe's trademark as his film career went on. The soundtrack is great which doesn't even need to be said of a Crowe film. John Cusask plays a unique, but likeable and memorable character in Lloyd Dobler and then Ione Skye gives what is likely the best performance of her career. Say Anything is simply a classic and belongs up there with the rom com classics."
    },
    {
      "rating": "10",
      "text": "As an almost 17 year old, today was my first time seeing it and wow! Diane's style was a huge hit or huge miss but that's hardly a way to rate a film. Really powerful performance by John Mahoney. Great lighting! But most importantly, the characters acted like subtle teens but there was all the magic of a movie."
    },
    {
      "rating": "8",
      "text": "tells an essential heartbreaking tale..Say AnythingThere are few little touches added by the maker that not only connects with the viewers but communicates with them on higher level than any other romantic genre feature usually does. And this is where Cameron Crowe; the writer-director, shines brightly through his brilliant execution skills that speaks volume in each and every frame and paints this cultural phenomena of cinema; especially in its genre, that it is. He redefines the \"love\" by not exaggerating but taking a smarter approach on keeping it practical and grounded with the help of its pragmatic characters who even though are sometimes cheesy, is certainly immensely lovable. The performance objective is where the wheel gets stuck in here despite of their appreciative effort which is clearly visible by the cast like John Cusack and Ione Skye. It is short on technical aspects like sound department too but is finely edited and beautifully shot which makes it pleasing to watch. The chemistry between the characters and the energy of a scene is transported safely from the paper to the screen and delivers completely to the audience. Say Anything tells an essential heartbreaking tale of an unpredictable and complex relationship that is ironically set back in order to keep it simple and sensible."
    }
  ]
}