{"id": 851, "title": "Scary Stories to Tell in the Dark", "starring": ["Zoe Colletti", "Dean Norris"], "runtime": 108, "genre": ["Horror", "Thriller"], "description": "Mill Valley, Pennsylvania, Halloween night, 1968. After playing a joke on a school bully, Stella and her friends decide to sneak into a supposedly haunted house that once belonged to the powerful Bellows family, unleashing dark forces that they will be unable to control.", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/kNjEmQGBm9cYqTB03r6yECozQyW.jpg", "categories": {"plot": 5.639344262295082, "acting": 6.111111111111111, "ending": 5.538461538461538, "soundtrack": 5.0, "cinematography": 5.75, "familyFriendly": 5.777777777777778, "funny": 5.2, "action": 3.0}, "reviews": [{"rating": "7", "text": "For me this was a disappointing film with one or two really good moments (for example, the monster in the hospital), but overall it was never as good those very few parts. The mostly mediocre actors, the dull story, and the slow pacing were just not good enough to create even one real moment of true horror."}, {"rating": "7", "text": "It was a cool movie,but nothing more,didn't really do anything original,i guess they needed to follow the story and not be to gory because this movie loooks to be tyargeting a relative young audience but they could have done so much more with this story.I guess that is why a sequel in probably in the making.Overall i felt kinda dissapointed because this movie wasn't scary at all but it was still a cool and enjoyable movie.O and the actors did well."}, {"rating": "7", "text": "Pretty GoodIt’s not the perfect adaptation, But it’s still one worth watching."}, {"rating": "8", "text": "This is my 3rd favorite horror movie of 2019, one of my favorite movies of 2019, and one of my favorite horror movies. The creatures were phenomenal and so cool, creepy, scary, and disturbing, I was especially creeped out by the Pale Lady and the Jangly Man. The visual effects were fantastic. The story was terrific. The acting from Zoe Colleti, Michael Garza, Austin Zajur, Gil Bellows, Lorraine Toussaint, Dean Norris, and Gabriel Rush was excellent. This was a great horror movie."}, {"rating": "10", "text": "Voilà un film original, angoissant et flippant ! J’ai beaucoup aimé ce film"}, {"rating": "7", "text": "Um filme para deixar vc tenso e levar alguns sustos, com criaturas medonhas e assustadoras apesar de serem um pouco mal feitas digitalmente, mas concerteza vale o ingresso"}, {"rating": "7", "text": "Η προσεγμένη παραγωγή υποβάλλει μια πειστικά τρομακτική ατμόσφαιρα, με σκηνές οι οποίες διαχειρίζονται εύστοχα το σασπένς, σερβίρουν τα απαραίτητα jump scares κι επιβάλλουν την απαιτούμενη εφιαλτική αίσθηση"}, {"rating": "7", "text": "Engaging, suspenseful and an original story. Ias a horror movie buff, I recommend it to anyone interested in the genre."}, {"rating": "7", "text": "Scary Stories to Tell in the Dark does have some really good elements to it, but it’s missing things and falls short in other areas. Great job bringing the original artwork to life on the big-screen. Great job with the writing. Not sure it was the best cast of kids... acting could have been better. Check my review here - https://youtu.be/gZiewZ88yHI"}, {"rating": "7", "text": "The movie could never be as good as the illustrations from the book but there were some disturbing images from the movie I won't forget for along time."}, {"rating": "8", "text": "Scary Stories to Tell in the Dark faithfully brings the stories that terrified us as kids to the big screen. If you remember the books fondly, you will be delighted from start to end. While the overarching story tying its individual parts together is a little cheesy, the various stories throughout the film promise to scare and delight horror fans. As a huge fan of the original trilogy, I loved this film and hope there are more Scary Stories in our future!"}, {"rating": "8", "text": "I was scared to walk into this movie, but I was shocked by how good it was. It was an awesome horror movie that didn't ruin my liking of the book. It has some pretty scary moments for a pg-13 movie. I love the scares, the suspense, and acting (they actually gave a really good performance in this movie). I didn't care too much for the characters, but they have just enough exposition to make me sort of care for them. Also, there was one sentence character said about a dream (no spoiler), but it just felt so out of place. Other than that it was a great horror movie, better than other pg-13 horror movies that don't seem to do well. 8/10 or B+"}, {"rating": "7", "text": "I can honestly say this movie surprised me I went into it not expecting much but it kept me gripped right to the end and had me on the edge of my seat."}, {"rating": "8", "text": "La magia y el horror de esta cinta viene de sus impecables y maravillosos monstruos. Es una cinta de aventuras con cierto toque de suspenso. Estoy seguro de que  ganará más cariño y seguidores en el futuro."}, {"rating": "7", "text": "Growing up these books where a staple in my childhood. Was hyped when I saw they were making them into a movie. After finally giving it a watch on Netflix, I can say overall it was a decent depiction. I had heard the use prosthetics on set but went with a more CGI look with some of the monsters and it makes me wish they had left it to just the prosthetics. Still a good movie, wouldn’t be opposed to a sequel."}, {"rating": "7", "text": "A fun and technically well executed scary movie, pretty much exactly the definition of a good popcorn flick."}, {"rating": "7", "text": "Following the similar style and simple premise of 2017's IT, with slightly more horrifying imagery and greater nightmare fuel, Scary Stories to Tell in the Dark is a solid and simple gateway film for emerging genre fans and younger filmgoers. It should not be much of a surprise, largely because of del Toro's involvement in the writing process. However, Norwegian talent Andre Overdal deserves credit where credit is due - the leading quality in Stories is suspense, and Overdal constructs his sequences masterfully. Each individual character's narrative culminates in either one or more personally scary moments, which all add to the absolutely spot-on recreations of Stephen Gammell's disturbing illustrations. On top of this, the acting all around is solid and quite convincing, similar as well to that of IT. Though minor flubs in pacing and needless exposition occur sporadically, there are no real, game changing flaws or issues. Simply put - Stories fits in well with the likes of other young adult classics, and will certainly become a classic of its own within several years time."}, {"rating": "2", "text": "If loud noises amd jump scares are your thing, then this is for you. If however you were hoping for real scares, your completely out of luck. A story that makes zero sense. cardboard cut out characters and Saturday morning cartoonish monsters.Poorly directed, badly edited, weakly acted, all from a poor screenplay."}, {"rating": "7", "text": "As a fan of such horror fare as Tales from the Crypt and Creepshow, I appreciate what they're doing with this film.  The kid actors are fantastic - kudos to the casting team.  I was hoping that the \"horror\" sequences would be a little scarier, but hey - I get the feeling (based on my audience) that this is one of those horror films meant to get younger audiences into the genre.  Mission accomplished, from what I saw."}, {"rating": "10", "text": "I Enjoyed every scene of this movie!A nice building up to most of its scenes, with fun, scary stories to check best on a foggy night.Del Toro manages to did it again, in helping to create this little horror gem, even for a more recent generation."}, {"rating": "7", "text": "It’s not perfect, but it is perfectly enjoyable. I knew it was going to be visually stunning from the moment I saw Guillermo Del Toro, and it absolutely was. It was fun and nostalgic and it felt like the movie I wished Goosebumps had been a few years ago, rather than it taking the full on comedy approach. It was cute and definitely more kid-oriented than it would be for adults, which is understandable. Felt more like 90’s Goosebumps episodes brought to today’s world. But even with all this praise and nostalgia I felt, I must retract some points just for the fact that the monsters felt hollow and lifeless and more of a means to an end or some sort of “scare factor” rather than having some sort of character or purpose or personality. A lot of the meat of the stories in here was taken out and I felt the overarching narrative was drug our a little too much or too long. Wish they had focused more on the stories within and cut back a little bit on the overarching narrative. Still, it was fun and I enjoyed it. Looking forward to the coming sequel. The ending pretty much promised one."}, {"rating": "10", "text": "Wonderful movie. Definitely feel Del Toro had a part in this. The story is well written and the way the smaller stories (from the book) comes together here is marvelously done."}, {"rating": "10", "text": "Perfect scary movie. Would be a great gateway horror film for younger viewers. As always with del toro the creatures are the highlight."}, {"rating": "7", "text": "The elementary school book fair staple whose illustrations have traumatized children for decades finally gets the Hollywood treatment in André Øvredal's \"Scary Stories To Tell In The Dark,\" yet another unassuming gem hidden within the rough that is the 2019 cinematic landscape. A movie far more concerned with trying to explore the limits of what we can still call \"PG-13 horror\" rather than with going through the same motions we've seen with these sorts of films time and time again, \"Scary Stories\" will have your stray jump scare here and there, yes, but it'll make sure that the image on display contains something well-designed and -- most importantly, especially considering the namesake in play here -- scary. It looks great, the acting is serviceable, but above all, I kept hankering to see what creature, effect, or scare they were going to try and pull off next. All in all, it's quite the chilling treat -- one that also ensures I'll never look at any pot of stew or spider bite the same way ever again."}, {"rating": "7", "text": "Scary Stories To Tell In The Dark is a revisionist tale of all of your favourite horror movies from the 1970s to our present time, amalgamated into one very solid and well done horror film. Directed by André Øvredal and heavily influenced and produced by Guillermo Del Toro, Scary Stories is a fresh yet cozily familiar peak into a growing genre of cinema that is not only its due diligence, but gaining exponential notoriety in the film industry. The film manages to be youthful but not irritating and scary but not grotesque, blending clichés and devices together and delivering them with class and effortlessness.The story kicks off on Halloween; no punches are pulled when it comes to nostalgia considering the film is based in the 60’s. Heavy nods to films like 1987’s Adventures in Babysitting are made, giving light to a very breezy yet heartwarming entrance to the characters.  Our main protagonists Stella Nichols (Zoe Margaret Colletti) is a young aspiring horror fiction writer who has, as expected, a geeky group of friends. Auggie played by Gabriel Rush, the kindhearted rational player in this game and his best buddy Chuck played by Austin Zajur, are just a bunch of nerds trying to get back at the resident jock Tommy (Austin Abrams) who so happens also is dating Chuck’s sister Ruthie (Natalie Ganzhorn).While the characters are somewhat cliches embryos, each character serves its purpose with glee; Chuck provides the main comedic relief in the film, Stella is the bookworm, Auggie is the realist and newly formed friend Ramon Morales (Michael Garza) is the newbie who they tumble upon and find shelter after chucking faces in Tommy’s car, stumbling upon Ramon at a local drive in. What’s interesting yet weirdly satisfying about the film is how Del Toro, who had a heavy influence in the creation of the film being the film’s main producer, incorporates some social consciousness and real-world dilemmas into the film with minority based subtexts and racist undertones, giving the film a familiar yet authentic feel.So after thwarting off Tommy and his band of Outsiders inspired jocks, it being Halloween and all, it only seemed fitting that Ramon and the trio of main characters visit an old, resident haunted house owned by the small town’s primary original family. While some jokes and pranks are delivered throughout the house, Chuck comes across an unsettling encounter with an unnamed figure, and Stella, being the horror fanatic that she is, ends up stealing on the supposedly haunted Sarah Bellows’ books. What she doesn’t know is, the book starts to live out the deepest and darkest fears of our protagonists as well as antagonists, in horror delight fashion. Each story of our characters are done in a very interesting and ingenious vignette style with each spooky story in my opinion getting scarier and scarier, or in cinematic terms, more Del Toro. Del Toro’s contributions to the film are quite obvious; his signature coloring of scenes is prevalent and absolutely adds to the eeriness of Scary Stories. Heavy rich reds used effectively to show either impending horror or in one case thrusting us right into it, the grayish blues that I feel are Del Toro’s go to for atmosphere are breathtaking. My first exposure to Del Toro’s color palette was when I watched Pan’s Labyrinth back in 2006; yet despite the film being less of a horror film, the eerie atmosphere and tone of the film was spine-tingling, to say the least.Scary Stories plays close to Labyrinth’s stylistically and I couldn’t have been more visually satisfied especially considering that palette paired with 60’s nostalgia which, [any of my readers would know] I adore. The monsters are all truly terrifying in their own way and possess an unsettling realness to them; no creature or ghoul feels too outlandish, or too far from our own reality. For the first time in a long time, the monsters actually feel like they were plucked from our own consciousness; our deepest fears and demons. That’s what Scary Stories so good is how the film and narrative revitalizes horror and the genre as a while, but allow it’s characters and spooky set-pieces to stand alone and create a world that is familiar, yet new. It makes you as the viewer feel young again, touching that place deep down that I don’t think horror has touched in a long time, a aura of retrospective and nostalgia.Scary Stories does everything a horror film should do and more. Yes it scares, induces jumps, scream and terrors but like so many horror films of the 1980s, its also a good time at the cineplexes. Much like the Nightmare on Elm Street, Friday the 13th and Child’s Play were a riotous time at the cinema back then, those films didn’t take themselves too seriously yet were still as spooky, fun and entertaining. More than anything, Scary Stories had me entertained, from beginning to end."}, {"rating": "7", "text": "Based off a kids book of very short stories, the movie picks a handful of them and gives them the full horror movie upgrade. Another great movie from André Øvredal of \"Troll Hunter\" and the \"Autopsy of Jane Doe.\""}, {"rating": "7", "text": "This is a decent film made for a specific audience, pre-teens who are just getting into horror films. Though the acting, pacing and plot isn't the best at times, overall it works and is worth a pre-Halloween watch."}, {"rating": "6", "text": "Some interesting moments throughout but overall it felt like the 60sbsetting was used as window dressing only and the jump scares were common and felt cheap. Throw in a pretty forgettable set of two dimensional characters and some pretty average cinematography and what is left just lacks any particular flavour to be worthy of remembering fondly. Conceptually there's something here.... Also the abundance of cgi kinda stood out here. Less is more folks. Go practical at all times unless absolutely necessary. In general too much 'clear view of the monster' was evident here which is a massive fail when it comes to the horror genre when building tension. Production was high quality but the lead actor felt like a bad choice. I never felt truly emotionally connected to her backstory or motivation."}, {"rating": "6", "text": "Scary Stories to Tell in the Dark is a breath of fresh air in the horror and mystery genres of Hollywood for it brings out some storytelling (about a mysterious young girl who is kept locked in a basement room by her own family and who narrates scary stories to children) with enough dose of horror imagery and not resorting to puerile jumpscares that is the hallmark of new-wave horror these days. TN."}, {"rating": "7", "text": "6.5 or 7 stars. Well done, spooky imagery with a not particularly scary story. Enjoyable for any age, perhaps not scary for anyone older than 13 however. Enjoyable for sure, though. Flawed...the main actor (Stella) gives a particularly bad performance in a group that doesnt really stand out. Doesn't detract too much from the experience, however."}, {"rating": "5", "text": "At a time when the entertainment industry is being saturated with historical coming of age horror mystery stories, Scary Stories To Tell In The Dark does so much that other films and TV series do, but much worse. Much like IT and Stranger Things, Scary Stories' main protagonists are a group of children/teenagers who are facing up to a mysterious horror which is plagueing their town, and along the way learn some important lessons about leaving the innocence of childhood behind. The only difference is that none of the characters are really interesting enough (or get much screentime) for the plot to work. Additionally, the town and the people who live in it are never really developed enough to make the threat it faces feel impactful. More time is spent on the monster than on the people who actually matter. The characters are eye-rollingly horror aficionados and \"geeks\": as this is the 1960's rather than the standard 80's setting, their interests are in B-movies rather than Dungeons & Dragons, but it's too similar to Stranger Things and honestly a little irritating at this point. The only interesting member of the main crew is Ramon: a wandering Latino vagrant who deals with the usual bullying Jocks with a cold, menacing demeanour which makes him feel like he's going to be a good balance to the more immature, geeky characters. Unfortunately, he very quickly outs himself as a massive horror fan and lover of geek culture.Regarding the monster, the film ultimately fails where other similar films have: it is a horror film that isn't ever that scary. There are a few jump scares here and there, very few of which are paced in a way to feel earned. Much worse than this, there is almost no horror caused by suspense, which fundamentally undermines the main premise of the film: that peoples' gruesome fates are predetermined by a collection of scary stories written in blood. Where there should be a sense of creeping dread, we instead get treated to a collection of monsters being weird things on camera before killing people in as PG-13 a way as possible. I've recently being reading IT, which pulls no punches on the deaths of characters at the hands of monsters, and narrates it in gruesome detail. Much like the recent film version of IT, Scary Stories relishes too much in having monsters mess around on the camera and spends very little time actually making them threatening.worst of all, the film ends with a sequel hook, which is especially bad as the overall mystery the film presents is never that interesting, so to stretch it over a minimum of two films is way too much.If you liked Stranger Things or the 2017 IT, I'm sure you'll enjoy this: but if you want horror, you're watching the wrong film."}, {"rating": "7", "text": "Entretenida, la verdad las películas de terror de este tipo no van conmigo (infantil y adolescente), pero disfruté bastante viendo esta y pienso que tiene la atmósfera suficiente para disfrutarse con amigos en Halloween.Lo bueno: La ambientación, la historia y el diseño de las criaturas, en fin, todo el apartado técnico.Lo malo: Los personajes, puesto que te importa un rábano su destino final sea cual sea. Se supone que es apta para mayores de 14, pero a mi criterio debería ser simplemente para mayores de 7 debido a que es una película muuuuy suave a mi juicio, la poca violencia es de risa y es muy blanda pero aún así es disfrutable a todo dar.En conclusión, es una película para casi todos los gustos para ver de pasada, recalco en que podría ser indispensable para quien guste hacer maratón de películas en Halloween con familia o amigos."}, {"rating": "2", "text": "Think about darkness… if a noise creaks, your imagination takes over… termites perhaps? Or maybe a burglar? Nothing will be known for certain unless you leave the comfortable bed to turn a light on, maneuvering around things on the floor on the way. Scary Stories to Tell in the Dark sounds like it would take on an anthology film format like Creepshow and Twilight Zone. It sounds like the key experience to feel sucked into exactly what makes the dark so scary. Wrong. It instead imitates the exact same genre familiarity without taking any creative risks, which is too bad, because if this was an anthology film, it would be more than another “young victims get killed off one by one until the virgin is left” kind of plot.The sloppy production team behind this horrific horror picture show does nothing but mock genuinely good films of the genre. The first noticeable disregard to common sense is the white-fresh paper of the very old possessed book, then gets even lamer when the teenage leads access highly confidential city records without problem. Even when it tries to get scary, atrocious CGI doesn’t make a series of severed limbs reattaching themselves easy to overlook in the cheap finale. Director André Øvredal’s lack of control results in all logic being accidentally ridiculous, not over-the-top satirical like the unrealistic violence in Kill Bill. Any of its attempted creative ideas fall flat on passing as healthy art for the common viewer, as it relies on the evil book for the convenience of breezing past details with lazy dialogue.At least the “creepy” scenes deliver okay, the best of them featuring a deformed woman who slowly creeps toward you down a hospital hallway; each edit cut she moves closer and closer like the overly-familiar fear of being followed, enough to help you overlook the thoughtless conversations in every other scene. It’s not worth it to sit through the unmanageable scenes though for this one moment, since nobody who oversaw auditions in the pre-production process said anything about how those who made the cast have no talent.Zoe Margaret Colletti is one of the worst cast members, as her eyes never have a sign of terror when they are supposed to; she instead just sounds passive, reliant on a warm porch light to set the happy mood instead of bringing out life from her own presence. The other kids in the movie go through personal problems, including dysfunctional families and *gasp* zits! That’s it really, any other real problems are left out. It does attempt to chuck in political overtones with a radio that exclaims, “say no to war,” and many shots of Richard Nixon on TV. But none of these visuals affect the narrative in any way whatsoever, especially not the thought process of Zoe’s character, Stella.It does attempt to look impressive by incorporating jump-scares, some of them just fake-outs, and one of them an attempt to quietly build up to the “mother of all jump-scares,” but all these attempts flop. There are problems in all other horror scenes too, one of them has a toe inside a soup, which succeeds at being gross, but is otherwise empty of any lasting impression besides the visual of clawed floorboards under someone’s bed leading to a wall.The production crew should have taken notes from their costume designer Ruth Myers (L.A. Confidential) for inspiration. One boy wears a wonderfully pathetic Spider-man costume for Halloween (courtesy of mom), and it captures the tone the film should have had: self-aware in how much it stretches from being what is expected with a large aura of goofiness. Instead, it goes for dead serious but is goofy by mistake. One laughable attack on a blonde girl matches said level of ridiculous misinterpretation, with spiders intending gross reactions out of everyone but winds up getting the expected reaction only out of those with arachnophobia.But here’s the dumbest part: the feature is bookended with monologues on why stories craft us, which is not insightful, but ironic, because the message is attached to something with mere entertainment in mind, not philosophy. Trust me, I know about the philosophy of film, and books.Scary Stories to Tell in the Dark has no idea about those realities of literature, it’s just a piece of Play-Doh that molded itself into the shape of a puzzle piece to try and fit in. Since it can’t do what it should have done all along, it can’t make your skin crawl once the lights boom out."}, {"rating": "7", "text": "I found this adaptation of the popular children's book trilogy to be one of those films that has great scares with an okay plot.Director André Øvredal (who directed the excellent The Autopsy of Jane Doe) really knows how to bring on the scares. For those worried that the violence and gruesomeness is going to be watered down because this is from children's books, be rest assured that Øvredal manages to push the PG-13 rating pretty far. The movie does a great job with the atmosphere when the scares kick in. The characters are attacked by several stories come to life, and each one is accompanied by an unrelenting sense of doom.The ghosts and monsters in this are heavily based on the original, iconic, and freaky illustrations by Stephen Gammell, which, let's be honest, are as much as responsible for the books' fame as the stories. They look great. They also rely on practical effects when... well... practical. I found the Pale Lady segment to be one of the best scares of the year. Only draw back is that the final foe, though still creepy, doesn't quite compare to the ones before it.The plot is okay, just okay. The opening suffers from trying to both fit in the exposition and getting to the scares too quickly. The revelation of what causes all the evil to occur felt undercooked. On the plus side, there are a few clever lines in this.Acting is mostly just okay. The weaker points are Tommy the bully (Austin Abrams) who even by movie terms is too over-the-top and Natalie Ganzhorn as Ruth, one of the teens, who just doesn't gel. In fairness to the actress, I don't know if the director and the screenwriters really had a grip on the character either.Once again, I want to clarify that the plot isn't bad, just not great. I recommend this for the scares, which by themselves would've had this rated a little higher."}, {"rating": "7", "text": "The good horror movie without screamers, but with a individual Del Toro's horror atmosphere. The last monster is very impressived to me and the story \"The Red Room\" is really scary for me and reminded me the \"It Follows\" film"}, {"rating": "3", "text": "Just not good in any way'Scary Stories to Tell in the Dark' exemplifies everything that is wrong with the horror genre. There are some really good horror movies out there going unnoticed, while garbage like this gets a cinematic release. Fake jump-scares, bad looking monsters, slow-moving monsters (didn't we work out they weren't scary 20 years ago) and horrible characters. This was not a fun viewing to sit through.The concept in this movie is quite deceptive. To the naked eye is might appear clever and creative, but when you actually think about it it is incredibly lazy. A book where whatever is written down actually happens. So basically no limitations and no need to structure your story or create plausible reasons for anything to happen. Genius. No, it's simple and incredibly lazy and anyone with half a brain should see right through it.How do people fall for these cheap horror movies that have no depth? It's like people have forgotten how good horror can actually be when it is done right. 'Scary Stories to Tell in the Dark' is not a film I would recommend. There are infinitely better watches available out there."}, {"rating": "10", "text": "I absolutely loved it. Brought back so many memories from the books. I hope they make a sequel and maybe a prequel ;)"}, {"rating": "3", "text": "This movie has the reason I just don't like watching horror movies: Paper-thin and one-dimentional characters, full of clichés of the modern horror genre including: A halloween setting, haunted books, dogs barking at \"paranormal activity\", the characters investigate about the monster/paranormal creature, the characters consult an expert that knows about the thing, lights always fail and goes dark anytime the monster is near and the most annoying thing: JUMPSCARES. Pointless jumpscares that are there because the movie doesn't know any other way to scare you or to be creepy. It's always the same: Music stops for a while and then a loud noise. Sometimes they don't even make sense and one of the monsters literally makes a jumpscare to the audience. It's the most unoriginal, boring movie with no creativity and with all the clichés of the genre.I can't believe Guillermo Del Toro was involved in this."}, {"rating": "10", "text": "Not really so much a horror fan but this movie was really impressive! With good performances and very well-crafted horror scenes this movie kept me on my toes and scared the whole time. Definitely would recommend Del toro is very talented!"}, {"rating": "5", "text": "No hay nada original en esta película, es aburrida y no da miedo, es prácticamente una copia de escalofríos"}, {"rating": "3", "text": "Ovredal and Del Toro’s adaptation of Scary Stories is a bit braindead, but not in ways that are completely obvious. The weakness of their muddled social commentary might have been easier to overlook if all of the monsters and scares hadn’t been given away for free in the trailer. What you’re left with is a film that will probably still scare the bejeezus out of your twelve year-old but not leave you very satisfied.Some spoilers. “Scary Stories leans on its social allegories, but with little conclusive meaning,” write Aja Romano for Vox. I’ve written before about the need for horror films to have nimble metaphors and Scary Stories starts out strong with the way that it handles the disappearances of children by supernatural means. They are the invisible, the silent victims of forces beyond their control. That feeling of sudden loss and erasure is an apt description of the loss of the nation’s youth during the Vietnam War, and that message in and of itself is impactful for the nation’s youth of today who are yet again embroiled in a long, drawn-out, and bloody war. The time frame of the story, stretching from Halloween night through the election of Richard Nixon (2nd term) is also a really thoughtful structure that I don’t think I’ve seen before. Most Halloween movies end on November 1st and most election movies don’t mention Halloween at all. But aside from those spark of brilliance, the internal logic of the film doesn’t hold up very well. It’s thrilling when the deputy assumes that Stella’s friends have draft-dodged just like Ramone, but when Ramone leaves for war on the bus at the end, we’re sort of left wondering what lesson he’s learned from his experiences in the film. All in all, the film does a pretty poor job of commenting on the 60s just as much as it fails at encapsulating the problems of the present decade through the use of its horror metaphors.Other kinds logical inconsistencies grate: we’re led to believe in a voice over toward the end that the lesson that Stella has learned from Sarah Bellows is “never to give up.” “If you keep on killing little children, someone will eventually solve the mystery of your death!” one Friend quipped afterwards. “There is no magic, only rage,” the old former help to the Bellows family intones during a farcically slapdash interview. This is often a problem in horror films. The chief perpetrator of the haunted violence is itself a victim, which tends to exculpate them of their present day crimes on account of “rage,” but is that really the right message? Is Sarah Bellows more rabid dog or disturbed foster child? Why is no one punished for the death of a cop at the end of this film? Presumably the other cop who leaves the children in prison for the night isn’t going to let them off scot-free? Even if I’m a little tired of giving supernaturals who act out a pass, it seems like meeting these traumatized ghosts on their level is the name of the game.Richard Newby calls it “the Next Generation of Horror” and lingers on the empathic framework of the story and its characters which will prepare young movie goers for “social horror” films when they are more mature. Newby’s got it exactly right that Ovredal and Del Toro’s genius is about compelling the audience to sympathize with the grotesque, the radical integration of social groups that Northrop Frye describes as the duty of comedy is used as resolution in Del Toro’s work to great effect. It does no good to make the monsters evil–the woman in the hospital says, “This is a place of great evil,” not “I am a thing of great evil,” and that distinction is not quibble semantics.My biggest sore point for the movie is that the film does such a poor job of creating a personal connection between the scary story and the person it’s associated with. Unlike in It, where each horror is designed to psychoanalyze the trauma of a band of school-aged friends, Scary Stories elects for “music over truth”, as Richard Hugo might’ve said. Probably the best scare is the first one in the corn field, and everything that you could possibly find scary about the other monsters is already laid out for you in detail in the trailer. The wax cylinder scene is a pretty good bit of horror no matter the age, but these moments are few and far between."}, {"rating": "3", "text": "Extremely heavy-handed political narrative that focuses on irrelevant cultural points to the exclusion of compelling story and character development. I think Richard Nixon and modern commentary on Vietnam got more screen time than some of the main characters. Every single modern film is simply a vehicle for political propaganda in 2019.A shameful waste of an awesome IP."}, {"rating": "0", "text": "Garbage. I give it a zero I would. It is pathetic stupid dumb and full of ****"}, {"rating": "3", "text": "Very boring repetitive movie with very classical story, but realised wrong. Some characters as monster which wanted to kill Ramon are funny, not frightening."}, {"rating": "5", "text": "First of all, I will admit that in a few cases that the CGI in this film was okay but I do know that they also used makeup to help make these creatures and whenever it was practical it looked well done. I’ve seen multiple things online comparing the creatures in the film to those in the book and you can see the level of detail the make-up people put into making them look as if they just popped right out of the book. As much as I want to say this film is scary it honestly isn’t. You can tell right away when a jump scare is about to happen because it’s such a cliché way. I will say that there was one point where I felt like I was going to vomit but it was one moment out of I don’t know how many. The pacing in this film is another big problem with this film. The film is one-hour and forty-one-minutes long and you feel it. The plot moves at a snail pace speed and the film keeps coming up with dumb ways to keep making the film longer. Like I said in the intro this feels like a long episode of a kids show like Goosebumps or Are You Afraid of the Dark and it probably would have been better as a two-part episode of one of those shows. The acting in this film was mediocre at best and I couldn’t really care about any of these characters. I don’t want to say which person it was but there was one character that could have been better recasted. In the end, I feel like this could have worked best as a TV Show than a full-length film. It ends off with a possible sequel that I think will never happen. I give Scary Stories to Tell in the Dark a 5.5/10."}, {"rating": "8", "text": "Guillermo Del Toro is truly one of the greatest masterminds when it comes to horrifying imagery. The book has so many terrifying monsters that Del Toro has absolutely done justice for. Not a moment during the movie was I bored until the end, the rest of the movie is tense and surprising to the core. The performances are very good; the teenagers they got to act are much better than, say, the kids from Stranger Things. The movie takes bold turns, with unexpected twists to shock you at every turn. I found the plot, however, to be very similar to It (Chapter 1). Also, the final act is unfortunately anticlimactic and predictable, which really makes this movie lose its steam; because otherwise, it was fantastic. I recommend it to any horror fans; I was scared way more than I expected to be."}, {"rating": "3", "text": "I really cannot understand why people like this movie. The plot and the dialogue are extremely basic and lazy. These main characters are so forgettable and should not take up nearly as much screen-time as they do. What saves this movie from being complete forgettable **** is the spectacular practical effects and costume design that we all know Guillermo del Toro for. I can understand the child-friendly direction this movie was going for but to me it just comes across as bland and poorly written. This loosely put together stock plot that we have seen many times before makes this movie almost unwatchable."}, {"rating": "8", "text": "The lead actress is perfect.... this movie reminds me so much of Lean on Me, and even Super 8.  Not terribly frightening - not nearly as scary as the text.  Solidly entertaining."}, {"rating": "10", "text": "The movie was really good and impressed me and everyone else in the crowded theater i saw it in. Critics who saw it privately and were just trying to impress someone with their cut-throat review of a book written for teenagers that turned movie didn't get it. Go see this movie for yourself and i am sure you will be spooked and enjoy your time  at the theater."}, {"rating": "2", "text": "This is yet another bland ghost story with creepy creatures (thanks primarily to producer Guillermo del Toro's design). It's set in 1968 and features a group of geeky teens out to solve the mystery of a book that creates stories, while killing its victims. Unlike STRANGER THINGS or IT, the period references lack fun nostalgia and the kids are a bland combo of stereotypes. The title is a misnomer too. It's never scary…not even a good jump scare. The plot is predictable and the killings aren't original and definitely not frightening. The original books are written for young audiences, which explains why none of it works for grownups."}], "recommendations": ["annabelle_creation", "lights_out", "the_conjuring_2", "sinister_2", "ouija_origin_of_evil", "the_conjuring", "the_ritual", "it_follows", "the_ring", "insidious_chapter_3", "the_woman_in_black", "oculus", "it", "the_prodigy", "insidious_the_last_key", "insidious_chapter_2", "annabelle_comes_home", "antlers", "winchester", "the_conjuring_the_devil_made_me_do_it", "the_witch", "dark_skies", "the_descent", "the_possession", "the_boy"]}