{
  "id": 646,
  "title": "Scary Movie 3",
  "starring": [
    "Anna Faris",
    "Simon Rex"
  ],
  "runtime": 84,
  "genre": [
    "Comedy"
  ],
  "description": "In the third installment of the Scary Movie franchise, news anchorwoman Cindy Campbell has to investigate mysterious crop circles and killing video tapes, and help the President stop an alien invasion in the process.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gLTVGCtUfD80sMDkbxAiWNso7Ne.jpg",
  "categories": {
    "plot": 6.222222222222222,
    "acting": 6.090909090909091,
    "ending": 4.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.055555555555555,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "With the third film in the Scary Movie franchise, David Zucker adds a certain level of competence to proceedings, the addition of Leslie Nielsen is always a positive, and Charlie Sheen playing Mel Gibson's character from Signs is a stroke of comedy genius. The film just about hits the good joke quota, and Anna Farris is still mildly amusing and gets the job done reprising her ditsy lead role. The best film parody is 8 Mile (which incorporates a certain egotistical British talent judge playing himself) which is a bit odd considering the film is a \"Scary Movie\". All the film spoofs are pretty well executed, probably slicker than they ever have been in this series, and in much of Zucker's own career, though it's a bit odd that so few of the parodies relate directly to the horror genre. The whole film still never quite comes together - some of the gags fall flat, and some of it is just plain embarrassing, and not in an intentionally hilarious way. While the vast majority of the jokes and parodies will at least raise a smile, Scary Movie 3's main achievement is unfortunately reminding you how good David Zucker used to be, but no longer is. His current work can still loosely be classed as comedy, so at least he's doing a bit better than his early writing partners, brother Jerry and Jim Abrahams, but David must still be pining for the good old days of Airplane!, Naked Gun and even BASEketball."
    },
    {
      "rating": "8",
      "text": "Good to see the series get back to actually being funny and that's thanks to a few things. Both Cindy & Brenda are back but this time joined by a new crop of actors, most of which are very funny and perfect for the series. The writers cleverly merge together the likes of Signs, The Ring and even movies that aren't Horror but in a way that still really works. There are also some hilarious LOL moments that weren't as evident in the others. Overall funny stuff and good for a laugh!"
    },
    {
      "rating": "8",
      "text": "I was a pretty interested in the scary movie films before I saw one. I knew number 1 was an all time favourite but I little worried when I wanted to watch number 3 as I heard people where giving it some pretty mediocre reviews. So a couple easters ago I decided to watch it with my friend. Needless to say....we liked the film a bunch! I loved the comedy and how everything was just so random in the film. I love when people can make horror funny, it turns a frown upside down. The choice of actors was ok, the only person I really recognised was Charlie Sheen. I don't like how people criticise this film for having a childish plot. It's a spoof movie!!! It's not supposed to be serious!!! Go watch batman or inception or something if you wanna look for drama. So, I enjoyed watching scary movie and I had myself a good laugh too!"
    },
    {
      "rating": "4",
      "text": "Scary Movie 3 is a 2003 American science fiction horror comedy parody film, which parodies the horror, sci-fi, and mystery genres, directed by David Zucker. It is the third film of the Scary Movie franchise, as well as the first to have no involvement from the Wayans family. The film's plot significantly parodies the films The Ring, Signs, The Matrix, The Matrix Reloaded and 8 Mile."
    },
    {
      "rating": "8",
      "text": "Such a fun. May be I should have watched the first one, but yeah. Anyway, it was great fun. At the end it got a little repetitive and that way I take 2 points. But I’m sure the scary movie series will remain as the best comedies ever."
    },
    {
      "rating": "10",
      "text": "This was a pure genius comedy! all the jokes were funny and the humor in it was outstanding!"
    },
    {
      "rating": "9",
      "text": "There is just too many funny moments to count. I loved it then, and it still has me laughing my butt off today. This was seriously pretty brilliant to come up with this."
    },
    {
      "rating": "2",
      "text": "I am sorry Anna Faris you are way too good for this awful franchise that can't seem to go back to form from the original. Scary movie 3 is silly, stupid humor with absolutely no heart at all which this franchise really, really needs dearly. I give this movie 16%."
    },
    {
      "rating": "0",
      "text": "Yeah, okay the movie is aptly named. It's so freakin scary unbelievable that if you pay to see it, you won't believe it was even made. Disjointed from beginning to end and possibly the worst movie ever made. Now that is scary. Sucked big time. But if you don't believe me and still want to see, make sure you wear a paper bag over your head because the management at your local theater will be laughing at you coming out of the show? You want to die from embarrassment when you walk out. You have been warned."
    },
    {
      "rating": "0",
      "text": "This film is a piece of crap. Worst sequel ever. I F**king Hate It."
    },
    {
      "rating": "2",
      "text": "The first 2 prequels had something I could at least laugh at. Now, the tables have been turned. \"Scary Movie 3\" is what you call \"A **** up sex-satirizing gross out movie\". Nothing is funny or scary."
    },
    {
      "rating": "10",
      "text": "The movie is fantastic, has no real plot, but the humor is spot on, never a dull moment."
    },
    {
      "rating": "8",
      "text": "David Zucker takes over the spoof series in this third entry and he manages to keep the laughs coming. It can be laugh-out-loud hilarious, but there are other times when the humor fails to connect. Thankfully the majority of the humor does, and Zucker manages to capture what made the previous two movies so funny."
    },
    {
      "rating": "7",
      "text": "Much better than the second Scary Movie and actually quite surprising. The humour of David Zucker (Airplane) is much better than the Wayans brothers. I mainly enjoyed this because of Leslie Nielsen who is always hilarious and played Dr Rumack himself in Airplane (the Don't Call Me Shirley guy). Scary Movie 3 may not be the most intellectual comedy ever but it is enjoyable overall."
    },
    {
      "rating": "0",
      "text": "Easily one of the worst movies i've ever seen in my life. It's stupid and with no sense! I give it the bare minimum, because i just hate this movie. The worst choice you can make if you choose to watch it."
    },
    {
      "rating": "10",
      "text": "i love regina  hall she is funny in this movie  . i also love anna faris in this as well but i cant wait to see . marlon wayan's haunted house 2  if some of you hate this see your up next or paraonormal : marked ones movie instead"
    },
    {
      "rating": "10",
      "text": "Indiscutiblemente la mejor de la saga, no es tan exagerada y ridícula como las dos primeras, esta tiene niveles de humor más trabajados y mejor distribuidos."
    },
    {
      "rating": "6",
      "text": "Less foul-mouthed jokes and more original jokes make this film more appealing."
    },
    {
      "rating": "10",
      "text": "Hilarious, brilliant, comedy classic."
    },
    {
      "rating": "6",
      "text": "I did not particularly like the first two as i thought the Wayans Brothers can't grasp this kind of comedy but when i found out that David Zucker would be taking over i was itrigued to see what he would do to make these movies funny, he bought in spoof acting veteran Leslie Nielson to play a brilliant and rather accurate president of the United States and spoof a bad movie, Signs, Charlie Sheen And Simon Rex were good additions to the cast as well as the two new black guys who are very funny."
    },
    {
      "rating": "7",
      "text": "I have seen all scary movie films and this one is defiently the worst. not saying i didn't like it just it ain't nowhere near as good as the first one."
    },
    {
      "rating": "7",
      "text": "Probably the best Scary Movie ever (followed directly by Scary Movie 1), it's full of funny moments, good laughts and crazy characters. Too bad, there are a few excessive scenes (like the one in the white house with the handicaps) that ruin the general atmosphere. WARNING: this is not a serious movie! Watch this only if you want to have some casual fun!"
    },
    {
      "rating": "10",
      "text": "I think it's the best of all the Scary Movies."
    },
    {
      "rating": "8",
      "text": "why deal with it? it beats the second movie in just one shot. so, its not that big of a deal. the funny material was terrific though."
    },
    {
      "rating": "10",
      "text": "The plot is nonsensical, the jokes offensive and over-the-top and the acting ridiculous...this is one of the best comedies ever written! I love the way that the Scary Movie franchise has to parody everything, however I raised my eyebrows when I saw the Michael Jackson-y scene."
    },
    {
      "rating": "2",
      "text": "Scary Movie 3 lazily spoofs films ranging from The Ring to Signs and adds in a few scenes that involve people being hit in the crouch or falling over. If that’s your idea of comedy then you’ll love this."
    },
    {
      "rating": "8",
      "text": "All the scary movie's are pretty stupid but this one seem to have more of a cohesive story and the comedy will make you laugh so hard you might not stop laughing."
    },
    {
      "rating": "7",
      "text": "Very well made movie. I expected less and I found lots of fun."
    },
    {
      "rating": "7",
      "text": "Maybe my favorite Scary Movie of the 5. The plot made some sense, it wasn't scary at all but the funny sceens where cool. The Ring is a good movie also (part of the parody in this movie) so it was funny as i expected."
    },
    {
      "rating": "10",
      "text": "For sure this part is better than the 2nd. Here you have plenty of good illogical jokes and a lot of fun with many hints to other movies."
    },
    {
      "rating": "6",
      "text": "Scary Movie 3 has some funny moments, but they are fleeting. The series becomes a bit predictable at this point and our love of Cindy and Brenda waines with this half-a$$ script."
    },
    {
      "rating": "7",
      "text": "The 2 first were really better than this **** ass movie.Well at least there is 1 or 2 funny jokes but the rest it's just crap.I do not recommend this movie only because the first were way much better."
    },
    {
      "rating": "8",
      "text": "i liked it very much. got some hilarious Scenes in here.    great comedy"
    },
    {
      "rating": "6",
      "text": "While the Scary Movie film series got worse in general this movie has redeeming qualities. I made the statement that each movie was worse than the previous. After rewatching I will admit that this one is better than Scary Movie 2. It is mainly a spoof movie / parody of The Ring, Signs and 8 Mile with side-blows to Sixth Sense, Matrix, American Idol, Mars Attacks and others. There is also an awkward appearance by Michael Jackson.  Most of the jokes work well with some great and a bit more failing ones. The actors do their best what they can do with the script. I think that the actors were hold back by the writing or script and would do better otherwise. I will praise them for what they have done and not blame them. Anna Faris is really talented and maybe the Scary Movie series hold her career slightly back. She delivers her role and is a plus. Her filmography and acting career is noteworthy. Also there are some cameos by several rappers. But this is a plus for music preferences only. If you like it it is good and if you don't have interests in Rap music you wouldn't even recognize them. My main complaint is that the movie feels really constructed. Many parts that shouldn't belong together were merged and the edges are still visible. Maybe a parody for one movie would be better then 3 in 1. I will even made the statement that with slimming the content, more polish and better writing this could become a general appreciated movie in the 7-9/10 range. Also Leslie Nielsen is not good in this movie. Overall an improvement over the prequel but it was just a last stand against the decline of the movie series. Bonus knowledge: Did you know that Leslie Nielsen was used only for serious or dramatic no nonsense characters for most of his career? Only relatively late he was typecast for spoof movies / parodies. It is even named “The Leslie Nielsen Syndrome”."
    },
    {
      "rating": "7",
      "text": "MEDIOCRE, but guilty pleasure\rThis movie and the 1st one in the series are two of my all time guilty pleasures.\rI admit is not a great film but I'll admit I found it really funny.\rAnd I still think this one is better than the first.\rFor god sake what other movie can make fun of the ring and signs at the same time?"
    },
    {
      "rating": "10",
      "text": "This movie is funny as hell. Brenda is funny as hell and almost everything else. This is my favorite scary movie in the series, I love it so much. It is very funny."
    },
    {
      "rating": "1",
      "text": "Scary Movie 3 I laughed one time during the movie that's about it. It fails as a comedy. This is the only scary movie parody film I have seen and man it's bad. These movie are the death of parodies."
    },
    {
      "rating": "6",
      "text": "Scary Movie 3 best part of the series. It doesn 't look as original as the first part, but the plot here looks better. And parodies turned out better than in the previous 2 parts."
    },
    {
      "rating": "6",
      "text": "Better Than 2It may be an improvement and has plenty of funny moments, But it’s still inferior to the original. But that Michael Jackson scene had me in stitches."
    },
    {
      "rating": "5",
      "text": "Tolerable.This is the third film in the \"Scary Movie\" franchise ... and this time, Cindy will be the protagonist of satirical situations and parodies of notable mild horror films like \"War of the Worlds\", \"The Happening\", \"Signs\" or \" The Ring ”. That is, this film repeats exactly the same formula that we already know, changing only the films that are the target of satire. It does not present anything new or that has not been rehearsed in the previous two films, and the jokes are much weaker and loaded with sexual allusions, appealing to easy laughter. The dialogues are uninteresting.The film again brings some of the actors that we already know, in the characters that we are used to. I refer specifically to Anna Faris and Regina Hal who, with their characters, are the protagonists of the film. They do a reasonable job, but not brilliant. I also liked Leslie Nielsen's effort, despite the fact that he is much more subdued and serious than usual. The film features several cameos and names known as Queen Latifah, Denise Richards, Pamela Andersen and Jenny McCarthy, but without any brightness or remarkable merit. Overall, the cast does a poor job.Technically, it is a film that invested heavily in visual and special effects, and that was an interesting and successful maneuver on the part of the production. The effects are good and have quality. It's a relatively short film, it doesn't tire the audience, and even those who didn't like it very much see the film without problems. The sets and costumes do their job, as does the soundtrack. The biggest problem with this film is, in fact, the rather poor interpretation of the cast."
    },
    {
      "rating": "9",
      "text": "The funniest of the lot the rest are terrible in comparison the jokes are just so well done. Leslie Neilson made it"
    },
    {
      "rating": "6",
      "text": "Not as good as the other 2 but still a hilarious movie. Scary Movie 3 makes fun of The Ring, Signs, The Matrix Reloaded and 8 Mile."
    },
    {
      "rating": "5",
      "text": "When it all started to go down the toilet still funny in parts but rushed with bad acting in parts."
    },
    {
      "rating": "10",
      "text": "bom, um otimo filme de paródia, ele é muito engraçado, personagens incríveis com otimo carisma, roteiro exelente e muito bom, atuações muito engraçadas e legais."
    },
    {
      "rating": "9",
      "text": "favourite film as a 7 year old and it still is now... im high rn lol but srsly i love this film ever since i was7"
    }
  ]
}