{
  "id": 128,
  "title": "Scary Movie",
  "starring": [
    "Anna Faris",
    "Jon Abrahams"
  ],
  "runtime": 88,
  "genre": [
    "Comedy"
  ],
  "description": "A familiar-looking group of teenagers find themselves being stalked by a more-than-vaguely recognizable masked killer! As the victims begin to pile up and the laughs pile on, none of your favorite scary movies escape the razor-sharp satire of this outrageously funny parody!",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lRQiJXETkCnVVurHmglNvMXrZOx.jpg",
  "categories": {
    "plot": 6.454545454545454,
    "acting": 6.384615384615385,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 6.902777777777778,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Probably one of the best comedies along with Airplane! and Liar Liar. It's gross, silly and satirical, and therein lies its charm. The thing about reviewing Comedy is its so subjective - either you find it funny or you don't. In this case, I'm in the camp of the former. One of my favourite comedy movies of all time, and definitely a benchmark against which other parodies should be measured."
    },
    {
      "rating": "4",
      "text": "Pretty stupid, but does have its LOL moments.  Cheap, sometimes effective.  It did push the grossness envelope back in its day, but today the gags don't hold up as well.  Fun for what it is."
    },
    {
      "rating": "8",
      "text": "a pretty funny movie by the waynes brothers. its commedy is in the style of Airplane . its very goofy and off the wall but pretty damn funny. the humor is pretty crude pretty often so if sexual humor turns your head then you should pass. i thought the funniest part of the movie was the charicter Doofy . he just had me laughin on the floor."
    },
    {
      "rating": "8",
      "text": "I don't see why people don't like this movie. its totally hilarious!"
    },
    {
      "rating": "8",
      "text": "Scary Movie is a very funny parady of the scary films. Stupid yes but one of the funniest films of the year. Couldn't stop laughing throughout the film. Very crude film and thats good."
    },
    {
      "rating": "7",
      "text": "Most of the jokes are stupid and much like the movies of Aaron Seltzer and Jason Friedberg  But the jokes which work are very funny especially the one's with the masked killer who is hilarious. Scary Movie may not have a huge fan club and a cult following but it is in places hysterical. Shame about the sequels eh."
    },
    {
      "rating": "10",
      "text": "This is The. Best. Movie. Ever. It is absolutely hilarious, and the cast is amazing. But, this movie is not appropriate at all. Three instances of full male nudity, female upper nudity, and back nudity of all genders."
    },
    {
      "rating": "7",
      "text": "This is a pretty funny movie! Although there are a few jokes that are bad, the majority of this film is relatively funny and interesting. Now, I wish I had a shirt that says blunt on it."
    },
    {
      "rating": "8",
      "text": "Scary Movie (2000) is the first film in the \"Scary Movie\" parody series that revolves around making fun of what was originally just horror movies, but eventually by the time of the 3rd part, features other movies that were not horror. Scary Movie is a very memorable film to me, and really showed what a true spoof is. To me, this film is up there with Airplane! and Spaceballs. The film has non stop humor much like Naked Gun, while having characters that you actually care about and have some development. Directed and written by the Wayans brothers, who also act as main characters in the movie, this film received an R rating, as did the second film. However, 3-5 were directed by different people and received the PG-13 rating, giving them less freedom. Scary Movie was actually a box office hit, making a few hundred million dollars. Acting isn't too bad in this film, and you are constantly entertained. As a bonus, the main antagonist, Ghostface, taken from the popular 90's horror franchise Scream, has some very funny scenes where he interacts with other minor characters. All in all, this is a great spoof movie with an actual story, that is entertaining with decent cinematography and puns. Overall, I give thus film a 8/10."
    },
    {
      "rating": "8",
      "text": "This is a really funny movie.Scary movie is always really funny and the actors are not really good so the movie is even more funny because of that.He's definitely one of my favourite scary movie by far."
    },
    {
      "rating": "1",
      "text": "Funnier than getting sick through your eye sockets, but only slightly."
    },
    {
      "rating": "1",
      "text": "In the ten years since this movies release we have been subjected to endless sequels and spin offs of this original movie. The fact that the franchise managed to go downhill from here is quite frankly staggering.\rIt is all very well spoofing another movie (The Hot Shots movies were largely successful at doing this) but it needs to be done with some level of intelligence. Simply copying scenes from well known movies, in this case mainly Scream and adding in a few rude jokes is not clever or funny. In fact the writers of Scary Movie seem to have completely missed the point of Scream, which was itself already a send up of horror movie conventions.\r Avoid at all costs."
    },
    {
      "rating": "7",
      "text": "The most respectable pro of this film is the jokes and gags almost never cease throughout, and even though most are crude and the plot is slim, it is genuinely hilarious."
    },
    {
      "rating": "2",
      "text": "Even spoof movies deserve a few good jokes. For the most part the humour in Scary Movie is obvious, inept and crude. We get it Wayans Brothers and co. you've seen Scream, I Know What You Did Last Summer, The Blair Witch Project and scores of other films - so why do you fail so completely in writing clever gags referencing them? There are a couple of moments I must admit that I laughed at, and the Usual Suspects homage and some of the Scream nods raise the odd smile, and Anna Farris works rather well as a goofy comedy performer. Beyond providing some mild amusement, however, Scary Movie is pretty awful. Clumsy direction, lazy performances, uneven story pacing, in addition to a quite grating overall feel of buffoonery drive the film into the ground. A Zucker/Abrahams/Zucker parody film this is not - it's simply not smart enough. It's merely a poor imitation, both of the aforementioned comedy trio's landmark spoof films, but of the films that Scary Movie itself chooses to spoof."
    },
    {
      "rating": "8",
      "text": "its a classic, it´s not a Genius Comedy but it´s still a    classic"
    },
    {
      "rating": "1",
      "text": "Some funny parts, but mostly gross and offensive. There are so many things wrong with it: male nudity, sterotyping, and other offensive scenes. A horror spoof can be as bad as a horror re-make."
    },
    {
      "rating": "9",
      "text": "I thought it was hilarious! And even if it was a little over-done, it was brilliant. I strongly recommend this for a \"Saturday Sleepover\", just like I watched it. BRILLIANT!"
    },
    {
      "rating": "10",
      "text": "This is the funniest movie I have ever seen. I can't believe people disagree with that! I hope there is a 5th one."
    },
    {
      "rating": "8",
      "text": "As far as parodies go, this is among the best. Insanely funny. You are just a wicked old cruel ass if you think this movie is bad. Short and silly. One of the best of the series."
    },
    {
      "rating": "9",
      "text": "I'm a big fan of this Parody series and after watching the first four many times I can easily say this one is my favourite. 3 & 4 put up tough competition but at the end of the day this is where it all began and where we were introduced to the likes of Cindy & Brenda along with the rest of the gang. It's full of classic parodies and gags with Scream and IKWYDLS being the main ones, but overall it's a very funny parody that anyone can have a really good laugh with, and I highly recommend it!"
    },
    {
      "rating": "9",
      "text": "I love the wayans  brothers  and there not so hilarious film like  white chicks , little man . but still there films are great . and this one is  89 % worth watching  and it is (8 % not worth it . some  of  parody was kinda distrubing  and some i do not get . but hey its a Wayans brothers movie\rGrade A- ."
    },
    {
      "rating": "9",
      "text": "WAZZUP!!!???With a smart script, Hilarious spoofs, And plenty over-the-top moments. Scary Movie is what a spoof movie should be."
    },
    {
      "rating": "8",
      "text": "I find Scary Movie as a hilarious film to watch. The characters are funny and quite dumb, the concept of the movie is fun, and Ghostface is so cool. 9/10.My opinions on the other films:Scary Movie 2: 7/10.Scary Movie 3: 6/10.Scary Movie 4: 4/10.Scary Movie 5: 2/10."
    },
    {
      "rating": "5",
      "text": "I admit that the gross out fusion comedy \"Scary Movie\" is terrible. However, giving its worst as its best was a bold, appropriate choice for the movie to present itself and earn credit."
    },
    {
      "rating": "7",
      "text": "In my opinion, this movie is so stupid and so flawed that it's a damned near perfect spoof comedy, cause aren't spoof movies supposed to be those things? Yes, yes they are. Shorty makes this movie 10 times funnier."
    },
    {
      "rating": "4",
      "text": "Spoofs and satires can be hilarious if made right, but nowadays the genre consists of cheaply made, unfunny movies like this one. This genre needs to be turned in the right direction for once!"
    },
    {
      "rating": "6",
      "text": "Funny film with hilarious pranks and falls."
    },
    {
      "rating": "6",
      "text": "Scary Movie has caught my guilty pleasure, its crude and raunchy but I admit that I laughed when I didn't want to. The funny as hell spoofs were eye catching and fun to cam. While the critics don't take the tamest of the series's pleasure, Scary Movie is a average blockbuster. When Anna Faris gave up her role in the worst of the Scary Movies- SC5, I was surpirsed how this excellent actor saved herself. Scary Movie might be a extreme- porn  theatre film, it won my funny bone."
    },
    {
      "rating": "10",
      "text": "Just funny. Well not as much jokes as the original and some of the jokes take of while to laugh but I still love this movie and it aged well but some little flaws."
    },
    {
      "rating": "9",
      "text": "Completely hilarious, and the perfect example of spoofing done right. It not only pokes fun at the movies \"Scream\" and \"I Know What You Did Last Summer\", but it pokes fun at just about all the teen-slasher horror movie tropes we've come to expect from the genre. It's vulgar, crude, and rude and makes no apologies for it. It's gross-out humor is endlessly entertaining and keeps the laughs coming. Make no mistake \"Scary Movie\" is a hilarious comedy and it might just be the best spoof out there."
    },
    {
      "rating": "7",
      "text": "A very entertaining movie where you will laugh to death."
    },
    {
      "rating": "6",
      "text": "Scary Movie is a series of American comedy films created by Keenan Ivory Wayans with his younger brothers, Shawn Wayans and Marlon Wayans, that mainly specialize in parodying horror films, which have collectively grossed over $895 million at the box-office worldwide. The two main recurring actors of the first four installments were Anna Faris and Regina Hall as Cindy Campbell and Brenda Meeks, joined by new or recurring actors and characters."
    },
    {
      "rating": "5",
      "text": "Its humor is way too stupid to recommend, but Anna Faris leads the movie to almost victory with her sharp and hilarious performance. I give this movie 51% of a good movie."
    },
    {
      "rating": "3",
      "text": "I made have said that I thought Scream made scary movies better to watch again while also ruining it at the same time, I meant to say that about this film. I still have the same thought about it in Scream, but it's more clear here than ever. I mean my God this is so pathetic. It is the antithesis of what I look for in any film: likeable characters, a point, being interesting overall, and visually pleasing. Not only are the actors bad in this, but they're so annoying. There's no settle moments; sure I'll laugh maybe once in a while, but I feel like shot afterwards. The point of this film is to only cash in, there's no other fricking reason for this to exist. I think this could be done well; the idea of parodying a parody is somewhat interesting, but this is the completely wrong way of doing it."
    },
    {
      "rating": "9",
      "text": "In terms of parodies, it doesn't get any better than Scary Movie. Even now, the comedy and jokes are extremely funny."
    },
    {
      "rating": "6",
      "text": "En su momento era bastante graciosa y fresca, pero ha envejecido pésimamente mal."
    },
    {
      "rating": "6",
      "text": "Funny? Yes. Gross? Yes? Bad acting? Yes. Poor dialogue? Yes. Bad writing? Yes. These are the things that comprises the Wayans Brothers' take on slasher parodies. I have to admit, it is funny sometimes, and offensive even. The main problem is the bad acting and the poorly-delivered dialogue that seems to come out of a bad teen movie, if this isn't one."
    },
    {
      "rating": "1",
      "text": "One laugh in the whole thing.Gross and disgusting but not funny."
    },
    {
      "rating": "9",
      "text": "If you are not comfortable with sexual humor, then may not like the movie, but i really think it is funny."
    },
    {
      "rating": "7",
      "text": "Too crude for adults and too inappropriate for kids, but it's the perfect teenage comedy."
    },
    {
      "rating": "0",
      "text": "What so nice about this show? This movie probably is worse, stupid and boring. Its not talking about scary things. Its talking about sexual harrassment movie. It was gross and totally brain dead. If u havent watch this, dont."
    },
    {
      "rating": "7",
      "text": "First time I saw this, I laughed like hell. It was very funny. Re-seeing this, it's still funny as hell, but some jokes are worn thin. The infantile humour is getting annoying as the movie progresses. Profanity and fifth-grader tiltillation is no replacement for what brought the movie down most in my opinion: a dire lack of wit in the dialogue. And by that I mean the British definition (look it up). This is probably the only good movie from the Wayanses before they lost their funny and went desperate, aka: cluttering up movies with subpar spoofs of everything under the sun. This is the only one where the subpar and good parodies are in equal number. For the rest, it's a needle in a haystack. This is probably because... well... they didn't write it. Which begs the question. Why is it that when \"Scary Movie\" was directed by David Zucker (I still admire the guy for the sheer comedy of \"Airplane\" and \"Naked Gun\"), it still blew? Maybe the Wayanses wrote that one."
    },
    {
      "rating": "10",
      "text": "I like such movies that makes jokes of another one or with the logic. Of course you need to know the movies, that are copied here. And there are so many funny and today classic scenes here."
    },
    {
      "rating": "7",
      "text": "Scary Movie is one of those films that does exactly what is says on the box. It's silly, gross, cheesy and fun enough. Perfect for teenagers or drunken college kids."
    },
    {
      "rating": "8",
      "text": "The movie we thought would revitalize the spoof movie genre. We were so wrong. For itself it is a good spoof movie but also the reason many awful spoof movies were created. Each sequel got worse and worse. With 5 movies this is an achievement that I don't think I can archive willingly (Maybe I am exaggerating because I am incompetent in movie making, but not as much as it should be). But back to this movie: It is a parody of different horror movies, mainly Scream with side jokes for Blair Witch Project, Sixth Sense, American Pie, Matrix and more. The humor / jokes in the movie work really well and play with the stupidity,  stereotypes and tropes of Horror Movies. For me >90% of all jokes are funny. The Actors are well chosen for their roles and deliver the stereotypes and their jokes very well. I don't think I should rate the story for itself in a spoof movie that can completely tracked to another movie. I will rate the humor and creativity instead which is a win for this movie. Overall a movie worth watching but not in the Top 10 for spoof movies. Special warning! Like I said each sequel got worse. Stay away as far as possible from the Sequels especially from 4 and 5."
    },
    {
      "rating": "7",
      "text": "MEDIOCRE, but guilty pleasure\rThis movie and the 3rd one in the series are two of my all time guilty pleasures.\rI admit is not a great film but I'll admit I found it really funny."
    },
    {
      "rating": "5",
      "text": "Scary Movie is at first glance a terrible parody film. But first, at that time, subsequent films were not yet known. And second, it 's so bad here, it 's even good. Yeah, it 's a crack, but a couple of funny moments are still there. You can look once."
    },
    {
      "rating": "7",
      "text": "Scary Movie. What is your favorite parody movie? The Wayans brothers have made a truly iconic piece. They collected all the best that was in the movie Scream and added to it a tone of humor and jokes for the toilet. After this movie (Scary Movie) it will be very difficult to take Ghostface seriously after hanging out with Shorty Meeks. And the most and most important thing is not to repeat my mistake. Watch Scary Movie first, and then watch Scream even after many years. Because there will be a small spoiler, everything that happens in the \"Scary Movie\" almost one to one copies his terrible brother Scream."
    },
    {
      "rating": "6",
      "text": "This adolescent film (one of the most abominable cinematographic genres) was made to mock some well-known horror films. The clearest victim was Wes Craven's film \"Scream\", but if we pay attention we will see scenes that satirize other films such as \"I Know What You Did Last Summer\", \"Blair Witch Project\" or \"Sixth Sense\". Interestingly (or perhaps not so much), the working title of \"Scream\" was \"Scary Movie\" and the studio responsible for the two films is the same: Dimension Films. Talking about the plot here would be not only redundant, but it seems to me a mistake: by mentioning the most spoofed films here, I think I have already left enough clues about the plot. Whoever wants to know more, please go see the film.The film is a satire, it was made to entertain, and it is clearly aimed at young audiences, so it is better not to be expecting something complex or a dramatic show. This is not a movie designed to win Oscars or anything like that. It is a film to make people laugh, for the easy laugh of teenagers who don't think much, love eschatological humor or suffer from a serious obsession with everything related to sexuality. But that does not mean that it is a bad or abominable film, as many teen films really are. In fact, it turned out to be a pleasant film, one that you can't revisit often or make us laugh out loud (although it varies from one person to another) but it will put some smiles in the most circumspect audiences. For me, the film has both good and bad things: I don't like such an immoral humor, but it is impossible not to laugh at some situations. Parodying horror films also helps, although the choice of these films is debatable.The cast is led by Anna Faris, and she does a satisfying job, just as Regina Hall and Jon Abrahams, Marlon Wayans and Shawn Wayans are decent enough, but do not exceed the average. Carmen Electra does not work well as an actress, she appears only to show her generous cleavage whenever necessary, and Shannon Elizabeth is not much better than her. But the one who really does badly in this film is Dave Sheridan, thanks to the horrible and offensive character that happened to him. There is a limit between being politically incorrect and being offensive, and the character Duffy overcomes that limit by the insulting way in which he portrays a mentally retarded man. And it's not even worth mentioning the fact that this character is annoying and not funny at all."
    },
    {
      "rating": "0",
      "text": "As unfunny as it is trashy. You forget it's a parody of a horror movie. Get a barf bag and the sensibilities of a 12 year old."
    }
  ]
}