{
  "id": 1049,
  "title": "Scary Movie 4",
  "starring": [
    "Anna Faris",
    "Regina Hall"
  ],
  "runtime": 83,
  "genre": [
    "Comedy"
  ],
  "description": "Cindy finds out the house she lives in is haunted by a little boy and goes on a quest to find out who killed him and why. Also, Alien \"Tr-iPods\" are invading the world and she has to uncover the secret in order to stop them.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4SMqo8Me8aCT4KAVLeG9pk8VYiN.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 4.75,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.5,
    "funny": 4.916666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "A stupid movie which is only mildly amusing, and only mildly amusing every 10 minutes. Leslie Nielsen has less screen time to Scary Movie 3 which is always a bad sign. The acting is terrible, the special effects are terrible, the plot is terrible but the jokes are alright."
    },
    {
      "rating": "1",
      "text": "So bad it's good, then bad, then good, then finally bad. A bunch of immature jokes that revert to repetitive toilet/sex jokes rather than actual spoof."
    },
    {
      "rating": "5",
      "text": "Unfortunately, this installment is simply less funny than all the other films."
    },
    {
      "rating": "4",
      "text": "David Zucker's second stab at a Scary Movie is about as hit-and-miss as his first attempt. Leslie Nielsen is still great (when was he not?), and his not too subtle moronic presidential parody of George W. Bush has to deal with various threats to the planet from various Hollywood genres, with help from returning haphazard heroine Cindy (Anna Farris) and Craig Bierko, who's playing Tom Cruise from Spielberg's War of the Worlds. Easily the funniest scene in the film is the prologue, which finds Dr Phil and Shaquille O'Neal imprisoned in the infamous Saw bathroom. All the J-Horror spoofs (dominated by The Grudge) are also executed pretty well, but like always with this series, when the humour becomes lazily crude and body function-obsessed, the film achieves more in terms of sheer annoyance than anything that actually makes you laugh. I'm not saying Zucker is a dignified comedy genius lowering himself to depravity for the first time - Airplane and Naked gun were often very juvenile, but this kind of humour was well-timed and balanced with different kinds of jokes. When a film only uses gross-out comedy to promote childish snickers, then it comes across as incredibly shallow and unmemorable. Thankfully, Scary Movie 4, like its predecessor, has a couple of memorable and funny sequences, but the big laughs are few and far between."
    },
    {
      "rating": "7",
      "text": "This is by no means a great film, but it's by no means a bad one either. I found it funny, charming, and a great film to watch with your friends on a Friday night at 10:00. Granted, the movie's Citizen Kane compared to any of the Meet the Spartans, Epic Movie, Date Movie, Disaster Movie, or Vampires Suck crap that's been released, but that's not saying much."
    },
    {
      "rating": "5",
      "text": "You are beginning to see this is starting to get old with its recycled jokes. Scary Movie 4 has its moments but also carries a laziness that doesn't make it has funny as its predecessors."
    },
    {
      "rating": "5",
      "text": "While this installment follows an actual story, it doesn't deliver as much on the raunchy funny scenes. The series is loosing steam. It becomes more difficult to realize whether you are laughing at the jokes or the movie itself."
    },
    {
      "rating": "7",
      "text": "This was the first Scary Movie i saw, didn't watched the first 3 before this one so i had no expectations. It was scary and funny, what i expect from it. Nothing much to say except that there was a lot of part to laugh and some scary parts but nothing too great, i liked the way they did the \"Saw\" and \"Ju-On\" parody."
    },
    {
      "rating": "8",
      "text": "The last of the series (that's right I hardly count the fifth entry as part of the series) is still very funny and while the first and third are just that little bit better it still triumphs over the second. War of the Worlds and The Grudge are the main parodies here along with some other pop culture references. Cindy and Brenda are of course back again joined this time by Tom replacing George. Overall a good way to end what was a great series before that fifth one came along and screwed it up!"
    },
    {
      "rating": "6",
      "text": "One of the stupidest movies I've ever watched. It's still enjoyable in a so-bad-it's-funny sorta way. Lots of jokes are funny because they aren't funny, but some of them can hit a bullseye(the Detroit & heart attack jokes are some examples). There's some gross-out humor which I'm not a fan of, but it's definitely the best possible sequel to the first Scary Movie. Certainly better than Scary Movie 2..."
    },
    {
      "rating": "5",
      "text": "Scary movie returns its funny but not better then the precious films (  1,2,3 which the first one was  a good genre of comedy from the wayans brothers expect the first one and the second one was funny , but to much black humor you can never let a black man have anything to with horror comedies  No offense Keenen Ivory Wayans ,   they turn into a disaster ask yourself one thing why would you make a parody of the best horror   movie of Wes Craven's classic suspense horrific  thriller  ? ). A funny movie with Anna Farris and regina hall Grade 5/10 ( maybe a C)"
    },
    {
      "rating": "6",
      "text": "This one is even worst than the 3 it's incredible.There is 1 or 2 laughs but the story of war of the worlds is bad already bad why do you pick it to make a worst movie? just why."
    },
    {
      "rating": "5",
      "text": "its watchable, got some good Scenes but nothing more.    order 1,3,2,4,5"
    },
    {
      "rating": "5",
      "text": "BAD\rThe first and the third one in the series are two of my all time guilty pleasures.\rThis one I think is just bad. But I still think it's better than the 2nd and the 5th one."
    },
    {
      "rating": "7",
      "text": "This is the fourth film in the \"Scary Movie\" franchise ... and this time, Cindy is going to get a new job as a health care provider and face an alien invasion. Of course, the film is full of satirical situations and parodies of notable films like \"Grudge\", \"War of the Worlds\", \"The Village\" and \"Saw\". That is, this film repeats the same formula that we already know. Despite this, it far exceeded my expectations. I felt that the jokes are much better and funnier than those of previous films, including the first one. The sexual load is still present, but it has been reduced and the dialogues are the best so far. Honestly, for me, this was the movie that I liked the most in the franchise, so far.There is no doubt at this point that the best thing that could have happened to the \"Scary Movie\" franchise was the change of director and screenwriter and the arrival of David Zucker. In the first two films, the Wayans clan dominated actors, director and screenwriters. In the third film, Zucker already takes the direction but accepts a script from the Wayans. Here, he had more control over what he wanted to do, assuming direction and script, which was undoubtedly an improvement.The film again features Anna Faris and Regina Hal in their usual characters. This time, I liked their work more. Hall's character, whom the previous films had made into a nymphomaniac, was much better developed here and the two actresses seem to have received better material to work with, obtaining better results from their efforts. I also enjoyed watching Leslie Nielsen, with a series of jokes and situations so anecdotical that it is impossible not to laugh. Honestly, I can understand why Nielsen has collaborated so actively with Zucker in other films: he knows how to get the best out of Nielsen, much to the public's delight. Alonso Boden is very good and Carmen Electra, Michael Madsen and Charlie Sheen do a satisfactory job. The cast, in general, did quite well. The opening sequence, with Phil McGraw and Shaquille O'Neal, is memorable.Technically, the film is quite interesting. There are good special effects and CGI and the sets and costumes also play their part very well. It is a longer film than the others, with about 90 minutes, within the average of a feature film. It has a good pace, it doesn't waste time, the jokes follow one another quickly and don't let the audience stop laughing."
    },
    {
      "rating": "3",
      "text": "Funny if you're a 2 year old."
    },
    {
      "rating": "2",
      "text": "Anna Faris leave this franchise now so it can be so bad it will stop making movies. As unoriginal as expected and silly, stupid and offensive. I will always wonder why this franchise is making money at all. It has everything bad from all four movies. I do not think the series will ever be good again. I give this movie 24%."
    },
    {
      "rating": "2",
      "text": "Holy ****"
    },
    {
      "rating": "3",
      "text": "There is a fine line between parody and satire, and it seems to me, especially from seeing the Scary Movie films, that only one of these genres work. How can I clarify this? Scary Movie is a parody. This is Spinal Tap is a satire. Parodies poke fun at something and sometimes retell a story in a comic or ridiculing way. Satires usually create their own story and actually play to be fans of the works they are mimicking. Either can be funny and that is what their intentions are, they are usually sub-genres of comedy. The problem with The Scary Movie films are they are parodies that keep poking fun at something that it continuously keeps doing so that you almost pitty the work they are mimicking. These movies parody horror movies, usually of the last few years, though the first two movies in the franchise played off the classics. I found this in much better taste, considering more people could get a kick out of them. The last two films do just the opposite and it is clear that the movies have established their target audience, the people who have gone to the theater to go see these recent crappy horror films. The third film was much better than its previous, especially introducing Leslie Nielsen as the idiotic and"
    },
    {
      "rating": "8",
      "text": "my god! the whole franchise just gets funnier and funnier every time. this movie is extremely funny!"
    },
    {
      "rating": "5",
      "text": "This is the worst of the series after the second part."
    },
    {
      "rating": "4",
      "text": "The Scary Movie formula had not aged well when this movie came out. However there are great jokes and good humour in this movie while I must admit at the same time that half of the jokes did not work that well. It is hit and miss in a pure form. The cameos are dividing the viewers. Some enjoy them and others say the movie is overstuffed with them. The foundation for this movie are War of the Worlds and The Grudge with many side-blows to other movies like Saw, Million Dollar Baby, The Village and others. I am also divide by this movie. I see the potential for a far better movie that is hold back by poor jokes and to much content. Maybe they should have made less references and stick more to fewer but better developed humour. It is hard to describe what makes classics like Spaceballs and the Naked gun work. For me it is the structure, developing ideas and the seriousness in giving us hilarious spoofs, jokes and parodies. This movie hits the marks not often enough while missing many by far. The acting is what you expected from this sort of movies. It is a vehicle for the humour. Overall not worth seeing as a whole movie with a few notable exception as some scenes and jokes are great."
    },
    {
      "rating": "5",
      "text": "Bastante regular, pero lejos mejor que las dos primeras películas, un poco forzada y bastante apagada si de humor se trata."
    },
    {
      "rating": "10",
      "text": "This movie is hilarious but one part did kinda scare me. But I won't spoil it. The movie is funny and brings back one of the hilarious characters...Brenda!"
    },
    {
      "rating": "3",
      "text": "Scary movie 4 is a typical parody film that does not skillfully parody horror films. At the same time, the main storyline why, then Spielberg's film radiates Sci-Fi in general. And it doesn't make it funny at all. Scary movie 4 is the most boring and secondary part in the series at the time of its release."
    },
    {
      "rating": "7",
      "text": "DecentThough still inferior to the original, Scary Movie 4 is still tons of fun to watch."
    },
    {
      "rating": "4",
      "text": "I don't find Scary Movie 4 as good as the first 3 films, but it's way better than Scary Movie 5. The whole movie is decent and funny, but I couldn't enjoy it like the other 3 good movies."
    },
    {
      "rating": "10",
      "text": "It was a great movie that had me in stitches."
    },
    {
      "rating": "0",
      "text": "Watched this film yesterday, it was really terrible. The humor is immature and stupid and is just sick alot of the time - may I point out I'm a teenager, soif I find it immature, what would most people feel about it. Another problem with it also is that many of the jokes are reused from other shows. There is one example when they try to steal clothes by beating the person up but just get beaten up and you feel like shouting \"That's off The Simpsons!\". Its just a shame that they waste the talent of Leslie Nielson on this tripe, concidering hilarious films like Airplane."
    },
    {
      "rating": "0",
      "text": "There's both good and bad things to say about this movie. First, the bad. This movie was chock full of slapstick comedy that was comparable of a 6th grade boy running into a wall 32 times in a row in order to get attention. After the 2nd time it loses its appeal, yet it never ends... ever. The parody aspect of the movie was so lackluster that many of the people in the theater were like \"What movie is that from?\" I will be the first to admit there are a large amount of stupid people in my geographic area (no I don't live in Alabama), but there was not a single incident in the entire movie that motivated me or any of the surrounding viewers to give even a sympathy laugh. However, the good part about this movie was that I snuck into it after watchin Ice Age 2. Overall assessment - not a single shred of talent - 0 out of 10."
    },
    {
      "rating": "7",
      "text": "Some comedies, when done right, are like a pro with a bow and arrow: not an infinite amount of em, but they use such precision that the pay off is enormous. Not Scary Movie 4. This is the kinda movie that throws everything, including (quite literally) the toilet seat, at the target in hope that some will stick. And I guess a lot do. This was a lot like Date Movie for obvious reasons, though a big difference is David Zucker is involved, and like Airplane there are a few very funny and truly witty pieces of dialogue, though here it is quite a bit scarcer. The potty humor is really awful, but a surprising amount of the gags are so silly or done in a way that it's hard not to laugh. I actually felt that Date Movie for the most part had more gags per minute. If you liked any of the movies that are spoofed here, especially War of the Worlds, I think it's worth going to if you go in with the right mind set."
    },
    {
      "rating": "5",
      "text": "Scary Movie 4 left me disappointed. I had higher expectations, even for a Zucker film. This flim was pieced together and 4-gettable! Like Survivor the reality show, it has lost it's flare. When you find more humior in the Michael Jackson scene than the rest of the film, it's time to stop."
    },
    {
      "rating": "10",
      "text": "I loved this movie! Sure its a little weird. I found that 15 to 21 year old like it most. Thats what this kind of humor is for..."
    },
    {
      "rating": "2",
      "text": "Easily the worst of the Scary Movie filmms. The jokes on the most part were terrible, there were log periods of time when the cinema was quiet! About as bad as Goldmember."
    },
    {
      "rating": "7",
      "text": "It was good. It had it's moments, but got a little slow near the end. It spoofed the movies well, but had a lot of missed opportunities to. More slapstick than clever. So go if you want to dumb yourself down a bit."
    },
    {
      "rating": "0",
      "text": "Stop desturbing me with this kind of movies! Bah! Maybe funny for kinds born in 1998!"
    },
    {
      "rating": "10",
      "text": "i thought it was the best scary movie yet! i think a ten year old can see it but it still had lots of language overall it ruled!"
    },
    {
      "rating": "1",
      "text": "The series has lost it's touch. There is an odd laugh now and again, but nothing to justify wasting good time over."
    },
    {
      "rating": "9",
      "text": "I could not stop laughing even weeks after the film was over... In my opinion, the best Scary Movie."
    },
    {
      "rating": "5",
      "text": "Probably the worst of the quadrilogy... There are some good entertaining moments (the first scene with O'Neal is quite funny), but the rest is a mix of old jokes, incomprehensive gay humor and odd scenes. Scary Movie 3 was all another thing."
    },
    {
      "rating": "9",
      "text": "One of the most funny movie EVER (after scary movie 3) !!! If you relax and stop worrying about the plot you'll find it hailarious because of it's stupidity!"
    },
    {
      "rating": "10",
      "text": "With Scary Movie 4, director David Zucker and screenwriters Jim Abrahams and Craig Mazin (let's call the trio: \"ZAM\") do more than just spoof recent scary movies. ZAM's gags, puns, and parodies bring out the philosophical confusions at the heart of contemporary responses to politics and art. In other words, ZAM's \"bad taste\" exposes the hegemony of \"good taste.\""
    },
    {
      "rating": "7",
      "text": "It is a very funny movie. The movie tries to relate to the third one. It is not the best scary movie yet."
    },
    {
      "rating": "6",
      "text": "Plenty of laughs throughout. Just don't expect comedic gold."
    },
    {
      "rating": "6",
      "text": "Funny but not nearly as good as Scary Movie 3."
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie! It is not only the funniest movie I've EVER seen, but it's one of my favorites this year. Anna Faris and Regina Hall are amazing as always, and the excellent supporting cast include Craig Bierko, Simon Rex, Anthony Anderson, Molly Shannon, Leslie Nelson, Charlie Sheen and many more surprise appearances. It did a perfect job at mimicking the films it was spoofing, and the sets, costumes and lines were nearly exact from the spoofed movies. Awesome flick to kick off the summer!"
    },
    {
      "rating": "9",
      "text": "I realy think the movie was great! I realy do. It was awsome with Shaq."
    },
    {
      "rating": "2",
      "text": "The acting was poor and abysmal, the humor was undeniably pathetic and the movie was just as bad as anything else you could see this year. As the opening scene plays into key you see Shaq or Shaquille O' Neal in the clutches of the murderer in the movie \" Saw \" with him is a man in a corner which is Dr. Phil. Now what do you think about this? Dr. Phil and Shaq in a movie don't go near it please. It just isn't funny, I laughed once because I felt uncomfortable sitting in the movie theatre watching this pathetic excuse for a movie."
    },
    {
      "rating": "6",
      "text": "The movie was actually a lot funnier and more interesting then I thought it would be. After seeing the horrid SM3, I just couldn't imagine the series getting any better - I was wrong. The film was interesting, and the cameos were used to better the film, and not just to get star power into it. I read one reviewer who compared this film to Date Movie, which is insulting to this work - Date Movie was 100s of times worse then this movie was even at its lowest."
    },
    {
      "rating": "0",
      "text": "I used to think House of the Dead was the worst movie ever. Then i saw scary movie 4."
    }
  ]
}