{
  "id": 83,
  "title": "Scarface",
  "starring": [
    "Al Pacino",
    "Steven Bauer"
  ],
  "runtime": 170,
  "genre": [
    "Action",
    "Crime",
    "Drama"
  ],
  "description": "After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.",
  "releaseYear": "1983",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iQ5ztdjvteGeboxtmRdXEChJOHh.jpg",
  "categories": {
    "plot": 8.5,
    "acting": 8.764705882352942,
    "ending": 7.0,
    "soundtrack": 9.75,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.25,
    "action": 8.571428571428571
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This movie was great and i think this was al pacinos best performence he ever did (beating the godfather) its great but the only thing i did not like about this film is that well to me when movies made me cry it means its great this made me cry also but in a differnt way it is a very very sad movie and to people who dont have brains shouldnt see this movie because the tony montana charecter isnt violent to me but he was just to dark"
    },
    {
      "rating": "10",
      "text": "Wow great movie, after a viewing of this its going down as one of my favourite movies of all time. if you like mafia movies your bound to like this. Al Pacino who plays (Tony Montana) a man who becomes a cuban drug lord. this movie really shows a side of what people can become with wealth and having an obsession with wanting more. i'm not going to spoil anything, if you haven't seen this movie already defiantly see it!"
    },
    {
      "rating": "10",
      "text": "Perhaps my favorite movie of all-time. Often compared to legendary heavyweight The Godfather, and often as inferior. That is to a large point understandable depending on your taste. However, Scarface is a very different film. I like that it manages to fit in a lot more humor and I find the very human characters the big draw. The Godfather has a much more calculating tone, whereas Scarface is much more volatile.What makes the movie so great is that it doesn't hold your hand and tell you what to think of Tony Montana or anyone else. It lets you take its wide cast of colorful characters. To me, Tony is a manifestation of very human desires - but he has a fascinating drive, passion, and intensity that is unparalleled. While it is a cautionary tale, I find plenty to admire in him. Unlike Michael Corleone in The Godfather, he is not thrown into the dark world of organized crime - he largely throws himself in. (with the help of hard drugs) But, we understand where his lust for the American Dream comes from when we consider his smothered upbringing.I feel that the movie has aged very well and isn't nearly as cheesy as a lot of movies from its era. It did what it set out to do. Sit back and enjoy the ride."
    },
    {
      "rating": "8",
      "text": "Good acting, Plenty of enjoyable action, and a story that is satisfying from begining to end. Scarface is the kind of movie that you simply must see. It's fantastic."
    },
    {
      "rating": "10",
      "text": "Scarface, what a movie, what a film, deserves to be the best(excluding The Godfather series). Pacino has acted ever so well in this damn movie. Immense action, drama, violence! Hats off to this great masterpiece."
    },
    {
      "rating": "10",
      "text": "This movie truly is a cinematic masterpiece. This movie shows Al Pacino at his best. This shoot-em-up classic shows the rise and fall of a true \"Bad Guy\" ."
    },
    {
      "rating": "10",
      "text": "How can somebody give this movie less than an 8? this movie is one of the greatest I have ever seen. It may be a little hard to follow at times and the end sucks, but Everything else in the movie makes that forgivable. Pure Genius"
    },
    {
      "rating": "8",
      "text": "I went into this movie thinking it was going to be overrated garbage. What I found was a very entertaining gangster pic. It's very 80's and extremely corny, but even that has it's rewards. The run-time is my only complaint about the film."
    },
    {
      "rating": "10",
      "text": "By far my favourite film of all time. No matter how many times I watch it, it's always just as good. Not only is it a classic, but it's very well directed, good acting on all fronts, great soundtrack and phenomenal story. The whole drug lord theme is particularly well-executed in that there is no holding back on violence, gore and drug use. This film has it all- suspense, action, story, characters and above all, the progression through the film is so consistent. It's entertaining the whole way through."
    },
    {
      "rating": "8",
      "text": "This movie is a classic and a brilliant movie. It is about a Cuban immigrant that moves to Miami in hope of finding a better life. He is caught up in a drug empire that threatens his life and the people around him. Lot's of violence, and  good effects for the time. A great gangster film, and a classic you have to say you've seen."
    },
    {
      "rating": "10",
      "text": "This movie comes as close to a \"ten\" that I could envision. So controversial for the times cause of its inherant depiction of violence-which compared to this day would be \"g\" rated. However, aside from the violence is the story most people can identify with-coming from nothing to be the best at something. Oh, and did I mentioned Pacino and Oliver Stone put definite stamps on this movie. If you can find pleasure in any one of these things, check your pulse."
    },
    {
      "rating": "9",
      "text": "Scarface great movie !!! And Why the hell A Carrie Remake 2013, in God's name?!!!! It's a perfect film! Brian de Palma filmed it perfectly, Sissy Spacek and Piper Laurie are absolutely perfect ,they both got Oscar nominations out of it, for God sake!"
    },
    {
      "rating": "9",
      "text": "An instant classic. The 1980's decadent lifestyle and music really complements the setting of the movie. It's about drugs and the consequences of rising to the top through illegal means. It's unfortunate that many people see Tony Montana as someone they should emulate. The movie is about the rise and fall of someone who wanted to own the world."
    },
    {
      "rating": "10",
      "text": "..........................................................................................Tony Montana Myth.....................One of best movie of mob.............Totally Underrated at the time of release....................But now is cult and acclaimed sometimes or always the critics fail........................."
    },
    {
      "rating": "10",
      "text": "Like most of the gangster films, Scarface is the first one from many years and some people didn't even know that it's actually a remake to the original B&W version. While I was thinking about this, it went on the whole new level with the violence for the most part because it's directed by Brian De Palma. I know he's not going to make a movie overly violent to get an NC-17. Al Pacino as Tony Montana is what everyone loves, his character is incredible with his Cuban accent and his dialogue. He has his friend, Manny and a younger sister and later takes over Frank Lopez' place and becomes addicted to cocaine. This is the first time that you'll see Steven Bauer and Mary Elizabeth Mastrantonio in the film. I love the soundtrack in this movie. The soundtrack is awesome and amazing. It actually came before Grand Theft Auto III which is amazing. I love all the songs in this such as \"Rush Rush\", \"Shake It Up\", \"Push It To The Limit\" my personal favourite along with \"She's on Fire\" and \"I'm Hot Tonight\". If you forgot about that Scarface starring Al Pacino is the original version, think again. This is a remake to the B&W film from the 1930's. Scarface is the original film shot in B&W in the 30's and now you're looking at the ultimate gangster and I mean, the ultimate badass! Al Pacino does a great job as Tony Montana. He's unforgettable in this. \"You wanna play rough? Okay. Say hello to my little friend!\" \"You know what I'm talking about, you f**king cockroach.\" And the script is great and it's written by the director Oliver Stone which is a surprising thought. He was Tony Montana. The world will remember him by another name ...Scarface."
    },
    {
      "rating": "10",
      "text": "A cinematic masterpiece, outstanding story and quality acting. This film is easily in the top 10 films i have watched. It also does a great job on engaging viewers and building some tension. This film is worth every second you spend watching it. Scarface certainly deserves a place along with films like 'the godfather'."
    },
    {
      "rating": "10",
      "text": "Never get high on your own supply.   This movie is genius and Al Pacino displays a terrific performance."
    },
    {
      "rating": "10",
      "text": "I'm insanely in love withe this movie. I will say no more.. watch it.Whether you are shocked or dismayed and digusted.... well, it's awesome either way.I'm an adult, and was one at 18 when I first saw and loved it. We each have our own opinions.GAWD I LUV THIS MOVIE!"
    },
    {
      "rating": "10",
      "text": "Scarface was a good movie to watch, I watched it like 2 times after the first time I saw it, that's how good it was to me. I think I might watch it again, since it's such a great movie."
    },
    {
      "rating": "10",
      "text": "Scarface is, simply put, DePalma's masterpiece. It has heavy amounts of violence, swearing, drugs, blood, drinking, lavish lifestyle, you name it. But that is the point and central theme of the movie: excess. It tries to turn Tony Montana, an evil, temperamental monster, into something human, and it succeeds. He is both the protagonist and antagonist of the movie, the tragic hero and the tragic villain. There are no drug wars here; Mr. Montana is at war with himself."
    },
    {
      "rating": "10",
      "text": "Everybody's fave criminal. The ultimate gangster film!!! Totaling 143 minutes in length you still crave for more!!!"
    },
    {
      "rating": "10",
      "text": "Its the greatest movie ever made.Its an instant classic.For me this beats the godfather.This movie is a fast action packed movie.It had great dialog,acting and a great plot.Its sad to think that the odds of Hollywood making another perfect movie like this or the Godfather is almost unthinkable."
    },
    {
      "rating": "10",
      "text": "This movie is a genius one because the main character is the bad guy, but the audience can still relate to him and see him as human.It is a love story,an action movie,a mystery crime kinda movie,and even in some parts it's even funny, all of which are great essences of this one of a kind movie."
    },
    {
      "rating": "7",
      "text": "Scarface is dirty, high and so crazy that it will leave you mystified. It's a basic cartoon with drugs and violence- and Al Pacino. Tony (Al Pacino), a Cuban immigrant soon creates a drug empire and owns billions of dollars. It's true that films need a meaning- well, Scarface doesn't have one. Al Pacino rocks- does coke and just kills every guy that he sees with his fast bullets. Scarface is meaningless, funny and stupid entertainment with drugs. Well say hello to his little friend and rent this film, NOW."
    },
    {
      "rating": "9",
      "text": "8.9/10................................................................................................................................................"
    },
    {
      "rating": "6",
      "text": "The Dramatic aspects are lacking but overall Scarface is meant to entertain like any viable film. The direction is heavy handed at times, jumping between a firework Rambo spectacle to a much more laid back tone; that of which is comparable to Francis Ford Coppola."
    },
    {
      "rating": "4",
      "text": "An overrated movie with way too much time on it's hands. Literally. The screenplay by Oliver Stone boasts big twists, but instead delivers vulgarities that only increase the crudeness of the film, not the quality."
    },
    {
      "rating": "10",
      "text": "One of the best drug lord or the best lord drug movie ever. Al Pacino is great and this movie has everything you want in a movie: drug, murder, and an awesome catchphrase."
    },
    {
      "rating": "3",
      "text": "The best C movie ever made. This film and most people that enjoy it don't seem to notice that it is a parody. I can't for the life of me figure out why anyone takes it seriously or would want an airbrushed t-shirt proclaiming their love for it."
    },
    {
      "rating": "3",
      "text": "Nothing more that mountains of cocaine, and never-ending violence. Scarface has absolutely no storyline. It is true that hollywood only makes movies with action, that have absolutely no meaning these days."
    },
    {
      "rating": "1",
      "text": "The most overrated movie ever? Possibly. I know that so many people drool over Scarface, but I honestly think it is a steaming pile of ***t. The reason that it gets a one instead of a zero is for the iconic final moments of the film. I was so glad to watch Tony die."
    },
    {
      "rating": "1",
      "text": "This is quite easily the most overrated film of all time. It's not even ****ing close. What makes it even more shocking is that this is the product of people who are actually quite talented; Brian DePalma, Oliver Stone and Al Pacino, neither of whom do themselves justice. Al Pacino is shockingly bad, his accent is just ****ing annoying, as is Stone's equally annoying script (or lackthereof) and dialogue. . There is no genuine plot to this junk, just tells us what we already know. Violence was absolutely pointless (and my favorite films are Goodfellas and Taxi Driver). One of the 10 worst films I've ever seen. Gets a 1 because I started laughing when Montana finally gets killed by Terminator. Goodfellas and the Godfather Part II are infinitely better examples of the American dream. Hell, if you want to watch a three hour movie about excess, check out the Wolf of Wall Street. At least that had yet another great turn by DiCaprio"
    },
    {
      "rating": "5",
      "text": "One of the most overrated films of all time. For people that set out to glorify this lifestyle, there are much better films out there to be attracted towards (Goodfellas, for one). There are times it comes across like it's begging to be parodied (how often do you hear \"say hello to my little friend?\"). Every now and then, Oliver Stone's script shines and Al Pacino does his best, but ultimately, I believe, it falls flat."
    },
    {
      "rating": "10",
      "text": "One of the best movies I ever seen in a long run.Al Pacino played a great role in this movie and the way how it ended was amazing.Best movie ever if anyone haven't seen it I recommended and yes I forgot one thing don't listing to the meta score go watch it"
    },
    {
      "rating": "10",
      "text": "Llegó el día de 'Scarface' sabía que esta película iba a ser de mis preferidas antes de verla, este sí es mi tipo de cine 100%. Este tipo de personaje y situaciones, en la que se pierde en control de todo y todo es como muy límite. Lo primero, no sé como será la original de Haws, pero quiero verla. Segundo, lo que estaba pensando en todo momento durante las 3 horas de metraje (las cuales son las 3 horas más rápidas viendo una película que recuerdo) lo que podría haber sido esta película si la hubiera hecho un Scosserse o un Peckimpah... Y en cierto modo, si que le voy a dar a De Palma un palito porque hay cosas que hace que no me gustan (pero es su estilo, eso sí). La película es mítica y estas vibrando todo el tiempo con uno de los personajes más icónicos y cafres de la historia del séptimo arte. El final es legendario, aunque ya le había visto, obviamente, por eso me quedo con la escena \"hermana, cuarto de baño\". En definitiva, ¿Es buena? Por supuesto.¿Es de obligado visionado? Está claro.¿Es una obra maestra del cine? NO, pero a mí me encanta. El ejemplo perfecto es \"El Padrino\", siendo mucho mejor película que esta, 'Scarface' me gusta más. Larga vida a Tony Montana."
    },
    {
      "rating": "7",
      "text": "This movie has a generic story that does little to distinguish itself from other rise to power stories, but there are some great monents and al pacino does a great job."
    },
    {
      "rating": "10",
      "text": "Scarface was greeted with almost universally bad reviews on its release in 1983 â"
    },
    {
      "rating": "10",
      "text": "Scarface is a spectacular crime movie that tracks the rise and fall of the legendary Tony Montana. Stuffed to the brim with fantastic performances, pulse pounding action scenes and ultra-memorable quotes, Scarface provides unforgettable moment after unforgettable moment. This is one of the best 'gangster' movies ever made and easily the most fun."
    },
    {
      "rating": "8",
      "text": "Scarface lives and dies with Al Pacinos performance as Tony Montana. He is brutal, out of control but also funny. The rest of the cast does also a good job but pacino outshines them all."
    },
    {
      "rating": "10",
      "text": "This is one of the peaks of cinema history, totally epic if you ask me. Characters, music, story...And the original theme of this movie. Watch it and then you will see."
    },
    {
      "rating": "7",
      "text": "When you watched Scarface as a kid, (assuming you were allowed to watch Scarface when you were a kid), it was thrilling and exciting, with all it's F bombs and gun fights, it's like nothing you'd ever seen before, but watching it as an adult, it doesn't give me the same thrill as it once did. Al Pacino is of course amazing, he's pretty much amazing in everything he does, but as far as the film goes, its centered on this masochistic **** who was never happy with what he had. Tony Montana, was never a hero or someone who was meant to be looked up to as one of the greatest characters of all time. As far as Mob films go, Scarface is so much easier to follow then most, as the timeline makes sense, and you're not introduced to new people every five minutes. While Al Pacino is terrific, the mumbled lines and enormous greed leave something to be desired. Not to mention that when you break things down, isn't the film really just business meeting, gunfight, personal life, repeat? After a while the film feels like it's going around in circles and really is kind of stale. People will always remember this film for it's epic finally, taglines, and the great Al Pacino, but as far as stories go, this one isn't something I would consider a classic or a can't miss film. Scarface has it's moments and has to be at the top of the list for action junkies, but beyond that, I found the story to be just your run of the mill mafia tale, focused on a guy, who was too greedy and too stupid to hold onto everything he worked so hard for."
    },
    {
      "rating": "8",
      "text": "The first time I ever watched this, I was in the fourth grade. Not my best choice at a young age, but ever since then, Al Pacino's portrayal of Cuban gangster \" Tony Montana has stuck with me for the better or worse. Scarface is a movie everyone should watch at least once. And even if its some what overrated, there is no denying  this is nothing short of a good movie."
    },
    {
      "rating": "9",
      "text": "ItÂ´s Scarface, we all know it, we all love it. Some of the best acting ever, by Al Pacino. A great main character, a good story, an amazing Miami Vibe and great music. The score by Giorgio Moroder, which was never officially released, has some great stuff. Great action and a gripping, often emotional story."
    },
    {
      "rating": "7",
      "text": "Wow, this was definitely pretty good. Now, it was entirely over the top and insanely violent, which hampered my enjoyment of it a tad. But, this look at a purely evil man that shows all the faults surrounding a man so evil is brilliant. On top of that, the over the top nature of this one is admittedly very fun. While the blood and violence can certainly be excessive, it has the comic feel to it that dulls the blow, thankfully. On top of that, the acting is great, especially Al Pacino. His accent may be a little much, but it really works with every over the top element here. The direction from Brian De Palma is also very strong. I honestly think this was the perfect project for him and he did a great job with it. The writing from Oliver Stone is also great and endlessly quotable. It is not hard to see how this one has such a long-lasting life after its release considering how quotable and enjoyable it is. Luckily, it is also expertly made. Overall, Scarface will likely scare away those with weaker stomachs, but if you can make it, it is entirely worth it. While I did not love it, I can certainly see why it gets so much praise."
    },
    {
      "rating": "8",
      "text": "Completely over the top and a little bit dated, but Pacino's performance is legendary. As is his character, Tony Montana, who is endlessly quotable, and has an unforgettable arc."
    },
    {
      "rating": "10",
      "text": "Best movies I've seen in this year is Looper and batman the dark knight rises  ,my all time favorite movie's are  The Godfather (1972) .Taxi Driver (1976).  Carrie (1976). Scarface (1983). GoodFellas (1990) . Raging Bull (1980) .Casino (1995) there masterpiece movies, what i don't like are the silly remakes why a new carrie movie ? this is the 4th movie carrie the made it's just stupid ,Sissy Spacek and Piper Laurie are absolutely perfect ,they both got Oscar nominations out of it, for God sake!"
    },
    {
      "rating": "10",
      "text": "Scarface is a disturbing 80's masterpiece with blood, guns, drugs and everything the world of crime has to offer to a racial-suffering Cuban immigrant, showing it's potential on portraying the crime scenes in the 80's, and extremely charismatic characters on out-of-the limit shootout scenes, looks like a good mixture of Rambo and The Godfather, while it features it's own world and quality itself."
    },
    {
      "rating": "10",
      "text": "\"Scarface\" is one of the greatest classics of the 20th century. It's heavy and brutal but it's very instructive too!  That's what happens to people who're insatiable. Okay, stop it SEROJ...now...i give this classic a 10/10, because it's Al Pacino at his best and it's going to be forever one of the greatest movies ever made. THE WORLD IS YOURS"
    },
    {
      "rating": "8",
      "text": "Wow, what a watch! You will root for the villain, Pacino in a very strong, threatening and cool performance. I wish this movie was longer! I was so attached to Pacino's character words can't explain it, purely I loved him. It's a great watch but nothing I'd rush to watch again sadly though every scene is written with great dialogue and performances and entertained the entire way! Be aware this isn't a movie for everyone. The violence, foul language and themes is taken to the extreme. This movie is really a fantastic journey, from a man who gains money and then power in the crime. Absolutely CLASSIC and immense stuff."
    },
    {
      "rating": "7",
      "text": "Scarface; the remake, is a different type of movie. Also this is not a rip off of the Godfather, you can tell it's not because this movie is obviously not as great as that movie. Not to say that this isn't a good movie. Some of the great aspects of this film are that it focuses on a unlikable type a person, a hitman I think. Al Pacino gives an overtop, extreme performances as the main lead, and is enjoyable throughout. I guess I should talk about the story. It's about this man who arrives from Cuba and wishes to fulfill the American dream of getting a ton of money. The simple viewing of watching the uprising of this man is simply fascinating and intriguing. One of the most notorious tales about this movie is that it has a record; almost, for most swear words uttered in a film; until South park. The violence in this is a bit over the top, especially the chainsaw scene, but is \"almost\" over the top, I say that because other than that one scene it's not that graphic. So I say again that the biggest treat this film gives us is the simple joy of watching the life of this person who we'd normally not want to associate with. I would say this is definitely worth a viewing, and despite what some may say of it being a copy of The Godfather, but should be viewed only by mature viewers."
    }
  ]
}