{"id": 365, "title": "Scary Movie 5", "starring": ["Ashley Tisdale", "Simon Rex"], "runtime": 86, "genre": ["Comedy"], "description": "Home with their newly-formed family, happy parents Dan and Jody are haunted by sinister, paranormal activities. Determined to expel the insidious force, they install security cameras and discover their family is being stalked by an evil dead demon.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/r2Jwo4Eoax0oOnsU5qcXv0ea0Q8.jpg", "categories": {"plot": 3.4285714285714284, "acting": 3.7, "ending": 0.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.5, "funny": 2.5510204081632653, "action": 5.0}, "reviews": [{"rating": "0", "text": "The movie is absolutely unwatchable. I hope they never make another one of these horrible movies again. Please save your cash and watch something that's worth your time like 42."}, {"rating": "0", "text": "I've had about enough with this stupid series. It's not funnny at all and Charlie Sheen is one of the worst actors ever. Scary Movie was good and it should have just been its own film. The series needs to END!!"}, {"rating": "4", "text": "Scary Movie 5 is silly but entertaining although it is stupid, it is a fun dumb time. One thing I liked in this movie besides it delivered some laughs, it has a good way in connecting the spoofs, like how Black Swan is in Paranormal Activity? And how Evil Dead has a place in the movie, I give it a point for that!"}, {"rating": "1", "text": "Without Anna Faris this movie totally sucks!\rShe acted so stupid and it makes you laugh.\rIn Scary movie 5 are no funny ideas and no clever and funny jokes."}, {"rating": "2", "text": "There was one good joke and it was only in the preview. I loved the first two but after that they actualy became almost scare in how awful they are. What the hell..."}, {"rating": "0", "text": "Absolutely awful, I went with some friends and 2 fell asleep, that's how bad this movie was. I can't think of a single good thing to say about it. It's about time that the Scary Movie franchise was brought to an end as it will only get worse.\r Once again, the film has no plot, like most spoof films of this kind. Terrible acting and cameos from Charlie Sheen and Lindsay Lohan, amongst others make the film more unbearable.\r I'm warning you, don't watch this film, you can't have the time back you wasted watching it."}, {"rating": "2", "text": "same as the whole series the directors an producers are trying to make it as worse as possible. The actor should take a nap or go for drama classes..."}, {"rating": "3", "text": "As a fan of the Scary Movie series, this movie was very disappointment. It make me laugh a few times, specially the part of the lesbian sex, but most of the jokes are forgettable and senseless. I didn't had the chance to saw this movie because I read the mediocre reviews, but I saw it because Halloween is near and I usually make a marathon of Scary Movie series, but I wasn't expected it was tooooooooooo bad. The plot is mediocre and senseless, how can you make a movie taking Black Swan's plot and Paranormal Activity's plot?"}, {"rating": "2", "text": "Tediously UnfunnyThough it’s not Freidberg & Seltzer bad, Scary Movie 5 is still a very poorly done film."}, {"rating": "1", "text": "Got stuck watching this movie because another theater was leaking.\r Walked out 30 minutes in.\r You wanna know what's funny? This series has made over 800 MILLION DOLLARS worldwide and is on track to make 1 billion.\r We're the punchline."}, {"rating": "0", "text": "This is the last time I will ever see a parody in theaters. I really like the Scary Movie films, but after 2 it kinda gets a few step backwards. But this one KILLED everything. Both Scary Movie and parodies in theaters all together. Anyway you look at it, it is horrendously awful. The jokes were more painful than funny, I wish I left the theater before it ended. If you like these type of films, trust me, you don't want to watch this. Also, for those who defend this film and say \"You people are too stupid to be entertained by good humor.\" So if we're stupid for hating this movie, then you are RETARDED for loving it. I've seen parodies that are so much better like Spaceballs, Robin Hood: Men in Tights, Young Frankenstein, Airplane, Naked Gun, even the first Scary Movie is better than this piece of sh*t."}, {"rating": "0", "text": "Even by Scary Movie standard, this one is horrible. I have quite a low standard when it come to comedy, especially spoof/parody movies. This is one is just god-awful. I think the movie just has no clear direction whatsoever. The jokes are all over the place. No zinger in any ways. I'm very very disappointed."}, {"rating": "0", "text": "Just no. We've seen too many \"Scary Movie\"'s come out to the big screen, and they got bad, and then worse.  This movie is not funny nor is it entertaining."}, {"rating": "0", "text": "Blatantly rips off jokes from elsewhere (and can't even do that right). For instance, mixing up the bum probe with the mouth probe? That's a complete copy and paste of a scene from \"Idiocracy\". It's not homage, it's not parody, it's shamelessly trying to make money by stealing somebody else's joke. And they couldn't even make the joke funny. Absolute bottom-of-the-barrel worthless garbage. Do not go anywhere near this."}, {"rating": "0", "text": "What a bullsh*t  year for comedy this has been. I hope This is The End can, ironically, save us. Utter garbage. Why the f**k is Mac Miller in this movie."}, {"rating": "2", "text": "Too bad to put into words. 2/10"}, {"rating": "1", "text": "These are the sort of movies that make me wish i lived in a cave and only used the word 'ugh'.  I just can't believe someone actually pays to make them or pays to go and watch them."}, {"rating": "0", "text": "You know what, I had it with this Scary Movie V crap. All 4 movies were very entertaining, but where's Anna Farris? Charlie Sheen and Lindsay Lohan are two of the biggest douchebags of Hollywood and as you can see, the Scary Movie franchise needs to die. I mean, DEAD as in zombies eating people. Razzies, take another note for \"Worst Picture, Actor, and Actress.\""}, {"rating": "4", "text": "The movie is okay, but not as funny as the previous installments I always liked the first, because of how it separated itself from traditional comedies, but this movie goes in the ranks of 'Vampires Suck' and 'Movie 43'...just clones of what  was funny. In my opinion, go see 'A haunted house', they beat 'Scary Movie' to the punch with the 'Paranormal Activity' theme and it has that Marlon Waynes charm."}, {"rating": "0", "text": "scary movie 5 is a pathetic exsuse for film making. the first scary movie was lagetly funny but the sequals have been  this movie has an old formula that has been used way too mutch and pop culter refrences that aret clever or funny. hounistly this is a lazy pice of crap filmaking. These spoof/satire films are becoming old and not funny at all.The acting, dialoge, direction is tarrable in the film. When i saw the trailer for scarry movie 5, i wosent exspecting much but man this movie sucked more than i entisapated. please stop making these movies hollywod, becouse thay are owfule."}, {"rating": "0", "text": "This is the worst movie I've ever seen in my entire life and the fun part was that I actually paid for this crap. I went to the theater to spend some time with my friends and we all got depressed by the extremely childish, stupid, humour of this trash.\rI don't believe how people can give this nonsense more than 6/10  they're 9 years old or they don't know nothing about (good) movies.\rSave your money, trust me."}, {"rating": "5", "text": "-------------------------------------------------------------------------------------------------------------------------------------------------------Still a better love story than twilight."}, {"rating": "0", "text": "A quick review if you will, but what else did you expect from the fifth (and may god have mercy on our souls if this isn't the final) installement of the scary movie franchise?\r In a word? No. There is nothing here worth the time writing about, if only to mention the blatant (and by all means institutionalized) formula of the film's producers... putting in the \"red list\" celebrities of the past couple of years and giving them \"jokes\" to say in front of the camera. Bad \"jokes\". Terrible \"jokes\". No, that's not true....nor is it fair. To say the cast is a common vehicle for delivering \"bad jokes\" would imply these jokes are of a certain merit for having been developed by a tellers unique ability to create original material. These, on the other hand are used jokes. these, on the other hand are D.O.A. type jokes you've heard before in some other form or another (which by chance were not funny then) and rehashed with a large production cost tag attached to the end of it's dead toe.\r The highly totted cameos by Lindsay Lohan (who couldn't catch a break if it were gently handed to her in a Faberge egg), Charlie Sheen and Katt Williams fall dead on their face given the amount of respect their dealt with a terrible script; managed by producer types who try to keep the film length as low as possible.....so as to meet the budget quo. In the end, I find it ironic and strangely humorous about the movies existence, wherein those who brought the franchise into inception (shawn and marlon wayans) favored better (though really not by much) with \"The Haunted House\"; which now acts as a giant size 'suck it' gesture aimed solely at the cats who bought the rights to this aging turkey and actually thought they could turn a lucrative profit. Whose laughing hardest now? The Wayans bros? I sure as hell hope not, their no funnier than Dane Cook on a free college tour. That can't possibly be the funniest thing to come out of both of these messes of two movies, can it? Yikes!\r No words. Skip it. *0 out of 5 stars*"}, {"rating": "3", "text": "It wasn't horrible but it wasn't quite good enough to pass off as decent. I mean some of the jokes made zero sense and the movie acted like we were suppose to die laughing every time it randomly mentioned something inappropriate. Just because something is perverted doesn't necessarily mean it's funny. The absolute worst part was watching Snoop Dog aka Snoop Lion and Mac Miller walking through the woods looking to steel some Cannabis........................... and trust me, it's painful to watch them both try to be funny because they weren't in the slightest. Although the movie had some good moments, overall all I can say is..... seriously?"}, {"rating": "0", "text": "Just let scary movie die, 5 is a horrible abomination and is just embarrassing to be honest, even for scary movie standards, I'm feeling that scary movie will not die, i'm thinking it will be the call of duty of the movie industry, no matter how crappy it will always have fans that eat it up, let's just hope they don't make a new one next year, don't support this, this is the prime example of dumb movies for the dumb masses."}, {"rating": "1", "text": "The only things scary about this movie are the bad acting, stupid jokes that fall flatter than a lead balloon, and the fact that it even exists to begin with. We all know that few movie franchises ever pull themselves back from the dead and survive. Scary Movie 5 is trying desperately to stay funny and cool, but only trips on it's own stupid comedy, and stabs itself repeatedly and slowly to death with it's own reputation as a old franchise that is trying too hard."}, {"rating": "0", "text": "Scary Movie 5 is the cinematic equivalent of a slap in the face. Virtually EVERYTHING about this movie is so horribly done, even Tommy Wiseau would be embarrassed.\r This \"comedy\"  flick is (like its predecessors) a satire on recent horror films such as Guillermo del Toro's Mama, and the Paranormal Activity franchise. The simple act of watching this movie is something to be ashamed of. The humor is immature and juvenile even when compared to the previous films. Some jokes in the film include a toothbrush with poop on it, a nanny on a toilet in a closet, and Snoop Dogg stealing a giant joint with Mac Miller for no reason. When it's not attempting to crack horrid jokes like that, it's referencing films like Inception, Black Swan, Tyler Perry's Madea films, and Rise of the Planet of the Apes; movies that were relevant two years ago.\r Every single thing about this movie is a direct insult to the audience. I would only recommend this film to immature high-schoolers, and people who enjoy movies that are so bad, they're good. If you don't fit into one of the categories above, AVOID SCARY MOVIE 5 LIKE THE PLAGUE."}, {"rating": "0", "text": "I went to see it last night and honestly the most worthwhile investment I made there was with my soda. I cannot begin to describe how stupid this movie was but I'll give it a shot. It was like the once esteemed writers decided to make a movie so bad that they idiot masses would eat it up, which from the 19 positives here and the approval rating of 79% on Rotten Tomatoes would signify that they were successful. That's the scary part. The funniest moments of this movie either involved Molly Shannon or Vacuums or Train Tunnels. It's pretty bad when the bloopers make you laugh 60 times more than the whole movie, and you only chuckle. I am so sorry that the comedic genius that is Molly Shannon will have this on her resume. I suggest that she omit it. To clarify, Im the kind of person that can't even get through the old Evil Dead because of the tree scene, nevermind the new one but at the end of the night I was wishing that I had spent my $8.50 on the Evil Dead. Please do not make the same mistake I did. Don't encourage these bastards."}, {"rating": "0", "text": "From beginning to end it is an exercise in failure.\rFilm students might watch this if they are inclined towards comedy to see precisely how not to do a movie."}, {"rating": "2", "text": "What is it about these movies that makes them so funny? Dated pop-culture references, stale raunchy jokes and horrible, horrible acting just make these films kinda lame. What more can I say? I can't wait for Scary Movie 6 and 7.\r 2/10"}, {"rating": "1", "text": "It's funny, it's weird, it's ridiculous, it's stupid, it's....horrible!!! The appearance of Linsey Lohan, Ashley Tisdale didn't approve Thisssss. This series should, no, OUGHT TO, need to end"}, {"rating": "3", "text": "Worse than all of the previous entries in the series but I've seen worse movies I guess. The funniest part was the scene with Lindsay Lohan and Charlie Sheen and that was only because they were making fun of themselves. The rest was hardly worth my time let alone my money."}, {"rating": "1", "text": "Extremely poor excuse for a film. It's filled to the brim with childish gags and (at best) mediocre acting and only served to remind me of the dreadful failure that was Disaster Movie."}, {"rating": "0", "text": "Esto más que una deshonra es una vergüenza total y sin sentido, no puedo creer que haya perdido 1 hora y 20 minutos de mi vida viendo esta cosa que se hace llamar película. No hay nada absolutamente bueno, ni una vez me reí con los \"chistes\" de esta película, hasta da vergüenza ajena saber que hay gente que tenga una mente así y este libre para crear (ojalá que no) más bazofias como esta maldita porquería. Scary Movie 5 no merece ningún consuelo ni perdón, no merece a la audiencia, no merece respeto, no merece gracia y ni siquiera merece ser vista. Esta película es una maldita pérdida de tiempo valioso que puedes utilizar en cualquier otra cosa (por ejemplo jugar Grand Theft Auto V). La peor bazofia del año está aquí, no la veas y si la ves hazlo solo, porque sino tus amigos y tú morirán de la impresionante vergüenza ajena que produce esta \"película\". Cero y desprecio total."}, {"rating": "6", "text": "It's the worst of the five, so I'll get that out of the way, but it's still an entertaining film and it's definitely not the worst of the spoof films that are out there. Some of the actors are back from the past films but all playing different characters. They blended a number of films together quite well and while it had its funny moments it also really missed the mark on a lot of jokes. It's going to get bagged out regardless and only fans of the series will probably enjoy it like I did."}, {"rating": "0", "text": "So many \"comedy geniuses\" have gotten to \"Paranormal\" way before this film. Scary Movie stopped being entertaining when they decided to make a 3rd one, then a 4th one. And now with this 5th one, I'm sitting here literally saying Eff this. I can't believe I wasted money on this. Anybody who thought this was even remotely entertaining, have terrible taste in movies. Only C-List and below were in this movie. And fan boys, sorry to break it to you, Lindsey Lohan and Charlie Sheen don't even approach the B-List. Sucks. That's all I have to say. It sucks terribly."}, {"rating": "1", "text": "Beating a dead horse...with half a loaf of Wonder Bread..that's all that I picked up while watching this poor excuse for a movie. I, I-I don't even know what to say here, it's just gotten pathetic and needs to stop. If you want a good laugh with the classic Wayan's Brothers, go out, rent A Haunted House and you will get something three times better than this trash."}, {"rating": "0", "text": "I don't ever rate movies this low.  Usually I can find some sort of positive in any movie; this is clearly the exception.  It's not funny, all it is is 90 minutes of 'oh my god why did they put that in, did they think it was funny?'"}, {"rating": "2", "text": "If it was actually meant to be a scary movie, then it was meant to be a horrible film. All you see is crude stuff and a VERY horrible end to a stupid movie. Parody for Paranormal Activity is not funny, and I thought Scary Movie 4 was bad..."}, {"rating": "0", "text": "This movie was terrible, my brother chose the movie for his birthday over watching evil dead. After the movie I told that he made the wrong chose, and I was wanting to watch evil dead. I say that you should not watch this movie. The director should be ashamed of himself for making this movie!!!"}, {"rating": "1", "text": "Not good at all, this is my first negative review, and a waste of my money. I don't recommend it to any one as it as not funny nor scary. Acting was terrible, and i think you should watch something else."}, {"rating": "1", "text": "Hey guys, look, these kinda unrated movies can be funny enough. Take American Pie for instance. But this movie is just horrible! Horrible! I've had enough of these stupid parodies mashed up together. What a waste of money, this is! Give me half of the money you spent creating this movie, and I'll make you something better than this!\r You know what? I'm really mad at me for buying the ticket and watching the first 20 minutes of this (I couldn't bother for more...)"}, {"rating": "0", "text": "Scary Movie 5. Holy cow. Wow. I had so much high hopes for this raunchy slapjack comedy but oh no, it sucked bad. REALLY BAD. First off, it looked like I was watching A Haunted House not SC5! The spooky spoofs are Evil Dead, Mama, The Cabin in the Woods, and Paranormal Activity 4. Now, I noticed that some of the scenes in the trailer were not in the movie like the ballerina scene where the baby is \"confiscated\" on the man- the mother is telling her the story but in the movie she is telling her boyfriend or something. I hated this movie for only one reason, its comedy. It isn't funny, you know! Just cancel this series! I have seen that every single director that makes a Scary Movie's Movie always ruins its reputation! In this case- Malcom D Lee director of the super funny Undercover Brother. Sorry, dude."}, {"rating": "6", "text": "Is it the worst of the five yes\rdoes it have over the top stupid humor that i know the 13 year olds inside of us loves then yes\rover all i did like it a bit"}, {"rating": "7", "text": "Once you accept this is mostly slapstick comedy, it turns out to be really funny. I found myself laughing hard many times, cause the jokes where ridiculously funny and beyond the usual border of taste. I liked \"haunted house\" too, but there were too few jokes. Scary Movie is trying to be funny every 10 seconds and i think it delivers every second or third joke... and many of them are really badass. It´s not the best out of the franchise, but i´ll rate it a 7.\ri understand why most people don´t like it. your humor must be far advanced to get this one."}, {"rating": "7", "text": "Personally, this movie was enjoyable and I really had a lot of fun while watching, and while I can \"understand\" many people saying that it's horrible, I want to start saying that this \"movie\" isn't like the \"OTHERS movie\" (aka, disaster movie, epic movie, horror movie, etc), and people should know that at least, because while THOSE were horrible and not even funny, this one had at least a minimal amount of thought behind the scenes and it was actually fun to watch. And really, is this the worst movie ever? Remember that, if you're giving this movie a zero, you're actually saying that the Twilight movies are BETTER! Think about that. But rants aside, I don't think this movie is that awful, and if I had to pick a position, this is probably the third best of the franchise. Although, yes, it has flaws. For instance I didn't like that they removed Anna Faris, which was sooo funny...but oh well I liked the new actress enough and I liked the others too (I missed Brenda though). I didn't like also how the story wasn't focused on just one main scenario, but across two or three all together instead, making a lot confusion to follow the story: sometimes it's Paranormal Activity, sometimes Evil Dead, sometimes another. It's just not focused enough on certain aspects, unlike other Scary Movies (for example, SC3 was focused on The Ring, and SC4 was focused on The War of the Worlds). The jokes also weren't exactly stellar in comparison to the previous movies...but really liked how stupid they were, because while they weren't exactly genius, they were just freaking funny. Immature? Yes. Silly? Yes. Idiotic at best? YES at least it wasn't filled  with really bad puns, stupid pop culture references that usually made no sense...and singing jokes? But yes, these jokes aren't as good as the previous Scary Movies, but they are FAR superior than the ones present in the \"OTHER\" Movies. At least they made me laugh. Honestly, I will never understand how this movie was bashed so hard, and probably never will: it's not horrible, but it's not even great, but it's not worth all that bashing in my opinion because at least it took some planning and some effort. I'm not gonna defend it anyway, mainly because, like I said, it has flaws and maybe it should have more focus on some parts, more funny jokes, and the old actors back, but as it is it's NOT horrible, but still a bit of a disappointment. But is it worth the zero? My answer is no. If you're a fan of the old Scary Movies, you probably won't really like it as much, cause of the stupidity of the jokes and the lack of focus on the parodies; If you hated the \"OTHER\" movie series, you might like this a bit more, since it has better jokes. Best advice, however, is to see for yourself, and hate/enjoy it for what it is: a parody flick."}, {"rating": "7", "text": "i thought that it was funny it could have been funnier like the previous installments and it could have been longer but overall i enjoyed it good movie 7/10"}, {"rating": "7", "text": "I thought this was going to be really bad and i think if it was a longer movie i would have got tired of it but there were a few good laughs and with it being a short movie it did not have time to get on my nerves its worth a watch but don't expect to much and you will be ok."}, {"rating": "8", "text": "I originally had low hopes. But it turned out it is the best one yet on the franchise. To get some of the jokes you have had to see some of the paranormal activities and black swan. I would recommend seeing evil dead and mama before you see it but you don't have too."}, {"rating": "10", "text": "It's a stupidly-funny movie, these parody movies are so lame, so sick of it already well i am not. They did a justice doing a parody of Paranormal Activity, especially Black Swan. Ashley Tisdale's poor performance made it a more laughable and formulated at its finest. Scary Movie 1 is definitely the best & Scary Movie 2 is the lamest. 1 THUMBS UP!"}], "recommendations": ["vampires_suck", "epic_movie", "meet_the_spartans", "deuce_bigalow_european_gigolo", "a_haunted_house", "grown_ups_2", "movie_43", "scary_movie_4", "miss_march", "one_year_one_night", "scary_movie_2", "little_man", "hot_tub_time_machine", "superhero_movie", "kangaroo_jack", "a_haunted_house_2", "the_babysitter_killer_queen", "dumb_and_dumber_to", "the_hangover", "scouts_guide_to_the_zombie_apocalypse", "white_chicks", "the_watch", "scary_movie", "the_dictator", "not_another_teen_movie"]}