{
  "id": 3294,
  "title": "School of Rock",
  "starring": [
    "Jack Black",
    "Joan Cusack"
  ],
  "runtime": 110,
  "genre": [
    "Comedy",
    "Music",
    "Family"
  ],
  "description": "Fired from his band and hard up for cash, guitarist and vocalist Dewey Finn finagles his way into a job as a fifth-grade substitute teacher at a private school, where he secretly begins teaching his students the finer points of rock 'n' roll. The school's hard-nosed principal is rightly suspicious of Finn's activities. But Finn's roommate remains in the dark about what he's doing.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zXLXaepIBvFVLU25DH3wv4IPSbe.jpg",
  "categories": {
    "plot": 5.230769230769231,
    "acting": 7.3,
    "ending": 6.0,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.045454545454545,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "They couldn't pick anyone better than Jack Black to make the movie. He's funny and a big rock fan. The children are awesome musicians. The acting is pretty good overall. Not incredible but pretty good. The soundtrack is amazing and the whole idea for the movie is awesome. Great."
    },
    {
      "rating": "8",
      "text": "Jack Black is awesome in this rock comedy. It's not the best comedy I ever seen though."
    },
    {
      "rating": "10",
      "text": "Jack Black is side-splittingly funny in this comedy about a fake substitute teacher (Black) and his attempt at turning a preppy elementry school class into rockers. A must-see if you like Black or bands like Led Zeppelin."
    },
    {
      "rating": "10",
      "text": "its so funny. jack black is the perfect character. i hope they can do a school of rock 2."
    },
    {
      "rating": "9",
      "text": "First off, this is a 9 out of 10. Acting is good. Jack black is great in the film. He's real funny.  Music is really good throughout the movie. Story is also really good. Overall, this is a really good film. Even with the pg-13, everyone should see it. Highly recommended."
    },
    {
      "rating": "8",
      "text": "School of Rock is a film that has a phenomenal performance by Jack Black in a role he was born to play. In the sure hands of Richard Linklater, the film manages to avoid being too formulaic and is incredibly funny throughout. The film manages to not just be funny, however. Rather, it is also quite touching, entertaining, and moving, throughout as you see this man be \"touched\" by these kids and see the way he 'touches\" them. Well-written and directed by Linklater, School of Rock also has a good performance from Joan Cusack and very impressive performances from the young kids who show tons of potential in this film. The main drawback is that some of the scenes are really hard to watch due to how uncomfortably awkward they are, but hey, that's just me. Coming into this one, I had pretty low expectations in spite of Linklater and came away quite impressed while also being quite entertained. A comedy film with heart."
    },
    {
      "rating": "9",
      "text": "A fun, light-hearted farce that is punctuated by some surprising depth and feeling. School of Rock is a winner, and, to quote Dewy, it kicks ass."
    },
    {
      "rating": "9",
      "text": "Talk about a fun movie! \"School of Rock\" knows exactly how to have a great time, and thanks largely to Jack Black's performance and an incredibly hilarious script, \"School of Rock\" is definitely a great film. If you want a fun and exuberant time with a movie, make it a point to watch \"School of Rock.\""
    },
    {
      "rating": "9",
      "text": "This movie was great. It was hilarious overall. The acting was great. Jack Black was awesome. The plot was good. The soundtrack was awesome. The School of Rock is an awesome movie and I would recommend that you check it out. If you hate this film, you are silly as JB and BieberNinja."
    },
    {
      "rating": "10",
      "text": "One of my favorite music related movies of all time. Killer duo of Richard Linklater and Jack Black. The music is carefully picked and the supporting cast with all the kids make for a heartwarming movie."
    },
    {
      "rating": "8",
      "text": "Some points remind me of the School of Rock. What School of Rock? There's any School of Rock here. Oh, this School of Rock... you know, Jack Black stars in? Eh, not one of his best films, but indeed enjoyable."
    },
    {
      "rating": "10",
      "text": "The School of Rock is one of the best comedies and best stories about the power of music ever made. Jack Black gives truly one of his best performances, and the supporting cast and child actors are fantastic. If you are at all a fan of comedies, rock and roll, or just music education, you need to make School of Rock required viewing."
    },
    {
      "rating": "10",
      "text": "it was a very good movie. and yea i agree, the fact that Jack Black was able to tune down his many obsenities for a childrens movie (or pg-13) and Katie (A.K.A the bass guitar) is hot."
    },
    {
      "rating": "10",
      "text": "Awesome movie with awesome music!!!! Caitlin Hale is really cute and has a good voice. Too bad, she don't want to proceed as an actress or singer. Joey GAYdos sucks!!! He think he's best guitar player of the world. I listed to a few songs of him and I have to say: they're sounding all the same. He's totally overrated."
    },
    {
      "rating": "6",
      "text": "It is an overall very good time. This is one of Jack Black's best moments because of a great performance and unique plot."
    },
    {
      "rating": "3",
      "text": "I like this movie but Joey Gaydos completely ruined it. He goes to my freaking school and is the biggest jerk I've ever known. So don't look up to him, be happy you don't know him because he is so full of himself. He actually Googles himself and finds what people think of him. No one likes him except you losers that don't even know him."
    },
    {
      "rating": "3",
      "text": "I cant believe that anyone can like this terrible excuse for a movie, i tried watching it with my brothers and they just left! The characters (in particular that of the principle) are unrealistic and poorly acted. Unfortunately i have been forced to sit through several runnings of this film... wasted time :("
    },
    {
      "rating": "10",
      "text": "This is a really fun film - and we all need more of those.\rJack Black can be \"over the top\" and he's WAY over the top in this but it succeeds by being cute, fun and silly at the same time. The film feels like it's only a few minutes long as it zips by. The extras on the DVD are fun too !!"
    },
    {
      "rating": "1",
      "text": "WORST MOVIE EVER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I WOULD NEVER EVER get this movie ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "Hey! Wow,what a fantastic movie. Sure I'm just 1 of those ppl who fall 4 the 1st hott guy in the movie, but Kevin Clark is so lyke WHOA!! Jack Black was hilarious! Top performance from all, can't wait 4 another movie with Kevin!"
    },
    {
      "rating": "10",
      "text": "I love this movie for many reasons! the gay guy is sooo funny but mainly Kevin u rock! heres my sayin! \"guitarists get paid but drummers get layed\" fit fit fit! oh and v. funny movie ;P"
    },
    {
      "rating": "10",
      "text": "Great movie great band period!"
    },
    {
      "rating": "10",
      "text": "Ilove kevin clark he is the hotest drummer I know i know a lot of drummers to.I have been dreams of him before his movie came out.I just want to know his number so I can call him to tell him about my dreams."
    },
    {
      "rating": "10",
      "text": "This is one of the most inspirational and hilarious movie I have seen in a long time. I watched Love Actually for the first time yesterday and I was touched, but School of Rock is WAY more heart warming. Oh God I love this movie."
    },
    {
      "rating": "10",
      "text": "Was one of the funniest movies I have ever seen. The only reason you wouldn't like this movie would a) be a total stiff and have no sense of humor, b) hate life, or c) don't like to laugh. This is a great movie for anyone who was in, is in, or wants to be in a band. Jack Black's performance was hillarious. School of rock deserves a 10 out of 10."
    },
    {
      "rating": "7",
      "text": "Kevin clark is soooo hott!!!"
    },
    {
      "rating": "10",
      "text": "Omg, Zack from the movie (his real name is Joey Gaydos) is really HOT...so amazing, so cool, so talented! and that Caitlin Hale is really cute (i mean Marta from the movie) she's pretty cool too.... i wish i had her voice....hehe!!! Bye bye"
    },
    {
      "rating": "10",
      "text": "I think this movie was BRILLANT!!!! im so sad i must have watched it 100 times!!! OMG its just so funny, and jack black is a legend, and kevin clarke, boy now he is hottttt!!!!!!!"
    },
    {
      "rating": "10",
      "text": "You want to know what's scary about this movie? It's so good that, if it weren't for LOTR: The Return of the King, it would be the best movie of 2003."
    },
    {
      "rating": "9",
      "text": "Funny movie, good music, the clash hell yea, but Jack Black thinks he iz da shit, and is so funny, and he is, but he sux @ guitar."
    },
    {
      "rating": "10",
      "text": "Kevin clark is soooo hott!!!"
    },
    {
      "rating": "7",
      "text": "I think this movie is geared to kids. There were some funny moments but it don't deserve the high rating it is getting. I would give it a 65%."
    },
    {
      "rating": "10",
      "text": "I totally agree with Jennifer L Kevin is the hottest guy on earth. He's just turned 18. The movie is amazing!! I do not believe some people gave it a 2. R u nuts??"
    },
    {
      "rating": "10",
      "text": "My parents ALWAYS laugh at just about every second of this movie!"
    },
    {
      "rating": "10",
      "text": "Omg! this movie so totally rocked...literally!!! the entire cast was amazing. kevin clark is SOOOOOOO HOTT!!!! he looks just like tom felton, and he can act just as great. at first i thought this movie would be bad but a friend convinced me to see it and i was soooo not disappointed. if you havent seen it stop reading this and go watch it NOW!!!"
    },
    {
      "rating": "7",
      "text": "not excellent, but Jack Black was funny"
    },
    {
      "rating": "9",
      "text": "The school of rock, like nacho libre (another Jack Black film), is hilarious, its possibly even better the nacho libre, I love it so much, its a hilarious classic (not all classics are good, but this one is!)"
    },
    {
      "rating": "9",
      "text": "Awesome. Jack Black is believable first as a mooch and then as a motivational instructor because as both he's a dreamer and untroubled by the realities of the real world. Joan Cusack is fantastic 'I didn't used to be this tightly wound'. And some of the students were far out talented"
    },
    {
      "rating": "5",
      "text": "Oh, it's cheesy. It's Jack Black--how could it not? But there's something warm about it. School of Rock is often touching, even amidst some questionable musicalities."
    },
    {
      "rating": "6",
      "text": "I wanted to take the guitar strings and strangle Jack Black, but besides that The School of Rock is a very good film that incorporates some excellent music."
    },
    {
      "rating": "8",
      "text": "This was a really fun movie to watch. Some great funny acting by the adults and by the kids. Great concept that was done pretty damn well. I even enjoyed the music."
    },
    {
      "rating": "8",
      "text": "Jack does an amazing job of bringing it home with a face-melter. Watch this movie and prepare to be rocked, as well as come away with some great one-liners."
    },
    {
      "rating": "6",
      "text": "It may not be as funny as it is charming, but \"School Of Rock\" is an entertaining experience overall."
    },
    {
      "rating": "6",
      "text": "It was a great movie to watch, and Jack Black made the perfect role for Dewey. But the jokes and acting was so cheesy that it hurt. Its still good but the roles had a better place. Jack Black was a star, everyone else was just a spot-taker."
    },
    {
      "rating": "10",
      "text": "Can't imagine a better cast, better soundtrack and story for a movie about music. Watching over and over can continue charming as the first time watching."
    },
    {
      "rating": "8",
      "text": "How can you resist the power of The School of Rock? It's charming, funny, entertaining, and enjoyable, making only the occasional misstep. This movie is Jack Black at his best."
    },
    {
      "rating": "4",
      "text": "This is one of those movies that seemingly everyone likes. In this respect, I disagree with 'everyone'. The plot sits on a chasm (how does nobody recognize that Dewey--whom I cannot call the movie's 'hero'--is a phony? Seriously, I thoroughly agreed with Patty telling him to wise up) and there's a sad paucity of truly original music. Most of the jokes are funny, yes, but I do not subscribe to the notion that 'funny excuses anything'."
    },
    {
      "rating": "8",
      "text": "Richard Linklater is a guy that can really do anything with the comedy genre every one of his films are different as he has a very good track record. School of Rock is just another example of another solid Linklater film. Jack Black is in the role he was destined to play and you can sense his true passion for this project throughout the film. Everyone knows that working with kids in film can be hell but it works in School of Rock and they make it look so easy. If Black didn't have a good dynamic with the kids this movie would have been dead in the water and it was excellent. There are some great child actors in this film that are cute, funny and you believe the whole band even if they are all kids. The development is great for Black and the kids grow along with him which is really cute. The ending is really satisfying as well, it will leave you smiling. That's all I will say."
    },
    {
      "rating": "4",
      "text": "I don't want to call Richard Linklater a \"sellout,\" since that's probably as unfair as it is unkind. But The School of Rock is clearly Linklater's attempt to develop some box office clout – something he has not achieved with critically acclaimed, sparsely attended features like Before Sunrise, Waking Life, and Tape. So, like Gus Van Sant with Good Will Hunting, Linklater has ventured into the mainstream. However, whereas Van Sant could at least claim that Good Will Hunting was a good movie, Linklater cannot make the same statement about his first mass-market suitor. The School of Rock is feel-good tripe: a string of clichés lashed together by a formulaic plot that features underwritten characters and sit-com style humor.\r The key to the film's watchability lies in your opinion of lead actor Jack Black, who (depending on your view of him) either carries The School of Rock on his back or buries it under his impressive weight. Black fans will be delighted by this opportunity for him to light up the screen. His detractors will run screaming from theaters. In general, I like Black as a supporting character. The School of Rock has too much of the amped-up actor. After a while, his high-voltage, scenery-chewing approach becomes wearisome. But there's no denying that he adds some pizzazz to the movie - a quality that is not supplied by the screenplay or Linklater's direction.\r Dewey Finn (Black) lives for rock 'n roll - not the kind of lame stuff that populates the radio airwaves these days, but the classic material. He's a walking encyclopedia of groups, singers, and songs. However, although Dewey loves the music, he's not the most adept artist, and his on-stage antics often make him more of a liability than an asset. So, when his bandmates fire him and his house-mate, Ned (Mike White), threatens to throw him out if he can't come up with his share of the rent, Dewey knows some changes have to be made. He starts by impersonating Ned to get a long-term substitute teacher's job. At first, Dewey doesn't know what to do with a classroom full of elementary school kids, but, when he discovers that several of them show signs of musical aptitude, he gets an idea - transform his pupils into a group and enter them into a \"best band\" contest. Of course, all of this has to be kept secret from the other kids, the parents, and especially Principal Mullins (Joan Cusack).\r It's Sister Act meets Dangerous Minds, with the most galling qualities of both in bas-relief. The School of Rock doesn't have anything interesting to say or do. It's pure saccharine inspiration with occasional bursts of failed comic relief and a few exceptionally choreographed and executed rock numbers. The latter are what redeem The School of Rock to the extent that it can be saved. However, where the recent The Fighting Temptations, rescued us from an equally lame plot with 45 minutes of music, Linklater seems to believe that his storyline and characters are worth their screen time. So, with a few minor exceptions, the rock doesn't start rolling until the final fifteen minutes (and one song is during the end credits).\r The key to a feel-good movie like this succeeding has very little to do with the overall plot, which must follow certain time-honored formulas. Instead, it has to do with the likeability and believability of the characters, and that's where The School of Rock stumbles most obviously. It's a lot easier to swallow the kinds of mammoth plot contrivances this movie spews out if there are a few well-developed individuals hanging around. Unfortunately, the kids (as cute as some of them may be) are all stereotypes. The adult supporting characters are equally poorly developed (the straight-laced principal, the timid house-mate, the shrewish girlfriend). And Dewey is just Jack Black with a jones for anything to do with rock.\r The presence of Black and Cusack in a story about music may evoke thoughts of High Fidelity, but that association only makes The School of Rock seem less palatable. There are elements that keep this movie from being a complete waste of time - the musical numbers are highlights, some of the kids (many of whom are non-professional actors) are cute, and there are isolated moments when the dialogue grows barbs. Nevertheless, my overall impression was not a positive one, and it's not just because I expect so much more from a filmmaker of Linklater's ability. I would have been as irritated with this movie if it was made by a first-time director. The School of Rock is made-for-TV quality, and, if you must see it, that's the medium where it deserves to be watched."
    },
    {
      "rating": "8",
      "text": "Leo loves School of Rock, and after watching with him, I can't say that I blame him. Jack Black stars as a (lazy?) rock musician that's struggling to get on his feet. His life is about showing it to the MAN but his lack of success in the band and mooching off of his friend dries up most of the paths that lay in his way.\r In an extraordinary chain of events, Dewey ends up as a substitute teacher! By know we know that the story's going to be about him beating the odds beating the man and hiding from authority – in a way, acting more childish than the children. This teaching gig was supposed to bail him out, but as it becomes bigger the enthusiasm and love for rock and the kids grows and is infectious. Unrealistic as it may be, it's charming in the creative ways these kids band together and get involved.\r School of Rock could have easily fallen multiple levels in quality by stooping to its audience, but instead it expected them to rise to meet the occasion, most of which would look this film straight in the eye and give it \"two thumbs up.\" It's not cheesy, it's not real, it's rock. It doesn't try to be something it's not, and that's admirable. The relationships are real, the people are real, and so is the love of rock & roll. I can feel the passion."
    }
  ],
  "recommendations": [
    "pitch_perfect",
    "17_again",
    "hairspray",
    "pitch_perfect_2",
    "grease",
    "friday",
    "the_pacifier",
    "my_spy",
    "nacho_libre",
    "the_longest_yard",
    "ghostbusters",
    "old_school",
    "mean_girls",
    "bad_santa",
    "jumanji_welcome_to_the_jungle",
    "the_game_plan",
    "21_jump_street",
    "easy_a",
    "forgetting_sarah_marshall",
    "central_intelligence",
    "zack_and_miri_make_a_porno",
    "the_nice_guys",
    "last_vegas",
    "dodgeball_a_true_underdog_story",
    "just_go_with_it"
  ]
}