{
  "id": 1572,
  "title": "Science Fiction Volume One: The Osiris Child",
  "starring": [
    "Kellan Lutz",
    "Daniel MacPherson"
  ],
  "runtime": 95,
  "genre": [
    "Science Fiction"
  ],
  "description": "Set in the future in a time of interplanetary colonization, an unlikely pair race against an impending global crisis and are confronted by the monsters that live inside us all.",
  "releaseYear": "2016",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3sx69bH2n2tgvknvq2VROJ6lEXS.jpg",
  "categories": {
    "plot": 5.153846153846154,
    "acting": 5.428571428571429,
    "ending": 4.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.333333333333333
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Quite good science fiction movie but without fireworks. In my mind this kind of “first part of series” should be thrilling and full of potential for extension of the subject but in this case we have poor CGI, average acting and many loops in the plot."
    },
    {
      "rating": "5",
      "text": "The Osiris Child manages to pull you in during it's opening chapters with impressive visuals, strong character work, and themes of progression related malfeasance. It all implies that we are getting a more thoughtful science-fiction affair and one that's been done on an indie budget. However, a lot of this gets lost along the way as the movie gets distracted with spending time on backwater space hillbillies and devolves into a sci-fi, B-movie with all of the quality of a Syfy original creature-feature. Only prettier.The promise of it's story gets snuffed out in the face of some of the least convincing monsters ever thrown onscreen. Well, that's not true. They're just the worst I've seen in a movie where the director expects us to take them seriously. The biggest threats to our characters are clearly just dudes in rubber suits that have been draped in tattered rags. That removes any of the urgency from the action sequences. The writing takes a steep dive following it's solid introductory moments. The movie sets it self up great and then fails to deliver. It just sort of stops developing it's characters in any satisfactory manner and gets caught up in the shlock.Director Shane Abbess delivers a final product that feels like a mashup of two completely different scripts. One intelligent, the other goofy. Both probably would have made for an enjoyable movie on their own for entirely different reasons. The Osiris Child can't commit to one or the other though and leaves viewers wanting more. In the end all it has going for it is that the strong performances and mostly great visuals continue to shine all the way through. It's what keeps the film from sinking into a realm of complete awfulness. They both deserve a better movie. One that doesn't fluctuate so much between compelling bleakness and silly cheesiness."
    },
    {
      "rating": "7",
      "text": "Don't be fooled by the low budget, this is a worthy sci-fi thriller with good drama as an extra seasoning and the effects look good. The acting is on par and the story is interesting and believable. You don't even have to enjoy sci-fi since the setting plays out on an earth-like planet without too much sci-fi fuzz to worry about. There are some action scenes and violence but this is mainly a thriller/drama centered story that even chicks should be able to appreciate."
    },
    {
      "rating": "6",
      "text": "I got this DVD based on a review in Sci-fi.com. It's not terribly bad for a grade \"C\" production. What is more important is the underlying theme of genetically engineering creatures to be used for extermination. Have he seen or heard this theme before?"
    },
    {
      "rating": "1",
      "text": "Comme série ou plutôt comme mini-série ou même une micro-série (3 épisodes de 4 mn) ça pourrait passer en fermant les yeux mais en tant que film entier, Osiris est complètement à la masse.Les comédiens quant à eux sont carrément à l'ouest mais le pire concerne ce scénario totalement bidon de A à Z... c'est un gamin de CM2 qui s'en est occupé ? putain que c'est ridicule et que ça sonne creux en plus de sonner faux ! c'est de la SF de supermarché au rayon soldé et pourtant les effets sont tout-à-fait présentables...Mais si la coquille est assez jolie, elle est vide : c'est comme un Kinder Surprise sans la surprise à l'intérieur, vous imaginez le désappointement... On aimerait en rire et on y cherche matière à rigolade, y compris à des degrés très élevés... Hélas, c'est tellement sérieux cette affaire que ça fait pitié !"
    },
    {
      "rating": "0",
      "text": "Cringeworthy. Worst movie I have ever seen. Terrible editing, awful screen writing. Just awful."
    },
    {
      "rating": "7",
      "text": "More like a 6.5 for me, but I’m going to round up because it did a pretty good job even with a low budget. There is a lot of crap sci-fi out there but this one was well acted and overall enjoyable."
    },
    {
      "rating": "3",
      "text": "After watching the movie and reading some reviews, it seems many give it high praise for its vision. Full stop - can't award points on vision. The plot was just a cheaper version of many other movies and shows (Serenity, Riddick, et al.) The plot was hard to follow and full of holes. SPOILER ALERT: how are genetically-engineered monsters who zombify humans into becoming monsters supposed to help colonize future worlds? If there's a secret antidote or kill-switch, explain it better. The ending is one big, poorly explained cliff hanger. It's hard to suspend disbelief if you care more about aerial dogfights and hillbilly gunfights than cohesive story telling."
    }
  ]
}