{
  "id": 333,
  "title": "Scooby-Doo",
  "starring": [
    "Freddie Prinze Jr.",
    "Sarah Michelle Gellar"
  ],
  "runtime": 88,
  "genre": [
    "Mystery",
    "Adventure",
    "Comedy"
  ],
  "description": "Join the Mystery Inc. gang as they take on their biggest challenge yet! When they're invited to Spooky Island, a popular amusement park, they soon discover that the attractions aren't the only things that are spooky. Strange things are happening, and it's up to Scooby, Shaggy, Fred, Daphne, and Velma to uncover the truth behind the mysterious happenings.",
  "releaseYear": "2002",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3B9dxR5hE34W8ALLbP6SGdTgBRc.jpg",
  "categories": {
    "plot": 4.481481481481482,
    "acting": 4.695652173913044,
    "ending": 3.8,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 5.384615384615385,
    "funny": 4.590909090909091,
    "action": 4.818181818181818
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This is probably the best you're going to get attempting a live-action Scooby Doo. It's just not meant to be."
    },
    {
      "rating": "8",
      "text": "Not a movie for everyone. But it has such a charm to it. and is a ton of fun to see the gang act exactly as if they were they're cartoon counterparts. Shagy and scoob are perfect. Velma is still a nerd looking for glasses. All around it's just a fun time to see these characters again in action."
    },
    {
      "rating": "1",
      "text": "There is some fun to be had here but I have to admit the movie straight up sucks."
    },
    {
      "rating": "8",
      "text": "Ignore the critics. I had a great time watching this hilarious adaptation of the animated TV series from the late 60s."
    },
    {
      "rating": "9",
      "text": "Ignore All The Bad Reviews From Critic's This Is A Cute Scary And Funny Movie!\rA Really Good Adaptation From Scooby-Doo Where Are You?"
    },
    {
      "rating": "9",
      "text": "This movie is great. Scooby and Shaggy made me laugh so much! I hope they make more because you never know what is going to happen next to the gang. Scooby Doo, where are you??"
    },
    {
      "rating": "3",
      "text": "Yup. The crude poster says it all...."
    },
    {
      "rating": "9",
      "text": "I Have Allways Loved S.D. But I Also.... Love This Movie! A Great Childrens/Teen Movie! Overall The Acting Is Very Good & Cute :D The Script Once In A While Seems Repeating Its Self...Overall 9!"
    },
    {
      "rating": "4",
      "text": "I am a huge fan of Scooby Doo, or at least I am of the old school Scooby Doo, now days they just can't seem to get it right, take this movie for example it's garbage, they made a terrible plot, the characters I loved unlikable, and added some cursing and sex jokes, just like the new tv shows this movie can't seem to get what Scooby Doo is (or was), which is a shame because I was really looking forward to this movie, but was sadly disappointed."
    },
    {
      "rating": "1",
      "text": "Not funny, immature and a complete insult to the cartoon that it was based on. This is a film that my entire family remembers in infamy. It is the only film that we all agree on a rating for and that rating that we agree on is: terrible. If you like fart jokes and fourth grader style humor this is the movie for you. If not avoid at all costs."
    },
    {
      "rating": "4",
      "text": "The movie started off with the potential to be funny, but, threw away that potential and made it too corny. The villains were horrible, the ending felt forced, there were too many fart jokes, and they tried to make too many jokes that are innapropriate for little kids but that they wouldn't understand, that were there for adults only. Shaggy and Velma actually felt pretty spot-on, characterization and visual-wise, but, Fred and Daphne were off. Fred was arrogant, and Daphne was whiney, which just didn't feel right for either of them. It's sort of a fun movie, but, it has a lot of failed moments and feels like wasted potential."
    },
    {
      "rating": "8",
      "text": "Pure nostalgia fuel. Not a very good film in the traditional sense, but a very enjoyable guilty pleasure for even this big Scooby-Doo fan. If one thing is for certain, kids will love this movie!"
    },
    {
      "rating": "10",
      "text": "Ignore the critics. I had a great time watching this hilarious adaptation of the animated TV series from the 70s.  Please hand me the Scooby Snacks. I'm gonna need some right now."
    },
    {
      "rating": "0",
      "text": "Honestly, this movie was decently scary, but not in an entertaining way. It’s scary how this can be called a Scooby doo movie. The only character that looks good is shaggy. Scooby is absolutely horrifying and so are the rest of the team. The jokes are completely inappropriate even for its targeted audience. The plot is so insanely predictable and boring. The villains are incredibly basic and just a overall yawn. Go ahead and watch this if you want to waste your time. Would not recommend."
    },
    {
      "rating": "5",
      "text": "The casting and story is good but the rest is just rushed and messy in places."
    },
    {
      "rating": "10",
      "text": "Scooby Doo (2002) saved my life. It brings together the best of comedy, romance & reggae in a UNIQUE BLEND. Rowan Atkinson is at the peak of his career. Every line of it is unadulterated genius.Hydrocolonic? More like hydro-ICONIC. THANK YOU!!"
    },
    {
      "rating": "8",
      "text": "If you never \"got\" Scooby Doo, then don't go see it; and don't rate it! I grew up with Scooby Doo, am in my 40's, and I LOVe these movies! Except for Fred and Daphnie, the characters are right-on the mark. Fred and Daphnie are actually deeper in the movie than they were in the cartoon. But it is really about Scooby, Shaggy, and the brains of Velma; In other words, it's not the good-looking popular types that save the day, it's the goofy or brainy misfits. A good message to children who may be feeling awkward; showing that even the fearful, goofy or nerdy ones can be cool; and usually turn out to be the coolest. A really fun nostalgic ride. And yes, we all hated Scrappy ;-)"
    },
    {
      "rating": "2",
      "text": "Like many others, I enjoyed and liked this film as a kid. But now, as an adult, I can proclaim that this is a true piece of crap. First things first, Matthew Lillard plays the role of Shaggy brilliantly, it's like the dear (alleged) stoner has been brought to life. Shame about everyone else. The other actors play the role as best as they can, but can't overcome this weak script. Scooby and Scrappy look so fake, theres no way anyone would mistake them for real dogs. And of all the villians to bring into the film, why ue none of them and make Scrappy, the most annoying thing about the cartoon, the bloody villian? The plot is nonsensical, the jokes aren't funny at all and the villians are ill concieved. The traps aren't even as good as the cartoons. At least Sarah Michelle Geller gets to kick ass, Buffy style Like the flintsones, alvin and the chipmunks, Garfield and many (MANY) others, a live action film of a cartoon show does not work. Is there any good live action films based on cartoons? Apart from Death Note and Transformers (1st one), I don't think so. (I'd like to hear if you think theres actually any good live action films based on cartoons, just comment) Just shudder in anticipation for the Smurfs movie"
    },
    {
      "rating": "6",
      "text": "This Scooby-Doo movie may have occasional strange humor, but the mystery and story of the movie make sense enough that you can enjoy it. You may like the silliness."
    },
    {
      "rating": "4",
      "text": "Scooby-Doo was one of the cartoons I grew up with as a kid, plus this came out when I was about 6 or 7 so I grew up with the films too and back then they were awesome, but now...not so much.\rScooby-Doo opens with the case of the Luna Ghost in which Mystery Inc disband due to disagreements which have been piling up over years. 2 years later they are all invited to Spooky Island by Emile Mondavarious to solve a new mystery. However as they try to work individually to solve the mystery they realise they need each other and that this is no normal mystery, that it could lead to the end of the world.\rScooby-Doo is a great kids film but there is nothing there to satisfy anyone older than 9. The story is poorly written, acting is shoddy (a big surprise seeing as Matthew Lillard from films such as Scream  Final Destination plays Shaggy), CGI is poor at best and the camerawork  editing are atrocious.\rAs a 90 minute episode of the TV series this would have been great, but as a live action standalone title Scooby-Doo the movie just doesn't quite cut it to be an averagely good kids film due to some rookie mistakes, but I'm sure the kids will love it either way."
    },
    {
      "rating": "8",
      "text": "A great family movie if you have kids that like the Scooby-Doo cartoons, then you should definitely watch this with them. Matthew Lillard plays the perfect Shaggy, he sounds like the original cartoon version. And is now playing the voice of the character on the new Scooby-Doo cartoon. Linda Cardellini also did great in her role as Velma. And Sarah Michelle Gellar and Freddie Prinze Jr did good too."
    },
    {
      "rating": "4",
      "text": "It's not an abomination, but it really is an insult to the TV show that I love so much. I loved Matthew Lillard as Shaggy, though, as he stole every scene he was in. The rest of the cast wasn't as good, the story was lame and only a few of the jokes were funny. Watch the show instead."
    },
    {
      "rating": "6",
      "text": "It is entertaining and fun."
    },
    {
      "rating": "6",
      "text": "I read someone here say that this is as good as a live action Scooby-Doo movie is going to get, and that is pretty much very true. Velma, Shaggy and Scooby in this movie are great and play their roles loyally to their cartoon counterparts, particularly Lillard who seems like he was born to play this role. Sarah Michelle Gellar & Freddie Prinze Jr on the other hand do look the part, but unfortunately it is hard to see them as their characters as they are a bit too high profile for the roles they are playing. Overall this is movie perhaps tries to be a bit too serious at times but is overall good for some plain old fun."
    },
    {
      "rating": "5",
      "text": "Not bad for a kids' movie.  It doesn't aim high, and it's probably not that funny for most people over the age of ten, but it breezes by smoothly enough and the cast members were chosen well.  As everyone who has seen this has already said a million times before, Mathew Lillard was the perfect Shaggy.  He sounds like him, he acts like him, and he looks like him.  It might not even have been on purpose.  He seems like Shaggy in everything he's in, but that doesn't detract from his performance here.  The tone's also not very self serious which helps out a lot.  Bottom line, the movie's alright, but it's also nothing great.  It's formulaic and lacking in inspiration, but it could have been a whole lot worse.  In fact, it probably should have been a whole lot worse.  I can easily imagine a painfully bad version of this movie."
    },
    {
      "rating": "2",
      "text": "Incompetent, silly, and poorly made, the live action Scooby-Doo rehash sucks. It offers little redemption of any kind for its countless flaws. Pass on it."
    },
    {
      "rating": "5",
      "text": "It has some charm here and there, and Matthew Lillard is rock-solid as Shaggy, but unfortunately, \"Scooby-Doo\" falls into the same category as many live-action/CGI hybrids. It's plenty of fun for kids and Scooby-Doo fans, but it's nothing adults will want to watch over and over again."
    },
    {
      "rating": "5",
      "text": "On New Years Eve, I rented the Scooby Doo film to watch with my brother. Unlike the Scooby Doo cartoons, this movie is a lot different. The main plot is when the gang catch a ghost and unmask him but due to problems in the gang, they split up which leaves Shaggy and Scooby. Later on, they are all invited to an island called Spooky Island where they have to solve the mystery of the visitors being cursed.\r Some of the things I liked about the movie would have to be the fact that it pretty much retained the Scooby Doo cartoony action and the fight scene with Daphne and Zarkos. It also has a plotline which you would normally find in a cartoon. I like how they made Scrappy Doo the villain this time as he was an annoyance in the cartoon. He was the main reason why the Scooby Doo franchise was ruined in the first place.\r The main problems with the movie were the humor at times was a bit too mature, the higher level of violence and mostly the use of mild language in a movie based on the children's cartoon (it is most notable in the ending cutscene when Scrappy says \"I would have got away with it if it weren't for you meddling son of a-\". I felt that the movie would have done better without those additions.\r Overall, I think it is best that kids avoid this movie as it is more violent than the cartoons, it has humor that they will not understand and there is mild language in certain parts. Some people might find the movie good though but others may want to avoid this movie."
    },
    {
      "rating": "6",
      "text": "Its not a bad film, I liked it as a kid. Its not much meant to be much more"
    },
    {
      "rating": "2",
      "text": "I hate this movie, it is just horrible, the CGI is **** the movie tries to parody the original show, but fails horribly, the actors are awful, and for some **** reason they made Scrappy-Doo the villain, which is **** stupid."
    },
    {
      "rating": "7",
      "text": "The film is silly filled with idiotic humor and bland CGI also a terrible mystery, but the film is like the show it has dumb kids humor and it has a dumb fun mystery also the cast does look like the characters from the 60's TV show. The film knows that it is awful but director Raja Gosnell and the screenplay by James Gunn can it least they can poke fun at it. Grade C+"
    },
    {
      "rating": "7",
      "text": "Sometimes the film becomes too stupid , but still did not prevent me from laughing . The partnership Shaggy ( Matthew Lillard ) and Scooby Doo is clearly the highlight of the film but the participation of comic Rowan Atkinson also was a good shot ."
    },
    {
      "rating": "7",
      "text": "This film is nowhere near as bad as the rating suggests, sure it isn't flawless, but a good film doesn't need to be that to be enjoyable. I thought Scooby Doo a colourful film, with some good direction, and very good performances from all involved. The best of the cast were Matthew Lilliard as Shaggy and Sarah Michelle Gellar as Daphne, and Rowan Atkinson is amusing as Mondavarious. The film is very amusing at times, especially the scene when Scooby dresses as a Grandma and the scenes in the haunted house. The actress of Mary-Jane is very sweet too. But I will say that the film isn't without its flaws. The plot is a little far-fetched, and some of the farting jokes are very silly. There have been complaints of the Scooby Doo model being charmless, but I disagree. He was quite sweet at times. The only character I didn't really like that much was Scrappy, then again I never did like him, not even in the animated series. Despite these flaws, this film is not bad at all, and I will award a 7/10. Bethany Cox"
    },
    {
      "rating": "8",
      "text": "Scooby doo is full of action packed scenes and entertaining characters. The cgi was ok. This movie brings back so much memories and is full of nostalgia."
    },
    {
      "rating": "2",
      "text": "Dudes, pass me the Scooby Snacks. I know what to exactly do with them.... not give them to this poor Scooby-Doo movie and actually teach them to make a better movie on the way too."
    },
    {
      "rating": "5",
      "text": "While I never liked scooby doo because of it always being the same thing, this is once again the same thing, so dont expect anything new in a movie like this."
    },
    {
      "rating": "8",
      "text": "Scooby Doo was a great kids movie that I really enjoyed watching growing up. The casting was good as they brought the fun cartoon cast of characters to life, and it was entertaining to watch as they went on a thrilling adventure."
    },
    {
      "rating": "5",
      "text": "It had funny moments and a ok story. The story was entertaining, but it was very predictable. The movie had a couple good jokes, but some were actually disgusting. I thought the CGI Scooby, looked not that good. It wasn't good, but not bad either."
    },
    {
      "rating": "5",
      "text": "MehDespite a fantastic performance by Matthew Lillard as Shaggy and some decent special effects, This adaptation of Scooby-Doo has very hit and miss humor with some being good and some REALLY stupid, A badly written script, and a badly written villain. Had Lillard’s performance not been as terrific as it is, I would’ve given this film a 4."
    },
    {
      "rating": "10",
      "text": "I don't know why people think this movie is bad? I mean, I watched it as a young child and I still do. It's a memorable classic that is pretty much so bad it's really good. I mean who didn't love Scooby-Doo as a kid? I'm also pretty sure this is more for young adults up rather than for children with some of the jokes."
    },
    {
      "rating": "6",
      "text": "The mystery gang have a mid life crisis. Scooby and shaggy eat food and get spooked. Velma uses some science to do your physics homework. Finnally freddie and daphnie have enough sexual tension to make you uncomfortable."
    },
    {
      "rating": "1",
      "text": "This movie is hot garbage because it ruined my childhood of Scooby-Doo. Making Scooby Doo a **** CGI character is so stupid because he looked awful. One Good part that Matthew Lillard played Shaggy and he voices him so that was good. This movie was a awful, I loved it as a kid but as older kid it is **** terrible the animated movies are so much better. You had so much resources to use to make it good but you **** it up and I am pissed off and really needed to let my anger out. My last good point is that the characters did look them from the show so that is a good thing because if they looked dumb then the review would be way worse. My Last point is this did not make me laugh at all thanks **** up you **** dumbass"
    },
    {
      "rating": "9",
      "text": "Честно говоря, если бы кто нибудь мне сказал году эдак в двухтысячном, что я буду хотя бы смотреть фильм по мотивам Скуби ду. То я просто рассмеялся бы ему в лицо и послал куда подальше.Но в 2002м году я фильм посмотрел и он мне невероятно понравился. Мало того, этот фильм стал для меня одним из любимых фильмов. Хотя я смотрел его уже далеко не ребёнком.Актёры подобраны великолепно. Играют прекрасно, подражая поведению и особенностям своих мультяшных прототипов. Неплохая графика. Сам Скуби хорошо анимирован.Мне понравилась история четырех друзей и их шизонутой собаки. Приключения и враги нарочито \"мультяшные\".Да недостатки были. Иногда была не очень точной анимация. Хотя для того времени вполне ничего. Ещё мне не очень понравилось как проработаны монстры \"Страшного острова\". Какие то резиновые.Но это всё мелочи. И сейчас, если мне надо расслабиться или просто поднять настроение вечером, я включаю этот замечательный фильм и жизнь кажется веселее!Жаль конечно, что из четвёрки героев, кроме Мэттью Лилларда и Линды Карделлини, в других фильмах лично я никого не видел. Великолепный семейный фильм, советую всем. Даже сегодня в 2022м году! Сейчас таких добрых фильмов уже не делают. Даже не знаю почему фильм засрали критики. Это говорит только об одном: либо их некомпитентности, либо об их продажности."
    },
    {
      "rating": "3",
      "text": "If anyone wanted to see the hot crap that comes out of the people in charge of Warner Brothers this is it. This movie is a clear indication of what it means to put big name celebrities with no place in a movie simply to garner their following to be interested. The biggest positive of this movie is that the animation was brilliant, but that is about it. If you are a Scooby Doo fan you will only find disappointment as they force jokes upon jokes to try to stay relevant in today’s youth while trying to blend the past at the same time? It was actually quite confusing why the decision was made to make a movie that is placed in the past, but blends today’s pop culture? One argument that is ridiculous to hear is that this movie was aimed towards kids, and let me stop you right there. Scooby Doo is a IP that was already aimed at kids leaving them no use to actually dumb down the characters more. They in turned decided to disrespect the IP and force depth into characters that didn’t need depth. I found myself wondering why certain plot points caused conflict other than the fact that it was easier for the plot to progress. In the end, the movie basically was a huge disappointment to anyone who was hoping to see a reboot of their favorite dog. Another note I’ve noticed is the constant positive reviews about this movie giving it 10 out of 10’s. When I see many big named Youtuber’s and Blog’s giving this a 10 out of 10 it makes me wonder how much did WB pay for Influencers. This movie is not a 10 out of 10, it is a poor written cluster bomb of plot holes and missed opportunities. Shame on you WB for allowing this to end up as cheap as another VHS quick release. The original voice actors deserve better than this and to be honest, they didn’t miss out if this is what was end result."
    },
    {
      "rating": "9",
      "text": "complete and utter slay, ignore the critics, all scooby doo live action movies were awesome and i do watch them every week. daphne pls kick me"
    },
    {
      "rating": "6",
      "text": "----------------------------------6.4/10-----------------------------------"
    },
    {
      "rating": "3",
      "text": "Warning: Do not watch this movie if you did not grow up with Scooby-Doo in your childhood. The movie is ridden with cheesy animation, a not-well-done plot, and subpar special effects. However, Scooby-Doo lovers are sure to get a kick out of this movie, and its humour, despite its many flaws."
    }
  ]
}