{
  "id": 1519,
  "title": "Scooby-Doo 2: Monsters Unleashed",
  "starring": [
    "Freddie Prinze Jr.",
    "Sarah Michelle Gellar"
  ],
  "runtime": 93,
  "genre": [
    "Mystery",
    "Fantasy",
    "Adventure",
    "Comedy"
  ],
  "description": "After solving their last mystery at Spooky Island, the Mystery Inc. gang is back in Coolsville, where they are being honored with their very own exhibit at the Coolsonian Criminology Museum. However, when a masked villain steals costumes of classic monsters on display and brings them to life, the gang must come out of retirement to solve the case.",
  "releaseYear": "2004",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/p0RlCKdVKOfBKVrWwBql4HOd8yd.jpg",
  "categories": {
    "plot": 4.5,
    "acting": 4.833333333333333,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.25,
    "funny": 6.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Okay, this film is better than the original, but it's still terrible. I like how they actually used original Hannah Barbera villians from the original show rather than badly cgi-ed sun-allergic creatures. Just to see the Black Knight Ghost, 10,000 Volt Ghost and Miner 49-er put a smile on my face. Also, Seth Green starred in this film. I'm a fan of the guy, especially since he's creator of Robot Chicken and starred in Buffy for 3 years. I also liked when Shaggy and Scooby encountered the Cotton Candy Glob. Matthew Lillards performance is still brilliantly spot-on But, those are the only good points The movie is quite dull, the characters aren't much like the original cartoon counterparts and we have another mystery that seems to give us more clues that appear from out of the blue. Also, I cringe at hollywoods attempts to make this film \"hip\" by adding Big Brovaz in to rap (remember them? No, me neither) At least theres no Scrappy F*cking Doo this time around This one's definately for the kids"
    },
    {
      "rating": "2",
      "text": "Wow, this is worse than the first one, there is still **** CGI like the first one, there still horrible acting, and jokes, and it is still a **** movie."
    },
    {
      "rating": "4",
      "text": "Better than the first one, still not that great of a film. It’s an alright kids movie."
    },
    {
      "rating": "10",
      "text": "Fun movie."
    },
    {
      "rating": "0",
      "text": "This movie makes the first one look good. Did anyone on the set give a sh*t about what they were doing? This movie just plains to be silly, incoherent and pathetically laughable. If you're going to watch this, think 5 times."
    },
    {
      "rating": "2",
      "text": "This was even worst than the first, they still can't get that classic Scooby Doo feel, the crappy actors, bad jokes, and retarded story make this movie unenjoyable, as a huge fan of Scooby Doo I can't find a reason to recommend this to anyone."
    },
    {
      "rating": "8",
      "text": "This Movie Is Cute! :D Overall The Acting, Writing, And Production Values Were All Fine..Some Moments In This Movie Are Great, But Some Seem Chipped, Or Boring...Overall 8!"
    },
    {
      "rating": "9",
      "text": "A Really Good Effort Again..\rIgnore The Critic's Same Plot As The 1st One Good Movie!"
    },
    {
      "rating": "4",
      "text": "Incredibly simpleminded, and featuring more gut punches to the original show than subtle nods."
    },
    {
      "rating": "4",
      "text": "The first live-action \"Scooby-Doo\" film was nothing awful, but it was also nothing special. In other words, it was good enough that Warner Bros. felt it deserved a sequel. It didn't. \"Scooby-Doo 2: Monsters Unleashed\" is one of those films that will most likely only see appeal among young children. Even if you are a fan of the classic TV show, you'll probably find the movie too silly, too poorly-written and too dull to have much appeal. If you have really young children, it wouldn't be too bad showing it to them, but you might not have as much fun as they will."
    },
    {
      "rating": "8",
      "text": "I grew up with Scooby Doo, I"
    },
    {
      "rating": "7",
      "text": "it wasn't as good as the first, but I think it has enough humor and perfect visuals to impress us."
    },
    {
      "rating": "7",
      "text": "Scooby-Doo 2 is better than the original. There is a lot more action, and in some ways, an even better story. I also like that this sequel contains original villains from the original cartoon series."
    },
    {
      "rating": "7",
      "text": "Ignore the critics. This movie was pretty fun. Generally it outdoes it's predecessor in every way and succeeds in being pretty funny in several scenes. The script is also much stronger and Lillard turns in another spectacular performance as Shaggy. Much better."
    },
    {
      "rating": "5",
      "text": "It's better than the first dose of Doo, but not by much. I say- bring the cartoon Scooby Doos to the theaters- and bring these live-action flops straight to DVD."
    },
    {
      "rating": "4",
      "text": "A bit more loyal to the show than the original movie, but perhaps a bit too much at times to the point of it being silly. Some things work as a cartoon, but just look stupid in live action. Again, Shaggy & Scooby are the stars, doing what we all know and love. The rest of the cast  are just a mess, further distancing themselves from their characters in order to readjust to be more \"believable.\" Considering the premise of the movie, that's a bit of a joke in itself. Overall: While the movie can be a bit entertaining at times, it's poor script and silly premise just ruin it most of the time."
    },
    {
      "rating": "8",
      "text": "This film is very underrated, I loved it when I was younger and while I don't love it as much as I used too, I still think it's decent.\rI'll admit there are one too many silly moments, but when it's not silly it's awesome, the scene with Velma, Daphne and the Black Knight ghost is so much fun, and reminds me a lot of the carton series, there are some out of place moments here, but it's still awesome, and the final scenes are fantastic, as is the scene where the gang are being attacked in the mystery machine, by the pterodactyl, it's awesome."
    },
    {
      "rating": "7",
      "text": "An unnecessary sequel that shouldn't have been made, but this sequel is somewhat enjoyable yes the jokes are unfunny and the special effects are cheesy, yet the filmmakers set out to make a fun, ridiculous film. Director Raja Gosnell does a pretty good job making the cheesy CGI glossy and the screenplay by James Gunn is cheesy and mediocre and sometimes lame but the film knows how to make the cheesiest parts fun and enjooyable. Grade C+"
    },
    {
      "rating": "7",
      "text": "Ignore the CGI, this movie is not awful, I actually enjoyed it and still do. I think the idea's pretty good and had some really good moments from the actors and as a bonus this movie turned out much better than the first one which is kind of like a disaster in progress."
    },
    {
      "rating": "6",
      "text": "Despite the double Shaggy and Scooby call enough attention , even it this sequel was worse than the predecessor film. The participation of Seth Green, in my opinion not add anything to the quality of the film but still gets this note 6 for the good mood times caused by the already mentioned double ."
    },
    {
      "rating": "8",
      "text": "The predecessor honestly wasn't that bad at all, but was flawed in terms of story and scripting. I really wan't expecting the sequel to be better, and it was. The plot was better, more focused, and a little more faithful to the Scooby Doo cartoons. One thing I appreciated here was that the director sensibly focused on Shaggy and Scooby, and that added to the film's charm, as nobody could resist Matthew Lilliard's goofiness as Shaggy. Sarah Michelle Gellar, Linda Cardellini and Freddie Pinze Jnr were very good too, there are some decent jokes and there were some very good action sequences. Out of the supporting cast, Seth Green was a standout as Patrick, and Alicia Silverstone is likable too. My only complaints were that one or two of the monsters could have been designed better, and also some scenes felt a bit rushed. Other than that, an enjoyable film, with an 8/10. Bethany Cox."
    },
    {
      "rating": "2",
      "text": "Sure, let's ruin Scooby-Doo even more. It's not like they're using them to gain a whole load of money which is once again a bad idea. Not worth giving any Scooby Snack to."
    },
    {
      "rating": "5",
      "text": "This is once again the same movie that really didn't need to be made. While I do admit that its better than the first, it doesn't improve on anything, except it being more boring."
    },
    {
      "rating": "4",
      "text": "Despite the double Shaggy and Scooby call enough attention , even it this sequel was worse than the predecessor film. The participation of Seth Green, in my opinion not add anything to the quality of the film but still gets this note 6 for the good mood times caused by the already mentioned double right now."
    },
    {
      "rating": "4",
      "text": "I am a huge fan of the show. I sadly expected this to be good, but I enjoyed the first more. The story was good, but written poorly. Actually, I found myself bored at a scene. Also, the CGI was somehow worse. It wasn't that good."
    },
    {
      "rating": "3",
      "text": "“Facepalms”Though it’s not quite as unbearable as the Chipmunk films and Lillard is once again great as Shaggy, Monsters Unleashed has painfully bad humour, Awful writing, and a little to no effort."
    },
    {
      "rating": "9",
      "text": "В общем так. Отличный сиквел, отличного фильма!Скуби-Ду 2002 года один из любимых фильмов как моей молодости так и сейчас. Что ж Скуби-Ду 2: Монстры на свободе, фильм ничем не хуже оригинала. Весёлый незатейливый сюжет. Весёлые персонажи, актёры прекрасно играют и пародируют оригинальный мультфильм.В Скуби-Ду 2 исправили все косяки  первого фильма связанные с компьютерной анимацией.Те же актеры играют снова тех же персонажей и это здорово.Два этих фильма, ну лично для меня, одни из лучших комедий в своём классе. Советую всем, даже сейчас.Не надо обращать внимание на низкие оценки критиков, они как всегда не правы."
    },
    {
      "rating": "3",
      "text": "The casting is good but the rest is a absolute mess made as a quick cash in ."
    },
    {
      "rating": "10",
      "text": "Velma looses her glasses, a really heart-warming scene. This film is perfection just for that."
    },
    {
      "rating": "7",
      "text": "A genuinely well acted, and decently funny, weird movie, yes it's very dumb, but it's not meant to be the magnum opus of cinema, it's Scooby-Doo, a movie that you can watch, and just have fun with. The movie has great outfits, (especially Daphne's), callbacks to episodes of the past shows, and I've been a fan of Scooby Doo since I was about 4 or so, I've seen a LOT of Scooby-Doo, so seeing the oldies back, and reimagined was awesome, and it's a movie that not only children will like, there is stuff for adults too. :) But, the movie does have downsides, the scenes with Velma, and Patrick, are UNBEARABLE, and the CGI is clearly dated, and the humor does fall flat at times with the fart jokes, and gross actions, but overall, Scooby-Doo is not only a good movie, but a great comedy, and a fantastic Scooby-Doo movie! :)"
    },
    {
      "rating": "6",
      "text": "----------------------------------5.8/10-----------------------------------"
    },
    {
      "rating": "3",
      "text": "Apart from a few funny and a few impressive moments this was a standard ghost story with some really stupid moments that were beyond belief. Making one movie of Scooby-Doo was going to be a stretch at best and making two movies is just plain stupid. And that is exactly what we got. It was totally stupid."
    },
    {
      "rating": "3",
      "text": "The animation is much better in this movie than the original. However, the plot is worse and much more pointless, the humour relies too heavily on slapstick, and the acting is the same as the first. However, like the previous movie, Scooby-Doo fans ought to love it."
    },
    {
      "rating": "10",
      "text": "scooby dooby doo where are you We got some work to do nowScooby Dooby Doo, where are you?We need some help from you nowCome on Scooby Doo, I see youPretending you got a sliverBut you're not fooling me, 'cause I can seeThe way you shake and shiverYou know we got a mystery to solveSo, Scooby Doo, be ready for your actDon't hold backAnd, Scooby Doo, if you come throughYou're gonna have yourself a Scooby SnackThat's a factScooby Dooby Doo, here are youYou're ready and you're willingIf we can count on you, Scooby DooI know we'll catch that villain"
    }
  ],
  "recommendations": [
    "scooby_doo",
    "scoob",
    "monsters_vs_aliens",
    "the_wild",
    "yogi_bear",
    "the_mummy_tomb_of_the_dragon_emperor",
    "teen_titans_go_to_the_movies",
    "zombieland_double_tap",
    "sherlock_gnomes",
    "shazam_fury_of_the_gods",
    "hotel_transylvania_3_summer_vacation",
    "the_spongebob_movie_sponge_out_of_water",
    "son_of_the_mask",
    "megamind",
    "alvin_and_the_chipmunks",
    "teenage_mutant_ninja_turtles",
    "the_lego_ninjago_movie",
    "superman_ii",
    "jason_x",
    "night_at_the_museum_battle_of_the_smithsonian",
    "ghostbusters_ii",
    "minions",
    "scary_movie_3",
    "goosebumps_2_haunted_halloween",
    "hotel_transylvania_2"
  ]
}