{"id": 879, "title": "Scoob!", "starring": ["Amanda Seyfried", "Christina Hendricks"], "runtime": 93, "genre": ["Animation", "Comedy", "Family", "Mystery"], "description": "In Scooby-Doo’s greatest adventure yet, see the never-before told story of how lifelong friends Scooby and Shaggy first met and how they joined forces with young detectives Fred, Velma, and Daphne to form the famous Mystery Inc. Now, with hundreds of cases solved, Scooby and the gang face their biggest, toughest mystery ever: an evil plot to unleash the ghost dog Cerberus upon the world. As they race to stop this global “dogpocalypse,” the gang discovers that Scooby has a secret legacy and an epic destiny greater than anyone ever imagined.", "releaseYear": "2020", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/jHo2M1OiH9Re33jYtUQdfzPeUkx.jpg", "categories": {"plot": 5.638888888888889, "acting": 5.566666666666666, "ending": 1.6666666666666667, "soundtrack": 3.0, "cinematography": 5.0, "familyFriendly": 5.75, "funny": 5.083333333333333, "action": 3.75}, "reviews": [{"rating": "6", "text": "A good if somewhat different take on this. It didn't seem like a mystery. I liked the take on Dyno-mutt. I understand what they were going for with the Blue Falcon although it was a let-down a little bit. I will give the studio credit for trying to get references to other Hanna Barbara characters during the film. There was some noticeable effort and thought put into the film even if it didn't really fire on all cylinders."}, {"rating": "6", "text": "I Honestly had hopes for this movie, watched it and all i can say oh.....yeah this wasn't very good, it's probably perfect for little kids which i can understand, because of the jokes. but everything felt forced in this movie, the character i liked was Dynomutt. 6.1/10"}, {"rating": "0", "text": "Terrible...a Scooby Doo movie without any heart and mystery?????....come on!"}, {"rating": "5", "text": "This text does not contain spoilersAnd that's just a short review, not all parts of the film, and it's just a summary.It's not very appealing, but it's fun.The biggest problem with this animation is that it's not a good story.So that the creators could not hide some parts of the story and surprise the audience, and you can easily guess what happens at the end of the story."}, {"rating": "4", "text": "Should of been a scooby movie but it was more about other characters. Bad movie"}, {"rating": "0", "text": "Horrible movie that doesn't compare to other Hanna-Barbera films. P.s. I predicted Simon Cowell twist at the end"}, {"rating": "0", "text": "A horrible boring scooby doo nostalgia cash grab. Nothing good here. Bland and painfully boring."}, {"rating": "1", "text": "It was looking very promising because of nice character design and CGI, but the story, everything about it (especially jokes and them trying to be more \"hip and cool\" for modern kids that always had explanation which felt awkward) was bad. The very beginning was very nice, but after that everything went down to hell. 90% of the movie was about the typical \"i dont need friends!\" Drama around shaggy and acoobs, Daphne and Fred had the least lines, it was more  about Velma. They decided to go for \"only one smart character in team\" trope as an excuse to make Daphne and Fred completely lose their personalities.  Everything about this movie was one huge cliche from other popular ones. They even tried making their own \",minions\" by replacing them with cute baby-looking robots. The movie was blant and boring. It's okay only if your kid prefers flashy CGI over plot."}, {"rating": "0", "text": "this just doesn’t feel like scooby doo. It is just so different and being difference isn’t a bad thing, but this doesn’t feel right, any horror in this movie isn’t there and it’s more of a action movie."}, {"rating": "0", "text": "Not the the scooby doo I know and love. Don't watch this, I don't think you would like it."}, {"rating": "7", "text": "Simon Cowell! A cover of \"Shallow\" from A Star Is Born! The Gates of Hell! This film has it all. It's so tone-deaf and bonkers that I enjoyed the heck out myself. Both ironically and otherwise. Probably great for kids too, I don't know, I'm 25."}, {"rating": "4", "text": "What do you do to the Scooby Doo brand? why is such a **** produced. Makes a 2D cartoon series again. It was at least good."}, {"rating": "4", "text": "Scoob is a woefully bad attempt to \"modernize\" timeless characters; featuring cringeworthy jokes, surprisingly stilted animation, and a TERRIBLE performance by Will Forte, dont count on Scooby doo to help you catch this waste of time."}, {"rating": "7", "text": "I found this new Scooby-Doo movie, the first to use computer animation, to be good but with room for improvement.Let me get this out of the way for Scooby-Doo fans: This isn't the traditional type of story. There isn't a lot of mystery solving or spooky situations. This is more of a superhero adventure. Warner Bros. (which now owns Hannah-Barbera) is trying to start a shared HB universe. So they were more interested in doing a movie using HB characters from more than one show. Scooby was basically chosen as the first lead because he's the most prevalent character.Shaggy (voiced by SNL/Last Man on Earth's Will Forte) and Scooby (voice-acting veteran Frank Welker) spend a lot of the show working with other HB characters in order to push the shared universe concept. The rest of the Mystery Inc. characters only play supporting roles. I would've preferred the main gang in more of this, but I give the movie credit. This isn't the only SD show or film to focus on just the duo, but I felt that this was the only one where they managed to make it work. (That's right Reluctant Werewolf fans, come at me.)This may not be a perfect representation of what Scooby-Doo is, but as a movie by itself it's an entertaining children's film. It doesn't have the most ambitious story, but it's fun and upbeat. (I ended up watching this twice.) The best part is the jokes, there are a lot of funny lines.There are a lot of moments where I felt myself thinking that the movie could have been stronger. The setup in the first few minutes feels rushed. The movie offers an obstacle to Scooby and Shaggy's friendship and confidence, which feels formulaic and forced. However, when it comes to their and other characters' emotional moments, the movie nails it perfectly; no complaints.Some of the voice actors felt miscast. (Jane the Virgin's Gina Rodriguez sounds too old to be Velma.) Others were good, but couldn't quite make the dialogue pop. The MVP in this is Jason Isaacs, who played Lucius Malfoy in Harry Potter, as Dick Dastardly. He completely encaptures the feel of old-timey mustachoid villainey.The animation is cheaper than say a film from Disney, Dreamworks, or Pixar. (Given how their attempt to create a DC shared universe didn't pan out, I can't blame the WB for being financially cautious. Even the director Tony Cervone was brought from within house.) That having been said, design-wise the entire thing looks great. There is a distinctive colorful look to this. Several characters get redesigned. I know some people don't like it when they mess with characters' classic looks, but I really, really liked how everyone appeared. Really, the design team knocked it out of the park.I know my jaded adult mind has been critical of this. Plus this isn't my, or probably many other adult SD fans, idea of the ideal Scooby film. (Scooby-Doo on Zombie Island is still the high bar to judge by.) But, I'm pretty sure kids won't have any complaints from this. Plus, I think this won't bug parents if their children rewatch. This is a perfectly decent way to spend your time."}, {"rating": "10", "text": "It's awesome the characters be a personality perfect and this movie needy for we back to room house in family and the this generations know good 90s television"}, {"rating": "10", "text": "It’s a cute movie. No, it’s not like the series and yes, Shaggy’s voice sounds weird, but my children are in love with the movie so much that we’ve seen it 17 times since May 15; it was that that reminded me that it’s a movie aimed towards kids. Personally, as an adult, it felt different, And they could’ve done better. At the end, I’m just happy that my children are loving Scooby-Doo and I hope will continue to love Scooby-Doo as much as I do."}, {"rating": "10", "text": "Clever, funny, delightful.So many references to the original material that brought tears to my eyes! A must see, for sure!"}, {"rating": "5", "text": "This movie was alright. It had some good funny moments but it has too many pop culture references and turns this into an action movie instead of a real mystery."}, {"rating": "3", "text": "\"Scoob!\" is entertaining in parts but never makes for a satisfying whole. It's attempt to be another \"Despicable Me\" instead of taking inspiration from its usual premise makes it unoriginal and predictable throughout."}, {"rating": "4", "text": "The animation is pretty but to be honest there's more heart, humor and fun in the old Scooby Doo cartoons and there's tons of them."}, {"rating": "10", "text": "This is nice movie I don't know why its got low rating Its fun And its hilarious"}, {"rating": "6", "text": "Scoob has a really smooth animation with a great cast of voice actors who do a really good job. Also, another thing which I really liked about this movie would have to be the little hidden Hanna-Barbera references in different scenes, I thought that was quite nice of them to do. Finally, the movie's got some really good songs throughout which is always a good thing. The only negatives which I had with the movie would have to be the plot and it being very predictable. Overall, it's a really lovely animated movie with a great cast who all give a really good job."}, {"rating": "10", "text": "Muito divertido, o filme consegue manter a essência dos desenhos e a originalidade, não se perde ao colocar vários personagens e núcleos e está num ótimo equilíbrio pra agradar tanto aos fãs mais antigos quanto a essa nova geração.Certeza que seria um sucesso de bilheterias"}, {"rating": "8", "text": "Loved this movie great option for kids to rediscover would have been even more awesome if all the Hannah Barbera characters would have been it"}, {"rating": "10", "text": "The story seriously departs from the usual plots of the series, when the Corporation \"Mystery\" solved another riddle with ghosts, monsters and mutants. Now the focus is on what is now popular — superheroes. And this is cool, from a light cartoon you do not need something colossal, and the emotions that it causes are chic."}, {"rating": "7", "text": "Was better than I feared it would be.  Animation was good, and the story was OK at best.  I enjoyed Dastardly, Dynomutt and Blue Falcon were better than expected...but what a miss with the voice of Shaggy...it was jarring to hear him speak and was among the worst parts of the movie for me.  Stick to the classic cartoons, Be Cool Scooby Doo and the straight to DVD movies until this is at redbox."}, {"rating": "10", "text": "#SCOOB is amazing just like the original show and brought back the classic theme song!! ‪ #SCOOBMovieNight‬. I love how they brought back every character in the Hanna-Barbera universe."}, {"rating": "10", "text": "I don't think I have ever been this horny while watching a movie.Perfect!."}, {"rating": "10", "text": "Dudes and other fairy creatures, these are the heroes of not only my childhood and any movie with them immediately becomes cool.Movie deserves it."}, {"rating": "2", "text": "Who wants to play a game of \"Guess the director's politics\"? It won't be hard. You'll see it more than you see jokes or Easter eggs. Velma's Halloween costume is Ruth Bader Ginsberg, she dyes her hair purple and complains of toxic Masculinity while looking down on her alleged friends. Fred is now pdumber han Shaggy"}, {"rating": "10", "text": "This movie was fun, visually stunning and full of surprises! I thoroughly enjoyed it."}, {"rating": "10", "text": "Dejando de lado la nostalgia, esta película es buenísima, está cargada de acción y diversión presentes a lo largo de toda la aventura y la animación es increíble. Muy recomendable."}, {"rating": "10", "text": "Scooby! é um filme divertido, infelizmente foge do que estamos acostumados no mundo sooby-doo; o ar de detetive quase não teve neste filme. Mas teve uma bela homenagem ao universo de hanna barbera. Recomendo para todos que querem reviver a infancia!"}, {"rating": "5", "text": "Hollywood, you don't need to turn everything into superhero movies and cinematic universes, and you shouldn't."}, {"rating": "0", "text": "JUST POOP...I never liked the saga!!! I like of this movie ¡NOTHING! Is a stupid movie."}, {"rating": "1", "text": "que blasfemo es llamar a esto una pelicula de scooby doo literalmente arroja lo que es esta franquicia una pelicula sin un misterio mas que nada es un intento de pelicula de superheroes cuando scooby doo no es eso"}, {"rating": "3", "text": "Terrible! The film is nothing but feminist propaganda with forced characters not matching the metrics of the story. The film massacres the original tv series and the spin off movies."}, {"rating": "6", "text": "Scooby-Doo is back and I'm glad to see him back in animated form. The film boasts a wide net of Hanna Barbera characters never before seen on film but the pacing, pop-culture references and overall story are pretty stale."}, {"rating": "3", "text": "The opening 20 mins or so was golden and had me hooked .... Soon after this we get introduced to falcon and co and things quickly went downhill for me as it became apparent that this production is trying so desperately to instantly connect with a large audience making its main characters dab and seems afraid to stick with the original characters for long instead shamelessly shoehorning in more hanna barbara characters.You even get to hear the term 'toxic masculinity'.... In a cgi remake of a beloved 70s animation..... I guess nothing is truly sacred in the entertainment business anymore. I came for the scoob but was left with gender politics and massive magical/action sequences featuring knock off minion like cg robit madness. On the plus side the visual presentation looked excellent on uhd hdr setup. My wish is that productions like this either try and come up with some new characters instead or actually let the original concepts/characters from my childhood make it to the big screen on the merit of their original design not manipulate that into just another shameless cashgrab."}, {"rating": "10", "text": "AMAZINGLY GOOD!!!Whole family loved it~9/10 for me here!Really hope they do go on with more movies~"}, {"rating": "2", "text": "A great man once said, \"It's a no for me\". On a serious note, why is Simon Cowell in a Scooby-Doo movie? I thought early 2000 references died years ago.The only redeeming quality in the movie is Jason Isaacs as Dick Dastardly, but that's really it.Every decision the film makers made for this movie was the absolute worst. The animation was bad and at times looks unpolished. How this new version handles the characters such as the old gang was painfully insulting. The Scooby gang are separated for a massive portion of the movie and we instead focus on this superhero-like story line, because superhero movies are popular right now. The voice acting was pretty terrible and how the movie applies modern technology into the story was straight up embarrassing.It's a factory-made movie produced by a bunch of old boomers that try so hard to be hip for the modern youth, but it will age like sour milk.I thought we would get a Scoob movie in the same vein as 'The Peanuts Movie' back in 2015. I guess not."}, {"rating": "5", "text": "Very Mixed BagDespite great animation, a great cast, and some heartfelt moments between Shaggy and Scooby, Scoob! Is a major disappointment with a script that is very messy, So-So humor, and focusing way too much on starting a cinematic universe."}, {"rating": "9", "text": "I literally have no idea why the ratings are bad. This movie was fantastic. Funny, enjoyable, and a genuine surprise all the way through. Just goes to further cement the reason I dont bother with critic reviews."}, {"rating": "7", "text": "E-Value: 7Acting: 8Plot: 5After two terrible live action movies and many direct-to-video movies, Scooby-Doo franchise returns to the big screen and this time in an animated movie. This movie is the first instalment in the planned Hanna-Barbera shared universe. Originally, the movie would have release in the big screen if it weren’t for the COVID-19 pandemic. Instead, the movie goes straight to video on demand.The movie begins with Shaggy (Forte) meeting a stray dog, whom he named the dog, Scooby-Doo (Welker). Soon, they become close friends. During Halloween, they meet Fred Jones, Daphne Blake and Velma Dinkley where they catch a costumed thief who have been stealing many electronic devices. This inspires them to work together as a team known as Mystery Inc.Ten years later, a British entrepreneur decides to do business with Mystery Inc as its investor but he would not invest if Shaggy and Scooby are part of it because he claims that friendship is a weakness. Angered by his words, Shaggy and Scooby leave and hang out in a bowling alley where they were attack by small robots called Rottens.They were later rescue by the Blue Falcon, Dynomutt and Dee Dee Sykes in a nick of time, whom they told them those robots work for a super criminal named Dick Dastardly (Isaacs). Dastardly wants Shaggy and Scooby for reasons unknown but it has something to do with the three skulls of Cerberus, which he has been stealing them. Meanwhile, Fred along with Daphne and Velma soon tracks down Shaggy and Scooby and they work on their own in solving the mystery to find out what is Dastardly’s plan.I may not a big fan of Scooby-Doo franchise but Scoob! is a fun and enjoyable movie to watch. The animation and character design are very well done and the voice acting are great. There are lots of funny moments and the humours are not weak and lousy. Although none of the original cast of the previous Scooby-Doo movies (except Frank Welker) returned to voiced their respective characters, everyone in this movie still delivered their best performance. As for Will Forte, he managed to gave his best voice acting for Shaggy. At least, it is a good thing that Shaggy does not sound terrible. However, I wish Matthew Lillard would reprise his role. It would have been great service for hardcore fans of the franchise.While I enjoyed watching the movie but the story in this movie have some flaws. As this is the first instalment in a shared universe, the movie used up too many characters outside of Scooby-Doo franchise. Because of this, Scoob! became more a Hanna-Barbera crossover movie instead of a Scooby-Doo movie. The movie should have focus on mystery solving stories like how every other Scooby-Doo TV shows and movies have done previously. Honestly, the movie should have been full origin story with Scooby-Doo characters only. The crossover stories should have been save for future instalments. One thing good about this movie is Scoob! did not go overboard with setting up some future instalments like the 2014’s The Amazing Spider-Man 2 and 2017’s The Mummy.For those who are fans of Hanna-Barbera, you probably will enjoy watching this movie but those who are Scooby-Doo fans, you may or may not like this movie. For the time being, we can only wait and see if this movie will be success. If it does, there might be a sequel to this movie or more Hanna-Barbera movies will be made. If not, this will the only instalment in Hanna-Barbera shared universe. Only time will tell. In the nutshell, this is a mediocre movie. Not too good but it is not too bad either. You can give this movie a shot if you are curious."}, {"rating": "5", "text": "Se eu fosse descrever SCOOB! numa palavra diria “indeciso” porque não faltaram histórias para contar, certo ?! Mas, parece que preferiram mais do mesmo entre essas animações que pouco explicam e nada dizem ao mesmo tempo! O visual dos personagens deste novo \"Hanna-Barbera-verso\" nos convence com o carisma de cada um deles e nos faz esperar que possam continuar, mas digo que não foi um bom começo para este Universo. É confuso e ao mesmo tempo você não entende o que está acontecendo na tela."}, {"rating": "0", "text": "THIS MAY CONTAIN SPOILERS ⚠️-First off, I lived my whole life watching Scooby-Doo.And this one, I gotta say it's probably one of the worst ones.Like, Down there with the \"Be Cool, Scooby-Doo\" series.It's such a dissapointment.And such a waste of time.Why even bother making a movie, YET AGAIN?They could've done something way better like, Make the third season for the \"Scooby-Doo: Mystery Incorporated\" series? This movie has no purpose whatsoever.What's it for? Oh, Money.Now as a Scooby-Doo fan i was extremely dissapointed, Even the first second in i was already dissapointed.The fact that they remade the original theme song to some dumb autotuned upbeat track? Oh"}, {"rating": "3", "text": "It’s a bad movie but it’s very funny also. The voice acting and animation are fine but Mark Wahlberg sucks as Blue Falcon. The jokes are horrible and will probably be dated in the next 5 years yet they are hilarious because of how bad they are. There are a ton of references that I doubt the targeted audience of children will get such as Tinder, search history jokes, and personal messages and dms. It’s very poorly written and the soundtrack is half boring and half dated. I don’t regret watching it but it’s pretty terrible. It’s probably better to watch this with friends."}, {"rating": "2", "text": "The thing that holds the film back is the title. Might as well be called \"Scooby-Doo and Blue Falcon: A Superhero Adventure!\" No mystery, no catchphrases? What type of Scooby-Doo am I Watching? The new hip youngster one with celebrities? Oh wait...My Metacritic Score: 34"}, {"rating": "6", "text": "Para minha surpresa, a obra foi completamente \"assistível\".O humor é bem claro no que se diz respeito ao publico alvo, porém, ainda há algumas piadas e referencias que ao menos tiraram um riso do meu rosto. Os personagens não são bem desenvolvidos. Porém, pelo fato de serem não só rostos mas personalidades conhecidas, o filme não precisa se esforçar muito para que gostemos deles. O mesmo diz respeito ao vilão e a outra equipe que os ajudam. Acho que a presença deles foi interessante e divertida. O filme também possui umas subtramas bobas que deixam a experiencia mais leve e fora do foco. A animação está lindíssima - eles acertaram em cheio na caracterização dos personagens também. Ninguém soou estranho aqui.Essa não é uma animação que agrega muito - o que vem sendo pregado pela pixar e disney há muito tempo, porém, ainda sim da pra passar o tempo, principalmente se quem estiver assistindo for uma criança."}, {"rating": "3", "text": "Just nothing felt right about this movie. The plot felt shallower than a 20 minute SD episode. Forte was a terrible Shaggy, none of the characters felt like they were written by someone that's ever seen an episode. I barely got a smile out of a couple side jokes. Never laughed once. The live action movies were far better. If you need something fast paced to keep the kids entertained I guess it's OK, but it's not Scooby Doo."}], "recommendations": ["scooby_doo", "penguins_of_madagascar", "teen_titans_go_to_the_movies", "ice_age_the_meltdown", "hotel_transylvania_3_summer_vacation", "hotel_transylvania_2", "tmnt", "the_lego_ninjago_movie", "despicable_me_2", "scooby_doo_2_monsters_unleashed", "ghostbusters_ii", "the_angry_birds_movie", "home_on_the_range", "ice_age_collision_course", "the_lego_movie", "minions", "ice_age_continental_drift", "the_lego_movie_2_the_second_part", "the_grinch", "monsters_university", "rio_2", "free_birds", "the_secret_life_of_pets_2", "the_smurfs", "my_little_pony_the_movie"]}