{
  "id": 1086,
  "title": "Scouts Guide to the Zombie Apocalypse",
  "starring": [
    "Tye Sheridan",
    "Sarah Dumont"
  ],
  "runtime": 93,
  "genre": [
    "Comedy",
    "Horror"
  ],
  "description": "Three scouts and lifelong friends join forces with one badass cocktail waitress to become the world’s most unlikely team of heroes.  When their peaceful town is ravaged by a zombie invasion, they’ll fight for the badge of a lifetime and put their scouting skills to the test to save mankind from the undead.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lUKvvSnjFlazrdh6wyHxHrdMknD.jpg",
  "categories": {
    "plot": 5.833333333333333,
    "acting": 6.75,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.583333333333333,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "One of the most entertaining films I've seen in years.  Yes, it's an adolescent action-horror flick; it's also a parody.  It's what people used to call a \"madcap comedy.\"  It succeeds in making most of Romero's stuff look worse than lame and it's far funnier than Shaun of the Dead.  Also, the people who made this film appear to know something about pacing.\r Anyone who rates this film at 6 or less is probably a very boring person."
    },
    {
      "rating": "8",
      "text": "Scouts Guide to the Zombie Apocalypse isn't bad, but it's disillusionment, the jokes don't work, and there barely any laughs here only chuckles. It's a dopey gargantuan dumb fun with charming, witty and like able characters also grand CGI, Landon's film is mirthful and has a heart not to mention funny juvenile humor, but his directing isn't well handled also not good when comes to comedy, but at least he lets his actors shine. Ben (Tye Sheridan from Tree of Life) is a local scout troop along with sex-obsessed Carter and nerdy Augie (Joey Morgan). Ben doesn't like the uniform because it doesn't attract the ladies, a random zombie apocalypse hits their small town. They team up with the tough kick-ass cocktail waitress Denise (Sarah Dumont) who works at the strip club called Lawrence of Alabia. I forgive the screenwriters including Christopher Landon (who co-wrote the script and direct Paranormal Activity: Marked Ones also co-wrote the three Paranormal Activity installments) for adding teen-romance and drama. Ty Sheridan, Logan Miller and Joey Morgan have some A1 chemistry and they can act, but this isn't there best film, but the film shows what their talents. Grade B"
    },
    {
      "rating": "10",
      "text": "Apologies if this happens to offend certain highbrow critical sensibilities, but I haven't run across a movie that's (intentionally) made me laugh so hard in years. My husband and I rented this one thinking \"Meh, the reviews weren't so great but let's give it a shot.\" So I guess I don't understand -- were we all watching the same flick?? I feel like reviewers calling it \"sophomoric\" and \"ribald\" and \"frenzied\" are utterly missing the point: that's exactly what it's going for, because it's turning every single decency-duty-and-honor scout cliche right on its head. I've been a horror fan for years, and thought I'd seen everything the (WAY) overplayed \"zombie apocalypse\" genre had to offer. This movie is absolutely fearless in its attempts to cook up the most screwball, gross-out, left-of-center scenarios imaginable -- and it has an absolute, unabashed ball serving them up. I dunno, I thought practically everything about this film was a riot ... and buried under all that mayhem is a sweet heart to boot. As a general reference point, I loved \"Shaun of the Dead\" and \"Zombieland.\" This one delivered just as many action-packed scares and gross-outs, but made me laugh more."
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "10",
      "text": "It's supposed to be random, stupid, and funny. I mean, I laughed at this harder than I have laughed at any movie ever. I love the acting, the comedy. the action, the direction. This movie is well done. Don't take it seriously people. To me, this was the best movie I've seen in 2016, so far."
    },
    {
      "rating": "7",
      "text": "Scouts guide to the night of the living dead.\r At first I believed it was a children's horror movie, I have not even known it was rated R. In the opening scene itself convinced me that it's going to be aggressive as the progression commence. Yeah, it lived up to my last minute expectation. A fine time pass movie for the regular audience, definitely it won't suits for the critics' viewing.\r When the three friends find virus outbreak in their town that turns everyone into zombies, they plan to make into a safe place along saving a few others in their attempt. Surely this is what every zombie movie you have seen dealt with. The same old adventure in zombie theme, but the characters and the scenarios were different with lots of fun. I was surprised at that part, surely a cult status will be tagged for it.\r Overall movie was decent, but being a horror-comedy was its strength. Just leave the logics behind and enjoy the entertainment it offers. In the end you will be convinced for your patience. It is the movie you might like it, but can't give full marks. One of the many reasons was, it is not a mainstream actor or the filmmaker's film. But still the entire team was awesome, and delivered its purpose. It was not a box office hit, but still I expect there will be a sequel.\r 7/10"
    },
    {
      "rating": "8",
      "text": "If you take the movie as a serious one, you will not enjoy it, it is plain stupid, but that is the goal, it is a good movie if you just want to turn off your mind for 90 minutes"
    },
    {
      "rating": "10",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "Title: Scout’s Guide to the Zombie Apocalypse\rMedia Type: Film\rZombie Type: Some slow, some fast, some surprises\rOutbreak/Apocalypse Phase: Initial outbreak (characters experience the outbreak as it happens)\rSub-Genre: Horror/Comedy\r Having never heard of this, I went into the film expecting little more than the typical D-level trash found on most streaming sites.  You know what I mean; the hundreds of zombie movies that appear to have been filmed by bored high school kids during summer vacation.  The experience was thankfully more akin to Zombieland.\r Combining witty (frequently over-the-top) humor, clever sight gags, inventive zombie death and dismemberment scenes and the best use of a trampoline ever, Scout's Guide to the Zombie Apocalypse is not only similar in tone to the 2009 horror comedy hit (Zombieland) but is easily the best and most fun zombie romp since Woody Harrelson's epic quest for Twinkies.  Do yourself a favor and give it a shot, but don’t spoil anything with the trailer.  I haven't seen the trailer, but I hear it gives away least two memorable scenes.\r Final Verdict: Highly recommended!"
    },
    {
      "rating": "10",
      "text": "Quero falar sobre o filme Como Sobreviver a um Ataque Zumbi.\rA critica especializada detonou esse filme. Isso só mostra como a critica especializada são feitas de velhos com senso de humor falecido.\rIsso explica esses remake de clássicos como Mad Max, Star Wars e Jurrasic World estarem recebendo criticas super positivas... Mad Max é muito bom sim, mas Star Wars e Jurrasic World não são lá essas coisas, ficaram presos ao passado.\rSó estão sendo elogiados por que foram filmes feitos na época que esses críticos eram jovens, e eles são fãs.\rE eles estão presos ao passado, sem permitir novidade, e por isso filmes com um humor mais pesado não passam.\rO filme tem um humor pesado e com nudes, obvio que foi proibido para melhores de 18 anos nos cinemas. O que impediu o publico do filme assistir. O filme não foi feito pra gente velha e sim pra garotos de 14 anos ou com mente de 14 (tipo eu) que gosta de rir desse tipo de humor. O filme foi uma fracasso de bilheteria.\rMas agora ele chegou a internet, onde seu publico vai poder assistir. Assim como Eurotrip e Sex Drive, eu digo, esse filme vai se tornar mais um épico da internet. o Torrent já é uns do mais baixados do dia.\rEu gostei demais, é um filme totalmente fora da casinha e dos padrões imposto por hollywood. Assista, mas só se você tiver senso de humor.\rEsse filme é o que a comedia está precisando. A comedia não precisa de Oscar, precisa de filme como Eurotrip, Sex Drive, Caindo na Estrada e Como Sobreviver a um Ataque Zumbi."
    },
    {
      "rating": "0",
      "text": "How how how is it even possible that these movies keep getting made? The same hack that did the later Paranormal flicks - which got worse and worse and worse - is not directing this piece of trash.\rFolks STAY HOME. Rent a scary movie if that's what you're looking for. $15 to see this is unconscionable."
    },
    {
      "rating": "4",
      "text": "I honestly expected it to be much worse, but Scouts Guide To The Zombie Apocalypse is still a silly attempt at a great, entertaining, horror comedy. If you like zombie comedy, you will enjoy this, but if you're like me, and don't really enjoy that stuff, you will find yourself wondering why the film is so stupid."
    },
    {
      "rating": "10",
      "text": "+++++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷×÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "6",
      "text": "It doesn't attempt to achieve a ton, but it has a heart, and it's not nearly as snarky or ironic as most teen flicks or zombie stories.  It actually gains a ton of momentum toward the end, so don't walk out on this movie.  The humor is dead pan as hell.  If you're looking for a B-movie that you can laugh with  (and at), you could do much worse."
    },
    {
      "rating": "0",
      "text": "I joined up to metacritic in the hope I could save someone from throwing away 1 hour and 33 minutes of there lives. It was simply the worst movie we have ever seen. We would have walked out if we weren't at a drive in."
    },
    {
      "rating": "10",
      "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"
    },
    {
      "rating": "0",
      "text": "Zero stars is a first for me. I tried to find something redeeming about Scouts Guide, but to no avail. I just don't understand what the heads of movie studios are thinking when they greenlight stuff like this. I think USA network or SYFY channel could have done better.  Half way through this nightmare, all I was thinking was - I wish someone would shoot me! It was a slow death. I struggled not to walk out. Cheap. Amateurish. Vulgar. Inane. Ridick."
    },
    {
      "rating": "4",
      "text": "A   sloppy,  unfunny,   lazy,   horribly   paced   crap   fest. Tye  Sheridan  makes   it   barely   watchable. A  big  fail  for  a  strong  premise."
    },
    {
      "rating": "3",
      "text": "Scouts Guide to the Zombie Apocalypse is like Superbad with zombies added to the mix, but imagine taking away the humor, funny character's or anything interesting in the plot, and you've got this mess of a movie. Tye Sheridan was the only good thing in this movie. I wanted this movie to be good, but sadly it let me down."
    },
    {
      "rating": "0",
      "text": "this movie make me soooo mad. its sooo bad! i just waste 90mins of my life and money to see the stupiest dumbest movie on the planet. arggggggg!  this should have gone straight to video. how it get in theaters i don't know.  if i see anyone from this movie on the street who make it i will demand my money back"
    },
    {
      "rating": "6",
      "text": "It's got stupid humor and zombies coming together in the most immature of ways. If you enjoy/can put up with those two elements then you'll do okay with this flick. It's cheesy, stupid, at at times very funny. In the end though it's not hard to wish that there was just more good about it overall.\r The young cast is pretty talented. Although Tye Sheridan seems a little wooden here and you can tell he really isn't trying at all. The majority of the laughs come from Logan Miller who occasionally is forced to overact because of the material. The rest of the cast just sort of lays on the cheese with their performances, but who can really blame them this kind of movie.\r As far as the action goes the movie has some pretty great gore effects. The kills are brutal and often absurd. It makes the whole thing more entertaining overall and proves once again that it's just fun to watch people kill zombies.\r If only the jokes were just as entertaining. Unfortunately not all of them stick the landing. There are some laugh out loud funny moments here, but all too often the movie just relies on the characters freaking out at the sight of boobs or making lame penis jokes to get by. Yet for all it's stupidity and half-hearted attempts at sexual humor there are some hilariously absurd moments that will have you rolling on the floor.\r Is it worth putting up with the rest of the film to see them though? It depends. If you just really enjoy zombies and immature R-rated humor like I do then it's worth a quick rental for some cheap thrills. How ever if you have a.... classier, more refined sense of humor then stay far away. The penis jokes, boobs, and blood aren't going to be your cup of tea.\r Yet, even for those of us who love this kind of thing this isn't the most entertaining way to get our fix. Yet, like I said it's worth a cheap watch just for some gross laughs and zombie killing fun. The plot and lesson about friendship and growing up might fall flat on it's face, but when it comes to watching a mostly charming cast come together as high school losers facing zombies it has it's moments. That at least makes it passable in my book."
    },
    {
      "rating": "1",
      "text": "Never scary, and rarely funny; Scouts Guide to the Zombie Apocalypse is one of those many, many movies that will be completely forgotten by tomorrow..."
    },
    {
      "rating": "5",
      "text": "I didn't know anything but the title of this and thought, for a buck fifty Redbox rental...why not? When it started with Blake from Workaholics playing a janitor, I thought, okay this may be actually good. Wellll, how about merely good. It's definitely R rated, which was a surprise. But F bombs do not a comedy make.  Nor do cliché upon cliché. Our three boy scout heroes come from every teen comedy under the sun. The earnest guy who wants to do good while crushing on the hot girl (with the dick boyfriend), the chubby schlub who's REALLY into scouts, and the horndog best friend. \"Earnie\" and \"horndog\" are invited to a private senior party, that will be the NIGHT OF THEIR LIFE!!!! Of course they split from Augie, the schlub, to attend. Of course they're discovered by Augie. Of course they make up and become better friends at the end. And the good guy gets the girl in the end. After saving the day, of course-....I gave it an extra point because it's gleefully dirty in a totally juvenile way, with zombie dick jokes and a zombie oral sex scene that was beaten by ReAnimator thirty years ago, but was still appreciated. Good for a few chuckles and a laugh or two. Catch on cable if you must....."
    },
    {
      "rating": "4",
      "text": "Scouts Guide to the Zombie Apocalypse is another addition to the already oversaturated zombie genre. Its not a Zombieland rip off by any means but is similar enough and its not nearly as good. The leads are all fairly enjoyable in this movie, everyone gives a pretty good performance but something is definitely missing and that is comedy. I never felt like there were really any fresh jokes in this and I know that the horror comedy genre is already stretched pretty thin. It was also pretty slow getting underway for a 90 minute movie. I wasn't expecting Scouts Guide to the Zombie Apocalypse to be good and it wasn't, I'm really not any worse for it."
    },
    {
      "rating": "4",
      "text": "Despite having some brief fun moments here and there Scouts guide to the apocalypse is a largely unfunny and boring affair with little fun unlike what was promised in the trailer."
    },
    {
      "rating": "6",
      "text": "The performances are mediocre and the movie is too absurd at times for its own good. That said, it's a breezy watch with a few genuinely funny scenes."
    },
    {
      "rating": "9",
      "text": "A clasic for me. You may love it or hate it. I know it has many  flaws but it's so much better than the zombie movies from the last 15 years. It has the something of the old movies because of a certain type of narative line and caracters .That from  a 45 years old  movies fan."
    },
    {
      "rating": "2",
      "text": "Scouts Guide to the Theater Showing an Insanely Bad Movie. Zombies have been easily overused in movies a lot... and if you're going to add zombies in the movie, please make your movie worth to watch."
    },
    {
      "rating": "6",
      "text": "Deutsche Review - KritikDer folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden?Dann sind hier meine Punkte.Mein persönlicher Score = 64/100Mein User Score = 6/10Lohnenswert? =Fortsetzung erwünscht? ="
    },
    {
      "rating": "6",
      "text": "I love this funny movie. This movie is not scary at all. Even it is funny. I laughed many times. When the students take selfies with zombies, it was a crazy Instagram-moment! Many zombies are killed. But the blood looks like \" tomato juice\". It is funny.If you are looking for some Halloween movie for 90 minutes, Please enjoy it. Your kids will laugh instead of crying. LOL."
    },
    {
      "rating": "9",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:**;*;*;*:*;*;*;*;*;*;*;*☆⊙°•☆⊙°••°⊙☆•°⊙☆•°⊙☆☆⊙°•☆⊙°•☆"
    },
    {
      "rating": "8",
      "text": "An instant classicThere have been a number of horror comedy films the last few years but none have came close to the likes of shaun of the dead. Well im glad to say that times might be changing as this film is as good if not better than the yardstick of shaun of the dead, from the hysterical opening scene scouts guide to the zombie apocalypse is a instant hit. When three scouts on the last camping trip find themselves in a life or death situation when there town is taken over by blood thirsty zombies they have to use all there knowledge they picked up in scouts to try save themselves and there town. There are some awesome kill scenes the comedy is genius from the dolly parton to Britney spears scene this film is a must see!! the plot is a bit thin but with the brilliant acting and script it makes up for it, scouts guide to the zombie apocalypse is now the new yardstick for true comedy/horror films."
    },
    {
      "rating": "0",
      "text": "I've watched this movie this week because one of my friends recommended it to me. The movie was so bad that I had left a review. The story doesn't know what's it doing. There is a scene where there is a zombie dancing to his favorite song and there is one zombie in strip club crouch running idk if that's a word and I thought they were going somewhere with these but no they just didn't know what to do with the film. It's bad u didn't even laugh once during the entire movie. I do not recommend"
    }
  ],
  "recommendations": [
    "zombieland",
    "piranha_3dd",
    "drag_me_to_hell",
    "cabin_fever",
    "cooties",
    "the_babysitter_killer_queen",
    "scary_movie_5",
    "the_host",
    "a_haunted_house",
    "crank_high_voltage",
    "a_haunted_house_2",
    "vampires_suck",
    "the_happytime_murders",
    "the_hangover_part_ii",
    "baywatch",
    "snakes_on_a_plane",
    "deuce_bigalow_european_gigolo",
    "scary_movie_4",
    "21_jump_street",
    "zombie_strippers",
    "scary_movie_2",
    "scream_4",
    "hostel",
    "rough_night",
    "the_revenant"
  ]
}