{
  "id": 1761,
  "title": "Scream 3",
  "starring": [
    "Neve Campbell",
    "David Arquette"
  ],
  "runtime": 116,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "While Sidney lives in safely guarded seclusion, bodies begin dropping around the Hollywood set of STAB 3, the latest movie based on the gruesome Woodsboro killings.",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mLljepVl9NMPlaRDCGqPxTml8GW.jpg",
  "categories": {
    "plot": 5.545454545454546,
    "acting": 5.423076923076923,
    "ending": 6.0,
    "soundtrack": 7.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.052631578947368,
    "action": 6.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I'm gonna go against the crowd and say that this was my favorite installment of \"Scream.\" It has a a good plot, a good music score, a great cast, everything that's suppose to be in a film. I also liked the small tastes of humor that were presented through out the film. Great movie! The \"Scream\" Trilogy is the best horror trilogy of all time."
    },
    {
      "rating": "10",
      "text": "much people say, \"Scream 3 is the worst film of the saga\", but no, is great, the character of Jennifer (Parker Possey) is the best of the saga. Scream 3 is fantastic. I love this third part."
    },
    {
      "rating": "9",
      "text": "Excellent movie, and a rarity that a 3RD horror sequel can do so well! This one is sort of different as it feels like they soft pedal the horror/gore and amp up the comedy and story telling. It still works, but I think some people were put off by that. One of my favorite series in horror EVER!"
    },
    {
      "rating": "9",
      "text": "--------------------------------------------------------,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,"
    },
    {
      "rating": "9",
      "text": "Scream 3 is a phenomenal finale to the trilogy. The twist in the movie is clever and it clarifies why Billy & Stu attacked Sidney's mother in Scream 1. Billy was motivated by Sidney's half brother who she didn't know existed. Her half brother showed Billy a home video he made of Sidney's mother meeting Billy's father at a motel for a tryst. After Billy's mother found out she abandoned him. The twist in this movie is brilliant & unforseeable, A- for the conclusion."
    },
    {
      "rating": "9",
      "text": "Liev Schreiber came up with the idea of having his character (Cotton Weary) be killed off in the opening scene."
    },
    {
      "rating": "7",
      "text": "A good movie, but, probably my least favorite Scream. The ending felt too out of nowhere for a movie that is also supposed to be like a guessing game, and, the side characters were even less memorable than the second movie."
    },
    {
      "rating": "4",
      "text": "They say third time's a charm. Well, wait until you see \"Scream 3\", and then you WILL 'scream'."
    },
    {
      "rating": "1",
      "text": "It has finally become what it has been making fun of the whole franchise. Sorry Wes Craven you just made this franchise have a bad reputation. It lacks scares, but gains in unintentional laughter. Wow I give this movie 14%."
    },
    {
      "rating": "9",
      "text": "mhugyfvhhvctyfughiihihihininni..............@#$%&*():;!÷▪○●□■☆⊙°•¤¤《》¡¿¡♧◇♡♤{}[]●■°▪•●■●○▪●■•▪°¤》"
    },
    {
      "rating": "7",
      "text": "More of the same."
    },
    {
      "rating": "8",
      "text": "Many fans consider this one to be the weakest but I honestly liked it.The overacting and the constant references to Sydney's mother might be annoying for some but the action and the blood redeem those defaults.Overall, a great movie to \"finish\" the saga."
    },
    {
      "rating": "4",
      "text": "The third entry in the iconic slasher movie spoof franchise, Scream 3 is a film that still maintains the same level of fun as its predecessors and is mildly scary, but it is such a mess in execution that it is hard to claim Scream 3 is actually a good film. Due to horrible acting, too many meta references to the series itself, and an annoying continuance of calling out classic slasher tropes only for that exact element to be included in the film, Scream 3 falls apart. However, where the film truly sputters is in how it strives to just re-create the original film through not just references, but by literally returning to the set itself. Trying too hard to be irreverent and funny in depicting that level of metahorror, Scream 3 just winds up stepping in the same footprints as the original and the sequel, while falling into all of the same pitfalls along the way.One of the worst elements of this franchise is the inclusion of Randy or anybody who explains what this entry of a horror franchise typically includes. It is funny to some degree in calling out classic horror franchises and how true it often is, but in the context of the film itself, it just serves to sum up this film too much. Scream 3 is one of those spoof franchises that believes it can use the same tropes as the films it spoofs as long as it calls out how it is a trope and places its tongue firmly against its cheek. Unfortunately for Scream 3 and any other film that tries this, it only winds up being incredibly annoying to watch. Scream 3 knows exactly how silly the third entry in a horror franchise can get with unstoppable killers and revisionist history in the series, yet it opts to go full bore into both issues and more. It hardly even spoofs them anymore either, it just mocks the tropes and then uses those same tropes, which somehow makes it worse than the films it mocks due to this self-referential angle. In the same vein, Scream 3 cannot help but mention the events of the past films. Though it creates a compelling case in this film with the resurgence of a killer who leaves behind pictures of Maureen Prescott, the film's continuous referencing of the prior films feels like the new writer trying to remind himself of what happened as it progressed through the script. Every scene seems to have at least one reference to past events that brings newcomers to the series up to speed and allowed the writer to remember for himself. For those who watched the first two, Scream 3 winds up embodying the worst quality of many sequels in how it wrongly believes that just because it tosses in this fan service, it can get away with not being that good in its own right and just rehashing what made the originals so good. This does not work in the film and, together with its meta humor about the horror genre as a whole, Scream 3's reliance upon plot rehashes and refusal to innovate on its general narrative (once more, the film is just Sidney running from Scream with the help of Gale and Dewey, which is tiresome by this point) winds up turning this sequel into a poor re-enactment of its predecessors. Though still mildly fun and scary, Scream 3 just plays like a reminder that, if you do like these characters and scenarios, your time would be better spent watching its predecessors.Where Scream 3 is successful, however, is in its setting. While it does derive some horror from the inclusion of Maureen's ghostly voice, Scream 3's setting on the set of the fictional film Stab 3 and how it uses it to critique Hollywood is rather fun to watch. In many ways, Scream 3 is almost more of a critique of the Hollywood system than it is of horror films. Critiquing the way in which women have to sleep with men for parts, the way in which they are abused by powerful men, how serious directors have to make crappy sequels to get clout, and how stupid sequels are in general, Scream 3 is a film that is deeply Hollywood and yet it is unafraid to mock Hollywood and call out the abuses in place. The irony that Harvey Weinstein produced the film does seem lost on Scream 3, however. Fortunately, the smart critiques of Hollywood are not lost with the film having a fun time traversing the minefield that is Hollywood and mocking the absurd system that gave rise to a third, unnecessary Scream film.Mildly funny and occasionally scary, Scream 3 is a film that is too caught up in calling attention to horror tropes and referencing its predecessors to carve out its own path as either a horror film or a member of the Scream franchise. As a result, it just spoils itself by calling out exactly what will happen and it does so while just following a very similar to the original. Fortunately, the added twist of the Hollywood setting is a nice touch, even if its reveal of the killer and its revisionist history about the previous films is really stupid (dumber than usual too since it said it would happen)."
    },
    {
      "rating": "7",
      "text": "Not as good as the first two. But it is still is very entertaining, funny and extremely unpredictable. It is a very honorable third chapter in this series."
    },
    {
      "rating": "4",
      "text": "They say the third time's a charm. In the case of the Scream movie series, the Wes Craven/Kevin Williamson collaboration credited for having revived the slasher genre in the '90s, this cliché proves to be a falsehood. The most recent (and hopefully final) chapter in the comedy/horror trilogy comes across as a lame regurgitation of material already presented. There are no real surprises, and the whole affair has the feeling of something left too long in the pot to stew. The life and energy is gone. What began as a lively, intelligent series suffused with self-referential humor has turned into just another slice-and-dice-by-numbers affair. Scream 3 isn't just the weakest of the movies, it's the kind of thing that the original Scream lampooned with affectionate glee.\r Scream 3 features three good moments, but they're hardly enough to save the movie from the tedious spiral of repetitiveness it is trapped in. The first is a from-beyond-the-grave video lecture by Randy (Jamie Kennedy), who offers up the \"rules of the trilogy.\" For example, \"events in the third segment always go back to the beginning\" and \"even the hero can die in the final chapter.\" (One that he doesn't mention, and which proves true in this case, is that the final installment of any trilogy is usually the worst. The examples Randy cites, Star Wars and The Godfather, are classic examples of this.) Then there's a brief cameo by cult heroes Jay and Silent Bob, who are given a couple of lines (well, at least Jay is. Finally, Carrie Fisher appears as a receptionist who bemoans not having gotten the part of Princess Leia in Star Wars because she wouldn't sleep with George Lucas.\r When it comes to storyline, character development, and pacing, Scream 3 strikes out. The movie drags along from one predictable slaying to the next, and the only real scares along the way are the \"boo!\" moments when something innocuous jumps out of the shadows just before the real killer strikes. Meanwhile, the level of humor in Scream 3 is way down. Parker Posey (as the actress playing Gale in the Stab series) has a few amusing lines, but the ironic dialogue and cute references to other horror films, which were wearing thin in Scream 2, are now positively threadbare.\r Once, I wrote that Scream 3 would have to do something radical or inventive to avoid becoming tiresome. Unfortunately, there's nothing here that even the most inexperienced horror film fan would call innovative, and the predictable result is a movie that pales in comparison with its predecessors. Thus far, 2000 has been a very bad year for films, and Scream 3 does nothing to reverse the trend."
    },
    {
      "rating": "7",
      "text": "Ask people what they think of the Scream trilogy, & usually their exact words will be: \"Liked 1, liked 2, didn't like Scream 3\", so this film is the end of the scream franchise, (well, for following 11 years anyway) and it's disliked by a lot of people, personally, I think this is my second favourite scream film, just under Scream 1 and above Scream 2, however the main thing that puts a lot of people off, is its lack of originality and freshness, and it's easy to see that this film feels almost as created as the 'I know what you did last summer' franchise, but I think that this film is very entertaining, this film was given a whopping $40million budget and you can see where the money has gone, I think the finale in Milton's gigantic mansion is the best finale of the franchise, & this is why this film sits in second place for me, while it is cheesy, it is entertaining, and should be given a shot. (it's also the only film in the franchise that made me jump several times, just saying!)"
    },
    {
      "rating": "5",
      "text": "Overall I Am Really Not Sure What To Score This Film..Scream Was Good, And Scream 2 Rocked, But Scream 3??Some Things In This Movie Were Done Very Well.. Neve Campbell Does A Great Job, As Well As Courtney Cox, But David Arquat Is A Very Bad Actor.. He Needed To Be Cut Off From Ruining This Movie.. Dewey Go!In Some Spots There Are Really Bad Writing.. But In Others Its Very, Very, Good...Overall This Is Not A Bad Movie Or A Good Movie.. It's Just A Movie :)"
    },
    {
      "rating": "5",
      "text": ""
    },
    {
      "rating": "7",
      "text": "Ok, it's a step back, but it's still a fun movie. The horror element is a bit lost in the comedy side of it. It has some great moments. I found the movie got good from the house explosion and on-wards. Kevin's writing is sorely missed in this film, and so is Neve. Not enough screen time for her. All in all it's a good movie, but compared to the 'Scream Standards', it just falls short"
    },
    {
      "rating": "5",
      "text": "'Scream 3' still has the familiar traits that made the first two films so dynamic, but the film as a whole proves that Ehren Krueger holds NOTHING to Kevin Williamson."
    },
    {
      "rating": "2",
      "text": "I am glad that they stopped the franchise with this film (ending the trilogy) because its the same formula with no originality to it and its still too recycled from the first film. Acting is rather poor and they try far too hard to sell their parts and that results in quite a bit of overacting. The whole plot twist was rather stupid as well and sort of ruined the previous films because of it."
    },
    {
      "rating": "7",
      "text": "Scream 3 is a jaunty, light addition to the Scream franchise. It doesn't have the originality of the, uh, original and it doesn't achieve the intense scares of the second installment. What it does have is a colorful, in-joke heavy parade through familiar ghostface shenanigans. Whilst it is certainly a weaker threequel,  Scream 3 still maintains a lot of fun (and lovable characters) for series fans."
    },
    {
      "rating": "1",
      "text": "A poorly executed film that nearly fails on all levels. It's not scary, it's not funny or clever, it's just a drag."
    },
    {
      "rating": "3",
      "text": "is the worst film in the Scream series is very annoying because the movie not the fear, the suspense that appears is not the same thing the other two films, the villain is a bit disjointed"
    },
    {
      "rating": "6",
      "text": "Well, the Scream films just keep going down in quality (Please God let the fourth one be good!!!) It had definite glaring flaws but it still was great fun to watch. Ghostface still has to earn his kills which is a nice thing to see, and there is a decent amount of cute comedy. The acting is pretty much the same all around. The screenplay was much weaker. There were some parts that were like \"okay really? you could have done better than that.\" It was simply a good time all around. Nothing too special. I wouldn't rank it as high as the first or even the second. But it was fun. My advice: see it as a completion of the trilogy. Particularly if you are going to see the fourth one.TRIVIA TIME: 1. Wes Craven filmed three different endings and didn't tell the cast which one he was going to use.2. The bathroom Sidney finds Angelina in on the set of \"Stab 3\" is the same bathroom used when Sidney is attacked in the original Scream. You can tell by position of doors and soap dispenser design.3. Between Scream 2 and Scream 3, David Arquette and Courteney Cox (two of the five actors who feature in all the Scream movies) got married. They met on the set of the first movie, were an item whilst shooting the second and by the third they were married. Courteney added 'Arquette' to the end of her name, as can be seen in the credits. Courteney and David had to cut their honeymoon short to begin filming Scream 3."
    },
    {
      "rating": "4",
      "text": "While not a horrible film by any means, Scream 3 certainly doesn't live up to the heights established by its predecessors. It has its good moments, such as Parker Posey's performance as a whole, but all in all, it's not scary nor does it deliver any tension. This is a horror film, right? I didn't like how it took a more comedic route; it made the film dwell into self-parody.Not terrible (as aforementioned), but it definitely isn't good. Not even close."
    },
    {
      "rating": "3",
      "text": "The writing in this bad sequel isn't very good. It may have some clever and suspenseful moments, but moments are also rehashed from the first two and it's lame, predictable, and lacks the freshness of the first two. The new characters are also very boring (except Parkey Posey) but actors playing actors was just boring and there was a lack of a lot of character development. They should of done this with Kevin Williamson."
    },
    {
      "rating": "3",
      "text": "The Scream series ironically becomes what it is trying so hard to parody with this installment. It is in no way scary or interesting, and offers nothing to expand on the previous movies; rendering itself incapable of justifying its existence beyond being a cheap mockery of the first-film. The only things saving this from being a complete disaster are the performances of David Arquette and Patrick Warburton, who both come with an extra serving of both cheese and ham."
    },
    {
      "rating": "3",
      "text": "Wow tis movie is way more laughs than screams. Scream 3 3.5/10"
    },
    {
      "rating": "3",
      "text": "Sadly Not What I Wanted..\rThird Time's A Charm.. But Not In This Movie!\rScream And Scream 2 Were Amazing But This Is Just Boring The Same Old Stuff.. Not Really A Plot At All....\rStab.. Stab.. Stab..\rWorst Movie Of 2000!"
    },
    {
      "rating": "3",
      "text": "Scream 3 isn't scary, isn't funny and just isn't good at all. It's at least 20 minutes too long and there are too many actors in here. The screenplay is bad and the ending is no big surprise. #3 bored me very much and I still don't like the principle of the franchise. A killer with a halloween mask for kiddies? I can't take that seriously. Scream 3 is no complete rubbish but it's really not worth watching."
    },
    {
      "rating": "5",
      "text": "First time around, \"Scream 3\" is enjoyable and at times funnier than its predecessors.  But by the second time, the film drags on-- it lacks the thrills and wit of the first two and instead trades it for more accessible humor that isn't as witty.  The replacement of screenwriter Kevin Williamson was a huge mistake.  Hopefully Craven has taken notes on what not to do since this film."
    },
    {
      "rating": "6",
      "text": "This is where a series gets a little vulnerable and desperate, like a girl looking for a prom date. It tries very hard to get its point across, but it doesn't succeed past being average. The series is on its last leg, and the third one almost tripped it."
    },
    {
      "rating": "5",
      "text": "Because of the unfortunate Columbine massacre, Dimension Studios wanted to cut down the amount of gore released in it's films, and Scream 3 was shot more as a 'whodunit' than a horror film.  This was the filmmakers first mistake as the movie became a little more slapstick than horror. The overall error of this film was it became more a cliche than a commentary to the genre."
    },
    {
      "rating": "6",
      "text": "Scream 2 does an awesome job of doing the whole \"this is a sequel but we're totally showing you that we're aware we're making a sequel. Look we're explaining the rules to sequels and discussing sequels in film class etc.\" But I feel like they were beating that concept to death by the third movie.\r \"Chapter one sets the rules, chapter two bends the rules, but in the finale... forget the rules.\"\r Sure, Scream 3 raised the stakes (which true-to-form is commented on) but in raising the stakes they messed with part of the plot of the first movie by retconning some plot details in a way I'm not comfortable with.\r This is a weird hiccup in the Scream franchise, that I still quite enjoy watching whenever I do watch it, mainly to finish off the Scream trilogy... But it's not a trilogy and hasn't been since 2011! Jesus, I so often forget that there is a Scream 4 but not in an Indiana Jones fanboy refusing to admit there's a forth Indy movie kind of way but I genuinely forget that it exists. It's probably because I have only own 1-3 on DVD and I only watched Scre4m once, the ear it came out. I actually liked it so I'll have to watch it again soon (I've been saying this to myself for nearly 5 years now).\r Jay and Silent Bob appear in this movie and for those of you who have't seen this I don't mean Jason Mewes and Kevin Smith have roles, I'm for real telling you that they appear in-character as Jay and Silent Bob. This means that the Scream movies are movies in the View Askewniverse because Wes Craven can be seen filming \"Scream 4\" in Jay and Silent Bob Strike Back. Which is fun to think about."
    },
    {
      "rating": "6",
      "text": "Scream 3 is still a solid entry and still very watchable but make no mistake, Scream 3 is the floor for Craven's ultra successful horror franchise. I really felt the Hollywood angle was excessive and really unneeded for this franchise. Apart from the 4 returning characters, the movie introduces a plethora of new supporting characters. None of them attempt to reach the heights of the originals and you get the sense by film's end that theyre just cannon fodder for Ghost Face."
    },
    {
      "rating": "6",
      "text": "While the third film in the trilogy successfully increases the blood and body count while adding to the strong overall narrative, it stumbles due to a few forgettable characters and the ridiculousness of a voice changer that can replicate anyone's vocal tones."
    },
    {
      "rating": "3",
      "text": "Scream 3 just seems to be a rushed idea for another sequel in the Scream franchise that turned out to be a disappointment, and a really, really bad idea for another sequel."
    },
    {
      "rating": "7",
      "text": "I was not tired of the same formula that Screenwriter Kevin Williamson does with the last two installment of the franchises, but the third one was my favorite of all the scream films. Stab 3 is in production inspired by Sidney's life  (\"The Woodsboro Murders\") ghost face returns! and they are dealing with a trilogy. Director Wes Craven does his horror magic and that's what i like about the film, also the script. But the script is written  by Khren Kruger he takes the franchise in his own hands and goes in the wrong direction with Craven. But your gonna have fun watching this trilogy. Grade A-"
    },
    {
      "rating": "4",
      "text": "Scream 3 suffers from under-experienced writing from Ehren Kruger. It does not feel like a \"Scream movie\" rather than a parody or a spoof. I heavily appreciate the cast of Scream 3 (Jenny McCarthy, Parker Posey, and the sexy Scott Foley) and the ending."
    },
    {
      "rating": "5",
      "text": "They say the third time's a charm. In the case of the Scream movie series, the Wes Craven/Kevin Williamson collaboration credited for having revived the slasher genre in the '90s, this cliché proves to be a falsehood. The most recent (and hopefully final) chapter in the comedy/horror trilogy comes across as a lame regurgitation of material already presented. There are no real surprises, and the whole affair has the feeling of something left too long in the pot to stew. The life and energy is gone. What began as a lively, intelligent series suffused with self-referential humor has turned into just another slice-and-dice-by-numbers affair. Scream 3 isn't just the weakest of the movies, it's the kind of thing that the original Scream lampooned with affectionate glee.\r Scream 3 features three good moments, but they're hardly enough to save the movie from the tedious spiral of repetitiveness it is trapped in. The first is a from-beyond-the-grave video lecture by Randy (Jamie Kennedy), who offers up the \"rules of the trilogy.\" For example, \"events in the third segment always go back to the beginning\" and \"even the hero can die in the final chapter.\" (One that he doesn't mention, and which proves true in this case, is that the final installment of any trilogy is usually the worst. The examples Randy cites, Star Wars and The Godfather, are classic examples of this.) Then there's a brief cameo by cult heroes Jay and Silent Bob, who are given a couple of lines (well, at least Jay is. Finally, Carrie Fisher appears as a receptionist who bemoans not having gotten the part of Princess Leia in Star Wars because she wouldn't sleep with George Lucas.\r When it comes to storyline, character development, and pacing, Scream 3 strikes out. The movie drags along from one predictable slaying to the next, and the only real scares along the way are the \"boo!\" moments when something innocuous jumps out of the shadows just before the real killer strikes. Meanwhile, the level of humor in Scream 3 is way down. Parker Posey (as the actress playing Gale in the Stab series) has a few amusing lines, but the ironic dialogue and cute references to other horror films, which were wearing thin in Scream 2, are now positively threadbare.\r Once, I wrote that Scream 3 would have to do something radical or inventive to avoid becoming tiresome. Unfortunately, there's nothing here that even the most inexperienced horror film fan would call innovative, and the predictable result is a movie that pales in comparison with its predecessors. Thus far, 2000 has been a very bad year for films, and Scream 3 does nothing to reverse the trend."
    },
    {
      "rating": "5",
      "text": "Em comparação aos outros filmes, este é o piorzinho. Poucas cenas com emoção, trazendo dois assassinos nada surpreendentes. Esperava mais, muito mais."
    },
    {
      "rating": "5",
      "text": "The artistic medium of film is very subjective. Every audience member has a different set of criteria they use to measure their viewing experience. Not everyone shares the same set of criteria. If we did, what a bland and uninspired world this would be.\r What I Personally Liked About \"Scream 3\":\rThe most likeable attribute of this third film in the franchise is Neve Campbell portraying Sidney Prescott. Of course, she could probably play the role blindfolded with one hand tied behind her back and in a half vegetative state at this point, she seems to know the character so well. Some recognizable faces were also brought in for this supposedly final chapter. Some of them work and some of them don't. Lance Henriksen and Roger Corman are such professionals that they're able to elevate the thin material they're given to work with. Jenny McCarthy and Parker Posey also do well as victimized supporting players. Well, they're both slightly hammy, but at least they're better than the majority of (over)actors in the second movie. To add to their credit, they do provide some decent comic relief. Seeing the video return of Jamie Kennedy's Randy is another big plus in this picture's favor. It just wouldn't feel like \"Scream\" if he wasn't there to lay down the ground rules. The \"death\" of Sidney and the death of Roman Bridger were definitely my favorite moments in the film. Everything just fell into place from the music to the lighting to the pacing to the tension to the uncertainty over the fate of the leading lady to Sidney's ability to ruthlessly stab someone else after all of the grief and loss she has been through. It's just a shame there wasn't a better film building up to this fantastic sequence of events.\r What I Personally Disliked About \"Scream 3\":\rUnfortunately, the death of Cotton Weary came too soon in the picture. Liev Schreiber was one of the best parts of the second chapter in this series and I would have loved to see more from him here. I know that killing off an established character is status quo for horror sequels, but for the love of God why didn't they kill off David Arquette? Why? Why?! WHY?!?! You're supposed to trim the fat not arrange it as a centerpiece on the plate. Oh well. At least Cotton tried to put up a good fight before his untimely demise. Dewey Riley, on the other hand, could have been written out of the movie and I obviously wouldn't have missed him. His relationship with Gale Weathers becomes more unbearable with each passing film. Seriously. Weakest subplot ever. I should also stress the fact that I hate pointless cameos just for the sake of having pointless cameos. Jamie Kennedy's was necessary for the film; most of the others were not. Carrie Fisher's cameo particularly bothered me as she looks bored out of her skull being there. That boredom seeps through every celluloid pore of the scene's skin and infects the viewer with a case of the ho-hums. Last, but certainly not least, trying to shoehorn in the half-brother angle at this point with no prior basis to do so was just unacceptable. If this had been a preplanned trilogy and some little clues had been thrown into the first two installments, it might have been a different - and more cohesive - story.\r My Overall Impression of \"Scream 3\":\rYes, the half-brother/sister storyline was a bit of a stretch, but some of the surrounding material makes this film look like it's trying harder than the second film did to break genre molds and point out flaws in the scary movie system instead of partaking in them itself. It doesn't try to be \"one of the boys\" in the way that \"Scream 2\" did. While it's not a successful film by any means, it's still not nearly as bad as some of its detractors make it out to be."
    },
    {
      "rating": "5",
      "text": "Succumbs To SequelitisLike Shrek The Third, This threequel does not have the charm of it's predecessors."
    },
    {
      "rating": "4",
      "text": "This is the worst movie in the Scream franchise, but it is a decent movie to watch. It wasn't as great as the first two movies, however it did give an enjoyable \"ending\" of this awesome trilogy."
    },
    {
      "rating": "7",
      "text": "I wouldn't say its better than the others but its still a good movie. Well Ghost Face got less scary in the third and the acting wasn't as good. I would recommend it but I would recommend the other two."
    },
    {
      "rating": "8",
      "text": "It's hard when the two previous films in your franchise were literally horror masterpieces but than on top of it all to wrap up a trilogy is unthinkable. There was no way this wasn't going to be a tad disappointing. That being said this is a very fun movie and truly does a wonderful job of ending Sidney's story. This time around Sidney is living in seclusion and the murders start up again in Hollywood while they're making Stab 3 the first fictional sequel in the film within a film franchise. So both the original characters and the actors starring in the new film are targeted. What's great. Our core people are back and they are in top form. I love Neve Campbell's performance in this one because she is just done with it. Courtney Cox and David Arquette have wonderful chemistry as usual. As for the newbies Jenny McCarthy is fun, genre favorite Lance Henriken is awesome, Scott Foley is great and Carrie Fisher has one of the best cameos ever. But the real scene stealer is the amazing Parker Posey and when she's teamed up with Cox its incredible. Also the movies twist is one that wraps up the trilogy nicely. Now for the good. Its evident that Kevin Williamson didn't write the screenplay, he only wrote the treatment. It's not a bad screenplay it's actually good but focuses more on the comedy and feels different than the other films. All in all it's still a very hood film and just overly entertaining.Budget: $40mDomestic Box Office: $89mWorldwide Box Office: $162m4/5"
    },
    {
      "rating": "7",
      "text": "The ultimate scream...Two years after the deaths of the second film, and during the filming of a new movie based on the life of Sidney Prescott (who lives at large under another name), a new wave of mysterious murders shakes the film crew and all suspects a new return of the masked psycho. Sidney, suspecting that the killings have some connection with the mysterious past of his deceased mother, decides to go to Hollywood and help the authorities to face the killer. Directed by Wes Craven, has a main cast equal to that of other films.If the other films could be considered parodies, this film only has a few scenes that point in that direction. The whole film is a small crime thriller where the scary scenes don't scare enough to be a horror movie, but manage to put us in the expectation to follow the investigations and see who will be the next victim. This time, we didn't feel any sympathy for the killer because the main characters (Sidney, Dewey, Gale and even Detective Kincaid) evolved dramatically and now shown to be more mature, complex and able to reach the audience in a more effective manner. The only one with which we don't sympathize is Cotton Weary, a guy more interested in their own fame than anything else. The end of the film is remarkable, and it's surprising enough to make us wonder if it really existed, in real life, more cases similar to those of Maureen Prescott."
    },
    {
      "rating": "4",
      "text": "They're making a film of the film but the director turns out to by Sidney's half-brother who put on a ghost mask and stabbed her friends."
    },
    {
      "rating": "4",
      "text": "Era innecesaria una 3 como explicarlo no está ala altura  de la 1 y 2 pos es entretenida y todo pero se siente forzado como llega syn creo qué la prota era inecesseia pero igual es entretenida pero lo del hermano forxado igual es el ghosface que mas a matado pos pa mi el final de la saga es en la 2"
    }
  ]
}