{"id": 1791, "title": "Scream 2", "starring": ["Neve Campbell", "Courteney Cox"], "runtime": 120, "genre": ["Horror", "Mystery"], "description": "Away at college, Sidney thought she'd finally put the shocking murders that shattered her life behind her... until a copycat killer begins acting out a real-life sequel.", "releaseYear": "1997", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dORlVasiaDkJXTqt9bdH7nFNs6C.jpg", "categories": {"plot": 7.238095238095238, "acting": 7.621621621621622, "ending": 6.826086956521739, "soundtrack": 7.0, "cinematography": 3.0, "familyFriendly": 3.0, "funny": 7.647058823529412, "action": 7.666666666666667}, "reviews": [{"rating": "10", "text": "In my opinion, \"Scream 2\" is even better than the first.  It's funnier, scarier, and a lot more confident.  Featuring even more memorable death scenes and dialogue that's worth talking about, every scene is delicious.  The twist ending is a great homage to horror films in general, and the thrills are non-stop. Plus one for the fact that Sarah Michelle Gellar's in it."}, {"rating": "9", "text": "Acting: The acting is much like it is in the first one. it isn't Oscar winning but the main actors, and even the supporting characters, do a great job and that helps keep the movie more interesting and fun to watch. The actors really made the characters more likable. I like the characters of this film (Ghostface is my favorite. To me, he is a whole different character than the character under the mask and I like that a lot).Plot: The plot is more or less the same as the first one. Killer stalking people and ripping them apart. Standard stuff. the only real differences are the setting and the fact that the survivors are dealing with the events of the first one.Screenplay: not perfect. It was weak in some spots, but there was some good stuff. Like the rules of this one. I applaud the genius who thought of the idea to have the rules of slasher films for this film.Likeableness: This film, like the first one, is incredibly likable. you just have to love it when you are watching it. There are many reasons for that. One of them is that the killer is human. he trips, he falls, he gets the crap beaten out of him. Long story short, he earns his kills. just like in the first one. a superhuman killer is boring. It is an extremely fun film to watch. good characters, great killer, it's just a blast.Final Score: 8.85/10.0 (N)TRIVIA TIME: 1. Not only was the cast not informed who the killer was until the last Day of shooting, they also didn't receive the last 10 pages of the script until it was time to film them. The last 10 pages were also printed on grey paper, therefore making them unable to be illicitly Xeroxed. All cast members had to sign contracts that they would not discuss the movie's outcome or the killer's identity with the media.2. Though in most films, phone voices are recorded later, director Wes Craven actually had the voice of the killer on set, to heighten the sense of fear for the actors. According to Roger Jackson, who plays the voice, he was kept on set but always out of sight from the actors, so they couldn't picture a face with the voice. He said while watching the monitors, he could see between takes that Heather Graham looked a little scared, whereas Sarah Michelle Gellar would pick up the phone and carry on a conversation with him.3. The tagline for \"Stab\" (the movie within the movie) is, \"This is Gonna Hurt\".4. The rules for a horror movie sequel - as laid out by Randy in the film - are (1) the body count is always bigger and (2) the death scenes are always much more elaborate with more blood and gore. The third rule to surviving a sequel is cut from the movie, but is shown in the trailer. \"\"And #3. Never, ever under any circumstance assume that the killer is dead.\"5. Any actor auditioning for the part of Derek had to perform the scene in the cafeteria where he sings \"I Think I Love You\" without accompaniment."}, {"rating": "10", "text": "It has been a year since the events at Woodsboro. A year since a psychotic killer went on a rampage sending a wave of fear and paranoia through a once peaceful town. The hero Sidney Prescott (Neve Campbell) has survived her ordeal but left emotionally scarred and despondent she is now attending Windsor College in Ohio with one of the survivors of the Woodsboro murders, Randy Meeks (Jamie Kennedy) the ultimate horror movie guide who narrowly escaped with his life after his previous encounter with Ghostface. Sidney and Randy are just trying to get on with there lives and put the past behind them trying to forget the painful memories of those that they lost a year ago. But the past never stays dead and nor does a killer  as it is seems someone has taken up the mantle of the Ghostface killer once again and is seeking revenge on the survivors of the Woodsboro killings. Could it be the killer come back to life? Alternatively, is it someone else who has once again taken there love of scary movies one-step too far? \"Scream 2\" starts off with slam bang opening  a  young African American couple(Omar Epps and Jada Pinkett Smith) are brutally murdered at the premiere of the new slasher flick \"STAB\" and  it seems that someone  has taken up the mantle of Ghostface once again. This slam bang, home run sequel from Director Wes Craven and screenwriter Kevin Williamson is in a rare group, it is a sequel that is more intelligent, far more brutal, and hilarious the groundbreaking original. â"}, {"rating": "10", "text": "A fantastic sequel, Scream 2 have much great elements, the cast, and the moments of scare, one of my favorite parts is the death of Cici (Sarah Michelle Gellar) is fantastic, really the direction, the cast all is fantastic, Scream 2 is scare."}, {"rating": "10", "text": "One Of The Best Sequals Of All Time!\rJust As Good As The 1st Scream Sarah Michelle Gellar Does A Great Job"}, {"rating": "10", "text": "Scream 2 agreeably, is more funnier and scarier than the first, but is as violent since it did garner an NC-17 like the first film. Scream 2 features more comedic content than the first film and more casting. So smart, the first scene features Omar Epps and Jada Pinkett Smith both getting slayed by ghost face was very unexpected and scary. Also, the film takes place on a college campus, which is a big step for the film (which also explains a more expansive budget than the first). Glad that Gale Weathers (Courtney Cox) survives in the film. I really appreciate the casting of Sarah Michelle Gellar, Jamie Kennedy, Jerry O'Connell, and Timothy Olyphant whom have all performed very greatly in the film."}, {"rating": "8", "text": "Scream 2 is an excellent sequel. Whilst it doesn't quite hit the same high as it's predecessor, it does come pretty close. Two aspects this sequel scores over the original are scarier action sequences (car crash / soundbooth) and lovable character development. It's just a shame that the film's eventual antagonists aren't as interesting or well defined as the original duo. But Scream 2 is still a very worthwhile sequel."}, {"rating": "10", "text": "FOR ONCE a horror sequel done spectacularly right. Again, horror, suspense, comedy, drama and parody make a wonderful mix in this totally entertaining movie!"}, {"rating": "10", "text": "Scream 2 continues what the original started and perfects it; it's more intelligent, the body count is higher, it has more scares, and the script is packed with more realistically written characters and dialogue. In a world where sequels are often overstuffed, Scream 2 fits all the pieces together just right and delivers much more than just your average sequel."}, {"rating": "9", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"}, {"rating": "10", "text": "Is it possible to catch lightning in a bottle twice??? Yes! Scream 2 is one of those very rare horror sequels that manage to be just as impressive as the first. I love the suspense in this film. The first movie was true horror, the sequel is true suspense. I love these movies"}, {"rating": "9", "text": "I Enjoyed This Scream 2 More Than The 1st Scream... I Love The Cast In This.. Sarah Michelle Gellar (Prinze) And Jade Pinkett Did Great... Some Parts Really Did Scare Me... This Is 10 Times Better Than The 1st Scream!9!"}, {"rating": "10", "text": "another \" Scream \" movie directed by horror expert Wes Craven which is a new ride to put your self shoes in someone else's to survive that phone call from ghost face. buy a popcorn get a snack buy a soda You my friend are in for another ride ;) . Grade A"}, {"rating": "8", "text": "In my opinion, it's almost better than the first one. The only problem was that it was slow at first. But when it got started, it was very entertaining and funny."}, {"rating": "10", "text": "This is how you make a sequel! I admit the first one is the best (of course) but this one is a great movie as well. Wes Craven did a fantastic work (as usual). They broke the  movie sequel curse which is a hard work to do. The acting is great also the actors. Im happy that the four main characters of the film are still alive in this part. The lines are sometimes funny considering the fact that scream has always been a horror/comedy-ish kind of movie. It scared me too. The amount of suspense and thriller is just enough, its not gory like other **** movies. Theres nothing more scarier than a mother's revenge! Loved it."}, {"rating": "8", "text": "Almost as good as the original, Scream 2 is a little more intelligent than the original and knows when the audience is least expecting a scare. But, I still found myself enjoying the original's twist and turns more than this one."}, {"rating": "8", "text": "A very good sequel despite its message that 'sequels suck'.  The increased blood and gore were controversial when released but has fared well over the years."}, {"rating": "3", "text": "The artistic medium of film is very subjective. Every audience member has a different set of criteria they use to measure their viewing experience. Not everyone shares the same set of criteria. If we did, what a bland and uninspired world this would be.\r What I Personally Liked About \"Scream 2\":\rRight off the bat, let me say that the two best things about this sequel are Neve Campbell and Jamie Kennedy. They bring the same energy and same characterizations to this second installment that they brought to the first. It seems like they slipped effortlessly back into their roles whereas Courteney Cox and David Arquette struggled here and there. The death of Kennedy's character Randy was one of the best sequences of the movie and was a necessary evil as the ante always needs to be upped in sequels. Personally, I just think it's a shame Dewey didn't die while they were at it. Liev Schreiber was also a wonderful supporting actor who fits the film well. If they could have only found a few more people like him who didn't automatically turn into overacting hyenas, we would have been all set. While we're at it, Peter Deming's magnificent cinematography should be noted as one of the highlights of this production. Visual framing this good really deserves a better movie to accompany its presence.\r What I Personally Disliked About \"Scream 2\":\rFor the most part, this sequel takes itself more seriously than its predecessor did and this hampers the enjoyment tremendously. Where the first film lampooned the horror genre, this second chapter feels like it's striving to fit in with the very flicks the initial production thumbed its nose at. In addition, it succumbs to the pitfall that plagues most scary movie sequels: it feels like we've seen it all before. It has nothing new to bring to the table. A good example of this is the boyfriend issue. For those of you (like myself) who thought Skeet Ulrich was the height of conventionality, I give you Jerry O'Connell. Yikes. He just had to sing, too, didn't he? Oh, the horror! I'm also not a big fan of Courteney's hair. Seriously. Who in their right mind thought THAT looked good? Double yikes. The inclusion of the painfully unfunny sorority girl stereotypes was also an abysmal decision which, of course, would make triple yikes. I thought watching Arquette in the first film was like being slammed against a brick wall but these girls take the cake. At least David had the good sense to ever so slightly tone down his buffoonish antics. Let's be completely honest with each other as well, shall we? The twist ending in this picture is a little lame and quite a bit forced when compared next to the innovation of the original.\r My Overall Impression of \"Scream 2\":\rAt two hours in length, this film is about forty minutes too long. A lot of sequences (particularly the atrocious last third of the movie) seem to drag out endlessly and the viewer is left to wonder what happened to Wes Craven's normally tight directing skills. There are some briefly enjoyable moments scattered about, but this sequel feels more tired than inspired."}, {"rating": "6", "text": "A lot weaker than the first because a lot of times the whole plot seems silly, but the movie still is quite scary, with its odd but cool beginning. I give this movie 63% of a good movie."}, {"rating": "5", "text": "Once more, \"Scream 2\" gives its summer horror flicks to the audience. But this time, it forgot the 'scary' parts and concentrated more on the 'gory' parts. In the end, \"Scream 2\" will scare you like 3 times on the screen. No more, no less."}, {"rating": "7", "text": "It's good, but, it's characters are a little less memorable than the first, and, certain parts of the ending felt a little forced. Still definitely worth checking out, especially if you were a big fan of the first movie."}, {"rating": "7", "text": "More of the same."}, {"rating": "5", "text": "Just plain sucks. In the first movie, the killers were who you most expected, therefore making them the least expected suspects to the viewers. It would just be too obvious, we all thought. Well, it was, and that's how Craven got away with it. In this, the killers were the most minor characters who could even be considered characters. Lame. The coolest character in both the movies gets killed off, and not even in an elaborate kill. Come on! The first one was original and creative, and this is the same as the first- with no originality or creativity. Watch it if you loved Scream, but if you would give the first less than eight out of ten, or haven't even seen it, stay away from Scream 2."}, {"rating": "8", "text": "This fantastic sequel keeps to the original film's sense of humor, scariness, and psychological excitement which is a rare aspect in horror sequels. This film does not prolong the scariness to the degree that the original did, but it has most certainly remained as funny and intriguing as ever."}, {"rating": "6", "text": "Two years after the hullabaloo from the first film, reporter's book made into film about events, killer returns copycat style.Entertaining but slightly silly second film in the Scream trilogy with most of the cast returning. The humour is still very self-mocking & funny but just didn't think it had the tension, a weaker storyline & is a lot more predictable than the first film."}, {"rating": "6", "text": "Eh not as good as the previous film but its still solid. It follows the same formula and doesnt feature anything new to it to make it any where near as interesting as the previous film. Acting suffers a bit this time around as well. Overall it was ok."}, {"rating": "6", "text": "Certainly it is not one of the best horror films out there but \"Scream 2\" managed to be much more amusing than a lot of horror movies I've seen lately. Lots of cliches are still present but I liked the humour and acting. Overall, it is a nice film."}, {"rating": "4", "text": "is another film in the Scream series of fear nothing, except that unlike the first film that is not as good as the first, the two villains of the film are terrible actors, but the other actors are good especially who plays Gale"}, {"rating": "5", "text": "How the heck did Dewey keeps surviving. This sequel is definetly on the \"bad sequels\" list."}, {"rating": "6", "text": "A step back from the original, Scream 2 is a solid sequel that maintains the same level of thrills and mystery of the original, but much of the experience feels entirely hollow. With Sidney (Neve Campbell) now at college, a copycat killer has decided to follow her and finish what the original ghostface had started. An expertly crafted analysis of horrible horror sequels, the influence of film in real world violence, and horror movies as a whole, Scream 2 is a good satire, even if it is not nearly as scary or funny as the original.\r Back for their second rodeo, Sidney is joined by familiar faces Randy (Jamie Kennedy), Gale Weathers (Courteney Cox), and Dewey (David Arquette). The band is back together, yet they do not seem to have much of the same energy or power as in the original. For example, the smaller role played here by Randy is unfortunate, as he was the source of a lot of the fun of the original. While everyone was scared speechless, Randy kept things going with horror movie references or playing whodunnit with the cops. There is a little bit of that here, but after a while, the film opts to ditch the whole mystery solving element that made the original work so well and instead just focus on scaring you.\r On the scariness front, there are some solid moments. Director Wes Craven knows horror and he is not afraid to display this skill-set in Scream 2. A sequence in which Gale tries to escape Ghostface with Dewey is incredibly tense and terrifically shot. From beginning to end, this scene is laced with tension and really highlights just how scary the Scream franchise can be in its own right. However, as we reach the climax, though it is surprising who the killers are, they just feel like reaches. The twists just feel tacked on to try and make references to the original and, as a result, feel entirely like fan service. Ironically, a killer promises they are not like every other 90s killer only to then take 15 hours to finally try and kill their intended victim. Though Scream 2 is willing to call out conventions, I guess they decided to forget that one was a convention as well.\r Additionally, the red herrings here are quite obvious and never quite work. Much of the cast is thrown under suspicion, but whenever somebody asks, \"What if you're the killer?\", you can feel the air escape from the movie a bit when you realize that there is no way they could be the killer. Instead of building mystery and suspense, the film immediately tries to assist the audience in jumping to conclusions about who the killers are and then tries to play on those red herrings at the end. Yet, the audience, hopefully, has realized they are not be believed which makes some of the end reveals completely unsurprising.\r This said, Scream 2 most certainly entertains and though a step back from the original, a lot of the playful spirit of the film is there as Craven toys with and mocks horror cliches. The end results are some pretty comical moments that really land. This ferocious blend of horror and comedy does prove incredibly entertaining and this is what makes Scream 2 so incredibly watchable. Even when the mystery elements flounder and fail to deliver the same suspense as before, the film does have some surprises along the way that do land quite well.\r Scream 2 is an entertaining film, but just feels like a hollow exercise of re-doing what made the original good. It retains the majority of the terror and the comedy, but the mystery of the original is gone as is the manic fun that made it such a good satire of the genre. Here, things are a bit gloomier and, as a result, not nearly as good."}, {"rating": "8", "text": "A good sequel, doesn't quite reach the heights of the first one. Nonetheless there is plently of thrills and spills to go around and the returning cast are still top notch as the characters are well developed and feel more personal. Its worth seeing as one of the better sequels out there, which in the horror genre is a rarity"}, {"rating": "6", "text": "The Sequel to the top notch \"Scream\" film has familiar elements from the first, that pull together to make yet another great horror movie. But like most horror sequels... It's just not as good as the first."}, {"rating": "6", "text": "Not as fresh as the original but the cast is superb and the quality of the production is high. Was great to see it the first time around. Sad all the best thrills gone from later viewings."}, {"rating": "7", "text": "Scream 2 is one of the better horror sequels out there. Wes Craven returns to direct which is a rarity in horror films and all of the members of the cast return to carry on the story and that makes the story feel like a true continuation of the first movie. Its not as self aware as the first one and there are not as many tense scenes but Scream 2 still has the fun. There are a few points were you really didn't know who the main character was and I thought that took me out of it a little and the twist ending is a little out there and unneeded, but Scream 2 does exactly what a horror sequel should do."}, {"rating": "8", "text": "Even if when a horror film starts creating sequels, you know it will be more about the gore and the kills than the story. Thankfully with Scream 2- the story is good enough, the acting is linear, and the kills more scary.\rIt's take is completely different from other sequels of it's genre, making the previous one world wide famous, and continuing the story in that manor.\rWith this film, we are in for more tension and a good character development, where the killer of course became more smarter and learned from the past.\rThe touch of Craven on this film did wonders and must be praised accordingly.\rScream 2 is right up there with the good sequels of any genre."}, {"rating": "7", "text": "Scream 2 isn't quite as clever as its predecessor, but it fills the gap with a cutting wit. Death -- even gruesome, bloody death -- can be funny if handled the right way (some will be offended by this statement, but you need look no further than Pulp Fiction for an example). And, while there's plenty of horror to go around in Scream 2, the latest '90s slasher flick incarnation, there are also a few laughs to be had. Scream 2 is a slice-and-dice movie for those who don't take their horror too seriously.\r As stipulated by one of the \"rules of sequels\" uttered by a movie-obsessed character in the film, the body count in Scream 2 is higher than that in the original. Paradoxically, there's a lot less gore. There is blood, of course, but nothing excessive by slasher-movie standards, and there are no depictions of spilled entrails. Craven has remembered that scares are more important that graphic displays of human insides and bodily fluids. A second strength of Scream 2 is that it features a gallery of legitimate characters rather than a group of cardboard cut-out stereotypes lined up for slaughter. After all, we've known some of these people for two movies -- it's almost impossible not to care about them at least a little.\r From the Stab scenes to lines like \"Brothers don't last long in situations like this,\" Craven and Williamson are clearly having a lot of fun with Scream 2, and the movie is enjoyable, if a little overlong (the livelier first hour is better than the second). Their resolution to the obligatory \"whodunit?\" is less of a letdown than it could be, and knowingly offers a wink and nod at past unmasking scenes. (\"Nice twist,\" quips the killer. \"Didn't see it coming, didya?\") One senses, however, that, by the end of this picture, the overall concept of a hip, self-referential slasher film has been played out. Supposedly, there's going to be a Scream 3, but, if the film makers don't come up with something radical, we could end up with a classic case of sequel overkill."}, {"rating": "7", "text": "Pretty Scary SequelIt’s not as good as it’s predecessor, But it still has those scares and kills."}, {"rating": "6", "text": "The parody continues?Two years after the Woodsboro murders, Sidney Prescott tries to rebuild her life and goes to college. But, amid all this, new deaths happen and soon all realize that, after all, the masked killer is back. Directed by Wes Craven, has a main cast basically similar to the first film.If the first film was difficult to understand, this film goes in the same direction. If some people found it scary, tense and full of terrifying moments, others thought it was fun, laughed and basically \"supported\" the killer. Wes Craven returns to \"attack\" the clichés of teen and horror films, but this time more gently, giving the film an apparently more serious focus. Nevertheless, and despite the film really looks serious and keen to cause fear, its too funny for it and the victims are still too despicable for us to have empathy for them. Only Sidney (Neve Campbell) deserves sympathy, as seems to be the character psychologically more complex and mature. Interesting is also the transformation of Dewey and Gale: that ambitious and egocentric journalist falls in love with the young policeman, who looks a \"good boy\" who can't break a dish, but is now much more mature than in the first film."}, {"rating": "8", "text": "Scream Is An interesting sequel to Scream Right when Scream 2 I don't like they are taking Ghostface killer as a joke in a theater I don't know why they were doing that two people die at the theater while people are just celebrating it As Scream 1996 I like most of the characters but there are characters are just annoying on-screen and characters I just don't like there are moments like what is the scream killer been doing For example weathers gets attacked the Sidney gets in a car Very messy writing right there is not too much I dislike I don't like the ending they do to these movies there drag too far In this Debbie is just annoying asking questions while she was the killer Than Debbie Son was Billy which to me does not affect anything Mickey as the killer also Is just rushed he really had no reason to be killing people So Scream 2 is an interesting sequel Just not as good as original But still really enjoyable I give Scream 2 An B-"}, {"rating": "7", "text": ""}, {"rating": "2", "text": "i think that sequels are never particularly good. especially not in horror. This film confirms my attitude again."}, {"rating": "3", "text": "Scream 2 recycles a bit too much from the original while lacking what the original so good. The story is atrocious and the multiple re-writes that when on during production did nothing but hurt the movie overall. The plot made zero sense, the twist involving the killers felt totally out of left-field. It was bad and it goes to show that sometimes you just can't capture lightning in a bottle a second time around."}, {"rating": "7", "text": "The movie is not as good as the first but it's still a great movie.The kills were better but the atmosphere was not as strong as it was in the first.And the final killer was really obvious I was kinda disappointed, and then there was the side killer. This was the big ass plot twist which made not a lot of sense.The end of the movie felt like a parody of the first one which is not a bad thing but… Overall, a better slasher film than most of what is made today"}, {"rating": "7", "text": "Entertaining movie, with good jump scares. This is worth seeing, even though it isn't as good as the first. This movie has numerous awesome jump scares and an awesome scene at the end."}, {"rating": "8", "text": "Scream 2 isn't quite as clever as its predecessor, but it fills the gap with a cutting wit. Death -- even gruesome, bloody death -- can be funny if handled the right way (some will be offended by this statement, but you need look no further than Pulp Fiction for an example). And, while there's plenty of horror to go around in Scream 2, the latest '90s slasher flick incarnation, there are also a few laughs to be had. Scream 2 is a slice-and-dice movie for those who don't take their horror too seriously.\r As stipulated by one of the \"rules of sequels\" uttered by a movie-obsessed character in the film, the body count in Scream 2 is higher than that in the original. Paradoxically, there's a lot less gore. There is blood, of course, but nothing excessive by slasher-movie standards, and there are no depictions of spilled entrails. Craven has remembered that scares are more important that graphic displays of human insides and bodily fluids. A second strength of Scream 2 is that it features a gallery of legitimate characters rather than a group of cardboard cut-out stereotypes lined up for slaughter. After all, we've known some of these people for two movies -- it's almost impossible not to care about them at least a little.\r From the Stab scenes to lines like \"Brothers don't last long in situations like this,\" Craven and Williamson are clearly having a lot of fun with Scream 2, and the movie is enjoyable, if a little overlong (the livelier first hour is better than the second). Their resolution to the obligatory \"whodunit?\" is less of a letdown than it could be, and knowingly offers a wink and nod at past unmasking scenes. (\"Nice twist,\" quips the killer. \"Didn't see it coming, didya?\") One senses, however, that, by the end of this picture, the overall concept of a hip, self-referential slasher film has been played out. Supposedly, there's going to be a Scream 3, but, if the film makers don't come up with something radical, we could end up with a classic case of sequel overkill."}, {"rating": "7", "text": "The original Scream was a classic, so this sequel had a lot to live up to. And it was a worthy sequel on the most part. Though it didn't entirely succeed, the story is less fresh and less original, it is not as efficiently paced and the killer's reveal was predictable. However, the production values are of high quality, the music is still haunting and the sound still unsettling, there are still the funny lines, the genuine scares, the credible direction from Wes Craven and the return of the iconic GhostFace. The acting is still good too. So overall, a worthy sequel, just not quite the instant classic the first was. 7/10 Bethany Cox"}, {"rating": "8", "text": "The second Scream has a lot of twist and turns which makes it a thrill well...a scary thrill. Its a good sequel but could have been a bit better. I recommend it."}, {"rating": "9", "text": "Like Aliens and T2, Scream 2 is one of the only sequels as great as the original. Picking up after the events of the original Sidney is off at college with Randy and some new friends when the murders start up again. Like the original the film is a slasher whodunit as we along the characters try and figure out who it is as it marches towards its thrilling conclusion. Like any great sequel of which there is few it expands the universe and fleshes out the characters even more. There is one emotionally devastating scene concerning Dewey and Gale that may be the best of the series. Craven refreshingly adapts the material bringing new life to the genre. The movie is comedic but also suspenseful, scary and surprising. When the mystery finally unfolds it's not only shocking but so well constructed you can't help but be awed by the complex methodology that went it to it courtesy of its amazing creators master Wes Craven and my idol Kevin Williamson and the strong cast that pull it off. Speaking of performances everything is upped a notch. Neve Campbell is electrifying as Sidney giving her a u pique strength and relatable vulnerability. Courtney Cox really has a journey in this film as Gale and David Arquette is again wonderfully and layered as Dewey. As for the newbies Timothy Olyphant, Sarah Michelle Gellar, Laurie Metcalf and Liev Schreiber offer solid support. This entry has a bit more to say about the mechanics of the genre and is even a bit more involved than it's predecessor but the sheer magnetism of the first is never fully met. As it stands it's still one hell of an amazing movie.Budget: $24mDomestic Box Office: $101mWorldwide Box Office: $172m4.5/5"}, {"rating": "5", "text": "Interesting sequel to the major first opus. The two films are cleverly intertwined as we can easily recognize the characters and their intentions.Characters are quite likeable (or hateful) but many of them evolve during the several events. Some of them sadly are one-dimensional, as Gale Weathers (Courtney Cox), because even her sudden development seems false and shallow. She doesn't deserve such a happy-ending. The most important protagonists showcase very impressive reflexes and speed while the rest of the cast often die in a ridiculous way. If the two first kills happen fast, it is hard to know why them especially. In the same way, protagonists quite often make bad choices. Like very dumb ones. It feels like 'Scream 2' has multiplied its characters only to make us doubt between many people when searching for culprit.The pressure is great and goes crescendo, the slaughters feels more agressive and violent, more realistic and less gore. The police(men) are nothing but ineffective. Environments are varied which allows differents angles and kill scenes, bringing a bit of fresh air. The end is particularly intense but unfortunately once again uses the 'psycho' formula ending, just as the first opus.'Scream 2' manages to be incredibly sarcastic and he shows a poignant self-mockery, but to go where? It seems that it only offers what it already has.Yeah, 'Scream 2' manages to be scary from time to time but fails to provide a solid and original scenario, even if it uses many plots based on the first film."}, {"rating": "9", "text": "A sequel that is done right. A fantastic film that gives the viewers what they want."}], "recommendations": ["scream_4", "scream_3", "sinister_2", "insidious_chapter_3", "insidious_chapter_2", "the_collector", "halloween_ii", "scream", "final_destination", "insidious_the_last_key", "wrong_turn", "hellbound_hellraiser_ii", "happy_death_day_2u", "the_texas_chainsaw_massacre", "malignant", "final_destination_2", "the_ring", "vacancy", "ouija_origin_of_evil", "the_amityville_horror", "halloween_iii_season_of_the_witch", "the_strangers_prey_at_night", "annabelle", "the_grudge_2", "texas_chainsaw_3d"]}