{
  "id": 2836,
  "title": "Second Act",
  "starring": [
    "Jennifer Lopez",
    "Vanessa Hudgens"
  ],
  "runtime": 100,
  "genre": [
    "Romance",
    "Comedy"
  ],
  "description": "Maya, a 40-year-old woman struggling with frustrations from unfulfilled dreams. Until that is, she gets the chance to prove to Madison Avenue that street smarts are as valuable as book smarts, and that it is never too late for a second act.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/maUMIZVGs8g1hYtq4dQ9Lg9FtVF.jpg",
  "categories": {
    "plot": 5.2,
    "acting": 4.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.166666666666667,
    "funny": 6.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Muy buena película, una historia inspiradora. La actuación de Jennifer Lopez es asombrosa."
    },
    {
      "rating": "10",
      "text": "JLo and Leah are the best. So inspiring movie “For better or for worse, I have to be who I really am. The only thing stopping you is you.“"
    },
    {
      "rating": "6",
      "text": "The story's a little awkward, and there's just not that much to it, but Lopez and Rimini are both fun to watch. It's sort of a poor-woman's Working Girl. It just lacks punch."
    },
    {
      "rating": "5",
      "text": "Ron Swanson once said, never half a** two things. Full a** one thing. Second Act tries to be a really funny film with lots of heavy drama but because it tries both it doesn`t fully succeed in both. There a great scenes all around but it does have lack luster scenes in between."
    },
    {
      "rating": "10",
      "text": "I really enjoy the movie ! I laugh and I cry, its all about dreams. The cast is very nice, I love the alchemy between Joan and Maya, Jennifer Lopez is very good. She deserves more first role."
    },
    {
      "rating": "3",
      "text": "The cursing humor is not funny anymore guys.. stop counting on it. The movie is total disaster, except the cinematography, JL acting and one absolute true quote - \"The only one who can stop you is yourself.\", which by the way didn't really match the movie. Many contradictions in key moments in the film, like - they made the protagonist as a woman with a normal joyful life, but she is also very sad, because the thought of abandoning her child is always in her head. She sees her and wow, nothing. Also said the biggest nonsense ever, that she made good choice abandoning her, because she found good parents and it's rich. You know.. the script writer is obviously very primitive and stupid to put that stupid quote, pretending it's exalted and not selfish. Second Act - stupid, stupid, stupid, not funny, not constructive, 100% predictable, contradicting itself, superficial and boring (my mother fall asleep two time during the movie).As you can tell.. I Loved it."
    },
    {
      "rating": "5",
      "text": "I mean, what do you expect? It hits every beat you think it will, with silly plot twists and cheesy heart-tugs along the way. Nice to see J-Lo back in her element, though..."
    },
    {
      "rating": "6",
      "text": "I eagerly anticipated this movie for months after seeing the first trailer.  Now that I’ve seen it, I can tell you that all the laughs are in the trailer.  Lopez plays Maya, a woman whose godson tweaks ner resume so that it sounds fantastic enough to get this high school dropout a junior executive level job in a big company.  Once Maya has the job, she uses her experience as an assistant manager of a Walmart type store.  She does know her products and what her clients want.  So far, so good.  But, about half way through, there is an utterly preposterous “twist” that nobody could bave seen coming in a million years because it is so ridiculous.  At that point, I kind of mentally threw up my hands and said, “Seriously!?!?”  From then on, I kind of lost interest in the story.  Leah Remini as Maya’s best friend is very fun to watch and adds lots of laughs.  Also Charlyne Yi as a crazy co-worker also adds to the laughs.  I so wanted to love this movie, but it wasn’t nearly as funny as the trailer would lead you to believe, and the whole product development plot was not amusing.  I wouldn’t recommend it unless you are a die hard J’Lo fan, in which case, you’re going to see it anyway!  As I would!"
    },
    {
      "rating": "9",
      "text": "It's not an oscar winning movie by any means, but it's a great JLo film. Laugh out loud funny moments (Leah Remini almost steals the movie) and also sweet, touching moments that weren't expected. With the right expectations going in, you'll leave the film having had lots of laughs and really enjoying the movie. Also, if you are a JLo fan, this is a must see as it's the best movie she has been in in a really long time."
    },
    {
      "rating": "4",
      "text": "It's just a T.V movie, if you want to watch a movie without thinking, you can watch it. The story is not interesting, but the movie has some nice comedy that makes you forget the bad story."
    },
    {
      "rating": "10",
      "text": "First of all Jennifer Lopez is great in the role of Maya, she's warm funny and believable. Her chemistry with Leah Remini who plays her best friend is another highlight for me."
    },
    {
      "rating": "4",
      "text": "The radiance of Jennifer Lopez is simply no match for such a hamfisted script."
    },
    {
      "rating": "4",
      "text": "Positivism? Yes, I can say, yes. Execution and functionality? Not really and I'll be honest, I'm not fond of Jennifer Lopez. I never have been."
    },
    {
      "rating": "6",
      "text": "There have been many great Jennifer Lopez movies that I always watch. Now, Second Act is a different story. I did not believe it. There is nothing wrong with an underdog story trying to make it big. But the movie was predictable and did not bring that good feeling of accomplishment like in many of her movies.  Maybe, instead of creating something new, revisit the other titles. I would like to see a second part to Maid in Manhattan. I would love to know of they made. They tried to capture all the goodness of the other titles, but could have done better. Good Effort!"
    },
    {
      "rating": "6",
      "text": "Engraçado de uma forma não muito original mais que consegue prender o telespectador numa história cheia de aventuras e desventuras com Revelações muito exageradas."
    }
  ]
}