{
  "id": 2143,
  "title": "Secret Window",
  "starring": [
    "Johnny Depp",
    "John Turturro"
  ],
  "runtime": 96,
  "genre": [
    "Mystery",
    "Thriller"
  ],
  "description": "Mort Rainey, a writer just emerging from a painful divorce with his ex-wife, is stalked at his remote lake house by a psychotic stranger and would-be scribe who claims Rainey swiped his best story idea. But as Rainey endeavors to prove his innocence, he begins to question his own sanity.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nSKhvsW9rvct60o363PQpXwNFou.jpg",
  "categories": {
    "plot": 5.241379310344827,
    "acting": 5.2,
    "ending": 5.529411764705882,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 3.6666666666666665,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Underrated and overlooked, Secret Window masters suspense and mystery. Johnny Depp does one of the more serious characters, I wanna see him do such characters more often, and the twist works"
    },
    {
      "rating": "10",
      "text": "One of the best films I have ever seen. You cannot imagine how Secret Window endings, and the fact that it's based on a Stephen Kings story, makes it better!!! Do not miss it!!!"
    },
    {
      "rating": "7",
      "text": "Although the film starts out with a fairly simple and seemingly innocent premise, Secret Window is no doubt one of the most twisting and chilling Stephen King stories ever brought to screen."
    },
    {
      "rating": "6",
      "text": "A successful writer who accused of plagiarism.It was based on the novel, though the original title makes more sense than this film. Maybe they wanted to avert the spoiler. But I don't think it would have affected much, because the twist comes at the final segment. The tale of a writer who is in the middle of divorce and now living alone is the lake house got threatened by a stranger, because according to him he stole his story. Followed by many unpleasant events, how he gets out of the trouble told in the next half.Feels just an okay kind. Though Johnny Depp was good. The suspense was good, particularly in the first half, but later it comes falling down. The second half was average, the twist was not interesting enough. After some point, you might predict it, but the point is it was too familiar. I especially did not like the finale, it was like not in detail. Still a watchable film, because of the actor and for decently made. So I think worth a watch if you keep a low expectation.6/10"
    },
    {
      "rating": "5",
      "text": "If you can be patient with this movie and its snail-like progress, this does turn into something quite creepy and chilling. It isn't a jumpy slasher like most of the other popular horror movies, while not outside the talents  of Stephen King, this one took a much more psychological turn. I mean again if you can just be quiet and pay attention while this movie builds, it starts to get scary. Especially if you can consider the idea of this actually happening to YOU. That being said I did think the alternate ending (found on dvd) proved more appropriate for the actual state of mind Mort was in. This did fall heavily on Johnny Depp who can definitely hold his own, but he may have been a slight bit too quirky, a minor problem. Overall it is a tough thing to make a good novella into a movie while staying relatively true to one another. I feel they did that, but it does move slow and the end, while horrifying, doesn't drop the jaw and feel worth the wait. It is one of my favorites though, nonetheless. Approach it openly and it may surprise you, but be critical out the gate and i don't figure you'll be all that impressed. Worth at least one watch."
    },
    {
      "rating": "0",
      "text": "I haven't watched the  full movie yet, anyway I read the novel and I have to say they differ in certain aspects. For instance, in the film  Mort kills his wife , whereas in the book he gets killed by a police agent, Fred, before he can commit the murder.Morevover, I found an intresting analysis of the film on this site: http://bluegrassfilmsociety.blogspot.it/2007/09/tony-bowling-analysis-of-secret-window.html. Check it out for more informations;)"
    },
    {
      "rating": "3",
      "text": "Filme extremamente fraco,Johnny Depp dar o máximo de sí porém o filme não ajuda,o desenvolvimento é lento o filme é ainda mais lento sem emoção e empolgação.A História já não é excelente"
    },
    {
      "rating": "5",
      "text": "Secret Window: 5 out of 10: I am not going to critique Johnny Depp. He is fine in this movie. And I certainly do not want the great wrath of woman, of various ages, down upon my head. Johnny Depp is a thespian God. He can do no wrong. Charlie and the Chocolate Factory never existed... (God he was awful in that.) Depp’s performance is the most entertaining thing is Secret Window. In fact with the exception of a wonderfully drawn Timothy Hutton in a supporting role, it is the only entertaining thing in the movie. The small cast is rounded out by Maria Bello (A 41 year old butterface that plays Depp’s, cuckolding, **** soon to be ex-wife) and the usually dependable John Turturro who is a disaster.\r This is a Stephen King adaption about a writer going over the edge. (If you saw the Dark Half which also starred Timothy Hutton this will definitely feel like familiar ground). The plot is a familiar train wreck. Depp is a writer going through a nasty divorce and suffering from writers block. There is a knock at the door and Turturro is at the door. With a southern drawl and an Amish tailor Turturro claims that Depp stole his story and has to make it right.\r Ah plagiarism, that old plot twist standby which many a great horror novel is based on. (Or maybe not). Turtorro’s character quickly becomes a nasty bit of work as he kills Depp’s beloved dog with a screwdriver. (This isn’t really a plot spoiler. This is a Steven King adaptation, there are no kids in it to kill and the beloved dog might as well have been dressed in a metaphorical red shirt from the first scene.) This is where the movie officially lost me. Turturro is about as threatening as a Joe Pesci romantic comedy and if his character (named Shooter) killed one of my family members the next time he entered my property he would be renamed shot.\r But the movie cannot let Depp kill Shooter... cause of a super secret plot twist so lame and so obvious that it’s no wonder plagiarism was at the forefront of the writer’s mind. To add insult to injury the movie actually feels it needs to drop hints at this shocking plot twist apparently under the assumption a portion of the audience sniffs glue for a living and didn’t figure it out within 10 minutes of the opening credits.\r The only real surprise in the entire film is the strange Children of the Corn references (Turtorro’s character seems to be clearly channeling Malachi and the last scene is torn right from that mid-eighties classic.) Perhaps the film is meant to be homage to the fine Children of the Corn series... No greater faint praise could I imagine damning with."
    },
    {
      "rating": "4",
      "text": "Johnny Depp is effective in this adaptation of a lesser known Stephen King story, but unfortunately the whole thing comes off as nothing more than a fancy made for cable thriller. It has a big budget cast with a low budget look and attitude. The writing is at times laboured and the direction somewhat pedestrian. Not one of the better King adaptations to film, but, then they're hard to come by."
    },
    {
      "rating": "4",
      "text": "Why johnny depp just made bad movies he's is a great actor but this movies are a **** Secret Window is one of his boring,without action...and without life souless boring so boring i yet say boring????"
    },
    {
      "rating": "3",
      "text": "If a movie requires the lead actor to spend a good chunk of his onscreen time talking to himself and Popeye is unavailable because of contractual disputes, it's hard to do better than Johnny Depp. His performance as the trebly beset writer Mort Rainey is the highlight of the underwhelming \"Secret Window,\" which opens nationwide today. This movie is a suspense thriller whose only suspense comes from an audience wondering if the picture will hit its promised 97-minute running time.\r \"Secret Window\" dramatizes the plight of Mort, who is suffering from writer's block. This was triggered by the tumultuous break-up of his marriage to Amy (Maria Bello) and the protracted divorce proceedings. The writer and director, David Koepp, stages the events leading to the end of Mort's marriage so well that most of what follows is a letdown.\r And what follows is Mort, who now lives in a remote cabin, sleeping his way through a depression until a thunderous knock at the door rouses him from a sofa almost as lived in as his bathrobe. He hauls his blond-tipped bedhead to the door, where he encounters John Shooter (John Turturro), which brings up Mort's Misery No. 3. Dressed ominously in a big-brimmed black hat and a work shirt buttoned to the neck — he looks like an Amish hitman — Shooter drawls menacingly, \"You stole my book.\" Groggy and astounded, Mort is confronted with the evidence: Shooter's short story reads exactly like Mort's best-selling murder mystery \"Secret Window.\" And worse, Shooter gives Mort three days to set things right, or else.\r Much of the plot turns on Mort's getting his hands on a copy of Ellery Queen's Mystery Magazine to prove that he published his story before Shooter wrote his version. And on Mort's need to be home when the phone rings. In other words the film takes place in a charming little seaside town without cellphones, Internet access or a library; sadly, given the current state of affairs, only the last is not so improbable.\r \"Secret Window\" was adapted by Mr. Koepp from Stephen King's novella \"Secret Window, Secret Garden.\" Mr. King's name is noticeably absent from the advertisements for the movie; given that the ABC miniseries \"Kingdom Hospital\" comes from the mind of Mr. King — sort of — this novelist's name must be as frightening to Columbia Pictures, which is releasing the film, as the Beatles' lawyers are to Danger Mouse.\r \"Window\" has been opened up to let too much air into the room, and the sluggish pacing will allow even the drowsiest viewer to keep up with the story. A number of amusing little clues turn up, involving some snappy gestures from Mr. Depp. And the director abets the mischief by planting a copy of Tom Robbins's farcical magic-realism novel \"Villa Incognito\" in plain view.\r Timothy Hutton plays Ted, the other man/other menace. (Amusingly, his dad, Jim Hutton, played Ellery Queen in an old series and would have wrapped things up before the trailer ended.) And Charles S. Dutton gives a gentle authority to the role of Mort's bodyguard.\r Pale and disheveled, Mr. Depp rolls through the film in a wardrobe that looks as if it has been slept in, the kind of believable physical detail that never gets costume designers Oscar nominations because it's far too real. What little intrigue the movie has comes from Mort's shattered self-esteem; he asks himself if he really was capable of stealing Shooter's story, vowel for vowel.\r Unfortunately, such a concern may not mean a whole lot to viewers. Then again, neither will the rest of \"Secret Window,\" which has the vague plotting generally found in an anthology horror-show episode. It's the kind of thing that's fine for about 20 minutes, before your attention kicks in, or nods off."
    },
    {
      "rating": "4",
      "text": "A mediocre film in which only Johnny Depp stands out. The plot is simple and predictable, which causes all tension to be lost. The ending is also obvious. One time you can see, no more."
    },
    {
      "rating": "5",
      "text": "Quite simply there is not enough of a story to stretch it out to a full length feature. It's why it's source material was a short story (and a good one) and nothing more."
    },
    {
      "rating": "0",
      "text": "This movie sucks! It wasn't scary, the acting was bad, and it was a crap storyline!"
    },
    {
      "rating": "6",
      "text": "The film starts out great, but as it progresses it loses steam. It becomes predictable and I found the ending a let down. Still, it has it's moments and Johnny Depp is great as always."
    },
    {
      "rating": "9",
      "text": "It has been a very long time where a \"scarey\" movie, actually scared me. So many movies out there like the grudge and ghost ship...give me a break! the only scarey part of the horror movies of today is that people waste their money to go see it. This movie truly surprised me. I heard so many bad things about it and i just happened to see it on tv without knowing what it was until it was too late(i was interested in it by then) What makes this so bad in peoples eyes today is because most people are full of crap when it comes to scarey movies. \"like, omg! the ring was so TOTALLY scarey\" these are the people who dont understand what makes a good movie"
    },
    {
      "rating": "5",
      "text": "Secret Window is a run-of-the-mill psychological thriller with solid performances from a capable past, namely a neurotic and paranoid Johnny Depp and creepy Southern John Turturro. While its tricks that it has up its sleeves are hardly noteworthy, the performances are rock solid and the film is capably directed by David Koepp. While it is hardly a must-watch, it is one that can be watched and you can rest assured it will be solidly entertaining. That said, do not expect too much, as it is pretty familiar when it comes to psychological thrillers and its adherence to the cliches. Having not read the source material, it also feels oddly similar to King's novel The Dark Half, which I have read. Since The Dark Half has been adapted into a different film and this one is based on a short story published a year after that novel, I have  no idea why this film was made. Hell, I do not really know why King wrote a short story on practically the same idea he put in an entire book.After being confronted with a plagiarism accusation from John Shooter (John Turturro) regarding his short story \"Secret Window\", Morton Rainey (Johnny Depp) slowly discovers he is insane. Initially in denial about his own insanity, it quickly becomes apparent that this man should not be left alone as he is a danger to himself and society. While the twist is predictable for anybody familiar with King or movies in general, it is quite well handled and thoroughly compelling all the same. The film has a really engrossing sense of paranoia that really keeps you on edge as Morton begins to put things together and it really has no problems hooking you in from the very beginning.Now, of course, a lot of that is due to Depp. He is never anything less than engrossing, even in bad films. He is sort of like Nicolas Cage in that way. He somehow breathes life into films where the material is below standard. Secret Window fits the bill there and is hardly Oscar-material. Yet, Depp makes it worthwhile playing the anger stricken husband with a cheating wife. His paranoia, neurosis, and obsession are all well-executed and Depp really brings it to life. By the end, you feel oddly sorry for the man as his story comes to life through his own tale. As a psycho, John Turturro is nothing less than stellar. He always brings his A-game and that is very much the case here as he plays the unhinged sociopath with ease and really has great chemistry with Depp in the scenes they share, which is a must.Secret Window is a hard film to recommend. For those that like psychological thrillers, it is a bit too typical to really appeal. For those that do not, it may be appealing, but it does stick too closely to cliches to really change their opinions on the genre. While it does execute the cliches well and the ending is superb in the way it really grosses you out mentally and ties together with the short story he wrote, it is hard an excellent film. It is fun while it lasts with some unique elements, but is mostly just worth it for fans of Depp or the few people who like to check out Turturro appearances."
    },
    {
      "rating": "6",
      "text": "Secret Window is a more than suitable psychological thriller with capable performances from Johnny Depp and a truly chilling performance from John Turturro. The problem to me has always been the third act, you can see the twist coming a mile away and the film does nothing to subvert it or much less hide the twist."
    },
    {
      "rating": "5",
      "text": "From the beginning, you can expect that Johnny Depp & John Turturro are the same person, when Mort found out that his wife betraying him with Ted, he became schizophrenic psychopath, and started to imagine another character (John Turturro) who represents the latent revenge within him.Who watch \"Fight Club\" & \"A Beautiful Mind\" they will know the secret of the movie since the first conversation between Johnny Depp & John Turturro, there is nothing mysterious in the film, we got enough of that theme.The performance of Johnny Depp was great. In this film he proves that he can do any role given to him. Lastly, the ending was acceptable and satisfied."
    },
    {
      "rating": "6",
      "text": "Film à rebondissement typique mais rebondissement unique : on lui pardonne volontiers d'autant qu'on se retrouve assez surpris au premier visionnage. Tirée d'une histoire de Stephen King, cruauté et paranoïa y font plus ou moins bon ménage tout comme la fin à laquelle on adhérera... plus ou moins.Johnny s'en tire assez bien, car en dépit de sa belle gueule, c'est un acteur \"assez bien\" en règle générale avec ses quelques moments de fulgurance, parfois. Maria Bello est une décolorée bancale, trop souvent à côté de la plaque pour sa part : à la fois énervante et quelconque. Heureusement, Turturro est là, toujours aussi percutant en personnage cinglé ou inquiétant... ou les deux en même temps !Le film est bien mené et sans gros défaut (à part en fait son histoire bizarre... pas forcément crédible) et se laisse regarder sans déplaisir mais ne parvient pas vraiment à sortir du lot des films de ce genre."
    },
    {
      "rating": "7",
      "text": "This movie is about a writer unexpectedly accused of plagiarism, after his traumatic and ill-resolved divorce. What could be just an intellectual setback quickly turns into a police case as the writer feels more threatened. We're facing a light thriller with some tension and a good script. But it takes a while to get to the most interesting moments and the first half will seem monotonous, with the conflict between the two central characters slowly becoming more dense. The end, with a good twist, will make up for that. There is a surreptitious link between the importance of film's end and the discussion between the main characters about the importance of the ending in a story.Johny Depp uses an intentional \"I woke up now and I'm hung over\" look to make his character more sympathetic to us. His character have much psychological depth and he manages to put it on screen. John Turturro is his antagonist but, at the same time, he completes Depp's character, insofar as the film relies on the rivalry between them. Turturro made an excellent deep southern accent and used a grim, sinister appearance to look more threatening than dangerous. The remaining cast has more secondary roles."
    },
    {
      "rating": "9",
      "text": "This is a really great thriller, one of the best I've ever seen. Does anyone recall a moment in this film when, right after Rainey picked up his package from the Post Office, he looked directly at the camera and addressed the viewing audience?"
    }
  ],
  "recommendations": [
    "the_raven",
    "identity",
    "the_king",
    "predestination",
    "1408",
    "the_autopsy_of_jane_doe",
    "cold_pursuit",
    "cujo",
    "the_skeleton_key",
    "the_little_things",
    "zodiac",
    "before_i_go_to_sleep",
    "the_lincoln_lawyer",
    "the_rental",
    "a_cure_for_wellness",
    "the_woman_in_the_window",
    "midnight_special",
    "child_44",
    "prisoners",
    "inferno",
    "memento",
    "knives_out",
    "the_machinist",
    "the_call",
    "10_cloverfield_lane"
  ]
}