{
  "id": 609,
  "title": "Secret Society of Second Born Royals",
  "starring": [
    "Peyton Elizabeth Lee",
    "Ashley Liao"
  ],
  "runtime": 97,
  "genre": [
    "Action",
    "Adventure",
    "Comedy",
    "Fantasy"
  ],
  "description": "Sam is a teenage royal rebel, second in line to the throne of the kingdom of Illyria. Just as her disinterest in the royal way of life is at an all-time high, she discovers she has super-human abilities and is invited to join a secret society of similar extraordinary second-born royals charged with keeping the world safe.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xOmGTJtBgRVSAF4S5dZEUqHqyy5.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 3.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Disney tries to make people believe that some of the original content they bring to Disney + has a better quality than what they produced for the Disney Channel, but the truth is that even if they change the presentation, the stench is unmistakable."
    },
    {
      "rating": "0",
      "text": "Pero que carajo es esta cosa, no tiene ningún sentido ni razón de ser, lo peor que Disney ha sacado en años."
    },
    {
      "rating": "9",
      "text": "So much fun for the WHOLE family. Finally little girls get to have their own rebel with a cause!"
    },
    {
      "rating": "2",
      "text": "It has become obvious that Disney+ is largely a dumping ground for any inferior content generated either accidentally by Disney or intentionally (like in the heyday of their direct-to-video sequels).Expecting SSoSBR to be good based on the trailer (which is more enjoyable than the movie) is foolish.Predictable, dull, thin garbage.  Seriously, do not be fooled, this was a waste of time."
    },
    {
      "rating": "3",
      "text": "It's a bad movie. The acting isn't good, the writing doesn't help and the budget wasn't very good either, but it is possible to enjoy (if you drastically lower your standards). If you want something nice to watch with your 7-12 year old kids, give it a watch to pass the time. Otherwise, look elsewhere"
    }
  ]
}