{
  "id": 3080,
  "title": "Secret Obsession",
  "starring": [
    "Brenda Song",
    "Mike Vogel"
  ],
  "runtime": 97,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "Newlywed Jennifer is brutally attacked at a dark rest stop. While healing from her injuries, she can’t recall anything from her past, including the ordeal. Her husband, Russell , is just thankful she’s alive and eager to get her home. As he reintroduces her to their secluded mountain estate, Detective Page  pursues Jennifer’s assailant — his own daughter went missing and was never found. The same fate now awaits Jennifer, unless someone realizes that her loving caretaker is actually her captor.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iKMeE6oYzBVzhA6xLGb8PPWEruF.jpg",
  "categories": {
    "plot": 6.166666666666667,
    "acting": 4.0,
    "ending": 3.0,
    "soundtrack": 3.0,
    "cinematography": 7.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "This is the kind of film on Netflix that is for times when nothing is going right and you just decide to call it a day. So it's good to have to watch even though the story, the writing, the directing, the cinematography, the choices each actor makes, are dreadful. At least there was something to watch, which seems to be the Netflix business model."
    },
    {
      "rating": "2",
      "text": "This is just a very cliche movie,that you have seen a thousand times. It's even worse than all those bad movies you've seen. Bad acting,bad script,bad action,stupid characters...Just don't ruin your evening if you can. Don't watch it! Netflix please stop doing a s**t like that!"
    },
    {
      "rating": "7",
      "text": "I don't go into suspense films expecting great Cinema, all I want tension and an interesting story (preferably with characters I can care about). For me, this movie delivers just that. I found it enjoyable, and couldn't wait to see how Jennifer figured things out.I also appreciate that it makes an effort to play with some classic thriller/suspense tropes, and does so pretty successfully. You won't find too much ground breaking here in terms of cinematography or story, but it is fun to watch if you enjoy seeing mysteries unfold."
    },
    {
      "rating": "3",
      "text": "Wow! Why did I let my lovely lady persuade me to watch this.Cliches,poor acting, loose ends (who was the man that visited the hospital with ominous music that got murdered?). A crap Sunday pm film for the very bored... but don't waste your 90 mins. Watch something with a review over 5."
    },
    {
      "rating": "4",
      "text": "A by-the-book thriller with few thrills and even fewer scares. On the positive side though, Brenda Song plays an impressive lead and Dennis Haysbert is always provides a welcomed screen presence. The direction provides some decent tension in some moments but the film fails in story and writing. The movie does nothing to avoid the many thriller cliches and really let's it self down before it has a chance to get going"
    },
    {
      "rating": "2",
      "text": "Netflix I'm trying to defend you and then you pull out this crap.It can't be done like that."
    },
    {
      "rating": "8",
      "text": "Not the most creative story but I thought it was put together well enough to keep me hanging in suspense, while still making me feel a great deal of sympathy for the female lead in this picture. The poor girl went through hell."
    },
    {
      "rating": "6",
      "text": "This is a damn good Netflix version of a Lifetime movie. It's got more production value and a more energetic pacing and a slicker feel but it's still a guilty pleasure, hot mess, cinematic trash. Its all by the numbers as a young woman is attacked and than awakens with amnesia. Her supposed husband played by hunky Mike Vogel (Texas Chainsaw Massacre \"03\") picks her up. He's  living and respectful at first until a dark side emerges and she begins to suspect he's not who he says he is. It's very cliched down to the Allstate guy playing a detective who just shows up as s tragic distraction. It's not memorable but its entertaining and let's face it it's not aiming high and in that regard it's a minor success.3/5"
    },
    {
      "rating": "5",
      "text": "This is not my least favorite movie of 2019 but it is far from my favorite. This movie was a good time filler but it was very predictable and not as suspenseful as I hoped. Brenda Song and Mike Vogel did give a good performances. Overall not the worst movie I have ever seen."
    }
  ],
  "recommendations": [
    "house_at_the_end_of_the_street",
    "shut_in",
    "the_loft",
    "the_boy_next_door",
    "disturbia",
    "contraband",
    "the_happening",
    "man_on_a_ledge",
    "now_you_see_me",
    "awake",
    "next",
    "hancock",
    "seven_pounds",
    "vacancy",
    "till_death",
    "hereditary",
    "abduction",
    "a_walk_among_the_tombstones",
    "national_treasure_book_of_secrets",
    "summer_of_84",
    "orphan_first_kill",
    "the_tax_collector",
    "marrowbone",
    "the_usual_suspects",
    "the_next_three_days"
  ]
}