{
  "id": 4875,
  "title": "Secretary",
  "starring": [
    "Maggie Gyllenhaal",
    "James Spader"
  ],
  "runtime": 104,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "A young woman, recently released from a mental hospital, gets a job as a secretary to a demanding lawyer, where their employer-employee relationship turns into a sexual, sadomasochistic one.",
  "releaseYear": "2002",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mdRXSE7ho185SZlXj0JSwuecEd3.jpg",
  "categories": {
    "plot": 5.916666666666667,
    "acting": 5.5,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "The critically acclaimed 50 Shades of Grey, Secretary is either too smart for me or just about one of the dumbest movies I have ever seen. Sexist, unsexy, and one of the worst written films I have ever seen, Secretary is not the worst film I have ever seen, but it not as far off as it should be. It is awkward, uncomfortable, and exists in this sort of dream world that tries to explore sexuality and depression, but winds up just sitting there and waiting for something to happen. Tragically, it never does and the viewer is left in the awkward position of being bored to tears. Character actions are odd, awkward, and completely undeveloped, leaving the audience to wonder why something happened. It not funny, it is poorly directed, and the acting is pretty rough. While I appreciate the dream aesthetic to the film, it is still an unbearable film that is not something I would subject my worst enemy to."
    },
    {
      "rating": "8",
      "text": "In Secretary, Maggie Gyllenhaal gives the performance of her career as Lee Holloway, a meek and introverted young woman who gets a job as a secretary for an oddball small-time lawyer (James Spader), which leads to a less-than-conventional sexual relationship. It's a sweet and engaging tale of two cripplingly shy people, who are unable to communicate with each other at all other than though BDSM. The film insightfully discusses intimacy, desire, sexual fetishism and depression, and manages to strike just the right balance between darkness and light-heartedness in writer/director Steven Shainberg's brilliant screenplay and complex characterisation. Both Lee and E. Edward Grey are interesting, layered and fully-rounded characters with real (if unusual) chemistry, and it's genuinely involving to see how their relationship progresses and how they conquer their fears and evolve as people throughout the film. It is only the last few minutes of the film that the narrative begins to wobble, delivering an ending that is a little too slushy and formulaic for this otherwise pleasantly original film. Even with this jarring change in tone in the final act, Secretary is a quirky, well-written and entertaining comedy-drama that bravely tackles a taboo subject in a way that only independent cinema can."
    },
    {
      "rating": "3",
      "text": "I have run into this movie several times while channel surfing, but had never watched it all the way through. Tonight, however, I saw the entire film.This movie will leave you with more questions than answers. It is disturbingly erotic. I say “disturbingly”, because both of these characters have severe mental health issues, and the last thing you want for them is to be in any kind of a romantic relationship. You want to see them both get to mental health facilities ASAP.  Nevertheless, (or perhaps because of this), the viewer’s primal sexual urges will definitely be awakened while watching this film.Lee is a naive, troubled young lady who has just been released from a mental institution for self-mutilation. Her feelings of vulnerability and abysmally low self-esteem are palpable as she tries to cope with her newly found freedom back home with her family.When she answers a help wanted ad, it seems to be Destiny stepping in to play a cruel and deviant trick on her, giving her even more of the same punishment she had already inflicted on herself.  As we watch her become dysfunctionally entangled with her boss, Mr. Grey, the viewer’s only wish is for her to run away as fast as she can and never look back.  Oh, if only she had done just that. As I watched her bizarre odyssey unfold, (at one point hating this man for hurting her, while at the same time feeling pity for him), I was dumbstruck while witnessing the sick commonality they shared, that of a deeply depraved mutual attraction. Lee seems to thrive on the physical and verbal abuse she is receiving from her boss. This is extremely disconcerting, to say the least.I felt somewhat conflicted at the movie’s conclusion, however. Maybe for them, this is not dysfunctional at all and can work, or at the very least, be as good as it could ever get for each of their twisted psyches.In any event, this film will leave you questioning and re-thinking society’s moral codes and values, as well as your own.It is a thoroughly creepy, unsettling ride."
    },
    {
      "rating": "8",
      "text": "Excellent movie! Didn't know what to expect when starting this film, however very pleasantly surprised. Gyllenhaal is amazing and so is Spader, their sheer intensity during some of the scenes makes you shudder. However, I believe that this film is a very powerful metaphor for finding oneself and true love, and can't be missed by the avid movie watcher. Especially someone who likes Gyllenhaal from other pieces. The S&M is not pornographic, rather personal. I highly rate this film, good plot, fantastic characters and actors, excellent movie!"
    },
    {
      "rating": "5",
      "text": "Well, as a secretary myself in an obscure company that makes bobble heads I can identify with the kind of situations this movie talks about.  Having to retype a letter all day because I keep making mistakes because the only reason I have the job is because I'm pretty not because I'm able to do anything properly behind a desk is just like the movie. I also get my bottom smacked when I make mistakes. It happens at least once a week. Far from it being a crude sexist experience it can be the highlight of my day-especially when its done in front of other people with my skirt off showing my bum in pantyhose to anyone in the room while my boss fondles himself with his free hand. What more could a girl want."
    },
    {
      "rating": "8",
      "text": "Despite it's unusual skew, Secretary is actually one of the most romantic movies I've seen. Sure, the characters are complete S&M nutjobs, but hey, they need happiness too. It's also a fun ride from start to finish because you're never sure where Gyllenhaal's and Spader's relationship is going. I honestly thought he might kill her! Kudos to both the main actors for top-notch performances, too."
    },
    {
      "rating": "7",
      "text": "An unsual film; a psychological drama: smart, romantic, erotic, with characters grow.It tell the story of a girl that begin a journey of self-discovery after being released by a mental instituition. She is trying to find his way and let other hears her without being suppressed by her problems, her family and social expectations. This journey takes a turning point when she find a job for a lawyer with his own spsycological difficulty. Try it, it may suprise you because it has a real story under the sm first impression.A much better, mature, down to earth and intelligent movie than 50 shades of gray."
    },
    {
      "rating": "10",
      "text": "James Spader was exceptional and it took a subject that isn't all that uncommon and made it mainstream. This isn't hardcore BDSM, it's just an alternative way to enjoy love."
    },
    {
      "rating": "9",
      "text": "The Secretary takes all of the standard 'love story' cliches and explores them with more honesty and meaning than any genre standard. Spader is perfect in his role; memories of his dysfunctional sexual nature from 'Sex, Lies and videotape' and 'Crash' had me convinced of his 'perversion' from the start. Maggie Gyllenhaal owns the screen with every sultry moment, and her pairing with Spader works perfectly throughout. Whilst the closing minutes of the film seem to go against the unfolding plot of a tragic love story, it works perfectly in achieving its' aim of showing us that there really is someone out there for everybody. Truly memorable performances and a truly touching film."
    },
    {
      "rating": "8",
      "text": "More proof that Maggie Gyllenhaal is one of the most talented, alluring, and underrated actesses working today."
    },
    {
      "rating": "2",
      "text": "This isn't the worst movie, far from it. However the movie has some interesting moments but the majority of the movie is banal especially the scenes featuring the BDSM. There are a few sexy scenes in the movie but they are unerotic, they are done merely in relation to the plot. Maggie goes full frontal nude in the movie but it is because the plot requires her to. I was expecting more depth from James's character because he lacked massive depth in his personality. His character came off as bizarre, aloof & overly one dimensional. If there was more sexuality in the movie & the relationship was presented stronger than what is seen, I would have enjoyed the film much more. Lastly the movie was lacking in supporting characters. There is only Maggie & James to hold the movie together. They attempt to salvage the movie but it all falls apart. If talented, well known actors were added to the movie, the movie would have been very engaging. Unfortunately this movie is worth watching once but you don't need to watch it again or buy the movie because it is totally average but barely exciting. Kudos to Maggie for trying a daring role and for being semi-sexy in a few scenes, aside from that the movie is a dud. The relationship between Maggie & James is Creepy and it should be erotic. If the BDSM scenes were erotic and passionate the movie would have worked perfectly. Those scenes are passionless, awkward and bland."
    }
  ],
  "recommendations": [
    "closer",
    "elle",
    "thoroughbreds",
    "blue_valentine",
    "me_before_you",
    "five_feet_apart",
    "20th_century_women",
    "the_hunt",
    "her",
    "the_fault_in_our_stars",
    "all_the_bright_places",
    "trainspotting",
    "unforgettable",
    "the_intern",
    "the_reader",
    "the_good_shepherd",
    "stillwater",
    "manchester_by_the_sea",
    "21_grams",
    "promising_young_woman",
    "lovelace",
    "swallow",
    "cashback",
    "black_swan",
    "melancholia"
  ]
}