{
  "id": 3040,
  "title": "See No Evil",
  "starring": [
    "Glenn Jacobs",
    "Christina Vidal"
  ],
  "runtime": 84,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A group of delinquents are sent to clean the Blackwell Hotel but little do they know reclusive psychopath Jacob Goodnight has holed away in the rotting hotel. When one of the teens is captured, those who remain band together to survive against the brutal killer.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uA6hwY75mhewYK2tAib1LJclhbD.jpg",
  "categories": {
    "plot": 3.5,
    "acting": 3.4,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I love gorry movies and horror flicks, this is definetly my fave."
    },
    {
      "rating": "10",
      "text": "Finally a true horror movie. This is the first time in years that I had to cover my eyes. I am a horror buff and I recommend this movie but it is quite gory. I am not a big wrestling fan but Kane really pulled the whole monster thing off. I have to admit that I didn't want to see this movie, my 17 year old dragged me to it, but am very glad I did. During and after the movie I was looking over my shoulder. I have to agree with others about the whole remake horror movies enough is enough. I think that is why this movie is getting some good reviews. It is a refreshing change and takes you back to The Texas Chainsaw ( first one), Michael Myers, and Jason. And no CGI crap."
    },
    {
      "rating": "4",
      "text": "An extremely typical slasher movie, with neither originality or consistent plot. Still, it gets pretty atmospheric sometimes, so I wouldn't call it a complete failure."
    },
    {
      "rating": "2",
      "text": "This movie was absolutely dreadful. It had it all: a mind-numbing plot, amateur actors/actresses, and over-the-top gore. This movie was definitely made for WWE fans...need I say more?"
    },
    {
      "rating": "8",
      "text": "Okay, not original in concept but served it's purpose, which was to make my girlfriend squirm, say \"Eeewww!\" a half dozen timeswhile clutching my arm tightly. An evening well spent."
    },
    {
      "rating": "0",
      "text": "The movie was point less. It was poorly made and it looked like they rushed to get it finished. They could have taken more time and made it a lot better and they needed a better plot line."
    },
    {
      "rating": "7",
      "text": "If you pay to see this film, hopefully you know what you're getting into and are not expecting an artistic masterpiece. Even if you don't know who Kane is (going into the theatre I had no idea the killer was played by a WWE wrestler), if you are a fan of the genre you should not be disappointed. Despite a slow start (half an hour into it I was still waiting for it to get exciting) the film eventually pays off in dividends. I have read many poor reviews, but one review in particular hit home with me. If I may quote Eric Lurio (GREENWICH VILLAGE GAZZETE): \"The art of the slasher movie is a subtle one. It's difficult to tell one from another in most cases and that's because they generally follow specific rules ... But just because one of these things follows the rules and does nothing especially original doesn't mean that it doesn't do the trick, far from it, this is actually pretty good for what it is...\""
    },
    {
      "rating": "0",
      "text": "I feel dumber for watching this movie."
    },
    {
      "rating": "2",
      "text": "Pretty awful movie. Acting was extremely amature, especially the police officer you eventually got whacked.."
    },
    {
      "rating": "10",
      "text": "This is not the film company reviewing this, I swear. This movie deserves something like a 9.76 out of 10, but since they didn't have that score, I had to round it up. This is a definite fun for the whole family film that really surprised me. This movie can inspire young film makers trying to make low budget movies on their DV cameras (I mean that in the nicest way possible). The 400 pound evil religious guy really made me realize that my sins must be cleansed. This movie is far more insightful than other \"religious based movies\" such as that Ron Howard mess. I heard that movie ruins families, like my friend Mary's daughter. Take your kids to this movie and they will learn a valueable lesson from the 400 pund evil guy."
    },
    {
      "rating": "1",
      "text": "Even worse than I thought it was going to be."
    },
    {
      "rating": "9",
      "text": "Good Fun, Gore!"
    },
    {
      "rating": "0",
      "text": "There is no evil to be seen in this disaster. There is only an odor, and it's a lot of crap."
    },
    {
      "rating": "0",
      "text": "I can't believed someone actually gave this movies a 1??!! Throw a slasher film into a grinder with the Saw, then shake it up until there are only the worse of both, and you get this..."
    },
    {
      "rating": "10",
      "text": "Everything said in the first post is pretty much correct - except some minor points. I'm a MAJOR Musical Theater fan, but I've never been much of a 'Rent-head', (I find the story a bit pretentious and self aware - basically a modern version of \"Hair\") - yet the emotion and energy is real and infectious, fueled by an incredible and memorable score. As I remember, though, both the songs \"Halloween\" and \"Goodbye, Love\" were NOT in the final cut I saw last night (11/6), but the interview with the cast and director was inspirational! The best factor for me was that Director Columbus made a decision to shoot it AS A MUSICAL and not try to hide it's musical theater roots (like say, \"Chicago\"). Also, he cast many members of the original cast (a throwback to old movie musicals). These were brave and successful moves, and should finally knock down that door to MORE movie musicals. HIGHLY RECOMMENDED!"
    },
    {
      "rating": "0",
      "text": "I saw this movie because I like Kane as a wrestler and wanted to see what kind of movie talent Vince McMahon could muster. Well...$20 and an hour and half later I wanted to rip my own eyes out for seeing this God-awful flick. The acting was the worst I HAVE EVER seen and the plot incredibly lame. The director and everyone involved should be embarassed that they were part of this stick-fest. The next WWE flick is called \"The Condemned\" (no relation to the game) and features Stone Cold Steve Austin as a convicted felon. I'm going to save my money and wait for a cheap rental cause it's probably going to be just as bad!!"
    },
    {
      "rating": "1",
      "text": "The only reason I gave this movie a 1 is because it features Kane. However, that 1 may have been too generous. You know what's been going on Raw and Smackdown! for the past few weeks before the movie's release? Kane has been going insane over the date \"May 19\". Do you know why? Because even the Big Red Machine knows his movie is trash and he's really upset about the release. Kane can wrestle, but acting is in another world."
    },
    {
      "rating": "7",
      "text": "Not nearly as bad as I was expecting. I was awaiting this movie to be dreadful. It really wasn't that bad. It had it moments that were stupid. But other then that, decent movie. For the gore fan for sure."
    },
    {
      "rating": "10",
      "text": "This film was a non-stop thrill ride with the actor Glen Jacobs a.k.a. Kane performing like a man who's been in the film business for as many years as Marlon Brando. The horrifying ending is truly something to behold and I suggest anyone out there who is into slasher-horrors (not just you WWE fans) rushes to the any theatre still showing this masterpiece."
    },
    {
      "rating": "0",
      "text": "This movie was just like any other horror film where they're trapped in a locked house. It was too predictable and a basic boring plot. Very cheap actors also."
    },
    {
      "rating": "10",
      "text": "This is the best WWE-spawned horror movie ever. Think about it."
    },
    {
      "rating": "8",
      "text": "Just not that good. If I hadn't been familiar with the story I don't think I would've enjoyed it at all."
    },
    {
      "rating": "0",
      "text": "Pretty terrible. Very poor visual effects and they didnt even try to make them look realistic. The horror was weak and the acting was terrible. Just another pathetic attempt at filmmaking by the WWE."
    },
    {
      "rating": "1",
      "text": "This movie was just horrible. There is absolutely nothing good you can say about this movie. The writing, acting CGI premise, directing and action are all just horrible. The deaths weren't even cool. This movie is just an absolute waste of time.  I feel like this movie was written on the back of a napkin and the only reason it was made was a producer lost a bet and it was either castrate himself or make this film. I am almost certain after seeing the movie he castrated himself just out of shame. I am just in awe at how horrible this was. Go see another movie and save the money and time you will waste by watching this."
    },
    {
      "rating": "3",
      "text": "See No Evil is the film that started it all for WWE films, and with a sequel due out later this year, I figured I'd give it a shot. The WWE films have been surprisingly good, but I think See No Evil is what most people expected when they heard WWE was going into the film business. Kane stars as a mad man, held up in an old abandoned hotel. Chaos quickly ensues, when a group of teenage delinquents are assigned to fix up the hotel, as part of their community service. Kane is a perfect villain, as he is a huge scary guy, however, he plays a character that has all of two lines the whole film. Being that this was WWE's first venture into the film business, they weren't able to get anyone of name to support him, and there were some awful performances, by young actors in their debut roles. This film was a just a very basic, generic, slasher film, that we've all seen a million times. There is nothing of note and it was quite boring and unimaginative. I can only hope with the development of their films division, that WWE and Kane can come up with something better for the sequel."
    },
    {
      "rating": "0",
      "text": "Incredibly generic story supported by poor acting. Not scary either and not entertaining. I agree with critics 100%. This film is a piece of trash and not worth watching."
    },
    {
      "rating": "5",
      "text": "Kane is one of my favorite WWE superstars and I saw this film when it was first released, is it as bad as it's metascore says? No, not in the slightest. Kane, now Mayor Jacobs is a pretty scary individual. He's scarier if you ever have the pleasure of meeting him up close so he doesn't need to act very hard to be scary. It's a meaningless horror film otherwise"
    },
    {
      "rating": "6",
      "text": "I was reading the comments and I was like **** this movie looks horrible.But i watch it to see what kind of movie it was. And,i was really surprised because it's not that bad.I agreed the effects are really horrible but there is a lot of action and the actors were not that bad."
    },
    {
      "rating": "5",
      "text": "A mere summer entertaining slasher with no answer to the meaning of life and with Craig Horner; our Seeker."
    },
    {
      "rating": "8",
      "text": "Big humongous dude gets shot in the head, and gets a plate put in. He pretty much goes psycho and wants revenge. Really good movie."
    },
    {
      "rating": "3",
      "text": "This is far from original. It is a pathetic horror. It seemed obvious that they saved their entire budget for the ridiculous, over-the-top, ludicrous ending. If the whole film was like the ending then it would have been very good. The gore wasn't even that gross. There was no depth or atmosphere. A lacklustre effort. The overblown and fun ending barely improves a terrible attempt at a horror movie."
    },
    {
      "rating": "10",
      "text": "The movie that few like but I'm in love with kane in the form of crazy assassin"
    }
  ],
  "recommendations": [
    "friday_the_13th",
    "rings",
    "the_bye_bye_man",
    "ouija",
    "the_texas_chainsaw_massacre_the_beginning",
    "red_dawn",
    "jeepers_creepers_reborn",
    "the_eye",
    "the_messengers",
    "slender_man",
    "venom",
    "the_babysitter_killer_queen",
    "the_mummy_tomb_of_the_dragon_emperor",
    "drag_me_to_hell",
    "cabin_fever",
    "the_host",
    "indiana_jones_and_the_kingdom_of_the_crystal_skull",
    "the_darkest_hour",
    "the_wolfman",
    "malignant",
    "legion",
    "stay_alive",
    "the_grudge_2",
    "the_curse_of_la_llorona",
    "the_devil_inside"
  ]
}