{
  "id": 266,
  "title": "Seed of Chucky",
  "starring": [
    "Brad Dourif",
    "Jennifer Tilly"
  ],
  "runtime": 87,
  "genre": [
    "Comedy",
    "Horror",
    "Thriller"
  ],
  "description": "This time around, Chucky and his homicidal honey, Tiffany, are brought back to life by their orphan offspring, Glen. Then the horror goes Hollywood as Chucky unleashes his own brand of murderous mayhem!",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vd9K93gQ9whMKjXzADZanxWpIXM.jpg",
  "categories": {
    "plot": 4.625,
    "acting": 4.571428571428571,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.2,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I like the Child's Play films because of  the horror, but I like Seed and Bride of Chucky because they are comedy. Seed still has a few hints of horror, but most of it is humorous."
    },
    {
      "rating": "7",
      "text": "The Chucky movies are probably my favorite horror/comedy movies of all time. This one wasn't the greatest out of all of them, but it was still pretty good."
    },
    {
      "rating": "9",
      "text": "awesome sequel"
    },
    {
      "rating": "3",
      "text": "This film could've worked if Chucky wasn't jerking off, driving a car, and killing Britney Spears. There's also a lot of sexual comedy, which is uncomfortable and annoying.Then there's Glenn pissing his pants, ugh.This film could've worked if they didn't make stupid writing decisions. And this film looks like a cheap, direct to video product, which is ironic as this was the last theatrically released Chucky film."
    },
    {
      "rating": "7",
      "text": "Seed of Chucky is actually not as bad as people say how bad this is I actually like the very beginning but glen looks like trash and his voice I do not like neither so he is not enjoyable on-screen but this movie I did enjoy tho more like Freddy's dead and Halloween resurrection the lows' of those series Chucky is still great as Chucky but if u do not like wierd comedy this is definitely not the movie for you I did enjoy the comedy and those kills wow a lot of brutal ones one thing that is so annoying is that glen keeps peeing himself and he literally does nothing in the movie besides betraying Chucky with tiffany and the japan stuff does not make any sense the ending is so lazy and dumb like glen doing karate what!!!!! and Chucky dies and tif and that is the worst ending I have seen from this series so all-around an enjoyable movie if you don't mind the comedy if u don't watch this but if you do you will enjoy the movie has cool kills so I give Seed of Chucky a C+"
    },
    {
      "rating": "4",
      "text": "I haven't seen any of the first 3 Chucky films, but fell in love with Bride Of Chucky, because of the introduction of Tiffany, played by the very beautiful Jennifer Tilly. This film, I was expecting it to be a great follow up to that great film. Sadly, it wasn't. Glen's character is, well, I liked that he was simply on a quest to find his parents, and I liked how he tapped into his killer instinct at the end of the film to kill his father, and how he didn't want to kill like his parents, but, here come the bad points. His British accent. I know that he got it from travelling with that **** at the beginning, but it just doesn't seem right. Him knowing Japanese, and doing the kung fu against Chucky, where did that come from? Maybe he learnt it from TV while in his cage, but come on! The act at the start was just crap. And the pissing! For gods sake, WTF? and how did the opening scene in that house fit in to the story? The film itself, well let me break it down. Chucky was brilliant as usual, especially the Britney Spears scene \"Oops, I did it again\" and the Shining parody scene. It was great to see his killer instinct unchanged, and him trying to pass it on to his son, but the masturbation scene just felt wrong. I didn't dislike him instantly trying to kill Tiffany, but I loved their character dynamic. Shame it looks like the duo won't be together again. Tiffany, brilliant like in the last film, I especially liked how she was trying to quit killing. I liked that she got to be human with her children, and that her killer instinct hadn't left. Jennifer Tilly, her complete change of character after she'd given birth felt a little tacked on and I wasn't liking Redman. He was a pretty useless character. Why bother including him? And the chauffer, he needed to be included more to have felt sympathy for me from his death. Hannah Spearrit's character, I felt a little sympathy for her, she needed a little more screen time. For all of this, I felt a little dissapointed by this film. It was bad, but it wasn't horrible."
    },
    {
      "rating": "0",
      "text": "Seed of Chucky is a rare film. Rare in the way that it's the kind of film that absolutely kills a franchise. I honestly can't think of a single redeeming aspect of it."
    },
    {
      "rating": "6",
      "text": "The whole series is my guilty pleasure. Actually,I LOVED Bride of Chucky. Not because it was scary,but because it was hilarious. I have not a single clue why this doll, voiced expertly by the respected Brad Dourif, has captured my fantasy and gaze. Perhaps because it is ridiculous, edgy, and at times there are some one liners that I have laughed over for hours on end,\r Seed is more of the black sheep of the series. It's comedic, but it's also not very well directed which is explained by Don Mancini, the creator/director. As much as I love the whole Tiffany/Chucky already married and having a baby, I felt there could have more to really sink some teeth into. I am not ashamed to admit it, this is a fun ride if you're able to look past the film's flaws. Ordinarily, I would suggest not viewing it at all, but if you have a love for the series (especially if you love Brad Dourif's work) it's certainly worth a look. I'll come back to view this every once in a while."
    },
    {
      "rating": "4",
      "text": "A REALLY poor attempt. Chucky is pretty much my favorite Horror movie villain. Here, he's just a pathetic joke. But, it's not his fault. Just absolutely poor writing from a script spewed out by a dyslexic Downs syndrome patient. You can hear that Brad Dourif was really trying his best with what he was given, but even that wasn't enough. Chucky is perhaps the ONLY saving grace in this movie. Everything and everyone else is just terrible. Okay, to be honest Tiffany did have a few moments and it was funny watching the two murderous dolls have \"family\" issues. But that wore off fast. Overall: A crap movie that has a few enjoyable moments, but nowhere near enough to save it or even make it average."
    },
    {
      "rating": "1",
      "text": "I love the original Child's Play movies, and I did enjoy Bride of Chucky, but this movie was awful. Its not scary at all, nor is even that funny. The thought of Chucky having a wimpy kid or having a kid whatsoever is absurd, or having to cut down on killing like it is a drug. Chucky was meant to kill and it's ridiculous that the director thought that would be a good idea.  Child's Play 1, 2, and 3 are the best in the series, Seed of Chucky is an insult to horror/comedies and I wouldn't recommend it to anyone."
    },
    {
      "rating": "5",
      "text": "Seed of Chucky is the 4th sequel to the popular horror movie, Child's Play (1988) revolving around a killer doll named Chucky, trying to possess a young boy named Andy Barclay. Now 16 years after the original, we have Seed of Chucky. Seed of Chucky is the 2nd Chucky film to have taken more of a comedic turn, in order to keep the series a bit fresh and more enjoyable to a general audience. In the film, it is much different from the original 3, in that Chucky is not after Andy. Now, after the events of Bride of Chucky, we are out behind the eyes of their son/daughter Glen/Glenada, the offspring of Chucky and his girlfriend Tiffany, and like them, he is also a doll with human characteristics. In the film, the story bounces around a lot, and their are few plot holes and inconsistencies. Sometimes characters get to certain places that would seem REALLY difficult to find or even get to, but they do anyway, without an explanation, it just kind of happens.. Basically this is what happens, Glen flies to LA after seeing his alive 'parents' on TV, when he arrives, he finds them in storage of a Hollywood set and reads the chant of the old Voodoo medallion that Chucky apparently gave him after he was killed? (This makes no f****** sense...) After that, they rise from the dead and Glen tells them that he is their offspring, and after some arguing, they accept him. Shortly after this, they kill and it shows how much of a p**** Glen is compared to his parents. On the other hand, Jennifer Tilly, the actress playing Tiffany on the TV show is trying to land a movie role by sleeping with some black guy. Eventually, Chucky and Tiffany get her pregnant and they orchestrate this big plan to put their souls (Chucky, Tiffany, and Glen/Glenada) into Jennifer Tilly, her random limo driver, and one of her two babies that some how come out clean? But, Chucky at the last second decides not to do it, and he kills Tiffany, shortly after, Glen kills Chucky for some reason. Then it skips to five years later at some birthday party, and apparently, Tiffany somehow managed to transfer her soul into Jennifer, Glen's soul into the baby boy, and as for the baby girl, she just acts like Chucky with her mischievous behavior, and has red hair. Then, Glen gets some random a** present and when he opens it, it has Chucky's severed arm, which attacks him. THE END. This movie is stupid and really inconsistent, but it is fun and adds a new character to laugh at, Glen, while reciprocating the newly found comedic roots from 1998's Bride of Chucky. In this movie you basically just watch Chucky be an a**hole, while seeing some killing and doll boobs. Nonetheless, not the worst movie I have ever seen, and some of the POV shots were pretty cool. 5/10"
    },
    {
      "rating": "3",
      "text": "A very stylized film that (unlike part 3) has far too many ideas and not enough time to develop them. This film is very Meta and highly satirical and unfortunately falls into that trap that most horror films do when they have advanced sequels; the killer isn’t scary anymore but rather goofy (Freddy’s Dead anyone?). It also borders on being offensive to the transgender community. Clearly this film is the worst of the franchise."
    },
    {
      "rating": "5",
      "text": "Below Average Chucky FilmAfter the decent Bride Of Chucky, I had hopes for this one, Unfortunately, Chucky has caught sequelitis AGAIN."
    },
    {
      "rating": "0",
      "text": "What the hell? What is this movie? Bride of Chucky was an okay movie now Chucky has a son? What the hell?! The movie isn't even scary its just comedy mixed up with some cringe worthy scenes. They ruined Chucky."
    },
    {
      "rating": "2",
      "text": "this movie is just terrible, the worst  movie in the franchise. i kinda do some what like chucky in this movie but not really, the jokes are just awful.  the glen/glenda thing is just...god this movie..."
    },
    {
      "rating": "10",
      "text": "Seed Of Chucky is that type of movie that you need to watch with an open mind its full of dark humour and if you aren't a fan of that then you will probably not like it. You will either love or hate seed of Chucky and if you are interested in it then I highly recommend it."
    },
    {
      "rating": "5",
      "text": "Seed of Chucky (Child's Play 5) is entertaining but doesn't have any taste of horror with which this franchise started. Movie is continuation of Bride of Chucky and like fourth part, this part was also just timepass.The movie doesn't take itself seriously for a second. Also there are a few gory murders thrown in to satisfy us horror fans and the film never stops moving.The acting was bad. The direction was also bad. With the story this much weak, a strong direction was needed. The pacing was normal. What made this movie different from earlier parts was that it didn't have any proper horror element. Movie was just comprised of violence and humour. The special effects were properly used, thank God for that.Overall, the movie is a fun ride but it may fail to satisfy even those who love watching Child's Play franchise."
    }
  ],
  "recommendations": [
    "friday_the_13th_the_final_chapter",
    "a_nightmare_on_elm_street",
    "jason_goes_to_hell_the_final_friday",
    "friday_the_13th_part_iii",
    "the_babysitter_killer_queen",
    "friday_the_13th_a_new_beginning",
    "bride_of_chucky",
    "curse_of_chucky",
    "friday_the_13th_part_2",
    "son_of_the_mask",
    "friday_the_13th_part_vii_the_new_blood",
    "halloween_kills",
    "friday_the_13th",
    "texas_chainsaw_3d",
    "fright_night",
    "mama",
    "jason_x",
    "cabin_fever",
    "freaky",
    "the_bye_bye_man",
    "halloween_resurrection",
    "spy_kids_all_the_time_in_the_world",
    "wish_upon",
    "brightburn",
    "i_know_what_you_did_last_summer"
  ]
}