{
  "id": 1019,
  "title": "Seeking Justice",
  "starring": [
    "Nicolas Cage",
    "January Jones"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "description": "After his wife is assaulted, a husband enlists the services of a vigilante group to help him settle the score.",
  "releaseYear": "2011",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lN3O0j1DKVnwhO1h5J3utrmrBF2.jpg",
  "categories": {
    "plot": 6.846153846153846,
    "acting": 6.142857142857143,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 0.0,
    "funny": 9.0,
    "action": 6.6
  },
  "reviews": [
    {
      "rating": "3",
      "text": "By all costs a Net-Flix, night-filler as opposed to a $10 theater let-down, \"Seeking Justice,\" is not the worst played by Cage (sporting a fledgingly trim goatee) in recent films, though it is not far behind. Still packing unnecessary convolution and plot holes, ample action, and a low suspension of disbelief, this thriller is only saved from camp delight due to Pearce's sufficient-enough foil. Though, once the plot takes off, as with almost every Cage movie, mostly of late, things become familiarly complicated, nonsensical, and, oh yes, embarrassing and intermittently funny. Cage fans not to be disappointed; he may even exceed your expectations (not that the bar has been set very high)."
    },
    {
      "rating": "9",
      "text": "This was a very well made, very entertaining movie. Both of us were extremely happy with it and went away feeling like we'd seen a high quality piece of filmmaking. The shots, locations, edits and casting were invigorating and yet realistic and lifelike. The dialogue was mainly restrained and nicely understated. The acting was good all around and Nic Cage was especially strong, playing a vulnerable \"regular guy\". Sure the plot is a little fantastical but within that sort of genre it was smart and well written and the plot was truly suspenseful and thrilling, consistently through. Despite the action/intrigue plot it had a low-key indie feel a lot of the time. Also, the New Orleans locales were excellent."
    },
    {
      "rating": "9",
      "text": "Yes, Nick Cage has made some stinkers, but Seeking Justice isn't one of them. This move was suspenseful from beginning to end, The worst thing about this movie was the title.It should 've been called Civilian Justice."
    },
    {
      "rating": "7",
      "text": "Seeking Justice is truly one of Nicolas Cage's better films and maybe the best one in his last 15 or so. The plot hinges on a very interesting and creative concept of an underground vigilante operation that I haven't seen in any other movie. Some of the plot points that progress the story arc feel a bit weak but overall, I was pleasantly surprised but how entertaining and well written and acted the movie was."
    },
    {
      "rating": "7",
      "text": "Seeking Justice is a rare example of a B-Movie blockbuster. This film may have been direct-to-video, but it features one hell of a cast, a ton of action, and a pretty decent storyline. Like most B-movies, this film was predictable as hell, but not in a bad way. Yes, I knew what was coming, but I was still interested in seeing how it was done and what the results would be. Nicholas Cage is actual not the action star of this film, he is merely a High School English Teacher, with a seemingly perfect life. His world gets turned around though when his wife is savagely raped and beaten. As a result, Cage has two options, let the police do their thing or find someone else to take care of business. Can you guess which choice he made? Cage is of course fantastic as always. Even if the particular film doesn't suit your interests, when you see that it stars Nicholas Cage, you know you're about to be entertained. Guy Pierce is also excellent, giving a performance that was eerily similar to that of his character in Memento. Seeking Justice is definitely not an award winning film and is destine to fall under the radar of most moviegoers, but it's just as thrilling and entertaining as anything you'll see at the box office."
    },
    {
      "rating": "0",
      "text": "This film is bad, laughably bad.  I was actually entertained at just how ludicrous and poorly done this potboiler is.  This is the kind of film that flashes back to five minutes ago to show what the hero is thinking.  It has so little faith in the audience to figure out that maybe, just maybe, the hero is thinking about his wife's attack that it flashes back not once, not twice, but three different times.  This film stands in resolute, unwavering defiance in the face of credibility, without seeming to know it.  I couldn't recommend it more if you want to watch something really, really terrible.  Full review on my blog."
    },
    {
      "rating": "1",
      "text": "What is te reason to watch other film of Nicholas Cage? Because his last movies are of this type, like kill, boom, all fight, he die, and all the film is same, and boring. The only good on Seeking Justice are the performance of January Jones and Guy Pearce."
    },
    {
      "rating": "5",
      "text": "i wonder if they went out of their way to rip off numerous better films... like taken, law abiding citizen, etc. oh well, it at least assembles all the little bits ripped from these films into something decent..."
    },
    {
      "rating": "6",
      "text": "\"Seeking Justice\" is a decently-entertaining and well-made thriller with a healthy pace and good storytelling.  Nicolas Cage plays a happily married man whose life is turned upside down when his wife is beaten and raped one night, and accepts a stranger's offer to \"take care of\" the perpetrator in return for a promise to pay him back sometime. When that time comes, he challenges what he's asked to do, and ends up on the run to protect his name and his wife. The film boasts good storytelling and a healthy pace, and Cage's performance is engaging. Guy Pearce also handles himself well as the villain, and there's a fair dose of action sprinkled throughout. Don't expect it to be more than what it is - a popcorn thriller - but don't expect it to be any less, either."
    },
    {
      "rating": "6",
      "text": "Despite it's obvious low budget, inconsistencies, cliché action scenes and predictable ending, Seeking Justice isn't all bad. The acting was okay, the action scenes were well made and quite entertaining and the movie was interesting. It's not a particularly bad action flick, it's just not very good."
    },
    {
      "rating": "8",
      "text": "Seeking Justice is like mediocre pizza; It won't change the world but it should satisfy those hungry for a well-made, generic meal.\r Watch here for free http://www.watchfree.to/watch-1d0a67-Seeking-Justice-movie-online-free-putlocker.html"
    },
    {
      "rating": "7",
      "text": "I found this to be quite a suspenseful movie. The plot moves at quite a fast pace, with a few decent twists. Cage puts in his usual performance as a fairly quick witted regular guy who was perhaps in the wrong place at the wrong time. The score used made scenes appear more menacing and tense, that and low camera angles used to highlight Wills distress when he scanned around areas looking for people. The movie is at least partly set at night but it was easy to see what was going on, which is a big plus when I think back to some earlier movies which frustrated me no end with their dark settings that I couldn't make much from the picture.I noticed that the story didn't take the sometimes tedious half hour or so to build up, with the action starting (or certainly the plot quite clearly building up) pretty quick. There are some fights scenes, which seemed pretty realistic, although not overly gratuitous. There is also strong language present, so be aware of that if its something thats likely to offend. I know Nicolas Cage's roles of the last few years haven't all been received with critical acclaim and indeed I didn't think a great deal of one or two but this one I thought was decent enough. Its hardly ground breaking material but I thought it was entertaining enough, it kept me guessing and there were some pretty suspenseful scenes to keep me watching through to the end. The message behind it is rather sinister, one that many people who are victims or who know victims of crimes may well feel very emotive about - the idea that justice isn't always served on the people who carry out depraved acts but to get involved in underground activities, is that right? yes it is pretty much a tired out theme but it still applies in this day and age, to quite a large extent I think.To me this is a fairly good movie and as such, I suppose I would recommend it, yes. It could be seen as perhaps a fairly regular, run of the mill action movie but there are certainly worse out there, in my humble opinion - this one kept me guessing and entertained, so to me it was pretty decent. There are some shocks and decent action scenes, although it could perhaps be seen as a bit superficial maybe, without a great deal of characterisation I suppose but otherwise yes, I'd recommend it."
    }
  ]
}