{"id": 3600, "title": "Selena", "starring": ["Jennifer Lopez", "Edward James Olmos"], "runtime": 127, "genre": ["Drama", "Music", "History"], "description": "In this biographical drama, Selena Quintanilla is born into a musical Mexican-American family in Texas. Her father, Abraham, realizes that his young daughter is talented and begins performing with her at small venues. She finds success and falls for her guitarist, Chris Perez, who draws the ire of her father. Seeking mainstream stardom, Selena begins recording an English-language album which, tragically, she would never complete.", "releaseYear": "1997", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/j8xX3yBAFOayfSaImgLZPnAcdWz.jpg", "categories": {"plot": 5.0, "acting": 10.0, "ending": 10.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "The movie \"Selena\" is a touching portrayal of the life of a rising star that was cut short. Over 20 years on and this movie has become an American classic. Jennifer Lopez gave a truly magnificent performance as Selena and should have been nominated for an Oscar, in addition to her Golden Globe nomination."}, {"rating": "9", "text": "Very good and sassy! One of the year's best films!"}, {"rating": "10", "text": "An amazing movie, truly moving and heartwarming! Anyone who hasn't seen this movie is really missing out! It makes me cry at the end every time, I wish she was never killed, such talent gone in a few seconds, so sad!"}, {"rating": "8", "text": "When I was planning a trip to Corpus Christy. I found Selena's name and music. I came to The United States in 2003. I hadn't known her at all. The film was very educational.I learned her and  Tejano music. Jennifer Lopez was great. If you want to know Selena, please watch!"}, {"rating": "8", "text": "Its a good representation in role performed by JLo in the history of the Texano Legend. Viva Selena!"}], "recommendations": ["cinderella_man", "walk_the_line", "respect", "forrest_gump", "the_godfather", "house_of_gucci", "king_richard", "almost_famous", "flag_day", "the_shawshank_redemption", "bohemian_rhapsody", "the_parent_trap", "raging_bull", "goodfellas", "afterlife_of_the_party", "my_name_is_khan", "la_la_land", "mary_poppins_returns", "hairspray", "quo_vadis", "casablanca", "a_star_is_born", "a_beautiful_mind", "spencer", "rocketman"]}