{
  "id": 4326,
  "title": "Settlers",
  "starring": [
    "Sofia Boutella",
    "Ismael Cruz Córdova"
  ],
  "runtime": 104,
  "genre": [
    "Science Fiction",
    "Thriller"
  ],
  "description": "Remmy and her parents, refugees from Earth, have found peace on the Martian outskirts until strangers appear in the hills beyond their farm. Told as a triptych, the film follows Remmy as she struggles to survive in an uneasy landscape.",
  "releaseYear": "2021",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tBUYDwiJVDcnjPneOitVetJk2Rt.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "There's something in Settlers that makes it compelling, but it's bogged down by the weight of what the writer/director thinks it should be about. This could have been just a simple story of a failed colonization and its aftermath, but they tried to imbue it with too much bs. It's not colonization of indigenous people, and I think that was one of the points. There are no indigenous peoples of Mars, in case someone was wondering. However, one thing humans will do is find a way to hate each other and it's usually something completely incidental (race, gender, orientation). Case in point, Jerry hates the family that moved into his parents (his) farm. He doesn't ask why or how it happened, he just brings along a few friends and decides to take it back by force. After doing so, and the loss of three people, he moves in and makes the surviving mother and daughter an offer in the name of survival. This is where what could have been a decent movie about survival on a hostile planet fails. Why is Jerry so damned rapey?! His reasoning is so contradictory it leaves no room for common sense. I guess someone saw this as a statement about women not needing men? If so, this is the dumbest way to go about it. Jerry makes the case for and against himself in that the whole Mars colony is a failure and they're all gonna die. So why would he care to create more kids to die on the deserted planet?? Outside the ridiculous plot, it looks and feels okay to me (I've seen criticism about the setting, but then again, it's a dome on Mars so it can be whatever). I can only imagine this started out as a simple Mars colonization story and devolved into some kind of political/cultural/social statement that destroyed a threadbare plot. Shame. Good cast (including the ever-awesome Brooklyn Prince from Florida Project), decent filming (loved Steve), but bogged down by intent."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)Why does Remmy end up with an ear piercing? Was she really on Mars or was it a metaphor? If the director is not interested in being clear, let alone me. Another debut to \"LEAVE\" out."
    }
  ]
}