{
  "id": 1071,
  "title": "Seventh Son",
  "starring": [
    "Jeff Bridges",
    "Julianne Moore"
  ],
  "runtime": 102,
  "genre": [
    "Adventure",
    "Fantasy"
  ],
  "description": "John Gregory, who is a seventh son of a seventh son and also the local spook, has protected the country from witches, boggarts, ghouls and all manner of things that go bump in the night. However John is not young anymore, and has been seeking an apprentice to carry on his trade. Most have failed to survive. The last hope is a young farmer's son named Thomas Ward. Will he survive the training to become the spook that so many others couldn't?",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7Q8DfXSjcFSSQDOxz1Sk865wNqI.jpg",
  "categories": {
    "plot": 4.483870967741935,
    "acting": 4.081081081081081,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.0,
    "funny": 2.5,
    "action": 4.705882352941177
  },
  "reviews": [
    {
      "rating": "4",
      "text": "This less than enthralling fantasy film plays out like a mash-up of The Lord of the Rings and Hansel and Gretel: Witch Hunters without any of the original splendor."
    },
    {
      "rating": "2",
      "text": "Seventh Son - There was one good aspect of the movie: The special effects. The acting was good, but with a script like this, no actor has a chance to shine. I have seen school performances that were more memorable than this.It felt like three first-time scriptwriters came together on a rainy weekend - with a goal to include as many genre cliches as possible per minute.I never thought the day would come where I say this: Van Helsing (2004) was the better movie.That anyone would film this script can only be explained if the investors desperately needed a guaranteed write-off project."
    },
    {
      "rating": "3",
      "text": "Seventh Son is the latest pile of trash to come out this year. Unoriginal, boring, horrible acting and a movie that makes no sense. At least the visuals kept your eyes from closing."
    },
    {
      "rating": "2",
      "text": "Overall I really disliked Seventh Son, it was so boring.   It had a script of a film that I had seen a hundred times and it’s been done better before and it wasted a brilliant ensemble cast.  How you have a film with Julianne Moore and Jeff Bridges in and you don’t get a decent performance, I will never understand, and it is a sign of poor directing.  The 3D was laughable and I think actually impeded the film I was watching and the action sequences were really varied in quality.  It’s a very bland, very forgettable film and if I haven’t forgotten about most of it in a week, I will be amazed!!  I won’t be surprised if this film turns up in my worst films of 2015 list, although it is way too early to speculate on that. The ending of the film eludes to this becoming a franchise PLEASE NO!"
    },
    {
      "rating": "4",
      "text": "At the beginning, the movie seems promising. But as the movie goes, the plot become weaker and weaker.\r The CG is quite impressive. The monster seems real but:\r The plot is weak.\r Battles: Monster must roar at their face then only start attacking.\rTwice the giant bear and dragon.\r Story: How it goes on becoming more and more predictable. Useless boy + good teacher = super hero that can instant kill any bad guys\r Realistic: leader of 1000 assassin but only bring 20 at most. what happen to the other 980?"
    },
    {
      "rating": "4",
      "text": "Fantasy adventure films have always had their place amongst the realm of cinema, when I was young I loved fantasy adventure, films like: Conan, Krull, Beast Master and alike. These days though I feel as though everything that gets released in the genre are recreations of plots done to death and were done much better, sure the special effects in the 70’s and 80’s were nothing compared to what they are today but that’s what made those films so great, those little special effects. These days CGI is king and a lot of the time is so over used that it leaves nothing for our imaginations to grasp hold of.\rSeventh Son is the story of Gregory the spook (one who hunts the supernatural) and his mission to destroy the Queen of the witches Mother Malkin set in the 18 century. After trapping Malkin years pass by and she remains in prison until the threat of a new blood moon looms, Malkin escapes her prison and takes off to cause havoc and reclaim her kingdom once more. Gregory and his newest apprentice Ben; the seventh son of a seventh son set about the task of stopping Malkin and protecting the world from the devastation she plans to bring…\rSound familiar???\rIt’s a story that has been told time and time again, set in all ages and in all places but especially medieval times where this is set once again. The stand out for the film and the reason you should see it though is for Jeff Bridges (The Big Lebowski, True Grit) who plays Mater Gregory, he has created a fantastic character in Gregory, everything from his voice to his movements is exciting to hear and see. Also helping the film out is Julianne Moore (Still Alice, Mockingjay pt 1) who plays Mother Malkin, she manages to bring an over the top possibility down to Earth and even a little humble, she has done a marvelous job with her character and even though she is the “bad guy” you can’t help but root for her in some places, and that’s about all the goodness the film has to offer. The other characters are annoying, the actors should be on an Australian soap opera, they were lifeless, plain and boring, they brought nothing to the screen but a presence, and I hate to say it; but I doubt if the actors were even replaced with A list celebrities their characters would have been any different. I feel all the effort was put into Jeff and Julianne and the CGI landscape and beasties. Ben Barnes (Chronicles of Narnia, Stardust) plays the son of the seventh son Tom Ward, Alicia Vikander (Anna Karenina, A Royal Affair) plays Alice, Olivia Williams (The Sixth Scent, Rushmore) plays Mam who does bring a little something more to her character at least.\rThis is Sergey Bodrov’s first real English film he is really well known for his Russian films so I did expect a lot more from him, I have a feeling that perhaps the actors may have directed themselves in places as he sat back and took it all in. I was disappointed as I definitely expected more from the director of “Mongol” and “Nomad”. The CGI used was so extensive at times there was so much happening on the screen it was hard to make heads or tails of what was taking place, don’t get me wrong it was great, the dragon scenes in particular were legendary it was just a little messy is all. It seems to be CGI has taken over a lot of the substance a film can deliver when cheap thrills and special effects are used.\rSeventh Son isn’t worth rushing out to see, it is worth waiting to see on dvd at least but I wouldn’t be wasting my money at the cinemas. Being a fantasy adventure its appropriate for kids with only a few swears nothing they wouldn’t hear in the school yard on a daily basis anyway."
    },
    {
      "rating": "0",
      "text": "Fell Asleep..................................................................................................................................................."
    },
    {
      "rating": "0",
      "text": "Well I was not happy with this movie! The book was so amazing and clever but the movie didn't follow it he was a 12 year old boy and Alice ended up being his friend not. Girlfriend! The special effects were good but that's it!"
    },
    {
      "rating": "8",
      "text": "A fantasy adventure film needs more than \"cool creatures,\" a rousing score, and two certifiably over-the-top performances to make a lasting impression.\r Watch this movie online http://www.watchfree.to/watch-1a4eb7-Seventh-Son-movie-online-free-putlocker.html"
    },
    {
      "rating": "0",
      "text": "Seventh Son is a lot like a trainwreck. It's so bad and awful that you can't help but look at it and ponder over every little step and thing that went wrong that allowed the trainwreck to happen. Then you think about how if one thing had been different, it wouldn't have happened. That's how I feel about this \"movie.\" It's as if this movie exists solely as a form of divine punishment."
    },
    {
      "rating": "3",
      "text": "This movie is one of the most clichéd, unoriginal stories ever made in the history of cinema. An evil is going to destroy the world, but it has to wait for certain weather event to happen for its powers to be fully loaded; and there’s only one person that, for some stupid reason, can destroy it and save everything, but he needs a master because he is not yet ready to fight that evil. How many times have we seen that before? It’s just so dumb, anything you can predict that is going to happen based on previous similar films, happens; there’s no one single unexpected twist, and there’s absolutely nothing new. The script is very laughable at. They don’t even bother in explaining why the main character is so special. The only reason they give to us is because he is the seventh son of a seventh son (and another stupid reason that I don’t want to spoil), and that’s it. I don’t even know what Jeff Bridges, Julianne Moore and Djimon Hounsou were doing there, but it’s definitively bad for their curriculum.\rUntil now, one of the worst movies of 2015. The only thing I can rescue from it is a very occasional sense of humor, and some cool action scenes (some were cool, another were really stupid). Nevertheless, don’t even bother watching this film, it’s a waste of time and money.\rReal score: 3.5"
    },
    {
      "rating": "7",
      "text": "I actually really enjoyed the Movie possibly due to enjoying the book, its transferred to screen about as good as it could, i would look forward to more, there are 10 books and this Movie was Book 1"
    },
    {
      "rating": "1",
      "text": "If you were going to see Seventh Son after reading The Last Apprentice, then don't. This move has almost nothing in common with the book other than similar names. One of the worst book adaptions I've seen yet."
    },
    {
      "rating": "9",
      "text": "i loved this movie.  i have no excuse, maybe it was Jeff Bridges voice which i cannot replicate but it worked for me. i usually trust the viewer reviews more than the critics for some reason. still, i thought this was better than Jupiter ascending, which i forgot the next day. i love scifi and  fantasy and special effects. i cant say this was the greatest movie but i did just like it."
    },
    {
      "rating": "8",
      "text": "I went to see this with my two daughters, one of whom read \"The Spook's Apprentice,\" which was the basis for the movie.  All of us liked it very much, including the daughter who read the book.  In fact, she said it was the best movie she's seen in months, much better than the last two, where we made the mistake of trusting the \"professional\" critics, who rated them quite high.  I simply do not understand the bad user ratings, unless there is some attempt to appear sophisticated by aping the critics, who don't review movies with the same approach us average users do.  I make my judgements based on whether the movie justified my admission fees.  This movie did so.  The special effects were, as is so common now, flawless.  The acting was good, and the plotline explained what this user needed to know of the backstory.  I give it a solid 8 out of 10 as a good action adventure romp that provides a good release from the cares and stress of daily life.  I recommend keeping an open mind and giving this one a try.  It's sure better than \"Black Sea,\" which left me wanting to ask for a refund."
    },
    {
      "rating": "1",
      "text": "From pathetical acting to pathetical screen writing to pathetical plot, Seventh Son is truly the bottom of the barrel when it comes to fantasy films. However I will give it points for the unintentional comedy."
    },
    {
      "rating": "2",
      "text": "Seventh Son has great action scenes and A list acting. But this boring, rushed book adaptation, cannot be saved, even by Jeff Bridges at his best. Seventh Son plays out like Lord Of a The Rings meets Gladiator. Director Sergei Bodrov, mixes with his elements, for a movie, not worth watching. I thought this movie would be different, but how much can you expect from book adaptations. SS is a wasted opportunity, Bodrov's vision of the book is clunky and flawed."
    },
    {
      "rating": "4",
      "text": "Whatever potential this movie may have had was covered in excessive, repetitive and bad CG, a narrow clichéd story with completely uninteresting characters outside of Master Gregory and his apprentice (Who's name I cannot remember). I rolled my eyes so hard when the protagonist was talking about how he would \"get out of there\" and \"make something of himself\". Visions?? Really? How original, the protagonist has visions. Sigh, I know 3 of the characters names, Tusk, Mother Malkin, and Master Gregory. The rest are apparently unimportant. I left the theater with more questions than anything. Where do Gregory go after everything? Why did every witch burn away and showcase bad CG upon death? The movie wasn't all bad but there nothing really good and I laughed about twice. Only the young would find any enjoyment from this, assuming they haven't seen a million other movies with the same plot."
    },
    {
      "rating": "7",
      "text": "Its not that bad guys lol. I think the story seemed interesting and jeff bridges is awesome as the Spook. I wish Jon Snow was in the movie longer. The CGI was cool I dont think it was HORRIBLE like you guys think and the person who I saw it with liked it alot as well."
    },
    {
      "rating": "9",
      "text": "I have seen lots of fantasy movies from The Lord of the Rings to Monty Python and the Holy Grail and let me tell you Seventh Son brings on a whole new experience. This movie brings light upon a new set of fantasy. It is about a boy named Tom Ward who is chosen to aid the spook because he is the seventh son of the seventh son and on that journey he must fight creatures sent by the evil witch that wishes to gain all this power from the blood moon. First off people can not go into the movie expecting Harry Potter and Lord of the Rings this is mainly because Seventh Son is its own thing. From I have seen in other reviews they did not understand the story for some reason, but I promise if you have half a brain you would fully understand. The reason I am rating this a 9 is mainly because through out the movie there was this character that I thought annoying but besides that everything was pretty darn awesome. The effects and action scenes were awesome. Also, from what I know it is supposed to be a book series so I will be very excited to see a sequel to this film. I do not know why this movie has been trashed on and I know this one review will not stop that but I promise who ever reads this if you are on actual fan of Fantasy or Action you will enjoy this movie, and I forgot to mention that I saw this movie in IMAX and was completely amazed at how amazing the movie was with the 3D and amazing sound system. So, if you find yourself at the movies and do not really know what to watch I highly suggest this movie, I say watch it in IMAX but if you do not have the money that is completely understandable, I hope my review helps in your final decision to watching the movie."
    },
    {
      "rating": "3",
      "text": "A medieval fantasy film that is about the same quality as a Uwe Boll film. You can tell the actors know that this is nothing more than cheesy schlock as none of them give genuine performances. Jeff Bridges turns up the camp for his performance and Julianne Moore, well, she simply barely gives it any effort. They know the film is low quality and they don't really try as a result. The young actors are just kind of there, and the rest of the cast is completely unremarkable.\r The plot is generic and uninteresting. It follows the same path most movies based off of YA novels take. Our young protagonist is taken under the wing of a veteran character who trains him to be the a hero right as an old enemy resurfaces. It's got the same predictable romance between our two young leads and a painfully predictable twist surrounding the relationship of Moore and Bridges' characters. However this film has the disadvantage of feeling less fleshed out and a lot more rushed in the storytelling department. The romance also falls flat on it's face thanks to the fact that Barnes and Vikander have absolutely no chemistry. As a result the romance just seems to sort of happen. There's no sort of genuine affection between the two characters. They get together just for the sake of the film having a romance.\r The film doesn't even succeed in the action department. Battles are yawn inducing affairs.  They also look clumsily directed. That's really a complaint that can be attributed to the film as a whole. The majority of the scenes just look so goofy thanks to the shoddy work of director Sergei Bodrov. Unlike many, I also found the CGI to be cheap looking. It's a film that tries to get by on big spectacle, but fails to deliver it thanks to untalented writing and design.\r It's a failure in just about every sense. A boring film that feels rushed beyond belief. The only highlight being that there are a few jokes scattered here and there delivered by Bridges that can lead to a chuckle or two. However when the best thing about your movie are some cheesy jokes you've thrown in in order to make the film feel lighter you've pretty much failed.\r I give \"Seventh Son\" a 3.2/10."
    },
    {
      "rating": "3",
      "text": "There should be an award ceremony revoking Oscars, because some of the stars of this should be required to return theirs. Lots of fancy special effects can't save this convoluted foray into the world of fantasy and adventure. The script for this is just terrible and can't seem to decide whether its dialogue should be modern day or classical. And the direction...is non-existent. I bet Kit Herrington thought that he had made a wrong turn on his way to the set for \"Game of Thrones\" when he stumbled into this mess."
    },
    {
      "rating": "1",
      "text": "This is the kind of film you watch at home on TV for free. You play it in the background as you live tweet something else, anything. Nothing here memorable other than the dreadful, dreadful voice of Jeff Bridges -- an actor I used to adore. One of the critics suggested he has become a parody of himself. It's his voice and accent: you cannot escape them and it is almost impossible to find a character behind that sound. There is no way that this was the director's idea: this is Jeff's schitck."
    },
    {
      "rating": "6",
      "text": "I seemingly like this movie. Even though the plot is totally unoriginal, and the acting seems to be too cliched, the overall cinematographic technique is quite good, and there were moments that clicked for me. So, I still think it's a very decent movie."
    },
    {
      "rating": "2",
      "text": "What should have been the launchpad for a franchise dies on its feet with this truly terrible fantasy adventure. The seventh son of the title joins a knight in his quest to destroy an evil witch in a land of wizards and dragons. Sounds exciting but this turkey fails on almost every level, but especially in the casting of Jeff Bridges who gives the strangest performance you are likely to see this year"
    },
    {
      "rating": "7",
      "text": "I think this movie needed more character background to understand why they were doing what they did. Of course, I just don't like movies that are one fight after another. I really liked the strong good women that broke up the evil, a needed respite."
    },
    {
      "rating": "6",
      "text": "Decent fantasy epic. Good effects. Some depth. After barely watching it the first time around, the second time changed my mind. It from start to finish displays some original script writing. The effects are surprisingly good. I enjoyed it more the second time around."
    },
    {
      "rating": "5",
      "text": "It is nothing more than a Syfy movie with better effects and two Academy Award winners. Not inventive or unique in the slightest, but that is what I expected. Good enough for what it was."
    },
    {
      "rating": "4",
      "text": "For the first two thirds of the film you don't care about any of the characters.  There's just no development of any of the characters you may get the premise but the dialogue means nothing.  The final third was the most interesting and at least kept my attention.  D+"
    },
    {
      "rating": "1",
      "text": "THE.WORST.MOVIE.EVER.\rnow i gave 1 don't be fooled I'm not giving to the movie, I'm giving it to Julianne Moore and that few minutes with Kit Harrington."
    },
    {
      "rating": "4",
      "text": "\"Seventh Son\" 10 Scale Rating: 4.0 (Mediocre) ...\r The Good: Jeff Bridges and Julianne Moore try REALLY hard to carry the film ... with mixed results. Regardless, they each had a few solid scenes. Ben Barnes was saddled with a poor script and awful dialogue, but made the most of it. Some of the special effects were very good.\r The Bad: Bridges wasn't bad, but he seemed to be playing a character that we've seen him play before. His odd choice of accent and drawl was hard to ignore. Moore was also pretty good, but at times was a little too over-the-top. The rest of the cast was completely forgettable and Alicia Vikander (who played the main character's love interest) was outright terrible. She and Barnes had zero chemistry, which is something the film revolved around. While the effects were good at times, other times it comes across as cartoony and fake. Not among the worst films that I have seen, but I probably won't remember that I saw it a few weeks from now."
    },
    {
      "rating": "4",
      "text": "I can't think of anything but weak. Despite an interesting plot and an amazing Jeff Bridges, Seventh Son never connects with us for real. Tom is not likeable enough as a hero, his romance with Alice is not convincing and the end is quite disappointing. Special effects are great, we have electrifying action scenes but they aren't enough to please the audience. You can watch it and have some fun, laugh a little bit, of course, but this movie won't get your love."
    },
    {
      "rating": "5",
      "text": "The film has so many flaws. The misuse of A-list actors is disheartening, the dialogue is like that of a Saturday morning cartoon, and the accents are equal parts ridiculous and inconsistent. And it seemed as if the visuals were out of focus. Also, when someone goes flying into a pillar at 80 mph, they should be dead, or at the very least, seriously injured. Also, I wish Kit Harington was in the film longer.  Also. There isn't a whole lot of character development. The film also has some good features though. Cool CGI and great action. Cool villains, and a plot that has potential. But in the end, the film was pretty bad."
    },
    {
      "rating": "1",
      "text": "Unflowing plot, lack of introduction, no certain climax, unclear events everywhere.in the end it seems like it just strolling around.\rthe visual effects seems to be \"unfinished\" or rushed. There are still many rough effects that should be rendered smoother.\rin the end, it tastes like nothing."
    },
    {
      "rating": "3",
      "text": "It's a cliche movie and I'm pretty sure that everyone has already watched a movie like this one before: magic, witches, fantasy... the only good thing that I think about this is the visual effects, it was very good, but Seventh Son is just another fish on the fantasy and magic medieval stories ocean."
    },
    {
      "rating": "5",
      "text": "What to say about this movie... It is a good way to spend an afternoon.\rI've read the Wardstone Chronicles and has such, I know how much of the great world created by Joseph Delaney was left behind. And the full extent of the loss, represented by the Seventy Son, almost comes off has being an insult to the books.\rBut because this movie was not made to have sequels. When I went to watch it, I was already expecting a totally different world, and has such, I was able to have a good time watching this movie.\rIt's nothing that stands out, and even the brilliant performance of Jeff Bridges and the somewhat performance of Julianne Moore, the movie simply fails to achieve any meaningful height.\rSimple story, good special effects, and a somewhat unbalanced cast, could not produce more, no matter who directed and produced this movie.\rAll in all it was good, not great, not awesome. Just good.\r There was one detail above all that I loved. To see Jeff Bridges character John Gregory, live to pass on the mantle of spook to his apprentice and be able to retire, was indeed a beautiful touch. The one I'd loved to have seen at the end of the Warstone Chronicles."
    },
    {
      "rating": "4",
      "text": "Well, this movie felt like it took all the things that didn't work with films like Season of the Witch, Van Helsing, Elektra (where she fights these people who are supposed to be awesome assassins but they die super quick) , Eragon (which wasted Jeremy Irons.).  It was predictable and pointless.\r How in the world do you get acclaimed actors like Julianne Moore, Jeff Bridges and Djimon hounsou and not make a great movie?!?!"
    },
    {
      "rating": "6",
      "text": "This is a baseline for any action movie. The beginning hooks you but the plot becomes mediocre eventually. Regular viewers of any action movie will be uninterested in this but you'll get some enjoyment out of this movie. Best as just a rental."
    },
    {
      "rating": "7",
      "text": "Even if you're willing to go along for the ride, that still means taking Bridges' performance seriously. Which, believe me, isn't easy.\r Check this movie here http://www.watchfree.to/watch-1a4eb7-Seventh-Son-movie-online-free-putlocker.html"
    },
    {
      "rating": "8",
      "text": "Seventh Son wraps itself in a bland colored shroud of clichés, making you find reality much more interesting than fiction.\r Watch this movie here http://www.watchfree.to/watch-1a4eb7-Seventh-Son-movie-online-free-putlocker.html"
    }
  ]
}