{
  "id": 3845,
  "title": "Seven Psychopaths",
  "starring": [
    "Colin Farrell",
    "Sam Rockwell"
  ],
  "runtime": 110,
  "genre": [
    "Comedy",
    "Crime"
  ],
  "description": "A struggling screenwriter inadvertently becomes entangled in the Los Angeles criminal underworld after his oddball friends kidnap a gangster's beloved Shih Tzu.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cfkdwxJd1gWGmT9kI0XXYfXNLmw.jpg",
  "categories": {
    "plot": 7.32258064516129,
    "acting": 7.029411764705882,
    "ending": 7.666666666666667,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 7.025,
    "action": 4.75
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Seven Psychopaths had a clever premise, and then weaved a story within a story that was a lot of fun.  Great cast, fun premise, and while gory, the gore is done in a comedic way, so it does not gross one out."
    },
    {
      "rating": "8",
      "text": "Seven Psychopaths is one of the most interesting and funny movies of this year. The development of the movie is really smart, all the movie have funny scenes. The performances of the cast, wow are awesome. The screenplay is interesting. Seven Psychopaths is one of the most funny movies of this year."
    },
    {
      "rating": "2",
      "text": "Wow..  folks there really IS such a thing as trying too hard to be witty and original, and this movie proves it.  Yes I get the 'meta movie'.  Yes I see the real life and classic references.  But this was just super lame.  No amount of Walken could save this.  And Colin Farrell is a waste of space, as (mostly) usual.  Go back to the Phonebooth, buddy.  Some funny parts."
    },
    {
      "rating": "3",
      "text": "I really could not see all this clever or funny sparks people talk about.\rWhat movies have you been watching lately? This film had lots of money and great names but no ideas, far fetched black humour and contrived demented dialogues. It has to be really hard to protract a movie for almost 2 hours with such an utterly pointless plot.\rHollywood over-produced nonsense at its best."
    },
    {
      "rating": "6",
      "text": "Seven Psychopaths is one of those films that shows how hard it is to achieve a 'Tarantino-esque' crime- comedy-thriller.  This film is supported by a stellar cast, including Rockwell, Walken, and Harrelson, as well as having a lot of self referential bits of dialogue.  Nevertheless, the film felt aimless and smart but not as smart as it think it is.  Not bad."
    },
    {
      "rating": "7",
      "text": "This movie can get very weird at parts, but all in all a very good movie. The film kept me very entertained throughout. Oh and one more thing. Sam Rockwell is a freakin genius!"
    },
    {
      "rating": "6",
      "text": "Martin McDonagh's \"In Bruge\" was a darkly funny comedy. This new effort lacks the comic spark, but it tries real hard. A screenwriter (Colin Farrell) gets entangled with wacky crooks when his friends (Sam Rockwell & Christopher Walken) kidnap a gangster"
    },
    {
      "rating": "8",
      "text": "The title refers to the cast of the characters and to the title of the film script one of them is writing.  Therein lies the key to enjoying the film.  The characters belong in a tough realistic crime film, but they behave like intellectuals discussing the probabilities and logic of fiction.  Hence, the dialogue is a constant counterpoint between the expected cliches of gangster flicks and the arguments of a poststructuralist.  If you think there are humorous possibilities in this, you'll like the film.  If not, not.  I liked it a lot (all the actors are in the know and in the vein), but it is a bit too long.  Imagine Woody Allen remaking The Asphalt Jungle, and you've got it."
    },
    {
      "rating": "10",
      "text": "Having seen and loved \"In Bruges\" Seven Psychopaths was one of my most anticipated movies. I'm happy to say its everything I had hoped for and more. From the opening, this movie kicks off with a great start having a very Tarantino style beginning. With such an original and great screenplay you can't go wrong. We than get introduce to our seven psychopaths.   The performances are great, Colin Farrell should stick to these small roles, more specifically comedic roles, before I saw In Bruges I disliked him as an actor none of his movies appealed to me. He works so well as the lead protagonist in this role.    This is probably one of , if not the best Sam Rockwell performances. He has played this crazy character before but its more effective in this particular role. He is unpredictable, the funniest and the best psychopath of them all with out a doubt the star of this movie.    Christopher Walken is at his best. If you just enjoy him in any role, you will love him in this. He plays the calm and wise religious man but very hysterical at times another scene stealing performance. Woody Harrelson is the enraged mob boss who will literally stop at nothing until he gets his little Sh-ih Tzu back. Tom Waits plays probably the most psychotic of them all. Everyone works fantastically well in this movie. I have not a single bad thing to say about them. The woman in the cast though, are basically eye candy.    Martin McDonagh is one of the best up an coming Writer/Director. If he keeps this up one day he may be considered among the best script writers of our time. This movie does have elements of Pulp Fiction where everyone is just having random conversations that sometimes end up with people dying horrifically. Yes, there are multitudes of gore involved in the death scenes. Everything is so unpredictable with plenty of laughs and flawlessly made from both behind and in front of the camera. Seven Psychopaths is another \"best of the year\" and the funniest film I've seen so far in the year."
    },
    {
      "rating": "10",
      "text": "Great movie in every way.  Charlie Kaufman meets Terintino. It is a great combination of clever plot lines, great characters, and cartoon violence to keep you laughing on the edge if your seat."
    },
    {
      "rating": "10",
      "text": "Original."
    },
    {
      "rating": "9",
      "text": "I got a kick out of this movie! Very well-scripted, and I never could guess what was going to happen next. This movie left me with a deep sense of satisfaction, plot points that opened in the beginning found the perfect closure in the movie's climax. Martin McDonagh's generous gift to movie audiences this fall, sealed together with a pretty bow."
    },
    {
      "rating": "9",
      "text": "I think this movie will be one of my guiltly pleasures from now on. It's suble dark comedy can reach almost any audience member, unless they have no sense of humor. The characters are well developed in their own unique way. This movie really comes together at the end and gives us a look into the unexpected Hollywood format. Altogether this movie is a fun viewing!"
    },
    {
      "rating": "8",
      "text": "This picture is nothing i have watched before. This movie entertains on many levels. It asks the question about whats normal and whats not. Who are the normal people who say this man is a psychopath and this man is not? Why does the audience like movies about psychopaths at all? Do we really think they are more interesting than the people we see on the street? Are we so thirsty to see violence? Is our life so boring, that we have to see people being brutally killed? This movie shows the psychopath in your self."
    },
    {
      "rating": "8",
      "text": "Seven Psychopaths is a violent, brutally funny dark comedy that unexpectedly touched my heart. The pacing and development of the plot is excellent, the suspense is palpable, and everything about this movie is so interesting and fun to watch. The cast does a great job, and Christopher Walken gives his best performance in years. If you like In Bruges or Martin McDonagh's work, Seven Psychopaths is a must-see. The conflict between violence and non-violence is further explored in Seven Psychopaths, and I would argue, better explored."
    },
    {
      "rating": "6",
      "text": "Not without moments of intriguing social critique and compelling ventures into backstory, Seven Psychopaths meta-film elements come across as half-hearted and the ending is quite dissapointing."
    },
    {
      "rating": "10",
      "text": "What an unexpected treat! Very unconventional, off-beat, hilarious. The performances are top notch and just fun to watch. (Christopher Walken is the man! And Sam Rockwell just kills it in this movie.) Actually, it's my favorite movie of the year so far."
    },
    {
      "rating": "10",
      "text": "I don't know what movie these other people giving it negative reviews are seeing, but i saw Seven Pschopaths and it was fregen great! Amazing cast, amazing dialogue, amazing plot, amazing exectution. Need i say more? This movie made me laugh harder than any film i've seen in a long time. Woody Harrelson is just the greatest, as well as Christopher Walken. I don't even have to say more, if you love violent comedies then you'll love Seven Psychopaths, enough said. This is a must see. 10/10"
    },
    {
      "rating": "3",
      "text": "Another film that I had so much hope for but ultimately tries 2 hard and fails in many areas. They did a magnificent job casting an all-star cast but that's unfortunately the best part of the movie. The movie starts with a halfway interesting story that falls apart about an hour into the film. If you're looking for a witty action movie with an all-star cast then watch something else because there isn't a shred of intelligence and it's pacing is 2 slow to be called an action movie. If you have a brain then you already know how the movie is going to end and you're just sitting through the last boring hour to see what you know will happen. Don't believe the hype and rent this movie if you're curious before you buy."
    },
    {
      "rating": "6",
      "text": "I wanted to like this more but while it has some fun characters with a few good scenes it lacks a real cohesive plot to bring it all together. Walken is great value along with Harrelson and Rockwell gives far more to a role which I felt lacked thought. Its fun but never really grabs you. Also for a black comedy it lacks really quotable material - not a crime in itself, but something I noticed afterwards. Worth a look but dont expect too much."
    },
    {
      "rating": "2",
      "text": "This movie is indeed vicious drivel.  It is nothing like the Trailer.  Blood, guts, and gore.  I feel cheated that I was expecting a comedy and was subjected to such trash.  If you like the movie Trailer, you will not like the move."
    },
    {
      "rating": "4",
      "text": "Not funny or really interesting. I honestly fail to see what the point of this movie is. It just seems to be violent for the sake of being violent. I started off interested in the movie even though it was dull, but after a while I just stopped caring. The cast gives a great performance but the writing falls flat. It's kind of a dud and I don't recommend it. There are better ways to spend your time."
    },
    {
      "rating": "2",
      "text": "I laughed once. It was when Farrell's character proposes that the rest of his movie would just be the psychopaths talking to each other and then his friend replies  \"WTF, We're making French movies now?\". I laughed because I'm French and it is how I feel about most of my country's movies. The rest just... sucked, really really sucked. Is it my sense of humor? Or do I lack the cultural background to enjoy this comedy? The later seems unlikely since I've been in North America for over a year. Either way I didn't find this movie funny, in any way."
    },
    {
      "rating": "1",
      "text": "Im not sure the people who gave this terrible movie a good metacritic score watched the same one I did.  It felt like a budget Tarantino movie without the witty dialogue.  Art impersonating real life....didnt Colin Farrell have a real life drinking problem?  I didnt care about any of these characters and I just got the feeling that they all did this movie for the paycheck. Possibly the humor is in the dark receses of black humor...but I just didnt find this movie funny, redeeming or entertaining. Two hours of my life I will never see again...."
    },
    {
      "rating": "9",
      "text": "An unexpected delight!  Loved the writing and the performances are top notch!  Christopher Walken and Sam Rockwell are standouts,  Ends up being one of my favorite films of 2012!"
    },
    {
      "rating": "5",
      "text": "The film is not devoid of VERY funny moments and terrific acting performances (Rockwell & Walken in particular are solid), but it's just overlong, bloated, and meandering. Several of the sequences are flat-out hilarious and creative, but they're strung together far too loosely. I can't figure out if it was re-written too often or not nearly enough. And yes, for the squeamish, it's very violent and gory - things I normally go for, especially the \"Scanners\" / \"Wild at Heart\" shot. There's a right way to see this film, but I don't think the theater is it. I can imagine the Brad Pitt character in True Romance getting baked watching this on his Betamax in his cramped little West LA apartment. [Disclosure: the website I work for is owned by the same parent company as CBS Films.]"
    },
    {
      "rating": "0",
      "text": "there were 7 psycopaths but garfield was not one of them\r0/10000000000000 DONT BOTHER WATCHING"
    },
    {
      "rating": "2",
      "text": ""
    },
    {
      "rating": "5",
      "text": "Seven Psychopaths is an OK film. Compare it to In Bruges and it becomes somewhat of a disappointment. It's highly reminiscent of something Tarantino would be behind. Also, don't expect an In Bruges performance from Farell. Rockwell seemed to be the guy worth getting excited for. It's no In Bruges -- not even close -- but go see it. You'll enjoy it."
    },
    {
      "rating": "5",
      "text": "Some movies are difficult to review.  This is one of them.  The film is quirky and politically incorrect, which would normally mean I would love it.  It is supposed to be a comedy, however, and I never laughed out loud.  Not once.  There were other people in the theater that were laughing so hard I thought they would split a gut.  That's why you are going to see reviews that are all over the place.  Maybe I'm just getting old and jaded but it just didn't seem that fresh and new or funny.  The performances are good across the board.  Christopher Walken in particular is noteworthy.  The violence is graphic, so be prepared for that.  In order for me to have liked it more it would have had to be better written like the Coen Brothers film it is striving to be.  It's not in that league."
    },
    {
      "rating": "9",
      "text": "Inspiration needs to come from somewhere, this is the sort of film that we know witty yet simple in many forms, with ‘Seven Psychopaths’, we have a film within a film, sort of. A lot of it is through the vivid imagination of Marty Faranan (Colin Farrell), while the rest is true to the main plot of the film, the title comes from the screenplay that screenwriter Marty is struggling to write, he has the title at the top of the page, the same as the real film, but not much else. He ends up getting quite a bit more than he bargained for when is loose cannon of a friend, Billy (Sam Rockwell), decides to put an ad in the paper reaching out for actual psychopaths, its dry and believable approach can only come from the man behind ‘In Bruges’ and ‘The Guard’, Martin McDonagh makes films that are soaked in their own awareness and deep characters. We immediately see this in the opening scene involving two hit men clearly waiting on their target, oblivious to the man in a red mask approaching them from behind, and in turn execute them, moments like this sum up the layers of surprise and edginess of the film, yet also not taking itself seriously. In the midst of Marty writing about psychopaths, or trying to, there is a serial killer on the streets of Los Angeles, the same man we meet at the beginning, his calling card being the Jack of Diamonds, he seems like a vigilante. Billy, meanwhile, spends his days kidnapping the dogs of rich people and collecting the reward with the help of Hans (Christopher Walken). He has his own past and own problems with his wife recovering from cancer, but caught in the middle of the wrong dog to kidnap, the one of gangster Charlie Costello (Woody Harrelson). We are introduced to each psychopath as their stories are revealed, the stories being played out as imaginary or as flashbacks, many being subtle bows to previous Hollywood films that employ the same scenarios, some of the quips seem to poke fun at themselves, but it also brings out quite an interesting and even heartwarming story, Walken in particular bringing a subtle yet effective tone to his role, some of this seems improvised, which is definitely a good thing.\rThe scenes with the three leads of Farrell, Rockwell and Walken, seamlessly combine silliness with brilliance as they attempt to come up with the ending for the film, but each time the film seems to go one way, it definitely can go other to surprise us, it has comedy, cruelty and camaraderie rolled into one well scripted package, which makes for a film that has the brass and talent to back itself up."
    },
    {
      "rating": "9",
      "text": "What a crazy fun ride Martin McDonaugh's Seven Psychopaths is. The originality and creativity of it put a smile on my face that never left for 110 minutes."
    },
    {
      "rating": "9",
      "text": "Storyline: Marty (Colin Farrell) is a writer and is trying to get more idea's for a screenplay he's writing called Seven Psychopaths. His best buddy Billy (Sam Rockwell) has been giving him some great material but he has gotten everyone into some heavy duty bother with a villain called Charlie (Woody Harrelson). Billy and his friend Hans (Christopher Walken) who kidnap dogs to claim the reward end up with Charlie's dog, and Charlie really loves this dog, so now they are in serious trouble. There are a superb bunch of characters in this movie that keep us very interested throughout.\r Acting: I'm not really a Sam Rockwell fan but I've always loved his performance in 'The Green Mile' and in this he is awsome at playing the complex Billy. He is actually better in this than Bradley Cooper is in 'Silver Linings Playbook' but Bradley gets the Oscar nod. Colin Farrell was really good and played his scenes with a very similar delivery as with 'In Bruges' but this is not a bad thing because it is a Martin McDonagh film. Woody Harrelson and Christopher Walken were also good but they never had to do anything out of the ordinary so while they were great we have seen them do this stuff before. The 4 woman in this,  Abbie Cornish, Gabourey Sidibe, Helena Mattsson and Olga Kurylenko are all good actors and I've seen a lot of thier work so even though they aren't on screen much when they are you won't forget it. It was a nice touch using well known actors in small roles especially Michael Stuhlbarg and Michael Pitt at the start of the movie.\r Direction: Martin McDonagh wrote and directed this with his wicked sense of humour which I think is amazing. I enjoy his style and hope he never strays too far from it. He's had 2 out of 2 so far. Production: Martin McDonagh made this for $15 million which is the same money as 'In Bruges' but an even better cast. This was a sleek operation with decent special fx and make-up, sets, music and the script was the best thing in the movie. It was snappy, funny and inteligent. 15 mil for this cast and a killer of a script is pretty awsome if you ask me. Conclusion: This film was not perfect but I loved it can't wait for Martin McDonagh to bring out a new one. A funny and violent flik with the cast all using thier own accents (which helped).\r Score: 8.5/10"
    },
    {
      "rating": "6",
      "text": "Overall bearable. Lots of boring talking with a fair number of wild scenes. Too much talking is the problem. The trailer was completely misleading and I was a little disappointed in the end, my expectations no where near met. OK movie, giving it a miss wouldn't hurt you, good for pasting time tho."
    },
    {
      "rating": "10",
      "text": "This was a sublimely clever, seriously funny movie.  It manages to poke fun at violent movies, racism, sexism, religion, love, pet ownership, and more!!  At the end, just when it makes you wonder whether it means to be philosophical or profound, it makes fun of the viewer for expecting a neatly wrapped-up ending.  Keep watching as the credits roll!  However, if you have a short attention span or dislike black humor, you will hate this film."
    },
    {
      "rating": "4",
      "text": "An over-the-top movie (even pulp noir) should not be sloppily self-indulgent.  Parts of Seven Psychopaths feel arbitrary and thrown together, creating confusion, not art.  SP really goes off the rails in the final half hour.  I was surprised that SP was less than two hours long.  I would recommend deleting the Vietnamese character (and the rewrite of his story) and the fantasy shootout sequence.  Without this padding, I might rate SP a six, mainly for Christopher Walken."
    },
    {
      "rating": "9",
      "text": "Seven Psychopaths is an excellent non-linear film that has some great talent, and tries its hardest not to waste them: it succeeds. It's fun and entertaining, but not for those who are easily offended. The way it mocks itself and self-references other scenes in the movie is pure genius. The whole movie is one big ironic piece of cinema that has Christopher Walken, one of the many things this movie got right."
    },
    {
      "rating": "0",
      "text": "Je ne sais pas qui est ce Martin au nom imprononçable mais on dirait bien un disciple dévôt de Quentin Tarantignole et Guy Richie, les spécialistes invétérés au QI d'invertébrés des comédies adulescentes imbéciles à l'humour 'jackass\" de la tête dans le fion. Et si ce n'est pas le cas, ça y ressemble fort, si fort que ça frôle à la fois le pastiche et l'hommage, à l'insu de son ignorance éventuellement.Malgré une belle distribution, on y retrouve comme dit plus haut l'humour \"branchecouille\" absurde et outré au possible qui ferait mourir de honte les improbables boutades de Philippe Bouvard lui-même. Ainsi, cette histoire de Mafia à la recherche de leurs clébards enlevés n'arrache pas le moindre sourire ni le plus petit rictus ; par contre, on lève les yeux au plafond et on souffle, on souffle longuement pour s'aérer le cerveau en souffrance.Voilà donc une kikoololerie très symptomatique de la génération Fèces-Bouc qui contamine le cinéma à très grande vitesse... même si, on le sait, les films imbéciles ne datent pas d'hier !"
    },
    {
      "rating": "7",
      "text": "Seven Psychopaths is a lot of fun, even if it is decidedly incoherent and pointless.  The entire cast has a blast riffing ton crime film cliches and winking self referentially at the proceedings.  Bonus points for the inclusion of Tom Waits who deserves his very own psychopath movie."
    },
    {
      "rating": "5",
      "text": "Not necessarily a great film but interesting different and watchable. Decent acting just strange plot linking, it's like it's a movie that knows  it's a movie."
    },
    {
      "rating": "9",
      "text": "IGNORE BAD REVIEWS! Yes there's no doubt any movie loving person has high hopes for this film pre watching but it delivers in a striking fashion. Whether it's laughs or sick revolting violence you crave SP delivers at every turn. The plot may be riddled with certain cliches but never the less the story hooks you and evokes every passion from the viewer from painful laughs to shocks that result in goosebumps to holding in tears. Every character's profile is revealed in a fascinating fashion and in fact (while not going crazy) the plot and humor is similar to The Big Lebowski!!!"
    },
    {
      "rating": "7",
      "text": "“A person suffering from chronic mental disorder with abnormal or violent social behaviour.” That’s the definition of the word of psychopath from Oxford Dictionary. Thiz movie comes from the Directors of “In Bruges” (2008) Martin McDonagh. McDonagh is the kind of Director who can make an effective black comedy with roller coaster storyline and interesting characters. He also shows promising signs of becoming one of the cult movie Directors. The story revolves around a psychopathic screenwriter (Colin Farrell) whose seemingly nice girlfriend is a psychopath (Abbie Cornish), makes friends with a psychopathic dog kidnapper (Sam Rockwell) and his psychopathic assistant (Christopher Walken) who unfortunately stole a shih tzu which belongs to a psychopathic gangster (Woody Harrelson) whose unfaithful girlfriend is also a psychopath (Olga Kurylenko). Meanwhile it’s also about a mysterious psychopath (Tom Waits) who carries a white bunny all the time. Well, I just used the word “psychopath” so many times. If you feel confused, it may be true. The first 30 minutes of the movie will probably make you confused. If you feel it’s kind of weird, yes, the movie is very weird and comedic as well. The dialogue is interesting and alive. Everything just flows to the right direction. And I almost feel like there is a time when thiz movie criticizes itself. The three main characters are amazing. Let’s start with Colin Farrell. Farrell depicts an alcoholic screenwriter who looks like a peace lover but sometimes looks more like a coward in many situations. It’s great to see Colin Farrell can bring a different kind of character. And the next one is Sam Rockwell who rocks pretty well. Rockwell’s character is the one who sets fire in thiz field of gasoline. He looks confident and believable. People can hate his character but surely will love his performance. Personally, Sam Rockwell’s performance is the best performance in thiz movie. Last but not least, it’s Christopher Walken. Walken goes back to his roots, bringing an eccentric character, it simply reminds me what he is good at, just like the old times when he triumphed in “True Romance” (1993), “Last Man Standing” (1996) or “Kill the Irishman” (2011). Thiz movie just made me realize that all thiz time, most of my favorite movies has psychopathic characters in them, such as “Pulp Fiction” (1994), “Fight Club” (1999), “Trainspotting” (1996), “True Romance” (1993), “Natural Born Killers” (1994) and many more. Just because we like movies about psychopaths doesn’t mean we are also psychopaths, right? Or are we?\r Visit My Blog on JONNY'S MOVEE  http://jonnyfendi.blogspot.com"
    },
    {
      "rating": "10",
      "text": "Like a modern day Roald Doahl, Martin McDonagh celebrates the darker side of human nature. 7 psychs is adazzlingly funny and poignant movie, full of gallows humour with numerous deft diversions and several wonderful vignettes- the parallel writers block story is sublime. I enjoyed this even better than In Bruges -  a classic black comedy which rewards repeat viewing. McDonagh's dialogue as usual is snappy and multilayered. The credits twist is one of the most satisfying ever. Do yourself a favour and check out all his movies and plays."
    },
    {
      "rating": "7",
      "text": "Seven Psychopaths delivers weird but fun experience. It was remind me bit experience when was watching Cabin In The Woods. Movie writing at its best? You can name it but it wasn't really work to me."
    },
    {
      "rating": "9",
      "text": "This movie was unlike any movie that fit into this genre I've seen before. Didn't really have any idea what happens next. Colin Farrell was brilliant. Walken will never get old. Another excellent job from Rockwell as well! Also good to see Harrelson back in front of the camera again. Of course, let's not forget about Tom Waits, you could put him in a movie with a piece of  and he would turn it into acting gold!"
    },
    {
      "rating": "6",
      "text": "This is a fairly entertaining crime-comedy with some great writing though inconsistent."
    },
    {
      "rating": "9",
      "text": "Great, GREAT movie. What good pop culture should be. It's accessible to the masses but presents an interesting discussion about our existential journeys as people, good in the face of evil, obsessive love, and, above all, fate. The cast is incredible, the dialogue is great and at times hilarious. It was definitely far more than I expected. Everything about it was strong but the pacing faltered once or twice. A negligible criticism to an otherwise stellar production."
    },
    {
      "rating": "7",
      "text": "Seven Psychopaths was a very interesting movie and truly unique. The cast was absolutely fantastic. Colin Farrell is a very underrated actor but Sam Rockwell, Christopher Walken, and Woody Harrelson really made this movie worth watching. Rockwell was hilarious. The movie did drag quite so that's the main reason for the lower rating. I don't think this is a film everyone will enjoy, however. There's a substantial amount of vulgarity and violence so some people will certainly be put off by that."
    },
    {
      "rating": "7",
      "text": "Another exciting turn for Martin McDonagh.... and yes, this one has it all. Near constant bombastic violence and plenty of laughs. Seven Psychopaths is a movie for writers and you'll see why."
    },
    {
      "rating": "6",
      "text": "Seven Psychopaths has got to be one of year"
    }
  ]
}