{
  "id": 3551,
  "title": "Seven Pounds",
  "starring": [
    "Will Smith",
    "Rosario Dawson"
  ],
  "runtime": 123,
  "genre": [
    "Drama"
  ],
  "description": "An IRS agent with a fateful secret embarks on an extraordinary journey of redemption by forever changing the lives of seven strangers.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pCVpsCEYtvtlg1I9h3rtglKgThu.jpg",
  "categories": {
    "plot": 6.533333333333333,
    "acting": 6.0,
    "ending": 7.333333333333333,
    "soundtrack": 2.0,
    "cinematography": 5.0,
    "familyFriendly": 1.0,
    "funny": 1.5,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "At the end of the movie I was glad that I spent my time watching it.Good performance by Will Smith.It could use some better editing,some scenes were too long without reason.It managed to bring tears to my eyes and that is a huge factor that it got an 8 from me.I strongly suggest it to those who have not watched it yet."
    },
    {
      "rating": "1",
      "text": "Absurd, wretched film. Really: If a man were that shattered about a car accident he caused, and hated himself that much (enough to torture himself with bone marrow donation without anesthetic, and suicide by one of the most agonizing ways to die), why would he also feel that he had the moral authority to determine who \"deserves\" his body parts? Flawed and a little icky. I felt like I'd watched some kind of snuff porn. Blech. Also: does anyone actually think Rosario Dawson is any good? She's a blank slate in everything I see her in. Pretty, yes. Pretty boring!"
    },
    {
      "rating": "2",
      "text": "Well, i couldn't agree more, that this movie is way too long. Drama? Hahahaha, you must be kidding. I was really disappointed, I've wasted 2 hours of my precious lifetime to watch that pathetic movie. I watched this movie just because everyone was saying ''oooh, a great movie, you must see it''. Anything happens."
    },
    {
      "rating": "0",
      "text": "This movie was a pathetic attempt to engage your sympathies as you watched a disjointed rendition of a woeful tale about a man who wants to give up 7 pounds of his toxically poisoned flesh to deserving recipients. What a load of BS!"
    },
    {
      "rating": "1",
      "text": "Manipulative uber-drama that would play better as an arc from a TV series. Is it supposed to be a surprise ending? If so why do they reveal it 5 minutes into the movie?"
    },
    {
      "rating": "3",
      "text": "I am a Will Smith fan through and through, but this movie does not work at all. Mr. Smith appears to be angling for an awards nod, since he is, in every scene, welling up with some emotion (mainly tears he appears to be fighting to hold back). The film is a one-trick pony that is simply frustrating after the trick is figured out-- which, honestly, is about 30 seconds into the film. Will Smith is great actor to watch, but he and this threadbare concept movie are simply trying too hard to be \"significant.\" Maybe its time to attack a story with meat on its bones or do an outright comedy to exhibit your ample charm again, Mr. Smith. Leave the over-emotional melodrama to the daytime TV guys and gals."
    },
    {
      "rating": "3",
      "text": "Will Smith's quest for an Oscar will never be fulfilled with sentimental drivel like Seven Pounds, an unbelievably bad movie that's 80% close-ups of Mr. Smith's anguished face and the line \"I can't tell you.\" Do me a favor Will - don't make a sequel for this turkey - Hancock II will be pushing your luck as it is!"
    },
    {
      "rating": "3",
      "text": "wayyy too predictable. Would have been better if i didn't figure out the whole ending 40 minutes into the movie, but I spent the next 80 minutes just waiting for it to be over."
    },
    {
      "rating": "0",
      "text": "Will is the silver screens Golden Boy as he is a money maker who can do no wrong. One more turkey like this and he can kiss his image goodbye. Just dreadful. Hancock was bad but this is ten times worse. Who is selecting his films?"
    },
    {
      "rating": "1",
      "text": "No crdibility, contrived plot, terrible acting, stilted dialogue. Will Smith had 2 forms of acting in this: worried brow and fake smile."
    },
    {
      "rating": "3",
      "text": "This movie is Chicken Soup for the Soul \"on steroids\". Nice storyline but then gets crazy by the ending."
    },
    {
      "rating": "2",
      "text": "Wow - what a downer! Did not enjoy this at all. Poking myself in the eye with a sharp stick would have been more fun. Sorry Will."
    },
    {
      "rating": "1",
      "text": "This movie was very disconnected, depressing and outright creepy!"
    },
    {
      "rating": "1",
      "text": "Ok----WOW! Generally, I don"
    },
    {
      "rating": "1",
      "text": "Pretty bad. Why does Will Smith pick such terrible scripts? This might be the worst yet."
    },
    {
      "rating": "1",
      "text": "What the heck was Oprah thinking?! I feel DUPED! This movie was so bad I could have gnawed off my arm. There was NOTHING redeeming about it. Its only message: Don't text and drive. Shame on you, Oprah, for stumping for your friends (Will Smith) dishonestly."
    },
    {
      "rating": "1",
      "text": "Ridiculous."
    },
    {
      "rating": "2",
      "text": "Boring and Slow with an awlful music score."
    },
    {
      "rating": "2",
      "text": "Will Smith is a great actor, unfortunately he is pathetic in Seven Pounds. The movie is terrible... the only good thing is the soundtrack. Buy the soundtrack, don't waste money to see this movie."
    },
    {
      "rating": "4",
      "text": "Way way way too long, some major editing would have prevented the stretches of boredom. Too slow moving. It's very sincere, but it also fails to convince. The acting is stiff and lacking enthusiasm. Good score."
    },
    {
      "rating": "0",
      "text": "This movie is a piece of cinematic crap. Its funny to see Will Smith is \"serious actor mode\" acting like he's getting an oscar. Haha. This movie is just absurd and so stupid. DO NOT see this movie, it will be a big waste of your time and money."
    },
    {
      "rating": "2",
      "text": "Messy and overlong! could have been a good movie..."
    },
    {
      "rating": "2",
      "text": "I went into this movie wanting it to be amazing, but unfortunately it was the complete opposite. Will Smith and Rosario Dawson gave wonderful performances, but the movie took way too long for anything to happen. Seven Pounds was a \"2 hour don't text and drive commercial\"."
    },
    {
      "rating": "2",
      "text": "Seven Pounds has the most predictable plot. Yes, i did give the movie a chance, i wanted to see seven pounds become a phenomen. I wanted to see what the director was thriving for, what he wanted to bring to the film, instead seven pounds delievered a wasted movie. It's sad, but true to say that some movies aren't as good as they sound. I think they were also trying to hard to make it a superior film, instead of following the natural flow, and unpredictable story; it turned out to be a predictable movie, that had no secrets."
    },
    {
      "rating": "0",
      "text": "This movie starts with a suicide, then slowly tells the story of what happened leading up to that.  If that's your sort of story, enjoy.  If you're depressed or you want to avoid getting depressed, avoid this movie.I can't help but wonder how many people actually committed suicide after watching this movie."
    },
    {
      "rating": "4",
      "text": "Well, I'll keep it brief as even thinking about this movie makes me depressed. The whole story was pretty far-fetched and it was just too depressing. Although it is a dark film I think that making every scene as depressing as the last was just too much for any normal person to bear. Ben Thomas is a **** protagonist as he is basically a douche. The writers could have made him a really good character but in the end they just made him hateful and bitter, meaning that we don't care about his problems. I understand that he has to be depressing to a certain level but this was unbearable. The 4 that I gave was for Will Smith's acting and an almost convincing death scene. ----By the way, the whole box jellyfish thing was stupid. It was put in the film because he thought they were beautiful as a child. Not the best of references. Why not use a shotgun or jump of a cliff? His house was near the sea! Why not take a plunge instead of using the most ridiculous means of suicide in movie history?"
    },
    {
      "rating": "10",
      "text": "well i would like to have as much of inteligence as you guys have. all of those who said it was way too predictable. Will Smith was awesome in this movie as well as Woody Harrelson and Rosario is adorable! It was certainly better than the Changeling and almost as good as the Green Mile. There are not many movies i am willing to see more times but i have seen this one three times already!"
    },
    {
      "rating": "8",
      "text": "Engrossing tale of redemption which works well IF you don't read the plot spoilers. Half the appeal is trying to figure out Ben's (Smith's) purposes. If you know the before you go in it's akin to knowing the murderer in a whodunit. Experience the movie how it's meant to be and you'll enjoy it."
    },
    {
      "rating": "3",
      "text": "Wow, one of the most boring movies I have ever watched. I never fall asleep during movie and this is one of the ones I almost did. I am not a big Will Smith fan and he wasn't good in this movie at all one of his least best performances. The only reason that it gets a 3 from me is because there were a couple good acting performance but that is it. Bad story and really boring."
    },
    {
      "rating": "10",
      "text": "There is no reason for this movie to be rated so poorly. I think that the main reason for this is because of slowly everything plays out, and how little the viewer knows even half way through the film. I find movies more interesting when you have to find out what is happening and I don't want everything to be so straight forward. I found the acting to be brilliant, the story to be played out well, and the movie to be intriguing and emotional as well. I would recommend it to anyone!"
    },
    {
      "rating": "8",
      "text": "Nice Emotional piece. Great performances by Will Smith and Rosario Dawson. Same Director as The Pursuit of Happyness. Gabriele Muccino. Sometimes I think critics pan movies if they are not shot in Italy and about a bicycle."
    },
    {
      "rating": "10",
      "text": "I don't get the most acclaimed critics... I am very cinical when it comes to movies and I hate bla bla love bla bla romance. BUT... this is not about it. This is WAY beyound our idea of a movie about love and romance. Maybe that's why there are these terrible reviews - in a world full of copied.past scripts and never-ending possibilities with new technology, thus creating virtual (alternative) realities, I think people are losing the real sense of A movie. I can relate so much about it... It is NOT a film without grip of reality - I LIVE a reality very near to this one and it really blew my mind. Of course the movie is \"elongated\". You have to feel it - unlike other common movies about an alien adventure where you except frames to fly around like crazy. The critics MUST take a break from this technology-based imagery we're living in so that we can appreciate, again, the beauty of thinking and living - experiencing. One of my favorite movies ever - and I don't remember a single one I like with feelings of courage or redemption or whatever. The casting is great and Oh Boy Will Smith gives it all. WELL DONE"
    },
    {
      "rating": "10",
      "text": "It was a beatiful movie how can you not like this movie, it deserves a better rep than this."
    },
    {
      "rating": "9",
      "text": "I am not too sure why this movie received such bad reviews but I thought it was very beautiful, powerful indeed. Loaded with emotion, intensity and a superb cast. What's a matter here?"
    },
    {
      "rating": "7",
      "text": "This movie was much better than I thought it was going to be based on reviews. The previews made it look good, but media reviews were lackluster. I was pleasantly surprised with this film, though there were no real surprises at all. While they could have picked up the pace a bit, and given a little more attention to some of the other characters (other than Rosario Dawson), I still thought this was a decent film."
    },
    {
      "rating": "10",
      "text": "The movie was excellent. A lot of sentiments. Will Smith is an excellent actor. This is a very sad movie showing a lot of love. I cannot understand how this movie get such a bad rating ! I loved it."
    },
    {
      "rating": "8",
      "text": "I don't know what the critics expected from this film, but it seems against all logic that dozens of reputable writers just didn't get it. This is not a film about generosity or altruism, it's a film about a desperate struggle for redemption. It's dark and difficult, but ultimately rewarding."
    },
    {
      "rating": "6",
      "text": "overall great plot, but took to long to get to point.did not put pieces to the moving to the end, literally."
    },
    {
      "rating": "7",
      "text": "This movie is not as bad as it seems to get rated. I would still watch it again."
    },
    {
      "rating": "10",
      "text": "one of the best films that I have seen in a long time"
    },
    {
      "rating": "8",
      "text": "I am pretty critical of movies and thought this movie was very provocative and interesting. Will Smith did a great job of playing a convincingly tortured man on a mission...I had no idea what this movie was about before I rented it, maybe that's the key (to either loving it or hating it) but IMHO it was excellent and unique."
    },
    {
      "rating": "10",
      "text": "The title \"Seven Pounds\" refers to the Shakespearean pound-of-flesh metaphor, meaning a figurative debt that needs to be paid back (the death of seven people in a car crash). I loved this movie... highly recommend it for something who is truly a \"good person\" and can use their brain to actually watch the movie."
    },
    {
      "rating": "7",
      "text": "With a confusing, drivel and depressing tone, Seven Pounds does a good job of playing with the strings of your heart while rattling your brain with plot holes big enough to drive a semi through. The performances of the main cast, especially Will Smith make this movie enjoyable."
    },
    {
      "rating": "9",
      "text": "I see hundreds of movies each year but I can't recall the last time a film has moved me to tears. All of the performances were stunning."
    },
    {
      "rating": "10",
      "text": "The most breathtaking, intense and mindnumbing drama i've seen ever. The screenplay, the script, everything brought to perfection in what i would say, the best drama movie of this decade. Do not, i repeat, do not care about what the critics say, they are always in opposition with the usual, amateur eye."
    },
    {
      "rating": "9",
      "text": "I actually found it quite entertaining, and solemnly profound. A lot of people will say it is manipulative because of what it boils down to at its conclusion, but I would argue the acts considered \"manipulative\" by some are indeed powerful works. Ask yourself, would YOU do something like that for someone else. If it takes you longer than it takes to read this comment to answer, then I can understand why you wouldn't like this movie."
    },
    {
      "rating": "9",
      "text": "I don't know how people who watched this movie can give it a bad rating. It is probably the best movie in recent years (have I ever seen a better one?). Yes, the story may seem far-fetched, but it is told in such an incredible manner, that you won't know until the end. My girlfriend was crying a lot during the second half of the movie, and I was trying hard to keep my tears from flowing and comfort her. Will Smith and, especially Rosario Dawson, are just amazing to watch, but that's not the main point. I am no Will Smith fan, but after seeing this movie I have to admit he is a great actor. The main point is idea of this movie, that is only fully revealed in the end (if you're good at guessing movie plots, you might know around the middle, not earlier). Amazing, amazing, amazing! A movie about the human spirit and the infirmity of life."
    },
    {
      "rating": "8",
      "text": "Intense emotions. beautiful and moving climax. will smith's acting is excellent."
    },
    {
      "rating": "10",
      "text": "Absolutely emotional and gives us the opening to see life and how Will Smith in his Ben Thomas charactor looks at it. Good way to express emotions and thoughts to rest of the world."
    },
    {
      "rating": "10",
      "text": "This movie was excellent!!! The story line was intriguing and plot was phenomenal. I enjoying making attempts to solve the ending and purpose of a film before it is over, but I had noway of knowing the ending in this movie. However, when it was finally revealed I was blown away. Many of the reviews given concerning this movie are way off in my opinion. If you like blood, gore, shoot 'em ups, and special effect movies then your rating my be like all the others. However, there are still many of us out there who like to \"think\" when watching a film and actually get into the twists that the writer and director are striving to provide."
    }
  ]
}