{
  "id": 4582,
  "title": "Seven Years in Tibet",
  "starring": [
    "Brad Pitt",
    "Jamyang Jamtsho Wangchuk"
  ],
  "runtime": 136,
  "genre": [
    "Adventure",
    "Drama",
    "History"
  ],
  "description": "Austrian mountaineer, Heinrich Harrer journeys to the Himalayas without his family to head an expedition in 1939. But when World War II breaks out, the arrogant Harrer falls into Allied forces' hands as a prisoner of war. He escapes with a fellow detainee and makes his way to Llaso, Tibet, where he meets the 14-year-old Dalai Lama, whose friendship ultimately transforms his outlook on life.",
  "releaseYear": "1997",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AwAlbBjAf6K0aX8PPyhTUB1S3X7.jpg",
  "categories": {
    "plot": 7.181818181818182,
    "acting": 7.333333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 5.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "A pretty underrated piece, this is one of Pitt's most underappreciated films, great storytelling and amazing acting.We follow the characters in their journey in this great  7 year epic."
    },
    {
      "rating": "7",
      "text": "Seven years in Tibet is the incredible true story of Heinrich Harrer, an austrian mountain-climber that accepted some nazi's money, in 1939, to hammer a flag on the top of a himalaya mountain. But the war is declared and he's being kept in prison until he makes his way out with a convicted fellow. There begin his journey through the himalaya until Lhasa,the capital of Tibet. He meets the Dalai-Lama and the movie is about this friendship. It's a really beautiful story about discovering new cultures, new ways of thinking. It's about hospitality and trust in human ressources to be united. Although I would say that it's now really romanticized, it's still one of these movies that will make you feel good if you like to travel."
    },
    {
      "rating": "10",
      "text": "One of the best movies of the 90s the acting, writing and the pure feeling of adventure. This is a must see for travelers and explorers, for people who don't explore the world this might not be their cup of tea. Its a movie to sit back and in joy, and not to take so serious it's political history."
    },
    {
      "rating": "10",
      "text": "This was a beautiful movie, worth watching for the photography alone.  It captured an essence of traveling the world and being transformed by it.  The Brad Pitt character made a subtle transformation from being a hard charge Nazi type to a mellow patient guy, with the fall of Tibet as a backdrop.  I felt enriched by this movie.  I was not aware 1 million Tibetans were killed in the religious cleansing by China, that is a bummer."
    },
    {
      "rating": "10",
      "text": "While there is some time that it feels more of like Kundun movie rather than Heinrich, the rest of Seven Years In Tibet is stunning, powerful, and incredible."
    },
    {
      "rating": "6",
      "text": "Lovely cinematography and costumes for this period piece. But clunky dialog and a terrible Austrian accent by Brad Pitt decreases enthusiasm."
    },
    {
      "rating": "6",
      "text": "The movie is too long in my view. Some of the characters are written also too simple. The pictures are beautiful though with many details."
    },
    {
      "rating": "9",
      "text": "Brad Pitt is amazing in Seven Years in Tibet. This movie is a 1990s classic and should be watched if you want to learn about interesting events that actually happened during a tough time for the world. Very underrated!"
    },
    {
      "rating": "8",
      "text": "Based on the memoirs of Heinrich Harrer, narrating the failed ascension to Nanda Parbat, his capture as a prisoner of war and the events that led him to meet the future Dalai Lama, an experience that would change their lives, each other. It could have been a little better off not focusing more than it should on the Maoist occupation of Tibet. Still, it is worth the effort to see, especially if you are a fan of Brad Pitt."
    },
    {
      "rating": "7",
      "text": "Seven Years in Tibet is an excellent biographical film. Great cast and great real story. A unique film, because so few films about climbers, even less about Tibet."
    },
    {
      "rating": "6",
      "text": "Une belle histoire que cet impétueux et orgueilleux alpiniste autrichien qui finit par trouver en une période troublée une certaine forme de sagesse auprès du Dalaï-Lama avant de retourner chez lui après tant d'années. C'est aussi l'occasion de revenir sur l'invasion du Tibet par la vermine communiste, l'une des nombreuses hontes du 20ème siècle.L'occasion également de se laisser aller dans une guimauve excessive de la part de Jean-Jacques Annaud avec en prime -on s'en serait passé- quelques longueurs dans le récit. Brad Pitt n'est clairement pas à la hauteur et mine sensiblement le film qui n'en demandait pas tant. Malgré ces aléas, le réalisateur français dispense une mise en scène pleine de dignité, de grandeur et d'éloquence... et les acteurs (à part Brad Pitt) sont excellents."
    },
    {
      "rating": "7",
      "text": "This film follows the course of the German climber Heinrich Harrer, who travels to Tibet in order to climb a mountain. The failure of the attempt and the outbreak of World War II takes him to a prison camp (India was a British colony), from where he manages to flee to Tibet, a neutral country outside of English jurisdiction but very averse to visits from foreigners . However, he is able to enter and settle in the capital, where he meets the young Dalai Lama and helps in his education. Thus begins a great friendship between the two, portrayed in a touching way. The plot has a strong story behind it and is truly interesting, with well-developed moral and historical backgrounds, though it does not focus much on the historical facts but rather on the protagonist's personal connection with what happened there. I felt that the Chinese invasion was almost a footnote in the film, and the movie ended up losing with that absence. Brad Pitt gave life to the protagonist and, despite a reasonable performance, was not totally happy with his character. It seems that he has never really been in the shoes of the climber he plays. David Thewlis had more capacity for his character but, being a secondary character, there was little for the actor. One never comes to understand whether Harrer is a sympathizer of Nazi ideas or whether he was merely a victim of events, like so many Germans who suffered from World War II and who have never reviewed the ideas of the regime. The film explores the whole Tibetan ambiance very well, with its impressive scenery and scenery. Although the film fails to create a mountain epic with an emotive background, it is good enough to merit our attention and does a good job showing a little of what Tibet has been in the past. I'm even surprised that this film has not been nominated for a single Oscar, but maybe political reasons have silenced the Academy."
    },
    {
      "rating": "7",
      "text": "This movie is a case of something important that's just not that well communicated. I was genuinely intrigued by the story of Heinrich Harrer who gets captured by the British in the Himalayas during World War 2, escapes his imprisonment and wanders through Tibet in search for a way home. Still, the story somehow often emphasizes the wrong things, the rivalry between Heinrich and his colleague, for example, or the whole theological business once they arrive in Lhasa and meet the Dalai Lama, all while stuff like the actual War going on or the annexation of Tibet by the Chinese communists is handled in, like, 30 minutes.Nevertheless, this is an important movie, with some beautiful moments at that."
    },
    {
      "rating": "7",
      "text": "Two good actors and a myriad of others in a thoroughly enjoyable film. It is a tad slow though."
    },
    {
      "rating": "7",
      "text": "At first, I thought I was in for a Hollywood slog of a film where it was going to just go \"through the motions\". To my pleasant surprise, I ended up caring for the characters and enjoying the details that can be found in this version of Tibet. Some scenes need to be cut out, but give it some time and the film may be worth your investment."
    }
  ],
  "recommendations": [
    "the_pianist",
    "free_state_of_jones",
    "the_lost_city_of_z",
    "frantz",
    "the_imitation_game",
    "nomadland",
    "a_united_kingdom",
    "race",
    "dances_with_wolves",
    "hostiles",
    "the_33",
    "the_last_duel",
    "cold_mountain",
    "the_eagle",
    "the_white_tiger",
    "the_way_back",
    "12_years_a_slave",
    "the_last_king_of_scotland",
    "darkest_hour",
    "empire_of_the_sun",
    "gone_with_the_wind",
    "allied",
    "agora",
    "the_last_samurai",
    "first_they_killed_my_father"
  ]
}