{
  "id": 378,
  "title": "Sex Tape",
  "starring": [
    "Cameron Diaz",
    "Jason Segel"
  ],
  "runtime": 97,
  "genre": [
    "Comedy"
  ],
  "description": "When Jay and Annie first got together, their romantic connection was intense – but ten years and two kids later, the flame of their love needs a spark.  To kick things up a notch, they decide – why not? – to make a video of themselves trying out every position in The Joy of Sex in one marathon three-hour session.  It seems like a great idea – until they discover that their most private video is no longer private.  With their reputations on the line, they know they’re just one click away from being laid bare to the world... but as their race to reclaim their video leads to a night they'll never forget, they'll find that their video will expose even more than they bargained for.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/u2h7UnSHrbAA5WBoKhdH1rlDZfz.jpg",
  "categories": {
    "plot": 2.3846153846153846,
    "acting": 1.6666666666666667,
    "ending": 2.3333333333333335,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 2.3333333333333335,
    "funny": 3.925925925925926,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "\"Sex Tape\" 10 Scale Rating: 1.5 (Awful) ...\r The Good: While it was a small role, Rob Lowe was actually funny. Rob Corddry was pretty entertaining as well.\r The Bad: While the premise is not a bad one and had the potential to be a hilarious film, \"Sex Tape\" squanders a great setup and wasn't even remotely funny.  In fact, I don't think I even chuckled or smirked once. Cameron Diaz was especially awful and ruins entire scenes all on her own. Jason Segel tried really hard to make this an entertaining film, but perhaps tries TOO hard as most of his jokes fall flat. A woefully inadequate attempt at a raunchy comedy."
    },
    {
      "rating": "4",
      "text": "\"Sex Tape\" é engraçado e mau ao mesmo tempo. Cameron Diaz não deu o seu melhor, no entanto, Jason Segel fez-me gostar um pouco mais do filme.4/10"
    },
    {
      "rating": "2",
      "text": "It's ridiculously raunchy and dirty, and at the same time it's also painfully cringe-inducing and unfunny. Cameron Diaz and Jason Segel try far too hard in this film and a majority of the gags fall flat on their face. And at the film's halfway mark, it becomes surprisingly boring. A few mildly amusing one-liners as well as a random, pointless five-minute cameo from Jack Black couldn't even save this one. Easily the worst comedy I've seen all year."
    },
    {
      "rating": "1",
      "text": "It had become very apparent to me early on during my viewing of “Sex Tape” that Cameron Diaz, and Jason Siegel were going to have remarkable on screen chemistry. Then the unthinkable happened, the first five minutes ended. Where to begin? is a question that is never asked in the treacherous debacle that is “Sex Tape”. A bland attempt at a lude-and raunchy R rated comedy, that is not only poorly scripted, but severely unfunny in all the wrong ways.\rThe film follows the early sex lives of one Jay (Siegel) and Annie (Diaz), we (the audience) know nothing about the couple at first. just that they love having sex. (As showcased within the films first hefty five minute montage - these scenes alone earned the hard R rating). Fast forward a few years -- and they have a couple kids, and are happily married. Annie is on the verge of the biggest breakthrough of her career (selling her blog to a huge branding company) headed by a douchey, crazy, and creepy Rob Lowe. While Jay is a successful songwriter, and musician. Between the jobs and the children sex is hardly ever an option. However, on a brink night to celebrate Annie’s new job. In a last ditch effort to restore some flair and originality into their sex lives...the couple inadvertently make a three hour long escapade. Thinking all was free and clear, their sex tape accidently leaks into the cloud and becomes available to all their closest friends and family. This results in a wild goose chase to “erase” all the evidence before it’s too late.\r “Sex Tape” is by far one of the more intriguing premises this year has to offer. I mean ask yourself..”if you made a sex tape?” would you want your mom seeing it? heavens no. So my props go to Jake Kasdan and Jason Siegel for making a cool premise, That is, of course, the extent of my appreciation. From then on the movie wallows in self pity, and never takes off from the standard set. At one point Diaz character says “the quality of writing in porn has really gone down these days”. I immediately thought to myself “and so has this movie” ..this was a whopping twenty minutes into the film, where I knew there was no going back.\r With most films that start off poorly you keep gesturing to your inner self “it’s going to get better, stick with it” and besides from a fun cameo towards the end of the fIlm (I won’t reveal who) “Sex Tape” is just moronic and plain boring. Picture an hour and forty minute long trailer..except with no humor, no jokes, and not a sensible care in the world. The film co-stars Rob Lowe in his worst performance..to date. In comparison..when you look at earlier films this year “Blended” for example, was a film that knew its boundaries, and it didn’t try to be better than it was. “Sex Tape” think’s it’s funny, and keeps mustering up the same lame one-liners that just leave you sitting in your seat checking your watch constantly wondering where the film is going. I was not a big fan of Kasdan and companies last film “Bad Teacher” I thought the bawdy humor didn’t mesh well with the plot at hand. I suppose the same goes “Sex Tape” in a sense. Not to mention this film has the most absurd amount of product placement I have ever seen. Ok..we get it..you like Apple products. Give me a break!.\r “Sex Tape” is a film that comes on strong..and then surprisingly pushes you away. There are some moments where I laughed (preferably the aforementioned cameo). Sloppy characters, and even sloppier jokes (Even by R rated standards). Siegel belting out his lines in a high pitched squeal doesn’t help either. I admire the passion and devotion our two leads have to this film. (Diaz especially) However, as with most films with a intricate premise. “Sex Tape” is the latest addition to take something cool, and make it dull and lifeless.\r D-\r By: Nate Adams\r Directed By: Jake Kasdan\r Rated: R\rRuntime: 100 mins\rStudio: Sony\rRelease Date: July 18th 2014\r Thanks For Stopping By ®"
    },
    {
      "rating": "4",
      "text": "Cameron Diaz & Jason Segel play a married couple who decide to spice up their sex life by recording it. Needless to say, it gets out of their hands, which is supposed to cause a zany time. As a screen couple, Diaz provides the hot and Segel handles the comedy. Unfortunately, the majority of the movie is spent with them in mediocre banter and their chemistry isn't special. The attempts at madcap situations are overblown and silly. Despite the efforts at outrageous humor and enuff F-bombs to make Tarantino blush, most of the gags fall flaccid (pun intended). The upbeat energy keeps it moving, but the genuine laffs are overclouded by everyone trying too hard (pun also intended)."
    },
    {
      "rating": "0",
      "text": "If a movie is crude and offensive the least that can be expected is that it is also funny and well written. Sex Tape is neither. The holes in the story rival those in Swiss cheese and the jokes are sophomoric.  In addition to this, the Rob Lowe character and the names of his family members border on being anti-Semitic; they are not only offensive stereotypes but seem to have been thrown in gratuitously since the characterizations don't even have relevance to the story."
    },
    {
      "rating": "0",
      "text": "Absolutely horrible movie!No funny moments and total lack of humor.I nearly fell asleep after a few minutes. Do not see this movie on cinema,waste of money!"
    },
    {
      "rating": "2",
      "text": "Horrible movie. Not FUNNY. It was cool to see these two on screen in bad teacher and this is obviously trying to piggyback off the success of that. it FAILS."
    },
    {
      "rating": "0",
      "text": "Well where to start... bad acting bad writing bad \"jokes\" (if you can say that this movie has any) despite Cameron Diaz small \"almost good acting\" that are often very few just because the screen play writing do not give the actors any good chance to act better. Because the obvious characters behaviors by the situations they are facing is it lacks of a better development in their part. This isn't juts another awful movie, no no. It is a disgusting \"funny movie\" Mixing funny with nudity is never have been great.\r P.s. Comedy is dead in movies now days.... and do not watch it, wait until it's in Netflix."
    },
    {
      "rating": "2",
      "text": "An terrible excuse for an Comedy Movie stupid jokes nearly only sex and toilet humor. The acting is also very bad  exaped for diaz on some parts. The Story is also just offensive and another thing that is a big problem in my eyes is the maine character , he is just not that likebal that you want to see him go thout all that."
    },
    {
      "rating": "3",
      "text": "This movie really shows you what happens when you have a great concept, great actors, and zero script or direction.  The movie is saved, for me, by two scenes - the Rob Lowe Slayer sequence (love me some Angel of Death) - and the Jack Black sequence in which he's listing all the potential competitors to YouPorn that he thinks our hero is representing.  Hilarious stuff.  Hearkens back to the list of pornos that the sidekick from Clerks lists off to his video supplier."
    },
    {
      "rating": "1",
      "text": "Very poor script, combined with very poor direction, plus levels of vulgarity beyond reasonable, make for one of the worst movies in the reccent past.  The premise had promise, but the execution, from start to finish couldn´t have been worse.  I am surprised Cameron Diaz agreed to participate in such a project.  She declared that she took some clothes off in this fillm because \"the pay was good\".  Was it really worth it?"
    },
    {
      "rating": "2",
      "text": "In a year of bad comedies (Walk of Shame, The Other Woman, Blended) Sex Tape continues the trend.  Characters doing really dumb things for really dumb reasons.  D"
    },
    {
      "rating": "4",
      "text": "Not as bad as I thought it would be but still not good. Laughed a few times through the movie but not as much as you want from a comedy. A good cameo at the end that was funny and made the movie a bit better. Some funny moments but still not good at all."
    },
    {
      "rating": "6",
      "text": "It is enjoyable to see the chemistry between Jason Segel and Cameron Diaz evolve, in a not so great, cliched, raunchy sex comedy about a burned out relationship."
    },
    {
      "rating": "0",
      "text": "Until this day I still don´t get why so many people think Cameron Diaz and Jason Siegel are super funny. I just don´t. I have liked inly like 2 movies of Diaz and none of Jason movies. This movie is so bad in so many ways that u almost feel sorry for them...almost."
    },
    {
      "rating": "0",
      "text": "The worst example of a comedy film. It is like a parody of American Pie, and the script doesn't make sense to realize the beauty of a comedy film about sex."
    },
    {
      "rating": "6",
      "text": "Shamelessly crude and offensive, Sex Tape offers a few moments of genuine hilarity - but all in all, is a very forgettable comedy which is ill suited to its genuinely funny leads."
    },
    {
      "rating": "8",
      "text": "The movie Sex Tape isn't bad. Though, I wouldn't consider it to be a comedy movie. Lifestyle movie? Maybe. But there are a few memorable moments on the movie. If you wanna learn how to do sex, this movie could possibly help you how to do it. Oh yeah, I forgot to mention one of the most memorable moment you guys might like is probably the dog biting scene. So my suggestion, go on and see it."
    },
    {
      "rating": "2",
      "text": "I know what this is going. And yes, Rob Lowe did indeed had a sex tape on his own way back. But to be fair, why is Sex Tape the name of this title movie? I didn't see the movie because I thought it was supposed to be as good as Bad Teacher, but then again I just don't understand with a bland script and mimicking American Pie, Old School, and all of its raunchy teen comedies just happens to be the movie's biggest blunder. But extra points to Rob Lowe. I definitely love this guy delivering a performance that he totally mocks himself lately. Hey, he hosted SNL. Either way, Sex Tape is one of the weirdest but absolute worst movie of 2014 so far."
    },
    {
      "rating": "0",
      "text": "So, so, sooooo bad, and I'm talking Beverly Hills Cop 3 bad. Appalling dialogue and we are led to believe that Cameron Diaz, who's stunning figure we see naked from behind multiple times, has body confidence issues.\r This film was so bad, I turned it off before they made the sex tape.\r Did I say it was bad?"
    },
    {
      "rating": "1",
      "text": "There isn't much to excite you in Sex Tape. The dialogue is at times so poor, you'd be better off watching this on mute. It attempts to amuse you with absurdity, but unfortunately the joke's on the film."
    },
    {
      "rating": "3",
      "text": "Probably the laziest comedy I have ever seen. It seems like as little effort as possible went into making it. As if the only reason it exists is out of some contractual obligation. There are a lot of great, funny people here who give it no effort. The jokes are so bland and unoriginal that it's evident writer Kate Angelo just took bits and pieces of unfunny jokes from other comedies and through them in with original gags that lack humor in every way.\r Once or twice a chuckle worthy line popped up and a cameo from Jack Black spitting out the names of porn sites mildly amused, but nothing funny happens. This is a boring slog devoid of any laughs. The direction itself is just awful. Scenes just look cheaply made, rushed, and phoned in. Did I mention how lazy this all feels?\r Even the usually amusing Jason Segel gives a lifeless performance. You can tell he doesn't take it seriously as he horrendously overacts. It almost seems like he's trying to make fun of how awful it all is. The rest of the cast just looks bored. They are given nothing to work with though. It seems like no one involved wants to be there at all. Except maybe Diaz. You can tell she's actually trying.\r The only good part of this movie is Diaz's bare butt. It only makes 3 appearances onscreen and isn't worth suffering through this movie to get a glimpse at. The movie has nothing to say about it's rather taboo core concept. It has nothing to say about pornography, it has nothing to say about sex, and it has nothing to say about relationships. That last one makes it kind of weird during the times the movie tries to become a rom-com. The biggest issue it has is that it's devoid of laughs. That issue kills this comedy.\r I give \"Sex Tape\" a 3.5/10."
    },
    {
      "rating": "7",
      "text": "Oh how much potential this movie had. I'm not going to lie, this movie had me laughing to tears for the first hour. It's one of the funniest and most original comedies I've seen since The Hangover and it was on pace for a 10/10 rating. Then the writers had the ultimate fail and ruined the plot.\r The film follows Jason Segel and Cameron Diaz as they go from young lovers to married with children who don't have the same love life they once did in their youth. In order to spice things up, they decide to make a sex tape and record it with Segel's iPad. In a sharing snafu their intimate moment is shared with everyone who has been an iPad by Segel in the past... approximately half a dozen people. Now the adventure begins. The two of them have to go track down these iPads and delete the video from them before their friends and family members discover the newly added flick. Oh man are there some amazingly hilarious scenes. Unfortunately, the writers didn't understand how awesome this was and after acquiring one of them, the movie takes a drastic turn for the worse. Instead of making a film where they go from adventure to more chaotic adventure, the movie loses much of its excitement after being confronted and blackmailed by a ten year old. After this point, while there were still a few funny moments, the movie was largely predictable and lacked the same feeling and magic.\r Overall I still suggest the movie to people who don't mind crude humor but it's no longer the must watch that it could've and should've been."
    },
    {
      "rating": "4",
      "text": "From the cast and crew that brought you Bad Teacher, comes Sex Tape, and on the surface it had all the makings of the next big comedic hit. Many people were saying that Sex Tape could be the next Hangover, as it is an original idea with an all-star cast, but sadly it falls well short of expectations. Annie & Jay's marriage has become a little stale, so one night they decide to spice things up by making a Sex Tape. Jay is a music producers and inexplicably neglects the fact that his laptop is connected to many other devices, and the tape finds its way to the cloud. Once again, Jason Segel and Cameron Diaz have absolutely no chemistry. They are too different types of actors that just don't compliment each other and they are even less believable as a married couple. If that were the only issue with this film, maybe I could have gotten passed it, but the real problem, as with Bad Teacher, is that the writers don't know their audience. This is an R rated film about a sex tape and in no way meant for children, yet the jokes are on a sixth grade level. As an adult going to see a raunchy comedy, I'm not interested in jokes about erections and diarrhea, it's in very poor taste and isn't something many adults will respond to. This film is supposed to be a laugh out loud comedy, but there was barely even a snicker in the movie theater, which basically tells you all you need to know about this film. Sex Tape is trying to get people to see it under the guise of being raunchy and featuring some pretty attractive stars, that fans hope they will get to see naked. The truth is that it is very amateurish, you really don't see all that much, and the jokes could be out of PG movie. All in all, Sex Tape is a big disappointment and a huge waste of time."
    },
    {
      "rating": "4",
      "text": "We all knew going into this one what we were likely to find. For the most part, we are unimpressed. Occasionally, however, there is slight magic between our two leads."
    },
    {
      "rating": "2",
      "text": "An incredibly dull and boring film. I have laughed more in heavy drama films than I did in this one. It incorporates some of the worst dialogue of the year with a concept that gets old after 10 minutes. A shameful excuse to make a movie."
    },
    {
      "rating": "6",
      "text": "It's funny. I laughed. Not sure why people are loathing this film. There are wore comedies this year (Tammy), there are as funny comedies this year (Million Ways to Die) and there much funnier films (Jump Street). If you can overlook the structure flaws, it should be a good enough time."
    },
    {
      "rating": "4",
      "text": "At times the film isn't entertaining, it's just so funny and bad at the same time. A talent actress like Cameron Diaz won't go far with her humor. However i did laugh a lot and Jason Segel is like a comedic sidekick. So i did enjoy it. Grade C+"
    },
    {
      "rating": "3",
      "text": "When comedies are stupid and they are funny, they're clever. When comedies are stupid, but they are not humorous, then it's stupid. This problem threatens to happen here, in \"Sex Tape\", a relentlessly cringe-worthy comedic film that while carries a charming chemistry from its main stars and a naughty premise, it falls flat with its jokes. If you wanna see this, I only recommend you that you pirate it or just wait 'till comes to cable TV. Other than that, please, stay away from this."
    },
    {
      "rating": "4",
      "text": "At first, I was so bored that I wanted to stop him. Honestly not much liked, a little boring. From the Trailer looked interesting, but that's a... bad movie."
    },
    {
      "rating": "1",
      "text": "If you have seen the trailer you have seen the movie. This film was an absolute atrocity by far one of the worst of the year, it was simply a product placement for apple and and a waste of talent."
    },
    {
      "rating": "4",
      "text": "This movie was mediocre, just like every movie that has come out this year. Save your money by not going to the theater. Go spend it on.... anything else. Go donate it to charity."
    },
    {
      "rating": "6",
      "text": "most of it is pretty good, but not great. The middle of the film, where they actually try to retrieve the tape is where the film sags like a flat tire."
    },
    {
      "rating": "2",
      "text": "One joke movie that becomes boring despite stars' best efforts.  Sex does not fix an ultra weak script anymore.  Cameron Diaz is also looking old.  She needed a bit of photo-shopping."
    },
    {
      "rating": "5",
      "text": "It was funny, just not funny enough to keep me entertained the whole 90+ minutes.  Opening was cute, setup of plot was fun, but after that, it pretty much headed downhill and only had a few laughs in a couple of places.  In places, it seemed as if they were trying to stretch the movie our as gags just kept going and going with no real progress on the story."
    },
    {
      "rating": "2",
      "text": "Sex Tape is essentially a 90-minute Apple commercial. A promising premise is wasted on a slow-paced, unrealistic and disjointed storyline. The comedy bounces all over the place, unsure of how racy it should be, which in turn wastes the great cast. What ends up on the screen is a family farce film filled with corny, forced humour. This film is should only be watched if you're a fan of Cameron Diaz or Jason Segel, because if you're looking for any story or intelligent jokes you wont find it here."
    },
    {
      "rating": "9",
      "text": "All the other reviews I've read on this site about this movie I do think are very fair. As a 22 year old I honestly think Sex Tape did a pretty good job of being both entertaining and funny and if I'm honest i prefer it over Bad Teacher. The story isn't great but in my opinion that is not what you watch a comedy for. As a comedy Sex Tape does a great job of getting laughs out of what can be considered a very awkward and embarrassing situation. I love the crude humor and the gags on how aging people are loosing their touch with technology. All in all it is a great 'balls out' comedy which will keep most young entertained the whole way through."
    },
    {
      "rating": "3",
      "text": "Cameron Diaz needs to pick better movies then this. This has to be the most unfunny and the most painfully movie that I had to sit throw. The characters are so stupid and the writing is the most lazy writing that I have seen in my life. I laughed once during this movie and that's it, sex tape is the most lazy comedy that I seen this year and I tried to find something good in this movie but I couldn't."
    },
    {
      "rating": "0",
      "text": "Very carp movie rude dumb imhate movies like this ivan milat series is a lot better I think so. Crap tape more like it  very dumb if you are gay or lesbian never watch that **** **** movie yucky"
    },
    {
      "rating": "1",
      "text": "Sex tape is an awful comedy with poorly executed jokes and only exists to showcase apple products not to mention the movie is very tame for a film called sex  tape"
    },
    {
      "rating": "3",
      "text": "Very poor attempt at comedy with a terribly contrived story shackled to a script which is littered with \"comic\" simulated sex scenes and a lot of very cynical Apple product placement.\r Avoid."
    },
    {
      "rating": "3",
      "text": "Quite disappointing. There isn't as much copulation as the title suggests. Can't be that bad if everything else makes up for it, right? Nope. Jason Segel is a rubbish cast, he delivers some truly cringe-inducing dialogue which make me squirm in embarrassment. Cameron Diaz, on the other hand, is much more natural at her role; she is a vastly superior cast. I can't help but feel that if Diaz was paired with a better counterpart, the film would be much better. The plot is utterly bonkers, but it occasionally brings out good humour that seems to be missing every other time. Sex Tape is a dull, below average film with promising moments that are too few and far between."
    },
    {
      "rating": "4",
      "text": "Às vezes, o filme não é divertido. É engraçado e mau ao mesmo tempo. Cameron Diaz não deu o seu melhor neste filme (talvez por não ser a mais indicada para filme de comédia). No entanto, eu ri imenso e Jason Segel fez-me gostar um pouco mais do filme."
    }
  ],
  "recommendations": [
    "30_minutes_or_less",
    "couples_retreat",
    "the_hangover",
    "zoolander_2",
    "the_watch",
    "anchorman_2_the_legend_continues",
    "baywatch",
    "rough_night",
    "neighbors_2_sorority_rising",
    "identity_thief",
    "hall_pass",
    "thunder_force",
    "ted_2",
    "this_is_the_end",
    "the_change_up",
    "little_fockers",
    "grown_ups_2",
    "movie_43",
    "miss_march",
    "dirty_grandpa",
    "deuce_bigalow_european_gigolo",
    "jackass_presents_bad_grandpa",
    "trainwreck",
    "the_wedding_ringer",
    "tammy"
  ]
}