{
  "id": 123,
  "title": "Sex and the City",
  "starring": [
    "Sarah Jessica Parker",
    "Kim Cattrall"
  ],
  "runtime": 145,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "A New York writer on sex and love is finally getting married to her Mr. Big. But her three best girlfriends must console her after one of them inadvertently leads Mr. Big to jilt her.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AhNfnsGW95RKHQNLdgFH48UN0Zy.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 5.083333333333333,
    "ending": 4.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.35,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Maybe it is because I am male but this film was just so dull and so long. I think it also justified my decision to stay happily single as they go on, and on, and on. ... This film had absolutely nothing going for it. The cast I am sorry but I do not find them attractive as women and I found myself feeling less so as the films went on. Normally I give films a second chance and watch them again, but for this particular film (as with the Royal Tenebaums and The Life Aquatic) I do not need to. Thankfully I bought this as a cheap DVD and plan to donate it to a library or someone who also will probably pass it on when they have seen it."
    },
    {
      "rating": "6",
      "text": "I adored the show, wish I would have left it at that. The movie was very long, and the drama that was created was devastating. The entire movie was depressing, and then, after unforgivable drama.... the end is happy. The characters lost their identity, and the jokes weren't as witty or funny as the show. The movie didn't have the same vibe as the show."
    },
    {
      "rating": "10",
      "text": "If you loved the series, you will love the movie. It is very touching and true about the relationships between women. I loved it! If you never watched the series, this movie isn't for you. You won't pick up on the story based on history of the characters. To see this without having watched the series would be an unfair review. It stays true to the show."
    },
    {
      "rating": "10",
      "text": "I had softened my expectations based on the incredibly inconsistent reviews it has gotten. I was surprised therefore how good it actually was. It was a valentine, that even when predictable, won my heart. If you loved the show, you owe it to yourself to see the movie. I may go through withdrawl from the series all over again."
    },
    {
      "rating": "6",
      "text": "Perhaps if I had seen at least one episode in the series, I might have gotten more out of the movie. It does have it's moments. Kim Cattrall is great, and Jennifer Hudson is memorable. It's a likable film overall."
    },
    {
      "rating": "4",
      "text": "Not my type of movie, boring and unappealing (to me)."
    },
    {
      "rating": "9",
      "text": "If you're a fan of the show, there's no reason to dislike this movie. In fact, I thought it was pretty good. It was much more truer to its roots than Indiana Jones 4 was, so in that regard, it's worth the $10 ticket in gold. It's like 5 bonus episodes strung together, which isn't a bad thing if it's based on a TV show. Check it out."
    },
    {
      "rating": "7",
      "text": "Yes it was predictable. But the whole series was. How great of a movie would it be if everything was perfect. This was 4 episodes in one giant serving. My wife complained that she wanted more. But why would you want to change something that works so well. And imagine the uproar if the entire formula was changed and it sucked."
    },
    {
      "rating": "1",
      "text": "That Hollywood can produce a two-hour-plus advert for L'Oreal, Prada and Gucci and, apparently without irony, conclude with the hypocritical message that none of those designer labels and must-have bling really MEANS anything, shows how culturally bankrupt and corporatized the US has become, and how stupid they think their audiences are. SITC is overly long, poorly paced, about as exciting as watching your girlfriend buy shoes (which it kind of is...). I was left with two questions: 1) How on Earth can the producers of this dreck think that watching people buy $50,000 rings is entertainment? 2) How on Earth did Jennifer Hudson win an Oscar when she may be the single worst actress the US has ever produced?"
    },
    {
      "rating": "9",
      "text": "I'm a die-hard fan of the series, and the movie didn't disappoint at all! (And I'm a tough critic.) I laughed and cried, and I'm planning to see it again."
    },
    {
      "rating": "8",
      "text": "A very sweet fable that--surprise surprise--emancipates love from labels."
    },
    {
      "rating": "9",
      "text": "Loved it. Even though it was over 2 hours long, I didn't want it to be over!"
    },
    {
      "rating": "7",
      "text": "I thought it was a fun movie. It did the series justice."
    },
    {
      "rating": "6",
      "text": "As a huge fan of the show and owner of the complete series, I was beside myself in excitement for the film. I loved the show for its edgy topics, risky humor, and honest portrayal of how women view relationships. The movie did not meet my expectations. The SATC felt more like a chick flick than anything else, and was not the comedic performance I was expecting. The movie took us to a dark place for much of the movie. I felt the acting on most parts were flat (compared to the show). The story line seemed scattered and seemed to have no focus. On the other hand, It is a difficult task to cram all the complications of all of the characters into one movie...which is probably to blame for the lack of depth in the characters. I love the 4 women and was happy to see them again. But if you weren't a fan before..this movie is not enough to convert you."
    },
    {
      "rating": "10",
      "text": "LOVED it, loved it, loved it... Thought each story line played out true to character for each of them. Simple Loved it!"
    },
    {
      "rating": "6",
      "text": "A five-part HBO special would have been more fitting. This movie is not meant for the big screen. Save your money and rent the DVD with all the glorious extras."
    },
    {
      "rating": "1",
      "text": "ARRRRRRRRRRGH!!! Kill me, Please put me out of my missery, Girls your gonna love it because it has Women in it and they talk, As far as i could tell thats all they do, i think there is a wedding in there somewhere, but for the Real men out there may i suggest that you try the following when being dragged to see this film 1, Take LSD, this should make the fiml enteraining."
    },
    {
      "rating": "8",
      "text": "Much better than I expected. I'd never seen the HBO series ,although I was aware of the characters. A \"chick\" movie for sure , but entertaining and funny."
    },
    {
      "rating": "10",
      "text": "Having been a Sex and the City fan for as long as I can remember and watching every episode at least 20 times, the film was what I expected and more. It didn't try to be anything else and was a witty, funny, smart movie, just like the episodes. It was amazing they managed to get all the cast back so it was even better. Would I watch it again, oh yes!!"
    },
    {
      "rating": "3",
      "text": "I for one loved the series and followed it very closely. This movie was about as far from the series as you could get. It was boring, dumb, and way too long. As a man, I could not recommend this film to another man. I for one could not connect to it as I did with the series. The ending is absolutely horrible as well. It felt like the plot was all over the place. The length was unbearable. I can remember looking at my watch, figuring out there was 45 more minutes, and wanting to fake a injury to get the hell out of there. Females may find it more entertaining, but men stay far far away."
    },
    {
      "rating": "4",
      "text": "After enjoying the series so much, the film was a let down. There were laughs and tears in places, the fashion was fabulous but overall the plot was dismal. The ending left me feeling annoyed and thinking does a leopard ever change his spots?"
    },
    {
      "rating": "1",
      "text": "Honestly I don't remember much from this movie. I went catatonic during the last hour. However, from what I recall it was terrible. When i wasn't drooling from sheer overwhelming boredom I was sitting in disgust. Not only was Sex and the City twice as mind numbing on the big screen, it was also poorly written and poorly acted. It wasn't edgy or sexy or funny or interesting in the least bit. The four women of this film frankly terrify me, and not because they're all crazy as shit. It's mainly because I don't understand how they can act this out and keep any sense of feminine dignity. This movie is the exact reason men continue to think that women are bland, boring, crazy bitches. Thank you Sex and the City for perpetuating stereotypes, and for all the sane people that were forced to go see this movie by someone obviously fucking crazy, I truly sympathize."
    },
    {
      "rating": "7",
      "text": "I have watched this film twice now. The first time I was very disappointed, but the the second time I realized why everything happened the way it did. I felt it could have been a little funnier, but still good."
    },
    {
      "rating": "0",
      "text": "Since seeing the video last night I've been trying to think of a worse, more boring, shallow movie. I'm still coming up dry. This was a bad kids' movie with sex and vulgarity. I guess if you're interested in seeing endless tedious \"fashion\" and airheads who swoon over it, this was worth the (seemingly eternal) time. For the rest of us it was a bad Halloween prank, complete with pretentious-crap costumes. I say this as a guy who watches \"womens' stuff like Housewives and Betty with some degree of interest. Maybe because they actually manage to be funny once in a while. This trash movie, on the other hand, may have cured me of ever wanting to even go to NYC again. I don't need to get on a plane if I want to see the kind of self-obsessed ugliness this waste of film offers."
    },
    {
      "rating": "4",
      "text": "It was nice to see them on the big screen but everything that happens was revealed in the trailer so there were no surprises and a lot of things that happened were uncharacteristic of their characters on the show. a disappointment in my eyes."
    },
    {
      "rating": "2",
      "text": "Just saw a sneak peak. VERY dissappointing. Seemed to only be an excuse for the actresses to parade around in expensive clothes furthering the divide between SATC and reality."
    },
    {
      "rating": "9",
      "text": "I haven't watched the Sex and the City series on either HBO or on TNT. My girlfriend made me go. She prepared me with some knowledge about the show. Although it was a bit of a pain to listen to, I enjoyed the movie much more because of it. However, what I really enjoyed the movie for was its thought provoking relationship decisions. I would watch it again."
    },
    {
      "rating": "10",
      "text": "I was so afraid it wouldn't be very good, but it was better than I hoped. Surprisingly deep, dark and sweet and tender. Extremely satsfying. The girls hit one out of the park."
    },
    {
      "rating": "0",
      "text": "It's just bad. Save your money and watch the TV show."
    },
    {
      "rating": "10",
      "text": "It's the closure I've been waiting for. The whole story is just too honest for some people to swallow."
    },
    {
      "rating": "10",
      "text": "Loved it, loved it. It was like visiting old friends again..very entertaining, and I was glad it was over 2 hours long!"
    },
    {
      "rating": "0",
      "text": "This is the worst movie I have ever seen. Too long and too boring! My wife made me see it with her and even she regrets seeing it."
    },
    {
      "rating": "10",
      "text": "Saw it last night at the midnight show it was fantastic...these reviewers suck! The men who didnt like it must hate women and the women who didnt like it need a date!"
    },
    {
      "rating": "9",
      "text": "SATC The Movie definitely lived up to all the hype and anticipation. I'm going to see this in the theater at least a couple more times then buy the DVD as soon as it comes out!"
    },
    {
      "rating": "8",
      "text": "Too long? Yes. Bit sappy? Yes, but wasn't the series? The writing was lacking, no question. But .... one of the reasons we loved them in the first place is that they were three quarters imperfection and one quarter fantasy. If you're one of the millions who faithfully followed them week to week on HBO (please, the sanitized reruns don't count), then how could you NOT be thrilled to see them getting older right along with you and still falling in and out of love? Not a perfect movie, but it was still divine."
    },
    {
      "rating": "0",
      "text": "Modestly attractive women, whining about men, treating children like accessories, all in the name of girl power. What's not to like? Oh, all of it!"
    },
    {
      "rating": "10",
      "text": "Wierd - it seems most people who don't like this movie either 1. Wanted a different story 2. Didn't like the fact that it was unrealistic or 3. Are just threatened. I went with my wife who loved it - and I must say I thought it was great too - it delivered precisely what a vast majority of fans of the series(particularly 30-40's females who really \"grew up\" along with the characters) absolutely wanted. And I can not remember the last movie I was at where at the close of the movie the audience burst into applause. For those who hated the movie - I hear you but just don't get it."
    },
    {
      "rating": "10",
      "text": "Loved it! It was awesome! If you haven't seen the series then you won't be able to appriciate the movie. It was great to see all of the girls back together with great style and love!"
    },
    {
      "rating": "0",
      "text": "Okay this is so not the sex and the city I know. Where was the witty culture wise chat? Where was the range of sexual experience? This was tawdry, dull, flat, lank, like hair that has used the straightening irons one time too many. And ha ha ha, how we laugh at the gay kiss, and ooh ooh ooh, how sexy the straight new year's kiss. Served a cosmopolitan in the theatre with cheap orange liquer, and pre-mixed limes stuffed with preservative, a perfect match."
    },
    {
      "rating": "10",
      "text": "I went in sneering prepared for the worst then spent the entire time in the theater laughing and crying (roller coaster-like) at what I experienced. Truly a fun, well-intentioned blow-up to the popular series."
    },
    {
      "rating": "6",
      "text": "As a marriage and family counselor I found this television show revealing at times in uderstanding the different perspectives with which men and women see the world and understand life. Therefore, I viewed the movie, along with the other three men in a theater full of women. Whoever marketed this movied failed miserably in making it appeal to men. A vast amount of revenue was lost. I believe the poor attendance of men says a lot about the content of the movie and the word of mouth that accompanies a film. I admit that without a prior knowledge of the characters from watching the HBO series, much of the humor was lost on the audience. The movie was entertaining in spite of the need for prior knowledge as heartache and humor were intermingled in the post-modern world of dating, relationships and the institution of marriage. However, the movie soon lost its luster and began to feel like watching a compilation of tidbits from previous episodes. Woody Allen was one of the directors who could meaningfully explore relationships in novel ways using the same combination of humor and pain. He also knew how to gather the perfect ensemble of characters. This film held such promise and potential. However, just when the audience was prepared to journey down new paths we found ourselves sitting on the sofa in front of the television, laughing at the same personalities and similar circumstances. This culture is ready for a movie that realistically offers a vision of hope for those in search of authentic, lasting love. \"American Beauty\" powerfully revealed our angst, confusion and pain. We are now ready to laugh a little, while greatly believing love can still emerge from pain. This film tantalized us, but left us to wait a while longer."
    },
    {
      "rating": "0",
      "text": "Absolutely awful. This film is completely over-hyped and any reviewer that rates this positively has almost certainly had a few too many cosmopolitans before heading to the cinema."
    },
    {
      "rating": "10",
      "text": "Huge fan of the TV show, and I thought they did an amazing job with the movie. I didn't want it to ever end."
    },
    {
      "rating": "8",
      "text": "Overall, I thought It stuck to the essence of the TV show, and was every bit as good. There was a couple things in the Big/Carrie storyline that could have been improved, but it is still a solid 8 in my books!"
    },
    {
      "rating": "10",
      "text": "I loved this movie. It was a thrill of emotions...crying for both happy and sad... Highly recommended for fans of the show!"
    },
    {
      "rating": "10",
      "text": "If you loved it on the tube you will love it on the big screen! Also it must be said that the friends I took with me who had never seen the show before really like the movie too! They ranged from pleasantly surprised to asking to borrow my dvds of the seasons, SATC converts!"
    },
    {
      "rating": "10",
      "text": "Loved it. Had the same wit and humor as the series. Laughed out loud throughout."
    },
    {
      "rating": "2",
      "text": "As Jay Sherman used to say on the critic 'It Stinks', I gave it two as their are some funny moments, but this is in a cruel way, one character shits her pants, and the other gets jilted at her wedding day and another gets cheated on... But this film is way too long and really makes people who have negative comments about the show right..that it can be shallow and meaningless. This film shoudl not have been made."
    },
    {
      "rating": "9",
      "text": "I REALLY enjoyed this movie. I never saw the TV series so I did not have any preconceived ideas of the characters, but I had no problem following a warm sesitive movie about four women looking for love and happiness. I am a 52 year old single female who would like to believe that fairytales REALLY do come true!"
    },
    {
      "rating": "7",
      "text": "I was not a devoted fan of the television series, but watched some episodes when it got to TBS. The plot is minimal and the film both delivers and disappoints in that the humor, clothes and settings are up to par, but the plotline is slight and somewhat predictable. Did I cry? Yes. And I enjoyed being part of the phenomenon of the female rush to the ticket office .On day one at 4 p.m. I could only get in day two!"
    }
  ]
}