{
  "id": 2265,
  "title": "Sex Drive",
  "starring": [
    "Josh Zuckerman",
    "Amanda Crew"
  ],
  "runtime": 109,
  "genre": [
    "Comedy",
    "Adventure",
    "Romance"
  ],
  "description": "A high school senior drives cross-country with his best friends to hook up with a babe he met online.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4Py88PRFuzDgXtkOwnxfNobWn6B.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 8.0,
    "ending": 5.5,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.117647058823529,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It wasn't a perfect movie. It was unbelievable, predictable, stupid and there were a few plot holes, but it was entertaining, the acting was good and it was fairly fun to watch."
    },
    {
      "rating": "10",
      "text": "One of my favorite road trip movies, with a simple premise that keeps it going and some really great memorable scenes. The humor is quite blue and it's not one to watch with your grandma, but if you're a fan of Apatow (minus maybe the depth of character) type stuff you'll enjoy it."
    },
    {
      "rating": "7",
      "text": "Surprisingly bold and likable raunchy comedy, and the cast is a big plus. Josh Zuckerman is very good, Amanda Crew is awesome. It has some very funny scenes, as well as it's share of gross out scenes. Overall though it's very entertaining."
    },
    {
      "rating": "3",
      "text": "The plot is as any other teen comedy, go grab the present. The only problem with Sex-drive is that it doesnt. Sex-drive summons up some good moments but it doesnt really get to the point where you think \"Wow this movie is worth all the money\" overall its an medium rated movie and should not get more than 3."
    },
    {
      "rating": "7",
      "text": "In Todd Phillips' \"Road Trip\", the filmmaker pays homage to his own bout with puberty when Amy Smart frees her boobs, just like how Phoebe Cates frees her boobs in Amy Heckerling's \"Fast Times at Ridgemont High\". Everybody remembers what Cates wore, a two-piece red bikini, now: Think fast! What was Smart wearing before she pulled it over her head? That's why Phillips failed. Nobody remembers Smart's spaghetti strap. Memorable clothing, not just memorable boobs, is the reason why Cates' poolside scene has its own wing in the Perv-Hall-of-Fame. Linda Barrett was a bad girl. She showed Stacey Hamilton(Jennifer Jason-Leigh) how to fellate a carrot in the Ridgemont High cafeteria. Felicia(Amanda Crew) is a good girl. In \"Sex Drive\", she drives Ian(Josh Zuckerman) crazy by being in love with Lance(Clark Duke), just like another good girl, Maggie(Kerri Green), who chooses Cappie(Charlie Sheen) over Lucas(Corey Haim) in David Seltzer's \"Lucas\", the 1986 film that quietly informs this \"American Pie\" retread\", redeemed and given transcendence by a sweet performance by Crew, whose Felicia is soft like Green's cheerleader, the high school girlfriend you always wished for(when you weren't busy wishing for boobs). After \"Lucas\", the auburn-haired beauty starred in Bill L. Norton's \"Three for the Road\", and wouldn't you just know it, our three heroes are three for the road. \"Sex Drive\" has two inspired bits: an ornery Amish man(Seth GREEN), and a donut costume. Read the donut, read Ian as a talking p****. In the short form music video for \"That's Good\"(directed by Gerald Casale), an animated French fry screws an animated donut hole. After the climactic scene in the parking lot, the donut costume becomes prosaic; Ian's masculine performance transforms his emasculating mall get-up, back into a mere donut costume. Now when he talks, it's his own voice, and not contracting vaginal muscles."
    },
    {
      "rating": "10",
      "text": "This movie is hilarious, well written, and the even the acting is good. While it is another teen movie, it will make you laugh hard, and some characters we will be seeing again. The movie simply did not get enough attention, but the production values are good and it is a gem for it's genre. Definitely better than many films of the genre, and I would consider this a must see."
    },
    {
      "rating": "10",
      "text": "Hilarious. I haven't laughed this hard in a long time. Critics are cranky, unhappy, unfunny people. The only people who shouldn't be reviewing movies are movie critics themselves."
    },
    {
      "rating": "10",
      "text": "so funny...such a pleasant surprise."
    },
    {
      "rating": "7",
      "text": "It's not the next Superbad that people are still waiting for, but it has enough laughs to keep its target audience entertained. Props to Seth Green for a marvelous performance that I am sure everyone would wish had been more prominent in the film."
    },
    {
      "rating": "10",
      "text": "Just much better than critics suggested. Built to a crescendo after the first half hour. Worth a shot."
    },
    {
      "rating": "4",
      "text": "As far as end-year movies go, quality can assure its displacement."
    },
    {
      "rating": "9",
      "text": "I am usually not so much a fan of exceedingly stupid movies however, there is something about this movie that made me geek so hard. I literally think that because it lacked so much substance I was able to be captivated by it over and over again. I just don't like the main character Ian, seemed like his goal was to portray a morphed version of Jason Biggs and Michael Cerra."
    },
    {
      "rating": "9",
      "text": "I've never been a big fan of \"Teen movies\" or \"Teen sex comedies\"...the first American Pie film was kind of funny but the sequels and direct to video garbage that followed made me despise the genre altogether...and now we have \"Sexdrive\"...and at first glance it seems like a \"American Pie on Wheels\" from the \"character embarassment\" at the beginning of the film to the inevitable conclusion which involves...you guessed it...S-E-X. Though something about this movie made me think differently...perhaps it was the likeable characters, unique moments of hilarity, or James Marsden's hilarious over-the-top potrayal of a bullying homo-phobic (with a twist) big brother. The movie centers around Ian, Lance, and Felicia...they hit the road so Ian can \"become a man\" by meeting up with some girl he met on the internet...all the while he is really in love with his best friend Felicia who just so happens to like Lance, whom is a womanizing though caring friend of Ian's...the movie carries this love triange up to about the halfway point where it becomes obvious that things are going to go in Ian's favour, a tad bit cliche...but the young actors have great chemistry wtih each other, so it comes off as natural and funny. Overall....Sexdrive is easily one of my favorite comedies of 2008, from the previews i completely wrote this movie off...but after hearing more about it i gave it a chance and im glad i did...its a truly remarkable \"Teen sex comedy\" in the sense that its actually FUNNY and while it riddled with cliches (embarassing the main character, a road trip, a gorgeous best friend love interest, the cocky womanizing best friend) it all comes together in a way unlike anything ive seen of its type. HIGHLY RECOMMENDED."
    },
    {
      "rating": "2",
      "text": "Tryin to rip-off superbad and it failed,epic failure, I was not laughing, there were 15 minutes left and I just walked out."
    },
    {
      "rating": "6",
      "text": "The raunch is funny, for the most part. The heart doesn't feel forced. Knocked Up it ain't, but it's a perfectly harmless, unstupifying film."
    },
    {
      "rating": "8",
      "text": "Another great comedy to add to the teenage, crude, sex referenced pile. A welcome addition that has great humor, surprisingly good acting and overall provides the viewer with a greatly enjoyable experience. Probably cheap and easy to find on DVD since it's been a few years since its release, well worth the spare $6 in your pocket."
    },
    {
      "rating": "8",
      "text": "Absolutely hysterical! My wife and I stumbled across this film OnDemand and we gave it a go, for different reasons I might add! **wink wink** We ended up discovering just a downright hilarious film. I couldn't stop laughing. The performances are wacky but still streamlined in their element, and the film rolls along a road of sexual conquest, evolution of relationships, and a donut costume! Check it out for a very fun time!"
    },
    {
      "rating": "5",
      "text": "This is a pretty standard teen comedy and horribly predictable movie. You will know the ending long before the first act is over. Also the jokes are easily seen coming miles away. With all that said the movie is actually pretty good if you just sit back and watch it. If you go into this thinking to hard then you aren't going to have any fun, but if you just sit back and let it happen then it's not to bad. There were a few times it caught me off guard. A Fall Out Boy concert at an Amish farm is pretty funny. Overall the movie is your standard teen comedy with your standard characters and standard outcome."
    },
    {
      "rating": "4",
      "text": "It's about as good as any movie featuring Fall Out Boy can be. It's cliched and predictable from the start, but it at least had some redeeming moments to make it watchable."
    },
    {
      "rating": "8",
      "text": "This thing is hilarious, hadn't laughed at a comedy movie for some time, especially after watching Adam Sandler flicks. If you like teen adventure movies a la American Pie, give this a chance (this has much less nudity and swearing) and now I'm in love with Amanda Crew, wow."
    },
    {
      "rating": "6",
      "text": "Sex Drive, a pretty funny comedy movie, it's got a decent plot which is about this 18 year old lad called Ian (Josh Zuckerman) who decides to cross the country drive to meet this girl who's been chatting with him online. Also, the movie's got quite a few hilarious moments throughout and a lot of them work quite well, while some of them don't work very well.The only problems which I've got with this movie would have to be how certain scenes throughout are built up and how they end up being quite predictable.Another problem I had with this movie would have to be when they've shot certain scenes for this movie. The reasons on why is because there's a certain scene where Ian is sitting with one of his friends in the back of a truck and you see where his friend is sitting and when it pans over to the next scene, only Ian is in the background sitting in the truck and his friend is missing.Finally, the pacing for this movie isn't the best on building up for certain moments with the character's throughout this movie and it actually sort of ruins the characters.Overall, it's not a bad comedy at all, it can be pretty funny throughout, it's just there's some unfunny moments and some not so good pacing to build up towards certain moments."
    }
  ],
  "recommendations": [
    "rough_night",
    "the_other_guys",
    "21_jump_street",
    "neighbors",
    "jackass_presents_bad_grandpa",
    "what_happens_in_vegas",
    "forgetting_sarah_marshall",
    "the_proposal",
    "friends_with_benefits",
    "30_minutes_or_less",
    "trainwreck",
    "this_means_war",
    "the_change_up",
    "identity_thief",
    "dirty_grandpa",
    "tammy",
    "hall_pass",
    "22_jump_street",
    "little_fockers",
    "date_night",
    "the_spy_who_dumped_me",
    "my_spy",
    "bridesmaids",
    "27_dresses",
    "pitch_perfect_2"
  ]
}