{"id": 4011, "title": "Sextuplets", "starring": ["Marlon Wayans", "Michael Ian Black"], "runtime": 100, "genre": ["Comedy"], "description": "Father-to-be Alan is shocked to learn that he was born a sextuplet. With his newfound brother Russell riding shotgun, the duo sets out on a hilarious journey to reunite with their remaining long-lost siblings.", "releaseYear": "2019", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/ztGSEcowBoHyRwcK0s5kIKVVXwy.jpg", "categories": {"plot": 4.857142857142857, "acting": 5.333333333333333, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 0.0, "funny": 5.5, "action": 5.0}, "reviews": [{"rating": "8", "text": "HILARIOUS!!! I don’t know what these critics talking about, Marlon had me WEAK!!!"}, {"rating": "2", "text": "I rarely give a film less than a 3 rating but this piece of garbage deserves it. This film is such a slapped together piece of junk. The first two minutes contain so much exposition that it feels like the filmmakers pitched this to an audience of simpletons. Every stereotype you could think of appears in each character starting with Marlon Wayans weak and simple son-in-law but continues with the dumb white guy, the Russian slutty thief, the **** female boss, the unapproving father-in-law and even the characters of each sibling, which each are worse than the last. There is a scene where someone unwittingly donates a kidney, even tries to escape and winds up getting his kidney taken by a hospital of Doctors which seems more like a horror-movie than a comedy. The only reason this film gets anything higher than a zero are the well done special effects and the passable cinematography."}, {"rating": "10", "text": "If you liked White Chicks, then you're gonna love this movie. My favorite character : Dawn. Iconic already. Marlon, hands down !"}, {"rating": "2", "text": "Marlon Wayans peaked on Scary Movie 2. He stopped being funny after that. And for that this film is shame like most of his work."}, {"rating": "0", "text": "Horrible. I knew it was bad before playing it, thought I could just make fun of it. Had to click away after fifteen minutes. Everything is wrong and bad. Why is Netflix promoting this piece of **** so much? Are they trying to lose customers to Disney+?"}, {"rating": "6", "text": "Sextuplets: Stream it or leave it?And we’re back from summer break! I hope you all missed our reviews but we won’t keep you waiting that long again. This week Netflix brought to us a family comedy, Sextuplets. Sextuplets features Marlon Wayans, as Alan, a soon to be father struggling to fit into his wife’s family because Alan grew up without a similar family structure. As an orphan, Alan never knew his family, but after some pulled strings Alan finds his long lost brother. Together they find out they are actually sextuplets. From here, we follow the two on their adventure to find the rest of the siblings and the uncanny resemblances.Let’s talk about what is impressive about this movie instead the obvious problems. Marlon does a great job of bringing us 7 completely different characters. He channeled everything he had to bring us a current expression of what we loved in Nutty Professor or Coming to America. Marlon plays all six sextuplets, Alan, Russell, Dawn, Jaspar, Ethan, Baby Pete. Marlon gives us 6 different characters, personalities, mannerisms, dialects, voices, and speech patterns. This was hard work and I hope ultimately for him very rewarding piece of work. I truly did enjoy watching Marlon at work in this film and not just for the comedy aspects. Marlon displayed some true acting at times as Alan and he probably should start venturing into more of those Kevin Hart type drama comedy movies (dramedy). He always does a great job of fully immersing himself into his roles while giving performances that are full of energy at all times. Marlon’s energy literally pops off the screen, especially on his now cancelled tv show Marlon or his Netflix movie Naked.Now, unfortunately, this movie is bad but don’t get me wrong you’ll laugh your butt off. Plot = Predictable. Storyline = Predictable. Comedy = typical Marlon behavior. BUT WITH ALL THAT SAID, the movie is still funny. Honestly, the movie industry needs a few more movies like this now in the mainstream. A classic family friendly comedy that everyone can sit around and enjoy. Would this be a blockbuster in the theaters? Definitely not but on a streaming service it fits perfectly.Long story short, Marlon is capable of keeping anyone entertained for and hour and half. The predictable storyline will have you bored but Marlon will make you cry and laugh out loud all in one. This isn’t a must see on Netflix but grab a bowl of popcorn and enjoy the laughs with your family. Stream it.The Stream: Classic Marlon going overboard.The Big Screen: A family movie with Classic Marlon going over board.The Final Bill: This is for all of you that love a good corny laugh and over the top stereotype displays with Marlon doing it all.-S2S"}], "recommendations": ["wanderlust", "little_fockers", "a_million_ways_to_die_in_the_west", "sisters", "neighbors", "tammy", "trainwreck", "ted_2", "step_brothers", "thunder_force", "sandy_wexler", "blended", "funny_people", "friends_with_benefits", "little_miss_sunshine", "this_is_the_end", "ted", "paul_blart_mall_cop", "dinner_for_schmucks", "dodgeball_a_true_underdog_story", "identity_thief", "rough_night", "dirty_grandpa", "burn_after_reading", "tower_heist"]}