{
  "id": 848,
  "title": "Shadow in the Cloud",
  "starring": [
    "Chloë Grace Moretz",
    "Nick Robinson"
  ],
  "runtime": 83,
  "genre": [
    "Horror",
    "Action",
    "War"
  ],
  "description": "A WWII pilot traveling with top secret documents on a B-17 Flying Fortress encounters an evil presence on board the flight.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/t7EUMSlfUN3jUSZUJOLURAzJzZs.jpg",
  "categories": {
    "plot": 4.636363636363637,
    "acting": 3.8421052631578947,
    "ending": 5.714285714285714,
    "soundtrack": 1.25,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 5.8
  },
  "reviews": [
    {
      "rating": "1",
      "text": "This is the new kind of writing. No depth, just to make a silly point. It's all about gender politics, so best is to skip this brainwash material."
    },
    {
      "rating": "0",
      "text": "January 1 and we already have contender for the worst movie of 2021.Plot is insanely stupid, horror - nonexistent and writers clearly have deep hatred for men.Moretz is stuning and brave, she can fix everything, shoot enemy planes and can beat monsters in hand to hand combat... On the contrast, all male characters act like incompetent idiots and talks like scum. Because, you know, every soldier in WW II was a masogynist. Don't waste your time on this trash. This movie is not one of those \"so bad that it's good\", it's just bad. Really bad."
    },
    {
      "rating": "4",
      "text": "This was a really dumb movie. Yet somehow quite watchable. Tries to string too many concepts into its short runtime and the ridiculous Mary Sue lead makes things a tough sell (inexplicably talented fighter whose broken arm and finger seem to heal miraculously!)."
    },
    {
      "rating": "3",
      "text": "I didn't catch the overt political vibes people here are discussing. But I can say this movie was pretty bad."
    },
    {
      "rating": "0",
      "text": "This movie is the biggest **** I have ever seen , absolute garbage and mess of a movie. Super unrealistic and most of the music and scenes are unberable. Please give ot a pass and it looks like the director has no idea how to make    a proper movie ."
    },
    {
      "rating": "1",
      "text": "WTF was that? Complete waste of time. If i only knew how bad was this, i would deffinetely do something else instead of losing 83 minutes of my life."
    },
    {
      "rating": "3",
      "text": "I believe we can split the movie into 2 parts, the first half had a good idea, the mysterious story,.... but as soon as the second half starts it looks like the writer forget everything and tried to create a new superhero who saved everyone single-handedly. I mean come on! she was walking upside down outside of a moving airplane, even spiderman couldn't do that! and beat the monster with punches while everyone was watching! it could've been a good movie but the idea wasted"
    },
    {
      "rating": "0",
      "text": "This movie might appeal to kids because it seems to be written by one.  Unbelievable action even more ridiculous than any mission impossible film, copies storyline’s from a few different movies, and completely unnecessary male chauvinism. If your of the Tik Tok no attention span generation that needs 20 plot twists to be entertained or stoned you might enjoy this."
    },
    {
      "rating": "2",
      "text": "I refuse to give this movie any of my vastly available mental energy it is that bad. Men bad, women good.I hope Chloe Grace Moretz was contractually obligated to do this movie. If not, I can't imgaine the type of boys in her life that made her think \"yeah, this is how grown boys are.\""
    },
    {
      "rating": "2",
      "text": "Just awful. Horrible script and even worse acting. How this was even greenlighted I'll never know."
    },
    {
      "rating": "1",
      "text": "Worst movie I have ever f****** seen this made Wonder woman look like a f****** Oscar winning movie and Wonder woman 1984 sucked even worse the plot sucked the acting sucked inaccurate f****** description of world war II she just about knew everything and started using martial arts on the gremlin dummy to win a battle and the movie and I with her breastfeeding her baby that should have been dead by now on that leather bag"
    },
    {
      "rating": "0",
      "text": "Absolute unmitigated worthless garbage. I rarely see such worthless trash as this one. It has no redeeming qualities. I rarely wanted 1,5 hrs of my life back as much as after watching this.. It's basically an hour and a half of sticking to men while they just stand on the sidewalk with open mouth. I thought first that the music might be fitting, but more than 1 point in the film it was more distracting than fitting. After the mystical element was introduced with the gremlin, I expected the package to be somewhat connected to that. The movie would have been better if it would focus more on the mystical line. I don't mind the female lead at all but the fact that she saved literally everyone multiple times while all men were just babbling idiots on the side-lines there only to be hindering, berating, and eventually graveling on their knees in front of the main lead made this movie painful to watch. Characters were uninteresting to watch other than the main lead, I guess my main problem with this movie is that other than the main lead, the rest of the cast was forgettable, interchangeable, they had no story or focus, almost like the whole plane and mission could have been completed by the main lead alone. I expected significantly more from this move, but ultimately, it did not worth my time, it's not something I'd recommend to anybody for any reason other than torture."
    },
    {
      "rating": "0",
      "text": "An 80 minute movie that is 60 minutes too long.  Cheaply made, cheaply acted, zero investment in any of these characters.  Its just noisy stuff happening and terrible accents saying whatever to move things along.  I was rooting for a bomb to hit the plane after five minutes to put everyone out of their misery.. including me."
    },
    {
      "rating": "2",
      "text": "Was this meant to be about female empowerment or like how a mothers love for their child give them a fight and will like no other? If that's what they were going for, IMO they still massively missed the mark. I like weird movies but this was real bad."
    },
    {
      "rating": "0",
      "text": "Never knew you could give a movie a zero score, but ever there was one this is it the one.  This was an absolutely worthless story. The writer and editor of this movie should be taken out back and beaten.  Since Chloës' career isn't going anywhere I guess she did it for a paycheck."
    },
    {
      "rating": "1",
      "text": "OMG. What a story Mark. I really enjoyed Chloë Grace Moretz acting in kick ass but here. The script is so bad that its disgusting. IDK what was the reason why Ms Moretz was okey to take part of this thing. WOKE rating 10/10"
    },
    {
      "rating": "0",
      "text": "Merely rubbish. Of course this is how most of the 2020 movies turned out to be. How stupid could someone be to waste their time for such a disappointing failure."
    },
    {
      "rating": "0",
      "text": "NO. No, no, no... and I thought WW84 was bad. This movie is at least 20 years late. So obvious.  So childish and over the top. I guess those pilot ladies on the credits must be turning on their graves."
    },
    {
      "rating": "2",
      "text": "The stars were for the production quality - it did feel like the movie Overlord in style. Typical modern throw-away movie filled with woke ideology. The main character makes it a point to chastise one of the guys for saying \"dames\", totally takes you out of the movie. Sloppy script, there's a reference to Bigfoot which really wasn't a popular culture reference until 1958 - and this movie takes place in 1943. Then at the end to presumably dedicate the movie to all the prior female military pilots...she didn't even fly the plane! Ultimately it just feels like they had the actors in front of a green screen most of the time to save money, and no real character development."
    },
    {
      "rating": "0",
      "text": "Absolute garbage. Why anyone would still consider hiring this terrible actress is a mystery. Story was god awful too."
    },
    {
      "rating": "0",
      "text": "So my first written rewire was removed, no information why.So boring, you could cut this movie down by half and you would not miss much.Leading character is a Mary Sue and every man in this movie is sexist and weak.End scene says it all: The men watch when she fights, then they watch when she breastfeeds.Lets see how long this stays up?"
    },
    {
      "rating": "1",
      "text": "That was really bad. The technical quality is fine. But the scenario is full of nonsense which culminates in one big wtf at the end."
    },
    {
      "rating": "2",
      "text": "The movie starts out interesting and mysterious, then in a matter of minutes devolves into one of stupidest and just plain bad movies ive ever seen. Chloe Mortez deverves better than this trash film."
    },
    {
      "rating": "1",
      "text": "Wow this movie is bad. The pacing is bad, the acting and writing is bad but what the hell is with the alien. Someone explain."
    },
    {
      "rating": "0",
      "text": "Worst movie I've ever seen. How do actors volunteer time to participate in something so trash?"
    },
    {
      "rating": "1",
      "text": "Wokeness in the cloud. Can't the film industry learn to write \"strong' female characters without going totally over the top and spitting out feminist propaganda. But this type of writing is all too common in our current age, and seems that most everything getting greenlight in the film industry follows this same terrible framework. A bad start to 2021."
    },
    {
      "rating": "3",
      "text": "This B movie horror/action film could've been one of those 'so bad it's good' films, but sadly its annoyingly heavy-handed feminist take on the genre puts it squarely in the 'so bad it's BAD' category, the opening 40s style cartoon was fun though - 3 stars"
    },
    {
      "rating": "0",
      "text": "I have no idea what I just watched, but I do know it was intended to be blatant and deceiving woke propaganda.The beginning of the movie is kinda ok. Even the supernatural stuff. It is very unrealistic from the start (like a B17 landing right over her head and then she doesnt move and suddenly she stands right under another stopped B17, or no oxygen needed on a Pacific flight - yet they do have filled oxygen tanks that play a role later, or the temperature on board in that altitude). But it keeps you interested for a good while.The issue isnt really the female protagonist or a completely incompetent \"diversity\" token co-pilot (you do know what youre doing with such a depiction, director, do you?), its that the movie suddenly takes a hard woke/crazy/ridiculousness turn in the middle, that just makes you feel like you have just been conned by the director and writer (interestingly woke directors use that tactic a lot in movies and series - I wonder why... no I dont). Even the music turns to absolute garbage all of the sudden (not that it was fitting for the times depicted in the first place).Turns out the whole movie was just about giving it to men and pointing out that women served in WW2 and can scream very loud for no reason (I thought thats an old stereotype they wanted to get rid of?) and can develop literal super powers and freeze enemies in fear so that they let themselves get killed without any defense.To the director and writer: If you wanted to show the female heroes of WW2, then you should have made a documentary about them. Those were real heroes and a vital part in the effort to win WW2 (even, or especially in Russia). With crap like this you make fun of them. Not only that, you demean the male heroes of WW2 and divide present societies, paving the way for new conflicts and ultimately wars.Disgusting."
    },
    {
      "rating": "3",
      "text": "I had high hopes from this movie since i watched it's trailer on youtube. I really don't know who is to be blamed here for destroying this concept which had a lot of potential in it. This movie could have been an awesome survial/horror or a War/Drama but rather they made it a B grade pointless joke. This concept (where a young beautiful chick got stuck on a flight with few military dudes and she later turns out to be more bad ass than them) could have served a lot better than it actually did on the screen. I feel sorry for them to destroy it."
    },
    {
      "rating": "1",
      "text": "The only good thing is the paycheck for actors. Crazy woke propaganda and competely missed opportunity. Didn't expect much but this is even worse. This movie will be either forgotten tomorrow or it will be a mark of peak of cinema wokeness in history."
    },
    {
      "rating": "0",
      "text": "the First 30 minutes are somewhat ok ... after that its breathtaking shix -1!"
    },
    {
      "rating": "0",
      "text": "A promising movie turned into a joke, wast of ressources , watch the movie and you will understand nothing to add."
    },
    {
      "rating": "7",
      "text": "This movie was a complete surprise.  Is it a traditional movie...no.  It is an over the top original idea joy ride."
    },
    {
      "rating": "10",
      "text": "Was actually surprised, I didn’t think I would enjoy it but it was better than a lot of movies I have seen in 2020. A lot of the criticism that i see about this movie is how things aren’t “believable” or “physics/science accurate” it’s supposed to be a fun movie that doesn’t take itself seriously so just have fun with it."
    },
    {
      "rating": "8",
      "text": "This is one of the craziest films of recent memory and it's all the more fun for it. Moretz is committed to the madness and commands your full attention. Great direction elevates it above B status."
    },
    {
      "rating": "1",
      "text": "This is now my #1 worst film, knocking off Resident Evil from the top perch after almost 20 years.  This film is absolutely terrible, but worse than that it's unusual in the extreme.  It somehow manages to get much worse as you progress, ending on the low-note of a baby crying and a mother breast feeding as actual \"scenes\".  I think this film is aimed at the sort of people who find Jacinda Ardern inspiring (for example) and potentially single mothers with 5+ illegitimate children to different fathers.  They potentially could make more sense of this train wreck of a film.  Any sane person should distance themselves from this mess at all costs."
    },
    {
      "rating": "10",
      "text": "Well, that was ridiculously entertaining and fun. It’s so refreshing to watch a film that does its own thing without trying to fit into one of the established genres."
    },
    {
      "rating": "8",
      "text": "I thought this movie was fun from start to finish.  I'd only ever liked Chloe Grace Moretz from when she was in the first  Kick A** movie, and nothing since, but she was really really good in this, as the only person on screen for 85% of the movie she carried the whole thing.  What a great little treat.  Recommended."
    },
    {
      "rating": "10",
      "text": "I'm giving it a 10 to even out the 0 scores it's getting for being too \"woke\". I'd give this movie about a 7 normally.  I had a total blast with this one. Part creature feature, part WW2 fighter pilot movie, all pulp and mystery. The first half of the movie is a claustrophobic mystery, as the story begins to unfold and twists are laid out. The second half is a pulse-pounding, over-the-top action movie. The final third was just the cherry on top, with an ending that for me, elevated it to something a bit more than your typical pulp. It's so hard not to spoil it, but it's very apparent it was written and directed by a woman in the best way possible and I even felt empowered. I'm going to definitely be buying this when it comes out on Blu-Ray, but I wouldn't rent it for the $20 bucks. One thing I love about this movie, even though it's pulp, it takes itself seriously and actually works on being a good movie and not just trying to be so bad it's good. Reminded me a bit of Overlord, though that movie was a bit better. Chloe Grace Moretz was so awesome in this one, I'm hoping this won't be the last adventure she takes this character on. This film was originally going to be written and directed by Max Landis, he has a writing credit, but his script was very short and changed drastically to what we got on screen.  Good riddance to him, I'm glad we got some new talent on the screen."
    },
    {
      "rating": "8",
      "text": "original story and fun over the top fantasy movie with some grindhouse vibe going. chloe grace moretz' performance had me on the edge of my seat. has me looking forward to seeing other movies about women in WWII"
    },
    {
      "rating": "10",
      "text": "What?!?! What a hell i just saw here!!! Wh wh what? The movie dont deserve a 10 but for sure is not a 3, its above average, its entertain as supposed to be!! The bad reviews when they complain about feminism, camon guys, if is a guy as protagonist people will complain only about the exaggerated scenes but now basises the unrealistic crazy scenes some **** morron need to complain about the girl, the female plot and bla bla bla ... is a action movie... the premisse and message of what the movie try to send, for me, is mission accomplished!!!"
    },
    {
      "rating": "10",
      "text": "This one is bloody fantastic!!! I was prepared for a total low budget disaster, but its a hell if an enjoyable ride and a lesson in budget-constraint movie making. Great storytelling, great ideas to circumvent expensive shots yet deliver thrills and fun. Oh, and WETA made some great creature FX. Thumbs up."
    },
    {
      "rating": "10",
      "text": "Just suspend your belief in reality and enjoy the craziness. Roller-coaster ride"
    },
    {
      "rating": "9",
      "text": "Approaches Spielberg in its simplicity, emotional depth of main character and and using \"absolute implausibility\" to disorient viewers so no telling what will happen next in this B+ genre romp.  A film MADE BY WOMEN about a STRONG WOMAN.  If you don't care about this, see another movie.  Because everything else is downplayed.  \"Moretz’s ferociously effective, expressive work\" keeps the show from stalling.  Also Outstanding is WETA's creature work. Technically this is way beyond  Gollum, WETA's best creature work to date?"
    },
    {
      "rating": "6",
      "text": "This was very entertaining, but the movie and plot hinged on the fact that Chloe Grace Moretz can really sell what she’s given to work with. If you're not at all invested in her character then this will not be a fun film for you to watch. The film has a ton of atmosphere and is really quite good, until it jumps the shark with a questionable back story that set everything into motion. Then came the jarring action movie antics that moved this into the “so bad it’s good” territory. The plot devices and twists don’t make any sense. What started out as good and well paced dialogue became every character being very ham fisted with shoving current gender roll politics into every shot. The lines of dialogue at the climax and resolution of the movie made the person watching this with me say “this is why you need a studio to step in when your good ideas become a lame student film project with a budget.” If you like roller coaster rides and can easily suspend your disbelief then this could be something you’d get a kick out of. Otherwise steer clear."
    },
    {
      "rating": "5",
      "text": "The incels are mad. Frankly, I was hoping for something different, but basically, Shadow in the Cloud, ends up being a mixture of attractive ideas, but unluckily doesn't manage to land any of them gracefully.Much of its short duration deals with Chloe Grace Moretz locked up in a small cabin listening to her male companions making sexist jokes about her, to of course give a social message about feminism, while at the same time, with her in there, we have a small subplot that copies Nightmare at 20,000 Feet from The Twilight Zone, to then become an action film in its last 25 minutes.Like I said, it's a strange mix, but hardly outstanding or rewarding.I liked the soundtrack though."
    },
    {
      "rating": "8",
      "text": "I love Ms moretz acting and she did well in this filmI love action films,too.So blending both of them was great!Excuse me if you didn't understand my meaning."
    },
    {
      "rating": "4",
      "text": "This movie still manages to be entertaining despite the bad score and writing"
    },
    {
      "rating": "10",
      "text": "The entire movie should have taken place in the ball turret and shown her ability to carry it all by herself."
    },
    {
      "rating": "7",
      "text": "This film surprised me in a way I didn't expect. Reading the plot for the film, I thought it was a ridiculous/poor idea for a film to combine sci-fi with war. But after watching it, I am happy to say that this movie was better than expected. In no way is the movie perfect, but combine the surprisingly awesome actions scenes and great performances from Moretz and Robinson, this film is perfect for anyone looking for a fun action movie."
    }
  ]
}