{
  "id": 2809,
  "title": "Shame",
  "starring": [
    "Michael Fassbender",
    "Carey Mulligan"
  ],
  "runtime": 102,
  "genre": [
    "Drama"
  ],
  "description": "Brandon, a thirty-something man living in New York, eludes intimacy with women but feeds his deepest desires with a compulsive addiction to sex. When his younger sister temporarily moves into his apartment, stirring up bitter memories of their shared painful past, Brandon's life, like his fragile mind, gets out of control.",
  "releaseYear": "2011",
  "mpaaRating": "NC-17",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aywgzSw9LK4z3DxMPZsNbzWYqQ1.jpg",
  "categories": {
    "plot": 6.956521739130435,
    "acting": 7.853658536585366,
    "ending": 6.636363636363637,
    "soundtrack": 8.333333333333334,
    "cinematography": 8.5,
    "familyFriendly": 9.0,
    "funny": 6.0,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Despite a go-for-broke performance by Michael Fassbender, Shame never really digs deeply enough into the the guilt and self-loathing that the central character has obviously intertwined with sex as a result of his Irish upbringing.  The resulting movie is neither emotionally raw or sexually explicit enough (despite the dreaded NC-17 rating) to leave much of an impression."
    },
    {
      "rating": "7",
      "text": "Shame: I thought it started off well, studying the main character's sexual addiction. However, as the movie went on, it lost steam. Carey Mulligan's character was distracting and I thought it hurt the movie overall. Michael Fassbender and Carey Mulligen did give very daring performance."
    },
    {
      "rating": "5",
      "text": "Never really delivers and over long for it's content; this is act 1 of the film this could have been. The mood and atmosphere are great , and there are some powerful cinematic moments, but this lacks plot and/or enough depth to it's back story (dysfunctional family / siblings) to really engage with. We just get an emotionally dysfunctional bloke who cant quite get it together; all moody and existential. In the end I did n't really care that much for him or what happened to him and, here's the spoiler, he ends up out in the rain, all sad and crying. boo hoo."
    },
    {
      "rating": "6",
      "text": "Michael Fassbender is the reason this film had its moments of subtle brillance. I was in awe of the way he is able to construct the feeling of a scene only by the expression on his face as he tries to make a life of normalcy while fighting his private demons. My main complaint with this film though was the inability to bring the characters out more, I felt disconnected from the cast of this film, which made it hard to feel anything at the end of the film because you dont feel sorry nor happy for anyone. Just a general numbness. I would give this film a 6.4 out of 10, a compelling insight to a man struggling to deal with his own personality."
    },
    {
      "rating": "10",
      "text": "I like dark movies. But saying that \"Shame\" is dark doesn't make justice to it. I loved \"Shame\" because it's poetically dark and not just that. It is poetically dark in the right way, the Baudelaire way. And Sissy is \"La fleur du mal\" with a scent too strong for Brandon. After all, she is his sister. It can't get simpler than that. And that is just disturbing! Intimate, personal and hopeless decent into the deep darkness of men's weak hearth."
    },
    {
      "rating": "9",
      "text": "A haunting, horrifying, and harrowing portrayal of self-hatred, Shame is a dreadfully melancholy and truly abrasive look at the spiral one can go through when suffering. With an incredible lead performance from Michael Fassbender anchoring Steve McQueen's exploration of sex addiction, self loathing, and depression, Shame is a film unlike many others. It takes real courage to explore sex addiction in a meaningful way, as many write it off as something that is impossible to be addicted to and, as such, not a real addiction. Instead, sex addicts are cast aside as dirty perverts who are the shame of society. As Brandon Sullivan (Fassbender) shows, however, he does not enjoy sex. It is a need. It provides a momentary high and then he comes crashing back down to earth into a rapidly spiraling out of control mire of self hatred.From the very beginning of the film, McQueen adorns his film with shades of blue and gray. Melancholy and depressing colors, Brandon wears a gray jacket with a blue scarf daily. The scenes behind him at home, work, and on the subway, are covered with grays and blues. This colorization truly sets the scene for the film, which is incredibly depressing and a dark look at depression as a whole, both through Brandon and his sister Sissy (Carey Mulligan). In many ways, Sissy is just like Brandon. When he finds her unexpectedly in his apartment, she is in the shower and has no problems with Brandon seeing her naked. The two of them are incredibly open with one another to the point that she has sex in Brandon's bed with him in the other room and makes out with a guy in a cab right next to Brandon. The two know the other is a sexual being, but they have a similarity: they use sex to disguise the pain. Sissy is suicidal with numerous scars on her arms and flirts with jumping in front of a pain. Brandon himself sort of just mopes around the film, rejecting human companionship of any kind in favor of short lasting jolts of sexual energy with random people. For Brandon, he is straight, but will pay for sex, pick up women, watch porn, read porn, or accept sex from men. Anything to get his fix fits the bill and it is how he covers up the pain. Sissy, in the short time we see her, seemingly does the same thing with references to past lovers and an obsession with her current lover. Thus, she is far less fleeting and more concerned with finding long-term connections with somebody who can mend her broken pieces. Unfortunately, she cannot find this person, as she is unable to fix herself first.In its exhaustive sex scenes, Shame may turn off more than a few viewers. However, if you watch the film and go with it, it becomes clear that this is not an erotic film. The sex scenes are depressive. They are cathartic for Brandon as he gets his fix, but it continues to fuel his spiral of self loathing. It is clear he is disgusted with himself. He feels intense shame to the point that he throws out of all his porn magazines, computer, and anything else that is of a sexual nature. He tries to move on and become normal. He goes on a date with a woman from work and tries to be nice without taking her home on the first date. However, once he has sex with her, it does not do it for him. He must get his fix, so he calls up a random girl and has sex with her instead. He follows up it with a threesome towards the end of the film and a random encounter with a guy. Though he does these things, it is not voluntary. Brandon is addicted to sex, yes, but he keeps indulging in this addiction because he cannot stand himself. Looking in the mirror is a tiring task and, when he does, he does not like what he sees. Undeniably, Brandon is suicidal and suffering from intense depression. Sex does not even make him happy, he merely goes through the motions because it has become the norm. Actually meaningful sex is a foreign concept to him and one that is no longer able to perform. Cheap throwaway sex with random women is the only thing that keeps him going. Unfortunately, it only feeds his self-hatred as he becomes even more depressed that he is so alone. His addiction leaves him unable to find a companion for longer than four months or, as is often the case, a single night. It is this spiral that makes the film only slightly one about sex addiction. Rather, it is a film about how people cope. For Brandon, it is via sex (which is certainly addicted to) and it is the only way he can make himself feel. For Sissy, it is through cutting herself and throwing herself into relationships.A tragic and often hard to watch film, Shame shines a lot on the depravity one can do to themselves when they do not love themselves. Brandon Sullivan is one of the most depressed characters in a film in recent years and Fassbender truly brings him to life in a shockingly brilliant performance. Alongside him, Carey Mulligan breathes life into Sissy, who is equally as depressive as her brother. Together, they make one somber and melancholy duo."
    },
    {
      "rating": "1",
      "text": "Painfully boring. Fastblender is wasted on this nonsensical bore of a movie. its tedious, unsurprising and just fails to be interesting. The subject matter is too shallow for a movie that takes itself waaaaay to seriously about a guy who's really hung up on getting off. its not as if every man hasnt had urges, also the subplot with the sister feels like extra padding.They couldnt just show Fastblender jerking off or battling his wet noodle for the majority of the movie. Just skip it."
    },
    {
      "rating": "9",
      "text": "Shame is the mixture of melancholy and human spirit; it gives a strong statement on how human emotions malfunction sometimes which could lead to self destruction."
    },
    {
      "rating": "10",
      "text": "One of the most thought provoking films regarding a subject not often talked about. Fassbender gives a truly tortured  performance worthy of at least an Oscar nomination."
    },
    {
      "rating": "10",
      "text": "From time to time a movie arrives in cinemas that will leave such an impression that no matter what you do, itâ"
    },
    {
      "rating": "8",
      "text": "Hunger is an uncompromising drama in which Fassbender bears body and soul in film difficult to watch yet impossible to turn away from.  It is only the second collaboration with McQueen, but considering the first one (Hunger) was also equally harrowing, I suspect and hope of more to come.  But, it would wrong not to mention Mulligan who delivers yet another unflinching performance, and a mesmerizing rendition of \"New York, New York\".  As it would be wrong to neglect the impact of the music from Bach."
    },
    {
      "rating": "10",
      "text": "extraordinary film, Steve McQueen played with history as it had to be, every angle, every detail perfect. I imprisoned in his beauty from the first scene, nude natural, wild, exciting. Fassbender brother, you ought to be nominated for an Oscar; Mulligan majestic, spectacular entire cast. Installation, spectacular music! amazing photography."
    },
    {
      "rating": "4",
      "text": "Shame summarizes its own fundamental problem in Carey Mulligan's line, \"We're not bad, we just come from a bad place.\" The bad place that Sissy and Brandon come from is where others have moved on to more au courant dysfunctions, while Brandon got left behind with a circa-1995 sex addiction and Sissy got left behind with the depression fostered by having a brother with a circa-1995 sex addiction. It's remotely possible that the movie might have made something interesting of this notion of being left behind - the unsexy out-of-dateness of Brandon's sex addiction - but Shame evinces a nearly absolute lack of self-awareness of the difficulties it brings upon itself by attempting to engage a topic that no longer has much cultural currency. There's a glimmer of promise when Brandon, on a date with his co-worker Marianne, asks her to feel a bump on the back of his head and explains, playfully, that he's a Neanderthal (and then goes on to describe the childhood mishap that actually produced the bump). It's worth noting that the exchange of dialogue in this scene is practically the only passage in the movie that doesn't feel oppressively contrived. A viewer who hasn't yet given up might suppose that Shame is finally pushing through to a recognition of Brandon as belonging to the wrong era: he has the misfortune to be the Neanderthal who survived the extinction of the culture's interest in sex addiction. All he's survived, though, in the constricted view that the movie is willing to allow itself, is a vaguely dysfunctional childhood in New Jersey. Curiously, the movie alludes ambiguously to a different (the same?) childhood in Ireland. The Irish childhood is another glimmer of promise; it suggests a whole other larger context, in which Brandon's struggles with himself derive from and are justified by a formative guilt-laden Irish Catholic upbringing (in Ireland, so much more guilt-laden than New Jersey can ever be). In this context, Brandon fits plausibly into the movie's frame because his origin is from outside the movie's setting. As a New Yorker with a sex addiction, he's an anachronism, but as an Irish immigrant, he's an outsider grappling with a plausible burden. But to make the Irish-immigrant narrative plausible, the movie would need to allow itself room to explore the larger context, and this is exactly what the movie rigorously declines to do."
    },
    {
      "rating": "5",
      "text": "To be honest, I do not get enough sex any more to qualify as an expert on sexual addiction. I found the film to be rather boring and quite predictable. I knew some one was going to end up dead or close to it. I also found the route that the film took to be more of the cheap thrill mixed in with something out of the old film \"Wolfen\". Why did he change into an animal when having sex, why was he masturbating all of the time, when did he sleep, how did he manage to get to work, why was the gay scene so much sleazier?  The whole NC-17 rating is a joke. The film got that because I saw a penis? A boring film that lost my attention early on."
    },
    {
      "rating": "3",
      "text": "I wish I could give this movie a good rating.  Its starts with a fairly handsome guy, nicely built in all proportions, who is a sex addict.  Sometimes he gets what he wants (always friendly; this guy does not rape), but on other occasions he cannot produce.  His sister lives with him, and she appears to be on the verge of suicide from Day One, making this film complicated and dark.  The guy, who suddenly seems to have lost interest and or ability to perform sex, plus put up with the antics of his sister, walks endlessly through the night streets of Manhattan, or jogs and jogs, or rides half-filled, old newspaper-littered subway trains endlessly.  These scenes where he's losing himself, or possibly trying to find a way out of sexual addiction go on and on -- making this 1-hour, 45-minute film seem like a 5-hour ride on a dirty subway train.  There are good street shots of Manhattan, but at the now-famous Standard hotel on the High Line, they miss the opportunity to have the woman bracing herself against the picture glass picture windows while being pumped from behind - something that supposedly happens regularly in real life every night - much to the delight of High Line voyeurs.  Why does the film shy away from the big window scenes - maybe a nod to hotel management's requests?  Go see, but I think you may be disappointed too."
    },
    {
      "rating": "10",
      "text": "I will not say that this is the best movie I ever seen, but damn, it's pretty close. Amazing acting, directing, am sure that it will be strong contender at the Academy Awards, at least for acting."
    },
    {
      "rating": "10",
      "text": "If Michael Fassbender is not winning an Oscar for his mezmerizing and pitch perfect act in Shame, then everyone's going blind. Ebery psychiatrist should watch this before retirement."
    },
    {
      "rating": "8",
      "text": "If you're going to push the envelope then push it don't just move it around on the coffee table and then pretend you've opened it and read the contents.  Had the writer explored just a bit more the relationship between Brandon and Sissy.  There's more too these two than meets the eye.  Siblings with that type of comfort level with each other's nudity wreaks of some behavior that is truly the cause of where these two have found themselves.  The direction by Steve Mc Queen is taut and taunt.  He's not revealed a lot about his two protoganists that would let us understand how they got here but he has explored and revealed how they've ended up.  The final scene leaves more questions than it answers.  Mulligan is satisfying in the role of Sissy but she's not given a great deal to work with.  The winner here is Fassbender who is amazing but at times painful to watch.  The sex addiction is truly explored and even though it's a bit difficult to relate too you empathize a bit with Brandon because he just seems better than what he's become and he knows it.  Not a great film because there are holes in this screenplay.  The music was appropriate and the cinematography underscored the total concept.  Gritty and worth watching Fassbender.  The expression of emotions that paint his face during scenes are some of the best language not spoken in cinema."
    },
    {
      "rating": "9",
      "text": "Probably one of the best films I've seen this year.  What can I say that most already know; Fassbender is having a really awesome year and this year shows it.  This is actually the first I've heard of Steve McQueen the director and I gotta say he's given me a good first impression.  The shots and acting overall (along with Mulligan) were great, but the only gripe I had was that some shots dragged on too long, but still looked great nontheless."
    },
    {
      "rating": "9",
      "text": "A truly powerful film that succeeds with it's dramatic effect because of two outstanding areas. These areas are the acting of Michael Fassbender and the audio visual experience Steve Mcquean creates. If the direction wasnt so good the film would be boring and a drag. If the acting werent so good there would have been the same problem. Overall a powerhouse dramatic effect that is difficult to watch but you just cant stop watching it. Just like Ebert I don't believe I could see it twice."
    },
    {
      "rating": "10",
      "text": "Fassbander and Mulligan are raw and naked and bare - both physically and emotionally - in this movie and it makes for a compelling experience:Full review:http://luhathoughts.blogspot.com/2011/12/its-shame.html"
    },
    {
      "rating": "6",
      "text": "Clinical in its core, Shame is an aestheticized rendering of a case-study of the sex addiction of a generic corporate-type (played by the ungeneric Fassbender).  But all of its supposed ugly reality of a not-much-talked-about affliction is a bit misplaced by the directorâ"
    },
    {
      "rating": "10",
      "text": "Brilliantly and beautifully filmed.  Perfect cinematography for the subject --- capturing its essence.  the acting is superb and the directing is seamless and close to perfection."
    },
    {
      "rating": "9",
      "text": "Finally a film could knock down HUGO (2011) and a leading male performance could overcome THE ARTISTâ"
    },
    {
      "rating": "10",
      "text": "Strong film really, Shame hit me. The story is can be simple but the direction is amazing, have much interesting ideas, and the development is amazing, the cast is really awesome, Michael Fassbender and Carey Mulligan wow, awesome cast. I don't have most words to say, Shame is fantastic and strong."
    },
    {
      "rating": "3",
      "text": "Shame is an empty pointless film. Steve McQueen draws out certain scenes way beyond their breaking point. At times the movie felt like it might start to take off, but in a blink of an eye, falls back into a bottomless pit of pretentious trash."
    },
    {
      "rating": "9",
      "text": "Very good story. Many guys have a private dark side that no one knows about and this movie cleverly brings that to the big screen. Its a little hard core for some but it is well directed and Michael Fassbender is excellent in it. Definitely worth the watch."
    },
    {
      "rating": "9",
      "text": "Shame is brutally honest. It doesn't leave out anything essential yet leaves an unsaid fog around the characters. It's graphically obvious yet highly suggestive. The characters are simple yet complex, and when watching the movie it seems as if Fassbender and Mulligan couldn't have portrayed their dark sibling relationship and shaky family chemistry better. I relate to both, and they keep on lingering, even the morning after watching the movie. Somehow, the soundtrack also had a great impact on me. For me, it created an instant sentimentality to the characters of the movie."
    },
    {
      "rating": "10",
      "text": "The plot, Fassbender and Mulliganâ"
    },
    {
      "rating": "10",
      "text": "Although it is bracing and does a decent job of showcasing the dark side of man, the film, Shame, is not as good as Fassbender is here, which is too say it is not great."
    },
    {
      "rating": "3",
      "text": "It's not offensive, it's not particularly interesting, it's mainly just boring, and extremely overrated.\r The guy's problem is uninteresting and 90% of the male population has the same urges/done worse. Personally I felt that some of the behaviour/dialogue felt wrong to, perhaps due to the choice of actor (European), e.g. the bar scene and some others. I was not surprised to find out later on that McQueen is a black guy as it would suit a black actor much better.\r I sat through it until the end so I guess it wasn't completely terrible but I sure did feel as if I had wasted my time."
    },
    {
      "rating": "5",
      "text": "The sex and nudity are the best parts of this movie. Not sure about the whole gay episode of the movie. I thought he was going to have sex with his sister, but I guess not."
    },
    {
      "rating": "7",
      "text": "Director Steve McQueen started as a cinema artist and that shows in his commercial work. There are extended takes & minimal dialogue (hence, slow pacing) and episodes that add up to an impression (as opposed to a storyline). Michael Fassbinder plays a New York stud, who's obsessed with sex and afraid of intimacy. As a result, there two primary types of scenes: sex (including random pickups, masturbation & full-frontal nudity) and struggle (rueful staring and disaffected relationships). It's compelling on several levels, but too cerebral to be powerful. The most shameful thing is that the distributors had the conviction to release it in NC-17 (with all the attendant barriers) and it's not worth the risk."
    },
    {
      "rating": "8",
      "text": "Shame is a very realistic and deeply harrowing tale of sex addiction, loneliness and inferred psychological abuse. Despite all of it's predatory sex and nudity, Shame is probably one of the least erotic films you'll ever see. Micheal Fassbender delivers another mesmerizing turn and the rest of the cast are on top form too. Excellent, thought provoking stuff."
    },
    {
      "rating": "8",
      "text": "Viewer discretion is advised. It"
    },
    {
      "rating": "9",
      "text": "Why Shame is so special? Controversy? Michael Fassbender full frontal or explicit sex scene? Anyway, Shame is poignant movie about sex addiction and about how you dealing with it. Michael Fassbender and Carey Mulligan stellar performance also boost the drama. And don't forget the powerful score, I know why Ebert maybe even couldn't be able to see it twice."
    },
    {
      "rating": "4",
      "text": "Brandon Sullivan (Michael Fassbender) has an addiction.  He does not struggle against it, seek therapy to cure it, or deny its existence; he learns to cope with it and attempts to shape his life around it to create routine and give it space.  Brandon is addicted to sex but appears to be a bit more OCD about it than the regular sex addict looking to score at the club on a weekend.  He has a handle on his issue enough to know specifically what he wants.  This specificity is most likely his limiting factor when it comes to real life relationships and intimacy, but Brandonâ"
    },
    {
      "rating": "9",
      "text": "Near the beginning of Shame we're given a glimpse in to Brandon's (Michael Fassenbender) life as he sits alone on a train. He catches the eye of a pretty young woman who gives him a smile. As he begins to look her up and down he notices that she's wearing a wedding ring. But this doesn't matter to him. Brandon is unable to resist and tries follows her off the train, before losing her in the crowd. He is completely controlled by his addiction and is trapped in his own self-loathing life style. Throughout this entire sequence, Fassenbender has a look of complete anguish on his face. He gains no pleasure from pursuing his sexual needs. He feels only shame.\r Steve McQueen represents sex addiction as a form of self-abuse, with the agonising pain Brandon's sex addiction causes himself being bought to the forefront of practically every scene. McQueen avoids the clichés of a typical Hollywood sex scene, with shots uncomfortably lingering for too long and maintaining a focus of Brandon's emotional fallout throughout the scene. In one of the most powerful and tragic moments of the film McQueen ends a sex scene with a close up of Fassenbender's face as he orgasms. His expression is a mixture of pain and misery, with the entire scene having such an overwhelming feeling of anguish that feels similar to a death scene a death scene.\r In spite of Brandons addiction controlling his entire life, nobody around him seems to notice. Every girl he meets seems to be perfectly fine catering to his every sexual need (although to be fair many of these girls are hookers just doing their jobs). His co- workers seem completely oblivious to the fact that Brandon spends most of his time at work jacking off in the bathroom. Even when Brandon's boss discovers that his entire hard drive is filled with porn, his boss quickly assumes that it belongs to his assistant and remains completely unaware of his addiction.\r The only person who seems to be aware of his addiction is his sister Sissy (Carey Mulligan), who moves in to his apartment whilst she has some gigs in the city. But she doesn't seem to be able to help much since Brandon appears to want to create as much distance between the two of them as possible, constantly avoiding her calls and remaining extremely aggressive towards her at any opportunity he gets.\r It also doesn't help that Sissy is just as self-destructive as Brandon is. But whereas he is cold and detached, Sissy is in dire need of emotional support with a history of self-harm who has cut herself several times in the past. We never know exactly what caused them to become this way, but it's clear they've both been damaged in the past. This history is instead told through both Fassenbender and Mulligans powerhouse performances that can tell a history of suffering and anguish without needing to say a single word.\r Sissy keeps reaching out to Brandon and Brandon keeps pushing her away, leaving them both completely isolated. And this is probably the greatest tragedy of Shame, as it is the lack of any real support that leaves addicts like Brandon unable to escape their lifestyle. They'll either keep their addiction hidden in embarrassment or actively push away anybody who could actually help them, leaving them trapped in their own self-harming life-style and unable to stop their path of self-destruction.\r The entire tone of Shame strongly resembles Requiem for a Dream. It creates a similar tone of complete despair and serves as a harrowingly realistic representation of the pitfalls of addiction. It's a true masterpiece, though also one that can be hard to sit through."
    },
    {
      "rating": "7",
      "text": "Now, don't get me wrong. I quite enjoyed Shame (with the exception of the absurd sequence where Carey Mulligan performs in a posh nightclub. What was it, Mediocrity Night?) While the film does address some of the doubtless vexing aspects of sex addiction (needing to be in the office loos having a quick wank while you should be in a meeting; a sudden desire to bang an expensive prostitute against a floor-to-ceiling hotel-room window), it doesn't tell us about two of the most  obvious daily problems these poor folk must encounter. (a) The movie never shows us if Fassbender's character wears CONDOMS. This guy should take out shares in Durex! (b) SEXUALLY TRANSMITTED INFECTIONS. Heavens, having your sister stay over may be inconvenient, but contracting -- and spreading --  the clap, genital herpes, chlamydia, crabs and all the rest must be even more so. How's that winsome married lady on the train going to explain THAT to her husband?"
    },
    {
      "rating": "9",
      "text": "What an amazing movie! From start to the amazing ending the movie is great! Every scene belongs in the movie."
    },
    {
      "rating": "9",
      "text": "Shame deals with the unorthodox and the sometimes embarrassing nature of sexual addiction, and Michael Fassbender puts in an emotionally driven and edgy performance as the man in question.\rBrandon (Fassbender) leads a very routine life, waking up, masturbating, watching porn at work and at home, sometimes just staring endlessly at the screen.\rHis routine is broken with the arrival of his equally as damaged sister, Sissy (Carey Mulligan) who wades in on Brandon's life unexpectedly which interferes with his mindset, causing an eventual downward spiral. She is very invasive of what he considers his personal space.\rit is clear as the film goes on that Brandon himself perhaps have difficulty talking to women unless he is being intimate with them, he is almost a recluse in his reluctance to speak thoroughly or freely to anyone, choosing instead to spend large amounts of time staring blankly into nothing.\rThe film certainly doesn't hold back in its attempt to put across the problems and abusive nature that sex addicts can bring upon themselves, with very explicit content that will surely turn many off, but this is all pivotal to the message being conveyed in these characters, so why should they hold back?\rMichael Fassbender continues to surprise and entertain in this leading role, and this will undoubtedly gain him recognition in more ways than one. He powerfully depicts a damaged yet heartfelt man who simply doesn't seem to know any other way of life. He is tortured in every decision he makes, yet continues to lead this life, simply because it is like a drug.\rCarrie Mulligan also delivers a memorable performance as Sissy, ditching an almost good girl image to delve into the dark world of realism, the chemistry between herself and Fassbender is convincingly sombre as warring siblings, not knowing each other deepest secrets, but aware of each others way of life.\rWith its reliance on extended scenes of emotional depth, director Steve McQueen mirrors certain scenes from his earlier film with Fassbender, Hunger, to further explore the characters and make said scenes more involving and appreciative.\rNot everyone will enjoy this film, but Shame certainly leaves a powerful, gritty and rugged impression on the mind, and it is difficult not to look away, mesmerising."
    },
    {
      "rating": "4",
      "text": "I admit it, the sluggish pace may have distracted me, but I didn't get the back story of the brother-sister. The main reason to see it is the frontal nudity of a soon-to-be major star, and the daring sex. But it is strangely clinical and unsexy, and sad, which I DO get is the point. Sigh."
    },
    {
      "rating": "7",
      "text": "Good movie but not as good as it may sound from the reviews.it's like they wanted to make a movie about sex addiction but they just didn't know how, so they filled it with ridiculous scenes (like that slow and boring rendition of New York, New York ), a lot of sex (which is fine) and made it quite monotonous.and I didn't notice much sexual tension between Brandon and Sissy (as some reviews suggested). to make a long story short  this could have been much better movie."
    },
    {
      "rating": "8",
      "text": "A powerful look at addiction--with powerhouse performances from Fassbender and Mulligan. Steve McQueen proves to be one of the finest directors of his generation."
    },
    {
      "rating": "8",
      "text": "This is a tasteful fearless movie that gives its subject matter justice. Performances are exceptional. This movie might be too much for some people, but to those who see it as art will understand how powerful this film truly is."
    },
    {
      "rating": "7",
      "text": "Shame is a great example of a movie I wanted to love, but could only like. Despite strong performances from Fassbender and Mulligan and a promising premise, there are a number of smaller mistakes that ultimately detract from the overall movie. The film does a fairly good job of fleshing out Fassbender's character Brandon, but is not nearly as successful in explaining the relationship between Brandon and his sister Sissy, played by Mulligan. Consequently, Sissy's arrival ends up more as a way of showing how closed off Brandon is as a result of his sex addiction rather than providing an actual, nuanced relationship. Additionally, there are a couple confusing flash-forwards; the first is not explained until later and is the most odd, while the latter is quite effective once you begin to understand what is happening.\rUltimately, the movie is occasionally quite moving, but it just doesn't achieve that level of success throughout. During one of Brandon's binges, for example, at the zenith of his pleasure you see from his change of expression that he is really at the nadir of his anguish, an absolute slave to his addiction. But this fantastic scene is then followed up by another underwhelming one involving Sissy, illustrating the ebb and flow of success throughout the film. You can tell that McQueen wanted both a character study of man whose life is dominated by his sex addition as well as a gripping sibling relationship between two flawed characters, but in the end it seems that he bit off more than he could chew."
    },
    {
      "rating": "8",
      "text": "This film is not for people who like happy-happy/feel good movies. Fassbender plays a tormented wanker (in both senses) who does whores and watches tonnes of porn but on the other hand fails to connect to humans (and his dependent sister) on an emotional level. That being said, Fassbender does an exellent job and shows that he can play superheroes as well as real profound roles. Carey Mulligan also has a great supporting role and does some singing as it turns out she has an beautifull voice. A well made reflection on the darker side of the human condition."
    },
    {
      "rating": "8",
      "text": "Steve McQueen's second film is just as hard-edged and brutally honest as his outstanding debut Hunger and his phenomenal follow-up 12 Years a Slave, but in an entirely different way. In Shame, the British auteur explores a topic hardly ever discussed in the film industry, sexual addiction, and uses it as a means to create a brilliant character study with artistic visuals. With very few things actually happening, Shame surely feels the longest of all of Steve McQueen’s films and, just as with Hunger and 12 Years a Slave, it’s probably going to take me quite some time to watch it again. However, the film brings up a lot of interesting things to think about and is the most honest and dignified approach to the subject I could think of, thus making it something very worthy of checking out."
    },
    {
      "rating": "8",
      "text": "\"Shame\" examines the nature of need, and how we live our lives and the experiences that shape us. \"Shame\" leaves us to internalize our thoughts, asking us to paint our own cinematic details in the gaps, and with the dark feeling that something black and heartless has been communicated most powerfully. Brandon (Michael Fassbender) is a good-looking, young man in his early 30's, who lives alone in a sterile condo in Manhattan. He works in a cubicle with a computer. Never mind what his company does. It makes no difference to him. Sometimes in the evening, he and his boss, David (James Badge Dale), go out to drink in singles bars. David is a outgoing and throwing out pick-up lines. Brandon just sits there, his face impassive, knowing he doesn't have to. He shuns intimacy with women but feeds his desires with a compulsive addiction to sex. The film's opening shot shows Brandon awake in the morning, staring immobile into space. He could be a man prepared to commit suicide. He gets out of bed, goes into the shower and masturbates. It will be the first of his many orgasms, solitary and with company, that day. He never reveals emotion. He lives like a man compelled to follow an inevitable course, and his life is a living hell. He is cold to everyone he encounters; prostitutes, co-workers, to strangers. On the subway, he trades eye contact with a woman who may be flirting with. He boldly maintains eye contact, but he doesn't smile. His is a dreadful life. His shame is masked in privacy. He wants no witnesses to his hookers, his pornography, his masturbation.\rThe introduction of Sissy (Carey Mulligan), Brandon's sister, injects spontaneity and life into this-up to this point-an almost emotionally desolate film. She is as passionate and uninhibited as he is the opposite. This encounter resurfaces stirring memories of their shared painful past, and Brandon's insular life and addiction begin to spiral out of control. She needs him desperately and that frightens him most. She works sometimes as a cabaret singer, and in one scene, she performs a fantastic rendition of \"New York, New York\" in close-up. This close-up also shows pain and grief of both, a truly beautiful moment captured. McQueen's camera gives us a mix of the highly-stylized and the stark, with frequent long takes giving the actors the narrative space to embellish scenes with depth. Fassbender for one, is often captured looking unseeingly at the ground, failing to register the world before him. It can get to be overwhelming and burdensome for some as the movie, as well as Brandon's addiction, progresses. But Michael Fassbender's powerful, gut-wrenching performance and Steve McQueen behind the camera is what makes this so extraordinary."
    },
    {
      "rating": "9",
      "text": "I'd like to let it be known that Shame is an obscene movie. It's quite gross, but what else could you expect going into an NC-17 film about sex addiction. That complaint aside, it's a compelling almost-masterpiece and if you have the stomach, watch it. A fantastic performance from Michael Fassbender."
    }
  ]
}