{
  "id": 4031,
  "title": "Shanghai Noon",
  "starring": [
    "Jackie Chan",
    "Owen Wilson"
  ],
  "runtime": 110,
  "genre": [
    "Adventure",
    "Action",
    "Comedy",
    "Western"
  ],
  "description": "Chon Wang, a clumsy imperial guard trails Princess Pei Pei when she is kidnapped from the Forbidden City and transported to America. Wang follows her captors to Nevada, where he teams up with an unlikely partner, outcast outlaw Roy O'Bannon, and tries to spring the princess from her imprisonment.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/b0WwWRcDiDahkah5vZ0KjB4N9ZZ.jpg",
  "categories": {
    "plot": 6.181818181818182,
    "acting": 5.714285714285714,
    "ending": 3.0,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 4.333333333333333,
    "funny": 6.461538461538462,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "One of my favorite comedic movies ever, never get tired of watching it. The buddies have amazing chemistry, gotta love a good western with humor."
    },
    {
      "rating": "9",
      "text": "mmnnbbvvccxzzkklljjhhggffddssaaihihufybijkhufyfyyfguihhi⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "10",
      "text": "This movie rocks!!! enough said."
    },
    {
      "rating": "9",
      "text": "++++++++++++++++++++++÷÷÷÷÷÷++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷"
    },
    {
      "rating": "9",
      "text": ":*:*:*:*:*:*:*\"*:*:*:*:*\"*\"*\"*\"*\"*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*"
    },
    {
      "rating": "6",
      "text": "Shanghai Noon has some pretty cool martial arts sequences, and Owen and Chan have surprisingly good chemistry. The story, however, has some major problems."
    },
    {
      "rating": "8",
      "text": "A film like 'Shanghai Noon' proves that you can take a serious and benchmark setting like the Western genre that has had hits and misses across decades, and take a more light-hearted and humorous approach, thats exactly what likeable stars Jackie Chan and Owen Wilson bring to the table in this comedy-action film, a flick that has all the makings of a martial arts marvel with the perfect setting of the Old West to set up a fish out of water story that sparkles from beginning to end. Jackie Chan plays a curious and bumbling Imperial guard called Chon Wang in ancient Forbidden City China, where he hears the high princess (Lucy Liu) over-talkning to an unknown man about leaving the country to go to America, when this happens, Chon and a small number of other guards are sent America to retrieve the princess, where Chon runs into notorious outlaw Roy O'Bannon (Owen Wilson), a witty and fast-talking cowboy who robs trains and longs after pretty women, but he messes with the wrong guard, and the two soon form an unlikely and uneasy alliance to retrieve the Princess, while Roy seems to be in it for the gold that is part of the exchange, as it is revealed to be an abduction of sorts.\rThe film plays to its key strengths which are the two leads of Chan and Wilson, its entertaining and awe-inspiring to watch Jackie Chan move seamlessly around the screen, taking out various enemies with his martial arts background, theses scenes rely on environmental cues which work brilliantly so as we don't have an endless amount of mirrored action sequences, with this comes Wilson, who provides an excellent amount of comical timing as man who tries to reason and talk his way out of everything, setting up a few funny encounters with Marshal Van Cleef (Xander Berkeley), who is after him. Many homages can be found to some of the best Western of the ages, proving that the film has a healthy respect for its roots, but also showing confidence in what sort of film it tries to be, not too serious but certainly enough drama to keep us entertained.\rThis is a wild and action-packed thrill of a film, it has some truly funny scenes and has some excellent martial arts moments with the undeniably energetic and charismatic Chan, but Owen Wilson cannot be left out of that equation, bringing his undeniable charm and witty persona to team up with the \"Shanghai Kid\", which has plenty of nods to buddy cop films but truly stands well on its own two feet."
    },
    {
      "rating": "7",
      "text": "A great film. It's funny, has good story and it's funny. The pace is perfect and has really good character development. Films with a premise like this are typically quite cliché and shallow, but this manages to keep it exciting."
    },
    {
      "rating": "7",
      "text": "It has a lot of funny moments and great performances from Owen Wilson and Jackie Chan. Even with a short story to tell with a few plot holes, it is a fun movie."
    },
    {
      "rating": "3",
      "text": "I am truly surprised by the average user score for this movie. Yes, it's sometimes funny (mainly thanks to the amazing Jacki Chan's acting) but just substract all the racist and intolerant jokes and it becomes flat. I couldn't believe my eyes when I saw the scenario falling apart in the first quarter of 'Shanghai Noon'. How mainstream and unoriginal is it to put a Chinese character deep into the western american society ? Obviously there are huge differences between the characters. Obviously there is a gigantic hole between their moral values and behaviours. Obviously they don't live the same way. But is it really all the job of the movie to make fun of these differences ? I guess it's hilarious to see a 'china man' test weed and getting drunk these days. This movie is just gross, vulgar and doesn't hide its racism.The storytelling takes a hell of a hit for the development of some jokes. For example, all the 'American Indian' part could be resumed in: 'the hero meets a badass girl who will save his ass in multiple occasions without asking anything back'. This kind of scenes makes the scenario look duller and more predictable.There are two main female characters in the entire cast, all the others are hookers. Waw.The ending is quite unpredictable but doesn't make sense anyway.Gunfights are lazy and emotionless while bare-hands fights are amazingly choreographed.It is barely impossible to identify and to have empathy for the sidekick (Owen Wilson), who compiles betrayal behaviors and an unforgettable mercantilism.Movie soundtrack is great and so is the artistic direction."
    },
    {
      "rating": "6",
      "text": "Honestly this is a good western comedy movie that works not that well for me. I am a fan of Jackie Chan, like Owen Wilson and Lucy Liu, the set up idea is creative and there are no notable missteps. However it is in no ones favorite Jackie Chan movie lists, reaches not the higher levels and the humor cant win me over completely. The story is set in 1881 and follows Chon Wang (Wordplay as it is similar to John Wayne) who is a lower ranked imperial guard in the Forbidden City in China. After princess Pei-Pei is abducted at an escape attempt from her golden cage and brought to the USA the emperor sends three of his best guards to safe her. Chon begs to join them as he blames himself for failing the escape aka abduction. So starts the story. It has a creative start and the word culture shock comes to mind. Sadly it is nothing special after this. Two different characters that join together to stop a greater evil. Rush Hour works far better with a similar premise. Now that I think of it it is Rush Hour in the wild west with some adjustments. I think these are mayor enough that I cant call this a simple copy. Lets say the story works but is neither great enough or refreshing to be a masterpiece. The cast safes this for me and a lower rating. Jackie Chan plays Chon Wong and you get what you expect from him (Meant positive). Even if this is far from his best movies it is satisfying. Owen Wilson as Roy O’Bannon works well and I praise him. He works well with jackie Chan. Lucy Liu is always good when not harmed by a script and works also well as princess Pei-Pei. Other than those I will praise Brandon Merill as Falling Leaves,  Roger Yuan as Lo Fong and Xander Berkeley as Marshal Van Cleef. The name Van Cleef can be a bow or reference to Lee Van Cleef who is an awesome spaghetti western bad guy best know today for “The Good, the Bad and the Ugly”. Back to the review. The actors deliver a good performance. The humor works but is nowhere near the better Jackie Chan movies or comedies. The action scenes are well crafted and are satisfying. Visuals the costumes and sets are O.K but impress me not that much. Overall this was worth watching but was fast forgotten. I have not talked or heard anybody talking about the movie in many years. I must mention that my circle of friends is full of Jackie Chan fans to give perspective. I would neither recommend to watch nor to avoid this movie. A 6/10 seems fair in this case."
    },
    {
      "rating": "8",
      "text": "Amigooooooooo! Muy buena la película. Siempre creí que la forma de pelear de una persona en la vida cotidiana se asemejaba más a la de Jackie Chan que a la de otros actores de acción.Son dos horas que se pasan rápido y la verdad que Jackie Chanactúa muy bien, se nota que siempre se toma el trabajo en serio. En una entrevista vi que decía que la mayoría de las piruetas y escenas de riesgo las hacía el mismo.Por otro lado, Owen Wilson tampoco estuvo mal, pero es clásico papel de él. Una peli en la que actúo que lo vi bastante serio fue de tras de las líneas enemigas. No está mal y él se lleva la película.En cuanto a esta tiene alguna que otra cosa que no tienes sentido, pero no quiero explayarme por un tema que no quiero entrar en spoilers. Vestuario óptimo, linda fotografía y personajes de relleno, a los que le sobran minutos de pantalla. Vamo a ve que nos depara la segunda!"
    }
  ],
  "recommendations": [
    "shanghai_knights",
    "true_lies",
    "red",
    "the_foreigner",
    "demolition_man",
    "die_hard",
    "gangster_squad",
    "skiptrace",
    "beverly_hills_cop",
    "from_paris_with_love",
    "lethal_weapon",
    "red_2",
    "rocky_ii",
    "last_action_hero",
    "kickboxer",
    "the_rock",
    "tomorrow_never_dies",
    "the_rundown",
    "the_legend_of_zorro",
    "octopussy",
    "for_your_eyes_only",
    "butch_cassidy_and_the_sundance_kid",
    "rush_hour_2",
    "american_made",
    "the_nice_guys"
  ]
}