{
  "id": 11,
  "title": "Shang-Chi and the Legend of the Ten Rings",
  "starring": [
    "Simu Liu",
    "Tony Leung Chiu-wai"
  ],
  "runtime": 132,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "Shang-Chi must confront the past he thought he left behind when he is drawn into the web of the mysterious Ten Rings organization.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1BIoJGKbXjdFDAqUEiA2VHqkK1Z.jpg",
  "categories": {
    "plot": 8.172413793103448,
    "acting": 8.318181818181818,
    "ending": 7.666666666666667,
    "soundtrack": 7.8,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.666666666666666,
    "action": 8.9
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The MCU has finally reached a point where we have seen a lot of weird stuffs, So they can throw something really crazy at us and we will just accept it as normal. That's what I love about this movie, it takes you to a wild journey where anything can happen. The movie has a lot of surprises, a great villain and a good story even if I wasn't a big fan of the jokes that the movie throws at you every time anything happens.In conclusion, this is the kind of movie that you will enjoy if you watch it to have fun. This movie is far from a masterpiece, but at the same time, feels like they finally portrayed the craziness of the comics in the big screen without the fear that it could be too much for the audience."
    },
    {
      "rating": "9",
      "text": "That's one of the best marvel movie! I love the storytelling and the action, that was amazing. But honestly i didn't expect that. Friends told me that this is a great movie, but i watched trailer and it didn't impress me at all. One thing is a little disappointing it's the lack of fighting of the shan chi himself."
    },
    {
      "rating": "10",
      "text": "esta buena la pelicula y la disfrute mucho espero que le llega muy bien en taquilla"
    },
    {
      "rating": "10",
      "text": "The action was amazing it was not like the same old marvel movie the acting was perfect and I laughed watching it good movie"
    },
    {
      "rating": "10",
      "text": "A truly special ride.  Only (ridiculously small) quibble was with a few of the effects, but most of the effects were amazing. Cast was wonderful - Simu Liu is a STAR, Awkwafina and Tony Leung were incendiary, the entire rest of the cast were perfect.  The action is so far beyond most other action movies, it’s almost playing a different sport.  The heart of the movie, though - the struggle to find one’s self amidst family turmoil and the expectations of father and the loss and grief embodied beautifully in the movie…THAT is why the movie is truly special."
    },
    {
      "rating": "10",
      "text": "i've never seen something so beautiful. incredible story, even greater characters, a lot of family drama, stunning fighting scenes and majestic animals.one of marvel's greatest so farps: simu liu and awkwafina are THE duo"
    },
    {
      "rating": "10",
      "text": "Had a great time watching this one, it felt so different from the other MCU movies and yet it was very enjoyable.  Even though I don't understand Chinese i'm glad some of the dialogue is in Chinese I love the way it sounds.  The fight scenes are so cool and and I love the fantasy settings.  The cast is great Katy is so funny and loveable and I'm hoping to see more of her and Shang-Shi and Xialing. I'd give this movie a 9.7 and round it up to 10."
    },
    {
      "rating": "8",
      "text": "Action was amazing , visuals were stunning plot had some slows but overall it was an emotional joy ride for me, I cried twice cause I could release to the story in some ways.Sim Lu has charm and potential. He’s a very down to earth character which is good. But the MVP in Tony Leung’s Mandarin is outstanding."
    },
    {
      "rating": "10",
      "text": "Great one by marvel"
    },
    {
      "rating": "7",
      "text": "I had low expectations for this one and was actually pleasantly surprised by the story and how good the main villain is. I wish the soundtrack would've been better as the setting was beautiful. On the other characters of the movie - they were just alright. And i must mention the phenomenal visual effects.Another solid movie from Marvel, check it out!"
    },
    {
      "rating": "8",
      "text": "This has the best fight choreography in an MCU movie since Captain America Winter Solider. The story was pretty good and the acting was on point, the cameos from a few characters were really cool to see as well. Overall the fight scenes were the star of the movie and the story was good, I’d definitely recommend it especially if you like good martial arts fight scenes."
    },
    {
      "rating": "10",
      "text": "This movie is adventurous and wonderful Simu Liu doesn’t great and the cast as well"
    },
    {
      "rating": "8",
      "text": "A great addition to the Marvel Cinematic Universe. I loved the character conversations and moments. The fights throughout the film were incredible to watch. What kept me from rating this film any higher was the direction toward the end of the film. Overall this was a thrilling adventure and I hope to see more of Simu Liu in action soon."
    },
    {
      "rating": "10",
      "text": "Outstanding Marvel movie! Visual and actions is the best part of any superheroes movie and here it is the top of what the world had to offer in the decade! That movie is a love letter to Asian cinema and culture!  The reimagining of the ten rings design and powers are super cool and beautiful! Truly one of the best weapons in the MCU. The combo attack of  Wenwu or Shang chi are straight out of a video game! And finally upgrading the master of Kung fu to a high-tier hero in the same level as Hulk and Thor is the best change for that character! I cannot wait for Shaun to interact in with the others heroes and his involvement in the next Avengers and others movies."
    },
    {
      "rating": "10",
      "text": "Shang-Chi and the Legend of the Ten Rings was just a masterpiece, every second was visually gorgeous and it's amazing to Asian Culture being explored and represented in the media more and more especially in a genre that doesn't. The fight choreography and action scenes were impeccable, just so clean and awesome; maybe the best fight choreography I've ever seen and some of the best action scenes ever. The performances from Simu Liu, Meng'er Zhang, Awkwafina, Tony Leung, Michelle Yeoh, and Ben Kingsley were outstanding. The visual effects were phenomenal from the Great Protector to the Shishi to the Dweller-in-Darkness, just some of the best visual effects I've ever seen. The writing was stupendous, the screenplay and story were just superb and the character development especially with Shang-Chi was terrific. The costumes were spectacular. The makeup and hairstyling was great. Also the music was great. An A+ movie and it is definitely in my top 3 favorite movies I've ever seen now."
    },
    {
      "rating": "10",
      "text": "Com certeza um dos melhores filmes que a Marvel lançou. CGI e direção de arte incríveis."
    },
    {
      "rating": "8",
      "text": "What a movie. The fights are awesome, the visuals are stunning: the third act is absolutely insane."
    },
    {
      "rating": "10",
      "text": "This is the best MCU movie that i’ve ever seen. Did not expect so much until getting into theatre."
    },
    {
      "rating": "10",
      "text": "THIS WAS SUCH AN AMAZING MOVIE. The storyline was so creative and thought-out, the characters had so much depth, and the action scenes were amazing. Overall, really really really good movie (and it's three really's so you know it's good)"
    },
    {
      "rating": "10",
      "text": "I went to watch this in the movies a couple of weeks ago, and i really enjoyed it. I would really like to watch it a second time, so i would really like it to come to disney+ pretty quickly. Might not be my favourite marvel movie but its pretty damn good. I recommend it."
    },
    {
      "rating": "10",
      "text": "Joder esta película fue como ver una perfecta adaptación de un anime basado en un manga pero el chiste es que esto fue basado en un cómic Estadounidense."
    },
    {
      "rating": "10",
      "text": "Después de volver al cine y ver dos películas que no cumplieron mis expectativas, esperaba que esta de Marvel me decepcionara.. pero fue todo lo contrario.Buena acción, buen humor, buena historia y un protagonista que te puedes identificar muy bien.Sin duda una joya de película para el genero de superhéroes."
    },
    {
      "rating": "9",
      "text": "One of the best origin movie on MCU and i love so much the character of Shang Chi and Katy, I also enjoyed The Mandarin, the villain. recommended"
    },
    {
      "rating": "8",
      "text": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good.[Watched in Cinema]"
    },
    {
      "rating": "10",
      "text": "Great performances, some of the best action sequences and a story filled with heart."
    },
    {
      "rating": "7",
      "text": "shang chi review no spoilersI saw shang chi the new marvel film with an oriental tone.The strongest point of the film is the plot that manages to tell (although in the first few bars I was not convinced) a simple story, easy to understand and linear.The soundtrack does not make you scream to the miracle but it is still good and accompanies the scenes well. These latter are some very beautiful, others instead made me turn up my nose. The main flaw of the film is the poorly detailed characters (apart from shang chi) albeit justified by a good cast. One thing that I have not endured instead is that they have wasted the character of ..... guys I really don't know what it's called forgive me(the masked one like taskmaster)"
    },
    {
      "rating": "10",
      "text": "A Marvel não veio para brincar mesmo, Shang-Chi é simplesmente incrível!Claramente um dos melhores filmes solos do MCU, se não até o melhor."
    },
    {
      "rating": "10",
      "text": "Absolutely loved this movie. One of the best superhero movies ever. Simu Liu and Tony Leung were both brilliant"
    },
    {
      "rating": "8",
      "text": "Shang chi é um filme muito bom, o humor é ok, o vilão é ok mas a primeira cena pos creditos é bem engraçada"
    },
    {
      "rating": "8",
      "text": "Shang-Chi and the Legend of the Ten Rings is very formulaic by the acting and storytelling yet has very groundbreaking action sequences and stunning visuals."
    },
    {
      "rating": "9",
      "text": "Un film che sa di cosa si tratta e se lo gode fino alla fine.Un grande successo per i Marvel Studios."
    },
    {
      "rating": "10",
      "text": "Um filme epico, sem palavras pra descrever as cenas de ação que esse filme trouxe..Marvel está de parabéns, esse pode ser o melhor filme solo de ação da marvel facilmente..Trouxe tudo o que é de bom em um filme de artes marciais.E o humor não  incomodou  nem um pouco.Nota 10"
    },
    {
      "rating": "7",
      "text": "Entertaining if somewhat long superhero origin story. Both leads are very entertaining and their interactions with each other and the outside world, and are a highlight of the movie. As are the many fight scenes. Visually an impressive movie. Not much wrong with it as a very entertaining popcorn affair. Despite the simplicity of some of the characters and the inevitable plot holes that accompany superhero worlds."
    },
    {
      "rating": "7",
      "text": "If you've ever seen a marvel movie you pretty much know what you're getting here. Doesn't break any new ground, the superhero origin story is formulaic and well-trodden territory for Marvel. This however has some of the best fight scenes which is it's main draw but some of its most lacking characters, particularly the protagonist and antagonist who are both devoid of any personality whatsoever and are hampered by having 3 minor female characters around them who can beat them in a fight, zapping the final confrontation between the two of much tension"
    },
    {
      "rating": "8",
      "text": "Marvel makes another \"B\" grade movie, which is by no means an insult. However, I couldn't help shake the feeling that I had seen this Marvel movie before. In other words, these films are becoming formulaic, especially since I've seen every one of them. Combine that with the new shows and I wonder if they're starting to get too saturated. This film and one medium flaw and a handful of small flaws in my opinion, but nothing major. The medium flaw was a character's motive three quarters into the film and some of the smaller issues was overreliance and sometimes questionable CGI (reminded me of Black Panther's not so good CGI in parts). Also, it was pretty predictable if you've seen a ton of movies over your lifetime, but again, it's a superhero flick. It dragged a smidge in Act 3 as well. On the positives, it didn't rely on a bunch of clichés in addition to the action/martial arts being top notch. The characters were likeable and world building was solid. IMO Marvel makes about 15% \"A\" films, 70% \"B\" films, and 15% \"C\" films. This can be thrown in with the majority."
    },
    {
      "rating": "8",
      "text": "Shang-Chi was a fun movie. The story is mystical in nature, in line with Dr Strange. It has a lot of humour and great actions/fighting. The acting was very solid from the main actors to the secondaries. The CGI was solid too. The fighting sequence was really good, except for the one on the tower exterior, where it gets too fast and confusing. The music support the movie very well. I give it 82%. I really like it, especially since I never even read one comic about that character. It was all new to me and very enjoyable."
    },
    {
      "rating": "10",
      "text": "It's the best superhero movie I've seen this year and the decade.I know I'm being a bit of an exaggeration but I really enjoyed it so much."
    },
    {
      "rating": "8",
      "text": "Shang Chi and the Legend of the Ten Rings is one surprisingly very fun MCU movie and it surprised me in some ways.I will be honest before watching this film I was little tired of superhero movies being made multiple times over the year and after mediocore Black Widow ,I was thinking how this will be another disposable work but in the end I was wrong and I am glad because of that.Story was nothing new or remarkable but it still had some good laughs,fun and some solid messages.Characters were ok to while fights were nicely choreographed and enterteining."
    },
    {
      "rating": "9",
      "text": "I do not know if it is true that the superhero genre is saturated or exhausted; how true it is here knows how to combine this genre with martial arts and Chinese mysticism with intelligent and dynamic action scenes. Judging from the extra credits, what should we expect?"
    },
    {
      "rating": "10",
      "text": "By now this has become my favorite movie in the Marvel Cinematic Universe.A marvel of a movie."
    },
    {
      "rating": "7",
      "text": "Good movie. Fun, funny, good action, likeable characters, decent plot. Though it feels disconnected from the MCU that's not necessarily a bad thing - it stands on its own. Unfortunately this is another movie where ever woman can out fight a man. And there's no black men in this movie - hmm....the left isnt complaining about this, maybe because its an Asian movie. Outside the stupid wokeness this one is worth watching."
    },
    {
      "rating": "8",
      "text": "great movie with great characters. Really peaked my interest. excited for the next phase of the mcu"
    },
    {
      "rating": "7",
      "text": "Although I'm not the biggest Marvel fan, I always go to the movies to see the popular new releases. So I decided to go and see Shang-Chi last week with some friends. I was not disappointed at all! Of course , it's kind of different if you're going to compare it to some other Marvel movies, but it's really interesting! I really enjoyed the soundtrack aswell."
    },
    {
      "rating": "10",
      "text": "This movie got me interested in the Marvel Cinematic Universe.Undoubtedly something that was impossible for me."
    },
    {
      "rating": "9",
      "text": "Post-EndGame, what I look for in the \"Super Hero\" film genre are matters of the Family/Friendships/Relationships with certain background characters having a life of there own, and making comments as the main characters deal with a problem. Also expanding this universe with diversity is always welcomed. This will be my 3rd time watching this film. The last time I did this was with End Game. So, is this movie any good? Hmm."
    },
    {
      "rating": "8",
      "text": "Allegedly, \"Eternals\" is on the table to be delayed if \"Shang-Chi” under-performs... Welp, they better get that idea off the table ASAP, because this movie is not only doing amazingly well, it's also an amazing movie! “Shang-Chi” is a unique genre blend of martial arts, fantasy, and family drama.In my opinion, this film had quite possibly, some of the best fights in any Marvel movie. The film had everything you could possibly want in a martial arts film: From elegant \"Wire fu\" fights to traditional martial arts to feudal battles, it was a true celebration of Asian martial arts.Coupled with amazing martial arts, this film also had a fun fantasy element to it: The second half of the movie was filled to the brim with Asian folklore creatures and enough whimsy to fill your heart with wonder and awe.If there was anything I’d fault the movie for, it would be the high budget visual effects sort of “deluding” some of the martial arts scenes and maybe a bit too much forced humor. It just feels like every Marvel movie HAS to be a comedy these days, and I hope that trend simmers down in the future.“Shang-Chi” was a pleasant surprise and a HUGE win for the “Marvel Cinematic Universe.” \"Ant-Man,\" I love ya... But \"Shang-Chi and the Legend of the Ten Rings\" has officially taken your spot in my \"Top 5 Marvel Movies\" List!"
    },
    {
      "rating": "9",
      "text": "The fight scenes were well choreographed and stylish leaving me at the edge of my seat with every set piece fight/battle. I've noticed that there are people on here reviewing extremely negatively based on single elements, which I don't understand. I loved the performances from the entire cast. All around fun movie to watch."
    },
    {
      "rating": "10",
      "text": "The most visually beautiful marvel movie intermixed with the best fight scenes. Great story."
    },
    {
      "rating": "10",
      "text": "It was an amazing movie. The fighting choreography was amazing. The storyline was also good. Really recommend watching it. As always Marvel doesn't disappoint."
    },
    {
      "rating": "10",
      "text": "Best Marvel movie I have ever seen! The fights is amazing.  I really like Tony Leung, he is not evil, just wanna save his wife."
    }
  ]
}