{
  "id": 4277,
  "title": "Shanghai Knights",
  "starring": [
    "Jackie Chan",
    "Owen Wilson"
  ],
  "runtime": 115,
  "genre": [
    "Action",
    "Adventure",
    "Comedy",
    "Western"
  ],
  "description": "The dynamic duo of Chon Wang and Roy O'Bannon return for another crazy adventure. This time, they're in London to avenge the murder of Chon's father, but end up on an even bigger case. Chon's sister is there to do the same, but instead unearths a plot to kill the royal family. No one believes her, though, and it's up to Chon and Roy (who has romance on his mind) to prove her right.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vVNQStMlZS9mn2AKBEpadRunHgt.jpg",
  "categories": {
    "plot": 6.3076923076923075,
    "acting": 7.111111111111111,
    "ending": 8.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.181818181818182,
    "action": 4.888888888888889
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Rarely is a sequel as good as the original. This is the exception. Shanghai Knights is superbly done, from the plot and the dynamics between the two central characters to the music and fight/dance choreography, this excels at them all. Jackie Chan shines as usual with his comedic martial arts moves, and Owen Wilson does an excellent portrayal of a BS artist, but always loyal to his friend and vice versa. This movie is a delightful parody of era films, from silent movies to 40's dance musicals to 60's psychedelia, it has a little of everything. And that includes real life characters of the late 1800s woven throughout, many a surprise to the audience. A lot of fun to watch - 10 out of 10, easily."
    },
    {
      "rating": "9",
      "text": "An action packed comedy! I loved it Jackie Chan and Owen Wilson were hilarious and Fann Wong was good too. If you like action movies and comedy movies then Shanghai Knights is a movie for you."
    },
    {
      "rating": "2",
      "text": "It was ok but really it was just so stupid that it was likeable. The acting was poor and the action was good (for the most part). The entire plot was too generic though and lacks interest. Also it ended terribly."
    },
    {
      "rating": "5",
      "text": "It's not as fun or exciting as the original, but \"Shanghai Knights\" will pass as some Friday night popcorn movie entertainment with just enough kick to be watchable."
    },
    {
      "rating": "6",
      "text": "It is like the prequel a really solid movie but not an awesome one. I like the ideas, concept and characters. I can see this being a masterpiece if done better. One paper everything is amazing but sadly it does not work that well especially in the middle part of the movie. To be fair this can just be me. I am a huge fan of Jackie Chan by the way and so are my friends. Because it is not in anyone's top Jackie Chan movies list I think I am not that far of. It is set in 1887 a few years after the events of the prequel Shanghai Noon. In the Forbidden City in China the imperial seal is stolen and the keeper of the seal Chon Wang’s father gives his daughter Chon Lin a puzzle box for her brother with his dying breath. Meanwhile Chon Wang has become a legendary Sheriff with an impressing number of captured criminals. When he receives the box with a letter from his sister that has followed the clues to London he is searching his friend Roy O’Bannon for help. This is the start of the adventure. The story works but has some lengths and a few flaws. For example: A foreigner leading a group of Boxers is as believable as the woke left following a republican old, white and rich man that supports Donald Trump (Not as much a hyperbole as you believe). For those who don't believe this look up the goals of the Boxer, the century of humiliation and the Boxer rebellion. Back to the review. It stats strong but gets weaker in the middle and stronger when we get to the climax. I was bored in the middle parts and overall it is not in the top categories of the genre and Jackie Chan movies. Like the prequel the characters improve this. Jackie Chan is always Jackie Chan and delivers what you want to see as Chon Wang. Owen Wilson is solid as Roy O’Bannon but does not amaze me. I think mostly because Rush Hour did it better with Jackie Chan and Chris Tucker. Fann Wong (Fann Woon Fong) as Chon Lin is the hidden gem of the movie. They made a few additions with characters you might have heard of with Tom Fisher as Arthur and Aaaron Johnson as Charlie (I avoid spoilers with not telling the surnames). Good fan service except for me who knows the back story of both. I know the biographic of Charlie as I read it and a lot about Arthur too. The bad guys are good and work well. We get a good cast of characters and the actors mostly deliver. The sets, costumes and stunts are excellent too. There are some homages to older Jackie Chan movies in the fight scenes if I remember correctly. Overall I repeat that it is a solid movie but not great. It is not in the league of the best Jackie Chan movies and forgotten. I have not heard anyone mentioning this movie in years. Would neither warn nor recommend this movie."
    },
    {
      "rating": "7",
      "text": "Always loved the Shanghai movies, the first one was better though and had a more exciting and executed script. Still a very needed and fun sequel with diamond material. Would've loved the third one."
    },
    {
      "rating": "2",
      "text": "I really tried to enjoy this movie as it appears to be rated as the fourth best Jackie Chan movie according to user reviews. Yes the choreographies and fights in general are awesome thanks to this artist Jackie Chan is. Angles taken by the camera, environments and landscape scenes also are as gorgeous as the quality of the disguises. The historical links bring more depth (with the Chaplin and Conan Doyle thing). For once there is a strong woman in a movie like than, introducing Chon's sister capable to save for multiple times the protagonists' skins. Another good point is the music (excepted when the movie decides to serve us foolish scenes). The link between Chon and Roy is kinda laughable but still it's a cool bromance. About the jokes I admit I laugh at some of them (the more meta ones) but in overall they are dull.And here we come to the main flaw of the movie (and it's sadder because it was the same in the first movie 'Shanghai Noon'): jokes are sooooo predictable, often (and barely always) racist or stereotypical, pre-pubescent and unfunny. The movie hardly rises above the level of the daisies both for the jokes and for the script. As I said, Chan makes all the work here and Roy (Owen Wilson) quickly becomes the shadow of himself. All he does in the whole movie is checking women, spitting gross and/or childish words and being greedy.  He just appears to be a retarded perverted playboy, very symmetrical compared to the 1st movie (with the friend betrayal drinking part) and overacting. All the action scenes follow the same schema: 1) Roy is in danger for a reason or another and 2) Chon saves him brilliantly accompanied by some awkward fight sounds. Unless the Chon's sister I wrote about, all of the other females of the story are just objects (I'm just avoiding to use the term 'hoes'). The only romance of the story is awefully predictable and dumb.This movie obviously had so much better to do but *sigh* it is just an even paler copy thant the first one."
    },
    {
      "rating": "8",
      "text": "This film starts off with Jackie Chan's character from the first movie (Shanghai Noon), Chon, being the sheriff of Carson City, where he settled down after the end of the last movie. However, he doesn't stay there long, as he gets bad news from his sister - that his estranged father has been killed back in China. This results in Chon reuniting with Roy and the two of them travelling to victorian London (both movies being set in the Victorian age, just to clarify), where they accidentally stumble upon a plot to kill the Royal family. Again they end up in lots of different situations, including being thrown back in jail again and teaming up with Sir Arthur Conan Doyle! (the name of the real life author of Sherlock Holmes),.Again this movie offers a good share of comedy, with funny scenes (one of Roy O'Bannon having a dream about something totally different then waking up to being licked by a goat being one example, watch the movie you'll see what I mean - again somewhat cheesy but it has to make you laugh at least a little!), some fairly clever dialogue (as there is in the original movie) and more displays of Jackie Chan's signature comic martial arts.Somewhat random and quirky but basically good for a laugh, it again works as a funny and entertaining movie. Again I would also say that it doesn't take itself too seriously but its perfectly adequate as an entertaining comedy movie for most of the family (apart from younger children, like I said above its rated 12)."
    }
  ],
  "recommendations": [
    "true_lies",
    "shanghai_noon",
    "daredevil",
    "the_nice_guys",
    "red_2",
    "spenser_confidential",
    "last_action_hero",
    "rush_hour_2",
    "red",
    "grudge_match",
    "spy",
    "the_spy_next_door",
    "gangster_squad",
    "the_suicide_squad",
    "spider_man_far_from_home",
    "sherlock_holmes_a_game_of_shadows",
    "angel_has_fallen",
    "alex_cross",
    "the_foreigner",
    "demolition_man",
    "boss_level",
    "knight_and_day",
    "kingsman_the_secret_service",
    "the_forbidden_kingdom",
    "logan_lucky"
  ]
}