{
  "id": 2256,
  "title": "Shaun of the Dead",
  "starring": [
    "Simon Pegg",
    "Nick Frost"
  ],
  "runtime": 99,
  "genre": [
    "Horror",
    "Comedy"
  ],
  "description": "Shaun lives a supremely uneventful life, which revolves around his girlfriend, his mother, and, above all, his local pub. This gentle routine is threatened when the dead return to life and make strenuous attempts to snack on ordinary Londoners.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dgXPhzNJH8HFTBjXPB177yNx6RI.jpg",
  "categories": {
    "plot": 9.38888888888889,
    "acting": 9.391304347826088,
    "ending": 8.5,
    "soundtrack": 9.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 9.23913043478261,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie is bloody brilliant. Action-packed, hilarious and gory. The writing is funny, the acting is great, and the directing is superb. I highly recommend it."
    },
    {
      "rating": "9",
      "text": "This movie is a match made in Heaven, Zombies and comedy, it will surprise you how funny, but yet just as brutal as any other Zombie movie, I have to admit some of the emotional parts feel awkward amongst the jokes, but this is still a movie I highly recommend to fans of Zombies, and comedies in general, a fantastic movie."
    },
    {
      "rating": "8",
      "text": "Refreshing take on the zombie genre although the zombies are a bit overly stupid. (Although, who's to say that's not realism!) The gags are well done the humour well mixed with the gore, the acting is solid and overall a very enjoyable horror comedy."
    },
    {
      "rating": "8",
      "text": "This a great zombie film full of blood, guts and funny moments. It can be hard to pull of a horror and comedy all in one, but this film does it well. The film isn't scary, but the zombies do look freaky. An alright storyline and plot, and played well by the actors. The action scenes are good, mostly filled with comedy. It's violent, horrible and bloody, it's Shaun Of The Dead!"
    },
    {
      "rating": "8",
      "text": "The first hour or so is great fun, but when the characters get barracaded in a bar for the climax, the movie flames out and becomes exactly what it has been making fun of. The actual ending is amusing, though. \"Player 2 has joined the game...\""
    },
    {
      "rating": "10",
      "text": "Best zombie take ever. Extra points for Queen music. Just Ridiculously Funny."
    },
    {
      "rating": "9",
      "text": "A truly amazing film by Edgar Wright and Simon Pegg. The storyline is easy to follow. The characters are very well thought up, and the acting is superb. Shaun of the Dead is both humorous and gory and the balance is well designed. The editing, especially â"
    },
    {
      "rating": "9",
      "text": "A comedy that is best shown with a group of friends on a boring Saturday night because it will soon turn into one with great laughter.  An innovative comedy that blends the horrors of a zombie apocalypse and makes it seem like in the event of breakout, life wouldn't be so bad."
    },
    {
      "rating": "8",
      "text": "An incredibly entertaining comedy that manages to keep my interest despite seeing it at least a dozen times. The fact that it still holds up after all these years tells you how good it is."
    },
    {
      "rating": "9",
      "text": "This is a great movie. The jokes are well timed and witty. The pacing is excellent and it seemed to me that the movie lasts shorter than it does. Simon Pegg is excellent and quite believable as a Shaun the hero. The movie is a real refreshment in the Zombie genre."
    },
    {
      "rating": "9",
      "text": "Shaun of the Dead is a romantic zombie horror comedy movie about two men, one called Shaun and the other called Ed they are best friends, they like to stay home, lounge about drink coffee and play video games. Shaun wants to get back together with his ex girlfriend. He soon finds out that a zombie apocalypse is happening and he starts getting worried about his family, friends and of course his ex girlfriend. This movie is very funny you will have a lot of laughs. I like it because it is a more comedic take on a zombie movie which hasn"
    },
    {
      "rating": "10",
      "text": "Shaun of the Dead is hands-down one of the best movies of the 21st Century. Brilliantly funny and genuinely scary at points. Edgar Wright, Simon Pegg and Nick Frost are amazing."
    },
    {
      "rating": "7",
      "text": "A lighthearted zombie take. Wish there was more gun action. I'd like to see a zombie film where survivors fight off the zombies with assault rifles, miniguns, RPGs, etc, a starship troopers with zombie instead of aliens."
    },
    {
      "rating": "9",
      "text": "It's a dumb comedy. And mixed with horror. Just inventive! No movie like it. I had a good laugh, and a little scare. The music was just great!"
    },
    {
      "rating": "10",
      "text": "Funny, touching, serious, and even at times scary. It hits all the best spots from the romantic comedy and zombie genres."
    },
    {
      "rating": "10",
      "text": "Will go down as the best horror comedy of all time."
    },
    {
      "rating": "10",
      "text": "Very good zombie movie. not so scary but there is enough humor and eye-candy for horror lovers too make it a memorable view."
    },
    {
      "rating": "10",
      "text": "This film joins the ranks of other such horror movie parodies/homages the likes of Young Frankenstein. I agree with George Romero when he said \"An Absolute Blast!\". This movie will forever remain a cult classic like the original Night of the Living Dead."
    },
    {
      "rating": "9",
      "text": "This is clearly the best zombie parody I have ever seen, it beats actual zombie movies by a long shot!"
    },
    {
      "rating": "10",
      "text": "Perhaps what is so endearing about this film, aside from the ceaseless humor and the spatterings of fun gore, is the fact that the viewers find themselves sincerely attached to the characters and their plights...the film is able to leap from hysteria-humor to seriousness in a second when Pegg and his cohorts will it. A brilliant film that is actually quite a bit better than any other zombie film I've ever seen."
    },
    {
      "rating": "6",
      "text": "I think I laughed 3 times during this movie. The only thing that kept me watching was hoping it would get funnier. I thought it must get funnier because everyone had raved about this film; it never did. The best I can say was that it was OK. Hot Fuzz was much better."
    },
    {
      "rating": "9",
      "text": "I find Shaun of the Dead to be a wonderful satire of zombie movies, with witty humor and a hilarious plot line, yet it was still able to retain the traditional survivor-mentality. I think both Pegg and Frost played great idiot-saviors in the film, and Moran's role as the resistor and eventually the next meal was hilariously stunning. He had it coming."
    },
    {
      "rating": "10",
      "text": "My favorite zombie movie of all time. Stays respectful to its inspiration through the hilarious parody."
    },
    {
      "rating": "10",
      "text": "Great humour, editing, soundtrack and all the subtilties."
    },
    {
      "rating": "10",
      "text": "I'm sorry but you'd have to be retarded not in some way to like this movie. It's witty, gory, all around intelligent portrayal of zombies in a city already populated by living zombies is brilliant."
    },
    {
      "rating": "10",
      "text": "This movie made me lough hard and often. Really good comedy."
    },
    {
      "rating": "10",
      "text": "Ever Since I saw Dawn of the Dead, I knew that horror movies had a spoof coming and Shaun of the Dead was that perfect spoof. And with the Zombie violence not too unbareable to watch, The movie really made you believe that it was really happening, and these two slackers were actually saving their little town. Overall this was a hilarious movie, with some good action, and probably one of the best endings in movie history. It's a definite must see and if you want to see some Zombies eatin' some brains and a good laugh, watch this movie."
    },
    {
      "rating": "9",
      "text": "For a British film, Shaun of the Dead hits the spot, particularly as a lot of the horror movies have come from America, zombies in particular. Simon Pegg and Edgar Wright have written the film realistically and added in the homages and traits in a way that doesn't make it look too much like mass advertising or copying. Gore is bearable and the ending with the British Army culling the zombies has remained one of my all-time favourite horror movie scenes. While some of the jokes do not always appeal to all ages, the film largely increased my interest in the zombie genre. All in all, it makes a good homage and it's good to see Britain is capable of making good films after all."
    },
    {
      "rating": "8",
      "text": "Great movie. Like a mix of Spaced, Monty Python, Night of The Living Dead, and a Staurday with my friends while we LARP a zombie outbreak. Very funny. I like Brittish humour. I find it as the \"thinking man's\" humour. Watch the movie and you'll either love it, or hate it."
    },
    {
      "rating": "9",
      "text": "Shaun of the Dead is clever, witty, and just as inventive as it is funny. It took what the world knew as a horror spoof and turned it on its end. It shaped the way we look at the horror/comedy genre and will continue to be at the top tier of the genre until another film like it is made. An absolute romp from start to finish that leaves you satisfied, but wanting more. A must see for horror, comedy, or movie lovers of the like."
    },
    {
      "rating": "9",
      "text": "This has to be one the most original comedies in years. It mixes the genre of horror spectacularly with the comedy. With such a depressing subject which has been explored by people such as George A. Romero, it's not the first zombie comedy, but I do think it is the best. The lines are great, the irony is clever, and each scene leaves you with a smile. Edgar Wright is a brilliant director and I am a fan of his works that I've seen. What works in his movies is the characters are so realistic and you can immediately identify with them. An example would be Ed, he is such a jerk but he's the kind of friend you've known forever. I think everyone has had this type of friend in their life at one point or another. Edgar Wright also has great symmetry with his movies, such displayed early on with two near identical long takes, that are just beautiful to behold. Also nearly every line has a just payoff, making the dialogue also very clever. The comedy is hilarious, the characters are great, and the editing is fast-paced and brilliant which leaves this movie impossible to keep your eyes off."
    },
    {
      "rating": "9",
      "text": "It should be noted that this is the best Zombie film of the 21st century. It also should be noted that the superior quality of this film made Edgar Wright and Simon Pegg internationally noticed."
    },
    {
      "rating": "8",
      "text": "The most memorable zombie comedy to date, Shaun of the Dead is just as good now as when it came out 16 years ago. As the first entry in Edgar Wright's Three Cornettos trilogy, it establishes a lot of ideas and elements that carry through all three films. The movie is thought provoking, sad when it needs to be sad, funny when it needs to be funny, and gory when it needs to be gory. There are a few slow scenes in the film, but this is a must-see for any zombie or comedy fan."
    },
    {
      "rating": "8",
      "text": "This movie is a match made in Heaven, Zombies and comedy, it will surprise you how funny, but yet just as brutal as any other Zombie movie, I have to admit some of the emotional parts feel awkward amongst the jokes, but this is still a movie I highly recommend to fans of Zombies, and comedies in general, a fantastic movie."
    },
    {
      "rating": "8",
      "text": "Great film with lots of laugh and some action packed moments. Is a zombie film that at the same time honors and make fun of the strongholds of the zombie genre. The directing of Wright is, as always, superb. The cast is quite good and the jokes are always funny.Is not the funniest of the Cornetto Trilogy (The award goes to Hot Fuzz) but is still a solid, well executed and hilarious film."
    },
    {
      "rating": "9",
      "text": "A fantastic mix of romantic comedy, zombie movie homage and social commentary portrayed through excellent writing and direction and helped along by the strength of the personality of the stars."
    },
    {
      "rating": "10",
      "text": "Shaun of the Dead probably shouldn't work. It aims to be funny, dramatic, exciting, and totally brutal all at once. But it does work. Every element works like gangbusters, never feeling disjointed. It's brilliantly directed by Edgar Wright in his feature debut. It's edited in such a way that's full of energy and cuts all fat from the edges. The cast sells the comedy and the drama. The action is tense, and you truly feel as if the characters are in danger. You care if they live or die.Wright and his co-writer Simon Pegg (who also stars in the film) clearly love the zombie genre, and they play around with its conventions in wonderfully hilarious ways, without ever making the film feel like a parody. The attention to detail is astounding. I've seen it countless times, and I discover something new with every viewing. An absolute blast from start to finish, this is one of the best zombie movies ever made."
    },
    {
      "rating": "10",
      "text": "Absolutely hilarious British comedy, and honestly the best of its type. This is definitely one of my all time fave movies and will give anyone a good belly laugh. It does have some emotional moments throughout but is mostly just an awesome zombie comedy."
    },
    {
      "rating": "9",
      "text": "Comedy zombie movie. Great characters, hilarious jokes, fun.I highly recommend it."
    },
    {
      "rating": "10",
      "text": "No one!!!!!!!!!!!!! Ever!!!!!!! Beats!!!!!!! SHAUN!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "Shaun Of The Dead is honestly a masterpiece and a half, the plot is honestly great. It's about this man called Shaun (Simon Pegg) we can tell from the start of this movie he's not a very brave character and he get's talked over a lot but that later changes when the zombies start to appear.Also, throughout this movie we get to see the character of Shaun change from how he once was and it's done so well. The other characters throughout this movie are also great especially Ed (Nick Frost) he's a very hilarious character from start to finish and so is Shaun throughout this movie.The chemistry which Shaun and Ed have throughout this movie is honestly great, it's nicely displayed when they're either murdering a bunch of zombies together or just having some banter together in a pub, either way the two of them have got some great chemistry with each other throughout this movie.Finally, the movie's got some very cleverly done fight scenes but oh my god, they're very brutal, very gory and very bloody but they're amazingly well done. Also, the love interest which Shaun has got for Liz (Kate Ashfield) is built up very well and it's honestly great.Overall, Shaun Of The Dead is honestly a masterpiece and a half. The movie's got a great plot, brilliant and funny characters, a great love interest, bloody and gory fight scenes, the dialogue is honestly great and so is the acting from all the cast, it's honestly worth the watch."
    },
    {
      "rating": "9",
      "text": "Shaun of the Dead is a very good movie. the plot is very good and the characters are unforgettable. One of the best comedies ever made."
    },
    {
      "rating": "10",
      "text": "Shaun of the Dead has to be one of the funniest movies ever made. Simon Pegg and Nick frost make for an awesome comedic duo, as also seen in Hot Fuzz.The movie manages to give laughs, as well as being somewhat frightening and touching at points.9/10, great piece of art!"
    },
    {
      "rating": "8",
      "text": "Other than the \"Simon Pegg+Nick Frost\" performance combo, \"Shaun of the Dead\" throws in humor, a humor that applies to every kind of problems we have; politics, life, love and so on. A zombie movie that is humorously scary to watch."
    },
    {
      "rating": "10",
      "text": "One of the best zombie movies ever. The death parts were very funny!"
    },
    {
      "rating": "10",
      "text": "Great British zombie horror comedy that I ever seen. Everyone is hilarious and they have the funniest catchphrases."
    },
    {
      "rating": "10",
      "text": "British humour at it's best.  What kind of person couldn't adore such awesome characters mixed in with the most dangerous situation known to humanity.  I still can't believe that there is red on reviews.  sex on a disc!"
    },
    {
      "rating": "10",
      "text": "An amazing film starting off an amazing film series. This film is perfect, and the best in the trilogy. The humour is great, and the action sequences are also great. The character development is good. There are so many little touches in the films you may not notice, which make the film completely perfect, and in my opinion, the best film ever made."
    },
    {
      "rating": "10",
      "text": "Unbelievably funny.  I saw this just a year ago and screamed in laughter.  These actors were so funny and had great comedic timing.  It is bloody even for the TV version so for R, you are probably in for some gruesome scenes.  The storyline, even if it is a spoof of the classic \"Dawn of the Dead\"  was original and brilliantly written."
    },
    {
      "rating": "10",
      "text": "Simon Pegg, Nick Frost and Edgar Wright could be described as the new Three Stooges, having given us so many wonderfully funny treats each year. However, their 2004 \"romzomcom\" shot them to stardom and single-handedly managed to revive British horror. Shaun is a young man working in an electrical store has a rocky relationship with his mum, his girlfriend Liz is on the verge of dumping him and his best mate Ed is a complete slob who spends his days on Shaun's couch playing videogames and drinking beer, When he finally decides to get off his feet and sort his life out, a zombie invasion takes place but Shaun merely sees it as another obstacle. When he rounds up his family and friends and takes them to his local pub to try and survive the night. A real treat for all fans of British comedy and at the same time a gorefest that harkens back to the days of Peter Jackson's Braindead. Bloody brilliant."
    }
  ]
}