{
  "id": 3085,
  "title": "Shaun the Sheep Movie",
  "starring": [
    "Justin Fletcher",
    "John Sparkes"
  ],
  "runtime": 85,
  "genre": [
    "Family",
    "Animation",
    "Comedy",
    "Adventure"
  ],
  "description": "When Shaun decides to take the day off and have some fun, he gets a little more action than he bargained for. A mix up with the Farmer, a caravan and a very steep hill lead them all to the Big City and it's up to Shaun and the flock to return everyone safely to the green grass of home.",
  "releaseYear": "2015",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dhVYlfMNc2bfXPB83LLL00I4l9n.jpg",
  "categories": {
    "plot": 8.241379310344827,
    "acting": 8.705882352941176,
    "ending": 9.0,
    "soundtrack": 5.5,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.5,
    "action": 8.666666666666666
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I took my 6 year old son and his two 8 year old friends to see this movie. They loved it and laughed the entire time. I was very surprised at how funny and cute this movie was with no words. So different from what I'm used to, better than the other kids movies. It was worth the money, Yes I recommend it, I will be bringing my daughter to see it also."
    },
    {
      "rating": "8",
      "text": "Saw it on the plane and the journey flew by. Typically British, not too flash and a little risque. No dialogue and none needed. Kids will love it and so will their folks. Lots of laugh out loud bits. To advertise this movie online they put up a very funny poster skit ( Mission Impossible)of  Shaun hanging on airplane wing..emblazoned Mutton Impossible: Rogue Bacon. That alone should make it worth seeing."
    },
    {
      "rating": "7",
      "text": "The latest from the unconventional animators at Aardman features their TV-star sheep, whose idyllic farm life is disrupted when he and his flock go to the big city to find their farmer. It's loaded with the witty gags and wacky characters. To make it even more inventive, there's no dialogue: only animal noises, grunts, goofy sound effects and a bouncy soundtrack. While there aren't American style broad jokes, there are plenty of sweet, clever and delightful moments. A charming experience for anyone who enjoys engaging animation."
    },
    {
      "rating": "7",
      "text": "Another enjoyable outing from Aardman Animations who also gave us Wallace and Gromit. Whilst perhaps not quite as good as its predecessor this still can boast an inventive story that is also a lot of fun. Being dialogue free is in no way a hindrance to the film’s success as the rich detail on display is not only clever but elicits more than a few chuckles. The restaurant scene alone is worth the price of admission. Adult audiences who are true film buffs will also relish the references made to classic movies of the past such as ‘Taxi Driver’. These asides will, of course, go over the heads of tots but they won’t care as there is so much else on display for them to enjoy. The last twenty minutes or so become a tad frenetic which is a common failing in toons these days. However, at a time when animated films seem to be in the doldrums it is ironic that this is also CGI free."
    },
    {
      "rating": "8",
      "text": "After so much blood and guts this summer, we (two adults) decided to go to something just for fun, and Shaun the Sheep was exactly right. I don’t know if I have ever seen a film of any kind that was so constantly inventive without ever being heavy-handed. The film was like skating fast on a frozen river where danger and cleverness lurked at every turn. The film was beautifully done both visually and story-wise. And watch for the Silence of the Lambs and Night of the Hunter references."
    },
    {
      "rating": "8",
      "text": "It's a wonderful stop motion animation with enough wisecracking humour. The animation is outstandingly complicated and intricate. A film that can carry itself with absolutely no dialogue in this day and age is a testament to itself. It is very British, a little bit for adults. Both them and their kids will laugh so hard."
    },
    {
      "rating": "8",
      "text": "Liked this film a lot -- although it didn't meet my high expectations -- but there's no denying this was a very good film with some consistently funny gags, entertaining slapstick and amazing shots. Seriously, the movie as whole is excellently shot and brilliantly animated. It's smart with its jokes, it's inventive and above all, fun, especially for the target audience.\r Final Score: 8/10"
    },
    {
      "rating": "8",
      "text": "Man's second best friend is Sheep?\r The story is about Shaun the main character decides to take the day off and have some fun, he gets a little more action than he bargained for. A mix up with the Farmer, a caravan, and a very steep hill lead them all to the Big City and it's up to Shaun and the flock to return everyone safely to the green grass of home.\r I know these a lot of people that may not seen the TV series of Shaun the Sheep and here's my quick opinion on the TV series. I liked the show, I thought the animation was pretty good I mean stop motion never get's old well to me it doesn't. The show had a good sense of humor to it and the character's without talking makes them even more enjoyable to watch. Now we got the movie and to my surprise this is actually a enjoyable movie and a great one as well.\r The animation once again looks well detailed and great I mean just like I said before about stop motion animation never getting old and still looks great even today. Nice work to the people who did the animation for the movie, you made a good looking movie.\r The character's in the movie are the same in the TV series and I'm saying that in a positive way because them not saying anything only sheep noises and you also got a dog that don't talk (Thank the lord for that) but anywhere they dialogue are them talking in their own animal langue and it's still interesting to see them interacting with each other like that, and that takes talent for me to be more interested with character's that are not human or don't talk human.\r The whole movie is trying to get the farmer home just because he got knocked out by a solid object and falls into caravan it falls into town and all of the sheep and the pet dog from the farm have to go out and search for him, that's whole the movie right there and it's short and to my surprise it flowed very well not like other movies that are short and the story line is too basic.\r If I have to name problems from the movie these only some like: The villain of the movie just felt like your basic, cliche, not that interesting villain with a poor character ark that every time his on I felt it would be a lot better if he wasn't there at all. And that's really it for problems.\r Overall Shaun the Sheep: The Movie is a good family movie with clever and well thought out jokes that flow extremely well even for a kids movie. Great character's, outstanding animation, funny humor and a good stand alone movie that's worth seeing if you have seen the show, if you have not please watch the show first to get to know everyone and then watch the movie."
    },
    {
      "rating": "8",
      "text": "I think its great seeing how much Shaun has evolved, considering he started out as a side-character in a Wallace and Gromit short. Anyway, this was a great film with NO voice acting. Yeah, its pretty crazy, when you think about how long this film is. I hope that audiences in the USA will search up 'SHAUN THE SHEEP' on YouTube and watch the original shorts, AND the original short (if you're wondering, search up 'Wallace and Gromit: A Close Shave on YouTube). Anyway, if you're new to Aardman Animation then definitely check this one out. Its got the great British humour that all things Aardman have, and its a great movie for the whole family to enjoy."
    },
    {
      "rating": "9",
      "text": "I went into this expecting it to be average at best. I love all the Wallace and Gromit animations, but never really got into the whole Shaun the Sheep thing, and I didn't think they could translate it into full length movie. However, I was very pleasantly surprised. It was really charming and funny, and I loved it. I usually go for more action-y movies, but this was great, and I'd recommend it to anyone. Thank you for existing, Aardman."
    },
    {
      "rating": "9",
      "text": "Shaun the Sheep is a hilarious, touching, beautifully animated film that captures the spirit that made silent films so special. While this movie is more directed at children, adults will get plenty of enjoyment from this as well. The slapstick humor offers plenty of hilarious moments, and on numerous occasions everybody in the theater will find themselves laughing hysterically. Besides that the film is beautifully animated, which is even more impressive when one considers the time it takes to make a stop animation film. I will say the biggest surprise was the emotional depth of the film, filled with characters that couldn't talk, it conveyed a story that everybody could follow that was never weak, and had moments that made me feel like a child again, from the opening to the heartbreaking scene in the barbershop. In essence Shaun the Sheep is everything you want it to be for kids and adults, it's hilarious, nice to look at, but it also has a great emotional depth, much like the best works of Pixar."
    },
    {
      "rating": "8",
      "text": "Although this movie didn't include interaction between characters, we get an original story based on a TV Show. The story was simple and fun and really there's not much to say about this. Take your whole family and find out what you've been missing."
    },
    {
      "rating": "10",
      "text": "Absolutely adorable. I don't feel that the lack of dialogue took away from the film at all – sometimes we don't need words. Who would have expected that sheeps' facial expressions would be enough? Nobody else that I saw it with enjoyed it nearly as much as I did, but hey! Their loss! Sheep are quite hilarious in a subtle way that the animators took full advantage of. Putting humans to sleep by jumping over a fence – priceless. Thumbs up, Shaun the Sheep.You even managed to warm my heart with the importance of family."
    },
    {
      "rating": "8",
      "text": "Really nice movie if you liked Shaun the Sheep animated series you'll enjoy this too. You can not only enjoy how they can make an amazing movie with no talking, but also it is made from clay figures or whatever this is, which makes it even more amazing. I think this is an amazing family movie."
    },
    {
      "rating": "9",
      "text": "Excellent Film! This is a non-dialouge film that uses a great paced plot, stunning stop-motion animation that pays attention to detail, and a great use of a wide variety of humour. It can be enjoyed by Adults, teens, and children alike!"
    },
    {
      "rating": "10",
      "text": "It's always true that the best kids films are the ones made for adults too, and I wasn't the only adult at this film. Aardman studios, best described as artists in film making, with no dialogue whatsoever in the film yet the storyline is told effortlessly. Perfection, nothing more, nothing less."
    },
    {
      "rating": "9",
      "text": "Shaun the Sheep Movie does not have one single word of intelligible dialogue. The animals go “Wrr wrr wrr,” the humans go, “Wha wha wha,” and the movie is all the better for it. Without the dependency on words for humor, the filmmakers have gone above and beyond to create nonstop physical gags and visual puns. This is truly a movie that you cannot look away from without missing a joke.\r While the story is not incredibly original, the route taken to tell the story is incredibly efficient and stupidly adorable. Baby sheep, homeless dogs, crying animals, hugs, kisses– what else do you need to warm the dead cockles of your heart? Are you really so defeated in life to not receive any warmth from the heart of the film? Even the most gruff humans around would watch Shaun the Sheep Movie and need to sneak an, “awww shucks,” every so often."
    },
    {
      "rating": "9",
      "text": "Shaun the Sheep is another \"BAH!\" way to say... \"Great movie and I will see it again if I wanted to!\" but it's obviously not the best animated feature of 2015."
    },
    {
      "rating": "9",
      "text": "It's a good film\rGreat animation, smart screenplay and a lot of good characters and  brilliant comedy\rOne if the bests works of Aardman Animation since Wallace and Grommit and Flushed Away\rIf you are looking for a movie to entertain a kid, this is a perfect choice"
    },
    {
      "rating": "10",
      "text": "By far the best animated movie of the year. (In my opinion.) The animation is wonderful, the story is adorable, and the comedy is hilarious. Definitely recommended."
    },
    {
      "rating": "10",
      "text": "The whole movie is awesome, the animation is amazing. All the elements fit perfectly, I really liked it, the animations should be more like this one!!"
    },
    {
      "rating": "8",
      "text": "An adorable, hilarious, well-crafted, animated gem. It's filled with great gags and emotional moments. Even without any dialogue, \"Shaun the Sheep Movie\" speaks volumes."
    },
    {
      "rating": "9",
      "text": "Losing that you love makes you realise its value.\r The only reason to I go to Nick is to watch 'Shaun the Sheep'. This show was watched by many adults as well, a popular one among all the ages. As the fan of this series, we have been waiting very long to get a movie version. I was excited to see it and of course enjoyed it completely. Its impossible one to get disappointed with the movie/show when the narration is led by one of the awesome characters, Shaun. The promotional posters were also created some extra curiosity that imitated the famous Hollywood films like 'Boyhood', 'Wild', 'Birdman' and many others.\r Stop-motion is a very-very hard and outdated concept of the animation format, but still loved by many. Every year only one or two get released, sometimes none. The technical sides were upgraded, including bluescreens for backgrounds and other special effects. Still the hard work remains, but qualities are improved. It made significant contributions to the live-shot movies in the old days when there was no CGI. So when we see a movie like this, the product reveals in each and every frames the real vision from the artist and writer's perspective. Every detail, every corner of the screen tells the story.\r It was so good as a television show, because of short and sweetness. The filmmaker intended to create the same magic, except the credits its just a below 80 minute movie. Had a good storyline and a couple of new characters were introduced. Because the new adventure extended its area volume and so the antagonist was needed. Shaun and his buddies set foot outside their barn to find their lost farmer. The journey begins towards the big city and the movie discloses their risky and dangerous undertaking. They go pass lots of stages to accomplish their quest and only the last quarter reveals result with a thrilling chase scene.\r Unlike the series, it was not completely a fun movie. There are some emotions involved, and I was amazed by those exhibitions. Because of some kind of childhood connection between Shaun and Co and their owner. That was unexpected, but was really very nice to see the other side of them. We know Shaun is a curious character, he always wants to learn and try new things. So when he has to make an unexpected decision, it does not go as planned and the fun begins with their mischievous adventure in an unfamiliar territory.\r As usual without the dialogues, that can be understandable by everyone without a language barrier. A true family movie, from grandparents to grandchildren together watchable flick. Almost a masterpiece, offers a lot of great moments to give ourselves to it. And for the fans its a celebration time for sure. Definitely this movie would get into the final shortlist for the upcoming (2016) Oscars, if not, that would be a shame for the entire ceremony. But for winning, we have to wait till how good 'The Good Dinosaur' going to be. In the meantime, don't miss this little cute flick.\r 8½/10"
    },
    {
      "rating": "7",
      "text": "A cute and sometimes funny family film. Kids will love it, and with some classic humor, adults will too. I wasn't expecting it to be all that, but I found it was enjoyable."
    },
    {
      "rating": "10",
      "text": "Es increible el gran trabajo que se hizo en el filme. Aardman vuelve con lo mejor en esta gran comedia animada. La historia,la animación,los personajes,las canciónes,todo fue escrito con mucho cuidado y con cariño y sin la necesidad de dialogos. Y lo que hace Shaun the Sheep Movie es realmente impresionante y divertido, Starzak y Burton demostrarón a Aardman que lo mas dificil que cueste hacer una película sin dialogos,puede lograr grandes resultados. Shaun the sheep Movie es definitivamente una gran obra maestra,es graciosa,entretenida y emotiva. Una película perfecta para verla en familia."
    },
    {
      "rating": "5",
      "text": "I was never really into Shaun the Sheep when I was kid and I also didn't enjoy this movie as much as I would if I was. I probably had the same problem with this film as I had with minions. It isn't bad idea but it's too much minutes for too little words.Shaun the Sheep is great idea but much more enjoyable when it's in seven minutes instead of 85. I think that story had too slow tempo for how long it was and I also felt like I already saw it because the story wasn't really original when it comes to it and also gags in this movie weren't really that funny. I think that even 5-years-old are already full of this same kind of jokes.I personally enjoyed \"emotional part\" of this movie more, than I enjoyed the \"funny part\".On the other hand I really loved animation and soundtrack of this film which was truly briliant and one of the factors why I had energy to finish this movie because without it I wouldn't do that and for me, the last 15 minutes of this movie was the best part. The idea was great but they should have worked on it more."
    },
    {
      "rating": "8",
      "text": "personally believe that the movie is a little bit overrated( some people think It's better than Inside Out, No WAY!) I mean 81/100 is a great critics score, but Monster's inc got 78/100 which I think is totally unfair. but forget them, I was surprised when I saw this movie. I thought it was just gonna be funny, not emotional too. when their beloved-owner forgets them while he became famous basically because of them(!) I have to admit it was dramatic, that's what you go and a watch a movie for, to be spellbound.\roverall, I think this movie will surely get an academy award nomination for best animated- feature ( as the academy likes Aardman) but It's winning is probably impossible, given that We've got a masterpiece here, Inside Out( which I believe is one of the best movies of all time) and another great movie(though I've not seen it yet) Anomalisa and of course another Pixar movie The Good Dinosaur."
    },
    {
      "rating": "10",
      "text": "I saw it with my family and we laugh a lot! Aardman showed he can also make a film adaptation of a series excluding dialogue. The great work of Starzak and Burton showes a great animated comedy and emotional of 85-minute with songs, cultural references, jokes and a great message. Shaun the Sheep Movie is definitely one of the best animated movies with Inside out really deserves an Oscar."
    },
    {
      "rating": "10",
      "text": "Shaun, el cordero: La Película (2015)Sinopsis:Shaun, una oveja lista y traviesa, vive con su rebaño bajo la supervisión del Granjero y de Bitzer, un despistado perro pastor con muy buenas intenciones. Pero la vida en la granja es muy monótona, así que Shaun idea un plan para tener un día libre.Opinión:No tengo palabras, siento que el alma me volvió al cuerpo, es una película totalmente maravillosa.Valoración:⭐⭐⭐⭐⭐"
    },
    {
      "rating": "8",
      "text": "Shaun the Sheep is charming. While this is a simple day off story with gags, beats, and cliché characters you’ve seen before it’ll be hard to let them get to you. Not only did Aardman throw their back out creating charming stop-motion but they told a story without dialogue. The story is conveyed through creative ways and charming characters. Sheep who are mischevious yet still likeable, a cliché animal catcher whose still charming, and a dog who just is trying to do his job. With characters are charming as these you won’t want to throw them away like the animal catcher but take them home and adopt them. This isn’t a deep, tear-jerker like Inside Out; but there is something entertaining about a film that doesn’t have a deep story, water itself down for children, or bombard you pop culture references constantly (ok there are two in here that are cute) but instead keeps things simple and gives you characters to connect with. Aardman continues to shine in these elements and hopefully they’ll stick around and make more films like these."
    },
    {
      "rating": "10",
      "text": "I rarely give movies a 10 star rating, but this film is perfect.  First and foremost, it's hilarious.  There are many laugh out loud moments.  The movie relies mostly on sight gags as there is no dialogue.  Anyone who has watched the first 30 minutes of Pixar's \"Wall-E\" knows that dialogue is not needed for an excellent experience.  Aardman's stop-motion animation is second to none and is dazzling.  Even the low-brow humor (fart jokes, etc.) works in this movie, where in other animated films it feels tiresome and dated.  I hope there is a sequel someday."
    },
    {
      "rating": "6",
      "text": "Not as good effort from Aardman, less funny than usual but still typically entertaining."
    },
    {
      "rating": "9",
      "text": "A fantastic and hilarious movie overall that captures the charm of the series, but the rather cliché villain lowered my enjoyment of it slightly."
    },
    {
      "rating": "10",
      "text": "With a warm spirit and a mound of enjoyable (and truly funny) jokes that will surely make laugh any kind of viewer, Shaun the Sheep is another must-see welcome and unforgettable addition to Aardman's filmography."
    },
    {
      "rating": "9",
      "text": "Fortunate sons of the silent age. The story is narrated in agile way, that does not seem like a long episode of television. A manhunt, runaway experience plenty of comical cultural references and movies. Another rebuffed by mean Uncle Oscar."
    },
    {
      "rating": "9",
      "text": "Aardman Studios must continue to make films like this to inspire producers for making simple yet very compelling movies. They have done it with “Chicken Run” and “Wallace & Gromit”, and for this time, based from the successful television series, Shaun and the flock go to the Big City to find The Farmer until things do not go according to plan.The Aardman Studios has crafted yet another stop-motion animation which appeals to the heart and laughter of its audience. But what makes this truly amazing is how an 80-minute exciting journey of animals becomes a very delightful and charming family movie, and in this case, without any words and dialogues. There are plenty of gags that are pure to the heartstrings and a lot of adorable moments for children. Moreover, “Shaun the Sheep Movie” lets the viewers be intoxicatingly attached to the characters for unexpected yet hilarious spectacle.VERDICT: An old-fashioned yet long breath of fresh air which captivates its audience of all ages."
    },
    {
      "rating": "9",
      "text": "Sometimes, Silent Is BetterBased on the extremely popular UK stop motion series, Shaun The Sheep the movie knows how to handle characters that don’t speak (Unlike Minions which came out the same year)."
    },
    {
      "rating": "6",
      "text": "This movie has some funny bits, but what I will remember is the emotion. Not bad but not essential either."
    },
    {
      "rating": "6",
      "text": "This movie was something totally unexpected to me. When I first started watching, I thought a movie for kids would bore me dead. The absence of spoken dialogue was something I had not seen in a feature film for a long time, at least since the last time I watched a silent movie. But I didn't get annoyed, on the contrary. I thought it has its own beauty and it's funny, even though it's not the kind of movie I see every day.We do not have a fixed plot. The story told is very light and gives space for the several jokes and humour moments that they wanted to create in the middle. In essence, the film tells how a flock of funny sheep tries to find their farmer, missing for days in the middle of the big city and suffering from amnesia. Of course, there is a villain, who is the city's animal control agent (we've seen something like that in other animal movies in town).This is a stop-motion animated film... nothing more, nothing less than the most laborious and arduous technique for making animated films. Aardman still uses it regularly, probably being the latest animation studio to do so, and is adept at this technique, so it should not be surprising if I say that the whole film is technically impeccable. Even the soundtrack worked very well. As I already mentioned, I was very surprised at the decision not to use spoken dialogue. But it even made sense, because it puts human beings at the margins of history to give space to animals.The film earned the Oscar nomination in its respective category (\"Best Animated Film\"), but never went beyond that. Despite this, and the film seems to have been quickly forgotten by the public, it did deserve it. It's not brilliant nor remarkable, it's perfectly forgettable due to the absence of an impact script... but it's a technical feat and it's funny."
    },
    {
      "rating": "10",
      "text": "This is the best movie I have ever watched in my life. The main character Shaun is so wacky and charming. If I were a sheep I would date Shaun he is such a handsome and charming man. I honestly am jealous of Timmy the sheep for being so close to that sexy sheep. God if I could get a sniff of that wool or maybe even a grasp at his hooves. I feel the same way with Wallace and Gromit that dog and cheese man god lucky bastards they are."
    }
  ],
  "recommendations": [
    "the_croods",
    "the_lego_movie",
    "zootopia",
    "flushed_away",
    "up",
    "ratatouille",
    "rango",
    "bolt",
    "madagascar",
    "storks",
    "cloudy_with_a_chance_of_meatballs_2",
    "the_peanuts_movie",
    "rio",
    "ice_age",
    "over_the_hedge",
    "meet_the_robinsons",
    "hotel_transylvania",
    "ice_age_the_meltdown",
    "puss_in_boots_the_last_wish",
    "despicable_me",
    "peter_rabbit",
    "atlantis_the_lost_empire",
    "captain_underpants_the_first_epic_movie",
    "onward",
    "paranorman"
  ]
}