{
  "id": 569,
  "title": "Shazam!",
  "starring": [
    "Zachary Levi",
    "Mark Strong"
  ],
  "runtime": 132,
  "genre": [
    "Action",
    "Comedy",
    "Fantasy"
  ],
  "description": "A boy is given the ability to become an adult superhero in times of need with a single magic word.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xnopI5Xtky18MPhK40cZAGAOVeV.jpg",
  "categories": {
    "plot": 8.1,
    "acting": 8.722222222222221,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.185185185185185,
    "action": 8.625
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Filled with humour, One of the finest DC movie since wonder woman.A perfect Example of how an all-rounder movie should be directed & produced. ZacharyLevi & JackDylanGrazer's charismatic performances , Humour, Action, VFX, direction Casting makes the movie electrifying stunning! ⚡⚡⚡"
    },
    {
      "rating": "8",
      "text": "Think a mash-up of \"Superman,\" \"Big\" and \"Jumanji\"... Yes, spoilers ahead if you keep reading. I very much enjoyed this film. Zach Levi (from \"Chuck\") was born to play this role.  My only criticism of his performance is that the younger (non-Shazam) version of himself is cynical, shrewd, and not all that funny - he's been through a lot having been abandoned by his mother, so it makes sense. When he's in the BIG role, he's much more, for lack of a better word, \"goofy.\" The consistency is not there, but this didn't kill it for me.  Much more importantly, the casting director found Jack Dylan Grazer to play Freddy Freeman.  Believe it or not, he's the beating heart of this film. Brilliant work- extremely funny but not in the typical \"sassy teen\" way.  If you can't feel for him, everything else falls apart. I also absolutely loved Cooper Andrews (Jerry from The Walking Dead) and Marta Milans as the foster parents. They're more tangibly \"real\" than any other parents in these superhero flicks. Believe it or not, Mark Strong is only OK in this film.  Sure, he's the bad guy, and they give him a really good back story which I won't spoil, but he doesn't bring a unique spin to the all-powerful menacing force. I also liked exacxtly how they acknowledge the other existing DC superheroes in this world - Batman, Superman, etc. are a \"thing\", but they handle it in a very organic way - if you're  a fan of thse things, you'll smile. BIGGER spoiler (without giving too much up)....  When the entire family goes through their \"thing\" toward the end, the casting director did a phenomenal job - all those new parts are all perfectly cast. Love all those actors - particularly Michelle Borth (Hawaii 5-0) and Meagan Good. Triumphant ending. Recommended for sure."
    },
    {
      "rating": "9",
      "text": "These days, if a comic book movie is not either super serious and well-acted (see: The Dark Knight), or VERY funny (see: Deadpool or the first Iron Man), I'm typically bored to death by them (see: Avengers, Civil War, etc, etc.).  Shazam is just a hell of a lot of fun.  It's funny, it's quick, and the actors are all incredibly sympathetic.  The concept is simple but entirely effective. My sneak preview screening was met by roars of approval, big laughs, and applause at the end.  If you're going to see it, by all means, stay for the credit sequence (with a bad-ass Ramones song underlying it).  Clearly,  the makers of this movie are comic book lovers."
    },
    {
      "rating": "9",
      "text": "This movie was wonderful! If this is the direction that the DCEU is going in, I might just have to consider myself a fan! This movie had a great story, great characters, solid jokes, a good script, and a lot of heart! It reminded me a lot of Spider-Man Homecoming. It’s a much smaller-scale superhero story, focussing on a small cast of characters and not existing solely to set up sequels. *cough*Batman v Superman*cough* I really like how authentic this movie felt. It takes place in a universe where superheroes exist, but they aren’t going around flying everywhere. The connections to the other movies are loose. That’s probably what a universe full of superheroes would really be like. They would be rare. You wouldn’t see them every day. The Marvel Cinematic Universe doesn’t really feel that way to me. It’s missing that human element of what it’s like to live in a universe full of heroes and gods just as a regular average citizen. Maybe that’s why I don’t really like the MCU that much. Maybe that’s why Ioved Spider-Man Homecoming so much. I like stories about regular people living in larger-than-life universes. Anyway, back to Shazam, this is a must-see for any fan of superheroes and family comedies! Maybe don’t take the little ones though. I was kinda surprised, this movie looks really kid-friendly, it has a main cast of mostly child actors who do a really good job, but it actually has some really scary parts! There were kids crying in my theatre. Just a heads-up. All that aside, I loved this movie, it’s a ton of fun. Highly recommended! Now the only movie from the DCEU I haven’t seen is Man of Steel. (I finally watched Wonder Woman. It’s good.) Should I go watch it or should I let my positive feelings for the DCEU stay a little longer? Hmm..."
    },
    {
      "rating": "6",
      "text": "Decent movie but I kinda felt the target audience is more kids or maybe families not guys around 30 years old like me :D"
    },
    {
      "rating": "7",
      "text": "This movie has good action, and it is very funny!all the actors are doing a good job, the kids all acted very good. it has a good and heartwarming story.7,5/10"
    },
    {
      "rating": "6",
      "text": "A comic book movie that was designed to make people chuckle and laugh and where it did do that and did it okay...I felt like there was a lot of moments here just forced on for the sake of it...It felt like this was a movie where it had to hit certain pop culture references for the sake of a laugh (Kid turns into adult with super powers and one of the first things he does is Floss because kids etc) It isnt a bad DCEU movie at all, It is one of the better ones for sure but personally felt a bit TOO forced on..."
    },
    {
      "rating": "7",
      "text": "My personal second favorite of the DCEU. Shazam is an interesting character. The movie was very fun and entertaining to watch. The movie did its humor well for the most part. And the villain had cool action scenes. The plot was kinda weak and the villain is forgettable, but still a great movie."
    },
    {
      "rating": "6",
      "text": "How is that The grown-up Billy (Levi) is more funny and childish than the little Billy?Great sound and graphic FX. But that's pretty much it."
    },
    {
      "rating": "8",
      "text": "Shazam was a pleasant surprise for the DCEU as it is heartfelt, action-packed, and features some lovable main characters. The plot keeps you on your feet and there’s never really a dull beat and features a great climax. While lighthearted, not all the jokes really hit it for me, but the overall optimism coming from this movie was nice. However, the film was not as unique-looking as other DCEU movies and the CG was a bit mediocre. In the end, though, Shazam is a great time at the movies and another brightspot for the growing DCEU"
    },
    {
      "rating": "8",
      "text": "This movie legitimately surprises me. It is funny, energetic ,... but it has hearts, not many superhero films since Guardians of The Galaxy has made me feel fresh again, caughinnnn...Captain Marvel, never got over that terrible flu. The opening scene isn't what i was expecting, it was chilling. Zachery Levi was perfect casting here, it is hard to imagine someone else could play a 15 years old boy in a grown up man's body. Eventhough Shazam is not as good as or as thematical the original Spider Man movie IMO and the villain is not developed well enough, it still stands out and really has the tone of those movies, and the ending is awesome."
    },
    {
      "rating": "3",
      "text": "This could have worked for me if I was maybe 7-8 years old. In all honesty this was pretty weak sauce."
    },
    {
      "rating": "7",
      "text": "The movie has the same mediocre special effects of most DC movies.Most of the acting was pretty darn good.The scenarios were also pretty darn great at times.Humor was more entertaining than the times it fell flat. (Santa)The beginning was a solid 8. Could have been a 9 if it handled some of its good ideas better. (Bus scene was a great idea, but handled poorly)Then the action sequences took a child cartoon approach. (for obvious reasons) Which drastically hurt the last bit of the movie for me. (Ironically, most people enjoyed the ending, and hated the start. But then again, most super hero fans tend to like action, and I tend to find it boring, if nothing interesting is happening.)The ending could have been a massive success, if they copied ONE thing from the marvel movies. (Sadly I can't say what it is, otherwise knowing it doesnt contain this, is a sort of spoiler.) But like the rest of the movie, the ending has a GREAT idea, and handled it poorly. (probably to save on money.)RATING: 70% Above average, and mostly enjoyable.Semi comparable to Thor3, humor wasnt as spot on as Thor3, but the actual plot was more interesting than Thor3."
    },
    {
      "rating": "3",
      "text": "dont get me wrong i love zachary levi and his lively presence but this is yet another lazy dc entry that looks more tv than film level"
    },
    {
      "rating": "2",
      "text": "Wow, it looks like people downvoted negative reviews completely out of spite alone, smh.I just watched this for the first time on RedBox. It looked like a good movie from the trailers.  I was wrong.  Mainly, this is a movie for teenagers or younger possibly (pg-13 though?).  The plot was very basic, clearly written to a child's level.  The villain was pretty lame and barely dangerous. A lot of downtime where nothing seemed to be going on, it was boring at times.  The dialogue was cringey at times, seemed lazy or just poorly written, however realizing at the end that this was a kids movie, probably just dumbed down.  I seriously considered turning it off around half-way through.  Honestly not sure I'm going to give DC movies another chance.  Very disappointing."
    },
    {
      "rating": "9",
      "text": "Shazam! is one of the funniest DCEU films ever made and perhaps one of the most heartfelt films ever crafted sitting right next to Wonder Woman. If I were you, stick all the way to the end of the movie and a surprise or two will come up thanks to the remarkable coherent direction that DC/David Sandberg has taken in terms of creating a great family superhero movie. And yes, Captain Marvel is better than 'Captain Marvel' alright."
    },
    {
      "rating": "8",
      "text": "Good movie. Entertaining but not the best From DC. Kids will love it, will leave the theater  excited wanting to be a superhero and yelling \"Shazam!\". The villain is really poor, the bad bad guy. The film doesn't have a very complex plot, the guy is thirsty for power and wants the ones that the protagonist has and uses the 7 deadly sins (which are mythological monsters) to try to get them. It touches very important issues about the true meaning of family and heroism. It reminds us of The Goonies, Stand By Me, The Greatest American Hero and Big. Wonder Woman is better but this one is better than Aquaman. Same light and cool tone since Justice League and this is the perfect path that DC found to compete against Marvel. The movie is very long, in the middle it becomes heavy and slow, 1 hour and 45 minutes would have been better."
    },
    {
      "rating": "9",
      "text": "A nice change from the typical Superhero movie!! Had a nice mix of action and comedy, Zachary had a really great performance and made the movie shine."
    },
    {
      "rating": "9",
      "text": "A Wonderful movie, with perfect comic timings with perfect amount of action. A movie with its heart in right place. A perfect homerun from DC."
    },
    {
      "rating": "10",
      "text": "Awesome movie loved Zachary Levi as Captain MarvelI smiled through the entire movie and laughed alot"
    },
    {
      "rating": "9",
      "text": "Best DC movie i have seen , this is real Captain Marvel that we want . They have done their best to make a PG-13 superhero movie . The Queen's song is familiar and fits the movie . Well , i got to say , it's much more worthy to watch DC movie than Marvel movies now ."
    },
    {
      "rating": "8",
      "text": "Pretty fun movie, a bit childish but at least it's way better than Captain Marvel."
    },
    {
      "rating": "10",
      "text": "SHAZAM is one of the best films of the DCEU.It contains everything a fan of comics needs.I love the family atmosphere and the humor.I need a sequel ..."
    },
    {
      "rating": "9",
      "text": "The CGI is terrible in Shazam!, the villian is shallow and standard in Shazam!. There are several plot points that make no sense in Shazam! Should you watch Shazam!??? ABSOLUTELY, 100%!!! Go see it with a date, go see it with the kids (a few scary parts, but definitely do not stay with you because of the comedy of the movie).  This was such a refreshing and fun movie to watch."
    },
    {
      "rating": "10",
      "text": "Went and saw this movie with my family during the fandango early premiere. It was fun for the whole family. We took my grandmother who doesn't particularly enjoy superhero movies (she was there for the popcorn) and she walked away loving it. It is funny, action packed, heart warming, and is visually pleasing. I can't wait to see it again, and own the movie as well. \"Shazam!\" is a home run, and well worth the price of admission."
    },
    {
      "rating": "10",
      "text": "This movie is rad. This is the best DCEU movie yet. This is the direction things need to take. Not every character has the wit and charm that this movie has, and that's ok. Tones like this don't fit every hero. But I'll be damned if this didn't fit like a glove. It was refreshing, it was happy, it was sad, it was smart, it was fun. No line was wasted, no moment was tossed to the side. I love this movie."
    },
    {
      "rating": "8",
      "text": "Shazam! is the rare comic book movie that will appeal to everyone, from families, to neckbeards, to cinephiles. It wildly succeeds in what it sets out to do because it understands that there is nothing childish about childhood or children's entertainment. Irregardless of the invulnerability of its title character or the power fantasy inherent in the superhero genre, the film embraces a disarming vulnerability and emotional intelligence. The movie never forgets that while childhood is full of wonder, humor and escapism, it is also full of fear, loneliness, and struggle. Where other recent comic book movies are built behind a smug aura of \"cool face,\" cheap sentimentality, or winking humor, Shazam! earns its  attitude and big laughs by leaning in to the humanity, complex emotions, and social longing inherent in comic book mythology. The film is decidedly on a smaller scale that what we've come to expect in the genre, both in times of budget, star power, and 'end of the world' dramatics, but rather than diminishing the impact of the film, it heightens the very real and emotionally powerful stakes of family and friendship."
    },
    {
      "rating": "8",
      "text": "The DC Universe movies are generally some of best in the industry, but are usually more serious than funny. Shazam changes it that by being a great superhero film and still have enough humor to make it a comedy. While it has it's flaws, Shazam is a great film to see in theaters while it's still there."
    },
    {
      "rating": "9",
      "text": "Shazam! Is the most amusing DC comic movie so far that brings fun moment to audiences and it's a promising and almost perfect low budget DC movie. The characters are well introduced especially Shazam's and supervillain's origin story. Overall, DC's future plans shouldn't be a problem."
    },
    {
      "rating": "8",
      "text": "Good Superhero movie. Good action as well as good comedy. However, a lot of jokes were revealed in trailers, making them less humorous."
    },
    {
      "rating": "9",
      "text": "This is one of the better DCEU movies I've watched - with Wonderwoman and Aquaman, DCEU is finally on a roll! And with Avengers Endgame likely drawing the curtain on the 10 year reign of MCU, this comes not a moment too soon (note: I'm HUGE MCU fan, but I also want DCEU to do well, because superheroes). The movie is funny and heartwarming though slow in some areas (could have been cut shorter), and I thoroughly enjoyed all of it. I'd have liked more action, so I really can't wait for Black Adam (Dwayne Johnson!!) make his entrance."
    },
    {
      "rating": "8",
      "text": "The Pro: Great cast everyone has a great connection to each other (mostly the foster family)The Con: CGI SuckedOverall CGI did suck but didnt stop me from enjoying a warmhearted family movie"
    },
    {
      "rating": "8",
      "text": "This was such a fun movie! The trailers really didn't give anything important away, thank goodness. But, golly, does it ever warm its PG-13 rating, and not in the usual cheap way, trying to find where to for the F-word in, but rather by it's nightmare fuel Raiders/Last Crusade-esque imagery. Wasn't thrilled with the theme music, but what it lacked in theme it made up for in the overall soundtrack! This needs a sequel, and fast!"
    },
    {
      "rating": "10",
      "text": "an amazing movie funny at every movie and gets everything right all of the jokes are in placed it dose not feel like they attack their  audience"
    },
    {
      "rating": "10",
      "text": "This movie was really fun and mostly loyal to its source material! The coustumes were really accurate comic wise, and the child actors were amazing. People at my local theater were laughting and clapping in some key scenes - they were very excited throughout the movie. Aside from the humor, it has a very profound message of family union."
    },
    {
      "rating": "9",
      "text": "This movie says the magic word and electrifies the audience as our protagonist learns that being a hero is more than just flying high, beating the bad guys, and looking cool. Not only is this movie family-friendly, but it's pro-family and an utter delight."
    },
    {
      "rating": "9",
      "text": "The style of humor in this movie landed with me, but I understand how it might not for others. It is on the childish side, but I do tend to enjoy the \"manchild\" style of humor, EX: Castle, and Psych. The acting by Zach Levi was on point, and the more serious topics addressed were handled in a realistic and thoughtful manner. The characters ultimately change from cynical and selfish to the hero you were hoping for in a way that didn't feel overly optimistic, and how I would expect a 14 year old with a traumatic past to handle a situation like this. I am excited to see this movie again."
    },
    {
      "rating": "10",
      "text": "It was fun loaded and simply amazing. The family, the humour, actors...Everything was on point. It's worth a $100 I tell you. I recommend it for EVERYONE.Shazam!"
    },
    {
      "rating": "8",
      "text": "Big with super powers is almost perfect. I didn't so much care about the actual fight scenes, but instead the comedy and strong chemistry with the family. Overall a low 8 an A-."
    },
    {
      "rating": "8",
      "text": "+Great cast+Good screenplay+Has a lot of fun within the genre+A great win for DC movies!!!-Basic plot with few suprises-It's 2019 so the super hero genre is feeling tiredI saw this with my 14 yr old son today and it delivered exactly what the trailer promised, it has a great feel good factor and the excellent comedic sensibilities of the well chosen cast ensured we laughed numerous times throughout. Really the only problem I have with Shazam! is in its basic run-of-the-mill plot but then it is a well worn genre by now..."
    },
    {
      "rating": "8",
      "text": "'Shazam!' is an easy movie to love, and that's because it is told through the eyes of young teenagers who aspire to be noble and powerful heroes, the spirit of this film is what keeps it alive. The story centers around a young, 14 year old boy named Billy Batson (Asher Angel) who is alone, and is searching for his mother ever since they were separated when he was just a young boy. He is then forced to bond with a new foster family after having a reputation for running away numerous times, but decides to finally settle in. His new family is big, many different siblings of various ages and personalities, the one he gets closest to is Freddy (Jack Dylan Grazer), who is a big fan of superheroes and collects all kinds of special merchandise, even right down to the bullet that Superman himself deflected. Billy struggles at first with his new family and school, but is still motivated to find his mother. We also meet Dr. Thaddeus Sivana (Mark Strong), who, when he was a child, he encountered the wizard Shazam (Djimon Hounsou) and was cast out as he could not resist evil, and was deemed not worthy to possess such great power. He manages to get himself back in and snatch the evil power, and the wizard must find someone truly worthy enough to defeat Sivana. That is where things get interesting for our young Billy, as he also comes across the mysterious temple and is told what he must do, when he says \"Shazam!\", he turns into a fully grown-up superhero (now played by Zachary Levi), but still has the mind of his own, young self. What really surprised me about this movie was how charming, heartwarming and funny it all is. Directed by David F. Sandberg ('Lights Out' and 'Annabelle: Creation'), the movie's tone is surprisingly light and much different than what he maybe used to. Despite maybe one or two moments when we constantly cut back and forth between Billy and Sivana, it can feel like two different movies, making it tonally uneven, but that's just a small percentage. The movie mainly works because of its youthful spirit. Teenagers always wanted to be a hero, and how Levi plays a 14 year old trapped in a 30 year old's body and his reaction to everything from super strength, to flying, really adds to the movie's joyful quality. The third act also, can get a little too cheesy at times, but maybe that's intentional, overall, this is pretty much 'Big' (1988) meets 'Superman' (1978), also, it does remind me of 'Spider-Man: Into the Spiderverse' (2018) and that's a high compliment. It knows the concept is a little silly, it embraces its light spirit, and it has fun with the material, like how most kids have fun when they use some powerful piece of technology. Imagine if you were a kid, and you found out you could fly and have super strength. This movie is a joy to behold."
    },
    {
      "rating": "8",
      "text": "I genuinely liked this movie. A lot. I also laughed. A lot. DC is starting to get these movies right."
    },
    {
      "rating": "9",
      "text": "Honestly cannot remember the last time I smiled so much watching a DC movie. This film combines the fun of \"Aquaman\" with the heart of \"Wonder Woman\". The combination makes for the most enjoyable film in the DCEU(or whatever WB's calling it now) for all ages. Even if the stakes never truly feel high, a lot of the CG effects leave a lot to be desired, and the villain usually approaches Marvel-villain level of quality, there's plenty of humor and heart in the story to keep you entertained throughout."
    },
    {
      "rating": "9",
      "text": "Хороший фильм, с хорошими шутками ваше лучший фильм dc, советую всем сходить рекомендую,"
    },
    {
      "rating": "10",
      "text": "Shazam! is without a doubt one of the closest things you can get to a perfect comic book adaptation. Having read a bunch of Captain Marvel stories, it was exciting seeing how much stuff they managed to seamlessly fit into the film. The mostly lighthearted tone of the film was great, and they managed to land a fair amount of good jokes, so it was very enjoyable to watch. Though it had just over a two hour runtime, the pacing and entertainment I got out of it made it feel like barely an hour and a half had gone by.In my eyes, it was both enjoyable as a faithful adaptation of a DC property as well as a film, which is a welcome change given some of the past entries in Warner Brother's expanded universe attempt. I really feel like Warner Brother's is starting to get it right now."
    },
    {
      "rating": "8",
      "text": "One of the best DC movie I've ever seen, DC is doing his best, I give 8 because this is a very good film but isn't at Batman and Aquaman level"
    },
    {
      "rating": "10",
      "text": "Absolutely stunning :) such a revival for DC I loved the entire film. Stuck true to the source material so well. This is was a truly diverse movie looks like in the Super Hero genre. Nothing seemed forced, and the cast did such an excellent job. CGI was on point and the movie is full of laughs."
    },
    {
      "rating": "8",
      "text": "We finally have a film in the DC comics universe that I can get fully behind. Terrific CGI, a solid cast, and witty comedic writing create a fun ride that is unlike most of the super hero films that have been coming out lately. The standout of this film is easily Mark Strong who once again plays a solid villain character. The younger cast is also quite solid as well which is a bit rare. B+"
    },
    {
      "rating": "8",
      "text": "Overall, it is a good movie. Unlike other movies, here we have a character development that succeeds to overcome his problems, and not just handling his new superpowers but also his family problems as well. The jokes told during the movie were kind dumb but hey, we are watching a 15 year old boy inside a adult body making what any 15 year old would do if he finds up with newly adquired super powers.About the soundtrack. They used the nostalgia formula yet again. The big difference here is that they don't overuse it. Overall, good soundtrack.About the CGI. Generally speaking, CGI effects were good but at some scenes of the movie you can tell that they use CGI.At the end of the movie. Good final battle but I think they overdued to show the full potencial of character. Overall, a good movie."
    },
    {
      "rating": "10",
      "text": "Without spoiling anything I'd just say that the movie is simply amazing. Trailers barely show anything. You're in for many surprises. Action and comedy are well balanced and there are some horror moments too. Lots of heart. I had a big smile throughout the movie. Every character had their moment to shine."
    }
  ],
  "recommendations": [
    "despicable_me_2",
    "goosebumps",
    "hotel_transylvania_2",
    "megamind",
    "incredibles_2",
    "spies_in_disguise",
    "thor_ragnarok",
    "peter_rabbit",
    "jumanji_welcome_to_the_jungle",
    "guardians_of_the_galaxy",
    "deadpool",
    "the_babysitter",
    "free_guy",
    "shazam_fury_of_the_gods",
    "deadpool_2",
    "despicable_me",
    "minions",
    "the_croods",
    "the_lego_movie",
    "love_and_monsters",
    "the_green_hornet",
    "the_princess_bride",
    "turbo",
    "ice_age_the_meltdown",
    "puss_in_boots_the_last_wish"
  ]
}