{
  "id": 3370,
  "title": "Shazam! Fury of the Gods",
  "starring": [
    "Zachary Levi",
    "Asher Angel"
  ],
  "runtime": 130,
  "genre": [
    "Action",
    "Comedy",
    "Fantasy"
  ],
  "description": "Billy Batson and his foster siblings, who transform into superheroes by saying \"Shazam!\", are forced to get back into action and fight the Daughters of Atlas, who they must stop from using a weapon that could destroy the world.",
  "releaseYear": "2023",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3GrRgt6CiLIUXUtoktcv1g2iwT5.jpg",
  "categories": {
    "plot": 4.809523809523809,
    "acting": 5.294117647058823,
    "ending": 6.777777777777778,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.214285714285714,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Fury of the Gods wasn't really that great. The story feels like a series of sketches that miss cohesion. I think the premise was really good, but the execution and writing was poor. The fast dialogues (way too fast at time) and forced jokes broke the rhythm a lot. I didn't feel invested in the characters because I didn't have time to do so. The CGI were a bit better then the first movie. But I couldn't help seeing some Green Lantern effects in there.  The acting was unequal but that was to be expected. But the movie focus too much on Freddy for my taste, and they gave him hyper fast dialogues, that didn't favour his character. The villains were' I don't know...just there. The music and sounds were ok. I give it 53%. All the personal stuff is briefly skimmed and never truly explored. It's an action movie with barely any intelligible humour and any convincing drama."
    },
    {
      "rating": "4",
      "text": "Typical film for children, at all times they want to put a joke and a humor that is embarrassing, it makes sense why the film is for children, since the heroes are children.  Of course not forgetting the love of a young man of 15 years with a goddess of 6000... would it be pedophilia?"
    },
    {
      "rating": "4",
      "text": "Good popcorn film, nothing more... But there are no surprises: generic monsters, generic villains, generic action in generic super-hero film... I'm little disappointed with this sequel... Lot of bad jokes. Long product placement for Skittles. Cheap cameos. Still quite fun and watchable, I like this family dynamic... Anyway, the big reboot is coming so why we should care? And no: it's not \"Superhero Film Fatigue\" - it's \"Bad CGI and Mediocre Story Fatigue\"!"
    },
    {
      "rating": "4",
      "text": "Não dá pra exigir muito de um filme cuja proposta claramente é fazer rir, tratando seus personagens de forma idiotizadas, típico filme feito para não se levar muito a sério. Nesse sentido, ao menos podemos dizer que ele é eficiente.Não me canso de dizer que filmes infantis não precisam ser necessariamente idiotices puras. Temos aí filmes da Pixar/Disney para comprovar. Mas também não quer dizer que necessariamente precisam ser profundos. Está tudo bem criar roteiros pífios como aqui e se entregar a diversão.Há, no entanto, muitos e muitos furos, além de incontáveis momentos em que, por exemplo, a vilã poderia acabar com tudo e fica conversando por vários minutos até vir alguém e desarmar. O roteiro beira o amadorismo, e o maniqueísmo de quem é bom ou mau beira o ridículo, sem contar que uma das personagens muda instantaneamente, sem pudor algum.A DC aqui pega o que há de pior nos filmes da Marvel e insere em duas horas de projeção. Se você for com o mínimo desejo de ver uma boa história, melhor não ir, e se você não curte piadas bobinhas, aí mesmo que deve passar longe.Ainda bem que eu fui assistir de coração leve e muito bem tranquilo com o material, por isso não me arrependi tanto assim, consegui até mesmo dar boas risadas, ainda que entrasse fácil como um dos piores do ano."
    },
    {
      "rating": "1",
      "text": "a total mess ! should've cancelled this and then we can start over with new dcu."
    },
    {
      "rating": "4",
      "text": "nooo good movie better than the first one but still not god i dont like shazam"
    },
    {
      "rating": "2",
      "text": "It kind of knows it’s fighting a losing battle, and still puts an effort in regardless, it just feels pointless, empty and hallow though.."
    },
    {
      "rating": "4",
      "text": "\"Shazam! Fury of the Gods\" was...  Kind of a letdown.  As a huge Shazam fan, I went into this movie with the utmost positivity, but my upbeat optimism was dashed by this films lack of focus.  None of the events in this movie seemed to flow naturally and everything was just happening off of a conveyor belt.  This, coupled with some VERY unthreatening, non-canon, movie exclusive antagonist's, made for an experience that seemed more like filler than anything else.  Speaking of the antagonists of this film, Helen Mirren and Lucy Liu did an excellent job in their roles as Hespera and Kalypso and were definitely the stand outs, but even their combine powers of brilliant thespianism were no match for the evil that is DCEU's knack for fumbling their films.There was at least one scene at the end of the movie that was kinda cool, but it really doesn't make up for the rest of the movies inability to \"wow\" me.  This was not what I would call a \"worthy sequel\" to the first Shazam movie.  Not only does it pale in comparison to the original, but it will more than likely dissipate from most peoples memories shortly after they’ve watched it."
    },
    {
      "rating": "4",
      "text": "It’s just so ugly and mostly unfunny. I think Levi is solid in the role, but the writing is lazy, creating easy ways to get out of situations within a scene. DCEU reboot can’t come soon enough."
    },
    {
      "rating": "2",
      "text": "It felt stupid and it is stupid, the plot is completely incoherent at best. RIP to the Shazamverse and I greatly await you (not) returning to the new DC era."
    },
    {
      "rating": "5",
      "text": "It advances in matters of scale, but regresses enormously in matters of plot and there wasn't much there in the first place, but I must say that Shazam! Fury of the Gods borders at many points on a line that almost makes it a children's film.The constant need for humor clouds any attempt at seriousness and only manages to get a touch of drama in its climax that frankly doesn't add up to anything.The show entertains for the most part, but considering the reboot that's coming, Shazam gives no reason to stick around in the DCEU. A shame.* Though the first post-credits scene gives a minuscule hint that maybe James Gunn does have him considered for what's to come. But like I said it's minuscule.** And only for a small mention. Grace Caroline Currey as Mary Marvel is"
    },
    {
      "rating": "4",
      "text": "Not as bad as Quantumania, but still very generic and boring. Terrible acting and corny as hell story. It's good to know that the DCEU is dead. Hope James Gunn can bring this corpse to life."
    },
    {
      "rating": "1",
      "text": "A generic and cliche story, I felt like I could predict the whole movie. No substance to characters and jokes that didn't land. Sequels don't always live up to expectations but here it feels like they made it to capitalise on the first movie and make it a cash grab."
    },
    {
      "rating": "0",
      "text": "Sadly if you’re not reinventing the wheel or taking big risk. An enjoyable innocent sequel that plays things safe is going to look tiresome & bland in a world where we get 10 superhero films a year."
    },
    {
      "rating": "3",
      "text": "Some incredibly lazy writing, and editing that chops out too much context, resulting in a movie that requires a total lack of attention to enjoy."
    },
    {
      "rating": "3",
      "text": "They tried but this movie was bad and lazy, acting (and especially the extras) were BAD and there's no character development and the romance between the godess and the disabled kid looks forced and the whole story is cliche and predictable.And the ending was almost good but the bad acting ruined and that Wonder Woman cameo is dumb and uneccesary and ruined the seriousness of the scene and felt like a lazy way to give the movie a chiche and dumb ''happy ending''. This is why the movie is flopping at theaters, nobody is interested and James Gunn is gonna reboot the DC Universe anyways"
    },
    {
      "rating": "6",
      "text": "La pelicula me gusta, buena comedia y acción entretenida, la pelicula no se me hizo larga, al contrario, me divertí tanto viéndola que se me fue el tiempo volando y me gusta el desarrollo de la relación de Freedy y AntheaLo que no me gustó es que Pedro y Eugene se sienten un poco desaprovechados, pudieron darles un poco mas de protagonismo, y ahora lo que si odié fue ese final, la muerte de Billy estuvo Genial, me gusto que hicieran madurar al personaje haciendo que se sacrificara para salvar a la tierra y la escena del entierro de Billy es emotiva... hubiera sido perfecto que lo dejaran así PERO esa parte de la mujer maravilla reviviendo a Billy se siente tan \"Forzado y fuera de lugar\" es innecesario.en resumen, el inicio estuvo bien, la parte del medio fue genial, ese climax espectacular pero esa escena de la mujer maravilla y lo que pasa después es tan Forzado y molesto"
    },
    {
      "rating": "1",
      "text": "Zachary Levi can't act, and the movie is so boring and generic even Helen Mirren can´t save it. Better than Black Adam, but not by much."
    },
    {
      "rating": "2",
      "text": "I gave this franchise as much of the proverbial \"benefit of the doubt\" as I could muster and it still wasnt enough to win me over. Both movies were inept, lazy and creatively bland. These super hero directors clearly don't understand comics, they violate orginal content and value nothing but their own ego's. The movie has the audacity to have the original Billy Batson in the movie regulated to some basic extra. Its insulting and careless. Have lost just about all faith in DC and Marvel is not far behind. Is it even possible to make a super hero movie about the character and not someones convoluted vision."
    },
    {
      "rating": "1",
      "text": "Not sure what’s worse this or MorbiusIn the battle of comic book mediocrity, DC still is king"
    },
    {
      "rating": "3",
      "text": "this movie was terrible ; badly written scenes ; they made fred as creepy and dorky as possible when it came to lines with Rachel Zeglers character; badly written scene the kid throws skittles and stops the unicorn in its tracks and suddenly they ally with the kids who are depowered at this time then the next scene was stupid af with them riding on them with full trust  so unbelieveable ; the whole lets give up our powers to get fred back angle was really stupid as well ; wonder woman is in the city but doesnt help/ aid the shazam siblings because why??; the 3 gods were all working together when suddenly they betray one another was another plot induced stupid moment to give the heroes a chance; the shazam siblings have the strongest amount of Plot Armor ever seen in a super hero movie ; Billy should have been killed literally so many times over but was spared because the plot demanded it ; Fred should have been killed many times over but the plot demanded it ; the whole fred inlove with a goddess was stupid af ; they never give a reason why she wanted to help them and betray her sisters"
    },
    {
      "rating": "0",
      "text": "Dreadful, DC is a mess......................................................"
    },
    {
      "rating": "7",
      "text": "I think it's OK, it has a generic story. It seems that the movie it's for kids, not the best super heroes movie but it's entertaining. If you're looking for a deep story, this movie is not for you. The weak thing of the movie it's the story, it's predictable but despite of that soundtrack and CGI are good."
    },
    {
      "rating": "8",
      "text": "This is a better movie than all the recent MCU movies. Period. Better than Black Adam and first Shazam! I had so much fun and I freaking LOVE this movie!"
    },
    {
      "rating": "1",
      "text": "I already had my suspicions, and the movie just confirmed them. BB being a teenager is ok, now being a complete idiot doesn't make sense, it doesn't work and it's neither funny nor fun. The humor doesn't work, the movies have holes, they don't have a climax... anyway, I'm glad they paid for my ticket for me."
    },
    {
      "rating": "0",
      "text": "Generic, cliche, predictable, childish in a bad way, parody, no real investment, no character arc, cheap cameos that are only there so people can say “she is from the other movie!” and nothing else"
    },
    {
      "rating": "9",
      "text": "Better than the first, sucks we won’t get more from these characters since these new guys want to change it up and not bring back some of the good actors"
    },
    {
      "rating": "0",
      "text": "Horrible movie, nice super hero in the comics but the movie is a trash super hero."
    },
    {
      "rating": "10",
      "text": "Really funny and entertaining. Jokes know how and where to land. Overall good movie"
    },
    {
      "rating": "10",
      "text": "Entertaining and funny sometimes. Mister Mind at the end really the funniest. Hey I'm a worm, vengeance needs to wait because I move so damn slow."
    },
    {
      "rating": "8",
      "text": "This movie was a fun time. A bit generic super hero film but it gets the job done. It still captures the same heart that the first one had and even had some dark moments as well. If your looking for a fun watch fury of the gods is for you."
    },
    {
      "rating": "10",
      "text": "Really Entertainment movie... Better than recent MCU Movies....Wonder woman cameo"
    },
    {
      "rating": "10",
      "text": "Great, with good action sequences and a surprising cast! The vfx are stunning for a budget that it’s only 100M"
    },
    {
      "rating": "8",
      "text": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good."
    },
    {
      "rating": "10",
      "text": "Great I wouldn't miss it for the world , forgot these critics and go see it for yourself....Cheers"
    },
    {
      "rating": "7",
      "text": "It's difficult to give a fair score. I liked it, a decent story, and the characters are still fun. I can still appreciate that these characters are rooted in magic. It felt like we were learning more about the inner lore of the Shazam magic, but in the end we didn't learn that much. It'a decent sequel to Shazam 1."
    },
    {
      "rating": "8",
      "text": "\"My problem is pretty much the same with the first Shazam!, there is a scene that goes too long or in this one is more of like unnecessary cut to another build up, one or two not funny jokes, one personality switch problem, Freddy was a bit too much in this one and sometimes became annoying, her relationship with Rachel Zegler wasn't really connect to me and it's pretty much a whatever, but the good rest of Shazam! Fury Of The Gods was also pretty much the same like the first Shazam! with according to me an obvious better villain, it's still an entertaining fun soft movie overall, no big improvement from the first one but i do kinda like this one a bit more, from now the whole family involved and again better villain, with good performance by all the cast, i like the look of the monster creatures that they create, a very entertaining battle sequence, and nice little and powerful surprises at the end, Shazam! Fury Of The Gods is a good fun sequel overall."
    },
    {
      "rating": "0",
      "text": "Una pelicula no sólo innecesaria sino aburrida e ilógica en el guión y ni mencionar las escenas post créditos que contradicen el nuevo universo de DC que ya en producción."
    },
    {
      "rating": "10",
      "text": "Better than the first.Loved everything Fun time for children.VFX top notch for a 100 million dollar film"
    },
    {
      "rating": "9",
      "text": "9/10The characters are funny and expressive, The villains are well written and actually interesting and the music is amazing and fits the scenes. The pacing is also really good and it never gets slow. The movie has actual funny jokes that hit well and aren’t over done.One of my complaints is that the ending is a bit of a cop out and it could have been done a bit better. Also some scenes go on for slightly too long although not TOO long imoAlso the CGI is amazing.Could be a 9.5 if the certain scenes were shorter and the ending was slightly altered."
    },
    {
      "rating": "10",
      "text": "Just an overall good time, nothing really to get upset about. Likable characters and fun action make up the bulk of the movie. It's a definite would recommend from me."
    },
    {
      "rating": "8",
      "text": "More enjoyable for me than the reviews led me to believe.  Another movie with at least eight director-level collaborators:  a 2nd unit director plus seven VFX directors one for each house working pre, post and during production.  When so many people who love telling stories well collaborate, the result is almost always impressive on multiple levels.  As regularly happens in pro reviews of most super hero movies, the Great Expectations pattern takes over.  The final movie is criticized for what it is not; and, for what it could have been.  This is the fast way to become a jaded and cynical movie reviewer.  I recommend finding the moments which do work for you, try to ignore the rest on first viewing.  As the negative pro reviews observe, Shazam 2 is very much a movie with a 2010 mindset, perseverating on familiar tropes which ran out of oomph a decade or more ago.  I did not find Helen Mirren and Lucy Liu \"bland.\" I did find the stereotyped limitations of their roles and dialog very 1990s. The most literate, considered pro reviews on S2 Ive seems so far are from Owen Gleiberman in Variety and Jacob Oller at Paste."
    },
    {
      "rating": "7",
      "text": "Em maior escala que o primeiro, mas ainda bem formulaico. Achei esse mais engraçado e os novos trajes são beeem mais bonitos. Ver o Billy como uma figura superprotetora condiz com o desenvolvimento do personagem. As vilãs são padrãozona mas fazem oq tem que fazer. Pena que não veremos Shazam! na Liga da Justiça."
    },
    {
      "rating": "7",
      "text": "It starts kinda cringe, but once we find out the motivations behind the daughters of Atlas and the action starts, it gets better."
    },
    {
      "rating": "9",
      "text": "A very surprisingly entertaining sequel, not sure what people where expecting from shazam but this was exactly what I was hoping for, something a bit lighter after the flop of black adam"
    },
    {
      "rating": "10",
      "text": "LOL, so funny!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "8",
      "text": "Shazam Fury has an Incredible cast including Zachary Levi and Lucy Liu. I enjoy the action in this movie."
    },
    {
      "rating": "10",
      "text": "This movie delivers splendid flares of action plus comedy and direction...the villains are new. The locations are new everything is downright amazing. And aside from that, we have a great cameo from Michael Gray aka the OG Billy Batson from the 1970s TV show that ran along side with Iris \"Shazam!\""
    },
    {
      "rating": "10",
      "text": "Very fun loving and very entertaining movie, this is just awesome.Billy Batsons wrote the magical letter is very humoures and so comedic,Dragon and other creatures are so real.vfx are so so good. wonder woman entry and Shazam talk to wonder woman are so comedic.This is perfect sequel."
    },
    {
      "rating": "10",
      "text": "This movie was delightful, epic and humorous. Zachary Levi did a tremendous job bring the Shazam we all know and love to life in such a fun and authentic way.It has everything- action, adventure, mythical creatures and lightly forbidden love. What more could you ask for?!"
    }
  ],
  "recommendations": [
    "hercules",
    "thor_love_and_thunder",
    "hancock",
    "guardians_of_the_galaxy",
    "the_green_hornet",
    "jumper",
    "now_you_see_me_2",
    "kingsman_the_golden_circle",
    "incredibles_2",
    "night_at_the_museum_battle_of_the_smithsonian",
    "megamind",
    "poseidon",
    "teenage_mutant_ninja_turtles",
    "deadpool_2",
    "terminator_genisys",
    "bloodshot",
    "minions",
    "pirates_of_the_caribbean_on_stranger_tides",
    "zombieland_double_tap",
    "the_a_team",
    "jack_the_giant_slayer",
    "the_losers",
    "suicide_squad",
    "jumanji_the_next_level",
    "justice_league"
  ]
}