{"id": 3344, "title": "Sherlock Gnomes", "starring": ["Johnny Depp", "Emily Blunt"], "runtime": 86, "genre": ["Animation", "Family", "Fantasy", "Comedy", "Adventure", "Mystery"], "description": "Garden gnomes, Gnomeo & Juliet, recruit renown detective, Sherlock Gnomes, to investigate the mysterious disappearance of other garden ornaments.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/wqnzpJR3PwS4doVkAkt9seSEpoX.jpg", "categories": {"plot": 4.4, "acting": 3.75, "ending": 3.6666666666666665, "soundtrack": 3.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.2857142857142856, "action": 3.0}, "reviews": [{"rating": "2", "text": "This movie is just a dumb cartoon there is nothing good about thus sequel other than the animation"}, {"rating": "5", "text": "Very predictable and standard as far as kids movies go, but still completely harmless and watchable. Nothing worth trashing here except for a few cringy pop culture jokes."}, {"rating": "4", "text": "Should I start mentioning its empty plot, scattered chasing sequences that are put one after another with no reason, its absurd and silly jokes that just are not funny? I can't even remember if I smiled once while watching this stupid movie ..... no no hold a second, I think I smiled once because they used the wilhelm scream and I believe that at this time I was supposed to cry or something.Of course the villain is so weak and his backstory and motives don't make any sense. By the way, the villain is just a miserable try to make a version of the joker in The Lego Batman Movie.The most infuriating thing is that the movie tries to make you feel it's smart; showing 2D animated scenes to display the way Sherlock Gnomes thinks or how he tries to solve the mystery and all that absolutely nonsensical. Also, there is a plot twist that is presumed to be surprising.there are man many other problem but let's get over them and mention the very few things that I liked in this movie:- The animation quality is surprisingly quite good.- James McAvoy's and Johnny Depp's voice acting are the only two that are kinda good but the other actors aren't good (Emily Blunt's voice acting is very idle)- The first 20 minutes are fast paced so I think this is a bonus! (The pace dragged every once in awhile due to \"dramatic\" moments or just to play some songs)I'm so disappointed that this movie came from John Stevenson, the same director who brought us Kung Fu Panda. (4.5/10)"}, {"rating": "10", "text": "My wife and I loved it! Way better than we anticipated. We're both 70, and neither one of us had seen the first Gnomes movie. I don't know what those professional critics are grumbling about, because \"Sherlock\" impressed us as being a fast, funny, and visually imaginative entertainment. The thematic elements were good points to make and were well-expressed. Would we have seen it without our Movie Pass cards? Probably not, but thanks to our wonderful MP membership, we took a chance on this one. So glad we did... and by the way: The movie theater was empty when we saw it. We were the only two customers."}, {"rating": "4", "text": "Should I start mentioning its empty plot, scattered chasing sequences that are put one after another with no reason, its absurd and silly jokes that just are not funny? I can't even remember if I smiled once while watching this stupid movie ..... no no hold a second, I think I smiled once because they used the wilhelm scream and I believe that at this time I was supposed to cry or something.Of course the villain is so weak and his backstory and motives don't make any sense. By the way, the villain is just a miserable try to make a version of the joker in The Lego Batman Movie.The most infuriating thing is that the movie tries to make you feel it's smart; showing 2D animated scenes to display the way Sherlock Gnomes thinks or how he tries to solve the mystery and all that absolutely nonsensical. Also, there is a plot twist that is presumed to be surprising.there are man many other problem but let's get over them and mention the very few things that I liked in this movie:- The animation quality is surprisingly quite good.- James McAvoy's and Johnny Depp's voice acting are the only two that are kinda good but the other actors aren't good (Emily Blunt's voice acting is very idle)- The first 20 minutes are fast paced so I think this is a bonus! (The pace dragged every once in awhile due to \"dramatic\" moments or just to play some songs)I'm so disappointed that this movie came from John Stevenson, the same director who brought us Kung Fu Panda.(4.5/10)"}, {"rating": "10", "text": "Martin Scorsese's newest movie titled \"Sherlock Gnomes\" is possibly his greatest feature yet. The Oscars better make this win best picture next year after the brilliant \"The Boss Baby\" got robbed."}, {"rating": "10", "text": "Movie of the year! An absolute masterpiece of animation with a compelling storyline, hilarious characters, and strong character development, making for the best movie based of an anime so far in 2018."}, {"rating": "3", "text": "I literally wished that Gnomeo and Juliet to be at least original with its slapstick plot and thought that was bad enough compared to the source material it's based on. On its own, it was mediocre. Then I saw Sherlock Gnomes and wondered what was Johnny Depp doing there. He literally killed the show more than enough times that Johnny Depp is literally the only good thing about this slap-in-the-face poor-man's slapstick attempt to parody Sherlock Holmes. The other actors and actresses have no chance of outshining him in their own game that they dominated in its predecessor. Sadly, like the other actors and actresses, Johnny Depp suffocated his acting career just for an absurdly stupid film that just gets stupider every minute."}, {"rating": "0", "text": "This doesn't deserve a review. I watched the first film and it sucked. I watched the first 30 minutes of this one and left the theater immediately. This film shouldn't exist."}, {"rating": "3", "text": "This movie is just pointless. Like if they want to tell a silly kids story about Sherlock Holmes, why have it be a sequel to a bad 2011 film no one remembers? And considering the box office performance of this film, it's a real bonehead decision!There are some positives...I guess. The animation has improved a lot after the first film. The textures are nice, the set pieces look big, and the action scenes are pretty fun that will surely entertain the kids. It does feel like an expansion to the first film, even if it is filmsy. The voice cast isn't terrible, not remarkable either, but they do a decent enough job. Emily Blunt, James McAvory, Chitwetel Ejiofor, and Mary J. Blige did a solid job, as does Johnny Depp despite some bad reads every now and then, and Jamie Demetriou does stand out as Moriarty. Also the gargoyles look pretty cute despite them being menacing killers.Okay so the negatives. The whole premise of this film feels like a very flimsy attempt at making a sequel when it really should not have been. There is no real reason why this is a sequel to Gnomeo and Juliet, no true benefits other than it being a safe attempt at making money (it made less than the first film). The conflict is forced, as Gnomeo acts like a whiny ass to Juliet and is totally unlikable, as is the titular Sherlock Gnomes. The film never offers any true laughs, unless you are under the age of 10 or are a parent that's been numbed by life to find lame jokes funny. There is a twist that is painfully obvious. And there is no real reason why Elton John songs are used in the film since they barely play any of his music besides an awful remix of Don't Go Breakin' My Heart at the opening credits. Also them removing Jim Cumming's character from the first film is a travesty, since the flamingo is the best part of the first film and damnit Jim Cummings is one of the best voice actors alive how dare they!Honestly I don't have much to say since this is just a bargain barrel kids film. It's not the worst thing ever, but hardly redemptive nor worth more than the rating I am giving it. It's passable, but kids deserve a lot better!Also how come everyone was so up and arms that Johnny Depp is going to be in the next Fantastic Beasts film in spite of his domestic abuse allegations, yet NO ONE said anything about him being the voice of the titular character in a children's film? Be consistent!!!"}, {"rating": "10", "text": "I find it to be okay. I liked Johnny Depp as Sherlock and it dosen't include fart and pee jokes. So, yeah, I recommend it."}, {"rating": "0", "text": "The movie is not funny nor entertaining. It had bad animation and stupid jokes to go along"}, {"rating": "4", "text": "To be honest, Sherlock Gnomes was decent. Which I don't mean good. Below average but sorta good, yeah. Sherlock Gnomes has Gnomeo and Juliet in it... Based on Sherlock Holmes, it's not that successful like Ready Player One."}, {"rating": "0", "text": "Several kids in Russia were burned while they were watching that **** movie."}, {"rating": "6", "text": "A typical children’s films - the good guy always wins, and the bad guy always loses. The film was nothing more than that for me, and I could’ve gladly gone without watching that. 6/10."}, {"rating": "0", "text": "Noooooooooooooooooooooooooooooooooooooooooooooooooo ooooooooooooooooooooooooooooooooooooooooooooooooooooo"}, {"rating": "2", "text": "+Animation is impressive+Casting is great+Score is quite good-Plot makes no sense-Several characters from Gnomeo and Juilet missing-Jokes aren't funny and are dumb-The plot twist(not saying what it is) is poorly written-The original song is bland-The Elton John songs are mostly edm remixes-Terrible script"}], "recommendations": ["dolittle", "shazam_fury_of_the_gods", "pitch_perfect_2", "suicide_squad", "the_green_hornet", "deadpool_2", "megamind", "thor_love_and_thunder", "zombieland_double_tap", "pitch_perfect_3", "zoolander_2", "horrible_bosses_2", "minions", "jumanji_the_next_level", "catwoman", "monsters_vs_aliens", "peter_rabbit", "venom_let_there_be_carnage", "teenage_mutant_ninja_turtles", "son_of_the_mask", "the_karate_kid_part_iii", "killers", "little_fockers", "baywatch", "spies_in_disguise"]}