{
  "id": 861,
  "title": "Sherlock Holmes: A Game of Shadows",
  "starring": [
    "Robert Downey Jr.",
    "Jude Law"
  ],
  "runtime": 129,
  "genre": [
    "Adventure",
    "Action",
    "Crime",
    "Mystery"
  ],
  "description": "There is a new criminal mastermind at large (Professor Moriarty) and not only is he Holmes’ intellectual equal, but his capacity for evil and lack of conscience may give him an advantage over the  detective.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/y1MYZkwhZK6L0Jy4YMuPktzDOfn.jpg",
  "categories": {
    "plot": 6.35,
    "acting": 6.7727272727272725,
    "ending": 7.4,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.3,
    "action": 6.882352941176471
  },
  "reviews": [
    {
      "rating": "9",
      "text": "My expectations werent necessarily low, but I was very pleasantly surprised by how brilliantly written, meticulously directed and fantastically edited this better-than-the-original sequel was.  Critic response hasnt been very positive, so I expected some level of disappointment, but I left disappointed in the lack of praise this movie has received.  The cast is downright perfect, as it was the last time, but what improved this version over the extremely wonderful predecessor was the extensive insight into Sherlock's detective mind, something I considered lacking in the original.  The relationship between Holmes and Watson was more deeply built, as was Holmes' relationship with his adversary.  Moriarty was a perfect counterpart and a joy to finally see on screen.  Other than the length, I have very, very little criticism of this intellectually stimulating, action-packed feast for the senses.  The getaway scene from the armory was enough to praise Ritchie, and this is coming from a not-so-interested-in-action-movies kind of guy.  Sherlock Holmes: A Game of Shadows is a masterpiece in a genere not often represented or respected."
    },
    {
      "rating": "6",
      "text": "Like the first Sherlock movie, Sherlock 2 looks great with good editing and a visual style but does not have a compelling plot or characters you care that much for. There are some charming moments but for the most part Sherlock 2 was underwhelming. I recommend Sherlock 2 if you liked the first movie but don't expect too much as its only ok and is not too memorable."
    },
    {
      "rating": "8",
      "text": "I enjoyed this movie, it was thrilling and comical, moved along at a fair pace and had enough of a plot to maintain interest. the effects were well done, but the sound was a bit loud, at some times it was scary, i would have rated it M15+"
    },
    {
      "rating": "8",
      "text": "SHERLOCK HOLMES: A GAME OF SHADOWS continues the tradition of the first film superbly, with the same brilliant chemistry between Watson and Holmes that made the original so enjoyable."
    },
    {
      "rating": "7",
      "text": "Somewhat better than the first one. The story introduces Professor Moriarty with which Holmes and Watson play a game of wits. There are plenty of action scenes with the trademark super-slomo explosions and fistfights Guy Ritchie likes so much. It all looks great and the VFX are pretty good too. At 130 mins it's maybe a bit longer than it should have been but otherwise nice popcorn entertainment."
    },
    {
      "rating": "10",
      "text": "The movie was brilliant and the actors were even more brilliant! I really enjoyed this movie: in my opinion the people who don't like it actually don't understand it."
    },
    {
      "rating": "5",
      "text": "It's witty and clever, but far from cohesive. Apparently Sherlock is not only a great detective, but he can see the future as well? The scenes where he knows what is going to take place are absurd. The ending is also beyond ridiculous. I hate it when directors act as though we, as the audience, are morons. It was fun to watch, but silly. Downey Jr. is a genius of an actor, and the saving grace of this movie. He manages to salvage something positive from this messy film."
    },
    {
      "rating": "10",
      "text": "really good! i really like that you have to think harder with this part. part 1 told you everything, and was simple, this one makes you think harder, and it was really epic! slow-motion scene in the forest was awesome, fantastic humour to x)"
    },
    {
      "rating": "10",
      "text": "This film was amazing.I enjoyed every part of it.It was very humorous at times and sometimes shocking. I would strongly recommend this film.I actually prefer this film rather than the first one!"
    },
    {
      "rating": "10",
      "text": "I liked this as much as the first one. That's saying a lot, it was one of my all time favorites. Great fun . The action flows very well and a cool surprise ending.   Awesome movie."
    },
    {
      "rating": "10",
      "text": "This movie was very thought provoking. I loved it, but I can see how other people would classify this as boring. It was a long movie. Don't go in expecting it to be like the first one, it's not in more ways than a few. Most of the battles in this are mental. Didn't really care for the fire fights, but even with the gun battles, there was always an underlined theme."
    },
    {
      "rating": "8",
      "text": "Some movies you watch in order to see beauty; some movies you watch in order to think and contemplate; some movies you watch so that you can be entertained. \"Sherlock Holmes: A Game of Shadows\" is certainly in the third category, and it knows it. This movie is about entertainment and not much more. Robert Downey, Jr. and Jude Law perform their parts very well as Sherlock and Watson. I would rate the movie more highly but I think that it could use some tightening in its plot. Nonetheless, the bedlam of the action sequences married to the erudition of the movie's wit make for good cinema."
    },
    {
      "rating": "9",
      "text": "Shut up critics. You don't understand good film. Sherlock Holmes: A Game of Shadows has a complex storyline, and it's great acting and gentle humor makes it a hit. Plus, I loved the end.THE END ?"
    },
    {
      "rating": "10",
      "text": "I like reading the critics reviews because they further help me understand that movies are primarily about entertainment and that the majority of America cares about just that fact. Sherlock Holmes: Game of Shadows was simply very entertaining. Kudos to Guy Ritchie and the cast taking it up a few notches. From start to finish the intrigue of how this one will end never disappoints, the action is first rate and Robert continues to embody the Sherlock Holmes character. See the movie, its entertaining!"
    },
    {
      "rating": "10",
      "text": "these critics know nothing about good movies, this film better get a higher score or there will be mess, anyway a range of action, mystery and suspense make sherlock holmes a great night out"
    },
    {
      "rating": "9",
      "text": "First off, i do not agree with the critics whatsoever. This movie was veryy good. Robert Downey Jr. is back and better than ever as the always funny and incredbily intelligent Sherlock Holmes and a very well made sequel to the first sherlock holmes. The story kept me entertained from start to finish, the action was mindblowing, and the acting by the 2 lead stars Downey Jr. and Mr. Law was on par, same with the supporting cast. Loved this film from the very start to the very end. Must see film, 9/10"
    },
    {
      "rating": "10",
      "text": "An awesome movie - Sherlock Holmes has the ability to keep you at the edge of its seat with its extreme unpredictability. Not so much that you lose control of the plot and you just sit there looking puzzled and confused, but to keep you intrigued of what might happen next. It's one of those movies that actually makes you think - you yourself may have turned into a Sherlock Holmes unravelling the mystery of what both Sherlock and Dr. Watson are solving. So much darker and creepier tale - but is still enjoyable for the imminent teens because it does not make them feel stupid, but neither is it too much for them. This movie also goes deeper into Sherlock's and Watson's relationship, I think they make such a good team, so funny, so brilliant, like there's an unbreakable bond between them. It still manages to pull off an excellent line of gags - I laughed and laughed so much I wished I could laugh at it all over again when it finished because it was so hilarious. One unmissable moment involves a man and some drag, and don't forget to look out for the surprise ending, which fascinated and entertained for what might come next. It achieves both sides - its technical side is perfection, and the literary and artistic skills don't come amiss, unlike some movies nowadays. And this is what I call a real movie, and a really good sequel to what came before.  A thrill ride of a movie taking you from one place to another - miss this and you miss the biggest and best rollercoaster of your life. The critics certainly don't know what they're missing - don't even believe one word of what they're saying - see this and be overjoyed that you did listen to common sense."
    },
    {
      "rating": "8",
      "text": "The beginning of the movie is kind of boring and just plain action with less content but the 2nd half pays up for it with more chess moving.. the climax scene with Sherlock and Moriarty is just pure awesome."
    },
    {
      "rating": "9",
      "text": "I just saw this movie last night and was blown away. It was way better than the first one. The storyline was incredible, and the actors were amazing, not to mention the amazing action sequences. Guy Ritchie has made yet another amazing movie. Alot of people don't like the Sherlock homes movies because they are not true to the book. I think that it is a great adaptation, and it was very well done. The only problem I had was that Sherlock Holmes' characterization was not the same as it was in the first film, and I thought they could have found a better actor to play Moriarity. Other than those things the movie was amazing."
    },
    {
      "rating": "10",
      "text": "The second chapter is better than the first for quality fiction and for entertainment. The actors are really good, and Moriarty is a real villain. Excellent slow-motion effects, set design, costumes ... amazing film! Recommended."
    },
    {
      "rating": "8",
      "text": "While I think they could have toned down the action bit a little bit, I thought the movie flowed really well. Jude Law and Robert Downey Jr both had excellent performances, as usual. The end had the whole theater laughing, myself included."
    },
    {
      "rating": "8",
      "text": "Complex story line. Decent acting. An amazing adventure, full of thrills at every corner. What more could you want?"
    },
    {
      "rating": "6",
      "text": "I probably laughed out loud a good 30  times during the film, which is many more times than I expected to, but it just felt bloated around the middle.  I still love the action sequences, and Downey Jr. is made for this role, but it could be tightened up in the 3rd iteration."
    },
    {
      "rating": "6",
      "text": "An improvement over the original.  My audience actually clapped, I think because the ending was clever, more so than the rest of the film.  It's good they killed off Holmes' love interest early so they could concentrate on the real romantic relationship between Watson and Holmes.  Not sure why they tried to make Downey look like the Joker in Batman in one scene."
    },
    {
      "rating": "6",
      "text": "Even though there are now two films in Guy Ritchieâ"
    },
    {
      "rating": "7",
      "text": "Much better than the previous film: I could understand everything RDJr said this time, and the action sequences were more easy to follow (just!). The central relationship between Holmes and Watson was beautifully done and it looked great. In all, a perfectly entertaining night out."
    },
    {
      "rating": "8",
      "text": "A game of shadows starts fairly slowly and is slightly confusing at first as it doesn't continue the cliffhanger from the first one- which seems strange. Its slow start is however made up by what follows- the antagonist in the form of professor James Moriarty is a brilliant match against Sherlock and the banter and a clever game of cat and mouse is outstanding between them. The action set pieces are amazing including a train and a breathtaking slow motion escape through a forest  that is that good you can hardly breathe. The films ending however is clearly the best aspect of the film in which an outstanding showdown between the professor and Sherlock takes place over a physical and somewhat metaphorical game of chess. While the film starts not its does find its steam and from then on never fails impress and amaze."
    },
    {
      "rating": "6",
      "text": "Like the previous Sherlock Holmes movie I had no idea what was going on until the ending when everything came together, however overall this movie has good action scenes and is entertaining."
    },
    {
      "rating": "7",
      "text": "A Game of Shadows didn't have quite the same appeal as the first as there's a bit too much unnecessary talking, and started to drag a little towards the end (numb ass and a bit of shuffling in my seat...), but was still enjoyable to watch. The fight scene breakdowns are back and are really good, especially the last! Best section by far though is the forest run (seen in the trailer), the slow motion, fast spins and explosions were great!If you liked the first, you'll probably like this too, but prepare to be a little let down I think."
    },
    {
      "rating": "8",
      "text": "I enjoyed this movie much better than the first. I do think Game of Shadows is an appropriate title, however, I felt there should have been more of that going on in the film. The plot was transparent at each step. Downey and Law's acting compliment each other so well you'd think this is who they are in real life. Very well paced movie."
    },
    {
      "rating": "10",
      "text": "This was the most pleasant movie experience I have had in 2 years, after having seen the previews I feared this would be Sherlock Holmes on speed. Instead the movie augmented what was good from the first movie, and generally just surprised the hell out of me with a great plot, great acting, and the perfect balance between action and real acting."
    },
    {
      "rating": "10",
      "text": "I have got to say, the critics AND users were a little harsh on this VERY SLIGHTLY flawed diamond. this movie was entertaining and very action packed. harsh critics rate it bad and only say they fell asleep, giving no backing to why is was terrible. I see no justification in that. Now the reasons why I said the movie was slightly flawed are't even worth mentioning. if you get a chance to watch it, please, watch it."
    },
    {
      "rating": "10",
      "text": "Phenomenal movie! Intense action, amazing filmography, good plot, great acting. A must see. Witty and filled with clever British humor. Keeps you on your toes."
    },
    {
      "rating": "2",
      "text": "The first one was an amusing little action flick, even if it had nothing to do with Sherlock Holmes. This one doesn't even try to be a good movie, and they've stopped pretending to be Sherlock and Watson altogether. Terrible movie."
    },
    {
      "rating": "10",
      "text": "Still doing a great job at incorporating elements from Doyle's books, and Moriarity was played perfectly. It amazes me that critics liked MI:6 better than this"
    },
    {
      "rating": "9",
      "text": "Robert Downey, Jr. and Jude Law return once again as Sherlock Holmes and Dr. Watson in â"
    },
    {
      "rating": "9",
      "text": "It was clear that the critics no nothing about movies. One is to wonder how they even got a job. This movie is mixed with mystery, suspense, humor, and all around fun. Robert Downey Jr. wastes no time in making this action packed film full excitement. Well worth the $10+ at a movie theater."
    },
    {
      "rating": "10",
      "text": "A superb film, even better than the first. I found it hilariously funny, very gripping and despite what some might say about Holmes being too much of an action man - it is faithful to the original character. He was never supposed to be a sleuth, sitting at home solving mysteries. He only lounged at home in between cases - never by choice. Holmes always was a man of action. In Conan-doyles books he took part in high speed chases, firefights and all sorts. Ok so he never pumelled the hell out of anyone with his bare hands - but I always felt that he should - seeing as he was an accomplished boxer. Anyway - the user reviews are much more in line with how the film actually plays. Most of the critics who say the film isn't faithful to the original text have never even read holmes."
    },
    {
      "rating": "8",
      "text": "If I listened to critics, I wouldn't go see anything. SH: A game of Shadows has a complex storyline, average acting, gentle humor, and a surprise twist ending. THE END ?  Oscar or Not? No."
    },
    {
      "rating": "4",
      "text": "Guy Ritchie has managed to take anything that could be found fun in the first installment and use it to death to the point of monotony. Game of Shadows is really the same movie as the first: an extremely Hollywoodized, action-oriented take on the classic detective. While the first was fairly enjoyable, with a great performance by Downey Jr., this one has scrapped any mystery whatsoever in favor of a Victorian era, Steam Punk actioner. There is a bit of redemption however, with the last twenty-five minutes to half an hour being intense and fairly clever, as well as some decent action sequences. It doesn't exactly outweigh the awful performance by Stephen Fry or the fact that Robert Downey has now worked all originality or quirkiness in his character to death. And of course, the upsetting fact that they set it up for a third movie."
    },
    {
      "rating": "4",
      "text": "God, if I could put this in simplest terms this was an extremley boring movie and I honestly couldn't wait till it ended. The movie does take extreme intellectual ability to understand which is what makes this a boring movie also a silly premises and plot, though action at times also clever scripting and acting which saved the movie from total demise, other than that the movie was to long, too boring, and to hard to understand."
    },
    {
      "rating": "8",
      "text": "SH2 offers a great blend of action and mystery, and it's worth a few laughs.  RDJ, Jared Harris and Stephen Fry are all phenomenal.  The ending left a few things open to question, but I'm sure that will all get cleared up in SH3.  Overall, I think most people who enjoyed the first one will enjoy this one as well."
    },
    {
      "rating": "5",
      "text": "The potential for this series is great but no one seems wiling to take advantage of it. Here we have two great actors in Robert Downey, JR and Jude Law and the result is a TV miniseries. This film is no improvement on the first which may be my fault for not knowing the Holmes/Moriarty story better. Ritchie would have done himself some good if he had laid the foundation for that rivalry. In addition, Law is not that good at being the straight man to Holmes. Law could have been left out of the film and I would not have noticed. Lastly, is Ritchie turning Moriarty into the a Bond super villain?  Let's hope not as that is what destroyed that series."
    },
    {
      "rating": "4",
      "text": "This sequel has very little of what made the original so much fun. Holmes (Robert Downey Jr.) and Dr. Watson (Jude Law) talk way too much and most of it's not witty. Worse yet, the plot is confusing and convoluted. The action sequences are edited so fast and blurry that's it's impossible to tell what's going on. Director Ritchie has thrown around plenty of his stylistic flourishes, but they just add flash and noise. There's nothing about this film to recommend it."
    },
    {
      "rating": "6",
      "text": "I'm giving it a pass - barely - because it was never boring.  I'm still not convinced Guy Ritchie is the right director for Sherlock Holmes.  I admire his visual style, but there was too much distracting slow motion and super fast word play between all the characters.  I still have the same problem as I had in the first film about turning Holmes into a kung fu fighting super hero, but Hollywood has decided the average movie-goer in America has the attention span of a mosquito so the more action the better.  They also threw a woman in the film for no reason, she is absolutely wasted.  Still, Robert Downing Jr. and Jude Law do have a chemistry, there are some laughs, and a lot of action.  Just don't expect much if you are a fan of the Arthur Conan Doyle books."
    },
    {
      "rating": "5",
      "text": "Guy Ritchie delivers his lurid best. I don't think that Moriarty is the worth enemy for Holmes. I got dizzy, lousy acts. Don't enjoy the talk, \"the game,\" enjoy the slow-motion action scene, the forest scene is my favorite."
    },
    {
      "rating": "1",
      "text": "Such a dull and boring movie. The only thing that is possibly interesting at all are the fists fights due to the obscure filming. I would rather watch Bridesmaids than this garbage, and Bridesmaids was one horrid piece of crap. From about 10 minutes in I was ready to walk away, and that feeling didn't change. The story was boring, Rachel Mcadams was in it for about 5 minutes. The jokes weren't funny and the action was barely enjoyable and fancy. Worst movie of 2011 and 2012 at present."
    },
    {
      "rating": "5",
      "text": "The second installment in Guy Ritchie's Sherlock Holmes franchise is more action-packed than the first, and is just as funny. It's also on a far grander scale, as the great detective launches into a game of wits with his arch-nemesis Professor Moriarty (Jared Harris in a piece of perfect casting). Whilst the stakes have been increased, and there are a good deal more explosions this time round, A Game of Shadows has lost a lot of the charm the first film had. Robert Downey, Jr. has well and truly grown into his role - in the first film it felt like he was finding his feet, discovering who the character of Holmes really was, but this time round he is completely certain of himself, and his incarnation of the iconic literary character is mesmerising. As previously mentioned, Jared Harris makes the perfect Moriarty, both believable as an academic and as a criminal mastermind, and always menacing, and the scenes of \"intellectual fistycuffs\" between Holmes and Moriarty are without doubt the highlight of the film. Unfortunately Jude Law's Dr. Watson is now a little dull. In the first film he was essential to Holmes' investigations, serving as a combination of best friend, carer and bodyguard, but this time round he seems to have been brought along for the ride as an afterthought. He serves little purpose other than running around and firing the odd shot while Holmes works everything out. He's now just a big moving target with a moustache for evil henchmen to shoot at. And Jude Law forgets his character's limp on an alarmingly frequent basis. The relationship between Holmes and Watson has also devolved from an amusing \"bromance\" into full-blown homo-eroticism. Other characters from the first film aren't given the screen-time they deserve - Rachel McAdams' Irene Adler gets a couple of short scenes, and if you blink you'll miss Eddie Marsan's Inspector Lestrade. The performances of series newcomers Noomi Rapace and Stephen Fry are both competent but uninspiring. The main problem with the story of A Game of Shadows is not that it's uninventive and predictable (which it is), but that the pace is inconsistent - alternating between complex action scenes and quieter moments where Holmes tries to figure out exactly what is going on results in the story having a rather jarring stop-start feel. In addition, because of the excessive use of innuendo, sometimes the film resembles a Carry On! a little too closely. Sherlock Holmes: A Game of Shadows is still entertaining for the most part, and has great performances from Robert Downey, Jr. and Jared Harris, but a combination of reduced roles for some central characters, uneven pacing and some laughable double entendre makes the film far less than it might be. Here's hoping these problems will be addressed in the sequel that will undoubtedly appear at some point in the near future."
    },
    {
      "rating": "8",
      "text": "If you liked the first one then you will love this one! Downey and Law team up once again to unravel a mystery and combat evil in Victorian Europe. The supporting actors are once again excellent except for Noomi Rapace, who is lifeless and can't act a lick. Her performance was almost as bad as Rachel McAdams' in the first movie. Rachel comes back (but only briefly) as Irene Adler leaving Noomi to stink up the main female role. The saving grace for the girls is Kelly Reilly, who once again shines as Watson's fiance/wife. The action is almost non-stop and the \"face to face\" confrontations between Holmes and Professor Moriarity (played to perfection by Jared Harris) are superb.I'd ignore the negative reviews and consider just who didn't like this movie. They are probably the same critics who swoon over the crap that winds up being nominated but never winning during awards season."
    },
    {
      "rating": "10",
      "text": "I thought the movie was great fun. As long as you do not expect to see the classic Sherlock Holmes in the books I think you will be pleasantly surprised. The whole  theatre was laughing and enjoying the movie and I was too."
    }
  ]
}