{
  "id": 1117,
  "title": "Sherlock Holmes",
  "starring": [
    "Robert Downey Jr.",
    "Jude Law"
  ],
  "runtime": 129,
  "genre": [
    "Action",
    "Adventure",
    "Crime",
    "Mystery"
  ],
  "description": "Eccentric consulting detective Sherlock Holmes and Doctor John Watson battle to bring down a new nemesis and unravel a deadly plot that could destroy England.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/momkKuWburNTqKBF6ez7rvhYVhE.jpg",
  "categories": {
    "plot": 5.64,
    "acting": 6.705882352941177,
    "ending": 5.0,
    "soundtrack": 1.0,
    "cinematography": 3.6666666666666665,
    "familyFriendly": 5.166666666666667,
    "funny": 8.1,
    "action": 6.45
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I liked it a lot! But I had to forget everything I read as a kid. As an action movie it's great."
    },
    {
      "rating": "10",
      "text": "What the hell are the critics complaining about? They are basically saying that the movie is nothing like thew books. Have you even read them? It is a brilliant adaptation of the stories that Doyle wrote!"
    },
    {
      "rating": "10",
      "text": "A perfect movie. The critics should stop acting like elitist bastards. Some say it was too much action for Holmes, some say it was boring. We either have snooty elitists or gun-obsessed action-heads. It was a the best movie of 09"
    },
    {
      "rating": "7",
      "text": "Hmmmm. There are action sequences, plenty of one liners, and Robert Downey Jr. I can only deduce that this is another Hollywood box office smash. And silly old me, I just saw the film. My friends pestered me about this for the longest time. They loved the film, and were positive I would too. I told them I'd get around to it, until finally one of my friends lent me the movie to watch. My feelings about this unique film are a little mixed. The film wants to be clever, but very little smarts at all are needed to view this film. Naturally, this film is geared towards teenage boys, who for the most part, are not interested in an intellectually stimulating film. They just want to see Downey deliver witty lines, and watch him beat up thugs. So, if that's what you came to see, you will not be disappointed. However those wanting a more intelligent film, should not look here. Even when the Sherlock Holmes is explaining how he figured out the case at the end, it's through many clues that the viewer didn't have a chance of deciphering themselves, which is quite contradictory to what Sherlock Holmes is all about. I know the target audience, so I expected as much, but my mother who viewed the film with me, was quite irritated at the obscure clues. A good mystery should be tailored so that the audience can try to solve the mystery too (and make it hard enough, so that they can't figure it out). This film does nothing of the sort, instead, we merely learn at the end, that Sherlock had seen things that the camera never shows us, making it impossible to solve the mystery ourselves. But like I said, the target audience doesn't care about such things, so therefore, the film is oddly \"smartless.\" But I digress. On the other hand, the cast does a fantastic job at portraying each of their characters, even if some lines were delivered a little hammy. Also, the musical score, composed by Hanz Zimmer, is very good, and absolutely hilarious. Music doesn't commonly make me smile (out of humor anyway), but this score did. Though many of the action sequences were rather ordinary, there were definitely a handful that kept me on the edge of my seat, and I'm sure the target audience will eat it up. The film is quite amusing, as one can expect with from the leading actor, but for some reason, the film wasn't quite as humorous as I was expecting. It was funny enough, anyway. Lastly, and this may be a major problem for some, but this film just doesn't feel like Sherlock Holmes. It feels like Robert Downey Jr. makes another million dollars. I suppose this is to be expected, but somehow, I was hoping that there might be some sort of Sherlock spirit to this, but alas, there was not. I was not wowed, but I most definitely enjoyed myself. I do wish, though, that the film was a bit more intelligent, and this film doesn't feel like Sherlock Holmes at all. Regardless, this is an enjoyable romp, and I'll probably catch the sequel on DVD. Consider me entertained, but not impressed."
    },
    {
      "rating": "8",
      "text": "Thanks to Robert Dwoney Jr. and Jude Law's surprisingly effective chemistry and an impressively entertaining storytelling, Sherlock Holmes isn't only one of the smartest works added to Ritchie's filmography; it also offers a great spectacle to the audience."
    },
    {
      "rating": "9",
      "text": "I'm loving the reviews here, the stupidity within the statements: \"It was too rational\" and \"It was too complicated and boring\" are reminding me once again that most movie-goers prefer to have their hand held throughout an entire movie rather than use their deductive skills. Too rational? are you kidding? you actually need 'magic' to enjoy something? Sherlock Holmes is ALL about the mystery being solved, everything being presented and known. If you don't like that then why did you even bother to go watch? @the Sherlock Holmes purists, every other hero of some of the oldest stories in time have transitioned into numerous changes like this one(batman, being a man without powers, being a sort of detective on his own, was changed a lot over the years). The picture of however you imagined Sherlock to be might not be the same as the next person beside you. Its open to interpretation, unless you seek to extinguish everyone's creativity due to your close mindedness. The characters weren't empty, their relationship was fully realized (Sherlock and Watson, two detectives fighting over small, inconsequential things, Watson being tired of Sherlock's antics, and yet what unifies them is the mystery for the time being. Sherlock feeling stuck in his life, feeling as though he is being abandoned, trying to pull his old friend back into the game so he wont be the only one who's trapped and alone, his character develops from there but I wont spoil it) and it was very much apparent that they cared deeply about each other, but most would rather that their emotions surface in a much more obvious way. Its ridiculous to give this movie a bad review just because you didn't bother paying attention.As for the science and the technology in this movie, it wasn't a copout. All of this was at their disposal back then. Sherlock Holmes, whatever version you prefer of him, was above all else a man of science. Also it goes without saying that in the books and in the cartoon or live action series on tv, things did go slower and there was less action. However in movie format things have to be sped up a bit in order to fit everything in, otherwise the movie would wind up being 3-4 hours and coming wayyy over their estimated budget. Its impractical, and to say otherwise means most of you don't have a clear grasp on what making a movie entails, including the reviewers of these magazines. Besides it all works out in the end, and I found the pacing to be especially stimulating, kept me at attention the entire time.I understand that you have to pump out these reviews almost everyday, but it doesn't mean you have to rush them like this. Hating a movie like this one while its successful doesn't make you a good critic, it just makes an idiot, especially when you assume this was made for a younger generation or for the \"ADD crowd\". Branding them the ADD crowd while skipping over the fountain of medical terms used in the proper way(for once in a mainstream movie, no pseudo-science, no **** spells or rituals), the witty jokes and all of the deductions and experiments Holmes made all tied together in one neat conspiracy(Which given a little thought, wasn't all that complicated to those who said it was) just makes you look like your the one who deserves the label.Also what was mentioned was the exaggerated scenarios. They were pretty lucky to survive I will admit, but one thing I found realistic was the part when they lost a whole night's sleep after the fight. This is something I rarely see in movies, usually the fight is over, hero carries on like a good soldier. This humanized them, and it wasn't the only occasion in the movie where they did this.One last comment before I leave this review to those whom aren't as gullible as the rest, the hand to hand combat wasn't as uninspired as some claim it to be. While being as intelligent as Holmes with the reflexes he possessed, its not hard to observe the fact that every hit he made was calculated beforehand, as displayed in the very beginning of the movie. When he didn't have time to calculate his every movement he used things like the electricity conductor or chains or guns etc to gain an advantage. I honestly don't get how all of this could have been missed by so many reviewers, but that's fine. I hope that if you've read this you've decided to rent or buy this movie. Whatever you decide, its definitely worth the look."
    },
    {
      "rating": "8",
      "text": "Guy Richie's \"Sherlock Holmes\" is a stupid interpretation where Sherlock Holmes is a muscle brute solving murders and mysteries with bullet time and sheer luck. Surprisingly, the movie actually works great with its modern interpretation of Holmes."
    },
    {
      "rating": "9",
      "text": "I have not seen a class movie since Slumdog, this was a very good movie. Guy Ritchie is back now that he is over Madona, maybe now he will continue to make some good movies."
    },
    {
      "rating": "8",
      "text": "Sherlock Holmes was greatly acted, suspenseful picture with a great impersonation of Holmes. Robert Downey Jr. deserved best actor nomination."
    },
    {
      "rating": "4",
      "text": "Robert Downey Jr. and Jude Law work great together. It's a shame that nothing else in this movie works at all - the worst part is how hard it tries to."
    },
    {
      "rating": "5",
      "text": "When it comes to big blockbusters, I generally dislike movies that fall into this category because they simply lack any cerebral characteristic. Surprisingly, Guy Ritchie's Sherlock Holmes is dissimilar to my tendency of aversion of big budget films.  Contrary to what I just stated, Sherlock Holmes is undoubtedly not a thoughtful film. But unlike other films in my categorical standards, Holmes  makes up for it with its beautiful art direction and action sequences. Even though they are not accurate to the time setting, the scenes of combat are well choreographed and give the film personality.  Additionally, the art direction is great, the images of vintage London are just mesmerizing giving the film much needed charm to successfully emulate the original Sherlock Holmes.  Lastly, Downey Jr's replicates  Conan Doyle's literary character to English perfection with his remarkable false accent and smug personality. With these statements said, the main flaw is the lack of mystery.  Sherlock Holmes is a renowned literary character that was famous for the mysteries he solved and how he manipulated every sort of evidence to solve the case. Even though there are some traces of it, Sherlock Holmes ultimately doesn't create a plot of anonymity.   It is obvious that the film focuses on action, and that only.  That does not necessarily ruin the film, I found the film thoroughly entertaining. But the audience should simply lose the thought that Sherlock Holmes is a mystery; because it ultimately is not thought provoking or mysterious in any way."
    },
    {
      "rating": "1",
      "text": "I looked forward to see this movie but it turned out to be a total dissapointment. I agree with NYP and Washington Post, this film is empty as can be. I was with a friend in the theatre but if I was alone I would have left halfway. First of all, there is no color whatsoever, everything is grey, even the makeup of the 2 ladies is so ugly, and their parts are flat and uninteresting. Jude Law is ok, but Robert Downey jr has this frozen look in his eyes, he is not funny, not intriguing and not worth watching. The story is overcomplex, way too rational. Guy Ritchie seems a testosteron driven visual artist with zero talent to push actors to a great achievement. I cant believe it. No wonder Madonna left him, you can say what you want but her music always has a meaning and feelings, even her most dancy tracks. And this is what I missed the most with this movie, the lack of a soul."
    },
    {
      "rating": "0",
      "text": "I would love to review the whole of this movie but i honestly don't know if it improves after the first hour. Y'see my fiance and i both walked out after what seemed the longest hour of our lifes. I could genuinly find no reason to stay seated as this film completely lacked any kind of heart, and the so called \"chemistry\" between Law and Downey jnr was completely missing from our screening. Normally when i'm sat in a packed cinema and the audience is deadly silent it usually a good sign. It often means they are compelled and fascinated by the on screen perfomances. This time the audience just looked bored. I can only pray that RDJ's performance in Iron Man 2 makes up for this travesty. p.s. this is the only movie i've ever walked out on and i've seen a lot of rubbish in my time. Hell i even watched terminator 3."
    },
    {
      "rating": "7",
      "text": "If you go in to a movie with low expectations, you'll more than likely be surpized. As was the case for Sherlock Holmes. Don't get me wrong, Guy Ritchie taking on a literary masterpiece is no way the same as Kubrick and The Shining, but Ritchie has incorporated Holmes' intelligence with his usual over the top action pieces and made a much better-than-expected entertaining film. Downey and Law play Holmes and Watson with humor and a little gay innuendo, but the way Ritchie has Holmes analyse his fights in slow motion first is a great advantage to all the commotion that follows. All in all, well worth the price of admission."
    },
    {
      "rating": "3",
      "text": "If you have read and enjoyed Sherlock Holmes over the years this movie is a major disappointment. More like a fantasy where Sherlock meets Batman and Robin. Boring with a very poor story line. Younger people will enjoy it but for mature adults it is a waste of time."
    },
    {
      "rating": "3",
      "text": "This movie was terrible. Zero points for anything other than Downey, who was his usual great self. But Guy Ritchie shouldn't be allowed anywhere near a camera again."
    },
    {
      "rating": "3",
      "text": "Downey. Jr, even he does not believe in anything happening in the movie,is brilliant. Jude Law Ok. The rest is only BORING. But well, is Guy Ritchie so, what did you expected, a good movie?"
    },
    {
      "rating": "6",
      "text": "Gorgeous to look at, and great performances by Downey and Law, but an eminently forgettable plot: I won't need to see this twice."
    },
    {
      "rating": "3",
      "text": "The best I could say about this film is that it inspired me to re-read A. Conan Doyle's Sherlock Holmes stories. I'd watch Robert Downey Jr in anything but even he was hard to take as he consistently mumbled his lines off screen making him almost unintelligible and and adding confusion to the already obtuse storyline. I am still puzzled over what the plot was really about. Although the fast action and CGI London was amazing, I wanted more of what a Sherlock Holmes story is supposed to be - the use of recognizable deductive reasoning and those 'ah-ha' moments on my part as I understood what the mystery was all about. No such moments here. This film is Holmes as an action hero and although I appreciate the change in character from the old 1940-1950's stogy British gentleman, this version just did not work for me. Maybe I should have paid closer attention but the confused plot made me wish I'd taken a nap instead."
    },
    {
      "rating": "2",
      "text": "ROFL"
    },
    {
      "rating": "5",
      "text": "Let me begin by saying that \"Sherlock Holmes\" is a lot of fun. That said, as a movie about Sherlock Holmes, it is a failure. As a lifelong fan of the stories by Sir Arthur Conan Doyle, I have seen many screen adaptations and interpretations of his most enduring creation, and this movie simply fails to do the subject matter any kind of justice. While billed, somewhat schizophrenically, as both a \"return to origin\" and \"reinterpretation\", the film definitely inclines to the latter. A romance is added, as is an emphasis on chop-socky action and physical comedy. The joy of the Holmes stories, and of all his best films, is the unraveling of the mystery. Here the mystery takes a back seat, serving as a vehicle to propel the film from one frenetic action sequence to another. The fights are kinetic and exciting, but ultimately many of them seem included for their own sake, not the sake of the story. This is truly a Sherlock Holmes for the MTV generation. Between the whizz-bang fights, some plot sometimes occurs. There is not very much, however, and what is there is underwhelming. Mark Strong is given little to do as the main villian, and his nefarious scheme does not hold up to close scrutiny. Rachel McAdams plays a totally reimagined Irene Adler, who is now a master criminal and Sherlock Holmes's love interest, a development which never appears in Conan Doyle's books. Love, in the books, is anathema to Holmes, and he would no sooner form a romantic relationship than dance naked down the Strand. A good Sherlock Holmes story must remain within the parameters that Conan Doyle set down. It must be a convincing story about Sherlock Holmes. Otherwise, why have it be about Holmes at all? Why not a different detective? The obvious answer is, of course, because the Holmes name is arguably one of the most famous brands in the English speaking world. But this is not an excuse to run roughshod over such a unique character. This is not to say that the movie is without its strong points. Quite apart from its failings as a Sherlock Holmes adventure, it is fun and features two fanstic actors (Downey and Law) as Holmes and Watson. The fights are, admittedly exciting, and the views of 1800s London are top-knotch. I can only hope that the sequel will include more plot, more mystery, and more of Conan Doyle's Holmes, not Guy Ritchie's."
    },
    {
      "rating": "3",
      "text": "OMG, what a disappointing drag. These aren't interpretations (or reinterpretations or even MISinterpretations) of Holmes and Watson. They're two other guys involved in a clownish caper."
    },
    {
      "rating": "2",
      "text": "I agree with John W.- awful!!!!"
    },
    {
      "rating": "0",
      "text": "0worst movie I have ever seen. would have walked out but my wife seemed to be interested in it. A headache. Confusing. No discernible plot. stay home. BTW my wife gave it a seven, she must be getting senile."
    },
    {
      "rating": "0",
      "text": "I walked out...A piece of garbage. Writing is terrible, Acting by Downing is google eyed. A TOTAL Disaster!!"
    },
    {
      "rating": "0",
      "text": "Does Guy Ritchie know how to deliver anything else but this over-stylized crap?"
    },
    {
      "rating": "0",
      "text": "Terrible movie, I sat through the whole thing (sadly) and I must say every single thing about this movie is terrible,vile,horrible,and many other bad things to say about this movie."
    },
    {
      "rating": "9",
      "text": "I thought this film was great. Great performances all around, very atmospheric. It also manages to be authentically Holmes, although the action's on a slightly larger scale. But how could anyone not enjoying watching Holmes work out how to take down his opponents in more unique ways."
    },
    {
      "rating": "8",
      "text": "This is probably as good as a Shaerlock Holmes movie is going to get. Robert Downey continues to do great in this movie."
    },
    {
      "rating": "1",
      "text": "Little fidelity to the orignal character, very little homework on the history and the period the story took place. This movie is a commercial enterprise to lure bored youngster or people with low reading skills so that they can sit and turn the brain off as usual sitting on the moive theater seat eating some popcorn. Jude Law cannot make a Watson as he does not look at all like a rugby player. Robert Downety Junior would actually make a good Moriarty and Mark Strong should have been the Sherlock Holmes. They have good the cast inverted."
    },
    {
      "rating": "7",
      "text": "Sherlock Holmes is known as the brilliant detective of 221B Baker Street, who can spot minute details in the blink of an eye and observe even the smallest and insignificant things and regard them as important. Here in this film we get a more rambunctious, drugged and physical man with the same intellect and persona we'd expect. An excellent film."
    },
    {
      "rating": "10",
      "text": "The scenes between Holmes and Watson were witty and fun to watch. I've not read a lot of Sherlock Holmes, but I can tell the movie presented him to be a little too eccentric. Holmes and Watson excel in hand to hand combat, which I thought unlikely. Ironically, I can believe Watson to be great in fighting, given he's a seasoned soldier. The antagonist was brilliant, so was the plot and the mystery. I thoroughly enjoyed every minute of it."
    },
    {
      "rating": "10",
      "text": "What more do you need in a movie? Great actors leading you on a exciting adventure and keeping you entertained the whole ride. Good work Mr. Richie!"
    },
    {
      "rating": "7",
      "text": "Very hard to rate, but I'll bump it because the average is too low. The plot is stupid, the hand-to-hand combat is dubious, it's no more a Sherlock Holmes movie than it is a mystery (closer to a spy movie) and the use of drugs and technology is a massive copout destroying all sense of crime-solving deduction. Yet Holmes and Watson are just so *funny.* They carry the movie away from total oblivion and make in entertaining for at least another viewing. Meanwhile their domestic, awkward relationship sets off the homoeroticism alarms of reviewers everywhere. Arthur Conan Doyle's work was always somewhat pulpy. Perhaps this is really a fitting (if entirely faithless) modern reboot."
    },
    {
      "rating": "8",
      "text": "Cool flick. Downey Jr. and Law make a great duo. Love Them."
    },
    {
      "rating": "4",
      "text": "Bears not the slightest resemblance to Sherlock Holmes, and I was so tired of watching people beat each other up. Rachel MacAdams doesn't seem bright enough to be any kind of mastermind, and the plot of the story is a total snooze. Downey Jr. is fine, Jude Law is forgettable."
    },
    {
      "rating": "9",
      "text": "If this film wasn't marketed as 'Sherlock Holmes\" and the characters were unrelated to the Holmes universe, then this film would have far better ratings. The reviews are simply written by people who are dismayed at the re-writing of Holmes' personality and adaptation by Downy Jr."
    },
    {
      "rating": "7",
      "text": "Very good but felt a little long by 3/4 of the way through."
    },
    {
      "rating": "9",
      "text": "I'm not sure why the critics disliked this movie so much. As a person who has never read a Sherlock Holmes novel, I found the movie quite enjoyable. Well shot, well acted, and very entertaining."
    },
    {
      "rating": "6",
      "text": "Better than the last Indiana Jones, not as good as most Indy action thrillers, same sort of crazy ass plot. Annoying ending, middling muddled middle, good beginning. Ii will make Madonna jealous."
    },
    {
      "rating": "9",
      "text": "Very funny and tense which we all love and quite a thinking movie but brilliant."
    },
    {
      "rating": "8",
      "text": "Excellent movie, entertaining and fun. Great action. Holmes and Watson compliment each other nicely."
    },
    {
      "rating": "9",
      "text": "I am not a Guy RItche movie fan but he did a wonderful spin on the Sherlock Holmes story. I enjoyed every moment and cannot wait for a sequel."
    },
    {
      "rating": "9",
      "text": "This movie was awesome. The story was fast paced and intriguing. The acting was phenomenal, and the effects were decent."
    },
    {
      "rating": "10",
      "text": "One of the wittiest movies I've seen."
    },
    {
      "rating": "7",
      "text": "It wasn't amazing but I did like how he was a drug addict thug rather then the mystery solving uptight guy people usually think of. He was the original Holmes."
    },
    {
      "rating": "7",
      "text": "It's nice to read the User coments, honestly, I hate everybody hwo makes a critic, there are so many different comments, from \"This sh*t sucked\" to \"Masterpiece\". The Users here aren't giving a critic, they are just saying if the movie liked them or not. A lot of people think they can give a mature coment but no, like this guy John W., what a dumbass, what does he know about writing or acting?"
    },
    {
      "rating": "9",
      "text": "This is one of the best movies i have seen so far this year(2009) and maybe one of the best films i have ever seen. The script was very good and the story was extremly enjoying. One of the best things in Sherlock Holmes was the actors; Robert Downey, Jr. And Jude Law. They are perfect and makes the movie great. Everybody has to see this movie. Honestly i cant really see how Sherlock Holmes can bee called a bad movie. It`s a great moie."
    },
    {
      "rating": "10",
      "text": "Brilliant film."
    },
    {
      "rating": "4",
      "text": "It has a good premise, the action was pretty great, but for the most part it bores you to death with it's complicated plot."
    }
  ],
  "recommendations": [
    "sherlock_holmes_a_game_of_shadows",
    "lucky_number_slevin",
    "the_accountant",
    "inferno",
    "looper",
    "the_prestige",
    "twelve_monkeys",
    "minority_report",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "the_raven",
    "odd_thomas",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "glass",
    "inherent_vice",
    "the_equalizer_2",
    "tenet",
    "morgan",
    "knives_out",
    "the_hunger_games_catching_fire",
    "body_of_lies",
    "ant_man_and_the_wasp_quantumania",
    "three_kings",
    "terminator_genisys",
    "avengers_age_of_ultron",
    "thor"
  ]
}