{
  "id": 3012,
  "title": "Shot Caller",
  "starring": [
    "Nikolaj Coster-Waldau",
    "Omari Hardwick"
  ],
  "runtime": 121,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "A newly-released prison gangster is forced by the leaders of his gang to orchestrate a major crime with a brutal rival gang on the streets of Southern California.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qLmLz2wtyYvmW8Ult3l2ngOnW8v.jpg",
  "categories": {
    "plot": 8.166666666666666,
    "acting": 8.133333333333333,
    "ending": 7.75,
    "soundtrack": 7.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "One of the best and if not the best movie i have seen in years. One of my favourite of all time. Ignore the critic reviews they have no credibility. These are the same critics that gave \"the last jedi 9/10\""
    },
    {
      "rating": "10",
      "text": "What a beautiful and thrilling movie this is. I could not take my eyes off this movie. Every single was interesting. This movie is definitely very underrated in my opinion. Go and watch it now, its great!"
    },
    {
      "rating": "10",
      "text": "I enjoyed that movie as a thirsty for quality person, and it satisfied me all the way up and more. I actually did pin in my head the name of the brilliant director of this movie.The really best of Nikolaj Coster Waldau works,also."
    },
    {
      "rating": "8",
      "text": "I loved the movie. Its a kinda realistic look at high medium and max penitentaries in america. Or..so says my brother who worked in one for 30 yrs. Not sure he would have gone to such a high level security prison for his crime though. Especially not having a record. Still, the action and reality of prison life was real especially in state run prisons. Jolly good show!!"
    },
    {
      "rating": "8",
      "text": "This movie deserves to be watched for more people this needs to have more recomendations. What an amazing movie this surprised me in a very good way nicolaj coster-waldau gives such an amazing performance he carries the entire film so well, the music gives a lot of tension and it goes fast allthough the movie is slow, the only issue that i found is that they should put in here more time of nicolajs carácter in prison."
    },
    {
      "rating": "8",
      "text": "Really glad I checked this movie out. Nikolaj has taken a wide variety of roles since his rise to fame thanks to Game of Thrones and this one is one of his most unique yet. As a banker who gets sent to prison, He realizes he has to adapt or die and ends up getting sucked into this world of crime. It's a tough tale to tell because it's such a 180 for the character he plays. And Nikolaj does a fantastic job leading a talented cast. Go check it out, You won't be disappointed."
    },
    {
      "rating": "9",
      "text": "This has to be one of the hardest movies I have seen in a long time. It belongs up there with heat, scarface, and the departed. It portrays a successful man who makes a horrible mistake and kills his best friend in a dui accident and is forced to do prison time. Money, main character, is thrown in a prison with the \"big boys\" the murders, rapists, etc and is forced to play by the gang rules in order to survive. The movie shows how our prison system does not rehabilitate but only makes criminals far worse when they come out. The movie's primary motive for the main character is to protect his family and it shows the sacrifices he is willing to make to do that. I thoroughly enjoyed this movie and highly recommend for you to see it."
    },
    {
      "rating": "8",
      "text": "Actually pretty good movie, with a good storyline, depicting life in prison and how the US justice system can actually F up your life. The acting of Coster Waldau also was really good and all in all in all one of the best movies I have seen lately that I thought won't  be that good at first."
    },
    {
      "rating": "6",
      "text": "Nikolaj Coster-Waldau and Jon Bernthal star in this new thriller crime movie. With all the trailers I was actually stoked to watch this. Being a huge Game of Thrones fan and for it just looking cool. But does it actually deliver? Short answer yes. I did feel it did a good enough job showing the horrors inside prison can be. It was very interesting seeing a family man in the beginning transform into this criminal, and that's where I think the movie shines. The movie does start off with him being out and keeping cutting back to his time in jail. For the most part it was utilized fine, but in the beginning it makes absolute no sense whats going on since you are being thrown right away in the middle of the movie. But as the movie starts to unfold it becomes clearer and clearer. I just wish it was easier to follow in the first 20 minutes. The acting was incredibly strong from everyone and most definitely Nikolaj Coster-Waldau. I did think the first 30 minutes could of been improved and handled better, but the last hour and 30 was entertaining, which means the film could of been cut down by 20 minutes. Overall I think most people will find this enjoyable and entertaining."
    },
    {
      "rating": "9",
      "text": "Premise was simple. The quality of acting is what got me. Excellent use of sound and music. Hope there is a sequel."
    },
    {
      "rating": "9",
      "text": "What would you do for your family? Where would you draw the line? Would you take another life? Would you grab the lowest hanging fruit for your own and your families safety? These are just some of the social questions that Shot Caller asks the viewer, and as a husband and father, I found my thoughts terrifying.The film opens on the day of Jacob “Money”’s release from prison, formerly a successful stock broker turned con, played by Nikolaj Coster-Waldau (Game of Thrones, Black Hawk Down). He writes a heartbreaking letter to his son, stating this will be his last. You can easily tell from the opening moments, that Jacob is not a man to cross. During his bus ride to the city, the film shows us how he got to this point.Prior to his incarceration, Jacob had it all; a wife, a child, and a great career. While out with his friends and wife, he has a few too many to drink and causes a fatal car crash. After consulting with his council, he is offered a deal which would take his sentence down from a number of years to several months with good behavior. Against the wishes of his wife, he takes the deal, but is housed with other violent offenders due to the nature of his crime. His lawyer also informs him that the other inmates will test him, and he should not back down, or he’ll likely not make it out alive. This leads to an altercation with another inmate that puts him in the sights of a white supremacist gang.He is then coerced into their association in exchange for protection by Bottles, played by Jeffrey Donovan (Burn Notice) and Shotgun, played by Jon Bernthal (The Walking Dead, Daredevil). At first, he is simply smuggling drugs and contraband in his rectum, but soon escalates to murder and participating in riots. These actions quickly add time to his sentence, as well as raise him through the ranks of the gang.Shot Caller continues to switch between its past and current settings seamlessly. While requiring the viewers’ full attention, it’s not hard to follow thanks to the excellent writing and direction by Ric Roman Waugh (Snitch, Felon). Waugh used every second of the film’s two hour run time wisely. The direction, keeping the viewer in the dark with a number of questions that are answered through flashbacks is extremely powerful in keeping the viewer engaged. Normally, my wife barely looks up from her phone while watching a movie; this is the first time in a year she hasn’t picked it up throughout the duration of it.Back in the present day, Jacob meets with Shotgun (also released) and Howie, played by Emory Cohen (The Place Beyond the Pines), who serves as his underling overseeing a major gun deal for the gang. After a short introduction, the group heads to a party celebrating Jacob’s release. After a drive by shooting causes the party to end abruptly, you can tell not everyone is happy this deal is happening.The remainder of the film follows Jacob and the supporting characters through the days following his release and leading up to the deal. Without giving too much away, it delves deeply into the questions I mentioned earlier, as well as questioning the common stigma that the U.S. correctional system is nothing but a revolving door. That the prisons can transform someone who simply made a mistake into a psychopath, doing little to actually rehabilitate the inmate and releasing a man into the general population worse off than when he went in. Additionally, Shot Caller touches on some themes of military personnel not having many options once they are brought home from foreign lands.Waldau excels as Jacob, showing an amazing transformation that rivaled Bryan Cranston’s as Walter White. Not only did I feel sympathetic to his plight, I easily identified with the character. If I was put in the same situation, I can’t say I would have made different decisions to protect the ones that I love.Additionally, Holt McCallany (Alien 3, Fight Club) steals every scene he is in as The Beast; he is the leader of the gang. The Beast is equal parts intelligence and intimidation and comes across as the most terrifying criminal element in this feature, or recent history. The only performance I found to be lacking was Lake Bell (How I Met Your Mother), who plays Jacob’s wife Beth. While not featured prominently in the film, her stance from concerned wife to bitter ex feels forced and out of place, considering Jacob clearly holds feelings for her, even after his 10 year absence.With current events that are erupting in the U.S., I can see where this movie may receive some backlash due to the content. I feel like if you skip this movie because of these events, you will be missing out on an amazing character study and experience. Shot Caller is not only an amazing movie; it offers a look into social issues that are often not touched on by other films where the criminals are villainized or glorified. Nikolaj Coster-Waldau’s Jacob feels like what we all are: human."
    },
    {
      "rating": "7",
      "text": "After Jamie Lannister I'm not surprised that Nikolaj did such a great job playing this morally grey character which can't decide if he's a bad or good guy. Also the plot is interesting enough to keep you going, but sometimes it drags with it's pacing issues. The music and sound effects are great and welcomed. Visuals are great as well, with a casual directing style. But sadly two third of the movie is just not entertaining enough for a general audience, right until the end of it. There are no major plot twists either to help this out. Overall it's a good movie, but barely. And only because of the actors work, and the ending of the movie, plus that this really is a serious crime drama thriller movie, just as advertised."
    },
    {
      "rating": "9",
      "text": "Great movie. Would be a 10 compared to the garbage being churned out of Hollywood today with their woke diverse garbage. Great acting, believable and logical storyline (more than can be said for today's films) it offers a great insight into how institutionalization can lead to more criminals and the problem with our current system.Don't trust the critic score, this movie is a great watch"
    },
    {
      "rating": "6",
      "text": "Un poco sobrevalorada, la trama es demasiado superficual, me hubiese gustado que se fijara más en algunos detalles profundos."
    },
    {
      "rating": "9",
      "text": "surprisingly good. too graphic at times, but still a fairly good movie. Acting was on point, and I didn't realize until a flashback scene that the main character was from GOT"
    },
    {
      "rating": "8",
      "text": "this one wastes no time getting into it. makes you think twice about drinking before driving. great performances from all actors, great screenplay, brings prison life to light which by the way is no joke. a thinker is the most dangerous inside. watch this."
    },
    {
      "rating": "9",
      "text": "Great movie. Had never heard of it before I watched. Reminds me a bit of Shawshank - as a witty prison movie. Knew Coster-Waldau from GoT and he did a fantastic job. Could be a tad slow at times but you never feel disconnected. I recommend this movie to anyone who likes a good Drama/Thriller."
    }
  ],
  "recommendations": [
    "no_escape",
    "the_marksman",
    "law_abiding_citizen",
    "contagion",
    "the_next_three_days",
    "taken",
    "promising_young_woman",
    "savages",
    "assault_on_wall_street",
    "no_country_for_old_men",
    "flight",
    "cold_pursuit",
    "prisoners",
    "live_by_night",
    "limitless",
    "snitch",
    "donnie_brasco",
    "the_purge_anarchy",
    "run_hide_fight",
    "hereafter",
    "gone_baby_gone",
    "3_days_to_kill",
    "the_accountant",
    "falling_down",
    "death_wish"
  ]
}