{
  "id": 3616,
  "title": "Showgirls",
  "starring": [
    "Elizabeth Berkley",
    "Kyle MacLachlan"
  ],
  "runtime": 131,
  "genre": [
    "Drama"
  ],
  "description": "A young drifter named Nomi arrives in Las Vegas to become a dancer. When she catches the eye of Cristal, the main attraction at the Stardust stage show, Nomi is on the brink of realizing her dreams. But as she bumps and grinds her way to the top, Nomi realizes that there is only room for one starlet on the marquee... and that either she or Cristal will have to take a fall!",
  "releaseYear": "1995",
  "mpaaRating": "NC-17",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ojcUMFpOhYuDOlIb4Ik47mBcYej.jpg",
  "categories": {
    "plot": 4.454545454545454,
    "acting": 3.6666666666666665,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.666666666666667,
    "funny": 7.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Eh....I don't find this movie so sexy. I'm a dude, and I guess I'm suppose to say this is so erotic and watch it over and over again just to see some seductive garbage. But this was just very disturbing. I'll admit that Elizabeth Berkeley who was also from \"Saved by the Bell\" is very attractive, but her acting is like she's trying to be sexy. As gorgeous as she is, it didn't help out a lot. She shows her breasts.....too many times. I'll be honest as a man, I always wanted to see her boobs. But after the 3rd time, it got really tiring very fast. My reaction was, (YES, she has nice t*ts, enough!) Also....the plot was so disturbing. I just don't understand what the plot this is trying to show me, its just bizarre. This was really hard for me to sit through, it's not worth the time....okay, maybe just one sit through the movie if you like bizarre erotic films with lots of stripping, Elizabeth Berkeley's t*ts and lap dance, weird sex and mediocre softcore porn."
    },
    {
      "rating": "0",
      "text": "One of the worst movies. It has decent acting compared to a porn movie. The acting is plain bad. The main character can only express two feelings: anger and lust. The story is really the low end of Hollywood screenplays. It is nothing more than a soft-core porn movie. The girls were looking good. There is no other reason to see this."
    },
    {
      "rating": "3",
      "text": "Not very erotic. I mean some scenes are very sexy like Elizabeth Berkeley's lap dance or her final French kiss with Gina Gershon. But the movie is not well acted and directed. Although, it is not that the movie has no redeeming qualities at all (infact, it is very unintentionally funny at times), but still a very bad movie."
    },
    {
      "rating": "8",
      "text": "A masterpiece of high camp... i laughed the entire time."
    },
    {
      "rating": "0",
      "text": "It's gone beyond the well-loved \"so bad it's good\" bar and gone down to something much, much worse."
    },
    {
      "rating": "7",
      "text": "\"Its a Versace\" Nomi sums it up herself nicely. Also deserves at least a six out of 10 for being six points better than the atrocious Striptease."
    },
    {
      "rating": "7",
      "text": "Not to be taken to serious. It's a very clean T & A movie. This movie will be a classic!!"
    },
    {
      "rating": "2",
      "text": "Showgirls is a prime example of a movie that doesn't really get anything right with a story-line never really goes anywhere, direction that is all over the place and a terrible central performance from Elizabeth Berkley.\r If you're really desperate to see lots of topless women then this might be for you, otherwise just avoid it completely."
    },
    {
      "rating": "3",
      "text": "I really watch the movie on TV and it nearly killed Elizabeth Berkley's career for good reason. Sure, Showgirls is a cult classic, but some critics find it obscure why NC-17 films can't even make it to a major wide release unless it's still an R-rated raunchfest. I'm definitely agree with the critics including the late Roger Ebert. Showgirls was like the soft-core erotica of the 90's with little known but finds very unsatisfied for horny men wanting to show a little bit of nudity and some rape scenes and finds itself on the VHS bargain bin. I still hate this movie. I hate the acting, I hate the script, I really hate it when they added nudity. Nobody wants to see that mess. How come a RoboCop director directed this stinker, anyway?"
    },
    {
      "rating": "5",
      "text": "While Elizabeth Berkeley looks incredible, the movie would have been better had she actually looked like she was enjoying what she was doing. Other than that this is a guilty pleasure. The kiss between Elizabeth & Gina Gershon is up therer with the best lesbian kiss in a movie."
    },
    {
      "rating": "5",
      "text": "This is one of those so-bad-its-good films. This film was meant to be Elizabeth Berkley's big break after 'Saved by the Bell', but really it killed her career. I would have to say this film has everything; bad acting, nudity, a high budget, sex, violence and a lesson learned. The most expensive exploitation film ever made."
    },
    {
      "rating": "8",
      "text": "This is not a 'good' movie. It was not designed to be. It is designed to be an exploitation movie about exploitation in the entertainment industry. In typical Verhoeven style, the amps are at 11. The irony is so thick it is too obvious to miss. Or is it? Apparently most critics missed it and took the film for what it seems to be at face value. Irredeemable.\r When taken for what it actually is the critics of the movie still have some points. It is not great, the pacing is off at times and certain scenes and dialogues fall flat. But the bad reviews were never really about that. The film was butchered for its perceived message and they got this wrong. Ultimately, the film is pretty entertaining and it is a great social commentary. I would recommend watching it."
    },
    {
      "rating": "9",
      "text": "Back in 1995 Paul Verhoeven (Basic Instinct) unleashed his criminally misunderstood high trash masterpiece. I remember I was 16 when it came out and I was only allowed to see it because I worked at the theater. I was quite popular in school because I would sneak my friends in with me. I had no idea how much the film would make an impact on my life. From my humor to my writing, my dancing and the way I view films in general. Now don't get me wrong the film is indeed bad in almost every fathomable way. From its ridiculously over the top performances to the ultra cliched storyline and odd directorial touches. The film centers on Nomi played by a perfectly ferocious Elizabeth Berkley (Saved by the bell) who lands in Las Vegas in hopes of becoming a professional dancer but ends up in a seedy exotic club. But after a series of events she lands in a big, topless show at the Flamingo. And before she knows it shes thrust into a dark world of ambition where everything is for sale. What makes the film so great is the intensity in which everything is delivered. Because it takes itself so seriously it's easy to enjoy the unintentional funnies. Of which the film is filled with along with lots of nudity, sex and even a crazy fight scene. It's a soap opera on cocaine with Red bull thrown in. There will never be anything else like it and that's why it's one of my favorite movies.Budget: $45MBox Office: $37.8M9/10"
    },
    {
      "rating": "0",
      "text": "The plot is incomprehensible, the acting is poor and it's incredibly un-sexy. The worst film I've ever seen."
    },
    {
      "rating": "10",
      "text": "I am first of all going to point out what everyone else so has failed to do. Which is, point out that this film is LOADED with feminist ideas. It's worth noting that the only positive review by an actual critic is also by a woman. Coincidence? My basic contention is that this film is merely masquerading as a high-camp sexploitation \"comedy\" (I didn't find it that funny). Instead, I found myself mostly admiring the protagonist, and at the point where your sympathy begins to wane, the film skillfully manipulates you once again back into that position. In a sense, this woman is a precursor to Joss Whedon's relaunch of Buffy, only this girl is more vulnerable, 'damaged', real.  Secondly, if this really were a \"man's\" film, would literally EVERY single man in it be a giant sleezing, exploitative, repulsive d-bag? There is literally not one straight man in the film who is not completely abhorrent. Chris Katan has a brief scene as one of the gay male dancers, and all he does is make fun of another guy for being chauvinistic. And never are any of them 'forgiven' or presented sympathetically for the viewer to redeem.\r• People are making the mistake that this film is supposed to be 'erotic'. It's not about eros, it's about exploitation, especially male exploitation of women—but not for the film. You'll notice that all the breasts and sex in the film function not to titillate the viewer, but to illustrate that every single one of them are doing this for economic advantage and are part of an exchange process.  The film's protagonist is struggling to stay above what is regarded socially as the lowest rung of this economic ladder, and her attempts to hold onto dignity and respect are almost microcosmic precursors to the Slutwalk movement which demands the same thing. Furthermore, as a Canadian viewing this film, I find it particularly ironic the continual condemnation by critics of the prevalent presence of breasts—which, here, are perfectly legal and uncontroversial. Already armed with this disposition, it was perfectly obvious that they aren't there for me, the viewer's enjoyment—they're there because these are women who are *working* in an environment which demands it, and this film is about the difficulty existing in such an environment.  Now, I would never actually give this film a \"10\"—but I am, for the purposes of improving its Metacritic rating, which I think is quite low. Oh, and at 2hrs11min long, really: would a  be that long? Think about it."
    },
    {
      "rating": "10",
      "text": "The authentic guilty pleasure."
    },
    {
      "rating": "6",
      "text": "I am not comfortable calling Showgirls a bad film. I derive far too much enjoyment from its misguided attempt at drama to judge it so harshly. No, its not fair to call Showgirls bad, but I think â"
    },
    {
      "rating": "1",
      "text": "Showgirls is a 1995 film directed by Paul Verhoeven (Total Recall). All basically this film is is nudity, dancing, more nudity and naked women and a film that drags and drags with horrible dialogue and weak acting. This film is so bad it's easily one of the worst films ever made. It's tacky and even the sex scenes look rubbish and neither the sex scenes or nudity can save it. A film for adults only due to strong sex scenes me nudity but this film is so bad and so crap.  Real stinker."
    },
    {
      "rating": "6",
      "text": "It's a real guilty pleasure with crappy acting from every actor in this movie."
    },
    {
      "rating": "10",
      "text": "i thought it was a pretty good movie,don't listen to the haters....i never knew of this movie until my sister told me about it,i was hesitant at first to watch it honestly but when i did,i enjoyed it one of the best erotic movies i have ever seen in my life....i constantly watch it from time to time."
    },
    {
      "rating": "10",
      "text": "Time for a total re-evaluation. Yes, SHOWGIRLS is a cult camp classic but it is also a serious meditation on  the American obsession with money, power and sex, and how the three are inexorably intertwined in our decadent, vulgar, and puritanical culture. SHOWGIRLS beautifully creates a frenzied environment that could only exist in the whorehouse known as Las Vegas. SHOWGIRLS is as American as an apple pie in the face with a brutal series of final scenes that totally spoil all the fun. That's intentional too and makes for a brilliant sort of satire of \"America\" with a capital \"A.\""
    },
    {
      "rating": "9",
      "text": "A cult Classic, much better then you think. Don't make the mistake to take this film to seriously."
    },
    {
      "rating": "10",
      "text": "This movie is great. Who doesnt love sex and nudity."
    },
    {
      "rating": "5",
      "text": "\"Showgirls\" is not nearly as bad as you might think; what it lacks in screenwriting it makes up for in gratuitous nudity. A peep show on the silver screen."
    },
    {
      "rating": "5",
      "text": "The movie was okay. I liked the asthetic of the whole 90s Las Vegas scene and it's not a boring movie; just a very poorly acted, directed, and written one. The only pretty well acted role was Gina Gerson (Cristal Connors) but Elizabeth Berkleys acting was painful to watch. Some plots were very unnecessary (Nomi and James relationship), cringeworthy (Nomi and James dance scene), and unsettling and extremely hard to watch (Molly and Andrew Carver scene). The nudity in this movie is definitely shocking now so I can't even imagine how shocking it was when it was in theaters. Showgirls is like a car wreck; such a disaster that you just want to see what happened. Not the worst movie but DEFINITELY not the best. Don't take this movie seriously; think of it more as a comedy. That's what Elizabeth Berkley should have thought."
    },
    {
      "rating": "8",
      "text": "Cited by some as one of the worst films of all-time, Showgirls' reputation has improved markedly in the past few years. From being accepted to \"so bad it's good\" to a \"guilty pleasure\", the film has now received a critical re-evaluation. Many critics and directors have come out and defended the film as a brilliant work of satire, which it most certainly is. Famed critic Jonathan Rosenbaum has praised it as an allegory for selling out in Hollywood. While it most certainly could be an allegory and is a satire, I believe that Showgirls is most closely aligned with a critique of the sex industry. Showing girls selling their bodies as hookers, strippers, and showgirls in seedy Vegas hotels, Showgirls is a full bodied critique of the sex industry. Derided as misogynistic and exploitative trash, Showgirls is certainly both of those, but it has to be in order to show the dark repercussions of the industry.As an erotic drama, the film was criticized for not being erotic enough. Yet, that is entirely the point. The film starts off somewhat erotic, but by the end, we see the dark rewards reaped by eroticism and the warped perception of women that men have. As these women snap off their tops without prodding, men walk away with the belief that they own and possess the female body. It is their personal playground to do whatever they like. Men such as Andrew Carver (William Shockley) emphasize this with him raping a girl towards the end of the film. He could have had sex with her anyways. She was definitely going to, but he likes the power that comes with ownership. He feels as though he owns women and is unwilling to cede this control. By letting her make a consensual decision to sleep with him, he concedes that she is his equal and well, in the world of the sex industry, that is simply not allowed. Women exist solely for our entertainment and to reveal their breasts while dancing is their only contribution to society. Dark, exploitative, and unflinching in this depiction, Verhoeven shows the horrors that the sex industry breathes. It feeds into the rape culture that plagues our nation and asserts that, yes, women are nothing but male playthings.However, it can become even more horrifying. The protagonist, Nomi Malone (Elizabeth Berkley), meets a man named James Smith (Glenn Plummer) early in the film. James is hardly a good guy and definitely exploits women sexually throughout the film. Yet, he does hit the nail on the head in one conversation with Nomi. He argues that places like strip clubs are alright, because they do not lie to you. The women are selling their bodies and the men are buying. It is erotic dances in a Vegas hotel, such as the show \"Goddess\" that Nomi wants to be in, that are bad. They pretend they are art and the patrons pretend they want art, but instead they give you the women's bodies anyways. It is lying and still just as exploitative. This is certainly true of the shows at the Stardust Hotel, in which the show solely consists of women ripping off their tops and dancing half-naked. This parallel is revealed by Zack (Kyle MacLachlan) when he reveals Nomi's past. A former hooker who only cost $50-$100 a pop, Zack tells her that she has low self-esteem and sells herself short. Yet, hooking is still very much her job, she just does not have sex with patrons anymore. From stripping at the Cheetah to dancing at the Stardust, the save product is for sale: her body. The only difference is that the line of work she does now is legal. The show also shows itself to be exploitative with the girls being propositioned for sex by workers at the hotel to satisfy important customers and famed Vegas showgirl Crystal Connors (Gina Gershon) being dumped to the curve after an injury. Once they are done with you, they will throw you without hesitation. But, it is almost preferable to when they do want you, as they treat you as a sub-human sex toy.The film cements itself as a critique and satire of the sex industry with a sign outside of James' apartment. Reading \"Jesus is Coming Soon\", this simple sign is a call for help from the sex industry. Having seen Sodom and Gomorrah destroyed for the same antics as those found in Las Vegas, it is a warning to heed the word of the Bible before it is too late. Exploiting women's bodies for over-stimulation and titillation is putting the city and the people in a hand basket destined for Hell. This also drives at why the film is not supposed to be erotic, but rather exploitative. Verhoeven rips open blouses repeatedly to show you the horror of the situation these girls find themselves in. Though they may be smart or talented, their only value is their breasts and there seems to be solemn knowledge of this fact possessed by the women. Yet, this knowledge is juxtaposed by an urgent warning to shape up and repent as Jesus will soon arrive and Vegas will most certainly be left behind."
    },
    {
      "rating": "8",
      "text": "Paul Verhoeven is one of the most 'out there' directors of his generation. In a career spanning multiple genres, when you see his name attached you just know it will be a film that will cause discussion.\rShowgirls is definitely a film that, in the 20 years since its release, has resulted in some fairly heated discussions!\rThe genre of the film is hard to define, but it's clearly a much deeper and thought provoking movie than what the contemporary critics would have us all believe. The sheer amount of female flesh on-screen, coupled with some hilarious dialogue and, most strikingly, Elizabeth Berkeley's incredibly 'all or nothing' performance, lead everyone to overlook what the actual moral of the film's story is.\rIt's clearly not something designed to be the height of intellectual film-making, but there is a scope to the narrative that the visuals are meant to override. To me, that's genius. Verhoeven subverting the audiences perceptions, making you leave the cinema wondering if the film is just a vacuous skinflick, or a moral tragedy that just happens to have a lot of exposed breasts on show, as well as the most hilarious sex scenes ever filmed!\rTo me, it's not a surprise the film has been reevaluated in more recent times, and has become a staple for film-making students to review and analyse.\rIn the grand scheme, it's not an amazing movie. But from the perspective of someone (everyone) trying to understand what Paul Verhoeven was trying to achieve and express.... It's absolute genius movie-making!"
    },
    {
      "rating": "5",
      "text": "like driving past a car wreck on the highway, you can't look away. a guilty pleasure, perfect for those snow bound days. great for the whole family . . . especially the crazy ones."
    },
    {
      "rating": "1",
      "text": "If I had a dollar to every time some sort of immature adult watch this women-infested movie, I'd earn the exact amount of money this movie earned at the box office. Children, don't watch this. This NC-17 rated movie has been the worst NC-17 movie and one of the worst movies to watch on your movie break."
    },
    {
      "rating": "7",
      "text": "Good, not an oscar movie but does not deserve all the hate.It's one of those movie that improve with a second view.I watched it ages ago (when i was younger) and I didn't like it ... I made fun of it: Like many  I was looking more at the beautiful naked girls that other things.But I watched it today and I find it much better ... maybe I was too young to understand it.It's a serious drama that put some light on the \"dark parts\" of show business.This movie is satire, is harsh, is visuals, is unforgiven ... like many other Verhoeven Film.I know it's a long shot but it's kinda like Robocop ... you can think of robocop only as an old campy-sci-fi action movie or you can see the drama, innovation and social subtext in it ... and enjoy it more.I liked it, give it a try"
    },
    {
      "rating": "10",
      "text": "NÃO ACEITO O FLOP E O MASSACRE DESSE FILME, INJUSTIÇADO MERECIA SER RECONHECIDO"
    }
  ]
}