{
  "id": 779,
  "title": "Shrek Forever After",
  "starring": [
    "Mike Myers",
    "Eddie Murphy"
  ],
  "runtime": 93,
  "genre": [
    "Comedy",
    "Adventure",
    "Fantasy",
    "Animation",
    "Family"
  ],
  "description": "A bored and domesticated Shrek pacts with deal-maker Rumpelstiltskin to get back to feeling like a real ogre again, but when he's duped and sent to a twisted version of Far Far Away—where Rumpelstiltskin is king, ogres are hunted, and he and Fiona have never met—he sets out to restore his world and reclaim his true love.",
  "releaseYear": "2010",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6HrfPZtKcGmX2tUWW3cnciZTaSD.jpg",
  "categories": {
    "plot": 5.111111111111111,
    "acting": 6.142857142857143,
    "ending": 7.125,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.4,
    "funny": 5.0,
    "action": 6.666666666666667
  },
  "reviews": [
    {
      "rating": "6",
      "text": "So it's not a wonderful life; so they lied. Lying awake at night, Shrek, a husband and father of triplets, undergoes an existential crisis, as Fiona sleeps soundly, oblivious to the paradox that vexes her domesticated spouse, who misses the ogre condition of alienation and veneration. The sheer awe that Shrek's size and stature commanded from the townsfolk, in hindsight, so he thinks, was adequate compensation for his lonely bachelor life in the swamp. The marital bed, suddenly a coffin instead of a haven, inspires Shrek to take out a \"Wanted\" poster, the highlight of his outlaw notoriety, from the dresser-drawer and affixes the ephemeralia to the mirror, creating a jarring disconnect with the ogre's reflected self. Shrek realizes that he's half an ogre; his resentment lies in incubation 'til the next day at the birthday party, where he reveals his true colors. In the 1947 Frank Capra classic that loosely informs \"Shrek Forever After\", George Bailey(Jimmy Stewart), the stabilizing force of Bedford Falls, matches the ogre's disenchantment with being a household patriarch, in the housewarming scene where Mary(Donna Reed) gives her wanderlust husband a knitted picture that reads: \"George lassos the moon.\" Like the lunar surface, Shrek can be his own man in the swamp, lonely, but away from the pressures of being a husband and father. In the Capra film, Mary doesn't realize the double-edged significance of the moon; she sees the sphere as merely a romantic object, and not an object of despair, the final outpost for George's wandering spirit. Like \"It's a Wonderful Life\", one wish made in haste and self-absorption transforms a town and its people for the worse. Rumplestilskin's rave hints at the noirish qualities of Pottersville, since a rave promotes bacchanalia and in this instance, a means of institutional control. The witches turn into good-time party girls as FarFarAway Land becomes a fertile ground for intolerance and nihilism."
    },
    {
      "rating": "10",
      "text": "So underrated. Maybe its only me, but I liked this one more than any other in the series,  and i cant see any better way to end the series than this one."
    },
    {
      "rating": "7",
      "text": "Although Shrek Forever After's story seems like a rehash of the first film, it's spun in such a way to make an overall success. It falls short of the first two films, but it's an improvement over the third."
    },
    {
      "rating": "7",
      "text": "Hm, nice movie, great animation and stunning sound. A bit slow for the moments but overall experience is pretty cool. So it was pleasure watching it though i hope this is the last part. Enough is enough:)"
    },
    {
      "rating": "5",
      "text": "The new villain, Rumplestilskin, is what really helped make this Shrek better than it could have been. Shrek is tired of his life as a harmless ogre and wants to be like he was before he met his friends, so he makes a deal with Rumplestilskin and his life changes exactly like that, with a lot of dislike for this new life. Beware of a dissappointing ending that makes the Shrek series leave too soon. Other than the ending, I think you'll have reasons to enjoy Shrek Forever After."
    },
    {
      "rating": "8",
      "text": "E se encerra a franquia Shrek,que deixa saudades. Termina muito bem,com um bom desfecho,mas não tem tanto gás,e isso atrapalha um pouquinho. Shrek aprende a lição de sempre amar as pessoas ao seu redor,e assim termina dignamente."
    },
    {
      "rating": "6",
      "text": "Despite ripping off Its a Wonderful Life, it still manages to be way funnier, and way more interesting than the third movie because it doesn't drag on, isn't boring, and feels like they actually wrote something. Overall Forever After is just okay."
    },
    {
      "rating": "6",
      "text": "Shrek Forever After may not being great as the first two Shrek movies, but i better that Shrek the Third. The characters are funny, the story is okay, the animation is nice, the comedy is good but what i really like the most is the drama and the emotional scenes. In this movie, you really feels bad for Shrek for lost all his friends and family that he has. Even that the message is too simple, it doesn't change the fact that it still being a good movie. Is not perfect but it doesn't need to be. I'm glad that the writers really follow the continuity of the first movie, and this defiantly is a check this out."
    },
    {
      "rating": "6",
      "text": "You get this feeling to why Shrek has to end. You get this feeling that it deserved to end after what Shrek the Third done to the franchise. Thing is... it's a story that'll forever end Shrek."
    },
    {
      "rating": "8",
      "text": "Una muy buena película e infravalorada. La historia dio un cambio algo brusco, volviéndose un poco mas seria. Si bien no me gustan mucho los nuevos personajes, la historia te mantiene enganchado y preocupado por lo que le llegara a pasar a Shrek."
    },
    {
      "rating": "7",
      "text": "A better sequel than Shrek 3 that's for sure!It has a cool villain and side characters, so that's an improvement compared to Shrek 3, where characters are annoying, especially the princesses."
    },
    {
      "rating": "8",
      "text": "This movie is remake of the first one, but at the same time shows us how much could have changed and how much the characters changed through the series, yes it is not Shrek 2, but it also isn't The Third."
    },
    {
      "rating": "10",
      "text": "Didn't blow me out of the water, but there is a reason that this is called the true 3rd Shrek movie- it is leauges better than the third movie and had some pretty cool and orginal ideas. Has a harder time standing up on its own without Shrek 1 and 2, but Shrek 3 drowns regardless of support. I'm really here to boost Shrek 4's reviews to make it better rated than Shrek 3"
    },
    {
      "rating": "10",
      "text": "It has the best 2 lines ever spoken by Shrek in the franchise, one is in the climax and other is right at the end, and the movie did a perfect job to build up the delivery for those 2 lines, I couldn't think of a better way to end the franchise."
    },
    {
      "rating": "9",
      "text": "Shrek 4 was awesome! Definitely one of the most satisfying movies of the summer so far. Enjoyed it from beginning to end. And if it is the last Shrek movie, it serves the series proud. I'd proudly own Shrek and Shrek 4."
    },
    {
      "rating": "8",
      "text": "I watched this with my family and we all thought this movie was great. The funniest of all the Shrek movies and I genuinely enjoyed this movie. Good way to end a memorable series."
    },
    {
      "rating": "4",
      "text": "\"Shrek Forever After\" has permanently changed a funny, pure franchise into a greedy one craving for money. Nice work, Dreamworks..."
    },
    {
      "rating": "6",
      "text": "yeah it wasn't horrible.   it was a good way to say goodbye.    it was entertaining to me.  but its not shrek.  or shrek 2.    so yeah 6 out of 10 its a solid movie.   its watchable."
    },
    {
      "rating": "10",
      "text": "shrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love"
    },
    {
      "rating": "7",
      "text": "One of the reasons this was so good was because it was so much better than the disastrous Shrek 3. Obviously, it's not as good as the series' first two entries, but, unlike it's predecessor, Shrek Forever After manages to retain the fun and wit of 1 and 2."
    },
    {
      "rating": "7",
      "text": "It's not as clever as the first two installments in the franchise, but this newest Shrek doesn't feel like is was cranked out as fast as possible for a quick buck. It's witty and well-written."
    },
    {
      "rating": "7",
      "text": "A lot of the pop culture references are gone, and much of the charm in the world of Far Far Away. However you do not always need charm to make a good film. There is much more emotion (crying and yelling) in this film, and less comedy, but the strong moral message that is the heart of this film glows warmly, and so even if it can't produce the thrills of both 'Shrek' and 'Shrek 2', it is still a huge improvement on 'Shrek 3', and provides an emotionally satisfying and enjoyable conclusion to what is a classic animated series. I am glad that it finished on a good note, despite my low expectations."
    },
    {
      "rating": "6",
      "text": "In the fourth and final chapter, the animated Shrek series recovers the sense of mischief it lost in Shrek the Third. Yes, it helps that this one is in 3-D – the real deal, not a retrofit – that makes the action pop. But it's the characters that pull us in when familiarity flatlines our interest.  The plot gimmick involves husband-and-father Shrek (voiced by Mike Myers with just the right blend of mirth and malaise) feeling frustrated that his days as a fear-inducing ogre are over. So he makes a deal with Rumpelstiltskin (an ingeniously nasty vocal turn from DreamWorks Animation story editor Walt Dohrn) that tricks him into an alternate universe where he doesn't know his wife, Fiona (Cameron Diaz), his friend Donkey (Eddie Murphy) or fat-cat Puss in Boots (Antonio Banderas). It's a fun ride. What's missing is the excitement of a new interpretation."
    },
    {
      "rating": "8",
      "text": "Shrek Forever After is a great return to the Shrek series Shrek Forever After is about Shrek his life he is getting tired of and bored of so he gets angry at a party and finds someone stuck saves them but then gets carried away and Shrek wants to go back to old ways so Rumpelstiltskin gives it to him so he can go back to those days but there is a catch to it while Shrek did not know that at first So Shrek Forever After is a good ending to the series but I still want more tho anyway everyone is good I believe that Rumpelstiltskin is the best villain in the whole series at first I did not like this entry to the series I start to respect this movie now it is great what they were trying to do and succeed what they were achieving but I don't donkey that much and Puss in Boots there are weak in this entry of the series so all round a good ending to the series that I miss a lot so I give Shrek Forever After a B+"
    },
    {
      "rating": "8",
      "text": "It wasn't as good of a finale as I hoped from Shrek, but it definitely showed us again why we loved Shrek so much by bringing back the heart and most of the charm and some great 3D and animation. I give this movie 80%."
    },
    {
      "rating": "9",
      "text": "This installment, the best after Shrek 2, is everything, especially the Shrek-Donkey relationship is exceptional.\rA worthy and delirious final chapter to this animation franchise.Wish there would be more in future- will be truely missed!"
    },
    {
      "rating": "9",
      "text": "While not good as Shrek 2, I really enjoyed this Shrek, even more than the first one. I really am glad they got rid of the Arthur character, since he was the weak point of Shrek 3."
    },
    {
      "rating": "10",
      "text": "While not good as Shrek 2, I really enjoyed this Shrek, even more than the first one. I really am glad they got rid of the Arthur character, since he was the weak point of Shrek 3."
    },
    {
      "rating": "7",
      "text": "While it's not the best in this series it's a great way to say goodbye, some fans may be disappointed with the more serious story and the lack of humor (don't worry it's still got jokes just not as many) but I was surprisingly impressed, a good farewell to this series."
    },
    {
      "rating": "8",
      "text": "Satisfying End For ShrekCertainly A Big Improvement On Shrek The Third, The Characters Aren't at Their Absolute Best, But They Are Well Done. The Animation Is Clean, The Humor Is Funny, And The Ending Is Heartwarming."
    },
    {
      "rating": "6",
      "text": "Shrek Forever After was the movie that did not need to be made that being said ti was not all that bad. The voice acting was good, there were some decent jokes, the characters still had their charm, and the animation was still good. Plus, I kind of liked the villain and the Pied Piper. However, this film is still the weakest in the series. The plot feels forced and clearly an excuse for another Shrek movie. Did not feel sad when this one ended. Maybe if the film had more throwbacks to the previous films I'd care more but as the film is it is just ok. While Shrek Forever AFter was clearly a money grabber and no where near as good as the first to/three it still has some charm and will entertain Shrek fans."
    },
    {
      "rating": "7",
      "text": "One of the best animation movie !!! A little bit complicated to understand for kids,but it's a great entertainment ! I had a very great time to watch it with my kids."
    },
    {
      "rating": "4",
      "text": "The jokes at this point are forced and feel very plastic. The dialogue doesn't flow as it did in the first film."
    },
    {
      "rating": "7",
      "text": "Let's face it: the \"Shrek\" franchise has jumped the shark. After two fantastic entries, the third film was less-than-stellar, losing the charm that made its predecessors so amazing. Now, the fourth one trots along (to the chagrin of some filmgoers) and touts itself as the \"final\" film in the series (though, of course, the recent announcement from DreamWorks that \"Shrek 5\" is being developed and planned for release in 2019/2020 renders that point essentially moot). How does the series end off? Well, pretty well, all things considered. Let's get it out of the way now: \"Shrek Forever After\" definitely feels like a retread. It's not the most original story in the world, and that might contribute to the notion that the franchise has lost its way. That said, it's still wonderfully animated, considerably charming and humorous, and it features some great, entertaining characters, ranging from great returning characters to exciting new characters (such as Rumpelstiltskin). Sure, the \"Shrek\" franchise may have lost its way, and it's no longer the animated juggernaut that it was in the early 2000's, but overall, \"Shrek Forever After\" is a considerably entertaining romp that the whole family can enjoy."
    },
    {
      "rating": "5",
      "text": "It all felt like filler. It's like someone wrote a fanfic epilogue and Dreamworks decided to animate it. The gags weren't nearly as inventive as the first 3 and Shrek without fresh humor is well, hollow.\r However, I really enjoyed the idea of Shrek coming to terms with uneventful fatherhood and settling down. I guess the franchise could've ended worse."
    },
    {
      "rating": "6",
      "text": "Here I add the last movie of the Shrek saga. \"Shrek Forever After\" a fun movie , romance a little boring but the fact very good, hope to remind our favorite ogre and his friends."
    },
    {
      "rating": "10",
      "text": "perfection meets steve buscemi, and jeff goldblum-dr phil-mahatma gandhi"
    },
    {
      "rating": "2",
      "text": "If your clever enough to make sequels of a film youll now that repeating the same storyline of a film will drastically change the critic and users reviews but not that case with this film it was way overrated. what really pissed me off was that this film was so bad not just because the story line repeated itself but because it itself was not prepared long enough and not thought through enough i wasted my money and was fuming with rage when i left the cinema plesase do not watch"
    },
    {
      "rating": "2",
      "text": "The only thing Shrek lives on now is the ripped off money of stiff parents and the tears of kid's who whine morbidly and begged to see this movie. Which is why it gets the \"two\" on the scale. Shrek had jumped a more humiliating ship than Freddy Kruger or Jason Vorhees. To add insult to injury this might not actually be the last Shrek in existence. Yet again, as if it was not clear already, promoting a childs movie through potty humor does not develop a good comedic skill. The last Shrek already comprised of limitless vomiting and diaper drama. What makes this movie shape the humor off tone is the blatant oral sex joke involving the donky and puss in boots. Cue that some cannot even say \"puss\" without the \"y\" anymore. God forbid the next Shrek could show an \"unintentional\" orgy involving the knights and princess feona."
    },
    {
      "rating": "7",
      "text": "Shrek, Shrek 2 and Shrek 3 were great. However, Shrek Forever after is starting to show franchise burnout. I don't blame them for making more movies after the first three highly successful ones, but this latest one was just not as funny as the others. Its hard to make multiple movies over a single good idea I think. Shrek Forever After was not a bad movie at all, but it just wasn't as funny as the first two, it was just mediocre."
    },
    {
      "rating": "5",
      "text": "This installment in the 'Shrek' series still maintains the comic validity of the previous three, and has a few moments which set it apart from the others, but much of what was wrong with the third is still present in this one."
    },
    {
      "rating": "7",
      "text": "wasn't as good as the previous three movies, but its a perfect way to end one of the greatest animated trilogys of all time."
    },
    {
      "rating": "0",
      "text": "This movie doesn't have anything good. Not even anything decent. It's pure garbage."
    },
    {
      "rating": "0",
      "text": "After watching a series of unforgettable movies with charming characters, music, story, and graphics, I would have never expected \"Shrek\" to be going downhill. The plot involves Shrek wishing he had never saved Fiona from the tower in the first movie (can't remember why), then this weird dude comes in an puts Shrek in a time period in which the events of the first movie didn't happen. He is then seeing what would've become Fiona, Donkey, and Puss in Boots. I can't remember what happened after that, but I do not intend to watch that junk again. All I remember saying after watching that was: \"Well that sucked!\". Shrek as a series is now as good as dead, thanks to this movie."
    },
    {
      "rating": "0",
      "text": "This crap of movie just completely ruined one of the best animated franchises ever made. The movie is a complete mess does not makes sense and is an insult to the first three movies. I would rather that this crap wouldn't have been made and I do not intend to watch this horrible movie again"
    },
    {
      "rating": "0",
      "text": "A horrible ending to a downhill series of Shrek movies. The film is not funny anymore unlike the previous movies. The whole story just pissed me off. I gave a 1, not a 0, because of its graphics. But still, it's definitely a terribly bad movie.............."
    },
    {
      "rating": "10",
      "text": "This is a real breath of fresh air. Gone are the oh-so-hip jokes, the pointless pop culture references and double-meanings aimed at adults. In their place is a pleasing fable of love, family and the compromises we all make. The second act sags slightly, but overall this movie is a worthy sequel to the first one and almost makes me forget the wretched #2 and #3."
    },
    {
      "rating": "2",
      "text": "Shrek Forever After is nothing like Happily Ever After for SUCKING! The story is completely mess,it has the same story,same issues,same plot holes,nothing make sense,the only difference is the new plot  is about the evil Rumpelstiltskin wants Shrek to took away everything and wants to rule the kingdom and it doesn't reveal anything from the forth one,they shouldn't been done since the last third one. THAT DOESN'T MAKE SENSE,WHY DID THEY SCREW UP EVERYTHING! The Rumpelstiltskin character is completely useless and he doesn't look like that I've just saw. Why does Shrek has to come back that way he is? I just don't het it? The scenes are just nothing like that and screws up everything even more. I just one another Shrek film could be next step or should be over right now,but NO they just want Shrek to screw up the franchise. So that's that,Shrek film is done and they said that they will make another Shrek film and I just thought that I will say that Shrek needs to retire the franchise and I feel that Shrek needs a break."
    },
    {
      "rating": "6",
      "text": "\"In my opinion this latest and hopefully FINAL! chapter it gets boring , and unfunny , its hardly worth anyone's time , the character we all know and love , has well lost its charm , but i love seeing all the characters back , and for that i say Rent It\" .. C+"
    },
    {
      "rating": "7",
      "text": "Although I love animation, I've never been a fan of the Shrek franchise.  This movie took me by surprise.  The first Shrek movie was good (not great) thanks to Eddie Murphy, but Shrek 2 was awful.  I never saw the 3rd installment.  I've never liked the weird Irish accent for Shrek that Mike Myers provides.  It doesn't fit for me and I find it distracting.  Why is he Irish when nobody else is?  My friend talked me into going to see this one and it turned out to be a good animated movie - maybe even the best of the Shrek movies.  The script is WAY better than Shrek 2 and had some good laughs and good animation and it held my attention the entire way.  The 3D was good, not great, and probably not worth the extra cost, as 3D mutes the colors due to the dark glasses."
    }
  ]
}