{
  "id": 801,
  "title": "Shrek the Third",
  "starring": [
    "Mike Myers",
    "Eddie Murphy"
  ],
  "runtime": 93,
  "genre": [
    "Fantasy",
    "Adventure",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "The King of Far Far Away has died and Shrek and Fiona are to become King & Queen. However, Shrek wants to return to his cozy swamp and live in peace and quiet, so when he finds out there is another heir to the throne, they set off to bring him back to rule the kingdom.",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/n4SexGGQzI26E269tfpa80MZaGV.jpg",
  "categories": {
    "plot": 4.703703703703703,
    "acting": 4.6875,
    "ending": 4.75,
    "soundtrack": 5.5,
    "cinematography": 5.0,
    "familyFriendly": 5.833333333333333,
    "funny": 5.0588235294117645,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Alright, unlike with Spider-Man 3, this time I actually agree with the critics. What a disappointment Shrek The Third was. The first movie was a brilliant and charming spoof of Disney cartoons and fairy tales and was really fun for anyone, even older audiences. Shrek 2 left a little bit of that behind but still delivered a great and charming movie for all audiences. Maybe it's the loss of series director Andrew Adamson (who is now working on the Narnia series) but Shrek The Third feels different from the first 2 almost immediately, and not in a good way. Almost immediately, the humor feels forced, and the movie almost seems to be aimed at a much younger audience than the first 2. This movie is so tame and sugary, in fact, that it often ended up feeling just like the Disney movies the series was originally spoofing. This becomes even more clear when a \"message\" is blatently delivered to the audience at the end of the movie. The plot is entirely mediocre, Donkey and Puss seem to have nothing to do, (and the filmmakers, as if realizing this, half-heartedly threw in a pointless character switch, I guess in a failed attempt to keep these characters interesting) and Shrek himself is really just a boring character this time around. Although this movie is definitely aiming only for the kiddies (whereas the first 2 Shrek movies were definitely for all audiences) some attempts at \"adult jokes\" and out-of-place licensed rock music was halfheartedly thrown into the movie and feels entirely out of place. Yes, there are a couple funny moments here, but they were almost all given away in the trailers and commercials. (I hate it when they do that.) Much of the humor felt very forced, and even the audience I saw this in (which contained plenty of little kids) let plenty of jokes fall flat. (Although they enjoyed all the fart jokes thrown in at the end of the movie.) Of course the animation is very nice, and as I said, a couple jokes hit and are pretty funny, but there's really no reason to see this. What a disappointment. The makers of these movies have completely forgotten why these movies were made to begin with and what we ended up here was a boring, mostly un-funny, and very forced mess."
    },
    {
      "rating": "8",
      "text": "This movie is being unfairly panned. All I will say is this: I saw this yesterday with my wife and our four year old and all three of us laughed all the way through. Not sure what standard people are holding this up to. This is a very good movie."
    },
    {
      "rating": "5",
      "text": "Clearly the series has lost it's momentum. There are a few moments that provide genuine laughs, but overall the movie didn't really seem to have any new ideas or bring anything new to the table. Basically just a rehash and celebration of things that worked in the first two movies. At least it was relatively short."
    },
    {
      "rating": "6",
      "text": "Not a great film and only mildly entertaining. Plot and characters begin to dry up and only the scene where the Ginger Breadman has a flashback remain in my mind. It will not be the Shrek film that will be remembered. That will be 1 and maybe even 2 but it will still keep the children entertained even if the adults get a little bit bored."
    },
    {
      "rating": "4",
      "text": "\"Shrek the Third\" is a tiresome and unoriginal sequel, with its loss of heart, wit, and charms that made the first two films enjoyable. With its pop culture references trying so hard to bring humor in to the film, \"Shrek the Third\" feels very hectic at times, with very tiring jokes that have trouble attaining much laughter. The plot feels like trying to bring new ideas and concept, but failing despite these efforts, and becoming a similar rehash of its previous films that doesn't work this time. Their formula to add humor to heart doesn't exceed this time, and leaves audiences wondering that if they should call it quits (but of course, there is a Shrek Forever After)."
    },
    {
      "rating": "4",
      "text": "Una decepcionante (e innecesaria) continuación. Shrek the third pasa de ser una gran película animada para todo publico a un intento de \"una comedia de doble sentido\" la historia es pobre en comparación a la excelente Shrek o Shrek 2, la animación es mejor, pero la comedia tuvo un bajón tremendo de calidad. Es una pena que no respetaran el mismo estilo \"comedia para todo publico\". Ok lo admito, si el guion fuera excelente, no habría problema, pero es tan ridículo y se siente tan forzado que da pena. ¿Fue el cambio de director? no tengo idea, pero lamentablemente, Shrek 3 es horrible."
    },
    {
      "rating": "5",
      "text": "I love Shrek. I think he's a great character, and his film series is excellent and witty. But Shrek the Turd – oops, I mean Third – is an unnecessary sequel that fails to reach the height of the first two. It lacks the wit and comedy that made the first entries comical, and the story feels lazy, and more like a direct to video cash-grab Disney sequel than a Shrek movie. It also had too many characters; too many to keep track of.\r However, it DID have its redeeming qualities, such as the character of Merlin (excellently voiced by Eric Idle).\r In short, this bland threequel should have been better developed, or, better yet, never made."
    },
    {
      "rating": "6",
      "text": "Well, in my opinion, Shrek the Third it was okay. Before the comments attacks me, i explain why. I know that i it is supposed to hate this like everyone else, but i don't hate it. I mean, it had problems like some of the jokes are not funny, the Shrek's Nightmare and Ginger-man Past doesn't make seances and the villain is really unnecessary, but the animation is good, the characters are okay (Except for the princess who are really funny and great characters), the story is okay and the jokes are funny. But if there is something I can agree with all the others, is that this film is the lowest of the others Shrek movies.\rIt's just that I didn't find out too bad in my case. Still, I recommend in if there's a necessary case."
    },
    {
      "rating": "6",
      "text": "I love Shrek. I think he's a great character, and his film series is excellent and witty. But Shrek the Turd – oops, I mean Third – is an unnecessary sequel that is trying to reach the height of the first two. It lacks the wit and comedy that made the first entries comical, and the story feels fine It also had so many characters; so many to keep track of.\r However, it DID have its redeeming qualities, such as the character of Merlin (excellently voiced by Eric Idle).\r In short, this bland threequel should have been better developed, or, better yet, made better. But the film is really good."
    },
    {
      "rating": "4",
      "text": "Sadly, It's Not Good :(First Off, The Pros, The Great Animation, The Voice Acting, Prince Charming Was A Decent Villain, And A Few Funny Bits. Now The Negatives, The Characters Are Now Pretty Bland, 65% Of The Jokes That Want To Be Funny Aren't Really That Funny, And The Script Isn't Very Good. I Don't Hate This Film, But It's Not Good And Very Disappointing."
    },
    {
      "rating": "5",
      "text": "\"Shrek the Third\" is a movie you would expect from a third sequel of a franchise. Yes, its decent."
    },
    {
      "rating": "10",
      "text": "I don't know what those critics are saying about the movie. There not kids, so how would they know how funny it is. Sometimes I wonder if I'm alone with that opinon, but it's true. How would those paid critics know about how good the movie was. Me, I'm twelve and trust me, it was a so-so movie, but still made my friend and my dad laugh. I really don't agree with the critics in red because they're not kids, we are, and you know what?! I loved that movie. Any Shrek movie do for me. I was expecting to laugh more, but I still laughed no matter what those paid people say about a movie. The movie was good and thats all what counts. You just have to trust me. Go watch the movie, then go to the reviews and you'll see how wrong they are about the movie. Go watch it and you won't be sorry. The critics are just embarrassed that it's like Hollywood. Go watch it. Trust me."
    },
    {
      "rating": "7",
      "text": "The movie wasn't terrible, it just wasn't anywhere as good as the first two, especially the second movie, which is my favorite in the series. Most of the cons came from Justin Timberlake's character."
    },
    {
      "rating": "5",
      "text": "With its loss of heart and some of its charm it can't be good. Although it has just great animation and some moments that can be remembered. I give this movie 47%."
    },
    {
      "rating": "8",
      "text": "Really, really good. Shrek 1 was a masterpiece. Shrek 2 was somewhat mediocre. This is brilliant. The plot is better than 2, the CGI is just beautiful, and it's really funny. Bring on Shrek 4!"
    },
    {
      "rating": "8",
      "text": "The worst of the Shrek series, but it was still entertaining. Like another reviewer said, the fairy tale magic really was missing here, but the comedy packed into each part really was great."
    },
    {
      "rating": "8",
      "text": "Even tho Shrek The Third is my least fav in the Shrek entre it is still enjoyable for me I like everything going on but this movie does not feel as fresh as the first two installments Shrek the Third is about Prince Charming wants revenge pretty much and he got everything taken away from him like I said this was a solid entry into the series I don't mind it too much it is weak than the first two installments it felt fresh in those movies and all the characters are great the score and music match those movies this does not really do that which is a downgrade I like arurther and all that So I believe that this is a solid entry to the series so I give Shrek The Third a B-"
    },
    {
      "rating": "0",
      "text": "This movie is the worst movie at all times and it's mo use for dumb old dreamworks to make this movie.dreamworks animation is the worst place on earth, because it keeps on losing to disney & pixar each year."
    },
    {
      "rating": "10",
      "text": "shrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love"
    },
    {
      "rating": "0",
      "text": "Annoying, repetitive in your face humor filled with montages that give you a break from its obnoxious plot and disaster of jumbled scenes Justin Timberlake is annoying and this movie blows. I loved the first two and now they are just isolated masterpieces with no association to this piece of crap. Terrible."
    },
    {
      "rating": "5",
      "text": "It's still undeniably charming -- and funny -- but Shrek the Third lacks the innovation the first two films were shrouded in. Pros: The animation and characters remain as charming and funny as they did before. Cons: Too pop culture referential; too short; too cliched; lacks any kind of innovative spark."
    },
    {
      "rating": "4",
      "text": "The first two movies is way better than this one. Maybe because the plot in this movie is ridiculous. Though, the graphics is still good. But it is still an \"average to bad\" movie and this movie proves that third sequels in movie franchises are bad..........."
    },
    {
      "rating": "10",
      "text": "The third installment in the franchise. I enjoyed this one too. I think mainly because Puss N Boots was introduced to it, without Puss it would have probably just been Shrek 2 all over again. I do remember laughing a lot when I saw this in the theater and the group of people I was with were all laughing too."
    },
    {
      "rating": "5",
      "text": "Although the voice actors know how to deliver a fresh comedic style, \"Shrek the Third\" lacks the heart, charm and the intelligence that made the other two Shrek movies a success."
    },
    {
      "rating": "9",
      "text": "this movie was pretty awesome! but some people says it´s terrible but i love it because i love shrek"
    },
    {
      "rating": "3",
      "text": "the concept of this movie had potential to be something cool and interesting like the previous 2 films, but this movie is just a rehash!"
    },
    {
      "rating": "4",
      "text": "This film was made for no other reason than commerce and a guaranteed payday for everyone involved. Considering the content emotional state of its protagonists there was little place to take both the story and its passe post-modern ironic jabs at pop and Disney culture. Murphy's voice is only an exploited extension of his hilarious work as the Klump family in 'The Nutty Professor.' Banderas's charm as 'Puss' is negated by monotonous character jokes as well as a poor second-act twist that makes the film increasingly grating. The plot hinges on 'Arthur' and Timberlake imbues him with a whiny, effete personality that is less than winning. He also appears incapable of reciting his dialogue with any double-entendres or meanings as everything sounds like he's reading from a kids book to a five year old audience. The film's saving grace continues to be the wonders that the film's limitless budget can provide to an expressive animated universe. There's no real urgent ambition here, just an opportunity for viewers to reconnect with old \"friends.\""
    },
    {
      "rating": "7",
      "text": "What is wrong with the MPAA? PG for \"Swashbuckling action\". What an immature and disgraceful organization. Anyway, this movie was good. The worst of the three, no doubt. But def. funny and entertaining and cute. Just a bit too short, and often tries to hard."
    },
    {
      "rating": "8",
      "text": "The purpose of writing a review for this movie is to tell you what I think of the movie. From an honest, critizing perspective, taking into account, how much I laughed and enjoyed myself, I give this movie a solid 8.0 out of 10. I think it was slightly funnier than the second but not as beautifal and classic as the untouchable first film that started for all. It is short, and this is not nessacarily a bad thing because it makes you want more from a possible fourth. It is hard to understand what the critics really think about Shrek 3. They seem to like it, only to a certian extent, however. Reel Views thinks that is is more of the same but that it is tiring out. Those two points clearly contradict eachother in the full review. To stop being so serious for a second, I would like to mention the fact that this movie is hilarious at times. Donkey is possibly funnier than ever and the new princess gang is brilliant to say the least. I loved the ending and loved Pinochio. Prince Charming is an annoying downside to the movie and Fiona is not really in the movie. Justin Timberlake takes a large portion of the movie and does a excellent job in his scenes with shrek. The movie has alot going on, and it really works. I loved it, and was just short of LOVING it. Hope theres a # 4 ! :)"
    },
    {
      "rating": "8",
      "text": "The purpose of writing a review for this movie is to tell you what I think of the movie. From an honest, critizing perspective, taking into account, how much I laughed and enjoyed myself, I give this movie a solid 8.0 out of 10. I think it was slightly funnier than the second but not as beautifal and classic as the untouchable first film that started for all. It is short, and this is not nessacarily a bad thing because it makes you want more from a possible fourth. It is hard to understand what the critics really think about Shrek 3. They seem to like it, only to a certian extent, however. Reel Views thinks that is is more of the same but that it is tiring out. Those two points clearly contradict eachother in the full review. To stop being so serious for a second, I would like to mention the fact that this movie is hilarious at times. Donkey is possibly funnier than ever and the new princess gang is brilliant to say the least. I loved the ending and loved Pinochio. Prince Charming is an annoying downside to the movie and Fiona is not really in the movie. Justin Timberlake takes a large portion of the movie and does a excellent job in his scenes with shrek. The movie has alot going on, and it really works. I loved it, and was just short of LOVING it. Hope theres a # 4 ! :)"
    },
    {
      "rating": "7",
      "text": "Not nearly as bad as people are making out. It's about on par with the second one. The audience I was with was really into it and laughed constantly. The first was the best, but this is still worth seeing."
    },
    {
      "rating": "4",
      "text": "Shrek 2 proved that a sequel can be just as much fun as the original if done right. This franchise isn't too tired or old. Shrek the Third could have been great, but it isn't."
    },
    {
      "rating": "7",
      "text": "Though it doesn't have the magic of the first Shrek, it is still good. My major complaint is that it is too short. I wish the jokes could have gone on for another hour. As it was, it seemed intent only in telling its main story, whereas it could have meandered more and had more fun with the characters like the Disney princesses. I also noticed the animation of this kind of movie has really improved. You can see the stubble growing on some of the character's faces."
    },
    {
      "rating": "4",
      "text": "This movie generally suffers from one of the most annoying problems ever to be included on a sequel, Overused elements, If I concure, this movie spoils three elements- -Environments that are dull -Quiet moments -In bed scenes (seriously) I think there will be a fourth, but who knows how bad that will be?"
    },
    {
      "rating": "5",
      "text": "This movie was really pretty and had great production values, but that fact was not enough to save its weak plot. This movie had terrible pacing and no depth - just, as Billy said, a bunch of fart jokes... it lacked the charm, originality, and complexity of the first two."
    },
    {
      "rating": "3",
      "text": "Its really a shame when a movie you've waited for since it was first announced turns out to be as uninspired as this one. I kept wondering why the animation on Arthur was so dead. I know the animators try to capture the voice actors expressions, but didn't they know better than to do that with Justin Timberlake. During his big oration at the end I noticed more expression from individuals in 2 second cuts of the background. Really sad and a waste of money."
    },
    {
      "rating": "5",
      "text": "This movie definitely met my expectations of being the worst of the series. Casting Justin Timberlake as one of the lead roles was a poor mistake. But Eric Idle on the other hand... Good idea. The plot was thin. Period. The ending almost seemed to imitate the last one, with a funny action sequence and then a lot of dialogue with a happy ending. They could have at least given us a cliffhanger leading into the 4th one (which I pray is better than this.) But it just had to be a carbon copy of the last two. But I do admit that I laughed. However, it wasn't a laugh a minute and I wouldn't see this again or even bother with the DVD."
    },
    {
      "rating": "3",
      "text": "They should have kept this movie on PBS and left it at that. This movie bears no relation to the other 2 save the characters. The plot is weak, the characters have run out of funny lines and there's nothing new to add to this movie. The continuing theme is the tired old \"Believe in yourself\"... feel-good mush. Doesn't make for a good humor movie. Disappointing. Go see it if you've got little kids, but don't go expecting the even half the laughs of the first two."
    },
    {
      "rating": "4",
      "text": "The summer crop of movies does not give me much hope for the future of Hollywood. Shrek 3 is the second sequel of the summer to bomb in my opinion. As many have pointed out - the magic feel of the first two is gone and in its place are jokes that seem entirely aimed at adults but just aren't that funny. Timberflake was a poor choice for Arthur and most likely was only cast since he was dating Diaz at the time of filming. The ending is an eye roller on the magnitude of a Saturday morning cartoon and the jokes mostly fell flat on their faces. Disappointing after a good first two films. Hopefully this will be the last we see of the jolly green giant."
    },
    {
      "rating": "4",
      "text": "Though a few funny movies, it is hard to believe they spent three years on this. It looks great, but the story and acting and pace seems like something you would find in a direct to DVD sequel."
    },
    {
      "rating": "5",
      "text": "I couldn't help but get the feeling that the writers and voice-actors only goal for this film was to get it over with and get paid. But despite it's lack of effort, it still presents some of the \"Shrekness\" movie-goers have grown to love."
    },
    {
      "rating": "1",
      "text": "Dreamworks really jumped off the plane without a parachute with this one. Shrek the Third is a poor excuse to carry on the Shrek series. Personally I enjoyed the first two in the series, but this was horendus. Repeative jokes, jokes carrying on, and when there was humor it was merrily a low \"heh\". This was a poor excuse for a film and should be avoided at ALL costs."
    },
    {
      "rating": "9",
      "text": "What is wrong with you people ? The first Shrek was a masterpiece because it set off a new genre and it was different. The second one sucked and is the one that would deserve this kind of press. But the third Shrek was light and fun... the way it should be. Not with a overly long story and a boring déja vu of all that the 2 movies could offer. They couldn't have reinvented the series and people's expectations becomes too high. Some of those jokes are hilarious as hell (is anyone getting those jokes or is it just me?) The -1 of the rating would be for the kid's appeal was a little bit less than the other two."
    },
    {
      "rating": "9",
      "text": "I really don't understand why this is getting such bad reviews. In my opinion, this movie was better than the 2nd but not as good as the first. My only complaints are that I feel Donkey and Puss weren't as funny as Shrek 2."
    },
    {
      "rating": "2",
      "text": "They've gone one shrek too far just like the Santa clause filmsand they were just clutching at straws. Some parts were funny and hail eddie Murphy and Antonio banderes for keeping me awake"
    },
    {
      "rating": "3",
      "text": "Tepid and tired compared to the previous titles. Unfortunately most of the material has been done before and even younger children will find much to like in this third installment."
    },
    {
      "rating": "3",
      "text": "I thought this was a really by numbers badly done cash in sequel. To be fair, that's pretty much what I thought the 2nd one was too, but at least the 2nd one made me laugh. I don't think I heard more than five laughs out of the whole audience that was in the cinema to see this. It just wasn't funny at all. Really really poor quality stuff. But hey, I'm sure the kids will like it."
    },
    {
      "rating": "0",
      "text": "The first Shrek was good, the second was lousy and this one is insufferable. Amazingly unclever pop culture references. My nephews (ages 6 and 11) liked it--strange that most of the humor is aimed at adults and falls totally flat, but the kids just like anything animated. Well, I guess the producers will make their money. Unbelievable waste of time--like paying 10 bucks to watch a bad tv sit com."
    },
    {
      "rating": "1",
      "text": "Excrutiatingly boring."
    },
    {
      "rating": "5",
      "text": "Runs out of good jokes after about half an hour, because the writers don't seem to know what to do with their ideas. Shrek has pretty much become a cliche these days so I wouldn't be too excited about a fourth one."
    }
  ],
  "recommendations": [
    "shrek_forever_after",
    "shrek_2",
    "enchanted",
    "flipped",
    "life_as_we_know_it",
    "the_notebook",
    "hannah_montana_the_movie",
    "if_i_stay",
    "christopher_robin",
    "a_walk_to_remember",
    "onward",
    "the_lake_house",
    "bridge_to_terabithia",
    "a_cinderella_story",
    "love_actually",
    "the_star",
    "zookeeper",
    "up",
    "wonder_park",
    "the_willoughbys",
    "about_time",
    "the_vow",
    "bolt",
    "the_peanuts_movie",
    "shrek"
  ]
}