{
  "id": 322,
  "title": "Shrek 2",
  "starring": [
    "Mike Myers",
    "Eddie Murphy"
  ],
  "runtime": 93,
  "genre": [
    "Animation",
    "Family",
    "Comedy",
    "Fantasy",
    "Adventure",
    "Romance"
  ],
  "description": "Shrek, Fiona and Donkey set off to Far, Far Away to meet Fiona's mother and father. But not everyone is happy. Shrek and the King find it hard to get along, and there's tension in the marriage. The fairy godmother discovers that Shrek has married Fiona instead of her Son Prince Charming and sets about destroying their marriage.",
  "releaseYear": "2004",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2yYP0PQjG8zVqturh1BAqu2Tixl.jpg",
  "categories": {
    "plot": 9.052631578947368,
    "acting": 9.0,
    "ending": 9.0,
    "soundtrack": 8.333333333333334,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.25,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This is better than the first Shrek because the story in this one is more interesting, the humor is more funnier (which is a little weird in the first), the graphics are better and the characters' voices are better. The first one is just good, but this sequel is great...."
    },
    {
      "rating": "10",
      "text": "THIS ONE RIGHT HERE IS GREAT I LOVED THIS MOVIE AS WELL.   GREAT PLOT AND LINES.   THE action scenes are good.   10 out of 10 my favorite shrek movie."
    },
    {
      "rating": "9",
      "text": "If not better -- Shrek 2 is certainly more innovative than the first film. Pros: Even more hilarious characters and dialog; rich visuals; probably more charming for the kiddies. Cons: A bit too pop culture referential."
    },
    {
      "rating": "10",
      "text": "How can you improve on a near-perfect animated film? Why, by making the sequel even closer to perfection of course. Andrew Adamson has fleshed out his wonderful comic fantasy universe that parodies both fairytale conventions and the modern world so ingeniously. Shrek (Mike Myers), Donkey (Eddie Murphy) and Princess Fiona (Cameron Diaz) remain engaging and easy to empathise with, and have all grown as characters, and face new life challenges as they travel to Far Far Away to meet Fiona's parents King Harold and Queen Lillian, voiced by the dream paring of John Cleese and Julie Andrews (which results in one of the funniest moments in the film - that fine romantic comedy staple of the awkward dinner with the in-laws). The cast is further fleshed out by Antonio Banderas as Puss in Boots, a suave, swashbuckling sword-for-hire with a deep sense of honour, but who isn't above exploiting his inherent cuteness. Jennifer Saunders makes a great villain as the Fairy Godmother, her performance an inspired mix of Michael Corleone and Oprah Winfrey, who seeks to secure the crowning of her spoilt, empty-headed son Prince Charming (Rupert Everett) and above all to maintain the status quo of traditional fairytales, of which Shrek living happily ever after with Princess Fiona is in complete defiance of. Shrek 2 is smarter, more bitingly satirical, even more visually splendiferous and far, far funnier than the first film. The jokes are wide ranging, from visual gags (my personal favourite being a shop in Far Far Away called Versarchery) to sitcom-style one-liners (Donkey proclaiming to Puss in Boots \"I'm sorry but the position of annoying talking animal sidekick has already been taken) to the completely unexpected (after threatening King Harold, in her complete frustration at her schemes unraveling, the Fairy Godmother stops her flying carriage at a drive-thru to buy some comfort food) to the crude (the discovery that Pinocchio wears lady's underwear). At its core, Shrek 2 is the next chapter in a good old-fashioned love story. It adopts timeless themes of love, sacrifice and friendship and emphasises the importance of being true to yourself, no matter how life beats you down. Adamson presents these themes earnestly, and with great wit, and makes them affecting and relevant to a modern audience composed of both children and adults. The use of a tongue-in-cheek take on iconic fairytales, something we have all grown up with, makes the second chapter of Shrek's story recognisable but pleasingly fresh at the same time - everyone, no matter your age can take away something from this heartfelt animation extravaganza, and you'll likely have a smile on your face for hours after the credits, and Karaoke segment, roll. Shrek was a very special animated film. Shre 2, on the other hand, is truly one of the finest animated films of all time, and certainly DreamWorks Animation's most glorious achievement."
    },
    {
      "rating": "10",
      "text": "Shrek 2 is even better than the 1st Shrek. It is especially hilarious and it has a deeper, more open story than the 1st Shrek had. I especially liked the new character Puss in Boots."
    },
    {
      "rating": "10",
      "text": "This is one of the rare occasions where the sequel to a movie surpasses the original. I found Shrek 2 to be even funnier than the original Shrek (which I also loved). If you liked the first Shrek movie you should also like this one. It is entertaining and follows a similar formula to the first one but is done even better."
    },
    {
      "rating": "9",
      "text": "Just as good as the first one with gags and the odd emotional moment to keep you,and more importantly, the children interested for a few more than 1 view. The animation is even better and all the childrens (and the adults) favourite characters all return. This movie meant that the expectations were way too high for Shrek The Third, of course,it didn't quite live up to the hype."
    },
    {
      "rating": "10",
      "text": "THIS ONE RIGHT HERE IS GREAT I LOVED THIS MOVIE AS WELL. GREAT PLOT AND LINES. THE action scenes are good. 10 out of 10 my favorite shrek movie. I like it !"
    },
    {
      "rating": "9",
      "text": "Shrek 2 is fantastic. The movie was animated but has a mature feeling to it. The music is incredible and the ending has perfect editing and music. Much better than the first one and the first one wasn't bad."
    },
    {
      "rating": "9",
      "text": "A wonderful movie full of spirit. The plot is great as it continues to use satire on fairtytales. Very funny and the music is what makes it excellent. Action packed and sweet."
    },
    {
      "rating": "8",
      "text": "#1 comedy of all time"
    },
    {
      "rating": "9",
      "text": "This movie more or less fixes everything that was wrong with the first movie and makes what worked even better. This is how a sequel should be.\r As before, fantastic performances by all the cast, including the newcomers. Story this time round feels fresh and finally gives the Shrek universe a sense of its own identity.\r Overall:\rThere is nothing I can fault with this installment. Shrek 2 is by far the best of the series and have set a really high standard that Dreamworks has rarely ever reached again."
    },
    {
      "rating": "10",
      "text": "dis movi is relly good cuz it is Shrek 2 and Shrek is the best cuz Shrek is the best shrek is love shrek is life i hate and are all dead to me is a noun in the English language. The word originated as a neutral term referring to black people, as a variation of the Spanish/Portuguese noun negro, a descendant of the Latin adjective niger.Often used slightingly, by the mid 20th century, particularly in the United States, it suggested that its target is extremely unsophisticated. Its usage had become unambiguously pejorative, a common ethnic slur usually directed at blacks of Sub-Saharan African descent."
    },
    {
      "rating": "10",
      "text": "dis movi is relly good cuz it is Shrek 2 and Shrek is the best cuz Shrek is the best shrek is love shrek is life i hate  and  are all dead to me  is a noun in the English language. The word originated as a neutral term referring to black people, as a variation of the Spanish/Portuguese noun negro, a descendant of the Latin adjective niger (\"color black\").[1] Often used slightingly, by the mid 20th century, particularly in the United States, it suggested that its target is extremely unsophisticated. Its usage had become unambiguously pejorative, a common ethnic slur usually directed at blacks of Sub-Saharan African descent."
    },
    {
      "rating": "10",
      "text": "This movie was just awesome! Even better than Shrek the first. The storyline was great. The new characters were good especially Puss in Boots. The voice acting was great. The animation is very good. Shrek 2 is the best Shrek film and I'd recommend it to anyone who has seen the first."
    },
    {
      "rating": "10",
      "text": "shrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love\rshrek is life\rshrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love shrek is life shrek is love"
    },
    {
      "rating": "9",
      "text": "One of the few occasions where the second movie is better than the first one. I just love this film. It has a whole batch of new characters, as well as the ones you loved from the first one. The story is even better, and the jokes are even funnier. Probably Dreamworks' best film yet!"
    },
    {
      "rating": "10",
      "text": "A Masterpiece Just Like The 1st OneHas Everything That made The First One So Damn Great, But The Best thing About This Film Is By Far Antonio Banderas As Puss in Boots."
    },
    {
      "rating": "10",
      "text": "The original Shrek was already really good, but this is even better! It's funnier, has better action scenes, and an even more iconic soundtrack. It earns it's status as a classic!"
    },
    {
      "rating": "10",
      "text": "It's even more quotable and funnier than the first, which is already pretty funny and quotable. I'll never get tired of it!"
    },
    {
      "rating": "10",
      "text": "While I liked the first Shrek movie, I thought the movie was really overrated. This movie however, is the only Shrek movie I believe deserves a 10. Funnier jokes, Antonio Banderas as Puss in Boots, I actually love this movie!"
    },
    {
      "rating": "9",
      "text": "It's charm and extreme heart and originality make for an improvement on the amazing first film. It has to be one of the funniest animated movies made in a long time. I give this film 94%."
    },
    {
      "rating": "6",
      "text": "\"Shrek 2\" is a decent movie using the same formula from \"Shrek\". But hey, its still very funny and entertaining to watch."
    },
    {
      "rating": "10",
      "text": "like the first movie, this one also kicks a**!"
    },
    {
      "rating": "10",
      "text": "Shrek 2 what a great movie and a great sequel to one of my fav movies of all time when I watched this movie I loved it, even more, I thought I was not going to enjoy this movie as the first but it was so great that is it better than the original this movie for years I thought was overrated but nope I think this movie is amazing the expanded the Shrek universe the characters are great puss in boots is introduced in this movie he is the best he has ever was I liked that potion stuff in this like Shrek wants to do what Fiona wants so he does it while that fairy godmother is messing with him so Shrek is my fav movie in the Shrek series Shrek series to be is great I love the first movie and I think the second movie is even better Shrek 3 is a little bit disappointing Shrek 4 was a nice return to the series so I give Shrek 2 an A+"
    },
    {
      "rating": "4",
      "text": "A bit funny, but the first one it's that good that leaves Shrek 2 in the dust."
    },
    {
      "rating": "6",
      "text": "Another stale installment of the Shrek series with its plethora of fart jokes and bad Scottish accents. Nothing new. This series could've saved itself, at least a little bit,by not being a series at all and stopping at the first one."
    },
    {
      "rating": "9",
      "text": "Possibly the second animated sequel that's considered the best. (First is Toy Story 2 obviously...) It's just after this movie seems that they overstayed their good home to be ogre."
    },
    {
      "rating": "0",
      "text": "A change in directors butchers Shrek 2 and heavily undermines the only positive aspects of the first film. With the writing department thrown off the cliff, nothing can save the film from its trend of ongoing stock characters, massive missed opportunities, and rote rehashes of the original."
    },
    {
      "rating": "9",
      "text": "Probably my favourite movie. I liked it better than the first Shrek. Script and images more meaningful to an older audience than the previous film. Still a lot of fun for all the family."
    },
    {
      "rating": "10",
      "text": "Although I'm not a fan of Shrek movies anymore, I'm disagreeing on the fact people saying it wasn't as good as the first one. This movie is way better than the first Shrek, more family friendly, had more characters, more beautiful locations and a lot of humor. I'm giving it a 10 because it gave me lots of laughs 5 years ago but not now, after all, the big three animated comedies (Shrek 2, Simpsons Movie, Ice Age Dawn of the Dinosaurs) dont have that much replayability as other cool films like Curse of the Black Pearl."
    },
    {
      "rating": "8",
      "text": "Dammit I wanted this to be better. Not that it's bad, in fact it's damn good, but it just doesn't have...I dunno, the charm of the original. That one seemed like an impromptu student revue, this one seems like a calculated sequel. There's a faint but discernable corporate feel about it that just makes my skin crawl. But then I am a communist, so it's probably my own fault. To reiteratie: good movie. Puss in Boots is a wonderful creation, brilliantly played, and the rest of the cast rock bells. It's inferior to the original Shrek, but it's still good times."
    },
    {
      "rating": "10",
      "text": "Shrek 2 is my most favourite film of all time. I watch it over and over again. I think that Shrek 2 is better than the first one!"
    },
    {
      "rating": "9",
      "text": "THis was the best Shrek out of the two. but still donkey is just anoying. i really liked the new character puss in boots. don't wast your time watching the third or the first onlice you can watch them for free."
    },
    {
      "rating": "9",
      "text": "Though this film is not as ood as it's predecessor Shrek 2 is nearly there."
    },
    {
      "rating": "6",
      "text": "i like this movie it had its funny parts, like when puss in boots came. But it wasn't the best movie ever."
    },
    {
      "rating": "10",
      "text": "It's all GREAT!!!I love SHREK very mush!!!!"
    },
    {
      "rating": "6",
      "text": "Blatantly sentimental where the original was clever, Shrek 2 is the sort of movie the original would have made fun of. The charm wears off quickly. There are some outrageously funny moments, but its more miss than hit, going for easy parody and satirical cliches."
    },
    {
      "rating": "10",
      "text": "Funny? Yes. Clever? Absolutley. Heartwarming? Could it be any other way? Shrek returns with the original brilliance that highlighted the original."
    },
    {
      "rating": "9",
      "text": "Simply wonderful! A few bad jokes and things like that, but all movies seem to have one or two of them in there."
    },
    {
      "rating": "9",
      "text": "ok seriously, what are these critics smoking??? this is sooo much funnier than the first one"
    },
    {
      "rating": "10",
      "text": "Great :-D"
    },
    {
      "rating": "10",
      "text": "Just as funny, sweet and engaging as the first film starring the big galoot."
    },
    {
      "rating": "7",
      "text": "Sequel to the highly entertaining erm..Shrek.Funny in places but also quite annoying too. Really didn't like the Fairy Godmother character (Yes I know she's the baddie) but came across in parts as a bit smug & some of the gags were just lazy.The music tends to be badly recycled covers with the exception of Tom Waits & Nick Cave.So ok but not as good as the first."
    },
    {
      "rating": "8",
      "text": "Shrek 2 is one of those rare sequels that works really well being just as good if not better than its predecessor. It has a great story that feels like a continuation of the first one and has some sharp writing, more geared towards adults than kids. The characters from the first one are back and are as likeable as before along with some new ones that are welcome additions to the cast. On top of that you have some pretty funny jokes, moreso than in the previous film, that the adults will get moreso than the kids. Shrek 2 is a great sequel having everything the first one had and more making it an easy recommendation to fans of the first one along with people who were not even that big on the first one (like Doug Walker). Its films like this that make it clear why we all fell in love with Shrek in the first place."
    },
    {
      "rating": "7",
      "text": "It's good. Not the best humour but it's worth a watch."
    },
    {
      "rating": "8",
      "text": "Better than first film, epically entertaining with good visuals, great writing and music."
    },
    {
      "rating": "8",
      "text": "In my opinion this movie slightly better than first Shrek. It still has the great humor that appeals to all ages but the fairy godmother makes for a better villain. Also the new characters make for a pretty good animated film."
    },
    {
      "rating": "8",
      "text": "Even more snarky than the first one, but with just as much heart and likability."
    },
    {
      "rating": "8",
      "text": "\"Shrek 2\" is just a hilarious comedy hit, and while it feels somewhat similar to its original, new characters do shine  Puss in Boots as an example. It's formula to appeal to adults and children at the same time works, and while it may feel a tad too familiar to the first; it can still appeal to all ages."
    }
  ]
}