{"id": 1073, "title": "Shutter Island", "starring": ["Leonardo DiCaprio", "Mark Ruffalo"], "runtime": 138, "genre": ["Drama", "Thriller", "Mystery"], "description": "World War II soldier-turned-U.S. Marshal Teddy Daniels investigates the disappearance of a patient from a hospital for the criminally insane, but his efforts are compromised by troubling visions and a mysterious doctor.", "releaseYear": "2010", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/4GDy0PHYX3VRXUtwK5ysFbg3kEx.jpg", "categories": {"plot": 8.31578947368421, "acting": 7.136363636363637, "ending": 7.739130434782608, "soundtrack": 6.25, "cinematography": 6.666666666666667, "familyFriendly": 3.0, "funny": 5.0, "action": 7.555555555555555}, "reviews": [{"rating": "10", "text": "I'll keep it short. This film is one of the best films I have seen recently. So intense, thrilling and it keeps you to the edge of your seat. From prologue to the epilogue it's so perfect. What can you expect more from a director of his caliber.!!!!!"}, {"rating": "10", "text": "This movie is just plain GOOD. Simple. Let me also be the one to say that these other people who are giving bad reviews, well they mostly do not have a good IQ or any knowledge of psychology. These people were probably just hoping for a scary movie. Because after the trailer, I was expecting the same. But I still enjoyed the movie even though I didn't get scared at all (because it's not a scary movie) is because I am a college student with a good IQ and understand of psychology and how the brain works. I also know what psychologists do and how they used to treat patients in the old days (hence why the setting is 1954 and not now). You don't even need to KNOW anything about psychology to appreciate this movie. Just a simple curiosity of how the brain works is a good start. I love action movies and scary movies but I also like INTELLIGENT movies and that's what this is. Those of you who say you saw the twist coming, I say bullcrap. Maybe some of y'all did but the twist doesn't take place until there is like 20 or less minutes left in the movie and the whole first half doesn't leave any clues as to what is coming. If you are an intelligent person or a curious person to how we humans function and our mind works, this is a GREAT movie. Great acting and great plot. I love psychology or most of it atleast and like I said, I am a college student who enjoys intelligent movies and not just the ones where there is plenty of violence, comedy, and sex. So those of you who gave it bad reviews, I'm sorry I have to say it but y'all are probably just dumb kids or dumb people in general who don't have a clue how you even function as a human being. Watch the movie and tell me if I'm wrong."}, {"rating": "10", "text": "I just think that this movie is beautiful. No slow spots for its entirety. The story itself and the ending are not the main points of the movie. The main point is emotional journey of the main character and his inner change."}, {"rating": "8", "text": "Not Scorsese's best film, but it might be one of DiCaprio's best performances. It's a very good looking film and intense feeling to it all. The music does a really good job in setting a tone, **** work comes to mind. Leo lights up the screen as Teddy Daniels, a  US Marshall investigating the disappearance of a patient at this really sketchy hospital. I think multiple viewings of the film gives it justice."}, {"rating": "10", "text": "Scorsese and DiCaprio were born to work together! Shutter Island is brutal and twisted, yet brilliant right down to the core. From the first shot of the film to the closing credits, error was nowhere to be found. The music encompased the element of fear and excitement, perfectly. The beautiful yet gritty cinematography left you on the edge of your seat for the next shot. The script was one of the best I have ever seen on screen, leaving you repeating the dialogue in your head from the previous conversation. DiCaprio knocked it out of the park with one of his best acting performances, not to mention everyone else in this movie did really good. The story is unpredictable and once the Scorsese credits hit the sliver screen you will still be questioning what you just saw. In my opinion, its one of the best films ever made. A must see!"}, {"rating": "10", "text": "A great film.  DiCaprio/Scorsese deliver again. Suspenseful and never dull. The ending is powerful. The score is an all time favorite of mine. This movie was so great, I read the book and I don't like reading too much."}, {"rating": "9", "text": "A nearly perfect movie.Everyone who says its bad is not stupid but  has possibly not understand it.\rIt has a perfect twist at the end.Leonardo DiCaprio is a stunning actor and he plays an amazing part.\rI also like the bad feeling the movie gives you.Scorsese created powerful dialogs which force you to think about them.\rA 9 from ten only because its sometimes hard to follow and there are smaller logical mistakes."}, {"rating": "10", "text": "This movies is the best Mind Blowing ONE.Love the way of how Leonardo DiCaprio took his acting to another level.Just LOVE IT !!!.Also the rest of them played very well....also the places used for all scenes are SUPERB"}, {"rating": "10", "text": "Screw what anybody else says... this movie blew my mind, its totally worth watching for the fantastic ending... i heard there was a good twist and whilst watching the movie I tried to think of every single possible thing that could have been the twist.... my oh my was i wrong and it was the craziest ending ever. I havn't met one person out 40 different people who said it was even slightly bad.. so I don't understand what all these stupid critics and people giving it a 0 rating are for. They just obviously can't sit through a movie until the end. As for what somebody said about how it doesnt explain the ending... actually yes it does in extreme detail, you are just too stupid to understand it all."}, {"rating": "8", "text": "This is a real impressive thriller from Scorsese with great acting and writing and a harrowing story."}, {"rating": "8", "text": "Scorsese and DiCaprio’s fourth collaboration, SHUTTER ISLAND is an on-the-edge-of-the-seat nail-biter, a period thriller situates at the titular island near Boston in 1954, a patient mysteriously disappears from the mental hospital on the island, draws the investigation of US marshal Teddy Daniels (DiCaprio) and his subordinate Chuck Aule (Ruffalo). But on the sly Teddy volunteers the task under a more personal motivation, he is after a pyromania who is responsible for the killing of his wife Dolores (Williams).\r read rest of the review on my blog, google cinema omnivore."}, {"rating": "6", "text": "Pretty good. I enjoyed it a lot, but I think it's very overrated. It had some very good, thrilling moments, but overall it was predictable. I had the ending figured out after the first 90 minutes. Some people will try to squeeze this movie into \"The Best of 2010\" category, but for me it just doesn't deliver. Good but not what I was expecting!"}, {"rating": "8", "text": "Very good film!  I absolutely did not see what was coming in the end.When the twist is revealed it all makes sense, the signs were there, yet the viewer's mind chooses to ignore it, just like the protagonist's mind, that's why it's a genius twist. Perfect ending!\rThe music is also great, it creates the tone for the movie.\rSome people say that you should watch this movie more than once, I would disagree with that statement. If you pay attention, you'll remember all the details in the end and it will combine in your head. Watching it for a second time however, I didn't find it thrilling anymore, because I knew everything and it just wasn't interesting.\rI note that I would not recommend this film to those with weak nerves. Some people I talked to told me they found it very violent, distressing and depressing. Well, it is set in a mental institute for the criminally insane..."}, {"rating": "10", "text": "Shutter Island holds up. 10 years after its release, I still find new little discoveries in almost every frame of the film. It's hard to make a mystery/thriller movie that is so engaging, and remains engaging even after you watch the movie once and know the twist. The musical score to this film is absolutely haunting. Shutter Island is gruesome. It's dark. It's scary. It's powerful, and it has something to say. One of Scorsese and DiCaprio's best. This is a must-see film."}, {"rating": "9", "text": "Shutter Island starts as an eerie investigation movie of a criminal insane facility. The beginning of the movie is interesting enough, but it becomes very riveting once the ultimate revelations of the plot are unraveled. It will completely shock you and startle you. After figuring out the actual premise of the movie you will want to rewatch it, as you will be able to pick up on things you missed the first time. Anyone that likes psychological thrillers or films with complicated plots will love this movie."}, {"rating": "9", "text": "A complex plot presented in dark, brooding style. It holds your attention, draws you in and then leaves you thinking about it. It's like plain chocoalte and chili: richly textured and surprisingly good. I will return to Shutter Island before too long."}, {"rating": "9", "text": "In this film, two American police officers try to solve a crime that occurred in a prison insane asylum, isolated on an island full of mysteries. Directed by Scorcese, it is carried out by an excellent Leonardo DiCaprio, always impeccable in his character, deep and complex. Ben Kingsley also did a great job as the prison director. Mark Ruffalo was fine, but his character is almost erased by the brilliance of his colleagues. Max von Sydow makes a short appearance, but in an intense and striking character.The script is at least intelligent and provocative. He cleverly uses period elements, makes an unexpected but well-exploited connection to the drama of the Nazi death camps, the traumas of war, and the suffering that was felt in the early psychiatric hospitals. In fact, it is not by chance that most of them still have the reputation of being haunted, whether they are ruined or still in use. The psychiatric therapies used in this period, though they seemed absolutely barbarous to us, were the best at that time and contributed greatly to the better understanding of this field of medicine. Despite this, the movie is full of mysteries, unanswered questions or answers hidden in small details. Therefore, watch closely. If you blink, you may miss something decisive to understand the movie. The ending seemed disconcerting, but it made perfect sense. Cinematography makes an excellent introduction into the movie environment, which is pure mystery and suspense. It is dark, gray, misty, directing us to all the dark secrets that the island supposedly seems to hide. The soundtrack cleverly helps, as well as the shooting scenarios and locations, meticulously thought out to fit in history and historical time.A ambiguous movie full of mysteries, that never answers all our questions but requires a lot of attention and perhaps more than a visualization to understand. It certainly will not please all people but fans of DiCaprio, Scorcese and thriller movies will be very pleased with the result."}, {"rating": "9", "text": "Pacing, content, acting, cinematography. This film has it all. There are very few flaws, if any, in this film. Ideal films should act like a dream, where the viewer is pulled from the world in which they exist and completely trans fixed with the fictional world in which they find themselves. Shutter Island does just that. Someone who is actively watching this movie will find themselves engrossed in the story and invested in the advancement of the plot. As far as the genre of psychological thrillers goes, this is just about as good as it gets. I will always recommend this movie to lovers of cinema."}, {"rating": "9", "text": "фильм хороший актёры имба концовка имба заставляет смотреть дважды"}, {"rating": "7", "text": "The movie uses the knowledge of unethical experiments with mentally ill patients in Nazi Germany, as well as in the Americas during the 1940s, to form a conspiracy theory that will keep you guessing until the end."}, {"rating": "7", "text": "Martin Scorsese's \"Shutter Island\" is a thrilling entertainment thanks to great performances from Di Caprio and Kingsley, but the film falls short for its lasting appeal. Good movie overall, but stick with your \"American\" crime Scorsese."}, {"rating": "9", "text": "It was great movie, filled with a spectacular cast with spotless perfomances, great production values and a beautiful visual style courtesy of director Martin Scorsese.  It has a slow pace, but the mystery of the plot is well worth the wait.  Not every will enjoy it, but that's the beauty of it.  It's an acquired taste.  And thankfully, the taste was delicious. A 9.25/10"}, {"rating": "9", "text": "One of the most beautiful movies that I have seen. Di Caprio is fantastic in his interpretation, and the plot is very interesting, since at the end..."}, {"rating": "10", "text": "This movie is what made me a moviegoer. I love this movie, beginning to end, brilliant, and that twist, oh my god, did not see that coming. Creepy, intriguing, and Smart. I love it"}, {"rating": "9", "text": "Set in the 1950's, two interesting stories that unfold while DiCaprio giving an excellent performance on Shutter Island, which is a mental \"institution\" that has you questioning from the opening credits. Although the movie can get confusing, even though it's story is told really well. Director Martin Scorsese will take you on an epic mystery that you won't forget for a long, long time."}, {"rating": "10", "text": "This film is simply confusing, especially in first watch. You think you get the idea, the storyline and then you start hesitate and believe the whole idea is actually hidden and overturned. And in the end you are fooled again. Because Shutter Island is definitely open to theories, focus on the details and enjoy. :)"}, {"rating": "7", "text": "\"Shutter Island\" is not Scorsese's best, but it's hard not to be turned on by the brilliant visuals and great performances given within it. The entire film is, as Ebert points out, directed at your senses, and as the twists and turns of Shutter Island become more and more intense and noticeable, the tension grows higher and the stakes much larger. The ending isn't great, but it's done so well we barely care to challenge it. Simply a very entertaining and wellmade mystery flick that pays a lot of homages to the 1920's."}, {"rating": "8", "text": "MUCH better than I thought it would be. I was surprised that the professional critics weren't more on board with it. My favorite element was the music - so brooding, and so delicious. The visuals were also incredible."}, {"rating": "8", "text": "I guess Leo and Scorsese are just too good together to stop making movies, and this one is no exception. Creepy at times, and it's amazing how elaborate the whole idea was in the end (obviously you have to watch to know)."}, {"rating": "8", "text": "What makes this movie so great is the fact that it allows the viewer to work out for themselves what is actually going to happen and with out me revealing too much the result at the end will make the viewer go WOW the line up of actors isn't too bad either . The movie however can only be watched once as once you know the ending the rest is just pointless. definately a rental though no doubt about it."}, {"rating": "8", "text": "Amazing cinematography and inspired performances from DiCaprio and Ruffalo, but the film is a little uneven as a whole. I wanted to like it a lot more than I did, but I did think it was really interesting and certainly better than some of Scorsese's other recent films (\"The Aviator,\" \"Gangs of New York\") but a step down from \"The Departed.\""}, {"rating": "8", "text": "Shutter Island is a Martin Scorsese reworking of a novel not many will be familiar with, which means the twists and turns will be all the more unexpected. Throughout the course of the film, we are left guessing as to what is actually going on, which characters are we supposed to trust, which ones are actually real and which one is going to ultimately reveal the truth. In fact, few would be able to guess at the convoluted ending the movie adopts, which makes it all the more enthralling to be taken along for the ride. Strong lead from DiCaprio and an excellent supporting cast including the likes of Sir Ben Kingsley, Max Von Sydow and, begrudgingly, rom-com fodder Mark Ruffalo make this a well thought out, well acted adaptation.\r *Best Watched - In a dark room with plenty of patience that will ultimately be rewarded*"}, {"rating": "10", "text": "If you were to say that this movie was a major twist, or it was DiCaprio's most frightening picture, I would say that they are spot on. A perfect, sensible ending that makes everything change completely to the way I thought it would've ended. With a wondrous mystery to solve, answered, ONLY if you pay attention. Now, I only sometimes give spoilers, but I will not, would not, could not, should not, give away any important feature to this movie. Yeah, a little long- 2:15 or so, but if you start this early, turn up that volume, and put on the closed captioning, and you're a fan of horror/ suspenseful movies, and Leonardo DiCaprio, I would recommend this movie to you."}, {"rating": "9", "text": "The movie is amazing. Put together DiCaprio's perfect acting with Scorsese's incredible directing, and then throw in a breathtaking, intelligent, complex story and you have Shutter Island. One of the best movies this year, if not the very best."}, {"rating": "2", "text": "This movie had to be one of the worst films of the year.  The most disappointing of all is that it was put together by one of the greatest film directors and an A-list actor.  Please make sure you don't waste your time checking this film out!"}, {"rating": "4", "text": "(Ignore the review I had with a 10. Not sure why the page reverted back to that score)\"Meh\" about sums it up. The acting was good, with a decent idea for a story, but the ending was hugely predictable, even from the previews. The length was expected of Scorsese, which actually hurt the movie. It would've been much more bearable if the ending we knew was coming would have arrived 20-30 minutes earlier. Add in a couple of blatantly unrealistic moments such as the scene where the storm's rolling in and tree branches are whipping by at 80 mph, but the people are able to practically jog with no hindrance from the gale blowing around them. Really, Scorsese? You've been in the business that long and didn't even see that flaw?"}, {"rating": "2", "text": "Horrible Cliche Garbage. Even Scorsese couldn't save this hack story. Terrible."}, {"rating": "3", "text": "This movie was absolutely ridiculous. I just couldn't believe I had paid for this one to watch. That it was directed by Scorsese. If you're expecting a movie of the same caliber as The Departed please stay away. In fact, just stay away. Go watch Instinct again or something. I predicted the plot, was annoyed by the intense music (that was there for absolutely no reason) wasn't pulled in by it. The only justification I can give for sitting through it and not falling asleep was the brilliant performance by DiCaprio. Giving it a 3 since all this movie has over a 1-star movie is excellent acting & good visuals."}, {"rating": "3", "text": "Boring...predictable...Not worth watching for the last line."}, {"rating": "3", "text": "I worked it out after 20 minutes and fell asleep 10 minutes to the end and had to rewind to find out it I was right. Scorsese got carried away with the wind machine and an over blown score. Can't believe most of the critics loved it."}, {"rating": "3", "text": "Thoroughly unimpressed. From the opening scene with the poor attempt at realism via crappy CGI (the sea and sky were so fake), the one dimensional acting and predictable and unrealplot with that awful, awful music direction. Well, that killed it all for me. The fact that those parts are integral to the film means that of course I switched it off half way through (through one of those ridiculous dream sequences)"}, {"rating": "4", "text": "I saw it coming after about 20-30 minutes. So, I had to wait the entire movie to see the ending I already thought was going to happen. Totally lame..."}, {"rating": "2", "text": "Started great, cinematography beautiful, but poorly paced and B O R I N G. Wanted to leave 2/3rds of the way through."}, {"rating": "0", "text": "Don't even waste your precious time on this movie. Boring at best. What was Scorsese thinking? Too bad, since you can usually count on a great film with the featured actors and director."}, {"rating": "1", "text": "Absolutely Terrible. Too long, too predictable, soundtrack was just ridiculous. Very disappointed."}, {"rating": "4", "text": "To be sure, I love Scorsese and am generally a fan of DiCaprio's, but this movie was disappointing on all levels. It was so riddled with cliche after cliche, and to be honest, I didn't feel this movie was much of a thriller at all. I had the twist figured out half-way through and was just bored waiting for the reveal. And that's another thing...the twist. Do we have to keep seeing movies with that twist? Seriously, Fight Club, the Machinist, Identity, etc etc etc. It's old, it's done. I don't care anymore."}, {"rating": "1", "text": "Shutter island is the worst movie of the year. it has a plot like a shit. the movie is boring and stupid."}, {"rating": "3", "text": "Deeply disappointing, becaase WAAAY overploted, and waaaay too long. As many reviewers noted, this length is its chief embarrassment: it allows you to think it through, they fail to explain. I gave up on it between the cemetary scene with dialog sounding like an outake from \"A Beautiful Mind\" and the meeting with Noyce. Thereafter, it just became annoying. Would that Scorsese learned that there is a reason why Hitchcock - the master of suspense - strove to put ordinary characters into extraordinary situations. That way, we can identify with our protagonist, allowing suspense to build. I shudder to say that this balloon sailed into the ether far too soon. A waste of great talent, writing and set potential."}, {"rating": "10", "text": "Totally agree with Kyle ( who gives it a 10 ), an awsome film. And to anyone who say's they don't get the end....You must be kidding?? A masterpiece."}, {"rating": "10", "text": "Loved this movie!! I love movies that are unpredictable, and this was as good as it gets. Thank you!!!"}], "recommendations": ["enemy", "the_prestige", "now_you_see_me", "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_", "the_usual_suspects", "gone_girl", "bad_times_at_the_el_royale", "signs", "a_cure_for_wellness", "a_quiet_place_part_ii", "tenet", "tinker_tailor_soldier_spy", "split", "the_machinist", "what_happened_to_monday", "a_perfect_getaway", "us", "the_loft", "the_snowman", "zodiac", "twelve_monkeys", "the_butterfly_effect", "glass", "the_illusionist", "inception"]}