{"id": 4567, "title": "Shut In", "starring": ["Rainey Qualley", "Vincent Gallo"], "runtime": 90, "genre": ["Thriller", "Horror", "Drama"], "description": "A young single mother is held captive along with her two children by a violent ex and must plot their escape before it’s too late.", "releaseYear": "2022", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/b5ug4LyLQFeR6azAJyIPBQz5ur9.jpg", "categories": {"plot": 2.5555555555555554, "acting": 3.933333333333333, "ending": 3.0, "soundtrack": 5.0, "cinematography": 2.0, "familyFriendly": 3.0, "funny": 3.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "It's completely predictable and cliche for the most part and has a very dark and disturbing \"twist\", but has some decent atmosphere and setting and some decent acting from Heaton and Watts. Not the worst film like it's being hailed but not a good one."}, {"rating": "6", "text": "A solid horror film with one really, really bad, over-the-top performance by Charlie Heaton. His awful performance (perhaps more the director’s fault than Heaton’s) dragged down fine work by Naomi Watts and Oliver Platt and most of the rest of the cast. Another problem is that we have had a lot of inventive horror films ately, and this film was more traditional. Overall I enjoyed this film for the lead performances and the claustrophobic atmosphere, but I can’t say it wasn’t without faults."}, {"rating": "10", "text": "A solid horror film with one really, really bad, over-the-top performance by Charlie Heaton.. Amazing how the lefties are hating on this movie, but not giving any reasons why. They just don't like Ben Shapiro. So brainwashed. Go enjoy the movie and make up your own mind!"}, {"rating": "2", "text": "Shut In is just basically what it tries to do. It attempts to scare people poorly and terribly at the way too. Just another low-quality horror bait. Don't watch."}, {"rating": "2", "text": "I'm going to be honest here in defense of my own self righteous, that I went to see this movie cause my friends wanted to see it. I skipped my chance to see Arrival for this movie and I wish I had gone and seen that instead cause this film might just be the hugest disaster of 2016 I've seen this year so far. I'll also add, that all my friends after the movie ended, thought the film was a waste of time, boring, and overall immensely stupid. I guess the only positive I have for this movie is that Charlie Heaton's actually tried to act really well in this film but his character just came off as confusing due to an awful script. Also the cinematography in this film was alright and sometimes beautiful, but cinematography is one of those factors that really don't affect my opinion about a movie, if the overall film is layered with negative factors. Naomi Watts' character in this film was so bland and one dimensional. Her character made so many cliché, stupid, horror movie decisions in this movie and had emotions that were conveyed extremely poorly. The movie takes about an hour to actually get semi-interesting since the first hour is pretty much really bad exposition scenes that don't really have anything to do with the revealing plot at all. This movie also relies on something I hate a lot about certain horror movies: \"jump scares.\" I can't stand them. Literally the only scares in this movies are mainly false scares that aren't even remotely scary. Another negative I just have to mention about this film is the twist ending. Of course I won't spoil it, but, it is a laughably bad twist. What I hate the most about this revealing twist is it has nothing to do with the events that have led up to it, it just came out of nowhere. Readers, if you feel like torturing yourself with a film that is extremely boring for the 1st two acts and has extremely bad script writing, go right ahead and watch this \"movie\", but if you want to save money and time, just skip this movie for sure. I'm going to give this movie a D- and a score of a 1.5/10."}, {"rating": "3", "text": "It's disappointing that, in a year filled to the brim with horror feats, this movie is the one that has to cap it all off for us. Indeed, Naomi Watts may try as hard as she can with what she's been given here, but the simple fact remains; what she's been given is so devoid of any tension, intrigue, or character development that even an actress of her caliber can't save this hopelessly uneventful slog of a \"horror film\" with a third act so over-the-top and incredulous it ventures into \"so bad it's funny\" territory. Avoid if you can."}, {"rating": "4", "text": "A good cast and a potential thriller, but...At first, it looked fine. Well initiated by giving out a proper reason to develop what comes later. But that later part was the biggest let down. It becomes so cliché and because of that I lost interest. Otherwise, it is could have been a decent one with all the good actors. Also the location was good, a perfect setting for the storyline. But not noticeable when the narration enters the second half, mainly because of thriller takes over.It is the story of a psychologist who recently lost her husband in a car crash, but ended up taking care of step-son after he became mentally and physically incapable. When the life was in the routine, suddenly something bad happens where her young patient goes missing. Following the event, she begins to experience what others won't believe her. But what comes later is more shocker, a twist in the tale takes us the conclusion.As the title and its genre suggest, it remained truth to that, but there is no innovation in storytelling. Most of the people would easily predict most of the parts if not the entire film. The casting was the advantage and they all were good, including the kid from 'Room' and Naomi. Even though it is rated very low everywhere, as well as by me, kind of entertaining, which means watchable till the end than cut it out in the middle. Not a film to recommend, but if you choose it to watch, I won't say don't.4/10"}, {"rating": "3", "text": "This is a terrible movie, going in you think this is a ghost movie but as it turns out its not that at all, a lot of stuff in this movie is bad the acting the pacing in wich things happen and the twist is so stupid, id save my money if i where you guys"}, {"rating": "3", "text": "People need to be working. It's not just about paying bills. More importantly, it's about keeping busy which is vital psychologically. It gives us the feeling that we have purpose or at least a direction – so we can feel that we belong somewhere and this big train called Life has not left the station without us.Movie people need to be working too, even more so than a regular joe with a regular steady job. Because movie biz can feel very hectic and random. You end one project, feel the threat of the great unknown and the only supporting thought may be: so what's next? It would be good to have couple of new offers already waiting.This is the way, at least according to my hypothesis, that most genre movies are made. You know, the kind of movies that don't feel like they have anything to say really, and may not even show much passion for the story, topic or genre they represent. People just rehash whatever has done before countless times, sometimes with feeling (almost) fresh and becoming a cult classic, sometimes ending up just dull and ugly.But somebody somewhere managed to get enough funding for it, using magic pitching words like \"This is gonna be like X but with added Y and Z\" and now it needs to be done. Hey – people need to be working anyway.\"Shut In\" is that tedious genre movie that many probably feel the need to not watch til the end and some certainly even like, because they haven't seen this kind of thing too many times before, or they are in generous mood and the night was boring anyway, or they just did lots of drugs and now everything feels exciting, whatever.It reshashes the cliches of even two cheap horror sub-genres. I will only name \"hostile house\" because otherwise I would spoil the fun for some lucky person. Child psychologist is living alone with her vegetable-state-son and then she discovers some disturbing activity in the house which seems like... Damn, I'm too good. Now it seems more interesting in writing than it really is.The first part plays out like any other haunted house movie. It's a bit slow and tedious and workmanlike... you will probably check your clock during the first 30 minutes and think: \"OK, it's not that bad...\" That's mostly due to starring lady Naomi Watts who does convincing job as reclusive person who is slowly bowing down on the heavy load the life has put on her shoulders.Then we reach the second part and the movie makers feel the need start adhering to the rule that any Any Self Respecting Low Budget Horror Must Have A Big Twist in the End or Second Half. The movie changes tone completely and turns to **** quickly. It was just harmless and tedious before, now it's just silly and makes you crawl your eyes and ask \"Really?\" a lot. It would probably be tolerable as a subplot in \"90210\"-style teen drama but not as a second half of a major movie. Having said that, I discovered that the director's body of work does include mainly episodes of different not-quite-A-list TV series.If there's a single argument for watching \"Shut In\" and not any better thriller/horror that its copying, then it would be Naomi Watts. She totally justifies spending the big bucks (in case they didn't get her cheap for some reason). She's always believable, even in the last third when the onscreen events turn to kind of \"I am not sure if I am able to continue watching this without laughing or instead checking Facebook in my phone\" bad.I would recommend re-watching \"The Sixth Sense\" or \"The Others\" instead. Watts has gotten her money for her good work, now let's let the nature take its course and bury this little movie under the rug of time. It will probably reach Netflix and/or other streaming services soon, so you can check it out and quit in 15 minutes or so.Watts seems to believe she hasn't outstayed her welcome in horror genre although her better-received projects (\"The Ring\" 1-2 and Peter Jackson's \"King Kong\") are already at least ten years old. Of course there was also 2011's excremental \"Dream House\" but the less said about this colossal misfire, the better."}, {"rating": "6", "text": "Im ländlichen Maine kümmert sich die frisch verwitwete Kinderpsychologin Mary um ihren gelähmten Sohn Stephen. Der Druck ist riesig – und als auch noch Patientenkind Tom in einem Schneesturm verschwindet, dreht die schwer Angeknackste völlig am Kabel: In fast schlaflosen Nächten verschwimmen Albtraum und Realität, unheimliche Schritte knarzen durchs Haus – und plötzlich liegt jemand mit im Bett. Ist das etwa Toms Geist? Der Grusler Shut In sorgt schon mit seinem eingeschneiten Setting für ordentlich Stimmung, die Kino-Neuling Farren Blackburn mit einer wandernden Kamera, tausend dunklen Ecken und einer panischen Naomi Watts in der zweiten Filmhälfte in Hochspannung verwandelt. Das mit The Shining-Zitaten und einem gut gelaunten Oliver Platt gespickte Ende ist zwar unglaubwürdig und übertrieben – aber unerwartet effektiv."}, {"rating": "2", "text": "They apparently attempted to set the record for most times knocking out the bad guy and then dropping the weapon, turning their back on him and hugging, only to have him come back with a vengeance.  Shotguns, hammers, oars, you name it.  If it could be used to their advantage, it would be abandoned.  The movie looked like a real movie and the acting was adequate, but the writing and directing were student level."}, {"rating": "4", "text": "It's not scary, it's lame, it's stupid, and it's boring, i didn't hate it, it just a pure bad film, it's weak because of a too much predictable jumpscare, stupid story, and bad performance by all the cast except Naomi Watts, she did a pretty fine job, i felt really fast while i'm watching the movie and thank god for that, the movie just straight to it and that's probably one of the few things that i like, but overall movie, Shut In is still not a recommendation."}], "recommendations": ["house_at_the_end_of_the_street", "hereditary", "the_happening", "old", "chernobyl_diaries", "bird_box", "countdown", "would_you_rather", "dark_skies", "devil", "the_curse_of_la_llorona", "the_mist", "malignant", "ouija", "the_bye_bye_man", "the_new_mutants", "the_devil_inside", "next", "the_strangers", "unfriended_dark_web", "awake", "marrowbone", "annabelle", "the_loft", "paranormal_activity_4"]}