{
  "id": 562,
  "title": "Sicario",
  "starring": [
    "Emily Blunt",
    "Benicio del Toro"
  ],
  "runtime": 122,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "An idealistic FBI agent is enlisted by a government task force to aid in the escalating war against drugs at the border area between the U.S. and Mexico.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lz8vNyXeidqqOdJW9ZjnDAMb5Vr.jpg",
  "categories": {
    "plot": 8.344827586206897,
    "acting": 8.603174603174603,
    "ending": 8.5,
    "soundtrack": 6.6,
    "cinematography": 8.571428571428571,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 8.607142857142858
  },
  "reviews": [
    {
      "rating": "10",
      "text": "GREAT movie, that was entirely undersold by the trailer.  I actually think that Josh Brolin seals the show. Can't imagine there will be many better movies for the mainstream moviegoer this year.  Of course, there will be long, boring biopics trotted out for Oscar season, but for my money, this very narrowly tailored and spare film will beat them all. Everyone in my theater was on the edge of their seats.  Phenomenal stuff."
    },
    {
      "rating": "5",
      "text": "Pretty much no story whatsoever, the trend of female and black guy continues, both characters absolutely useless and added only for \"diversity\" reasons. Solid audio visuals, though the soundtrack is bland and forgetable. Worth seeing only for Benicio Del Toro."
    },
    {
      "rating": "6",
      "text": "The directing and cinematography were great. The overall performances were solid. However I can't get past how poorly written the main character is, (Emily Blunt) or her partner. There's something missing when they get the short end of the stick in the story. Almost feels like several key scenes were cut that would've given Blunt's character more of an active role in everything. Whatever the reason for the oversight, it's still an action packed movie worth watching, just not best film of the year."
    },
    {
      "rating": "6",
      "text": "Keeps interest with gritty visuals and interesting characters, but Emily Blunt is completely miscast as the hand-picked local law enforcement to assist in a larger drug operation that plays fast and loose with the law.  Blunt, sold early in the film as a tough-but-moral cop (and her toughness is a hard sell, indeed) makes one bumbling, naive move after another as the chaos of the drug war is revealed to her.  From a plot perspective, ultimately her roll in the drug operation really doesn't make much sense, and it doesn't take much thought to imagine a ton of other FBI better suited to the overarching goals.  Vague, I know, but I can't say more unless you want spoilers.Setting aside Blunt, a side story of a Mexican State police officer who smuggles drugs never really goes anywhere save to humanize some of the low-level traffickers \"just trying to put food on the table\".  Of course he loves his son.  Of course his wife is worried and prays at dinner.  Of course his son plays soccer.  Lastly, if you like films with military operations, tactics and so on, this isn't your film.  Literally in the first couple minutes, Blunt is on an FBI operation to bust a drug house in full body armor, assault weapons and a troop carrier.  As they're searching the house yelling tactical stuff like \"room clear!\", Blunt walks into a room without looking(!!), and the cliche bad guy with a shotgun is of course standing right out in the open, and of course is going to shoot it out despite dozens of agents swarming the building.  He manages to miss from five feet away, but ol' quick draw Emily Blunt spins and pumps him full of lead.  He falls to the ground still clutching the shotgun, and Blunt walks right up to him, doesn't neutralize his weapon and then checks his pulse.  For a film trying to do gritty realism, it doesn't fly."
    },
    {
      "rating": "6",
      "text": "A would-be thriller that never quite lives up to its potential, due to numerous lapses into labored storytelling. The film's superb action sequences, beautiful cinematography, fine performances and haunting soundtrack are real stand-outs, but, unfortunately, they're undercut by uneven pacing and the inclusion of a little too much padding. With a little tightening up, this could have been a much better effort."
    },
    {
      "rating": "8",
      "text": "Sicario is a great follow up from Prisoners by director Villenueve. The cinematography is excellent and score is heart thumping. The movie keeps an intense atmosphere from beginning to end."
    },
    {
      "rating": "10",
      "text": "I want to divide this review into 5 parts: Directing, Cinematography,Writing,Score and finally Acting.\rLet's star with Directing - I thought that directing was phenomenal. It seemed that all of the main actors were on the same page as far as the movie should go. And portrayed their roles perfectly. All of the actors worked together like a well made Swiss watch. Denis Villenueve masterfully managed to capture the intensity and suspense of this mesmerizing thriller. The director cemented his name as one of the best if not the best thriller masters in Hollywood today.  I would rate it 18/20\rCinematography - Was really impressive, and manages to capture the audience from the first shot of the movie and never let go of the viewer. The lightning seems bleak, but that just adds to suspense of the movie. There were a lot of impressive shots, including the very well made aerial shots of the USA - Mexican border.  I would rate it 17/20\rWriting - A movie is as good as it's script. Well in this case it's marvelous. The movie delivers everything it promises and more. It manages to deliver the thrills and sense of intensity from the start. All through out the movie, viewers are encouraged to question every single character, because the line of good and bad in this movie is very thin.  20/20\rScore - The composer Johann Johannson manages to do a very good job. Score is done to perfection. Every bit of sound seems to fit the frames perfectly and just helps to add the thrills.    I would rate it 18/20\rActing - A give a very big A plus for all the actors in this movie. Like i mentioned before, everyone fitter the role pretty much perfectly with good casting. All of the actors performed very well, so it is very difficult to mention some in particular. It seemed like every actor added something personal to the role, that made them very memorable. The chemistry between actors was something special, every relationship between characters was really intensifying, and mesmerizing.    I would rate it 20/20\rNow for the MVP of the movie is: Jon Bernthal, who truly might have slipped under the radar. But his performance was both memorable and amazing. Even though he didn't have very much of a screen time, what he did with what he got, was really masterful. He deliver a bad cop, who does not give a bad impression and hides under a mask. His character is like a wolf, disguised himself as a sheep.\rIn Total i would rate this movie - 95/100. One of the best thrillers ever made, and one of the best last years movies."
    },
    {
      "rating": "9",
      "text": "Ultimately a grim and strong movie that accomplishes and serves its theme.\rThe movie is far from a movie that is suppose to leave you in awe, it's a movie that serves to paint the dark and true terror of a very, very real social issue.\rA great movie to watch alone."
    },
    {
      "rating": "7",
      "text": "Tough film to watch at times with depictions of drug cartel savagery, but it provides insight into black ops against drug kingpins. Josh Brolin portrayed well a confident, laid back \"Matt\", and Benicio Del Toro was convincingly menacing as \"Alejandro\" aka Sicario, however, Emily Blunt made for a poor \"Kate\". I'm not blaming her, she's a great actress, I'm just saying she was wrong for the role and that took away points from the film because she was more distracting than immersed. The final few scenes of the film were so anti-climatic, too, with \"Kate\" pointing her gun at \"Alejandro\" yet again when she was warned not to, and the final soccer field scene. I understand what the director was attempting but it didn't measure up to the prior events. Really needs a more worthy ending if/when someone remakes it."
    },
    {
      "rating": "9",
      "text": "Scorching with the dry and arid heat of the desert land, an aerial view of Phoenix, Arizona fills the opening screen of French Canadian director Denis Villenueve’s newest feature Sicario. Sweaty, pulsating with uncanny tension and trumpeting with constant uncertainty, it seems that the land in which Sicario is based on is inhabited solely by the ravenous animals of the desert; and no, it isn’t referring to the four-legged desert beasts hungry for blood.\r Premiering at the Toronto International Film Festival earlier in the season, Villeneuve’s newest film seems to touch upon a current trend plaguing all new outlets, artistic commentaries and current events; immigration, and not just at a national level, but from a very large and vast international one.\r Sicario takes places in the rural desert areas of Arizona and Mexico, setting the tone for a very corrupt and dangerous world where Mexican cartels rule the land, and the sounds of gunshots are as frequent as the cries of wolves. Drug cartels keep citizens in fear, police are as corrupt as the cartels themselves, and the efforts of the United States and their universal judiciary right for “peace” is as subtle as the low-efficiency Black SUV’s snaking their way through the hot highway pavements. With the high exposure of Trump’s high-attention media-driven campaign, as well as age-old conflicts between land, boarders and people in other areas of the world, the issues of immigration are as universal as the numeric system, which makes Villeneuve a perfect candidate to direct a wrought, unbiased and highly effective piece of fiction and reality.\r Yet, with all its high-profile media attention and concurrent position in all the headlines, Sicario doesn’t soar to its conventional storyline of corruption and intrigue of mystery for loyalties and alliances; the film itself exceeds due to its honest portrayal of people playing people, dealing in real ways with the abundance of injustice and violence.\r The spearhead of these real people is highlighted by the impeccable performance from Emily Blunt. Blunt, who trades in glam for grit, plays Kate Macer, an idealistic Special Weapons and Tactical Team agent who believes in justice and the greater good. During a routine kidnapping raid, Macer and her trusty partner, Reggie Wayne (Daniel Kaluuya), encounter a total of forty-two corpses hidden within the walls of the abandoned home, as well as an explosive device that detonates, killing two officers, and wounding Kate and Reggie. With the aftermath of the explosion behind them, Kate is offered a position working for the CIA and Department of Defence, lead by the egotistical and reckless Matt Graver (Josh Brolin). Using brute force and unconventional and highly illegal methods of dismantling the Mexican drug cartel, the special unit, paired with the help of a very mysterious and highly intimidating Alejandro (Benecio Del Toro), break the rules of law in order to get their men.\r Sicario is an uncomfortable film, in every sense of the word. Recommending the film would be a hard sell. If it wasn’t for the always spectacular Del Toro, who chimes in an Oscar worthy supporting performance that requires very little dialogue, but masterful minimalist acting, the film itself isn’t the most commercial in theatres. The intensity of the film stays true to the very blurred lines of federal justice while crossing State lines; constantly being under strict surveillance. Although the characters seem to be always out of their own jurisdiction, Kate seems to be the teams only voice of reason. It becomes quite clear early on, that everyone else in the ops are crossing the rules of the terrain, forcing Kate to bend her very strong and unwavering moral conscious. What might appear to be a very annoying character trait, in reality becomes a selling feature as Kate’s ability to humanize the very barbaric people around her is something audiences admire, not begrudge.\r Much like the memorable performance from Del Toro’s Alejandro, Sicario embodies the characteristics of the most memorable strong, silent type characters in cinema. Without over-stimulating the senses in the way Hollywood knows how to, Sicario never lets up its aggressive demeanour, despite its scarcity. Thanks to the wonderful work of Jòhann Jòhannsson (Prisoners, The Theory of Everything, Foxcatcher), who sets an unsettling score with natural sounds of harmful creatures (buzzing of bees, howling of wolves), the film’s score paces the very slow moving material at a very heavy and fluid pace. Matched with the wonderful cinematography of master Roger Deakins, the confident and tremendous direction of Villeneuve, and phenomenal transformation of Blunt as Kate, Sicario is one of the most, if not most, complete films of 2015, in all regards, cinematically speaking.\r Visually, the film is a diamond in the rough."
    },
    {
      "rating": "9",
      "text": "Excellent, serious film that touches on interesting themes like moral ambiguity that makes the viewer question his own beliefs and view of the world. The truth is, it may be impossible to fight horrendous criminals like the cartels when your hands are bound by rule of law, but does this justify the things we see? This is what films should do - make us think, question, discuss. And Sicario does an excellent job of that.\r I think a lot of people dislike how helpless the protagonist (Kate) is, but to me it just adds realism. There are so many situations in real life where the \"good guys\" are simply powerless to do anything.\r My only criticism is that the film was a bit predictable - it was pretty obvious that nothing would happen to Kate, and unlikely that anything would happen to Alejandro."
    },
    {
      "rating": "7",
      "text": "\"Sicario\" is a solid, well directed and ambitious thriller. With terrific acting performances, impressive action sequences and a great ending, it definitely deserves the acclaim it gets."
    },
    {
      "rating": "8",
      "text": "Though slow at timesSicario is a bleak, brutal, and fascinating thrill ride with phenomenal performances, beautiful cinematography, and a wonderful score."
    },
    {
      "rating": "8",
      "text": "Sicario is a very well directed and beautifully shot movie that follows an FBI agent who is enlisted by a governmental task force to aid in the escalating war against drugs.The film is directed by Denis Villeneuve and the lead stars are Emily Blunt, Benicio del Toro and Josh Brolin.\rThe main things that stand out from this movie are the acting, directing and the brilliant cinematography from the amazing Roger Deakins who can do no wrong.Everybody in the movie is amazing, especially Emily Blunt, who is traumatized most of the time and this is certainly one of the best roles I have ever seen her play. Benicio del Toro also really surprised me and his character is really mysterious.\rThe action in this movie, while there's not much of it, it was still great and very intense. Also, the score is amazing by Jóhann Jóhannsson and it totally deserved the Oscar nomination.\rHowever this movie is very slow in some parts and it feels like it's dragging on for quite a while. There are some good intense sequences but at the same time some slow parts that go on forever. The ending is also weird with a surprise twist.\rNonetheless I enjoyed this movie but I wouldn't say it's one of the 2015's best."
    },
    {
      "rating": "9",
      "text": "Daha önce işlenmeyen bir konu ancak bu kadar güzel aktarılabilir. Kaliteli oyunculuklar, kaliteli sinematografi ve kaliteli hikaye. Nerdeyse kusursuza yakın bir atmosfere sahip. Türü severler mutlaka izlemeli."
    },
    {
      "rating": "9",
      "text": "Sicario is a film of beauty and terror. Stunning cinematography, raw character emotion and a gripping soundtrack demonstrate the sheer class of director Dennis Villeneuve. Whilst the final act drops off the pace in comparison to the stunning first two, the final shot manages to display the overall message of the film expertly, an overall message that will leave you haunted by what occurs outside the realms of household safety."
    },
    {
      "rating": "8",
      "text": "Sicario is a great follow up from Prisoners by director Villenueve. The cinematography is excellent and score is heart thumping. The movie keeps an intense atmosphere from beginning to end."
    },
    {
      "rating": "8",
      "text": "Sicario is directed by Denis Villeneuve, written by Taylor Sheridan and starring Emily Blunt, Josh Brolin and Benicio Del Toro.In the lawless border area stretching between the U.S. and Mexico, an idealistic FBI agent [Emily Blunt] is enlisted by an elite government task force official [Josh Brolin] to aid in the escalating war against drugs. Led by an enigmatic consultant with a questionable past [Benicio Del Toro], the team sets out on a clandestine journey forcing Kate to question everything that she believes in order to survive.A great fast-paced, dark and powerful story, with an amazing direction adding some very talented cast, but with a couple of flaws, this is how Sicario was born.Let's jump to the flaws.. Emily Blunt's character wasn't so necessary, she had no goal but just going with the waves of this movie, but with her amazing performance, she convinced me -or I pretended being convinced- that her goal is cleaning the world of it's dark crimes, but for me, it's uneven.Some scenes were so confusing, and there was nothing to give any hope, it's just dark.. from the beginning to the very very end!These are the flaws of this movie, everything else was well made.. the breathtaking scenes mixed with amazing performances with great story.Sicario is a great movie, and I'm gonna give it an A-.Alright, next one is Sicario: Day of the Soldado, stick around. And thanks for reading my review, wish you like it."
    },
    {
      "rating": "5",
      "text": "The problem with Sicario is that it is too much of an infuriating mystery before it becomes anything else. After a stunningly horrific opening the film meanders disappointingly before advancing the story in to any meaningful or understandable context. Dealing as it does with the drug trade between Mexico and the states, the picture is predictably violent requiring constant viewer attention, but is never boring. The screenplay is generally fine, but there are definitely situations that are questionable plot contrivances (Officials fast tracking cars through the border only to have them caught in a traffic jam; The pointless act of obtaining Blunt’s signature to stop her talking, and even Del Toro’s motive for his involvement in the operation). The traffic jam shootout is actually a very good set piece and, whilst the film may take its time for three quarters of its length, there is no denying the power and tension created in the last half an hour. The sound and music add volumes in atmosphere and the performances of the three leads are good.\rJosh Brolin and Benicio Del Toro both play unsympathetic characters. Brolin comes over as smug and confidently self-satisfied whilst Del Toro, giving the film’s best performance, is a silent and mysterious character who can turn impassively violent in a heartbeat. Surprisingly, given the early buzz on her role, Emily Blunt’s character turns out to be very reactionary to the males around her. For much of the running time she hasn’t a clue as to what is going on and seems to be there either to be brutalised or ignored, appearing naïve and out of her depth. Considering that this is the type of lead that would normally have gone to a male star it is all the more surprising a let-down. This is definitely not a performance heading for an Oscar nomination despite her excellence at what little is required of her."
    },
    {
      "rating": "9",
      "text": "My movie of the year so far.  Villeneuve's shots are beautiful, and his control of pace and tone are really unmatched these days.  The intensity in some of those tunnel sequences and pursuit scenes is palpable.  Felt a little like the second half of Zero Dark Thirty.  Blunt is obviously solid, but Benicio is over-the-top incredible. Probably his best performance in a now-long career.  A great companion piece to this film is FX's \"The Bridge\", which touches on many of the same Juarez-related issues."
    },
    {
      "rating": "10",
      "text": "I couldn't breath at all from the beginning! this is the best movie I ever seen this year!\rIt could be 1 of 10 best movies this Year on My choice.\rEmily and Del Toro were amazing!!!!"
    },
    {
      "rating": "8",
      "text": "If you like Michael Mann films then you will probably like this. Not a particularly inventive film but it does have it's fair share of very captivating moments and some thrilling short and sweet action sequences. Some of the characters (including Emily Blunt's) feel a bit by-the-numbers and some of the story arcs were quite predictable. Del Toro stole the show."
    },
    {
      "rating": "10",
      "text": "Unbelievable. A story highly worthy of being told. A very entertaining and flawlessly executed movie. del Toro is incredibly powerful. Blunt delivers an effective performance. And Brolin has evolved and delivers his performance with biting charm.  Its only equivalent is The Dark Knight by Nolan, with del Toro almost reaching the heights of the Joker."
    },
    {
      "rating": "9",
      "text": "Excellent across the board.  Great plot, solid acting, and wonderful camera work make for a totally engrossing and entertaining film.  And beneath it all runs a brilliantly dark sense of humor.  My kind of movie."
    },
    {
      "rating": "9",
      "text": "Having seen Prisoners and Enemy by Denis Villenueve, I have a very high expectation going to the theater to see Sicario. Personally, I put Sicario behind Prisoners and Enemy judging from how great Jake Gyllenhaal's acting for both movies, originality and the intensity that keeps you on the edge of your seat. Overall, Sicario is still an amazing movie and one of the best of this year so far.\rAs the main character, Emily Blunt gives a perfect performance that make us feel and empathize what she is going through throughout the movie. We can feel her frustration, pain, anger and disappointment through her face with just few dialogs. The very last scene really did it for me and it broke my heart. However, Benicio Del Toro as Alejandro gives the best performance of the whole movie.\rThe writing in this movie is amazing.  There are a lot of questions raised in this movie and they answer them seamlessly and perfectly at the right time just to keep us entertained until the very last scene.\rThe cinematography in this movie is the one that really blows my mind. There are a lot of scenes that you just think \"Wow, that is really beautiful\". However, for me this is also one of the weakness of this movie because they just keep showing you these beautifully shot scenes that is not necessary to the storyline given the limited amount of dialog and longer runtime of this movie."
    },
    {
      "rating": "9",
      "text": "I thought the beginning of Sicario was sleep-inducing, but others might consider it tense and suspenseful. However, after about the first half hour, I found the movie riveting. I thought the cast was great, especially Benicio Del Toro and Josh Brolin, but they played the most exciting characters. Emily Blunt, on the other hand, had the most difficult role as the “pawn in the game,” yet you were always interested in her and what was happening to her even though she was as confused and suspicious about what was going on as the audience was most of the time. To make a character like that sympathetic is a neat trick. The movie also managed a message about the “drug wars” – which was perhaps the neatest trick of all – about why they exist at all and how cruel they are, which puts the movie a cut above most action films where the violence is simply meant to entertain."
    },
    {
      "rating": "10",
      "text": "Wow this was well made. excellent performances, excellent direction, music, everything was really well done. It was good to see Benecio del Toro in excellent form.  A gritty film full of people being exploited for their beliefs.  A better movie was not made this year."
    },
    {
      "rating": "10",
      "text": "Sicario is my favorite film of the year,it is also my second favorite Denis Vileneuve film ,next to prisoners,it combines a superb cast,delivering top-notch perfomances,great-intense action,mixed with breathtaking cinematography from Roger Deakins,to add up to a fantastic thriller,worthy of Academy nominations in all departments.\rEmily Blunt plays a convincing ,by the book,FBI special agent ,whose own naive attitude and nature,gets put to the test as, she's taken into a world ,of mass murder,mutilation,drug wars and political and civilian unrest in the city of Juarez Mexico.She manages to be both cunning and relatable so that no moment feels wasted,whether it is her questioning the indiscriminate, often times risky and reckless,yet surprisingly effective working methods of her newly assigned teammates,or whether she is just throwing up after seeing over a dozen dead bodies being stuffed into walls,like forgotten painting,that lost their use.While Benicio Del Toro,gives the best performance in the movie,that may be told from Blunt's character's Kate's perspective,but the film rightfully belongs to him ,as his emotional arc is deeply intriguing and his past viciously brutal and impactful.Del Toro's Alejandro,is one of the coolest,meanest,and quietest hitmen we've seen all year,decade even,he may not say much,but when he does it means more than the actions of all the characters in the film combined,it's his best work I've seen and rightfully so.While Josh Brolin provides some nice humorous exchanges and masterfully hides his inner motivations and intents,delivering an almost cowboy-like attitude,with a handful of moral lessons to be taught to both Kate and the audience about war,peace and the borders between.\rThe world of Sicario,is bleak and hopeless,at no point is there a scene or a line or a visual symbol of some sort that indicates that there is still hope in Mexico,the drug war and those involved on both sides are so animalistic in the ways they fight each-other, that the lines are constantly blurred,and the only way to differentiate them from one-another, are uniforms and badges,take those away and you have yourself a gang war.The drop-dead gorgeous cinematography and direction by Villeneuve and Deakins works brilliantly in the movie's favor of delivering the said message.Incredible wide shots of the city,almost looking like a post-apocalyptic desert at times,gives off a sense that these people are quite literally in hell,that they took part in creation of.The action is superbly directed from a filmmaker who never really had action sequences in their past films,yet are capable of dramatizing and intensifying dialogue scenes and regular character exchanges ,more than some filmmakers can with pure action.The set-pieces in this film are peppered and expertly paced throughout,including a terrific shootout on a Mexican border,a thorough opening raid scene ,which leads to unexpected and deadly discoveries.The night-time apart from looking absolutely beautiful and actually darkening the faces of the characters ,without them being in open lit by lamps or lights or even city roads,has an eerie foreboding sense to it and the short gunfights that erupt in it ,with the use of goggles are spontaneous and frenetic ,adding kinetic energy and adrenaline,that lasts, throughout the whole movie.\rSicario is one of the best action films of the year,which cleverly tells a rather traditional drug-bust story,while actually delivering a swift,profound and touching message with it,in addition to towering performances from everyone in the cast,it excellently conveys its dark atmosphere with exquisitely good-looking visuals ,superb direction and the film just like it's lead character,says as much as it does and means more than meets the eye (or ear for that matter).It may not be as good as prisoners,but it certainly proves,why Villeneuve is the perfect choice for Blade Runner 2."
    },
    {
      "rating": "7",
      "text": "I, much like the lead character in this movie, never quite made a connection with what is supposed to be the plot of the movie.  Don't get me wrong, it's a good movie, but I never felt like the character relationships were believable as they were portrayed which was made more difficult with the \"gritty\" storyline."
    },
    {
      "rating": "10",
      "text": "Amazing movie! This movie will generate a response from every emoting you have, keep you on the edge of your seat then spit you out begging for more. Seriously this movie completely rocked the audience in such a dramatic manner that not a person in the theater said a word while exiting the movie. The silence from overwhelming, thought provoking satisfaction. Josh Brolin, Benicio Del Toro and Emily Blunt were perfectly cast for these roles."
    },
    {
      "rating": "8",
      "text": "What a movie, It is second movie of Director Denis Villeneuve I have seen and both time i said the same. Perfect cast and breathtaking cinematography and background score. Emily Blunt starts the movie with stunning performance but its Del Toro to whom this movie actually belongs. Actor takes torture and perfect assassin to another level.\rI did not expect any less from the director of Oscar Nominated Incendies and i was not disappointed."
    },
    {
      "rating": "9",
      "text": "Genius. Denis Villeneuve did it again.\r Sicario is the kind of drama/action movie you wanna see. The tension and emotions are present 110%. The whole time I could not stop asking myself the question ''Who will pull the trigger first?''. You don't really trust anyone except Kate (Emily Blunt) - who is not trusting anyone either. Every time an ally is met, that ally either dies or betrays someone.\r Very efficient movie. Brilliant script & actors. Camera works is A1. Go watch it. Now."
    },
    {
      "rating": "10",
      "text": "OMFG. I can't emphasize enough in this review how much I absolutely loved this movie. I just finished watching this movie at 10pm and I had to get this review out ASAP. I will start with the story which is cliché but it's also indomitably told in real time. I know a handful of movies that use flashbacks to tell the story but this one doesn't and I enjoy that fact. I will say this much about the story that it's about an FBI agent tasked with helping a non-disclosed agency take down a Cartel. I will now move onto the acting which brought there A-Game for sure. The cast is incredibly strong with Emily Blunt,Josh Brolin and Benicio Del Toro being the main three characters. They are all fascinating but Del Toro in my opinion blows the movie out of the water with his character. They all have fantastic rapport. I will now move onto the action which while this isn't a Michael Bay movie the scenes that do take place are on point with excruciating detail that it boarders realism. The scenes are violent and bloody and are meant to invoke a certain feeling of awe and dread simultaneously. I must also talk about the cinematography which was done by Roger Deakins who is a mastermind when it comes to the angles and etc of the film and it's absolutely Phenomenal in every aspect and it brings the movie to life and the sounds of everything in the movie from the gunfire to the city aspect will leave you transfixed onto the screen. The banter between the characters including the Delta Force Operators is impeccably done. The director Denis Villeneuve was terrific and I applaud him for such a powerhouse of a motion picture. I will finish by saying this is my new favorite movie of 2015 which prior was \"Mad Max: Fury Road\" but this takes the whole bakery. I would recommend watching this movie without a doubt. A Masterpiece rapped in a bow."
    },
    {
      "rating": "8",
      "text": "Sicario is a dynamite hybrid of Homeland and True Detective. It’s a gritty examination of Mexico’s dire drug problem and it’s effects on the USA. Outstanding  cinematography - of a landscape that is character in itself-  and music that heightens the tension  combine with Villeneuve’s superb storytelling and intense performances especially by Emily Blunt- who holds her own in a tough male dominated world. It’s a movie that could propel Trump into the oval office - with it’s own solution."
    },
    {
      "rating": "10",
      "text": "Who: Emily Blunt, Daddy Warbucks, and Brand from the Goonies as Matt Graver\rWhat: The best movie ending since No Country for Old Men\rWhere: Drug filled cities too gruesome for Breaking Bad\rWhen (can I watch again): Almost immediately\rWhy: So you can walk away from the film feeling so futile nothing else in life matters...but in a good way"
    },
    {
      "rating": "8",
      "text": "Very good \"Heart of Darkness\"-type film. Not a masterpiece by any means, but it gets across its ideas through a well-paced plot and, overall, some great acting (Blunt being the weak link here by a good margin).  Superb atmosphere and some truly, truly beautiful cinematography, although the \"grittiness\" is at times shoved down your throat.  I found it very akin to Zero Dark Thirty.\r Del Toro, Kaluuya and the guy from Burn Notice turn in great performances.  Brolin does a great job as an off-the-grid loose cannon and brings home the comic relief."
    },
    {
      "rating": "10",
      "text": "One word. Outstanding! Movie full of understatements, but obvious. Great atmosphere primarily with photos and music. all delicious. highly recommend to anyone who love action and true stories."
    },
    {
      "rating": "10",
      "text": "Sicario is a film that engulfs you in a nasty world of drugs and deceit. It is easily one of the best examples of excellent filmmaking in many years. The plot follows an ambitious FBI agent (Emily Blunt) who gets called to Juarez, Mexico to take town the dirty and come down with the clean, unfortunately, a dark hitman (Bencio Del Toro) and a seedy agent (Josh Brolin) come in her way and eventually destroy her from the inside. Plot twists are key here and director Denis Villeneuve makes sure of that. Lies, cheats, violence, it all bends together in the shocking climax that I won't forget for a long time. It has been nominated for a Palme De Or and I hope it wins. A must watch."
    },
    {
      "rating": "10",
      "text": "This is a movie I didn't need to see as the subject matter was too dark for me, but I saw the whole movie. Amazing writing and acting. You see how the bad and really bad characters do have some feelings, but only for their families as they do awful things. Only Emily Blunt's idealistic character thinks it can be fixed the right way with normal actions. By the end of the movie, you realize bad people are the only ones who can possibly break up this evil. Amazing acting job from Benicio in retaining our sympathy as he commits atrocious acts! Josh added the right comical balance that made me keep watching despite the fact that I did not like the story. The movie depicts another instance of human depravity that is happening today."
    },
    {
      "rating": "9",
      "text": "Great to see a proper film (at last) this year. I was getting worried. Script is concise and very \"non Hollywood\"(the best way I can describe it) so no daft exposition here. Lovely cinematography, the shot as they walk into a sunset is a corker. But its the tension build that's the real kicker here, you know that the scenes are building to a climax but there is a real sense of anticipation. Best movie of 2015 for me so far."
    },
    {
      "rating": "9",
      "text": "Sicario is a completely engrossing, beautifully shot, terrifically acted thriller that exceeds expectations. I didn't know what to expect from this film, but I was surprised that from the opening shot the film had me hooked. I won't give away the opening scene, but I'd find it hard to believe that you're bored after seeing that. Emily Blunt and Benicio Del Toro are easily two of the better performances I've seen this year, and as per usual Villeneuve get's terrifically dark performances from his brilliant cast. Villeneuve's taut direction, combined with beautiful cinematography, and an amazing score, make Sicario one of his best in his constantly growing filmography. The end result is a great movie, that will almost definitely get recognition at award season."
    },
    {
      "rating": "9",
      "text": "Took my wife to see this movie and we both loved it. The action pieces were amazing and during some of them it had me feel like I was there. It's hard to explain but at times the characters would look into the camera and make it seem like they were looking back at you. Amazing. I recommend this movie to anyone who has an interest in military intelligence and black ops as there was a heavy focus on this."
    },
    {
      "rating": "8",
      "text": "An idealistic FBI agent (Emily Blunt) joins a special task force (including Josh Brolin & Benicio Del Toro) that uses questionable tactics to fight drug traffic between Mexico and the US. This intelligently-written film unfolds the complex narrative by withholding information, reflecting the agent's own confused state. The style of director Denis Villeneuve  sometimes calls attention to itself with atypical camera placement, but he also makes uncommon choices that heighten the drama. Blunt effectively pulls off the mix of tough confidence and vulnerable bafflement. This film rejects typical drug crime tropes for a more cerebral approach that still has visceral moments of violence."
    },
    {
      "rating": "8",
      "text": "The conflict here is, naturally, within Kate, and takes the form of a struggle between a desire to go strictly by the book and generate prosecutable cases on the one hand and, on the other, the attraction of using extra-legal means to knock off kingpins and make a real difference.  I’ve seen few U.S. movies about the border war on drugs. \" Traffic\" comes to mind.  There must be others.  \"Traffic\"was a good movie (Metascore 86), but I like \"Sicario\" even better—director and composer instill a sense of menace and extreme jeopardy, suspense builds to great concluding scenes (will likely make my top 10 for 2015).  Warning:  Movie is bloody and occasionally gruesome—nothing truly over the top by today’s standards but just a tip to the more sensitive types."
    },
    {
      "rating": "9",
      "text": "Director    Denis    Villeneuve    does    a    phenomenal    job    crafting    a    visually    striking,    intense,    atmospheric    thrill    ride."
    },
    {
      "rating": "8",
      "text": "Confused and crushed sums up Emily Blunt's character in Sicario.  And that is how the director intends for the audience to feel.  But the confusion prevents us from a deeper connection with \"Kate\" as we struggle to understand what is happening and why.  It is a testimony to EB's skill that we remain involved with Kate/Kat whose curiosity does lead to her undoing.  If Sicario had focused more on her moral quandary (duty and greater good versus breaking the law and doing bad things) and less on her drive to understand, she would have been much more believeable.  Instead, we want to shout \"who cares why, just walk away from this moral morass\".  I am tempted (a little) to watch Sicario again without the confusion.  But no, I'm not that curious."
    },
    {
      "rating": "8",
      "text": "This film gives you a sense of dread in almost every minute of the film.  Sicario kind of reminded me of Training Day a young cop wanting to help make a difference, but is stuck in a world with no hope.  A-"
    },
    {
      "rating": "9",
      "text": "An expertly-made and very intense film all around! Emily Blunt, Benicio Del Toro, and Josh Brolin each gave top-notch performances. Almost every scene presented in the film provided great tension or suspense in one way or another. Even the sound really stood out. I normally don't pay great attention to little details like that in films, but the sound of the guns among other things sounded so realistic, giving the film even more of an unexpected sense of realism. The story was intriguing, well-written, and often kept me fixated and wondering what was going to happen next. Overall, despite kind of a slow pace towards the beginning, the film quickly picks up and doesn't let go until its final moments. It's also another great and notable achievement from director Denis Villeneuve and his best work since Prisoners!"
    },
    {
      "rating": "10",
      "text": "Sicario is a powerful movie, an important movie.   It’s the best movie I’ve seen so far this year.  The casting is perfect.  Benicio Del Toro is superb.  His performance is easily worthy of an Oscar nomination. Josh Brolin and Emily Blunt are also extremely good.  As a hardened movie watcher, this is my kind of movie.\rThe movie maintains a consistently high level of dramatic tension.   It also has the necessary level of believability and realism.  While the level of violence is very high, it’s not what I would consider gratuitous.  Sicario isn’t as dark as No country for Old Men, but if you tend to hide your face at such movies, then Sicario probably isn’t for you.\rEmily Blunt plays a by-the-book FBI agent who volunteers for an assignment being run by James Brolin, purportedly under the auspices of the Department of Defense, to disrupt the Mexican drug cartels.  The ruthlessness of these drug lords is unquestioned, a point evidenced through scenes of mutilated bodies hung from ropes beneath city bridges in Juarez, Mexico, and further driven home when Del Torro suggests to Blunt that the victims probably didn’t even do anything wrong, the drug lords simply want people to know that this is what happens to you if you do something they don’t like.  Juarez, which is just across the border from El Paso, is one of the deadliest cities in the world.\rThe story is a twist on a couple of old tropes.  In Sicario (and maybe in real life), America and Mexico are losing the battle against the drug cartels.  Brolin has been authorized to do whatever it takes to turn the tide.  Benicio Del Toro, whose background is even murkier than Brolin’s, has been enlisted to help.   Blunt is recruited to join the team for reasons that aren’t revealed to her.  She’s neither a new agent, nor a jaded veteran.   She’s been exposed to some hard core violence and death, and she’s performed well, but she’s not a fully seasoned veteran.\rAfter joining Brolin’s team, it quickly becomes clear that Blunt is in way over her head.  In addition, she strongly objects to the methodology employed by Brolin as being both illegal and immoral.  (If your enemy is helpless and you kill him, are you any better than your enemy?)\rThe film maker wants you to agonize over is whether Blunt is right or wrong in her convictions.   As if to further inflame the tension, the movie pits masculine against feminine.  Blunt is the only female in the group.  The movie taunts you with a female lead character that may not be as smart or as wise as you would like her to be.  But this is red herring, meant to test you’re feminist sensitivities.  As an actor, I like Blunt a lot, and to her credit, she takes the role that she is given and she plays it great.  But, in the end, Del Torro dominates.  In the not-soon-to-be-forgotten closing scene, Benicio tells Blunt to, ‘go home, you’ll never survive here.  This is the land of wolves and you’re no wolf.’\rWhen Oscar time rolls around, you’re going to hear a lot of people say, “I never heard of that film, what’s it about?”  Don’t be like that.  Go see this film."
    },
    {
      "rating": "8",
      "text": "Villenueve is an incredible director. With an astonishing opening that’s gritty and visceral, and bringing incredible foreshadowing with the motes of dust you can see why people are pumped about this film.\rThe gore is brief but effective. The violence is covered and not made to excite, but is extremely effective. Denis shows how insignificant a good person can be in a male dominated world full of deceit and wrong doing. He shows we run in a cycle, and if you change something for the ‘better’, things always end up worse. In a way he shows chaos theory.\rEmily Blunt is a great character but it is Benicio Del Toro who is the biggest star of this, and in one scene with him towards the end of the film he had 75% of the audience in my cinema gasp.\rAn incredible film, although personally I’d say I enjoyed Prisoners a tad more.\r7.9/10"
    }
  ],
  "recommendations": [
    "the_rover",
    "you_were_never_really_here",
    "wind_river",
    "a_most_violent_year",
    "beirut",
    "a_most_wanted_man",
    "21_grams",
    "man_on_fire",
    "hell_or_high_water",
    "widows",
    "the_master",
    "ex_machina",
    "the_good_shepherd",
    "allied",
    "the_place_beyond_the_pines",
    "cold_mountain",
    "nocturnal_animals",
    "good_time",
    "body_of_lies",
    "prisoners",
    "bringing_out_the_dead",
    "the_beguiled",
    "heat",
    "casino",
    "whiplash"
  ]
}