{
  "id": 313,
  "title": "Sicario: Day of the Soldado",
  "starring": [
    "Benicio del Toro",
    "Josh Brolin"
  ],
  "runtime": 122,
  "genre": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Agent Matt Graver teams up with operative Alejandro Gillick to prevent Mexican drug cartels from smuggling terrorists across the United States border.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/msqWSQkU403cQKjQHnWLnugv7EY.jpg",
  "categories": {
    "plot": 6.40625,
    "acting": 6.431034482758621,
    "ending": 6.375,
    "soundtrack": 7.0,
    "cinematography": 6.166666666666667,
    "familyFriendly": 3.0,
    "funny": 8.5,
    "action": 6.651162790697675
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Sicario's sequel has good action sequences, though it doesn't feel as deep without Blunt's character it's still a good story."
    },
    {
      "rating": "6",
      "text": "Not a horrible movie, but fails to stand on it's own. The terrorism subplot is non-existent after the first 15 minutes of the movie, and throughout the film you're being led towards the inevitable \"Sicario 3\", which should have been condensed into this one to provide it with more substance."
    },
    {
      "rating": "5",
      "text": "The first film was intentionally slow with its noose-tightening tension; this is just often boring. Del Toro and Brolin are predictably solid but the film just sidetracks from the interesting “create a drug war” for a standard road trip. Wasted opportunities left and right."
    },
    {
      "rating": "6",
      "text": "We have come to another case in which a sequel that could be considered unnecessary reaches the cinemas.Although it's true that the story itself didn't need a continuation, I was interested and pleased to know that a sequel was in the works because Sicario was a really good film.I'm aware that many alarms went on with Emily Blunt's absence but for me there wasn't really a problem because I knew both Josh Brolin and Benicio del Toro could easily lead this new story.It was also confirmed that Taylor Sheridan would return to write the script but a monumental piece of the original film wasn't going to be involved, I'm talking about Denis Villeneuve.So now with the results at hand one should ask the most obvious question: His absence affected this film? Yes it did.Sicario: Day of The Soldier expands the story of the characters of both Josh Brolin and Benicio del Toro, they're now involved in a new battle against the Mexican drug cartels that now seems to be involved with terrorism.With that kind of theme you get a brutal, dark and violent story, however, even though Sheridan's script is good, it's not up to his original, especially because now it relies a lot more in the action sequences and the conflict feels a lot more thin.The film also feels hurried and compacted, trying to justify its existence and even though the story ends up on the right track it never got a real momentum or a truly emotional point.These elements end up hurting the film and its final part proves it by not granting any kind of resolution for any of the characters and even worse the story ends up open which is very upsetting.The trailers already called it the new installment of the Sicario saga so I can easily predict there will be a third film, although the numbers at the box office will play an important role in that decision.In the end what I can say is that I think the film was good but it's far from having the quality of its predecessor however I think it's worth it because the performances of both del Toro and Brolin are pretty good. The music is tense and atmospheric and to me the cinematography was also quite good.The film itself feels like a minor heir but I do think it's worth the shot.I'm definitely interested in a third installment because I would love to get some resolutions but I honestly hope and want better results."
    },
    {
      "rating": "5",
      "text": "decapitates the essential asset from the soul..Sicario : Day Of The Soldado2 And A Half Out Of 5Sicario : Day Of The Soldado is a character driven political thriller, whose urge to make a gut-punching point down the throat, makes it lose its lane from the plot track. The choreographed action packed invades or a road kill is, as always nicely done and speaks volume through it about the characteristics of the characters, just as it did on its first one. The camera work is stunning and it is beautifully shot and is immensely pleasing to encounter the visuals depicted in here despite of having such a dark tone of the feature. It is rich on technical aspects like cinematography, background score, sound effects, production design and editing.The script is well structured and builds up to its way in an even pace, keeping the audience engaged throughout the course of it and so are its pragmatic characters that are perfectly cooked. Its smarter and eerie perspective which was the key in the first installment is still present in here. Taylor Sheridan; the writer, as always delivers its enrooting and enraging political insight into the plot line but unfortunately it shatters into a bunch of distracted puzzle box, in its last act, which frankly no one cares enough to solve it out, narrowing it down to a predictable outcome. Stefano Sollima; the director, clearly whenever had its day into the vision, has got the execution aptly, but if not, it looses its grip quickly enough to dehypnotize the audience from it. The performance objective is safe and sound among the revisiting characters like Josh Brolin and Benicio del Toro and the new comers like Catherine Keener who didn't get much time to factor in effectively. Sicario : Day Of The Soldado decapitates the essential asset from the soul that was the primary fuel of its predecessor which is its poetic theme; it's a swing and a miss."
    },
    {
      "rating": "6",
      "text": "Unlike the first movie, this one doesn't have the main plot point and this is the main issue here. In Sicario we had a solid story about a soldier who tries to but can't withstand against a system and fails in every decision she make, that movie was more about psychology, rather than just obligatory \"we must defeat terrorists\" and it was awesome, Denis Villeneuve is a great director when it comes to a telling a story about a particular person and his feelings. Sicaro 2: Day of the Soldado in the first 20 minutes pretends the plot is about terrorists. Later on, movie suddenly claims \"I'm a buddy movie\" (Josh Broling & Benicio), 40 minutes later: \"Now I'm gonna be a road movie\", another 40 minutes later and all those stories became obsolete because now \"we shut down everything\" and the movie starts leading to the most horribly built transition into a third movie I've ever seen in my life. Ending is non-existent. No conflict is resolved, no character had their \"culmination point\" like in the first movie, when Emily Blunt realised that she was just absolutely useless and throughout the whole mission she was just being used. In the end of this movie right at that moment when it should show us \"what's gonna happen?\" \"what is he going to do?\" instead goes for \"1 year later\" and shows us probably the worst cliffhanger in history. The whole movie is just a huge dissapointment without an actuall story, main character, and culmination."
    },
    {
      "rating": "6",
      "text": "The Sicario sequel had a tough act to follow, that did not quite hit the bar of the 1st film. I liked the movie but felt it was lacking the buildup and suspense moments of the original. The first film was directed by Denis Villeneuve, who in my opinion is one of the best directors in Hollywood. Stefano Sollima did a decent job with the follow up, but any director would have had a hard time capturing the magic of the original.    Sicario: Day of the Soldado double downed on the gun fights which works for those who wanted a more action oriented movie.  The movie does come across as a bit slow, but that does build up on some of the more visceral scenes.   Benicio Del Toro was great again in his role, and newcomer Isabela Moner was fantastic as well.  Mark my words we will continue to see her in films as she gets older.    Overall it was an interesting film that did not feel like a waste of money to see in theater.  If you are on the fence about seeing it, I would personally wait for home release"
    },
    {
      "rating": "10",
      "text": "Amazing that something of politically-correct Hollywood could come out with this kind of storyline: America's southern border being infiltrated by terrorists; and we're not talking here about Mexican terrorists! Is it inconceivable to those with heads buried in the sand --- figuratively speaking, though Sicario might have it literally --- that Islamic terrorists could get into a South American or Central American country and work their way up to and across the Mexican border into the U.S.?"
    },
    {
      "rating": "7",
      "text": "I saw Sicario 2: Day of the Soldado about 2 weeks ago and it's one of those films were I had to think about it. After some time thinking about the best way to explain my thoughts on this film. Sicario 2 is probably just as realistic as the first. There are some good things about this film, like the acting and the film is well written. However, I don't think this film is as well directed as the original, but I would say the directing is good, just not brilliant. The final point is that the editing is nowhere near the same standard as the original, there is a lack of tension compared to the original and I think this is biggest difference between both films. Overall, I would recommend this film because there is a lot to like about it and is worth watching."
    },
    {
      "rating": "10",
      "text": "I really cannot understand critics these days. As far as I am concerned I got the exact movie I was expecting to get. It's gritty, it's raw, it's horrific and yet it also has a lot of heart. The acting, the pilots, the drivers and everyone involved in the making of this picture created something great here. The visuals are bold and totally immersive. This movie is definitely not for everyone, as it does deal with certain topics that might trigger certain groups of people. But this is the world we live in, as unfortunate as that is.While the plot of the movie is by no means deep, it doesn't have to be. Instead it focuses on a \"small\" plan that does not go according to plan, and that's it. The plot does not have to be any more than that as long as the movie works. And this movie does work very well indeed.You will most likely need a shower after."
    },
    {
      "rating": "9",
      "text": "Here's a bold prediction: 95% of people who see and love this movie will never write a review. In my session there were 30 people and 28 of them were men over the age of 50. If you liked the first, you will like this. You will know what to expect. It's complex, gritty, dark, humorless, engaging, fascinating, at times a little shocking. I've seen weird reviews saying this misses the mark based on where the US-Mexico border situation is. Huh? It's fiction. I also saw complaints that it's clearly setting up for another sequel. Again, huh? The end it really neatly tied together and could be left there, but I really hope not. A trilogy would really play out these character arcs and stories. And this might be one of the very few sequels I've seen where I loved it and really hoped there'll be one more installment."
    },
    {
      "rating": "10",
      "text": "Loved this film, I feel like most people thought that this was going to be just another mindless action movie. You have to actually pay attention and understand the message its trying to convey to the audience (us). Im glad it avoided all the typical Hollywood clichés. And the violence depicted in the film was very intense and had a purpose behind it. Josh Brolin steals the show here, his portrayal of Matt Graver was captivating; you will see far Matt Graver will go to complete mission. Del Toro gave a powerful performance as Alejandro as well. The ending is very bold but also very understanding when you consider the type of characters we are dealing with."
    },
    {
      "rating": "1",
      "text": "Now I realize there are worse movies out there, however, the cardinal sin of Sicario: Day of the Soldado is that is being praised for its \"passableness.\"    Don't be fooled this film may seem well made in certain areas but this only because the score and tone are recycled from the toolbox of terror set up by Villeneuve, Deakins, and Johannsson in the masterful 2015 original. Ultimately Soldado has nothing to say with these tools and fumbles the torch it was passed. The plot reads like a focus group approved version of a script that Sheridan wrote (the original screenplay of this film may be heavily altered.) The new director has no semblance of directing his actors or infusing a sense of dread, yet he clumsily retreads plotting structure from the original, leading to a plot that ultimately can't even decide if its a narrative drama or an omnipotent soulless thriller.    Sony's obligatory cash grab will please audiences who like empty action and violence, but as for the audience who love the original for its tension, mystery, and ambiguity on the subject of the drug war this film feels like a slap to the face. The kicker is as action filled realism the film also misses its mark with cornball dialogue and an unimaginative & unbelievable conflict."
    },
    {
      "rating": "8",
      "text": "I was hightly skeptical going into this one, given the absence of Emily Blunt, but I absolutely enjoyed it.  Brolin is much better than he was in the first film, and Benicio is killer (excuse the pun) as always.  He was born to play this role. I especially love the score, which seems like a series of above-the-nut 6th string bends (the note you hear at the beginning of Sabbath's \"Iron Man\").  It's highly effective in setting a mood of dread.  The weak link in the otherwise stellar case is Catherine Keener. She brings nothing to that character, and she's usually so good.  Even Matthew Modine one-ups her in a fairly flat performance. I should also mention Isabela Moner as the cartel head's daughter - we've seen this role a million times, but she brings something fresh to it."
    },
    {
      "rating": "9",
      "text": "The best thing about this movie is Benecio Del Toro. He can play a guy who does bad things yet remain sympathetic. Wish he made more movies. Josh Brolin is always reliable, and he’s making a ton of movies. The storyline was sad about the desperation of illegal immigrants who no one wants to help, and others take advantage. It was time for a movie to depict their plight."
    },
    {
      "rating": "2",
      "text": "Amazing how a series can go, in a single step, from being a intelligent action thriller to just another bunch of blokes shooting up the place. What a waste of talent and potential."
    },
    {
      "rating": "9",
      "text": "This is a terrific followup to the first film, continuing to explore the drug and human trafficking at the border.  Brolin and Del Toro are great, and it is in NO way slow or boring - a sharp script that really shows what is happening at the border."
    },
    {
      "rating": "8",
      "text": "Well, color me completely and utterly shocked. This is a sequel that's actually better than it's predecessor -- a movie directed by one of my favorite directors working, I might add. Things are just so much more tighter now. There's no dead weight in the form of a protagonist that's relegated to just spectatorship (like Blunt's character from the first one). There's a clear and understandable goal this time around that everyone being can identify with. And the action and set pieces are more spread out throughout each act. I don't know what else to say, I simply enjoyed this movie more than the first."
    },
    {
      "rating": "8",
      "text": "Here it is, a sequel to a movie we never expected, Sicario 2: Day of the Soldado. Although the absence of Emily Blunt and director Denis Villeneuve had me worried it's just as entertaining with an even darker story. Sure it's not as good as Sicario in terms of the story and the constant sense of dread didn't quite build for the entire film I still liked it and if you're a fan of Sicario or drug cartel movies at all then be sure to check out Sicario: Day of the Soldado. The drug war on the US Mexico border has worsened with drug cartels trafficking terrorists across the border. Matt Graver (Josh Brolin) teams up with Alejandro (Benicio Del Toro) to start a war with the cartels. The drug war quickly escalates and as to be expected gets a bit out of hand. I feel the most effective thing about Sicario is Benicio Del Toro's chilling on screen presence and the soundtrack. I didn't think the original soundtrack by the late Jóhann Jóhannsson could be topped but Hildur Guðnadóttir gave us a beautiful score and still maintained the intense and foreboding atmosphere. This works very effectively with the action scenes resulting in a thrilling experience. Honestly it doesn't really feel like a sequel and will probably not be the last Sicario film we'll see but as long as the standard doesn't drop then I'll be happy to see another one and then that's enough. No use milking a franchise just for the sake of it, yeah I'm looking at you Jurassic World. If like me, you're getting sick of this heatwave and need a good film then Sicario: Day of the Soldado should be your choice. Recommended."
    },
    {
      "rating": "4",
      "text": "Clearly, Mexican crime coming into the United States is a huge (or should I say, “YUGE”) problem… so much so our own president wants a wall to shut them away. Now, the three-time Oscar nominee’s sequel continues influencing a strong outlook about the controversial subject in the form of an escapist action flick that pits Americans against the Mexican Border.Sicario: Day of the Soldado ultimately thinks thievery aids people better than the Trump Administration, yet because nobody ever resembles realistic human beings, any intentional influence fails. For example: Alejandro (Benicio Del Toro) takes off his mask on a public street right before riddling a victim two-bullets-per-second under broad daylight, then later, he reveals his convenient knowledge of sign language when he by chance meets a deaf guy. Such on-the-spot improvised personality traits do not feel natural or earned, just to serve whatever’s plot convenient. Plus, screenwriter Taylor Sheridan (Hell or High Water, Sicario) introduces and revisits subplots at random without enough drama built up. With such messiness in a generic script, how can I see it as persuasive in any form?Forget seeing any woman empowerment either in this massive step down from the first movie, for its gun worship replaces Emily Blunt’s presence, moving our attention instead on empty, forgetful gunfire sequences. For the weak women that are seen in this sequel, Maybe some extra work towards the on-the-nose dialogue could’ve made them somewhat tolerable to watch, not either victimized or an irksome moral hindrance. The significant female role, teenager Isabel, just spectates bland action as a companion to the true male protagonist without a consistent arc; she first appears fist-fighting a fellow private school student, a trait lost past her introduction. If Isabel was alternatively more goody-two-shoes, her arc would had been improved since she utilizes the cliché emotional high point of cutting her hair, like Mulan. Nonetheless, she cuts her hair not to fight alongside the bad boys but continue to be unimportant.The great emotional distance concerns the men too, the lead hitmen are to freedom of Second Amendment Rights what steroid-jacked dudes are to fitness gym ads. They even become legitimate kidnappers we’re expected to cheer on—if a real assassin took a kidnap victim, despite his good intentions, it’d be unacceptable. Remind me again whom the real criminal here is?No politicians seen act redeemable either, the Secretary of State becomes one major supporting player who contributes nothing story wise besides giving the hitmen greater convenience of their mission. Though ultimately, his stupidity makes the filmmakers’ perspective of the Pentagon appear incompetent compared to a badass Puerto Rican who spurts out cool murderous catchphrases.At least Benicio Del Toro plays this “badass Puerto Rican” well, especially during the bright shining scene previously mentioned where he earns the deaf peasant’s respect. His vengeful semi-dead walk also deserves attention.Beyond Del Toro, the picture’s mood swings create cinematic power to gritty, realistic manifestation. Director Stefano Sollima creates tangible rustic imagery as his visual range includes an aerial symmetrical cold desert road shot thru gunman’s territory until the hot sun blows away leftover chill. His smaller creative techniques make you glance out a car through dense dust clouds, unnerving those inside, yourself included. Then at night, your eyes jolt as helicopter spotlights are staged to stop smugglers. Subtle pieces of Italian mob imagery are implemented to paint the activity down south, particularly when focused on one Mexican boy who is negatively influenced by his cousin, a representation of how today’s youth can get caught up with mob gangs. Then the spoken elements come together as the last image pays tribute to The Godfather.The strong screen direction goes deeper than mere big scale—the dramatization of a Kansas City department store bombing particularly shocks you. For character exposition, the camera first introduces Matt Graver’s (Josh Brolin) crocs before it pans up to the extra facial hair on his face, which suggests age progression of the ruthless mercenary walking in a comfortable anti-fashion.Except I’d hardly say the listed good qualities deserve opportune investment, because its glamorized bloodshed says we can stop violent immigrants… using violence. Yes, these hypothetical heroes’ callous murders throw dusk onto an Unforgiven quote: “It’s a hell of a thing, killing a man. Take away all he’s got and all he’s ever gonna have.” Unlike Sicario: Day of the Soldado’s pictorial sermon, understand that proper victory never goes to a sociopath. Only love, kindness, and humility can save your anger."
    },
    {
      "rating": "7",
      "text": "A good beginning a slow burn middle and an unsatisfying ending. This time around the script isn't as tight or interesting. Blunt's absence is palpable. The plot holes are bigger and more obvious. The \"Deep State\" scenario is trite and paper thin. The action scenes are still worthwhile but they don't save the movie. For Sicario Tres let's hope they bring back Blunt and get our foreign policy with Mexico back to some sophistication."
    },
    {
      "rating": "7",
      "text": "I'm getting really tired of these leftist reviewers [NBC & Indiewire, to name a couple] of painting movies like this as racist and complaining about them portraying a particularly race or faith in a negative light. They are telling a story. One particularly story, with particular characters. You reviewers are pathetic."
    },
    {
      "rating": "4",
      "text": "Don't be fooled by the good reviews, I think people are just hung up on any type of military movie(American Sniper/Lone Survivor got good reviews).  This is not like the first one, it starts off good, but about 45min you realize that the plot is moving into a different direction(Del Toro w/ little girl) and another sub plot that is meaningless.  The ending is horrible, just completely unrealistic.  Also, there is a shootout scene that also falls into the \"Hollywood\" ****  Bulletproof glass is not bulletproof forever."
    },
    {
      "rating": "8",
      "text": "Sicario: Who is the target? Who is the shooter?Cinematography: 8.932/10 The film forces the audience to be patient reckoning with planning. There are a lot of strong still moments which calls for the audience to identify with the elements of a scene especially the acting. The film is very cryptic and poetic; Sicario: Day of the Soldado shows and tells all though requires keen-patient observance from the audience. Costume Design: 8.721/10 The attire seems accurate and not too overly done which helps the believability of each scene throughout the film.Film Editing: 9.121/10 This is a very strong point for Sicario: Day of the Soldado. The film moves very slow though presents a lot of information for the audience to put into perspective. Make-up and Hair-styling: 6.923/10 There are instances I find the characters look a bit too clean especially after their experiences throughout a day. At a point, I'm questioning duck tape's abilities as a low-key-skin-healing mask. Sound Editing: 7.831/10 This film really forces the audience to deal with dialogue, natural sounds, and silence. It's good for the film though makes the audience feel every second of the film which may be good or bad depending on the audience member. Visual Effects: 9.129/10 This is a strong area in which the film cannot really do without.Story: 7.792/10 Beyond any ideas that the film might be reminiscent to actual events in modern day societies, I do feel as though the film poses as a long trailer for a coming film all while forcing the audience to bare with real concepts in development before their eyes. The random visual detachment of governmental characters like James Ridley's crew adds more to the cryptic-poetic senses of Sicario: Day of the Soldado. Still - the story seems to be drawing a lot more attention for events to come rather than events present all the while attempting to have a tough conversation in poetic form. Acting: 7/10 I think the acting works well with the dialogue and visuals though I sense the film relies more on the latter two than the acting alone. The acting does assist the tone of the film.Personal: Sicario: Day of the Soldado is asking a lot from its potential audience members. It's a tough watch because it forces the audience to engage with its aesthetic sensibilities. Poetry is ever present throughout the film. The acting, dialogue, and visuals all work well together. I don't know about all of the money going around the world. How do illegal activities seem to always have cash backing in films? I understand border crossing and protection are important topics of discussion. Still, I don't think Sicario: Day of the Soldado informs the reader of the reason people might want to cross the borders. Am I the only one that thinks Sicario: Day of the Soldado makes cartels look like saviors and the government like monsters? I think the film may be a lot stronger with a bit more information for the audience to work with unless the aforementioned is an argument Sicario: Day of the Soldado is presenting. Is the film itself an assassin of characters and ideals? Overall: 8.181/10-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "8",
      "text": "Sicario 2 the day of soldado was a sequel I was excited about but also very nervous about especially since I found out that this film was not being directed by Denis Villeneuve but by Stefano Sollima.  What Denis made in 2015 I thought was a very unique film and one that couldn't be replicated even by a sequel to the same film.  After seeing this movie twice and taking some time to think about it, I can definitely say that this film isn't as good as the first but does serve up as a nice main course to a great untre.  Josh brolin and Benicio Del Toro are once again brilliant in this movie and we get to explore some of their darker character traits that we only ever touched on in the first.  This film still offers the same thrills and gritty violence as its predecessor.  We get to have a further look into the world of sicario and not just the military operations that our main characters proceed in often.  We get to explore some darker parts of the cartels and the terrible aftermaths they have on people, especially on children.  Some people may dislike this because some of the content that the director has chosen to explore in this film may be fairly disturbing to certain people as I would say that the sequences of violence and mayhem are far more frequent and graphic than the first.  I personally don't see this as a negative because sicario is not an action movie.  The sequences of violence that take place in the film are intense, violent and at times disturbing.  The director has chosen to go for a very real feel in this movie just like Denis did with the first and this is what makes the movie feel unique in its own way.  There is a storyline that i didn't enjoy very much and it's about a boy and his use in the drug cartels. This storyline felt like an added set of scenes just to make the movie longer.  It doesn't involve or collide anywhere with the main plot and I personally felt like it was an unnecessary dark take on the movie that was there for the point of being violent. So overall I did enjoy this movie quite a bit and I will definitely be purchasing the score for this movie because it is brilliant.  Don't go into this movie expecting it to be better than the first, this is a nice follow up to Sicario and was a lot better than I thought it was going to be."
    },
    {
      "rating": "7",
      "text": "Better than most of the action and war movies that came last several years, but worse than the first Sicario movie."
    },
    {
      "rating": "8",
      "text": "Del Toro and Brolin do great as leads but without Blunt, There definitely feels like a piece is missing. While Brolin and Del Toro's characters are all for war, Blunt's character was the moral compass of the group and the lack of that in this movie is felt for sure but it doesn't stop the movie from being good.The plot involves Brolin's character, with the help of Del Toro's character, starting a war among the cartels because they had smuggled terrorists across the border, which resulted in an attack that killed several Americans. The sub-plot involves a young Mexican-American slowly being introduced to the cartel world by his cousin and both plots intersect nicely throughout and wrap up nicely by the end of the film.It's action-packed, Features solid acting by the cast and all in all, It's almost as good as the first film and it'll definitely make you wanna come back for a third."
    },
    {
      "rating": "7",
      "text": "I enjoyed Benicio Del Toro’s soulful performance most of all, but the rest of the cast was also very strong. I was a bit bored during the setup at the beginning, and towards the end I was ready to scream every time the “here comes something dramatic” musical theme was pounded out ad nauseum. But generally, this was an entertaining film with strong performances that kept me interested, and the charisma of Isabela Moner as Isabela Reyes (the drug lord’s kidnapped daughter) made up a bit for the absence of Emily Blunt. If your other option is being outside on a miserably hot and humid summer day and you are not into “Won’t You Be My Neighbor?”, this is a good choice."
    },
    {
      "rating": "7",
      "text": "A little less exciting and taught than its predecessor, but still an interesting and worthwhile enough follow-up nonetheless. If there's one thing you can rely on, it's the skillful and engaging performances from Benicio Del Toro and Josh Brolin. Overall, the plot is less inspired and simply isn't quite as flashy or exciting as the first, but really the biggest thing that's remained just as compelling and worthwhile are Del Toro and Brolin's performances."
    },
    {
      "rating": "10",
      "text": "I really like this movie. It was not boring plus it ramps up from start. Can't wait to see part 3 if it's ever made. Hopefully it will have a part 3."
    },
    {
      "rating": "8",
      "text": "Not very often does a sequel surpass the original screenplay but I vote this one did. Very interesting & intense story line and talented acting. I enjoyed the original and rated it a \"7\" but this movie surpassed it. As usual ignore the negative ratings they are not deserved"
    },
    {
      "rating": "10",
      "text": "This movie is deep and complex. Respect for everyone who made this movie happen."
    },
    {
      "rating": "5",
      "text": "Sicario: Day of the Soldado is a serviceable enough sequel to the first Sicario. Though not nearly as cleaver or memorable as the first, it is still extremely well acted, solidly directed, and beautifully shot. The action scenes are all very well shot and edited together and features some great sound design, mixing and editing. Benicio del Toro, Josh Brolin, and Isabela Moner (surprisingly) give 3 of the best performances of the year so far. On a technical level this movie is downright amazing. Unfortunatly, the script is much less than amazing. It is by no means a bad script, but in comparison to how cleaver and unpredictable the first film this film is a major downgrade. No spoilers but it kinda becomes ridiculous in the last 30 minutes to where in the end I felt bit empty. Overall, Sicario: Day of the Soldado is an extremely well made movie brought down by a middling script."
    },
    {
      "rating": "6",
      "text": "An unnecessary sequel that manages to be a well-made, entertaining, OK film."
    },
    {
      "rating": "0",
      "text": "Sicario was awesome but this is a load of rubbish. Can't believe the Sicario writer could come up with this."
    },
    {
      "rating": "6",
      "text": "The first twenty minutes of 'Sicario 2' feels like it's produced by Breitbart for the specific purpose of serving as border gore porn for their ill informed readers.The meandering storyline is a surprise given that the film was written by Taylor Sheridan, who wrote the first installment before following that up with 'Hell or High Water,' our #10 pick for best movies of 2016.Both Benicio Del Toro and Josh Brolin are riveting to watch here, as they are in just about everything they do, but neither are able to deliver the pure magnetism that Emily Blunt brought to the original 'Sicario.'Lastly, the complete non-ending in which the story is abruptly cut off for the sole purpose of setting up 'Sicario 3' is insulting to every last person who spent the time and money going to see a movie that presumably included a beginning, middle, and ending. Evidently Lionsgate wants to treat their audience like suckers by taking their wallets for another spin on this franchise, but they won't be getting any of mine. Thanks to their little cliffhanger stunt, 'Sicario 3' is getting the boycott treatment."
    },
    {
      "rating": "3",
      "text": "This movie was promising. Fantastic action sequences albeit there were long build ups, I am a big fan of Brolin.  However the finishing was terrible, almost like the movie ran out of budget, there were way too many plot holes. I do not want to get into to much detail, however how can a guy who has been injured in such a way walk 100 miles to the vehicles that ditched him in the first instance? One of the worst movies i've seen in 2018 imho."
    },
    {
      "rating": "9",
      "text": "I wrote more in a google docs:) but might as well or have to say this. Absolutely essential, it didn't need to happen but maybe i'm being too hard, it was 9 out of ten in terms of impact. I usually rate movies smaller if they didn't have enough(this feeling about to say is new undocumented to my knowledge, maybe those most satisfying video you'll see videos are a start and kojima and cliffy describing games as steak is the same feeling, um maybe if the movie, rarely a game due to the haptic and constant nature, doesn't give me a(I just coined this term a second ago-\"active narrative\" huh) imginary physical thought, you know how you feel that feeling in your head, an actually physical feeling when there is some complete action or thing your thinking off, the action coming out like it's filling your head, while maybe \"unsatifying stuff feel blank, perhaps it's the lack of face muscles tensing. Like that ketchup bag or object exploding out? Yeah? See I'd knew you'd get it:) Don't worry i can still be and emulate a more tone appropriate( i swear if they use that word again to describe a game..)persona but i love gwenpools and happy katherine waterston(hey look at that, from his beasts review)cute ways. This movie would feel more brain physical empty rtecolection but i feel this time I'll go with the feeling and impact,9/10 love it so much. That ultimate highlight finger psoture gun firing, The amazing ballsy scenes, the dubious nature of the plot. During the large police ambush i wasn't sure if it was real or not. A double fake of acting, is this another in-on it situation, was i supposed to be confused, highlighting the nature of film and something? I'm gonna say no but it was a amazing side effect, don't push those thought away they can be yep I'm saying it again, amazing alternatives more personal than was intended. Combining drug cartels and terrorists was brilliant. Almost all of it felt plausible, hopfully so as(hah I'm re-writing parts of my other too long to myself review)great movies and art see the world as it could be and hopefully is. in this case showing that the first reaction to dulling straight news(ugh i cant even write that word, as oh man this brilliant, news endorses it self by reacting and prioritizing it but unfortunately become it as the happening event should be on it's own, putting down a real thing to a word or phrases can really negatively change it, encompassing everything without really doing that. ooh smart, and trust me i can write better that's what a lunch table and not being recognized on the internet will do) is wrong and their is something so much more,uughhh(the g is silent)interesting. I hate re-writing, umm, to cover my ass from, um maybe i should stop there if this is archived:),the horrible nature is why we see it and why i wish to be in that world. space, space, back from the dead, I know that was a great ending, um,oh shoot that describe the actual ending. I think i need to go to bed(\"i was on liposuction\" I wrote enough :)"
    },
    {
      "rating": "7",
      "text": "Remember how gorgeous and linear that Denis Villeneuve’s Sicario was when it dropped in 2015? It was awesome when it had Emily Blunt in it. But when it comes to Day of the Soldado however, still has its unique grim touch and at the same time it felt weird without needing the strong components for the sequel from the first film. First of all, to the Italian director that’s directing an American crime thriller sequel for Sicario for the first time in Hollywood roots, Stefano Sollima, nailed it in terms of the direction that he took in order to make this one badass organic film compared to the first. Sollima’s direction felt quite mafioso and intense when he directs a film since he’s known for directing Italian flicks such as: Suburra and Gomorrah. The incorporation that he does in this film is naturally well directed compared to a good TV show and it didn’t disappoint. Also, Taylor Sheridan’s screenplay for Soldado still got it going when exploring deeper within the roots between two borders and the motivation between our beloved characters and new talent. In addition, Dariusz Wolski’s cinematography has it’s own unique flare of how Roger Deakins sets up his style from the first and it’s quite impressive. And Josh Brolin and Benicio del Toro still got it. Plus, Isabela Moner, known for the horrendous Michael Bay Transformer’s godawful sequel The Last Knight, was surprisingly good in this film even though it’s her latest debut in an intense film like this and she made a pretty good key character too. However, after seeing this film, I somewhat had difficulties when there is a scenario or two that were out of place that affected the overall film quality - especially the first act. And for some reason, the plot kind of loses itself in different sequences and it's somewhat a crying shame. This film is heavily described as an anthological chapter of its own, not a direct sequel and I completely understand it. Is Day of the Soldado any good, quite frankly yes in terms of cutting edge grotesque action and writing, but is it any better than the almighty first Sicario, nope – not even close."
    },
    {
      "rating": "6",
      "text": "An enjoyable ride in its own right, but by no means of the same caliber as the original \"Sicario\". I had high hopes for this movie, and while it succeeded in some areas I was sorely disappointed in others.The acting (particularly Benicio Del Toro and Josh Brolin, but especially so with Brolin in my opinion) is still superb, the direction (despite missing Denis Villeneuve's magic touch) is crisp, and the film is still great to look at even without Roger Deakins, crisply filmed with exciting, harrowing action sequences and plenty of beautiful Mexican landscapes and grimy, crime-riddled cities to take in. I also liked the development that Brolin's Matt and Del Toro's Alejandro go through within the movie: seeing the former wrestle with following orders he doesn't believe in lends him some extra depth and the latter's bonding with a teenage girl (Isabela Moner) wrapped up in their plot to initiate war between the cartels some much-needed humanity. The story, however, tries to do too much and becomes a muddled mess because of it, with plot points raised and either never resolved or only mentioned again once or twice, and some of them defying common logic (what exactly would drug cartels gain from smuggling Islamic terrorists into the US?). Whether this is writer Taylor Sheridan's or editor Matthew Goodman's fault I don't know, but within this movie there are at least two or three stories that would have been solid movies on their own had they been developed enough to actually provide some substantial payoff. Alas, they weren't, and here we are. There are also some of you out there who, if you took issue with the decidedly negative portrayal of Mexican characters in the first film, will have a field day with this one: almost every Latino character outside of the main cast is either an illegal migrant or a criminal, while Muslims get payed the lip treatment as being portrayed purely as suicide bombers for the umpteenth time. To take such a complicated issue as crime at the border and boil it down to merely \"bad vs. worse\" provides a fairly reductive view of said issues, and threatens to reinforce some of the toxic beliefs still held in our day and age.I'm not recommending that you don't see \"Day of the Soldado\". Considering the sheer amount of testosterone and the often grim tone that it takes, \"entertaining\" may not be the right word, but the movie certainly had my attention (at least at first) while watching. For those of you going in expecting a worthy successor to the brilliant original, though, I would advise caution: you may find it more of a set-up for the third movie than an actual film in its own right."
    },
    {
      "rating": "7",
      "text": "Sicario: Day of the Soldado is the sequel to 2015's Sicario. I enjoyed this film. I liked a lot of aspects of it and found some of the scenes extremely well done, but ultimately the story has a few weak points that drag the film down more than I was hoping going into the theater. Story: Day of the Soldado picks up a while after the first film, but there is no real connection to it apart from the two main characters (Benicio Del Toro and Josh Brolin). Take those two characters out, and this film plays out more like an anthology film than a sequel. However, because it is a sequel, they don't give us a whole lot of set up. It shows us a tiny bit of what the characters have been up to and then throws us into the plot, which deals with the U.S. Government declaring drug cartels as terrorist organizations, giving Josh Brolin's character the ability to go about taking care of them any way he pleases. So he decides to bring in Benicio Del Toro's character to help with his plan to create a war between the cartels. Eventually, though, the daughter of one of the cartel leaders gets involved, the plan to start a war with the cartels goes off the rails, and the story ultimately changes directions. I won't get into spoilers as to what direction the story does go, but for the most part this seems to be the main criticism of the film most people have. This awesome premise of setting up a war between the cartels was given to us for about an hour, and then it just pivots to a more isolated, simple story. I get the frustration. I also think that if they had stuck with the story of the first half of the film it would have turned out to be better, but I wasn't as bothered by this story pivot as it seems like most people have been. And I think I wasn't as bothered by it because the pivot made sense given the situation. The reason why the Government added cartels to the list of terrorist organizations turned out to be false, and Josh Brolin's operation went a bit haywire on its own. The whole narrative changed for the Government, and the operation wasn't going well, so it was time to cut the cord and as a result the story had to pivot. There were a couple of story elements towards the end that I felt like were a bit...meh, mostly revolving around Benicio Del Toro's character. But, overall, I was entertained by the story all the way through.Characters: Benicio Del Toro and Josh Brolin's characters don't get a whole lot of development in this film. We basically have to bring the knowledge we learned from the first film into this to really understand each character's motivations and moral compass. But, they do seem like fairly simple, badass, men. So maybe that was the intention all along. Not every character needs progression in films. Sometimes, they just are who they are. Script: I'm a HUGE fan of Taylor Sheridan. He's my favorite screenwriter working today. He'd written three movies before Day of the Soldado, and I felt like Sicario was the weakest out of the three. Now, I believe this one is the weakest out of the four he has written. The film starts off a little abruptly and takes a few minutes to find its feet, and then the multiple storylines just don't work as well together as they should. All of the storylines are good on their own, but the connections between them are a bit weak. There are also a few elements later in the script that I feel like are a bit weak, but there were some rumblings that the studio messed with his original third act of the film and changed some things. He apparently wasn't super pumped on that, just like he was pretty pissed that they forced a name change from Soldado to Sicario: Day of the Soldado. But hey, that's the movie business. I still think the screenplay is serviceable, but it's definitely not his best work.Cinematography: There were some great shots in the first Sicario, but Stefano Sollima doesn't quite reach that level of cinematography in this film. However, he does capture some fantastic action scenes that were on par with the first film.Overall: Day of the Soldado is a solid watch for people that are interested in the subject matter, but it doesn't reach the same level of its predecessor."
    },
    {
      "rating": "3",
      "text": "I am a big fan of Benicio Del Toro and a huge one of underrated actor Josh Brolin because even though he usually gets rave reviews for his performances he very seldom gets the big awards! The 3rd reason I went to see this movie that there were very few new films opening today.The main reasons I didn't want to see \"Sicario: Day of Soldado\" is that I am not into gratuitous violence as there always seem to be in this type of movie let alone the screenplay not being that logical or understanding and this film proved those points!The most I can say about the film is that Brolin and Del Toro were excellent and I was introduced to two new actors that impressed me, they being Isabela Moner and Elijah Rodriguez. The villains are villainous while some familiar pros like Catherine Keener and Matthew Modine deliver the goods.I neither do or don't recommend \"Sicario: Day of the Soldado\" as you know whether you will like this film before you walk in and I will say the 2 hours and 3 minutes moves pretty face."
    },
    {
      "rating": "8",
      "text": "To appreciate Sicario 2 depends solely on how much you can separate it from the original. Sicario is a rare film that virtually flawless on every level, so it would be damn near impossible for any follow up to reach, let alone exceed, the high bar set by the original. With that said, this is a surprisingly great sequel that holds its own. It's just as nerve-wracking, complex, and shocking as the original, while also being filled with a lot more action. Fortunately, this isn't a Michael Bay action film, the characters and story still come first, so when the more explosive sequences do arrive, they are far more intense and filled with dread. Benicio Del Toro is fantastic once again, the true heart and soul of the film. And Brolin more than holds his own. The biggest surprise is Isabel Moner, though. So awful in the last Transformers, she's a revelation here. One of the best child performances I've seen. When all is said and done, this is a superior sequel that holds its own merits, serving visceral thrills and thought-provoking storytelling. I can't wait to see where this story goes."
    },
    {
      "rating": "6",
      "text": "Enjoyed this more than the first, totally brutal and unforgiving. Decent for that reason."
    },
    {
      "rating": "8",
      "text": "8.4/10 An effectively thrilling spin off type sequel that has already been overshadowed and misunderstood.I interpret this as more of a spin off sequel than a direct sequel to the also brilliant 2015; Sicario. Honestly I thought director Stefano Sollima gave us as much grittiness and intensity as Sicario, and had almost an identical thrilling atmosphere seeping through its entirety. Dare I say this particular story was even more well written by Taylor Sheridan as it added many new facets that relate to the climate and time we are living in. It gave an extremely interesting scope on domestic terrorism, cartel/gangs, border patrol/issues, and the defense from an american military standpoint. I know it's a film, but id have to say, it seems like a pretty accurate representation of these real life issues. Within all of these pulse pounding moments, Josh Brolin and Benicia Del Toro are fantastic and give absolutely wonderful performances like we are all so used to by now. While the dramatic/emotional aspects of the story become a bit slow yet interesting, from time to time, the insane action is right around the corner to liven the intensity back up every time. Overall a very good thrilling drama, that I honestly believe is on par with Sicario, but people shouldn't expect it to be a direct type of sequel, but a spin off type sequel."
    },
    {
      "rating": "8",
      "text": "As I never saw the first Sicario film, this is honestly a review without comparing to the original source. Overall the film is well shot, acted and edited, though very little happens and it feels more like the precursor to an even larger film to come. I think this film is a strong critique on US governmental power but also the drug wares that are still waged in North America."
    },
    {
      "rating": "7",
      "text": "Sicario: Day of the Soldado thrills with solid action, an engaging plot, and well-rounded characters."
    },
    {
      "rating": "3",
      "text": "The first Sicario did not have open end but still it success required a mandatory cashgrab called sequel. This time we need to forget that revenge is already completed by eliminating of drug lord and his entire family. The story has to be repeated but this time another drug lord and no children killing. The guy who cold blooded killed children to revenge his daughter will save and protect spoiled and violent drug princess. There is a lot of violence the similar to the previous part but the logic and common sense is different. In the first movie 10 guys were  killed meters from US borders and no media covered it. Now they killed dozens of guys in the middle of Mexico desert and it is covered by every outlet. Diplomatic scandal they say, but still they allowed 2 military helicopters to cross the border to shoot other guys. In the middle of international scandal between US and Mexico? The next day of Mexican Police assasination by US CIA? The main guy is shot in the head, survived, casually killed two random bandits with a single grenade and on its route to save the girl and revenge himself, but suddenly the screen blackened and we see him fine and healty talking about some Sicario BS. The End. Nicely Done, impressive that is even shorter story telling that Game of Thrones 8 season but similar character arcs progression."
    },
    {
      "rating": "6",
      "text": "+Fantastic main cast most of which return for the sequel+Great soundscape+Shows excellent production value at times-Plot feels 'by the book' in comparison to original-Overall lacks that special quality the first film exhibitedI really enjoyed watching Day of the soldado, yet I found myself wondering why bother making this film? The first was iconic by its own right wheras this feels far more by the numbers as far as plot material goes. Still if you like 'gritty' in your movie watching diet and you havent already watched the hell out of the incredible sea of tv there is to watch these days then you might enjoy watching."
    },
    {
      "rating": "8",
      "text": "Good, but failed to live up to the original. Sicario 2 had very big boots to fill and didn't quite reach the heights of the first film.Excellent action sequences however a plot hole riddled narrative left a lot to be desired.Hopefully they can sort things out in the finale, Del Toro and Brolin were fantastic."
    }
  ]
}