{"id": 2643, "title": "Signs", "starring": ["Mel Gibson", "Joaquin Phoenix"], "runtime": 106, "genre": ["Drama", "Thriller", "Science Fiction", "Mystery"], "description": "A family living on a farm finds mysterious crop circles in their fields which suggests something more frightening to come.", "releaseYear": "2002", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/hyZkNEbNgnciUVTyu4NZTjlCh4L.jpg", "categories": {"plot": 6.428571428571429, "acting": 6.035714285714286, "ending": 6.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.818181818181818, "action": 6.375}, "reviews": [{"rating": "8", "text": "Not the best film ever, but it's entertaining and it's different. The actors did a good job, and the atmosphere is great too when the aliens arrive; the tension building up at some parts. I don't really see why it's gotten negative reviews, the only parts that were bad is that it may be a bit boring in some parts and the storyline may be a bit confusing too. Apart from that, it's not a bad film and it's worth watching."}, {"rating": "8", "text": "Signs is an intelligent thrilling movie with scenes that are scary in the non custom horror way. A chilling movie that will keep you at the edge of your seat while scaring you with the unknown."}, {"rating": "9", "text": "About equal to the first two Shyamalan films.  A great story mixed with great performances by Mel Gibson and Joaquin Phoenix.  A story about fate or choice and about regaining your faith."}, {"rating": "9", "text": "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"}, {"rating": "10", "text": "A properly scary film. It's by no means original, but it works well with what it has to create genuinely scary minutes with a good lead from Mel Gibson, and what works even better is it's underlying message of faith and hope in the face of a crisis, leading to a satisfying, complex film overall. It's not the best alien invasion film, but not many alien invasion films can turn the concept of invasion into a religious moral."}, {"rating": "7", "text": "I reckon most of the criticism lies with infamous third-act problems. Yes, you almost chuckle. Nevertheless, Signs is suspenseful on all accounts--a film that knows what its doing and does it really quite well."}, {"rating": "8", "text": "Signs is an incredibly tense and atmospheric film from M. Night Shyamalan that does not provide many answers, but certainly provides thrills, chills, and spills, along the way. With a strong performance from Mel Gibson in the lead role, Signs is an incredibly well crafted science fiction thriller that does provide many answers, to the chagrin of many viewers, but I loved it. Plus, the emotional drama and personal trauma were both well handled and given the appropriate weight in the film. Together with the suspense, they combined to make a well told and truly engaging film. Additionally, the direction from Shyamalan is very good. Not only is it tense, but it is well paced and well told. He knows how to create suspense and thrills and does it here with incredible ease. Nowadays, it is sad to look back on a great film like Signs and think of what could have been with Shyamalan, but nonetheless, it is a very good science fiction film that proved thoroughly chilling."}, {"rating": "9", "text": "It's better than Aliens, because it subtly captivates, rather than throwing green guts in our faces."}, {"rating": "9", "text": "I watch this every chance I get. As far as alien invasion fiction goes, this is not the most intricate or the most compelling. In fact, somehow, the alien's are a rather second-hand element in the film. It's more so about the family dynamics in a widowers household. The extra-terrestrial warfare is just the impetus that nudges them into situations where their personal stories can unfold and their deepest emotions can surface among one another. Directed with tact and steadfastness, acted with precision and beautifully paced to create an extremely hypnotizing atmosphere. Not to mention, infectiously hilarious on several occasions. This is a showcase in how to infuse subtle humor into a story. The jokes are super easy to miss and may very well go right over the heads of some which is unfortunate. But, by the same token, the quietness of all the funny along with the dimly lit environment in which it is placed really allows for it to illuminate like a firefly in the night sky and be a million times funnier than it would be in an in-your-face, no holds bar type of comedy. Highly enjoyable."}, {"rating": "10", "text": "Frightening, hopeful, and strangely majestic, \"Signs\" is one of the last best movies of M. Night Shyamalan playing with the audience's expectations every tense step of the proverbial way."}, {"rating": "8", "text": "Signs is nothing compared to Unbreakable and The Sixth Sense but Shyamalan still creates a creepy horror setting is this must see horror."}, {"rating": "10", "text": "Scary, funny, sad, unpredictable, horrifying, creepy, mystifying, and gripping is everything that describes how brilliant this movie is. From start to finish you don't see anything coming. This is one of the scariest movies I have ever seen and one of the best movies I have ever seen!!!!!!!!!!!!! Mel Gibson is fantastic for his role and so is everyone else!!!!!!!!!!!!!!!! M. Night Shyamalan has created a masterpiece."}, {"rating": "7", "text": "It's a bit of a mess but it's also rather intriguing. The main problem is that it seems a bit too convinient at times. I know it's meant to be all about the question \"are there no coincidences?\" But even so, some of it gets a little ridiculous. But it's pretty interesting too. It has a very distinct Shyamalan style to it. I enjoyed it. It's one of the better Shyamalan films (and certainly better than \"The Last Airbender\"). It's better than a lot of the users on here are saying it is."}, {"rating": "7", "text": "Signs is not the best M. Night movie but is still a pretty good movie with good acting and decent writing    ."}, {"rating": "9", "text": "If you can look past the gaping plot hole, \"Signs\" is an almost perfectly crafted sci-fi thriller with really great humor and seriousness. The profound, serious stuff is moving and meaningful, while the humor is really hilarious. Not many movies can mix profoundness with humor, but any that effectively can are almost always worth watching. Also, ALL of the characters are really convincing and very well acted. All in all, a really just plain great movie."}, {"rating": "7", "text": "\"Signs\" is a suspenseful, intense and well-crafted sci-fi thriller. Yes, the movie is slow, but it does that in a good way and builds up the tension before it all comes down."}, {"rating": "7", "text": "Some parts that are too silly, the alien looked awful, but it was entertaining, the score was great, but some scares were too in your face, some funny moments."}, {"rating": "8", "text": "Signs is a truly great Movie. Its about Aliens coming to earth. The Movie i tolled out of the perspective of an Family that has to deal with the loss of the Mother. The Actors do an great Job of Playing the Family. Its also mostly playing on an Farm. With something like that the danger of Containment is really high. But the Script and the Great Acting lets the audience think that the Story is constantly Moving. Also the reactions of the People seems more realistic to Aliens coming to Earth without knowing why. That gives the Movie an more realistic touch. Even with having an Theme with Aliens the Movie \"Signs\" is more about the Essence of Faith. The Family needs to deal  with a great loss and the Father lost all Faith in Religion. The Movie is Really is about regaining of Faith and dealing with the bad stuff that can Happen to People. \"Signs\" is overall an fantastic and underrated Movie."}, {"rating": "0", "text": "Walk out of the theater Casey, walk out of the theater."}, {"rating": "2", "text": "There have een a few bad films over the years that go to great lengths to insult the viewers' intelligence. But \"Signs\" takes the cake. 2/10 instead of 1/10 just for some good camera work and my generous mood. Otherwise, an awful film in countless ways."}, {"rating": "3", "text": "Cheesy, wonderful, so-bad-its good brilliance. The acting is absurdly wooden. The script is so hamfisted that it sounds like it was written by an actual ham. The camera work is bizarre. Yet, despite all of that, Signs is charming in that M. Night Shyamalan way. Its not good by any means, but it is enjoyable."}, {"rating": "6", "text": "Nothing really special about this one. There is this one frightening scene, jump scare that I love and I literally jumped off my bed watching it. And because of that scene - it’s worth it haha"}, {"rating": "10", "text": "The best M night Shyamalan movie ever made with so much style and fright that the build up of this movie will leave you breathtaken. this buildup all leads up to the end which will give you your breath back to rethink  everything you have seen from a new perspective. If one has faith to watch m night shyamalan's best feature you will be gladly surprised."}, {"rating": "9", "text": "One of the last intriguing and truly good films of M.Night Shyamalan, it was interesting from start to finish and some of Shyamalans strongest work of his career. The story is great and very fitting to what Shyamalan style is and the performances from Mel Gibson and Joaquin Phoenix are superb in a story about the supernatural, fate, and the choices that come with regarding to a man's faith in God. The ending on the otherhand, is a bit of a downer. Its almost too cliche for a story regarding aliens. As a whole, Signs is scary, hopeful, emotional, and weirdly majestic while M.Night Shyamalan plays to the audiences every tense step of the way."}, {"rating": "8", "text": "I love this kind of movies - smart, funny and interesting from start to the finish. If it would be a bit faster paced I'd rate it perfect, but I appreciate concept of slowly building tension."}, {"rating": "9", "text": "After my confrontation with solid foreshadowing \"The Sixth Sense\" and a not great, but very good \"Unbreakable\", M. Night Shyamalan did his job once again to give me his best to scare the living heck out of my soul with \"Signs\".The story/premise about a preacher, his younger brother and his two children something very horrifying was spooky, yet very cool. The moral lesson about faith is really the right thing to teach your kids when you're in a church.Before I continue, I just want to say that I only go to church once in a few years or so. Just to remind you.Back to the review. The tone of this movie was absolutely dark and I think it was very good when it comes to other movies with darker overtones. Even the action was very impressive.I also liked the actors for doing such a great job, especially Mel Gibson. Everywhere he goes, \"Hamlet\", \"Braveheart\", \"Pocahontas\", \"Chicken Run\", \"The Patriot\", you name it.Signs is an entertaining movie and it's M. Night Shyamalan's strongest works in my opinion despite the fact that I didn't like the way his career later went downhill for such stinkers like \"The Village\", \"The Lady In The Water\", and \"The Happening\". \"The Last Airbender\", unlike his previous films, was a guilty pleasure in which you already know that.The ending was weak and too cliched it ruined a fewer aspects of the story.Bottomline: Great movie, worth checking out.9/10"}, {"rating": "9", "text": "An eerie, suspenseful, emotionally touching near masterpiece. With a great cast giving great performances, a witty, brilliant, and extremely detailed script, and some expertly sensitive direction, this may be Shyamalan's best movie. It's such a shame that he had to go into such a downward spiral. I truly hope he gets his mojo back because his first 3 films (this one especially) were just brilliant. Signs will scare you senseless because Shyamalan knew how to build the suspense slowly and effectively, with hints of menacing creatures, not guts and gore. The incredible score by Newton also adds layers of astonishing depth onto the already touching story and nuanced performances. A classic, plain and simple. Its reputation will only grow as time goes on."}, {"rating": "6", "text": "The fact that M. Night Shyamalan directed this movie is unbelievable. The movie wasn't all that great in general, with its only-okay acting and decidedly tedious story, but for an M. Night Shyamalan film, this is like \"The Godfather\"."}, {"rating": "3", "text": "Once again Mr. Shyamalan makes another film that seriously dents what reputation he had left as a director and writer. He manages to take some interesting themes and then cheats the viewer with a simplistic and cop-out ending which left me wanting to put my foot through the TV screen! Regardless of how good a movie is, what directors need to remember is the viewers lasting impression of a film is how the strands are brought together at the end. After two good first efforts Mr. Shyamalan is hurtling into meltdown."}, {"rating": "4", "text": "This just isn't my cup of tea. I'm not much of a fan of M. Night anyhow. I mean, he isn't a terrible director, but he should probably give up on writing. He's just bad with dialogue and its films like \"The Last Airbender\", \"The Happening\", and this that prove that. As for movies like \"Unbreakable\" and \"The Sixth Sense\"...those are alright. His other movies I haven't seen, I'd say yet but me not liking the guy sort of keeps from wanting too."}, {"rating": "4", "text": "They come to invade and don't know our planet contains water? Are they serious? Otherwise the film is reasonably strong in acting and even has a few tense moments. But nothing can redeem and I quote \"NickA\"here, the cop out ending."}, {"rating": "8", "text": "Signs was exactly what we needed this summer. A fun, entertaining film that makes you think. It was an enjoyable theatre-going experience with a lot of scares as well as humor. Mel Gibson has never been better and the rest of the cast was fantastic, especially the kids. Shyamalan is a natural at working with kids. I had no idea what this film was about going in, but I left extremely satisfied as well as feeling good about life. It's nice to watch a film about something that matters and also be entertained by it. Shyamalan is a definite talent and I can't wait to see what he brings us next. Blanco can kiss my ass!!!"}, {"rating": "8", "text": "Yes the statement that the director is trying to make is silly and heavy handed. However, his ability to make the events seem like they could really happen and the reactions of the characters play out very realistically before they collapse at the end. The build up is definitely worth putting up with some dissapointment at the end."}, {"rating": "3", "text": "A tacky morality play packaged in a lackluster retelling of War of the Worlds, delivered with the subtlety of a sledgehammer."}, {"rating": "10", "text": "This is a movie about hope. It's tagline for me is \"Can it be there are no coincidents?\". Some people think that it advocates religion and faith. I think the return of Graham at the end to religion is a plot device and a necessary parabol for everyone else, as we all have hopes and faith, each at different grounds. I felt deeply emotional by the end of this film. A miracle is the final ring of a chain which start from us. Among the most humanist film I've seen."}, {"rating": "1", "text": "Boring religious piece of garbage. I'm very sorry I wasted almost two hours of my life on this. Must be one of the worst movies I have ever seen. IMDb and Rotten Tomatoes have it wrong, metacritic generally has the correct score, although personally I would rate it even lower."}, {"rating": "0", "text": "Boring religious piece of garbage. I'm very sorry I wasted almost two hours of my life on this. Must be one of the worst movies I have ever seen. IMDb and Rotten Tomatoes have it wrong, metacritic generally has the correct score, although personally I would rate it even lower."}, {"rating": "2", "text": "There is excactly one, and only one interesting/exciting scene in this movie: Hiding in the basement while the world upstairs has gone mad. Everything else is standard Shyamalan-fare - a pretentious, over-ambitious build up, that is completely wrecked and torn apart at the end through childish banality, making you leave the cinema fuming over mis-spent cash and time."}, {"rating": "0", "text": "And the nostalgia critic changes it all people!This so called \"great movie\" is just a disaster piece of **** with no sense that deserved no popularity and sucks all my balls fulled with crap and **** pieces of **** that are better than this bullcrap!"}, {"rating": "6", "text": "While the first half of the movie is quite slow and the CGI is a bit dated, the movie is still impressively suspenseful. The acting is great, the story is interesting and original and the movie had a few thrilling scenes. If it wasn't for the weak conclusion and the numerous plot holes, this movie could've been great."}, {"rating": "5", "text": "I have been a fan of M. Night Shyamalan in the past but this film did not do it for me. I'll give credit to Mel Gibson on this one as I thought he was a strong point but there is not a huge twist that we expect in this film. Not even comparable to Unbreakable or The Sixth Sense."}, {"rating": "3", "text": "still under production..SignsSigns is a plot driven horror thriller about a family living on a farm that is shook up after the symphony of horror enters in their house. Despite of being of horror genre, there isn't a single loose thread of thrill for the viewers to root for either the characters or the storyline. The primary reason why it fails to create the anticipated crispy environment is because of its pretentious and shallow characters that the audience never cares about. The characters goes deep in order to draw out the emotions but unfortunately they are still undercooked if not one dimensional. The essential bits that usually antes up the horror and decorates it with long gasping of airs, is the missing puzzle in here. Neither the background score, not the sound effects factors in, addition to that, the art designing is daft and visual effects still under production, which scrapes out the heat from the asset. Gibson gives few good sequences especially his caring response towards the children whilst unfortunately Phoenix seems distracted and not in his game as his portrayal just doesn't seem palpable to the theme of the feature. Shyamalan's vision in here requires plenty of preparation and in order to do so, he spends his first two acts on building up the structure and when it finally hits on screen the viewers are exhausted and numbed by it to feel electrified by its rendezvous point. Having said that, Shyamalan's execution still delivers few good moments but the audience is never in an awe of it, in the entire course of the feature. The emotional repercussions that the flashback sequence breeds, its simplistic and practical take on something such fictional that offers much personal experience and its final nail biting seen-this-seen-that drama are the high points of the feature. Signs is more pretentious that it claims to be and surfs more than it hopes to be, it's a huge misconception iterated in a horror."}, {"rating": "3", "text": "This film is about a former evangelical pastor who lost his faith but who will be put to the test when his corn field is partially crushed, creating a crop circle. Directed and written by Night Shyamalan, the film quickly creates a mystery around crop circles, an well known phenomenon in the eighties and nineties, which fueled many supernatural theories. In fact, anyone who knows a little about that quickly realizes the direction of the plot, which simply explores the most publicized theory about crop circles. From this point of view, the film has no mystery and its easy to foresee the ending. Some religious notes arise in the plot, but it ends up lefting because it does not match with the sci-fi action after that. The fact that the main character is a former pastor isn't enough to bring religion here. Mel Gibson gave life to the main character but is far from being inspired. He seemed too theatrical most of the time. The rest of the cast was decent enough, but there was not much to do there."}, {"rating": "7", "text": "Signs is different from other alien invasion stories. It doesn't show aliens attacking humans and humans fighting back. If tells the story from a family point of view, how it is effecting them.The direction was nice. The director manipulated the viewers into seeing and believing what he wanted you to believe.All actors including Gibson, Phoenix and children played their parts properly.Overall, you should give it a watch. One thing to keep note, everyone may not like this movie. This movie needs understanding."}, {"rating": "0", "text": "Horrible Movie. Cheesy and unrealistic. It advertised that it is going to follow the mythology of Earth's encounters with extra-terrestrials. Instead you get a completely shallow suspense film with an unoriginal story. If you want good science fiction you will be terribly disappointed."}, {"rating": "2", "text": "this is a horror movie....I thought it was a comedy. If this is actually suppost to fit into the horror genre then ill give it mark that is due but as a comedy its a 4 because it there were too many boring parts between the funny bits. By the way, no im not smoking anything to all the people who liked this movie, when I watched this the whole theater burst out laughing in some scenes."}, {"rating": "10", "text": "I'm surprised by the mediocre reviews! I love this movie. I think people get mad because it is not the horror movie they expected. Signs is clever; funny, scary, and just entertaining!"}, {"rating": "4", "text": "For the first half of this movie, I was captivated. The characters grew and had depth, the history of the family, the religious aspect. It was a joy to behold a master director weave his magic. Then it all went horribly wrong. Holes started to appear in the plot, (what, NO weapons at all?) plus... these aliens navigated from across the galaxy, do they really need these signs? The \"finale\" .... was pathetic, sorry. Not so much because of it's contrite nature, but because are we really meant to believe aliens would invade earth without doing their homework to check for natural hazards .... As a sane and balanced agnostic, I was delighted with the way Gibson challenges his faith. I was less delighted with the \"twist\" at the end. It's meant to get you thinking... but it simply makes smart people think even more - so yeah, I believe in coincidence. Grrrr.... like the ending to Unbreakable, the last 20 minutes of this movie left me feeling cheated."}, {"rating": "9", "text": "Signs is exactly what the horror genre needed-a jolt of originality to the seemingly repetitive horror settings. This movie drips with originality, and it keeps you on the edge of your seat the whole time. M Night Shyamalan-I salute you."}, {"rating": "10", "text": "A thoroughly under-rated masterpiece. After watching the trailers for this movie, I can see why some people were disapointed. The trailers seemed to have been geared to attract the 'War of the Worlds' fans. However, a lot of peop-le seemed to have missed the raw craft and style with which 'Signs' is executed. To begin with, M.Night Shalamyn's movies scare me the most out of any other movies I have seen. His use of manipulative camera angles, building music, and slow development create some truly memorable moments. On top of this, the back-story is extremely believable, the acting is unique and top-notch, and the musical score is brilliant. It is a very subtle movie, however, so only people who actually like HORROR should watch it, and watch it alone. All you guys who just want to see blood and boobs should watch Hostel or some other piece of garbage with your friends."}], "recommendations": ["us", "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_", "color_out_of_space", "the_mist", "a_quiet_place_part_ii", "the_fly", "ready_or_not", "the_lodge", "the_invisible_man", "the_invasion", "shutter_island", "cube", "coherence", "it", "they_live", "i_am_mother", "sunshine", "a_quiet_place", "enemy", "it_follows", "inception", "what_happened_to_monday", "the_conjuring_the_devil_made_me_do_it", "dark_skies", "the_haunting_in_connecticut_2_ghosts_of_georgia"]}