{
  "id": 2285,
  "title": "Silence",
  "starring": [
    "Andrew Garfield",
    "Adam Driver"
  ],
  "runtime": 161,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "Two Jesuit priests travel to seventeenth century Japan which has, under the Tokugawa shogunate, banned Catholicism and almost all foreign contact.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wO8XKAt3JUpdij27gIq6Maq4JMp.jpg",
  "categories": {
    "plot": 6.888888888888889,
    "acting": 6.978260869565218,
    "ending": 7.166666666666667,
    "soundtrack": 5.0,
    "cinematography": 7.111111111111111,
    "familyFriendly": 3.0,
    "funny": 4.666666666666667,
    "action": 6.6
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I found this long-awaited Scorsese film riveting, thought-provoking and profound. Having spotted its appearance on cable-on-demand, I feel I finally found the movie I would have rooted for during the Oscars! (Where it was ignored -- too little inspiration for political cracks, I guess.) I disagree with some that you'd have to be a religious believer to appreciate it. But I do think it'll be more interesting to those who have thought about spiritual issues ... whether they ended up embracing faith or rejecting it. Superb acting, and it's visually haunting, as well."
    },
    {
      "rating": "8",
      "text": "This is an epic, rich, complex film about endurance of faith with good acting and stunning visuals."
    },
    {
      "rating": "7",
      "text": "With good enough acting performances, beautiful cinematography, brutal and realistic torture sequences and a bleak ending, Silence is a good surprise. Despite it's longer than average running time, it's still worth a watch."
    },
    {
      "rating": "5",
      "text": "Silence is a bizarre, illusive movie. Before I saw the film, my Catholic pastor and one of my Catholic news sources had demonized it. Several of my friends, though, told me I should go see it, so I did. The trailer does not do Silence justice! The actual movie not include that riveting, fast-paced soundtrack, nor the trailer's tone.I would not recommend Silence to the average person, adult, Christian, or even Catholic. To properly digest its contents, this film requires a fervently philosophical Christian mind. Indeed, I felt my faith was burning bright within me after I watched the film. But it is not because of any inspiration that the central characters gave me. In fact, the protagonist turns out to be of the haziest gray between black or white. In the end, we will never know whether he has reconciled himself with God or not. This is, for me, extremely disappointing and uninteresting. I could compare this ending to Inception's, which was a far better psychological film.Silence is one long movie without much music, and a lot of narration. This approach does allow for some impressive Zen experience for viewers. I will probably never watch it again because of its lack of clarity and message. But, as a devout Catholic I did find it intriguing and thought-provoking. At the end in the theater, one man began clapping as the credits rolled down. I thought to myself that there was no way I could clap for such an unclear message. It's a good thing I brought some equally intellectual friends along to discuss the movie!"
    },
    {
      "rating": "8",
      "text": "A riveting, complex, deeply profound movie that asks more questions than it answers. Honestly some of Andrew Garfield's best work as an actor and one of Martin Scorsese's best films. An incredible attention to detail, astounding atmosphere and world building, and stunning cinematography make Silence a film you will not soon forget. If you love film and can get your hands on this one, definitely do so."
    },
    {
      "rating": "10",
      "text": "It's bold beautiful and brutal. Amazing ensemble cast.  Andrew Garfield and Adam Driver are incredible. Issey Ogata might be the best villain of the year. It starts a bit slow but the second half of the film is stunning."
    },
    {
      "rating": "10",
      "text": "\"Silence is the loudest cry for love\". The story of \"Silence\" fellows two Jesuit priests, Sebastião Rodrigues and Francis Garrpe, who travel to seventeenth century Japan which has, under the Tokugawa shogunate, banned Catholicism and almost all foreign contact.This was tough. Seriously, this was the hardest thing I've ever digest in terms of progressing my thoughts. It's so mesmerizing with so many things going on at once that it takes awhile to sink in. Gets you thinking on a subject that you wasn't originally interested in. A movie that leaves you completely paralyze of reacting or forming a sentence to describe what you just witness. But after four days of letting it sink in, it has been settled.What I love about \"Silence\" is that it doesn't judge-the potential arrogance & imperialism of missionary work. It doesn't make you pick aside to root for, but understand where both sides are coming from. It's up to you - the audience, to decide if their actions are right or wrong.\"Silence\" is easily one of best movies of 2016. A film in which you get so involved of whats going on that it stays with you long after it's over. It's one of Scorsese's finest achievement of his career.For almost 30 years, Scorsese has been trying to get Shusaku Endo novel \"Silence\" made. You see, Scorsese grow up Catholic and had desire to become a priest at a young age. So the book deeply moved him in a personal way. But the reason why he couldn't get it made sooner is because he wasn't ready to take on anything like this. To him, this was something big and challenging. So all these years he tried to really think how a story like this could be cinematic.Martin Scorsese is my favorite director and every movie he makes, I'm there. I haven't seen all of his movies yet, but those are for a special time. Now people have ask the question of who's the best living director working today - It's Scorsese all the way. While Steven Spielberg and Ridley Scott will always be legends, but Marty doesn't just make a movie to stay relevant or just do it for the sake of it. You can see the passion behind every film his done. \"Silence\" is no different. It's a deeply spiritual film and has multiple layers of meanings. Marty reminds us of that old cinema we love.Andrew Garfield was absolutely fantastic in this movie. Garfield once again proves that he's a great actor. His performance was emotionally striking and he nailed the character down. It a real shame that he got nominated for \"Hacksaw Ridge\" and not this. I thought he was far better in \"Silence\". Because he starts off 100% dedicated to his own faith, but towards the end he's a complete wreck. The challenges he had to face was more compelling and soul crushing to watch.Adam Driver and Liam Neeson were also great. Driver performance was natural and tremendous that you see the deep passion he's character had for faith. Neeson doesn't have a big role, but his presence on the story is immense and unique.All the Japanese cast were all stellar. Especially Issei Ogata and Yôsuke Kubozuka. Those two were the stand outs for me. Ogata character can be best describe as Christoph Waltz from \"Inglourious Basterds\", as he's both comedic and menacing. Kubozuka broke my heart a couple of times, as the cowardly Christian who keeps letting others down many times. But when he begs for forgiveness, it's hard not to fall into that routine again.The score for this movie is quite interesting. I say \"interesting\" because there's not much music, but sounds. Nature sounds you would here in the Forrest or a swamp. It's a score that creeps into my head and psychological effects you.Rodrigo Prieto cinematography in this movie was just flawless. The look of Japan has this foggy, warmth, and damp look to it. Prieto capturers the cruelty and the hidden beauty to it.Unfortunately, this isn't going to be for everyone and I've already seen different sides. It ask questions more than answers. Quite honestly, I glad it dose. As it opens to discussions with others and gets you talking. You know, like a movie should.And yes it may be frustrating for some, but I think that's the right reaction that a movie like this should have. A movie that puts you in the shoes of what the characters going through and their main struggles. If all that is perfectly captured on film, it's less than a negative, but more of an achievement. For a 2 hour and 41 minute movie, it never dragged for me.Overall rating: \"Silence\" touches every rope of your mind and soul. This is one of those movies which may not be appreciated until many years later, for those who can grasp the true heart and meaning of this film, it's a transcendent experience. I was captivated from start to finish.Hail Scorsese!"
    },
    {
      "rating": "10",
      "text": "This movie is intense and powerful to understand why Christians struggle for their faith and God's silence.Scorsese described the historical setting of Japaneses and their religious life extremely well. I highly value and salute his genius masterpiece!"
    },
    {
      "rating": "10",
      "text": "Amazing movie! It's beautiful to the eyes, calm to the ears, and fruitful for the mind. I like how the characters and the ideas of the feature are painted with a lot of nuances, it makes you appreciate all perspectives of the conflict surrounding religion and culture that is the main conducting line of the movie.HOWEVER, I must warn that this is not that fun movie to take the family in the weekend. It is heavy weight and requires some level of predisposition to go through it. So, it is not for everyone, nor for every moment, but it is a mind blowing film, for sure!"
    },
    {
      "rating": "9",
      "text": "A film that explores intimate human values in a way that few other directors than Scorsese know how to do.  One of those films that will stay with you for years to come.  I don´t give it a 10, because I think it could have been made a little bit shorter.  Otherwise, as close to a masterpiece as they come."
    },
    {
      "rating": "9",
      "text": "Martin Scorsese continues to prove why he's one of the best directors going today.  Silence is a mesmerizing and deeply engrossing film that you won't soon forget.  While the first half isn't always as enthralling as the second this film is a must see for all. A"
    },
    {
      "rating": "8",
      "text": "Scorcese's near three hour religious epic is certainly well acted, accomplished film making, but its deeply contemplative nature and deliberate pacing will alienate some viewers."
    },
    {
      "rating": "10",
      "text": "Most spiritually-themed movies present a show of beauty, a glorious vision of spirit, but Silence explores the dark night of the soul, the suffering of spiritual doubt, and the feelings of being forsaken.  Martin Scorsese’s filmic spiritual journey is like his Akira Kurosawa film.  It’s sensual, open-ended, reflective, and, like a good teacher, it makes you ask questions.The story, based on  Shusaku Endo’s book of the same title, follows two priests, or padres, but focuses on one man, Padre Rodrigues, brilliantly played by Andrew Garfield.  Rodrigues and his fellow padre, Garrpe (Adam Driver), head off to Japan to find their mentor, Ferreira (Liam Neeson).  Japanese officials have been killing Christians to preserve the religion of their homeland.  The Catholic priests set out on a dangerous quest to continue their mission.  The two are confronted with the terrifying reality of their potential deaths by beheading and of the heavy responsibilities of bringing hope to the local faithful.  One can’t help but think of the contemporary persecutions of many religions and how each has been on both the receiving and the giving end of violence over millennia.  But a man’s religion is not the same as a man’s spirit.  Spirit rests in a deeper place, free from worldly ways.  Rodrigues is driven to open himself to the most profound level of that resting place.Great movies give you something to think about afterwards.  In this regard, Silence runs deep.  Many ideas, issues, and ethical questions arise in its running time and there is much to ponder, not least of which is -- what would I do?  When faith or the renunciation of faith become literally a matter of life and death, would we stand firm and die, or lie?  We, and Padre Rodrigues, also have to battle with our question, what would Jesus do?Other questions occur, such as, what is mercy?  How can one forgive?   What use is suffering? Just as we’re noticing that Andrew Garfield’s character is starting to look like Jesus, Rodrigues is directly accused of egotistically imitating Jesus.  Thankfully, the film never preaches.  The questions and the answers, as a good teacher is well aware, are best left to you.Silence, in an overview of Scorsese’s career, is a personal and integral work and will be regarded as essential.Silence, in Buddhism and Christianity and all great religions, is at the core of spiritual yearning.  When our ideas and ambitions and questions come to a terminus, ever-present silence remains."
    },
    {
      "rating": "8",
      "text": "Martin Scorsese's sweeping religious epic showcases his knack for world-building and once again presents the audience with a taste of how brutal humans can be to one another.  He shot this film on 35mm film, and while some of it could have been left on the editing room floor, none of it was wasted."
    },
    {
      "rating": "10",
      "text": "Google ImageIt is 2017 and Martin Scorsese starts the year with a bang. Or rather with Silence. I am usually not one to make predictions but if that movie doesn't get an Oscar nod then I don't know what will.Never have I seen a movie theatre full with people turn absolutely still. Nobody moved. Nobody breathed. Something akin to an electric current ran through me. The silence in the room when the pivotal scene came up was absolute. To experience anything like this is an incredible feeling and an homage to the director.Andrew Garfield was never an actor I paid much attention to in the past. In Silence he gave an outstanding performance. He incidentally also plays in Hacksaw Ridge, a role for which he got nominated for a Golden Globe. That movie is on my watch list and at last it will soon be released in Ireland. I am very much looking forward to seeing it.The MissionTwo Jesuit priests learn that their mentor Father Cristóvão Ferreira, who is living in Japan to spread the word of God, denounced his faith and committed apostasy. We are shown the torture of his followers by the Japanese in Nagasaki. The story is set in the 1630s and 1640s, when Japan is trying to root out all foreign influences in religion and Christians in the country are killed by the tens of thousands.Father Sebastião Rodrigues (Andrew Garfield) and Father Francisco Garupe (Adam Driver) feel in their hearts that God needs their help. Despite the danger that awaits them they head out to Japan to find Father Ferreira and see if the allegations are true. They are committed to continue the missionary work in a country that has become so dangerous for Christians.Upon their arrival they are found by some villagers who follow the Christian faith in secret. Hidden from the inquisitors during the day, the two priests come out at night to perform church services, hear confessions and baptise the people. They give hope to the villagers and give them strength to continue with their faith in the face of great peril.Keeping the faithThe two priests are forced to witness the torture and prosecution of the villagers. Only their faith helps them through those dark times. Eventually though they are captured. Father Garupe is killed and Father Rodrigues finds that the harder he prays the less answers he gets from God. God has become silent. In this silence he struggles to come to term with what he witnesses barely holding on to his believes.Until he meets Father Ferreira. As it turns out the rumours were correct. Father Ferreira is now studying at a Buddhist temple and has a Japanese wife and family. How will Father Rodrigues cope with this new revelation?Final ThoughtsAs someone who does not and never has subscribed to any kind of religion I don't understand this kind of faith or the willingness to kill and die for something as abstract as a deity. To me it is quite horific to see what people are willing to do to other beings in order to force their own ways and believes upon each other. I watched Silence days ago but I really struggled with putting all of this into words on short notice.Belief and faith or not, even to me the struggles that Father Rodrigues went through seem so real. I can certainly appreciate the emotional conflict he went through having to see his fellow Christians being tortured and killed. To watch this being done to another being must provoke some reaction in anyone. Andrew Garfield’s performance is just incredible. His grief, his doubts, his brush with insanity. It is all so real.Martin Scorsese’s vision for this film has famously had about 25 years time to develop and the end result really shows the passion he put into the movie. Silence certainly opened the new movie year in a spectacular fashion."
    },
    {
      "rating": "10",
      "text": "Beautiful, moving, challenging, thought-provoking, and exhausting - Silence is another spiritual masterpiece from Martin Scorsese that dares to ask questions about the nature of God's mission, and lets the viewer ponder their own answers. Masterfully acted and filmed, Silence deftly balances both the beauty and suffering of faith, while placing it in the context of challenging authoritarianism and bigotry, while offering hope to the most despondent and marginalized of people. Based on a true events, the film reveals a relatively unknown part of history and totally deconstructs any mythical romanticism of 17th century feudal Japan. The depictions of the brutal enforcement of anti-religious laws are tough to watch, and equally demanding is the premise posited that should faith be an inner monologue or should it be proclaimed aloud and shared with those who hunger for spiritual grace? Silence offers these very existential questions framed against the backdrop of genocide and cultural divisions/segregation. Martin Scorsese has never made a film that was less than merely excellent. Silence is yet another oeuvre in the filmography of one of the greatest artists of our time. Such a shame that Hollywood has turned it's back on this film, giving it no market supports and snubbing it for the Academy Awards.Silence, without questions, should be considered for Best Picture, Best Director, Best Lead Actor, 2 Best Supporting Actors, Best Adapted Screenplay, Best Cinematography, Best Production Design, Best Costume, and Best Sound. But yet again, Scorsese is just too cool for Hollywood school.Silence - 10/10. Top 3 Best Films of 2016."
    },
    {
      "rating": "8",
      "text": "I was strongly thinking that I wouldn't give this movie a rating. I felt like I could not possibly put it on a scale of 0.5 to 5, because there was so much to it that I liked and so much of it that I didn't like as much that I was really torn and didn't know what to think. The movie was too long, the accents were bad, Andrew Garfield was great, but his Latin was borderline cringe-worthy. Why did Adam Driver have an accent while the other actors didn't? Does God exist?That is the other reason why I wasn't sure I could rate this movie: faith is one of the most personal things in the world, and this movie is comparable to that. I am sure that it resonated more with some than with others,but that is also the way faith is. Some people live for God and they think of her every moment of their lives. But that is not the case for everyone.Technically speaking, this movie is extremely well made. And nothing less can be expected from Martin Scorsese. However, the story itself may not be as sound.The reason why I am giving this movie 4 stars is that as personal and divisive as this movie is, as soon as I finished watching I felt a calm feeling spread through me. It wasn't the utter joy of La La Land, but it was also not the maddening despair of other movies. It was just calm, calm and silence."
    },
    {
      "rating": "2",
      "text": "The same three scenes repeated. The only difference is the location.\"Apostatize!\"...\"No way!\"...\"Ok, then we'll kill this guy\"...\"NOO!\"...\"Lord, help us!\"...repeat.Never do we have any further character understanding, simply the same dialogue replayed for nearly 3 hours."
    },
    {
      "rating": "9",
      "text": "Spectacularly brutal, Martin Scorsese's Silence is physically and mentally hard to watch at times. Compelling performances from Andrew Garfield and Adam Driver add to a beautifully shot film which does not shy away from crossing the boundaries of modern cinema."
    },
    {
      "rating": "6",
      "text": "I genuinely feel like I’ve aged ten years after watching this movie and at 2 hours and 40 minutes I felt every. Single. Minute. That’s 160 minutes total or if you’d prefer 9,600 seconds. 160 minutes of brutal violence. 160 minutes of pain, suffering and silence. As much as I respect Martin Scorsese as a director, I do not understand the drive behind making this torturous endurance test of a movie. It’s an interesting story that unfortunately gets dragged out and lost just after the halfway mark. If there’s one thing I can salvage from this punishing journey it’s the cast. Flawless acting from Andrew Garfield, Adam Driver and Liam Neeson. Garfield is perfection, his standout performance is nothing short of brilliance. Honestly there’s little point in my personal recommendation so if you’re left asking yourself if you should see this film, make sure to look at the trailer beforehand and that will give you your answer."
    },
    {
      "rating": "6",
      "text": "I was disappointed when I first saw the trailer for this at the movies because I thought Scorsese's next picture was going to be the eagerly awaited \"The Irishman\" with Pacino and DeNiro.  Marty is a great legendary director of course and I like any film critic, cinephile, or moviemaker am a fan.  Though I was never such a big fan of his earlier efforts which though I always respected felt were widely over-praised in some cases.  Yet I found \"The Departed\", \"Shutter Island\", and \"The Wolf of Wall Street\" not only to be excellent (all 10 ratings) but each ranked as my best movie of the respective year.  That is quite a roll not to mention how late in an artist's esteemed career!  Rarely do they get better with age.This film doesn't continue that run in my opinion.  It's well crafted of course, it's quality, it's thought provoking, and it's a good historical story set in an exotic locale with fine actors.  It's also long, slow and boring.  Had it been as good all the way through as the intensity that kicks in at about the two hour mark then once again it would have enabled claim as yet another masterpiece from Marty.Interestingly and disturbingly the film depicts a sort of analogous brutality and unyielding intolerance for religious freedom that the Japanese were guilty of in the 17th Century and the current ISIS with its similarly horrific barbaric torture and slaying of human beings is now.  That evil primitive derangement is hard to watch but as it plays here is a fine example of the power of movies and art in general to bring clarity to an audience regarding history and how it pertains to current events.  You know, if we don't learn from history we are condemned to repeat it.technical-aesthetic note:  There was an annoying change in the sub-title style during the feature.  They begin more traditionally with a subtle drop shadow (in the old days there was never any drop shadow which was always a stupid problem of readability), but then later the drop shadow is very pronounced and downright distracting.  Amateur looking and anything but elegant!  Obviously this was because they thought the brighter scenes with sub-titles later in the film needed this modified treatment.  They don't!  Consistency always matters!  It's surprising this got by Marty.And on another similar but broader note regarding all titles now in movies on the big screen, because it's all digital projection there has been this terrible digital aliasing (\"jaggies\") of text that is so unacceptable on the big screen, so wrong, so not film!  It is unbelievable this has been accepted as long as it has been going now!  I first noticed it in 2002 actually and was appalled!  Jagged digital text reeks of low grade TV/video.  Well it doesn't have to be this way.  I know how to remedy it.  Simply add a slight Gaussian blur and text will appear more filmic even when projected digitally.  The trade off is softer focus on the text but worth it!  It's the over-crispness of digital text that is so glaring when you can see the staircase edges.  I mean come on!  Or upgrade cinema projectors to 8K, which they probably should be if even television is going 4K."
    },
    {
      "rating": "9",
      "text": "This is the best movie I have seen since Interstellar. It asks the questions that any intelligent human should ponder about religion faith, spreading that faith , and the realitity of faith. Scorsese hits a home run for those willing to question. Fundamentalists will despise the movie but I sat back and went wow. About damn time, these questions were on the big screen. I am so glad I saw this and think this is what intelligent people need. A another brilliant piece of filmmaking from Martin."
    },
    {
      "rating": "2",
      "text": "\"Well, there's 161 minutes of my life that I'll never get back,\" I said as the credits to Silence rolled.There's so much wrong wit Silence that 5,000 characters might not be enough to explain it all, but I'll try. First, and most obviously, it must be said that this movie is boring. Painfully boring. When you combine the tedium with its nearly-three hour run time, you feel almost like you are a victim of the torture routinely being displayed on screen. Simply put, there is no logical reason why this film should be as long as it is, except for the fact that a legendary director considers it a pet-project, and evidently no producer or editor possessed the stones to tell him he should truncate it.Okay, so the form itself is dreadful, but what about the content? Insulting. Puerile. Apparently, Martin Scorsese believes that human faith only goes as deep as iconography. On numerous occasions throughout the film, Christians are challenged to step on an image of Christ to signify their apostasy, and the viewer is apparently not supposed to laugh at the sheer lunacy of this. Even if one is able to accept that some of these characters believe that stepping foot on an image of Christ constitutes apostasy, the set piece is used so frequently that by the time in happens to Rodrigues/Garfield, there is almost no emotional weight left in it.The saddest part of this whole project is the fact that it took 30 years for Scorsese to make it. Three decades, and the end result is this jumbled, aimless mess. The main conflict is less about Christians versus Buddhists in Japan in the 17th Century, and more about the nature of faith in the face of adversity. Okay, it's been done before, but when an artist like Scorsese takes on such a fundamental human conflict, it's not hard to pique one's interest. Turns out this interest was misplaced.Scorsese doesn't really offer any tangible answer to the questions about faith that he poses. Does God speak to us in the silence? Who knows. Does suffering enhance faith or destroy it? It does both to different characters throughout the film. Is apostasy for keeps, or can forgiveness and redemption really be attained? The hell if I know, from watching this film. Rodrigues is a weak vehicle to explore these questions, although Garfield plays him as well as anyone could, given the material he has to work with. The film spends two solid hours with Rodrigues and his flock fighting against logic and sanity to remain faithful, and not apostasize via Christ-shoeing (for lack of a better term), leading the viewer to believe he will find some way to reconcile his faith against all the suffering that comes attached to it.Nope. With 45 minutes left, and after being confronted by freshly-apostate Liam Neeson, Rodrigues steps on Christ, crossing what the film has presented thus far as an unredeemable line in the sand. But just as the film ends, as Rodrigues' body is being burned, the camera zooms to show us the crucifix that was given to him by his flock earlier in the film.Once again, is Scorsese so infantile as to say that one can apostatize as simply as deriding an icon of Christ? And then that one can redeem oneself in similar fashion? If so, why would any of these persecuted peoples not simply apostatize for the authorities and then redeem themselves as soon as they leave? According to what Scorsese presents here, it is that simple.In the end, the film's length, lack of urgency, and undermining of its own message serve to make it unwatchable. An exercise in self-indulgence for a legendary director who should know better."
    },
    {
      "rating": "7",
      "text": "Deep movie about religion - given that I am not religious this movie maybe didn't touch me that deeply but I do think that it might be a really interesting one for Christians. Just that the topic wasn't that interesting for me, but the movie itself, the visuals and the acting was really good and the story interesting, even though the movie is almost 3 hours long."
    },
    {
      "rating": "8",
      "text": "This is an exquisite treatise on faith which wrestles with difficult theological and philosophical questions whilst providing few answers. The cinematography is masterful, and Scorsese carefully explores the intricacies of proselytisation and apostasy in the 1600's to force discussions and parallels for today. The cast is superb, Garfield is particularly moving in his performance, and whilst this is a complex film, it is one worth your time. An introspective, powerful experience not for the casual viewer. 8.79/10"
    },
    {
      "rating": "7",
      "text": "To this day, Martin Scorsese remains my all-time favourite director, a man whose approach to cinema completely differs to others in Hollywood, his appreciation towards cinema as an art form is his finest quality in what makes him arguably the greatest film director around. With 'Silence' promoted as Scorsese's 20-year passion project, it was a film I couldn't resist seeing, the legend back behind the camera focusing on a subject not fully studied in cinema, a subject that's mostly misunderstood.I want to start with my conclusion and go from there. 'Silence' won't be everybody's film, the same way other ambitious films like 'The Revenant' or 'The Tree of Life' weren't, however despite my respect to Scorsese's mastery and level of detail, in my own honest opinion I believe this film fell short due to the lack of insight into it's main theme and thus instead transformed into a slow and somewhat dreary tale that arguably didn't need it's near 3-hour running time to tell its tale.Now don't get me wrong, in regards to the film's craft it is a masterpiece, the cinematography is raw and epic, the direction from Scorsese is phenomenal and the set design is gorgeous. Accompanying this are a series of fine performances, most notably from Andrew Garfield who should receive monumental praise for his role, I haven't seen such a visceral performance in years, the raw emotion is uncanny. But unfortunately the technicalities and craft can't cover up the flaws that lie in the running time and the tediously slow plot that didn't want to end.If there's anything I can leave you with from this review to help you decide as to whether it's a worthy watch or not, let me just say this: 'Silence' isn't a piece of entertainment, it's instead an experience; and whilst a technically masterful one at that, many audience members may find themselves slowly drifting off to sleep - as my neighbour in the cinema did. It isn't really a case of liking it or disliking it, it's more a case of the adventure, and despite my partial disappointment with it, the adventure was more than worthy enough for the viewing. Scorsese is still an exquisite auteur, flaws or not."
    },
    {
      "rating": "4",
      "text": "I love long story driven movies with historical content and this movie looked to have everything I like in one package, so I was anxious to see it. But it was so boring and tediously slow that I started looking at my watch one third into it. It has just one thing to say \"carry on dear Christian through all unrelenting persecution\" and it says it over and over for all 2+ hours of its run time."
    },
    {
      "rating": "0",
      "text": "This film is for believers. For whom religion is of great importance. If you are not believer, for you the film will not be interesting. Very tedious story. Full of scenes of sadism and endless reflections on God"
    },
    {
      "rating": "3",
      "text": "\"Silence\" | C- | Holy **** All of the critics raving about this uneven, overly long, self-indulgent, anticlimactic, snooze-fest should turn in their credentials. Well-crafted but so what! It's Scorsese & his team. Production values are a given. Garfield's amazing performance saves the film from a D, but Driver's awful accent is cringe-worthy. Skip it - save the 2 1/2 hours!"
    },
    {
      "rating": "5",
      "text": "Despite gorgeous cinematography, a fine supporting performance by Liam Neeson, and a handful of moderately interesting spiritual and historical political discussions, this tedious, overlong saga is largely an exercise in religious self-importance and excessively sincere overacting. Whatever points director Martin Scorsese wanted to make are obscured or diluted amidst a story line that lacks focus, direction and continuity of tone. It may not be a great film, but it certainly makes a good cure for insomnia."
    },
    {
      "rating": "10",
      "text": "After seeing the play many years ago, the movie is a tribute which follows the events closely. This is a movie requiring patience, thought and reflection as it is a powerful, moving testatment how a person interprets religious beliefs. Do we follow blindly or recognize & accept differences amongst  cultures, beliefs and spiritual journeys."
    },
    {
      "rating": "8",
      "text": "This is not an easy film to watch.  It torments viewers visually and mentally the notions of faith and doubt, the fear or love of ideas and icons, the reactions against physical and psychological violence when they are against themselves individually or when they are inflicted on others, the effects of support and betrayal and the chasm or bridge between being religious and being spiritual.  Scorsese is a true master of his craft."
    },
    {
      "rating": "6",
      "text": "This really is quite the visual spectacle from Scorcese. Sadly, the cinematography might be the best part of Silence. The actors do a mostly admirable job with the material at hand mind you, which is not always saying much. There is horror all around, but all of which can end if someone steps on a religious image. And this motif repeats over and over again for the ridiculous two hour and forty minute duration of this slow and unconvincing torment of movie watchers. The dialogue is stiff, being further hampered by the obvious necessity of having actors translate statements between Japanese and English. But worse than that is that for long stretches of the movie absolutely nothing is happening. Perhaps this is the silence of God the movie is referring to, but it ends up as numbingly boring. I don't know if there is an actor alive who could have carried the nothingness of Rodrigues the Jesuit in this movie, but I know that Garfield is not the man for the job. He's good but this is too much for him, or indeed for anyone. Nor does he get any help from Liam Neeson or most of the other participants, least of all his flock of bedraggled Japanese convert peasants. Better is the villain of the story, Inquisitor Inoue. The scenes featuring him and Garfield together are easily the strongest in the movie, and it is a shame that there aren't more of them. Along with his sardonic interpreter, Issei Ogata manages to give an almost memorable performance in this role, even in the midst of Scorcese's tedium dream. Halfway spitting venom and halfway doing a reasonable good cop impersonation he wrestles with the stubbornness of the frightened priest in front of him. It could have been so much more than this though, and in the end stubborn and scared is all Rodrigues appears to be, whether this was intended or not. If one was to be uncharitable to him one might also say that he was self indulgent, but let's leave that out for now.As for the actual conflict between Buddhist and Christian spirituality, if that really exists, we get precious little. The problem with life, or one of them at any rate, is that occasionally very little happens. And the problem with realistic movies then, which is what this basically is, is that they become undernarrated because the protagonists can only know what they would reasonably know given the circumstances. So rather than exposition of any deep nature, Silence offers uneventful, well, silence, punctuated by sporadic but highly calculated outbursts of violence by the Japanese authorities. And these are not characterized by the hopelessness of the damned one might have preferred for some sorely needed dramatic effect, but rather by the pride of the stubborn priest. And this is all a pity because this particular historical conflict is very interesting. It's just that Silence doesn't really delve into it, even at its amazing running length. It is like a theological Last Samurai that refuses to talk about theology. Oh and with Tom Cruise at a safe distance obviously. Otherwise he would have had to do something heroic or hysterical. Anyway, instead of depth we get semi-heroic attempts by the cast at conveying fervor, which generally only end up in ritualistic behavior, on both sides mind you, with tartish, irrelevant symbolism tacked on top. The cross is important and so are bells in the temple. But Christ and Buddha disappear in the silence together, as if the movie isn't about any of that at all. It is weird in a way that might have been interesting but is not.It might be worth a watch for the patient or for those with a genuine passion for Scorcese and his films. For those with an interest in Japanese culture, Catholic theology, Buddhist philosophy or the general conflict between east and west in past centuries I would recommend giving it a berth. Not a wide berth mind you. You're not risking worse than two and a half hours of boredom, which might work if you pretend you're back in school where it is your job to be bored stiff. Just make sure you have some coffee at hand. Or maybe some sort of exercise equipment to keep your circulation going. Oh, and just like in school you're highly unlikely to learn anything useful, unless you want to count learning a new way of drowning peasants with bales of hay. If you want to know about spirituality, read some Dostojevski. If you want to be bored to death by Martin Scorcese, watch Silence. They really are two completely different things here, glowing reviews in abundance notwithstanding. There is nothing spiritual about anything that occurs in this movie. It is one half European arrogance and intrusiveness and one half Japanese desire for administrative harmony and avoidance of change. They could swap clothes and the movie would very easily become a tale about tax codes and tariffs instead. And then you'd really be bored because all the hairdos and nightgowns would look exactly as boring as Silence actually is behind its flimsy garb of authenticity."
    },
    {
      "rating": "8",
      "text": "My mother more than anybody else is the reason I am a Christian today. She raised me a Christian, but never forced my hand. When I was young, she asked whether I wanted to accept Jesus in my heart or not. In high school, she told me she would love me no matter what and did not want to force me to believe in Christ. Above all, she taught me that a relationship with God is a personal endeavor. It is not one to embark on through another person. Instead, reading the Bible, speaking to God, and praying for guidance from Him is the path to fulfillment. You must find God for yourself and it likely not the same way God is viewed by others. As such, I have never gone to Church, nor will I likely ever find myself listening to somebody preach about God. Instead, I pray daily. I try to live up to his values, but I fail every single day. I sin and ask for forgiveness. Ashamedly, I am often like Kichijiro (Yōsuke Kubozuka) in this very film. Constantly asking for forgiveness only to commit the same sin once more is a great vice and struggle of my own. To see it portrayed in this film is riveting and heart wrenching. Yet, Silence's pre-eminent impact upon me is two-fold. One, what I have discussed. The personal relationship with God that one must form in order to truly know Him. Two, the doubt that comes with following the path of righteousness. If I have not doubted my faith everyday that I have truly known God, then I must have not been awake long enough on the missed days to grapple with my faith.A harrowing portrayal of God's supposed silence, but solemn stolidness alongside us through our trials and tribulations, Silence is set during the mid-1600s. Depicting the horrifying torture and persecution of Christians in Japan, Silence stars Andrew Garfield and Adam Driver as two priests, Father Rodrigues and Father Garupe, tasked with finding Father Ferreira (Liam Neeson). Allegedly a fallen priest, Father Ferreira had gone missing and fallen victim to the wrath of the inquisitor. Father Rodrigues and Father Garupe have faith, however, that he has not left the faith. Upon arrival in Japan, they find a horrible picture. Torture, pain, and hidden Christians who are persecuted and threatened with death. This leads to some graphic moments, but the film is not overly violent. Instead, it gives a face to the sound of the tormented who were forced to suffer as Christ once did.That said, Father Rodrigues - after suffering for a long time - has an encounter with Father Ferreira. It is once Father Ferreira is brought into the fold that Martin Scorsese's incredibly personal film soars. With Father Ferreira, Father Rodrigues learns why they are being persecuted and why they have failed to lead the Japanese to Christ. Above all, he learns that beliefs speak louder than actions or words. As such, we see Father Ferreira explain that the language and cultural barrier is too great for somebody uninitiated in the culture to teach the Bible. Though those being killed are dying for what they believe is Christ, they are instead dying because Rodrigues (and Ferreira before him) had told them to die. It is only through the apparent and repeated renouncement of God that their suffering will stop and, as such, it is a necessity. However, they learn to live in hiding. By day, they identify Christian items for the inquisitor. Yet, all throughout the day, they speak to God and foster their relationship with Him. Though they renounce Him to the Japanese when they ask, it is done to further the word of God throughout the country. By hiding and denying Him verbally but not in their hearts, it is not an act of self-preservation, but a way of letting Christianity survive in Japan. As Father Rodrigues says at one point, to say that he is dead, it would mean that Christianity in Japan is dead. Without Father Rodrigues and the other fallen priests retaining the faith within them and not causing their people to suffer, they gain strength and are able to do their work as missionaries. Those who seek the fallen priests and wish to learn the way of God are rewarded with a man that is able to speak to them about God. Though the film does not depict these moments, the final shot of Father Rodrigues still holding the cross after he is dead certainly shows that the man died a man of faith and, as his scene with Kichijiro highlighted, he was still willing to shine a light for others.One of the most important moments of Silence, however, is when Father Rodrigues steps on the image of God. In the Bible, God rebukes those who worship idols and practice idolatry. This image is an idol. It is not God. God Himself tells Father Rodrigues this when we hear God speak for the first time in this film. He encourages him to step on the image and to save the suffering followers. Father Rodrigues does so and the Japanese Christians suffering in the pit and tied upside down and spared. For the rest of his life, he finds other idols and reports them to the Japanese."
    },
    {
      "rating": "10",
      "text": "Sounds like hyperbole given the great competition on both accounts, but yeah. This is it. Even with all due respect to Mel Gibson's Passion of the Christ, which was always going to be very hard to top...but this one is it.Pretty much the most profound movie on any topic I have ever seen. Leaves you shacked to the very core of your soul. Possibly depressed and questioning your own faith. Possibly more inspired than ever before. Likely a mixture of both, even if that's a contradictory statement.Spoilers below, so obviously don't read if you haven't watched.But my interpretation of the ending goes back to my favorite Bible verse.Romans 8:38-39    For I am convinced that neither death nor life, neither angels nor principalities, neither the present nor the future, nor any powers, neither height nor depth, nor anything else in all creation, will be able to separate us from the love of God that is in Christ Jesus our Lord.…Because even though in many ways Rodrigues appeared defeated at the end - he was forced to deny Christ, he was stripped of his entire Christian identity, he was made to work against the spread of the faith, he was given a Buddhist name, family, burial etc - and more importantly, even if internally he might have lost all semblance of faith, or at the very least was left tormented and conflicted, though might have appeared peaceful on the outside - even if his body, mind, and entire being were metamorphosed, even though he heard nothing but silence from God --- none of that, and nothing else in existence, separated him from the love of Christ.The ending could have worked perfectly well even without the cross in his palm - but I felt it was a symbolical gesture of the above.10/10 if there ever was one."
    },
    {
      "rating": "9",
      "text": "While it's far from being Scorsese's best film, this is still one of the more powerful and quietly unflinching films from 2016 that I've seen. The impressive cinematography is wonderful to watch and much of the imagery is quite impactful and memorable. As for the cast, Andrew Garfield delivers yet another brilliant performance after Hacksaw Ridge. Adam Driver and Liam Neeson in supporting turns also manage to make the film worthwhile. Overall, its length and heavy-handed faith-based message may prove as turn-offs and controversial for many. However, for those with the patience and fortitude to give it a shot, it's certainly not to be missed, especially for fans of Scorsese as he still proves that he's not quite out of touch with brilliant filmmaking just yet, even at his current age."
    },
    {
      "rating": "6",
      "text": "You    know Scorsese is a    good filmmaker when he can make Adam Driver even uglier.    Going a bit overboard with the god thing......"
    },
    {
      "rating": "10",
      "text": "Silence is well written and directed film by no other than Martin Scorsese, he triumphs again with this chilling Drama filled with violence and intrigue?What silence does best is that creates a dynamic perspective for its characters which is perfected by the actors.Silence in its heart is to emotionally set you in the characters situation and make you ponders every act they make.Overall silence makes you question your faith and strength, and is truly undeniably an amazingly perfected film."
    },
    {
      "rating": "10",
      "text": "A Martin Scorsese nearby to The last temptation of Christ. A deep reflection of the faith, the tolerance and the meaning of God and the Christianity. Andrew Garfield wears well and mature as a missionary. Outstanding photography of Rodrigo Prieto. One of great forgotten by Academy Award."
    },
    {
      "rating": "6",
      "text": "This film is certainly for the religious, and everyone else will probably find it annoying. I enjoyed it for the most part, up until around the 2hr. mark when suddenly the main character Rodrigues (played effortlessly by Andrew Garfield) decides to go against his upbringing and sacrifice his own beliefs, ultimately leading to an unsatisfying ending. Despite this, the film leading up to it would have sufficed as very well-done and enjoyable enough to see how a group of oppressed Christians in Japan lived and died because of their unwavering faith, which is a more powerful story and resolution than the last 40 min."
    },
    {
      "rating": "7",
      "text": "A harrowing portrayal of God's supposed silence, but solemn stolidness alongside us through our trials and tribulations, Silence is set during the mid-1600s."
    },
    {
      "rating": "8",
      "text": "After reading the book, I went to see Silence and was thoroughly pleased with Scorsese's work. When there wasn't dialogue in the film there were sounds of nature or pure silence.  His use of literal silence at particular points in the film enhanced my appreciation and understanding of that theme in this story because it is something you can't fully achieve by reading. A lack of noise is unsettling to me because it's not typical. People are rarely silent and even when they are nature is speaking. Is God speaking through his creation? Do the sounds heard only make God's silence more prominent? Why is God silent? How can we hear Him? These are all questions I found myself asking watching this movie and reading the book. It will definitely leave you with plenty to ponder."
    },
    {
      "rating": "9",
      "text": "Beautiful film, difficult to watch in some cases, and the central question of it is one we all have to deal with.  Don't go to be entertained, although this is an entertaining film-- go to be challenged. The final shot is both affirming and devastating. My wife and I saw the film Friday -- it's Monday as I write and we're still talking about it."
    },
    {
      "rating": "7",
      "text": "Silence is one of the most heart-wrenching and moving movies I have ever watched. Seeing the persecution of Christians hit home hard because they were dying for things I believe too. I asked myself, would I too die for my faith? Some of the scenes were probably some of the most horrific and graphic images I have ever viewed, but it made the movie so believable, so raw, and so real. If I weren't a believer, I think I would find myself curious to see what these missionaries believed and why they found it to be true. I honestly wasn't disappointed in the film, even having read the book. I think everyone needs to see this and realize what the missionaries had to go through. In the end, my appreciation for the freedom I have in my country soared and I feel humbled realizing how great a gift I have received by grace. To my surprise, the cinematography wasn't a bit cheesy. Some of the most beautiful and still images reigned throughout the whole film and I was utterly impressed. The style reminded me somewhat of Emmanuel Lubezki's films, but there was definitely more action. The locations were they shot were breathtaking as well. 'Silence' sure has got me thinking."
    },
    {
      "rating": "6",
      "text": "Much like the protagonist Sebastião Rodrigues, the events in this movie are going to be a test of faith for some of those watching it. Perhaps the film's greatest strength is in its ability to place you in the character's shoes as he finds himself in the unenviable position of having to choose between abandoning his beliefs or continuing to watch others suffer because of them.It's certainly not an easy film by any means. Despite being gorgeous enough to receive an Academy Award nomination for Best Cinematography, it's hard to not want to look away from time to time due to the horrific displays of persecution, execution, and torture that take place on both physical and psychological levels. That's because there's a bare naked reality to these scenes. You won't find any explicit blood or gore outside of a single beheading, and it's this kind of restraint and maturity that makes everything so much harder to witness. Especially with Andrew Garfield's gut-wrenching performance as the man being forced to bear the burden of it all really driving the conflict home.What made the movie difficult for me personally though was the message. I can see the ending being very divisive among the religious. One of the questions it asks is whether or not one can publicly and repeatedly apostatize, yet still actually hold true to God in their hearts if it is done to protect others. As Liam Neeson's \"Father Ferreira\" puts it, \"Only our Lord can judge your soul.\" And didn't Peter himself deny God three times? Is this in fact the greatest and most Christlike act of love a man can perform? It's all left open to interpretation, but due to its handling all I feel right now is conflicted.A remarkable aspect of Silence is how it feels very personal. Like Martin Scorsese's way of addressing his own struggles with religion through the medium he knows so well. Those who have studied him and his work would be remiss to avoid this even if they don't find the subject matter appealing. Perhaps I myself will find a greater appreciation for the film upon further reflection and a rewatch somewhere later on down the line."
    },
    {
      "rating": "10",
      "text": "This movie is probably one of the hardest ones you will ever watch if you are a Catholic. It begs the question: Is my faith worth the suffering of others? The Jesuit missionaries were always willing to die for their faith. That was never an issue (as shown by the numerous martyrdoms). But what about when preserving your faith directly causes the suffering and death of countless others?"
    },
    {
      "rating": "6",
      "text": "My suspicion is that a significant amount of what Martin Scorsese had inside his head did not actually make it into the movie because what we seem to have here is 161 minutes of screenplay that never really seems to go anywhere.Frankly, I'd rather watch Shogun again.  (I've watched it a dozen times at least.)  The 1980 NBC miniseries ran on for nine hours and change and did a far better job describing Japanese culture and the trials of Europeans and the Catholic church in Japan during a period when samurai ruled the land and various warlords were competing for supreme power.Silence, by comparison, comes to seem a bit like flogging a dead horse.  It's the same thing over and over.  The samurai want the priests to renounce their religion.  The priests want to evangelize.  The peasants get kicked back and forth between opposite poles and you should be able to guess where it all ends.If you enjoy the obscure, then by all means sit through this film and try to scope out whatever it was that kept Martin Scorsese working on the project for 25+ years.  I majored in philosophy and, sorry, I'm not seeing anything here that's particularly profound."
    },
    {
      "rating": "9",
      "text": "Martin Scorsese directs another masterpiece. My eyes were glued to the screen the entire time. Andrew Garfield gives another Oscar performance along with Adam Driver. Even though the film can be a little touchy I thought Scorsese did it with the upmost respect. But wow what a story and it gives you the true meaning to be a Christian and the hardships that go with it."
    },
    {
      "rating": "10",
      "text": "Beautiful and daring movie! Shows us that faith has no colors, and that that the true nature of human beings is all about the same. I congratulate Mr. Scorsese for pulling this off."
    },
    {
      "rating": "4",
      "text": "Once upon a time in the 17th century. Catholic missionaries (Andrew Garfield and Adam Driver) face their ultimate test of faith when they travel to Japan in search of their missing mentor (Liam Neeson) – at a time when Catholicism is strictly outlawed and their presence forbidden.Of all the recent critically praised movies I've watched, \"Silence\" is the one I don't get. I mean, I understand what's happening on screen, and I like the fact that Scorsese realized his long-planned non-mainstream spiritual project... But I find it boring. The first hour or so especially. Also, I was not much impressed by the spiritual side of the story. For starters, there’s nearly not enough deep conversations and thoughts for this 161 minute movie. Often it feels that the story is really not going anywhere and the main attraction is Garfield’s character having glorious mane of hair and making sad faces. The result would mean probably more for Christians but for others, the far and few meditations on God, faith and human nature offered here may wear thin soon. Or maybe I read too much spiritual literature to be carried away by couple of deep lines thrown to us here and there.The Japanese side of the conflict is actually better fleshed out and more interesting than missionaries’. If it was the intention all along, why is the main emphasis on the latter? After watching „Hacksaw Ridge“, I quite like Garfield but his character is one-note and doesn’t offer many opportunities to flex that acting muscle. There's a limit to how long I can be interested in watching him look sullen and pout around.Driver’s character has even less screen time and ends up unused and bland. Neeson is solid as usual but his role is also quite small.„Silence“ felt like a Terence Malick movie, with less beautiful sights and more monotone story. I should try to rewatch in the future. Maybe I will understand then why it’s so highly acclaimed. If the name Scorsese wasn’t attached to it, would the movie lovers still love it so dearly?I watched the trailer before the movie itself and it felt quite generic, just flashes of action and epic moments searching for a proper common ground. Having seen the movie, I gotta say this approach makes a lot of sense. If one wants to promote \"Silence\", one has to make it look livelier than it really is, outside or in."
    }
  ]
}