{
  "id": 1535,
  "title": "Silent Hill",
  "starring": [
    "Radha Mitchell",
    "Sean Bean"
  ],
  "runtime": 125,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "Rose, a desperate mother takes her adopted daughter, Sharon, to the town of Silent Hill in an attempt to cure her of her ailment. After a violent car crash, Sharon disappears and Rose begins a desperate search to get her back. She descends into the center of the twisted reality of a town's terrible secret. Pursued by grotesquely deformed creatures and townspeople stuck in permanent purgatory, Rose begins to uncover the truth behind the apocalyptic disaster that burned the town 30 years earlier.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/r0bEDWO2w4a43K2xTNSF284qOsc.jpg",
  "categories": {
    "plot": 6.766666666666667,
    "acting": 8.529411764705882,
    "ending": 6.333333333333333,
    "soundtrack": 7.0,
    "cinematography": 9.666666666666666,
    "familyFriendly": 3.0,
    "funny": 3.6666666666666665,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Slow-paces, non-scaring, but very disturbing and beautiful... the best video game movie ever."
    },
    {
      "rating": "10",
      "text": "Dont listen to the critics, if you are a fan of Silent Hill you will love this movie. It was extreamly well done! Specially when you have to tell in 2 hrs the extremely difficult story of Silent Hill. It goes deeper than most people realised, and fans of the game knows this. The people behind this movie are fans and they did the best they could to explain what happen. This is the best Video game to movie I have seen in a very long time. Dont miss it!"
    },
    {
      "rating": "10",
      "text": "best movie ever."
    },
    {
      "rating": "9",
      "text": "Amazing movie. All the critics on here with the low scores are clearly morons who can't comprehend a real plot. Great plot, best video game movie out there, definately a must see if you can comprehend plots that aren't laid out in front of you."
    },
    {
      "rating": "9",
      "text": "Silent Hill is a video game adaptation and it deserves plenty of praise for its efforts in staying true to its roots. All the critics' that bashed the movie have obviously forgotton some of the terrrible video game adaptations of the past (e.g. Street Fighter, Resident Evil) The writers from these took a decent storyline and turned it into garbage. There's nothing wrong with staying true to game plot, that what some of us want. Almost all book adaptation regurgitate the whole novel and receive good reviews but vdieo games' movies that does the same get stepped on. Maybe the critics that wrote these terrible review should actually play the game FIRST before writing up a review about the movie. If they say the acting is bad, than maybe they should rewatch Harry Potter and look at the \"OVERACTING' and reconsider the high ratings that they gave the film. Silent Hill was enjoyable, it is a good piece of entertainment for the weekend and for those of us that played the game you will appreciate the efforts that were put into this movie. The Critic's are obviously narrow minded and only believe films \"inspired\" by true events are worthy of good reviews........making money on a tragedy that happen in 2001 on flight 93 sure make the families of the victims very happy. Oh, and maybe Hollywood writters and directors should come up with original ideas and stop making bad movies from adaptations. Before they do that, they should take back their bias opinions and reconsidered bashing a game adaptation movie that is saving their butts in the box office."
    },
    {
      "rating": "10",
      "text": "Another example of the type of movie that critics don't like and the general public love. The problem with all the people with their comments being \"nonsensical storyline\" is that they either know it's a video game adaption, and don't think deep into it, or just can't make sense of it because you have to actually *gasp* think! Some of the best cinematography is here, as well as the best atmosphere in any recent movie that I can remember. The story, by no means stupid or nonsensical, requires you to think about every character and pay attention to little details, and eventually it all falls into place. I found myself more than confused at some parts, but then it clicked and everything made sense. So, in conclusion, this is a movie that people who are actually normal will appreciate. It has breathtaking cinematography, a suspensful, deep, and frightening storyline that deal with religious fanatics, condemnation, judgement, retribution, and revenge. Oh, and to all the people who think the creatures are CGI and look fake, most of them are actors in latex suits and costumes, with little touches of CGI here and there. What, humans in latex don't look real?"
    },
    {
      "rating": "9",
      "text": "This is an intriguing film. The visuals are stunning and disturbing. The sound design is phenomenal. All of this you've heard before. So, I figured I might address some of the other critiques.The mixing of live actors as well as CGI for the monsters was brilliant-- Acting: I actually think the Rhada Mitchell, Laurie Holden and Alice Krige were really good. The rest were okay. Confusing Storyline: The movie has a story...and it isn't nearly as confusing as a David Lynch film. But the thing about horror is that over-explainations often ruin things. Generally, I think Silent Hill is working a certain type of Horror...it is a type that we don't see a lot--but I also think the film brilliantly misdirects what sort of horror it is. This is not a slasher flick, it is not a ironic take on the horror genre. It also isn't exactly a gore-fest. Like Lovecraft, this is a film about isolation, about helplessness, about madness, about obsessions, about religion...it is about disorientation. The horrors are there, but sometimes they are grainy and hard to see...and then sometimes they are right up in your face. The film also has a European style horror pacing (which tends to be a bit slower than American), and works Twilight-Zone/David Lynch style ambiguity. And the film is scary. I think it should be seen in the theatre with a great sound system. I know that the film has gotten lots of negative reviews...but I dont' think the reviewers are watching it in the right spirit. Silent Hill is not about realism, but about surrealism. And that is pretty cool."
    },
    {
      "rating": "9",
      "text": "Rating this movie a 27/100 is preposterous. This is by far the best videogame adaptation yet to the big screen, with some of the most detailed cinematography yet seen in any horror movie. Thats the problem with most of these reviews. Most of these critics have probably never even touched a videogame in their life. Most of the gripes about the movie has been about the confusing ending, 'bad' acting, and the overall corniness of the dialogue. I'm not making excuses or alibis here, but personally I loved the script of the movie simply because it stayed amazingly true to the games. The acting in the games were 'bad', the dialogue was 'bad', but thats the point. This movie is extremely stylized, and stayed true to its roots. Fans may complain about some plot changes but damn't, its a good thing cause it means theres gonna be sequal with the way it ended. I personally can't wait."
    },
    {
      "rating": "5",
      "text": "Rose travels to the abandoned town of Silent Hill in search of answers to her daughter's mysterious sleepwalking and, following a traffic accident, the pair are separated resulting in a desperate search through the deserted streets of the town.\r The special effects and CGI are suitably creepy and really evoke the mood of the video games and overall everything is well directed making for some fairly interesting scenes.. Unfortunately however, despite far too much exposition and explaining of back stories, the plot doesn't make much sense and isn't particularly interesting anyway (something which is even more frustrating since the second video game in the series has a pretty decent storyline) meaning parts of Silent Hill can be a bit of a chore to sit through.\r Some horror fans may enjoy it but In the end this is yet another example of a video game license being mis-used."
    },
    {
      "rating": "1",
      "text": "1. Of course, its always a good idea to take your child to a place she\rhas nightmares about.\r2. Of course, you should always make a beeline for it wen a cop stops\ryou from going to said nightmary place (she could've saved you a hell\rof a lot of trouble than u cud imagine, but nooo, you have to save your\rchild by taking her to spooktown....which you have read about in detail\rin websites!!)\r3. Of course, its a marvelous idea to have a chat with one of the three\rwitches from Macbeth who looks beyond dead and rotting.\r4. Of course, Macwitch has a penchant for quoting inane biblical\rphrases.\r5. Of course, bust out the chesty lady cop to appeal to the male\rdemographic.\r6. Of course, you should put your hand inside an impossibly twisted\rrotting corpse. Ooh, nothing can go wrong there. NOT! (Gosh, leave the\rdead and their belongings alone. Its bad enough that they are dead)\r7. Of course, the husband gets help from the most unhelpful cop in town\r(from the way the cop talks, it looks like he loves puzzles and must\rmoonlight as a puzzle maker.. And a lousy one at that! Or maybe he's\rconstipated. Yep, that's it...that's why he talks like that.)\r8. At this point, its safe to assume that the mother and daughter are\rdead what with the father sniffing out mommy's dang perfume and not\rseeing her.\rFun fact= Ideas that the producers thought would make this movie\rscrewy...er..scary- disabled zombies, paint peeling, mutated bugs\r9. Of course, the grim reaper (or whoever that guy who has a short self\resteem and carries a ridiculously big sword to compensate)...yeah, of\rcourse, he has a Toblerone for a head.\r10. Of course, by all means let the basket case of a lady accompany\ryou. She won't be irritating at all, its especially endearing to be\rpreached at (Hey, newsflash ms.nutty, Moses called, he wanted his lingo\rback!)\r11. Of course, I fell asleep. (sigh...rewind)\r12. Of course,\rbeing holed up with a bunch of Bible thumping freaks who looks as if\rthey haven't bathed in over a 100 years is always a great idea (I'd go\rwith Mr.Tobleronehead. At least, that death will b quick)\r13. Of course, undertake a quest as proposed by Lady Creeptastic. She must\rmean well and care about you.\r14. Whoa... McBusty cop dead? (Right at this point, the male\rdemographic must've left the theater)\r15. Of course, more dreary and boring rusty decor (What is this style\rcalled? Urban evil chic?)\r16. They've busted out chesty nurse zombies. Of course, the male\rdemographic are back.\r17. Of course, unoriginal flashback bla bla bla shown on old film reels\r(You'd think that the dark forces, with all the power they've got\rgoing, would have better quality film reels for flashbacks)\r18. Of course, I fell asleep.....again. (Gee, i wonder why?)\r19. Of course, the movie's going downhill, so why not add a bucket more of gruesome to\rit. Burning a small girl sounds just about right.\r20. Whoa! Busty cop's alive? Of course, she is. I mean who wouldn't be,\rafter being whacked on the head with iron pipes.\r21. Of course, she's alive only to be burned in the next shot. (Note to\rproducer- stop yo-yoing, **** and make a decision)\r22. God, this movie's laaaaame. Kill me now.\r23. Dayyum... Mother got sucker punched. Niiice. Of course, she needed\rthat, what with all the bloody useless running around and putting hands\rin dead ppl and ****\r24. Of course, trying to talk sense into a group of fanatics is always\ra good idea. Sure, they'll listen to u and change their beliefs.\r25. This evil entity likes to peel paint.\r26. Of course, kill Lady Creeptastic with an unoriginal rectal cleaving\rand the others with fence wires.\r27. Of course, the mother and daughter were dead. U gave that away in\rthe first part itself, moron."
    },
    {
      "rating": "2",
      "text": "The director doesn't know **** about horror, I am afraid. The movie was a disaster & shamed the SH franchise. True horror is not about scaring you but masterfully messing with you - something you can appreciate than being throw waves of monsters and expecting to have a good time. Said very simply: true horror deals with human nature, not the monsters."
    },
    {
      "rating": "4",
      "text": "Silent Hill is a very atmospheric movie that does not entirely live up to the epic video games. It is disturbing, it is frightening at times but it is dull and an overlong experience."
    },
    {
      "rating": "3",
      "text": "Aburrida y sin tensión, otra película floja sobre videojuegos que, no se como, logra gustar a algunos. Todo es una sucesión de chorradas que no asustan nunca, es una pérdida de tiempo, pese que la atmósfera se parezca a la del juego."
    },
    {
      "rating": "1",
      "text": "I'm gonna be harsh on this because I love the first 3 games, and people are saying this movie follows the story of the game. Well I'm an expert on Silent Hil, and I'm telling you right now, this movie doesn't even come close to the story of the game. It's not even interesting. There's a few interesting visuals and like half of the movie is boring. The story of Silent Hill in the game is about a cult that lives in Silent Hill and they are trying to birth a demon god through one of the members psychic daughter, Alessa. The movie has nothing to do with this. Alessa is good and in the movie they made her the villain? What? They also made Alessa an evil girl who just wants to torture people and kill them. Trust me, if you want to see this movie because you like the games, you will be very disappointed. If you want to see this movie because you think it's good, it's not. Ignoring the source material for this movie, it's just boring and uninteresting."
    },
    {
      "rating": "5",
      "text": "silent hill, It's the film where the plot is scarier than the movie itself. The cgi fell a little short and it all looked like a ps2/3 game.  Especially when there is a lot of gore, that is really hard to fake with cgi and just made me laugh rather than be scared!  Also there is no reason the movie had to be 2 hours long, it could have been wrapped up in 1 h 30 min,\rIn the end, if you liked the game then you are probably going to like the movie, if you haven't played the game or didn't like it, then the movie is meh, it really needs your imagination to help with the movie, it isn't naturally that terrifying."
    },
    {
      "rating": "3",
      "text": "Aside from a few good scenes, this movie is nonsensical and abysmal. 28/100"
    },
    {
      "rating": "5",
      "text": "As far as video game movies go, this ain't half bad (or it's extacly half bad, which is still pretty good for a mid 2000s video game adaptation).It actually tries to capture the spirit of the games, unlike other adaptations of the time.The visuals are really damn good (though it still can look very cheap at times). The acting is pretty good, though Jodelle Ferland who plays Sharon really isn't.The film is too long and it loses all momentum whenever it cuts to Sean Bean's character. There's a fanedit that is shorter and removes all of Bean's scenes and apparently it's pretty good, so I might have to give it a watch.This is a movie that's better to look at than to actually watch. It gets very repetitive and I kept losing interest, but it sure does look creepy.The sound and music are also very good (though I did notice one line that sounded like it was composited from two different takes and it sounded really bad).Overall, this is one of the better videogame adaptations, though its flaws still keep it from being more than average, which is still a big step up from other films of its kind."
    },
    {
      "rating": "0",
      "text": "This film is nonsense. He is frankly weak as just a horror movie, and as a continuation of the traditions of the game Silent Hill. The director of this film collected the cliches and the main features of all parts of the computer game and mixed it at his discretion, not giving a damn about the lore of the game."
    },
    {
      "rating": "10",
      "text": "This is perhaps the best movie based on a video game ever.  The way it resembles the game (ex. visuals, music, story) make it truly a great film based on a video game series.  If you played a Silent Hill game than this is all familiar to you and you will appreciate the awesomeness of the film."
    },
    {
      "rating": "10",
      "text": "This is the best horror movie ever made the critics obviously have no idea what the words \"deep storyline\" means this is so true to the game its ridiculous its also one of the only movie based off of a video game that was a good movie instead of things popping out at you every 5 seconds this movie delves deeper then that the beginning starts kinda slow but once you get to silent hill it starts to get interesting the psychological horror is is amazing with flashbacks and hallucinations and with few but huge scares this movie will keep you guessing and want more"
    },
    {
      "rating": "10",
      "text": "This was the best movie that has come out since Resident Evil 2 ! It stuck so well with the games(even though iv beaten all but SH 1) the sounds,music,camera,monsters,and alot of the characters and plot are straight from the game.The people who say it not a good movie are complete morons, same goes for the critics, idiots! If your a fan of Silent Hill (best game saga ever made )then you'll love this movie!"
    },
    {
      "rating": "9",
      "text": "This is the best Video game adaption to Cinema that I ever seen. AMAZING MOVIE that stupid critics don´t undestand....To the critics : LEARN about Silent hill before write a non sense article."
    },
    {
      "rating": "7",
      "text": "It was overall a good film, it explained the story well and showed pretty good effects. As a video game adaptation, i would recommend especially since its based off of Silent Hill"
    },
    {
      "rating": "9",
      "text": "I feel bonded with the movie since it successfully employs lots of elements from morality problems of human nature, demonstrating them in a charismatically quasi-symbolical way. The most critic-vulnerable element was the deus ex machina thing, explaining the rationale of the whole thing in a few sentences. nonetheless, if not for anything, should be appreciated for stating faith of any kind has no de facto morality guarantee, and closer to deviation and perversion even from faithlessness itself. Perfect for watching, but not consuming. Ignore critic rating."
    },
    {
      "rating": "7",
      "text": "This film can be good and bad, depending on how It's viewed and who It's viewed by. Particularly serious fans of the series may be better of just playing the game instead. If that's not or IS you but still intend to watch it, Don't jump to any criticisms until you have seen and understand the film in full."
    },
    {
      "rating": "6",
      "text": "Not a great movie by far, but to be fair a decent adaptation that stay surprisingly true to the source material. Plenty of better horrors out there, but as far as video game adaptations are concerned, this one isn't half bad. A decent attempt and worthy as a budget purchase. Mandatory if you are a fan of the games."
    },
    {
      "rating": "10",
      "text": "Rate this movie is easy. The movie was made for ALL THE PEOPLE IN THE WORLD that played Silent Hill in the glorious Playstation. The first Silent Hill is just a master piece. If you played Silent hill 2, 3 or The Room, it's not the same... if you never played any game of silent hill, even worst... I saw this movie with a smile and tears in my eyes because it was everything that I imagined when I finished Silent Hill several years ago... ALL is just perfect; I read that some Critics and User reviews said that the movie has no reality that it's too fantastic... Those who said that didn't understand the idea of the movie, that it's just the same of the game. The story has to be twisted, unreal, and for those who said that \"It's a bad horror movie\"... you're wrong from the beginning... The best of silent hill is that is not a horror movie, it may appeared but it isn't, it's not a suspense film, it' may have some points but... it isn't, the best of silent hill it's that to \"mark\" this film in some genre, we need to install a new genre, because silent hill is unique... play the first video game then watch the movie again, This movie doesn't care critics of those who don't played the game, It's just a tribute for the game and those who enjoy it!!! Resident Evil film doesn"
    },
    {
      "rating": "5",
      "text": "It's just okay. I'm a huge fan of the silent hill series, and there are a lot of things this movie does right such as the art direction and the settings always look great through the whole movie. However there were many changes to the plot that I found unnecessary and caused it to lose the unique touch that the older games had. Also the script writing is very hit and miss, sometimes the dialogue is good, other times it falls flat on it's face. I know SH1 wasn't exactly a shining example of good script writing and voiceovers but that was a game made in the 90s. I will say that it's miles above many of the other game-to-movie adaptations and doesn't just feel like a cheap cash in. It just could have used a lot of improvements and I really wanted to see the actual story of silent hill 1 play out in a movie... I mean how can you make a movie based on the first game and not include Harry Mason?"
    },
    {
      "rating": "10",
      "text": "The movie was interesting and even though it had a slow start it picks up like most movies. This by far was the best horror movie I have seen created in this century. The acting wasn't too bad but there were moments where the characters don't give you the feel of the movie. The monsters were probably the most realistic then any other movie I have ever seen. The atmosphere gives you an eerie feeling. The music was excellent and was played at the right moments. There were parts in the movie that made me think what the hell am I watching. In my personal opinion I thought the movie was perfect."
    },
    {
      "rating": "10",
      "text": "this has to be the best video game to film adaptation that i have ever seen. the soundtrack was brilliant, the lighting and shading used to portray silent hill was spot on, most of the monsters were made using real people and make-up instead of crap overused CGI, the acting was actually okay for this genre. it's only setback would be that the ending was slightly flawed as it contradicted itself and it didn't have enough pyramid head in it! but overall, this film is a small step forward in the ongoing war to actually make good video to game movies."
    },
    {
      "rating": "7",
      "text": "I love the games and i was curious about this movie, it was enjoyable some part were good designed and the story was also nice. It's was a movie that i enjoyed and the ending was one of the best parts but there is horror movies that i enjoyed more. For a Silent Hill lover it is a decent movie but for someone that don't know the games is a little blank."
    },
    {
      "rating": "7",
      "text": "As both a horror and video game fan I was at first quite sceptical about this title. But unlike the, to me, quite close to disastrous, Resident Evil remakes (although I haven't seen RE: Afterlife yet) I was pretty much surprised about Silent Hill. The atmosphere in the games is amazing. And I think they managed to convert it into the movie pretty well. The acting isn't bad at all either. Jodelle Ferland who seems really talented to me (based on her roles in Kingdom Hospital  Tideland) again is pretty steady in this movie although her role is quite small this time. Same as Radha Mitchell and Sean Bean act pretty decent. You can easily imagine the fear Mitchell (Playing the main character) is experiencing during her forced visit to lovely Silent Hill. Like most  horror movies nowadays this one isn't outstanding either but it definitely will not waste your time."
    },
    {
      "rating": "3",
      "text": "I was led to believe this was one of the best movies of the year when; when I watched it I was very let down."
    },
    {
      "rating": "0",
      "text": "Wow, everyone in my theater thought it was horrible, and I did too. My friends and I were laughing at the \"scary scenes\". Only cool part was when it turned dark...but that happened like only 3 times in the whole movie. Then you add in the ending of the movie and it made worst movie of the year for me, including Benchwarmers."
    },
    {
      "rating": "8",
      "text": "Never, ever, ever listen to critics when it comes to film. I can't say that enough. This especially applies to a film based on a videogame such as Silent HIll. Film critics are notorious for hating video games as a form of art/entertainment. Sorry Roger Ebert, but you're old and this is a whole new world. Yours and other critic's opinions on this film is irelevant in my opinion. Now for the movie: If you played the games religiously, as I have, then you will definatly appreciate what has been done in the transition to the big screen. It looks great, it sounds great and 99% of the time it just feels right. People who saw this movie with me who had never played the game left the movie really confused. Aside from the lame dialogue, and liberties taken with the story from the first SIlent Hill, this was my only gripe with the film. It is definatly for the fans of the franchise and everyone else is really left in the dark. That aside, everyone can agree that this movie does magicaly transport you into its foggy, gloomy world. And to be honest with you, I am glad that people who never played the games left the theater a bit confused because figuring out the truth about Silent Hill is what has made the games so great. I'm still trying to figure them all out, as I'm sure some of the hard core fans of the series are as well. As a Silent Hill fan: 9 As a film geek: 8"
    },
    {
      "rating": "7",
      "text": "Critics give it 30/100 and user comments give it 81/100. I know which I trust more. Most of those critics probably aren't videogame fans, let alone have ever played and understood the ideas behind Silent Hills. It's a psychological/mythological/horror hybrid. This film is the only one so far to be true to the videogame it is based on for, like the game, it lets you wallow in the atmosphere rather than bomarding you with action every few seconds and it doesn't cheat the viewer by having a totally upbeat ending."
    },
    {
      "rating": "3",
      "text": "This didn't need to be a two-hour film. It dragged on way too long at times and it just never sits right with me. I think they get the atmosphere right for the most part but that's about it. Sean Bean does a good job but the rest of the cast leaves a lot more to be desired, Some of the acting in this film more is just so blunt and straightforward, It was like they just couldn't put forth the effort to convey any sense of emotion."
    },
    {
      "rating": "10",
      "text": "A nice movie made to fans! Easily the best adaptation of a game to the movies."
    },
    {
      "rating": "2",
      "text": "A process of illustrating this movie is quite flawless, soulless, and joyless. Of course, the set design of scree translations is too much anomalous from that of the original game."
    },
    {
      "rating": "10",
      "text": "One of the best horror movies ever produced and definitely one of the better games-> movie. I was confused that one character was in both the past and present and looked exactly the same, but then researched the issue and saw, if you look, you can tell he does age. Coulda did a better job at that, otherwise, this movie hits the mark. Loved the resolution and Outcome"
    },
    {
      "rating": "7",
      "text": "At first I was going to give this movie an 8 or maybe even a 9, but then I actually played the games (all 1-4 of them!) and realized that: 1.The games are far more engaging in story and character than most movies ive ever seen and most especially this movie. 2. It is much like watching someone play the video game. (watching someone actually play the video game is, in fact, quite entertaining in itself though, especially with commentary from an unexpecting gamer) Overall, the movie is great fun with truly sick scenery and atmosphere combined with a great soundtrack from Akira Yamaoka (who also created the soundtrack for the games). Its drawbacks are its somewhat incoherent story (suggest playing the game first for a much greater understanding of the movie),lackluster dialouge at times (though not as bad as critics say) and the aforementioned fact that the video game itself is more engaging than the movie. I must say that, though not that scary, it is superior to most of the recent horror titles out there at the moment due to atmosphere and a plot, though messy, will keep you entirely glued to the seat throughout the movie."
    },
    {
      "rating": "10",
      "text": "This movie is downright scary, it made me crawl within my seat, i played some games and there also really scary thought the games are better than the movie but it was a cool movie"
    },
    {
      "rating": "2",
      "text": "This movie was a very generic horror picture. The acting, the plot, the set, the music was average at best. Lacked the tension, and true horror the video game Silent Hill had back in the days."
    },
    {
      "rating": "0",
      "text": "Completely contradicts the game. Takes Silent Hill a game about ghost and demons and turns it into a generic witch movie. Based off the first game but uses monsters from the second(all the monsters in Silent Hill have symbolic meaning so using them in a different story contradicts that). This movie is untrue and an insult to the game and is just a unscary boring movie. If anyone's seen the Indiana Jones episode of South Park what happens in that episode is the best way to describe this movie."
    },
    {
      "rating": "4",
      "text": "No... I just can't watch this !! It's so bad... at least the plot is interesting but that's all."
    },
    {
      "rating": "5",
      "text": "And... waht can i say? That movie rocks and sucks at the same time. The plot is kinda confusing because they wanted to put the most significant things of SH in the movie (Alessa and Pyramid Head). Fails as a remake of the experience of Harry Mason, but is kinda good. I guess."
    },
    {
      "rating": "10",
      "text": "I am not surprised Roger Ebert did not understand the story, it required he actually saw it and Roger do you actually have any functioning synapses? I know complexity to story is rather beyond some film goers these days, so buy it on DVD and watch it several times, it may sink in then. This film is an adapted video game and shows great creativity with more creature creations from Patrick Tatapoulos who with Stan Winston have probably created some of the best creatures seen in film. In essence it is a film about revenge on religious zealots who \"kill\" a child. The young actress who plays three parts I last saw playing a ghost in Kingdom Hospital and clearly has no problem playing highly variable roles from a sweet child to the manifestation of evil.. This film is hauntingl beautiful with great incidentatl music and the ending, well try it."
    },
    {
      "rating": "6",
      "text": "It's funny that I don't know how to place this movie. I've now watched it a handful of times, which should lead me to say that I liked this movie, but I don't know if that's the case. The bad guys, like the nurses and the huge man with the long metal pieces are fantastic and the setting is creepy as hell. However, the ending gets bogged down in religion and back stories that no one gives a crap about."
    },
    {
      "rating": "6",
      "text": "Though not as emotional or deep provoking as the game series, it packed some good scares, and music to my ears soundtrack but the things that made silent hill fans cry because of the game never appeared in the film but don't be disappointed."
    },
    {
      "rating": "0",
      "text": "I play video games. Hell, I love video games. I even played Silent Hill for two hours before going to this movie, just to ensure that I was in the proper frame of mind in which to enjoy the film. This was an abysmal movie. It was definitely the single worst film I have seen in 2006, and probably one of the worst films I have ever seen. It is Uwe Boll bad. It is poisonously bad. It was worse than Batman and Robin."
    }
  ]
}