{"id": 2382, "title": "Silent Hill: Revelation 3D", "starring": ["Adelaide Clemens", "Radha Mitchell"], "runtime": 94, "genre": ["Thriller", "Horror", "Mystery"], "description": "Heather Mason and her father have been on the run, always one step ahead of dangerous forces that she doesn't fully understand, Now on the eve of her 18th birthday, plagued by horrific nightmares and the disappearance of her father, Heather discovers she's not who she thinks she is. The revelation leads her deeper into a demonic world that threatens to trap her forever.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/xBC7bHZ5UglTw4LMd2lTSgXvQXl.jpg", "categories": {"plot": 4.484848484848484, "acting": 4.783783783783784, "ending": 4.375, "soundtrack": 8.6, "cinematography": 3.0, "familyFriendly": 2.25, "funny": 3.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "Not the scariest movie I've ever seen but this film is actually quite faithful both to the plot of the first movie and the third game in the series. I know I'm in the minority here, but I actually really enjoyed the first movie and felt like this sequel did a good job of establishing a strong link between that film and the game series. I will admit that there were a few instances of nonsensical plot and / or writing but I felt that overall, this was a worthy entry in the series with great atmosphere and great acting to boot. Don't believe all the garbage reviews in the press. I doubt most of those critics are even aware of the game series this movie is based on."}, {"rating": "9", "text": "First off, I am a huge fan of the Silent Hill games and was NOT a fan of the first Silent Hill movie. This film was an outstanding homage to the game. Not ADAPTION. HOMAGE. The monsters were beautiful. The 3d was fantastic. And all the key points from the game came across very well. My favorite part was how they intertwined the First film perfectly and still kept the film true to silent hill 3. I.e. Happy Burger, the mall, theme park etc. The only negatives for me were the portrayals of Vincent and Douglas. Vincent was too Good as opposed to the game. And Douglas was simply cut down to a minor character. Also I understand alot of fans will be angry because of Pyramid Head being in the film, but they need to understand, PYRAMID HEAD WASNT A MANIFESTATION OF JAMES SUNDERLANDS FEARS, THE CREATOR SAID THAT HIMSELF. That all being said I give Silent Hill Revelation 3d a 9 out of 10 FOR TRUE FANS OF THE SERIES"}, {"rating": "9", "text": "WHAT IN THE EVERLASTING F**K IS WRONG WITH THESE CRITICS?!?!?! I love the first film to this day, it remains one of my favorite films, and in my opinion, the best game adaptation... until now, revelation has now booted it's ass off the perch, fans of the series will LOVE the level of faithfulness to the third game, Adelaide Clemens was born to play Heather, the set pieces are stylish, surreal and sometimes quite creepy, they managed to tie up most of the loose ends from the first film, and pyramid head gets a fully-fledged fight scene, the 3D is used phenomenally, the effects are amazing considering a crappy budget of 20 million, the mannequin monster was the creepiest scene in the latter half of the movie, but it isn't without some flaws, Kit Harrington is annoying and d**kish most of the time, pyramid head, while he literally kicks ass, doesn't get used enough, which is half of what takes it down a peg because he's on almost every poster for the film... i hope to god a director's cut solves this, the problem with such a phenomenal beginning is that the ending doesn't measure up, without spoiling anything, they pretty much say \"LOL, SEQUEL MOTHERF**KER\" which is a bit cheap considering what they chose to imply as their next source materiel, overall, this is almost, ALMOST as good as the first film, one small step for man, one giant leap for video-game films - samarathenymph xoxo"}, {"rating": "5", "text": "Silent Hill Revelation 3D will absolutely please the fans of Silent Hill but I doubt that it will please the common movie reviewers or critics. I am a big fan of Silent Hill and I am addicted to the first Silent Hill and the video games. As a movie it is not near perfect. First of all, the script is awful and senseless, it is far away from the script and the eerie talking of Silent Hill, as for the story, it is explained more than the first, it doesn't leave anything to the imagination of the viewer, and that's make Silent Hill Revelation forgettable, the direction is really bad, because there is no actual tension during the climax, which makes us miss Christopher Gans' direction. The visuals are good but you can see and notice that Pyramid head's costume is rushed, and a proof is the trivia on IMDB. As for a movie, it is not that scary, and it is definitely not that good, sometimes it is boring and dull, but mostly, entertaining and fun. The 3D is really good, and I give them the credit for that."}, {"rating": "5", "text": "It isn't an appalling film by any means, but this film lacks the psychological horror of the games, relying on jump-scares which fail miserably. It also seems like the film is just moving from jump-scare to jump-scare with no buildup or character development, maybe because of the shorter length compared to the previous entry in the franchise, they felt they rushed it a little. On the plus side, the special effects are quite impressive. in fact, the only reason this review score isn't lower, is because of my love for the franchise."}, {"rating": "2", "text": "I'm not a fan of these types of movies although the first one wasn't too bad, which i did happen to like much more than this abysmal sequel. I want to say that this movie was rushed but that just doesn't make sense considering the first entry came out 6 years ago. The plot had quite a few holes. Acting wasn't an issue, but the dialogue and the script were just plain bad. Really the only positive thing about this movie i can think of is Michelle Williams' performance, and pyramid head is a bada$$, but other than that, this film is just terrible. Don't waste your time or your hard earned cash. 1.5/10"}, {"rating": "3", "text": "The only scary or gruesome thing about this movie is that it might be the end of Silent Hill. Yes, it's that bad, coupled that with an awful game earlier this year, Silent Hill is in all new low. Mercilessly butchering the memory of one of the best games in last gen, Silent Hill: Revelations 3D is a poor reinterpretation which fails almost in its entirety and they make sure to stomp the franchise while it's on the ground with truly horrible 3D implementation.\r Any resemblance to the game is merely cosmetic. The look of protagonist, misty town, gridiron underworld, they are all practically miming the game. This may work as a screenshot, but put them in motion, it's a travesty to the title. Heather Mason (Adelaide Clemens) has the hair and clothes, yet she fumbles in times, bordering on teen angst rather than the sorrowful persona of the game. It's amazing how the game digital character could exhibit more appropriate sadness, meanwhile the real life version somewhat struggles with the delivery. It's like she's in constant lousy mood and relies too heavily on screams, which practically everyone does here.\r There's also an variation of the cast, Vincent (Kit Harington), who is Jon Snow in Game of Thrones, but so Twilight here. He substitutes the private investigator part, who barely has any screen time and while I welcome changes, this one is needless and a blatant bait for teen drama. The private eye had odd relationship with Heather as they were both lost in Silent Hill, Vincent doesn't add to that, he's plain, very predictable, and can be mistaken from 90's slasher movie cast.\r It's strange that there are actually some quality names here; Sean Bean, Malcolm McDowell, Carrie Anne-Moss, but they only have brief screen time and not much to go with, considering how mediocre the script and screenplay are. Sean Bean does his best for the father figure, it's not a great performance, although he is believable as the parental role. And he offers a puzzle whether he continues his tradition of dying in the movie or not as Harry Mason actually died in the game.\r It'd be bearable if they only mess up that far, but the brilliant minds that made this had an epiphany: 3D. Oh god, the utter failure of it.\r Effect of 3D, as we all know, can also be accompanied by the blurry and blindingly dark effect. Now, add that to a movie where the bulk of it is in darkness, you have a horrifyingly bad visual. Then there are the cheap scares, so prevalently, from monsters that scream at the screen. Everything in the movie throws, stabs, yells at the screen. I've had enough of this persistent crap in my face. And when I said everything, that includes Heather. She shines the flashlight at the audience every few minutes.\r Imagine a putrid dark room, you can barely see anything, and then she flashes at your fragile eyes, repeatedly. Why the bloody hell someone would think that's a good idea is beyond common sense. All of these atrocious concepts make a visual nightmare, not in its intended goal.\r To be fair, it sometimes looks and sounds like the game, albeit only seldom, and a couple of scenes are almost okay. But that's buried in piles of questionable concepts and horrific execution of them, it's more of a laughable annoyance than adaptation of once a great game. What made the game so popular was the use of details to make an atmosphere. Flashlight, radio static, camera angle and the audio made an excellent terrifying world, the movie is anything but. This might be last tour in Silent Hill."}, {"rating": "3", "text": "Well ... it was fun to watch - if for the wrong reasons. Aweful and ridiculous plot and dialogue by blant and meaningless characters who behave and act stupidly will have you grin and giggle throughout a movie that tries to be exaggeratingly heavy on exposition and explaning but still manages to make no sense at all. It contradicts itself all the time and when it doesn't, it presents situations that are very unlikely and unbelievable if thought through.\r To say something good, the movie looks and sounds great, there's no denying it and even the 3D looks good. (Though the latter will depend on the theatre you visit, too.) I also thought the actors did a good job, the horrible script isn't their fault.\r So how about comparing the movie to the game it's based on? The similarities mostly start and end with the namedropping. In general, there's no need to slavishly stick to the game's plot ect., but if you change stuff, it should benefit the movie.\r Revelation has the following problem: it wants to be a sequel to the first movie and yet tell the plot of the third game which is problematic because the first movie already altered the key plot aspects of the first game significantly and especially those that are relevant for how the story was continued in the third game. (The second game had a completely independent story.)\r Now it would've been no problem to just stick with what the first movie did and build on it, but instead, the narration tries to combine the two differing stories - BUT does so very poorly, because first of all, in doing so, it does contradict certain facts known from the first movie and second of all, it still changes the story of the third game anyways! What the ---- was it good for to completely break the continuity and the canon of the first movie just to include the third game's plot when you, then, alter that plot anyways? You could've just altered the game's plot to fit the first movie and fine!\r If you like the games, the saddest thing about this movie is that it simply doesn't feel like a Silent Hill. It is not scary at all, there is absolutely neither mystery nor confusion, the emotional aspects are shallow and uninteresting and the town of Silent Hill is overcrowded with people.\r Which is in itself, independently from the games, ridiculous because on the one hand, the town is so super dangerous ect., but on the other hand, a full community has been living and surviving there for over a century among the hostile monsters and a spoiled brat gone wild with destructive super powers. For instance, the asylum in the movie is crawling with monsters that kill everyone they can get a hold of and yet, the order, trapped in the very same nightmare world, is using the place as a psychological hospital. (Basically, they brainwash people in there or make them prisoners when they disobey.) In one scene, they bring one of the characters there for \"treatment\", bring him into a room full of monster nurses, try to do their job among them, and then, surprisingly, get killed by those even though they knew the nurses were in that room and that they were dangerous. Fleeing whenever \"the darkness\" - yikes - approaches is the number one rule, but all of a sudden, the \"darkness\" is the perfect working place. Oooops, dead.\r That's how much sense the movie makes.\r Overall, yes, you can have a good laugh at the movie and it's remarkably well done, but that's about it. If you are a fan of the series and have a lot of humour, you will enjoy the movie for how funny it is and for all the little innuendos and references to the game series, but will also feel like you want to cry because the movie butchers and, pretty much, insults he franchise.\r If you don't know the games, this movie will make even less sense to you and you won't even be able to enjoy the shameless fan-service, so ... better go see something else."}, {"rating": "1", "text": "Bravo.  SH:R:3D is now the best argument for Digital over Film -- it has such a modern look to it!  This movie is so modern that it would be right at home on Netflix Instant or a Blu-ray or any modern technology (i'm surprised it didn't go straight there!).  it looks like it was shot on an iPhone!  Really cutting edge stuff.  And the acting. Oh. my, god.  Every time a familiar face showed up I thought to myself, \"I CAN'T BELIEVE THEY'RE IN THIS MOVIE!\".  The art direction was great.  it reminded me of one of those haunted houses you go to on halloween where a bunch of employees wearing rubber run up and try to scare you, and then go back and wait to pop out again.  Very professional.  And as for the writer/ director, WELL, he certainly made a lot of choices!  i really think that the person who deserves the most credit though is Samuel Hadida, after all, his is the first credit you see!  On a scale from 1 to 10, i will rate it a perfect score of 1"}, {"rating": "0", "text": "This was a great GAME, and a cool FIRST MOVIE, but why make a second movie that has nothing to do with anything? The only thing it shares with Silent Hill is the name and that's pretty much it. Then there's this cheeseball 3D crap they threw in... ugh. THIS IS A NO SEE MOVIE"}, {"rating": "0", "text": "Any true fan of the Silent Hill games will be greatly disappointed by this. It breaks the canon not only from the games but from the first film. The only character done nearly right is Heather, and even then she's still wrong. Don't even get me started on the fact Pyramid Head doesn't belong and how they portrayed Vincent...it wasn't scary, it wasn't faithful to the games, it was just a pure mess all around."}, {"rating": "7", "text": "A great choice for lovers of video game Silent Hill. I think that is not what was expected. visual effects but is well made. I take the pleasure of saying it's the best movie that is to be created from silent hill is the sequel to the first movie. is very good to have a good time watching it."}, {"rating": "5", "text": "now, i am a very hard person to disappoint... BUT F**K YOU MICHAEL J. BASSETT, F**K YOU, F**K YOU, F**K YOU, WITH A RUSTY IRON SPIKE!!! needless to say, it was very disappointing, for starters, pyramid head is on all but TWO posters for the movie, he is in only TWO F**KING SCENES IN THE ENTIRE MOVIE, these scenes are both extremely underwhelming, when you hype up a monster with all of your promotional material, YOU HAVE TO DO MORE WITH HIM!!! the characters, only three are developed with any effectiveness (heather, harry and vincent), and adelaide clemens is so flat, she barely has any of the heart her character did, kit harington was good, and sean bean was, as always, great, carrie-anne moss, was great as claudia, malcom mcdowell was great as leonard, and deborah kara unger was great as dahlia, who is BARELY IN THE MOVIE, despite the fact that she deserves a greater role as she is, by proxy, heather's mother!!! martin donovan was good but also pushed almost out of the movie altogether, and what happens to him, CHEAP!!! oh, and don't blink, you might completely miss rahda mitchell... who inexplicably provides a quiet mediocre performance... and to the shear lack of scares... there were only two scenes that scared me, one involves a birthday party, those who have seen it know what i mean, the other involves the mannequin spider... which strangely enough only lasts 40 seconds... like i said, CHEAP... the plot also seems flat sometimes, but the worst part? the fact that open road cut near FIFTEEN MINUTES out of the film, which they have voiced no intention of putting back in... what a shear f**king disappointment, this is barely silent hill, PLEASE MICHAEL J. BASSETT, NEVER MAKE ANOTHER SILENT HILL MOVIE EVER AGAIN!"}, {"rating": "5", "text": "So, I could start this review by telling you the reasons this is a bad movie. Paper thin storyline, bad acting, subpar special effects, among others. All this would give this movie a 2.............. but then I realize I didn't come for the storyline, the acting or the special effects, I just came here to see how they portrayed the silent hill world and monsters into the big screen, and at that it does a fair enough job. So, 5 it is."}, {"rating": "6", "text": "Well! I can't say it was like the first one or so bad, but it is bad, the first one is much better, this one, the scenes, the story is just a **** MESS! But I still enjoyed it, but don't know why!"}, {"rating": "2", "text": "This was terrible. Really terrible. I have no idea what the director/screenwriters did the the cast to make them act so terribly, but whatever it was it must have been worse than any of the horrors in the film. The acting was just so, so utterly terrible  especially from a pretty decent cast (Sean Bean for instance!)  that I just can't wrap my head around it. That combined with a terrible script (although, it does stay pretty true to the game...) really destroys any dramatic element to the film.\r Although it stays moderately true to the game as far as monsters and shocks go, it somehow seems to reduce them to a Buffy the vampire slayer regurgitation. Admittedly the first film wasn't amazing, but it did manage some genuine shocks (like the janitor) and managed to keep the intensely creepy vibe, whereas the monsters just looked ridiculous and not even moderately scary. So, although it may stay true the game in a lot of ways, it completely doesn't understand the 'vibe' of the silent hill series and the director would probably have had The Rock machine gunning down aliens in the middle of the hospital if he got the chance.\r As a huge fan of the games this was an huge disappointment, especially after the very solid first movie."}, {"rating": "5", "text": "Only for the absolute most die hard Silent Hill fans. I am intimately familiar with the Halo of the Sun, the Seal of Metatron, the Order, Valtiel, \"God,\" the layers of reality, Leonard, Claudia, Heather Mason, Harry Mason, Pyramid Head, Alessa, Dhalia, Robbie the Rabbit, the fog, Brookhaven, Vincent, and Lakeside Amusement Park, all from the games. If you don't recognize every single one of those from memory, then you will likely be lost throughout much of the movie. The film loosely follows the plot of the third game, and even then, you need to be very familiar with the story from that game to get what's happening most of the time. The acting is subpar in most of the characters, and there is way too much exposition. The set pieces are excellent, and some of the creatures are inspired, but the climax was rushed and the general pacing of the movie was poor. If you are indeed a super hardcore Silent Hill fan, then this movie will address many canonical issues that are largely unexplored in the games and deal with various fan-based theories. There are also so many references to each game in the franchise, including Downpour, that hardly a shot goes by without one coming in somewhere. Almost every set in the film was pulled from one of the games. Excellent fan candy, but not much else, I'm afraid."}, {"rating": "10", "text": "As we all know this is based on the 3rd instalment of the rather good survival horror games silent hill. It logically sidesteps the second game (as it was a stand alone story) and went to continue the story began in the first movie. Yes it follows the 3rd game and yes it changes aspects, the main characters and some of the plot elements, but the main bulk of the story is there. Visually Michael Basset has made a stunning movie, with some clever directing and ingenious set and creature design. (red pyramid always being a highlight) I found the plot self explanatory (with a little too much exposition) i feel there could be a better, longer directors cut somewhere, (i feel a extra 20mins  which enables the first 3rd of the movie to breathe a little better. Some of the dialogue was clunky but this is mainly because of the exposition, however it doesn't ruin or detract from the experience. The music is outstanding as ever with direct music cues from the game (most definitely a good thing) The only real downside was Vincent who didn't really work that well and to be honest wasn't needed, but again this does not ruin or detract from the movie. Tension is well handled and some of the scenes graphic and chilling. The 3d is handled well, with a few gimmicky bits but mostly bringing you into the misty town of silent hill in ways never before accomplished.\r The big question is do you need to be a fan of the game to enjoy it? I would say no, i would say it stands on its own. Although having said that i am a fan of the games so my opinion is somewhat biased. It helps to have seen the first movie, but with the exposition this is not a must.\r Overall a really enjoyable film that captures the awe and horror of silent hill. Well done MR basset and all involved."}, {"rating": "0", "text": "I never expected a movie to fail to follow it's source material so miserably. Poorly acted, poorly edited, and nigh incomprehensible plot-wise to anyone regardless of if you HAD actually played the games. In short, this film physically wounded me."}, {"rating": "10", "text": "The film faithfully respects the history of the game, if viewers who saw not a fan, then you will not find meaning. It's part of a history of Silent Hill, NOT a part of a horror movie like a \"the girlfriend of Chuky\""}, {"rating": "7", "text": "A true homage to part 3 of the game series.  Great visuals but the acting was honestly terrible.  The film felt rushed why they didn't make a 2 hour movie to spread it out I have no clue.  Having played the third game it actually tied up some loose ends for me.  You have to really pay attention in this movie or you will get lost fast.  Creepy bad guys are plenty, the return of the great Pyramid Head are ample reasons for fans of the series to come back 1 more time to Silent Hill for this installment."}, {"rating": "10", "text": "a great film, they used 3d so mind-bogglingly well that i felt like i was in silent hill with heather, the plot is strong, at least for fans of the third game, and the cast does a mostly brilliant job, i highly recommend this to people who liked the first film, and people who liked the games."}, {"rating": "2", "text": "Silent Hill Revelation is a prime example of how to take a movie's potential, wrap it up in a little box, and punt it off a cliff.  The first twenty minutes were somewhat suspenseful, slightly intense, and pretty much on par with the first film (for the record, I actually enjoyed the first SH flick). After that, it's as if Paul W.S. Anderson assumed filming duties and everything went to complete crap. Hilariously bad monster design, corny dialog, Malcom McDowell's apparent winging of his performance after coming to terms with reality and the film he signed for, and enough 3D IN YOUR FACE moments to induce 4D vomiting- those are reasons enough for me to stop there.  So, after trudging through that mess, we arrive at the final scene in the movie, the excrement on the urine-flavored cake: ***SPOILERS AHEAD*** In just one of many forced plot twists in this film, Heather summons Pyramid Head, who, with all his might, rushes to Heather's aid. I'm aware this reflects upon a scene in the first movie, but in this film they may as well have given Pyramid Head a cape and cowl because they couldn't have made his heroic presence more obvious.\r **END SPOILER*** In closing, Silent Hill: Revelation is nothing more than a lackluster follow-up to the original film. Whereas the first movie was quite enjoyable, this mess could barely hold by attention beyond wondering how much worse it could get."}, {"rating": "10", "text": "I was thrilled with how well this movie turned out. Being one who grew up watching the games being played, and playing them myself, Silent Hill has stayed true to it's fans with the movies. Which is a lot more than I can say about the generic and repetitive 'Resident Evil' movie series. The 3-D was phenomenal. Not an over the top, things flying at your face film. The 3-D wasn't used as the films selling point. Rather, it enhanced the movie. Making the beautiful sets and characters come to life! It was easy enough to follow, (even for those who haven't played the game) and yet stuck with the games. Not only was the art quality great, you'll fall in love with the main protagonists; Heather and Vincent. (Adelaide Clemens and Kit Harington) The only downfall was the films length. While it deserved at least a 2 1/2 hour time slot, it fell short with 1 hour and 34 minutes. This however, should not keep you from seeing this masterpiece of a creepy thriller. Maybe the resident evil series should just take a backseat and watch how Silent Hill does it."}, {"rating": "8", "text": "In my opinion was better than the first one, but I must say that it was not horrible as some sites judged. As far as the actors have to say that fared; certainly nothing special but I think the dubbing in Italian has a little spoiled acting. There were many scenes and quotes that brought me back to SH3 (and not only) and I think the fans will appreciate who is so even though the plot is not really faithful to the game. The flaw of the film I think it's the script a bit too simpleminded but still full of surprises. The strength of the film are the sets (very similar to the game) monsters (and many really well done) and the atmosphere. But I must say that I found the special effects a little fake. Then let me tell you that in the end there will be a clash, but can be spectacular, but that did not seem suitable for a film like SH. Great songs Yamaoka. A film that must be seen from without high expectations but that is not bad (even if I consider the first best)."}, {"rating": "10", "text": "I really enjoyed the film.Because i liked the game.All people say this is  no.The plot is fine,the acting is great.This is the best based on video game film.I can't understand why you guys give this negative reception? Many jumped scare don't make you scare?.That's a  reason to hate this film."}, {"rating": "6", "text": "i like silent hill: revelation, it is a narrative mess, but it is visually stunning, the monsters are stylish and inventive, and it benefits from a decent, devoted cast (sean bean, adelaide clemens, carrie-ann moss, malcom mcdowell, kit harrington), though it suffers from a distinct shortage of scares, it is consistently creepy, and that trademark sense of mystery is evoked in the asylum, though nowhere near as good as the original by any stretch, it is still a sufficient, conclusive ending to alessa's story, and i can't wait for downpour."}, {"rating": "0", "text": "There is really no point in even reviewing this film. All that is bad about this movie has been said by others. If this movie could have copied one good thing from the original Silent Hill film I would have given it a 1/10 but Revelation 3D is relentless with its failures. I suppose if you like the any Resident Evil film after the first one you will like this movie. Enjoy :D"}, {"rating": "0", "text": "I have had only 3 experiences in a cinema like I had with Silent Hill: Rev and I wouldn't want to experience them again.\rI liked the original Silent Hill Movie for what it was, but this was so terribly done, for a movie that was supposed to be scary, it wasn't even laughably entertaining, it was a horrible boring mess from start to finish."}, {"rating": "3", "text": "Wow. This one was hard to enjoy. Terrible in every way and a disgrace to the previous movie. It's even hard to try and describe what went wrong since everything went wrong.\r **SPOILER**\rAnd the ending battle between Pyramid Head and that other creature? Come one, that was terrible."}, {"rating": "10", "text": "Just saw it and I think is the best adaptation of a video game ever!\rI felt like i was playing Silent Hill 3!! I love Silent Hill, I hate the first movie but this one is awesome!\rTruly amazing"}, {"rating": "0", "text": "Three words. What. The EFF!? (metacritic sensors *shakes head). I'm so glad I didn't spend money going to see this in theaters. I thought the trailers looked more like a parody of silent hill, but upon seeing the movie it's even WORSE than I thought it would be. Not only does it completely massacre the content it's supposed to be paying tribute to, the movie is one of the worst I've ever seen in my entire life. The acting is terrible, script is phoned in, special effects are mediocre at best. It's not even remotely scary or suspenseful. The characters' roles are all rearranged, some characters who were important in the game were killed off within 5 minutes of first seeing them, with no lasting impact on the viewer whatsoever. Fan service was shoehorned in all over the place and with the exception of one moment toward the end, it always felt out of place. I seriously felt like I was watching a really bad fan fiction come to life. Probably the most common defense I see of this movie is that a movie adaptation can't hit all the exact plot points of what it's based on, or it wouldn't be interesting to people who've played the game already. That's true in some cases but definitely not this one. The reason people complain about the plot changes is because they don't add any new dynamics to the story, they just water it down and strip any meaning they once had or any purpose they served. The result is a mess of a bunch of different things that don't make sense together, and whatever does make sense turned out pretty damn insipid. Evil clowns eating flesh burgers? OOOH so thought provoking, I wonder what it represents. GAD... DAMMAT. No movie in history has pissed me off this badly. An absolute shame."}, {"rating": "3", "text": "I really didn't enjoy this movie, I knew from the trailers I probably wasn't going to enjoy this movie, but I went to the Cinema to see it because I thought, \"Hey, its Silent Hill, its got to be better than the last movie, right?\" Wrong.    The plot sort of based around the plot of Silent Hill 3 with Heather Mason, she starts having nightmares about Silent Hill and eventually starts seeing these things in real life. If you know the game, you know the general plot of this movie bar a few minor swaps and changes which may make it more interesting to some people? I don't know, I just kept pointing out mistakes to the people I was with who had never played Silent Hill 3. (They didn't like the movie either, by the way.)  The jump scares do scare you, but it doesn't really build up any kind of suspense as you know when the music starts to go quiet that something is going to scream, or a loud noise is going to attempt to frighten you. It did start to annoy me after a while, because it was less of a horror movie and more of a \"Loud noise, be scared\" movie.    The 3D aspect of the movie wasn't that bad, the fog and ash effects were nice, especially in transitions to the other world, but one scene that stuck out for me was the mannequin monster, the CGI was so bad that I burst out laughing like most of the audience in my showing of the movie, and I think it wins the award for one of the worst CGIs I have seen.    The last few minutes of the movie were pretty terrible, I really disliked the use of Pyramid Head and it just seemed to be queuing itself up for another sequel, with either Travis or the guy from the most recent game, Downpour as the main characters instead of the Masons.    Overall, the movie might be okay if you like jump scare movies or don't know anything about Silent Hill, but if you know about the Video Game, hate pointless jump scares or want a good horror movie, avoid this one. The reason it gets a three from me is because the 3D wasn't terrible, and some of the effects were nice, and while the plot wasn't a complete betrayal, it didn't make much sense in a few aspects."}, {"rating": "3", "text": "I don't know what to write. Honestly, I didn't like the movie. The first part was perfect. It's still one of my favorite films, but Mr. Michael J. Bassets' creature didn't captured me at all, I didn't  feel a bit of fear or horror. Some scenes looked ridiculous and awkward, especially the last fight between two monsters. Everything was happening so fast, the conversations were short, it looked like the makers didn't have time and they had to shorten the film, so it looks kind of pressed. I have never played  Silent Hill 3, but i think those who played will like the fill.\r3/10"}, {"rating": "6", "text": "silent hill no es la mejor secuela ya que se enreda mucho y no sigue la misma historia de la primera pero para mi los efectos especiales y una que otra actuacion valida compensa todo eso"}, {"rating": "3", "text": "I like the early game franchise, and actually really enjoyed the first movie.  This one, however, just has nothing going for it.  It moves away from the Silent Hill feel, for more of a standard Hollywood movie, and somewhere in the transition completely falls apart.  The plot is of very low quality, and the acting is mediocre."}, {"rating": "10", "text": "3D sequel to the 2006 horror film based on the popular survival horror video game of the same name. It was written and directed by Michael J. Bassett and is based on the 'Silent Hill 3' video game. The film centers on the heroine's daughter from the first film, Sharon, who's now a young teen and lives with her father while constantly on the run from a ruthless cult. The cult wants Sharon back in the nightmarish alternate dimension world of 'Silent Hill', where her mother is still trapped. Radha Mitchell, who starred in the first film, only has a cameo in this chapter. Sean Bean and Deborah Kara Unger also reprise their roles from the first movie. They're joined by Adelaide Clemens, Kit Harington, Carrie-Ann Moss, Martin Donovan and Malcolm McDowell. Horror fans are sure to be pleased with this installment as well as fans of the video games (I've heard). I haven't played the games but being just a fan of artistic imaginative horror I thought it was quite an achievement.\r Heather (Clemens) is now turning 18 and after being on the run with her father, Harry (Bean), for many years he goes missing. She's never fully understood who she is and why her father and her have been running from town to town. She doesn't remember 'Silent Hill' but has been tortured by nightmares of it for years. She soon discovers that the people of the alternate dimension town want her back. Her mom (Mitchell) has been captive there for years and now her father is as well. A young man named Vincent (Harington) who grew up in 'Silent Hill' has been sent to our world to help bring Heather back. Vincent is not a bad guy of course though and sees Heather's true beauty, so the two join forces in surviving 'Silent Hill' and unraveling it's mysteries.\r The film is like a true nightmare and is played out in beautifully grotesque elaborate detail; the set design, effects and 3D are all spectacular. It looks horrendous and really has that nightmarish feel to it. I'd put it up there with the classic slasher films of the 80s like the 'A NIGHTMARE ON ELM STREET' and 'HELLRAISER' franchises. It's every bit as creative and grotesque. The acting is all decent and the directing is fitting. The story is a little too rushed and fast paced but I've read it's really faithful to the video games and gives the fans just what they want to see. I know nothing about the games but I did like the original 'SILENT HILL' movie and would put this second installment right up there with it. It's a classic B slasher film done right."}, {"rating": "10", "text": "I am unsure like most of the reviews on here how this movie is getting such bad reviews! After waiting 6 years for this movie to come out I was not disappointed. The movie stayed very true to the game itself and the girl who played Heather looked amazingly similar to the character in the game. I felt the acting was real and believable aside from the fact that she hardly seemed scared at all where as I would have been peeing myself! Even if you have never played the games before the movie is still a solid 6 or 7 out of 10 but the way it stayed true to the story I was looking forward to seeing unfold was just awesome. Honestly I think the reason that it did so badly was because I had no idea the movie was even coming out because I never seen a preview on TV or in the theatres, and the movie opened on the weekend that everyone is out celebrating Halloween. Lets face it... Video Game fans most definitely take advantage of the Halloween holiday! I think you should see the movie and decide for yourself. It definitely could have been longer because it did feel a tiny bit rushed but I loved it and I really hope that we get another installation to this film! I am SOOO over Resident Evil..."}, {"rating": "10", "text": "This review may contain spoilers ***\r Silent Hill: Revelation is a fangirl's haven. They even referenced TRAVIS! I freaked the hell out!!\r Granted, they changed quite a bit from the game and there were some things that were kinda \"what?\" with their changes.\r (Full review and spoilers)\r In the game, Harry is killed in their apartment when Heather gets back from her Nightmare at the mall. What drives her to Silent Hill is finding out WHY her father was killed and who she is. Vincent  you don't even really meet him until a third through the game, though I get why they introduced him like they did for the film. Then you have Douglas, who wasn't supposed to die that soon and actually helps Heather.\r He didn't help her in the slightest, so his character was just kinda… there. And Claudia was the one that was supposed to actually off him after telling him what Heather was going to be used for. I was looking SO FORWARD to that!!\r Some pros were that the movie starts out similarly to the game, with her dreaming that she's at the Lakeside Amusement Park. What got confusing, though, was that Nightmare!Silent Hill was so prevalent and there wasn't a lot of the typical Silent Hill (more on this later).\r I will say that, this time, Pyramid Head made sense. He didn't make sense at all in the first one, considering he's in the second game (unrelated to the first and third games) and is the manifestation of James' inner turmoil. They switched his meaning around to have him in this film, but it worked and you can tell that it was really something for the fans  to have Pyramid Head portrayed as he was. As a fan, I DIDN'T MIND AND I LOVED THE TAKE.\r There was a lot of action, which, while it's nice, it took away from the character development and the real dark feel of Silent Hill. The whole love of Silent Hill is being completely alone, trying to solve puzzles and figure out everything on your own, occasionally running into another person, but eventually just going your own way. That's what draws the fans to the series and why the first film was pretty damn good.\r Look, I've been a Silent Hill fan since the first game was released in the 90s and I even own the Silent Hill Play Novel  I taught myself to read Japanese all so I could play that game. Maybe I'm being a bit harsh, but then again…. Like I said, there was a lot to put into one film from one of the best games in the series. It was an interesting take! And while I may not go to see it in theatres again, I will definitely be getting it when it comes out on DVD.\r Oh! They also had about five different rearrangements of \"Never Forget Me, Never Forgive Me,\" each sounding wickedly awesome and Mary Elizabeth McGlynn was singing the ending theme. That just *made* it for me. I love that they use Akira Yamaoka's music in it. The music really does give the feel of Silent Hill."}, {"rating": "0", "text": "Awful. All I have to say is awful. \"What do you expect Voice, a good video game to movie adaptation?\" No, I expect a rather decent one or one that is at least watchable. I am glad that I brought my girlfriend at the time or else I would be clawing my eyes out hoping that Pyramid Head would rip me in half. I enjoyed the first silent hill movie because it was unique in the sense that it looked like someone was playing a video game. This piece of trash totally took that out and went their own path. The first one is probably the best video game to movie I have ever seen. This one was garbage. It deserves nothing higher than a 0. There were no scary parts nor were there any parts that made the movie redeemable. All the things that it was going to do, it didn't do. I was wanting a god boss battle. What do I get instead? Pyramid Head being a protagonist and killing the things that worship him. 0/10"}, {"rating": "0", "text": "This Movie is so bad I could barely finish Hollywood has to stop with making these awful video game adaptions stop butchering game franchises hollywood"}, {"rating": "1", "text": "I'm honestly surprised and saddened at how many users gave this a positive review. The movie was riddled with awful plot twists, some of the worst effects I've ever seen, and moments that seemed entirely pointless. The worst part is probably the ending where they spot light the horrible effects and at the climax of it all they throw away everything you watched by acting as if it were no big deal. The only thing I can imagine being worse than this is the sequel. *shivers* Hopefully that day never comes."}, {"rating": "10", "text": "Matter of fact this is better than 1. It has the essence of the game (silent hill 3) that makes it awesome. Surely underrated film. I still don't get why people hated this film."}, {"rating": "2", "text": "Even there are some cases where horror video games can do absolutely better than their respective movie counterparts. Silent Hill: Revelation is filled with the trashiest and stupidest horror I've ever seen. It, like its predecessor before it, makes the video game look a lot terrible and I can guarantee you it's not."}, {"rating": "0", "text": "This movie is crap at best, not scary never any tension and absolutely awful dialogue. Don't touch the movie it is really that bad. I believe I could have made a better movie myself!"}, {"rating": "9", "text": "I can't believe these worthless fu**ing critics... People complain about the RE movies not staying true at least somewhat to the source materal... but holy fu**.  Silent Hill is SUCH a NEAR PERFECT representation of the first and third game, its unbelievable.  I applaude the director for doing a fantastic job with what he accompished with this movie and its continued connection to the first film.  Please people, if you have played the games; DON'T LISTEN TO THE CRITICS.  The movie is awesome.  The only point I docked off, was yes the actors could have done a slightly better job.  The girl who played as Heather was awesome though.  Please see this movie and support it, and also respect the fact that \"this\" is what we always wanted from movies based off games.  A \"true\" representation of it."}, {"rating": "4", "text": "I saw this in 3D-- which is a blurrier, dimmer, more migraine inducing version of this crap film.  I'm a gamer, and thus a fan of the Silent Hill video game.  Though the first film wasn't great it was definitely a film, made by a filmmaker.  Revelation felt like fan fiction--which if you're a big fan of SH3, you'll probably love it.\r I tend to use The Godfather as a basis of comparison for films--cinematography, music, writing, directing, acting--all supreme.  But Silent Hill: Revelation needs to be compared to the Spiderman Ride in Orlando--which it barely just falls short of in terms of entertainment.\r The dialog was awful but Sean Bean gave a good attempt at making it seem emotionally inspired.  But a film this plot-driven and reliant on surprises for scares really has no time for emotion and I was more annoyed by \"character moments\" than desperately seeking them. Honestly, if it was just an hour and half of Heather running from the Manikin-Spider, I would have been more satisfied!"}, {"rating": "0", "text": "Horrible bastardization of the Silent Hill game mythology. Not worth paying to see or worth your time. Not scary, cheesy, terrible script and director. It's kind of sad to see such a great story be completely ruined..to make a cheap buck for Hollywood. Silent Hill has gone to **** after they took out Team Silent."}, {"rating": "10", "text": "Perfect movie, perfect cast, perfect story. Dont listen to the other reviewers. The movie deserves WAY better then this. Its an amazing movie and is faithful to Silent Hill and Silent Hill 3 games. The reason people are rating it low is people are now expecting Silent Hill to be like Silent Hill homecoming and later games. No, this is TRUE silent hill. I cant wait until the next movie. The next movie needs to directly follow. I want to see if Chris finds Rose... 10/10!"}, {"rating": "1", "text": "Okay, I'm going to be up front here and tell anyone who is reading this that I am a Silent Hill fan.  I love the games and Silent Hill 2 is among my favorite games of all time.  I will not be comparing this to the games because we all know that the games are better.  So when I unleash all holy hell upon this movie, I want to make it clear that I am not being (or at least not attempting to be) a but hurt fanboy.\r For those of you who walked the first movie, you probably remember the artsy ending and how it left no room for a sequel.  Watching the writer's solution to that problem is unbearably bad and made even worse by both Sean Bean's and Mitchell Radha's lack of giving a **** (not that I can blame them).  using the seal of Metatron as a means of getting out of Silent Hill is what we call Deus Ex Machina.  It is the most half-assed explanation they could have ever wrote.  Not to mention the damn thing has no logic behind it.  It allows the user to see the true nature of things, but that doesn't explain how they get out of what is essentially Hell.  Was this whole thing just a delusion?  We don't know because the movie never explains to us, nor does it attempt to create a consistent logic within the world they've created.\r There are so many pointless characters in this movie.  From the girl that Heather randomly meets in the mannequin room, give a brief back story and then get taken away and killed off camera.  If you're going to have a pointless character in a horror movie then at least kill them off in a creative way.  All she did was scream with Heather and then died.  Why was she in this movie in the first place?  And how did she end up in the same dimension as the cultists when she just made a wrong turn?  Shouldn't she be in the actual town of Silent Hill and not the the crazy evil version of Silent Hill?  And Douglas has the same effect, except he's given a name and a reason for being in the movie, except he has no reason to be there because they have Vincent doing the exact same thing.  Then there is Dahlia's brief exposition dump because the movie is too busy showing us the \"creepy\" sets to care about telling the story.\r Then there is the plot, which is all over the map.  First off, why would the police be looking for Heather and Harry/Christopher the cult member was killed in self defense.  Couldn't they just as easily tell the police, there are some crazy cultists trying to kill me and my daughter?  Why does Heather run from the cops when she sees a message in blood, instead of tell them the truth?  Why is the plot point of the cops looking for Heather suddenly dropped?  Why is Vincent suddenly in love with Heather after knowing her for less than a day?  Why does Harry/Christopher care more about his wife than his daughter (seriously he gets a little obsessive)?  How is Pyramid Head in the Asylum, when he is later established to be chained up in the amusement park?  Why does the amusement park look more like a carnival? Why are the cult members who take Vincent to the Asylum killed by the nurses?  Shouldn't they know that sound attracts them?  How did Leonard turn into that monster by just fusing the Seal of Metatron, and how does removing it instantly kill him?  How is Claudia turned into a monster?  Was she always a monster?  If so, then what does that make Vincent? How did Pyramid Head break free from his chains, and why didn't he do that before?  And if he did that to help Heather in the Asylum, then why did he come back and chain himself back up?  Those are just off the top of my head, and I assure you, there are plenty more.\r The characters have no character to them.  Claudia is a one note villain who is hardly in the movie.  The movie seems to think that the town itself and the monsters in them are a substantial enough villain to hold the entire movie.  Vincent has no purpose except as a romantic interest, but he and Heather have no chemistry.  Heather flat out rejects him up to the point where she saves is life.  But after he kisses her, I guess they're together now (gag).  Leonard and Dahlia are there solely for exposition spouting.  Oh, wait.  Leonard is also there to remove the gun from the equation for the final act (because then she could just shoot the nurses, or Claudia if she conserved her ammo).  Harry/Christopher was generic and Sean Bean's performance was terrible (in fact, terrible acting is something I could say about the entire cast).  And Heather was wasted potential.  Here we have a seventeen year old girl, constantly moving around from town to town in order to avoid something she doesn't understand.  Then one day all of that gets brought to her attention and she begins to uncover the truth, eventually confronting her former self.  But the writer doesn't do anything with it.  It's like being handed the Mona Lisa, then putting it in your closet.\r And the movie isn't scary to boot (shocker).\r Thank you for reading this rant."}], "recommendations": ["silent_hill", "monster_hunter", "stay_alive", "tomb_raider", "resident_evil_damnation", "doom", "final_fantasy_the_spirits_within", "the_last_witch_hunter", "maze_runner_the_scorch_trials", "would_you_rather", "teenage_mutant_ninja_turtles", "the_conjuring_the_devil_made_me_do_it", "percy_jackson_sea_of_monsters", "malignant", "max_steel", "resident_evil_welcome_to_raccoon_city", "insidious_chapter_2", "the_new_mutants", "riddick", "lara_croft_tomb_raider", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "the_twilight_saga_eclipse", "doctor_strange_in_the_multiverse_of_madness", "bird_box", "world_war_z"]}