{
  "id": 1758,
  "title": "Silver Linings Playbook",
  "starring": [
    "Bradley Cooper",
    "Jennifer Lawrence"
  ],
  "runtime": 122,
  "genre": [
    "Drama",
    "Comedy",
    "Romance"
  ],
  "description": "After spending eight months in a mental institution, a former teacher moves back in with his parents and tries to reconcile with his ex-wife.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/y7iOVneBvITlBdhy6tVqXVOa1Js.jpg",
  "categories": {
    "plot": 7.048780487804878,
    "acting": 7.630434782608695,
    "ending": 5.222222222222222,
    "soundtrack": 8.6,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This comfortably sits as my movie of the year thus far.  I sat with a wide, satisfied smile when it was over.  This won't be a full review because I want it to be fresh experience for everyone.  I will say that it shows outstanding casting, writing, and directing.  And its use of a certain Led Zeppelin song is so pitch perfect, it gave me goose bumps."
    },
    {
      "rating": "10",
      "text": "This movie had me smiling all the way through.  All the characters are full of life and energy.  They're all a little crazy, even the sane ones, and I think that describes us all."
    },
    {
      "rating": "9",
      "text": "Two endings: one happy, one sad, wind up Billy Brown's malleable story in Vincent Gallo's Buffalo '66, the 1998 cult classic that informs Silver Linings Playbook: sometimes broadly, sometimes not. Like any good quarterback, however, the film calls many audibles and creates something new from the prevailing framework. But make no mistake about it, the QB scouted the Bills-themed indie. The QB knows the players. Billy, lost and unloved, just released from prison for a crime he didn't commit, inevitably, finds himself at a strip joint, bent on revenge with gun in hand, staring down Scott Wood, a retired placekicker whose missed game-winning field goal prompted in Billy a default on his wager to a local bookie that the designated fall guy couldn't begin to recompense. As the club's owner, Scott holds court in a private booth, in which the Super Bowl goat, surrounded by topless women, takes a bullet in the forehead before the disgruntled gambler turns the gun to the side of his own temple. Excelsior, Pat's notion that every bad situation has a silver lining is something Billy doesn't prescribe to, or so it seems, at first. Who is the omniscient QB(read: narrator) that changes the called play: the murder/suicide? Is it the bipolar high school teacher, who similar to the would-be killer, returns home after being incarcerated for a felony(he nearly beats his wife's lover to death), with the difference being that the facility is a mental hospital, not a state penitentiary? Pat, similar to Billy, grew up in a house where the preponderance of football created an extensive amount of dysfunction between parent and child. When Pat Sr. complains that Tiffany is messing up his team's juju, it reveals how for many Americans, football functions as a sort of pagan religion. In the Brown household, O.J. with the pigskin graces their wall, not J.C. on the cross. Moreover, Billy is named after the appelation given to the cold weather city's team. Clearly, both men played(and continue to play) second fiddle to an organization of beefy athletes who on Sunday, diverted their parents from the church and into a stadium, the house of laical worship. Sadly, the discovery made by Tiffany that Pat's catchword doubles as the motto used on the New York State seal, constitutes as a bona fide miracle. In Buffalo '66, god is in the details; the parking lot markings where Billy tries to drive Layla's \"shifter car\", look conspicuously like hash marks. The eagle, another detail, the symbol that serves as the moniker for Philadelphia's NFL team, doubles as a sign, a street sign in Buffalo, where Billy crosses Eagle Avenue during his quest for a public restroom. Therefore \"reading the signs,\" becomes even more pronounced, becomes more than the key phrase from the letter Tiffany writes in order to trick her fellow codependent into participating at a formal dance competition. She has filmic powers. The audience can read signs, too. Tiffany passes Baldwin(as in bald eagle) Street; she spans time like Billy, but backwards instead of forwards, all the way back to Eagle Avenue. Blink and you'll miss it, but as Tiffany enters the Ben Franklin Hotel, you see a camera flash go off; it's the photo booth scene updated. Other faint echoes abound, especially the moment in Buffalo '66 when Billy runs into Wendy Balsam, his unrequited childhood crush, whose house he used to walk past, since in Silver Linings Playbook, Pat jogs past Tiffany's place, but unlike Wendy, she comes out of the house, crossing Pat's path and greeting him with a sharp \"hey\". Tiffany, the girl who can span time, by running with her stalker(decked out in a garbage bag), it can be construed, is in a sort of extra-diegetical communique with celluloidal Buffalo and its flickering residents. She's the retroactive ghost in Gallo's film, a conduit from the moving picture future, a second skin beneath Layla, as she coaxes the former Bills fan into believing that he's better than Wendy(who growing up, perceived Billy as garbage), which has ramifications in her own life, since throughout Silver Linings Playbook, she is proving her love for Pat is bigger than Nikki's. Hypothetically speaking, in the performative sense, Silver Linings Playbook has an alchemizing effect on Buffalo '66. The illusion of fluidity in a static art is enacted. The second ending, the one where Billy's reality turns out to be his imagination, becomes the narrative equivalent of a Hail Mary. With Pat helming the quarterback position, he throws A Farewell to Arms through the window, through time, like a football. He then goes into his parents' room and complains about Ernest Hemingway, yelling, \"Can't anybody say: Hey, let's be positive? Let's have a good ending to this story?\" Billy hears the audible. Outside the nudie bar, he flings his gun into the darkness: a farewell to arms. Because of Tiffany, excelsior becomes his catchword, too. Layla is his silver lining."
    },
    {
      "rating": "10",
      "text": "Bradley Cooper establishes that he's far more than a pretty face and Jennifer Lawrence solidifies her place as best young actress around. Anyone with any experience with bipolar disorder or just off the charts crazy behavior will appreciate this movie. Enjoyed the subtle and not so subtle statements on every ones reality. Even though the shell of the story was somewhat rom/com, it was so much more. The \"normal\" folks all exposed their own dysfunction along the way, but Cooper and Lawrence embrace theirs and approach them from an honest (if somewhat delusional) place. Truly charming. Good humor and a number of warm moments. Will watch this a number of times in the future, I suspect."
    },
    {
      "rating": "8",
      "text": "A sweet, simple film that has the power to captivate you through the performances of it's cast. The narrative follows the basic format of any boy/girl love story but what makes this picture so pleasantly unique from the rest is the fact that it doesn't try too hard to remind you of the genre that it conforms to. The use of music in Silver Linings is remarkably enthralling, in particular the use of Led Zeppelin's \"What Is and What Should Never Be\" when we first get a glimpse of Pat's mental fragility. Having only recently been a David O. Russell fan since his boxing biopic \"The Fighter\", I was anxious as to what Silver Linings would bring to 2012 and whether or not my anticipation would end in disappointment but thankfully it most certainly didn't and if anything, left me admiring O. Russell's directional ability even more. In short, Silver Linings is a splendid movie, worthy of a watch and one that will not disappoint."
    },
    {
      "rating": "9",
      "text": "'Silver Linings Playbook' is the best romantic comedy of the year, holding up with a plot that some crazy characters, I can only say that is insanely good. Bradley does its best to deliver a great performance, but make no mistake, the film is Jennifer Lawrence."
    },
    {
      "rating": "10",
      "text": "This movie, represents everything an audience dreams of seeing in a movie. First, the acting is superb. Though, this movie is predictable, the story line and great dialogue makes up for it. Jennifer Lawrence and Bradley Cooper, have amazing chemistry together, making it all the more believable. Robert DeNiro and Jackie Weaver, also stole the show, playing the role of Pat Jr. parents. This movie, is hilarious, dramatic, romantic, and has a beautiful message. 'Silver Linings Playbook', is nothing short of fantastic"
    },
    {
      "rating": "8",
      "text": "I am thankful for the rare but ever so gratifying romantic comedies that are exceptionally well acted. Cooper and Lawrence were a delight to watch as they rocketed into the upper echelon of talented actors and actresses in Hollywood. The story had an insightful take on tragedy and loss that was quite refreshing. A great date night movie that will make you laugh and feel like you watched a movie with substance."
    },
    {
      "rating": "10",
      "text": "One of the best movies i have seen! It totally worth the 2 oscars. The movie was fantastic, the actors where great and the overal story was really good! Oh and one more thing, Jennifer Lawrence was gorgeous!"
    },
    {
      "rating": "9",
      "text": "One of the best movies this year. Top notch performances from every cast member. Sad and funny at the same time. It gets a little bit unrealistic around the last part, but I like it anyways, because when the movie ended I felt good, and there is nothing more to ask...Now we should go and find our silver linings too."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this film. The comedy never gets in the way of the drama and vice versa. The performances are all solid. There are several actors you don't see in movies too often anymore and it is pleasant to see them again."
    },
    {
      "rating": "10",
      "text": "A roller coaster ride of a movie with emotions swinging from teary eyed seriousness to laugh out loud moments. Every character was well played and especially good performances from Cooper and Lawrence."
    },
    {
      "rating": "3",
      "text": "David O. Russell hasn't quite grasped a more careful idea of portraying mental illness within a dramedy. The transparent depiction inside a Hollywood, Oscar-baited film becomes clearer towards the end, and if he knew that this script would win awards then he possibly didn't try it convincingly enough. The ending was purely cringeworthy, it lost its likeability pretty quickly and the sentimental drama that is said to be cleverly executed and believable is actually riddled with cliches. The bipolar illness itself is treated as more of a side-issue it kills any chance of an even tone by switching it on and off when needed. The comedy fails to distract from these problems, making light of the real issues (with its subject and the plot itself) and acting as if this is what it truly means to have bipolar."
    },
    {
      "rating": "3",
      "text": "This movie is smegma. Totally calculated and cynical, nonetheless managing to also be super vapid. Basically, it's a Sleepless In Seattle-style romantic comedy with a vaguely original \"mental health\" wrapping. You can call out all the most conventional and tired plot devices before they happen; and the ones you can't (like the dance-off) are unpredictable only because they are just so damn stupid and belong in another movie. Bradley Cooper is cute, but basically a WB-caliber actor. Hunger Games girl has a weird inauthenticity about her and she's just not believable as this character. I dunno what Robert Deniro is doing in this movie, but he makes the best of a bad situation, at least. I would fear for us as a society if I truly believed this stinker would pass the test of time. Fortunately, I am old enough to know it won't."
    },
    {
      "rating": "10",
      "text": "Silver Lining Playbook is inspiring for those willing to let their guard down to the uncomfortable realities told by this story, and a tastefully effective display of emotional honesty."
    },
    {
      "rating": "10",
      "text": "A seamless blend of excellent dramatic and comedic acting. Satisfying comedy. Satisfying romance. Dozens of scenes which could have gone awry and none of them do. Some movies just gel and have a special magic and this one did for me. Please go see this movie and support real film making, great writing, and just hardcore fantastic acting."
    },
    {
      "rating": "10",
      "text": "What a brilliant film Bradley Cooper, Jennifer Lawrence, Robert  DiNiro, Chris Tucker so funny considering the subject matter after a long day it really cheered me up some brilliant acting and great direction  a must see film."
    },
    {
      "rating": "6",
      "text": "Silver Linings Playbook: A charmer! Bradley Cooper proves to be an actor of skill. Jennifer Lawrence proves to be a future star. First half of the film was funny but also real. Second half: what a disappointment! I can't believe the movie chose to go for the cheese fest in the second half. It totally wasted the promising premise."
    },
    {
      "rating": "10",
      "text": "Best movie of the year. Not one moment did my wife and I feel any incongruity in any part of this movie. It was funny and real all the way through. Very rewarding if you have accurate people skills & intuition"
    },
    {
      "rating": "5",
      "text": "Just a little bit above the average. It's quite enjoyable, funny and likable and the performances are strong. I personally think that D.O'Russel's direction is what makes this lemonade so respectable. Still, even with the strong direction and catchy soundtrack, the screenplay, the dialogue and the whole atmosphere felt plastic and exaggerated and non-believable. And personally, I don't like how this fairy-tale depicts bipolar and depressed people. Oh, and is the Solatano family really dysfunctional? I never noticed that."
    },
    {
      "rating": "8",
      "text": "I love movies like this because it reflects just how messed up life can be sometimes. You may mess up and not get a second chance, so move on; improve yourself.\r Bradley Cooper and Jennifer Lawrence play off each other wonderfully, both representing broken people who have had their lives completely drained by a previous episode. Robert De Niro is wonderful as the OCD father and the film really does ride the line of comedy and drama well. The most surprising part is how it got me rooting for the main characters, a rare-feat these days.\r I would highly recommend it to anyone who is a fan of character-driven movies."
    },
    {
      "rating": "10",
      "text": "For me, this film worked at every level. It's funny, sad, tragic, compelling, screwed up and absolutely entertaining. Not a dull moment here and it's not even an action movie! Cooper + Lawrence are beautiful together and believable."
    },
    {
      "rating": "6",
      "text": "Good performances. But very flawed and lots of lazy writing and direction. The scene were the \"big bet\" is so damn contrived and illogical that it's embarrassing and ruined everything they'd built in the first two acts. And it's freaking illogical. Anyone, especially a bookie knows a double or nothing bet is not a big deal, you just have to make another bet at the same number. You don't need to parlay it or give more points. Lazy lazy lazy.\r I also like when Jennifer is listing the scores of the games she was with Cooper ... she mentions the Eagles beating the Seahawks 14-7. Well, they'd said earlier in the film that the Eagles were BEATING the Seahawks 27-10. WTF. How freaking lazy.  There's also a scene where Jennifer is taping Cooper's shoe's with duct tape. But in the shot RIGHT BEFORE that his shoes ARE ALREADY TAPED. Lazy."
    },
    {
      "rating": "7",
      "text": "Silver Linings Playbook is a peculiar film, because is a romantic comedy that breaks all the previews standards of that genre. Basically is the typical love story, but the interesting thing is that all the cast have a psychological problem. Starting by the protagonist couple, we see Pat (unexpectedly well played by Bradley Cooper) a bipolar that speaks before thinking, then Tiffany (Jennifer Lawrence as marvelous as always) a widow with borderline personality. The dynamic that is generated between them is based in learning how to live a normal life and be adapted to social conventions. The thing is that consequence of their condition the family and friends attempt to control their lives (the topic of the great power of the family is also noticeable in The Fighter). The family of the protagonist also is a dilemma; the father is an addicted to gambling with OCD and felt guilty because how his son turned out; the mother has an extreme necessity that all the relationships of the family maintain in order, living in denial; the brother lives with a superiority complex, but enters to a contradiction because of Pat. Then we have the friend of the protagonist who has problems with his wife so he release tension breaking stuff at his garage with hard music; the friend of the hospital invents excuses to run away and the doctor tries to fit in the American society. This great cast is amazingly well managed by David O. Russell, the only problem is that at the end the movie returns to the stereotypes of simple romantic comedies."
    },
    {
      "rating": "7",
      "text": "The music selections and acting performances are what make this movie shine, but there are many flaws that seem to have been overlooked.  As far as romantic comedies go, this one is one of the better ones with interesting twists and a good story.  However, the movies depiction of various mental illnesses are astoundingly inaccurate and the fairytale ending was nothing but predictable from the start."
    },
    {
      "rating": "5",
      "text": "Silver Linings Playbook has great acting, some wonderful scenes, and overall characters who you root for. The problem is that this doesn't all come together. It feels like by adding another few scenes might have brought everything together. But in the version I saw in the theater, something was simply missing."
    },
    {
      "rating": "10",
      "text": "Well, honestly speaking, Silver Linings Playbook is the best romantic comedy-drama film I have watched in 2012. I'm not even exaggerating it, I'm not a fan of Hollywood romance but there comes a time when someone, out of the blue, does something marvelous. Congratulations to David O. Russell for writing and directing such a wonderful piece of story, which is imperfect, includes a dysfunctional family, two damaged persons and despite all those imperfections, it is a flawless and perfect story. Some romantic films seem predictable at times when you're watching them with complete attention but Silver Linings Playbook is unpredictable. You think something bad would happen in the next scene but it turns out to be the complete opposite. Hats off to Bradley Cooper and Jennifer Lawrence's excellent performances. I know how great of an actor Lawrence is, but the big surprise of this film is none other than Cooper; his character and its execution, his dialogues and expressions are wonderful, he has carried it out extremely well, I don't think anyone else would have done it in the same way. Here is an argument that the film doesn't have a powerful story and gets lame at times. My only response to that is this love story is told in such a beautiful way that you can easily ignore all the bad things, but there isn't a single bad thing about this film, for me. My expectations from this film were higher than the Mount Everest and yet it still surprised me with its ingenuity and beauty. The imperfection of its story and its characters is what makes it flawless and perfect and that is the sole reason I call it the best love story of 2012."
    },
    {
      "rating": "9",
      "text": "Silver Linings Playbook is why we go to the movies and I can't remember the last film that evoked such a spectrum of emotions. I grabs you early on and doesn't let go, largely due to it's brilliant performances (a huge nod to Jennifer Lawrence), and culturally relevant screenplay. You will laugh, cry and cheer during several of it's dysfunctionally delicious segments and you'll fall in love with at least a couple of its characters. Backed by an outstanding soundtrack, SLP is one of those films that you'll recommend to everyone you know. Yes, it's that good and thank g-o-dnmovies like this are still being made. It will most assuredly do well at this year's Academy Awards."
    },
    {
      "rating": "2",
      "text": "It was this a comedy? Because I didn't laugh once (maybe once on a rude comment here and there).Was this a realistic movie about mental problems? Of course not. Was this an original mix of genres with great writing? No. It has cliché romance, cliché father/son problems. Cliché violent guy problems. All together with a cliché ending. The only \"different\" thing is the performances of mentally unstable people by the gorgeous leads... That's it.It is terrible and overrated"
    },
    {
      "rating": "10",
      "text": "Jennifer Lawrence has arrived.  If the Hunger Games did not catapult her to the top Silver Linings Playbook does.  All of us in America come from a dysfunctional family.  So what?  DeNiro is a scream as a die hard Philadelphia Eagle fan.  This movie is totally worthy of all the accolades it has received.  Definitely worth the price of admission.  Go see and enjoy."
    },
    {
      "rating": "4",
      "text": "Completely fell apart int he 3rd act.  So many plot devices and contrivances to reach the underwhelming emotional finale.  As over-hyped as the Eagles 2011 and 2012 seasons combined."
    },
    {
      "rating": "1",
      "text": "Was with it for first 2 acts. Completely fell apart and lost it's tone and believability in the third act. So much exposition just to get Deniro's friend to make a bet on them dancing (without ever having seen them dance)? Shoddy writing. Felt like a unique movie for the first 2/3 then a bad TV episode of Happy Days for the last third. Waste of a good start."
    },
    {
      "rating": "1",
      "text": "This movie troubled me at a level 10 on a scale of 1 to 10.  In my opinion, this movie's script was badly flawed and presented a dangerous and very serious mental disease in a completely unrealistic light.   Yes, the movie has a predictable and idealistic end but the end is just not conceivable given the events and the time frame depicted in the movie.  I have tried to figure how this movie got such a high rating from others, but have not come up with any plausible reason except that most people know absolutely nothing about the seriousness and difficulty persons with the mental disease depicted in this movies have in their lives dealing with the disease."
    },
    {
      "rating": "6",
      "text": "The acting of all the principles was well done and the dialog was mostly fine, however, this film did not really \"grab\" me as I expected, especially after hagving seen \"The Fighter\" by the same director.  Individuals who are part of the mental health world presumably will get more out of this story. Watching the film, I kept veering between wanting to really like it, but then feelings of \"who really cares\" would intrude. I think Bradley Cooper is terrific but some of his acting verged on histrionics. I thought Jennifer Lawrence was better. And Robert Deniro's part just did not really add to making this a \"ten\" film movie. He is so much better than his role in this movie. Go to see it, but don't expect \"great\"."
    },
    {
      "rating": "7",
      "text": "This movie is a mixed bag. I enjoyed everything except the main plot, which was very a typical romcom. A Boy has a problem, a girl has problem, then the boy and girl overcome that problem through mutual respect and handwork. That being said, the additional subplots and story elements are a welcome change to that typical formula. For example, the psychologist is hilarious, and the peculiarities of each character are executed well (except Cooper's mother, who is pretty stale). DeNiro and Cooper's performance are excellent, and show real promise in future movies for the later."
    },
    {
      "rating": "7",
      "text": "The first half of this movie made me slightly uncomfortable,and didn't seem to have a clear direction. I actually regretted choosing to see it at first.. But it found its voice in the second half and I ended up liking it.  I enjoyed how the film captured a slice of Philadelphia.but have no idea what a \"home made\" is.. . ."
    },
    {
      "rating": "4",
      "text": "This could have been a good movie if it knew where it wanted to go. The relationship struggling to overcome mental disease might have been worthwhile but the incessant need to reunite with the former wife and the ridiculous Eagles euphoria with stupid bets, ju-ju, and parlays not to mention a silly dance competition distracted the course of the movie and made it silly. So many things simply don't ring true because it tried to be more.    Stupid and moronic bets are made, Eagles fans attack their own, a dysfunctional family is made so only for laughs,  Copper goes berserk when ever the plot needs some stimulus, several other characters are possibly more disturbed than Cooper, Lawrence is basically conniving and dishonest to an extent, and who becomes a full blown slut just because their husband dies? I could go on with other aspects that distracted me but you get the point. This could have been better but it went for cheap laughs."
    },
    {
      "rating": "8",
      "text": "Bradley Cooper perfectly portrays a man struggling with his bi-polar disorder. He's warm and funny but also scary and delusional. The rest of the cast (including a revelatory performance by Jennifer Lawrence) is also terrific. The film captures the chaos and confusion of people dealing with mental issues well enough to forgive its neat Hollywood ending."
    },
    {
      "rating": "10",
      "text": "this movie brings a fresh air to the romantic comedies because with a simple story and great performances especially lawrence can conquer the public.."
    },
    {
      "rating": "2",
      "text": "DeNiro & Cooper save a bit what is simply a real bad comedy, full of cliché and a Jennifer Lawrence way over the top and using a ridiculous voice. Russel always go for the easy joke, the movie never really try to explore the disease or disability. At the end it's just a nice story about a guy and a girl."
    },
    {
      "rating": "0",
      "text": "it is rubish film that  a man who love spouse  that married with person that sex with 11 person and her father the act is very bad. robert deniro think he play in the gang movie but in film he is a father that love sport and bet. he is leader not boss of the gang"
    },
    {
      "rating": "0",
      "text": "Let me start by saying I am from Philly, and I like Robert DeNiro a lot. That being said, this has to have been the worst movie I've seen in years. This is a shallow, predictable and uninteresting tale about highly unbelievable and implausible characters. The dialogue is contrived, the plot unrealistic and ridiculous, and the acting over-the-top. The creators of this movie tried to do too much. It could have been a serious story about a man recovering from mental illness and family strife, much like the excellent movie \"The Fighter\", or an excellent comedy about a dysfunctional and extreme family, much like \"Meet the Parents.\" By attempting to combine both, the creators assured neither plot line was adequately developed, plausible or interesting. It was intellectually nauseating for me to watch this movie."
    },
    {
      "rating": "5",
      "text": "Any movie involving the Philadelphia Eagles or their mutant fans is terrible by definition. Oh yeah, Bradley Cooper is actually pretty good in this movie."
    },
    {
      "rating": "0",
      "text": "Please why does a movie that sucks so bad get an 8.2 score here  From the very first scene you can tell that even Bradley Cooper doesn't know if this is a comedy or a drama. Bipolar my butt. He looks like an NFL quarterback, that is the shape he is in. The script is just beyond awful. And why did they throw Robert DeNiro into the mix  Anyone who has ever seen a father and a son together know that they don't act like that...unless...it is a comedy, which it isn't. The ADD style of this movie and the constant babbling of everybody involved really go on your nerves after 7.5 minutes. I seriously start to doubt the ratings on here. I am pretty sure that Hollywood has an entire army of people who do nothing but rate up movies on sites like this one.\rAnd yes, why exactly WAS he wearing that modified garbage bag while running  It was not even funny..."
    },
    {
      "rating": "8",
      "text": ""
    },
    {
      "rating": "9",
      "text": "Silver Linings Playbook is a fun movie, with the usual compromises that touchy-feely family comedies have, especially when mixed with a heavy amount of clinical disfunctionalism.\rMost of the casting was fine, the script and work of the cast drew us in to the characters and the semi-plausible tale will bring tears to the eyes of the optimists in the audience.\rThere was a little too much psychosis for me, but it was a fun two hours and the ending didn't disappoint."
    },
    {
      "rating": "9",
      "text": "It's no \"Ordinary People,\" but I really enjoyed both the drama and comedy of this film about people just trying to survive in their different ways. And the fact that a competent cast managed to do the job in a mere two hours! Know it's not a \"blockbuster,\" but it's less preachy than \"Lincoln,\" doesn't embellish a real story like \"Argo,\"  is more relatable than \"Zero,\" and has a soundtrack that's more enjoyable than 99 percent of the music in \"Les Mis.\" Puzzled, though, by the Oscar nom for Jacki Weaver. She picks the son up at the hospital and that's about it -- kind of a zero compared with (say) Melissa Leo as the mom in \"The Fighter.\""
    },
    {
      "rating": "8",
      "text": "A truly adorable, engaging and uplifting romantic comedy that manages to steer away from the conventional and reminds us that in order to get it right in this genre it requires both a solid script, a good director, but most of all chemistry between the leads: Lawrence has proven her self before, but Cooper is just such a revelation in a very challenging role.  Recommended feel good film of the year."
    },
    {
      "rating": "6",
      "text": "As the movie begins, Bradley Cooper is released from a mental facility where he was sentenced after a violent incident. He returns home to his parents (De Niro's his dad) and tries to get his demons under control. It's not long til he meets his unstable soulmate (Jennifer Lawrence) and the knotty relationship develops. This is not a punchline script: The humor comes from the characters and their unwieldy interactions. Expect more quiet chuckles than outright laughter. Performances are uniformly strong (great to see Chris Tucker) with Lawrence adding to her short list of impressive characters. If you enjoy watching emotional outbursts and frantic family arguments, you may find this film entertaining. I was never bored, but never captivated either."
    },
    {
      "rating": "10",
      "text": "I loved this film.  A perfect balance between humor, drama, and quirkiness.  I thought the chemistry between Pat and Tiffany was through the roof.  The acting and writing are excellent throughout.  David O. Russell seems to be one of those directors that gets superb performances by the entire cast.  \"I made crabbie snacks and homemades!\".  I laughed every time his mother said it.  Pat and Tiffany's discussion about all the meds they've taken was hilarious.  I laughed a lot during the film and was rooting for these two to get together right from the start.  The best romantic comedy I've seen in years.  This movie and \"Life of Pi\" are the best two films I've seen this year.  Oh - I also really enjoyed the music selection for the film as well."
    }
  ],
  "recommendations": [
    "the_intern",
    "the_king_of_staten_island",
    "as_good_as_it_gets",
    "the_dilemma",
    "gone_baby_gone",
    "fatherhood",
    "chef",
    "the_terminal",
    "me_before_you",
    "little_miss_sunshine",
    "the_descendants",
    "hustlers",
    "the_big_sick",
    "the_fighter",
    "marriage_story",
    "blue_jasmine",
    "instant_family",
    "gifted",
    "we_bought_a_zoo",
    "good_will_hunting",
    "burnt",
    "the_blind_side",
    "life_as_we_know_it",
    "midnight_sun",
    "suburbicon"
  ]
}