{
  "id": 2754,
  "title": "Sin City",
  "starring": [
    "Bruce Willis",
    "Jessica Alba"
  ],
  "runtime": 124,
  "genre": [
    "Thriller",
    "Action",
    "Crime"
  ],
  "description": "Welcome to Sin City. This town beckons to the tough, the corrupt, the brokenhearted. Some call it dark… Hard-boiled. Then there are those who call it home — Crooked cops, sexy dames, desperate vigilantes. Some are seeking revenge, others lust after redemption, and then there are those hoping for a little of both. A universe of unlikely and reluctant heroes still trying to do the right thing in a city that refuses to care.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/i66G50wATMmPrvpP95f0XP6ZdVS.jpg",
  "categories": {
    "plot": 7.972222222222222,
    "acting": 7.15,
    "ending": 3.0,
    "soundtrack": 10.0,
    "cinematography": 8.4,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 8.166666666666666
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I loved the way the it is presented; a pulp noir thing. I never read the comic so I really didn't know what I was in for when I decided to watch this and I am glad I did. The violence is a bit over the top but it's no big deal, it acts as part of the city helping boost the fact that it's 'Sin City'"
    },
    {
      "rating": "9",
      "text": "Sin City is grisly, violent, and over-the-top in all the best ways. The stunning cinematography, taught direction, and electrifying script make it one of the best modern film noirs."
    },
    {
      "rating": "9",
      "text": "Spilt into chapters Sin City is a faithful adaptation of three of Frank Millers violent, but brilliantly written, Sin City stories. Shot largely in black and white using Millers graphic novels as story boards director Rodriguez has been able to create a visual feast the likes of which still hasn't been matched.\r Fortunately the stories themselves are able to match the visuals with each of the three fast-paced and engaging chapters providing truly memorable heroes and villains that take full advantage of the impressively talented cast. An all out success just sit back and enjoy two hours of fantastic entertainment."
    },
    {
      "rating": "9",
      "text": "Comic book movies have usually been the big hitters, like Batman, Superman, and the Marvel heroes. Today is the exception with Sin city. I never heard of it, and I never knew that this was based off a comic book, in fact the menu for the DVD tells you by itself. Not that I'm judging it differently now that I know it was based off a comic, but I can definitely see nods and ideas that comics themselves would take. Sin city is the dark noir; add salt and salt, view of three people: a cop, I think a detective, and a loser; persay. Each tale is told well in their own way, showing off the grittiness of the everyday city some us walk through everyday; if you lived in Chicago at least, and is told by unique and interesting people. Bruce wills plays a cop; stop me if you heard this before, and is hunting down a serial pedophile, he does good in not making his role too extreme or boring, just the right I'd say. Mickey Rourk does an awesome job of playing the bad ass Marv, I said earlier that he was a loser, but that was only figuratively. The last I guy I don't know, he's okay he definitely sells me on the character he's trying to play, but his monotone voice is rather boring. The stories are divided well and purposely don't tie into each other, which is good so that it doesn't get confusing. I mean a character will see another one from another tale, but it doesn't mean anything. Finally I conclude with saying this is one of the best comic book movies out there, near the dark knight, but not close."
    },
    {
      "rating": "9",
      "text": "If I had to sum Sin City up In Two Words, I would say \"Stylistically Badass\"  This film has TRULY Unique and equally Beautiful Visuals and a surprisingly Epic story, And something that makes this stand out from other comic book to movie adaptations is how faithful the live-action characters are to the original comic book characters."
    },
    {
      "rating": "9",
      "text": "This is one of the best comic book movies ever released. The look, cinematography, acting, and action are all perfect. Elements of the script are cheesy, but I chalk it up to its origins as a comic book."
    },
    {
      "rating": "9",
      "text": "\"Sin City\" is a very good movie with intense action. It really goes all in on showing how bad the crime scene is there. I especially like the narrative point of view character's in it. I also like that in the movie there are no limits in how bad the crimes really are at all. It does a great job in delivering certain items or people to be different color from the rest to point them out. The cast does a great job especially Clive Owen in his performance. Overall this is a dark movie, with violence and corruption which is what the movie is supposed to represent and they do an excellent job at it."
    },
    {
      "rating": "10",
      "text": "This didn't affected me too much while i was watching but after a 2 or 3 days, i noticed that i kept thinking about this and then i realized how an epic experience this movie was. I actually watched it because of Jessica Alba, but i couldn't believe it would be that good. Comments? Come on guys, if you give this movie anything lower than 5, then it is your problem. Cast is already full with stars: Jessica, Bruce Willis, Clive Owen, Mickey Rourke and even Michael Clarke Duncan bro...Noir Crime movies is not something seen common in Hollywood  (i dont even remember another Noir Crime other than Max Payne Movie) Watch it and you will love it..."
    },
    {
      "rating": "10",
      "text": "Another breakthrough in cinema comes in the form of Sin City, a film brimming with so much drama, flare, excitement and beauty that it will ultimately be one of the defining, unforgettable and dramatic pieces of modern cinema that explores and discovers new ground, and brings the comic to movie adaption scenario to a whole new level. The film is told through various stories based on Frank Millar's comic book series, the man who also directed the film along with Robert Rodriguez, and a special credit for Quentin Tarantino, along with an ensemble cast that have the pleasure of taking part in such a unique film.\rWe have Bruce Willis playing an ageing cop with heart problems, who struggles to do his duty, while in another story we have a heavily make-upped Mickey Rourke playing Marv, a man on the hunt for the person who killed his mistress in the night, and he will not let anyone stand in his way, good or bad. The large cast which also includes Jessica Alba, Josh Hartnett, the late Brittany Murphy, Elijah Wood and Michael Madsen, all play very versatile and intriguing parts, and to my understanding this is more a \"translation\" than an adaption, as it is very close to the comics. These actors and actresses really throw themselves into the roles, particularly Mickey Rourke as the larger than life Marv, and also Clive Owen, a mysterious man helping out a town of prostitutes.\rThe statement of the film and its faithful translation of the comic series is visually true on screen, when we see the graphic content and the neo-noir effect used entirely throughout the film, where it is predominately black and white save for certain colours such as blood and lipstick.\rThis unique and edgy form of filming is magnificent and full of gore, with an exaggerated and out of this world form of violence. Its a real delight when a film like this comes along, combining the power of technology and of course, the imagination, to create a very singular and unorthodox film that never quits being surprising, innovative and most of all, fun.\rThe film is one of historical significance in terms of its groundbreaking style of filming, but it is also well written and can be summed up in various aways, a crime film, a thriller but also a very brutal and imaginative tale, a must see for comic book and film fans alike."
    },
    {
      "rating": "10",
      "text": "\"Sin City\" is much more than a gory, stylized flick, it actually has a story and plot and, well, everything else.  Shot in a gritty black and white background with highlighted shades of red and yellow, this is one hell of a movie. And believe me, it has such style."
    },
    {
      "rating": "10",
      "text": "Its on my list for one of the best movies of all time, Sin City grabs audiences in on all levels whether its humor or its satisfying style of thrilling violence. Rodriguez at his absolute best."
    },
    {
      "rating": "10",
      "text": "This film is extremely disturbing: the violence is gruesome, the plot is dark, and a lot of the scenes/themes are vile, but that's what a graphic novel is! Despite loving the direction of the film, I was heavily disturbed (in particularly the Last Jessica Alba scene), but while I was ringing at the horrific images all I could think was how generally excellent this film is."
    },
    {
      "rating": "10",
      "text": "Ever thought you'd actually like a movie with a heavily used up \"Detective's POV\" style of progression? From this century? Well think again! A surreal, visually stunning Neo-noir by the legend himself - teaming alongside the likes Tarantino and Rodriguez - entertainment couldn't possibly get any better than this."
    },
    {
      "rating": "10",
      "text": "Robert Rodriguez has made some good and bad films in his career, so one has the right to be unsure of whether to see this film or not.  However, the very appealing cast persuaded me to watch 'Sin City', and I'm very glad I did.  The cast were excellent, the dialogue strong (although sometimes a little cheesy, which I didn't mind) and the effects were breathtakingly brilliant.\r It is stylistic, sometimes funny, well-acted and all together, a fantastic film.  An absolute 'must-see'!"
    },
    {
      "rating": "10",
      "text": "Sin City is a masterpiece. the black and white with some color visual style of this movie is amazing. the stories in this movie are great and interesting told."
    },
    {
      "rating": "10",
      "text": "AlvaradoKTAJun 16, 2014Even on such a low budget, this is the best in the Mexico-trilogy films. Well paced from the opening title to the to be continued promise, every scene has a humorous note. An original script with a good amount of shoot outs, this film"
    },
    {
      "rating": "10",
      "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤°°°°°°°°°°°°°°°"
    },
    {
      "rating": "10",
      "text": "●●●●●●●●●●●●●●●●●●●■■■■■■●●●●●●●■■■■■■■■●●●●●●●●●●~~~~~~````````````,,,,,,,,,,,,,,"
    },
    {
      "rating": "10",
      "text": "++++++++++++×××××××××××××××××××÷÷÷÷÷÷÷÷=÷÷÷÷÷÷==========::::::;;;;;;;::::::::::::::::°°°°°°°°°°°°~~~~~~~~~~~~~~~"
    },
    {
      "rating": "10",
      "text": "◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇●●●●●●●●●●●●●●●●●●●●zxcvnmmsodmodmkdmosmswet"
    },
    {
      "rating": "10",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,■》■》■》■》■》■》■》■》■》●》●》●》●》●》●》●》●》●"
    },
    {
      "rating": "10",
      "text": "the greatest comic book movie ever created, what a masterpiece! i love the the theatrical cut but i love extended cut even more bcuz it expand the story even more when it didn't even have to, such perfection. marv is my favorite character but honestly i love all of the characters. the cast is so perfect and fit so well. its nothing negative that i can say about this movie."
    },
    {
      "rating": "7",
      "text": "10 for style, but only a 5 for plot, yielding about a 7 overall. Didn't love it, but it was definitely original. Mickey Rourke is outstanding. Part 3 is repetitive, but then again Bruce Willis is a fine actor, so he pulled me in. Some of the violence was too much for me."
    },
    {
      "rating": "10",
      "text": "One of the five best films I've ever seen, Sin City is a masterpiece of monumental proportions. The only reason people are giving this film bad reviews is because they have no taste, thought it was boring, and hated how it represented everything wrong with society. That's what the purpose of it is, it represents what is wrong with society and isn't far from reality. This film was amazing throughout and if you get pissed at films that show the dark side of human nature, then just walk away. If you actually have taste in films and have no problems with films that aren't interested in happy endings or showing a good side of humanity, then this is quite the sight. It's determined to be stylish and feel realistic. BEST COMIC BOOK FILM EVER."
    },
    {
      "rating": "3",
      "text": "Expected so much more from this one. Sin City starts out intriguing, but in the middle gets so terrible I had to actually fast forward through parts of it and fight the urge to press stop and quit watching it. The problem, obviously, is not with the graphic presentation - it's stylish and sometimes very gory. Also gotta take note of the female cast - Jessica Alba is adorable, and others (especially Carla Gugino, to my surprise) are outright hot. (Boobs included) But a movie isn't all about its presentation (and boobs), it's also very much about the plot, and it's pretty damn awful here. The main problem are the characters and the overall goofy comicbook crap that it's based on. Mickey Rourke's ugly-as- **** character throwing people like he's superpowered, Clive Owen jumping down buildings, creepy cannibalistic Elijah Wood, people surviving totally grave wounds and some ugly disgusting yellow freak are ridiculous and just plain stupid.\rIt is impossible not to see how hard this tries to be \"noir\". with all the black-and-white colouring, constant rain or snow and neverending inner monologues. But it tries too hard, not achieving much. What the movie lacks is a good source to be based on - maybe some detective novel, some real literature, not this comic book junk from Mr. Miller, who can hardly be called a writer.\rOnly good thing is that now I know that I'm in no way spending money on a cinema ticket to the Dame to Kill For, despite its boob-cast now including Eva Green."
    },
    {
      "rating": "4",
      "text": "Sin City is just not my thing I guess. I did not like the story and the characters too much and they dragged the rest of the film down with them. The film just has no soul and it shows so much throughout the film as it is entirely hollow. The acting is fine and the direction is certainly stylish. The visuals of the film are revolutionary and a true wonder. That is the film's main redeeming quality; the visuals. I wanted to like this one more, but I just did not. Maybe I will rewatch it, because I want to love this film and I feel like I am being harsh on it, but it just did not land for me at all. The visuals must have taken forever to do and I appreciate the effort, especially since they are so groundbreaking. Plus, they are breathtakingly gorgeous, which does not hurt. The colors and when they are not present are just...wow. The direction is fine, but the characters and plot just make the rest fall apart. I could not get into this one at all and it also felt so shallow and hollow. Overall, I wish I liked Sin City more than I did. Sorry."
    },
    {
      "rating": "10",
      "text": "The story and characters are brutal, gritty and motivated. The visual style is atmospheric and comic book like. The soundtrack is just right. The movie delivers entertainment and interest in the characters."
    },
    {
      "rating": "9",
      "text": "Extreme brutality and violence, visually-arresting cinematography, and nothing short of pure genius. Remarkable crime thriller neo-noir based on Frank Miller's graphic comic novel series. Directed by Robert Rodriguez and Frank Miller, there wasn't a screenplay written for the film, and instead they approached the filming as a translation. This isn't an adaptation of a comic book, it's like a comic book brought to life and pumped with steroids. The movie is based on three of the \"Sin City\" stories which works perfectly for a two hour film. There are big time actors in the movie (Bruce Willis, Clive Owen, Mickey Rourke), but there is no lead role so much as actors who dominate the foreground and then move on. Fully digital, live action picture incorporating a technique of colorization while filmed in black and white. To say that this is the best comic book to movie adaptation I've ever seen would be an understatement."
    },
    {
      "rating": "9",
      "text": "After watching Sin City for the first time it would be a huge understatement to say that I am excited for \"A Dame to Kill For\" later this year! This movie was plain awesome! Everything from the fantastic characters, the interwoven story lines and the down right jaw dropping visual style; everything was almost exactly how it should be! I can honestly say that this is the first comic book films I have seen where the pages were not only adapted but truly brought to life!"
    },
    {
      "rating": "9",
      "text": "The sheer faithfulness of the movie to the comic book series is evident, and has my respect from before the movie even begins. The stylized neo-noir color, cinematography, and editing is added with stellar acting and an actual plot. The violence is turned into its own art form, which up until this film, I only thought Tarantino could pull off."
    },
    {
      "rating": "5",
      "text": "The film is split into 3 shorter stories. One of which, \"That Yellow Bastard\" is tense, gripping, and excellently directed. The second, \"The Hard Goodbye\" falls short, but is still pretty entertaining. The third, \"The Big Fat Kill\" is absolutely ridiculous and horrible. The whole experience levels out to be something quite shallow and underwhelming, and by the end, you feel like Robert Rodriguez is just throwing blood all over the viewer's face saying \"LOOK AT IT! LOOK AT IT!\" Definitely not really worth watching, unless you can find \"That Yellow Bastard\" as a standalone short film."
    },
    {
      "rating": "10",
      "text": "This is a good comic book to movie adaptation.Bruce Willis,Mickey Rourke,Jessica Alba and Clive Owen are excellent in their roles.The only thing that I found disappointing is, the fact, that Josh Hartnett was not there enough.But the movie was still excellent."
    },
    {
      "rating": "10",
      "text": "Unbelievable! In this age, a black and white movie making me love it so much? I'm amazed really. The characters, the story, the filming... Women to kill and die for! Everything is perfect. Sin City has made it upon my list of classics for sure."
    },
    {
      "rating": "10",
      "text": "Sin City is a movie that is interested in one thing and one thing only: being cool.And boy does it accomplish that.Every second of each of its different stories is dripping with unapologetically stylish visuals, sex, violence, brooding and edge.It's completely devoid of any pretentions while also being the perfect kind of pretentious. It knows exactly what it is, and it loves every second of it.There are few movies as confident in their ability to wow audiences like this one. It certainly wowed me."
    },
    {
      "rating": "10",
      "text": "A+ *************************************************************************"
    },
    {
      "rating": "9",
      "text": "+++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "Sin City was absolutely amazing! Just like the comic book, the movie's format of color is incredible.\r Watch it online for free: https://www.primewire.ag/watch-589-Sin-City-online-free"
    },
    {
      "rating": "8",
      "text": "\"Sin City\", a neo noir movie based on the graphic novel, is a beautiful film. It films in glorious black and white with rich story segments and artistic brutality. Simply a dazzling crime movie that has everything one craves for."
    },
    {
      "rating": "10",
      "text": "Easily one of the best comic book movies is so goddamn awesome so many awesome characters and such an amazing setting worth all the moneys 10/10 so much goddamn good"
    },
    {
      "rating": "9",
      "text": "One my favorite comic adapts.  I still think its one of the best.  Great black and white noir look mixed with fantasy elements.  Each character almost more over the top than the next.  The only thing is I thought they should have done the long goodbye last because it was strongest of the stories and the best performances are in that story.  The other stories are good but nothing quiet lives up to Mickey Rourke's turn as the revenge for the hooker with a heart gold..Goldy..."
    },
    {
      "rating": "2",
      "text": "Just because Sin City is derived from a graphic novel does not necessarily mean I wish for the film to appear as exactly such. The visuals were mediocre alongside its choppy script."
    },
    {
      "rating": "10",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@:@:@:@:@:@:@:@:@:@:@:@:@:"
    },
    {
      "rating": "2",
      "text": "While the film does start out interesting, It gets pretty old and boring the further you get into it. Also the stories are rather stupid and pretty generic, They lack interest as well. Also the acting is well below what I expected from the star studded cast. It looks good but thats about it."
    },
    {
      "rating": "3",
      "text": "I expected to see alot more from this movie, really i expected the best but it didn't deliver. It's hard to rate cause the movies 3 storys in one. The frist one was like having a open hart surgery and the last one was not much better. The second one was actully prity frigen good, the the hole movie was just and extened vertion of the second story I may have given it a 8 or 9. The worst thing was the Narration, the main chariture narrarates his own story. Which sounds cool but then you find out they all sound like Sam Spade and have cheesy diologe. Oh and the gore was enofe to make Jason from Friday the 13th sick. If they had cut back on the crudy narration and gore it would have been grate, but these 2 things murdered the film."
    },
    {
      "rating": "7",
      "text": "Sin City is, in every respect, a masterpiece of kistch. Simultaneously celebrating shallowness and gratuitousness while offering twisted spins on the themes of noir stories, Robert Rodriguez (and Frank Miller, but he is not technically a director of this film) paints a pulp art story then enjoys itself, while allowing the audience to enjoy it. Provided you have a strong stomach."
    },
    {
      "rating": "5",
      "text": "This is the kind of vile, ridiculously brutal movie made by a country that can't win real wars, and where economic failure causes its citizens to fantasize about ultraviolence. Sixty years ago Americans fought their wars with honor, and for the right reasons, but made movies that respected human dignity. We're flushing ourselves down the toilet of history."
    },
    {
      "rating": "2",
      "text": "Definatley one of the worst movies i have ever seen."
    },
    {
      "rating": "3",
      "text": "Easily the sickest mainstream movie of 2005 was \"Sin City.\" This is a duller than dull, grosser than gross adaptation of Frank Miller's adored graphic novels. But the movie, which features an all-star cast (Bruce Willis, Michael Madsen, Mickey Rourke, Jessica Alba, Elijah Wood, and on and on), is so sleazy and frankly boring that by the end of its two hours of screen time I feel exhausted and disgusted. Not since \"Batman Returns\" has a director been so fixated on creating moods and emulating creepy noir settings at the expense of storytelling that is coherent and enthralling. Director Robert Rodriguez (working with Quentin Tarantino) settles for misogynistic material that is amazing for the eyes to behold. But since when has that been enough? Working with Tarantino is a major tip-off to this movies abundance of problems. I loved \"Kill Bill 2\", thought it was among the best films of 2004. But there is a joy to the \"Kill Bill\" movies; a zeal for exhilarating movie making that calls to mind the joyful destruction of \"Goodfellas\" and those movies actually had strongly feminine proclivities. There is no joy, no fun, and no pleasure in \"Sin City\" (except for people who dig seeing the 50th head chopped off or women slapped around). Even if you can look past that there still isn't much to marvel at. Worse than the triumph of style over substance, \"Sin City\" champions bad attitude over ideas."
    },
    {
      "rating": "0",
      "text": "I'm not offended by nudity, and violence is okay if the flim has some other redeeming qualities. Sin City has no redeeming qualities. If Sin City is representative of modern comics I'm glad I gave up reading comics in my teens. Sin City isn't simply bad, it's disgusting."
    },
    {
      "rating": "1",
      "text": "Ridculous dialogue. Self-serving and preposterous. This movie uses every cliche in the book. It's gut wrenching watching quality actors seem like they are suffering through such a goofy movie with some of the worst lines ever written."
    }
  ]
}