{"id": 3867, "title": "Sin Nombre", "starring": ["Paulina Gaitán", "Edgar Flores"], "runtime": 96, "genre": ["Drama", "Action", "Thriller", "Crime"], "description": "Sayra, a Honduran teen, hungers for a better life. Her chance for one comes when she is reunited with her long-estranged father, who intends to emigrate to Mexico and then enter the United States. Sayra's life collides with a pair of Mexican gangmembers who have boarded the same American-bound train.", "releaseYear": "2009", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dubZwiGWp6TwYNGYtyGEUC7XAin.jpg", "categories": {"plot": 7.181818181818182, "acting": 7.2, "ending": 9.0, "soundtrack": 5.0, "cinematography": 9.0, "familyFriendly": 3.0, "funny": 9.0, "action": 9.0}, "reviews": [{"rating": "10", "text": "This movie was brilliant. Great story telling - and hey, there's a reason certain plot lines are repeated - it's called \"compelling\" - and this story is. And this isn't \"City of God\" - a good thing - there's no glorification of gangs here (however inadvertently). A contemporary Grapes of Wrath. Brilliant."}, {"rating": "10", "text": "Great Movie! Simply the most evocative movie I have seen all year. Pulls you in from start to finish."}, {"rating": "10", "text": "Storytelling at it's best. A poignant and moving tale told in a rich hue of a world most of us are sheltered from and oblivious to. Unpretentious, enlightening and moving."}, {"rating": "8", "text": "Excellent movie. It took me to and gave me glimpse of a part of the world I have never experienced. Very powerful. Very realistic."}, {"rating": "1", "text": "Really violent, gory scenes is what I supposes appeals to viewers. The story itself - not much to it. Evading the authorities and gang members while traveling on top of a train. About it."}, {"rating": "3", "text": "Don't go to see this movie. It is a failed somber and unrealistic attempt to tell a story that mixes gang violence with what some very poor people from Latin America goes through trying to migrate to the U.S. The movie moves in very slowly pace to a tragic end. All characters are quite somber and sad. Nothing good or positive occurs to any of them. No one laughs, smiles or seems to have any hope for a better life. I have lived and worked in Latin America for many years and this movie couldn't be more unrealistic in how it depicts the poor and uneducated people from the area. I came out of the theater feeling that I had waisted my time and my money watching a horrible, unrealistic and depressing movie from which I couldn't learn practically anything."}, {"rating": "0", "text": "If you like watching human suffering and tragedy by all means watch this movie(or the news). If you watch movies for having a good time the donÂ´t.  I watched this movie based on user reviews.... MISTAKE. Huge waste of time."}, {"rating": "8", "text": "Like Gommorah, Sin Nombre is a visceral look at one of the deadliest criminal gangs on the planet. Greatly shot and well acted but in the end makes you feel like crap because you know that similar story's like this with the MS-13 have and will continue to happen leaving at least me wondering what the f--k is wrong with humans??"}, {"rating": "10", "text": "Absorbing and beautifully told and acted. I've been to Tapachula and seen those trains and the movie is right on the mark. Terrific film."}, {"rating": "9", "text": "Beautifully shot, very effective film. This film works so well because it juxtaposes violent gang action with more normalized violence (physical and other) that many Central American and Mexican migrants face daily. Because the gang violence is so outlandish, the violence the confronted by the migrants seems all the more real. While fated with a tragic ending, the film still ends on a note of hope. It is this hope, show in small actions (e.g. children throwing fruit to the passing train) that makes this film more timely than just another gang thriller. One of the best films I've seen in some time."}, {"rating": "9", "text": "This movie is so raw at times, but it exposes just a little taste of what some immigrants might endure during their trek to a hopefully better life. And throughout all this there's an innocent relationship forming, highly unlikely but that's what engages us. The director did a great job, after all this is a movie, and sometimes things don't have a happy ending, but life goes on."}, {"rating": "10", "text": "One of the best movies I've seen in some time...predictable ending but still moving. Strong acting, marvelous camera work...I want to go see it again soon and NOT pay attention to the subtitles so I can catch all of the nuances."}, {"rating": "9", "text": "Don't believe what Manny says about the movie. There are people who do smile and have fun, but the motivating story is about people trying to get to America so that they can have a better life, because theirs sucks. So, naturally the main characters aren't bubbling with excitement, and cracking wise. This is hands down one of the best movies I've seen in '09. It's beautifully shot, and it's powerful and moving. I upon leaving the movie, I wanted to punch a gang member in the face, it was that good."}, {"rating": "10", "text": "We need more of this-there is no \"drug Romantism\" connected with the gangs involved in this movie-just the true teroism that world economics , and our borders, place on real people. I loved this film, probably for all the wrong reasons( But exactly the reasons why Cary Fukanaga made this incredible epic). Because of the violence- I could not reccomend this film to many of my friends, but because of the violence, I have reccomended it to others. Our economic systems are violent. Thank you Fukanaga"}, {"rating": "8", "text": "A harrowing tale of hope and despair, Sin Nombre has many positives. First off, the acting is great. I was unfamiliar with all of the actors, but they each did a great job. The direction from Cary Fukunaga, director of the acclaimed HBO miniseries True Detective, is stupendous. This feature combined with True Detective cement Fukunaga as a young director to watch. The cinematography is great and the story is very well developed and well told. The character development here is also very interesting. The growth of many of the characters in the film is as beautiful to watch as it is depressing. Ultimately, this is a immigration tale set against the violent gangs that dominate much of Honduras and some of the other Central American nations. This contrast of hope vs despair is a riveting thing to watch. Ultimately, Sin Nombre is a great and moving film that will have you wrapped into its world from the very beginning."}, {"rating": "8", "text": "Well filmed, very authentic feeling road picture.  A class of people who live for today simply because there is nothing else, adds a vibrance that is rarely captured on film.  Apparently the director spent a couple years living with Mexican gangs to flesh out the tone.  Not nearly as effective as the follow up Beasts of no Nation a few years later, but a strong entry."}], "recommendations": ["babel", "hotel_rwanda", "lone_survivor", "unbroken", "13_hours_the_secret_soldiers_of_benghazi", "no_country_for_old_men", "the_road", "into_the_wild", "hostiles", "slumdog_millionaire", "crash", "boyz_n_the_hood", "machine_gun_preacher", "hereafter", "run_hide_fight", "fight_club", "only_the_brave", "greenland", "nomadland", "zero_dark_thirty", "the_florida_project", "the_boy_who_harnessed_the_wind", "jungle", "allied", "the_hunt"]}