{
  "id": 1360,
  "title": "Sin City: A Dame to Kill For",
  "starring": [
    "Mickey Rourke",
    "Jessica Alba"
  ],
  "runtime": 102,
  "genre": [
    "Crime",
    "Action",
    "Thriller"
  ],
  "description": "Some of Sin City's most hard-boiled citizens cross paths with a few of its more reviled inhabitants.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/50kALxDX4mmzIRljbNbPY0u4cie.jpg",
  "categories": {
    "plot": 5.225,
    "acting": 5.1891891891891895,
    "ending": 4.9,
    "soundtrack": 5.0,
    "cinematography": 4.333333333333333,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 6.166666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie was AWESOME!   Everything that I expected and more.  It was a great follow up to the first Sin City.  Either the people leaving bad reviews have not actually seen the movie, or they are not fans of Robert Rodriguez or comic books in general.  This is the ONLY movie series out that is made to look and feel exactly like you are reading a comic.   Everything about the movie has the comic book feel.  The acting is spot on, the visual & special effects were beautiful to the eye.  I could not look away.  I have been waiting almost 10 years for this movie and I was not disappointed.  If you are not a Robert Rodriguez fan and don't like comic books,  this movie is not for you.  For me,  I would see it again and again.  Now the wait begins for the Blu Ray Steelbook Collector's Edition.  I can't wait!!"
    },
    {
      "rating": "3",
      "text": "The good: The dame kill for story is probably the best of the three and feels like a sin city story, even though it goes on a little too long.  The color palette and look of the film is pristine.  The bad:  Dialogue seems hackneyed and cheesy this time around.  The voice over is well over used and doesn't have the impact of the original.  The Ugly:  The Nancy Callahan story at the end is just laughably bad.  It s almost seems like self parody at times.  MIller and Rodiguez seemed to get lazy including Marv as a hitman in each of the three stories.  The movie just loses its punch by the end.  There are also a ton of idiotic scenes where characters say things like \"Hold still so I can blow your brains out.\"  and then proceed to shoot them in the shoulder.  Or a hangman's noose just appears out of nowhere."
    },
    {
      "rating": "3",
      "text": "Some great visuals and a lot of style... and that's pretty much it...\r Bad dialogues, some terrible special effects and a movie that just drags on..\r Not a good sequel,.. at all..."
    },
    {
      "rating": "3",
      "text": "Stunningly good to look at, maybe best watched with the sound off then. As for the plot/story of the movie was utter drivel and left me angry at the wasted talent who had enrolled to this follow up to the great Sin City movie.\r Very, very poor overall and unfortunately not a title I would like to recommend."
    },
    {
      "rating": "3",
      "text": "I don't know why this is rated so highly. It's one of the worst movies I've ever seen. Ridiculously over the top, jarringly gruesome, juvenile in delivery, and generally dopey... though its worst \"sin\" is being often boring. I liked the first movie and its stories and characters. This one lost a lot of the heart and believability of the characters. It's a very surface-level schlock shock movie. Maybe Rodriguez and Miller did it for the paycheck. It focuses on cheap endless attention-grabbing thrills, and regurgitates many of the same kinds of visuals and scenes that made the first movie stand out... but gets old fast. I suppose audiences when this came out were easy to please. I found it painfully mind-numbing, and besides a few good performances form a few actors, worth tossing in the bin. Hopefully I'll forget about it soon."
    },
    {
      "rating": "8",
      "text": "If you're a fan of the first film then you will find much to love. This trip back to memory lane may be convoluted compared to its predecessor, but still contains the same punch you'd come to expect."
    },
    {
      "rating": "8",
      "text": "i think this movie is great! My favorite thing about it was the art style, i think it's just a really cool movie and that the story along with the action worked very well together, although a little bit corny at times. The only thing i would say that might turn viewers off of this movie is that it really ties with the first movie, and if you haven't seen the first one then you might find yourself being a little bit lost in this one."
    },
    {
      "rating": "8",
      "text": "Great action , violent , that Comic Book feel , Film Noir and the black and white . The bad , annoying pole dancing , other than Brolin's character and story the rest needed more screen time . And yes , Eva Green stole the show again !"
    },
    {
      "rating": "7",
      "text": "While it's nowhere near as good as the first film, it still manages to be an entertaining and fun ride while it lasts. The ensemble cast does well. The story and narrative, however, felt a bit clumsy at times. This one felt like it was all over the place at times a lot more than the first film did. I was also disappointed that it was and felt a lot shorter and rushed than the first film. Overall, it's still a very entertaining sequel, but leaves much to be desired, especially after waiting for it for over nine years."
    },
    {
      "rating": "10",
      "text": "Sin City A Dame to Kill For is fabulous , this film goes beyond its prequel,providing fresh air to the franchise, thanks to a detailed photograph and Eva Green Luxury !"
    },
    {
      "rating": "9",
      "text": "The critical reviews written by professional critics seem to lean too heavily on whatever is trendy and popular at the time. This movie is a very acceptable, well done sequel to the original and anyone who lets a bunch of strangers dictate what they should or should not see is a very gullible and easily manipulated person."
    },
    {
      "rating": "7",
      "text": "\"Sin City: A Dame To Kill For\" is an excellent sequel to the original \"Sin City, as most of the simplistic black-and-white visuals are kept with an excellent cast that boasts experience and power on-screen."
    },
    {
      "rating": "8",
      "text": "Sin City: A Dame To Kill For is a bone crunching, sexy and stylized trip back to basics. The audience who watched Sin City (including me) are introduced to some new characters. Such as Johnny played by Joseph Gordon Levitt, a boy with luck while playing cards. Jamie King was very surprising as Wendy, they didn't talk much about her in the previous film. Well, Dame To Kill For starts up with Dwight played by Josh Brolin (first it was Clive Owen), he now has a changed up face using a surgery. Dwight now looks for revenge from the evil and sexy Ava played by Eva Green. The film had a Interesting path with the Nancy Hartigan story, but they didn't use Bruce Willis as much. He was just there for 3 minutes as a dream in Nancy's mind! Mickey Rourke plays Marv, a demented killer who helps Dwight in his goal. Overall, A Dame To Kill For is a badass movie. It has a great art style, pumping action but some of it slows down and drags you toward the climax. But it's a great watch, that doesn't top the original, but is really fun to watch. Even If you are not the comic's fan."
    },
    {
      "rating": "10",
      "text": "I great follow up to a perfect comic book movie adaption. \"Sin City\" is one of my favorite movies of all time because it recaptured the comics that I love so very much. I have read all 8 volumes of Sin City and this was like opening up a whole new book because about 60% of the movie is new material. The only adapted storyline is \"A Dame to Kill For\" and it followed its source material swimmingly. This has a master class if actors, the standouts are JGL, Eva Green, Mickey Rourke and Powers Booth. Jessica Alba is at her best which is still only okay. Josh Brolin kicks ass as per usual. People complain about the continuity and that this movie is to over the top and gratuitous in every fashion but the fact is is that this is a comic book movie that embraces what it is and takes its Neo-Noir storytelling all the way. Its fun,  its bloody, its sexy and its soooooo bad-ass. If liked the comics and the first film you'll love this.\r Also The Hateful Eight teaser was beautiful.\r Score: 10 out of 10\rDimension Films, 102 min. Rated R"
    },
    {
      "rating": "1",
      "text": "Unlike the original Sin City, which I did enjoy, Dame To Kill For fails to interweave the various story lines into a coherent plot.  The film tries to build a moody, gritty, noir feel, at the expense of building any sensibility into the characters or sympathy for their various plights.   The justifications for the action sequences are ham fisted into place, and the visuals are at times laughably out of place, rather than stylistically atmospheric. Dramatic moments were made laughable by the lack of subtly, light hearted moments passed virtually unnoticed.   By far the worst movie I’ve seen in some time, first movie I ever considered walking out of, I wish I had."
    },
    {
      "rating": "7",
      "text": "It only took nine years to get this sequel made, but Robert Rodriguez mostly succeeds. The film is ultra violent (Pleasingly so) and stylish however, it is not nearly as fresh and exciting as it was nine years ago. The actors do what they can and notable stand outs include Eva Green, Mickey Rourke, Joseph Gordon Levitt, and Josh Brolin as the recast Dwight. It is a good time spent at the movies and it does not run too long at 102 minutes. This film is not going to revolutionize film making, but if you like the characters from the original and are interested in what came before or after the events of the first film you won't regret giving this movie a shot this weekend."
    },
    {
      "rating": "9",
      "text": "This movie has been my most anticipated film for a very long time, I am a huge fan of the 2005 original for being so unique and the art direction took by Rodriguez and Miller. I admire Rodriguez for making the films shot for shot identical to their corresponding stories from the comic book series. The fact that Josh Brolin and Joseph Gordon Levitt starring in the sequel just made it even sweeter. It must be said as well that Mickey Rourke IS a badass as Marv once again and Eva Green gives a stunning performance as the manipulative femme fatale Ava Lorde. The story is made up of four stories. Two from the comic books and two original stories written for the film by Frank Miller. I found them all very enjoyable and the opening story, Just Another Saturday Night brilliantly set the tone for the film; very gritty storytelling and violence with a touch of humour from time to time. The majority of the cast give flawless performances ranging from Joseph Gordon Levitt's cocky gambler character to Josh Brolin's Dwight struggling with his past. Jessica Alba is the only weak link as expected but still gives a respectable performance as Nancy Callaghan. I only wish that Michael Clarke Duncan could have returned as Manute if he were still with us but Dennis Haysbert more than makes up for his absense and Jaime Chung is a sufficient replacement for Devon Aoki, and of course Clive Owen is absent as well due to the story taking place before Dwight has his face changed.\r In closing, A Dame to Kill For may not be for everyone because of it's over the top violence and style of storytelling but a large amount of people should find the movie enjoyable including the fans of the original. Please go see this so that there may be a possibility of a third in the future even if it takes another nine years."
    },
    {
      "rating": "0",
      "text": "If you like endless, rambling, insipid internal dialog, then this is your movie. If you like characters who are completely irrational, then this is your movie. If you like... I don't know... white blood? Then this is your movie.\r There are plenty of scenes where we get to see Eva Green nude. As enjoyable as that is, it's definitely not enough to save the movie. So skip this one. It is truly terrible."
    },
    {
      "rating": "1",
      "text": "If you want to see Eva Green **** throughout a movie in Black & White, then this is your MOVIE \"Sin City 2\"!!! Other then that if your a fan of the first Sin City, prepare to be very very disappointed and be out of $7 bucks and 2 hours of your LIFE!!! Because it's that KIND OF BAD and not the BAD in a GOOD WAY!!!\r Oh where to begin??? First off, I don't think Frank Miller really had a concept for this sequel, other then having him self inserted into mult - roles throughout this movie like he's Stan Lee clones of clones in a Marvel Movie about the Clones of Stan Lee cameo roles!!!\r As, CONTINUITY must be a word not used by Frank Miller or not familiar with i e, such as actors not reprising their same roles from the original Devon Aoki as Miho, Clive Owen as Dwight and I can not count Michael Clarke Duncan (May he R.I.P) as Manute but his character did get killed during the final shootout in \"Old Town\" in the first Sin City because they couldn't leave any survivors??? Right??? But leave it to that All State Guy to stay the day! NOT!!!\r And that's the thing about this movie, on one hand it wants to be a continuation from the first Sin City but also at the time not be!!! Such by adding non related material to the movie; Joseph Gordon-Levitt character \"Johnny\" who whole story arc had literally nothing to do with nothing with the movie but at the same time let's show Nancy Callahan going thru a deep state of depression over the death of Hartigan but then at the same time with no separation of the storyline throw in the back story of Dwight getting his face change episode!!!\r And I did I mention Jaime King plays both Goldie / Wendy on screen at the same time, knowing that Goldie was killed in the beginning of the first Sin City!!! WTF!!?!??! I mean, if your going to use character cameos from the first Sin City, then why not used Alexis Bledel as Becky, Benicio Del Toro as Jackie Boy or how about bringing back Josh Hartnett as The Man to explain his story arc to how he knew Becky in the final elevator scene then Johnny!!!\r No No No, must have said Frank Miller to that idea because that would have taken too much time being that it's been 10 years between movies to make this PIECE OF **** SIN CITY 2!!!!\r And for this Frank Miller, I say to YOU: STOP MAKING SEQUELS TO MOVIES THAT DO NOT NEED ONE!!! STOP RUINING MY MEMORIES OF SOME OF FAVORITE MOVIES THAT I HAVE COME TO LOVE IN SIN CITY AND 300!!! YOU NEED TO STOP DOING THIS TO YOUR REMAINING FANS!!! WAS NOT THE SPIRIT ENOUGH DAMAGE TO YOUR BRAND NAME???\r End of Line"
    },
    {
      "rating": "10",
      "text": "This sequel has all the elements to become a future cult film, giving a great and perfect exercise of styles in such adaptations , and Eva Green as the villain of the title is unsurpassed !!"
    },
    {
      "rating": "10",
      "text": "I'm shocked this received bad reviews. IMHO this was a very well done sequel. The artwork, the writing, the acting was all great. It's not often that a sequel is as good as it's original counterpart."
    },
    {
      "rating": "9",
      "text": "Very good movie and great follow up to the original Sin City ;)\rI rate it with 9 from 10, because I expected more story lines, but it is not big deal."
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●●●●●●●●●●●●●●●●●●,,,,,,,,,,........,,,,,,..."
    },
    {
      "rating": "9",
      "text": "This movie was not as intelligent as the first one, but it was more exciting and the special effects were an improvement over the first one. It deserved a better critical reception and it also doesn't deserve to be a box office bomb. Eva Green was incredible and so was Jessica Alba. Marv was great as always, although he was dumbed down compared to the first Sin City. Josh Brolin was good too, although not as good as Clive Owen was in the first Sin City. If Clive Owen had been in this one too, this movie would have been amazing. Powers Boothe was excellent.\r In summary, I was very satisfied with this sequel. It did some things worse than its predecessor but some things were improved. Overall I would say it was just as good as the first Sin City and I hope they can somehow make another sequel despite this one's poor box office performance."
    },
    {
      "rating": "6",
      "text": "I think it's pretty funny that people have such strong negative views about this film, what were you expecting? The REAL reality is that A Dame To Kill For is just as air-headed as it's predecessor and about as much fun.\r No, I don't think it's as good as the first film; the stories don't have quite the same narrative force or cohesion and the novelty value of Sin City's hyper-real storytelling is now absent, so we all know what to expect. Consequently the film doesn't really surprise in any way, the dialogue doesn't crackle quite as nicely this time round either, but the truth is that it delivers nice-looking and brainless entertainment and does it efficiently. The chances are that if you liked the first one you'll probably like this too. To those who think it's the \"worst movie ever\", I'm sorry but I think we all know that's utter **** Don't make me laugh.\r 6.4/10"
    },
    {
      "rating": "8",
      "text": "Great movie with lots of action and story though it jumps around the 3 main stories a bit too inconsistently. The ending could have been much better and longer by few minutes instead of just ending on a stupid bang. As if they didn't want to show us more gore for some reason."
    },
    {
      "rating": "10",
      "text": "I just don't get reviewers that profess to have LOVED the first one and can't STAND this one. Either they totally didn't get the first one, or they need their antidepressants adjusted. \"A Dame to Kill For\" is as much of a balls-out homage/pastiche of hard-boiled pulp fiction and film noir as the first one. Are they different? Sure. Is one better than the other? In my opinion, no. All I know is I watched both films with utter enjoyment, a stupid grin on my face half the time. And it's the best use of 3D I've ever seen. Truly. And I've seen a LOT of 3D movies. Watching smoke wrap through the air around Eva Green's body, or cards sail across a table into the audience, or Mickey Rourke smashing through a fence on a motorcycle, laughing like a maniac -- every frame is gorgeous. And for a medium based on moving frames of film creating the illusion of life, that has to count for something."
    },
    {
      "rating": "3",
      "text": "All style no substance. The film looked great but thats really were it ends. The story is EXACTLY the same in each chapter just as the first one. Characters are all dull and have nothing interesting to say and we learn nothing more about Basin City itself. It was just an exercise in excess, showing how much action they can but in each story. Eva Green is the only slightly redeeming feature.I would have thought that after ten years an actually story would have been brought to the table instead you just get three characters which are butthurt and need to kill. Whilst this is going on its just uninteresting mumblings over the top. Really poor effort considering the time they had. It gets a three purely based on its looks but that doesn't get you very far"
    },
    {
      "rating": "3",
      "text": "The best thing about “Frank Miller’s Sin City: A Dame To Kill For”, AKA Sin City 2, was that I got in for free, plus got a free popcorn and a free soda, all courtesy of The Gateway Theatre Loyalty Card.\r I had not seen the first “Sin City” so I was intrigued for about a half hour by the sparse use of standout color in what is basically a black and white film noir of the 1940s and 1950s shown as a combination of live, digital, comic book, pulp fiction and graphic novels. After the novelty of a slash of bright red across the lips of a black and while character wears off there was a little interest in the name of the actresses playing the female roles as most of the men are more ‘seasoned’ veterans, and recognizable, though even here one or two have face but not name recognition.\r Anyone familiar with the old movies, or books, like those featuring Mickey Spillane’s Mike Hammer or Dashiell Hammett’s Sam Spade or casts with Humphrey Bogart, Ida Lupino, Barbara Stanwyck, Lana Turner, Veronica Lake, Victor Mature, etc. will find their counterparts in Sin City 2. Every man is hard boiled and every woman a femme fatale. The main difference between this film and the old films are the amount of violence perpetrated not only by the men but more so by the women.\r Written and directed by Robert Rodriguez and Frank Miller I would love to know which one has the eyeball fetish! The production design by Steve Joyner and Caylah Eddleblute is outstanding as are all the other production assets such as costumes, hair and make up.\r With a cast including Eva Green, Jessica Alba, Bruce Willis, Powers Booth, Mickey Rourke (almost unrecognizable ), Josh Brolin, Rosario Dawson, Stacy Keach, Jaime King, Joseph Gordon-Levitt, Ray Liotta, just to name a few, plus a cameo by Lady Gaga, keeping track of who is who and trying to remember their real names will keep your mind off of the screenplay that is not at all original in any aspect of film making.\r There is almost as much nudity, frontal and rear, by both males and females, though there is a sense modestly, as there is violence. Killings are by guns, arrows, knives, hands, feet, cars, etc., all graphic and far from modest.\r The best/only way to see this movie is with a free ticket, a free popcorn and a free soda."
    },
    {
      "rating": "2",
      "text": "If you only care about visuals than this will be a good movie for you.  If you care about anything else this movie will be awful.  It has nothing going for it besides that single achievement.  Friends wanted to leave the theater in the middle.  The movie was so boring that I actually didn't mind the people around who pulled out their smartphones."
    },
    {
      "rating": "0",
      "text": "O bom desse filme deve ser so a Eva Green mesmo, porq a lady rata é um fiasco atuando."
    },
    {
      "rating": "9",
      "text": "A return trip to Sin City worth taking, provided you enjoyed the first one. It loses some of the surprises and freshness the first had because you know what to expect from the tone and content this time, but the stories keep things great. It's dark world and beautiful visuals that look like they were pulled straight out of a comic book means that fans won't be disappointed.\r Josh Brolin does a great job as Dwight before the face-change surgery. Doesn't do quite as good as Clive Owen did, and he makes the character feel different than before, but still great. However it might be hard to notice as he gets overshadowed by the fantastic Eva Green. She nails her character bringing all the sex appeal and manipulative qualities required. Surprisingly I do feel she's naked too much. There are scenes where it makes sense for her to be naked, and she's got a great body so I'm not complaining about the view, but often more than a few of the nude scenes feel thrown in for fan-service. She's still great though.\r I'm amazed to say there's actually someone who steals the show from Green for once, and that's Joseph Gordon-Levitt. He's excellent as always and his plot was my favorite in the movie. If someone could and was going to steal the show from Green it would've been him, and he does despite her bare TNA and excellent performance. It's also great to see Mickey Rourke back as Marv even if his character just ends up playing sidekick to the others when they need some skulls busted. It still leads to some excellent violence though.\r Getting to see Alba's \"Nancy\" more involved in the action is also a surprising treat, although her plot does throw a few kinks in the timeline. I guess her facial scars just healed before Marv's plot in the first movie, which her plot in this one takes place before of. Still fun though.\r All around it's just another awesome Sin City movie. Not quite true noir, but takes enough cues from the genre in order to feel unique. Because of that we get some awesome narration. If you liked the first Sin City then you should like this. I don't see why you wouldn't, even if you don't see it as just as good. For me it was another unforgettable, awesome, dark, and blood-soaked trip back to the dark streets, and I loved every second of it."
    },
    {
      "rating": "4",
      "text": "\"I can't remember how I got here\" You might be saying the same thing by the end of this movie.\rTwo things: Director knows his audience and that audience is mostly men. Like 95% men.\rAnyway this is kinda like if you took all the color out of a gangster movie, added in some nudity, a pinch of mystery and a dash of magic. I guess that's what these comic book movies are all about anyway.\rEva Green is nude for about a good quarter of the movie (so, if you're into it, I guess it's worth the money) and Bruce Willis makes a solid return as well.\rJoseph Gordon-Levitt also plays a smaller role (his character might warrant a whole movie) as does Jessica Alba.\rYou could tell this was based on a comic book, with separate acts and focus points, with one-liners and crazy metaphors strewn about.\rIn summary, makes for a good guy's guy movie, but not much else. No real substance to plot, just a continuation of the first really. Rent on Redbox or Netflix when it comes out. Unless you liked the first one."
    },
    {
      "rating": "0",
      "text": "I know sequels are often an exercise in disappointment, but even my low set of demands and expectations was let down in this sequel. You will get literally nothing but sex and violence. I realize that must sound like a no brainer for anyone who got to witness the first movie, but trust me when I say finer qualities from the first movie are absent, even it's fine cast could not save it from being a sloppy mess completely absent of storytelling."
    },
    {
      "rating": "4",
      "text": "Warning, poor English ahead.\r Being a huge fan of both the original movie and the graphic novels, my expectations for this belated sequel were pretty high, even though all the cast changes and a bunch of not-so-great trailers didn't really paint a very hopeful picture.\rLong story short, Sin City 2 ended up being the first movie I ever walked out on. The distinctive visual style and excessive gore is there, too bad not much else is\r First off, central 'towering' characters like Marv (Rourke) or Manute this time around look surprisingly unintimidating & unimpressive at best or just plain ridiculous for the most of the movie.\rAnd since they both on screen for the good half of the movie time it made it that much more difficult to take anything seriously.\r The writing has taken a nosedive in quality too and you can really feel it during the newly added story segments by Miller (who somehow managed to write himself into the movie as 3 different characters just for the f**k of it) , especially the whole 'Nancy (J. Alba) turning super saiyan' story line and especially the cringeworthy final act.\r Talking about the good parts of the movie, Brolin turned in a really great and stand out performance as pre-op Dwight, even though the opportuinity to bring back Clive Owen (who played the same character in the previous movie) was missed as they decided to just throw in a wig on Brolin's bold head to somehow justify the character's full face surgery and called it a day. The same can be said about the main villain of the movie - senator Roark (played by Powers Boothe) who's as menacing and power-crazed as ever.\r If fapping for 40 minutes on Eva Green's prominent body parts is not your sole reason behind watching this sequel, I highly suggest you saving yourself a trip to the movie theater. Otherwise, you are setting yourself up for a one tedious, occasionally painfully bad and ultimately disappointing 90 minute experience."
    },
    {
      "rating": "6",
      "text": "This 2nd film adaptation of Frank Miller’s graphic novels is all about the style. The stories are set in an ultra film noir world of tough guys and hot femmes. It's mostly black and white with pops of color (usually for the women). Three basic stories play out: doomed love, hateful pride and bitter revenge. The stylized violence and illustrative visuals make for dramatic images. Even though it goes on a bit too long, director Robert Rodriguez has created a rich, moody place."
    },
    {
      "rating": "5",
      "text": "Better late then never, right?\r Well, maybe not. Sin City 2  isn't a bad movie by any stretch (although some will argue that) but it just leaves kind of an empty feeling for those who loved the first one. I mean, you still get the violence, you still get the lines, you still get that \"noir-ishness\" that made you love the first one. Despite all of that, there just seems to be an overlying feeling of \"why didn't I like this more?\""
    },
    {
      "rating": "6",
      "text": "I definitely preferred it to the first one but I didn’t think this was a particularly good movie and it definitely is not convincing me to go back to buying Frank Miller comics or even going in to the Sin City franchise.  I will say I definitely came out of this film feeling a lot better than the previous one.  Mainly because it is mercifully a lot shorter than the first one and this is definitely one of the films that makes me think 3D is worth going with.  Though it still only manages to be a point above the other one and I still think there have been better films that have come out this year."
    },
    {
      "rating": "7",
      "text": "Something I would like to say about this movie is that it didn't do as well as the first one but for me it was really enjoyable and had a really interesting story, although most of the movie was spent on one characters story (Which was kind of disappointing) it was overall an okay experience."
    },
    {
      "rating": "5",
      "text": "This 2nd film adaptation of Frank Miller’s graphic novels is all about the style. The stories are set in an ultra film noir world of tough guys and hot femmes. It's mostly black and white with pops of colour (usually for the women). Three basic stories play out: doomed love, hateful pride and bitter revenge. The stylised violence and illustrative visuals make for dramatic images. Even though it goes on a bit too long, director Robert Rodriguez has created a rich, moody place."
    },
    {
      "rating": "0",
      "text": "¿Os acordáis hace ya 9 años, de Sin City?, es posiblemente una película que sorprendió tanto al público y a la critica, una película con estética visual muy de cómic, jugando con sombras, efectos de luz en blanco y negro, un repartazo y aderezado con una historia coral de criminales y perdedores, en una ciudad corrupta y podrida hasta los cimientos. La primera película adaptó bastante bien y con bastante fidelidad los tomos de El duro adiós, La gran masacre y Ese bastardo amarillo, solo dejaron en el tintero el tomo de Mataría por ella.\r Lógicamente tras el éxito de Sin City, habría una inminente segunda parte a corto plazo, pero pasaron los años y no salía nada, ni una sola noticia, Frank Miller mientras saca ese ñordo de The Spirit, y hace unos meses nos empezaron a bombardear con imagenes, trailers, que dan a entender entre otras cosas, que Frank Miller ha escrito nuevas historias solo para el film además de llevar el tomo que les faltaba, si la primera película era una muchacha provocativa, sexy y brillante, la secuela 9 años después es el aborto impregnado de heces resultante de una incentuosa relación entre primos.\r Sin City 2, es una película que todo el encanto que tenía la anterior, desaparece y se reemplaza por una versión barata y cutre  de Sin City, primero tenemos una narrativa, que si en la anterior estaba contada de tal forma, que podías saber en todo momento cuando se situaba los hechos que te comentan, saltando al pasado y al presente sin producir ningún tipo de confusión al espectador que no conociese/ leído los cómics. En esta secuela, al tonto del sombrero y al puto loco de los cojones de Miller Rodriguez y Miller, se la sopla ordenar la historia de una manera que tenga coherencia y cae en el caos narrativo mas absoluto, provocando cosas como ponerte en situaciones que simplemente desconciertan al espectador. Las tramas, exceptuando la trama de Ava Lord (Segundo mojonazo que se mete Eva Green este año)  y Dwight (Mataría por ella), que es la que mantiene un mínimo de coherencia, pero las otras historias aparte de innecesarias son terrorificamente malas y que no llevan a ninguna parte. La trama de Joseph Gordon Lewitt es una historia que es tan irrelevante, tan de relleno, que la sustituyes por 20 minutos de anuncios y no notas la diferencia, la trama de Lucy (Jessica Alba), esta bien que hayas cerrado tras casi 20 años que la hiciste, pero a ver...TONTO DE LOS COJONES, ¡SI VAIS A HACER ALGO NUEVO, FÍJATE EN QUE NO SE CONTRADIGA CON LO ANTERIOR!, SOBRETODO SI SALE UN PERSONAJE QUE EN ESE MOMENTO ESTA MUERTO (Y NO DIGO BRUCE WILLIS) O ALGUIEN CON CICATRICES QUE TRAS LO SUCEDIDO EN EL PRIMER FILM, NO TIENE. Luego dicen de X-Men y sus problemas de continuidad...\r ¿La estética o al menos el reparto se salvara?. Ni eso, la película tiene un reparto de segunda regional, Bruce Willis esta ahi por estar, Rourke igual, ni siquiera Clive Owen repite el papel lo que provoca que la pelicula sea más desconcertante, Lady Gaga eligiendo papeles de mierda como ya le paso con Machete Kills, y luego la estética, no se si la pelicula ha tenido mas o menos presupuesto, pero que una película de hace 9 años, luzca mejor, es bastante preocupante, hay momentos que parecen las cinemáticas de un juego de PSX, y con un presupuesto de 7 duros y unos FX totalmente BARATOS ya ni siquiera se dignaron en currarse la violencia todo es supercutre, cabezas de maniquíes sin detalle, lefa sangre cutre, trajes que parecen del salón del manga de Matalascañas. En serio, la primera peli de Sin City esta mejor hecha que esta, y ¡tiene casi 10 años!\r Sin City: Una Dama por la que matar, es una verdadera vergüenza, chapucera, incoherente e inconexa. Rodriguez hundiendose cada vez más y Miller ya nos desmuestra que si en comics tocó fondo, ya cinematograficamente esta muerto y enterrado."
    },
    {
      "rating": "5",
      "text": "Bare **** and waggling ass, I couldn't believe I watched this on cinema. Sin City: A Dame to Kill For is a series of several short stories that loosely correlates the characters. Just like the prequel, the movie is almost completely in black and white, excluding some notable details. This noir comic inspired look director Frank Miller's signature look is undoubtedly unique. The stars are aplenty as well, however the movie unfortunately ends up being corny, ludicrous and hackneyed. It strikingly resembles 300 : Rise of An Empire, in which there's more sex and less content in a sequel.\r The story is done in old fashion crime thriller style, and it’s mostly a continuation of the first Sin City. The long gap between the movies could alienate some viewers as some of the plot or characters may not be familiar to them. Regardless of the interval time, stories from this movie are not nearly as engaging. The culmination is a rather boring stroll through the city as characters come and go, but none of them brings any appeal aside from flashes of **** or **** wrapped in leather strip. This is odd since the cast consists of great actors and actresses.\r With Josh Brolin, Jessica Alba, Mickey Roarke and lots of others talent, this should be a captivating tale of a corrupt city. Yet, each story appears pointless. It’s hard pressed not to wish for it to conclude and for the next one to begin only to be disappointed with the same bland effort. Characters don’t stay long enough to make an impact, don’t have any attraction or simply underutilized. Script is highly stylized with everyone narrating like they are writing a novel while fighting and bleeding, what leisure time they have. It’s not entirely bad, but sometimes it becomes redundant and some of it can be easily translated to more visual performance considering the acting prowess of the cast.\r Graphic is exceptionally distinctive with deep focus on lighting and shadow contrast. It tries to bring the comic root, although at some scenes it just looks awkwardly unreal. Action is really silly, it reminds me of classic action or current Bollywood movie where the hero is suspended in mid-air while shooting. Decapitation and dismemberment are the norm, as well as display of unclothed bodies, and to the movie’s credit, these are quite exquisite bodies, so the Mature rating is indeed adequately deserved.\r Aside from the blood, gore, and nudity, there’s not much to Sin Cite: A Dame to Kill For. The plots are uninspiringly bland, but it does present more than one voluptuous dame. It’s an utter hot mess… a mess nonetheless."
    },
    {
      "rating": "6",
      "text": "Great characters. Great style. Great visuals. Tonnes of stylish ultra-violence that we loved in the first Sin City. Unfortunately let down completely by lack of a coherent plot. Sure, some stuff was going on, but it all felt a bit random. More like a dozen vaguely related events than an actual storythread. A massive shame, as the first was so good. They waited 9 years to release something mediocre. Unbelievable."
    },
    {
      "rating": "6",
      "text": "If you weren't a fan of the original Sin City, you won't like this one either. If you were a fan you may come off a bit disappointed. As a sequel there is more unnecessary gore, nudity, and over the top \"graphic novel\" style. Unfortunately this came at the expense of things like \"heart\" and \"cohesive storytelling.\" The story of Nancy (played by Jessica Alba) coming unhinged is the closest the story comes to having a sympathetic character. There were some interesting cinematic flourishes but in general they were under-done or poorly utilized.\rPerhaps if they'd tried to tell fewer stories we as an audience would have gotten more invested in them. Or maybe if the stories were tied together in some meaningful way instead of being seemingly random. Instead we get a story so focused on its neo-noir world that the characters end up flat. I wanted to root for Joseph Gordon-Levitt as the mysterious gambler, but his character was so generic that when (Big spoiler omitted) happened I had no sympathy for him at all. It seemed the logical outcome.\rAll in all this film is an alright flick. Certainly there is much worse out there."
    },
    {
      "rating": "5",
      "text": "Eva Green 10 out of 10, \"A Dame To Kill For\", yea right pull the other one. Emo Aguilera, NOOOOOO WTF.  MIho looked goth over ninja, Gail's bumper looked massive.The only cool part in this movie was Levitt. The rest of it was in dire repetition. A ride to be watched, but that was it. Entirely Forgettable ."
    },
    {
      "rating": "5",
      "text": "Even Eva Green can't save this tired, underwhelming and generally uninspired 9 years too late sequel to the original.\rRodriguez and Miller's comic noir project has lost its spark, this is clearly a case of diminishing returns.\rNone of the new stories feel fresh: the writing is poor, the violence has lost its shock factor and the new additions to the cast are seriously lacking in interesting characterization.\rAvoid."
    },
    {
      "rating": "5",
      "text": "Not nearly as good as the first one,its like they tried to hard.Acting seemed mediocre at times.If  you loved the first one as i did this one might be a real let down for you,the only thing that i enjoyed was the explosion  and some violence other than that its disappointing,And even having Eva green nude most of the movie isn't really a wow factor.The 3D aspect makes it a bit better but doesn't the movie make the movie worth it overall."
    },
    {
      "rating": "5",
      "text": "It's easy to see why the second installment of Sin City didn't do so well. Marv's make up was a bit dodgy, especially at the beginning, Not sure about some of the casting choices. Jamie Chung should have been a better choice for Miho, but she was unsure in a most of her scenes. Eva green, again, sexy but not feminine enough (too goth) for Ava. Josh Brolin, at least, was good. Jeremy Piven - good. A Dame To Kill For lacked a lot of the soul from the first movie. Improvements could have been made in too many areas for this film. That's why it gets a spectacular 'meh'."
    },
    {
      "rating": "3",
      "text": "Whatever happened to Robert Rodriguez? Where's the guy who knew how to make cool, witty films? This movie is so bad it feels almost like he's making fun of himself. Many of the fight scenes are just hilarious, and not in a good way. Though incorporating comic-y special effects could've been nice, poor execution just ruined it all.\rAnd why the omnibus style? Don't they know how to weave several stories together? It's not like there are so many stories that it'd feel too complex if you put them all together; there are three stories if you're generous enough to count Joseph Gordon-Levitt's as a \"story\". What I also don't get is why they had to introduce all of the characters at once including those whose story doesn't appear for another hour.\rThe writing is just so childish and superficial, which is ironical considering the film's \"mature\" look. The story is achingly one-dimensional, and the lines are so corny they could be used in a YA movie.\rTo sum up, this movie is visually nice but that's about it. It's amusing at best (as in I laughed at the movie, not with it). The original Sin City worked because of a mixture of things, but the filmmakers seem to have forgotten it all and focused instead on whatever looked cool to them."
    },
    {
      "rating": "3",
      "text": "This is one of the most beautiful movies that i will forever hate - The 3D effects in this film, especially in the beginning were excellent, at times it felt like augmented reality. Jessica Alba did a great job in bring Nancy to life it was like seeing the dance that you never saw in Sucker Punch - that's where it ends.\r The rest of the movie basically the story was boring, slow, flat, and in some ways insulting to your intelligence. Why would Miller or Rodriguez ever think this film was worthy to present to their fans is beyond me I really thought they would have done better - If you want to see some cool 3D then go see it at the theater -  but if you don't really care about 3D then wait for DVD or a Free night on VOD your not missing anything. http://scannerdrome.com/sdpodcast/"
    }
  ],
  "recommendations": [
    "thor",
    "elektra",
    "the_last_witch_hunter",
    "king_arthur_legend_of_the_sword",
    "pan",
    "inferno",
    "daredevil",
    "alice_through_the_looking_glass",
    "alice_in_wonderland",
    "bumblebee",
    "the_suicide_squad",
    "the_karate_kid_part_iii",
    "avengers_age_of_ultron",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "fantastic_four_rise_of_the_silver_surfer",
    "carrie",
    "hellboy",
    "aquaman",
    "dark_shadows",
    "kingsman_the_golden_circle",
    "indiana_jones_and_the_temple_of_doom",
    "maleficent_mistress_of_evil",
    "oz_the_great_and_powerful",
    "the_legend_of_tarzan",
    "the_magnificent_seven"
  ]
}