{"id": 1603, "title": "Sinbad: Legend of the Seven Seas", "starring": ["Brad Pitt", "Catherine Zeta-Jones"], "runtime": 90, "genre": ["Family", "Animation", "Adventure", "Comedy", "Fantasy", "Action"], "description": "The sailor of legend is framed by the goddess Eris for the theft of the Book of Peace, and must travel to her realm at the end of the world to retrieve it and save the life of his childhood friend Prince Proteus.", "releaseYear": "2003", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/nwD8sBSOpifIHqjz7APIkttcIFe.jpg", "categories": {"plot": 7.0, "acting": 7.8, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.125, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "Brad Pitt, Catherine Zeta Jones, Joseph Fiennes, Michelle Pfeiffer. You know I'm in for this. This is way better than Antz. I so glad I got to see this. This is a true adventure. 9/10."}, {"rating": "8", "text": "I thought this was a fun movie and I enjoyed it allot. Great animation, however the CG does feel a little out of place at times, but considering when it was made it is forgivable. Voice acting is pretty good, Pitt and Jones have some great chemistry and really bring their characters to life. Eris is utterly breathtaking. Her animation is just amazing. Overall a really fantastic film, that is not on par with the original fable, but I don't think it was meant to be. As a standalone modern animated full length feature it is very good and allot of fun."}, {"rating": "7", "text": "Sinbad is a perfect of example of why you should not always listen to the critics. Is this a great film by any means? No. While it may not be what the critics wanted, Sinbad is a fun little adventure film. It has likeable characters, cool monster encounter, and some fun action. I really mean that I am not nostalgic for this film because I only saw it once I am speaking sincerely. While it is a shame that this film does not have any more sequels may it is a good thing because we can remember Sinbad for how fun it was unlike Pirates, which had a good film or two but overstayed its welcome with convoluted story lines, lengthy films, and a bunch other stuff no cares about. While I am sad that Dreamworks no longer does hand drawn animated films they left behind some entertaining films to watch and Sinbad is one of them. While it may not be as enjoyable as Curse of the Black Pearl it is still a lot of fun and definitely worth a watch. Sinbad is a fun adventure film and a good way to end the 2-D era of Dreamworks’ career."}, {"rating": "6", "text": "without the plot and script, this movie would've been suffered. its not my favorite movie, but its good."}, {"rating": "6", "text": "Energetic and fast paced family film, very well animated and entertaining. Enjoyable for both children and adults. Fine story, colorful and well made."}, {"rating": "9", "text": "The animation is far superior than Disney! Its the best animation on the human form,they actually care about acting and motion and the drawings, none of that Disney, shoot them out quick to make a buck!"}, {"rating": "7", "text": "It's not that bad actually.I thought Sinbad had a lot of charming moments in it. The movie immediately sets up the villain and shows us the main character's motivation at the start. It never felt like it was dragging and nothing really felt pointless, aside from one point in the film that involves a huge bird that was still pretty fun thanks to the good animation. I thought the characters were likable even though not that much developed, and the dialogue was alright too.It's not really that memorable of a film though. The villain, while well designed, had very little screen time and the movie felt very short in the end, but it's in no way a bad movie. If it's on Netflix or comes on the TV, it's definitely worth a watch. Not great, but good success!"}, {"rating": "10", "text": "Превосходная приключенческая история. Сейчас увы таких очень мало осталось."}, {"rating": "6", "text": "Now to be completely honest with DreamWorks, this is the time before they went to completely CGI animated moves after seeing this failed at the box office and seeing the studio suffering money loss. Sinbad just keeps trying to be entertaining."}, {"rating": "7", "text": "This is a underrated movie. I loved the characters and the fun moments that happen. And while the plot is kinda dumb, it keeps me entertained, most of the time."}], "recommendations": ["peter_rabbit", "puss_in_boots_the_last_wish", "the_adventures_of_tintin", "megamind", "meet_the_robinsons", "the_croods", "monsters_vs_aliens", "despicable_me_2", "hotel_transylvania_3_summer_vacation", "my_little_pony_the_movie", "atlantis_the_lost_empire", "rango", "kung_fu_panda_2", "cars", "kung_fu_panda_3", "kung_fu_panda", "rise_of_the_guardians", "home_on_the_range", "hotel_transylvania", "rio", "the_lego_movie", "incredibles_2", "the_call_of_the_wild", "bolt", "sonic_the_hedgehog_2"]}