{
  "id": 133,
  "title": "Sing",
  "starring": [
    "Matthew McConaughey",
    "Reese Witherspoon"
  ],
  "runtime": 108,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Music"
  ],
  "description": "A koala named Buster recruits his best friend to help him drum up business for his theater by hosting a singing competition.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/b8UiFXwMrSXVTHM0fb2twl8uE8a.jpg",
  "categories": {
    "plot": 6.758620689655173,
    "acting": 7.235294117647059,
    "ending": 5.6,
    "soundtrack": 7.538461538461538,
    "cinematography": 5.0,
    "familyFriendly": 7.6923076923076925,
    "funny": 7.111111111111111,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The animation and visual look of \"Sing\" is excellent.  The story is simple, but not altogether predictable.  Not sure what the moral of the movie is, but I guess it would be to follow your dream no matter what.  If you're going to have a really simple story, then you should make the movie as funny as possible.  That's where the film fails for me.  I didn't laugh all that much.  It tries hard to be funny, and may succeed with small children, but not so much for adults.  The strangest part of the film is the Mom pig who creates an automated system for taking care of her large family while she is at rehearsals.  In a single night she creates a majorly complex auto feed, auto laundry system that would make NASA proud.  She needs to be an inventor, not a singer.  Not a horrible film, but could have been better."
    },
    {
      "rating": "7",
      "text": "After watching Despicable Me and Secret Life of Pets, Sing sounded like an interesting movie to watch. After watching Sing, I concluded that the movie was semi-decent. The story was interesting, the songs were good, etc. My problems with the movie was the fact that \"Dream On\" was played in the trailer, but it was not in the movie. That is annoying. The other problem I had was the plot seemed to go all over the place. It's a good family movie to see this holiday season, but do not expect it to be quality like Secret Life of Pets or Despicable Me."
    },
    {
      "rating": "6",
      "text": "An unfinished mashup of Cinema Paradiso with the (already overseen) formula of Kurosawa’s Seven Samurai, Sing feels uncomplete as a musical fable, to become just a showcase of music samples and good jokes. On the bright side, the music is enjoyable and the film does not even try to address social or political themes, which is absolutely not necessary."
    },
    {
      "rating": "9",
      "text": "This is amazing. One of the best animated features of 2016. The characters are so unique, and the plot, it's not all about singing, you know. That is exactly what makes this movie so amazing."
    },
    {
      "rating": "3",
      "text": "Sing is a movie that lures with the promise of being a modern day jukebox musical but ends up being a complete waste of time. Illumination was looking for another great hit since the only great movie they have been able to make was Despicable Me, but this wasn't it by long shot. It's not funny, unless you are two year old, and there are way to many characters to focus on. Thus every character in this film comes off as one dimensional and boring. with one exception, Johnny  the Gorilla. The only other good part about this movie is the ending scene which is when, shock of all shock, the characters actually preform full musical numbers. you see in the majority of the film we don't get full musical numbers just pits of the characters singing. Which, for a movie called Sing is a shame. In conclusion this movie is terrible if your looking for good Jukebox musical go check out Rock of Ages and stay far away from this pile of crap."
    },
    {
      "rating": "6",
      "text": "This movie was predictable and derivative. However, I enjoyed it. I liked the songs that they did, I thought it was genuinely cute. I was a little bit irritated by the giant plot hole, but other than that it was a very decent movie."
    },
    {
      "rating": "2",
      "text": "The only good things Illumination \"Sing\" gives us are: Good action, animation, and story basis.  Other than that, Sing is a rushed movie on so many aspects.  One being that the whole story changes because of something so stupid and unrealistic (an eyeball falling out of a lizards head), they should have put more thought into that. Another being that they use animals instead of humans, and they don't even act like Animals.  Disney's \"Zootopia\" at least follows the basis that they are still animals, even though they are basically human, they still have animal traits that have a roll on the story of Zootopia, Sing falls short in that.  The characters really feel bland and not interesting and hard to love.  Sing is one movie that is very forgettable and Illumination better pick up their act soon or just stick to Despicable Me, and even that they can't do.  Sorry, but Sing is not for me at all, and it's a very bad movie thats hard to even enjoy."
    },
    {
      "rating": "7",
      "text": "\"Sing\" apresenta-nos boas músicas e um maravilhoso elenco, com atores de voz incríveis, como Matthew McConaughey, Reese Witherspoon e Seth McFarlene.7/10"
    },
    {
      "rating": "3",
      "text": "This movie is a total fail of motivation, i would not see again even if it was given to me on DVD"
    },
    {
      "rating": "6",
      "text": "Sing relies too much on singing than going what's behind the purpose of the film. If there's like literally anything I have learned from this movie, it's that songs can easily get annoying throughout majority of this movie's screen time."
    },
    {
      "rating": "8",
      "text": "Sing is the best that Illumination produced from My Favorite Villano (better than Pets) and in my opinion one of the best animated films of the year. One can perfectly identify with the characters and the proposal is great entertainment for the whole family. The dubbing is fine, it could have been better with real Actors of Dubs. The best thing about the movie is the soundtrack and it makes you sing it. The bad: few gags and the predictable and full of clichés that is the plot (above the trailer tells you everything). Entertaining, it makes you laugh and thrill. A very good experience for the family."
    },
    {
      "rating": "9",
      "text": "A Touching and Moving Animal American IdolIn 2007, Christopher \"Chris\" Meledandri, the founder and current CEO of Illumination Entertainment, founds his own animation film production company after having been President of 20th Century Fox Animation and supervised and produced movies such as \"Ice Age\", its sequel \"Ice Age: The Meltdown\", among others. Three years later, \"Despicable Me\" seeps in worldwide movie show-times as a joyful, energetic and mostly invigorating feature film. Since then, the company has been rising, collecting recognition and purification which are credited to its works. With discrepant spin-offs, sequels, and original ideas, they've been working on providing an annual film, and while 2011 didn't release any new project, they challenge themselves this year like the major studios with two films filled with magic, spirit, and exultation. After \"The Secret Life of Pets\" of Chris Renaud and Yarrow Cheney, arrives the seventh one and the first animated musical of the Universal Pictures section. The factory shows clearly conviction deposited in its product, since it has been a pretty competitive year in the matter, and even story lines of this film have been outlined in other projects, putting it at great risk around to the unpleasant and subjective paradigms. However, there are inexplicably films of which you cannot hate, even though you know that something goes wrong, well this is the case.In a universe where humans are substituted by animals, it's ordinary to glimpse a giraffe jogging, a lizard talking or a zebra cooking. In this domesticated world is set Buster Moon (Matthew McConaughey), a koala owner of a fluctuating theater which is falling apart due to the almost non-existent income. He hopes to become a virtuoso host and rebuilds the theater, which his father bequeathed him; so announces a singing competition without restrictions or impediments, anyone who considers that can hum has the possibility of auditing in the proscenium. After a grueling knockout round, there are five shortlisted contenders to fight for the tempting award, a prize that has been altered by mistake. The finalists are intended to be a heterogeneous group: Rita (Reese Witherspoon), a housewife and mother of 25 piglets should be related a lover pop culture pig, Gunter (Nick Kroll); an egotistical and individualistic small mouse, Mike (Seth Macfarlane); a teenage elephant with stage panic, Meena (Tori Kelly); a young bouncer who wants categorically a different tomorrow from his family gives him, Johnny (Taron Egerton) and a rocker porcupine with an amorous deception, which impels her to emerge as a soloist; Ash (Scarlett Johansson). Around these plots, the story succumbs in well-known territories, however, it comes out unscathed thanks to the thoughtful and authentic connection with their characters; a story that finds its main propellant in the wonderful inspiration.In times where scrupulousness for accuracy and concentration for detail ruled in \"Zootopia\" or \"Kubo and the Two Strings\", many people consider that the film does not take hold in visual terms regarding its predecessors, placing emphasis repeatedly in the facial gestures scarcity and poor worked textures, however, contrary to what many declares, I encounter this one even more effective since they put the organic aside for going deeper in significant features for development, it should be noted that the above does not mean that the movie perishes visually, it's gorgeous on the essentials; but evidently dissimilar against its competitors. It's noteworthy that Illumination has joined the trend of concealing different easter eggs among its films in order to generate a kind of not confirmed interconnection among them, clearly highlighting the masks used by gorillas in the robberies, the iconic and unforgettable face of Snowball of \"The Secret Life of Pets\".Music is a vital issue, therefore they inject covers of 65 different artists, which ranging from Ariana Grande's low notes to the exquisite polyphony of Frank Sinatra. Katy Perry, Kanye West, Sam Smith, The Beatles, Beyonce, Lady Gaga and Nicki Minaj lead the melodic lists artfully personified, linked and adorned by particularly humorous circumstances. In addition to this, the film also conceived two own songs: \"Faith\", performed by Stevie Wonder and Ariana Grande and \"Set it All Free\" sung by incredible Johansson.The last card of the ascending study is an uplifting, noticeably touching and fertile in laughs reality show that will return you the hope of finding simple films with teachings so important. With animation standards of the seventh art in these days, \"Sing\" may not be an aesthetic pearl, but who longs for sensational animals and computerized voices when you have Taron Egerton singing to the dreams, to Scarlett Johansson as a mother and model or to Mathew McConaughey keeping alive the illusion of dreaming and fighting; any human being would swap one thing for other."
    },
    {
      "rating": "5",
      "text": "NO SPOILERS AT ALLSing is a bleh movie. It's a bunch of clichés in every sort or form wrapped together with pretty animation. The use of songs in this movie is just terrible; they use almost every overused song in movies out of the book. The song use is so terrible I was actually able to predict three of the songs that would play next! It's an offense to music and just barely not an offense to film. Just bleh."
    },
    {
      "rating": "10",
      "text": "In a world of anthropomorphic animals, optimistic koala Buster Moon (Matthew McConaughey) is the owner of a music theater, having been interested in show-business ever since his father took him to his first music show when he was a child. His assistant is a slightly senile green iguana named Ms. Karen Crawley (Garth Jennings), who has a glass eye (which pops out at times). Lately, Buster's theater is in financial trouble due to showing productions that have bombed, and his theater is in danger of closing down. Buster tells his friend, Suffolk sheep Eddie Noodleman (John C. Reilly), that he will try and save his theater from closure by hosting a singing competition, with the prize being $1000, despite having only random stuff in his briefcase.Buster isn't the only one in a crisis, as other animals in the city have issues of their own. Rosita (Reese Witherspoon) is a talented singer, but has given up her dreams of performing to raise 25 unruly children and is constantly neglected by her workaholic husband, Norman (Nick Offerman). Meena (Tori Kelly) has a great singing voice, but has severe stage fright, causing her pushy grandfather (Jay Pharoah) to pressure her to face her fear. Mike (Seth MacFarlane) is a street musician who plays the saxophone but doesn't make easy money, prompting him to threaten people into giving him cheap profits. Johnny (Taron Egerton) is the son of mobster Big Daddy (Peter Serafinowicz) who wants him to follow in his criminal footsteps, but Johnny aspires to be a singer. Punk-rocker Ash (Scarlett Johansson) is in a band with her boyfriend Lance (Beck Bennett) who is critical of her rocking style.While printing fliers for the competition, Ms. Crawley's glass eye causes her to accidentally print $100,000 as the prize money instead of $1,000. Before the fliers can be checked, they are accidentally blown out of Buster's office drawing lots of candidates around the city including Johnny, Meena, Ash, Rosita, and Mike. After holding auditions with a turnout greater than expected, Buster picks Mike, Johnny, Rosita, Ash, and a few others to be in the contest. Meena's stage fright causes her to bomb her audition, Lance is dismissed from the contest when he auditions with Ash, and Rosita is partnered with another pig contestant named Gunther (Nick Kroll) to be in a dancing routine. Soon enough, Buster discovers Ms. Crawley's error when Eddie shows him the flier, but instead of telling the contestants of the mistake and of the true prize of $1,000, he tries to get enough money for the promised reward.Convinced by her grandfather, Meena tries to get Buster to give her another audition, but due to some technical difficulties, she is hired as a stage hand instead. After some of the animals quit, Rosita, Mike, Johnny, Gunther, Ash, and (eventually) Meena are the only ones left in the show. However, their individual problems begin to hinder rehearsals, such as Rosita floundering in her dance routine with the glory hog Gunther, Ash suffering from immense heartbreak when she thinks Lance cheated, Johnny inadvertently letting his dad be arrested during a heist in the shipping lanes, Meena's stage fright, and Mike owing money to a mob of bears when he cheats in a card game. Buster visits Eddie to convince him to get his grandmother Nana Noodleman (Jennifer Saunders) to host the reward money for the show. When they visit Nana, she accepts their offer, but in a snobbish manner. On the day Nana Noodleman comes, the bear mob who Mike earns the ire from come and demand the money from Buster, but his suitcase is full of junk, leading the others to turn on Buster for his deception. Before Buster can face anyone's wrath, a glass tank full of luminescent squids shatters and floods the theater, evicting everyone from it. After Nana leaves in a huff, the theater literally comes crashing down.Homeless and crestfallen, Buster takes up residence at Eddie's house. News of what transpired at the theater hits the airwaves and Buster is ridiculed, further diminishing his confidence. The contestants visit him and try to cheer him up, but Buster is too despondent to listen to them, so they leave. Buster tries to earn his keep by opening a car wash, using the same bucket that his dad used to pay for Buster's theater. Eddie, unwilling to see Buster so miserable, reminds him of what Buster had told him before: \"Once you hit rock bottom, there's nowhere else to go but up.\"After hearing Meena sing in the remains of the theater, Buster's confidence is renewed and he reinstates the show, leading everyone (including Rosita and Meena's families) to come. Mike bails out when he learns that the prize money is omitted, but soon returns to show his stuff."
    },
    {
      "rating": "5",
      "text": "This singing competition takes place in a world inhabited by all types of animals, but there's no winner…just a group of contestants who each have a backstory. While the characters are sometimes charming and voiced by an all-star cast (Matthew McConaughey, Seth MacFarlane, Reese Witherspoon, Scarlett Johansson), the writing is bland. There's little genuine humor, but there is a touch of heart. On the other hand, there are LOTS of songs, some with spirited arrangements and good performances. While it's ultimately uninspired, there's an energy that propels the action. Plus, with almost non-stop singing and lots of pop hits, it never gets boring."
    },
    {
      "rating": "3",
      "text": "Not only did this production fail to be a musical, it failed to be a movie. It has 10-15 second segments of popular songs, without one full musical piece, and it has no soul. Not to mention, the moral implications of this film are questionable at best. What are they really saying?There's no real pay off. Nothing really that creative. This is \"America's Got Talent,\" the animated feature film."
    },
    {
      "rating": "9",
      "text": "So much fun. Very funny, the humour is distinctly British which may not appeal to all Americans. The voice cast is simply superb. Matthew McConaughey, after his great turn in Kubo and the Two Strings, gives another outstanding vocal performance. Tori Kelly and Taron Egerton are amazing. The music is tremendous, great selection. A lot of laugh-out-loud lines, one classic sequence (the carwash) and, surprisingly, it veres from very funny to incredibly moving. Great for kids and adults. Surprisingly, one of the very best animated films in a great year for animation - especially surprising coming from Illumination whose work I have never previously appreciated. A perfect Christmas film, warm hearted and kind."
    },
    {
      "rating": "10",
      "text": "Was dreading taking the kids to this. It was marvelous! We all enjoyed it. Wasn't expecting it to be so hilarious or so poignant. Lovely performances from the cast, they make you truly care about the characters particularly Taryn Egerton's sweet Johnny, Matthew McConaughey's hopeless optimist Buster and Tori Kelly's fragile elephant. Nick Kroll steals all his scenes. And a shout out to John C. Reilly."
    },
    {
      "rating": "10",
      "text": "Muy buena. Grandes canciones, mu buena animación. Hay momentos que hacen que te levantes de la silla a cantar.    .    .."
    },
    {
      "rating": "5",
      "text": "Sing offers a cheerful entertainment, blessed by a strong voice cast, but that is not enough to stop it's unbelievable storytelling, cliched characters and an undeniably thin plot."
    },
    {
      "rating": "10",
      "text": ".................................//...............././/////......................"
    },
    {
      "rating": "0",
      "text": "Nooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo"
    },
    {
      "rating": "1",
      "text": "Honestly one of the worst movies i have ever seen. The animation is bad you cant get attached to any character and the jokes are predictable."
    },
    {
      "rating": "2",
      "text": "Sing is one of the worst animated and worst film I've seen of 2016. The script is atrocious and only redeeming quality of the movie is the music... Scratch that Tori Kelly's and Taron Egerton's voice made the movie. Taron has come a long way and can't wait for Kingsman 2. I would give the Razzies to \"Sing.\""
    },
    {
      "rating": "10",
      "text": "I honestly really loved this movie. The songs were great, I enjoyed all the characters and their backstories, and the visuals were amazing. Ash, the Gorilla, and the mother pig won me over. Only issue I had is that there are a few answered questions to the backstories, and they need to explain were they are located"
    },
    {
      "rating": "10",
      "text": "It’s been said that the most powerful story is one that can be distilled to a single, simple, easy to understand idea. The more complex the idea the harder it is for emotional content to be connected to (or absorbed from) it. It certainly makes sense from a marketing perspective if not necessarily an artistic one; easily understood is easily sold.From that point of view, Sing makes perfect sense. Animate some current pop songs with anthropomorphic animals to add in some fun animation antics and sit back. It’s a similar idea to the one behind stuff like Glee and Pitch Perfect but with more dancing pigs. It doesn’t really make sense in any other way, but that’s not particularly a deal breaker.The big driver is diminutive showman Buster Moon (McConaughey), the world’s best worst theater producer. In love with musical theater since he was a child, Moon has been trying to make a go with his own theater for years but has come up with nothing but disappointment. On his last leg and with the bank threatening foreclosure, Moon has one last brainstorm – a singing competition that will both discover new talent and get the city invested in seeing one of their own make it to the big time.When a type-o in his competition flyer brings singers out of the woodwork, Buster is beset with more talent than he knows what to do with, including overworked housewife Rosita (Witherspoon), gangster-in-training Johnny (Egerton), brash lounge singer Mike (MacFarlane), wannabe punk rocker Ash (Johansson), and shy shower singer Meena (Kelly). But it will all be for naught if he can’t get them to gel as an act or get anyone to come and watch, something he’s never particularly excelled at.Simple ideas can have entertainment value and for all its lack of an animating idea (no pun intended), and when Sing does what it sets out to do, it’s a solid time. It basically has two things to offer and not much else. The first is well-cast and directed voice work, primarily McConaughey. Buster is an irrepressible spirit, endlessly optimistic no matter what obstacles are thrust in his path.McConaughey imbues him with a can-do spirit and joy to be doing what he loves that his perseverance despite his failure is both funny and believable. He also eats up most of the screen time as his co-stars are constantly balanced against each other in order to keep their own stories understandable (if not developed) and reflect more light on Buster. And sing their songs really well, which they do. Egerton is a particular find and could easily have a career as a pop star if he decided to give up the whole acting thing.Beyond existing to have a place for the voice acting to emanate from the characters, Sing doesn’t have a lot to offer. They are necessary evils for source music delivery and so that producers Illumination (Despicable Me) can practice the imaginative gag construction they’ve become so good at. From Buddy’s desperate attempts to fix his ailing theater to a very personal car wash, Sing’s sight gags are where it’s real innovation can be found."
    },
    {
      "rating": "6",
      "text": "Related media: There are no media related to this film.>What's it like?: It is like a combination of the backstage stories to reality TV singing competition shows such as American Idol and the written stories of TV series such as Glee, but with animals… much fewer animals than what was advertised in the trailer. It’s not original. Children and teenagers could be fooled into liking it due to its  numerous pop songs, but there is insufficient story and there are not enough good laughs. As a results, adults would find it middling.>Cons: >1. For much of the film, it seemed like there was nothing special going on and that the film was merely propped up by the numerous recognisable pop songs. The last 20 minutes was much better, but even then there were only covers of pop songs apart from one new original song. Even so, that original song was not memorable.>2. One would think that the film would cover the long story behind each season of a reality TV singing competition show, but the potential number of ‘contestants’ were chopped down drastically at the first cut, to just seven acts! That seemed too few and too lacking in variety and talents. It was as if there was insufficient budget to get enough famous voice actors to voice for the animals! >Pros: Cons #2 ends up being a master stroke. There could have been too many acts if the format of American Idol was followed. More is not always better. More could end up stalling the film by having one pop song come after another. With fewer ‘contestants’, the end of the film felt sharper and sooner, which is good. >How would the different age groups rate it?Children: Excellent.Teens: Good.Young adults: AverageMedium age adults: AverageOld adults: Average.>My rating: 3/5 (no half scores). Save you money and watch it on TV."
    },
    {
      "rating": "9",
      "text": "Sing from Illumination is my all time favorite animated movie in 2016, because it had a lot of energy, a lot of diversity, and mostly a lot of depth. The story was very richly colorful, the character were all very brilliant, the humor was mostly timely and the soundtrack was very awesome.My satisfaction score: 9.2/10"
    },
    {
      "rating": "1",
      "text": "This movie barely made me laugh. I saw this with my mom & autistic brother, & he liked it but I could tell he seemed bored throughout the movie; that's how I felt too. There's movies that are funnier & keep you engaged; this one didn't for me."
    },
    {
      "rating": "7",
      "text": "Though not a particularly original idea (CGI animals do singing contest) there are enough clever ideas and laughs in this film to make it easily worth the price of entry. Children will love it, and parents will relate to the characters as well."
    },
    {
      "rating": "8",
      "text": "Music is the key!It was one of the most watched trailer by me. Yeah, I liked the trailer and teaser, those beautiful songs and characters made me watch this film. Maybe because of that, I thought the trailers looked much better. I enjoyed the film, it had depth in characters than what I saw in the promotional videos. Though it is a simple story, and that worked so well.Its neither Disney or Pixer, but awesome. The good thing is the others as well getting there with par. It got nominated for the Golden Globe, but missed out the Oscars. A film for all ages. The musical is very common in animation, especially from Disney. This was a little different, a music genre. And the characters are the very special to this film to clinch the success.It could have been easily added to 'Zootopia' universe, since the two films are from different productions, that idea was ruled out. The selection of voice-over cast was excellent, particularly in the singing perspective. Recently Dwayne Johnson sang one for 'Moana'. I know the real life actors brought in for the marketing purpose, but anyway they all were so good.I liked a couple of tracks, but most of them are not original. Even the theme song from 'Zootopia' by Shakira had a small part in it. So this film is surely suggestible for anyone to try at any time in any mood. It only cheers, definitely worth spending time for it. Now bring it on a sequel. As per the latest news, they have announced which is going to hit the screen in 2020. That looks too long, I need it even before that. Meanwhile, you guys enjoy it if you'ven't watched it yet.8/10"
    },
    {
      "rating": "6",
      "text": "Вообще не смешно. Юмор СЛИШКОМ детский. Так же мультфильм не предлагает только ничего нового. Если бы не хороший саундтрек, то он был бы просто слит.."
    },
    {
      "rating": "8",
      "text": "Sing may be the most enjoyable film to come out of Illumination yet. Even more than the Despicable Me films. I know I gave criticism at The Wild Life for nothing happening whatsoever, but the reason for that is that it's executed in the most boring way out there. In Sing, nothing has been learned from Wild Life. The only difference is that the execution is much more fun. The story it tells is fun and witty, the animation is really good, and with the massive pile of characters, it's actually hard to pick a favorite. The only problem I have is that it constantly hops from one sub plot from another, which makes hard to focus on what's going on. It's even harder than choosing a favorite character. But despite the lack of focus on the story, it still passes as a fun movie."
    },
    {
      "rating": "8",
      "text": "I went into the movie knowing that I was going to love it but what I didn't expect however is to feel for the characters the way I did I loved momma pig and the koala bear the female porcupine and the gorilla I Laughed out loud at least twice and smiled the rest of the movie i loved it go see it you won't be sorry"
    },
    {
      "rating": "4",
      "text": "Well, I can certainly understand why the Golden Globes loved Illumination’s thespian-infested movie.​Based around something as universally understood as music, Sing seems to be an appropriate first-time directing effort by the duo Christopher Lourdelet and Garth Jennings (who directed live action before). The result of their hard work brings a passable accomplishment by the studio’s sixth ever full-length feature, even if no studio gamechanger nonetheless.The feature takes place in an unnamed San Fran-Los Angeles-esque city painted by Miami, home to many anthropomorphic mammals, reptiles, birds, primates, household pets, cephalopods, arachnids, and whales. We focus on six mammals: one a producer, five the lucky choices for his theater-saving singing competition. Plenty celebrity voices deliver occasionally terrific singing, although the minor roles’ unfitting voices draw back the overall quality. Surprisingly however, the anthropomorphic individuals’ subplots are all masterfully balanced in their yearnings on the road to fame and fortune:Buster Moon the koala (Matthew McConaughey) wants to keep the theater financially stable after his father passed down the torch. Despite being the lead, he is the least interesting cast member, more existing to vocalize the cliché morals. Though he still plays great off the more colorful characters, including his dimwitted senior secretary, Miss Crawly the iguana.Rosita the pig (Reese Witherspoon) wants to follow her passion away from her uncaring husband and twenty-five children. She soon meets unexpected challenges when the competition pairs her with an overly optimistic pig named Gunter. This widely marketed chunk of ham shockingly gets little stage time; and I should also mention how he flaunts an indistinguishable European accent exaggerated to the point of annoyance. The immature will worship him like Moccus, leaving adults to gag a bit while watching an overweight swine in a unitard stereotyping western culture.Johnny the gorilla (Taron Egerton) wants to escape his father’s criminal lifestyle, and follow his heart for the microphone. Boys across all ages will relate to this highly soulful musician, despite a phoned in resolution to his subplot.Ash the porcupine (Scarlett Johansson) seeks public appreciation alongside her boyfriend/musical partner. While her story feels relatively unengaging compared to the others, she still brings a nice voice, especially when her guitar strums electrify her quills to the point of showering out.Mike the mouse (Seth MacFarlane) needs the prize money to pay back a bear gang who see him as a tasty meal. His ratty account maybe could have benefited from higher stakes against the law; but it does not matter anyway, for this crude comedian providing the voice amazingly makes a tiny crooner so ruggedly lovable with some spice thrown in.Meena the elephant (Tori Kelly) cannot pursue her love for singing, as her glossophobia gets in the way, with no thanks to her arrogant grandfather. She has the most poorly balanced yet easily relatable experience for all the boys and girls facing a similar fear.Together, doubt gets conquered in a unified walk to fame and fortune. So who ends up winning the competition?It doesn’t matter! They are all too introspective to notice one another, as these well-rounded individual stories have zero interweaving amongst one another. In the end, Sing cares less about teamwork, and more about getting children to worship the most popular hits by Lady GaGa, Katy Perry, Taylor Swift, Carly Rae Jepsen, and everyone else out there (just stay through the credits, the list of songs used lasts over a minute). It doesn’t matter if the human artist singles are sung by cute little animals; accompanied by predictable fart jokes, evidence proves why this movie aims squarely toward kids with an affinity of music over rules, offering the parents nothing more than a few scattered chuckles to at least manage without booing the artist offstage."
    },
    {
      "rating": "7",
      "text": "Sing is another charming production by the new animation big shots in town, Illumination. It's story, following a koala bear trying to save his failing theater with a singing competition, is a wonderful film to keep everyone enjoyed. The characters are very interesting, especially Johnny the Gorilla, and the music numbers make the film even more fun. Surprisingly though, the film didn't quite live up to the mark in terms of story arc for its numerous characters or even in the humor department. Yes there were a number of funny parts, but after productions like Despicable Me and Minions, I had expected a little more amusment. However, the story is solid and this film is sure to excite every member of the whole family."
    },
    {
      "rating": "8",
      "text": "I have to say that I was wondering what to expect from the movie i knew that I was going to like it I was floored by how much I loved it I Laughed out loud and really felt for the characters I loved momma pig and the koala bear i even liked the girl porcupine and the gorilla this is a true movie for dreamers at is a lot of fun go watch it it's super fun and enjoyable"
    },
    {
      "rating": "7",
      "text": "Adorable, fun, and a movie that will have you tapping your feet and wanting to sing along.Animated movies will always have a soft spot in my heart. They warm my soul, make me feel like a child again, and usually always tug at my heartstrings. This movie combined humor, music, and love. Not a love story kind of love, but a deeper kind of love. It was smart, and it was smacked with stars–literally and figuratively.Everyone loves an underdog. If you say you don’t, you’re lying. Matthew McConaughey voices Buster Moon, a passionate koala theater owner struggling to make ends meet. He hasn’t had a successful show in years, he can’t pay his employees, and the bank won’t stop calling. In a moment of desperation, he decides to plan one last show, one that he thinks will save his theater and the Moon family name. A singing competition. He rounds up the last of his money as a cash reward and has his assistant, Ms. Crawl, to print out flyers for the event on the last bit of paper they have in the office. Ms. Crawl is a lizard with one eye, who seems to always be losing her fake glass eye, and while typing up the flyers for the event, she makes a grave mistake. What was supposed to read as a $1000 prize accidentally gets printed as a $100,000 prize.In the meantime, we have also met the rest of the main cast. They are collectively a group of talented singers, struggling living a normal everyday life all with the same passion: singing. We meet Rosita, voiced by Reese Witherspoon, a stay at home mother of 25 piglets. She longs for a life outside of staying at home all day, and her husband barely seems to notice her anymore. Ash, Scarlett Johansson, is a porcupine in a two person band with her egocentric boyfriend who tells her constantly that she isn’t good enough to be heard. Meena, a shy elephant with a voice that will knock your socks off, being voiced by Tori Kelly what more could you expect? Mike is a little mouse with a big ego. He sings on the streets and has dreams to live a lavish lifestyle, Seth MacFarlane couldn’t have been a better choice for this character. And finally, quite possibly my favorite character of the movie, a gorilla named Johnny, voiced by Taron Egerton. Johnny’s family is involved in a shady gang, and Johnny wants out. He’s too sweet for the lifestyle and just wants to do what he loves most–sing. But he won’t do anything to disappoint his father.They all enter the singing competition. There is a lot of different talent in the competition, as you see on actual singing competitions on television. Buster picks his favorites and the competition begins. Of course, then he learns of the mistake on the flyer, and now has to come up with $99,000 for the prize money. Now, without giving away any major spoilers for the movie, that is all I can really report on, but it is worth the money to take your kids! They’ll love it and so will you.This movie is truly enjoyable for people of all ages. It has enough depth that parents or older siblings, or just adults like me who love children’s movies as well, can watch and not be bored. The kids will love the different animal characters, and they’ll love the humor. It’s cute and fun, and it will make you laugh. There will be moments you feel sad. It teaches valuable life lessons for people of all ages. And the ending is perfect. No story line is left with a loose end."
    },
    {
      "rating": "10",
      "text": "Wow where do I start, sing is my favorite animation since lion king, it has a nice story, great voice actors and who wouldn't love a dancing German pig!"
    },
    {
      "rating": "10",
      "text": "I really loved this movie!!!! Good songs, and a wonderful cast, with actors such as Matthew McConaughey, Reese Witherspoon, and even Seth McFarlene!!! And Nick Kroll as Gunter, the lovable German dancing pig!!"
    },
    {
      "rating": "0",
      "text": "I Hate This: I Rate This: 0000000000000000000000000000000009000000000000000000000000000000000000000.1"
    },
    {
      "rating": "5",
      "text": "Sing has some mildly enjoyable bits and songs but is mediocre by any definition."
    },
    {
      "rating": "8",
      "text": "Definitely among the better animated movies of the past few years. I had always had big expectations for it, but I was still pleasantly surprised at how good it was."
    },
    {
      "rating": "7",
      "text": "Illumination Entertainment has made a number of films I definitely enjoyed, such as the \"Despicable Me\" series, and considering that I enjoyed \"The Secret Life of Pets\" despite initially thinking it would be terrible and dubbing it as just \"Toy Story with pets,\" I was very excited to see where \"Sing\" would take me. Ultimately, \"Sing\" wasn't a huge leap forward from \"The Secret Life of Pets\" thanks to its slightly all-over-the-place story, the somewhat unlikeable protagonist, and the fact that Illumination's trademark humor isn't really on display here. However, I'd be lying if I didn't say that \"Sing\" had some beautiful animation, great music, solid vocal performances, heartwarming moments, and other charming characters that helped keep it afloat. Sure, it's a flawed film, and it won't rank as one of Illumination's best, but \"Sing\" is still an enjoyable entry in the company's filmography, and it's definitely worth giving a shot."
    },
    {
      "rating": "7",
      "text": "Fantastic cast deliver the goods in a feel good animation that almost has a Muppet show vibes to it. The mediocre screenplay fails to move the needle past average but this was clearly made with love from top to bottom. Very enjoyable film with great songs throughout."
    },
    {
      "rating": "6",
      "text": "Sing is one of Illumination's best movies but it still feels retired and been there done that. American Idol Animal Edition is the best way to describe it. Many subplots all link to the fact that there's a singing competition. I think it's a little overload on the singing plot. It really blocked out many story elements that could've been great. Overall I think the movie is decent but it has many issues that tarnish it's good parts."
    },
    {
      "rating": "6",
      "text": "Overall the film had enjoyable parts. The best part was definitely McConaughey. With talent like this in the movie it should of been great but we got a film that was okay. The music overall was good and it has some funny moments but they were far in between. The performances are what keeps the movie afloat."
    },
    {
      "rating": "10",
      "text": "Times have changed. What seems to be more important in delivering an animation movie nowadays? The Disney brand? Big eyed animals or girls covered in digital makeup? The plot twist? Well, that's a great recipe... to build empty movies.Sing delivers an important element of storytelling almost every contemporary movie is forgetting: The story and character building.For those who watch more than 10-15 seconds of the animation knows this: The story is about a dream. About a individual who never gives up on its dreams, and get to change the life of the ones who are alongside with it. The song they sing at the end of the movie has something to do with every character.\"American Idol\"? Did the reviewers REALLY watch the movie to the end? The \"singing competition\" NEVER happens at the movie! People are really missing the point about this movie!The animation is really enjoyable to watch.Voice casting is just right.The character construction is fairy tale level.Verdict: 10/10. Don't watch it if you expect a glittering superficial movie with no real meaning to be."
    },
    {
      "rating": "7",
      "text": "Who: Matthew McConaughey, ScarJo, Ted, The Ghost of Stonewall Jackson, and a ton of other people you totally didn't know could sing.What: A fun kids film with a wide range of pop songs to back it up.Where: A universe almost exactly like Zootopia, but there's a lot more singing.When (Can I watch again): Whenever you have Elton John stuck in your head and you have to babysit some kids.Why: This movie has nothing on Pixar, but it's still a fun watch with catchy tunes."
    },
    {
      "rating": "7",
      "text": "This was such a cute little animated movie. From the opening aria through the grand finale, it was captivating and heartwarming. And, what about all those celebrities doing the voices? It's been a long time since an animated movie made me feel this good. Enjoy."
    }
  ]
}