{
  "id": 292,
  "title": "Sing 2",
  "starring": [
    "Matthew McConaughey",
    "Reese Witherspoon"
  ],
  "runtime": 110,
  "genre": [
    "Animation",
    "Family"
  ],
  "description": "Buster and his new cast now have their sights set on debuting a new show at the Crystal Tower Theater in glamorous Redshore City. But with no connections, he and his singers must sneak into the Crystal Entertainment offices, run by the ruthless wolf mogul Jimmy Crystal, where the gang pitches the ridiculous idea of casting the lion rock legend Clay Calloway in their show. Buster must embark on a quest to find the now-isolated Clay and persuade him to return to the stage.",
  "releaseYear": "2021",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aWeKITRFbbwY8txG5uCj4rMCfSP.jpg",
  "categories": {
    "plot": 6.615384615384615,
    "acting": 7.142857142857143,
    "ending": 7.75,
    "soundtrack": 7.6,
    "cinematography": 5.0,
    "familyFriendly": 7.846153846153846,
    "funny": 6.857142857142857,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I must say I am very confused by this movie's 7.9 user score rating. (Especially because Encanto, a much stronger movie, only has a 6.9) It's not bad at all, (in fact, it's one of Illumination's better movies) but it's not great either.The actors and animation are really good, as is much of the music, but it's dragged down by some pacing problems. A lot of the character drama is good in a vacuum but feels kinda rushed and glossed over in execution, which made it difficult to stay invested throughout the second act. Also, I wasn't really invested in most of the new characters. (I legit. don't know what people see in Porsha.)I think it's better than a lot of other movies with a 49 for their main score, it arguably deserves slightly higher, but a truly great movie it is not. Still, it's decent enough and worth a watch, especially if you liked the first one."
    },
    {
      "rating": "6",
      "text": "Perfectly okay.The music's good, the old characters are still likable and the third act is great, but there's a lot of glossing over shortcuts taken with the drama throughout the middle of the movie and I wasn't a big fan of most of the new characters.Still, not a bad time overall."
    },
    {
      "rating": "10",
      "text": "Great movie for the family.  We loved the first one and this is a great follow up.  We need more musical movies coming out."
    },
    {
      "rating": "10",
      "text": "It was much better then the first. This one actually was way funnier and way more enjoyable to watch."
    },
    {
      "rating": "10",
      "text": "I took my kid to watch this movie and I end up enjoying it more than I thought I would. The theater was having a blast too."
    },
    {
      "rating": "10",
      "text": "The critics must be dead inside. This movie let you feel a lot of mixed emotions... it's entreteined and teach you never give up, even of the world is against you.Come on critics... it's a movie made for Kids, not Shakespeare"
    },
    {
      "rating": "10",
      "text": "extreamly fun to wach, great animation and art, better choice of music then the first movie and a muuuch better story to back it all up."
    },
    {
      "rating": "10",
      "text": "A truly amazing sequel, huge line up and the music has stepped up hugely!Dunno what the hell critics could dislike about this!"
    },
    {
      "rating": "10",
      "text": "It was actually a lot better then I expected. It was way better then the first one."
    },
    {
      "rating": "10",
      "text": "I don't think I've ever written a movie review and I know how cliche that is to say, but man this movie was amazing. I went in to see this movie with \"meh\" expectations since I thought the first one was just okay. I am so glad to be proven wrong! I turn 18 in 3 days and I saw this movie in theaters with my 18-year-old best friend and my mom - all 3 of us laughed out loud at more than one point and I nearly cried during the scene with Clay and Ash singing with the audience. I'm not ashamed to admit that this is my new favorite animated film.I loved Johnny's arc in particular - Taron played him PERFECTLY, his emotions were so real. The conflict between him and Klaus and the immediate bond between him and Nooshy was so inspiring, and to see him flourishingly rise above Klaus's abuse in \"Sky Full Of Stars\"... I was bouncing in my seat and cheering him on. Of course, everyone else's stories were played out phenomenally, too."
    },
    {
      "rating": "9",
      "text": "Very bright, colorful, and so much better than anticipated. It was a joy for the family."
    },
    {
      "rating": "9",
      "text": "This is a rare sequel that improves on the original in almost every way. The plot is fast paced and doesn't slow down through the entire runtime, it is very good natured and heartwarming and you can't help but root for the crew of characters. There is a nice payoff at the end of the film, and some nice humour throughout. The soundtrack is better than the first film, and has some well known hit songs that are appropriately used in the film, they fit well with the animation and dont seem to be tacked on. The quality of the animation is really well done throughout, on second watch I spotted more details and enjoyed the film almost as much as the first time round.This is a really good film for all the family to watch and enjoy together."
    },
    {
      "rating": "8",
      "text": "It does a good job for what it’s trying to do,  a light hearted family movie.  The songs and animation were enjoyable and while the plot got a bit silly at points they touched on just enough real life problems to make it relatable.  I’m a little suspect on the moral of the story but the kids and I had fun."
    },
    {
      "rating": "10",
      "text": "So cute"
    },
    {
      "rating": "10",
      "text": "A fun loving movie that mixes music, emotional and fun all in one! Its definitely for the whole family and a good squeal that doesn't feel like it wasn't needed, the song choices were amazing and cast as usual was top notch, definitely worth a view"
    },
    {
      "rating": "10",
      "text": "Prefect Movie For The Whole Family to Enjoy. My Mom and I Loved the First Sequel Sing 2 was Prefect Excellent and Spectacular I Shoud Give 10 out 0f 10 Vote Because That's Movie Sing 2 was My Favorite."
    },
    {
      "rating": "10",
      "text": "This is a proper sequel from the 2016 movie only great for families and the Story and characters are not bad."
    },
    {
      "rating": "10",
      "text": "It's a really good movie kept my 3year old up until the end . And fun movie. If you like U2 music's you will love some of the remix and songs of them. End song of the movie gave me tears"
    },
    {
      "rating": "10",
      "text": "Another reason \"critic\" reviews are garbage. What an amazing movie. Animation, story, music, and entertainment value were top notch. Hard to fathom what they can do with animation nowadays. My daughter and I loved it."
    },
    {
      "rating": "10",
      "text": "Idc what anyone says but I really liked this movie and I thought it was great."
    },
    {
      "rating": "6",
      "text": "HeartwarmingGood movie to watch it with your kids and family. Great visual and animation, good voiceacting. Story... it's the same story as in Sing but in a bit different way. New goal, new town, but the same storyline that feels a bit boring. New characters also not so unique as original, old characters are the same and changes very little.Music and final show is still great and entertaining. I really like final show and see old characters, but don't think I want to watch it again."
    },
    {
      "rating": "10",
      "text": "One of the best sequel I’ve ever watched! It’s just, perfect, and all the songs inside, mind blowing! 10/10"
    },
    {
      "rating": "10",
      "text": "Don’t listen to the critics! This movie is a masterpiece! It’s the best movie of 2021 and that’s a fact. It will win the Oscars and golden globe."
    },
    {
      "rating": "0",
      "text": "Ladies and gentlemen, it’s official: an Illumination movie has received a rare average grade of “A+” from audiences polled by CinemaScore. This is such a sad day for humanity because it has shown us that audiences really will gobble up whatever cheap, lazy and uninspired but quote-unquote “visually appealing” animated slop that’s put in front of them. The bar for animation has now been set so low that this kind of worthless movie has been placed on the same level as Toy Story 2, Monsters Inc, Finding Nemo, The Incredibles, Up, Coco and Spider-Man: Into The Spider-Verse, (which all won an Oscar except the first, which won a Golden Globe), and The Lord of the Rings: The Return of the King, which won 11 Oscars, including Best Picture and Best Director. That is what the world has come to. I feel like I’ve been slugged in the gut 100 times. It just defies all explanation. It blows my mind right out of my skull, but not in a good way. I guess the only thing I can do now is agree with what Agent Smith says in The Matrix: humankind really is a virus."
    },
    {
      "rating": "6",
      "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."
    },
    {
      "rating": "3",
      "text": "It felt like the plot of Sing 2 existed to give the film an opportunity to squeeze in hit pop tunes rather than those songs being in the movie as a way to advance the plot. This is the film's biggest issue as the characters all feel one dimensional and impossible to connect with. The constant pop music also really took me out of the movie. At times it felt more like listening to the radio than watching a film. The animation is also extremely standard for Illumination as it fails to make any improvements over its predecessor in this vein. I laughed at a few of the jokes, but the comedy was generally very simplistic and underwhelming. Overall, this is a fine movie to watch with the family, but it certainly isn't up to par with the best animated films of the year(Encanto, The Mitchells vs The Machines, Luca)."
    },
    {
      "rating": "6",
      "text": "Sing 2 is a funny movie with a lot of heart. Animals. Song. Billie Eilish. It has it all. I wouldn't watch it again though"
    },
    {
      "rating": "8",
      "text": "Heartfelt through every layer of storytelling from animation, plot, song choices, choreography and dialogue. The fantastic voice cast bring it all to life and the direction is excellent. Got strong Muppet show vibes from this and had a lot of fun watching. Although brief, some of the scenes (like 1% or so) might be a bit intense for younger children."
    },
    {
      "rating": "9",
      "text": "Just As Amazing As It’s PredecessorWith new Likable and charismatic characters (Calloway, Porsha, and Nooshy in particular), Stunning animation, Catchy music, Strong humor, Terrific voice performances, And rich emotion, Sing 2 is as good as if not slightly better than it’s already fantastic predecessor."
    },
    {
      "rating": "7",
      "text": "Mais engraçado e mais divertido que o primeiro filme. faltou mais emoção ao filme, mas tem varios momentos bem comicos que salvam"
    },
    {
      "rating": "8",
      "text": "I really enjoyed this film sequel. I like how it sends up Simon Cowell type talent show judges and heartthrob type singers. The animals are quite likeable - it's funny to see a gorilla learning to become nimble on his feet!. I enjoyed the songs and the storyline was amusing and likeable. This is a kids film I quite enjoyed and didn't feel talked down to the audience in a patronising way, so yes, I'd recommend it."
    },
    {
      "rating": "6",
      "text": "Really a missed opportunity. After your first watch or even in it you will start to notice that the movie leaves you with strange questions that will never get answered. The emotional scenes were completely cut off, leaving the bland plot and few jokes on the spotlight. The whole story flashes with the speed of light making you just marvel at the oversaturated scenes without feeling something. If they gave more time for developing of the movie I think that they would have fixed the issues, but at the end of the day-business is business."
    },
    {
      "rating": "8",
      "text": "I really liked this movie,the one thing i didnt like is that there were some unnecessary songs but other than that it's a pretty solid movie."
    },
    {
      "rating": "7",
      "text": "ładna animacja i znane piosenki trzymają ten film - tak samo jak w pierwszej części. Poprawna kontynuacja czyli po prostu więcej tego samego, z usprawnieniami"
    },
    {
      "rating": "9",
      "text": "Although it did not manage to surpass the first, Sing 2 is a show full of good animation, a predictable but entertaining script and applauding musical performances."
    },
    {
      "rating": "7",
      "text": "Sing 2Familiar but different. Definitely not better than the first (except in the quality of the animations), but a lovely continuation with great songs."
    },
    {
      "rating": "6",
      "text": "The film is visually appealing, the moral of the story is good, fun to watch with family, and good for kids in this generation but the story is not as good as sing 1 from 2016. What im seeking in a sing movie is pop culture and yes what a suprise that this movie have good enough selected songs esepicially that grub hub ad song that we all hate a while ago but the song it's not as appealing as sing 1 does 5 years ago because the pop culture in it it's not enough. Suprisingly this movie is a good enough sequel not that good and not that bad usually sequel's have a bad reputation towards the original story like for example Venom 2, Finding dory, Cars 2, etc. Thank god they get rid of that little white mouse from the franchise i disliked him so much and they replace him with some new character's which is good enough, yeah i thinks that's about it im always feel neutral towards kid's movies nowadays because well were not kids anymore so we cannot experience that wonderful feeling of nostalgia with movies like this."
    },
    {
      "rating": "8",
      "text": "I really enjoyed the different dynamic of the show, also the variety of new music! It’s very kid friendly and a great way to get the kids out of the house for a bit :)"
    },
    {
      "rating": "10",
      "text": "Bruh this movie was so dang bad. What were they even thinking with this movie. Lmfao"
    },
    {
      "rating": "10",
      "text": "I usually never write reviews for movies but this movie is just a 10/10 :) i watched the first movie when it came out and i absolutely loved it, but this movie really knocked it out of the park!! I loved how we got to see how the characters grew and how they are able to overcome the challenges they faced throughout the movie. I love the overall message of the movie, to prove others wrong and to show that you can accomplish anything if you believe in yourself and know your worth. That inspired me :)).  I also LOVE the songs in this movie, ive had the songs stuck in my head for the past couple of dayssss and ahhh i dont think they are gonna go away any time soon. I'd really recommend watching this movie you won't regret it!! (this movie has also become my new comfort movie, its helping me with a situation im going through right now"
    },
    {
      "rating": "8",
      "text": "Not gonna lie this movie was great. I expected it to be cringe and to be like the first one... but instead I got something very different. This movie actually wasn't cringe like the first one. And the jokes made me laugh a couple of times as well. They also got rid of the mouse. Yay!(but I don't really mind Seth MacFarlene). There was still quite a lot of songs in this movie but they didn't bother me too much. The reason why I'm giving this movie a generous eight was because I thought it was funny, enjoyable and heartwarming at some scenes too. This is a situation of the sequel being way better than the original. Anyways, I really liked this movie. That being said don't make another one. This movie was really good, don't push it illumination."
    },
    {
      "rating": "6",
      "text": "A fun filled movie with music you'll love from every generation. While the plot is practically in the entire trailer, it is nice to see a return of these characters. Along with a few fresh faces that will be interesting to see flesh out when they inevitably do a 3rd installment.This would be a great outing for anyone 5 and up I was in a theater with real little ones and there was a sequence at the end of the movie that did frighten them , otherwise it is a decent movie to enjoy with the whole family."
    },
    {
      "rating": "0",
      "text": "This so bad,copied half part of plot from 1 part,1 part had no villain, BUT NOW! crazy wolf who freaking tried kill Mr.Moon,characters not disclosed,no more than 5 locations Conclusion:this is a mockery of the first part"
    },
    {
      "rating": "9",
      "text": "This movie really describes what is the meaning of a true family. And as long as you realize your wrong & want to make up for it, you can be the part of a family."
    },
    {
      "rating": "8",
      "text": "I stumbled on this show on Netflix one day with about an hour to kill. I was sucked in right off the bat and was late for my appt. Good story, good characters, great songs, funny, funny, funny. Liked it from start to finish. Now I'll have to backtrack and see the 1st movie Sing. As for the less than enthused critics? There is no accounting for taste."
    },
    {
      "rating": "10",
      "text": "Esta secuela de sing ha echo que sea aun mejor que la primera ya que conlleva muchas canciones y ademas con dos mensajes 1 aprender a seguir viviendo tal como tu ser querido quiso que isieras2 aprender que no necesitas a un experto para hacer algo dificil que tu quieras hacer ya que tu mismo podras acerlo por que tu puedes"
    }
  ],
  "recommendations": [
    "the_lego_movie_2_the_second_part",
    "rio_2",
    "rio",
    "happy_feet_two",
    "trolls",
    "the_lego_movie",
    "my_little_pony_the_movie",
    "ice_age_the_meltdown",
    "vivo",
    "trolls_world_tour",
    "my_little_pony_equestria_girls_rainbow_rocks",
    "hannah_montana_the_movie",
    "strange_magic",
    "frozen_ii",
    "alvin_and_the_chipmunks",
    "minions_the_rise_of_gru",
    "peter_rabbit",
    "uglydolls",
    "jingle_jangle_a_christmas_journey",
    "hotel_transylvania_2",
    "the_croods",
    "despicable_me_2",
    "home_on_the_range",
    "zootopia",
    "sonic_the_hedgehog_2"
  ]
}