{
  "id": 2054,
  "title": "Sinister 2",
  "starring": [
    "James Ransone",
    "Shannyn Sossamon"
  ],
  "runtime": 97,
  "genre": [
    "Horror"
  ],
  "description": "A young mother and her twin sons move into a rural house that's marked for death.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jLNUo05tEYaPMTmEoYTld8XYmOt.jpg",
  "categories": {
    "plot": 5.428571428571429,
    "acting": 5.043478260869565,
    "ending": 5.0,
    "soundtrack": 3.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 4.6,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Good horror movies are few and far between and good horror sequels are even more rare. I had my hopes up for Sinister 2 because I was really surprised with how much I loved the first one and I think it was by far my favorite horror movie so far in the decade, however, one of the reasons that I enjoyed the first movie so much was because of Ethan Hawke's performance and it was obvious that he was not going to return for the second movie. They did bring back the deputy sheriff (James Ransone) from the first movie as one of the main characters so at least it wasn't all completely new actors.\r One of the good things about Sinister 2 is that the story really starts to expand what we learn from the first movie, but there is just too much more going on other than the horror story and those other plot elements are not nearly as interesting. There is still lots of the old terrifying footage shot on the retro camera that I really enjoyed from the first film.\r James Ransone really didn't have the ability to hold down one of the leading roles either. He really wasn't good at portraying certain emotions without sounding really sarcastic. There were some elements of Sinister 2 that were nearly as good as the first but there weren't many moments in the film that were. I would recommend this for a big horror fan but I wouldn't check this movie out until it hits DVD."
    },
    {
      "rating": "4",
      "text": "Sinister 2 was a bit okay, but I don't see anything scary about this sequel that sometimes it gives great new ideas but otherwise the rest of the story is recycled somewhere. The cast is great, I still love Ethan Hawke. I felt that Sinister 2 is worn out and it should've been a decent movie. But I'd prefer Sinister 1 as my favorite time of horror movies I could watch right now. I think audiences (including myself) are going to be disappointed with this one. I hope there's not going to be another Sinister sequel, but it needs to take a break and probably just leave the original to where it stands. Wait for it on Netflix."
    },
    {
      "rating": "6",
      "text": "Lighter on the terror, thought the new cast sympathetically keeps the tension running.\r Sinister had a good premise and twist that separated it from ordinary horror flick. This also means it was relying on the mystery aspect that was revealed at the end. The sequel loses the luxury of having the paranormal riddle. Instead of completely rehearsing the plot it utilizes different perspective and personalities, then combines it with dreadful bits to make a terrifying spectacle.\r Resuming the events from previous movie, now Ex-Deputy (James Ransone) is trying to sever the haunting circle by destroying the houses it affected. Unfortunately, there's a new family of mother (Shannyn Sossamon) and two sons who occupies one particular house. They are in danger of repeating the same terrible fate as previous victims, especially the children.\r James Ransone is a much different lead than Ethan Hawke was, he's more timid and less intense, but he looks very decent which should endear audience to his valiant effort. There's good chemistry with Shannyn Sossamon who is a great cast for the mother role, just like in TV series Wayward Pines. The two are not the typical family or paranormal whiz of recent horror movies, and this gives the characters a sense of urgency.\r There are bits of usual investigation involved, but the main draw is the perverted twist on the children and the eerie clips they made. These short clips are like snuff movies from children's point of view and presented with old cryptic filter. It may seem a bit similar to that of first film, but they are dauntingly effective and much more diverse.\r The children themselves don't look menacing and often seem like superficial apparitions. Unlike the original movie which displayed them sparsely, their appearance here is overexposed. It may have worked if viewers were introduced more to the children or the child abuse issue was treated with more polished, although unfortunately there's not much depth on the youngling characters.\r For most parts the scare looks average, coupling a few jump scares and taking hints from creepypastas. It loses the steam towards latter end since it becomes a tad predictable and the ghostly kids are hardly frightening, however the characters are adequately presentable which should keep audience invested throughout the unworldly predicament."
    },
    {
      "rating": "4",
      "text": "despite having some interesting ideas sinister 2 is a very non scary horror film that is a complete copy of of the first film and is clearly just repeating stuff in the first film that people liked but in this sequel none of these things have a purpose in this sequel."
    },
    {
      "rating": "5",
      "text": "This movie is fairly hard to review for me, I adored the first one, it instantly became a classic in my books but this movie was...just... I don't know, It wasn't bad but it wasn't good, I suppose it was just alright and I don't really have anything else to say :/"
    },
    {
      "rating": "7",
      "text": "Was just as not good as the first one. More often than not, the scares in Sinister 2 provoke nervous laughter as opposed to a genuine sense of fear.  Bughuul actually popped up on a tablet at one point. The Super 8 scenes with the young Robert Daniel Sloan are particularly gruesome and the deaths in the film are ramped up to a much higher degree. It's clear that Derrickson is trying to position Sinister 2 as a possible replacement for Saw, especially if the level of gore is an indicator. But what Ciaran Foy needs to do is distance himself from these franchise horrors completely.  It's clear throughout Sinister 2 that he's polishing a turd as best he can, but isn't doing much for it. Let's hope his next effort, an Irish horror film set in the '60s, has better luck than this."
    },
    {
      "rating": "5",
      "text": "Though this film fails to reach the level of the original, I still thought the film brought enough new ideas to the table to make it watchable.  The videos did start to borderline on the ridiculous and the side plot regarding the father was just an excuse to kill a bad guy. Overall Sinister 2 is film you can wait to see on video.  C+"
    },
    {
      "rating": "2",
      "text": "When I had originally heard that there was going to be a sequel to Sinister, one of my favorite horror films, I was pretty excited to say the least. Then, early spring this year, the first official trailer was released. I suddenly felt less enthusiastic about the movie, but I still held on some hope that it could be a decent follow-up to the original, until I finally saw it tonight. I read the signs but ignored the warnings, and my punishment was an astonishingly disappointing sequel. Sinister 2 takes place some time after the events of the original film and follows Deputy So And So (that's seriously how he's credited in the film). He has become obsessed with tracking down murders and child abductions that could be linked to an ancient pagan deity named Baghuul, who coerces a child into killing their family and takes the child's soul. It leads him to a farmhouse near the site of a mass murder in a church which he expects to find empty. When he arrives at the house, So and So sees that a mother and twin sons have already moved into the house, and one of the twins is the subject of midnight show-and-tell with the ghost kids' kill tapes. From the first ten minutes, I noticed that something felt terribly wrong about this movie. Deputy So and So was nothing more than comic relief in the original film, and, outside of the big plot twist at the end, he can hardly carry more than a scene by himself, let alone an entire movie. While he is a generally likable character, Deputy So and So just isn't cut out to carry an entire film by himself. His character actually made the movie funnier than it was scary, and there was very little to be afraid of in this movie. If you've seen the trailer, and I'm not exaggerating, every single scare is spoiled in the trailer, and there aren't any surprises left for you. It seems like the filmmakers thought that showing Baghuul off as much as possible could make the sequel scarier than the original, but what made the original so terrifying is that Baghuul was just a shadow in the back of the tapes. You rarely saw him for more than just a glance, and it was scary as hell. In Sinister 2, however, you can practically count the buttons on his black overcoat because he's shown so profusely throughout the movie. Along with a ridiculously over-the-top abusive husband side plot, a weak script and bland direction, Sinister 2 is one of the biggest disappointments of the year for horror."
    },
    {
      "rating": "4",
      "text": "Sinister 2 is dumb, clichéd, and worst of all not scary. What made\rSinister good, was that it capitalized on it's opportunities to scare,\rand gave the audience what it wanted, horror. Sinister 2 abandons the\rapproach of the first film, and looses all horror, besides the few jump\rscares, the film isn't even remotely scary. The lack of horror, and\rpoor acting, leads to the film being very dull. The characters are\runderdeveloped, the film falls back on horror clichés, the story lacks\rany intelligence or depth, and there's almost no humor. So in the end,\rSinister 2 is a dumb, dull, clichéd, sequel that completely abandons\rthe things the original film did well, most importantly the horror."
    },
    {
      "rating": "10",
      "text": "I really liked it, primarily because of the following reasons:\r- interesting angle on the bad guys\r- eerie setting that works really well along with the premises (camera, radio etc.)\r- a nice mix of different horror-genres\r- the ending\r- it scared the cr*p out of me\r Simply amazing horror-flick in my opinion."
    },
    {
      "rating": "6",
      "text": "There are a TON of terrible horror movies released in this era, but this is certainly not one of them.  Sure, there are some needless jump-scares, but there concept is sound, and it's sufficiently creepy without being gratuitous.  The lead actors are great."
    },
    {
      "rating": "10",
      "text": "I would re-classify this movie as more of a 'Thriller' than 'Horror' movie.  Think of it that way and more of you would enjoy it! I know I did!  Some of the children were more creepy than others, but overall it was good."
    },
    {
      "rating": "10",
      "text": "Honestly, I loved the movie. I really connected with the characters and they were all well developed. Couple this with a 'tension' filled environment. It is a worthy sequel. Do not listen to the critics."
    },
    {
      "rating": "2",
      "text": "First one was great, this one was just AWFUL.  Even more of the cheesy kids, the best part of the first movie, the home movies, are presented in a non scary way and are just dumb for the most part.  Nothing scary.  This was TERRIBLE."
    },
    {
      "rating": "3",
      "text": "Talk about disappointment. While Sinister offered a cool, dark, indie, horror story, this sequel proves to be useless. Take into account that I'm a weasel in horror movies, but can actually have an appreciation for the good ones. Put simply, NOT a deserving follow-up. Even the actors, man. After having Ethan Hawke in the first one, I'd at least expected some quality performances. To end on a lighter note, it's not the worst horror film ever, but falls short from that list."
    },
    {
      "rating": "4",
      "text": "Just seen Sinister 2 and wow it was a giant piece of **** All the kid actors sucked, the writing was **** and it was very disappointing.\r I originally wasn't going to review this movie, because I think this review is late enough and I didn't want to talk about it since I'm working on other things that I have full interest in, but then I notice very quickly that those in depth reviews many take awhile to be finished and I always want to keep updated on Letterboxd. Right now I'm writing up another review that I want to talk about and that's the 2005 film called \"Caché (Hidden)\". I've been writing that review for almost six days now and it will up sometime this week."
    },
    {
      "rating": "5",
      "text": "THE BEST MOVIE(HORROR) I have ever seen!........................................................................................................................................................................"
    },
    {
      "rating": "7",
      "text": "The first Sinister introduced us to a interesting mystery and a creepy atmosphere, but ultimately fell short due to the fact that it never capitalized on any of that with anything scary. Sinister 2 might be even less scary. Outside of some unsettling use of a ham radio, all of the creepy factor is missing here. It even loses the original's seedy voyeurism.\r Despite that though I can't help but feel that this sequel is better than the original. It's just a lot more fun. No, it's not scary. We are treated to the same, predictable jump scares we've seen time and time again that we can see coming form a mile away. However the scenario is still very interesting. We may know the mystery, but even without the constant wondering about what is actually going on the plot can still manage to keep one invested.\r Part of this is due to the characters. They're a likable bunch played by talented actors. James Ransome returns as Ex-Deputy So-and-So in a plot that continues on from where the last movie left off. Despite being the previous film's comic relief character, he does well as the lead. He's still playing the same goofy character, and as a result there is a lot more humor this time around, but he's likable and brings a more human feel to this supernatural flick.\r I got invested in the plight of the mother and children on the run. No I wasn't always satisfied with what was going on onscreen, but I was entertained nonetheless. I went into this with zero expectations. The first movie was a disappointment to me and the trailers made this look straight-up awful. Imagine my surprise when I found a charming, amusing, although ultimately fright-less good time. It's a big, occasionally dumb haunted house. It won't scare you, and as a result won't satisfy your craving for a real horror flick, but will still provide some entertainment draped in the guise of a horror film."
    },
    {
      "rating": "2",
      "text": "Man did that movie suck major balls! I can't believe I hated it so much because I loved the first one so much. It was so cheap, just loud sounds, bad jumpscares, useless gore and clichés. The only kind of scary scenes is the ones where they litterally just re-did a scene from the first one."
    },
    {
      "rating": "1",
      "text": "Sinister 2 is a sequel to the surprise hit, however this film doesn't in any form resemble the word sequel. This \"Horror\" movie doesn't improve what the first one had in its creepiness, soundtrack and above all story-line; as at times this film story-line is all over the place.Overall, Sinister 2 will leave fans of the predecessor and horror fans alike disappointed."
    },
    {
      "rating": "6",
      "text": "Not nearly as mysterious or disturbing as the first film, but the story and character development was decent. If the horror/ creepiness was more refined, I could easily have given this film a 7 or 8."
    },
    {
      "rating": "1",
      "text": "A disgusting and dumb sequel to the original Sinister got me thinking: \"Why do we even need a sequel in the first place? I mean it was just fine with the original Sinister.\""
    },
    {
      "rating": "9",
      "text": "It's more like an 8.5. There were things that we're better in the 1st, and things that were better in this film. I really liked this film, and it's worth watching. It was scary and more disturbing than the first, and I loved the increase in violence and blood, but I wouldn't want a third film, even though I loved both."
    },
    {
      "rating": "1",
      "text": "Sinister 2 brings some things from the first film and unfortunately nothing works well and is not scary. A sequence serves to expand the original, not regressed it."
    },
    {
      "rating": "8",
      "text": "Deutsche Review - KritikDer folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden?Dann sind hier meine Punkte.Mein persönlicher Score = 80/100Mein User Score = 8/10Lohnenswert? = Ja!Fortsetzung erwünscht? = Ich hoffe es kommt eine."
    },
    {
      "rating": "5",
      "text": "There's actually a solid story at the center of this but it gets lost in slapdash scare scenes and a nonsensical, anti-climactic ending. If the movie had focused a bit more on the boys and especially the one's specific alienation from the abuse at the hands of his father, there could have maybe been something special here."
    },
    {
      "rating": "4",
      "text": "What's the most dangerous? The dark force or the evil father.\r The first film was good, I enjoyed it, but not scary. So a sequel was expected and it failed to live up to the standards of the original. I would say, it was a decent horror film, with more story and drama than the creepy atmosphere. One character retained from the previous and the core theme remained, but tried a different method of narration. Something like 'Goodnight Mommy' with two brothers and mystery events surrounding them.\r It definitely lacks what a horror film required the most, and predictable too. But the story wise, it was decent, because the actors did a good job. So it is an average film. I expected a better ending and it did not conclude at its best leaving me disappointing. The way it ended might have been the suitable for the story, but I wasn't impressed. Again, another sequel is most certain, so I think this tale is not over yet and chances are very high that the story would follow with the same cast.\r It was not a bad flick, but not a follow-up you would have wanted. If you're looking for a genuine horror film, then you should skip it. There's nothing brilliance to appreciate at any level. Overall, I too felt it should have been better in some places. So my advise is if you forget its genre and try to enjoy that you're watching some movie that you don't know its category then surely would have a decent time with it.\r 4/10"
    },
    {
      "rating": "6",
      "text": "It's really not that bad. Yes the cop from the first movie is a lead in this one, and I know he sounds sarcastic, but it makes the movie kinda funny. This is a brainless sequel that is simply funny. Ghost kids trying to get one of the brothers to watch their stupid home videos was hilarious. The clips themselves may scare young kids but it comes off as comical. I won't spoil any of the clips, as you should just watch the movie once with a couple beers. The demon is shown much more in this film, only to jumpscare the viewer mainly. I definetly liked the Children of the Korn elements and the setting. Not bad 6/10"
    },
    {
      "rating": "3",
      "text": "Sinister 2 is one of the worst horror films I’ve seen in a while, and the first horror film that has actually had me bored and not even in the least bit jumpy towards the last section of the film.\rSinister 2 follows up from the previous film with the deputy that helped  Ellison Oswalt investigating the murders conducted by Bughuul, and to keep things short and snappy his investigation ends up leading him to the next victims.\rNow the horror you can expect from Sinister 2 isn’t anything special or well thought out, it is another amalgamation of jump scares just like almost all other horror films that come out nowadays. However, the infamous film reels are back on display in this film but – albeit being more inventive methods of killing – don’t seem to come across with the same impact or shock value as the first films reels. Nothing recreates that lawnmower reel or the creepiness off the hanging reel that goes backwards. Henceforth, the real horror is not the scares in this film; it is the script. The dialogue is cringe-worthy and excruciatingly painful that I burst out laughing at times. It quite easily could’ve been written by a pretentious 14 year old kid who writes scripts for his mum and dad, of which they tell him it is “very clever” and “brilliant” just to please the child.\rThe script is not the only horror show in display though as the acting is something that almost put the noose around my neck. The deputy was too goofy for the role and almost seemed to be making quips like as if he was in ant man or something. The mother was mundane and the children were just typical child actors. The abusive father was overacted and also – referring once again to the script – an unneeded addition just made for increasing the run time of the film. To be quite honest though, if they decide to make another Evil Dead remake (I know don’t reboot it again like Spiderman) that the deputy played by James Ransone would make a great new Ash.\rIf I had to be honest though I did enjoy this film, but due to the fact I ended up seeing it as a comedy. Some scenes are so stupid, some acting is so bad and some dialogue is so awful that you can’t help but laugh at it; especially at a certain car collision scene.\rHowever, this literally is the first horror film that has actually bored me. Insidious 3 wasn’t a very good horror movie but it still kept me watching and jumping from time to time until the end. Sinister 2 had me interested at first and then slouched and bored in my seat hardly moving an inch at the lazy jump scares towards the end. But with all that I can’t miss out the fact that this is yet another horror film with a terrible “cliff-hanger” ending. Why can’t we get good writers for horror films anymore?\rOverall, Sinister 2 is a bad and unintentional horror comedy that does nothing to distinguish itself from the grey colour palette of the current horror genre. And lastly, the “twist” was once of the most obvious and unimaginative things I’ve witnessed in a while. It added nothing, and didn’t even try to make itself cryptic.\r3/10"
    },
    {
      "rating": "6",
      "text": "I would say a fair job, of course not as good as the first movie...but it did a good job telling the story and picking up were the last movie left off. The story could have had more detail tying up the story better, but all in all a good flick.\r Oh, Ending could have been better....I hope for a sequel."
    },
    {
      "rating": "7",
      "text": "Definitely not as good as the first film, but just as eerie, disturbing and well shot as it. The plot is a little contrived, but that's alright because the overall creativity of this film overcomes its small list of cons\r7/10 good but not great add on to an already horrifying story\rMust see"
    },
    {
      "rating": "7",
      "text": "Is a normal for a horror movie. First 2 points go to production, visual effects and stuff. The monsters are well-done and sort of scary. 1,5 points to plot, it is the same from the first, but the first has a good plot. it maybe isn't original, but it is different than the majority of modern films. 1,5 points for actorship, some of them are good, some not, but the main actor's, the kids and the father's roles are very well made, but the main girl's isn't. 1,5 points go for \"doing what the movie is made to do\", it is not made to entertain Queen Elizabeth, it is just a jump-scare movie. Last 0,5 goes for originality, it is not original, just a copy from the last. 2+1,5+1,5+1,5+0,5=7"
    },
    {
      "rating": "6",
      "text": "Its not as scary as the first but it is does have alot more gore which i wanna praise them for cause it looked good and each snuff film segment were creative and different the only one i didnt like was the crocodile one due to the fact that they used CGI that just came out to look bad really bad. this movie (similar to almost every mainstream horror film now a days) resorts to jump scares as an attempt to spook the main stream audience. their is a sense of creepiness in this film that i also enjoyed. the characters were ok i loved the main character though his reaction towards everything going on in the film is very similar to the way the audience or just any regular guy would act hes no macho man."
    },
    {
      "rating": "0",
      "text": "Oh GOD!!!!\r Sinister is my favorite horror movie ever(or my favorite horror movie of the 21 century) and this is what i get to as a reward to love a great horror movie?!\r Yep, Sinister 2 is horrible, with bad story, bad dialogues and kids trying to act like scary ghosts. The thing that i really love in the first movie is Ethan Hawke watching the tapes, but, why did it get into a extreme gore level?!\r Sinister 2 has nothing, nothing to love or nothing to like, with a lot of stupid peekaboos coming from nowhere, horror cliches everywhere and nothing that makes sense. This sequel does not honor his predecessor and i hope Sinister does not become a trilogy.\r Hey, at least is not worse than Paranormal Activity Ghost Dimension ¯_(ツ)_/¯"
    },
    {
      "rating": "1",
      "text": "Far away, this sequel is too far left from its predecessor, I understand that the genre is not going through good times but this movie is the worst of the year, an absolute disappointment."
    },
    {
      "rating": "5",
      "text": "As I have already mentioned several times in other reviews, I see film sequels with some caution, knowing that many of them serve only to raise money from the public and do not reach half the quality of the first film. This case is just another one that follows that line. If the first film was very good and worked quite well, this one has turned out to be much weaker.In fact, this film repeats, with some nuances, the same formula that we saw in the first one, without the advantage of the element of surprise that worked very well the first time. Once again, we see a house haunted by Bagul, an evil entity that turns children into murderers of their own families. Again, we see an innocent family being victimized by this entity, while a retired policeman, whom we saw briefly in the first film, tries everything to save them.Ciarán Foy assures the direction whereas Scott Derrickson, who directed and wrote the first film, limited himself to signing the script this time. Maybe that's why the film is never as good as the first. It manages to create a tense atmosphere around the house and the evil that surrounds it, but the fact is that we already know what that evil is and what its capable of, so everything that follows is easy to guess. The film has its good moments, there are some scares that work well and make the film worthwhile, but in general it is much weaker.James Ransone was good enough in his role and is supported by Shannyn Sossamon, with whom he seems to collaborate quite well and create a convincing chemistry. Robert Daniel Sloan, given his age and inexperience, was very good, while Dartanian Sloan was weaker. At a more technical level, the film closely follows its predecessor, with an elegant and well-made cinematography, especially in the footage that reproduce the home movies. The soundtrack is very good, but it seems copied from the initial film, with slight additions."
    },
    {
      "rating": "4",
      "text": "This disappointing sequel pays no respect to the original, and is filled with lazy jump scares, bad child acting and ultimately just isn't very scary."
    },
    {
      "rating": "10",
      "text": "Amazing story and movie.A horror movie should be dangerous and frightening!"
    },
    {
      "rating": "2",
      "text": "Sinister 2 lacks the creepy, and eerie feel of the first film, in a way that is so severe, it makes you wonder how this script was ever green-lit."
    },
    {
      "rating": "6",
      "text": "Sinister was different horror experience for me. It had well written story, quality actors and a genuinely creepy atmosphere. Main problem with Sinister 2 was that story didn't have that suspense which made original different. Story was very simple. Also, the actors could have perform better. Director tried his best to setup the chilling tone but failed miserably. Overall, would recommend this to those who have watched first part."
    },
    {
      "rating": "7",
      "text": "Deputy from the first film stops a family from killing each other under the instruction of some creepy ghost kids because they now live in the house belonging to the writer from the first film."
    }
  ]
}