{"id": 4817, "title": "Siren", "starring": ["Chase Williamson", "Justin Welborn"], "runtime": 82, "genre": ["Horror"], "description": "A bachelor party becomes a savage fight for survival when the groomsmen unwittingly unleash a fabled predator upon the festivities.", "releaseYear": "2016", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/dAEodQQODOtOlhiQQTW7n1eS9ft.jpg", "categories": {"plot": 7.0, "acting": 7.2, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 8.5, "action": 5.0}, "reviews": [{"rating": "7", "text": "I loved the original short segment \"Amateur Night\" from \"V/H/S.\" This film is fun, but not as good as the original. The monster makeup and dialogue is not as good. Plus, the overall film feels more cartoonish and less real than the original.Not to say the film doesn't have its strong parts. Hannah Fierman steals the show again as Lily, both horrifying and sympathetic and always interesting. The main characters are more likable and relatable than the douchey guys from the original. Justin Welborn also steals the show as the charming but villainous Mr. Nyx. For a low budget film, the effects are also rather good.I would have actually given this a higher rating number, but  there was some stuff in this that left me uncomfortable. Don't get me wrong, this is a horror movie. I'm not expecting sunshine and butterflies, but I was not expecting some things that didn't happen in the original segment. It's like the difference between the person who watches \"Halloween\" and \"Last House on the Left.\" There is some sexual violence in the film and some other really messed up stuff at the occult strip show. It really detracts from the more humorous/schlocky feel of the film.Still, as I said on the whole the film entertained."}, {"rating": "10", "text": "This is one of those films that sticks in your memory due to it's unique premise, fantastic special effects and brilliant ending. The acting is great, there's some comedy thrown in and some parts of it are just deeply disturbing and unsettling. Some very interesting, original ideas at play here, a must-see"}, {"rating": "7", "text": "A silly and whacky movie that gets elevated by a fresh monster design. I honestly don't know why this is not labeled as horror/comedy. So yeah, the characters act pretty stupidly and the acting itself is not exactly mindblowing but mixing up the classical siren from Ancient Greek mythology with a succubus was pretty cool. I especially liked the toothy grin though I can understand if people found it to be cheesy. The CGI was ok. It could have been better but the whole movie had a low-budget feel to it anyway. I just wished they left the whole comedic part out! While I am not going to say it did not work at all, I would have preferred less lightheartedness and more suspense. So, I am giving it a weak 7 for the interesting monster idea. I totally would not argue with someone giving this movie only a 4-6 just for the story. Very understandable."}, {"rating": "4", "text": "Bachelor party goes wrong when brother/best man makes the interesting decision to accept a stranger's invite to follow him into the swamp to a \"secret\" club where the groom-to-be releases what is seemingly a sex worker from her locked room before she sprouts wings and starts stalking him and killing everyone else."}, {"rating": "5", "text": "Technically the picture had flaws, the grading was a little haphazard and there was noticeable digital grain on some shots where they pushed the camera to far. Sound was mostly excellent but sadly let down by occasional bad dubbing, this was barely noticeable though. The special effects looked excellent, subtle and effective, never looking digital or fake. Sometimes it felt like some effects were missing and the main girl wearing a nude suit was quite off-putting. Pacing was fairly solid, it was short and never really got boring. The acting was mostly good, with the only notable exception being the main antagonist man who overplayed it to the point of annoyance. I was surprised how much I enjoyed Siren (2016), it reminded me of a lesser version of Jeepers Creepers (2001) but it just missed out because it's so forgettable."}], "recommendations": ["antlers", "wrong_turn", "the_wolfman", "the_last_witch_hunter", "the_possession_of_hannah_grace", "underworld", "jack_the_giant_slayer", "goosebumps_2_haunted_halloween", "sinister_2", "clash_of_the_titans", "into_the_storm", "poltergeist", "it", "the_possession", "the_meg", "pan", "bloodshot", "oz_the_great_and_powerful", "the_ritual", "cube", "terminal", "ouija_origin_of_evil", "color_out_of_space", "dark_skies", "the_eye"]}