{
  "id": 3325,
  "title": "Sister Act",
  "starring": [
    "Whoopi Goldberg",
    "Maggie Smith"
  ],
  "runtime": 100,
  "genre": [
    "Music",
    "Comedy"
  ],
  "description": "A Reno singer witnesses a mob murder and the cops stash her in a nunnery to protect her from the mob's hitmen. The mother superior does not trust her, and takes steps to limit her influence on the other nuns. Eventually the singer rescues the failing choir and begins helping with community projects, which gets her an interview on TV—and identification by the mob.",
  "releaseYear": "1992",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xZvVSZ0RTxIjblLV87vs7ADM12m.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I just watched \"Sister Act\" in 2021 for the first time in 25 years.  I think I went into this movie with the wrong attitude.  I was really expecting it to be funny, and I just couldn't find more than 5 things to chuckle at.  \"Sister Act\" isn't a bad movie.  It has a lot of good things going for it, but I just wanted it to have more going on in each scene to keep me engaged.  You shouldn't hate it, but I can't imagine anyone truly loving it.  I give it a C - If you’ve already seen all of the A’s and B’s, but you insist on seeing a movie, try this one out"
    },
    {
      "rating": "8",
      "text": "Whoopi is simply electric in this and her performance in this cannot be understated. Its silly at times but its a sweet movie"
    },
    {
      "rating": "8",
      "text": "A good comedy with a unique set up and one of Whoopi Goldbergs most memorable roles. It is the story of the lounge singer Deloris Wilson. After she witness accidentally the murder of an informant by her gangster boyfriend she is in great danger. They had to silence her as prosecution witness as quick as possible. To protect her she is send to a catholic convent by the police and has to pretend to be a nun. I stop here to avoid spoilers. A great set up to a hilarious situation. The story is really good and interesting. The humor works well in this fish out of water situation. The cast is excellent. Whoopi Goldberg is remembered well for her good performance but I have to praise a lot of the cats too as I think all the nuns like Kathy Smith, Mary Wickes, Maggie Smith and the others gave a great and believable performance. Another strength is the soundtrack. It won me over while I do not like songs like this. Overall this is a comedy I can recommend easily. It has a good story, a lot of humor and entertained me from start to finish."
    },
    {
      "rating": "9",
      "text": "This is one of my go to movies when I'm feeling down. I remember seeing it in theaters when I was a kid and I just couldn't stop laughing. The movie isn't fantastically directed but Whoopi Goldberg owns the show with a fabulous cast of supporting players which include a hilarious Kathy Najimy (Hocus Pocus), an amazing Maggie Smith (Dowton Abbey), Wendy Makkena, Mary Wickes and a slimy but sexy Harvey Keitel (Bad Lieutenant). Goldberg starts off the film as a headliner of a 60s style girl group at a casino. She's secretly dating the casinos mob boss and she accidentally witnesses a murder. Suddenly shes on the run and than is put into a nunnery to keep her hidden until her court date. It's a bunch of fun mishaps that leads her to the choir and some truly outrageous musical numbers. It may be familiar but it's fun and heartwarming. One of my all time favorites.Budget: $31mDomestic Box Office: $140mWorldwide Box Office: $232m4.5/5"
    },
    {
      "rating": "7",
      "text": "It's very funny in parts very boring and wooden in others good attempt    ."
    }
  ],
  "recommendations": [
    "horrible_bosses",
    "wedding_crashers",
    "last_vegas",
    "my_spy",
    "the_proposal",
    "forgetting_sarah_marshall",
    "role_models",
    "just_go_with_it",
    "spy",
    "friends_with_benefits",
    "due_date",
    "masterminds",
    "meet_the_parents",
    "the_boss",
    "tower_heist",
    "just_friends",
    "17_again",
    "tammy",
    "grudge_match",
    "wanderlust",
    "central_intelligence",
    "dirty_grandpa",
    "hitch",
    "a_bad_moms_christmas",
    "bad_santa"
  ]
}