{
  "id": 3299,
  "title": "Sisters",
  "starring": [
    "Amy Poehler",
    "Tina Fey"
  ],
  "runtime": 118,
  "genre": [
    "Comedy"
  ],
  "description": "Two disconnected sisters are summoned to clean out their childhood bedrooms before their parents sell their family home.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hpvHqAiusQtGNDx48dA3z5ejjon.jpg",
  "categories": {
    "plot": 6.285714285714286,
    "acting": 5.0,
    "ending": 6.0,
    "soundtrack": 7.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 6.588235294117647,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "6",
      "text": "It has some good laughs and some generic ones, it's pleasant and diverting. Bobby Moynihan steals some scenes and Leguizamo deserves more work in everything!"
    },
    {
      "rating": "4",
      "text": "There comes a time in every actor's career when they stop trying to produce great material and just give in to the Hollywood formula becoming literal caricatures.  I think we're starting to see this in the work of Tina Fey.  Of course Fey did not write or direct this movie which explains the utter dreck we see before us.  The question then begs:  Why?  Let's hope this isn't the start of a complete sell out."
    },
    {
      "rating": "6",
      "text": "Tina Fey and Amy Poehler team up again (“Baby Mama”), but the character types are reversed. Fey is the wild failure, while Poehler plays the stable do-gooder. When their parents decide to sell their home, the girls travel back to clean out their rooms, but not before one final blowout. The flick is all about the snappy banter that bounces effortlessly between them, thanks to SNL writer Paula Pell, who manages to capture their style with sassy ease. There are some cheap shots and obvious gags, but the witty comments make them amusing. It’s a lot of it’s fun until about half way thru the big bash, when the mayhem stops building and just gets silly. Still, if you like these women and their comic chemistry (plus a healthy helping of enjoyable supporting characters), you won’t be disappointed."
    },
    {
      "rating": "0",
      "text": "Que pelicula tan porqueria deberian de sacarla. no me gusto para nada!!\r Sencillamente no sirve, me da coraje salir alquilar una pelicula tan baja categoria. '\r nada de comedia!"
    },
    {
      "rating": "9",
      "text": "And the winner of the Star Wars opening weekend?  Sisters!  Sure, both films are good, but the writing in Sisters buries the Force Awakens.  My whole theater exploded on so many occasions, it made my sides hurt. If not for just a couple of lulls, this might be my comedy of the year. Those two ladies have amazing chemistry, and the supporting cast is incredible.  Just go see it!"
    },
    {
      "rating": "9",
      "text": "As the CoS critic said, this is a huge step forward from Baby Mama.  Not that Baby Mama wasn't funny, but this is that movie times twenty.  Tina Fey and Amy Pohler are an excellent comedy team once again in this hilarious rendition of two sisters with very different personalities, and the hijinks they get into trying to have One Last Night in their childhood home before it is sold off.\rI recommend this for a fun experience, which will leave you laughing; and a few heart warming moments which will leave you with the warm fuzzies."
    },
    {
      "rating": "9",
      "text": "I may be biased, but when I hear Poehler and Fey are starring in a movie, I'm already sold. I was not disappointed as they were an excellent comedy duo once again in this hilarious story of two sisters with contrasting personalities. It's a comedy, so you should expect really silly dumb even unreasonable stuff to laugh at. It's also a movie, so of course it's going to be dramatic. Go into it with an open mind and you'll see the plot even has a solid heartfelt message! I 100% recommend this movie to anyone who is looking to go out and relax and have a good time. It will leave you laughing, both guys and girls as my entire theatre was in an uproar the whole time!"
    },
    {
      "rating": "10",
      "text": "Tina Fey and Amy Poehler are hilarious in the film Sisters. Fey and Poehler have there own type of comedy that one person is either going to like it or hate it.  I was open minded going in due to all the hype built up and came out laughing about it days after seeing it. I would go see this again, in a heartbeat."
    },
    {
      "rating": "1",
      "text": "\"Sisters\" stars Tina Fey, Amy Poehler Ira Barinholtz and Maya Rudolph in this film written by Paula Pell and directed by Jason Moore. This is not a good film, in fact, it’s one of the worst films Ive seen in a very long time. The chemistry and talents of Ms. Fey and Ms. Poehler deserve a better vehicle to display the obvious abilities these two ladies possess. What makes the situation even worse is that the entire film is an insult, not only to them but to the viewers who expected and were entitled to much more.\rSlapstick comedy, even badly executed slapstick comedy, has its place but crudeness without humor does not. Adding to the tumult and artistic anarchy are James Brolin and Diane Wiese who play the parents of the two sisters but, try as they may, they just aren't comic actors and their efforts fail as does the rest of the endeavor. The film is a disappointment to the viewers and demeaning to the performers which I guess sums up the whole  experience. I give the film a 1 rating and that is for Ms. Poehler who, in spite of it all, is the only person worth watching in this 98 minutes of theatrical discomfort."
    },
    {
      "rating": "8",
      "text": "When I hear that Poheler and Fey are starring in something, I will give them my money, and I was not sad to do so this time. This film is a brilliantly funny, with an excellent script delivered expertly. The pacing is good, the storyine engaging and I laughed till I cried on a number of occasions. An entertaining, clever comedy that is thoroughly enjoyable. 8.12/10"
    },
    {
      "rating": "9",
      "text": "Tina and Amy are like two comdey people in a pod. And Personsly I had hopes for this movies mostly likey this had its laughs and moments and this would go on my list of the movies on a friday night"
    },
    {
      "rating": "5",
      "text": "I love Amy Poehler and I really like Tina Fey and the duo have worked very well together in other projects including hosting the Golden Globes. Sisters is their newest collaboration and this film could have been so much better. Fey and Poehler's friendship behind the camera certainly contributed to good chemistry in front of it and they do provide some pretty solid laughs here and there but there are a lot of random jokes that are terrible. I found the supporting cast of characters to be really funny and at some points they were funnier than the two stars. I know I'm not really the target audience but I just didn't laugh as much as I would have liked. The other major issue that I had with this movie is that it is a movie that did all it needed to do in 90 minutes but its two hours. I'm not completely writing Sisters off because it may be considered funny to other people but I didn't like it as much as I thought I would."
    },
    {
      "rating": "7",
      "text": "Tina Fey and Amy Poehler produced & star in this sibling buddy film that highlights their position to imprint their own comedic stamp upon their product, and while not a classic, it plays as a smart and dryly funny romp through mindless themes & sight gags, that neither offend capriciously, nor fail to deliver on enough belly laughs to pass off as being above the standard straight to video fare, for its well cast, acted, directed & edited, albeit not deep exploration of themes of returning home to deal with a reunion of shared pasts colliding with the present."
    },
    {
      "rating": "7",
      "text": "If you give this film a chance, you might get yourself a good laugh. Sure is not as funny as some other films but it actually delivered good laughs and I didn't find it disappointing. That's basically all I have to say."
    },
    {
      "rating": "7",
      "text": "Tina Fey and Amy Poehler \"the female duo most fun on the world\"  return in a sisters comedy,  dissolving their attitudes to perfection in their different characters.\r Recently, in the cinematographic world, much is had speculated and decreed against the few opportunities in this big world of cinema for women in terms of roles, directors, producers and other jobs in the production of a film. The averages are alarming: 30,9% characters with lines of dialogue are women.19,7% are screenwriters, 22,7% producers and 6,8% are directors.  The reality is disturbing inequality of the feminine gender in this topic. Slowly, This fades with celebrities as striking as Melissa McCarthy ('Spy' - 'Ghostbusters (2016) '), Amy Schumer that breaks the stereotypes in any film or the same Tina Fey and Amy Phoeler ('Sisters') this  project written by a woman. The impact of this discrimination is imminent, programming ideas with women everywhere, something similar with what you want to achieve with the race of color after problems with the Academy Awards (#OscarSoWhite).\rThis work ('Sisters') demonstrates  the domain and extreme capacity that may have a woman in the world of the cinema comedy or any other genre.\r These two women come into their comfort zone to give us a story written by Paula Pell ('SNL'), centered at a crazy party carried out by last time in their childhood home.  Despite the poor and immature script, Amy and Tina manage to offer the best of them through a childish material. \"Sisters\" possesses a very striking face for marketing, stimulating to give a chance, said marketing worked relatively outstanding, reflected at the box office against its strong imposing (18, December, 2015),\r \"Sisters\" premiere without fear of his powerful enemy \"Star Wars: The Force Awakens\" providing a good alternative to (strange beings) who don't like lightsaber battles or the trio of Chipmunks doing mischief  \"Alvin and the Chipmunks: The Road Chip\".\r The characters which turns the story is Kate (Tina Fey) a girl disorganized, insurgent, unable to keep a job and totally promiscuous,  while Maura (Amy Poehler) is a nurse, divorced, wanting to live a crazy night and with a personality that is radically different from that of her sister.\r Parents of them, (Dianne Wiest and James Brolin) strangely, do not form essential part of the project, instead of this, they spend has be secondary characters due to the low integration within the film.\r Without a doubt, the film takes shape as soon as start \"Ellis Island\", a development lasting mostly throughout the film, an interesting preamble for an interesting progress. With some reminiscences of the Judd Apatow's comedies (Trainwreck) but better quality, Fey throws her best powers during the two long hours, much more than in her entire career, while Amy in the same way that gives its most eccentric touch to this story full of humour.\r The cast is completely fun and exciting, as a surprising John Cena already had seen in \"Daddy's Home\", Rachel Dratch, Bobby Moynihan, Kate McKinnon and others. Personally, I emphasize the interpretation of my friend John Leguizamo, seeing that a Latino - American has a chance at the American Film Company, and what better way that making his \"Ellis Sandwich\" with so famous, beautiful and talented Phoeler and Fey.\r All the comedy is so fun and caricature, which even more beyond the scenes loaded with oral elements (phrases and others) the face film is a simple and inexpressive funny scene from a complication of pronunciation that it not only shakes the audience, but up to the own cast.\r The introductory parts are well known, guests of the past, find people that environmental party, buy the necessary elements for the meeting, and a funny scene at the clothing store that burst of laughter even to the more serious (This scene, a key point of its classification R)\r As seen in the film's behind of scenes, the fun and excitement that the actors and actresses felt tremendously reflection on the product that the public saw. The stars duo performed one of their best work to date on the big screen but overcoming never done on small screen."
    },
    {
      "rating": "7",
      "text": "7.5/10\r Thanks to the impeccable chemistry between Tina Fey and Amy Poehler . Sister is an above average comedy that will entertain you and put a smile on your face."
    },
    {
      "rating": "10",
      "text": "I went into this movie thinking it was going to be awful based on the reviews. I was completely wrong! The movie is not drivel as some reviews have mentioned. It is a movie that allows you to sit back forget everything and laugh! I haven't seen such a good comedy in a long time."
    },
    {
      "rating": "0",
      "text": "I now see why Trump appeals to 30% of Republicans.  This was the worst pile of drivel I have seen in years.  To say it is sophomoric, at best, is a complement far above what it deserves.  Toilet humor, an hour and 1/2 too long.  I had respected these women for their intelligence and savvy.  Never again will I waste one moment or one dollar on one of their projects.  Shame on both of them for contributing to the dumbing down of the American public and shame on us for buying a ticket."
    },
    {
      "rating": "6",
      "text": "This was Tina Fey and Amy Poehler being Tina Fey and Amy Poehler. It was like a mashup of 30 Rock with Parks and Rec, minus the great supporting cast. Unfortunately, its the supporting cast that makes those shows.\r Still, there were a handful of funny moments and it was overall fine enough. See it if you like these two, but catching it on TV/the Internet will be fine."
    },
    {
      "rating": "1",
      "text": "Sisters is one of the worst movies of the year with Tiny Fay arguably the worst character of the year. An abysmal embarrassment on nearly every level."
    },
    {
      "rating": "4",
      "text": "i heard good things about the movie but it was barely funny overall, with the party scene taking up a big chunk of screen time. i think a better movie if dianne weist was in it more because was pretty funny when she showed up. 'Sisters' is nothing you havent seen before."
    },
    {
      "rating": "10",
      "text": "The film is good and with Tina Fey and Amy Poehler make it great. It's funny and intelligent, everyone should watch Sisters and see how cool and amazing it is."
    },
    {
      "rating": "4",
      "text": "The movie reminded me of when kids get together and try to appear macho by cussing and being the most crude. Every crude joke is taken to the extreme. Even the aging parents are not spared. Are we supposed to be scandalized when the two are just as crude as the kids?"
    },
    {
      "rating": "1",
      "text": "Sisters was a horrible movie, You think a Movie that Containing Tina Fey, Amy Poehler, and Stars who have made a living in comedy completely ruined the aspects of what a comedy movie is supposed to contain. I gave the movie 5 minutes, i hated the movie i walked out and it was a horrible example of what passes for comedy. I don't recommend this movie to anyone."
    },
    {
      "rating": "0",
      "text": "Was so disappointed in Tina and Amy's choice in choosing these roles! Way too old for the characters they played! Who wants to go to movies and hear such awful language? A big disappointment!!!! Act your age girls!"
    },
    {
      "rating": "0",
      "text": "Goddamn this movie sucked so hard. This movie was made for older Gen X women that look back on their earlier years and reminisce on their irresponsible party years. One of the worst movies of the decade, hands down. I probably chucked twice, the rest of the movie was just straight **** cringe.\rIf anyone thinks that this movie was \"intelligent\" they should be killed."
    },
    {
      "rating": "5",
      "text": "A movie that's actually better than seeing 3 dumb chipmunks singing throughout the entire movie, but exactly worse than another installment of Star Wars (which is completely botted... don't trust these people)."
    },
    {
      "rating": "6",
      "text": "Sisters    has    some    good    laughs, but   is    ultimately    too    long    and    takes    too    long to get   to   the   laughs."
    },
    {
      "rating": "5",
      "text": "“Sisters” follows an atrocious first thirty minutes with a watchable final ninety. The humour is hit or miss and the runtime should have been shortened."
    },
    {
      "rating": "7",
      "text": "What it is like to throw a grand teenager-style party at your 30s?\r Don't assume it's a high school party movie, but the big girls'. That's where everyone's are wrong and expresses their disappointment. For me it was a nice comedy, but not comparable with other great ones. It might won't work on teenagers, but there's no issue for adults with the open mind to enjoy it. A part themed movie for the grown-ups.\r From the director of 'Pitch Perfect' another woman oriented comedy. Both, Tina Fey and Amy Poehler were not that funny, hence not a rocking combo, but did not fail either and worked okay on this. They are the sisters with the opposite character. When they visit their childhood home, they decide to throw one final party before handing it over to the new owners.\r John Cena's cameo was excellent. In this chick movie he's the only one who gave manly appeal compared with the other men. The story was decent, but most of the movie was a regular party that goes wild. So expecting development of the characters or the story is silly. What I meant was, it is an entertainer, not a biopic or a documentary, so it delivers its purpose.\r 7/10"
    },
    {
      "rating": "6",
      "text": "The story and main characters in this film really got on my nerves.  Fortunately for the movie everyone else actually brought some laughs.  80% of the movie seemed to take place at a party and I found plenty of funny moments.  It wasn't the best, but it definitely wasn't bad either."
    },
    {
      "rating": "7",
      "text": "Sisters is basically what you'd expect from a film starring Tina Fey and Amy Poehler. It's not funny to a fault and it certainly does have some pacing issues; but overall, Sisters is an enjoyable, entertaining film in which I liked seeing the comedic chemistry between the two ladies. In a way it's kind of a family film in terms of the plot and stuff, but deep-down its a rated R film that sometimes may or may not go off the edge. (73/100)"
    },
    {
      "rating": "7",
      "text": "It was a fun movie, but nothing too impressive. If you liked Tina Fey and Amy Pohler in their tv series or other movies then you will enjoy this one too. I wasn't amazed or impressed too much, but it still was quite a fun movie"
    },
    {
      "rating": "6",
      "text": "A Seth Rogan type movie but with women.  Raunchy humor, stupid situations, so you have to be in the mood for this movie or you won't enjoy it.  I have to admit, I had some belly buster laughs."
    },
    {
      "rating": "6",
      "text": "Two sisters decide to throw one last house party before their parents sell their family home. Tina Fey and Amy Poehler are making a movie together? Awesome! Although, this movie wasn't awesome it was still a pretty fun time. It doesn't work too well as a comedy mainly this is sadly due to the fact that a lot of the funniest parts were in the trailer. But there is still enough substance for you to not feel completely robbed. This is obviously a given but Tiny and Amy's chemistry together was so believable and real that you don't feel like you are watching characters interact and humans instead. The comedic timing was a bit off. There are times where certain scenes were stretched out to such an extent that the punchline/joke just became annoying. There is one running gag that really annoyed me and it involved one of their friends from their childhood thinking he's funny and he kept making these painfully bad jokes. I usually love awkward humor but it just felt a little forced. But is this movie funny? That's the biggest question, will you laugh throughout this movie. Yeah, I had a good time with this movie and was bursting out laughing at times. In the end, Sisters was a good time! Some of the jokes feel flat and when they do, they do really hard. But, I didn't go into this movie thinking it would be the next Birdman. I'm giving this one a 6.5/10."
    },
    {
      "rating": "3",
      "text": "I feel bad for Tina Fey and Amy Poehler for having to remember the lines for this totally garbage script. They are talented actors and hilarious writers but they could not hold up this monstrosity on their own. Rarely do I turn a movie off but my god I could not get more than an hour into this crapfest."
    },
    {
      "rating": "7",
      "text": "Amy Poelher and Tina Fey's flamboyant chemistry perfectly balances each other ever since they became stars in Saturday Night Live. Both of them are sufficiently smart when it comes to comedy movies, and “Sisters” is the test of their chemistry as they work together as siblings. Fey plays Kate, an unorganized stylist who loses her job because of her temper. On the other hand, Poelher plays Maura, a recently divorced nurse, who is always there to be a helping hand to others.Party movies like this are easy to predict: drugs, having sex, high-tuned music and fight scenes, and Sisters takes that path in a different way. The punchlines and the whole premise work together to bring a good family-comedy which delivers for quite some time. Yes, some of the jokes do not work, but when it hits, it totally hits.70% of Sisters takes place in the party which feels overlong. Also, during the second half, it loses its focus in telling the more important parts of the story.VERDICT: Indeed some of the movie's punchlines did not deliver any laughs, but when the gags do come, they work as a treat."
    },
    {
      "rating": "6",
      "text": "Had high hopes for this movie on hearing the premise and that Fey & Poehler were starring. In the end it comes of as being a bit lazy and forced."
    },
    {
      "rating": "10",
      "text": "kamskmkihugugugjhjmmnnbbvvccxxzzaassdrffgyhhjjooiuuyyttrrewqqwellmhhyytdtfyguftesegfuggyuiokhtdgctshfhvggfdeergj"
    },
    {
      "rating": "8",
      "text": "abcdefghijklmnopqrstuvwxyznifraqweryipitssddghkljgssxccbnmngihiguftsyhovyhuchgtzghkbhvigxgyfgijojkhvhfghfi"
    }
  ],
  "recommendations": [
    "neighbors",
    "wanderlust",
    "blended",
    "blockers",
    "a_bad_moms_christmas",
    "hall_pass",
    "step_brothers",
    "friends_with_benefits",
    "forgetting_sarah_marshall",
    "tammy",
    "a_million_ways_to_die_in_the_west",
    "trainwreck",
    "last_vegas",
    "the_wedding_ringer",
    "17_again",
    "knocked_up",
    "night_at_the_museum",
    "little_fockers",
    "neighbors_2_sorority_rising",
    "the_40_year_old_virgin",
    "identity_thief",
    "funny_people",
    "rough_night",
    "just_friends",
    "the_change_up"
  ]
}