{"id": 2613, "title": "Six Days Seven Nights", "starring": ["Harrison Ford", "Anne Heche"], "runtime": 98, "genre": ["Adventure", "Action", "Comedy", "Romance"], "description": "When Quinn, a grouchy pilot living the good life in the South Pacific, agrees to transfer a savvy fashion editor, Robin, to Tahiti, he ends up stranded on a deserted island with her after their plane crashes. The pair avoid each other at first, until they're forced to team up to escape from the island -- and some pirates who want their heads.", "releaseYear": "1998", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/fzWrrCzRa16v51TXAUuT6Wendw7.jpg", "categories": {"plot": 6.647058823529412, "acting": 5.157894736842105, "ending": 4.0, "soundtrack": 5.0, "cinematography": 3.0, "familyFriendly": 5.0, "funny": 2.8, "action": 2.0}, "reviews": [{"rating": "9", "text": "Six Days, Seven Nights is a 1998 adventure-comedy film directed by Ivan Reitman and starring Harrison Ford and Anne Heche. The screenplay was written by Michael Browning. It was filmed on location in Kauai and released on June 12, 1998. The main character of this movie is named Robin and it is very curious because she finds herself on a desert island in company with the pilot Quinine, who had to catch her to Tahiti like Robinson.Their romantic story is at the heart of this movie. There two other characters who connect with the main two – Frank and Angelica.So there are two men characters – Frank and Quinine, and two women characters – Robin and Angelica. And such a set of characters is thought of as an antagonistic one.Sweetie Frank on the beginning of the story is Robin’s boyfriend. On first sight Frank is very romantic person. But it is deceptive conclusion. He is very pragmatic one, he is very gentle person, weak and dependent of company he gets on. His vision of life is stereotypical and that’s why he can’t understand that there is no different for lovers to be on tropical island or office when they love each other. His antagonist – Quinine do understand it. The dialog between Quinine and Robin when he says: They come here looking for \"the magic,” expecting to find romance...when they can't find it any other place. It's an island, babe. If you don't bring it here, you won't find it here; is the keynote, main message of this movie.So Quinine is rude, cynic, but the brave person and he had some sorrowful story on his past life.Frank seems to live in an illusory world where everything happens on time and place it has to – like in movies – for example, he sure that engagement has to estate on a such a romantic place like the island he took his girlfriend on.Quinine overcomes his best friend sell out and heartbreak that is why he found a better way of life, “Came out here, got a nice, little house on a beautiful beach. Got his plane. Doing what he wants to do. Got peace and quiet”.Quinine throws out the comforts of the big world where women wanted men who weren't afraid to cry, who were in touch with their feminine side (like Frank is).Robin is very decisive and conscientious person but while living in the big town she is treating with modern aberrations that’s why Frank is her boyfriend. But when she is caught on the desert island with Quinine she tells him that women like men mean and armed, all the more so when they're being chased by pirates (it is another detail of their adventure).Eventually, the adventure helps both of them to understand what they want indeed. Quinine realizes that his broken heart can love again and Robin understands that she wants to be with some real men not with a sweetie infantile person, who gives you away in severities.So six days and seven nights on the desert island rock the world of the main character of this movie - They fall in love with each other. They get a chance to meet each other and have an opportunity to crush their common-and-garden vision of life while stemming difficulties. They succeeded in making out of each other, they managed to get a sight of themselves. Lugowska"}, {"rating": "9", "text": "jkbugdtugibubononugtdryfugggihiggugugugugugugugigigigigigihihihihhguugugugguugguigugug7"}, {"rating": "5", "text": "The movie itself isn't bad, but \"Six Days Seven Nights\" is completely forgettable, average genre fare. And for the record, I found the chemistry between the two leads lacking."}, {"rating": "2", "text": "repetitive yet funny sketches..Six Days Seven NightsSix Days Seven Nights is a plot driven romantic comedy about two people stranded on an island and the bonding that the survival spirit brings along with. It is a feature that doesn't take itself seriously let along expect the audience to care for the characters and track. And such mannerism is visible and itches the viewers throughout the course of it. The humor is the only piece of land that the audience relies upon to survive in this plethora of cliches and shallow emotional drama. But they too are forcibly imputed which sometimes shucks away its one liners and addition to that the gags too are your typical ones that thrives on sexist and cheap jokes. The structure of the script too follows a rudimentary process that is frankly off putting and questionable to actor's choice on accepting such a job. It falls flatly on face on technical aspects like its amateur cinematography, daft background score, questionable choreography of all the physical sequences, blunt visual effects and loose editing. The camera work is almost like a prank with its unnecessary slow motions and benign execution that mocks even its most sensitive emotional drama with its chalky writing. Ford hits all the one-liners aptly with amazing comic timing with Heche being her equal match where she can be a threat to Ford's performance at times, especially with her goofiness. Browning's script was always redundant but it still had few laughs here and there and with an execution from Reitman, the anchor weighs in more. Few one-liners, repetitive yet funny sketches and hilarious performance from the lead couple are the high points of the feature. Six Days Seven Nights is a commercial feature that might be thoroughly entertaining but is also easily forgettable, even the performance that made the viewers survive."}, {"rating": "4", "text": "Beautiful to see, but with poor performances by the actors.Romantic comedies are often the poor relative of comedy. Almost all renowned actors have participated in at least one, and almost never go well or are successful. In this case we have Harrison Ford in the lead role, but he is undoubtedly in a role that seems to make him uncomfortable.The script is simple: a loving couple from New York decide to have a romantic vacation on a paradise island of Polynesia. But she works as a photographer for a women's magazine, and at some point is urgently required to do work on a nearby island, Tahiti. The plane crashes and she, and the pilot she doesn't get along with, end up trapped on a deserted island, leaving their respective boyfriends alone on the resort. Add some danger, some adventure, seduction and you're done. Simple and relatively effective.Harrison Ford is not very good at the role given to him. It's never funny and it's grosser than seductive. Either way, she performed fairly well, managing to collaborate well with Anne Heche, whom the script reserves the best comedy scenes and the funniest parts of the dialogue (especially when her character drinks or gets hysterical). David Schwimmer, unfortunately, can never be good. His character is just a good-hearted idiot with more money than intelligence. Jacqueline Obradors, meanwhile, had little to do. Her character is hot, pretty and dumb, and appearing almost naked and talking in a funny way is enough. In fact, despite being a romantic comedy, the movie bets too much on infidelity and vulgarizes treason.The best of this movie, no doubt, is the photography and the scenery, which masterfully took advantage of the light, color and magnificent landscapes of the Pacific islands. This makes the movie beautiful and pleasing to the eye. The humorous and adventurous scenes and the light tone and fast pace with which the story takes place also greatly help to make the movie enjoyable. But it's not a good movie for the family: it has seductive scenes and messages that are inappropriate for the family."}, {"rating": "10", "text": "There's damn few movies that I can watch more than once. This is one. You actually can identify with the characters, more than one of the characters. (Considering that there are really only four main characters, 2 male and 2 female, you are really surprised when you identify with both characters of your gender)."}], "recommendations": ["the_best_exotic_marigold_hotel", "the_intern", "a_simple_favor", "silver_linings_playbook", "notting_hill", "the_age_of_adaline", "young_adult", "while_you_were_sleeping", "locked_down", "charm_city_kings", "a_hologram_for_the_king", "the_longest_ride", "five_feet_apart", "cast_away", "sleepless_in_seattle", "only_the_brave", "seeking_a_friend_for_the_end_of_the_world", "beirut", "the_terminal", "the_descendants", "me_before_you", "love_actually", "the_second_best_exotic_marigold_hotel", "crazy_rich_asians", "burnt"]}