{
  "id": 3809,
  "title": "Skiptrace",
  "starring": [
    "Jackie Chan",
    "Johnny Knoxville"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "Comedy",
    "Thriller",
    "Mystery"
  ],
  "description": "A detective from Hong Kong teams up with an American gambler to battle against a notorious Chinese criminal.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yepKO0bbXL2FSUoq93c7lkp0op1.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 8.0,
    "ending": 4.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.142857142857143,
    "action": 7.333333333333333
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Skiptrace uses Jackie Chan and Johnny Knoxville to put them in a blender to make this weirdly, nonsense of whatever I call this film by its type of background. The result is just a plain \"What just happened?\" face."
    },
    {
      "rating": "10",
      "text": "suprb i think jacky comody actor and action sssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppppeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeerrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr"
    },
    {
      "rating": "4",
      "text": "A con and a cop team up against a notorious crime gang.\r This has been done in Hollywood a decade ago, which is now considered as outdated, but Hong Kong and Chinese are doing it now. What I meant was Jackie Chan teaming up with an American star. Though all those films are almost same, like running and chasing and stunts with the comedic sense. Yep, totally boring, nothing new it it, except different locations and the cast. The Russians addition was new, but in the end it became a joke. That's funny to say, because it is a comedy film.\r If you are familiar with Jackie Chan's Hollywood films, then you already know the 90 per cent of this film and for the rest, you have to watch it. A cop from Hong Kong seeking a revenge for his partner's death, so now he has to find and rescue the American con man who stuck with the Russias gangster for the evidence he needed to put the criminal gang boss behind the bar. The adventurous journey they take across the Mongolia is what the film is based on.\r This film is specially made for the yuan market, so don't bother if you don't carry yuan in your wallet. Maybe Renny Harlin's worst film I've ever seen. Jackie Chan is the only reason to watch it, but surely you have seen better films of his than this. Johnny Knoxville was just okay and the rest of the cast does not look good. Rewatching 'Shanghai Noon' and 'Rush Hours' films is better than this, so I'm not in favour of it.\r 4/10"
    },
    {
      "rating": "5",
      "text": "By shifting through exotic locations every five minutes and embracing its genre tropes wholeheartedly, Skiptrace ensures that it remains a completely watchable buddy cop comedy. This is all linked with a threadbare, predictable and haphazard crime plot that the film doesn’t care about anyways. It’s the perfect film to play on your TV during a lazy weekend afternoon."
    },
    {
      "rating": "6",
      "text": "SKIPTRACE is a well-animated adventure. The inherent humor in Jackie Chan's action scenes mixed with the persona that is Johnny Knoxville proved to be very entertaining and joyful.\rBut, it's not all a bed of roses. Through out all movie length we are cursed by an annoying and inadequate soundtrack.\rThe comic parts could be very amusing if the music had helped. The scenes are very funny as when Jackie Chan in Bennie Chan's character goes to Russia get Johnny Knoxville (Connor Watts) we receive a nice and very funny scene of action but the music takes away all this fantastic setting, making it dull and exasperating.\rThere were good and funny moments but you can not enjoy due to \"background noise\"."
    }
  ]
}