{
  "id": 516,
  "title": "Skyfall",
  "starring": [
    "Daniel Craig",
    "Judi Dench"
  ],
  "runtime": 143,
  "genre": [
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "When Bond's latest assignment goes gravely wrong, agents around the world are exposed and MI6 headquarters is attacked. While M faces challenges to her authority and position from Gareth Mallory, the new Chairman of the Intelligence and Security Committee, it's up to Bond, aided only by field agent Eve, to locate the mastermind behind the attack.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/d0IVecFQvsGdSbnMAHqiYsNYaJT.jpg",
  "categories": {
    "plot": 3.8461538461538463,
    "acting": 3.727272727272727,
    "ending": 3.4375,
    "soundtrack": 0.5,
    "cinematography": 3.0,
    "familyFriendly": 1.8333333333333333,
    "funny": 3.5714285714285716,
    "action": 2.586206896551724
  },
  "reviews": [
    {
      "rating": "5",
      "text": "I have to say I agree with the positive reviews and the negative reviews too. It is a good movie as long as you do not think too much about what you are watching. You also need to ignore all the commercials during the film. You need to disregard the plot devices that are inconsistent writing. Did they say uranium? Never mind you are going to watch this movie anyway just enjoy it and expect to take a nap for the last half hour of this 2 and a half hour long movie."
    },
    {
      "rating": "8",
      "text": "I thought Skyfall was the best of the Daniel Craig movies. Javier Bardem was a great villain,as always. The plot was very good. great chases and fighting. Although I love Sean Connery more, Skyfall made me a big Daniel Craig fan now too."
    },
    {
      "rating": "0",
      "text": "\"SkyFail\" (This movie is so bad it inspired me to post a review)\r To be honest I expected a reboot similar to the batman franchise. It turned out to be a major letdown, due to a complete cliche plot, bland acting and blatant incompetence of the characters pasted together with the only redeeming feature: thrilling action scenes. Please remember to turn your brain off before watching this, if you do this movie might even be worth your money."
    },
    {
      "rating": "5",
      "text": "Based on reviews, I thought this movie would impress me and knock my socks off; and perhaps I walked in expecting too much, but I walked out thinking, \"meh.\"\r It wasn't a terrible movie, but I don't understand why everyone is saying it's so great.\r There were way too many plot holes that took me out of the movie.  The biggest one that ran throughout the movie was, \"Why didn't Silva just kidnap M?\"  At the end of the movie, it turns out his plans was to kill M but also himself.  Why did he go through all the effort of the entire movie when he could have just kidnapped M to begin with?  He clearly had the knowledge, skills, and resources to do so.  His whole reason for doing anything was because he had M (mommy) issues.\r His entire \"plan\" hinged on Bond wanting to get captured by him and then Bond taking him prisoner.  And why would Bond want to be captured in that way anyways?  Wouldn't it make more sense to take Severine, give her protective custody and interrogate her?  She knew where Silva was and appeared ready and willing to give Bond that knowledge anyways.  They could have found the location that way, and then sent in the commandos.  The second part of his \"plan\" was getting captured and then escaping.  Why go through all that?  Just attack the hearing that he knew M was going to be in anyways, without having to deal with planning an incredibly elaborate escape.  Or, back to the big issue, just kidnap her.  *side note: it is clearly established that Bond is chasing Silva through rush-hour crowds, yet the train that crashes through the ceiling and almost hits Bond is empty except for the driver.  Where did all the people go?*\r And about his escape.  The second biggest problem for me.  Q, this genius technology guy, plugs in Silva's computer, who has already been acknowledged as a master hacker, straight into MI6's network?!?  Seriously?!  Wouldn't you try to get what's on the computer without connecting it to a network? Or if you had to connect it to a network, connect it to an isolated one?  If guys like Q are in charge of computer stuff at MI6, no wonder they got so easily hacked.\r Skyfall.  James Bond had super rich parents. Great.  Their death messed him up.  Great.  He doesn't like talking about it.  Great.  But that's as far as we go.  But fine, let's say we're not going to delve into that.  At Skyfall, after M and Kincade escape, why are they using the flashlight?  I can get Kincade maybe not thinking of that, but M, who leads a spy organization doesn't think about how a flashlight could give away their position at night?\r Anyways, those are just the big ones that stick out in my head.  Those took me out of the movie and made me just wonder, \"what the heck are these people doing?!\" throughout most of the movie."
    },
    {
      "rating": "3",
      "text": "Bad movie. Hollywood must have some very efficient PR agencies which obviously now spam IMDB & metacritic way ahead of a movies release. Shortly before the movie came out in the US it already had 10000+ reviews on IMDB.\r Story: 2 out of 10 - (Spoilers): Bond dies - Bond does not die - Bond is back - lot of brainless action - plot does not make sense at all. The \"evil\" guy is a former MI6 agent, who was betrayed and exchanged against six agents by M to the Chinese. Now he wants M dead and how does he show her what she did was wrong? He acquires a list of NATO agents working undercover and unfolds their identity (5 at a time, to make it even more mischievous) on a YouTube channel (nice product placement btw.). As if that does not make enough sense he now blows up M's office 15 years after he freed himself out of the Chinese prison and makes sure M is not in it (adds to the suspense). To spice up life besides blowing up things and hacking M's computer he manipulates the stock market and hacks into satellites. Makes sense? Yes? No! But now his evil plans for world dom... ehhm... no actually just killing M (which seems to pretty easy for this superbrainiac) will finally come true, so he gets himself arrested by the MI6 and is locked up in a airtight cell in MI6 new secret HQ somewhere below London. But of course he has already calculated all the steps MI6 will take and now from within his supersecure cell he executes his super evil plan to ESCAPE from the cell! He escapes (this is not being shown, as escaping from a airtight cell is just too easy for this guy and too hard for the ingenious director to execute) and runs through the tunnel with James Bond nearly shooting him (he has precalculated the flight of the bullets too and also exactly the location where Bond is standing as NOW he blows up a hole in the underground of London where surprise surprise a metro is just flying through and nearly missing Bond (he calculated this also, so he could have some more fun with his favourite actor / counterpart). After escaping the underground he walks straight into the parliament (precalculated too) where a trial against the somewhat evil M is being conducted. Now he thinks it is time to kill M for real, but now his calculations went wrong and Bond saves M from being shot by Mr. Evil himself. Because obviously Bond and M now cannot trust anybody besides each other anymore they drive to Scotland and to Bonds former parents house. This of course is still being inhabited by the former servant, who despites being 60+ years old still seems to be quite keen facing Mr. Evil and his minions just armed with some shotguns and some self constructed MacGywer style bombs. Of course Mr. Evil comes in the second wave after blood thirsty Bond now has killed over 15 of his minions in the first assault wave and after a long battle chases M (the new number 1 of the Bond movie) to a chapel nearby. Now finally the 100 minute benchmark is reached - Mr. Evil gets killed - M dies - Bond almost crys and dear old servant looks shocked. Movie over - done. A masterpiece? Nope. The ingredients are mainly senseless shooting - \"cool\" looking explosions - dark meaningless places and a story lacks any sense at all. Not to say Bond movies ever where super logical or anything, but this movie is just a complete mess. It lacks humor, a coherent story, the evil guy sucks, the Bond girls appear like 5 seconds and then they disappear if lucky or just get plain shot, Bond shows his \"dark\" side - taking painkillers excessively and drinking, Q hands Bond two **** things and tries to be funny about it, the locations have no charm or character, not a single character gets explained. Main thing nowadays though seems to be kill count needs to be high, actors need not to act but rather look \"cool\" when killing people and story needs to be not existent to not overbear the viewer.\r Optics 4 out of 10 - Intro is cool, rest way too dark and superficial.\r Actors 3 out of 10 - no actor strikes out, especially the evil guy sucks, but that is all based on the story."
    },
    {
      "rating": "9",
      "text": "James Bond films were never really considered as great films.  They are good escapist fares, but never considered as something more than that.  On some occasions, such as 'On Her Majesty Secret Service' or 'Casino Royale', the Bond films rose to become something more, but they are far and between. Until now.  Skyfall may be one of the best Bond film of all time, and may be the best film of 2012. It's a character piece that deconstructs who Bond really is and his relationship with those surrounding him, in particular with 'M'.   The cinematography is top notch, the plot sublime and Sam Mendes delivers. But at the heart of Skyfall is the performances of its actors. Craig finally becomes the best Bond since Connery, imbuing great depth to this character.  Judi Dench finally does her best turn yet, while Bardem delivers an over the top performance as Silva, one of Bond's most memorable villain. Again, I can't say enough of this,  one of the finest film of 2012, and the best Bond film of all time. Don't miss it."
    },
    {
      "rating": "0",
      "text": "Worst Bond movie I've ever seen, boring, dumb, predictable, it sucks big time. Save yourselve some time and money dont watch it. Oh yes it is that bad"
    },
    {
      "rating": "1",
      "text": "First of all, whoever is simply upvoting positive reviews and downvoting negative ones, you are not helping constructive film criticism. This movie is bad, and there are reasons for that:\r 1) Bond never gives us a reason to like him as a person, yet we're expected to cheer for him. He's smug and dull. (half of the jokes in the movie didn't get any reaction whatsoever from the theatre I was in) Despite the long run time there is little to no interpersonal character development.\r2) The movie is paced poorly, almost unbearably slow at times. Even long-time Bond fans I was with admitted that they couldn't understand why some scenes went on for as long as they did or why they were even in the film at all.\r3) I'm sorry, but the Bond 'death' scenes are too ridiculous! I couldn't get over it and it's why I have to mark this review as having spoilers to include this point. If you get shot w/ a sniper rifle in the chest and plummet lifelessly underwater, you won't live! How can we take the movie seriously after that? And then you have Bond wrestling w/ a guy in icy water and is completely nonchalant underwater after killing him. Does Bond have superhuman traits that would make any comic book character jealous?\r The only redeeming things I can think of this movie are a decent opening and Kincade, the old guy at Skyfall. He is the ONLY character in this movie with any heart that I cared about and enjoyed watching. He alone earns the one point I would be willing to award to this film. Good riddance to the featured M."
    },
    {
      "rating": "10",
      "text": "Director,screenplay,actors,sound=awesome.Good election to choose ADELE for the song.I think that it will be nominated to the Academy Award:\r-Best Original Song\r-Best Cinematography\r-Best Actor\r-Best Supporting Actor\r-Best Supporting Actress\r-Best Sound Mixing\r-Best Sound Editing\rI see you in the Academy Awards."
    },
    {
      "rating": "0",
      "text": "I'm genuinely surprised this movie is getting such rave reviews, I thought it was awful. It tries so hard to be dark and serious, but to me it came across as completely shallow. I never felt empathy for Bond in this movie, and I don't get how I was supposed to when he never shows any emotion or attachment to anything the whole movie. That would have been OK if it was just about him being a badass but here they spend huge chunks of the movie where you're supposed to buy that he's \"vulnerable\" and \"complex\". But it kinda doesn't work when the guy is practically invincible and nothing ever affects him, in fact I would have been ok if they did a twist where they tell you Bond was actually a robot all along, that's how wooden the character was. So yeah, the psychology aspect just didn't do it for me, and not helping matters there was only one really memorable action scene and it's in the opening sequence (the intro was amazing I'll give the movie that) : it was basically a borefest for two hours after the intro. You could argue it's the second \"best\" JB movie based on the cinematography alone because it's true the movie is beautifully shot, but then again it doesn't matter when  you don't care about anything that's going on. That wasn't the case in Casino Royale where I genuinely cared about the character, because they showed you he was human and not just a cold robot."
    },
    {
      "rating": "1",
      "text": "It was G-d awful!\rConsistent blatant product placement.\rThe shout outs to the past bond films were nostalgic but seemed forced for cheap thrills. The CGI in the first scene was TERRIBLE and was clear that it was computer generated.\rQ wasn't fantastic but not terrible either. Fiennes was a nice casting choice though. Naomie Harris was poorly cast. I just don't think it was the role for her.\rWho scored the movie? Terrible pacing in music at the wrong time. I don't know what people are seeing in this film. The script was choppy and unfinished. I can't criticize it more without spoiling the film. This is a travesty for the 50th anniversary.\rOh and Javier Bardem's performance was WAY over the top and not as menacing as he could have been.\r There are some good fight scenes and some good scenes in general but its just terrible all over at the end of the day."
    },
    {
      "rating": "0",
      "text": "A total disgrace to the Bond franchise.  I can't recall the last time I was this disappointed by a movie.  Skyfall has none of the elements that Bond fans like myself have come to expect:\r 1.  Out of the world stunts and grand action sequences, especially the opening set\r2.  Cool gadgets\r3.  A smooth, suave agent\r4.  A villain hell bent on destroying the world (or large parts of it)\r Instead, we see a sentimental, introspective Bond who sheds tears (guys, I am serious) fighting against an effeminate villain with a personal vendatta, has no cool gadgets, and mediocre stunts.\r Three years since the last movie and this rubbish is what the clowns at MGM/Columbia give us?  I want my money back."
    },
    {
      "rating": "1",
      "text": "Left the cinema massively disappointed - I've always enjoyed the bond films, until Qos - in my mind this couldn't possibly be any worse... it actually manages to be far worse than qos, to the point I was bored watching it, coupled with a terrible plot with holes everywhere, rubbish villain, about 10 minutes of screen time for the bond girl this goes down for me as the worst bond I've ever seen, sorry! I'm aware there is a bit of a marmite reaction going on with this film, and some of the best bond film ever reviews appear to be fake so please beware before setting expectations too high like I did"
    },
    {
      "rating": "1",
      "text": "If this what James Bond has come to, then I would stick to Kung Fu Panda. This is worse than a B-grade action movie. Skyfall could have been accepted as a decent action movie if it hadn't been branded as a James Bond flick. For the full 143 minutes, I never saw Bond; all I saw was an aging and grumpy Craig."
    },
    {
      "rating": "0",
      "text": "Let the Skyfall, take your money, waste your time. Let's face it all, this film is the worst James Bond movie has ever been made. This film does not even feels like a JB movie. At least there is a little bit JB feel in Quantum of Solace. Skyfall's intro is not amazing like old JB films. The story is so ridiculous that they tried to fill it with James you are too old thingy.  Seriously, James Bond cannot shoot an object properly because he is too old. Actually, the story has fatal flaws which I am not going to mention them. Bond girl has nothing to do with story, plus bad acting skills. Bond acts creepy to the situations. With Naomie Harris helping JB feels like watching an Ocean's Eleven film. The new Q keeps failing in every situation. Some elements are stolen from The Dark Knight Rises in a creepier way. There are CGI's and they seem very cheap. The music is inappropriate with the scenes. Why did they change the old composer?. I really liked David Arnold, I still listen to his old JB soundtracks. And what about the director? His first action movie, right? The camera is so close to Daniel Craig in every scene. Let the audience see the beautiful places like Shanghai, Istanbul. The director shows the Omega watch in an action scene. What kind of advertisement is this?. There is a scene Bond looking to his phone doing nothing. Finally, the final fight between Bond and the villian is not that thrilling. If you like to watch a cheap action movie, lower your expectations and watch it. The series had a formula but the producers keep insisting of not doing it. So, I'm done with the series."
    },
    {
      "rating": "5",
      "text": "Skyfall starts off with a great set piece and carries on a very \"Bond\" feel right up until the third act. Then everything falls apart. The third act is basically a western and reinforces every negative thing said about Bond during the movie. Daniel Craig as Bond is as good as ever but...\r **SPOILER ALERT***\r ... he loses. This is the first Bond movie where the villain succeeds at everything he set out to do. Bond loses and there are no repercussions, the end. That third act and ending alone make this the worst Bond movie i've ever seen (Moonraker was considered to be good at the time)."
    },
    {
      "rating": "4",
      "text": "A few okay action scenes, but mostly a long, boring movie with no real point. I wouldn't recommend it. It might be okay for a few loyal bond fans, but if you aren't a James Bond superfan, you probably won't like it."
    },
    {
      "rating": "5",
      "text": "Casino Royale is my favorite James Bond film. I place From Russia With Love in second place. Just so you know where I'm coming from.\r Skyfall disappointed me. The biggest reason for this is that the bad guy's motivation just didn't make much sense at all. It was the opposite of the motivation in the precise and focused plot of Casino Royale. Then there were the little moments that soured me on it. Here's a few, without giving spoilers of any significance. Bond is after a bad guy. Just before he attacks the bad guy, the bad guy shoots someone. Bond could have stopped him, but didn't. Bond stands by without a care in the world as the man commits murder. And the moment after that, Bond goes after the guy. It makes no sense. He would have attacked just before. He may not be a saint but Bond as Craig has defined him (until that moment) wouldn't let an innocent person be killed that way. Next thing. Bond tells a woman he's going to rescue her from being a sex slave (forced prostitute) if she helps him with his mission. When he shows up at her place, she's in the shower. She doesn't see him. He gets naked and surprises her in the shower - they presumably have sex. This is a woman he's had exactly one conversation with in a public place. So let's recap that logic. He's going to rescue her from sexual slavery but first he pops in naked for a quickie. Anyone other than me disturbed by that? It's freaking creepy as he!!. This isn't some Bond girl he's flirted with. This is a chronic victim of rape. OK. Next thing. In one scenes he's capture but he brings in the cavalry by virtue of a hidden radio transponder in his jacket transmitting his location. Really? Couldn't he have done this with an iPhone? The radio transponder is one of Q's special gadgets, as if we live in the year 1962. It's ridiculous. And why wasn't he searched when he was captured? It would have been found. So disappointing."
    },
    {
      "rating": "4",
      "text": "Hm, okay, there is something new in this Bond film, vut especially the ending sequence at \"Skyfall\" was unrealistic and much too similar to an average action movie. The villain seems unmotivated, certain actions are not comprehensible, and then M's dead at the end, which destroys James' invulnerable image ... absolutely a matter of taste!"
    },
    {
      "rating": "5",
      "text": "The hype on this Bond is embarrassing.  I'm all about a more serious Bond with Sam Mendes at the helm.  What I wanted was a clever spy story.  What we instead get is a rehashing of great moments from other movies.\r As to not spoil, the list of stolen ideas from better movies include:  LIVE AND LET DIE, BATMAN, THE UNTOUCHABLES, and the painfully obvious SILENCE OF THE LAMBS.  Now I know why Sam Mendes has been unable to prosper without Bond.  Apparently he's a hack.\r As much as I like the actor who played the villain, he reminded me too closely in appearance and performance of Christopher Walken's disastrous A VIEW TO A KILL villain.  Laughing and smirking in a little world the rest of us neither understand or give a crepe about.  In this film I didn't care the villain, Bond, or the 'dramatic' event at movies end -- which wasn't set up by professional filmmakers but Comic book fanboys.  And the oh so precious introduction of a Bond institution at movie's end was another 'precious' fanboy moment played terribly wrong.\r Where the Bond girl?  The same place this script was.  Up someone's arrogant myopic behind."
    },
    {
      "rating": "5",
      "text": "Good movie, just not a good Bond movie. The main protagonist (Bond) and antagonist (Silva/Bardem) are underwhelming. I want Bond to be a hero, not a drunken bum (who can oddly survive a crazy high fall into a creek) and I want Bond villain to aspire to more than just silly revenge. It is however very well shot. This falls short of Bourne for me."
    },
    {
      "rating": "5",
      "text": "Bond has been hit by a fallen meteor.  Disappointing for a Bond film- strained and very unrealistic plot with another crazed unbelievable villain,  But good on-location photography."
    },
    {
      "rating": "4",
      "text": "I really didn't enjoy Skyfall. Some elements were good, but I felt it was too bland. Basically Bourne but with a bit more class. Why must they cut out the cool gadgets / glamour? What drew me to Bond in the first place was the escapism and fantasy elements. This is too real world, too much like a stock standard action film."
    },
    {
      "rating": "2",
      "text": "James Bond films are iconic not just for adventure also for the beautiful bevy of Bond girls that act as sirens to our beloved 007.  Skyfall has taken the newest profession of its featured Bond girl in this film to an all time low.  The beautiful heroin is actually a victim of human bondage.  This practice is repugnant enough, but to show case this exploitation of women as sexy; is blatantly disrespectful to all women, especially to those who suffer under these very real and very deplorable living conditions.\r\tThe audience quickly discovers that this damsel in distress; is actually and quite literally the branded property, of the antagonist in Skyfall.  The heroic Bond promises the very terrified woman that he will avenge her captors and in the following scene successfully dukes it out with several of the antagonist henchman.  In the next scene 007 slips comfortably into the shower with the woman in bondage and proceeds to sleep with her.  No woman alive can resist the charming allure of James Bond!  This theme has been resonated in every Bond film since it"
    },
    {
      "rating": "4",
      "text": "Anyone who believes this is a good Bond Movie is an Odd Job. And probably likes the  musical 'We will Rock You'.   Average action to open, silly effete bad guy (let's make him camp!) with lack of ambition and overbite, (didn't they used to  want to take over the world?) washed down with a  terrible clunky script.  Why? - because it borrows so heavily from other films: Hannibal Lecter cage from Silence of the Lambs; shotguns and courduroy jackets and country from Bourne; dead parents from Harry Potter.  Ridiculous dialogue: Albert Finney: \"I was born ready!\" - really! Silly denouement: Bardem arrives with heavies majically out of thin air and M has no security save for Bond who kills a helicopter with a calor gas cannister.  No glamour, no charachter arc for sexy women - only M who completely forgets all her training and waves a bad guy in with a white hankie. No bad guy characters introduced around main Bardem charachter (no Odd Job) 'Ext. Skyfall - Night:  Lots of bad guys wander down sepia tinted countryside looking for a tosser and his mum and a poacher so they can kill him. They all die in BBQ accident.'\r Stupid and unsophisticated with schlocky ending that betrays Bond cool.  His parents grave - and mum named Delacroix - and what -what- what! Stupid moments: Bond chasing Bardem in Z Cars outfit and crashing train pointlessly into underground. This is not a Bond Movie. It's a Blonde movie made by people with a schedule. Skyfall House - that really made me laugh... as if."
    },
    {
      "rating": "5",
      "text": "Disappointing.  Loved Casino Royale 's realism, but this was like watching a Batman movie with an arch villain and bumbling Secret Service except for Bond."
    },
    {
      "rating": "3",
      "text": "OK, he's shot in the chest, he falls a distance that is deadly, he goes over what could be Niagara Falls, and then 20 minutes later he's lying next to a woman in bed. No explanation given; some guys just don't die. I understand that with James Bond films belief must be suspended and situations are presented that don't make sense in the real world (like our defenseless hero is surrounded by armed opponents who follow the golden rule that they cannoct respond towards our hero until it is \"their turn\"), so I am somewhat predisposed not to like this type of film. But what is really wrong with this film is that the script is dumbed down to a fifth grade level and I may be too kind in this assessment. Really? People at this level of achievement talk with such a low grade -intelligence quotient?"
    },
    {
      "rating": "4",
      "text": "Skyfall had some good bits, but a lot of problems. The \"aging Bond\" aspect of the film didn't work for me because we all know that Bond is effectively a permanently young and handsome character, thanks to the miracle of casting. Besides, it's been done before (in Never Say Never?). The scale of the movie didn't work for me either -- \"Skyfall\" is such a grandiose name that it should have been an international scheme, not Bond's dismal childhood manse. And the \"revenge on M\" motivation fell flat. Bond villains should want to take over the world, get rich, or both. I also disliked the movie's midway morph into Home Alone. How tedious. Finally, I was offended by the homophobia implicit in the depiction of the villain. What will the next Bond film bring us -- a greedy Jew?"
    },
    {
      "rating": "2",
      "text": "I did not care for this movie, which is disappointing because I loved the first Daniel Craig movie. This one however was just cheesy.  The plot and situations were implausible, and so predictable. There was absolutely no suspense. I half expected Austin Powers to pop out at some point. To top it off, the movie drags on for 2 1/2 hours\r It was a return to the same tired old villain format: a mad genius who is unstoppable, who outsmarts MI6 at every turn. And what is Bond's brilliant plan to get one step ahead of him for a change? Why,  flee to a remote location in Scotland with no weapons and no support, where he can be outnumbered 20 to 1 and outgunned by the bad guys. But, guess who wins anyway. Bond also regresses in terms of being portrayed as a human being. Here, he seems more like the evil terminator from T2. He behaves purely mechanically, unfeeling, driven by will alone. His lack of human qualities makes it hard to identify with him and root for him. I've watched Casino Royale at least a half dozen times, but nothing in this film would make me feel like ever watching it again."
    },
    {
      "rating": "4",
      "text": "If I didn't know it was a Bond film I would have enjoyed it more. There was no 'light and shade' as in previous Bond movies. It was all too dark. What happened to the suave sophistication that Bond exudes...always 100% sure of himself. There were no 'tongue in cheek' snippets that always was a sign of a good Bond film. I missed the inventive gadgets that Q would provide. It was though the writers were trying to destroy the franchise by blowing up the Aston Martin and revealing Bonds past. Why destroy the mystique of Bond? I hope they return to the old format. There will always be plenty of Bourne Identities. Sorry 5/10."
    },
    {
      "rating": "2",
      "text": "I started falling asleep not through lack of sleep and couldn't wait for it too end by the time they were at Skyfall. Nowhere near as good as Casino Royale and only slightly better than that Quantum rubbish. It seems that women like it and men think its a waste. Ridiculous dialogue at times - even for a Bond movie. Scoring 92% at rottentomatoes is proof of a conspiracy."
    },
    {
      "rating": "4",
      "text": "After watching skyfall I felt like having worked for an enitre day, it just took far too long. It'd be better it'd be shortened by an hour. The acting wasn't bad and stuff. Actually there was nothing which was like really bad but everything also was not good."
    },
    {
      "rating": "5",
      "text": "Some great action scenes are the only distinguishing feature. Otherwise, far too much product placement and a plot which revises GoldenEye with its agent turned villain after harsh treatment by his spymasters (Bardem phones in his performance and counts the cash, and good luck to him). The whole thing could have been rescued for me if Silva had killed M and himself in the chapel, with Bond arriving just in time to witness it. Now that would have been a movie!"
    },
    {
      "rating": "3",
      "text": "I like Casino Royale, I like the Bond formula, I hated Quantum of Solace but I thought... surely it can't be worse. I was right, but only just. I'm going to slate this film and for one main reason; what is the point in making a Bond movie if the character isn't even recognisably Bond?\rInstead of a suave sophisticated agent you get a washed out has-been (who can still miraculously perform anything he needs to); instead of him bedding beautiful women he jokes when they die; instead of fighting a supervillain who wants to take over the world he's fighting a complete idiot (see plot-holes); instead of gadgets he gets a tracing chip the size of a toaster and a fingerprint PPK  whoop-dee-woo. OK, OK.... Its a new Bond, he's got to be more realistic in a post-Bourne world?? So, they have a plot that's so riddled with holes you can (literally) drive a tube train through it; an enemy that appears to be insanely competent but then completely insane; an unsurvivable fall; an unescapable escape; and a ridiculous ending where Bond, an old man and an old women take on and win against a small army.\r Bond has no charm, the film has no warmth, the characters make no sense, the dialogue is wooden, the love scenes cold, the action heavy handed, and the film betrays the Bond legacy. Why 3/10? Because the cinematography....\r ... is lush. I fully expect the cinematography to win an oscar. Watch it for that, but otherwise this is not even a Bond film and the last in the franchise I'll watch."
    },
    {
      "rating": "6",
      "text": "You have to review the Bond movies within their context. As such, Skyfall is by means not bad one. There is something new and something familiar to keep both old and new fans watching. When you are going to see a any James Bond movie you pretty much know what to expect  and Skyfall delivers exactly this."
    },
    {
      "rating": "5",
      "text": "The film starts out with a lot of promise but quickly goes downhill once the villain is introduced. The end sequence in particular makes zero sense and feels completely out of place."
    },
    {
      "rating": "3",
      "text": "The progress made in bringing the franchise into the modern age is spectacularly undone. By the end of this film, you find yourself staring at the start of every early Bond film. While this could have been a superb way to wrap up 'Bond will return' and that is rather a depressing notion."
    },
    {
      "rating": "2",
      "text": "I've never written a movie review in my life, but this was so horrible that I created a Metacritic account.\r I'm not a James Bond fan, but I know what a James Bond movie is supposed to be like. More importantly, I know when I see a bad movie, and this is a bad movie.\r -The Bond girl had about 10 minutes of screen time.\r-There are a lot of pointless scenes and dialogue.\r-The \"too old to be a spy\" plot is ineffective.\r-The villain is too cartoony (still love Bourdain, though).\r-The movie tries to mimic the Dark Knight trilogy too much.\rsee: http://www.wired.com/underwire/2012/11/skyfall-dark-knight/\r And  last but not least  the movie is too unrealistic. Now, I do understand that action movies are meant to be fun and that you have to let go a little bit to enjoy it. But there are SO many points in the movie that are so implausible that it makes me sick.\r I would like to quote user _MB:\rhttp://www.metacritic.com/user/MB_?myscore-filter=Movie\r Why didn't the badguy just kill Q at home or when he exploded her headquarters? Why didn't Bond ask for a doctor to remove the fragments rather than using a knife and his left hand? Why didn't the bad guy just kill bond, what did he want him for? Why didn't they just hide in the tunnel as the bad guy didn't know it existed? Why did the priest hole lead to no where? Why did Bond walk over the ice when everyone else went around? Where did the ice henchman appear from? Why did Q plug the bad guy's PC into the network rather than an isolated PC? Why did they lock the badguy in a glass room which is locked electronically rather than just use a padlock? When did Bond set off the radio beacon on the island and why didn't the electronics mastermind badguy not have him checked? When did the badguy put the explosives on the roof of the chamber letting the train through, wouldn't he have used his time better, running away? Why didn't they just withdraw all the at risk agents? Why didn't bond shoot him at any point, he'd be tortured for months by the Chinese why would he talk to them? Why was there more screen time dedicated to Judi Dench than for Daniel Craig? Why did bond's face change from Brosnan to Craig yet M's is still Dench? Why would you cut up a perfectly good opening action scene to an old woman moaning in an office ever 30 seconds? Can I get a refund?\r Concise, truthful, and hilarious!"
    },
    {
      "rating": "2",
      "text": "Wow. So they took my script after all. Only it wasn't a 007 movie. It was a 777 movie. The guy's name is Bomb not Bond.  Bomb can't shoot. If he were on a lifeboat and aimed a flair at the sky he'd put a hole right smack dab in the middle of his boat. Chronic boozer, doper, and complainer. Only assigned minor missions like if some disgruntled ex-employee leaked some names, then that would go to Bomb. Nothing world-threatening. That's reserved for the doulbe 0's like Bond. Goes around with a grim look on his face like if he were about to be cremated or spliced in half, that's something to be concerned about. Actually thinks HE'S more important than his mission, and takes an unauthorized vacation to pout about it after finding out he's not.\r A mistake hire. When given the choice between going to prison for being a combination peeping tom  raincoat exposer or joining the service, took the service.  Reason he got the option was a former foster kid of the Bosslady's  just like the ex-employee he was chasing.\r Changed the ending tho. After finding out he got the Bosslady killed my script had both his Volks and his ars parked on the grars. And a policy change  NO MORE HIRING RELATIVES.\r This is not a Bond.\r This is a Bomb."
    },
    {
      "rating": "4",
      "text": "I liked the fact that it showed the toll bond had accumulated over the years. But I expected him to snap out of his lonely old man state of mind and kick some ass. In all honesty the movie felt like it should have instead been the first 15minutes of another epic bond film."
    },
    {
      "rating": "5",
      "text": "\"Skyfall\", the latest entry into the long line of 007 thrillers is a disappointment to not only Bond fans but moviegoers in general. Directed by Sam Mendes the film stars Daniel Craig, Judi Dench, Javier Bardem and Naomi Harris in this dark, ill conceived and frankly, but for extraordinary special effects, boring film. To paraphrase Lloyd Benson in his famous admonition of Dan Quayle, \"Mr. Craig, I've seen Sean Connery as Bond and you're no Sean Connery\". Ian Fleming's concept of a spy with a flair for the playful, humorous and witty engagements as he saves the world from various evils is the thing the writers of this latest film fail to get or understand. The film as a screenplay, is neither plausible in its plot scenes nor is it clever in its execution. The Harry Saltzman/Albert Broccoli formula these two geniuses developed over the years and throughout the history of this epic franchise are lost in this movie and the casting of Mr. Craig still continues to amaze me. As fine an actor as he is, Mr. Craig just doesn't fit the mold that Messrs. Connery, Moore and Brosnahan were able to cast. This is a problem which frequently arises when an actor and the character they portray in sequel after sequel become so embedded in the minds of the audience that to separate one often harms the other. Basil Rathbone will always be the real Sherlock Holmes, George Sanders will always be the real Falcon (even tho his brother, Tom Conway, tried to fill his shoes) and, alas for Mr. Craig and the owners of the franchise,  the same fate seems to be befalling them as well. I give the film a 5.0 rating for its special effects and the chance to hear Adele sing the background song. Beyond that it seems that more than the \"sky\" fell in the ratings for this film."
    },
    {
      "rating": "6",
      "text": "It is hard to fault the brilliant direction of Mendes.  It is even harder to imagine a better performance than that of Javier Bardem as the villain.  But take the opening high adrenaline sequence away and there is little left of a Bond film and more of an artful drama."
    },
    {
      "rating": "6",
      "text": "I have mixed feeling about this film. Overall, I was disappointed and the main reason was that the nothing was developed to make it really interesting. Let's start with the villain. Bardem is a great actor but you need some back ground to make him villainious. They actually did have some of the best scenes in the movie when Bond meets Bardem. However, there is no depth given to how he becomes a villain and little face time with Bond. The same with the new Q. He just shows up. The plot has no depth either. We get little of Bond except in the first scene working on this. The movie really becomes about him protecting M and that really is not that interesting. The final scene reminded me of \"Strawdogs\" but without the tension or excitement. I had hopes for this series when they got rid of Roger Moore and the supervilian with the hugh fight scene at his hidden lair. However, the improvements are marginal with each new film and that takes several years. I don't know if I can wait for them to put an entire film together that is entertaining."
    },
    {
      "rating": "6",
      "text": "Not as a good as Casino Royal, for sure. This Bond movie felt like several stories mashed together (or several scripts?), and though long, seemed to be missing the real character moments/buildup of stakes. There were a few too many action sequences that probably could've been taken out. Even with that, still a good movie--Craig as Bond really makes up for a lot and Bardem is always great to watch.  Probably worth seeing a matinee for the special effects and cinematography--but it's not a must see."
    },
    {
      "rating": "5",
      "text": "This isn't the worst James Bond movie, but it certainly is NOT the best.  As someone who's seen almost all of the Bond movies, I can tell you this movie does not live up to the name.  James Bond is a secret agent  SECRET as in unknown  yet everyone knows who he is.  MI6 is the last to know about every detail rather than the first, which is pretty bad for an intelligence agency.  And the plot of Skyfall is about petty revenge.  Rather than being a character who is used to saving the world, James Bond ends up playing a body guard.  Yes plots and characters can change from film to film, but they threw out the entire recipe.  The film may not have been a bad movie, but it was not a James Bond film."
    },
    {
      "rating": "6",
      "text": "Okay Bond film with strong visuals and action but lame villain and new Q is not great."
    },
    {
      "rating": "6",
      "text": "Meh, Casino Royal is better. I like bond movies and I like this one. But this whole Jason Bourne is Bond  deal is kinda a downer. Every movie the treatment becomes more Dragon Tattoo than Goldfinger. But I guess that's what people want. It's not awful."
    },
    {
      "rating": "1",
      "text": "Watching \"Skyfall\" again last night I’m left with the same horrible taste in my mouth like first time around, stemming from the disgusting scene in which the Chinese sex slave Bond girl is murdered by the villain while Bond callously quips \"what a waste of good scotch\". Despite being awfully bad storytelling in itself (Bonds kills all the goons and captures the villain within 30 seconds after the murder, meaning he could have easily prevented it), how is such a scene a thing in the 21st century, and why wasn't that already a bigger controversy in 2012? It might be somewhat amusing re-watching Sean Connery dragging a masseuse against her protest into the shower as an (albeit still painful) artefact of his time. But how are we allowing a supposedly modern Bond be imagined the way Skyfall does? This scene singlehandedly ruined the movie for me. I give a point for the great visuals, but that’s it."
    },
    {
      "rating": "5",
      "text": "Another mixed bag Bond film. Plenty of the typical action and tropes throughout, including of course the Bond girls. I love the stripped down version we have of Bond now, and there are a couple of humorous moments to highlight these changes. I enjoyed Bardem's villain for the most part although I do feel like the praise is a little overstated, there were times when he didn't have a lot going on and others when what he was doing was more than a little confusing. One of the most disappointing things about this movie was Bond's back story, or lack there of. I love a film with a good, dark back story and while I appreciate the effort here in that regard it falls well short of the mark giving us very little actual story in that regard. Overall this Bond falls short of the other Craig films for me, but ranks better than the last few Brosnan films."
    },
    {
      "rating": "6",
      "text": "don't know what movie those people claiming its the best bond yet where watching but it was not skyfall. well Skyfall does have its moments of that Bond felling it tends to go towards what you would expect a action pack CIA movie. rally uses any gadgets and his big one is a gun! really a gun that only shoots if Bond holds it. lame. overall Id give this movie a 6 out of 10. if it did not have the bond title in it and was ratting it as far as action movies go I would give it an 8. good thing though is I think its the best out of the Craig bonds."
    }
  ],
  "recommendations": [
    "thunderball",
    "no_time_to_die",
    "spectre",
    "casino_royale",
    "quantum_of_solace",
    "x_men_apocalypse",
    "tomorrow_never_dies",
    "taken",
    "jack_reacher_never_go_back",
    "iron_man_3",
    "x_men_origins_wolverine",
    "killer_elite",
    "diamonds_are_forever",
    "taken_3",
    "the_marksman",
    "max_steel",
    "the_6th_day",
    "the_november_man",
    "resident_evil_apocalypse",
    "you_only_live_twice",
    "angel_has_fallen",
    "creed_ii",
    "spider_man_3",
    "the_punisher",
    "kingsman_the_golden_circle"
  ]
}