{"id": 611, "title": "Skyline", "starring": ["Eric Balfour", "Scottie Thompson"], "runtime": 92, "genre": ["Science Fiction", "Action"], "description": "When strange lights descend on the city of Los Angeles, people are drawn outside like moths to a flame where an extraterrestrial force threatens to swallow the entire human population off the face of the Earth. Now the band of survivors must fight for their lives as the world unravels around them.", "releaseYear": "2010", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/8QpvbnNrtzijlwiM0bFVeilc6lc.jpg", "categories": {"plot": 2.933333333333333, "acting": 2.3823529411764706, "ending": 2.4, "soundtrack": 5.0, "cinematography": 0.0, "familyFriendly": 3.0, "funny": 1.3333333333333333, "action": 2.857142857142857}, "reviews": [{"rating": "4", "text": "What can I say, 9 for the trailer and 4 for the movie. I have to give the intriguing trailer a big round of applause. If you have seen the trailer before, I can guarantee you will be so bloody curious to watch the movie itself (exactly what happened to CLASH OF THE TITANS earlier thiz year). They were editing the trailer so well. But the fact is: Something so wrong is going on. Next Thing I can say, A-Class Special Effects collide with C-Class Actors. The movie directed by Special Effects experts, Colin and Greg Strause, who also directed AVPR: ALIENS VS. PREDATOR-REQUIEM: (2007). The premise is mysterious at the beginning, one night at 4:27 A.M. strange blue beams appear on the City of Los Angeles. It is the first initial of the extraterrestrial invasion. The storyline only follows one point of view (just like CLOVERFIELD, 2008), the movie focuses on a group of certain people and what happens next to them. They are Eric Balfour, Scottie Thompson, Donald Faison, David Zayas and others. There is a scene that I think it is a rip-off from WAR OF THE WORLDS (2005), when Terry meets a stranger and the alien is sneaking around to hunt them furtively with its long and creepy tentacles. The last thing I can say, The Sky is wreck and The Line is flat. Approaching the end of the movie, the story-telling is getting more and more poignantly absurd. For example (Spoiler Alert!), the octopus look-alike alien which could chase and destroy jet aircraft and even sophisticated Stealth fighter jet, can be defeated by bare-hand and an axe. Strause brothers are really getting on my nerves, while they underestimate our intelligence with their absurd story. There are several of them. However there is something that maybe you wont realize. Everyone and most critics thought that thiz movie was a monstrous failure, but what you did not realize that thiz movie made with budget of ONLY $10 million (estimated). To be certain, they made up some real money here. The tagline on thiz movie is: Do not look up, well, do not even look at the film itself. Next time if aliens invade the theaters like thiz again, I would rather go home and sleep on my bed. Do not waste 92 minutes of your life.\r Visit My Blog on JONNY'S MOVEE on : http://jonnyfendi.blogspot.com"}, {"rating": "2", "text": "The worst movie of the year. I have nothing positive to comment on this movie except for the CGI. the cast is horrible with stone cold acting, running around the penthouse for an hour devoured by aliens. The story is uninspired with a preposterous ending. This is a movie that has lost its way to the direct-to-home video pile."}, {"rating": "4", "text": "The first 30-40 min of the movie held my interest and I thought it was going to something special, but the ending, with its Matrix style of the aliens need the humans for food/energy thing, really throw me off. Writers had 3/4 of a movie, and just winged it from there."}, {"rating": "3", "text": "The effects were surprisingly good for such a low budget film... But apart from that don't expect much from this film. It feels as if you were watching a bad tv show most of the time. Bad script, bad production, bad actors..."}, {"rating": "3", "text": "this movie wasn't that horrible ; it was horrible but it wasn't that horrible. While i was watching this movie i wanting i was expected more. I hope they don't make a part two.  One of the worst movie of the year. I would suggest anybody to go see this movie. They did an okay job directing this movie. This movie had an awful screenplay. It only going get worst. Please don't make a sequel to this movie. I give this movie an extra point because they did a fine job directing this movie shooting this movie in the director apt complex. nice job with the special effect."}, {"rating": "3", "text": "As far as the suspense goes, it leads you to nowhere. Too many War of the Worlds references are included too. It has also the weirdest, silliest ending which is more, well, weird and silly than you imagine."}, {"rating": "3", "text": "Take District 9 and Cloverfield, minus the character development, acting, plot, and drama, and you get this. It was pretty terribad- but I like a cheesy movie here and there. The problem with this is that it takes itself too seriously. When I think of how this came to be I imagine someone made some cool looking monsters, and said, 'hey, lets use these for...something..\"\rThe whole 'infection' didnt need to be there, unles sit was their way of showing the lead guy 'fighting back' to keep his senses. If thats what they were aiming for they failed. And why is JD in this movie?\rSo, points for cool looking monsters, points for aliens in the movie, points for JD....thats 3.\rAnd omg was the ending lame (must protect female- HULK SMASH!) Like, if there were some character development it'd make sense, but there wasnt...The lead male started out lookin like a tool, and never changed  till the very end."}, {"rating": "0", "text": "This movie took about two hours of my life that I can never get back. Though the first scene of the movie is intriguing the movie quickly derails into a morass of hiding in a penthouse, being squashed by aliens, being sucked up into the sky by aliens, and a final scene that leaves the movie watcher wanting to throw a rotten tomato at the screen in disgust. The acting was marginal at best (the script gave them nothing to work with) and the CGI seemed absurd. All in all I would call this the worst movie I saw in all of 2010. STAY AWAY!"}, {"rating": "1", "text": "Honestly one of the worst films I have ever seen. The plot is boring and the actors are atrocious. The film relied on special effects to much. The ending was so frustrating because it should off finished 10 minutes before it did and it didn't fit in at all with the rest of the film. They set it up for a sequel which will probably be as horrific as this one. Please save your money and don't see this."}, {"rating": "3", "text": "Just saw this movie on dvd and i thought it would be better than that. In reallity, its crap. The effects of the  movie  looked really nice but the overall scenes were dull and poorly done. It was hard for me to care abbout the  characters  in any way and  their stories were cliched from every B movie on the market. Giant ships and monsters were cool  to look at but brought no life to the film. Then that \"surprise ending\" was awful. Im all for films that just want to entertain, but this one doesn't."}, {"rating": "3", "text": "Skyline...when you first watch the trailer you think, well hey this might be a good sci-fi movie..right? WRONG, bad actors, cheesy, horrible effects, idea is nothing new, feels like a knockoff of War of the Worlds or something. Didnt keep me guessing whats next, didnt hold my full attention it was just another sci-fi movie that people will forget exists in a year or less."}, {"rating": "2", "text": "Given that this had zero positive critic review I don't know why I watched this.  Now I wished I hadn't. It was terrible.  First, you have to sit through about 20 minutes of incredibly corny dialogue.  The rest of the movie was just as bad with bad acting and a terrible screenplay.  It even had that cliched  guy yelling \"nooooooooo\" in slow motion.   How do movies like this get made?  Worse yet, it had a stupid ending that implied that a sequel is coming  Noooooooo."}, {"rating": "0", "text": "I only have one question? How did this film ever get made!!! This movie was trying way to hard to be cool and just didn't get the job done. Skyline, you get an F for FAIL!!!!!\r Acting: Bad\rStoryline: Dumb\rCharacters: Token"}, {"rating": "2", "text": "This is a perfect example of when a film's visual effects far outpace the screenplay.  The DVD container emphasizes in large font that the visual effects are from the same guys who worked on Avatar, Iron Man 2, and 300!  What the container does not say is that the screenwriters from those films did not work on Skyline.  Aliens descend from the sky and everything which occurs afterwards, the audience sees from the perspective of a particular group of people trapped in a Los Angeles penthouse.  Why this group?  Aliens are everywhere and we have to see the events through the eyes of people we cannot stand?  The characters are one-dimensional and very obnoxious for most of the time.  Why did they waste what must have been an enormous visual effects budget on a story which appears to still be in draft form?  Did the producers feel the story in Avatar or District 9 was too complicated?  Stay away from this movie!\r P.S.  The Air Force goes up against the aliens at points and I hope they were using some top secret drones; otherwise, those were B-2s pulling 9 G's and outmaneuvering enemy fighters.  Also, an F-22 crashes and 'bounces' right over the main characters.  *smacks forehead*"}, {"rating": "4", "text": "The movie had potential.  I liked how they attempted to portray events from purely the characters perspective.  I agree there were a lot of random scenes that were quite pointless to what little story there was.  The attempts at character background were somewhat shoddy, but not altogether terrible.  The CGI depicted the action and certainly drew you into the show.  I think how the characters responded to the crisis and invasion was not portrayed realistically.  I know I would have been going door to door in all the apartments looking for weapons or something useful to defend myself.  They just stayed in that one apartment the WHOLE time.  I would have ventured out at night to try and escape to the sea or at least tried to improve my situation as much as I could.  The fact that the aliens were practically impervious to all of the attempts to destroy them quite frankly was retarded.  It certainly promoted a somber depressing theme and frustrated me.  I would've liked to have seen the few uprisings and military attacks to have made some sort of impact on the aliens.  On that note I found it surprising that these aliens with all their technology were thwarted by shades or a simple kitchen counter in their attempts to locate humans.  I mean come on, if you can rebuild an entire spacecraft in a few hours after being nuked, but you can see past some shades?  What was the point for these aliens to invade anyway?  They needed brains to run their biomechanical creations?  That's pretty lame.  That's about 7 billion brains....I think those ships would have to be a little bigger and that it would take a lot longer to clean out L.A. then a few days.  I guess the brains, for the most part, lost their individuality and independence once they were transferred to their new hosts/bodies in a sort of \"borg\" like fashion.  That does not help this already handicapped movie in anyway. I think we all like movies to have some sort of closure, and that attempts to end movies without ending them only frustrate viewers and demonstrates a lack of creativity or ability to put together a cohesive story.  These \"endings\" make me think that the writers/producers could only come up with a bunch of noncontiguous scenes that they thought would be really \"cool\" to create, but then when they've created them they don't know how to connect them. That is my very long rant on a not so terrible B movie that had its moments in bringing me into the movie, but for the most part left me high and dry in terms realistic portrayal, lack of cohesive story, and fundamentally flawed ending on all points.  But hey the nuking of that alien mothership was pretty sweet.   I just need to remember not to lock myself in an apartment next time there is an alien invasion."}, {"rating": "2", "text": "Some of the worst acting ive ever seen Jared \"JRock\" is the biggest tool alive. This was probably the worst movie ive ever seen! Extremely predictable and makes no sense. Im mad i wasred 480 Microsoft points on this turd of a movie! The acting is so unnatural like a bad SciFi channel movie. Dont waste your time!!"}, {"rating": "1", "text": "Passable special effects for the movie's budget is the only thing going for this failure at storytelling.  Characters have little to do with what's going on around them and stand around like props waiting to be struck from the set by CGI tentacles.  I found myself vaguely interested by the invasion strategy: using light to lure victims into arms reach, but eventually decided it was a little redundant since the aliens are perfectly capable of getting to you and there's not much of a human defense against them.  My next bug-a-boo in movies of this genre is a poorly crafted rationale for the protagonist's ability to fight back.  I'm lead to assume Jarrod (Eric Balfour) is so somehow special by sheer virtue of his good looks and...neat tattoos because he got super-powers instead of being brainwashed by the alien lure AND was able to transfer his consciousness into one of the alien husks after being 'harvested.'  At it's best Skyline is a portfolio for FX on a shoestring budget, at worst, a 94 minute time sink."}, {"rating": "0", "text": "Skyline is the absolute worst movie I have seen in theaters. This piece of crap has a horrible plot, corny diologue and Horrific acting. I would not recommend this horrible movie to anyone, just aweful."}, {"rating": "0", "text": "How could people like this crap? I never heard of this movie until just a few days ago. A friend of mine told me about it and he thought it was terrible, but I checked it out anyway because I am a huge SciFi fan. After watching this, I wanted to shoot myself! What a piece of s**t! Every aspect of the movie was so freaking stupid. Hell, I'd rather watch Battlefield Earth than watch this mess again. Jesus, what a waste of my time!"}, {"rating": "1", "text": "This movie is so over the garbage, the actors really dint even felt that they were acting,looking like dorks that never did a movie. The sci fi  aliens looked more  like the 80's clay monsters, the end of the movie really made me laugh, plain horrible ."}, {"rating": "4", "text": "skyline our first encounter our last stand dont look up thats right dont even look up at the screen this movie sucks  very boring story thats never explained propaly too short bad acting the effects are very good that is  the only thing good about this movie brothers strause make a decent movie your effects are good but your story telling sucks"}, {"rating": "0", "text": "HORABLE!! Absolutely horrible endingâ"}, {"rating": "0", "text": "Pretty retarded,bad story line and the alien crap and copied War of Worlds.The alien ships had bad design and the \"burning light\" crap was a horrible concept of the also horrible movie."}, {"rating": "0", "text": "Boring. Amateurish. And miles away from being frightening except maybe how frightening the acting was. It shows that all the budget went to the spaceships and nothing else. There's really not much more to say except that it was a waste of time really."}, {"rating": "3", "text": "Very disappointing, after seeing the trailers i thought this could be great, i should have listened to the critics though! Great CGI effects, bad script, bad acting, bad ending."}, {"rating": "0", "text": "Finally a movie that sucks more than Battlefield: Earth.  This was one of the worst movies I have ever seen and I mean ever.  There was nothing good about this movie, the plot was horrid, the camera work was poo, and the acting was horrid as well.  I kept watching, hoping it was going to get better, but it didn't."}, {"rating": "2", "text": "Now here's a movie that could've easily got me scared because 'swallow' is in there, but instead, I was left off disappointed hoping something fascinating can happen and it turns out it didn't happen at all."}, {"rating": "3", "text": "A big disappointment, yet I think some are taking this too harsh. I agree with fbcking stating the first trailer had no relevance to the film. This is a cliched sci fi film with a terrible plot, and terrible acting to put the cherry on top."}, {"rating": "5", "text": "Random, boring at times, poor casting, and poor screenplay. Basically it was just special effects that made the movie even bearable until the end. The ending if anything was the only thing to actually grab my attention. The movie does not deserve a '1' nor does it deserve anything higher than a '5'. If they had played the movie out like it was in the end from the beginning it may have been good...Somewhat 'District 9'-ish with 'War Of The Worlds'."}, {"rating": "0", "text": "I cannot figure out how this movie made it to the big screen.  Could have fooled me if you told me this was a  high school project.  Terrible movie, weak 1st grade plot, cheesy awful dialogue and acting, and fake artificial special effects I could have done better with any movie making app on my computer.  I regret not walking out of the theater within the first 20 minutes like I was about to but stayed out of sheer curiosity to see how bad it could be and laugh at how bad it was.  I pray that God guides all the people involved with putting this atrocity in front of audiences to retire from the entertainment business and maybe try the fast-food industry."}, {"rating": "2", "text": "Skyline borrowed heavily from Cloverfield but added some twisted elements of its own that is plausable if executed right. Unfortunately, directors Collin/Greg Strause's (Aliens vs Predator) misunderstanding of the plot lead to an excruciating hour and a half of watching blue lights and funny looking aliens. Adding to the bad side of the movie came the dialogue. Laughable yet not funny at all, first time writer Joshua Cordes did an amazing job of trying to earn himself a Razzie award for Worst Screenplay. I can't say anything about the cast because apocalypse movies' cast is always the unknowns and are usually bad. But given all the negatives, I think the visual and CGI effects are a bit wonderful. With everything else aside, this is one of the better effects of the year. With admirable visual effects and CGI, Skyline still failed to deliver a good storyline and solid dialogue."}, {"rating": "0", "text": "Worst movie I have seen in ten years.The only reason I didn't walk out was that my wife fell asleep 20 minutes into it and I didn't want to wake her up.  I won't spoil the ending for anyone foolish enough to go see this piece of crud, but it was one of the worst endings to a film I have ever seen, if not the worst.  It was like someone came along and surgiclly removed anything that could have been considered plot, and replaced it with pointless filler.  Also, the acting and directing were on a junior high school level."}, {"rating": "9", "text": "I must have seen a different film from the rest of you.  I loved it!  Spectacular special effects and a story that keeps moving.  I loved that they didn't try to give us the feel-good \"Independace Day\" ending.  Sort of a cross between \"Cloverfield\" (without the shaky camerawork) and \"War of the Worlds\".  It is an alien invasion movie (that the plot folks) and it delivered even more than I expected. I will recommend it to all my sci-fi fans and will see it again soon.  I really thought it was a very good movie!!!"}, {"rating": "0", "text": "Stank .. don't even waste your time watching it for \"free\" when it gets released to broadcast in 6 months... I want my money back!  Hmm I got to come up with 150 characters for this review! What can you say! Its a greedy nasty Corporate Hollywood rip off! Did not even come close to the promise of the trailer! Should have read a few reviews before I wasted my money!"}, {"rating": "1", "text": "No need for a spoiler warnings because you've seen it all before in much, MUCH better movies.  Incoherent and illogical don't begin to describe the \"plot.\"  The special effects that supposedly make this dreck watchable were cutting edge in 1985 -- seriously."}, {"rating": "3", "text": "Without a doubt the worst movie I've seen this year. It's difficult to get an alien apocalypse movie wrong honestly, you just need some cool aliens, combat scenes and explosions, plus a little bit of drama wouldn't go amiss either. This movie is avoid of everything but the first point and the lack of budget is obvious, with limited variety in the alien types and special effects. The actors are universally poor, as is the sorry excuse for a script. The entire first 30 minutes of the movie are completely redundant and each character might as well be a cardboard cutout with one defining characteristic each. It is impossible to feel anything for these people when the acting is two dimensional and the script doesn't deliver a single line of good dialogue the entire time. The characters don't go anywhere, which is appropriate considering the movie doesn't either. This horrendous thing would not be out of place in the line-up of SyFy Original Movies, though it would do said line-up a disservice (consider that for a moment). This movie makes Independence Day look like the greatest science fiction work ever created. Don't lookup."}, {"rating": "3", "text": "Nothing special here, there isnt anything in this movie I havent already seen in alien invasion movies. The acting is below average and some of the characters can get a bit annoying at times. Judging from the reactions throughout the theatre most of the other audience members felt the same way. You can go see this movie if you want to but dont complain when you realized you just wasted 10 bucks on garbage."}, {"rating": "0", "text": "Let's see. Let's take a hit like Independence Day, mix it with some really bad scifi from \"movies\" like District 9 and War of The Worlds (Tom Cruise edition), throw in just a twist from Paranormal Activity and we'll give it a myseterious name with a great trailer. Don't fall for it. Biggest waste of money I've spent on a movie in recent memory."}, {"rating": "9", "text": "Great movie.ItÂ´s amazing.The best movie of alienÂ´s invasion since Independece Day.Good! Good! Good! Good! Good! Good! Good! Good! Good! Good! Good! Good!"}, {"rating": "1", "text": "In the Sparks song \"Cool Places\"(an ode to Los Angeles), which featured Jane Wiedlin on vocals, Ron Mael and the ex-Go-Go's bassist sang about going to these cool places and never wanting to \"cool down, cool down, cool, cool, cool.\" After all, Los Angeles is a town unlike any other. It's not Ontario, that's for sure. Concerning these places, the refrain \"I wanna go\" becomes a sentiment that moviegoers can relate with. \"Skyline\" is not Bruce McDonald's \"Pontypool\", the great 2009 Canadian indie whose action, brain-eating action, was also confined to one set. That zombie film had characters, especially Grant Mazzy, the disc jockey played by Stephen McHattie. \"Skyline\" has zombies all right, but they're not the aliens with an appetite for grey matter; they're the actors, all of whom deliver performances that rival porno ones. We root for these boring people to escape the confinements of Terry's high-rise apartment, because the cabin fever is mutual. We stare longingly at the theater exits. We could have stayed home and watched this sort of bargain basement sci-fi on basic cable. \"Skyline\" is not a wide release-caliber film. Jamal(Eric Balfour), new to L.A., along with his girlfriend Elaine(Scottie Thompson), starts the ball rolling when he proposes the idea of going to a relatively cool place: the marina, where the boats are, where he believes the aliens aren't. The aliens hate water, he theorizes, so they mobilize: five people, two cars, but before \"Skyline\" has a chance to get into gear, the car of adulterers(Terry and Denise, played by Donald Faizon and Crystal Reed) is demolished by an alien, just as it emerges from the parking garage. No road trip; no cool places, even relatively cool ones like the marina, because \"Skyline\" doesn't have the budget for a full-fledged escape from Los Angeles. Whereas \"Pontypool\" evoked the 1938 radio broadcast of H.G. Wells' \"War of the Worlds\" by insinuating the action via audio, \"Skyline\" projects its invasion on a flat-screen television, as a result of the link-up between the telescope and the monitor. Both films re-imagine a scenario in which the Mercury Theater's rendering of the alien invasion, narrated by Orson Welles, was real. Appropriately enough, \"Pontypool\" had a captivating voice to convey the attack, while \"Skyline\" lets the action speak for itself, fodder for the screen, as the US military's fight with the enemy gets translated into visuals, turning the speaking-challenged actors into an auxiliary audience. Ultimately, Jamal does end up in a cool place(climate-wise), the alien spacecraft, along with his pregnant girlfriend, once these discriminating extra-terrestrials get their fill of brains, metropolitan brains(L.A. and New York) exclusively, according to the time-log: no Bible Belt brains, no Dustbowl brains, no Appalachian Mountain brains are not good eatin' by these otherworldly creatures' lofty standards. \"Skyline\" ends with a \"minimum of chit-chat\", as Jamal, whose consciousness now survives in an alien body, makes human contact with Elaine through touch, like some dystopian version of \"E.T.: The Extra-Terrestrial\". Just when things finally, FINALLY, gets remotely interesting(staving off a zero rating), \"Skyline\" ends, strangely enough, on a high note."}, {"rating": "8", "text": "im suprised ... from all the negitive reviews i thought this movie was gona be a real stinker. i actaully thought it was a pretty decent movie and im a pretty harsh critic . maybe cause i went in waching it thinking it was gona be crap and had my expectations very low it didnt leave me with any hype it was going to be good. i thought the special effects where fairly decent . the acting i thought was ok . i kept hearing how terrable it was . i was expecting acting as bad as The last Air bender where i was just cringing every time any of thoose kids opened there mouth . the action was pretty good and i was entertained through it had some pretty good suspense once it took off . about my biggest gripe was the ending . its a pretty much lets get ready for the sequel thing . which im not sure how well this movie did at the box office to know if there will even be one . granted its not a great SCI-Fi movie but its still a good one i thought. hell id wach it again."}, {"rating": "1", "text": "This movie gets one point for the special effects. The rest of the movie sucks. The whole movie nearly takes place inside the apt building where mysterious lights land and end up being an alien race on a brain eating agenda .. the movie never changes scenes except for the end and a point where the people try to escape....there is no story actually but a moral of you should not pay movie ticket price for this crap"}, {"rating": "0", "text": "Without doubt one of the worst films I have ever seen. WHO decided this should be made?  Film is full of effects, no actual story and all set in a bloody apartment building, and the ending is actually beyond the ridiculous.TERRIBLE AVOID."}, {"rating": "0", "text": "They should have picked up the unmanned vehicle clash scene and they messed it up. I didn't hate it because of the actors (who can't act if their lives were on the line), I hated it because they did the military intervention so terribly. Whoever says it was like starcraft is STUPID. Waste of money and a definite waste of time it was. Battle: Los Angeles is the movie to see. At least they got it right."}, {"rating": "0", "text": "Unwatchable BS. No storyline. No plot. Cheesy, schmultzy just plain bad. Can't help but feel sorry for he actors. DO NOT WATCH! As Boring As Staring At a White Wall. Can't call this rubbish Sci-fi. It's too insulting to the genre."}, {"rating": "4", "text": "Pretty boring at times. Almost dozed off at one point. Disappointing over all. As exciting as the trailers for this film looked I definitely wish I had waited for it to hit Pay Per View at home."}, {"rating": "0", "text": "This is the worst movie in history. Other than the last airbender.  Between bad actors and even worse filming. This movie will go down in history as how to perform cinematic suicide."}, {"rating": "0", "text": "THIS MOVIE IS THE WORST MOVIE I HAVE EVER SEEN....HANDS DOWN.  I HAVE SEEN BETTER ON THE SY-FY CHANNEL.  I WOULD BE ASHAMED TO BE ASSOCIATED WITH THE FILM AS AN ACTOR, DIRECTOR AND MORE SPECIFICALLY WRITER.  SPECIAL EFFECTS DON'T MAKE A MOVIE - A STORY LINE WOULD BE HELPFUL - THIS ONE SUCKED."}, {"rating": "0", "text": "This is most definitely the worst movie I have ever seen. No depth of characters, little background, most of the movie is set in an apartment with scared people quivering for their life."}, {"rating": "5", "text": "waited, but not worth it...nothing else to say"}], "recommendations": ["the_darkest_hour", "war_of_the_worlds", "2012", "geostorm", "battleship", "knowing", "into_the_storm", "transformers_age_of_extinction", "legion", "the_predator", "the_tomorrow_war", "the_matrix_resurrections", "the_legend_of_hercules", "transformers_the_last_knight", "shadow_in_the_cloud", "independence_day_resurgence", "the_new_mutants", "jurassic_world_dominion", "jurassic_world_fallen_kingdom", "ghost_rider_spirit_of_vengeance", "district_9", "volcano", "teenage_mutant_ninja_turtles", "transformers_revenge_of_the_fallen", "cloverfield"]}