{
  "id": 869,
  "title": "Skyscraper",
  "starring": [
    "Dwayne Johnson",
    "Neve Campbell"
  ],
  "runtime": 102,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Framed and on the run, a former FBI agent must save his family from a blazing fire in the world's tallest building.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/52ml62vClzrlqvXZq2FEW6UF6c1.jpg",
  "categories": {
    "plot": 4.5,
    "acting": 4.485714285714286,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 4.0,
    "action": 5.6
  },
  "reviews": [
    {
      "rating": "5",
      "text": "It isn't anything groundbreaking nor is it really anything that good, but compared to some other movies that came out this year, there are worse ways you can spend 2 hours."
    },
    {
      "rating": "4",
      "text": "\"San Andreas\" was Dwayne Johnson's most fun as an action hero. Then, came \"Rampage,\" which was not. This time, they've heaped the absurd situations and ridiculous odds high enuff to reach the top of the titular structure. His character is hired as a security consultant on this incredible new building (the highest in the world). When it's sabotaged, he has to save the day and his family. Single-handedly, he overcomes outrageous obstacles and a fleet of armed baddies, but none of it is especially thrilling or even over the top in a fun way. It's big, splashy and predictable...and it's time for Johnson to find a new genre (or director)."
    },
    {
      "rating": "4",
      "text": "Whatever you do, don’t look down! Hope that you aren’t scared of heights, because if you are, Dwayne “The Rock” Johnson’s newest film might be a little hard for you to swallow and watch.The hardest working actor in Hollywood is back, and this time, teaming up with the man behind the hit cult comedy Dodgeball: A True Underdog Story and We’re The Millers. But instead for opting for a straight up comedy, the two team up to deliver a Die Hard inspired and overly-stylized The Towering Inferno film that is meant to be the ultimate summer movie. Skyscraper is blockbuster, Hollywood entertainment like we have never seen before. Taking cues from the best and worst summer blockbusters before it, Skyscraper is a non-stop, high octane, adrenaline filled popcorn flick for everyone.Like any movie Dwayne Johnson does in his career at this point, he adds his undeniable charm and heart into each and every project, and the same could be felt with his newest. What makes Johnson’s Will Swayer so likeable, aside from the fact that he is the ultimate family man, who will back down to no challenge involving his family, is the fact that he is modelled like any family man before him. Relinquishing his duties form the military following a rescue mission gone wrong, Will is faced to live the rest of his life with only one leg. Luckily for him, with every painful path in life, comes beauty. Sparking a romance with the doctor who saved his life, Will finds his life ten years later in Hong Kong, as a security assessment official, who must now give his expertise and knowledge to the largest free-standing building in the world, The Pearl. With a little help from an old friend Ben (Pablo Schreiber), Will pitches his small-business motto to Zhao Long Ji (Chin Han), the architect behind The Pearl, only to land the biggest deal of his life. Excited to share the news with his family, Will celebrates his big accomplishment with his best firmed Ben, only to find that The Pearl has been taken hostage and set ablaze, with his family still in it.From the first day of production, Skyscraper was always hailed as a homage to so many high-rise tension filled films before it. While no one ever believes anyone will be able to replace John McClane, Johnson is easily a very comparable action star with massive commercial appeal. Oozing with charisma and charm, Johnson’s character will not only becomes likeable for his personal quality traits and his unpardonable love for his family, but I’m sure that one of the biggest selling points of this film, was the fact that Johnson’s character is in fact, disabled. It is almost unheard of that action stars are in fact, disabled ex-military personnel who are still capable of kicking butt and beating bad guys. Not only does Johnson play Sawyer with class and bravado, but the film also highlights many times where his prosthetic legs becomes a tool for rescuing his family, as opposed to a weakness. This narrative driving force, and this one alone, is one of my favourite and most enjoyable, as well as respectable character traits, in recent memory in the summer blockbuster genre.It is no surprise that Hollywood loves Johnson right now, inflicting him into, practically, every franchise available at the moment. With that said, it has come to a surprise to me that Johnson has not been inducted into the MCU yet, but I am sure time will tell.While many would be surprised to seer Neve Campbell cast as Sarah Sawyer, Johnson’s wife in the film, it only goes to show how powerful Johnson’s presence is on screen, even when actors who have been absent from the silver screen are able to come back to revive their careers for smaller roles like this one. While the only name that matters on the movie posters may be Johnson’s, one of the best actors cast in the film is a person favourite of mine, Roland Møller, the certified baddie in Skyscraper. While Møller’s Kores Botha doesn’t have much intent, fibre or much to do or say within the film, but it is always great seeing foreign actors breaking through into Hollywood films. Møller was astonishing in one of my favourite foreign films in the last couple years in Land of Mine. Skyscraper surely will have many palms sweating, many hearts racing and people forcing themselves to cover their eyes thanks to some very crazy and absurd stunt work and visual effects of Will Sawyer jumping, dangling and racing in and around the fictional largest building in the world. Skyscraper is the typical escapist summer blockbuster film of the year, and one that, for maybe two hours out of your summer, will be a satisfying retreat into the air-conditioned theatre away from the heat that is outside, even if more than half the action in the film is borderline ridiculous.Skyscraper is just another entry into the very expansive filmography of Dwayne Johnson, further reinforcing just how wonderfully suave and likeable he really is."
    },
    {
      "rating": "4",
      "text": "“This is stupid.”Well at least it knows.‘Skyscraper’ is a disposable action flick starring Dwayne ‘The Rock’ Johnson. Just looking at the advertisements you can already tell it’s gonna be those type of movies where you have to accept it to enjoy it. If you watched the trailer where Dwayne jumps off a crane into another building to rescue his family who are trapped inside, before cutting to the release date. It’s absurd, although looks fun. Might follow the same path of ‘Fast & the Furious’ type of ridiculous, yet fun. However, what really took me by surprise is how the movie doesn't quite embrace it’s stupidity, and instead goes for a more serious tone. So during those ridiculous moments, when I meant to switch off my brain and enjoy, but I couldn't buy into it. Basically it’s ‘Dike Hard’ and ‘Tower Inferno’, drowned out in CGI.I know those comparisons have already been made by many people and the marketing campaign seemed to catch on by releasing spoof-like posters of those two films. What some have failed to bring up it’s not just those two movies it’s ripping off, as there’s plenty more. Literally every action movie ever, just done better before.Die Hard? more like ‘Try Hard’.Dwayne Johnson can make anything watchable. The dude is instantly likable in everything he’s in; both on screen and off. In this movie it’s no different. Although It’s not one of his best and we have seen better from him. Dwayne character is basic family man saving his wife and kids. The charisma was lacking and you expect more from The Rock in terms of picking roles. There’s no witty banter between other characters to flesh him out or anything. Overexposed maybe?Neve Campbell delivered a decent performance and it’s great seeing her back. Unfortunately, just like Dwayne Johnson, she has no character besides being a plot device along with the children.So let's talk about the villains, and yes I say “villainS” because there’s are so many the film keeps shifting focus. The bad guys are generic and not threatening at all. It’s even more funny when you realize there was no thought about their plan for it to work- allowing only on luck and convenience. They morons.The biggest strength I thought the film succeed on was playing on your fear with heights. My hands started to sweat and your heart begins to beat faster. You’re afraid to look down. I thought those scenes was well done, especially the close calls moments.Also the opening scene was pretty good. The way it opened was tragic and really sad, but that doesn't last very long.Overall rating: Better get more duct tape."
    },
    {
      "rating": "5",
      "text": "Dwayne Johnson was hired once again by Rawson Marshall Thurber to recreate an experience that has already existed for quite some time but only in a skyscraper so the movie can easily fool its audiences into thinking this is the most creative movie from Thurber's directing career."
    },
    {
      "rating": "8",
      "text": "Looking for a brainless action packed movie for a cold winter night?Then this is the movie for you, if you looking for a good story, i suggest to walk away. The strenght of this movie is the good special effects, a decent cast and the typical hollywood grandeur. For this reason the movie gets a high score for me. You can't compare it to different genres or other movies that are oscar worthy... Just sit down and enjoy this over the top action movie. ;-)"
    },
    {
      "rating": "3",
      "text": "lacks a layered surface to scratch on..13 July 2018Skyscraper1 And A Half Out Of 5Johnson's character in the beginning of the feature, says \"I'll just high-five the guy\" after attempting to wish in a foreign language, which unfortunately seems to be the motto of the makers - if impossible to justify it, just sleep over it or more accurately leap over it.Skyscraper is a plot driven commercial feature about a guy pushing his limits to save his family despite of being restrained and barred by the nature. It is short on technical aspects like visual effects, (which is a downer considering that it depends a lot upon it) sound department and better editing. It is shot decently with some pleasing scenes here and there, that are implemented to attract the viewers which too wears off sooner than expected. The writing is cheesy, corny and amateur with forced humor installed to balance the commercial aspect of it which isn't palpable to Johnson's character whose effort to breed the sincerity and seriousness communicates unevenly. The characters are loud, unnecessarily expressive and aren't polished appropriately, leaving them a bit chalky around the edges to swallow. The action sequences are shot brilliantly with Johnson in command who hits hard and brutal with convincing hand-to-hand combat where his hard work is clearly visible on the screen. He is good on physical sequences although struggling; even though improving, on acting skills and also isn't supported to that extent by the supporting cast like Neve Campbell and Chin Han.Rawson Marshall Thurber; the writer-director, seems to have taken the opportunity granted for neither his sloppy writing nor shallow execution convinces the audience to be invested in it. The Johnson's hard work and few choreographed action sequences are the only high points of the feature.Skyscraper lacks a layered surface to scratch on, for the revealing hollowness in a material is neither impressive nor advantageous."
    },
    {
      "rating": "4",
      "text": "It's unashamedly a pure action film. See it on the big screen and preferably in 3D. There's good tension in the action sequences and Dwayne is pretty convincing in his role and in portraying the terror and desperation of fighting to rescue your family from a burning uber-skyscraper.  But, the  plot and all that follows is not novel.  Most disappointing was that we never really got to know the intricacies of the villains.  We had their story and identity but that was all.  Their characters were flat and had no personality.  It's a film you enjoy and then forget."
    },
    {
      "rating": "10",
      "text": "Loved this movie! The Rock is a great action hero with a lot of heart. Many exciting, suspenseful moments, wonderful supporting cast, and a really fun tip of the hat to other films like Die Hard and Towering Inferno while still maintaining it’s own excitement and story line."
    },
    {
      "rating": "5",
      "text": "It’s fine. It's literally the definition of a *fine* movie. You’ve seen it before, you know every beat and outcome before the characters even do. Only question is how much escapism you’re looking for."
    },
    {
      "rating": "5",
      "text": "I would not have gone to see this movie if it wasn't for movie pass. It was a perfectly good movie to pass some time with. It was decently entertaining, the plot was passable, the dialogue was ok. But otherwise it was mostly predictable and nothing to write home about. If i had to spend money on this movie I wouldn't watch it in theaters."
    },
    {
      "rating": "7",
      "text": "OMG, I simply loved this action packed, not a whole lot of story, somewhat over the top action movie! It's not some artsy pretentious movie that you're just supposed to love because it's art, but an exciting movie you can actually enjoy because it's simply pretty darn great! that's what I recommend: enjoy this movie!"
    },
    {
      "rating": "2",
      "text": "This is a bad movie. Its not the worst movie ever made but still pretty bad. It copies Die Hard a lot and I mean copy. Not similar, there are some scenes that are direct copies of Die Hard. But other than that it has a bad plot and villain. Halfway through the film I had to do a spit take when I realized the guy I thought was just a run of the mill henchmen turned out to be the main villain."
    },
    {
      "rating": "5",
      "text": "Skyscraper follows Will Sawyer (Dwayne Johnson) as he is invited to the a new building, which happens to be the world's tallest, to do a security check that will allow for them to open up the residential portion of the building. We soon learn that the person who got him the job set him up, and then he gets lured away from the building and roped into what is essentially a heist story. The building is set on fire, and his family and the bad guys are in the building, so he jumps off of a crane to get back into the building to beat up some bad guys and save his family. That's basically it. This is a 90s-era action flick released in 2018. Clearly the team behind this film knows that, too, as one of the posters they put out while marketing the film had a 90s theme to it. Unfortunately, this isn't the 90s anymore and really this isn't even a good 90s action flick. The action is mediocre and honestly this isn't the best character Dwayne Johnson has played in his recent onslaught of the box office. He's charming, but humor is one of his strengths and there isn't a lot of it in this film. It's mainly him doing unbelievable thing after unbelievable thing until he achieves his goal of getting to his family. The story also takes a few leaps towards the end that I just couldn't get behind, most notably something related to how the fire containment system works at the beginning of the movie compared to the end. There's also some odd pacing in this story that we're supposed to just ignore because it's an action movie, but some of it is just so unbelievable I couldn't help but laugh. Don't expect any great dialogue here, either, as the script is mediocre at best. But, is it entertaining? That is usually the saving grace of these kind of movies. And, well...yes, it's entertaining. This is a film that will allow some people to turn their brain off for nearly two hours, eat some popcorn, and enjoy the show. It's incredibly forgetful, though, and I don't think I'll ever watch this one again."
    },
    {
      "rating": "6",
      "text": "Fancy special effects, but cheap quality.Skyscraper is just another poorly-produced film made to generate profit as quickly as possible while pleasing audience with special effects and action scenes. There are some few scenes where it's intimidating, but overall, it's poorly made. Crappy dialogue, lack of character depth, and so many cliches."
    },
    {
      "rating": "8",
      "text": "Skyscraper is a movie I love rewatching the very beginning is perfect with the pass is awesome but after that, an enjoyable movie that I really enjoy watching the entire movie is about this building which is a cool idea to have the villain is good to me with the pass and stuff and that is why he does what he does in this movie to try to get it back which does make sense I think what makes me fall interest a little bit in this film is Will Sawyer why does he do everything perfect why is there no risk so really there is no risk in this movie which does annoy me but all around a fun watch with that issue I have but after that I actually really like this movie I don't think it is that bad as it seems to some people so I give Skyscraper a B-"
    },
    {
      "rating": "0",
      "text": "Well this sucked...AWFUL! Just how awful? Find out and save your money this weekend! https://youtu.be/DdjWpIVkhi0"
    },
    {
      "rating": "2",
      "text": "Piece of crap.Rock should stick to making kids films. He's not Harrison Ford or Ahhhnold or even Stallone . He just plays at being them."
    },
    {
      "rating": "8",
      "text": "Former FBI Hostage Rescue Team leader and U.S. war veteran Will Ford now assesses security for skyscrapers. He's on assignment in China when he finds the tallest, safest building in the world suddenly ablaze, and he's been framed for it. A wanted man on the run, Will must find those responsible, clear his name and somehow rescue his family, which is trapped inside the building, above the fire line. I enjoy Dwayne Johnson's last film, \"Rampage\", and so I think this was even better.With it's well-cast yet derivative, Skyscraper isn't exactly a towering action thriller feat, but it's solidly constructed enough to stand among the genre's more mildly diverting features. Final Grade is a B+."
    },
    {
      "rating": "7",
      "text": "Exactly what you expect from the movie and it gives that, fully.  Nothing new, except that it does give The Rock the full show and the director does not muck it up with silly side character development.......just action from about 45 minutes on."
    },
    {
      "rating": "0",
      "text": "How did this movie get even ok reviews? Consider the bridge scene Dwayne and what Army?  Consider the plot of the unhackable tablet...Consider the motivation for getting to the billionaire...Consider the lack of an ending...Consider why fire suppression only works when they need it to...Consider the escape plan for the badies and why they were unprepared?Not one thing makes any sense here...  I mean action movies aren’t known for that but they aren’t usually so unapologetic about being impossible.... worst Dwayne Johnson movie I have ever seen... if there is a plus side it’s that some of the imagery/landscape was good.  It’s also a good message about karma and positive ideology."
    },
    {
      "rating": "7",
      "text": "I probably liked the film a little more than the critics-at-large.  I mean, sure, it's no Die Hard. The baddies aren't nearly as well-developed or as \"fun\" has Hans Gruber, but you'll have fun with this film, for sure. Surprisingly, Neve Campbell was a little flat in her performance.  I expected more.  And the Pearl concept could have / should have been better utilized, but hey, I had fun.  3D is not necessary, by the way."
    },
    {
      "rating": "4",
      "text": "Adding The Rock into this regurgitated amalgamation of Die Hard and Towering Inferno isn’t enough to salvage this disaster. Sorry Rock, but you just got checked into the dilapidated Smackdown Hotel."
    },
    {
      "rating": "7",
      "text": "Skyscraper ReviewCinematography: 8.442/10 The film flows seamlessly and looks good.Costume Design: 8.493/10 Definitely well thought of and given importance from the beginning of the film.Film Editing: 8.921/10 Talk about capturing and using just the right amount.  Make-up and Hair-styling: 7.893/10 Decent.Sound Editing: - /10 Visual Effects: 8.321/10 The Pearl is as real as Barad-dur (though a bit more believable due to its context).Story: 7.931/10 The story focuses on the idea of families and purposes from the ideas of a generally-traditionally known family to crime syndicates to justice units. More than anything else, the story is entertaining. Acting: 7.931/10 The film does heavily rely on Dwayne Johnson's acting abilities but balances the other actors well in accordance to fulfill the story. Personal: Skyscraper reminds me of San Andreas (which is the last film I've seen with Dwayne Johnson in it). Every film I've seen with Dwayne Johnson always makes me feel like that moment in San Andreas with him giving CPR. Plus, it's always fun watching flares of the Rock: am I the only one appreciating the Jumping Clothesline in Skyscraper?Overall: 7.062/10-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "5",
      "text": "How is it that Dwayne Johnson has become a movie star by doing the same thing over and over again?What does that say about modern audiences?"
    },
    {
      "rating": "10",
      "text": "The movie was great, it had everything a summer blockbuster had to have. The movie gave me vertigo 5 times and the action scenes made me nervous. So yeah i would recommend the movie."
    },
    {
      "rating": "4",
      "text": "It's pretty entertaining, and creative for a \"typical summer blockbuster.\" Is it Die Hard good? Not even close. Would I watch this again? No; plot is simple and I pretty much got everything I needed to understand the lack of thought put into this. There are some pretty gaping plot holes, but the performances are pretty ok."
    },
    {
      "rating": "5",
      "text": "Dwayne Johnson maybe a charismatic performer, but he definetelly can't save this 'Die Hard/ Tower Inferno' wannabe from being a total bore. The action sequences are ridicilous, and not in any moment that you believe that the 'Rock' is in great danger.  Even on a 'brain dead' level, this picture is not a great one. Just put on your streaming services and watch Die Hard again instead."
    },
    {
      "rating": "5",
      "text": "A water down version of several other action franchises. If you check this out on Netflix or some other streaming service, you might have a good time but it's nothing you have to go looking for. Overall a low 5 a C."
    },
    {
      "rating": "2",
      "text": "The lame generic lacking in creativity title tells you everything you need about this dopey \"Die Hard\" meets \"The Towering Inferno\" (both good titles) auto assemble.  The highest paid star now in Hollywood is indicative of the state of the industry since not only has he never made a single good movie (even Arnold made some good ones) and an awful lot of atrocious ones including roles beneath even a former wrestler, but his box office doesn't even back it up and that's taking into account it's all based on international sales not his poor domestic openings.  It simply must be his larger than life cartoon persona that stooge execs fall for.  This particular cartoon comes off as written by an eight year old with say King Kong being a far more realistic character than The Rock portrays here or anywhere."
    },
    {
      "rating": "8",
      "text": "Una típica, pero bastante buena visualmente, verla en 3D es una experiencia vertiginosa, no la recomiendo en este formato para aquellas personas que realmente sufran de vértigo, por otro lado me encantó volver a ver a Neve Campbell en la gran pantalla, en el fondo trae mucho de Sidney Prescott consigo misma."
    },
    {
      "rating": "6",
      "text": "Feels like a nice bookend to \"The Meg\" for the BIG summer films that don't add up to much, but are good ways to eat tubs of buttery popcorn, sit in an air conditioned theater, and see stuff get blown up. DJ is solid as usual, but it's nothing special.  Not his best work."
    },
    {
      "rating": "7",
      "text": "Skyscraper is an adequate action film in that it is entertaining enough but isn't something you need to put on the top of your must-see list.The plot is very predictable. It's basically Die Hard-light with some other action movie cliches thrown in. The obvious dialogue doesn't do the film any favors. Neve Campbell and the Rock are both charming actors, but even they could do so much with what they were given. The Rock's old FBI buddy is an exceptionally sore spot as he is a trifecta of poor dialogue, characterization, and acting.Still, the film remains watchable due to the action as there are some pretty nice fight and building disaster scenes. I really liked a closed-knit fight near the beginning where both characters do a lot of damage to each other. The Rock's character having a prosthetic leg was a fairly novel idea that was well utilized for the survival and action elements.Also the film looks nice. The quasi-futuristic tower it takes place in is a semi-unique design that helped elevate everything."
    },
    {
      "rating": "4",
      "text": "Die hard but I actually die from how boring and plain the movie is. Dwayne 'The Rock' Johnson can't save this one"
    },
    {
      "rating": "8",
      "text": "This was the first film in ages that kept me close to the edge of my seat. A thrilling ride which I’d more than happily pay to see again. 8/10."
    },
    {
      "rating": "10",
      "text": "En: Exciting, action-packed movie with good special effects in a futuristic skyscraper! The visit to the cinema was really worth it!"
    },
    {
      "rating": "2",
      "text": "Dwayne has charisma, but not enough for this dumb, bloated movie.I really like Dwayne Johnson in movies. He has charisma and charm. Decent enough actor (for the genre).However, this movie has a story that is thin in spots it shouldn't be, and convoluted in other spots, merely to set up one preposterous stunt or CGI sequence.I like a good action/disaster thriller, and I don't need every movie to be \"Citizen Cain\", but this one is not worth the time.If you're feeling like you want to see an action movie like this one, do yourself a favor and watch the original version, which was titled \"Diehard\", starred Bruce Willis, and came out in 1988."
    },
    {
      "rating": "5",
      "text": "Has a certain appeal but maximises stupidity over smarts for the most part."
    },
    {
      "rating": "5",
      "text": "This movie was fine. It beat my expectations (which to be fair wasnt a difficult feat) and as per usual i enjoyed every minute of Dwayne Johnsons screen time, the man is walking charisma. Nothing like a must watch but you could certainyl do worse than watch this movie."
    },
    {
      "rating": "5",
      "text": "Skyscraper is nothing to write home about. It literally does what it says on the tin. The Rock has to save his family trapped in a skyscraper filled with terrorists. Not much else to say."
    },
    {
      "rating": "4",
      "text": "\"Skyscraper\" is the definition of a popcorn film. It is fun, derivative, predictable, action-packed to the brim, filled with a measly plot and underdeveloped characters, but also never boring. Just wait for it to come on TV."
    },
    {
      "rating": "5",
      "text": "I mean, it wasn't bad by any means. It just wasn't that good. Usually I am a fan of what Dwayne Johnson is in because he has made so many good movies but at the same time I also realize that he has been in so many movies now that there is going to be ones that don't live up to the hype of others. The main problem I had with this movie is that it was simply predictable, it was something where you wouldn't even have to really think about what would happen next. It was just something that continued on and on and you knew the plot the entire time. While I think that this can make a decent movie, I think a good movie requires the viewer to truly think and attempt to predict what will happen next."
    },
    {
      "rating": "6",
      "text": "The Rock is incredible in this, again proving he has the acting chops to succeed in Hollywood. The performances as a whole are very strong, Neve Campbell is fantastic as a strong and capable wife. The problem with this movie as a whole, while it obviously \"pays homage to Die Hard, Towering Inferno, ect\" theres a difference between paying homage and ripping off. With that being said, it's a solid film but could have benefited more from being it's own film."
    },
    {
      "rating": "5",
      "text": "The movie was ok, but the story is used so many times, in many different settings, that it basically did not bring anything that really interesting here. And I think this is a typical ''popcorn'' movie that is only good when watching in cinema, to fully see the special effects etc. Without that, it is quite average."
    },
    {
      "rating": "2",
      "text": "Lo unico bueno de esta basura es el protagonismo compartido y que lo vi de un torrent. Lo demas es incompetencia creativa sobre una plantilla basica de narrativa y estructura."
    },
    {
      "rating": "5",
      "text": "Skyscraper was an entertaining but very simple movie, Dwayne Johnson continues to give us good characters, this time he made a little weaker than all the other characters he made, but he still showed strength, but he still makes good performances in regular movies except for Jumanji, history looks entertaining but it was reduced to something simple and the impact it was going to give is medium instead of being high, but it is still enjoyable."
    },
    {
      "rating": "6",
      "text": "Well, this movie cannot be taken seriously. A mercenary puts the highest building on fire to get what he wants. And what if there is a copy of it? And the villain girl wearing big earings? What is the deal with that? Surely they cannot help her in fight scenes or can they?Rock is great as ever but the whole idea of the movie is as weak spot."
    },
    {
      "rating": "9",
      "text": "Skyscraper is a very Hollywood movie. \"The Rock\" is a former FBI agent who helps his family in a fire. He fights with terrorists. I was impressed by Johnson's actions. He never made me sleep. Many critics say \"This is a recycled movie of \" Die Hard\". But computer graphics are beautiful. \"Skyscraper\" is much better than \"Die Hard\". This is a very international movie. It made me feel like living in Hong Kong. This is a 'popcorn movie\". You just enjoy \" The Rock\"! I want to watch it one more time."
    },
    {
      "rating": "8",
      "text": "SkyscraperNous sommes devant le film [spoiler]    \"Piège de Cristal\"    [/spoiler]    de Dwane Johnson..Le bâtiment est stylé ! C'est bien rythmé ! La réalité est oubliée ! Les scènes sont folles !Clairement un film comme je les aime.. Juste du fun !!"
    },
    {
      "rating": "6",
      "text": "The movie is enjoyable and entertaining, but it is also too predictable throughout the whole movie. The acting was mostly pretty good, with some weaker scenes. The movie was a little too unrealistic, and a lot too predictable (throughout most of the movie). Even with those things though, the movie was still very fun and entertaining to watch, which is something I was wanting from the movie. I recommend it, even though it is predictable."
    }
  ],
  "recommendations": [
    "san_andreas",
    "bloodshot",
    "angel_has_fallen",
    "poseidon",
    "lockout",
    "infinite",
    "kingsman_the_golden_circle",
    "the_ice_road",
    "escape_plan",
    "the_a_team",
    "london_has_fallen",
    "hercules",
    "xxx_return_of_xander_cage",
    "the_guardian",
    "the_transporter_refueled",
    "free_fire",
    "triple_frontier",
    "avengers_age_of_ultron",
    "rampage",
    "the_fate_of_the_furious",
    "the_meg",
    "nobody",
    "the_losers",
    "into_the_storm",
    "ant_man_and_the_wasp_quantumania"
  ]
}