{"id": 1800, "title": "Sleepy Hollow", "starring": ["Johnny Depp", "Christina Ricci"], "runtime": 105, "genre": ["Drama", "Fantasy", "Thriller", "Mystery", "Horror"], "description": "New York detective Ichabod Crane is sent to Sleepy Hollow to investigate a series of mysterious deaths in which the victims are found beheaded. Locals believe the culprit to be none other than the legendary Headless Horseman.", "releaseYear": "1999", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/coNhvSgZ7bpoyhEWckY6JDusuiP.jpg", "categories": {"plot": 7.2105263157894735, "acting": 6.894736842105263, "ending": 7.0, "soundtrack": 8.0, "cinematography": 7.4, "familyFriendly": 3.0, "funny": 7.111111111111111, "action": 3.3333333333333335}, "reviews": [{"rating": "10", "text": "Sleepy Hollow has great effects and acting in a creepily effective tale. The whole movie is exciting,\rrefreshing and every moment is enjoyable. If you're looking for a epic horror thriller, Sleepy Hollow\rwill satisfy your palate."}, {"rating": "9", "text": "Fresh spin on the classic story. Love the contemporary twist. After watching the pilot episode, I am now intrigued and committed to watching the next few episodes. Good writing, good acting, great imagination, all the ingredients for potential greatness. Hopefully, the series lives up to this great pilot."}, {"rating": "10", "text": "The best movie with Tim Burton and Johnny Depp working together (except for possibly Edward Scissorhands). This puts a modern and dark spin on the old Hallowe'en tale. The aesthetics are creepy and the performances of the actors and actresses are great. The story is great. Johnny Depp is absolutely excellent in his role as Ichabod. This movie was an instant classic the day it was released."}, {"rating": "10", "text": "We all know that Tim Burton is the master of  goth and shock especially his films that are classic like Edward Scissor hands , Beetle Juice ,  Nightmare before christmas and Ed Wood). But Burton was a master of horror with \" Sleepy Hollow\"  and based on the short story by Washington Iriving the visions of Burton and co- producer/headless horse men effect Kevin Yagher resurrected the Iriving's story and put it perfectly in Burton anf Yagher's vision. Grade A +  BEST TIM BURTON FILM EVER !"}, {"rating": "10", "text": "Thrilling and action-packed with clever twists. Crane's character has a quirky and funny portrayal."}, {"rating": "10", "text": "Thai movie, it's more than amazing, i love it, YOU MUST WATCH !Tell me your thoughts ?"}, {"rating": "10", "text": ",,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,++++++++++++++++++++++"}, {"rating": "10", "text": "-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"-\"+×÷=+×÷=+×÷=+×÷=+×÷=+×÷=+×÷=》》》》》》》》》》》》》》》》》》"}, {"rating": "10", "text": "One of the best and most incredible Tim movies. The story despite being scary and quite light and funny . Recordings in cold forests , very crazy! The film and long , unfortunately does not have three hours , I would love a extenssão this pearl , Depp further complements the film with his talent. I love that movie at all."}, {"rating": "10", "text": "Sleepy Hollow is the ultimate Tim Burton movie. ()()()()()()()()()()()()()()()"}, {"rating": "10", "text": "Winona Ryder was offered the role of Katrina Van Tassel, but turned it down. ^^^^"}, {"rating": "10", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "8", "text": "A fun horror film with with fun visuals but not lacking for a good story.  A pretty good job staying true to the original tale, but it is very dark which adds a really sense of evil in the headless horseman."}, {"rating": "8", "text": "Really enjoyed this. Worth owning. Visually brilliant, acting is high quality all the way through."}, {"rating": "9", "text": "One of the most greatest films I have ever watched...Its like the twin movie of dracula... Combination of fun,romance and horror."}, {"rating": "9", "text": "I loved this movie! Almost everything was perfect, besides a few things that the editor should have caught, but I suppose every movie has that."}, {"rating": "8", "text": "Tim Burton delivers a fantastic tale of the legendary Sleepy Hollow, which, though not without its flaws, manages to be a thoroughly entertaining program."}, {"rating": "7", "text": "Tim Burton has brought this timeless classic to life! \"Sleepy Hollow\" is a very fine film, with horrific delights, a touch of romance, and witty humor. I was very impressed with the cinematography and the elaborate costumes in this film. Also, the music and sound effects complimented this frightening and legendary story of the murderous Headless Horseman. Overall, I believe this is an excellent film and will definitely be remembered as a landmark in the thriller/horror genre of film."}, {"rating": "7", "text": "Tim Burton  o rei das coisas esquisitas porém esse seu toque pessoal transforma suas películas deixando  as únicas esse foi caso desse filme que com certeza o visual sombrio da um ar de beleza."}, {"rating": "1", "text": "Un film (presque) sans queue ni tête dans lequel on ne sait plus où donner de la tête au fur et à mesure que les personnages caricaturaux perdent la tête. On sait que Tim Burton a un drôle d'humour, le genre d'humour pas drôle mais tout de même, ce Sleepy Hollow est décidément trop creux pour convaincre en quoi que ce soit : il perd à la fois sur les deux tableaux, celui de la comédie et celui de l'effroi.Assez vite, malgré Johnny et son rôle de détective dilettante, le Sleepy en vient à nous endormir par sa routine répétitive et son scénario téléphoné ; il nous prend donc bien la tête pendant plus d'une heure et demi avec ses conneries de gamin et ses clins d'oeil grotesques.Christina Ricci est une pimbêche qui roucoule et tape sur les nerfs tandis que le reste de la troupe est toujours à la limite de la bouffonnerie, la faute surtout à Tim Burton et à sa prétention qui fait tourner le film en eau de boudin surannée et démodée avant que d'être : un gros pétard mouillé."}, {"rating": "3", "text": "A convoluted mess of a departure from the original classic story. Burton tries to direct his way out of the creative sidecars with heavy action scenes like a Schwarzenegger film. The beginning of Burton's mishandled attempts to remake classic stories. It just doesn't work."}, {"rating": "7", "text": "Sleepy Hollow is a fun horror / comedy from Tim Burton. It's gory and fun and has an entertaining performance from Johnny Depp. It's also just the right level of scariness and violence to make it a suitable Halloween movie for 10 year old kids, too."}, {"rating": "6", "text": "Sleepy Hollow is a visually brilliant piece of work from Tim Burton, but other than that I can't say there's anything I like about the movie. It's not particularly scary, thought-provoking, or extremely well acted. The film as a whole is just OK, but worth every penny for it's visuals."}, {"rating": "5", "text": "Johnny Depps performance and Tim Burtons deeply stylish imagery manage to salvage the inane plot and over the top action sequences which act as nothing but a relentless and un-exciting barage on the senses. All the characters beyond the lead are flat and some great actors (Michael Gambon among them) are not given the screen time they deserve. On a better note, fans of Danny Elfman will be pleased with his epic soundtrack. Sleepy Hollow is dumb eye candy, but should keep you nicely entertained, just dont expect to remember much about it 5 minutes after its over"}, {"rating": "7", "text": "\"Sleepy Hollow's\" pacing may be a bit too off-kilter at times, but its hard to deny the visual majesty at hand, thanks in no small part to the creative talents of Tim Burton and Emmanuel Lubezki."}, {"rating": "8", "text": "Johnny Depp E Christopher Walken arrasam com seus personagens.Um dos melhores filmes de Tim Burton,um puta filme de terror Tim Burton sabe fazer terror também. Contém cenas brilhantes como Ichabod lutando de espada com o cavaleiro,e a fuga final."}, {"rating": "2", "text": "I don't understand why some people(directors) like to spoil a perfect location+perfect cinematography+jack sparrow(I know that is not his real name) with a pathetic story line..its neither a horror nor a comedy movie,its one of those fantasy ones I think(never enjoyed those).The story starts off on a promising note,the location too makes you believe that you are in for a thrill and mystery ride but all your expectations come crashing down after next 20 minutes,tops.Its a ride of disappointments where in each turn reminds you to curse yourself for wasting 2 precious hrs of your life on this one.You wont enjoy this one if you are a big fan of the women in black,insidious etc..you know,real horror stuff,the one that would make you wet your own pants."}, {"rating": "9", "text": "A very interesting take on The Legend of Sleepy Hollow, obviously it doesn't follow the book or the legend very well but it makes up for that with its great acting, a creepy but classic Burton Gothic feel, its a fantastic movie"}, {"rating": "8", "text": "Tim Burton put his own spin on the classic short story \"The Legend of Sleepy Hollow\" with the surprisingly good 1999 adaptation Sleepy Hollow. In the movie adaptation, New York detective Ichabod Crane must travel to the mysterious Sleepy Hollow in order to solve a series of murders that took place there, but realizes the town's dark history and the legend of a headless horseman might be the true culprit. Sleepy Hollow is essentially a highly stylized slasher flicks. There are lots of gory decapitations set against a fittingly gothic tone, and although it's never truly heart-poundingly intense, there is a great atmosphere and some creepy imagery. Burton does make this movie a bit darker than his previous films (at the time), but there's still a bit of humor in its heart, mostly because of Johnny Depp's role as the Ichabod. Even though it deviates significantly from its source material, Sleepy Hollow is a fun, atmospheric movie."}, {"rating": "7", "text": "Sleepy Hollow. Head off the shoulders! A very beautiful movie with an interesting story and excellent acting. Of course, Johnny Depp and his Ichabod deserve special praise. And also a very high-quality chopping off of heads."}, {"rating": "7", "text": "This film is the Tim Burton's free adaptation of the Washington Irving's classic, already several times taken to the screens. This time, Ichabod Crane is a police investigator sent to the village of Sleepy Hollow (founded by Dutch immigrants) to discover a killer who cuts and collects heads. Obviously the star of this tale could only be Johnny Depp, a bizarre movie buff and an old Burton collaborator, as well as one of the most versatile and talented actors of the day. The film also features Christina Ricci (a Wednesday from \"Addams Family\"), Miranda Richardson, Michael Gambon and Casper Van Dien. Christopher Lee, who was the master of terror in the seventies thanks to his extraordinary voice and diction, also makes a brief but excellent appearance.The cast is extraordinarily good and does a great job. No fish bones, as we say in Portugal. It does not deserve a single negative note: the good quality of the actors and the precise direction of Burton was a combination with impeccable results. Depp is effective, can even be funny when he can; Ricci is seductive, engaging and mysterious. Miranda Richardson does a good job but the script requires that only in the end we be able to see the true value of this actress. The scenarios and ambiance, deeply Gothic, gloomy and hazy, is mysterious and scary, preparing the audience for eventual scares and giving the film the atmosphere of a horror movie when, in fact, we are in a suspense thriller. The CGI is used with caution and prudence, getting good visual effects and sound without boring or saturating the audience, as it is supposed.Not corresponding to the original story, it is however a very good film, appeals easily to the majority of the audience and is very well done. Certain scenes can cause big scares, but overall it's not a movie I would call scary."}, {"rating": "8", "text": "Good film. A good combination of horror, humor and creepiness. Definately worth watching if you like Tim Burton's movies."}, {"rating": "8", "text": "Tim Burton's Sleepy Hollow was designated a failure upon release both critically and commercially. This isn't a bad film and upon hindsight the aesthetics and pacing are good, but it isn't scary or even disturbing, which might have been the director's intention. The gothic atmosphere seeping through the fantastic production design is something to savor however, and one of the great assets of the film is the production design. Based on Washington Irving's tale \"The legend of Sleepy Hollow\" Johnny Depp stars as the well-meaning but cowardice Ichabod Crane who comes to this town to investigate the murders which are all similar in nature- gruesomely beheaded. I cannot pinpoint why the film failed but one thing is certain- Its reputation- as with many rediscovered films is improving with each passing day. If you are in a mood for a moody, atmospheric film then Sleepy Hollow will fill that void perfectly.(Atmospheric and gothic- a nice excursion to Sleepy Hollow)."}, {"rating": "7", "text": "It's extremely campy and it knows it. It's more concerned with being a fun homage to classic Hammer horror films than an adaptation of \"The Legend of Sleepy Hollow\".Its silliness can be a bit off-putting at first, but after a while, it grew on me. It's also highly elevated by its incredible production design and cinematography (courtesy of the always great Emmanuel \"Chivo\" Lubezki).This movie is just lots of fun and brutal gore. What else could you want?"}, {"rating": "7", "text": "Burtonverse meets R-RatedAs always a pleasure to see his marks, designs, but the liquids didn't fit that well, maybe I'm not used with them in his films. Johnny as always was brilliant. I don't know the book story, probably that's why the adaptation didn't sang to me. I expected more detective work and a successful one. I hoped he could have saved more lives, but that's the story. It moved slow, a bit, enough to make me lose my curiosity and interest. Nevertheless, it was good to see Johnny and Tim working again, more please! Peace and Love!"}, {"rating": "4", "text": "This one's negatives do outweigh its positives, but its strengths are really stupendous. Where some things falter, the main consistencies here would have to be the costume design, production design, and the cinematography. All add together to make this a visually striking and beautiful film. I may not have loved the film, but I really wanted to, if only for those elements being so strong. In addition, this one is very good at mood setting, as it feels dark, disturbing, and creepy throughout. However, this mood does get upset by one of the main negatives of this film; the acting. The acting from everyone is poor at best. I expected a lot better from Johnny Depp and Christina Ricci, but their performances felt entirely wooden and emotionless, even worse when they did put in emotion, it felt entirely over the top. The added in demonic elements were also entirely off-putting and came off as forced. Finally, the special effects lacked at times. A lot of the time, the special effects were extremely cool and well done (everything with the tree), but a lot of the time, they fell flat and just looked overly stylized and fake. As a whole, Sleepy Hollow rides on its visual splendor, but is nothing more than eye candy unfortunately."}, {"rating": "4", "text": "This is just garbage, it's too deviant from short story, this kind of horror works for Dracula and Frankenstein, but Sleepy Hollow, not so much."}, {"rating": "5", "text": "Sleepy Hollow is often praised for its great visuals. It invokes a dark mood and gives a nod towards the way lighting was used in movies as the Third Man. Alas, the visuals take a backseat on the small screen of my laptop and brings in focus the story and characters. And the contrast is striking. The movie is filled with strong actors like John Gambon, Martin Landau and Jeffrey Jones. But there is hardly any acting by them as they are figures in landscapes, witnesses to Depp's antics and victims for the headless horseman.Depp plays a young constable of a New York police force that did not exist for another fifty years and denounces police torture methods that were never tolerated(at least not until recently). He gets send to investigate strange beheadings in a remote village populated by yokels. He is the agent of modernity who is going to bring the light of reason to the outback. Or so you think.But actually; no. Sleepy Hollow is like a slideshow: we move from one set to the other. Each scene is like a painting: well crafted with powerful lighting. Deliberate marvelous pieces. A girl dressed in all white on a white horse in a landscape of black leafless trees. A massive tree dominating the travellers, its branches clawing the dreary sky. A small town smothered by fog. An Inn full with bright colors, people, laughter and music.But how do we get from one scene to the next? We use Depp. He meanders through the story: stumbles into caves, plunges into forests and trips over bodies. There is no investigation as such. He is just led on. When he gets stuck a witch tells him where to go next or a sidekick finds something and says: you have to see this, sir. And then he leads him to the scary tree and the girl in white tells you its name. It isn't a bad movie because even on my laptop it looks interesting, but it is evident that the story and characters are just there for the visuals. Pity, considering all the acting talent available."}, {"rating": "10", "text": "This movie is creepy, stunning and legendary at my household.This is my #CupOfTea."}, {"rating": "9", "text": "As I like Tim Burton, and I am fond of the timeless story, I was eager to see what this 1999 film was like. I also grew up on the Disney classic The Legend of Sleepy Hollow, the Headless Horseman creeped me out so badly when I was little I thought I would never see the day when I would see that topped. Now after seeing this I think I just have. The Headless Horseman is terrifying here, Christopher Walken does a phenomenal job playing him. I do agree that the story does drag on occasions, but plenty makes up for that minor fault. Visually, Sleepy Hollow is amazing, like Batman Returns and Edward Scissorhands, the sets and cinematography are dark and Gothic, and the special effects are wonderful. Also Tim Burton I think was the perfect choice for director, he is oddball and eccentric and that directorial style is perfect for this film allowing him to give a clever, unique and atmospheric take on the story. The music score by none other than maestro Danny Elfman is dark, suspenseful and haunting, like it should be. The story is a true timeless tale of horror, and really well structured here, as is the nuanced script. The performances are excellent once again, with Johnny Depp absolutely brilliant as the maverick yet intuitive Ichabod Crane and Christina Ricci fine in a poignant sort of way as the lovely Katerina. Solidly supporting them all the way are Michael Gambon, Miranda Richardson, Michael Gough, Jeffrey Jones, Ian McDiarmid and Richard Griffiths. And of course the film is full of cruel shocks and thrills, the murder scenes are shocking and violent but not in the sense that you have to look away. Overall, very unique and beautiful take on the tale. 9/10 Bethany Cox"}, {"rating": "9", "text": "Witt screenplay of Washington Irving story that excels the naive animated version of Walt Disney. One of best plays of team-up Burton / Depp, plus the masterly job behind of camera of Emmanuel Lubesky, a schivering score of Danny Elfman and the epoc adaptation."}, {"rating": "6", "text": "watch your head..Sleepy HollowAs always, the production design, costume design, background score and the tone of the feature endorses it more than any other aspect of it. Kevin Yagher and Andrew Kevin Walker; the writers, lay out all the big guns before it even hits the screen, after which the only thing awaits, is the journey and the path that it takes to reach out to its predictable outcome which fortunately is intriguing enough to invest in it. If not for Tim Burton, the feature wouldn't have made it post its first act, for each and every frame screams his manner throughout its runtime. Johnny Depp is convincing in it but isn't as good as expected or required and neither is supported well enough by the supporting cast like Christina Ricci and Miranda Richardson. Sleepy Hollow is not how it seems but unfortunately not in a good way, for even though it may hold the viewers for around 100 minutes, as soon as the curtain drops it is quite easy to forget."}, {"rating": "8", "text": "This was a really a fun and engaging experience. Johnny Depp is most suited in such roles or rather he makes those roles his"}, {"rating": "8", "text": "Tiene fantasía, horror y misterio, los ingredientes para crear una historia entretenida."}, {"rating": "9", "text": "A movie that highlights Tim Burton as one of the best story tellers of his generation.Dark, gothic and thoroughly entertaining."}, {"rating": "9", "text": "°°●°●°●°●°●°●●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"}, {"rating": "9", "text": ":**:*:*:*:*:*:*:**:;*\"*\"*\"*\"*:**¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "9", "text": "{}{}{}{}{}{}{}{}{}{}[][][][][][][][][][][]()()()()()()()!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "9", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "8", "text": "Bom filme, fotografia perfeita, ótimo roteiro, atuação magnífica do elenco, ambientação incrível. Puro entretenimento, filme para qualquer pessoa, Tim Burton está de parabéns pelo trabalho, assistir esse filme traz até satisfação pessoal de ter gasto esse tempo em uma obra tão magnífica."}], "recommendations": ["crimson_peak", "candyman", "doctor_sleep", "the_grand_budapest_hotel", "last_night_in_soho", "chinatown", "the_fifth_element", "the_shining", "hellboy", "victor_frankenstein", "dark_shadows", "doctor_strange", "sin_city", "frankenweenie", "the_others", "beetlejuice", "the_sting", "conan_the_barbarian", "alice_in_wonderland", "murder_on_the_orient_express", "the_dark_knight", "django_unchained", "indiana_jones_and_the_temple_of_doom", "the_black_phone", "fargo"]}