{
  "id": 4016,
  "title": "Sleepwalkers",
  "starring": [
    "Brian Krause",
    "Mädchen Amick"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Fantasy",
    "Thriller"
  ],
  "description": "Charles Brady and his mother, Mary, are the last of a dying breed whose needs are not of this world.  They are Sleepwalkers - able to stay alive only by feeding on the life-force of the innocent, but destined to roam the earth, avoiding discovery while searching for their next victim.  That search takes them to the sleepy little town of Travis, Indiana, where beautiful teenager Tanya Robertson is about to become an unwilling pawn in their nightmarish fight for survival.",
  "releaseYear": "1992",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iiwplv5pET2HgMog6otunohIiSr.jpg",
  "categories": {
    "plot": 2.25,
    "acting": 2.0,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 2.0,
    "familyFriendly": 2.0,
    "funny": 2.3333333333333335,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "khugfyguguguftdtfhgjgyfterydfuguihjoihgudtrstdygyffhjgqweeassdghmmmmkjhyyhyfd5fgdtdfjguugughgugyfyyyfyugguuggdgj"
    },
    {
      "rating": "7",
      "text": "An incestuous mother-and-son duo of soul sucking werecats move to a small town in Indiana in order to feed on it's only virginal teenage girl. Featuring an original screenplay from Stephen King, Sleepwalkers has an interesting place in the author's filmography as it isn't an adaptation of his books or other stories. Hyper-violent and cheesy, the tone is more Maximum Overdrive than The Shining. A total trashy B-movie with uneven writing it may be, but thanks to some appropriate direction from Mick Garris (A frequent King collaborator) it manages to make the most of it's cheap gore effects and deliver some low-rent stimulation.You catch glimpses of potential depth here and there. Like in the graveyard assault sequence that's very symbolic of rape. It never leaves the shallow end of the horror pool though. The aforementioned scene is punctuated with some one-the-nose jokes about consent that keeps the action firmly tongue-in-cheek. There's a nonsensical car chase, Alice Krige going on a rampage through town, and more ridiculous dialog than you can shake your head at. It's all a bunch of cheap thrills, but it's liberal with the blood and over the-top deaths so the silliness is a lot of fun.Like I said, the writing was uneven. King came up with a lot of inventive scenarios, but the lore of his monsters is underdeveloped. You can see the familiar archetypes often found in his work, such as the sleazy teacher that tries to blackmail Brian Krause into sexual favors leading a suitably gruesome demise, but there's no character development. The dialog is pretty sharp though and the film is always ready with a joke. The early moments of Krause attempting to woo his next victim are pretty well-done. Although it's odd to see his character erratically flip-flop on his motives so much.As a sucker for cheap thrills I enjoyed this movie. It has them in spades. I think what really won me over though were the cats. Your average stray feline is a goofy weakness for a monster to have, but we got the baddest tabby of all time \"Clovis\" (Sparks) out of it so I won't complain too much. A straight up OG. There's even a unexpected tender moment with him in here. Who expected that? Overall, this is a stupid good time. If you like the other Stephen King B-movies then you'll like this as well."
    },
    {
      "rating": "2",
      "text": "Don't get me wrong I do like Stephen King a lot, his writing is growing on me all the time, and I do like a vast majority of the adaptations based off his work. Sleepwalkers, alongside TommyKnockers and Thinner is one of the worst King adaptations for me.Although most of the effects are corny, some of the transformation sequences are surprisingly neat and some of the cameos from King himself, Clive Barker and John Landis are fun to spot, even if they pointlessly come and go.On the other hand, that's it. The film starts off shaky with a daft prologue and right up to the equally daft ending it never recovers. The pace is disappointingly dull, the dialogue is underdeveloped and reeks of cheese, the plot is thin and idiotic and there is no genuine atmosphere and jolts as a result. Apart from the fun to spot cameos, the acting unable to do anything with sloppily written characters is dire. Director Mark Garriss does try his best, but he is hampered by the mess that are the script, pace and story, so all the flashy gyrating camera work seems like a wasted effort in the end.In conclusion, a mess and one of the worst films based on the work of Stephen King. 2/10 Bethany Cox"
    },
    {
      "rating": "0",
      "text": "Was Sleepwalkers based on a novel or book or something? I could be wrong and don't honestly know... This is a 1992 horror directed by Mick Garris and I thought Sleepwalkers to be good in parts like Charles Brady (Brian Krause) giving some dude his hand back after he either ripped it off or somehow manages to tear it off, then his face changed into pure evil then his victim runs and Charles who isn't human follows him through the woods running after his victim. The attack on Tanya Robertson (Madchen Amick) and how he makes his car invisible to lose the cops then changes his cars colour. However Sleepwalkers is full of poor acting and laughable and cringey scenes too, non convincing performances, awfully hilarious storyline that makes little sense, dumb cops, unlikeable characters and it's neither terrifying or scary at all. If anything it comes off as a boring drama comedy at times and some parts are just pathetic and some characters are weak and to be honest the only decent actors in the entire movie aren't the human characters, it's the cats. Embarrassing!"
    }
  ]
}