{
  "id": 3606,
  "title": "Sleeping with Other People",
  "starring": [
    "Jason Sudeikis",
    "Alison Brie"
  ],
  "runtime": 100,
  "genre": [
    "Comedy"
  ],
  "description": "Can two serial cheaters get a second chance at love? After a one-night stand in college, New Yorkers Lainey and Jake meet by chance twelve years later and discover they each have the same problem: because of their monogamy-challenged ways, neither can maintain a relationship. Determined to stay friends despite their mutual attraction, they make a pact to keep it platonic, a deal that proves easier said than done.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/thYomS3wTYDTRZaM98ADMfBiDxm.jpg",
  "categories": {
    "plot": 6.375,
    "acting": 6.636363636363637,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.2727272727272725,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "\"Sleeping With Other People\" is a charming and lovable romantic comedy boosted by wonderful performances by Alison Brie and Jason Sudeikis. The writing is sharp and witty, the romance is believable, and the characters are strong and incredibly well-realized. An all-around pleasure."
    },
    {
      "rating": "9",
      "text": "Sleeping with Other People is one of the best romantic comedies I've seen from the past 5 years. The story is masterfully written, it really ends up being like a perfect 50/50 split of comedy and romance. Leslye Headland is nearly perfect in the directors chair for her second effort. However, the real headliners in this movie are Jason Sudeikis and Alison Brie. Both these people are excellent in almost everything they do but still seem to go by fairly unnoticed. Sudeikis and Brie give the best offerings of their respective careers and even though the film is a little clichéd the writing on the way there is so great that you really don't care that the script took you there. You may even see some shreds of other rom coms laced in the mix, but the film still feels fresh because it has a great modern twist to it. Undoubtedly one of my favorites this year."
    },
    {
      "rating": "6",
      "text": "This is a charming, witty and well-acted movie that showcases nyc beautifully. the charm, wit and good acting however fail to turn make this romcom an interesting one  due to the terrible hollywood ending which imho not only fails the audience, but fails the actors as well. I cringed when i watched Amanda Peet and Jason D as they were trying to make the police car scene work. This movie should have ended when the UHaul truck pulled up to our screens. It would have made far more sense."
    },
    {
      "rating": "10",
      "text": "Holy **** A perfect Romance Comedy\r I mean, I am just in awe at how they balanced them out so well, I was both laughing and crying with joy at how much this worked. And brilliant acting from Sudeikis and Brie, these two have so much chemistry it's insane. It is rich in substance and adult humour and you love seeing these two cling on each other, every morsel of this film down to the last second is perfect. Everyone should watch this movie, well...unless you're with your parents."
    },
    {
      "rating": "1",
      "text": "Yet another patronising romcom about unlikeable and depraved people. I guess thats been a trend longcoming in a genre where directors seem determined to keep lowering the bar more and more as time goes on."
    },
    {
      "rating": "2",
      "text": "Terrible not even funny. All the women in this movie deserve a oscar, if they can pretend that  Jason Sudeikis is **** He looks like their dad, and this is the biggest problem with this move and makes it \"fictional\". The relationships between characters are totally off and the movie becomes uninteresting in short period of time. And yes it is unnecessarily perverse in some scenes."
    },
    {
      "rating": "7",
      "text": "Sleeping with Other People may work as a comedy but as romantic as it can get, it might need a step-up. Other than that, Sleeping with Other People works as just your average sole comedy."
    },
    {
      "rating": "10",
      "text": "This movie is like a 9.5 but I’m giving it a 10 because it’s rare that I like romantic comedies. Alison Brie and Jason Sudeikis are great in this and they are truly believable in their roles."
    },
    {
      "rating": "6",
      "text": "Pretty OK stuff here. Very conventional, goes exactly where you expect with literally no surprises. But it's kind of humorous and it passes the time just fine. The cast is charming and funny."
    },
    {
      "rating": "6",
      "text": "A tale about not love at first sight.\r A romance comedy that begins with two people meeting in an unusual circumstance during their college year. Later the story moves forward to the present where their life status was revealed, particularly romantic life and relationship issues. This story seems familiar, but the filmmakers tried narrate it as much as possible from a new angle. So the majority of us know how it all ends, yet watching how the film is to reveal to us all those contents is not quite bad.\r This is a different kind of romance film than I thought. There're more about sex than being romantic or emotional. But still nice film with some good performances and length of the film was also good with decent pace. Both the lead actors were quite interesting. They're not as popular as those we see regularly in this kind of theme, but their roles were justified with their fine efforts.\r The first half was okay type, but the next half, particularly the last half an hour makes the film at its best. Whatever the opening was, but it ends well. It is not a greatest love story ever told, still enjoyable one. You can blame many things and/or scenes of it, but it entertains on its own way. So I think some people would consider it a good film, but most won't. For me it is an average, maybe a slightly above that. The film is not worth suggesting, even though not a waste of time.\r 6/10"
    },
    {
      "rating": "7",
      "text": "Maybe I don't remember trailer that well, but going into this I thought this will be more a comedy than a romantic movie. I was wrong about that as it did feel like generic romantic movie at times. But that's the only let down because besides that most of the movie was pretty good and I really liked chemistry between Sudeikis and Brie. If you want to watch a romantic movie, this is pretty great, if you are here for the comedy, then it's not that great but still decent."
    },
    {
      "rating": "7",
      "text": "**** have always been good leads for movies. This perception goes right to Jason Sudeikis and Alison Brie in Sleeping With Other People. Jake (Sudeikis), a womanizer with a cheating habit meets Lainey (Brie), a naughty-go-lucky chick who has a habit of screwing every relationship she has.As their characters meet, it turns out to be the rom-com movie, many fans have been waiting for. It is because of the powerful connection of the two leads and their portrayals that make this romantically funny.As for flaws, the shifting of shots show how incomprehensible the scenes are. It also has some problems in the underdevelopment of characters in taking their relationship seriously.VERDICT: Despite of some incoherent scenes and underdeveloped relationships, the undeniable chemistry and overflowing enthusiasm between Brie and Sudeikis make this flick both hot and hilarious."
    },
    {
      "rating": "7",
      "text": "my love is conditional..Sleeping With Other PeopleStarts off breezy and light, surprisingly keeping it real and on the track until it takes a highway in its final acts where things get intense resulting into a \"movie\" movie if compared to other Jason's installments."
    },
    {
      "rating": "5",
      "text": "Average rom-com at best. Has some funny scenes but not enough to keep you fully engaged. The final act was unnecessary."
    }
  ],
  "recommendations": [
    "friends_with_benefits",
    "the_five_year_engagement",
    "that_awkward_moment",
    "palm_springs",
    "how_to_be_single",
    "delivery_man",
    "the_break_up",
    "blockers",
    "hitch",
    "the_king_of_staten_island",
    "the_dilemma",
    "50_first_dates",
    "no_strings_attached",
    "the_vow",
    "i_feel_pretty",
    "seeking_a_friend_for_the_end_of_the_world",
    "the_nice_guys",
    "the_cobbler",
    "10_things_i_hate_about_you",
    "tag",
    "the_edge_of_seventeen",
    "the_upside",
    "silver_linings_playbook",
    "forgetting_sarah_marshall",
    "the_family"
  ]
}