{
  "id": 2029,
  "title": "Sleepless",
  "starring": [
    "Jamie Foxx",
    "Michelle Monaghan"
  ],
  "runtime": 95,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "Undercover Las Vegas police officer Vincent Downs, who has got a lot of enemies, is caught in a high stakes web of corrupt cops and the mob-controlled casino underground. When a heist goes wrong, a crew of homicidal gangsters get T, Downs’ teenage son. In one sleepless night, he will have to rescue his son T (whom they got), evade an internal affairs investigation and bring the kidnappers to justice.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9WkUSY33MDPGmz0vtzbsfaxTHVa.jpg",
  "categories": {
    "plot": 4.285714285714286,
    "acting": 5.75,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 4.3
  },
  "reviews": [
    {
      "rating": "1",
      "text": "I do not know why, but I did not want to watch the movie until the end. It seems not a bad story, but something in the film is not enough. In my opinion, there are a lot of small defects in the film. And in the plot, in the work of the actors, and in directing. In general, the film was similar to one of the series of some cheap TV series"
    },
    {
      "rating": "3",
      "text": "You don't get much more trite than an undercover cop fighting corrupt police involved with the mob. You don't get much more predictable than this movie (did I mention his child is kidnapped for extra pressure?) Jamie Foxx has the embarrassment of headlining this mediocre film. There's nothing about the writing, direction or the action that's new or interesting (even the location: Vegas…yawn). It's reasonably well-acted and the pace is steady with plenty of fights and chases. It's not so bad that it'll put you to sleep, but I doubt you'll remember it in 2 months."
    },
    {
      "rating": "0",
      "text": "This was the worst thriller that I have watched in a long time. This movie was hipped up too much and I say that it was a wasted film that should have never have been released. The cast didn't match the plot line or the conflict."
    },
    {
      "rating": "5",
      "text": "Vegas may look as pretty as ever in \"Sleepless,\" but the movie itself leaves just a bit too much to be desired - even with the serviceable performances considered. It toils earnestly at putting on a few different cinematic hats at the same time - it's, at once, a kidnapping film, a crime thriller, and a contained location actioner. But without any urgency, true intrigue, or set pieces that venture farther than your garden-variety fist fight, you're not really left with a film that excels in any of those directions. Don't get me wrong, it's eminently watchable and even enjoyable at times. It's just that, as an overall experience, it never really floats higher than the fair and the fine."
    },
    {
      "rating": "4",
      "text": "Sleepless is like your average sleepwalk journey. Nothing to expect, nothing to remember, nothing to cheer on. It's a series of fellow dreams that just seem forgettable to the maximum."
    },
    {
      "rating": "6",
      "text": "Have i seen better? Yes. Was this terrible? No. Yeah it's kinda all over the place at times & the plot is generic but TBH if you're wanting to see an action film, this satisfys that. Just don't expect an Oscar-performance from anyone. That's due to the writing & directing. Hopefully, the director won't do too many more movies."
    },
    {
      "rating": "3",
      "text": "Poorly directed action sequences and a recycled plot overshadow substantial performances, and make Sleepless nothing more than a disposable January thriller."
    },
    {
      "rating": "3",
      "text": "This movie was held together by Jamie Fox. Other then that it was painful to watch! With the female protagonist constantly taking you out of the movie with the horrible Im a wanna be bad **** attitude. Was fun however picking it apart with friends."
    },
    {
      "rating": "3",
      "text": "They said it was an easy grab...But it aint no easy grab, they got T!T for taken as this is what the movie is ripping off. Like a bad version of it."
    },
    {
      "rating": "5",
      "text": "The story doesn't make a whole lot of sense at times, but the action scenes are well done. Passable to watch for the action, but all the things that happen are just too much. No credibility left at all way before it ends but going with a 5 over a 4 for the action scenes that are well executed and filmed."
    },
    {
      "rating": "6",
      "text": "A night of twist and turn events.Maybe if you haven't seen the original, you will enjoy it, particularly if you like a thrilling clash between the cops and gangsters. For me this is the third version from the last three consecutive years. After the original French film based on the same name of the book, followed by the Kollywood remake 'Thoongavanam'. The second film was not bad, considering the way it was made to the Indian standards. They did not change much, but in this one the initial parts were almost the same and the following developments were too much. I mean literally they turned it into twice thriller with tight action sequences. Their main idea was to leave the open conclusion for a possible sequel. Which was really too intentional that not everybody would be happy with, for like those who liked the previous versions.The actors were good, but Michelle Monaghan was the best among. Unlike the same characters from other versions, I don't know how they turned Monaghan's role so powerful. That's the negative, as the film Jamie Foxx in the lead. Otherwise, as a neutral, this is not a bad remake. The Immigrant joke was trimmed off, since today's US is not in favour of such comedies in films. And many events, especially film scenes were accelerated. So the camera moves one place to another in a quick succession unlike other versions. Yeah, these changes were needed, since the film was not a fresh piece of work or even first remake. But like I said too muchness spoiled the party. Even though one time watchable film.6/10"
    },
    {
      "rating": "3",
      "text": "Sean: \"They said it was just gonna be a easy grab\".Vincent: \"Well, it ain't no easy grab, they got T!\"Gotta love Ralphthemoviemaker.Sleepless is basically black \"Taken\", but a poorly made version. It's a paper fin action movie with big name stars who acted so flat, especially from Jamie Foxx who's shockingly bad in this. Every line he mumbles and in the scenes when he either snaps or gets frustrated, it felt so held back.Been there, done that type of movie."
    },
    {
      "rating": "5",
      "text": "If I could I would give it 5.5. It was promising, but there were too many cliche storyline themes and some boring bad guys in it, that I think it was not that good."
    },
    {
      "rating": "6",
      "text": "Much better than it's reviews but still flawed. Its better than many of the movies in its genre but unfortunately its genre is a little dated. Jamie Foxx is a much better actor than he's given credit for and this was kind of entertaining."
    }
  ],
  "recommendations": [
    "brick_mansions",
    "bloodshot",
    "wrath_of_man",
    "the_transporter_refueled",
    "contraband",
    "rocknrolla",
    "transporter_3",
    "the_marine",
    "triple_frontier",
    "gemini_man",
    "poseidon",
    "the_three_musketeers",
    "seeking_justice",
    "the_a_team",
    "infinite",
    "american_assassin",
    "the_old_guard",
    "terminator_genisys",
    "den_of_thieves",
    "taken_2",
    "escape_plan",
    "the_tax_collector",
    "desperado",
    "clash_of_the_titans",
    "the_last_witch_hunter"
  ]
}