{
  "id": 3074,
  "title": "Slumdog Millionaire",
  "starring": [
    "Dev Patel",
    "Saurabh Shukla"
  ],
  "runtime": 120,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "A teenager reflects on his life after being accused of cheating on the Indian version of \"Who Wants to be a Millionaire?\".",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5leCCi7ZF0CawAfM5Qo2ECKPprc.jpg",
  "categories": {
    "plot": 4.833333333333333,
    "acting": 4.538461538461538,
    "ending": 7.25,
    "soundtrack": 4.2,
    "cinematography": 3.75,
    "familyFriendly": 3.0,
    "funny": 6.833333333333333,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Beautiful and emotionally satisfying. There is no other way to describe \"Slumdog Millionaire\". I know a lot of films have already showed poverty and violence before and the ending is quite predictable, but what matters here is not how it ends but what it takes to make us cheer so much for Jamal."
    },
    {
      "rating": "10",
      "text": "I just read David W's review. He must be a young man and doesn't get it. India really treats its citizen's this awful. The country is overcrowded, corrupt and only the strong survive. If you are from the slums as the lead characters were you have only a 20% chance of surviving. If the people don't kill you the disease and poverty surely will. Yes, the premise of the movie \"Who wants to Be a Millionaire\" isn't a true story but the lifestyle hits the nail on the head. I guess David still lives in a comic book fantasy world. Without question one of the best movies in many a year and should sweep the OSCARS for Best Picture, Best Directing and Best Screenplay."
    },
    {
      "rating": "8",
      "text": "Despite my scepticism this is finally a movie worthy of the hype. Great storyline, superb acting from all and excellent direction make this movie one of the best of the last five years. If you haven't seen it, watch it now. It will be worth it."
    },
    {
      "rating": "5",
      "text": "I am giving this movie three stars which it deserves just because of the cinematography and some other minor things. Else this movie is trash. I bet if an Indian director would have made this, it wouldn't have been considered even eligible for the Oscars. The dirtiness in this movie makes me retch. There wouldn't be a mortal on the planet called earth who could jump into **** for getting an autograph of Amitabh Bachan. And as if AB will give it as well!And I hated the dialogue when Jamal says: \"This is the real India,\" when a police constable was beating him up barbarically, and then an American interrupts and gallantly produces some dollars from his purse, saying \"Let us show him the real America.\" or something like that. That made me shut my television off. Of course the movie didn't instill any excitement when Jamal was about to answer a question on the game show. You know that it is gonna be right. But the cinematography and the background music was great. And following Jamal through his journey is not all that bad, though. It is exciting sometimes. The love story which runs parallel is somewhat fascinating.This is a movie worth watching, but don't overestimate it as an award winner. Certainly if you are a non- Indian, it would be a new experience."
    },
    {
      "rating": "8",
      "text": "Well deserved oscar! The movie is incredible! The ending was a bit rushed (no spoiling) but overall i think that this is a movie directed so well, that you don't want to miss."
    },
    {
      "rating": "1",
      "text": "Slumdog Millionaire is Danny Boyle's worst film so far. Boyle tried to ambitiously replicate Fernando Meirelles' City of God - a true modern masterpiece about life on the outskirts of Rio De Janeiro - but he failed miserably. It's one of those terribly cliched and predictable movies where the lovable loser wins at the end and gets the girl and the money. The acting is weak and there's a glaring lack of substance. There's not a single transformation portrayed, no character arc just an overflow of sappy moments. It doesn't resemble a shred of reality and it completely skips the true horrors of being born in poverty. I have lived in England all my life but even someone as unaware as me could point out that kids who serve tea in India with no parents don't speak in English, certainly not with hints of a British accent. The film says that the only hope to escape poverty is by fortuity and for that people flourish it with awards? Danny Boyle's crowd pleasing \"art\" film is the very definition of mediocrity. It's manipulative trash simply made for the sole purposes of winning awards."
    },
    {
      "rating": "0",
      "text": "How this dreadful movie won an Oscar for best picture is beyond me. It's so dull, drawn out, and silly that one has difficulty understanding where crtics found their praise. The work is drab, dreary and smacks of amateurism to the nth degree. The record shows that Hollywood Academy of Motion Pictures changed the way they vote for Oscars due to the selecton this dog of a movie."
    },
    {
      "rating": "10",
      "text": "A liberating and uplifting movie and the feel-good film of the decade, Danny Boyle delivers the Oscar Winning Slumdog Millionaire. And it's easy to tell why the film has won numerous awards. The film focuses upon Jamil Malik (Dev Patel) an 18 year old orphan from the slums of Mumbai and a constant on the Indian version of Who Wants To Be A Millionaire, who is one question away from winning 20 million rupees. However he arrested in suspision of cheating. During his interrogation Jamil reveals his incredible and heartwrenching story of his life as a young boy growing up on the streets of Mumbai with his brother Salim, and how he loved and lost the girl of his dreams Latika (Freida Pinto), each question links to a memoir of Jamil's exhilarating life. Superbly well directed in the ever capable and inspring hands of Danny Boyle who delivers a beautiful film from start to finish and one that will live long in the memory, utterly unmissable!"
    },
    {
      "rating": "9",
      "text": "Slumdog millionaire does suffer from some silly dialogue, but the film is beautifully filmed, mighty, wondrous, romantic and just fantastically acted. It deserves its Oscar. I give this film 87%."
    },
    {
      "rating": "0",
      "text": "Extremely overrated. Poor acting.An annoying cacophony atop a predictable structure.I want those 2 hours of my life back."
    },
    {
      "rating": "5",
      "text": "Eye-rollingly formulaic. This one wins the \"Pan's Labyrinth\" critically overrated film of the year award. Today's filmmakers have no clue how to tell a compelling story. Just another style over substance fluff-job."
    },
    {
      "rating": "0",
      "text": "One of the most overrated films of the year in addition to The wrestler, Rachel getting married,the visitor,che or Frost/Nixon. Slumdog millonaire is a bad film and a bored bored bored film."
    },
    {
      "rating": "1",
      "text": "Horndog Bazillionaire!"
    },
    {
      "rating": "0",
      "text": "slumdog millionaire is just a group of plot devices moving through a childishly contrived plot,\rdoing solely what said plot requires them to do, with no heart to make me believe otherwise.\r these anti-characters go through NO development or change whatsoever, they begin the terrible\r\"story\" as good or evil, with no grey area, and remain good or evil when the \"story\" ends, they don't even have much personality, jamal is good... because he's good, latika is good...\rbecause she's good, saleem is bad... because he's bad... they have no logical motivation, and\rbefore you try and tell me that saleem killing the owner of an orphanage/brothel is what made\rhim evil... NO, saleem lets go of latika when they're escaping, saleem locks jamal inside a toilet, forcing him to swim through feces to get out (which is played for laughs)... saleem is a terrible person before he shoots the guy, and he's a terrible person after he shoots the\rguy... the fact that these aren't characters means the only time i care about anyone in the entire movie, is when saleem, latika and jamal are children... solely because they're little children, and nobody with a conscience can refuse to care about children who go through\rhorrific torture and... WAIT WHAT??? that's right, this film centres around the torturing of children, the prostitution of children, the emotional suffering of children, you get the point, now let me explain why this is a problem, THIS IS WIDELY ACCEPTED AS ONE OF THE BEST FEEL-GOOD MOVIES OF 2008, doesn't the physical/sexual/emotional abuse of children just make any sane person feel all warm and fuzzy inside? I SINCERELY HOPE NOT! jamal and saleem had a terrible childhood which is revealed through flashbacks as terrible\ras the things they depict, it is from these flashbacks that jamal knows all the answers to\rthe questions presented in an indian \"who wants to be a millionaire\" (which is impossble to\rcheat in, because only the host knows the questions/answers, and every variation of the show\ronly uses LANDLINES to prevent connection failure, which renders two major plot points in the film completely invalid), but the most gaping plot holes arise when two of these flashbacks DO NOT EVEN GIVE JAMAL THE ANSWER, OR THE CHANCE FOR JAMAL TO FIGURE OUT THE\rANSWER!!!\r oh, and they don't show jamal completing the general knowledge questions REQUIRED to appear\ron every variation of the show, which he would have failed at, because he is unaware that\rghandi is on every piece of indian currency (even though he clearly earns indian money\rthroughout the movie), if he doesn't know that, how much more does he not know? this alone\rrenders the ENTIRE PLOT invalid...\r jamal went on the show because latika loves the show, and he loves latika, which is oh so\rIMPOSSIBLE TO BELIEVE BECAUSE JAMAL AND LATIKA HAVE NO CHEMISTRY, THEY HAVE NO COMMON\rINTERESTS, THEY DON'T EVEN HAVE AN IN-DEPTH CONVERSATION IN THE ENTIRE MOVIE, this is what i meant when i said 'no logical motivation' jamal and latika are in love solely because the plot needs them to be, and dear god does it show.\r oh, and then there's the ending, now, all throughout the movie, there is a consistent theme: money is evil, so what happens... HE WINS!!! if the movie had any logical messages he would have lost, and realised, alongside the audience, that money isn't everything, but no...\r let me leave you with this: slumdog millionaire won eight oscars."
    },
    {
      "rating": "2",
      "text": "this is the movie which deserve two awards to sy the least.THE MOST OVERRATED MOVIE & THE BEST FEEL-GOOD MOVIE TO THE WEST.all the director does at his best is that to portray India as a big slum.all the shady characters are Indians and the occassional foriegn tourists are the only messiahs.very cool indeed.I think it is well hatched plot by the academy to give awards to two indians who worked with the film so that they can be sure it will grab the attention of India.Rahman has given to Indians sweeter melodies than jai ho to the Indians.Its a very poor attempt to showcase the poverty of India so that the westerners can feel good about themselves.same can be said abt the Booker Prize given to Aravind Adiga.Pure, unadultrated crap."
    },
    {
      "rating": "3",
      "text": "I really to stop watching this movie right at the beginning. Just 5 minutes into the movie, I knew it was going to be a really bad cliche movie and it was. It was an insult to see this movie to have so much acclaim and the credits of this movie cut the cake to how shitty this movie it was. The only thing that this movie did for me was to feel bad for the country of India but that's because they depict so badly in this movie."
    },
    {
      "rating": "3",
      "text": "i was looking forward to seeing this because everyone i know enjoyed it, but i thought it was boring, drab, and over-rated.  Needs to recolor some of the subtitles, white text on a yellow background (i believe it was a car) is damn near impossible to read.\r The story was nice, i like the concept, just didn;t do it for me as a film."
    },
    {
      "rating": "5",
      "text": "@erin I'm sorry? India is in every sense a free country, which I can say, being an Indian myself. About the film: Ok, but there are much better films out there. I did not like the movie much as it shows India in a bad sense, and I love my country. The acting was good."
    },
    {
      "rating": "3",
      "text": "Contrived Plot"
    },
    {
      "rating": "3",
      "text": "Why this predictable, schmaltzy movie won Best Picture and is being so widely praised is beyond me. THE DARK KNIGHT, RACHEL GETTING MARRIED, VICKY CHRISTINA BARCELONA, THE WRESTLER and WALL-E were all far better movies."
    },
    {
      "rating": "0",
      "text": "This may be the worst movie ever made. I take that back. \"From Beyond\" is the worst. This one is second. Not one of the reviews I've read even mentioned the aspect of the persecution of the Muslims in a Hindu country. Where is the moral indignation at India for this racist behavior? The reviewers all mention the vibrant colors of the slums. That makes it the best film of the year? Why should we be visually assaulted watching a movie? Crap.This movie is crap."
    },
    {
      "rating": "2",
      "text": "One of the Worst films that i have watched in the past 5 years. It was trying to be funny at some points without even being close to funny. I never felt for any of the characters. If they both would have gotten shot and died i would have been happy cause the movie would of ended."
    },
    {
      "rating": "3",
      "text": "Highly disappointing. Many aspects of this movie are great but Boyle's tendency to keep a tucky romantic love story in the center of the movie with awfully ridiculous dialogues simply ruins the movie. I choose 3 to counteract the high scores this movie gets."
    },
    {
      "rating": "2",
      "text": "Stupid. boring. i got the dvd and was waiting and waiting for the movie to live up to all the Oscars it won and it never happened.i fast forwarded through half of it because it was so damn boring. and the part with him not caring if he won the money seemed totally unrealistic. horrible.although there were a few redeeming parts such as the nail biting ending."
    },
    {
      "rating": "9",
      "text": "There's a kinetic genius woven into the brightly colored fabric of Slumdog Millionaire, which is only something a director as wildly exuberant as Danny Boyle could accomplish. In what is a basic story, seen many times before, Boyle takes away from its roots of epic and bombast, and modernizes it into a wild, exotic adventure. It's something that can be funny (which the movie is). It's something that can be horrifying (which the movie is). It's something that can be romantic (which the movie is). It's Danny Boyle's take on a trip to somewhere else, and we're lucky enough to go with him"
    },
    {
      "rating": "10",
      "text": "The best movie I have seen in quite some time. It has everything and sucks you in and keeps you riveted for the full 2 hours - And Bollywood at it's finest in the closing credits to boot! Hello Best Picture!"
    },
    {
      "rating": "6",
      "text": "I must be from another planet, or I watched a different movie than the one everyone's raving about, or I got much more humanity & entertainment out of a true masterpiece like Salaam Bombay. Slumdog is contrived and shallow when it could be at its best. The silver screen buckles under the gigantic Who Wants to be a Millionaire graphics. It has its moments, to be fair, but in such a compelling setting as Mumbai, Director Danny Boyle manages to serve up fast food when we could have been tasting authentic street fare."
    },
    {
      "rating": "7",
      "text": "Very good film---loved the beginning more than the end as I thought the young actors/early slumdog scenes were almost perfect--absolutely captivating. The story seemed to unfold predictably and edged on cheesy towards the end, but it still moved me so I guess that says something. Yes, it's very contrived in many parts, but really, it's a solid film worthy of theater prices and/or rental."
    },
    {
      "rating": "10",
      "text": "Superb. Some squemish scenes and uncomfortable moments, but one of the best movies I've had the pleasure of experiencing. The acting by the children was remarkable. Go see it!"
    },
    {
      "rating": "8",
      "text": "The film editing was amazing. I started to leave the theater twice because the sound was way too loud (I have a hyper-sensitive sense of hearing), but the exciting pace of the movie pulled me back to my seat. I inserted some ear plugs I had in my purse, relaxed, and enjoyed the rest of the film."
    },
    {
      "rating": "5",
      "text": "Utterly average. Script is okay and cheesy at times. Acting is average. The camera work is average. It does show India in a non-bollywood way which is nice, but nothing worthy of praise. The only reason it's done well is because of the PC times we live in and the \"oh poor them\" attitude the film portrays. It's a feel good movie so utterly predictable and unrealistic. Honestly, if you want to feel good, watch a comedy. If you want to watch something about good people hard done by coming out all the better, watch Defiance. This movie is cheesy & uninspired, no different from your average chick flick."
    },
    {
      "rating": "9",
      "text": "I rarely watch independent films. When Persepolis was released, I had no desire to go and see it. After hearing about all the Oscars that Slumdog won, I figured I'd order it on demand. I have never been so happy to spend $5 and 2 hours for a movie. Not only did it hide its low-budget production extremely well, but it said to the major Hollywood producers, \"Get off you're lazy asses and make a good movie! We made one without all the high-tech equipment, why can't you do the same?!\" I would have given this movie a 10 but I felt that the love story was unoriginal, which is not a bad thing; I just would have liked it even more had it been 100% original. Due yourself a favor and watch this movie. It definitely lives up to the hype."
    },
    {
      "rating": "7",
      "text": "If you are one of those people that has problems with plausibilility, you might have problems with this movie as I did. Was it gritty realism or an idealistic romance?"
    },
    {
      "rating": "10",
      "text": "This was one of my favorite movies of all time. It showed you just how violent and poverty-stricken the slums of India are, it showed you the fierce hatred between Hindus and Muslims, it even showed you the lives of children living in India. Apart from nerve-tingling violence (a boy getting his eyes cut out, a girl getting a knife slashed across her face, a young boy killing a man with a revolver, a young boy getting beaten harshly by a guard, people setting a man on fire, a boy getting electrocuted) there was a very strong and great message to this movie. There was also slight sexual refrences, but they were very mild (a boy leading a girl into a room, girls dancing scandaly, boys walking through an alley of prostitutes, but not giving them money, although they walk in on a couple but it does not show anything). I thought the acting in it was spectacular. The children playing young Jamal, Salim, and Latika were outstanding, convincing you they truly lived in the slums of India, as well as the older versions convincing you their lives had slowly panned out and changed them into very different people by a sequence of events. There was slight cussing as well (the b-word, d-word, and s-word said only a couple times). But the themes of the movie, you could not help but feel heartbroken at how the children were living in such a poor, violent situation. Being beaten for hardly no reason, having to search through trash heaps, live in such a polluted area...it was incredibly heart-wrenching. There are a few disturbing events, such as a boy jumping into a waste mound, a boy getting his eyes scooped out with acid, a girl dressed up as a hindu god with several disgusting piercings, a boy getting hot chili peppers stuck down his pants, and many others. But apart from the violence and slight sexual references this movie taught me how truly lucky I am to live in such a free country, where people can't take me away to try to force me into gangs to shoot people, or to work as a prostitute. It also showed that just from your experiences, even if you are a \"slumdog\" from India, if you have traveled places or learned things from your experiences, you can know just as much as a rich gameshow host. :)"
    },
    {
      "rating": "8",
      "text": "Great movie! The beginning is definitely better than the end, mostly because of the younger actors doing an incredible job. The ending is a bit cheesy, but overall very enjoyable movie."
    },
    {
      "rating": "10",
      "text": "As riveting a movie as you will ever find. Keeps your attention for the full 2 hours. Reminds me of Pvt Ryan in that once you see it you will never forget it. Kudos for such a wonderful suspenseful movie. Masterpiece worthy of all the accolades."
    },
    {
      "rating": "6",
      "text": "I am not usually one to write reviews, but since my point of view is not represented....I walked out of this film. It started with a torture scene, which was soon followed by a mob scene in which the hero's mother is murdered. The hero and his brother (now orphans) are soon picked up by an \"orphanage.\" The orphanage teaches the kids to beg and when they burn one of the kid's eyes out to make him a better beggar - I walked out. I've seen many movies set in India and was ready for the poverty that would be portrayed. But it was too much. The scene of the kid getting his eyes burned out, haunted me for two days. The story had a great premise, but with each answer he gave in the quiz show - there was a related horror. That said, my husband really liked it. For me I could not stomach it."
    },
    {
      "rating": "10",
      "text": "Superb! Real. Authentic. Hopeful. Masterful filmmaking. It is a unique twist on an old story, done so well and so differently. Best movie I have seen in many years!"
    },
    {
      "rating": "9",
      "text": "Great movie for everyone over 15, especially for Americans who need to be reminded about how good we have it. This movie is about a street kid named Jamal (Dev Patel) who wins on the"
    },
    {
      "rating": "10",
      "text": "A beautiful story that has heart, and magic. It has just enough realism to keep the suspension of disbelief, but it never loses its fairytale love story, and reaches toward the idea of fate and destiny."
    },
    {
      "rating": "6",
      "text": "I grew up in Mumbai myself, and while I am pleased that a movie about my city is receiving this much attention, I just wish it wasn't this particular film. It wasn't a horrible film, but I really didn't enjoy it as much as most people do. Regarding the credibility issue, I do agree that the film needed to \"follow its own rules\" as others have said. As I understand it, the movie tries to show fantastic things happening in a gritty, realistic world. But the world itself is not realistic. Apart from minor errors in terminology, (eg. talking in terms of millions rather than crores, calling the quiz show its US/UK name rather than the Indian name, etc.), the fact that all these practically illiterate people can speak perfect English is extremely unrealistic, which foreign viewers may not realise. A lot of the plot hinges on this ability. Also, as everyone should know, the 'phone-a-friend' thing doesn't happen live with everyone watching! The person on the other end would just look up the answer online before the call is even made! The quiz show is obviously always prerecorded. I also felt that, since Jamal's love for Latika drives all his actions, it was very unconvincingly portrayed. I understand the guilt he feels for leaving her behind as a child. But guilt is not the same as love. Why does he love her as an adult after having such a flimsy friendship with her as a child? I am willing to believe it's possible, but surely the director might have fleshed it out more convincingly. Lastly, the brother's suicide was extremely unjustified, and again the director could have helped us understand it better."
    },
    {
      "rating": "4",
      "text": "This is a overrated and unnecessarily hyped movie. I have heard lots of music so far but could not what is special in the music of the film that it got nominamted for best music, backgroung music....Most of the time the backgroung music of \"Kaun banega Crorepati\" has been palyed, some other time a film song \"Aaj ki raaat\". I believe there are far better music we already have heard in bollywood movies, even that is by A R Rahman. \r\rLots of other points are there which have already been discussed in this forum, I will not go for those again, but I personally not satishfied with movie. I tried a lot to like the movie but I can not."
    },
    {
      "rating": "10",
      "text": "I long to pay homage to Danny Boyle, S. Beaufoy, the great cast, and AR Rahman. This film gives viewers everything they go to the movies for in an explosive yet measured stream of laughs, horrors, griefs, suspense, and wonder."
    },
    {
      "rating": "10",
      "text": "All movies stand on scaffolding that is artifice. The best movies (and this is one) make us either forget about the scaffolding, or not care one iota that it exists. This is the case of the latter. We know full well the improbability, even the impossibility, of the events here, but are so swept away by this film, its actors, its premise, that scaffolding be damned. I do like it better than anything else I've seen this year. Terrific movie. And Boyle is one hell of a director."
    },
    {
      "rating": "9",
      "text": "fantastic movie. great cinematography, entrancing (if a bit corny) storyline, great acting. I loved it. I'd probably give it an 8.7 or an 8.8 but 9 is closest."
    },
    {
      "rating": "10",
      "text": "The best movie made about the society of the India I've ever seen. There is no doubt about it..."
    },
    {
      "rating": "6",
      "text": "Doesn't live up to its hype... not bad, but nothing special either..."
    },
    {
      "rating": "2",
      "text": "Very mediocre. I agree with other sentiments about moviegoers jumping on the 'awards bandwagon.' There is nothing really original about this film other than the fact that it comes from India. I could not help but think that this movie was simply a combination of a couple of movies I have seen before and it was much less powerful. The film tries to juggle too many half baked messages and plot twists to be of real substance; and propped up by acting that is OK at best this film is not worth the praise it is getting."
    },
    {
      "rating": "10",
      "text": "amazing movie i founded spectacular indeed in terms of the storyline and where it takes place, the slums of india. The love story just captured me."
    },
    {
      "rating": "4",
      "text": "Very disappointing. I didn"
    }
  ],
  "recommendations": [
    "babel",
    "pay_it_forward",
    "there_will_be_blood",
    "soul_surfer",
    "boyhood",
    "the_butterfly_effect",
    "code_8",
    "the_power_of_the_dog",
    "heaven_is_for_real",
    "revolutionary_road",
    "no_country_for_old_men",
    "fight_club",
    "hereafter",
    "children_of_men",
    "the_lobster",
    "bridge_to_terabithia",
    "seven_pounds",
    "the_wolf_of_wall_street",
    "lost_in_translation",
    "the_adjustment_bureau",
    "3_idiots",
    "chappie",
    "the_shape_of_water",
    "mother",
    "antebellum"
  ]
}