{"id": 2350, "title": "Smallfoot", "starring": ["Channing Tatum", "James Corden"], "runtime": 96, "genre": ["Family", "Animation", "Adventure", "Fantasy"], "description": "A bright young yeti finds something he thought didn't exist—a human. News of this “smallfoot” throws the simple yeti community into an uproar over what else might be out there in the big world beyond their snowy village.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/zfaiO7QgpcvR8XDOMokWLRfKeTE.jpg", "categories": {"plot": 6.2592592592592595, "acting": 6.285714285714286, "ending": 6.4, "soundtrack": 4.333333333333333, "cinematography": 5.0, "familyFriendly": 6.75, "funny": 5.368421052631579, "action": 5.0}, "reviews": [{"rating": "9", "text": "This cartoon is a great example of what is created for children, but makes their parents think."}, {"rating": "5", "text": "When I first saw the trailers to both The LEGO Movie and Zootopia, each to me looked childish with humor practically designed to annoy me, then once seeing them respectively after the overwhelming praise came in, wow: the incredible comedic depth of The LEGO Movie blew me away, while Zootopia easily became my favorite movie of 2016! I was so impressed by how both communicated deep political themes in a fashion that kids can understand, something more animated films need to pay more attention to.How does that relate to Smallfoot? Well, from the trailer alone, I expected surface-level substance made just for kids and nobody else, and the finished product is in fact a bit more than that. While not better than The LEGO Movie or Zootopia, the Warner Animation Group still provide surprisingly deep social commentary about border control, abuse of the working class, communication with differences, and even past religious influence on an economic climate.The pale blue yeti colony upon a Himalayan mountaintop are not like the rising and setting sun they worship, they follow a strict belief system written on stone tablets; if it’s not written in stone (literally), it’s false. Yes, even if it means the stones say a yak’s anus created their mountain which giant mammoths hold up on their backs, they believe it. These folks are under the rule of a Stonekeeper who wears these laws. Those rough ancient stones make the Stonekeeper appear clung to past ideas that weigh him down, along with every worker who labor for nothing but to cover up a big political lie that could explain why there’s more clouds in the sky. That doesn’t make this land any more believable unfortunately: within this ice-behemoth utopia, the mammoths are dogs and the snails are lamps, which proves nothing more than servitude for the convenience of gags over common sense, much like any computer animation studio that isn’t Disney or Pixar.Anyhow, the main character of the story, Migo, has a father who holds a crucial duty of headbutting a giant gong via slingshot morning after morning to wake the giant snail (sun) in the sky. His head is flattened from continual gong striking—a hazardous old tradition that Migo will someday assume. That’s why he feels a calling to something greater, something new, something that… starts with a slow-motion pratfall when he slips on snow. Yeah… there’s still a lot of cheap humor that makes the first two acts a little tedious. The blandness of the feature gets to be a bit more noticeable once Migo meets a human named Percy, or the mythical “smallfoot.” A language barrier prevents proper communication between these two as an attempt to drive the film’s heart, although not enough boosts their bond to the extent of WALL-E and EVE.At least the architecture of rock murals influenced by the yetis’ mythological beliefs give some extra meaning in the visuals, including a yellow butterfly (representing new thinking) frozen inside a blue icicle (representing old thinking) focused on during one musical number. Yes, there’s numerous dull songs scattered throughout as if an attempt to rip off Disney, none of which are a “Circle of Life” or “Hakuna Matata” kind of deal. The staging of these songs is unimaginative too, as Percy at one point leads a love song surrounded by YouTube videos against blackness, which just looks forced. Also, the Stonekeeper raps, which doesn’t make sense considering he would have no way of knowing what such a music genre is. As much as the artists try to convey a love for nature, it can’t lift a story dragged by a constantly quick pace.Though the well-done animation itself does masterfully blow Migo’s hair to a thick blizzard that blankets the view, much more attractive than anything similar from twenty years ago. Plus, the facial expressions are just right, unhidden and memorable to enhance some nice laughs scattered throughout. One of the more notable examples includes a toilet paper roll dubbed a “scroll of invisible wisdom,” plenty funny enough to sustain excitement. But those genuinely funny moments are far from consistent, as the poor directorial pacing ends numerous jokes way too soon for an effective punchline. The direction suffers a bit too from the painful slapstick that defies physics: Migo’s rubbery body survives falling 500 feet then getting sandwiched between two rock pillars. Yeah, it’s a cartoon, but such a lack of care in establishing real danger removes all tension.That’s really the whole kit-and-kaboodle of Smallfoot: despite how its main human character plans to fake yeti sightings for the sake of viewers, there’s still the other useless plot devices, such as a dead mother, that stop this butterfly from fully emerging from its chrysalis. Therefore, the harmless entertainment will keep the kids entertained, with just enough depth to make the parents not tear their hair out; and that’s the truth."}, {"rating": "2", "text": "\"Small foot\" has nothing you want in a children's musical.The songs are cheesy, the story is an awful plot. And could be a offence to any religious groups.You do not want to go and spend a lot of money on this film. Once you finally get closer into the movie its boring right there. The movie has a lot of good actors,singers,ext. But they don't deliver the juiciness you want. So saying that it is trying to be a Disney musical."}, {"rating": "6", "text": "Life is happy for a village of Bigfoot creatures living in seclusion high in the mountains, until one of them (voiced by Channing Tatum) discovers a human (James Corden). Same thing with this animated film, it bounds out of the gate with a bouncy song and lots of physical comedy. When the titular character starts to complicate the story, the fun starts to dip, while messages of acceptance move to the fore. None of the characters, including expected zany supporting roles are especially memorable. The remaining musical numbers aren't as inventive or catchy. Even though there's plenty of energy, the level of fun never really returns, but there's probably sufficient entertainment value for young audiences."}, {"rating": "9", "text": "Review of SmallfootWhile we were growing we’ve seen so many fictional movies which revolve around aliens and superheroes. All these movies were based on our perception about foreign objects. This movie is about how Yetis look at humans. It’s about how they, out of the fear of humans, create their own world at the top of the mountains where they knew humans couldn’t come because they couldn’t survive there. It is a fiction but has got a lot of realistic day to day things to teach us. First thing that it teaches us elders is about the responsibility towards our families. The Stonekeeper, who is also the leader of the clan, has been able to protect the village from humans for many years. Not only that, he has also been able to create such a mechanism that the village is completely cut-off from humans. Firstly, he made the villagers believe that their mountain was placed on a floating cloud. He also made them create the clouds through steam which they never knew they did. All they knew was that they were feeding the elephants holding the clouds. He made them believe in many such superstitions just to keep them away from danger. His only motive was to be ‘better safe than sorry’.Percy, the human teaches us about integrity. Initially, he was tempted to create fake news about the Yetis with the help of his co-worker Brenda but later when he experienced the truth about them, he stood for them. He could’ve used all the media that he had on his phone to become rich, but he chose to delete them making people believe that the whole ‘Yeti’ thing was a hoax. He also teaches us about taking a stand for our friends.Migo teaches us that the stones (our perceptions and assumptions) are not always right. We always need to dig deeper and find the truth even when it doesn’t look true and a lie is sometimes so evidently true. When the Stonekeeper showed him the visuals of how humans harmed Yetis in the past, it was quite evident to Migo because his first encounter with a human (Percy) too was not too friendly. However, he forced himself not to believe what he saw and continued pursuing the truth. Meechee, Kolka and Gwangi teach us about teamwork and confidentiality.The most important lesson that I personally learnt is from Fleem, the pessimist. The best part is when he is counting the pros and cons before jumping off the cliff when the rest of his friends have already jumped. I hadn’t realized this until I watched it in the movie how important it is to take some major decisions thoughtfully. I personally have made many mistakes in taking hasty decisions.Smallfoot is not just for kids. It has a much deeper meaning and learning even for adults. It teaches us integrity, responsibility, the passion of finding the truth and taking a stand for our friends."}, {"rating": "9", "text": "I really liked it! It was pretty funny. I overall enjoyed the voice performances, characters, & story.It even had emotion at times and the animation was really nice too! Good film! I'd see a sequel if they made one."}, {"rating": "9", "text": "Review of SmallfootWhile we were growing we’ve seen so many fictional movies which revolve around aliens and superheroes. All these movies were based on our perception about foreign objects.  This movie is about how Yetis look at humans. It’s about how they, out of the fear of humans, create their own world at the top of the mountains where they knew humans couldn’t come because they couldn’t survive there. It is a fiction but has got a lot of realistic day to day things to teach us. First thing that it teaches us elders is about the responsibility towards our families. The Stonekeeper, who is also the leader of the clan, has been able to protect the village from humans for many years. Not only that, he has also been able to create such a mechanism that the village is completely cut-off from humans. Firstly, he made the villagers believe that their mountain was placed on a floating cloud. He also made them create the clouds through steam which they never knew they did. All they knew was that they were feeding the elephants holding the clouds. He made them believe in many such superstitions just to keep them away from danger. His only motive was to be ‘better safe than sorry’.Percy, the human teaches us about integrity. Initially, he was tempted to create fake news about the Yetis with the help of his co-worker Brenda but later when he experienced the truth about them, he stood for them. He could’ve used all the media that he had on his phone to become rich, but he chose to delete them making people believe that the whole ‘Yeti’ thing was a hoax. He also teaches us about taking a stand for our friends.Migo teaches us that the stones (our perceptions and assumptions) are not always right. We always need to dig deeper and find the truth even when it doesn’t look true and a lie is sometimes so evidently true. When the Stonekeeper showed him the visuals of how humans harmed Yetis in the past, it was quite evident to Migo because his first encounter with a human (Percy) too was not too friendly. However, he forced himself not to believe what he saw and continued pursuing the truth. Meechee, Kolka and Gwangi teach us about teamwork and confidentiality.The most important lesson that I personally learnt is from Fleem, the pessimist. The best part is when he is counting the pros and cons before jumping off the cliff when the rest of his friends have already jumped. I hadn’t realized this until I watched it in the movie how important it is to take some major decisions thoughtfully. I personally have made many mistakes in taking hasty decisions.Smallfoot is not just for kids. It has a much deeper meaning and learning even for adults. It teaches us integrity, responsibility, the passion of finding the truth and taking a stand for our friends."}, {"rating": "8", "text": "E-Value: 8Acting: 8Plot: 8Migo (Tatum) is a Yeti who lived in a hidden village in the mountains above the clouds. While learning how to ring a gong from his father in the morning (by catapulting and hitting the gong with the head), he missed the gong and flew out of the village. Out there, he discovered a human pilot (who crashed his plane) which he and the Yetis called them ‘smallfoot’ as the Yetis believed they are just a legend.Unable to prove the existence of a human (or smallfoot) to the Yetis in his village, the village chief, Stonekeeper, banished him until he can come to his senses. With the help of the Stonekeeper’s daughter, Meechee (Zendaya) and her secret group which she led called Smallfoot Evidentiary Society, they helped him go down below the clouds to bring a human up to the village to prove their existence and end his banishment.At a local town, Percy Patterson (Corden) is a wildlife documentary filmmaker; saw an opportunity after he learnt the existence of the Yetis from the human pilot who crashed his plane earlier. Hoping to revive his career, he begins his quest to look for Yetis until he sees Migo in town with his own eyes. With a human meeting a Yeti in public, the comical, misunderstanding and misadventures starts here.Although this movie may not be as hype as Disney or Pixar movies, this movie is still fun and enjoyable for younger viewers. The plot of the movie is simple to understand and not a rocket science. The songs in this movie are quite nice and I can see that the cast put some efforts in singing which I totally enjoyed it. There are many funny moments in the movie that can tickle your bone, especially with scenes involving a ‘communication’ between human and Yeti.While the movie does not exactly utilise a big bad villain, it also means that not every movies intended for younger viewers must have a big bad villain. As long as the story is good and well executed, the lack of big bad villain can be overlook. If you are planning to take your children for some weekend family activity, give this movie a shot."}, {"rating": "7", "text": "I liked the overall idea behind the plot but i think Warner Bros has failed to deliver the animation thats worth 80mil dollars. If you have any children though - don't miss it."}, {"rating": "5", "text": "Not unenjoyable and the visuals are solid but it really doesn't offer much."}, {"rating": "7", "text": "\"Smallfoot\" was a movie where its story because of its childish way is not so captivating but in the same way to see it is fun and entertaining, besides that the characters are good and their concept is simple to understand."}, {"rating": "5", "text": "No esperaba que se tratara de un musical, lo cual no fue mucho de mi agrado."}, {"rating": "8", "text": "ceritanya menghibur sekali sampai bikin saya ngakak, tetapi sayang endingnya kurang kuat ceritanya, Jadi kelihatan kalau agak maksa. Tetapi ada pesan tersendiri buat sebagai orang tua dan anak anak"}, {"rating": "4", "text": "Wrong Key With A Right Note.SmallfootWarner Brother looks like half Illumination and half Disney, and clearly far away from being Pixar. This knack of creating a whole new world and jumping on another perspective to draw in the laughs and humanize the characters- it may sound like a long procedure- is clearly outdated. And addition to that with chalky conversation that raises doubts more than it advances the storyline, it shucks away the integrity within first few minutes. The music too isn't engaging or melodious to convince us to hum along (except for the last track) but what's worse above all is the fact that it isn't an essential part of the narration, it feels like the makers are spending up their time.The emotional shots that will help you connect instantly are frankly cheap and manipulative, overriding the only piece of content that they have, this predictable storytelling gives away everything in one shot and then is left with nothing but petty laughs and empty music notes. The background tale of blending in the nature of wilderness and social animals, is narrowed down to a better and admirable point but with that comes a great amount of baggage that you ought to lop off and suffer for; not a fair trade.Aforementioned the humor is quite childish, it is one thing to not explore new territories and draw a line on R rated ones, and another to have a pun that is incompetent to draw in a single laugh. But still with fumbles like this here and there and ironical comedy as it puts us in a different shoes, the film qualifies with good visuals and a happy go lucky tone. Tatum, Zendaya and Corden lifts up few tunes nicely with some good work on voicing their characters. Smallfoot has too big a foot to fit in the shoes, expectations outgrows potential and pretentious inessential melodrama fills in the void."}, {"rating": "8", "text": "Every performance is great or do-able which is saying something for a kids film. There have been movies recently where you can just tell when the voice actor/actress is just cashing in. I do not get that sense here. This is a funny kids film. I laughed more at this film than the last 8 or so movies I have seen. Sure some is just slapstick and cheesey jokes, but come on. It is a kids film."}, {"rating": "8", "text": "Hollywood! Your grip is doing wonderful! The Teen Titans Go movie almost made you trip over and die! Same with the Emoji Movie but this movie saved your life! The plot gets too fast and way too confusing at times but the animation is very nice!"}, {"rating": "7", "text": "The main message is surprisingly refreshing, well-set, quite important, and above all, could appeal to and resonate with everyone whatever how old is he/she.An issue I had with Pixar's Oscar-winner, Coco is that it has too many secondary messages that besides they were ridiculously excessive, they were intrusive, confusing that made me not even sure what the main moral was, heavy-handed, and completely unnecessary to the main plot. Fortunately, It's not totally the same case here. Of course, the other minor messages and lessons that are conveyed throughout the movie can feel redundant and annoyingly in-your-face, but the good thing is that they are never distracting nor unnecessary. They are justified either by the connection to the characters' arcs, or by the fact the every sub-plot lead to the other finely. In doing so, the main message has never been overshadowed, and was predominant at all parts of the movie.Yes, the movie is literally split to a number of parts. But, alas, almost every part consists of a totally familiar, and infuriatingly predictable story that you can easily see how it will end a million miles away. Honestly, you can even readily predict the decisions the characters will make, nay the lines the characters will say!The humor lacks originality just as the story does. This actually added insult to injury, because when I tried to pass over the fact I know how this plotline will end, I found myself watching some insufferably boring, and utterly bland and uninspiring visual gags that are just not funny. The Jokes in general in this movie are pretty lame. I didn't had a single laugh throughout the entire runtime of the movie, but I smiled a couple of times, to be honest.So, it's clear that there are a lot of \"I've seen this before\" moments in this movie, and that shouldn't be surprising, for most of animated movies nowadays have this problem. But Smallfoot didn't settle on one generic story due to the episodic structure it has, and that's what amplified the feeling of familiarity, and made the clichés blatantly noticeable. But even the majority of the songs are totally unremarkable, and some of them are badly placed and feel interruptive, but all the songs are by no means bad. Actually, they are all good!As much as I found the first fifty minutes of the movie kinda dull due to the formulaic storylines as I mentioned above, especially the first act which was moving in a most predictable pattern that even its absurdly fast pace couldn't save it from not being boring, there were some twists and turns that happened at the beginning of the third act that really elevated the whole movie. I won't say the new path the movie took after these twists, especially the major one, wasn't familiar. But the good thing is that it's not predictable. And I really mean that I finally didn't know how the movie would end, and I think that's the most important thing. Not to mention that I was really intrigued, and really excited to know what the characters would decide, what they would do next, and how the things would turn out. And surprisingly the movie kept surprising me till the very end.The movie is filled with eye-popping colorful slapstick sequences that are just delightful to watch. The quality of the animation is top-notch, and the landscapes and the snow are simply dazzling. Let alone the well-designed characters.The voice cast is solid, if not extraordinary by any means. I liked James Corden as the \"Smallfoot\", Percy, though. But it's Danny DeVito's vocal performance as Dorgle, Migo's dad, that I found quite unique and uncanny. Channing Tatum is fine as Migo, and the same goes with Zendaya as Meechee.Smallfoot is so not nothingness, it's definitely somethingness! But I wish the story was as original as its message, and I wish the humor was as good as its animation.(7/10)"}, {"rating": "7", "text": "This was an entertaining experience! I´m a digital animation student and I watched this one because I was told it had very good animation, and it does. Also, the pictures in most of the film are just beautiful, the snow, the mountains, and the colorful sky. But as it has very good things, it lacks in other things like the character design. The movie was very appealing but the characters had no real personalities, just a lot of stereotypes and all along simple yetis or humans. I really prefer the Yeti on Monsters Inc.The story does have a good message, but it was very easy to predict. Also, I felt the movie to be a little longer than it really was, maybe because at some point it appeared to have finished, but then it continued. You will definitely have a good time with this movie, but you will forget about it the next day."}, {"rating": "2", "text": "A painfully mediocre and annoying kids movie. Every time the character Fleem was on screen I wanted to reach through the TV and choke him to death."}, {"rating": "10", "text": "Yeti, you say? Then come on down and see Smallfoot and tell me what you think!"}, {"rating": "6", "text": "Smallfoot is an animated film produced by Warner Animation Group, which tells the story of Migo, a Yeti whose world is turned upside down when he encounters a mythical \"smallfoot,\" or a human. The film is based on a book by Spanish animator Sergio Pablos and is aimed at children. The animation is bright and cheerful, and the tone is light-hearted, but the film lacks originality and visual distinction. The plot is similar to other family-friendly films, and the animation is reminiscent of other movies produced by Illumination. The cast includes Channing Tatum, James Corden, Danny DeVito, Zendaya and Patricia Heaton, and LeBron James. The film is a lighthearted distraction for children and encourages them to be more inquisitive. However, it also contains a deeper message about the rejection of scriptural authority and questioning societal norms, and it ends with a heartfelt finale._______________________Smallfoot es una película animada producida por Warner Animation Group, que cuenta la historia de Migo, un Yeti cuyo mundo se pone patas arriba cuando se encuentra con un mítico \"pequeño pie\" o humano. La película está basada en un libro del animador español Sergio Pablos y está dirigida a niños. La animación es brillante y alegre, y el tono es alegre, pero la película carece de originalidad y distinción visual. La trama es similar a la de otras películas para toda la familia y la animación recuerda a otras películas producidas por Illumination. El elenco incluye a Channing Tatum, James Corden, Danny DeVito, Zendaya y Patricia Heaton, y LeBron James. La película es una distracción alegre para los niños y los anima a ser más curiosos. Sin embargo, también contiene un mensaje más profundo sobre el rechazo de la autoridad bíblica y el cuestionamiento de las normas sociales, y termina con un final conmovedor."}], "recommendations": ["okja", "the_good_dinosaur", "raya_and_the_last_dragon", "the_boxtrolls", "the_iron_giant", "brave", "how_to_train_your_dragon_the_hidden_world", "greenland", "bambi", "alpha", "goodbye_world", "lucy", "the_road_to_el_dorado", "babel", "a_monster_calls", "kubo_and_the_two_strings", "interstellar", "next_gen", "vivarium", "crash", "downsizing", "annihilation", "colossal", "machine_gun_preacher", "avatar"]}