{
  "id": 4147,
  "title": "Snitch",
  "starring": [
    "Dwayne Johnson",
    "Barry Pepper"
  ],
  "runtime": 112,
  "genre": [
    "Thriller",
    "Drama",
    "Action"
  ],
  "description": "Construction company owner John Matthews learns that his estranged son, Jason, has been arrested for drug trafficking. Facing an unjust prison sentence for a first time offender courtesy of mandatory minimum sentence laws, Jason has nothing to offer for leniency in good conscience. Desperately, John convinces the DEA and the opportunistic DA Joanne Keeghan to let him go undercover to help make arrests big enough to free his son in return. With the unwitting help of an ex-con employee, John enters the narcotics underworld where every move could be his last in an operation that will demand all his resources, wits and courage to survive.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/unjVtbWDWIQvVUeiPUTzyykQiVF.jpg",
  "categories": {
    "plot": 6.103448275862069,
    "acting": 6.371428571428571,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 7.5,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 6.4
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Snitch wasn't a bad movie. I just did not think it was as good as it wanted me to think it was. This is no \"Faster\" or \"GI-Joe\". Dwayne Johnson tries to play a simple man in over his head. Unfortunately his pecs the size of the Brooklyn Bridge make it a little less convincing. Like I said not bad, but compared to the abysmal spring 2013 movie season this thing is a masterpiece!!!!"
    },
    {
      "rating": "4",
      "text": "Let me start by saying that this is probably the best Dwayne Johnson performance in his career which is why its a shame that its in this monotonous crime thriller. Snitch is the story of what happens when John Matthews (Johnson) finds out his son has been arrested for distributing drugs. Matthews decides he must infiltrate a drug ring to bring someone to justice to truncate his sons prison sentence but this may ultimately ruin everything he has ever built. At the beginning of Snitch you are reminded that this is a film based on actual events and then these supposed real life people go on to do some of the most ridiculous things in the name of family and justice that you find it ever so hard to believe that this has any standing in reality. The film splits its time between two families, one being John's family, the other belongs to one of John's employees, Daniel (Jon Bernthal), an ex con looking for a second chance for him and his family. The film feels no desire to discuss or even talk about these characters lives or how they got to this place, instead it lets the viewer fill in the gaps thanks to vague hints dolled out in increments over the course of the film. This allows you to make your own story for them but it also changes very little to do with the film making it lazy storytelling at best. As stated above this is a film grounded by a strong central performance by Johnson but the films slow pace and nonsensical storytelling makes it impossible to enjoy as the characters don't do normal logical things and they have not really been given any character traits to suggest they might even consider doing this. The end therefore leaves you unsatisfied and if your anything like me, quite a bit confused"
    },
    {
      "rating": "7",
      "text": "This was a decent movie with a good story and realistic action sequences. At times it seems a little absurd (father with another daughter and wife going to such lengths for his son and ex-wife...) but overall I enjoyed it. Note that this is not an action movie but more of a drama."
    },
    {
      "rating": "7",
      "text": "It starts off telling a story about how a stupid pothead was setup by his friend and was caught by the po-po. The action scenes are similar to that of your typical action film like Die Hard. The effects were well done. Dwayne Johnson did a good job in this movie and it was nice seeing Jon Bernthal who did a great job in TWD. Overall a good film but nothing special."
    },
    {
      "rating": "0",
      "text": "Complete boredom. I tried so hard to get through this movie The Rock was so miscasted it is ridiculous. 5 Minutes of action in the entire movie and I think I may be pushing it."
    },
    {
      "rating": "6",
      "text": "Any film with Dwayne \"The Rock\" Johnson on the front cover inspires images of butt kicking and broken bones, however, this film appears to be an attempt to leave that behind and show the world that their is more to him than big muscles.\r The Rock puts in a good performance and that coupled with Barry Peppers excellent portrayal of a gritty, streetwise cop and good performances from Susan Sarandon and Jon Bernthal means the film is definitely not lacking in acting quality.\r However, what starts out as a realistic and engaging storyline quickly becomes depthless and far from original, culminating in a far too predictable conclusion that completely lacks any twists and leaves the watcher wishing that it had been a balls-to-the-wall Rock action fest.\r In conclusion a poor, unoriginal storyline saved by some good performances and proof that Dwayne Johnson can act in a slightly more serious role as well as his usual broken bones style."
    },
    {
      "rating": "7",
      "text": "This is a more genteel Dwayne Johnson than were used to and paired with the recent leap in his acting ability it's been good to see 'The Rock' alter ego finally (and successfully)go to the great Smackdown in the sky and the new and improved \"Thespian\" flourish. I've been enjoying (and occasionally cringing at) his action movies since he started acting. There has of course been other athletes who've tried and failed at the crossover but Dwayne Johnson has come up through the ranks and has made me take notice. Strangely, I just saw 'Faster (2010)' a few days ago for the first time, and was taken aback at his rock steady performance (no pun intended) doing an hard action movie with very little dialogue and saying more in those few words than all his other films put together. It was good and he's done it again. I remember thinking similar things about Mr Marky Mark and I think Mr Wahlberg is a tremendous actor now. I just remembered, Marky and Rock (Y?) were in 'The Other Guys' together, lol. It's been directed by former stuntman Ric Roman Waugh who gave us the reasonable prison flick 'Felon'. This is a more stylish movie than his others and he seems to be one of those people who has to work hard at his job. You know the way P T Anderson or Tarantino just seem to know where the camera should go? Well most need to start small and work up so were seeing Ric Roman Waugh about a third of the way up the directing ladder. He is purty promising though.\r The bottom line is, this has some good performances, it's got a good and interesting (Susan Sarandon) cast, the pacing is not as smooth as it could be, particularly in the slow middle but it's been done on a budget of $15 million which it's just pulled back in it's first week. I guess that says it all really.  Highly Recommended  Score: 7.2/10  N∆V  navq@ymail.com"
    },
    {
      "rating": "1",
      "text": "Slow and tedious. Don't waste your money. 10 minutes of action at the end but before that it is a talking movie for almost the whole time. It feels like Dwayne Johnson fit this movie into his schedule. The script was hacked together by committee. Yes, I felt like I was ripped off. Don't pay good money, see it on TV if you are interested in a year."
    },
    {
      "rating": "0",
      "text": "I almost vomited from boredom.  Same plot as always.  Same cheap tricks.  When are these hollywood film makers going to start catering to smart, compassionate people?  They're oiling a machine that's destroying our planet.  Makes me sick, literally."
    },
    {
      "rating": "8",
      "text": "Snitch is a great film, the badasses are setting aside the hot cars and woman but instead they are saving family in a badass way. Dwayne Johnson is awesome because of his pumped up muscles, I am a big movie fan and this guy is the best body builder ever leaving Arnold S. Ric Roman Waugh has said it's a true story, but I don't think this ever happened... Maybe he is right. Well overall, Snitch is a great edge of your seat ride. 8/10!"
    },
    {
      "rating": "9",
      "text": "Unbelievably great movie. Edge of my seat the whole way through. I thought it would be just a dumb funny action movie like The Rundown or something. Nope. The title, poster, marketing. Everything was a lie hiding a much more toned down, thoughtful piece. They're's maybe 12 minutes of action in it's almost two hour runtime. The rest of it is set up, slowly paced but intense. Films like this are why this guy is my favourite actor. He can make any terrible movie half way decent, but in a smart, well executed film like this he makes it great."
    },
    {
      "rating": "7",
      "text": "It's first act could use a little sprucing up, but everything else about this movie shines bright: colorful characters, thrilling action/tension, and a devoted lead performance from Dwayne Johnson."
    },
    {
      "rating": "7",
      "text": "This is perhaps one of Dwayne Johnson's better movies and Susan Sarandon is good as district attorney Joanne Keegan. This movie adds emotion with hardcore action making it slightly better then most Dwayne Johnson movies. However it did start off slowly and it gradually started picking up and taking off to become a good movie. Overall it is actually a decent movie."
    },
    {
      "rating": "7",
      "text": "\"Snitch is no-where near originality or up to par with the Rock's other action flicks, but entertaining enough to the point where if you can get past the flaws, there are many, you may actually find enjoyment out of this easily forgettable action film.\"  B"
    },
    {
      "rating": "7",
      "text": "This is a good movie, and a bit of a surprise.  It is well-acted and well-paced.  It sits somewhere between blockbuster and indie territory, which might explain the mixed reviews.  With that being said, it is an engaging drama and well worth watching.  It is very comparable to The Yards in feel and quality."
    },
    {
      "rating": "8",
      "text": "Some movies are I find are over rated here on Meta Critic, some under rated.  I believe this movie is vastly under rated  for men. For women, I can understand why you might not like this movie. But for men... I believe most will enjoy it.  Suspenseful through out, good directing, good cinematography, and good editing. Chase scene is not over or under done  nice."
    },
    {
      "rating": "9",
      "text": "This isn't your typical action movie. You aren't going to see bullets constantly flying, you aren't going to hear cheesy one-liners, and the heroes aren't going to walk away unscathed. That's what makes \"Snitch\" so great. Dwayne \"The Rock\" Johnson gives a fantastic performance, if not occasionally lacking enough emotion, and Jon Bernthal (Shane from The Walking Dead!) is fantastic. The plot is realistic and really pulls you in. As a matter of a fact the whole movie is realistic, and that's what separates it from other movies and helps keep it tense and enjoyable. It's just a fantastic movie, the casting couldn't have been better, and constantly keeping you worried that not every character will walk away is something I haven't seen in many movies. \"Snitch\" is amazing and I highly recommend it."
    },
    {
      "rating": "7",
      "text": "A teenager is wrongly accused of a drug distribution crime and faces 10 years minimum unless he can 'snitch' on the dealers, his Father (The Rock!) sets up a deal with the FBI to crack a Mexican drugs cartel to free the boy.\r I've got to admit I was expecting a \"Rock action movie\" looking at the poster, and yes the finale does include an exciting high speed chase and shoot out, but for the most part it's more drama, well acted by the cast, which includes Susan Sarandon and the excellent John Bernthal (Walking Dead), and kudos to Dwayne Johnson, a much more downbeat dramatic performance from the big man, he doesn't play the usual wisecracking, ass kicker we're so used to. (check out \"Walking Tall\"-great fun)\r A solid action drama, as I said, exciting finale, and plenty to recommend this pleasant surprise of a movie."
    },
    {
      "rating": "10",
      "text": "One of the few action movies I've seen recently that manages to make all the events seem plausible. Believable motivation and believeable action. Dwayne Johnson has a few \"off moments\" in regards to his acting but they are few & far between."
    },
    {
      "rating": "6",
      "text": "Decent Rock film with good performances and gritty feel though not always engrossing."
    },
    {
      "rating": "8",
      "text": "Dwyane Johnson proves once again that he's become a surprisingly versatile actor and capable of being the leading guy in Snitch, a very good movie that was suspenseful, intense, and emotionally driven. Barry Pepper, Susan Sarandon, and formerly of the Walking Dead John Bernthal provide a great supporting cast but The Rock leads the way in a movie about how far a father is willing to go to protect his son. I wasn't a huge fan of some of the camera work and other cinematic effects but there's nothing overdone about this film and that's actually a good thing. The story develops well and is enough to keep you engaged without the need of excessive explosions or anything else. This isn't actually an action movie and just about any other quality actor could've played the role of John Matthews but as I said, the fact that Dwyane Johnson did it well shows how far he's come. Between his role in Fast & Furious 6, his recent comeback on WWE, his new shot on TNT \"The Hero\", and this leading role, Dwyane Johnson seems to be everywhere right now but he's performed his roles well so that's not a bad thing."
    },
    {
      "rating": "7",
      "text": "Had me intrigued till the preposterous and unnecessary action-heavy finale. And even though it gets a little preachy towards the end, this is some fine dramatic work and Johnson's performance is more than solid."
    },
    {
      "rating": "5",
      "text": "Better than I thought. It was a little slow but Johnson's puts up a fighting fatherly performance. The action kind of got drowsy but the main idea was decent."
    },
    {
      "rating": "5",
      "text": "Snitch was a very disappointing movie.The best thing going for it is the Rock, nothing much besides him.It`s a low budget movie, that felt like a TV movie allot of times.I wanted to like it but it`s average at best.Honestly it`s of those movies Dwayne Johnson is just trying to prove hes more than an Action Hero."
    },
    {
      "rating": "0",
      "text": "Snitch tries to show sympathy but ends up going off-topic with uneeded plot material."
    },
    {
      "rating": "6",
      "text": "first  off all i would like to state that i have nothing against dwayne johnson, i actually  appreciate his performance however\rthe movie is overdramatic and needed a much better stand out performances and not just good music.\rthe main glitch here is the story  it just too hard to believe that it has been taken from real events because if anyone knows a little bit about drug cartels\rhe would know that it's impossible to reach the mafia boss after one successful  job. plus all they ever needed is his phone number to trace him to his location and arrest him!\rwhat's the charges  driving his kid to school, and how are they going to attach that 83 million to him, i mean if NSA are tapping all mobile phones in the states\rbut they can't get the drug-lords-phone-numbers so they need an inside job to do so, then you're doing a terrible job  NSA.\ralso are you telling me that the united states is so generous that they gave a 100G rewards each? NOPE."
    },
    {
      "rating": "7",
      "text": "A pretty good film with really solid character development.  This is not a normal action film there is a lot of very dramatic moments.  Nothing special but it's just a solid film. B"
    },
    {
      "rating": "9",
      "text": "Snitch was very nice since it is based on a true story. It has a good plot and Dwayne Johnson is just the perfect person for that role. I rated it 9 out of 10 because it was a little bit complicated at its middle and there are some non-skilled cast in the movie."
    },
    {
      "rating": "3",
      "text": "Not a very good movie. Guys son gets tricked by his friend and as a result gets thrown in jail and the father makes a deal with authorities to go undercover and help them destroy a drug cartel. Very boring movie, drama. Not recommending it."
    },
    {
      "rating": "8",
      "text": "Not sure why this is getting a lot of negative reviews. Sure it is not going to win any oscars, but it's a solid thriller/action flick with the always charismatic Dwayne Johnson. A lot of thick suspense and great, et not over the top, action sequences. I enjoyed it."
    },
    {
      "rating": "4",
      "text": "Not the action promised. Johnson had a mediocre performance, but the kid had a great performance, to me. I didn't really feel any suspense or thrill either."
    },
    {
      "rating": "2",
      "text": "Boring!  Most scenes shot in the dark. Not worth the money.  Dozed off during the first half.  Dwayne Johnson is better than this.  It's not worth rating.  If I had to I'd rate it \"D\" for DULL."
    },
    {
      "rating": "4",
      "text": "This movie was just a really long bore. I mean going into this movie I thought that this movie would be action packed and exciting but it was just the exact opposite. I mean The Rock's performance was not to good but John Bernthal's performance surpassed that of The Rock's in my opinion. All the movie is is just an hour long drug deal. The best part of the movie was the ending just because it has the most action in it and it is also a happy ending. Don't have too much to say on this one.\rOverall: 4.75/10"
    },
    {
      "rating": "8",
      "text": "After hearing little about Snitch in the media, I wasn't sure if this was going to be a movie worth two hours of my life. As I was typing this review, I learned that the movie only made 42 million dollars in the box office. I was rather surprised by this considering Grown Ups pulled in a whopping roughly seven and a half times more than that. (300 Million)\r Snitch began showing John Matthews' (Dwayne Johnson) son, Jason Collins,(Rafi Gavron) who is agreeing to get shipped some illegal drugs and \"hold them\" until his friend can come pick them up. When the package comes, he opens it and then sees a tracker in the bottom of the box. When cops arrive he is already running away and then gets captured and goes into custody. By this time I already liked the movie because we learned what the movie was about and the problem that would try to be fixed, within the first ten minutes of the film. After meeting federal prosecutor, Caroline Keeghan (Susan Sarandon), John learns that he can try to bust other drug dealers to reduce his son’s sentence.\r After getting beaten up, money stolen, and his truck almost hijacked all on the first try, he goes back to meet with Keeghan. John meets with a former gang member Daniel, who works for him at his company. Daniel agrees to help and they go to a bad part of town to begin. They meet Malik, (Michael Kenneth Williams) who does not know he is being recorded. If he gets Malik and the drugs, she will reduce Jason's sentence to two years, one year suspended. Daniel thinks this who thing is real and does not recognize John's agents trailing them.\r After John gets home for the night he has a stressful conversation with his wife Analisa. John says that \"Every move I make, or don't make, Jason will have to live with for the next ten years of his life.\" I thought this was the most powerful part of the movie. I thought about this quote for a while and think it was very important. John basically said that if he doesn't do anything, his son will be in prison for ten years of his life. If he does do something, though he is risking his life, he is helping his son get out faster. What John does impacts how Jason's life turns out. John makes an even bigger deal with Keeghan that will assure instant release of Jason with the arrest of \"El Topo\" and the drug money.\r Without giving away the rest of the movie, though I correctly predicted how it would end, I still thought it was a solid film and was very underrated. To me, it does not make sense that an Adam Sandler comedy made so much more than a high end action thriller with a 35 million dollar budget. I thought that Dwayne's acting was top notch in this movie and he was the perfect person to play the father. I was reluctant to see Snitch but am glad I took the time and thought the film paid off."
    },
    {
      "rating": "6",
      "text": "Dwayne seemingly miscast in the lead role of this tense crime drama. John bernthal steals the film and kept me interested. Other secondary characters stand out nitably Susan sarandon Michael k Williams and Barry pepper.... It's a great movie with an ok production value to it, just suffers from having the wrong lead actor!"
    },
    {
      "rating": "7",
      "text": "While not being a revolutionary action movie, it was still effective. The acting was good enough for this kind of movie, the characters were likeable and the movie was entertaining. Even if it wasn't always believable, the story was cliché and predictable and the movie  would've beneficiated from an R rating, it was still more than watchable and even enjoyable at times."
    },
    {
      "rating": "7",
      "text": "Good movie. Loved the sex scene and when Tom Cruise jumped from that really cool skyscraper and the rock just drove his truck through the building and it transformed into optimus prime and it was just really awesome 11/10 but the score only goes to ten."
    },
    {
      "rating": "7",
      "text": "There were a number of moments in this movie during which I was shaking my head due to their complete implausibility (one particular incident that comes to mind is a highway chase during which a man fires a shotgun one-handed out the window of an 18-wheeler truck while remaining in perfect control of the vehicle), but its quiet, intense handling of the subject matter and powerful performances are just enough to elevate it above typical action fare. Dwayne Johnson is always entertaining to watch on screen, but this was the first time (in a serious movie, at least) that I felt totally engrossed by one of his performances.To me, Mr. Johnson is a criminally under-appreciated actor, especially considering he has no formal training as one: you could count his WWE theatrics as \"acting experience\", I suppose, but peers of his from that world (*cough cough* John Cena *cough cough*) have also attempted the transition with far less success. This tells me that his natural charisma and talent for the trade far outweighs his lack of experience (something that, unfortunately, the films he appears in tend to coast on due to lousy screenwriting and not-always-so-amiable co-stars), something I had suspected for a while but was finally confirmed with this film. As John Matthews, he isn't a bounty hunter, or a CIA/Special Forces operative with a tortured past, or a Diplomatic Security Services agent firing a minigun in the middle of a city street (*cough cough* Fast and Furious *cough cough*)--he is an ordinary man caught up in an extraordinary situation (the movie also understands that even for someone with muscles on their muscles, four on one is a tough fight).John's estranged teenage son Jason (Rafi Gavron; also, three cheers for the overused plot point!) is somehow convinced by a friend to take possession of a huge bag of drugs for the weekend, only to promptly be arrested in a DEA sting operation. With a minimum sentence of 10 years, the overeager district attorney (Susan Sarandon) informs John that the only way to spare Jason the prison life already taking its toll in the form of frequent beatings and abuse is by helping her fry a bigger fish. Time for a convenient plot point? I think so! One of the workers at John's construction company (Jon Bernthal) is an ex-con trying on behalf of his wife and son to lead a clean life, but is eventually persuaded by John to start introducing him to and setting him up with first local drug dealers (Michael Kenneth Williams) and eventually big-time cartel players (Benjamin Bratt). Now, it's in segments like these that this film goes beyond implausibility and takes a nose-dive straight into absurdity. John's main argument for why these hardened criminals should trust a straight-laced, ordinary guy like him is that he owns a legitimate business and the trucks utilized by his construction business carry too much freight to be properly searched. In that case, couldn't the cartels just buy a bunch of trucks and load them up with cheap and useless crap that can serve as a cover for the drugs? How no one had thought of this earlier in this movie is astounding to me. Additionally, what kind of shady, underground drug dealing world is this that people just trust outsiders implicitly because of one successful run? The escape from the rival cartel was impressive, sure, but new initiates don't just make leaps and bounds within a criminal organization like that. Any gangster will tell you, that s**t takes time.As compared to other \"true stories\", however, the story is fairly solid, and elevated far above the bar set by similar films with its committed, natural performances. Sarandon and Barry Pepper are good as the district attorney and the DEA agent acting as John's handler, Bernthal makes his Daniel character sympathetic and likable enough to make a blip on the radar as what could have been a stock character, and though dipping a bit deep into \"whiny teen\" territory (Hollywood would have you believe that there's only two ways to play teenagers on the silver screen these days: as spoiled brats and wise far beyond their years. There is no in-between.) Gavron makes us genuinely care what happens to Jason. The standout, as I said before, is Johnson, whose stoic determination and somewhat angry yet urgent calm captures the essence of a father willing to do whatever it takes for his son.In short, while by no means a masterpiece it is entertaining enough to warrant the DVD purchase if you're a fan of these types of movies (if you need some more examples, \"Savages\" and \"Contraband\" are the two that come to mind). It's also worth checking out simply to see Dwayne Johnson at his dramatic best, even if he is let down by the averageness of the movie. 7/10"
    },
    {
      "rating": "8",
      "text": "Snitch was a good film to watch as it was a crime drama. It was about when John Mathhew's (Dwayne Johnson) son, was under arrest for selling drugs and the film tells you what happens in everyday life. A good part of the film is when John Matthew's son got pulled up by the police and eventually got arrested for illegal drugs trafficking."
    },
    {
      "rating": "10",
      "text": "dope movie realy sad talks about life bra  best ever cant wait next  one yeah"
    }
  ],
  "recommendations": [
    "the_town",
    "safe_house",
    "live_by_night",
    "those_who_wish_me_dead",
    "the_taking_of_pelham_1_2_3",
    "the_next_three_days",
    "3_days_to_kill",
    "the_accountant",
    "killer_elite",
    "taken",
    "angel_has_fallen",
    "run_all_night",
    "no_escape",
    "the_equalizer",
    "the_commuter",
    "homefront",
    "man_on_fire",
    "savages",
    "the_mechanic",
    "nobody",
    "the_guardian",
    "unstoppable",
    "parker",
    "gone_baby_gone",
    "unhinged"
  ]
}