{
  "id": 2838,
  "title": "Snowden",
  "starring": [
    "Joseph Gordon-Levitt",
    "Shailene Woodley"
  ],
  "runtime": 134,
  "genre": [
    "Drama",
    "History",
    "Crime",
    "Thriller"
  ],
  "description": "CIA employee Edward Snowden leaks thousands of classified documents to the press.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yfK7zxNL63VWfluFuoUaJj5PdNw.jpg",
  "categories": {
    "plot": 7.564516129032258,
    "acting": 7.09375,
    "ending": 7.375,
    "soundtrack": 1.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 7.444444444444445
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The best part of Snowden was the lead actor. Joseph Gordon-Levitt does a great job playing Snowden, the camera work was excellent, and the story was simplified to where a general audience could understand it. However, instead of simply telling a straightforward story about the guy, the director infuses his own personal left-wing politics at points and thus, the film becomes a bit cringe-worthy at those points. For example, while Oliver Stone tries to remain neutral and let the audience form their own opinion of Snowden's actions, it's quite clear from the way the story is told that he supports him. In addition, the film doesn't have as much drama as it should have. It's a bit dry emotionally. However, Levitt's fantastic performance and beautiful camera work saves it and makes Snowden an overall decent film."
    },
    {
      "rating": "10",
      "text": "Well done, informative, and entertaining, but with the sad ending that Snowden himself predicted: His worst fear was that nothing would change (except to get worse).\r And so it is."
    },
    {
      "rating": "10",
      "text": "Support this movie and Snowden's cause by spreading the message and helping this movie get the popularity it deserves. This movie embodied the great quest Snowden had to take quite factually correct and it was done excellently well! Want to be inspired to fight against corruption? Watch Snowden."
    },
    {
      "rating": "8",
      "text": "A much better film than many of the reviews suggest. The movie is provocative and retells a very significant development in recent history. Some of the criticisms of this film seem to be that the movie is at times slow and relatively dull--I think that stems at least in part from the fact that the real-life Snowden is not the most exciting person and his life, while interesting, was not particularly compelling until 2013. He is not an action hero, but a real life person who made a series of decisions that are bound to attract both praise and scorn. I think that dynamic is captured by the movie, perhaps to its detriment with some reviewers.The movie is a bit long, but, in my view, there weren't scenes that warranted obvious cutting. A very good film and I'm glad I saw it."
    },
    {
      "rating": "3",
      "text": "Definitely not one of Oliver Stone's best. This is a portentous and, more unforgivingly, boring take on the Edward Snowden story. Lacking the amazing style and cleverness of JFK, this telling sees a lot of actors drowning as they try to make their characters come alive. A pointless exercise given that Citizen four, a documentary on the same subject, is so much better."
    },
    {
      "rating": "8",
      "text": "Great movie that doesn't make factual sacrifices for the sake of entertainment.  This is a political drama, not an action movie, so I'm not sure why people would complain about the lack of action...?\r While it's hard to know exactly where on the hero/traitor line Edward Snowden actually falls, it feels like the movie did mostly a good job of presenting the justifications of both sides of the argument.  Obviously, you're seeing the movie through Snowden's perspective, so it does make certain assumptions we can't be sure of.  Such as his motivation.  The movie presents Snowden's motivation as patriotism for his fellow Americans and, simply, the existence of a moral compass.\r Obviously people will view this movie through a political lens.  The movie presents the quandary as a freedom versus security scale.  Are you okay with the government invasively spying on you in the name of greater security?  Or are your rights and freedoms of greater importance?  Personally, I skew to the latter.  I think it is deplorable what the intelligence agencies of the States did to its own citizens and to its allies.  I understand why they did it, I just believe sacrifices (including security) need to be made to protect our basic human rights.\r Those who feel otherwise may be a little annoyed by the general leaning of the movie.  But, I don't see how they could have leaned the other way when they're viewing the situation through the eyes of the protagonist, Snowden.\r Definitely worth seeing if you're either open-minded or lean towards the freedom side of the scale I mentioned.  If you believe security trumps everything else, you should probably skip this movie."
    },
    {
      "rating": "6",
      "text": "ProsJoesph Gordon Leavitt is really good as Snowden. Story was really factual and it nice to see these documentaries making a comebackConsToo much focus on Snowden's personal lifeStory was slow and the pacing was too uneven."
    },
    {
      "rating": "7",
      "text": "Well done movie by Oliver Stone.  Showed the man as well as the headlines.  Gave insight into his life and how he lived his life.  Question: at the end, you hear Hillary's voice saying he should stand trial and be punished, etc, which may have cost her votes with the target audience of this film.  Is Oliver Stone anti-Hillary?"
    },
    {
      "rating": "5",
      "text": "In spite of a strong narrative and a good performance by Joseph Gordon-Levitt, Snowden just feels hollow. The movie plays the nuances of the subject matter way too safe, and sometimes borders on the grandiose a little too much. If you are looking for a good movie about the Snowden leaks, I highly recommend the documentary Citizenfour instead. The film Snowden just lacks the punch that it so desperately seems to be seeking."
    },
    {
      "rating": "9",
      "text": "Simply the true story about the first and maybe biggest hero of the 21st century! A must see for everyone who is interesting for the topics of freedom and human rights. Snowden is a world hero and I am as German shamed that the german government didn't give him asylum - of course, because she is sill involved in hurting the rights of german (and foreign) people. In the year 2018 even more Lies, surveillance and criminal activities by the german government! Also shame on Angela Merkel as puppet of the Obama government! My highest respect for this young american guy, Edward Snowden! Truly a hero!"
    },
    {
      "rating": "10",
      "text": "This film is the must see of the summer. It tackles important political topics and sheds light on the mass information debacle a few years back. Joseph Gordon Levitt pulls of an outstanding performance playing the complex Edward Snowden."
    },
    {
      "rating": "6",
      "text": "What Snowden tries is what it tries to aim at best, but unfortunately fails at the end. This movie should try to play hard on the audience instead of playing it safe because the ridiculous part is that there's no hard tries whatsoever. See it for yourself, but don't expect too much hype over it."
    },
    {
      "rating": "9",
      "text": "I really liked how they take his story and turn it into both a cyber-espionage thriller, and a love story. That wasn't what I expected, but it worked really well in the end. I think of this dude every time I glance at the masking tape over my laptop camera..."
    },
    {
      "rating": "10",
      "text": "An important film about the politics of surveillance in our times. It has fantastic cinematography, editing, directing, cast, acting, very good scenes and good music. My only complaint is, that it's too much in too little time, so some sequences in the middle don't really pop, because you have no time to process them. This film should have been longer, because it's too dense. It could have been a good TV series, too. I hope we'll get a longer Director's Cut with more character moments and more scenes on the inner workings of the NSA surveillance complex. It's still a very good film & everyone should check it out, especially those who don't agree with Snowden. If you can, see it in 4k and at least two times, otherwise you'll miss a lot of visual and dramatic details. It's Oliver Stone's best film since \"JFK\" !"
    },
    {
      "rating": "10",
      "text": "The Snowden movie is both entertaining and eye opening. I was worried the film would not do justice to the story but Oliver Stone got it right! This story line could easily become a franchise as this film only covered the beginning of the tale and there is so much more. Thank you Oliver Stone, cast and crew for making a great film, and thank you Edward Snowden for the great sacrifices you have made."
    },
    {
      "rating": "7",
      "text": "As the famous/notorious Edward Snowden, Joseph Gordon-Levitt is quietly compelling (even though he adopts the flat delivery of Keanu Reeves). This biopic alternates between his covert meetings with the reporters who released the NSA documents and the career events that lead up to it. The details are interesting, but his relationship with his girlfriend (Shailene Woodley) drags on the momentum. Sure, the paranoia message is requisite, but director Oliver Stone let it become too didactic and too constant. As a result, the basic story is still fascinating and well told, but it's power is diluted by the film's 134 minute length."
    },
    {
      "rating": "7",
      "text": "A compelling topic based on true events, there's perhaps a bit too much fat around the edges for it to be a total knock out of the park. Yet, the performances are satisfying and the insights shocking enough to make for an entertaining biographical political drama/thriller. It just that it's tendency to dive to deep into Snowden's personal struggles leads to mixed results.Joseph Gordon-Levitt's once again gives another fantastic performance, even if his choice in voice is questionable. It's him that keeps you going even when things slow down to focus on the rather tedious to watch relationship drama. The movie also feels overstuffed with side-characters that stick around just long enough to clue Snowden in on some new shady information and then disappear for the rest of the movie. It makes sense for Snowden to lose track of these people over the course of his life and even for the movie to send them packing after they've served their purpose in the plot, but it's still disappointing to see them go as they are usually among the film's more interesting characters and are played by great actors. The likes of Timothy Olyphant and Nicolas Cage are here and gone in an instant, but who sticks around? Snowden's annoying freaking girlfriend. At least she's portrayed by Shailene Woodley who gives a very good performance despite not being given anything interesting to do. The little side excursions into Snowden's personal troubles don't due much to further the plot and at times give the movie a plodding feel. However, they are a necessary evil as they do a lot to humanize Snowden. Something I feel was one of Oliver Stone's big directions here.A good concept and great cast help make up for some shortcomings in the pace and writing. At the end of the day it's still an interesting story, even if it probably could have been told better. If the topic interests you or you are just in the mood for some political drama, Snowden may be for you.7.5/10"
    },
    {
      "rating": "7",
      "text": "I liked this better than Citizenfour actually, where I found Snowden to just be annoying and wanting to be famous.  This film shows a lot of Snowdens relationship with his girlfriend, and what he was actually doing day to day, and in different countries, for the CIA which was all very interesting, and which I had not seen in any film before quite like that.  It also actually showed what Snowden was talking about better than the documentary did itself, which I found to be somewht funny and mostly luddite in nature.  (I think he is an idiot and might as well be Amish if he thinks there will never be cameras in the future...)  But, this was a better film than I thought as it looked bad and uninteresting based on the commercials and already knowing the story, but yet this film showed me much of his personal life and actual work which you do not get from just reading about the story in the news, so it was definitely worth seeing for those reasons."
    },
    {
      "rating": "8",
      "text": "Though sometimes flat in its tone and drawn out in its pacing, this important piece of cinema nevertheless does an excellent job of detailing what happened and explaining the implications of the protagonist's actions. This biopic, though a somewhat fictionalized account, ranks far superior to the \"Citizen Four\" documentary that captured history as it happened but became so bogged down in technical jargon that its impact was lost on virtually anyone not fluent in tech-speak. This may not be Oliver Stone's best cinematic effort, but it's arguably one of his most significant productions."
    },
    {
      "rating": "6",
      "text": "The best of Oliver Stone is hard hitting, intense, edgy, and controversial.  That was then.  This is now:  soft edged, melodramatic, predictable, harmonious.  Whatever you think of Stone, he is a giant of cinema and his voice so strong he created a brand of identity and signature subject matter which very few big movie directors ever achieve.  Give him the credit for tackling tough content nobody else would touch and executing with big class A production value and a zesty vigor which pushed the whole medium in his heyday.  Big fan here.\r Like last week's \"Sully\" the biggest problem with this movie is we pretty much know the story and what happened, yet \"All The President's Men\" and countless other political true stories have been made sometimes to great success despite their well known outcomes.\rWhen I saw the trailer for this, I thought it a natural subject for Stone.  Unfortunately this doesn't come off as much as a suspenseful thriller as it does a human drama and at that the protagonist is too opaque to care much for him and therefore the emotion is forced and low.  This is a sweeping full spectrum epic treatment which I tend to prefer generally, however in this case I think taking more of a particular angle and only telling part of the story could have been more impactful.  It drags after a while in its sheer predictability.\rIt's too simplistic in its argument, when in fact his controversial actions are a much more complex picture.  It's easy to only call out the abuses while leaving out all the saves the government does for us.\r On a minor aesthetic note:  the date/location titles are too large, and hopefully not a new trend.  They're less elegant and require more scan of your eyes across the frame (thus missing more of the visual itself) than traditional smaller lower third titles, and will not make a difference in readability on video.\r The very best from Oliver Stone:  \"JFK\" (10), \"Born on the Fourth of July\" (10), \"Platoon\" (9), \"Nixon\" (9), \"The Doors\" (9); and don't forget he wrote without also directing the classics:  \"Midnight Express\" (10) and \"Scarface\" (9), as well as a personal favorite \"8 Million Ways to Die\" (9)  \"Talk Radio\" was prescient and enthralling at the time (9), and \"U-Turn\" was one hell of a wild deranged southwestern film noir (8)."
    },
    {
      "rating": "8",
      "text": "I always start my critiques by judging did the director keep my interest throughout the entire film.  Oliver Stone accomplished that. Granted it's a little long in length but the story stayed in focus,  The ending leaves the audience with the choice of hero or traitor.  Everyone can judge that for themselves. As for me I give it a 2 thumbs up & refute the negative ratings some are giving it.  GO SEE FOR YOURSELF"
    },
    {
      "rating": "10",
      "text": "Great film making, and politically relevant. I saw this at the Arclight, Hollywood during a preview night. I had seen the HBO documentary on Snowden already, so knew what to expect. I admit this was my most anticipated movie of the year, so my expectations were very high. It met my expectations in every regard. I'll be seeing it again, and I hope everyone does. At the Arclight on Wednesday, there was a Q/A video that happened afterword and that was very enlightening. Or should I say mind blowing. Our privacy, or lack there of, are both taken for granted. Let's keep this conversation, and others, open."
    },
    {
      "rating": "8",
      "text": "Not Oliver Stone at his peak but definitely a solid entry in his cannon. Everybody gave great performances. This story is essential viewing. My biggest complaint was a weak musical score and a somewhat miscast Nick Cage. Otherwise, I recommend without reservations."
    },
    {
      "rating": "1",
      "text": "This movie is a no for me.\r I tried to just post that one sentence but they said I need at least 150 characters. =/\r This is a Bourne movie without any of the action, swagger, suspense or fight scenes and comes off like an old news reel.  It wants you to think about the major issue of  \"privacy vs security\", but it isn't clever or smart.  We get what your trying to do Oliver Stone but let's be real;  People gave the gov't a crap load of power, post 9/11, to do a crap ton of invasive data collection, and then people got mad when the gov't used their new found authority exactly the way they said they would use it by executing programs to gather intelligence on threats at home and abroad through surveillance. *jazz hands* (on another note, people post so much crap on social media that it seems hypocritical that you don't like the gov't in your lives but then you post every little thing your doing to God knows who, but that's a rant for a different day.)\r This movie is boring and unnecessary. You should could just google ed snowden, it wills save you tons of time and you can even play your favorite music in the background.\r Pros:\rThe cast is all top notch though...so there's that.\rJGL is the man!\rI saw this for free during a screening.\r Cons:\rEverything else outside the actors."
    },
    {
      "rating": "1",
      "text": "I, like Edward Snowden himself, was very disappointed with this film. Giving it to a jaded, major block-buster Hollywood director whose lost his sensitivity and nuance to the Hollywood machine, was probably the biggest, but most unavoidable mistake. Watch \"Citizen Four\" or any of his Edward Snowden's brilliant interviews with the media if you want the straight stuff on him. This film is a waste of time."
    },
    {
      "rating": "9",
      "text": "I was actually surprised by this movie.  The trailer did not make it seem all that appealing, but as a supporter of Snowden, I went ahead and watched it anyways.  The movie was actually well produced.  Obviously, the movie is heavily political, so if that is not a genre-base that one enjoys, then they should not watch it.  All in all, I really enjoyed it, both as a movie and as a philosophy."
    },
    {
      "rating": "3",
      "text": "I can't tell if it's slightly better or worse than the very disappointing Hell or high water. Either way it's a incredibly biased and dull movie on a subject that should be treated in a more open ended way. Instead of trying to answer the question of foreign policy and domestic spying, Oliver Stone tries to give you a answer. read up about Snowden before seeing this movie if you do. because you deserve to know the whole truth and nothing but the truth."
    },
    {
      "rating": "6",
      "text": "This is a decent biopic with a good performance from JGL but you have to be interested in the story to find this more than mildly diverting."
    },
    {
      "rating": "5",
      "text": "Edward Snowden is an infamous man nowadays. After leaking that American citizens and the entire world were being watched by the NSA, he became the most wanted man in America. People were split on whether or not this man was a hero or a traitor. It is a hefty question for which there is no easy answer. On the one hand, he pulled the wool off our eyes and forced us to see what our government become: unhinged. The government never knew when to step and, even if they had an inkling it was wrong, they trudged on anyways. On the other hand, what he did revealed top secret information to our enemies. Yet, it is not this debate that takes center stage in Oliver Stone's film. Rather, it is an examination of the man behind the leak with little focus on the leaked information itself, which makes for a largely mixed bag as a result. While a compelling film when it really hits it stride, the film never dives into the leak enough, instead focusing on the love between Snowden (Joseph Gordon-Levitt) and Lindsay Mills (Shailene Woodley).Personally, I believe Snowden to be a hero. Here is a man that has a great girlfriend (Woodley teaching pole dancing is what cinema was always intended to be), is incredibly smart, and has a well paying job. He has the world in the palm of his hand. Yet, because of his rigid moral stance regarding what his job entailed, he opts to let the world know what is going on. Personally, I would have just quit the job and started doing something else, even if it was just stocking shelves in a grocery store overnight. Anything else would have satisfied. Blowing the whistle would be the last option in my mind. Because he did something I find incomprehensible that will haunt him for the rest of his life and it is something that benefited society, he is a hero. Unfortunately, many people do not see it this and he is hunted like a fugitive.As for the film itself, it is simply too unfocused to be successful. Is it a political thriller or is it a biopic? Director Oliver Stone directs both parts with an assured hand, but the two feel like complete strangers. The two halves of this film never blend and make it work with one another. Rather, they just run off and split a potentially good film into two half decent ones. This is very unfortunate to watch unfold, but it is clear that the romance half is the portion that can go by the waste side. Instead of focusing on the leak and the very compelling scene in the Hong Kong hotel room with the documentary filmmaker and writers from The Guardian, the film focuses on his love with Lindsay Mills. While I love Shailene Woodley in this film and in anything (she is another actor that really needs better material though), her portion here adds nothing. It humanizes Snowden, but it borders on being oddly offensive. Early in the film, we learn she is a liberal who questions the government. Snowden is a conservative who does not. When they watch Obama being elected in 2008, Lindsay remarks in the pride she feels that Edward has become more liberal and is subtly happy about Obama winning the election. In essence, she has made him willing to question his government and not just blindly follow. The problems here is two-fold. On one, it positions all conservatives as mindless drones. I am a moderate, so I have no dog in this race, but this strikes me as an unfair painting of an entire half of the population. Secondly, Edward does the leak so that people can question their government. In essence, it is because of the influence of Lindsay that he has become what he is. If you read him as being a traitor, this film essentially lays the blame for that on his girlfriend because, otherwise, he would have just been a guy working for the NSA who does what he is told.Yet, it is the division in time between the two halves of the story that make the film sputter out of control. Stone cannot strike a balance between the two and it is the kind of story that demands that precision focus. Instead, he lets it get out of control as we get an unnecessary romance and not enough details regarding the highly complicated NSA material. This film could have been a great vessel for discussing Snowden's status, but instead it spends too much time humanizing him and not diving into the compelling parts of his story. While we know who he is and get introduced to Lindsay, his relationship and himself are too much of the story when compared to the vitally important information he leaked for public consumption. As an overall film, Snowden entertains, but lacks focus and needed some fine tuning before being released as a final product. It is a film that would benefit from being trimmed to focus more heavily on the CIA/NSA surveillance instead of a cliche romance story."
    },
    {
      "rating": "7",
      "text": "He who became a people's hero by betraying his own nation!I had like to begin by saying I'm not an American and I haven't seen the Oscar winning documentary 'Citizenfour'. But I'm very much aware of everything about it through the all kinds of coverages. So my perspective about the film will be true and about the content will be neutral. I have known about what this film dealt since the day it all began. I did not care much, but there are things to concern about it. Like if it is necessary to tap to prevent the serious threats, there's nothing wrong it that. Because, even if they have our private contents, they are not going to publish it or make money out of it. So that makes what Ed did was unethical and betrayal for his own country.In another angle, NSA's illegal surveillance questionable in many ways, but wrong is only a tiny thing. Because eyeing every single one of us seems wrong, though without examining all, nothing confirms, differentiate between right and wrong. So coming to the film, it was decently made one. The main reason is it was too long and many parts were boring. The theme was powerful like it was a one liner, but the film contents were very weak. Except Snowden passing the security, the rest of the story like why he did, including his personal life, particularly his romance was not good enough to make a film. This is very much suitable for a documentary than a feature film.But I liked the actors. Joseph Gordon-Levitt was good, but not great. If he gets the Oscars nod, that's only because of the issue which the film inspired by, not because his phenomenal character display. The direction was decent, but not the screenplay. The film is not for everyone, but I recommend it to all as a must see. The main reason why you should watch it is to educate yourself. To learn what they are doing and how. Particularly, you will definitely come to know how to avoid being eyed by the government in a simple way. So that's a good thing than whining over what homeland security does to protect the nation. It is not an inspiring biopic, or a masterpiece, but don't miss it for any cost.P.S. Whatever the form of the governments, the nations won't stop doing what in this film they said was wrong. Because there's no Edward Snowden in every nation to expose it. In that perspective, the US was really embarrassed for their own man letting them down. The China is the number one in this kind of activity. The point is, these things happening right now or not, but should never come to public notice like that happened in here, never should leave the compound. Suppose if we come to know, we will protect, at least in the democratic countries that's what we do. But not to forget it also safeguards us. That means it is like the stars and planets on the sky that we watch and take notes, but they are untouchable. We only monitor them for threats like asteroids and fractionally thinking about the alien invasion.7/10"
    },
    {
      "rating": "7",
      "text": "Must watch film that tells us the story of a very brave man who risked many things to let people, the world, know the truth about how the powers dominate the world. People need to wake up and understand how the awful things work and don´t be so easily manipulated by propaganda and light entertainment. It´s the case of the repulsive monumental companies such as pharmaceutical industry, dairy and meat industry and many more, apart from the markets which destroy countries just as they please only to earn more money. In this case it is about the way agencies like CIA  invade people´s lives (and kill calmly) and try to have the rest of the world under \"control\". For the type of film and story this Oliver Stone outing is, one can say that it is surprisingly entertaining and non-preachy. Joseph Gordon-Levitt carries the film perfectly, and actress Shailene Woodley does a good job too. Also, the rest of the secondary cast is full of seasoned veterans who add weight to the story. One can tell everybody is very involved with the film. And the most fascinating fact is that it is about something as recent as last years presidential election, with Hillary and Trump talking about this man in the debates (no wonder why people in America didn´t want to really vote for neither of them). Like I said, for the type of film that this is, it is a MUST WATCH."
    },
    {
      "rating": "9",
      "text": "Everyone know the real protagonist and many wants to know something about him. The pace of the movie is very good, there is a lot of tension and the background is good to understand."
    },
    {
      "rating": "9",
      "text": "I was really impressed by this film. Great pacing, excellent acting on the part of Joseph Gordon-Levitt, and though I typically don't enjoy Oliver Stone's filmmaking, the directing was much stronger than I was expecting.\r I'm not really sure what some of the negative reviews were expecting from the film. Seriously, \"Jason Bourne without the action\"?? This is a biopic. This is the story of Snowden's journey from gung-ho \"I want to go kill terrorists in the middle east\" to the revelations that made his name famous (or infamous, depending on your take).\r Some have criticized that the film takes \"liberties\" with the facts; however, the cited examples of this are largely pointing out discrepancies between Snowden's accounts of the facts regarding his life story, and the US Government's statement of facts regarding those claims. It's not like Stone was just making stuff up himself for dramatic tension. Pretty much all relevant claims in the film are based on things Snowden has claimed or documentation he's previously provided. Perhaps the only claim I saw that seemed to have been substantial and fabricated was the implicit approval from Snowden's colleagues hinted at in the film. I seriously doubt that any of Snowden's co-workers had any idea what he was planning, and while many in the agencies were dissatisfied with broad surveillance, few from the IC would approve of going public as Snowden did. However, this \"fabrication\" only accounts for about 20 seconds of screen time, so it's really not a big deal.\r As for the complaint that Stone's film played it too \"safe\" - I can't disagree more. If the film was Stone's typical outlandish and over-the-top preachy filmmaking, the core substance of the film would have been lost. By taking a step back and letting the narrative build the case on its own, the result is an exponentially stronger film.\r Whether you agree with his actions or not, Snowden is a person who went from a conservative point of view, who wanted revenge after 9/11, to someone who leaked information to the press because he believed what was taking place behind the scenes was morally inexcusable. That's quite the 180, and by simply presenting the story fairly close to how Snowden himself tells it, without trying to over-embellish it, we as an audience experience the transformation in its rawest sense.\r I can't think of how I would have changed the approach to the film to improve it. For me, this hit the perfect balance, and I highly recommend the film on the merits of the filmmaking alone, no matter which side you're on regarding the political aspects."
    },
    {
      "rating": "10",
      "text": "A great dramatised documentary about this man. A man who helped expose our governments for what they really are. I was gripped throughout as this film as it tells the full story how he started with full faith that all government bodies are here to purely serve the population, only to learn the truth, and his inner (and outer) struggles over whether to expose them and how best to do so without being killed. Ed Snowden is a true hero for doing what he did and I'm glad this story is now out there forever for all to see in this excellent video."
    },
    {
      "rating": "8",
      "text": "Really good movie what shows inside of how America works nowadays and show the actual discussion of today - what is worth more - security or your freedom?"
    },
    {
      "rating": "9",
      "text": "A fantastic, superbly crafted film that deftly examines the importance and influence of Snowden's revelations. Stone delivers a screenplay which is tightly paced, beautifully shot, and with a performance from Levitt that was exceptional, this was an engrossing experience that is well worth your time. 9.01/10"
    },
    {
      "rating": "9",
      "text": "\"Law Does Not Replace Conscience\"Edward Joseph Snowden, name surrounded by disputes, polemics, and two-dimensional opinions. This talented young of Maryland was an important American computer professional, informer, former Central Intelligence Agency (CIA) employee, and former contractor for the United States government. Nevertheless, It was not until he exhibited by 'The Guardian' and 'The Washington Post' newspapers thousands of classified NSA documents around the massive monitoring 'PRISM' and 'XKeyscore' programs, which violated privacy rights of each citizen with excuses of \"dodging terrorism\" that he got sufficient recognition, all this during the mandate of President Barack Obama. This, a controversial story inspired by real events—with political and social touches—was the opportunity that the American director needed to be released from that curse of the new millennium.From Academy Award-winning Oliver Stone, who is known for projecting important issues in American democratic scene in his films, has returned in a work rather remarkable, nonetheless, it is not capable of preponderating between films as tenacious and subtle such as \"Born on the Fourth of July\", \"JKF\" or \"Nixon\" at all. Oliver Stone is one of the American directors possessing the same number of supporters and detractors on the basis of his intense movies, something similar to the case of Quentin Tarantino, you either love them or hate them. Although recently we have seen him mostly in political documentaries on account of the unexpected and fateful film blunder of new millennium, he comes back with his all strength—they are not the same as before—in a biographical thriller motion picture, which can be dangerous and erroneously compared with 2014 documentary directed by the selfsame reporter who carried out the unmasking Laura Poitras, \"Citizenfour\". Erroneously because regardless of taking the same main topic (Snowden), they develop a drama with visual and narrative tactics, elements and technologies as different as suggestive.This man adopted the name of \"traitor or hero\" due to maneuvers and mechanisms which Edward had to revert for fulfilling his objective. Even if you consider him a traitor, the portrait made by Stone of Snowden is deliberately positive, always justifying his reasons and showing one side of the coin that many people does not accept. This time, the director takes his imposing and Manichean voice in order to show those who do not know thoroughly the motivations and ways of the American fugitive, who revealed—whether good, bad or both—an unavoidable truth, his love, personal and more prominently professional life. Even though the story had potential of being a commercial film a la \"Bourne\", obviously leaving physical action behind, but what his director did was narrate it in the way that it had to be: cautious, thoughtful and occasionally predictable but attractive, significant and surprising.Working from a screenplay that he co-wrote with Kieran Fitzgerald (\"The Homesman\"), based on the interviews of documentary filmmaker Laura Poitras (Melissa Leo) and journalist Glenn Greenwald (Zachary Quinto), Joseph Gordon-Levitt (\"The Walk\") portrays a version in flesh and blood more human, sensitive, and reliable from that impartial and cold face colliding into worldwide newspapers and news in 2013. Transforming his tone of voice, adopting his obsessions and expressions, Gordon-Levitt is chief sunlight in this lugubrious galaxy of information; without his impressive transformation, Stone's journey would have been grimmer and perhaps neither permissible. In addition to the main lead, Shailene Woodley, who did not propose in her first scenes, achieves a balance in a whirl of emotions and situations in refined and consistent way, a total delight.The narrative subject of the movie is a great skill for keeping to audience watches out, in order to spectators do entire transition process of the character with the character. An anachronism that goes from the interview which gives shape to the story to passages and circumstances which are narrated in voiceover by Snowden using explanatory flashbacks and even if we  rule thirty or forty minutes out to the extensive motion picture (two hours), it would have been more propitious, the whole story has an essential point. As for the visual landscape, Stone opts it safe with his interlarded angles and low-angle shots from modern expressionism building the footage, perhaps, he would have been more ambitious, assuming risks in staging.Some might say that Stone is deifying Snowden with his work, dispensing with dilemma of being a hero or criminal. \"Snowden\" produces a formidable biography, supported with a well-told story and a dazzling performance by Joseph Gordon-Levitt, nonetheless, Stone goes to fields already inspected and does not generate the shock what should do with such real story."
    },
    {
      "rating": "8",
      "text": "This movie answers the question regarding who Snowden was and how it accumulated to the events of 2013. It shows us the capability of the mass surveillance that the US had which can be used for both good and evil: monitoring terrorist activity and defending against foreign hackers, or monitoring millions of innocent citizens and blackmailing influential figures.\r Snowden wanted the people to judge for themselves whether it is worth the price to trade privacy for safety. Unfortunately this movie is well overdue and the discussion has silenced. In addition I would've liked it more if the movie focused more on the major issue Snowden brought up rather than the man himself."
    },
    {
      "rating": "8",
      "text": "This was surprisingly good. It's without a doubt an Oliver Stone film hitting upon all of the usual Stone themes but it works so well for this film. Stone does a fantastic job of pulling common emotions and you can easily emphasis with the protagonist as the film progresses. My only major complaint is the final seen is ridiculously over the top where a crowd at the end all cheer for Snowden at the end. I think this stripped away the ambiguity of the film and I wish it had been cut."
    },
    {
      "rating": "7",
      "text": "JG-L saves the movie... AGAIN... like he always does. Without him, it'd be a 4.It was better than I thought it'd be, and had more actors that I recognized, too. It's a little too long and the romance/relationship scenes are overly dramatic and almost certainly extremely exaggerated. But overall, it was enjoyable enough."
    },
    {
      "rating": "6",
      "text": "It is very well made movie, but this is no documentary of snowden (watch citizenfour or terminal f).Joseph does a great job portraying Snowden but movie itself is boring to watch if you are not into snowden and his revelations. I mean I am interested, I watched with big interest, but it is no action, no thriller, but advertised as such (by trailers)."
    },
    {
      "rating": "0",
      "text": "I refuse to give this a rating because I know Edward personally. It is also unfortunate that this \"film\" stretches the truth and bends it for Hollywood."
    },
    {
      "rating": "6",
      "text": "Snowden is the movie about Edward Snowden, who took it upon himself to release so-called \"classified\" documents. He currently has asylum in Russia for his actions, which are controversial among not only the public, but also in politics.\rI would like to make one thing about this movie very clear: it is not only true to the facts, but it includes lots of great information. I will refrain from disclosing that information because this movie is worth a watch. However, the movie is clearly confused with how to handle these facts.\rBluntly, I will confess that I absolutely honor Edward Snowden's actions. By releasing those documents (which were deemed classified), he alerted the world about something it should know: the NSA has spied on so many people, that undoubtedly, it has crossed the line and traveled a million miles away from it. But the movie doesn't focus on the interest (Snowden's leak of the documents and the search for him) as much as it does with his background. That background runs through an hour and a half of this movie, and 70% of it doesn't belong in the movie. It comes across as filler and it doesn't develop Snowden as a character. Rather, many scenes end up being boring.\rI'm not complaining about the facts nor am I complaining about Edward Snowden's life and actions. My only blame goes to the directing and the scenes in this movie that aren't necessary and make this movie a barely watchable drag. I still thought this movie was okay, but I can't grant it anything higher than a seal of mediocrity."
    },
    {
      "rating": "10",
      "text": "Oliver Stone did an excellent job of telling Edward Snowden's complete story. This is a story that Americans should know about and this movie does it well.  Some good acting, too."
    },
    {
      "rating": "7",
      "text": "Oliver Stone’s Snowden is a story about an NSA whistleblower who’s revelations about the Government’s secret surveillance programs have shaken the public to it’s core. It is a story of a man who willingly went against his country to initiate a change projected by the freedom of speech and information. During the summer of 2013 when all the information came to light, Ed’s case was widely publicized as the vast majority of news channels and papers headlined his stories and discovery’s. In 2014 Laura Poitras’ oscar-winning ‘Citinezfour’ carefully documented Snowden’s account. Poitras, just like Greenwald, MacAskill & Gibson played an integral part in making Snowden’s story come to life.All of these characters feature in ‘Snowden’ and possibly through great acting as well as the relevance of the story, they are able to project the realism and tension that make this film demanding. Joseph Gordon-Levitt looks so much like Edward Snowden it’s uncanny at times. He does an incredible job of replicating the person we see in all the documentaries and actual footages of Edward, yet his character still feels mechanic and robotic. It’s not however Joseph’s fault as Oliver Stone’s script seems too shallow at times. Rather then portraying Ed’s emotions and feelings, Stone’s ‘Snowden’ looks a lot like a Hollywood version of ‘Citizenfour’. Throughout the movie Stone uses extensive crosscutting between various important events from Edward’s past and the final days with the reporters in the infamous Hong Kong hotel room. The events that Stone shows act as a good summary of how Snowden has come to make the decisions he has made. However this feels repetitive at times. I’m afraid that ‘Snowden’ will not get much credit mainly due to the amount of information already made available by ‘Citizenfour’. While Oliver Stone is undoubtedly a great storyteller, this story could have been told from a more human angle. There is no subjectivity in Stone’s character. I have very similar thoughts about Robert Zemeckis 2015 movie ‘The Walk’ and James Marsh’s documentary ‘Man on Wire’. Funnily enough it also involves Joseph Gordon Levitt.Anthony Dod Mantle’s cinematography is stunning and very fitting to how Stone tells the story. Employing mainly mid-range shots and taking time to establish the scenes, he gives the characters room to move around and act, while the ‘mood’ of the scenes differs drastically as we are guided through secret Government Intelligence locations, Hong-Kong hotels & Hawaii landscapes. Anthony knows exactly how to achieve impact and tension, employing similar techniques he used in ‘Slumdog Millionaire’, ‘Rush’ & ‘127 Hours’. While Oliver Stone does an honest job showing some of the main pieces of Edward Snowden’s story as well as projecting the ‘Architecture of Oppression’ that he faced, his script feels empty. In one of the scenes Snowden says that a lot of people cruise happily through life, why can’t he? Unfortunately, we never get a chance to explore this question."
    },
    {
      "rating": "6",
      "text": "Here is a good dramatization of the Edward Snowden story.  Gordon-Levitt is excellent in the title role - he really embodies the guy (who can be seen interviewed for real in Citizen Four, the documentary film about him, the making of which is portrayed here.)  The equally protean Ifans is just as good as Snowden's wiley CIA mentor.  Here Snowden is portrayed as a good-hearted, decent man who came across some US government espionage skullduggery and felt morally bound to reveal it to the world.  He is also portrayed as a devoted, loving boyfriend, an up and coming young NSA/CIA insider, and a gifted, world class programmer.  I am not sure how true all of that is.  He was a temporary contract employee for the government, and this is the first I'm hearing of how he personally designed software that transformed the intelligence game.  And the romantic relationship between Snowden and Mills will probably not go down in cinematic history.  But this is a Hollywood picture after all, and if you are interested in the Snowden story or in Oliver Stone's work, it is worth seeing."
    },
    {
      "rating": "5",
      "text": "What’s it about?From Snowden’s early days contracting for the US government, up until he becomes responsible for the largest leak in history.What did I think?Oliver Stone’s interpretation of the most significant leak in history highlights its sheer magnitude by making the man behind it have less of an agenda and more of a personal obligation. Despite that, the film struggles to dive deep into the ethical questions but you’ll still find yourself taping up your laptop’s camera afterwards."
    },
    {
      "rating": "8",
      "text": "I think its an entertaining movie that tells the story of snowden. No idea whether its accurate or not"
    },
    {
      "rating": "9",
      "text": "I always believed in corporations that update their privacy policy all the time. And I thought that I'm safe until I saw that movie. For now only Utopia p2p promises to give full anonymity and faced no privacy scandals, but I'm not sure if we can believe something.  It was a shock for me that any word and picture shared on the private web can be seen by govs and someone else. Is there any way out how to protect yourself online? I don't know.. And I believe this movie is a total true."
    }
  ]
}