{"id": 1010, "title": "Snowpiercer", "starring": ["Chris Evans", "Song Kang-ho"], "runtime": 127, "genre": ["Action", "Science Fiction", "Drama"], "description": "In a future where a failed global-warming experiment kills off most life on the planet, a class system evolves aboard the Snowpiercer, a train that travels around the globe via a perpetual-motion engine.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/nzccOvhrLGI0nvAknCEAk8bchD9.jpg", "categories": {"plot": 2.5454545454545454, "acting": 2.90625, "ending": 2.0526315789473686, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 2.888888888888889, "funny": 4.0, "action": 1.8125}, "reviews": [{"rating": "3", "text": "Without doubt, one of the worst films of 2014, as well as of recent years, Snowpiercer was a massive disappointment. Collectively, I'm a fan of several of the actors and behind-the-scenes talent involved with this film, as well as its kind of dystopian setting, so although I knew little about the film I had high hopesfor it - sadly, they were soon dashed. Where to begin?\r There were just too many things wrong with it - for a train that's perpetually rocketing around the world, half the film featured zero sense of inertia or speed (even Star Trek's hams could wobble in their seats sometimes), as utterly stationary cast and equipment appeared stage-bound - apart from a few token sequences. We had a rocketing train that conveniently slowed wayyyy down at key expositional points (the Plane Below, the Frozen Exiles), as well as utterly bizarre casting decisions that were never explained (Jamie Bell's bizarre and somewhat patronising \"Shoite!\" 'Oirish' accent - why?!), while Hurt and Evans regularly over-emoted as though they going for an Academy award. (Just wait til the seemingly endless speech about what Evans used to eat...)\r Then, once the story started rolling along into the front, better-off section of the train, it absolutely rocketed into utter silliness. Yes, we get that they're all decadent, parasitic snobs living it up at the front - but did we need slo-mo Eurodisco shots to underline this? (Send in the gimps!) Derivative and dull to sit through, ticking one clichéd box after another, this was the point where I started considering what I could be doing instead of staying on board to the ending.\r The film's one - and only - saving grace is Tilda Swinton, who stole every scene with her perfidious Mason character. Half Gollum, half Northern English trade unionist, and half vintage Deirdre Barlow (Irish/British TV audiences will get that reference), her cowardly, sniping, mocking and treacherous ways were an absolute hoot to watch, with her hateful character proving unexpectedly entertaining in each and every scene she was in, while John Hurt was also a reliably engaging presence on screen.\r Unfortunately, one brilliant character and an okay-ish set-up do not an entertaining film make, and the initially interesting dystopian set-up soon derails into a cheap - and dare one say, almost grubby-feeling - Eurofilmesque tale, populated with flashes of jarring, stylised uber-violence, an inconsistent narrative, lazy editing, generally cheap-looking CGI/effects and a crashing bore of an ending.\r As such, it's 3 points for Tildy's turn, but a big, fat Zero for anything else..."}, {"rating": "3", "text": "I am befuddled by the generous scores given by all the professional critics. This was a boring film with poor dialog, and a preposterous plot with enough holes to rival Looper, and Lake House. At no point did I find it even remotely plausible, and the 'twists' at the end were just ridiculous. Chris Evans was completely forgettable."}, {"rating": "0", "text": "Plodding, linear, predictable, stupid. One of the worst movies I have ever seen. Lacks story and character development, logic, and common sense. My friend picked it, and we were both sorry. I don't understand why anyone would make this movie. As she pointed out, the analogy between the train and planet earth makes no sense.\rIn a lot of the scenes, the train does not seem to be moving. They forgot to jiggle the set or wiggle the camera. Very distracting. Often the reveals are told, not shown. The last scene, with Ed Harris, is especially bad. He lectures us about the way thing are—everyone in his place, we have to kill a certain number of people, blah-blah-blah. Terrible. This movie offers nothing to recommend it: no insight into human nature or the human condition. Avoid at all costs."}, {"rating": "2", "text": "No idea why this film is getting so many insanely positive reviews. Way too many plot aspects that did not tie together, the unnecessary addition of woo and supernatural elements that did nothing to advanced the story and a lot of suspect acting. Good idea for a film, poorly executed. Script seemed like it wasn't even edited. Strange."}, {"rating": "3", "text": "I was very excited by this film, and impressed by the first 10-15 minutes. As the story developed though, it just got painfully stupid. I think the idea behind the film is excellent, it's just been very poorly executed."}, {"rating": "0", "text": "It is not understandable how this movie can get such good reviews. It is almost as if those people saw a completely different movie. The one I saw was bad in almost every regard. Acting was the worst, followed by insanely bad CGI. Plot holes and predictable story from beggining to end. Don't waste your money for this."}, {"rating": "2", "text": "I'm quite shocked seeing this movie receives such a good response from film critics-it's insanely bad, unbelievable illogical with plot holes appearing in almost every scene. For example main character, our hero is having some difficult time eating protein blocks made of roach (we never see growing roach department however) but later in the movie we discover that his former eating habits include cannibalism and eating little babies?! Yes the guy who once ate babies now cries like a baby because he has to eat roach and start whole revolution because of it..that's how ridiculously dumb this movie is.There is one Terminator guy that can't get killed no matter what they do to him,Tilda Swinton get stabbed in her leg just to continue walking in the next scene like nothing happened- list of errors and stupidities could go on forever.Screenwriters couldn't even decide how cold is outside:very cold at the beginning (remember how the rebel guy lost his arm?),not so cold at the end...and where on Earth little kid finds suitable fur for him? I don't give it 0 because of some fine actors work and production values but this is complete rubbish."}, {"rating": "3", "text": "OK I've given this a 3 because it tried to be original and daring. It tried too hard though and it ends up as an unfortunate attempted cross between Brazil and any dumb action movie that you can name. I was disappointed because I liked The Host a lot but the dialogue here is poor, there is no characterisiation and the movie swings again and again from gory action to poorly-judged surreality to the detriment of both. the problem is that action movies demand one kind of logic, quirky surrealist fantasies another, and this film has none."}, {"rating": "3", "text": "Ditto on being shocked at good reviews. Snowpiercer is not worth your money. The dialogue seems to have been written by grade school children, which doesn't leave much room for quality acting. The characters are Brazil / Gilliam campy but not as interesting (partly due to the awful dialogue). Also, the plot is recycled from already recycled dystopias and is very predictable. Ok, are you here for action then? Well, you can basically just throw away the fighting scenes, which also seem recycled from other, better Korean films. Do we really need another axe-fight scene? Do we really need another dystopian film of this type and quality? The plot holes are mind-blowing even if you suspend disbelief, the acting is poor, the characters are random and disposable, and the plot is as dumb as a couch. The movie seems like a live action manga remake of the worst kind."}, {"rating": "10", "text": "This is the best movie I've seen this year.The fact is that I didnt see the movie in theaters but on my PC and I loved it means a lot.This sci-fi,action movie is put together with thought.It has a soul,a purpose,a style,good characters and AWESOME action.One of the best of this year.I'd like to quote what Peter Travers said in his review for this movie \" Snowpiercer is everything Transformers: Age of Extinction wishes it could be: a slam-bam sci-fi thriller with a brain, a heart and an artful sense of purpose\".I really hope this movie is gonna slam AOE at the box office because its entertaining and doesnt give you headache and doesnt make you dumber watching it.Snowpiercer diserves to be a succes.Go see it in theaters people."}, {"rating": "8", "text": "The slow motions should not be taken for granted, only great, great filmmakers know how to shoot it.SnowpiercerJoon-Ho Bong, the co-writer and the director of this dream project sectioned under sci-fi is constraining your imagination through meticulously crafted set pieces. In a way one can say that this is completely opposite to the Blade Runner world. While both are actually widening your eyes to behold the threat a film can possess on its society and history. The procedure is completely opposite. Now, one can argue that infinity is the final excelsior or that finiteness is the only excelsior. What cannot be ignored, is the fact Bong's film is a treat. A resource. That can be dug for years to come and still will bless the street with its light.As you might know by the logline of the film that it resembles a lot with the Noah's ark, the film is actually set in the future with the subtext that the history is repeating itself. And it is that irritation, the annoyance of the inevitable partiality; that is not politically motivated, but historically manipulated that stabs you and the characters in their heart. Even at the brink of humanity or arguably a new age ready to give birth, the human nature is told to be slave of the historians and the lessons they came up with.This is the commercial line. Incredibly rich. The struggling ones, the artists on the other hand are moving on by collecting what is present in front of their eyes possibly even capturing the moment like a photograph. And hence the reason why our sung hero, Chris Evans, the one, that embarks himself on a journey to move forward at a great price, that once again, his older generation had already paid. Snowpiercer is a many thing, 300 words cannot define it, just as two hours and a train couldn't; the finiteness lost because of the mole that spoiled the essence."}, {"rating": "7", "text": "I am only half way in to this documentary about Americans aboard an Amtrak train but it seems to be a perfectly decent and informative film."}, {"rating": "8", "text": "In the not too distant future, the Earth experiences a new Ice Age. The last survivors of mankind live confined to an icebreaker train capable of perpetually racing across the globe. The inventor of this perfect machine, the mysterious Wilford, has also determined a social system on which the balance of the community inhabiting the train carriages rests. In the queue are the miserable exploited who boarded for free, while towards the head of the train first-class passengers live in privileges. But the revolt of the downtrodden from the tail of the train is now imminent and its leader, Curtis, is just waiting for the right moment to attempt the daring grab of the head of the train. Bong brought his science fiction classic to the screen, which is not only an effective work of entertainment, but also a profound philosophical reflection on the nature of man and the fate of humanity, dark and disturbing, desperate and appropriately chilling, but at the same time veined - as always in Bong - of savory irony and open, in the end, to a dazzling ray of hope."}, {"rating": "0", "text": "I really, really REALLY don't want to go for the obvious pun here, but there's no way around it: This movie is a train wreck. The parts of the plot that weren't totally predictable were only so because they were so illogical, I couldn't imagine anyone being stupid enough to write them. The \"BIG PLOT TWIST\" at the end was so obvious, I accidentally predicted it in the first half an hour.\r I honestly have no idea how this movie was conceived. Did somebody say, \"Hey, let's make a dystopian, post-extinction, hunger-games-esque action movie, but on a TRAIN!\", and did somebody else honestly think that was a good idea, not realizing that is the perfect way to make LITERALLY THE MOST LINEAR MOVIE EVER?\r There are so many holes and inconsistencies in this movie, that the pseudo-intellectualism is brutally exposed to the icy winds of this **** metaphor. Why was a cannibal appalled at finding that he had been eating insects, which are a perfectly healthy and legitimate form of food, as opposed to **** CANNIBALISM? Who are these characters who we're expected to magically know and care about despite being told nothing about them? After the main characters suddenly found themselves cut off from the rebellion as a dozen heavily armed soldiers got behind them, why do they not seem to feel any sense of urgency? Why did the main character with a **** submachine gun stand there with no cover engaging an enemy who had a powerful assault rifle at a range of half a kilometer through a blizzard, and how the hell did he actually almost land a shot? Why does this Native American think he can survive in the frozen wastelands when the last people who tried didn't make it a mile, based on the fact that the snow has melted a little bit, yet it's still cold enough to freeze a man's arm off in seven minutes? How has this train come so close to derailing this many times in a few days, and yet it's kept on track for 18 years with no maintenance of the outside train, or the tracks it's traveling on? Why is a train superior to, say, an underground bunker? What the hell was that random scene near the end where a kid randomly disappeared into the engine with no explanation or consequences?\r HOW THE **** DOES NOBODY SEE THE PROBLEM WITH AN ENDING THAT LEAVES LITERALLY EVERY SINGLE HUMAN BEING, SAVE FOR AN 18 YEAR OLD AND A 5 YEAR OLD, DEAD, AND THOSE TWO CHILDREN TOSSED INTO THE ARCTIC WILDERNESS, AND HOW THE **** IS THIS BETTER THAN THE ANTAGONIST'S ALTERNATIVE OF *NOT* COMMITTING GENOCIDE?\r These are some of the many, many, questions you'll be asking during this movie. Instead, the question that it CHOOSES to answer is, \"what do babies taste like?\""}, {"rating": "0", "text": "I viewed this film based on a favorable review in The Week last summer. Never has this great magazine been so far off. This movie was shockingly horrible. I could tell in the first few minutes that something was terribly terribly wrong with this film, and I almost shut it off (an extremely rare response for me), but I thought that it must get better. It didn't. Just the opposite. This film does earn distinction, however: it qualifies in the top five worst movies I've ever seen (think: Plan 9 from Outer Space without the laughs). It's so bad that it isn't even \"so bad it's good.\" It's just so bad that it's pathetic. Gratuitously violent. Insultingly inane. A cheap ripoff of the movie art form. And they even had the nerve to put some known actors into this monstrosity. I want to vomit this vile stuff from my consciousness. Ick!"}, {"rating": "0", "text": "This movie was just awful! I had high expectations because of all the positive reviews but once the movie ended I was left confused as to how the movie had achieved such a high score. This may be one of the worst movies I have seen."}, {"rating": "1", "text": "A total waste of my two hours! Surprised it got such a high score on Metacritic! These overpaid critics have lost their  minds. Don't waste your time seeing this movie. Its pure ****"}, {"rating": "1", "text": "Snowpiercer is thrilling for the first half hour or so, until the plot starts to make less and less sense and concludes with no sort of tie in or message. Rampant plot holes, piss poor CGI, mediocre acting and a lame story that leaves you asking yourself \"Why did I watch this movie?\""}, {"rating": "0", "text": "The critics' high praise was not supported by the movie itself.\r The strong points were the special effects and the acting of Chris Evans, Song Kang-ho, Octavia Spencer, and  Go Ah-sung.\r The premise was absurd in the extreme, and the plot had so many holes in it you could use for a colander.\r The ending was just silly.\r I kept looking for some redeeming point to the whole thing, perhaps an allegory on humanity, a statement on technology, anything that would tell me I had not wasted two hours and the cost of a rental, but there was nothing there.\r Overall I'd put it in the same league as 1969's \"The Magic Christian\", except it's more depressing."}, {"rating": "0", "text": "I honestly don't understand all the positive reviews of this movie.  (Mild spoilers ahead.) From a believability point of view, it's a failure wherever you look.  The entire premise of the train is absurd.  Apparently this rich evil villain built this train/track in the ~1 year between when this global warming cure was discovered/launched and when that cure backfired into a catastrophe?  A bunch of rebels armed with sticks defeat enemies with automatic weapons and night vision goggles IN THE DARK (with the rebels trapped on one end of a narrow car with a narrower passageway behind them) and over and over win other similar battles against similar odds?  The villain is an all-but-mustache-twirling/cat stroking condescending cliché.  This train is packed to the brim with unbelievability.  My suspension of disbelief muscles wore out in the first 15 minutes.  It also felt like the writer/director had just read Hugh Howey's Wool and reduced it to one dimension.\r So that leaves the allegory.  I suppose that worked if you don't mind being repeatedly hit over the head with 500lb allegories, including the inevitable villain explaining the allegory at the end in case you missed it the first 37 times.\r I suppose I'm giving this a zero in part because I'm angry about being so misled by all the high scores.  On it's own, this film merits a 2 or a 3.  But I feel something has to be done to counteract all the absurdly high positive reviews.  I want my money back.  Everyone that gave this film more than a 5 owes me a penny."}, {"rating": "2", "text": "Totally improbable dystopian fable.  Good scifi must contain probable or at least possible technology.  This one never explains what powers the engine or how the tracks survive decades of high speed use in artic conditions with no maintenance.  Of course a really good story would allow me to forgive \"magical\" technology.  But this one is a heavy-handed, plodding allegory of class warfare.  The predictable progress from one end of the train to the other is achingly tedious.  The ending of this scientifically ignorant production is perfect.  It shows the majestic maritime polar bear roaming an alpine landscape."}, {"rating": "4", "text": "As a fan of a dystopian setting in movies I would say that I kind of enjoyed it in a strange way but to say it was a good movie would be a great overstatement. This is pretty much as stupid as it gets. There are plot holes all over the place. Consider it Mad Max in a train. Very strange and stupid movie. It had some good moments though."}, {"rating": "0", "text": "I downloaded this movie after reading reviews of the critics (84 rating)\rand this movie was a huge disappointment .\r DON\"T WATCH THIS MOVIE.\rseriously 84 rating meta critic??"}, {"rating": "1", "text": "Snowpiercer is a very pretentious and dumb movie trying to pass itself for social commentary on class warfare but utterly fails at it.\r What the writers and director forgot when making the movie is that at its core class warfare is about resources: you got a small minority controlling most of the resources and a huge majority fighting for the scraps. It's a powerful topic because it's as old as humanity and echoes to one of our core flaws as human beings: greed.\r But this whole concept goes out the window when there isn't any resource left to fight over anyway. Indeed the movie is about a bunch of people living in a small train in a post-apocalyptic world where there's nothing else left in the world! So what exactly is the point of having a bunch of people in that train starving to death for no reason when:\r a) they have enough food for everyone. It's clearly shown when you see how well the other passengers are living.\r b) those people aren't even working for the leisure of the \"upper class\", they aren't producing anything or working, they're literally just there to starve for no reason, simply as a plot device.\r c) they all live in a freaking small train, they're all miserable anyway. There's no \"good life\" to be had at the expense of others, unlike in the real world.\r The movie doesn't provide any answer, it's all form over substance, pure shock value with no understanding of the underlying issues that create those very real problems.\r But even with that aside it's just an all-around bad movie in general, with next to no character development, bad pacing, bad dialog. The stupidity of the whole story is what pushes it into unbearable territory. A shame because Chris Evans does give a very good performance all throughout."}, {"rating": "1", "text": "My goodness, how on earth does a movie of this poor calibre rate anything but in the red? I have rarely seen a more pathetic opening sequence. The characters are the worst sort of cardboard caricatures and the dialogue is unbelievably bad. Worst of all, the social allegory that this film has been applauded for does nothing but conjure a sort of innate permanence with respect to social 'class' - precisely the sort of 'realism' that maintains the inequalities in this world. Tragic."}, {"rating": "3", "text": "You can call me crazy but the truth is that I hated every second of this movie. The idea was well though, but I don't think that the film is well enough to give, at least, four points. For me was just a waste of time."}, {"rating": "1", "text": "One of the worst films I have ever seen in my entire life.  I was bored within the first 10 minutes and had to turn it off.  It didn't get much better, only more stupid.  The most painfully obvious metaphor in film history which is repeated for about 2 hours for the most dumbed-down film going audience in world history.  If you thought this film had any \"deep\" meaning I have true concern for your brain."}, {"rating": "0", "text": "This movie made no sense what so ever.  At the start it's as cold as liquid nitrogen outside and at the end the two survivors and a polar bear are wandering around outside.  Their lungs should be frozen in an instant.  They explain nothing in the movie.  What happened to the world that would only take 17 years to recover?  The sun is shining throughout the movie so how did the temp drop so drastically?  Any loss in atmosphere would cause a temp increase.  Why a long elaborate ruse to cause a revolt when they could just shoot people without any fuss?  Where are they keeping the feed for all of the cows, chickens and pork?  It would take acres of farmland just to feed and house them.  The train is supposed to last forever but they need small children to replace simple parts that they should be able to jury rig or replace entirely.  Why have a subclass of freeloaders at all?  Put them to work as servants for the upper class.  Get them to do the jobs that nobody else wants to do.  Where did all the bugs come from for making protein bricks?  That's a lot of bricks per day.  What if the tracks get damaged by falling rocks?  Why is there no way to remove power from the security doors so they can't be opened?  Isn't the woman survivor going to go through massive withdrawals and probably die?  What was the polar bear eating in the wild all this time?  The gene pool on the train isn't large enough to repopulate the world.  Why would you sacrifice the electrical engineer that created the electrical systems on the train?  Wouldn't he be one of the most valuable people on the train?  No fire suppression system on the train?  There are so many holes in this train wreck.  (lol see what I did there?)"}, {"rating": "0", "text": "+ CGI\r- Audio\r- Shaky Cam (unwatchable action scenes)\r- Plot\rLacking a time machine to go back and restore hours lost watching this dreck compels me to warn others."}, {"rating": "1", "text": "I am a bit shocked by all the great reviews for this movie. The movie promises way more than it actually delivers. Here is the good: fantastic set design and Tilda Swinton ('nuff said). And the bad: paint-by-numbers recycled premise with plot holes so big you could drive a train through them, a plethora a stereotypical characters that I could not care any less about, and dialogue so forgettable that I don't remember a single line from the movie. Probably the worst thing about the movie is the suspension of disbelief or lack thereof. I've watched a lot of sci-fi and fantasy movies, but the absurdity of a perpetually moving biosphere train (not to mention all its inhabitants and the variety of \"ecospheres\") was difficult even for me to swallow. And the movie's attempt at social commentary was equally lame and cliched. I think the people who gave this movie a glowing review were maybe snorting some of the same drugs that also conveniently double as C4 explosives! Give this train a miss!!"}, {"rating": "2", "text": "Quick and dirty review.  The acting is noticeably odd.  Possibly due to a language / culture difference between Boon Joon-ho and the English speaking cast.  The dialogue is dull and forced.  The story is predictable with action obstacles dressed in weirdness for the sake of weirdness (see: fish-axe).  The lighting, camera, set production, and costume design are actually solid in my opinion, which is why the trailer makes you think it's watchable.  I'm actually quite confused by the positive scores.  I watched this with a group of friends of which some were irritated to the point of anger.  Overall, this is a complete waste of time."}, {"rating": "1", "text": "This movie was dead on arrival.  There is a palpable sense of flatness to the acting, which comes from actors not believing in the lines they are saying.  Can't blame them, the dialogue was inane and the whole concept is a reheated mishmash of dystopian tropes.  Even the normally interesting Tilda Swinton is just walking through this flick.  I'm guessing the only reason this movie got made was because Hunger Games has created a sub genre of \"old timey people in rags vs the pompous über class\" and filmmakers think audiences will just gobble up anything in this vein.  Walked out, got our money back.  And this is from people who enjoyed Edge of Tomorrow, Apes movies and GoT, heck we even thought Hunger Games wasn't too bad.  This movie just didn't have the stuff."}, {"rating": "0", "text": "This movie is terrible.  First of all, how did they build a gigantic train track that never stops if they can't even go outside to build it?  Assuming they built it before everything froze in anticipation, fine, that's the least of the things that makes this movie bad.\r It's not supposed to be entirely realistic, let's just put that aside as well.  So, Captain America's whole plan is to get to the front of the train to help Gilliam take it over and run things again, presumably because the people in the tail end are unfairly treated.  When he finally gets to the front, he learns that Gilliam and Wilfred work together to keep the train's population in check.  He's all mad that they chose who to kill and how to prevent population overgrowth, but he also decides it's OK to kill EVERYBODY?  No.  Sorry.  That's retarded.\r People sustained life under harsh circumstances for 18 years, and he basically decides it's ok to just doom mankind completely?  No.  Sorry.  That's retarded.  There's like three people left alive with no food, water, or shelter.  Apparently killing all of the people, including the ones you were trying to \"free,\" is a better alternative to mankind continuing to live.  The plot twist at the end and his choice to ultimately let Han blow a hole in the train is the most non-sensical load of trash ever.\r Let's talk about that.  Han (I think that's his name, shows how forgettable the characters were), has a hidden agenda to escape the train based on a plane he's been watching being slowly uncovered.  To do this he horde's kronole, their drug of choice, which is apparently super flamable.  At the end he reveals to Captain America that he's been building a bomb to blow a hole in a steel gate, which is why he decided to go with in the first place.  When he shows him the bomb, it doesn't have any of the kronole chunks on it that he'd been collecting for opening the gates; the bomb is already built, AND he already had the matches.  Is there a reason.... Any reason AT ALL that he needed to go all the way to the front of the train to try and blow up a steel door instead of just blowing a hole through any part of the train or even a window?  The answer is No..  No there isn't.\r Han's plan doesn't make sense, Captain America's choice at the end doesn't make sense, and it makes the entire movie just seem lke a bunch of filler garbage."}, {"rating": "6", "text": "I can say without a doubt the film Snowpiecer is the hardest film i have ever had to review to date. Where on one hand the film can be argued as a masterpiece, it can be put forward as a equally valid argument that the film  is a complete and utter catastrophe and i find myself somewhere down the middle in my opinion of the dystopian sci-fi flick\r Based on a french graphic novel, Bong Joon-ho, the films director presents a grim view of the earths future one in which a preventative against global warming results in entirely new ice age in which humanity's numbers have become limited and the lines of social hierarchy have become ever so clear demonstrated by the living standards of each section of the train with the compartments closest to the front of the train being dedicated to the rich while the compartments closest to the back represent the poor junctions of this almost monarchical society.\r Where this film carries strong performances by Chris Evans, Tilda Swinton and Ed Harris in this cold and cruel makeshift world with stunning imagery, it is the moral agenda of the film that is its main fall, when it decides to introduce the questions is mankind worth saving? and what is the value of a human soul? all culminating towards an ending that is bleak and most of all frustrating, justified by the fact that it was a deserved ending. The problem with this question, its repetitive nature in which i am left sick and tired of it being asked in the first place as i find myself wanting an ending in which is more so logical than it is ethical which this film fails to presents"}, {"rating": "3", "text": "I really can't understand the praises for this film. I was really looking forward watching this movie, people talking about a magnificent metaphor of our world, with so much good positive feedback. I was really disappointed. First of all, it takes so much time to introduce what this is all about, what we're talking about. Then we understand so easily what it's going to be, a path through different stages of the train. The movie doesn't surprise us even once. What a script. The characters express nothing, we can't show any empathy. There are inconsistencies everywhere you can't focus on the story. But above all, this film is a compilation of all the clichés and stereotypes of the cinema. I had the feel that i was watching like a b movie sometime. The storyline itself is predictable, some action and supposed \"tragic\" scenes are scenes we have seen over and over again in so much movies it's sometime laughable. Finally, we get some \"explanation\", some kind of moral lesson about our society. It wants us to realize through this moral metaphor that there are different social class in this world, what a surprise. Sadly, despite all the willingness i had to tell myself it can't be that dull, it has to have a deeper reflection, they just leave you with a botched ending. More than disappointed."}, {"rating": "0", "text": "This is a terrible movie. I have a feeling whoever made it never said anything to any of the caste. It's like nobody had any idea what it was supposed to be about or what was going on. It starts out all right but then just moves on to scene after scene of uncreative nonsense. It's like everyone heard a rumor they were making a movie and just started filming. I'd hate to be the guy who did the editing. He must have sat there with the footage for a week trying to figure out what the hell he was looking at. Just... don't bother."}, {"rating": "0", "text": "Why do I feel like the director of this movie watched the Hunger Games followed by Under Siege 2 (or any other train movie) and then decided to make a really bad combination of the two? It saddens me to think that people are giving this movie any kind of positive review since it is so generic and has dialog that doesn't seem to translate over to an American audience very well. Skip this movie. Your time is worth something."}, {"rating": "9", "text": "I really liked this movie. Clearly the best movie i have seen recently. Acting, story, action, set -design, everything is amazing. It is the kind of movie that makes you uncomfortable, shocks you with its boldness, depth of character, and in the end compels you to ask questions, think about things you haven't thought before, imagined; about life, humans, society. Those are the movie i like the best. Thanks Bong Joon-ho!"}, {"rating": "10", "text": "One of the best and smartest movies ever made.Great acting and visuals. Don't even try putting this movie into any category. It's just that unique and original."}, {"rating": "0", "text": "It starts off okay but I couldn't take some of the characters seriously, then it just went to **** They established the setting really well but the pathetic attempt at dramatic fights which were soooo drawn out just made me lose interest. The rest of the movie doesn't deliver after what looks like an almost promising beginning. Even ignoring the plot holes, I feel everyone should of just died."}, {"rating": "6", "text": "The plot holes in the movie kept me from liking it. There are literally more than 20 plot holes, certain ones are minor, and A LOT of the plot holes are major."}, {"rating": "2", "text": "Oh my here we go again-an awful mindless movie almost completely without qualities except for having nice visuals and few serious actors involved gets insanely positive reviews from the world most eminent film critics.Those guys are obviously paid by studios and producers to write good things about bad movies-no other logical explanation-while some great pieces of cinema art passes almost totally unnoticed because there's no one to care about.So my question is:do we really need movie critics like this anymore?"}, {"rating": "1", "text": "This movie is so bad, I left the cinema after about 60% because I've had enough. Every movie with Chris Evans doesn't mean its a Captain America movie."}, {"rating": "8", "text": "A stunning, visionary example of dystopian science-fiction cinema at its best, South Korean director Bong Joon-ho's \"Snowpiercer\" is based on the French graphic novel - a blockbuster rich in style that successfully breaks through cultural and political boundaries.“Snowpiercer” is brought to the big screen and offers a solid narrative, carefully drawn characters and — above all — respect for the audience’s intelligence in high-concept genre cinema. While “Snowpiercer” and its world may be implausible, it's most certainly engaging, and further helping matters is Bong’s impressive, sprawling international cast anchored by Chris Evan's strong central performance.\r \"Snowpiercer\" is set in a distant future where a man-made ecological disaster has triggered a new ice age that has engulfed the planet and killed off all but a few hundred lucky survivors. Upending the social structure of society and transposing it horizontally, the upper-class has become first-class on the Rattling Ark - a gigantic speed train that contains a literal microcosm of a contemporary neoliberal society. The fortunate in the front of the train rule over the rest, where the rich dictate the rules in order to oppress the poor and underprivileged.\r Bong’s vivid depictions -- aided by Ondrej Nekvasil’s production design and Hong Kyung-pyo’s cinematography are beautifully orchestrated and captivating for the most part. That being said, one of the more significant issues with the film is the overuse of CGI in places, which does look sub-par at times, like stylized segments from a 1990's video game.\r Joon-ho creates an air of mystery and intrigue - as the passengers progress from the dark, rear tail of the train to the opulent splendour of the front carriages, \"Piecer\" evolves steadily, slowing providing information and further enriching its story with enough magic and wonder to suspend our disbelief entirely. The film's pacing is measured, but never slacks with adequate time taken out for nuanced, character-building scenes. You may recognize lots of inherent holes and flaws in its journey to salvation, but the movie confidently pushes its premise throughout its 126 minute run time.\r By the end, the film reveals itself as a surprisingly thoughtful contemplation projecting the problems of today into a science-fiction tomorrow, while it ties together a compelling story that continuously shifts. We all think we know what will happen here; the downtrodden are pushed to the limit, and as a result, they unite and rebel against their oppressors - exactly as we've seen countless times in a number of other sci-fi movies and it's all a bit predictable. \"Snowpiecer\" is the exception."}, {"rating": "0", "text": "This has to be one of the worst movies I have ever seen. Lets start with the plot, or lack of it. Dumbest idea ever. How could you build a train track in harsh environment like that if they couldn't even go out in it? Not only that but the train never stopped and went around the world? Land masses don't connect! There is a plot hole. Who could sit 18 years in one little cramped space such as they were in? Not only that everyone dies except 2 people at the end. HORRIBLE HORRIBLE movie.\r Stupid critics the only reason why they liked it as I suppose this is supposed to be imitating life?? I guess if your a gay critic who jumps on board with everyone else or you live in a world where there is no hope, this movie is for you!"}, {"rating": "0", "text": "Biggest let down since RZA's Man With the Iron Fists. CGI is a laugh for a 2014 film and the story line doesn't challenge the audience at all. A story with as much depth as a greeting card is painfully drawn out for 2 hours. This wannabe Willy Wonka tale is a sad excuse of a film with a lack of imagination.\r The random Asian people, and random fish gutting was a testament that this film was begging to add depth to the film but only showed the lack of confidence the director had during the making of this film in hopes of hypnotizing a braindead audience. I cannot think of a worse film to compare this to and I've seen 300: Rise of an empire..."}, {"rating": "2", "text": "i'm giving this a 2 because of tilda swinton. she is a wonderfully fiendish bad guy. the bad teeth and great costuming are the icing on the cake. ed harris, too, is fantastic. oh, and i liked the idea of a giant train, hurtling through the frozen world. the rest of the movie is high budget crap. it careens from gorefest to quasi-surrealistic and back again. should've picked one theme and stuck with it. when i see dystopian films with the same old tropes--everyone in matching rags, starving, but not thin enough, all wearing fingerless gloves--i curse \"mad max\". that great film spawned so many wannabes."}, {"rating": "7", "text": "An intriguing premise, committed performance from Evans, and surprisingly good special effects, Snowpiercer is one of the better recent post-apocalyptic films."}, {"rating": "8", "text": "Snowpiercer shouldn't work as a film, but somehow it does. The whole premise is so unlikely that most viewers would have to suspend disbelief just to watch it in the first place.\r The themes of survival, class warfare, and sustainability are all covered in the microcosm of a dystopian \"rattling ark.\" The storyline gives the viewers just enough information to draw conclusions about the world that they're witnessing and the cryptic symbolism gives audiences something to mull over (for example, what was the meaning of the fish blood ritual prior to the meelee sequence between the rebels and the train security forces? I'm assuming it correlates to Mason's later explanation of the aquarium later on and the idea of \"culling\" the population to keep things in balance).\r While the cast  performances overall were outstanding, I found Tilda Swinton to be particularly brilliant here as the comically draconian Mason; as was  Kang-ho Song as Nam, who is arguably the true protagonist of the film.\r Interestingly, I rented this on iTunes and watched it at home without realizing that it is a current release in theaters. I guess I like the trend of current releases being available on home video, but I also enjoy seeing movies on the big screen in a theater setting, so I hope the instant gratification of digital downloads doesn't make the theatre experience go completely \"extinct.\""}, {"rating": "3", "text": "-Really predictable\r-Scientifically silly - why would anyone have a train constantly in motion in a post-apocalyptic society let alone somehow maintain the ecosystem as described...on a train...\r-mediocre special effects\r-very unimaginative plot\r-the train concept is really absurd\r-this was more of a phantasy movie than sci-fi, really...\r +good acting especially by Chris Evans\r+good action scenes\r overall, i don't get what people see in this - it's certainly an allegory of modern/western/wealthy/wasteful life in a sense which is admirable but it doesn't need to be framed in such an inaccessible awkward way that this \"sci-fi\" attempts to do it"}], "recommendations": ["prometheus", "the_midnight_sky", "greenland", "stowaway", "district_9", "children_of_men", "geostorm", "sunshine", "jurassic_world_fallen_kingdom", "lucy", "the_tomorrow_war", "noah", "annihilation", "source_code", "the_titan", "the_first_purge", "the_kingdom", "jurassic_world_dominion", "how_it_ends", "elysium", "the_purge_anarchy", "eo", "the_purge_election_year", "28_weeks_later", "chaos_walking"]}