{
  "id": 803,
  "title": "Snow White and the Huntsman",
  "starring": [
    "Kristen Stewart",
    "Chris Hemsworth"
  ],
  "runtime": 127,
  "genre": [
    "Adventure",
    "Fantasy",
    "Drama"
  ],
  "description": "After the Evil Queen marries the King, she performs a violent coup in which the King is murdered and his daughter, Snow White, is taken captive. Almost a decade later, a grown Snow White is still in the clutches of the Queen. In order to obtain immortality, The Evil Queen needs the heart of Snow White. After Snow escapes the castle, the Queen sends the Huntsman to find her in the Dark Forest.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8yKdQHaqOo1lkaErmqMuYFespYI.jpg",
  "categories": {
    "plot": 6.024390243902439,
    "acting": 6.276595744680851,
    "ending": 6.666666666666667,
    "soundtrack": 7.5,
    "cinematography": 8.666666666666666,
    "familyFriendly": 6.0,
    "funny": 7.8,
    "action": 7.8
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Fantastic movie!!! I was not expecting it to be so good but I have to admit I was wrong!! Kristen Stewart and Charlize Theron were beautiful and very strong acting from both!"
    },
    {
      "rating": "10",
      "text": "Beautifully shot and very convincingly acted! Really enjoyed this take on the tale......so much better than previous attempts at adapting fairytales! I highly commend and recommend!"
    },
    {
      "rating": "10",
      "text": "I loved Kristen, Charlize, Chris and Sam as well as the supporting characters! Very well done. The visuals are also stunning and the sets are wonderful."
    },
    {
      "rating": "6",
      "text": "At first, I never heard anything about this film. I looked back to it... eh... a non-Disney Snow White movie would never work that well. At least don't try making a sequel... otherwise, the score would just get worse."
    },
    {
      "rating": "10",
      "text": "Surprisingly I loved this movie and I was not expecting to! I loved the action and visuals and I was very impressed with the cast! Kristen Stewart and Chris Hemsworth especially impressed me. They are far more than Bella and Thor!"
    },
    {
      "rating": "10",
      "text": "I thought all the actors did a great job! Kristen, Charlize, Sam and Chris were all on top form! It was nice to see Kristen not be Bella and it was nice to see Chris not be Thor! They can do so much more!"
    },
    {
      "rating": "7",
      "text": "Great gothic scenes in the mysterious, dark forest mix up with some dull moments in a cartoonish, Narnia-style Sanctuary and literally epitomize the movie's positive and negative aspects. A great idea of bringing to the cinema an adult representation of the classic fairy tale is marred by indecisions about whether this film should appeal more to the adults or to the younger audience. It has some very good elements, above all a stunning Charlize Theron as bad queen Ravenna, some music and atmospheric special effects (the forest, the mirror). At the same time, the acting of other characters (except for the dwarves) is unconvincing, marred by the same undecision, while many scenes are literally copied from other movies: the final charge on the beach (Ridley Scott's Robin Hood), the Sanctuary (Narnia), gothic villages (Solomon Kane), the representation of the dwarves (Lord of the Rings) or even the troll (Pan's Labyrinth). Finally, the plot lacks some deeper insights, offering only some generic explanation of the motivations of the protagonists (why is the huntsman drinking so much? why is Snow White not surprised at all by the charm she has suffered? why everyone wants to go to a war after her speech, if no one wanted to do that for the past 20 years? why is Ravenna's motivation to kill and destroy so badly explained and neglected?), as well as mixing very nice action scenes with lengthy, dull and unconvincing moments that force you to put matches into your eyes to keep them open.."
    },
    {
      "rating": "10",
      "text": "Great movie! So much better than any other Grimm adaptation attempt! This one actually works!!! Rupert Sanders did a wonderful job with this old tale. The story has been reinvented but still holds true to the fundamental lesson of skin deep beauty."
    },
    {
      "rating": "10",
      "text": "Snow White was recommended to me by a friend as I was not going to see it. I am so glad she talked some sense in to me as I was completely entertained and enjoyed it very much!"
    },
    {
      "rating": "5",
      "text": "Dazzling, class-A visuals are undone by a directionless and dialogue-heavy script, as well as poor performances from Kristen Stewart and Charlize Theron."
    },
    {
      "rating": "5",
      "text": "This was an uneven film.  It generated wonder and boredom.  The story telling was clunky.  The CGI and  imagination of many of the scenes were incredible.  A movie has lost me as a viewer when I no longer can suspend my disbelief and begin to question the logic and rationale of the storytelling; that's what happened here.  There were some great parts and I loved the re-imagining of the old story.  Brilliant what they did with the 7 dwarfs.  The scenery was great.   By the last 10 minutes I was so disinterested in the story itself that I walked out, which about 5 people had done before me throughout the movie."
    },
    {
      "rating": "10",
      "text": "I was dragged to this movie by my girlfriend and I thought I would hate it!! But I was wrong. It is actually a very nice piece of work and a very enjoyable movie. I would recommend it."
    },
    {
      "rating": "9",
      "text": "A wonderful movie with so many positives to point out. The actors did a great job and have great chemistry together. The director created a wonderful and unique World. The visuals are sharp and innovative. The story is nicely fleshed out."
    },
    {
      "rating": "10",
      "text": "i loved the twist they've made, i loved the characters and ...and.... to be honest i loved everything in the movie , i watched it twice and i would do it again if i have the time :D"
    },
    {
      "rating": "10",
      "text": "I agree with a lot of the comments here! The movie was so much better than one would think and Kristen Stewart is a far better actress than one gives her credit for!"
    },
    {
      "rating": "10",
      "text": "Chris Hemsworth, Kristen Stewart and Charlize Theron were all fantastic in this movie! They played their roles perfectly. I love that they had slight twists and tweeks to the story without completely changing it."
    },
    {
      "rating": "10",
      "text": "Overall a very good adaptation. I was surprised at how much they did with a limited story. They could perhaps have pushed it a little further but I was happy with the result."
    },
    {
      "rating": "4",
      "text": "Maybe Snow White and the Huntsman looks promising for dark fairy tale entry, but it's undone by uneven acting, problematic pacing, and a confused script."
    },
    {
      "rating": "5",
      "text": "Just a failed attempt to capture the classic fairy tale . With a unworthy script and Kristen's bad acting this adaption of snow white just doesn't work .  The Direction was even and the special effects were amazing . But still there were so many Negativity . Therons look and style was the Perfect Witch but coz of bad dialogues her character just kept falling and falling . Chris was the perfect choice as the Huntsman he did good but as soon as the story came out all \"Twilight\" it was the end of him . Right before the end of the film Kristen's Tough Lady Scenes were the funniest moment in the film . Seriously she cant act at all . The Movie could be a different types of Dark Fairy Tale but coz of that horrible script and Kristen as Snow the movie just doesn't work ."
    },
    {
      "rating": "4",
      "text": "Kristen Stewart is unconvincing in her role as Snow White, in terms of both acting and appearance (fairer than the Charlize Theron? Yeah right.) This film is nowhere near as epic as it pretends to be"
    },
    {
      "rating": "9",
      "text": "ust saw Snow White & The Huntsman. That might just be the sleeper hit of the summer. I wasn't to hyped for the movie until I started seeing some of the Tv spots. I wasn't really sure what to expect going in but man was it a great action/medieval/fantasy movie. I LOVED it. Chris Hemsworth was great, the dwarves where fantastic and Charlize Theron was brilliant. And the effects? The effects where stunning (And fyi, the dwarves? Real dwarves with life sized actors faces out on there bodies. You can't even tell!). Only thing that bugged me was Kristen Stewart. I mean her whole mopey attitude works for most of the movie, but at the happy ending she still doesn't even smile! Well she smiled a little, but it barely counts as a smile! She had a bigger smile earlier in the movie! I mean come on Stewart, show some other emotions. Other than that, the movie was great and is one of my favorite medieval fantasy movies."
    },
    {
      "rating": "8",
      "text": "Charlize Theron makes this film work.Nice scenes too.Kristen is not ready for these types of films though.Not really related to the original snow white,but no problem for me."
    },
    {
      "rating": "4",
      "text": "The film was normal, nothing impressive that just blows your mind away. The only character I liked in this film was the queen. She could really show the evil and cruelty that was inside. The '' Snow White '', character was boring, awkward and there was no magic around. Overall the film was boring, lacked good action, shown no humor and chemistry between the characters. When I watched the trailer I was hoping to see a good film that would bring back my memories from childhood."
    },
    {
      "rating": "9",
      "text": "I loved the movie! Kristen Stewart and Charlize Theron were amazing! BTW, all the cast is! A very beautiful and well craft movie! It has its flaws on the script (a better constructed antagonists than the protagonists characters. If you didn't see any Kristen's interviews you can not almost understand Snow White character, her magic and why something happen after her scape.) and in the editing (some well craft scenes lost some impact and intensity because it), but over all it gave me a heel of good time! Exceeded my expectations!"
    },
    {
      "rating": "10",
      "text": "This movie is very good and worth every penny. It was very well adapted and liked the fact that some things change. It has good effects, a story very accessible and very interesting, we holds the principle to an end. The cast is perfect, the longevity of the film very good, and the question is: Is it deserved note 57 of the film have? Obviously not. So it seems like a bad joke. It is an excellent movie in all aspects and highly recommended."
    },
    {
      "rating": "10",
      "text": "Pretty awesome movie! Deserves a lot more credit than it is getting!! Rupert Sanders did a fantastic job of making a pretty simple story feel big! The actors were really very good too."
    },
    {
      "rating": "9",
      "text": "Very impressive debut from Rupert Sanders. Beautiful scenery and beautiful cast. The best Grimm adaptation I have seen. Think it deserved a bit more love from certain critics actually."
    },
    {
      "rating": "10",
      "text": "I loved it! Though Charlize and Kristen were fantastic! Chalrize was wonderfully wicked and Kristen was innocently inspiring! Fantastic movie! Well done all!"
    },
    {
      "rating": "10",
      "text": "Very good movie with solid performance from the main cast. They did a lot more with the limited story than I thought they could actually. I've got to give credit where it is due and it certainly is here."
    },
    {
      "rating": "10",
      "text": "Wonderful movie! So much better than I was expecting!!!!! The camera work, the scenery, the music, the story, the characters and the acting all came together to make a fantastic action movie that is family friendly!"
    },
    {
      "rating": "10",
      "text": "Charlize Theron and Kristen Stewart were amazing in this movie!! They were the perfect two sides of the one coin! Very enjoyable movie overall! Go see it!!!!"
    },
    {
      "rating": "10",
      "text": "Wayyyyy better than I was expecting!!!!!!!!! I did not think Kristen Stewart especially could pull this off but I will admit I was completely wrong!! She played this part admirably and really made me believe in her as an actress!"
    },
    {
      "rating": "10",
      "text": "I am very surprised at how well Kristen Stewart and Chris Hemsworth did in this movie! Fair play to them...they have earned a new fan! They were badass in this movie!"
    },
    {
      "rating": "0",
      "text": "This movie was an absolute waste of time... I guess I was not the target audience for this movie but the trailer made me think other wise. It had its moments but I had a hard time sitting through the whole movie. Snow white was the worse character of the movie. The Huntsman was okay... I guess that's the reason why they are not going to do a sequel to this movie but are going to do one of the Huntsman solo."
    },
    {
      "rating": "8",
      "text": "This wasn't a perfect film, but most every movie isn't. Snow white and the Huntsman was definitely worth the admission. It had a few cheesy lines and cliche moments, just a couple flaws in the writing, but overally this was a very entertaining film. In my opinion Kristin Stewart wasn't the star of this film although shes the title character. Charlize Theron made this movie what it was. At times this film was bone-chilling due to Theron's perfect job at portraying the evil Queen. She did an amazing job and she made the film. Kristin Stewart was ok. I'm not a Stewart fan by any means, she just seems like a wooden actress, shes good when her job involves doing nothing, but when it comes to big acting moments she just doesn't shine like she should. Chris Hemsworth was funny, tough, and bada$$. The biggest thing i loved about this film was the perfect balance between action, story, and chracter development. It was veryyy well done, and the story was great overall. Speaking of the action, it was pulse-pounding and very entertaining, obviously centered around Hemsworth. The special effects were beautiful. Gorgeous visuals throughout the film. Overall Snow White and the Huntsmen was fun, action packed, beautiful, and it delivers exactly what you are looking for when you go to the theater, entertainment. 7.5/10 Worth the admission."
    },
    {
      "rating": "8",
      "text": "\"An Amazing Movie Experience! It has the full-scale charm of many other epic fantasies like the Lord of the Rings or The Chronicles of Narnia even if it mimics them too deeply...\"  I've always wanted to see a different version of Snow White. I've seen Disney' version countless times already and for the most part, I'd admired the artwork and the sing-a-long songs that made that experience so 'lively.' However, I knew the Grimm' had a different perspective, one of darker and meaningful aspects...more lets just say 'grim.' When I watched in my childhood, I never looked into it really. All I really cared about was of that red-looking apple whom was eaten by Snow White and it made me really hungry for an apple. However, as I look back on it now; the Snow White legend really came off as a creepy and cautionary tale just like that of the Little Red Riding Hood. We each have our own interpretation which is undeniable but we all can agree that the story of Snow White isn't always the most jolly out of all the other Grimm stories that our 'mother' (oddly enough) used to read to us. In fact, the Little Red Riding Hood was meant to scare little children. I mean come on! A little girl with a red coat walking straight through the dark forest is kind of creepy in itself just like that of a little white girl swinging on the swings at the hours of midnight. Its even more scary when she meets a talking wolf who then eats her grandmother and dresses up to be like her....that to me is very strange. Anyways, the storyline for this movie is still the same. However, it felt like the characters were just trying to find a way which is entirely understandable and it made the experience feel human, so it wasn't so predictable in that sense.   The performances were memorable and I really loved that each actor went deep into their roles even though sometimes that's not always the case for the many other films they played in. Charlize Theron' Ravenna is now one of my favorite villains. In the film, she has a good back story; its touching, sad and tragic so it does explain why she's the way she is.  I felt a little sympathetic because not only is she the many Kings tool (not to mentioned curse), she's just like any other human. She fears death and growing older. She also feels (like I mentioned) used and replaced. However, I can't sympathize with her too long because sooner or later her cold eyes pop out and her character turns like the prophetic Evil Queen. This movie was meant to be played by Kristen Stewart. Although many complain that she isn't the fairest of them all, let alone Charlize Theron. Just to put it out there; I think Kristen Stewart is one of Hollywood's most unique actresses because she is shy and she does want to keep her personal life to herself. I have to say too is that she is gorgeous-attractive even hot when she wants to be and many others will agree (her fans mostly). Snow White has been imprisoned in her room for 10 years so her voice is raspy and she is 'shy.' However, (when you're watching this film) her character has this sort of drive-determination and power especially when she's in the Dark Forest; always pushing and moving forward...I mean I would though if my life depended on it but that's not the case here, she even says the Lords Prayer: 'forgive the sins of others.' She even goes to battle with shining armor and faces (in the end) the Queen. I mean doesn't Snow White sound at all familiar to Kristen Stewart' publicity and their hate campaign. Kristen Stewart conveys a lot of emotions in this one and in many of the scenes, lets out a couple of tears. Chris Hemsworth is completely watchable as the drunken huntsman. When he's battling it with Finn, couple times I wanted to shout out 'COME ON WHERE'S YOUR HAMMER!?!!'\rOverall, he's noticeable and has a good screen presence. The Dwarves are what made the movie experience more lighter and happy (?). They took off the heavy load of the first hour and brought us to the Sanctuary. One of my favorite scenes.   The visuals are impressive as can be. I mean clearly you can see it through the trailers and clips. The cinematography balances out, changing from dark to light. The camerawork is also impressive and less shakier than that of The Hunger Games (loved that film btw). I'd also liked the many battle scenes and the grand scale of it all. It was truly a unique experience. The visuals and the script made most of the scenes memorable.   The disappointing factor is sort of the end. They build so much tension in the first hour and a half that the second half is a let down. I loved every scene until the last 5 minutes. The most dramatic and emotional scene came from the two main actresses and the showdown. The music was what made it so compelling and I have to give props to Mr. James Newton Howard because he really does capture that epic fairy-tale action. So a sold 5 on his part."
    },
    {
      "rating": "8",
      "text": "I didn't think the movie was the greatest, but I wanted to give it a 7.5 and a 7 would have been just plain mean.  The stuff that will bother the audience the most is the wierd Luke Leia stuff that happens a couple times.  The acting isn't entirely Kristen's fault.  You can tell there are parts where the director is too stubborn to allow the actors to change the lines when they don't fit.  Kristen had some horrible parts, but seeing that Charlize, being one of the best female actress there are these days, still had difficulty pulling off some lines you can tell that the dialogue wasn't really all the actors/actresses faults.  It feels like they put a ton of quality into every scene, then last five minutes they decided they didn't care anymore and wrapped things up rather poorly even hanging on what happens next.  Raises questions, what happens to Thor and Bella, do they get together, do they not?  One thing that I believe most would agree, Kristen Stewart and Chris Hemsworth need to do a romantic comedy together.  Unfortunately for Kristen, she always seems to get stuck with skinny nerds, or really insecure boys(men I guess? just no balls).  Hemsworth's confidence is hysterical and more of a good match for an attractive girl like Kristen who would want a man with skill and confidence that's fun.  I still think this is worth watching in the theaters if you want to get out of the house because it's a little better than a rental."
    },
    {
      "rating": "9",
      "text": "The only problem I had with this movie was that it was slightly too long! I was blown away by Ms Stewart and Ms Theron and Chris Hemsworth was surprisingly impressive too."
    },
    {
      "rating": "10",
      "text": "I went to see this movie after all the positive word of mouth and I have to say I really enjoyed it !! Very glad I gave it a chance and would recommend others do too!"
    },
    {
      "rating": "1",
      "text": "I had zero expectation going into Snow White and the Huntsman and yet it failed to even meet basic expectations like making any sense or being just entertaining. The script is just incredibly clumsy with characters teleporting from one place to another instantaneously for the convenience of the plot, the dialog is very basic, the characters are also very bland, and the pacing is particularly atrocious (what's up with movies nowadays lasting 2 hours and there's nothing going on for half an hour often time?). And what about the acting, oh my... Theron starts off great, her character seems vicious and menacing, but she quickly falls apart as she starts yelling in every scene she's in; yelling isn't scary it shows the character is powerless, the most scary villains are the ones that don't need to say a word to inspire fear (like Vader in ep IV during the duel with Luke). Stewart is equally terrible but unlike Theron it's because she's so amazingly stiff, she has absolutely no range in this movie, when her character is happy, or scared, or sad, she always has the same freaking face; it's so ridiculous that they had to put fake tears in her eyes in some scenes to show that yes she is indeed sad or you wouldn't know based on her face, just ridiculous. Hemsworth isn't any better either, his character is very shallow, the best I can think of to describe him would be a failed Han Solo, a kind of scoundrel that gets better as the movie progresses, only done much more clumsily. All I can say is congratulation to the people who worked on the costumes and the CGI, because that's the only good thing you can say about this movie, yes it looks absolutely gorgeous, but it's not enough to carry a bad movie anymore and I'm not sure it ever was to begin with."
    },
    {
      "rating": "2",
      "text": "This is a horrible movie that is visually stunning but that's it. If the director put more into the acting and the writing was better it would have a better chance but still fall short. Kristen Stewart has no business being in this movie because she's so far from being as pretty as snow white and she's just plain overrated for anything but Twilight. This is one of those movies that will leave you thinking when you leave but trying to make sense of what you just sat through. Skip it unless you like dull and boring movies with terrible writing and a poorly cast Snow White. If you loved the Once Upon a Time series on tv just stick with that because you will be disappointed."
    },
    {
      "rating": "9",
      "text": "I will start with the main course: Charlize Theron, Oscar nomination please! his performance was incredible, masterful, his eyes struck, passed all the witch felt, that was the best! as clear that his good soundtrack, spectacular special effects, the picture was very good, so the movie was in all its flavor. Kirstin Stewart Nothing more! the role he was too big, not I bring nothing, Charlize ate!"
    },
    {
      "rating": "9",
      "text": "I loved this movie Charlize Theron was fantastic  Ian McShane , Bob Hoskins , Ray Winstone and Nick Frost were brilliant and the visual effects were amazing the story line was good all in all a really enjoyable film well worth a watch."
    },
    {
      "rating": "9",
      "text": "Look this movie was amazing effects wise but the plot was lacking a coupple things. Also Kirsten has still got that crossed eyed thing happening hahah god love her though."
    },
    {
      "rating": "0",
      "text": "More of 2 hs missed in this boring crap, also the main character is a skinny ugly one, thumbs down, don't waste your precious time...if you want to see a fantasie movie go to Red Riding Hood"
    },
    {
      "rating": "5",
      "text": "Man was this movie average.  Kristen Stewart is not right for this part, Hemsworth didn't pull it off.  I like Hemsworth too so I am going to chalk that up to bad writing.   I liked the world and how it was shot but you need some acting and a consistent story.  Maybe a little comedy, just a little.  The queen was the best part of the movie."
    },
    {
      "rating": "10",
      "text": "The problem of Snow White for me it was Snow White. I mean, if you get an average actress and put it her with over-the-top actors, all her flaws will come to be evident. That's what happen with Kirsten."
    },
    {
      "rating": "10",
      "text": "The Queen is SO beautiful and she's such a great actor! The story of Snow White has NEVER been so interesting! I only have 1 problem, I wish there was more of the Queen, but the movie is great! The special effects are breath-taking, and visually-stunning. This movie combines suspense, with action, and drama. The costumes are great, so is the makeup, plot, and the enviornments are very detailed. The also introduce other fairytale elements like pixies and trolls! This movie is not just a movie, it's an experience!"
    },
    {
      "rating": "4",
      "text": "This was an alright action-ish movie. The visuals were good in a lot of places and the Queen was a great character, but the movie seemed a bit lost with what is was trying to do. Characters and their motivations were never really developed well and I ended up not really caring what happens. There some moments that just made me wonder if there were really important. For example, when Snow White meets that huge antlered deer, it was apparently a big deal. The problem is that we are told it's a big deal with out actually seeing why. Snow White apparently has some sort of healing powers or is \"life itself\" which is great because that's the complete opposite of what the Queen represents, but Snow White never demonstrates her ability. It would be better thematically to have had Snow White lead an army of nature oriented creatures and men to fight against the Queen with her dark and sharp monsters. It would have made more sense and made Snow White look more important.The acting was alright in most places, especially the Queen, but there were a few pretty corny speeches. Overall the movie had a pretty good concept and executed it's visuals well, but failed to develop the story properly for me to be invested in the characters and the outcome."
    },
    {
      "rating": "4",
      "text": "I really wanted this movie to be good since I am a fan of fantasy movies (when done right) and I love the old Disney movies.  But this one, like Alice in Wonderland, had great visuals but lacked a good story and good characters.  Charlize Theron was very good as the Evil Queen, so much so that I was kind of rooting for her to defeat Snow White.  But the rest of the cast just couldn't pull it off.  Granted they didn't have much to work with seeing as the story was so rushed and fragmented.  I might have liked Kristen Stewart's performance if she could just learn to close her mouth once in a while, instead of looking like she's perpetually on the verge of puking.  And then the climax of the movie just comes out of no where and features a hilariously over the top pep talk that K Stew gives to the soldiers.  Not to mention the fact that the last scene following the battle leaves so much unanswered.  Overall, it was pretty bad.  But if you want to see some impressive visuals, or if you're in love with Charlize Theron, you might just like this."
    }
  ],
  "recommendations": [
    "maleficent",
    "the_illusionist",
    "oz_the_great_and_powerful",
    "meet_joe_black",
    "stardust",
    "thor",
    "alice_through_the_looking_glass",
    "maleficent_mistress_of_evil",
    "pan",
    "black_snake_moan",
    "sin_city_a_dame_to_kill_for",
    "cruella",
    "hanna",
    "the_tourist",
    "red_riding_hood",
    "aquaman",
    "fantastic_four",
    "the_lucky_one",
    "the_suicide_squad",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "destination_wedding",
    "the_king_of_staten_island",
    "doctor_strange",
    "wonder_woman",
    "black_panther_wakanda_forever"
  ]
}