{"id": 2893, "title": "Solace", "starring": ["Anthony Hopkins", "Jeffrey Dean Morgan"], "runtime": 101, "genre": ["Thriller", "Crime", "Mystery"], "description": "A psychic doctor, John Clancy, works with an FBI special agent in search of a serial killer.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/pbcXpZgem8kgr90RwIUNAbC2ite.jpg", "categories": {"plot": 4.75, "acting": 6.0, "ending": 5.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "Interesting idea and premise, really good cast of actors and Anthony Hopkins is really good in his role. Was interesting to watch throughout the first part of the movie, but it kind of gets more and more boring towards the end, plus quite predictable. They should've ended it somehow differently for it to be better. I mean you don't get that thriller effect where you wonder what will happen next all the time, here it is just easy solutions"}, {"rating": "6", "text": "Solace wants to be so much deeper than it actually is. The problem is that the premise is just too absurd. Rather than diving into this absurdity and having some fun with things, director Afonso Poyart tries to go for self-serious and poignant. A pretty odd thing to do with in a movie about an old dude with psychic powers hunting down a serial killer. Plus the execution isn't quite there. Often when it tries to go for meaningful and intense, it just ends up embarrassing itself. Luckily though, not all of the fun from the core idea ends up process.Like most movies that want to be something more, but ultimately just don't have the writing to back it up, Solace tries to trick audiences into thinking there's more going on underneath the surface with a flashy sense of style. Scenes carry that same artsy, overblown, and almost sterile feel and look to them that so many of this ilk use. The movie even looks pretentious. While this does lead to some cool looking moments, more often than not it's just unintentionally goofy and fails to carry the emotion Poyart was going for. It's style over substance. All flash and little to no bang. Anthony Hopkins does a fantastic job in the lead. No surprise there. He carries the movie until Colin Farrell shows up in the second-half and steals the show. Farrell's bizarre performance is the best part of the movie. So much so that he feels out of place amongst the rest of the cast. Of course that may not be saying much. It's not like really anyone else attached to the project is an A-list actor. Debatably, neither is Farrell. Yet, here he's just so good that he feels like one.That's not to say that the rest of the cast outside of Hopkins and Farrell is bad. It's just that these aren't exactly big name actors. You'll see some familiar faces here and there. Mostly just supporting characters from The Walking Dead and Daredevil. So really outside of our leads the only people you'll really be paying attention to are Jeffrey Dean Morgan and Abbie Cornish, who share the spotlight. While Cornish is just kind of there, Morgan ends up being just as likable as Hopkins and Farrell in his own ways. Mostly just because of that sarcastic sense of humor and say anything style that made him so memorable in Watchmen and as Negan on The Walking Dead.While it does let itself get distracted with pompous style and writing missteps, it's not a complete dud. It's still pretty cool to see Hopkins psychic powers in motion. His mind game of cat-and-mouse with Farrell is more entertaining than it has any right to be. The movie also has some fun shootouts, case work, and a car chase. Standard popcorn affair, but it works even if this is one of those movies where you can predict every little beat. Overly familiar, a little dumb, and it tries to be too serious and ends up with little to show for it. But darn if it doesn't have a (mostly) good cast. The biggest disappointment is that you can tell the people behind it were clearly trying to make something that deals with the complexity of how humans deal with the concepts of death, suffering, and loss, but ultimately just couldn't pull it off. Should have just stuck with some sci-fi, psychic fun. Oh well, not all it lost. It's still stupid fun in a lot of ways. It just needed better execution and more focus given on making it a fun psychic thriller, rather than an overambitious dark drama-thriller.6.7/10"}, {"rating": "3", "text": "Really bad. Interesting premise for the serial killer, starts with promise, but the plot never gains traction. The second half especially is excruciating. Terrible waste of good actors."}, {"rating": "4", "text": "I love the premise and the cast. Hopkins still has his leading ability after all these years and that's something he always gonna have. The plot sadly never goes any where and doesn't remain interesting enough to wanna sit through. By far the most disappointing film of 2016."}, {"rating": "6", "text": "The A list actors in a B movie, is the latest trend.A bunch of great actors with their very good performances, but the story was merely okay, even though somewhat it was an enjoyable flick. 'Two Rabbits' was a good Brasilian thriller, this is from the same director and his Hollywood debut which is not a spellbinding. I expected a lot after knowing it was his film, it did not disappoint me either, but for the Hollywood standards this was a let down. If it would have been a Portuguese film, then no one would have complained much.It was supposed to be a sequel to David Fincher's 'Seven', but failed to fuse both the stories. So then it became an independent narration. The title should have been 'Premonition', but there's already a movie with that name. Like I said the story was kind of a mix of other films. The theme was a too much intelligence, so it needed the clever writers for its screenplay. I only say it was a missed opportunity to turn the product like 'Law Abiding Citizen'.For a concept like this, the scenes were too ordinary and the end has been just alright. The best thing about this was the entertainment it offered, no matter if you feel deja-vu of watching this film, you won't get bored. Top actors, but I still consider it a good quality B movie than an average quality A list movie.6/10"}, {"rating": "3", "text": "Except Hopkins in this movie especially to look and there is nothing. The plot first seems interesting, but in 20 minutes already we know a name of the antagonist and as he looks, and through his 5 stupid and senseless motives. Colin Farrell doesn't approach for this role at all. The ending is simply absurd. The movie obviously on the fan, except a fine game of Hopkins in him there is nothing."}, {"rating": "4", "text": "Notre bon vieux Hopkins est un \"médium\" qui travaillait pour la police et qui reprend du service ici afin de traquer un psychopathe d'un genre particulier puisqu'euthanasieur très préventif sur les bords...En vérité, c'est tout le film qui tourne autour de l'euthanasie, un film déguisé en enquête criminelle qui n'a que pour but d'explorer les tenants et aboutissants de l'euthanasie : pour ou contre, le débat tout de suite sur France 2 avec JLD (ne zappez pas... parce que ça tombe bien, enfin, tombait en tout cas).Donc, c'est plutôt bizarre comme prétexte, car si Hopkins est \"médium\", l'autre est carrément \"précognitif\", ce qui lui donne naturellement une longueur d'avance... Farrell n'apparaît cependant que fort tardivement, aussi a-t-on adjoint à notre retraité pas retraité une jolie blonde du FBI mais pas cruche heureusement ! (c'est assez rare pour être signalé).En fait, malgré son ambiance intrigante et ses louables intentions, le film n'arrive jamais à se départir de ses airs de gros épisode de série télé policière qui se cherche un \"thème\" sérieux de temps en temps. Sa réalisation très hâchée en est d'ailleurs souvent très proche...En outre, on ne sait pas trop où ils veulent en venir ni s'ils ont vraiment et véritablement quelque chose à dire sur l'euthanasie en question : bien, pas bien et sans opinion en somme, bref tout à la fois, comme ça, on ne se trompe pas ! Nous voilà donc peu convaincu par ce film trop brouillon malgré le si charismatique Hopkins."}, {"rating": "4", "text": "Primarily, Solace is a practical and very simple film, but it has two high caliber players as the main characters, the story is convoluted and honestly somewhat ridiculous, but at least they put enough effort to be credible and its director did a good work with the style delivering a film that would have been better as TV production."}], "recommendations": ["lucky_number_slevin", "broken_city", "project_power", "rocknrolla", "21", "a_walk_among_the_tombstones", "terminal", "contraband", "the_italian_job", "triple_frontier", "man_on_a_ledge", "the_loft", "now_you_see_me", "the_number_23", "inside_man", "now_you_see_me_2", "knives_out", "the_accountant", "wrath_of_man", "elektra", "american_ultra", "cube", "the_bank_job", "logan_lucky", "red_notice"]}