{
  "id": 3088,
  "title": "Solitary Man",
  "starring": [
    "Michael Douglas",
    "Danny DeVito"
  ],
  "runtime": 90,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "A car magnate watches his personal and professional life hit the skids because of his business and romantic indiscretions.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5Dpm8QDoL3w3ZOwVl6rgvjRWxrj.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.3125,
    "ending": 1.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.333333333333334,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "The problem with this movie is its linearity. The protagonist is a manipulative single minded jerk with no real insight and that doesn't change. It's aggravating watching him, there is no growth, the plot is obvious.  A disappointment."
    },
    {
      "rating": "0",
      "text": "I would have never rented this title in the first place, but my brother went to pick up something for himself, and offered to get one for me.  I gave him a list of titles that I would like, but he couldn't find any of them, so he picked out this one, I guess because it had Michael Douglas in it.  I am truly shocked to see some positive reviews here, I thought that they would be uniformly awful, just like the movie.  I could tell that I didn't want to watch it after about 15 minutes, but I guess that I got through half of it before shutting it off.  I saw enough terrible dialogue, and Michael Douglas acting like he believed that he was a 16 to 18 year old.  It was painfully boring, along with being just awful.  Now I know that it is a great idea for me to pick out my own movies.  It is extremely rare for me to not let a movie finish, but I'm not into torture."
    },
    {
      "rating": "0",
      "text": "Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long? Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long? Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long? Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long? Awful. Awful. Awful. Awful. Awful.  Why must a review be 150 characters long?"
    },
    {
      "rating": "1",
      "text": "To say this movie sucks gives it more weight than it's worth. The script is well-matched to the direction because both are done equally poorly. The only reason I watched it was because Salon.com liked it, but then it turns out that Matt Zoller Seitz reviewed it, and Salon should fire him. The movie had only one surprise for me - that I made it to the end without walking out."
    },
    {
      "rating": "9",
      "text": "Michael Douglas fans will enjoy his flawless performance as disgraced businessman Ben Kalmen in the darkly funny Solitary Man.\r Hailed as giving his best performance since Wonder Boys and Wall Street, Douglas plays an unlikeable but irresistible car salesman facing a mid-life crisis. His doctor worries about Kalmen's EKG, and orders further tests. Kalmen flees reality as he schmoozes, drinks and parties his way to near-oblivion. We meet him again six years later.\r Kalmen is determined to do all the things he ever wanted to do in life, he tells his loyal ex-wife Susan Sarandon. For him this means cheating, lying, and even enjoying a one-night stand with the daughter (Imogen Poots) of his current girlfriend (Mary-Louise Parker).\r Douglas brings much depth and charisma to his character Kalmen. Along his downward spiral he seeks to mentor a nerdy college student (Jesse Eisenberg), and reunites with an old buddy (Danny DeVito), who exudes wit and wisdom as he operates a diner. Yet Kalmen's continued bad choices alienate almost everyone around him.\r Solitary Man not only shows the personal costs of the ego run amuck in Kalmen's sex addiction, but the human side of a detestable man. Jailed for his business transgressions at the height of his fame as \"New York's Honest Car Dealer,\" Kalmen begs with panache from his daughter (Jenna Fischer) and ex-wife.\r David Levien and Brian Koppelman (who wrote and directed Knockaround Guys and The Girlfriend Experience) direct this showcase for Douglas with the help of an excellent cast. Koppelman also wrote Solitary Man's intelligent script.\r Finally Sarandon and DeVito are the characters who genuinely understand and seek to help Ben. In his own twisty mind, Kalmen believes he is helping himself.\r Douglas will reprise his role as Gordon Gekko in Oliver Stone's Wall Street: Money Never Sleeps (2010)."
    },
    {
      "rating": "7",
      "text": "Douglas is good and the script is smartly written, but I can't say that I found Douglas' character to be likable enough to care about how the film ended. I also can't say that I actually believed the daughter would sleep with Douglas' character either. Awfully skeezy/farfetched."
    },
    {
      "rating": "10",
      "text": "Michael Douglas is at his best in this dark comedy. The film is intelligent, sexy, funny, and pure fun. It gives you just enough drama to keep it interesting, while silently incorporating amusement when you least expect it. Jesse Eisenberg still shows he is a rising star, with raw acting talent. You have Douglas' right hand man Danny DeVito, who gives a notable side role. The dialogue between Susan Sarandon's character and Michael Douglas' are some of my favorite moments, despite the several \"WTF just happened\" moments that will keep viewers wondering what other crazy detail will the cast unveil next. No complaints here."
    },
    {
      "rating": "7",
      "text": "The movie is good, but you stay with wanting more, is too short. The best perfomance of Michael Douglas in years contribuites to save the movie, that fails in the poor script and discrete direction."
    },
    {
      "rating": "7",
      "text": "So close! Solitary Man is a masterclass in intelligent, hilarious but most of all truthful storytelling. The situations that Ben (Michael Douglas) finds himself in, and the resulting dialogues, are affecting because they are not strewn with Hollywood cliche plot twists. Instead we watch the slow and painful demise of a man who deserves his comeuppance and aren't left rolling our eyes at his predictable resurgence to glory.With a little sprinkling of thicker plot and a less cheesy roll to credits this would be a classic."
    },
    {
      "rating": "5",
      "text": "This is a kind of interesting film. The main flaw is the main character, Ben Kalmen - someone who isn't very likeable. He has a way of distancing himself from others, including (of course) decent friends. The performances are ok and it's pretty watchable, if a bit cheesy/cringe-inducing at times perhaps, at worst. I suppose it was interesting to see how Ben worked around his situations, to not allow others to see (or perceive) him as he knew himself to be, indeed as he is - a bit of a drifter. It's not a film that will appeal to all but its ok."
    }
  ]
}