{
  "id": 1757,
  "title": "Solo: A Star Wars Story",
  "starring": [
    "Alden Ehrenreich",
    "Joonas Suotamo"
  ],
  "runtime": 135,
  "genre": [
    "Science Fiction",
    "Adventure",
    "Action"
  ],
  "description": "Through a series of daring escapades deep within a dark and dangerous criminal underworld, Han Solo meets his mighty future copilot Chewbacca and encounters the notorious gambler Lando Calrissian.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3IGbjc5ZC5yxim5W0sFING2kdcz.jpg",
  "categories": {
    "plot": 6.171428571428572,
    "acting": 6.7407407407407405,
    "ending": 7.285714285714286,
    "soundtrack": 1.0,
    "cinematography": 8.5,
    "familyFriendly": 6.0,
    "funny": 8.142857142857142,
    "action": 6.142857142857143
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Went in with significantly lowered expectations and left wondering what the heck critics are complaining about. It wasn't a dramatic masterpiece but I was thoroughly entertained from start to finish. While Force Awakens and Last Jedi were far more polished, I had much bigger narrative and directorial issues with both than I did Solo. I thought the fan service peppered throughout was handled impeccably, Alden Ehrenreich did an uncanny job capturing young Harrison Ford's mannerisms as Solo, and Glover was superb as Lando. If you're a fan of the original trilogy do not let the polarizing views dissuade you from seeing this on a big screen and judge for yourself."
    },
    {
      "rating": "8",
      "text": "I was actually pretty impressed with Solo. It had a number satisfying action sequences and the backstory kind-of fit with what I had always imagined for the character. Ron Howard is a solid if somewhat unsurprising director.Above all I love the way the Star Wars Story films continue to explore seemingly marginal characters like the Stormtroopers or droids or wookies and expands on their lives in sometimes surprising ways."
    },
    {
      "rating": "0",
      "text": "Star Wars died the moment Disney took it over. Everything they do after that is just another nail in the coffin. This is like the modern Star Trek films, it is fan fiction with cos-play actors. Worst of all is the SJW droid and the mincing Lando. Just more cultural vandalism from the evil empire that is Disney. Keep your money."
    },
    {
      "rating": "3",
      "text": "Han shot first, but Lucasfilm keeps missing the target lately. You have one job."
    },
    {
      "rating": "7",
      "text": "There isn't much in the way of new or different story telling, but I had a good time watching Solo.  The performances were all good and Ron Howard steered the ship to a safe landing even if you desiring something a little bolder. B+"
    },
    {
      "rating": "3",
      "text": "We heard about the problems during all the production, the directors, acting problems....I expected a disaster...and Disney didn't let me down...it was the disaster I was expecting and more.... I won't spoil the whole movie here guys, I will describe it fast... no music, feels flat, was boring, people in the cinema were tired and had a tired face at the end, L3-37 was annoying as hell, the 12 parsecs kessel run was destroyed, the characters were underdeveloped, boring, bad acting, the characters did not followed their traits, Solo was ok, Lando became Gayer by the minute, the rest of the characters blended in the background, Woody was incredible Flat and Sad...what a waste of character, the movie doesn't feel like star wars, was a heist movie without any action nor stakes .... I strongly don't recommend the movie guys....wait for it to come out on Netflix and watch it on a rainy, sad, lonely day were there is absolutely nothing to watch."
    },
    {
      "rating": "1",
      "text": "Flat, predictable, and annoying. The references to tot are unbelievably  overboard. Politics and weird sexuality unnecessarily shoved in the movie. Han was ok, but still felt like cosplay. I keep seeing many reviews saying \"leave your expectations at the door and you'll like it\" WHY??? This is star wars, not a clable movie with generic adventure space man. We expect exciting rich stories and characters, and this film does not deliver."
    },
    {
      "rating": "8",
      "text": "i can not understand why people hate that movie , for me is better than rogue one for example and better than episode 7 and 8 , watching the movie i felt humanity , friendship and love like in the old movies , the acting is quite good , the boy who plays the role of han solo is not that bad , i only hate the lando actor the rest ok . i really enjoyed the movie"
    },
    {
      "rating": "8",
      "text": "The acting in this film is so much more \"human\" and fun than any of the other recent Star Wars flicks.  Sure, the first 5 minutes are terribly boring, but it redeems itself.  Phoebe Waller-Bridge as the bot is amazing - seems everything she touches these days (Fleabag, Killing Eve) turns to gold. Woody is great, Lando is solid.  Only that super tall worm-looking thing toward the beginning is utterly ridiculous - on the order of Jar Jar Binks."
    },
    {
      "rating": "2",
      "text": "Another terrible Star Wars entry by Disney. I think Rogue One was a fluke because that was the only Disney Star Wars that wasn't terrible. I honestly miss George Lucas owning Star Wars because despite the prequels being a mess, they are at least watchable compared to the Disney travesties."
    },
    {
      "rating": "2",
      "text": "Nothing can save this movie, not even Chewie. I mean how do you stuff these movies up so much? The history and back story are all there and yet... garbage! Don't wast your money on this movie as it's below mediocre and unfortunately borderline b-grade :( Oh yeah, and the fake review... 10/10 ffs. How much do those reviews cost disney? Edit: Adding that there is a JarJar type character in the form of an annoying droid you want to shut up and die within the first 10 sec of seeing \"her\" on screen."
    },
    {
      "rating": "2",
      "text": "The film is bland, soulless and full of cringeworthy facepalm moments. Its a total disappointment, I think Disney has been lowering expectations so much in the hope that better than a disaster is seen as a good film. Its not. Its a movie no-one asked for and the results are predictable, safe, dull and full of unnecessary toxic political correctness. This film is a shameful cash grab, it belongs in the trash compactor."
    },
    {
      "rating": "10",
      "text": "With all of the bandwagon hate going on due to the way The Last Jedi played out as well as the treatment of beloved characters, the fans have it in for this movie.How wrong they are. This movie is one of the best Star Wars films I've seen in a long while. I enjoyed it more than Rogue One (For real, it was a downer). In fact, the past three SW movies have been complete downers as we've seen characters killed off one-by-one, again and again. It's been pretty depressing.I think we needed this movie. It was fun. It was thrilling. It had that classic SW feel, and man, the aliens were incredibly well done as well as the sets and the effects.The cast is spot-on as well, and although I never thought anybody else could be Han, Alden Ehrenreich did a dang good job. Lando? Okay, Glover was chanelling Billy Dee pretty much. Chewie was finally more than just big hairy window dressing, and the rest of the characters did a bang up job with their respective roles.Man. I just cannot explain how happy I was walking out of the theater. And that reveal at the end?  I can't wait for the sequel.Do yourself a favor if you're a SW fan and ignore the fan hate. They are completely wrong.  See Solo, and save this movie. It's worth it."
    },
    {
      "rating": "0",
      "text": "Bad film.Classic commercial film made to make money.Total disappointmentI will not give more money to DisneyCanon disney, no thanksYes, old canon lucas (i.e. before 2014)."
    },
    {
      "rating": "10",
      "text": "the critics are WILLING this to be the failure the production shenanigans suggest - BUT it is a quiet gem that is closer to the original concept of a star wars movie than The Last Jedi was ... It deserves to receive strong word of mouth - and Alden probably had the most unenviable task of filling Harrison Ford's boots, which he achieved with great skill and conviction!"
    },
    {
      "rating": "8",
      "text": "Probably the most fun SW film in terms of jokes. Action and special effects were great. Visually, this was one of the better-looking films. Yeah, Aldenreich is no Ford, but he is a likable lead. The best part is the relationship between him and Chewie, totally natural. Also, this is probably the first time Chewbacca has been fully utilized. As practically everyone else has said, Glover is a terrific Lando Calrissian. The younger version of him is even more delightuflly egotistical. The MVP of new characters is Han's robot co-pilot. I won't spoil too much about her, but she may the most unique droid in Star Wars.I liked this but I do rank it behind the other recent SW films. (Though definitely leaps above the prequel trilogy.) The film does contain an overglut of characters and set changes. The ending is a bit subdued, too. There is one part of this film that will confuse those who never watched the Clone Wars and Star Wars Rebels cartoon series. I mean I give the writers credit for maintaining the continuity of the canon, but it is at the disadvantage of the casual viewer. Lastly, the biggest problem of the film is how darkly shot most of the film is. The lighting doesn't even match the tone."
    },
    {
      "rating": "9",
      "text": "Awesome movie - fun, entertaining and had that Star Wars spirit that I found lacking in Rogue One (which I enjoyed far less, although the final battle is great). I wish they had gone with a brighter color palette - the movie is very dim and desaturated. But it did not disappoint. Most of the negative scores seem to be people getting weird about SJW stuff. That was minimal in the movie and did not detract from it at all."
    },
    {
      "rating": "7",
      "text": "It isn’t anywhere near as ambitious as THE LAST JEDI, comforting as THE FORCE AWAKENS or great at giving us closure to storylines like ROGUE ONE, but for what it had to do, and all it had working against it, I’d say things turned out alright."
    },
    {
      "rating": "8",
      "text": "This is the style of movie The Last Jedi should have been -- not an experimental Rian comedy ruining canon.  Dark and Action packed.  All that news about \"Glover\" stealing the show or being pansexual, are moot.  He was a small supporting character.  Great job Ron Howard!"
    },
    {
      "rating": "8",
      "text": "I liked Han Solo movie, it's not the best Star Wars movie (obviously) but it was fun and interesting to know han solo 's past; the movie has some issues but still is OK and entertained."
    },
    {
      "rating": "0",
      "text": "Easily the most lame and pointless Star wars movie I've ever seen, and yes, I've seen Last Jedi.Han Solo is supposed to be a cool, roguish, ladykilling scoundrel, but this movie turns him into a cheesy clown (and don't even get me started on how they treat Lando). The plot is dull and loaded with fanservice, as usual for Disney. They really are determined to squeeze every nickel out of this franchise until it's a pathetic joke, and judging from this movie they are well on their way down that road."
    },
    {
      "rating": "1",
      "text": "Overall very boring and unnecessary story. The new droid is hilariously bad in the same vein as Rose from TLJ. Darth Maul shoe horned in for no good reason. Kessel Run left meaningless due to a \"Shortcut\". Unfortunately more of the same \"new age\" Star Wars. Not much to see here for the original fans."
    },
    {
      "rating": "9",
      "text": "I was really conflicted about Solo: A Star Wars Story. On one hand I hate the direction Disney is taking the franchise and absolutely despise the Sequel films. But if I'm to punish movies I don't like then its only fair I praise movies I do like. And I did have a really great time with this flick.It really is a Heist/Gangster film in a Space Opera setting. We see brilliant shots of the Corellian Slums, a muddy warzone on Mimban, and some really excellent sequences of the Falcon in space.The humor was much more subtle and appropriate than anything from the sequel films. The characters, though a little one-dimensional at times make much more sense. The empire is portrayed as vast and intimidating whilst also not having infinite reach. Callbacks and references to the other films and to the EU (surprisingly enough) occur often but they rarely stand out as forced.While the future of the franchise is pretty much a lost cause post-Endor, both of the side-stories have managed to seriously impress me despite extremely low expectations. If you're boycotting Disney for the travesties they've committed with Episodes 7 & 8 then I can understand not wanting to see another Disney-produced film. This idea cuts both ways however, if Lucasfilm start making Star Wars movies you actually like and you don't see them, it'll send the message that people really do want the adventures of MaRey Sue vs Cry-lo Ren and the Hitler Youth repeated every year for all time. Be consistent, or you'll never get the Star Wars universe you want to see."
    },
    {
      "rating": "1",
      "text": "So bad. Chewy is the only bright side. Glover shows hints of Lando. Ehrenreich is a sad Solo. His constant attempt at trying to do the Solo smile seems like he saw one picture and that its. L337, the droid, I wanted to dismantle and bury it like they did E.T. Atari game.Clarke, was a waste of space. Worst than Terminator:Genesis. And another thing they recycled almost the entire music score from New Hope and Empire. Oh the fly through intro crawl, was cool."
    },
    {
      "rating": "1",
      "text": "You are here probably wondering if Han Solo got emasculated and ruined as a character even more. The answer is a resounding yes. His name now has a origin that is lamer than anything you could imagine. He is alone when he signs up for the Empire, says his name is Han so the Empire names him Han Solo. He gets bossed around most of the movie by women, there is a disturbing dong to dong shower scene with Han and Chewbacca (no I 'm not kidding). The new droid  is a fem1nist from hell and the most annoying thing ever seen in Star Wars and Lando who gets more feminine throughout the movie loves it. Basically this is just another Kathleen Kennedy propaganda film where they strategically try to remove any masculinity from legacy characters. All women in the movie are more masculine than Han. They are all more intelligent and more confident than Han. Oh and yes there is a Darth Maul cameo that has no resolution and it's comical when he fired up a lightsaber for no reason. Enfys Nest is a 16 year old girl rebel who is basically Rey without the force, so even more ridiculous. Avoid if you liked Star Wars. Go see if you hate men and hated the original Star Wars and are glad to endorse the destruction of the franchise. Also highly recommended for kids if you want to damage your son and give him low self esteem. The only reason I didn't rate it a zero is most of these review sites consider scores like that \"trolling\". It deserves a 0 though. Star Wars is simply dead. Read the Thrawn Trilogy instead and just give up on Disney Star Wars."
    },
    {
      "rating": "1",
      "text": "Better than Last Jedi, but then again everything is. Just a souless cashgrab nonetheless. Star Wars is dead."
    },
    {
      "rating": "10",
      "text": "It was a really fun and enjoyable movie! I had a great time. Probably one of the top 3 Star Wars movies for me.Unlike the darker and more desperate tone of other recent Star Wars movies, this one had a fun and hopeful air about it. Alden was not like Ford at all but his portrayal of young Han was so earnest that I was completely won over by the end of the first speeder scene. His chemistry with Qi'ra was so real and touching. And Donald Glover was beyond perfect as Lando. Overall it's such a breath of fresh air for the franchise and I can't wait for the sequel, fingers crossed."
    },
    {
      "rating": "9",
      "text": "(87/100)Wow, I've never seen a fanbase THIS toxic. Not a single review that is under a 6 has valid arguments to why this movie was ''bad''. The only thing I'm seeing is: Kathleen Kennedy ruined Star Wars, SJW Propaganda and Disney ruining Star Wars. So lets get to why I liked it. Solo: A Star Wars Story is something new and refreshing. It's so much better than I expected. The story is amazing, Jon and Lawrence Kasdan have done an amazing job. Despite the movie having a directorial change it still feels very coherent and well put together. The movie was great fun all around. SPOILERS AHEAD. The reveal of Darth Maul (Sam Witwer/Ray Park) was surprising and it felt right. He fits right into the story and I really want to see those other 2 Solo movies to find out what happens next with the Crimson Dawn. The surprises of Beckett (Woody Harrelson) and Qi'ra (Emilia Clarke) turning on Han (Alden Ehrenreich) was an amazing twist. Alden Ehrenreich (Han Solo) is not what I expected, I expected it to be bad. He was great in the role as Han Solo and Lando was also excellently played by Donald Glover. Overall I was less divisive about Solo: A Star Wars Story than The Last Jedi and it was a very fun movie in general. Score by John Powell was also great, especially Enfys Nest's/the Savareen's theme."
    },
    {
      "rating": "9",
      "text": "As someone who despises The Last Jedi, I really loved this move. I went in with low expectations thanks to TLJ. I didn't watch any of the Solo trailers and I didn't read any news about the movie beforehand. This movie was made for the existing Star Wars fanbase and I enjoyed it because of that. I felt like TLJ was made to gather a new Star Wars fanbase while letting the past die, killing it if it has to.I have always had a difficult time figuring out exactly what it is about Star Wars that I love so much. There are so many elements to the movies, I'm not sure I can put my finger on just one of them. If I had to choose, I would say the movie's ability to take me to a galaxy far, far away is the core element. The Last Jedi didn't do that for me, but Solo did. I love the feeling of wonder and fantasy. The \"lived in\" environment, full of used machinery and living spaces, is ever present. We get a better feel for how the Empire has truly permeated its presence throughout the galaxy. We get to see how lawlessness reigns in some galactic territories. We get to see new and familiar alien species. We get to see planets that are mentioned in previous Star Wars films, but not seen in a movie until now. For the most part, I felt like I was in the Star Wars universe throughout this film. No, the film isn't perfect, but that's true of all the previous Star Wars films so far. I didn't feel like this movie was trashing Star Wars, it was merely building on what already exists. Considering the setbacks Lucasfilm faced during production, I think this movie turned out quite well. I never really wanted a movie about Han Solo, but I'm happy with what we got."
    },
    {
      "rating": "0",
      "text": "I should've gone to see Deadpool 2 instead...Solo is a boring, pointless movie that further confirms that Disney is just in this for the money, and is trying to pander to audiences with cheap nostalgia while simultaneously disrespecting and \"deconstructing\" everything that was good about the original movies. The guy playing Han is a total lightweight, Lando is a prancing fairy, and whats-her-name from Game of Thrones is just forgettable. The droid is worst of all though.I'm calling it: no one who is a real Star Wars fan could possibly like this movie, or Disney"
    },
    {
      "rating": "0",
      "text": "LOL remember when a new Star Wars movie was a major cultural event, with people lining up and getting excited for it? This is the first time I've ever seen a Star Wars movie arrive and most of the public doesn't even seem aware of it. It's a total \"meh, I guess maybe I'll see it, though I'd rather go see Avengers again\".And well it should be, considering that this is quite possibly the worst Star Wars Disney has made yet (though Last Jedi is tough competition for that title). Han has none of the edgy cool that made people love him in 1977, he spends most of the movie being bullied by shrill women. Lando swishes and sashays through every scene, totally unlike the cool dude from Empire Strikes Back. The Kessel Run story gets wrecked too through the use of a lame \"shortcut\". No surprise this movie had a very troubled production and had to be almost entire re-shot, though it looks like it didn't help that much.Anyway, skip it and watch it on Netflix, if at all."
    },
    {
      "rating": "9",
      "text": "As someone who was skeptical of this film, Solo left me with a big smile on my face. It's such a fun ride filled with great plot twists, characters, and a lot more. It's a nice balance of new and old, so it sits just right with any Star Wars fan. There's some parts that drag, but overall the movie is just something you don't wanna take your eyes off of. The casting (as many people have been worried about) is pretty spot on and lives up to its expectations. Solo: A Star Wars Story, despite its production troubles and \"unnecessary\" purposes, lives up to be a great Star Wars movie that I warmly welcome to the franchise."
    },
    {
      "rating": "7",
      "text": "Well, then. Consider me pleasantly surprised. Because, when I heard of the many production woes and trials that occurred along the way in crafting this film, I was sure the final product would be tired, boring, and devoid of meaning. And though it would still take a lot to convince me that this movie absolutely needed to happen, it's most certainly not boring or tired. In fact, director Ron Howard's \"Solo: A Star Wars Story\" is - at times - The rip-roaring, smooth-talking space actioner I was hoping it could be. And aside from a few head-scratcher creative choices here and there, I think it works overall as a film."
    },
    {
      "rating": "7",
      "text": "Many people would like you to think Solo is a bad movie but it's not. Solo is a good Star Wars movie but nothing special. The moments that work in this film really work and the moments that don't work really don't work. There are a few moments that stand out but a lot of this film forgettable. Alden Ehrenreich is a good Han Solo, as long as you don't expect him to be Harrison Ford. Emilia Clark is good in the role and Paul Bettany is good as the villain (even though he isn't in the movie for a majority of the runtime). Donald Glover is the most memorable out of the entire cast and steals the show in every scene. There is one big surprise in this film but unfortunately it feels like a setup for another film or a sequel. In any case, the surprise was amazing and I can't wait to see what they do next. There are a lot of small moments that make this an above average movie but there are too many small missteps to make this a great Star Wars film. If your a Star Wars fan it's worth seeing, if not, you can probably wait until it's released on Blu-Ray."
    },
    {
      "rating": "9",
      "text": "I had mixed expectations, after TLJ set the new bottom for Star Wars, but this for me is, at least after I've seen it once, very, very good movie. Even though I was skeptical about the main actor initially, Alden Ehrenreich proved to fit the Han Solo character very well. Other actors and their respective characters were also great. It's just sad that spin-off films are much better than the main series."
    },
    {
      "rating": "7",
      "text": "I think it's a solid action movie with a generic storyline and a slightly pale lead actor. Occasionally the charisma of Harrison Ford shines through, but only for brief moments. In contrast, Star Wars drips from every pore of the movie. The worlds are very well implemented and have that filthy and worn look one would expect from a Star Wars movie, especially in the Underworld. The humor was decent and did not always work, the fan service and the easter eggs were well dosed. The emotional moments usually do not work, because one is missing the reference to the figures. In addition, the film lacks tension, but that's the problem with a prequel. We know who will survive in any case. The supporting roles were very well staffed, especially Donald Glover stands out. I just had a problem with Emilia Clarke - she works in GoT, but here she did not make a good impression. For me, there was only one really disturbing and completely unnecessary scene - how Han Solo got its name. Facepalm. All in all, I had fun and was well entertained, I did not expect anything more, so I am satisfied with the movie. After one-time seeing I feel in any case better than after Episode 8."
    },
    {
      "rating": "3",
      "text": "Too long of a build up for too little of a payoff. Movie suffers from poor casting, eclectic storytelling, and unwanted political overtones. Not the worst star wars movie you will ever see, but close. If you choose to see it, be warned that it will feel like gold panning for entertainment."
    },
    {
      "rating": "2",
      "text": "It's not as bad as The Last Jedi, but not as good as Rogue One. It's really not worth the money. Just wait until it's on Netflix."
    },
    {
      "rating": "2",
      "text": "Snooze-fest, and I could not get over how badly miscast the main character was."
    },
    {
      "rating": "7",
      "text": "Solo is an enjoyable film despite not being a great film.  There seems to be an agenda of hate surrounding Star Wars films today, and this bias is pretty evident in user reviews across many sites.  We remember Star Wars films from our youth and rate today's films through a lens of nostalgia that can rarely be matched.  Everyone wants the next film to be better than the last.  Put it all in perspective and just enjoy some good characters, spectacular effects, and a few surprises.  The Star Wars hallmark of strange, humorous aliens in hilarious situations is intact.Of Alden Ehrenreich, well, he is not Harrison Ford any more than Roger Moore was Sean Connery.  He does a fine job, and that, more than anything, is the issue.  The role demands something very special, and Ehrenreich only hits that mark occasionally.  But to say that his performance ruins the film is hyperbole in the extreme.  Just more hater talk. And Emilia Clarke???  WOW...She is fantastic.  Thandie Newton is under utilized in the extreme but in a way that only makes sense if you really pay attention later in the film.  Pay attention to dialogue...In the end, Solo is solid.  Judged on its own, solo if you will, It's great, non-stop fun.  In the franchise of Star Wars it pales against the brilliance of TESB or Rogue One, but then again, everything does.You'll want more of Donny Glover and less of L3.  And that is a very good thing."
    },
    {
      "rating": "10",
      "text": "Solo is the best Lucasfilm production since 1989’s Indiana Jones and the Last Crusade and the best Star Wars movie since 1983’s Return of the Jedi. Bravo to the Kasdan family, Ron Howard and the entire team!"
    },
    {
      "rating": "8",
      "text": "So half of the audience reviews are people who haven’t seen the movie, but just “think this will be trash”. Or are boycotting because of reason x,y,x.  Haters are gonna hate because they hate every time a Star Wars movie isn’t The Empire Strikes Back, clearly the best of the lot, A film which people forget was assaulted by critics when it came out, is now the unattainable height by which all Star Wars movies are unfairly measured.  Is this movie that good?  Of course not, no movie is that good and never will be.  Accept this fact and stop depriving yourself of the possibility of enjoyment.  My goodness.  Do you need to check your expectations at the door?  You might if you are expecting Empire or a life-changing moment in your life.  If on the other hand you are a person who can appreciate the good in something without all this absolutism....\"Its the best ever\" vs \"It destroyed star wars and my life forever\"...and you can just go see a movie in a universe you love, with characters you want to see.  Then you have a great treat in store for you.  And that is not to take anything away from this film.  It works exceptionally well more often than not.  This movie isn’t perfect, but it is a Star Wars movie to its core, probably more so than some of the new trilogy movies.  I had so much fun at this movie.  As I watched this movie I could feel my childhood self screaming with glee in my head while my adult self yipped with joy aloud.  This movie succeeds in a lot of ways, most of them.  For someone to say this movie is rotten is just laughable to me.  The look of the movie alone is worth the price of admission.  Fortunately you get so much more.  This is the funniest Star Wars movie, but still a very action packed movie.  I’ve heard some people say it had “slow” parts.  I guess, but I think some of my favorite moments were just hanging out on the Falcon, shooting the breeze for a few minutes with these characters I love.  The moments where i could just be allowed to float in this world without the story being crammed at me like sometimes it is in blockbuster movies, were wonderful.  The beginning is a little rocky, but 15 mins in and it starts to find its footing.  Halfway through the second act I felt like I was inside an expanded universe comic.  It was really a fun time.  I think this movie is going to age really well. It has some scenes in it which are the best of any SW movie, even the original trilogy.  Don’t listen to the haters.  This is a quality adventure that was really needed.  I haven't had this much fun in a movie in a long time.  One of my favorites immediately and it expands the universe in great ways."
    },
    {
      "rating": "7",
      "text": "Aw yeah... no lightsaber battles(or magic powers), no large-scale 'wars', just small-scale interactions and encounters between characters. Boredom begone!(I'm not a huge fan of Star Wars)Other Star Wars films typically become extremely boring with just explosions and lasers filling the screen. If more Star Wars films contained more smaller scaled emotionally charged battles between characters (like VaderVsLuke, Obi-WanVsAnakin), I could get behind more of them. Solo: A Star Wars Story brings the franchise a step closer to the best aspects of Star Wars. Now my rankings for the films are: EmpireSB > RevengeotS > SOLO. BOOYAH."
    },
    {
      "rating": "10",
      "text": "This movie was a lot better than expected. People are judging poorly without even watching movie. GREAT movie!"
    },
    {
      "rating": "9",
      "text": "Solo is great fun original trilogy Star Wars fun! Alden Ehrenrich is Han Solo. Donald Glover is Lando. There are great action scenes and a twist that leaves you wondering where they are going to go next."
    },
    {
      "rating": "7",
      "text": "\"Oh,look! Another Star Wars movie. Unite the angry Fanbase and give them a notepad to write everything wrong with it so that they'll make their own rant! (and to give CinemaSins a run for their buck)”This is how most of this so called “Fanbase” works,whenever one of these movies comes out (*POP* I liked Last Jedi).But when we talk about Solo A Star Wars Story,I can say that it was a fun ride,aside from the Development Hell this movie went through. Going into it,I was expecting a Heist Movie with the same veins of a Steven Soderbergh one,and it was that,with some haunting places,a John Powell score that never disappoints and (almost) great casting.You may want to cool down your expectations if you want to see a good story with the big spectacle we usually expect from a franchise like Star Wars.From beginning to end,it just felt like a great big action sequence (of 2h15) that takes place in several places with a story that's easy enough to follow,given that the movie doesn't know when to spend its time on either the friendship between Solo and Chewie or the big heist with Woody Harrelson as Beckett.Speaking of the actors,I thought Alden Ehrenrich could have been good as Solo...If the script didn't give him some of the most cringey Fanbase moments of all time.“I hate you” “I know”Although the secondary cast was a better ensemble than I thought it was going to be.Emilia Clarke as Qi’ Ra? Good!Jon Favreau as Rio? Kind of annoying,but still good.Paul Bettany as Evil Vision? Boy...But Childish Gambino AKA Donald Glover as Lando Carlissian STEALS the movie.Not only that,but also the massive wonderment of a score by John Powell that, just like Ice Age The Meltdown and Robots,makes it for another standout that carries the movie,accompanied by a courageous theme by John Williams.Oh,and big special effects and one of the greatest title card appearances of all-time (Thor Ragnarok and Guardians Of The Galaxy BEWARE).You can call this the “Fun Star Wars” if you go into it with the right amount of expectations. Don't expect an Empire Strikes Back,but also don't expect a Rogue One,although a better movie than the prequels you can. All in all,sure,never tell him the odds...At some point."
    },
    {
      "rating": "7",
      "text": "Retcons galore. It's a decent heist / origin story but they really went overboard with references and retcons.Oh, the two major \"plot twists\" don't make any sense (blond girl and ending, yep, you heard me). I guess Emilia Clarke was promised a sequel..."
    },
    {
      "rating": "7",
      "text": "I actually liked this movie a lot but it do has its flaws. For one the script is kinda off since it just doesn't feel special. Its simple but its not unique and there are times in the film where the plot just feels messy and some of the characters are just there for no reason. It feels like the movie is just there, it may be a fun ride but at the end there's nothing new to it. For one, this movie is better than the TLJ and I suggest that you watch it because it's actually good. It may not be a masterpiece,but it's a fun ride and some of the scenes are just really well executed. Some criticise the pacing but I could say its fine. So overall this movie is just good but not great. But this is just my opinion."
    },
    {
      "rating": "9",
      "text": "As a Star Wars fan this is one of my favourite movies. Han, Lando and Chewie are awesome. There is also a surprise for all the fans in the last 10 minutes of the film. Favourite movie i have watched this year in 2018. 100% Worth seeing if you like Star Wars"
    },
    {
      "rating": "1",
      "text": "So for some reason my review got deleted and my account login changed. Again this movie sucked. Save your money."
    }
  ],
  "recommendations": [
    "rogue_one_a_star_wars_story",
    "star_wars_the_clone_wars",
    "star_trek_nemesis",
    "captain_america_the_first_avenger",
    "john_carter",
    "superman_ii",
    "star_trek_insurrection",
    "terminator_genisys",
    "thor_ragnarok",
    "red_dawn",
    "avengers_endgame",
    "star_trek_beyond",
    "edge_of_tomorrow",
    "star_trek",
    "star_wars_episode_ii_attack_of_the_clones",
    "star_wars_episode_iii_revenge_of_the_sith",
    "terminator_3_rise_of_the_machines",
    "black_widow",
    "hercules",
    "the_scorpion_king",
    "man_of_steel",
    "three_kings",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "the_a_team",
    "x_men_apocalypse"
  ]
}