{
  "id": 2824,
  "title": "Son of God",
  "starring": [
    "Roma Downey",
    "Diogo Morgado"
  ],
  "runtime": 138,
  "genre": [
    "Drama"
  ],
  "description": "The life story of Jesus is told from his humble birth through his teachings, crucifixion and ultimate resurrection.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7xWa1p2qMn4rxGIvRDDebJrXMiI.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 4.25,
    "ending": 5.0,
    "soundtrack": 6.0,
    "cinematography": 9.0,
    "familyFriendly": 3.6,
    "funny": 8.0,
    "action": 9.5
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Son of God isn't that bad of a film. Yes its long and has poor acting but whether you believe what happened or not, it's an interesting story. Too bad the film couldn't have told that story better."
    },
    {
      "rating": "6",
      "text": "Surprisingly well acted and engaging, Son of God doesn't reach the heights of say, Passion of the Christ, but it's not the bore it could have been either.  Some people believe that all Christians think all films about God are great, but I think being a Christian actually makes me more critical of Biblical movies.  Son of God has some real emotion in it, and it's actually less preachy than many other faith based films.  That's not to say that the movie is sinless in cinematic terms.  The visual effects showing ancient Jerusalem couldn't get any cheesier in my opinion.  Even 14 year old Gladiator completely destroys the film on this front.  Of course, Gladiator had over 100 million in its budget, but I've seen free software create more believable visuals than seen in Son of God.  There are also a few clumsy moments in terms of storytelling, and it's really nothing new, but I think the film is good enough in terms of acting and directing to give a little boost to your faith if you're running low.  And you'd have to be a stone to not be in danger of crying at the crucifixion scenes."
    },
    {
      "rating": "8",
      "text": "What a blasted shame that this beautifully produced and finely acted religious movie is not in here with the GREEN bar WAY out front of the Yellow and the Red bars! People like me, who wish for more religious themed cinema, as well as loving many types as long as the F word is not part of the extreme themes and the 3-D and wide screen stereo sound is digitally amazing to behold, should be so happy to spend their money on this assuring the producers that there will be large enough audiences to warrant making such films. I was hesitant to see it when it debuted in our Regal Theater here after reading such a mess of NON religious types putting it down and I was amazed to tears on that Tuesday after it opened on  the Friday before. My love for religion is specifically centered in the AngloCatholic wing of the Episcopalian/Anglican communion my lifestyle is one of a straight-in-appearance,gay catholic Christian so this movie covered all the basics without plugging anything offensive to ME but if those who don't believe in His divinity or even his Trinitarian claim, that part might set you OFF. I loved it but the BluRay series it came from (The BIBLE) was a bit weak,I agree, when it came to depicting the portions of the old Testament,...to my liking!"
    },
    {
      "rating": "0",
      "text": "One more movie about Jesus looking like Jared Leto and I'll kill myself.What is this?Who?What?How?Why? is this happening to me.:(:(:(:(:(:(:(:(:(:(:(:("
    },
    {
      "rating": "10",
      "text": "True to the book, great story!  If you are looking for action adventure, not a good choice.  Only anti religious folks don't like this.  Well worth the 2 hours to see the bible come to life..."
    },
    {
      "rating": "5",
      "text": "Son of god I found to be very powerful. Not just for Christians and the believers of God, but for everyone. It may be Christian oriented but the film explains very well (Not exactly as powerful as \"The Passion\") how cruel as human beings we can be in the world we live in today as well as it was a very long time ago."
    },
    {
      "rating": "2",
      "text": "This movie, like other movies like this, fails to deliver the story. The directors always assume that 1. it is going to be easy because the story is already written for them and 2. that everyone needs god. The director never tells the bible like a fantasy story like it is, but instead try to make it as believable as possible and meet an agenda. honestly, not worth the time or money"
    },
    {
      "rating": "4",
      "text": "But, revere them or reject them, in my mind the Christ stories that generated the most controversy were the most interesting films. Son Of God is TV-movie watchable, but it is not the greatest telling of ostensibly the greatest story ever told."
    },
    {
      "rating": "2",
      "text": "The movie barley passed as a  \"B\" movie and all I could think of was \"when will this get over\". The acting was VERY limited and the the movie. It would have been nice if there was an opportunity for actors to actually say more than five (5) words per line, The film (can't really call it a movie) jumped around without telling a story or being entertaining. It was easy to tell that it was culled from a miniseries and not a true movie. Two thumbs down."
    },
    {
      "rating": "1",
      "text": "What an insult, it was terribly written and acted don't waste your money, not even close to the greatest telling story, all we could think was when should we get up and walk out of the theater."
    },
    {
      "rating": "0",
      "text": "This movie is bad enough to make you want watch something like Twilight just to forget that pointless thing. Seriously,no,most of the scenes was just Jesus being a stalker. Wow,how cool."
    },
    {
      "rating": "2",
      "text": "Well, it'll probably make Noah look like Citizen Kane by comparison!  Christians settle for very little, it seems. And this is very, very little.  Jesus movies are as difficult to do correctly as Ann Rand movies."
    },
    {
      "rating": "0",
      "text": "Gross misrepresentation. I don't think I've ever seen a movie or play, about the life of Jesus Christ, that took more liberty and deviated more from the scripture than this one. I can't help but wonder if the script was written by an atheist skeptic.\r If you stick to the information given to us nearly 2,000 years ago, I don't see how you can go wrong. It's basically a pre-hit homerun. Just repeat what was written."
    },
    {
      "rating": "0",
      "text": "The captivating story about the first man who learned to lie. The movie reminded me that Jesus was an annoying and intrusive stalker put on Earth to stop man from achieving any kind of mental progress. It should also be noted that Jesus is ripped and that he looks like a 25 years old Norwegian athlete. It confirms my theory that humanity always finds a way to look stupid. I'm really sorry there's no score lower than 0."
    },
    {
      "rating": "10",
      "text": "This is a very good movie which is Biblically sound and done well!\rI recommend it to anyone who would be interested in the Christian faith and anyone who is a Christian."
    },
    {
      "rating": "10",
      "text": "This movie was a excellent summary of the inspiring life of Jesus, performed in the theme of the era He spent on earth. The story telling is deliberate and well portrayed by an excellent cast. I would recommend it for everyone, young and old, who is looking for the true meaning of the Christian religion."
    },
    {
      "rating": "2",
      "text": "This should have been a word for word adaptation of the bible . Sub par acting hokey exaggerated sense of wonder. Bland and weak even for Christians to enjoy well they have been under served by hollywood . Also why did they think so many drastic changes to the source material . Well most Christians alter the Bible to their liking."
    },
    {
      "rating": "10",
      "text": "Excellent reminder of what this life is all about, and how we should live our life and why. It's good to have a way to share your faith with your grandchildren."
    },
    {
      "rating": "0",
      "text": "If you wanted to teach people about Jesus and explain what the Christians faith was all about to someone that does not know, then this movie falls very far short of that. I can not in any way shape or form recommend this movie. It skips all over the place and most of the acting is so bad no one seems believable in what they say or do. I am a Christian and wanted a good movie about Christ and can not believe I would even write this. It is that bad. A plea to Mel Gibson please direct another movie just make it about Christ whole life this time. I would come and work for free for you just to see that happen....we need people to spread the word but if the word makes no sense what good is it."
    },
    {
      "rating": "10",
      "text": "Great movie!  The life of Jesus, and having faith.  I would highly recommend this movie for anyone..especially a non-believer.  The non-believer would learn a lot about how Jesus died for each and everyone's sin.  Being a Christian myself, I am always inspired by Christian movies.  It is the greatest story ever told, and it's refreshing to see that people are spreading the true gospel all over the world.  Praise god."
    },
    {
      "rating": "10",
      "text": "Great movie! Explains the life of Jesus.I would highly recommend this movie for anyone..especially a non-believer. The non-believer would learn a lot about how Jesus died for each and everyone's sin."
    },
    {
      "rating": "6",
      "text": "A good telling of the story of Jesus, but I'm not going to lie to you and tell you that it's perfect. Obviously Christian audiences are going to enjoy it the most, even if it has some inconsistencies here and there that aren't entirely factual. Once again those who have something against God, Jesus, and religion and general are going to hate it. That's sort of my main problem with the movie. Even though it does a good job of telling the tale it does nothing to give those outside of the Christian faith a reason to care. It won't give them any reason to doubt themselves or make them wonder, which is something I believe a truly great telling of the story of Jesus (and religion in general) should do.\r I think most of this has to do with the way it plays out. The majority of the movie is a string of the big moments in the life of Jesus that are popular in Sunday school lessons, and those who know the tales will have fun figuring out which ones are which, but they are tied together with little to no context which means that those unfamiliar with the tales will feel somewhat lost. The crucifixion scenes do hold power, but the moments leading up to them will not make those who do not care about Jesus, well, care.\r For Christian audiences this is a movie that does a good job of telling a large portion of the story of Jesus, and I feel that this is the audience it was going for. Non-Christian audiences are better off looking for a movie that will actually do more to get them interested in the \"stories\" of God and Jesus, or even asking a Christian to tell them about it or visiting a church. This movie won't do much to peek their curiosity. As it stands it's a harmless movie that Christian audiences will both enjoy and respect. It's just a shame I do not see a reason why it would do anything for those who are not of the faith. If it had I would have rated the movie higher. My total score is a 6.5/10=Okay."
    },
    {
      "rating": "8",
      "text": "In writing about this movie I'd like to stay away from the debate about the validity of God-as when you come to Jesus he will be ready for you. Regardless, I thought the movie was vary similar to the stripture, with some small liberties for movie making purposes (i.e. dumbing it down). However, it was interesting to see another's vision of the life of Jesus-clothes, casting of disciples, etc. Most importantly, I think everyone in the movie theater was touched by the film. Crying in most cases-especially if you are a Christian and understand the sacrifice made/written by God."
    },
    {
      "rating": "1",
      "text": "I suppose the movie served it's purpose, to edify the faith of the already faithful. It is a devotional movie. If you are looking for something with any historical accuracy, you'll need to look on Netflix, in the Documentary section. This particular movie can safely and fairly be placed in the Fiction category."
    },
    {
      "rating": "7",
      "text": "It's good, but not great. It is perfectly passable, but there are better Jesus movies than this."
    },
    {
      "rating": "9",
      "text": "Accurately tells the life of Jesus Christ. This is about the movie, its casting, special effects, and the dialogue. Religious views aside, there is nothing \"bad\" about it. I wouldn't exactly recommend gong to a critic site for reviews over controversial material, seeing that they would rather spill out someone's guts than just watch a movie and not be biased. If you are looking for something to do a Sunday afternoon, this would be a great choice for anyone interested in either stepping out of the box or just taking a break from all of the guns. Although before hand I would lie to give a heads up it may be a little intense for small children and/or older ladies seeing that a woman started sobbing behind my head while I watched it in theatres."
    },
    {
      "rating": "2",
      "text": "Son of God brings the story of Jesus' life and while there's certainly some good performances (especially from Diogo Morgado), this movie is immeasurably dull and way too clumsy to unlock entertainment."
    },
    {
      "rating": "5",
      "text": "Stop reviewing the message Christians..... You are not posting 'reviews' so why click on 'write a REVIEW'?? Not having a go and you are all clearly wholesome and nice people and God Bless you. But you are just saying hilariously quotable things like, \"God really does exist\" (?? Now after you have seen the film? Or you just always thought that, saw the film, and then bashed us with it because the film gave you the excuse to share what you believe in and therefore find important (selfishness by definition whether righteous or otherwise)??\rEither way: SSSssshhhhhhhh. Is the film good? Cool! Please inform us how (acting, cinematography, drection?)? Because we know the message is (even though it spread death, racism, war and disease with it.. oops!) good..... for the most part.... but what about the movie? All the 10/10s do not seem to be reviews.\rPut it this way, it is hard to convince anyone of anything when you sound brainwashed and one-track. In every other area of life, we generally regard this as a bad and foreboding thing. It is why cults exist... Munchausen syndrome.... racism.... and any number of other negative things. Deciding on our destiny is unlikely to be less important. So we can't be sure, just 'cos you all are. We have been afflicted with independent thought and the ability to be troubled. Our bad.\rIt would be so refreshing to have a full-blown Christian come in and say, God is good and great and this film is a steaming pile of ****. But which one has been able to or could separate the too? Exactly."
    },
    {
      "rating": "7",
      "text": "good movie tells the story of Christ very well and the strange thing is only anti christian  gave this movie a bad review. This movie made me have mixed feelings sadness and sorrow and at other times happiness it made Jesus' story come to life overall terrible acting but good story i recommend"
    },
    {
      "rating": "10",
      "text": "inspiring and HEart lifting! , MY sister and i came out of theater inspire , and RENEW, it Strengthen our Faith, the Producers and Cast did an Incredible job , Keep it up!!!!!"
    },
    {
      "rating": "9",
      "text": "This movie is a dipiction of the life of Jesus and that is what you get.  A beautiful movie, with good acting, that tells the storey a  the carpenter from Nazareth.  A corny scene with Jesus on water in a storm and some cheesey camera angles, are what hold this movie back."
    },
    {
      "rating": "6",
      "text": "This film tells the life of Jesus Christ as a story. Directed by Christopher Spencer, its a spin-off from the series \"The Bible\", of the \"History Channel\". The main role is played by Portuguese actor Diogo Morgado.This film has been subject of negative reviews for allegedly not do a literal reading of the biblical texts. Evangelical Christians were furious, conservative Catholics too. Some of the criticism has logic but others are pure religious fanaticism of people for whom the Bible is untouchable, no matter how many times it has been mistranslated, amputated (in pages or even entire books), rewritten and censored until get the version that we have in our house. This is the problem when we talk about movies with religious themes: people just aren't able to see beyond their beliefs.When I knew that \"History Channel\" would make this spin-off, I knew immediately that it was just to make the most profit of a production that had been very expensive. Since a few years ago, the contents of this TV channel (at least here, in the western corner of Europe) has had less and less quality (the programs come from America and speak only about pawn shops, cars, scrap and theories, absolutely idiotic, about ancient extraterrestrials). So I loved the original series, it was much better than the programs they normally broadcast. I didn't expect something too glued to the biblical text but a tale, inspired in the concept \"Bible told as a story\". The film follows this model, telling Jesus'story from birth to ascension. Purists may not like it but, nowadays, this material can be very useful, drawing attentions to the Bible in a world when every less people have it in home.The film does a very regular job telling the life of Jesus. Its greatest sin is still too much like the TV series, as if it were an expanded chapter. The special, visual and sound effects aren't cinematic enough, the soundtrack is not particularly relevant. As a movie film its bad, but as a TV film it works well. The actors, as expected, are absurdly unknown to most of the public. This includes the protagonist, the Portuguese actor Diogo Morgado, who made Jesus Christ. Like most of the Portuguese, I followed Morgado's career, who gained fame in our country through television soap operas and series, and a few Portuguese movies where he participated. Its not a bad choice for the role, although I think that Jesus will probably have been much darker than Morgado (the actor even has light brown hair), like most of the Jews."
    }
  ],
  "recommendations": [
    "the_shack",
    "overcomer",
    "war_room",
    "the_case_for_christ",
    "heaven_is_for_real",
    "risen",
    "facing_the_giants",
    "courageous",
    "i_still_believe",
    "exodus_gods_and_kings",
    "noah",
    "the_passion_of_the_christ",
    "woodlawn",
    "the_last_temptation_of_christ",
    "the_young_messiah",
    "i_can_only_imagine",
    "machine_gun_preacher",
    "babel",
    "mother",
    "antebellum",
    "the_giver",
    "v_for_vendetta",
    "united_93",
    "contact",
    "pay_it_forward"
  ]
}