{
  "id": 2896,
  "title": "Son of a Gun",
  "starring": [
    "Ewan McGregor",
    "Brenton Thwaites"
  ],
  "runtime": 108,
  "genre": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Locked up for a minor crime, 19 year old JR quickly learns the harsh realities of prison life. Protection, if you can get it, is paramount. JR soon finds himself under the watchful eye of Australia's most notorious criminal, Brendan Lynch, but protection comes at a price.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yRLVyhQfkW2hn15e8NIqarswLAr.jpg",
  "categories": {
    "plot": 5.083333333333333,
    "acting": 5.090909090909091,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.75
  },
  "reviews": [
    {
      "rating": "8",
      "text": "We don't know why this young man is sent to prison, but we see he's in big trouble.  He forms a partnership with a prisoner based on his chess skills.  Who knew?  This leads to more and deeper trouble but he's stuck, what's he gonna do?  Didn't like the ending, not a great moral teaching moment."
    },
    {
      "rating": "7",
      "text": "Ewan Mcgregor deliver a fantastic interpretation of someone who has seen and done a lot in his life and chose the path of brutality and violence in order to achieve their goals but he is eventually confronted by life itself closing a circle. The film has ups and downs but pays off."
    },
    {
      "rating": "6",
      "text": "For a crime or heist movie, Son of a Gun benefits from polished editing, good direction and commendable performance by Ewan McCGregor. However, the plot is not that engaging, the simplistic development could also be found in TV series or action games. To its credit, the film delivers plenty of content, even though some of them are stereotypical prodigy-versus-mentor or damsel-in-distress premise.\r JR (Brenton Thwaites) is a new inmate in a prison, where he meets Brendan Lynch (Ewan McGregor), a veteran conman who offers him protection. Soon JR find himself as Brendan's henchman, unsatisfied of only doing his bidding, the two eventually clash. Thwaites performs well, he's decent as the young lead, but his acting range is a bit limited on some scenes. McGregor is the star here, stealing any scenes with flair and occasionally blurted rage.\r Their relationship is a strange one, JR subtly seeks a father or teacher figure which he finds in Brandon, although ultimately he realizes that their interest might not align. It works in short term, but the material doesn't provide much back and forth exchange, what twists it has in store are pretty foreseeable. JR also encounters Tasha (Alicia Vikander), a beautiful girl in despair. There's little surprise this romantic subplot, Tasha's back story and also the tiny bit where she might just be a honey trap are not fully developed.\r Its plot isn't ambitious nor does it possess high level of intricacy on its heist. A lot of other similar movies, or even TV series, have delivered the same concept. The use of Australia as setting helps, but it boils down to the familiar prison break or robbery stints. Luckily, the pacing is sharp, it pushes forward with conviction and the action parts are decent as well.\r Son of a Gun feels like a fast version of crime miniseries of television show, it may not be groundbreaking but it is still a decent watch for action fans."
    },
    {
      "rating": "2",
      "text": "Director Julius Avery manages to make heavy handed entertainment out of the prison drama and the heist movie, two of the easiest genres to at least make watchable. Here they become tiresome and ridiculous lacking any subtlety whatsoever. The event packed screenplay is peppered with more clichés in one movie than I can remember in many a year. The story gives the impression of a lot going on, but take out the many obligatory romantic interludes and there is definitely less here than meets the eye. Both the heist and the escape from prison are so easily accomplished that one could believe it would have been harder if the guards had personally let them in and out, respectively. Even the editing doesn’t help as not one palpable jot of tension or excitement is produced despite everything that is going on, and given the material’s potential.\rOf the actors an unusually cast Ewan McGregor acquits himself well as a hardened criminal, but a lot of the other cast don’t come off quite as well. The ubiquitous Alicia Vikander stuck with the ‘girlfriend’ part, needs to start choosing her roles with a bit more care. Following on from ‘Ex- Machina’, another dud, she would be wise to reflect on her best performances in films like ‘A Royal Affair’ and ‘Testament of Youth’. Newcomer Brenton Thwaites may look pretty but he spends almost the entire movie shirtless sporting an expression of perplexed naiveté. He looks as if he has never been to school let alone jail!\rThis is the sort of film that in another decade would have gone out as a B movie or second feature. These days it’s just not good enough to pass it off as the main event."
    },
    {
      "rating": "6",
      "text": "Son of a Gun is a good movie - the story could have been developed a little further, but the lead characters are engaging. It is a really strong debut by Julian Avery - it will be interesting to see what direction he takes next."
    },
    {
      "rating": "5",
      "text": "Not a very good movie, yes the performances are great, but the movie wastes it's time trying to be a romance. I love romance, when it works. but Alicia Vikander, my favorite actress, and Brentan Thwaites have no chemistry. The romance is very lazy. The characters are poorly developed and don't have good chemistry either. The action is pretty good, but overall I thought the movie was too bland and boring to be good."
    },
    {
      "rating": "4",
      "text": "Son of Gun is the typical sunday movie, its biggest sin is to turn the movie into three by exchanging so many narrative and sequential movements, it's not a great movie, but it's not a totally discarded work at all, if you can see it, well."
    },
    {
      "rating": "8",
      "text": "I thought this was surprisingly good - a gripping and tense action/thriller watch with some plot twists and I liked that the characters were quite well developed. Ewan MacGregor gives a good performance in this film. I'd recommend it."
    }
  ]
}