{"id": 342, "title": "Sonic the Hedgehog", "starring": ["James Marsden", "Ben Schwartz"], "runtime": 99, "genre": ["Action", "Science Fiction", "Comedy", "Family"], "description": "Powered with incredible speed, Sonic The Hedgehog embraces his new home on Earth. That is, until Sonic sparks the attention of super-uncool evil genius Dr. Robotnik. Now it’s super-villain vs. super-sonic in an all-out race across the globe to stop Robotnik from using Sonic’s unique power for world domination.", "releaseYear": "2020", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/aQvJ5WPzZgYVDrxLX4R6cLJCEaQ.jpg", "categories": {"plot": 8.6, "acting": 8.777777777777779, "ending": 8.6, "soundtrack": 5.0, "cinematography": 9.0, "familyFriendly": 8.0, "funny": 8.904761904761905, "action": 9.0}, "reviews": [{"rating": "10", "text": "Definitely THE BEST VIDEO GAME FILM EVER! The hype is real! And has the BEST POST CREDITS SCENE EVER! We need Sonic 2!"}, {"rating": "10", "text": "It's a fun film to watch with various axtion senes and entertanig charters."}, {"rating": "9", "text": "Good    movie"}, {"rating": "10", "text": "Its a great family movie. Its realy enjoyable and Sonic felt real the entire movie"}, {"rating": "9", "text": "It could have been the worst disaster for SEGA, but they did manage it very well. I don't give It a 10, because there are a lot of things missing. The addition of Tails and the way Robotnik gets mad totally makes you relive the old games, it may be difficult for someone that hasn't ever played a sonicgame to understand that details but is still good."}, {"rating": "7", "text": "Don’t believe the hate! Sonic the Hedgehog is a pleasant movie with some decent jokes and some likeable characters. Jim Carey Steals the show with a role he was born to play. It starts a little slow, but otherwise a good, if unspectacular experience."}, {"rating": "10", "text": "The movie was very moving for me. It reminds me of my childhood. Jim Carrey is an incredible actor. It worths to go and have a good time!"}, {"rating": "8", "text": "Really loved it.  Was totally on par with the pokemon movie. I laughed and almost cried. sonic is funny and the action is good and the way they introduced video game concepts to a live action movie was clever."}, {"rating": "10", "text": "Awesome movie!  Rare case of a game to movie adaptation that is actually good. Jim Carrey being actually funny again in a movie too!"}, {"rating": "10", "text": "It was everything I wanted it to be. It was nostalgic, had excellent writing, it had a hyper potions song in it for christs sake! Im glad I went to see it alone because I was a sobbing wreck for half of the movie. Absolutely wonderful. I really wanted to hate it too but it was just so good it changed my mind. Anybody that says otherwise has no idea what they're talking about."}, {"rating": "9", "text": "Loved it! Sit back and soak in this fun film, don't think too seriously and look for logic. Just enjoy it for what it is like you would a video game! Loved all the call backs and references. Fans should stay for the secret bonus scene. Bring on Sonic 2!"}, {"rating": "9", "text": "This is a children’s movie, and a well done one at that. If I had kids, I’d take them to see this — something I can’t say about most movies in the current age. Fun, simple, and a great performance from Jim Carrey: I really hated this character, which is the entire point. Highly recommended for kids, or the adult looking for some simple wholesome fun."}, {"rating": "8", "text": "Possibly one of the best movies I’ve ever seen. Raises the bar by a mile for video game movies. Sonic’s cocky attitude was translated into the movie beautifully. My favorite iteration of Sonic at the moment. Won’t spoil much, but the final end credits scene really makes me want another Sonic movies, or at least a follow up game. While the humor at times could be lackluster, there were many hilarious moments in the movie."}, {"rating": "8", "text": "One of the best video game movies in a long time, watched the movie together with my brother and we both liked it.Is not perfect but well worth watching."}, {"rating": "10", "text": "The movie was so fantastic honestly without any lies, I like it its full of comedy especially jim caren role so marvelous That my opinion I hope u see the movie and like it so let's support it"}, {"rating": "8", "text": "Vale la pena ir a verla, la adaptación y los arreglos hechos a sonic tuvo buenos resultados. La historia es entretenida y para los fans no creo que queden haya decepción."}, {"rating": "8", "text": "Okay, that was fun. A legitimately good, entertaining movie. Was it a game changer? No. Did it have flaws? Sure, yes. But did I sit there, the whole movie long, with a big grin on my face? Absolutely. Jim Carrey stole the goddamned show, as is only right and proper. This was full on 1995 Jim, where you take the goofy, chaotic neutral Trickster/Coyote that is The Mask and go full on sinister evil. That's Dr Robotnick.Oh, and Raul Julia must now surrender the Overacting As A Video Game Villain belt. Dear god, no scenery escaped chewed. Actually that's very apt - if you liked Street Fighter, then Sonic is RIGHT up your alley!The sonic redesign was fine, the effects worked. The script is very linear and the characters very broad - but I don't mean that in a pejorative way. They're very basic archetype characters that get the job done and do what they need to do and I found myself caring about them and their fates. That's a win in any book.Is it flawless? No. Does it reshape cinema forever? No. But it's fun and full of heart and charm and is completely entertaining. The movie is exactly what it needs to be, no more, no less. I absolutely recommend the movie to any and all. It was a fun evening out."}, {"rating": "10", "text": "It's a generic kids movie with a few funny jokes, meme-worthy brand deals, and some incredibly sick action scenes. In Sonic 2 let's: let's get more action scenes, refine Tail's design, and tone down Sonic's more annoying traits.Tyson Hesse is a miracle worker,, god bless."}, {"rating": "10", "text": "My Family and I love this movie. We are so thankful for the redesign and how it allowed us to feel immersed with Sonic. Throughout this movie, we had genuine laughs and you could tell the audience and children among them, really liked it. My son said, he would be so bummed if they did not make a sequel. This one is great for the family."}, {"rating": "10", "text": "Adorei o filme! Um dos melhores que já vi. Adoro o franquia Sonic o que ajuda mais ainda a gostar do filme! NOTA 10!!!"}, {"rating": "10", "text": "Very good film( I'm not Sonic fan) Jim Carry was the best. And it's kind of funny."}, {"rating": "9", "text": "First I would like to thank you Paramount Pictures. Other studios need to take a page out of your book. I don't care if that disaster of a reveal was a marketing scheme or not your correction got my butt in the seat opening weekend rather than a $5 tuesday.Second, opening weekend every showing was so packed i had trouble getting a good seat at any time. So congrats.Now to the movie itself. The good the bad the ugly. Ill start rather than end with score. 9/10.Is it perfect no. But for what it is its the best movie I've seen in a long time. The character(s), that is plural btw stay after the credits to see what i mean, look amazing. Although you did make me think of Weresonic a couple times so that's a negative.I was laughing and having a great time some based on nostalgia some based on enjoying kids movies. Either way I was happy for about the entire runtime. Was there logical inconsistencies sure. Some made sense cuz it was a kids movie other didn't make sense but it was ok because it was forgivable for a kids movie, i.e. inconsistent power functions, lighting changes to match tone but not time.My final gripe was the one point off. Robitnik is great. Jim Carrey nails the level of eccentricity. Its a different brand but similar level so good on you. The problem is the San Fran scene. Its not shown but any adult would notice that casual murder is implied. Robitnik  lack of care for other humans and the event on screen means people are dying and he has not remorse for it. I am not a parent but i believe that may just be a tad too far for a kids movie and is the only reason i did not give this a 10/10. All having been said, I loved it and you have me ready for a sequel"}, {"rating": "10", "text": "Maybe it's far from reflecting the game, but still they made a great job to create such simple and delightful new story and friendly to watch scenario with really good actors.Im waiting impatiently for the second film :D"}, {"rating": "10", "text": "Excellent movie, so glad they held off releasing it until it was done right. So much nostalgia. I really hope they continue the story!"}, {"rating": "10", "text": "I loved it and I am waiting Sonic 2. The characters, the drama, everything was perfect."}, {"rating": "10", "text": "I was amazingly surprised on this movie, it was very entertaining, actors were amazing including Ben my absolutely favorite, great sonic choice. Your kids and u will have a great time. I was at a birthday party today and kids were running like crazy trying to be Sonic, haven't seeing this since Elsa on Frozen 1"}, {"rating": "10", "text": "I thought the movie was fantastic. I really wasn't sure what to expect after the whole redesign debacle, but they really nailed the look and feel for Sonic. It was fun, funny, and filled with plenty of little references for fans. My only criticism was they gave Sonic a little too much speed. He is basically the Flash (which is funny cuz there's a reference to the Flash), but it made for some entertaining scenes. If you're a fan of the games you def owe it to yourself to check it out.ps- I made a mc account just to review this"}, {"rating": "9", "text": "The movie was a great homage to the original Sega genesis games!  Lots of references to various memes about sonic.  Was definitely a smart idea for the studio to redesign him"}, {"rating": "9", "text": "i just watched the sonic movie. it was well worth the wait!  the great mixture of comedy action and emotional scenes made for an experience that i was totally not expecting. needless to say this is a great family movie and i thank jeff fowler for listening to us fans. loved the easter eggs and hints to some of the lore of the actual video game. some scenes were slow and a bit cringey but all in all the movie was a fantastic adaptation and i will be getting it on dvd and seeing the sequel!"}, {"rating": "8", "text": "Funny, has that nostalgic moments from the iconic game, is filled with laughs and just plain old fun."}, {"rating": "8", "text": "Good film to watch. Not the best film ever, but a good film to watch when nothing you have to do. Minus two point for two fart jokes."}, {"rating": "8", "text": "When you actually listen to fan's feedbacks, a good things happen. the movie was well made, especially sonic's visual remake"}, {"rating": "9", "text": "The best game-based movie of all time.Simply epic!Very funny and full of reference. Very faithful to the games."}, {"rating": "8", "text": "A lot better than expected and charmingly funny. Worth it for Carrey alone."}, {"rating": "9", "text": "A thrilling ride with Sonic and Eggman. Although the side characters try their hardest. Jim Carry easily... Carries the movie on his back. A bit slow at times but throwing you right back into the action. A fun filled adventure with jokes adults will enjoy, and lots of laughs for the rest of the group!"}, {"rating": "9", "text": "É um ótimo filme, principalmente se o assistirem como um filme infantil, não esperem uma história complexa digna de Oscar, agora se quiserem ver o filme pela proposta tenham um bom filme"}, {"rating": "9", "text": "Nice and funny movie . Not The greatest form of cinematographt  but you get what you pay for. Sonic. Enjoyable action comedy which respects the original material. If you are fan of sonic or videogames go for it. If not well this might not be for you ."}, {"rating": "10", "text": "This is the best game movie i ever seen,i need to see the second movie :)the animation is really good,and i apreciate the animation rework,and this probably will be my favorite movie watched"}, {"rating": "10", "text": "O filme é muito bom, para a proposta que ele foi feita, fico feliz da produtora ter feito o sonic da forma que a comunidade gostaria."}, {"rating": "10", "text": "It’s was amazing It’s was amazing It’s was amazing It’s was amazing It’s was amazing It’s was amazing"}, {"rating": "10", "text": "Super fun, super funny. My whole theater laughed so hard that at points I couldn't hear the movie. One of the most entertaining, crowd pleasers I have seen since Endgame."}, {"rating": "8", "text": "The paid critics must not have any kids to watch with them this for sure. This was a fun family sc-fi movie we enjoyed all together. From the big to the little people in the family. Bad guys vs good guys and no weirdo identity politics. That the usual paid critics love to clap to like seals. Refreshingly a non devise film that was just family friendly fun."}, {"rating": "9", "text": "Sonic the Hedgehog is one of my favorite movies of 2020. The visual effects were phenomenal especially Sonic and Dr. Robotnik's robots. I loved Sonic's design he was so cool and cute and a million times better than the original design. The acting from Jim Carrey and James Marsden was stupendous, Jim Carrey was better as Dr. Robotnik than I could have ever imagined. The writing was excellent, it was funny and touching. This was a great movie and one of my top 5 favorite video game adaption movies of all time."}, {"rating": "9", "text": "Great script, great acting from the cast. The movie seems to be over too quickly (and that's a good movie in my books). Kudos for listening to fans about how Sonic (should) look (I grew up with Sonic on a Sega console). I loved to see how Jim Carrey relishes his role. I gotta say, though, the final boss fight was a bit underwhelming. Overall, a great family fun movie!"}, {"rating": "9", "text": "Great Movie! Very funny! Take your kids, they Will Love this adventure!Ótimo filme para se levar os filhos, super divertido! Me surpreendeu demais!  Minha filha amou!  Realmente superou minhas expectativas!"}, {"rating": "7", "text": "I would give the movie a 9, but those 2 fortnite floss dances made me cringe hard."}, {"rating": "8", "text": "Awesome movie! is really fun, it was a great surprise, it can be enjoyed by gamers and also for people that haven´t played any sonic videogame, Finally they nailed it!, it´s a good videogame movie, hope the sequels keep the same way. Jim Carrey as Robotnik also excellent choice."}, {"rating": "9", "text": "This movie is more than amazing, it was very fun, and it also contains a lot of good jokes, funny clips and visual effects. It was great and a good sonic design. I enjoyed every moment in the movie."}, {"rating": "8", "text": "The movie (along Detective Pikachu) breaks the curse of \"bad movies based in videogames\".With good characters and funny scènes, Sonic arrives to be a nice journey to bee watched."}, {"rating": "9", "text": "Una película entretenida tanto para los fans cómo para nuevos conocedores, fiel a los videojuegos, divertida, y si bien una historia que no engancha por completo pero dejando un comienzo para una posible secuela que podría superarla."}], "recommendations": ["sonic_the_hedgehog_2", "the_spongebob_squarepants_movie", "jumanji_welcome_to_the_jungle", "free_guy", "the_green_hornet", "minions_the_rise_of_gru", "megamind", "the_lego_movie", "the_spongebob_movie_sponge_out_of_water", "over_the_hedge", "ghostbusters_afterlife", "the_angry_birds_movie", "deadpool_2", "wreck_it_ralph", "prince_of_persia_the_sands_of_time", "barnyard", "venom_let_there_be_carnage", "diary_of_a_wimpy_kid_dog_days", "peter_rabbit", "the_big_lebowski", "shazam", "despicable_me_2", "the_game_plan", "alvin_and_the_chipmunks", "entourage"]}