{"id": 75, "title": "Soul", "starring": ["Jamie Foxx", "Tina Fey"], "runtime": 101, "genre": ["Animation", "Family", "Comedy", "Fantasy", "Drama"], "description": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.", "releaseYear": "2020", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/hm58Jw4Lw8OIeECIq5qyPYhAeRJ.jpg", "categories": {"plot": 6.703703703703703, "acting": 8.61111111111111, "ending": 7.571428571428571, "soundtrack": 9.833333333333334, "cinematography": 9.0, "familyFriendly": 8.0, "funny": 9.5, "action": 9.0}, "reviews": [{"rating": "10", "text": "Amazing movie, I laughed , I cried, I got inspired. Make sure you have no distractions around you when you watch, turn the music up and let in to the story. WOW"}, {"rating": "10", "text": "This is probably the best Pixar film I’ve personally seen in a long time. Foxx’s performance was great and the jazz music is volumetric and nicely composed. The way Pixar addressed the narrative on the concept of one’s soul and the meaning of life was both beautiful and interesting. Soul is a funny and heartwarming film and I highly recommend it."}, {"rating": "7", "text": "*Closer to a 6.8/10.Visually perfect and thematically interesting but lacking that final polish. The notable lack of sound design gives the movie an awkward feel, understandable since it probably had to be done in quarantine but a problem none the less. There is also a lot I feel hurts the overall narrative of the film, most notably a scene early on that calls into question the ticking clock element of the story.A lot of fun none the less and I expect that I will get more out of it upon a rewatch."}, {"rating": "9", "text": "This is a really great Pixar movie. I just wanna start off with that. It has breathtaking visuals, amazing music, and a great cast. Richard Ayoade keeps on being one of the best actors no one seems to recognize. The visual ideas are really inventive and interesting, \"The zone\" being one of the most creative things I have seen in a film. The montage towards the end of the film made me cry, and is peak Pixar. Pretty much every scene spent in the spirit realm is really great. The scenes on earth is more of a problem. They have a bit of a whiplash effect, after the creativity on display in the spirit realm. Another problem is the weird, essentially tangential part where the protagonist is turned into a cat. I really appreciate that 22 got to be a human, but couldn't she just discover the wonders of the world as a cat? Anyway, I really liked this movie, despite its mistakes. It isn't very funny, which is a bit of a sad trend with modern Pixar, but it is still pretty great. It reminds me of the glory days of pixar, of Ratatouille and Wall-e and Up. I really hope this might usher in other films like that. And also that they stop making movies like Onward."}, {"rating": "9", "text": "The movie is basically inside out but a little bit more mature, with an even more interesting concept, better looking animation and some very relatable characters, Pixar is really back after this movie, and I can't wait to see what other ideas they have in the works."}, {"rating": "10", "text": "A film full of emotion and heart. Great to watch, easy to follow. A truly amazing film for all ages."}, {"rating": "8", "text": "Una película visualmente muy hermosas ,con música hermosa que demuestra de lo que es capaz Pixar con una historia envolvente y profunda que pone a pensar a uno acerca de una cosa...la vida"}, {"rating": "9", "text": "This film is so powerful! Even if it might be seen as a work that follows the path already took by inside out in 2015 it works very well. So hilarious during the first part but extremely deep in the final one.I might be exaggerated but i consider this as an hymn to life and research of good in everything (which is not a bad thing according to this strange period), such a strong message."}, {"rating": "2", "text": "I was really looking forward to this but I found the story lacking in both depth and logic. Visually lush, musically fantastic but it cannot hide a story that lacks originality, and a movie that tries way to hard to be charming."}, {"rating": "3", "text": "This was not a good film. At times the plot felt empty, boring and lazy. This would be a great film for maybe older people."}, {"rating": "7", "text": "Something lacks, but overall it's pretty fun.  Music is the best part, the animation amazing as always, but the story... well, it is great but could be better."}, {"rating": "6", "text": "This movie captivated me quickly, but then left me a bit confused at parts. Not because anything was too ambitious or deep, it was more how disjointed the story seemed to be between the living world and spirit world. I don't want to ruin anything but there are things that happen that flat out made zero sense and had my head scratching, especially in the last quarter of the movie. Also when the cat thing happened I was kinda like....I guess that has to be for the children because that route made way less sense to me than a fusion situation, where they were BOTH operating. It's one of those you have to just accept it's a fictional movie kind of deals.I really enjoyed most of the characters a lot. Terry was my biggest gripe character-wise. I get you aren't supposed to like him and he's arguably the only antagonist if there is one, but he was just a means to an end obviously. I just felt like there was a struggle to connect the two realms to further the story in the writers room. There was a lot of hurrying things along near the end.Overall a good movie that conveys a message about how our desire to seek purpose (and how those purposes can become obsessions) can take away from really \"living\" life. Just missed the mark a bit in the writers room."}, {"rating": "9", "text": "Didactical, strong and beautifully animated; Soul is one of the best movies Pixar has ever made."}, {"rating": "9", "text": "'Soul' is a dazzling movie. An adult will think about his life after watching it, and a kid will definitely feel attracted by the clever designs. The music, the animation, and the story are top-notch. The ending is a little too Disney, but, well, what matters is the spectacular trip Pixar has taken us this time."}, {"rating": "8", "text": "Pretty good movie and hits home for teachers, musicians, artists, etc. Also did a lot better job than I expected with incorporating death in a children's movie than others."}, {"rating": "5", "text": "This is difficult to rate. As an overall movie it's pretty good with deep meaning of life searching subject matter. Problem is it's pixar so if you sit the kids down expecting Frozen or the like they're going to be bored out of their minds. This is drama with a capital D so maybe watch it before you think younger kids will enjoy it. Mine didn't. Not from a lack of quality but simply because it's just not a kids movie.Given that I have to wonder why they would even put it in pixar's hands instead of just making it live action. The subject matter is majorly adult but the visuals are very kids movie. I didn't hate it but was very dissatisfied when I was looking for a family movie that made everyone happy."}, {"rating": "7", "text": "Really disappointed after such great reviews. There is a fantastic idea at the heart of this movie but it isn’t fully realised in a satisfactory way. Emotionally disjointed and seemingly confused by it’s own existential rules, it misses the opportunity to match the ghosts of Pixar’s past. If the present critics say it does, then I fear for what is yet to come."}, {"rating": "9", "text": "Disney and Pixar have struck gold with this animated feature about a struggling musician that finds the secret of life through a literal out-of-body experience. When I first saw the trailer for this movie, I wasn't blown away but after watching it I must say it is not at all what I expected but that is a good thing. Soul is a film that does a lot of things right. It's main character is interesting and gets a decent amount of character development that helps audiences connect with him. The animation is stunning, the supporting cast is superb and the story is deeper than I could have imagined. I love stories that have a purpose and leave its viewers with a lasting effect long after the credits roll and this film certainly accomplishes that. Soul might not be a kids film but it is one of the best animated films of the year by a long shot."}, {"rating": "9", "text": "Amazing movie. REALLY good visuals, very high quality, and music is amazing. Cast is great, too."}, {"rating": "8", "text": "Some people have told me: ''Pixar never disappoints''.And I don't know about them, but for me they have, but Pixar has also produced superb classics in animation.Fortunately Soul will fall into that category.Soul takes a similar approach to what the studio did on Inside Out, but let's say that here it takes you to the origin source.Everything is a metaphor of course, but the intuitive and captivating is what elevates this story.It could hardly be classified as a kid's film, because although they will be able to enjoy it of course, what makes this film special can only be appreciated by a more mature audience.A huge pity the film didn't get a theater release, because I would've loved to have seen it on the big screen, but that's water under the bridge, the film has been released worldwide now, and it's a wonderful adventure that I can recommend to everyone."}, {"rating": "9", "text": "This is a really good movie! The art design and  the animation style are very nice to look at and keep your eyes engaged. The storyline is very thought provoking and the writing is top notch. The voice acting is good all around and you can really feel the emotion the actors are trying to convey. All around great movie and I highly recommend watching it!"}, {"rating": "9", "text": "An amazing Pixar movie for these hard times. Thoroughly enjoyed the whole movie. Animation is fantastic and so beautifully shot. The message in this film is so amazing and inspiring one of Pixar's best in years. May be harder for kids to follow though. A great watch and one of the best movies of the year."}, {"rating": "8", "text": "Desde que se mostraron los trailers ya sabia que esta película me encantaría. Da un gran mensaje y nos hace replantearnos muchas cosas de la vida. Los personajes son muy carismáticos y la animación es de lo mejor que he visto, pero si hablo de las cosas que no me gustaron, siento que la película rompe con la seriedad que transmite en algunas situaciones de comedia como cuando Joe se convierte en el gato, se siente como la parte mas débil de la película. Una película animada que toca tantos temas complejos y serios necesita equilibrar mucho mas su comedia y que se note menos forzada. Y después esta el tema de que siento que no explotan el mundo de fantasía que propone. Se menciona el gran despues, el infierno y el gran antes, pero creo que le falto un poquito mas de desarrollo. En su lugar, la película trata de explorar mas la vida de Joe.En mi opinión, no es una de las mejores películas animadas que he visto de todos los tiempos, pero definitivamente es una de las mejores que he visto en los últimos años. Muy recomendada, aunque los niños puede ser que no la entiendan del todo, siendo mas enfocada a los adultos por su complejidad."}, {"rating": "10", "text": "Exciting from start to finish. Graphically perfect, Pixar's \"Soul\" innovates and takes audiences into a captivating and well-crafted story. It is worth mentioning the sound editing and soundtrack.  In my perception, the film comes strongly to the dispute for \"Best film\" at the Oscar 2021."}, {"rating": "10", "text": "Que bela surpresa! Se existe um filme capaz de quebrar o estigma de que animações são apenas para crianças, esse é certamente a melhor opção. Ele vai literalmente tocar a sua alma."}, {"rating": "10", "text": "For me, Soul is the best movie of 2020. I didn’t expect to love this film so much but here I am. Very touching story, great characters and magnificent animation production.A MUST SEEN MOVIE FOR EVERYONE."}, {"rating": "10", "text": "One of my favorite movies of all time. A masterpiece in every sense of the word."}, {"rating": "10", "text": "Initial Thoughts:“Soul” is one of the must see films of the year. Why? Because it has a well thought out plot that is thought provoking, and at moments in time, emotionally heartening. This film is all it claims to be and more by not just skimming the surface of what most of us think in our day-to-day lives. It reaches much further into our souls. It had me thinking who I would like to be and what I could be. Although I didn’t find the answer in 2-hours it had me wondering, what is THE spark that makes me, me?Visually, this film is spectacular. At times I would forget that it was an animated film, but this aspect had me more invested into the incredible story. I think each individual who watches this film will have a different take and level of emotional response. Speaking for myself. At the end of the day I didn’t feel the emotional heartstrings being tugged at, but I honestly felt like my soul had been moved to want more and to be better.The last takeaway to this film is head up. Take each day for what it is and live it to your fullest because you may never get the opportunity for a do over or second chance. Be kind to yourself and those around you, as it may trodden them in such a way that they lose hope or faith in who they are and who they are meant to be.Overall:Honestly, this is a must see film before the year is up. It’s visually stunning, thought provoking, and emotionally driven. Admittedly, I did have my doubts and thought this film would fall short of my expectations, which was 10/10, but instead it met them, which was a 10/10.Enjoy the show!"}, {"rating": "10", "text": "A very heart warming movie, which constantly reminds you of that life is a blessing, even when it doesn't go as we planned. Remember how 'Indide Out' talked about your feelings' feelings? This one talks about your soul's feelings. Soul movie review out"}, {"rating": "10", "text": "Most children’s films have underlying messages or themes that teach important lessons to them without them knowing it, yet no movie has as important a message as Soul’s. This films message is simple, but complicated: live life to the fullest. Jamie Fox’s character goes through an emotional journey to not be told, but shown his purpose, all the while he unknowingly shows another theirs. If you have not seen this film, but have Disney+, it is a must-watch, and will be remembered alongside Pixar’s greatest.Alongside the the story, the animation is top-notch, which is as to be expected from Pixar, and the performances from the cast are all sublime.Soul once again raises the bar for what Pixar can do through animation and I highly anticipate their next project."}, {"rating": "10", "text": "I would place SOUL among the first rank of Pixar animations, which means among the first rank of animations ever made. Of course, it's visually amazing, but its storytelling couldn't aim any higher. It's about New York, the Black American experience, jazz, teaching -- and the meaning of existence. And unlike practically any other movie about jazz, the music is first-rate. (John Baptiste, Questlove, and Herbie Hancock were among the performers and consultants.) My only question is — what will young children get out of this? It's hugely entertaining, but like the director's INSIDE OUT, it tackles knotty philosophical questions and will inspire a mountain of scholarly papers."}, {"rating": "3", "text": "Visually compelling scenes on Earth interspersed with graphic **** of both the visual and philosophical kinds - when exploring the befores and afters of life on Earth. The movie introduces a lot of threads and leaves many of them untied at the end and many that are tied are tied off in a “wrong” and unsatisfying way. And what about Lisa? She is Chekov’s gun."}, {"rating": "1", "text": "Terrible.  Dragged.  Boring.  Hard to follow.  8 year old, 15 year old and 2 adults couldn't get through it.  Great cast, bad movie."}, {"rating": "4", "text": "It is the movie \"Heaven Can Wait\" (1943 and 1978). Not sure why the people scenes are animated. The \"uncanny valley\" problem is huge, it pulls you out of the movie, over and over again. It really is a live-action & animated movie. It isn't \"The Incredibles\" where the character's powers and stylization make sense. They tried to make it for all audiences and in the end, it isn't made for anyone. It is not for little kids because the theme is adult philosophical ideas and it is not for adults because the pacing and visuals are for kids. If you like \"Inside Out\" this will work for you, if you were just OK with \"Inside Out\" then make sure you have your fast forward button handy."}, {"rating": "3", "text": "Tried watching this with my kids. They were not hooked at any point. The character and themes are not targeted at kids at all. I guess Pixar learnt that most of it's audience were adults anyway, so they forget what made them movies special for youngsters. Sure, the plot is interesting and very well acted and animated. Just make sure you watch it with the right audience, kids will be bored."}, {"rating": "10", "text": "One of the best movie I have ever seen in years.After watching this movie it motivates and hypes up me to work on the thing I loved and care about. I have never felt like that after watching a movie. One of the best movie to watch this holiday season."}, {"rating": "9", "text": "Sad but also very wholesome at the same time. Wouldn’t rank it among my favorite but still a excellent Christmas movie way better than that other movie I watched today about some girl superhero. This was much better movie to enjoy this holiday!"}, {"rating": "10", "text": "Wow! A beautiful and thoughtful story that takes you on a ride and challenge you to think about the message. Feels like the first Pixar film made for adults, one of the best movies this year."}, {"rating": "10", "text": "Soul is yet another Pixar masterpiece. Easily the best animated movie since Coco, and the definitive animated movie of 2020."}, {"rating": "9", "text": "A moving, charming, and delightful palate cleanser, Soul not only manages to be Pixar’s coolest looking film (and a fantastically New York film for that matter) but it also delivers a heartwarming message about the simple beauty of living - and what a pure gift life is. Touching on subjects such as passion and mental health, the film’s heavy themes are balanced with Pixar’s signature sharp-witted humor, a soft and gorgeous soundtrack, and a pleasing color scheme during the astral sequences. It’s an absolute triumph - it will bring tears to your eyes and a sense of profound gratitude."}, {"rating": "7", "text": "Lots of beautiful moments but I feel that the set up required to lay the ground work so that we could reach the Pixar epiphanies was over complex and unnecessary. The “Miro” world was the least interesting dimension,  It felt better in the honest human character moments. As ever though an exquisitely crafted movie with a good heart."}, {"rating": "10", "text": "Full of emotion, humor, power, and (well) soul, Disney/Pixar's \"Soul\" is easily the best film of 2020. As one of the most visually-captivating animated films combined with an even more provoking narrative, Soul presents itself with hardly anything to dislike about it. From start to end, you'll laugh, you'll cry, and you'll want to watch it again and again, all while watching gorgeous, jaw-dropping visuals. Released at a time where social equity matters more than ever in the world, this is certainly the movie to watch this holiday season and one whose legacy will live on for years to come."}, {"rating": "10", "text": "Easily the best Pixar movie in over a decade, I might even call it a masterpiece. Seriously loved it so much"}, {"rating": "10", "text": "Pixar do it again, taking a really deep topic, handling it with care and intelligence, and making a superb film that appeals to both kids and adults."}, {"rating": "10", "text": "i did jot expect it to be what it is/ was. Absolutely enjoyed it....graphics, music and storry telling. Great script. I feel its more of an adult cartoon but kids will love the visuals and graphics. I was impressed, very cool concept."}, {"rating": "10", "text": "What a great reflection of the human psyche. Your passions in life can carry you so far into a sense of purpose and this movie brilliantly gives a fun take on that mindset. Beautiful animation and incredible voice acting. This is the Pixar that I want to support, no more dumb sequels."}, {"rating": "10", "text": "As a 36 year old man who lost both parents in the past ten years, this movie spoke to me on somany levels it’s impossible to articulate here. Life is short. Obsessive behaviour is not the way to be. Life is actually bigger than music and at our core we know this to be true. 10/10 this is next level film making and very beautiful and true to life."}, {"rating": "10", "text": "I almost didn't see this movie, but wow...it really profoundly touched my heart and moved me to tears. I was not expecting to love it this much. This is definitely one of the most thoughtful animated movies in recent memory!"}, {"rating": "1", "text": "Dud. Not a children’s movie. Animation was poor and story was off. Pixar needs to a shake up and clear why went straight to Disney+."}, {"rating": "10", "text": "Soul delivered kindness, soul, everything about life... while its goal is clear, the movie wants to say that you've got a soul and it's alright"}], "recommendations": ["up", "your_name", "onward", "the_book_of_life", "zootopia", "klaus", "the_polar_express", "paprika", "how_to_train_your_dragon_2", "luca", "kubo_and_the_two_strings", "spirit_stallion_of_the_cimarron", "the_incredibles", "life_of_pi", "the_bfg", "where_the_wild_things_are", "the_little_prince", "the_good_dinosaur", "cloud_atlas", "ratatouille", "paranorman", "finding_dory", "hugo", "the_fountain", "tomorrowland"]}